[{"1": "Do našich měst přichází 21. kapitola nazvaná Valloriánská legenda. Od 7. srpna budete moci vyrazit na toto úžasné dobrodružství! Všechny vaše postřehy pište sem. [smilie--sprite1]"}, {"2": "Konec eventu, mezera na DS a do toho rasa?[BR]No, neexistuje slabší okamžik pro produkci uriny.[BR]Náhoda?"}, {"3": "není kam spěchat [smilie--sprite1]"}, {"5": "Již se připravujeme a těšíme [smilie--sprite1]"}, {"6": "No jo, tak si holt budeme s plným nasazením zase chvilku hrát."}, {"16": "@GorGlin Neříkej, že sis během pauzy nenašetřil:[BR][IMG]https://i.ibb.co/TwJ5XMg/https-cz-forum-elvenar-com-index-php-attachments-1690992793333-png-7012.png[/IMG]"}, {"5": "Unurium putovalo pravidelně do kotlíku, tak jako mana i semeno....do týdne bude pár mega stačit na začátek"}, {"2": "Já se snažím být připraven, takže mám zásoby úplně všeho.[BR]Uvidíme jak se Inno rozhodlo vyzkoušet naší připravenost tentokrát."}, {"3": "Já urinu nemám jak syslit bo se rozpadá, takže ji vrazim do T7-9, kde vydrží víc. Pokud bude třeba surová,  poresim operativne"}, {"16": "Valoriánská věž 30+ 2% rozpad udělá hodně (stejně jako všechny ostatní rozpady snížené na 2%)."}, {"3": "to je pravda, ale stejně jako bludiště nebo ta divná zelená věž, tak ani tohle nestavím. Radši snížím rozpad finálního výrobku, než meziproduktu... [smilie--sprite1]"}, {"6": "Divy jsou fajn. Je jich ale moc. A vylepšování holt chvíli trvá."}, {"5": "u Valor. věže je i positivum, že zárověn´obytky generují á 3h unurium...se slušnou kulturou je to nezanedbatelné množství..."}, {"3": "jenže ono v podstatě není k ničemu potřeba. Jasně, pro průchod kapitolou. Ale pro běžnou hru urinu nepotřebuješ, protože T7-9 je zatím na nic (mezi náma, ani T4-6) není skoro k ničemu potřeba.[BR]Tak proč si ztěžovat turnaje divem, který nic nedává (stejně, jako pravděpodobně další dva nové)"}, {"5": "V totmto máš pravdu, uvidíme kam cesta Inna směřuje, protože po devalvaci Křišt´álového majáku je tu možná další devalvace jiných divů včetně Valor. věže....tím by se hodila možnost Teleportovat i divy! a některé aktuálně nepotřebné uklidit /zde by někteří uklízeli asi na každý turnaj [smilie--sprite1] - což lze např. ošetřit nějakým týdenním odkladem znovu navrácení divu do města apod./ ....[BR]...a protože nevíme, kam se vše bude ubírat není zase úplně dobré nějaký div /tím spíše na lv 30+/ jen tak smazat ...a navíc se na průchod další kap. bude sakra hodit...[BR]PS: trochu mám i obavy, že i vývojáři nemají brýle k prozřetelné budoucnosti i vzhledem k tomu, že se s vývojem dokáží vrátit k využití ,,opomíjeného divu,, viz XX kap a Uskladnovací vír /zde možná i trochu nechtěně/, který většina pak vehementně stavěla a vylepšovala např..."}, {"3": "no já i přemýšlím, co s čmelákem, pokud nová kapitola nebude přes portálový bonus... těch pár směn u obchodníka vs. drahý turnaj..."}, {"5": "Tu směnu nepodcenuj dá se na ní pěkně traidovat...na čmeláka nesahat doporučuji [smilie--sprite1]"}, {"8": "a tech par smen ale plne pokryva vyrobu standardniho zbozi (ok ktereho ma vetsina dostatecne zasoby [smilie--sprite8] )[BR]2x(400k/270k/178k) / den jen tak za \"nic\"a nekdy i 2x [smilie--sprite1]"}, {"16": "Ono, pokud jsem to pochopil správně, tak čmelák stále zvedá produkci portálu, jen je jeho vliv stejný na portálu lv1 stejně jako na lv4.[BR]Tzn. když dostanete bonus +46% k portálu lv1, tak budete mít stejných +46% i k portálu lv4, jen ten druhý bonus půjde tím novým způsobem.[BR]Ale to by musel potvrdit/vyvrátit někdo z bety, kdo tu kapitolu už hraje."}, {"3": "tak to potom je jiná, pokud by to bylo takhle. Stejně bych ho neboural ani tak, jen ztrácí na kouzle"}]