[{"4": "@GorGlin - asi ano oprášíme pětileté plány, holt mi došla ta fialová kouzla, tak jsem musel použít i sílu zásob"}, {"6": "Fialová kouzla - nějak mi hned nedošlo, o co jde. Asi mám z tohoto způsobu léta poněkud vypálený mozek. Těch mám ještě 1438 a 1947 modrozelených. To mi asi do konce jen tak nedojde.[BR]A když dojde, tak z toho taky jeden nepojde..."}, {"8": "tak dokonceno [smilie--sprite1] aspon ze jsem stihnul udelat zarez do ukonceni fora [smilie--sprite2] pristi kapitola uz bude jen jedno velke prekvapeni [smilie--sprite8]"}, {"11": "fialových kouzel mi po skončení kapitoly zůstalo přes 4k a k tomu tisíce dalších. Vývojáři by měli přitvrdit. [smilie--sprite1]"}, {"16": "Já ještě 5 výzkumů, jeden z nich dokončím zítra, ty zbývající tak do dvou týdnů (+-)."}, {"6": "Došly zásoby many a při její výrobě kolem 3M denně budu kapitolu plácat až do poloviny října.[BR]Bezhlavě cpát někam kouzla se mi nechce, páč mi to leze na nervy.[BR]Nejhloupější je, že se svych 9+9 dílen jen tak nezbavím, protože na tom závisí zvýšení výroby v dračí věži.[BR]S tou přílišnou potřebou many se kapitola ve svém závěru stává nepříjemnou a nudnou."}, {"11": "tak ono to okouzlení není tak bezhlavý. Budeš mít několik dní nebo týdnů zvýšenou produkci dílen nebo manufaktur nebo vyšší kulturu. Záleží jestli máš kouzel přebytek. Ale je fakt, že do půlky října není zas tak daleko."}, {"2": "@voyager-1 [BR]obávám se, že nejde o dny a týdny, ale měsíce a roky.[BR][BR]@Schoenfeld [BR]Pokud si chceš procházet výzkum posvém, musíš být připravený.[BR]Pokud budeš procházet výzkum pěkně po sloupcích, spotřeba many se rozloží.[BR][BR]zrovna nedávno u nás někdo řešil manu[BR]tady jsem mnohokrát četl že stačí postavit dračí opatství"}, {"11": "jj, není problém okouzlit manufakturu nebo kulturku na rok, ale je to na škodu, pokud je kouzel dost?"}, {"8": "pokud jsi na konci vyzkumu a mas \"pulrocni pauzy\" mezi kapitolama tak staci. jen je treba byt aktivni v turnaji a hromadit svitky. a ve finale nemit zabrany je vypalit. proste svitky jsou mana potiony. a ve skladu ti k uzitku nejsou  [smilie--sprite1] 3m many je +/- 100 svitku . [BR]a za nadbytecna kladivka si dokoupis zakladni suroviny (kdyz mas cmelaka cca 440k/290k/196k - pokud i za penize tak jeste x2) [BR]Ale na nedostatek many si budes stezovat vzdy [smilie--sprite8] hlavne kdyz ti tve \"manapotiony\" zacnou dochazet."}, {"2": "když jsem zjistil, že Vallorianská škola zkracuje produkci kouzel, tak mě to docela překvapilo[BR]nevím že by si někdo stěžoval na nedostatek kouzel[BR]ale možná je to rafinovaný způsob jak zařídit přebytek"}, {"6": "@GorGlin V tuto chvíli je propočítaná potřeba dní mezi 24-29 v závislosti na četnosti použití kouzel a trochu i na naplánovaném zisku dalších měsíčních továren či tajemných jezer v příští události. Rozhodně to \"nesmrdí\" dalšími měsíci a roky.[BR]Fakt je ale to, že kdo naběhne na tuto kapitolu rovnou z dvacítky bez polštáře nahamouněné many, tak se tu prostě bude blemcat o něco déle. Do 3-4 měsíců by to mohl v neuspěchaném rytmu v pohodě zvládnout každý hráč."}, {"4": "@Schoenfeld - no já jsem naběhl v podstatě rovnou z 20. kapitoly se zásobou many 10 mega a už jsem více než týden hotov. Jen to chtělo vyplácat pár tisíc kouzel, která se snadno do začátku další kapitoly doplní. Já je vůbec během normální hry nepoužívám - pouze na plnění úkolů a na výrobu many v opatství."}, {"5": "...jen opakovaně připomenu, že když jde budova teleportem do skladu, tak o kouzla přichází a to samé při změně velikosti tj některé budovy mohou vydržet roky : viz čistě kulturní budovy nebo některé hybridy pop-kultura....naopak dílny a manuf. pokud mění svou velikost, jde o typ jiné budovy tak okouzlení dosud myslím taky mizelo....tím se vyplatí okouzlit max do příští rasy - poslední trend přichodu ras je cca rok[BR]/pozn. v některých rasách nedošlo ke změně velikosti dílen nebo manufaktur/[BR]...časové zkrácení výroby kouzel v akademii s novým divem Škola vítám - i vzhledem k tomu, že aktivně hrajeme DS"}, {"9": "@ElfNostradamus tak zrovna dnes jsem vylepsovala manufakturu co menila tvar a okouzleni nezmizelo tak nevim nevim ...[BR]kazdopadne teleportem zmiznou vsechna okouzleni"}, {"5": "Elvinka: Tak to je dobře...že to upravili [smilie--sprite1]"}, {"16": "Ti z nás, kteří mají dostatek kouzel, mohou využít služeb Opatství, ostatním to bude nějakou dobu trvat než vygenerují tolik many přes kulturní hybridy, evo budovy apod.[BR]Ideální je mít Opatství na max. a tisíce kouzel v inventáři, pak manu nemusíte vůbec řešit - prostě si ji naklikáte.[BR]A to jestli se okouzlení některými operacemi ztrácí mi může být jedno, jestliže i po dokončení kapitoly budu mít stále tisíce kouzel a další tisíce získám před začátkem kapitoly další."}, {"9": "tak stradani many neni spatne a kdyz to nestaci vytahnou se kouzla kdyz se specha, hlavne kdyz jsou moznosti"}, {"6": "Pro mne to prostě není dost sportovní výzva - klikat, klikat a klikat.[BR]Raději zapojím kalkul a uzpůsobuju Kutilskou dílnu v Dělnochatrči tak, abych všechna vybírání many, měl obdarováno 20% navíc. Ze 2M je to 0,4 M navíc. A to už se počítá.[BR]Jinak mi to natažení vážně nevadí, neboť jsem to byl zrovná já, co skučel v kapitolním mezidobí, že není co činit.[BR]Prostě si hraju. A užívám si to."}, {"9": "jo az dojde na manovou nouzi jsem pripravena vyzkouset i stavitele zatim me nezaujal[BR]...[BR]jinak dotaz delate portal na 4 ikdyz mate vir na urcite urovni?"}]