[{"6": "Hraj si dělnochatrčí hned - oddaluješ tím manovou nouzi.[BR]Dotazu nerozumím, páč kapitola nemá portál ale Dračí věž."}, {"9": "jeste nejaky cas me od teto kapitoly deli takze zatim manu nemusim honit, ale myslim ze draci vez je ve skutecnosti portal ikdyz se tak nejmenuje"}, {"6": "Aha, tak to neuspěchej, jako já, a vychutnávej si do sytosti zbývající kapitoly."}, {"9": "mam jeste 9 vyzkumu v hudbe a jdu na to ja uz se chci taky flakat na konci"}, {"20": "@Elvinka12 Portál je v 21. kapitole potřeba zvýšit na 4 lv., chová se totiž jinak než v minulých kapitolách, protože výrobu zvyšuje Prosperita, kterou ovlivňuje jak lv. portálu, tak také množství a lv. osadnických budov."}, {"9": "@Ludi diky to jsem chtela vedet ne ze bych planovala vir ale kdyz uz se me nekdo zepta, tak chci vedet jak to je - nakonec za chvilku me to taky ceka"}, {"2": "Je to další spotřeba prosperity, takže bonus na veškerou výrobu.[BR]Já portál postavil celý i s virem."}, {"8": "zkousim si ty nove divy v \"realu\" a skoda ze to Starozitnictvi dava suroviny ktere si sam vyrabim (tj ty co potrebuju nejmene). na seminka to bude uzitecne, ale suroviny mohly byt posunute +/-1"}, {"2": "Já u starožitnictví vidím smysl ve zvýšení výroby.[BR]Pořád budeme platit tu partičku nemakačenků co nepochopili k čemu je vůz.[BR]Možná by stálo za to zavést povinnou školní docházku.[BR]Společnost v elveanru je dost zaostalá.[BR]Ale když se v příští kapitole budeme pohybovat milionech místo statisíců, tak je to zajímavá alternativa namísto přistavování dalších manufaktur."}, {"8": "no.. zvyseni vyroby.. celoutuhle kapitolu jsem prosel se 2 tovarnama na pomazanku a jednou na aerosoly. a jeste nejaky ten milion na skaldu zustal Takze vyroba zatim vubec netrapi [smilie--sprite3] ale vypada to, ze ten random pokryje rozpad, takze ve finale muze byt 1m+ zbozi lezet skaldem i bez vyroby.[BR]A tim navysenim vubec nestras. uz nevim jakyma trubkama bych to obchodoval,kdyz zbozi stejne urovne se takrka nemenilo."}, {"2": "Já vyrabel T7-9 a měnil jen na stejné úrovni.[BR]Směna byla velmi rychlá."}, {"6": "Teda, když to hrajete v klidu, to je teda prča."}, {"16": "Ona je to větší \"sranda\" když u slabších měst nestihá výroba / výměna osvíceného a živoucího (ať už z důvodu nestíhající výroby semen/unuria a/nebo pomalejší výměny(zejména při špatných bonusech, kdy se bez urychlovačů často čeká až na návrat kupce za 6h)).[BR][BR]Takové neomalené oběti (zejména na konci) jsou taky hrozně srandovní pro ty, kterým nestíhá mana (a nemají tisíce kouzel na propálení přes Opatství)[BR][BR]To pak je úplně jiná rychlost než když vás nejvíce zdržuje samotná rychlost výroby osadnických budov a portálu."}, {"9": "zase me tu chce nekdo desit kapitolou ... to neni vubec pekne a ikdyz si myslim ze mam asi nejhorsi surovinu co jsem mohla mit i tak neurychluju kupce a hraju jen se 3, hudba se dala i v tech nejhorsich chvilich kdy jsem stavela cely orchestr, tak doufam ze zvladnu i tohle, mam na to tak 3/4 roku"}, {"2": "Žádné děsení, ale je fakt, že Inno rádo využije každé chyby."}, {"9": "nevim nic zasadniho by to nemelo byt a kazdy sam si stavi mesto dle sveho tak se s tim i musi poprat a neni dulezity jestli bude delat kapitolu mesic 2 nebo 4, ja doufam ze bych to do konce roku mohla dat ale kdo vi treba se zaseknu na mane a nebo necem jinem"}, {"6": "Mana - to je ta brzda pokroku. Když máš ostatního nasysleno, je to jenom o výrobních propočtech. Semena i unurium se dají průběžně zvládat v souvislosti s přiměřeným použitím urychlovačů many (kouzla a kutilská dílna). No a to ostatní by mělo být pro borce po 20. kole už přeci jenom v pohodě.[BR]Budu to mít po příští Události. (Směřuji to na ni z čistě soukromé herní líbivosti.)"}, {"34": "Ahoj rychlíci, co jste poslední kapitolou už víceméně prolétli. Mám na vás praktický dotaz - vím, že ke splnění úkolů v etapě je potřeba mít 9+9 dílen osadníků. Ještě jsem si na tento počet neudělal místo, zatím jedu s počtem 4+5 upgradnutých. Protože spotřeby živoucího i osvíceného zboží na výroby osadníků jsou dost velké, tak zjištuji info, kolik různých manufaktur jste na to potřebovali trvale provozovat (okouzlené či neokouzlené Magickou výrobou), abyste stihli výrobu v těch celkem 18 osadnických budovách (full upgradnutých na 4. level) vůbec uzásobovat? Sběr výroby v manufakturách počítám 1x 9 hod. + 3x 3hod (někdy i 4x) . A nebylo pak pro vás nakonec úzké hrdlo samotná výměna osvíceného zboží přes Kupce?"}, {"20": "Já mám od každého druhu zboží na živoucí i osvícené po jedné manufaktuře, ale také mám již slušnou podporu divů (snížený rozpad a posílená výroba atd.). U kupců měním stejný druh zboží, tam jde výměna rychleji. Když se zadá nerovná výměna, tak to tam zůstane na dlouho, takže takovou výměnu max na noc.[BR]Osadníky jsem měla 9+11, bylo tak akorát, aby výroba obětí v portálu byla slušná."}, {"2": "Já měl 17 orcich a 12 Vall dílen a zvlad jsem to s jednou manufakturu od každého typu.[BR]Ale měl jsem zásoby.[BR]T7 jsem měl 4M a konec rasy vyráběl pod kouzly.[BR]Vymena mě nezdržovala, ale měl jsem čas a často je točil."}]