[{"16": "U osvíceného bývá větším problémem výměna nebo nedostatek unuria než samotná výroba.[BR]Zatím jedna okouzlená manu stačila (u mne uživila 9+13 osadnických budov).[BR]U živoucího mám na cz1 milionové zásoby průběžně vyráběné i měněné i přes pauzu mezi kapitolami, takže není problém (navíc je o dost pohodlnější prostě jednou týdně zadat pár nabídek po několika stech tisících najednou (a během minuty tak zadat výměnu třeba 2 milionů živoucího) než jak pako klikat po 11000 přes kupce(toho kdo to vymyslel by měli za trest donutit klikat kupce celý den))."}, {"8": "osvicene 2 nejvyssiho stupne. a 1 druheho. Smena pres kupce s mou naidkou a cosvyma moznostma prakticky nemela vyznam. takze jsem 3x denne menil na 6h. + sem tam se naselnekdo kdo ty pomazanky chtel [smilie--sprite8] a ty jsem rovnou smenil na trhu.[BR]Zivouci 2. 90% vyroby mi pokryvaji bonusove budovy (knihovny a sety/...) a pripadna smna na trhuvygenerovanych prebytku.[BR]Bylo treba mit manu, takze vse co produkovalo bylo ocarovane a jeste par mesicu ocarovane bude [smilie--sprite1][BR]Budovy nejakj v 9+11 nebo 9+12. korist sla v podstate kompletne z PB svitku. ale do kapitoly jsem vstupoval s minimalne 1+M polstarem surovin vsech osvicenych i zivoucich."}, {"6": "Tak s kapitolou přesně podle plánu končím po Události. Hraji ji 1 den, takže ve středu. Už několik dní nic nevyrábím, jenom naháním manu a sbírám knížky. Tedy ne, že bych se zrovna honil...[BR]Ten závěr není moc domyšlený, když několik dní koukám na nepracující dílny. Mohl bych je vyhodit, ale čekám na konec. Není kam spěchat.[BR]Zároveň přemýšlím nad ukončením nebo usnutím hry, páč ten smutný a nikoli nutný (jak se nám snaží někdo podsouvat) přechod na bezpečnostně dikutabilní diskord mi bere možnost svobodného a bezpečného vyjadřování se ke hře v dostatečně širokém fóru.[BR]Nemluvě o tom, že před chvílí zavřeli mnou 30. září otevřené diskusní vlákno \"Jak umírá fórum\", aniž by tato diskuse nebo nebo diskutující porušili pravidla sdělování. Navíc by asi bylo slušné se mne v tomto případě alespoň zeptat, zda proti tomu nic nemám, když jsem ho už tedy jaksi založil.[BR]No ještě k tomu formulace důvodu: \"Jelikož vše důležité o tomto tématu již bylo řečeno, diskuzi si dovolujeme uzamknout.\"[BR]Z titulu koho a čeho, pokud se neporuší diskusní pravidla, může toto někdo tvrdit a takto konat?[BR]Přestávám se tu a tedy i ve hře cítit komfortně, což byla největší deviza hry, když jsem se pro ni před pár lety rozhodl."}, {"15": "Dotaz : taky se vám  někdy stalo, že  splníte zadaný úkol a on se vám nenačte ? Mně už dneska dvakrát . Zajímalo by mně , kde udělali [BR]zadavatelé chybu ? [BR][smilie--sprite6]"}, {"9": "sama jsem taky zvedava jak ten zaprah zvladnu i tak nejvetsim problemem v obchodovani je to ze kdyz delas pomazanku a potrebujes granule tak ten co vyrabi granule potrebuje zase kulicky, ja se tomuto problemu snazim vyhybat ze pomazanku nabizim jen za kulicky a pak smenim kulicky za granule coz jde kolikrat krasne smenit[BR]za granule je temer neobchodovatelna a 6h prilis dlouhych takze 2x tocim a jde to ikdyz pomazanka je snad nejmene zadane zbozi"}, {"17": "Schoenfeld napsal/a:\t\t\tZároveň přemýšlím nad ukončením nebo usnutím hry, páč ten smutný a nikoli nutný (jak se nám snaží někdo podsouvat) přechod na bezpečnostně dikutabilní diskord mi bere možnost svobodného a bezpečného vyjadřování se ke hře v dostatečně širokém fóru.\t\tKlikněte zde pro zvětšení...Jelikož někteří hráči zde opakovaně řeší Discord, ačkoliv toho se toto téma vůbec netýká (je věnované nové spřátelené rase Vallorianská legenda), čímž toto téma činí pro ostatní hráče zcela nepřehledným a chaotickým, dovolujeme si toto téma uzamknout. Pakliže by dotyční hráči nenarušovali stávající diskuze tímto off-topicem a věnovali se tomu, čemu je toto téma určené, nebyli bychom nuceni do diskuzí zasahovat a uzavírat.[BR][BR]Pokud chcete diskutovat o nové spřátelené rase, můžete tak prosím učinit na našem Discordu, kde máme speciální kanál, v němž najdete i diskuzi věnovanou této nové spřátelené rase. Ostatně spousta z vás tam už o této nové rase diskutuje. Těšíme se na vás! [smilie--sprite1][BR][BR]https://discord.gg/elvenar-1136205917306753035"}]