[{"2": "Podle obrázku to tak vypadá[BR][BR]\t\t\thttps://beta.forum.elvenar.com/index.php?attachments/1690306718618-png.11611/\t\t"}, {"11": "ElfNostradamus napsal/a:\t\t\tby se hodila možnost Teleportovat i divy!\t\tKlikněte zde pro zvětšení...jo, to by byla paráda, už se to tu i rozebíralo, myslím i ze strany podpory ale nějak to umlklo. Ale důležitý, pokud by ta možnost byla, by taky bylo jestli po teleportaci divu zůstane stejný součet divů nebo jestli by se teleportovaný div odečetl."}, {"20": "Teleportaci divů jsem navrhovala zde:[BR]\t\t\thttps://cz.forum.elvenar.com/index.php?threads/teleportace-div%C5%AF.7749/\t\t[BR]Asi to není zatím možné. Ale hra má svůj vývoj, co bývalo nemožné, je nyní skutečností [smilie--sprite2].[BR][BR]Na novou kapitolu se těším, plán na přerovnání města už mám. Mohlo by to být celkem zajímavé. Nové divy mě zatím nezaujaly, ale možná časem změním názor. Podle dostupných obrázků bude grafika zase moc pěkná, takže vzhůru k drakům."}, {"11": "jj, už dávno tomu [smilie--sprite1] Ale v Tvém vláknu se podpora nevyjadřuje pokud jsem ji nepřehlédl, ale někde jinde myslím psala něco jako, pokud by si to hráči přáli tak proč ne."}, {"6": "To je všechno hezké. Ale ví už z vás někdo, jaký prostor a kdy ho budeme potřebovat? Kde se rýsují úzká hrdla? A kde to vyloženě bude nasírací?"}, {"11": "já to dopředu neřeším. Času dost."}, {"3": "Ad teleportace: mám pocit, že v nějakém videu přímo lidi z INNA říkali, že to zatim není možné. Ale bude to už nějaký pátek..."}, {"2": "Často jsme si sami zdrojem obtíží.[BR]Pamatujete si na konstrukty?[BR]Tam rasa krásné klapala každému, kdo postavil všechny budovy, seskládali je aby dosáhl maximálního bonusu a svědomitě co tři hodiny klikal.[BR]Některá výroba byla na tři hodiny, jiná na šest co vyrobil jeden barák použil jiný.[BR]Pokud to teď udělali podobně, ale s výrobou 2h, 4h a 6h.[BR]Základni městská produkce je 3h.[BR]Tak můžeme zjistit, že kdo nebude na hře každou hodinu, bude si rasu prodlužovat.[BR]A nebo kdo si neudělal zásoby, nebo nevyužívá kulturní bonus, nepostavil div který se může ukázat jako důležitý, nebo naopak postavil.[BR]Zlatá propast je skvělí zdroj lidí i peněz, ale jen lidi nepřizpůsobivích a sociálních co pro komunitu nehnou prstem.[BR]Největší jistota je asi dělat všechno a mít koupena všechna rozšíření."}, {"20": "@GorGlin koupit všechna rozšíření je pro dost lidí celkem nedosažitelný cíl. Na mě už jsou nová rozšíření velmi drahá, takže v tomto směru se už moc nerozšoupnu. Ale myslím si, že to není hlavní podmínka dobré hry. 9 výrobních budov od každé tam nacpu, takže úkoly nějak splním, ostatní se poddá. Další kapitola začne určitě až za rok, takže to bude v klídku. Proč se honit, když to má být zábava. Jako vždy pojedu středním tempem."}, {"5": "GG je nově finanční agitátor INNA, kdo nekoupí rozšíření A.pojede pomaleji za B. přijde do pekla [smilie--sprite1][BR]....berte to prosím jako nadsázku včetně mého spoluhráče DžíDžího [smilie--sprite1]"}, {"5": "Příklady rozmístění nových budov: 23x31 polí[BR][IMG]https://i.ibb.co/mcwy3m2/https-cz-forum-elvenar-com-index-php-attachments-1691130417788-png-7013.png[/IMG][BR]21x33 polí[BR][IMG]https://i.ibb.co/ydd38KM/https-cz-forum-elvenar-com-index-php-attachments-1691130450959-png-7014.png[/IMG][BR][BR]Nemám žádné konkrétní doporučení, jednoduše jsem se řídil questy, takže mám 19 osadních budov: - portál, Vallorianská dračí věž (7x9 na úrovni 4) - 9 Vallorian Workshops (každý je 7x4 na úrovni 4) - 9 workshopů Diabhal's Horde (každá je 5x6 na úrovni 4) plus samozřejmě všechny Stezky kořisti (1x1), které je spojí Nesnažil jsem se optimalizovat svou osadu, takže určitě existuje mnoho způsobů, jak ji zmenšit, ale abyste si udělali představu o konečném výsledku po všech vylepšeních, níže máte moji mapu Elvenstats. Cokoli menšího než těchto 19 budov, nebudete moci ověřovat questy, ale s dostatkem many, 1h/2h časových boosterů, stoupajícího zboží, zisků portálu (v tomto konkrétním pořadí) nebo hromady diamantů můžete tuto kapitolu uspěchat. teoreticky pouze 1 od každého. Více než 19 budov by mělo být přínosem, protože množství produkce osady je indexováno faktorem prosperity, který se bude zvyšovat s každým vytvořením nebo aktualizací nové osadní budovy. Jinými slovy, čím více budov přidáte, tím více jich vyrobí všechny ostatní budovy, což vám pomůže rychleji dosáhnout požadovaného množství produkce osad. Nezkoušel jsem, ale měl jsem v úmyslu přidat 1 Vallorian Workshop + 1 Workshop DH a zjistit, jak to bude mít dopad.....[BR]PS: ... čerpáno z Bety."}, {"2": "Žádná agitace, prostě zamyšlení, já taky nemám všechna rozšíření."}, {"8": "Tenhle prostorovy zakald vypada naprosto v klidu, ale cekam zaludnosti [smilie--sprite1] za par dnu (Teda vlastne tydnu, pze jsem vyplytval knizky na vylepseni magickych budov) se ukaze jak to bude slapat [smilie--sprite8] tentorkate to do vanoce nedam :-/"}, {"16": "Uvidím, jak mi to půjde se 6+6. Na více bych musel teleportovat manu/zbrojnice/obytky."}, {"2": "@Boobika [BR]Jak jsi mohl vyplýtvat knížky?"}, {"20": "Vzhledem k místu, které mám, jsem si to poskládala takto:[BR][BR][IMG]https://i.ibb.co/SPDf9RW/https-cz-forum-elvenar-com-index-php-attachments-sn-mek-obrazovky-2023-08-04-180453-jpg-7015.jpg[/IMG]"}, {"8": "ukazkove jsem plytval knizky(edit: presnejsi terminologie: planky) za kralovske rekonstrukce  [smilie--sprite8] a ted jsem si dal par tydnu pauzu takze nepribyvaly. ale zase mam par knihoven na maximalnim lvlu [smilie--sprite2] (proste ty nejzbytecnejsi upgrady kdyz se nudis a nevis co se zdroji)"}, {"11": "VB za KR ?"}, {"3": "Myslí plánky, ne VB"}, {"6": "Na kapitolní cesty je nejúspornější první plánek @ElfNostradamus (38 políček). U zabraného prostoru je to zase jeho druhý návrh, ale ten má zase 54 cestovních políček. Někde mezi tím je návrh @Ludi. Ten je zase nejpřehlednější a nejuspořádanější. [BR]Asi rozhodne náročnost budování cest. Alespoň u mne."}]