[{"11": "no, tak se ještě jednou vyspíme a pustíme se do toho [smilie--sprite1]"}, {"5": "se mi líbí toto...[BR][IMG]https://i.ibb.co/wWK32pR/https-cz-forum-elvenar-com-index-php-attachments-1691354163933-png-7016.png[/IMG]"}, {"3": "Tu cestu nahore druhou zleva se dá vynechat [smilie--sprite1]"}, {"6": "Má to drobnou chybičku - je to otočené o 90 stupňů.[BR]Jinak u mě dobré."}, {"2": "Tak na kolikatou to šacujete?[BR]Na dvanáctou?"}, {"24": "Ak si dobre spomínam na predchádzajúce kapitoly, tak väčšina z nich bola spustená až popoludní. Uvidíme ako tomu bude teraz."}, {"25": "To sou nerrrvy  čekám už od 1:30"}, {"17": "Nová herní kapitola byla právě spuštěna, přejeme vám spoustu zábavy!"}, {"6": "No to je fajn. Jde se na to!"}, {"2": "Tak to je dobrá zpráva"}, {"11": "val. dračí věž mám vyzkoumanou, ale jak tedy získat prosperitu abych ji mohl postavit, navyšováním obytek ?[BR][BR]edit: aha, zvednout sídlo"}, {"8": "obytka, hlavni budova, ..."}, {"11": "jj, už se orientuju"}, {"6": "To je šrumec. 155 koupených knížek, abych otevřel kapitolu a k tomu 5 reklam pro zbývající VB.[BR][BR]No a teď začíná VB courání. U mě tak na 2 měsíce+. Alespoň je zase chvíli co dělat."}, {"4": "Hmmm, tak to je tedy veledílo, ta křížová výroba, to bude trvat dlouho."}, {"5": "Opětovně díky! - za opět dobrou, krásnou a hlavně včasnou cz Wiki k nové rase.... Tentokrát Luonnotarovi /myslím [smilie--sprite1] / ?![BR]\t\t\thttps://cz.wiki.elvenar.com/index.php?title=Valloriansk%C3%A1_legenda\t\t"}, {"26": "Tak já se dostal ke hře až teď, vybral z tajemného objektu několik set VB, prastarých vědomostí, pár tisíc diamantů a budovy..[BR]Do začátku kapitoly se ty VB hodily, prvních šest výzkumů je hned hotových. Teď se pustím do přestavby a doufám, že kapitola bude zábavná."}, {"5": "Já vím, že jsem zde huboval na reklamu a nesdílel nadšení s její zaváděním do hry, ale nyní při vstupu do nové kapitoly, jsou hráči s reklamou = možností využití určitých bonusů mírně řečeno trochu zvýhodněni....snad se časem dočkáme my nebonusový nápravy [smilie--sprite1] [BR]...nic ve zlém jen malé povzdechnutí, trpělivě počkám [smilie--sprite1]"}, {"19": "Taky jsem tak trochu čekal a hlavně doufal, že to s novou kapitolou spustí všem."}, {"20": "Těm, co mají reklamy, připomínám, že si mohou každý den naklikat v Hobby místnosti Stavitelů + 20% komunitní práce. [BR][BR]P.S: dnes sběr reklamy na ploše už dává 21 dia, protože začala 21. kapitola. Není to moc, ale je to hezký dárek."}]