[{"16": "Já bych naopak uvítal, kdybych si ty otravné kotouče mohl vypnout. Klikat na ně stejně nebudu."}, {"27": "Koukám, že už jsou tady pěkné návrhy na rozmístění budov nové kapitoly. Díky moc za ně. Taky bych ráda plánovala, ale ať dělám, co dělám, tak mě stránky architekta žádné budovy 21 kapitoly nenabízí. Město přenesené přes ElvenStats do plánovače dokonce zeje po vylepšení kouzelných dílen a obytek prázdnotou. Už jsem zkoušela snad úplně  všechno, ale architekt mi prostě novou kapitolu nenabízí. Má někdo stejný problém?"}, {"28": "@Najdana Musíš si architekta přepnout na betu, pak to půjde [smilie--sprite1]"}, {"27": "Juchů, mám to přepnuté na Betu a jede mi to. Moc děkuji za radu Angedev[smilie--sprite1]"}, {"5": "Lovec Krys napsal/a:\t\t\tJá bych naopak uvítal, kdybych si ty otravné kotouče mohl vypnout. Klikat na ně stejně nebudu.\t\tKlikněte zde pro zvětšení...Jenže v ideálu a spravedlivě všem stejně - bud´tedy všem vypnout nebo zapnout....respektivě spustit a mohou mít na výběr"}, {"21": "Ideál je ať si každý zvolí co mu vyhovuje buď si to nechá zaple,  nebo má možnost to vypnout[BR][BR]Odstraněna citace. Embla"}, {"8": "cekal by ze kdyz se z elfu/lidi stali komunisti a pracuji ted za stravenky, ze se nebude sbirat  unurium (pecetni vez), ktere je z dani [smilie--sprite1] ale vypisuje to provokativni 1 unurium za budovu"}, {"2": "Oni nepracují za stravenky.[BR]Místo daní ti doma malují tyhle papírky."}, {"25": "Valorianska pecetni věž přijde o 50% funkce kvůli nové prosperitě, která je velmi důležitá na postup hry.. Nwm proč ty daně urunia nejsou i součástí těch nových listku co vyrabi obytné budovy"}, {"6": "Tomu tak nějak nerozumím. O jakou funkci, prosím?"}, {"16": "@Schoenfeld Myslí se tím to,  že když v rezidencích vyrábíš Komunitní práci namísto mincí, tak ti div generuje řádově méně Unuria (naštěstí jeho hlavní bonus je snížení rozpadu)."}, {"11": "ahoj, jsem možná za tu dlouhou pauzu něco zapomněl ale proč nevidím u Vall. dračí věže bonus za uskladňovací vír? čmelák se tam zobrazuje. Podle wiki má portál na lvl 1 kapacitu 40.000 a mě to ukazuje 40.000 přesto že mám vír na lvl.29"}, {"2": "Přeci nenasadi lístky u poloviny obytek"}, {"6": "@Lovec Krys No losy zatím dělám, jen aby se neřeklo, a zkoumám, co s tím. Ale unur z paneláků jsem stejně jenom považoval za vítané zpestření mezidobí mezí událostmi."}, {"4": "@GorGlin - no já mám prozatím lístky nasazeny teda u všech obytek, a budu je mít do chvíle, kdy dokončím kapitolu. Mince si naklikám přes stovky požehnání, ty nepotřebuji. A unurium napadá z věže a sběru eventové měny dost. Takže v tržnici vyrábím jen semeno."}, {"20": "Souhlasím s @voyager-1, ani já nevidím u Valloriánské dračí věže bonus za Uskladňovací vír. [BR]Jedná se o chybu nebo záměr vyřadit tento div z provozu? Mám ho na 30 lv. a nyní bez účinku? [BR]Mohl by se k tomu, prosím, někdo z moderátorů vyjádřit?[BR]A pokud se budou některé divy blokovat v jejich účinku, nemohli byste nám dát možnost je alespoň teleportovat?"}, {"29": "A nebo je mít možnost prodat tak, aby po nich zůstaly všechny VB. Suroviny ať vezme čert  [smilie--sprite6]"}, {"22": "Všechny moje divy ukazují výrobu 0% už asi týden. Někdo tady psal, že je to chyba zobrazení a ví se o tom"}, {"20": "@Jasnost chyba v divech, o které píšeš, se týkala jen apky, ne PC a byla již opravena v poslední aktualizaci.[BR][BR]Chyba, o které tu píšu já, je něco jiného. Ostatní divy fungují kromě Víru. Není to chyba zobrazení, ale funkce."}, {"20": "Po aktualizaci Vír funguje, děkuji."}]