[{"16": "Tak po uvážení jsem nakonec taky trošku teleportoval (všechny manufaktury T4-T9 jsem ze dvou kusů jeden odteleportoval a druhý mohu nechat produkovat na kouzlech) a tady je plánovaný výsledek (poté, co ještě odteleportuju jednu obytku a tu kupu evo budov, co tam teď v té části města překážejí):[BR][BR][IMG]https://i.ibb.co/TL49rpC/https-cz-forum-elvenar-com-index-php-attachments-1691658669544-png-7032.png[/IMG]"}, {"5": "Zatím jdu cestou maximalizací osadnických dílen na lv 1 a 2 ...potom uvidím co se z toho vykrystalizuje [smilie--sprite1]  místa ještě dost[BR]Poučka-již v podvědomí přesto: přes den výroba na noc stavět..."}, {"6": "Je to tu akosi chcíplé z hlediska vyměňování si příznivých zpráv a návodů."}, {"16": "Orkové to flákají, protože ví, že je draci stejně po práci všechny sežerou (oni je požírají i přímo při ní)."}, {"20": "@Schoenfeld postupně se ukazuje, že kapitola není zase až tak složitá, jak to původně vypadalo. Zatím jsem nenarazila na nějakou záludnost. Komunitní práce i mince z domů bez problémů, trošku je to zase žrout na manu, výroba chce hodně trpělivosti, ale jinak vše v pohodě. Prosperita taky v klídku."}, {"2": "Za mě, tentokrát nemusíme spěchat s portálem. Vylepšováním dílen se zvedá produkce i bonus."}, {"20": "@GorGlin portál mám na 4lv. Pokud to jde, vždy je pro mě výhodné portál zvednout co nejdřív, protože ten zase ovlivňuje celou výrobu k vyššímu výkonu. Teď postupně vylepšuji dílny.[BR]Výzkumy na dílny 3. a 4. lv. jsou už hodně drahé, to mi ještě chvilku potrvá. [smilie--sprite2]"}, {"2": "Jak zvednutí portálu ovlivnuje celou výrobu?[BR]Přes prosperitu?[BR]To dělají i dílny.[BR]Dřív zvednout portál znamenalo dostat +20% na všechny produkční budovy.[BR]Ted už ne."}, {"2": "Jenže těch 40% není z portálu, ale za použitou prosperitu.[BR]zvednout portál je 27 prosperity, zvednout dílny 72[BR]Ano, výzkum na vylepšení dílen vyžaduje suroviny z portálu a už jen proto, jak je výzkum seskládaný, budu mít první lvl 4 na portálu[BR]Ale na 2. lvl půjde až jako poslední."}, {"20": "A o co tu vlastně jde? Budova, která hned po vylepšení nejvíc pohne s výrobou, je portál, trochu jsem ho urychlila. A pak dělám dílny, protože ty než se vylepší, tak to chvilku trvá, na to už tolik urychlovačů plácat nechci. Zítra už bych to měla mít.[BR]Potom výroba na výzkum 3. a 4. lv. dílen, ještě poslední rozšíření a zase zpět na ostatní výzkum."}, {"11": "koukám na navýšení portálu v malým městě na A., je to nějaký divný"}, {"2": "Protože?"}, {"5": "Zatím pohodový průchod. Výroby na sebe vcelku navazují, byt´se částečně navzájem sžírají, jak jsou propletený.[BR]Kdo se předpřipravil = jenom dobře....časem se stupnuje poptávka po T7-T9. Zatím to ale jedna mnf utáhne i díky právě přípravě na rasu.[BR]Lze - namačkat do města co nejvíce osadnických dílen na 1. a 2. lv. Tím se zapojuje prosperita a sama výroba je o krapet vyšší...poté již každý dle místa zvedat na lv. 3 a 4. případně redukovat předchozí vyšší počty těch nižších levelů.[BR]Úkoly budou chtít i 9 kusů Valor dílen na lv 4. a to samé i u Diabhal. dílen, necht´každý sám přijme rozhodnutí zdali vůbec tyto úkoly plnit.[BR]Úkol 72 : Mít 9 Vallorianských dílen alespoň úrovně 4 + 9 dílen Diabhalovy Hordy alespoň úrovně 3.[BR]Úkol 75 : Mějte 9 dílen Diabhal's Horde alespoň úrovně 4.  / zde se dá už tedy Valor dílny trochu redukovat případně odpojit/....kdo opravdu má nouzi na místo /vždy se dá něco odteleportovat/[BR]a jsem zvědav jak bude ve finále vypadat úkol 74: 10 obytek alespoň na úrovni 47 + 4 dílny alespoň úrovně 47 ...[BR]"}, {"2": "úkol 74 splníš přes magické budovy."}, {"9": "tak tak uz par kapitol mam jen 2 kouzelne dilny a tento ukol se mi vzdy splni"}, {"6": "Nevím, nevím, Ať počítám, jak počítám, pořád mi to připadá příliš snadné. Kde je to pověstné ***vítko?"}, {"5": "Jinak musím přiznat, že tato kapitola nahrává více hodně aktivním hráčům, kdy v dílnách osadníků běží převážně výroba á 2hod a 4hod...tj hráči, kteří sem mohou zajít jednou max dvakrát denně budou o to déle tuto kapitolu zdolávat...držím jim pěsti a nutno se obrnit trpělivostí. GL"}, {"2": "Já jich vidím několik, ale zatím, jsem všechny obešel, nebo k nim ještě nedorazil.[BR]Myslím, že města co jedou bez kultury můžou s komunitou docela narazit.[BR]No a spotřeba many v portálu, spálit za den 10M many moc dlouho nevydržím.[BR][BR]Výzkum je k..vitko samo o sobě.[BR]Nejdřív vyzkoumas portál.[BR]Je ti to k něčemu?[BR]Ne.[BR]Pak Vall. dilny, je ti to k něčemu?[BR]No, můžeš začít dělat bedny, ale to je to jediné k čemu jsou instanty.[BR]Až nakonec vyzkoumas orčí dílny a můžeš to spustit.[BR]A při vylepšování se to opakuje.[BR]A navíc tu je dost jednostranná spotřeba surovin, takže kdo si to nepočítá, schytá další zdržení."}, {"20": "To, že jsou poslední kapitoly drahé na suroviny, není nic nového. Spotřeba many v portálu je nepříjemná, ale nějak to uděláme, však už máme většinou slušné divy a to pomůže moc.[BR]Souhlasím, že hlídat kulturní bonus je nyní důležité a vždy bylo. Snažím se být nad 200%. [BR]Ale i dostatečný počet obytných budov a dílen hraje roli. Jednak pro dosažení dobré hodnoty prosperity, ale také slušný sběr mincí i komunitní práce. Ale nepočítala jsem, kolik je minimum obytňáků a dílen, potřebných na projití kapitolou."}, {"6": "Teď mne teprve napadlo: Kdy se spustí v kapitole úkoly?[BR]Ne že by mi extra chyběly, ale kde, ksakru, jsou, když už zkoumám v klidu dílny?"}]