[{"24": "@Schoenfeld ak máš ešte nedokončené úlohy z predchádzajúcej kapitoly, tak musíš najprv dokončiť tie (alebo ich preskočiť). V opačnom prípade by sa nové úlohy mali objaviť hneď po vyskúmaní prvej technológie (prípadne až po reštartovaní hry)."}, {"6": "Dík. Měl jsem na ploše pořád: Postav kulturní budovu. Až jsem na to zapomněl, že to patří k hudební kapitole, a už jsem to vůbec nevnímal.[BR]A teď to zkusím odklikat. I když nevím, jestli to má nějaký smysl."}, {"30": "má to smysl, já jsem to tak také měla a pak některé úkoly už jsi měl hotové, takže ti naskočí u některých odměny [smilie--sprite1][BR][BR]Odstraněna citace. Embla"}, {"16": "Ludi napsal/a:\t\t\tSouhlasím, že hlídat kulturní bonus je nyní důležité a vždy bylo. Snažím se být nad 200%.\t\tKlikněte zde pro zvětšení...Tak to uvidíme jek moc velký to bude rozdíl. Já jedu většinu času se 100%."}, {"6": "Mám stabilně 180+. To musí stačit. Když ne, tak to holt potrvá chvilku déle."}, {"7": "Nedávno jsem váceméně omylem poskočil z 180 na 250. Ten rozdíl je setsakraznát!!"}, {"16": "@Waso Tady je řeč o vlivu kulturního bonusu na osadnickou výrobu v kapitole 21 (novinka).[BR][BR]Edit: Moje chyba. Kulturní bonus zvyšuje produkci komunitní práce, ne produkci osadníků.[BR]Zatím mám našetřeno přes 7000 komunitní práce, tak mne to nijak netrápí. Jak to bude dál se uvidí. [BR]V nejhorším přepnu pár dalších obytek na komunitní práce. Mince mohu nějakou dobu držet na požehnáních a unuria mám v zásobě zatím ještě 25 milionů, takže i kdyby mi nestačila produkce z Chrámu, tak mám docela velký polštář."}, {"2": "Já je mam"}, {"11": "Ten kulturní bonus zvedá jen kom. práci, ale ne výrobu osadníků, ne? Jsem ho o dost zvedl a výroba je stále stejná."}, {"5": "Ukoly již dàvno jsou...případně musíš poodmítat ty staré, aby jsi se dostal k novým [smilie--sprite1]"}, {"5": "Kultura nezvedà vyrobu osadníků....tu zvedà prosperita resp.její potřeba tj.postavením více os.dílen a pak jejich levely...leze to mirně hodně mírně nahoru[BR]Kultura je dobrà na sklizně všeho ostarního na ni navazáného...mana.komunita.mince v obytkach tím i urunium z obytek, kladiva.....držím ji nad 600%"}, {"31": "Já mám opačný problém. Měla jsem tam úkol Odemkni technologii jěště od začátku kotlíku. Při spuštění dvacáté kapitoly ten úkol zmizel a mám tam akorát úkoly ke kapitole."}, {"20": "Kulturní bonus zvedá produkci mincí, kladívek a komunitní práce. Já mince i kladívka používám denně díky Čmeldovi u obchodníka, takže se mi hodí. A komunitní práce mám taky dost, tak jsem dnes uklidila jednu obytku, trochu místa se šikne."}, {"7": "@Lovec Krys .: Vím. Ale když jsi napsal všeobecně svých 100 a @Schoenfeld  standartních 180 procent, tak jsem to nevydržel a přispěl do (všeobecného) mlýna![BR][smilie--sprite7][smilie--sprite8][smilie--sprite7]"}, {"5": "Bonus portálu = hledáme pod kolonkou Výroba osadníků ....aktuálně 229% , kdy 44% dává 33lv Kvetoucí obchodní cech ...další bonus doplnuje množství osadnických budov a jejich aktuální levely...[BR][IMG]https://i.ibb.co/MRnWn38/https-cz-forum-elvenar-com-index-php-attachments-2023-08-15-2-png-7034.png[/IMG]"}, {"2": "Přijde mi že devět dílen je málo.[BR]Mám 11 valorianskych a 17 orcich, jinak bych pořád čekal až někde něco dovyrobim."}, {"16": "Ony ty osadnické budovy budou v počtu nejspíše optimalizované na výrobu bez  použití PP (bez záruky). Takže 1:1 nejspíše se 100% použitím PP nebude nejlepší.[BR]Taky přecházím na  jiný poměr (aktuálně 9:13)."}, {"5": "14:19 mám poměr [smilie--sprite1] portál již dalece nestačí sžírat nadvýrobu dílen....počítám, že na konci zůstane stát sám a dovyrábí poslední technologie s tou zásobou co se tam nahromadí..."}, {"11": "taky mám 9:13 [BR]a že vývojáři přihlížejí k výrobě kořisti je logický."}, {"2": "Můžete mi někdo poradit s úkolem, získej hordu orků?"}]