[{"19": "horda orků = množírna 48 hodin"}, {"2": "Diky"}, {"5": "K některým úkolům přibyly i alternativy, takže se úkolová řada plní lépe...díky INNO [smilie--sprite1]"}, {"6": "Ať počítám, jak počítám, kořist asi potáhnu převážně z portálovek. Mám nahamouněno 8 000 %, tak co."}, {"2": "Něco jsem vyrobil, když by jinak budova nic nedělala.[BR]A vyšlo to jen na pár kousků, takže myslím, že není důvod instanty nepoužít."}, {"4": "Docela zajímavá je potřeba many. jenom na výrobu 1920 neomalených obětí budu při výrobě 22 kusů v jednom slotu potřebovat 79.200.000 many "}, {"6": "Celkově to bude chtít 134 M many, jak mi to zatím vychází."}, {"2": "Zítra bourám rasu a tak si dovolím shrnutí dojmů.[BR]Rasa byla, pro mě, super.[BR]Byla svižná, opřít se do toho přineslo benefit, pečlivé budování zásob se secsakramentsky vyplatilo.[BR]Je možné postupovat ve výzkumu postupně po sloupcích, ale dá se i tématicky rozdělit do tří linií, rasa, vojsko, produkce.[BR]Pokračovat ve výzkumu tématicky přináší výhody, ale i úskalí.[BR]Já jsem šel cestou preferencí a v jednu chvíli se potkal s takovou spotřebou many že 80m, na skladě a 1,6m denní produkce mě dostalo na dno.[BR]Spotřeba uriny a semene nebyla zdaleka tak likvidační.[BR]Ale produkci many může běžné město mnohem snáz dohnat lépe než semene nebo uriny.[BR]Takže klacky pod nohy ano, ale nic co by nešlo řešit.[BR][BR]Ale jsou věci, které mě překvapili i negativně.[BR]provincie ve vzálenosti 17 jsou stále velmi lehké, 18 jsou stéle lehké, 19 stále střední, 20 se změnili z velmi těžké na těžké. Dál všechno na max.[BR][BR]Nebo Starožitnictví, když nejde uklidit na pauzu mezi rasamy.[BR]Fakt by mě zajímalo co tím autor myslel.[BR][BR]Každopádně jsem se asi nejvíc zasekl nad detaily plynoucími z příběhu.[BR]Přišel chlap z minulosti.[BR]Se kterým byla zkušenost, že si nechce živobytí obstarávat sám, a chce být pirát.[BR]To obecně znamená okrádat druhé.[BR]Naše reakce byla, je to tradice, nemůžeme je nutit pracovat, chce krást, nechmeho.[BR]A pak to šlo dál.[BR]Chlap s kachnou na rameni, kterého znám jako kriminálníka mi něco přijde prodat.[BR]A já to prakticky bez otázek koupil.[BR]S argumentem, že vedec mě varoval, ale po mamonu toužící obchodník mě přesvědčil.[BR]A pak se začali dít zvláštní věci.[BR]Jak mému městu prospěje, že jeho obyavtele přestanou platit daně a budou malovat papírky?[BR]Nebo budou chodit do okupační zóny orků a tam makat.[BR]Kterou jsem sám vystavěl, ve městě pod kontrolou orků.[BR]jsme v zajetí[BR]Moment, který mě nepřekvapil, spíš vyděsil, bylo,\"nadpřirozeno, kdo by tomu věřil?, ale malování papírků, v tom je budoucnost.[BR]nadpřirozeno neexistuje, ale pomalovaný papírek[BR]Myslel jsem že elvenr je svět kde může voda téct do kopce.[BR]Teď doufám, že si tu dva orci z méno města neudělají místo na honeymoon, protože jsou to bytosti bez kultury a intelektu a já nechci počítat mrtvoly pro jejich pobavení.[BR]snad se to sejde[BR]Elvenar je svět bez rasizmu, každý zrádce a podvodník žije ve stresu že to na něj praskne"}, {"6": "Gratulka. To je fofr. [BR]Na skladě mám 32 M many a denně jsem schopen dělat 1,5 - 2,2 M. Takže jsem usoudil (@GorGlin mi to potvrdil), že úzký profil je tentokrát mana. [BR]Hnát se mi nechce. Času do další kapitoly je více než dost. Ještě dva měsíce na draky je pro mne přiměřený termín."}, {"20": "@GorGlin gratuluji. To já ještě nějaký čas hrát budu, ale jsem s tím v pohodě, na další kapitolu je spoustu času. Spotřeba many je značná, je to hlavně znát, když se vyrábí Neomalené oběti. Ale vše je řešitelné."}, {"6": "V podstatě platí, že ten, kdo si trpělivě dělal zásoby před kapitolou, respektive udržoval pokud možno co nejvyšší stav ve skladišti, tak je teď v pohodě.[BR]Ti, co mají \"daně\" kolem 2 % jsou samo hvězdy.[BR]Budiž jim přáno. Spíše jde o nás \"rychlokvašky\", co jsme se přiřítily na konec 20. kapitoly, a teď - co s tím?[BR]O 2 % daní si i teď můžeme nechat jenom zdát, ale asi můžu v klidu doporučit, ve vylepšování divů při čekání na další kapitolu hodně (ne jenom!) se soustředit na ty, co sundávají \"daně\" na manu, semena, unurium, živoucí, osvícené a teď i komunitní práci.[BR]Co na to třeba @GorGlin zapřemýšlet, co s tím, když teď už s kapitolou končíš.[BR]Nebýt rad zkušených hráčů k předchozím kapitolám, rozhodně bych za 2 roky a 9 měsíců nevystřelil až tam, kde teď jsem, to jest sem na kapitolní vrchol.[BR]Tak pojďme maximálně poradit těm, co jdou za námi."}, {"32": "Se surovinami mi pomáhá Kryobudova,snižuje rozpad o 5% kterou jsem našel v inventáři (čary).Nevím ani jak a kdy jsem ji získal,třeba někdo poradí zda je někde k mání."}, {"3": "Loňský zimní event"}, {"6": "K poznámce @Ch u c k y  dávám snímek od @iDavis. Oběma dík.[BR][IMG]https://i.ibb.co/42DkWDN/https-cz-forum-elvenar-com-index-php-attachments-1693134128349-png-7040.png[/IMG][BR]Samozřejmě dík i @Emhyr var Emreis II, který mi uspořil hledání."}, {"4": "@Ch u c k y - ještě jsem v těch čárách našel manovou runu, ta zvyšuje na pár dnů produkci many o 70% a to není úplně málo"}, {"32": "pavelb napsal/a:@Ch u c k y - ještě jsem v těch čárách našel manovou runu, ta zvyšuje na pár dnů produkci many o 70% a to není úplně málo\t\tKlikněte zde pro zvětšení...jj už jsem ji také našel"}, {"11": "taky mám pocit, že mám v dílnách a hordách vše vyrobeno, ještě mě čeká vyrobit pár neomalených obětí a ještě jsem neměl úkol na 9 dílen a hord a přes 1000 VB do výzkumu mi chybí. A za mince ani zboží už je kupovat nechci."}, {"20": "@Banderoi v divu vložíš runové úlomky do runového kola."}, {"12": "a když nemám runove kolo?"}, {"20": "@Banderoi a máš nějaký div, který nemáš postavený?"}]