[{"26": "Hoď úlomky někomu se spolku do divu a úkol se splní...[BR]Možná to funguje i při hození do vlastního, ale je to škoda, protože tak získáš jen 10VB/ks.."}, {"2": "vložíš někomu, všetně sebe, runy místo VB"}, {"12": "Ludi napsal/a:@Banderoi a máš nějaký div, který nemáš postavený?\t\tKlikněte zde pro zvětšení...Díky za rady-vyřešeno-podpora zareagovala skvěle!!!!"}, {"30": "zdravím, pořádám sbírku na semínka - děkuji všem, kteří mi přispějí na můj účet [smilie--sprite2][BR][smilie--sprite6], joooo a taky mana by se hodila - takží díky všem skvělým přispěvatelům [smilie--sprite1]"}, {"9": "@abraham semeno taky nemam nazbyt ale many mam ted dost vymenim nakou za unurium ok?[BR][BR][IMG]https://i.ibb.co/xghSkYj/https-cz-forum-elvenar-com-index-php-attachments-sn-mek-obrazovky-2023-09-02-100600-png-7048.png[/IMG]"}, {"30": "kdyby to šlo, tak to by šlo - unurium  teď jde dobře - díky eventu [smilie--sprite1]"}, {"9": "jo jako je to o mnoho lepsi ted mi stoji jen polovina osvicenych manufaktur"}, {"8": "hm. klidne bych za manu strelil. urinu i semeno [smilie--sprite8] to ted ve finalni fazi kapitoly je jedina brzda. jinak zatim se to jevi jako takova prijemna pohodva kapitola"}, {"5": "Kapitola, krásná, rychlá, efektivní a při dobré přípravě a dosti místa = zvýšené množství osadnických dílen do měsíce hotovo..."}, {"9": "no se tesim teda ale kdo vi jak bude trvat me no od lodi jsem nemela zadnou mezeru mezi kapitolama tak se uvidi i tak jeste potrva nez se k ni vubec dostanu, ale uz se poamalu tesim ze jednou dojdu na ten pomyslny konec"}, {"20": "V této kapitole velmi pomůže Maják dobrého sousedství. Zvedne výrazně kulturní bonus ( běžně přes 300%, někdy i 500%) a tím zlepší produkci v obytkách a také zlepší produkci many. [BR]Myslím, že nejdéle za dva týdny budu hotová, jen musím protlačit přes portál zbývající oběti a nechce se mi na to dávat urychlovače. [BR]Takže 9 Valloriánských dílen bohatě stačí, Hord jsem měla 11. Dostačující počet, aby produkce v portálu byla slušná. Na kapitolu v klidném tempu cca měsíc a půl. To je dobré. Grafika opět velmi krásná."}, {"8": "ja tomu majaku porad nemuzu prijit na chut. co to tak sleduju tak ma pocit ze vzdy je opackovany cokoliv jineho jen ne to co bych potreboval [smilie--sprite1] (a mel oznacene jeste kouzlem)"}, {"9": "co se tyka majaku no kdyz jsem se rozhodovala postavila jsem i kristalovej (zvonici) oni se hodne dobre vzajemne doplnuji a druha vec je vyhazet zbytecny kulturky aby se dostala pomoc prave tam kam chces a druhy majak pomuze aby tam zustala pomoc do doby kdy budes sbirat tu manu[BR]ikdyz jsem mela starsi vejce tak to celkem slo protoze vejce muzes vybrat bez ztraty az 24h i proto povazuju vejce za jednu z nej kulturek na manu (nedojde ke ztrate za pozdni vyber)"}, {"16": "Ono se to dá i bez Majáku a bez kulturního bonusu.[BR]Pro manu stačí mít slušnou zásobu kouzel a vysokou úroveň Opatství - při dostatečné zásobě kouzel je možné naklikat celou manu kapitoly jen přes Opatství a nemít ve městě jedinou manovou kulturku.[BR](ano, vím, že ne každý má luxus tisíců kouzel v inventáři)[BR][BR]No a chybějící kulturní bonus jsem nahradil prostě tím, že jsem zapnul komunitní práci na více obytkách, mince v případě potřeby mohu naklikat i přes požehnání a unuria mám stále ještě dost v zásobě.[BR](ano, vím, že ne každý má luxus začít kapitolu se zásobou 27 milionů unuria (ještě mi jej stále 16M zbylo))[BR][BR]Strategie pro hráče, který ještě nestačil dojít na konec výzkumu bude samozřejmě jiná, než nás, kteří mezi každou kapitolou máme minimálně půl roku čas na shromažďování všemožných surovin a požehnání (a vylepšování divů) a je pak docela těžké nás nachytat na nedostatek skoro jakékoliv suroviny."}, {"4": "@Lovec Krys - přesně tak, kapitolu jsem začal asi po 14 ti dnech po ukončení té předchozí se zásobou asi 10 mega many, pár semen a unuria. Mana byla pryč hned po vylepšení radnice. Už jsem utratil asi 2000 kouzel na výrobu v opatství a ještě pořád mi chybí přes 30 mega many na výrobu posledních neomalených obětí. Takže pokud tu kapitolu chce někdo stíhat za měsíc, tak je potřeba mít k dispozici kolem 4 mega many denně !!! Já utratím ještě nějaká ta kouzla a pár urychlovačů, abych se těch osadníků zbavil a po následujícím turnaji bych měl mít teoreticky též hotovo."}, {"20": "Vše jde snadno zvládnout, když má člověk mega zásoby všeho. Ale jak jste se tu oba zmínili, je i dost hráčů, kteří takové možnosti z různých důvodů nemají. Maják pomůže s tím, že hráči nepotřebují tolik obytek a pomůže i s manou. Ale samozřejmě, to jde i bez tohoto divu, jen pro některé hráče to může být vítaná pomoc, tak jsem to tu chtěla připomenout."}, {"3": "Mana se dá obejít,  mě nejvíc brzdí semeno, ale nic dramatického. Holt budu upgradovat pomaleji. Pohodový tempem si myslím, že ještě max měsíc a půl. Spíš méně"}, {"4": "@Emhyr var Emreis II - tak já upgradoval jen radnici a kasárny, na zbytek bude čas a surky během následujících měsíců [smilie--sprite2]"}, {"6": "Není kam spěchat, páč je za tím zase nejspíše tak půlroční mezera plná nudy a reklam."}, {"16": "Schoenfeld napsal/a:\t\t\ta reklam\t\tKlikněte zde pro zvětšení...Tak na ně furt nekoukejte."}]