[{"7": "Miluji reklamy....."}, {"2": "A já furt nic"}, {"5": "Rovněž jsem zatím bez reklam, což na jednu stranu zatím kvituji ...na druhou pak co čtu na chatu tak některé ty bonusy by se v určitou chvíli i šikly...[BR]...přesto tu je tu měsíce určitá nerovnováha, kdy část elvenarské hráčské populace má přístup k reklamám jiná ne...."}, {"20": "Kapitola dokončena, úkoly splněny. Ještě mě čeká postupné vylepšování manufaktur na T1, ale to už je v klídku. Období mezi kapitolami mám ráda, klídek a pohoda. [smilie--sprite1]"}, {"2": "Taky to mám rád.[BR]Sezóna, rasa, DS, všechno najednou je opruz.[BR]Teď budou maximálně dvě věci najednou a to je až dost.[BR]Co vím o reklamách, tak to je nevyvážené mezi počítačem a mobilem.[BR]Bonusy se hodí, ale na mobilu to trvá děsně dlouho, vlastně vypadnete z aplikace pak když nekliknete správně tak hned to začne vyvádět, nainstaluj mě, nainstaluj mě, na počítači se objeví okno a za chvilku je pokoj.[BR]Jen je potřeba si hlídat zvuk, protože nektere reklamy dělají hrozne zvuky.[BR]A s ohledem na to, že chodím na hru většinou z mobilu, tak reklamy nejsou služba pro mě."}, {"9": "reklamy jsou na nic, nebo jsem chtela zkusit 80% na suroviny jenze je to 80% ze zakladu nez se zapocitaji relikvie a jine bonusy tak pak ten efekt nebyl ani videt no jestli je to tak i s ostatnima bonusama tak jsem za celou tu dobu o nic neprisla[BR]to mi pripomina ten darecek co je na mobilu jednou za uherak 20 dia jedina kloudna odmena, ale stejne sance je mala takze kdyz tejden nejdu na mobil se nic nestane"}, {"16": "Samí rychlíci. Já mám před sebou ještě 8 výzkumů, takže odhaduju ještě tak na 3 týdny.[BR][BR]Kromě many může být brzdou i produkce osvíceného/živoucího, koneckonců ony ty osadnické produkce nežerou zrovna málo obojího.[BR]A pro slabší města kromě many mohou být brzdou i tyhle suroviny (a celá ta šaškárna s kupci (stačí si porovnat spotřebu osvíceného na jednu výrobu s kapacitou jednoho kupce)). A když nebude stíhat produkce/výměna těchto surovin (a many), tak hned se průchod může prodloužit o měsíce."}, {"7": "Miluji reklamy![BR]Klidně mi jich Elvenar může posílat dvakrát tolik!!"}, {"20": "Jedna zkušenost: větší množství budov na osadnickou výrobu může být velkou zátěží na osvícené zboží. Já měla jen 11 Hord a 9 dílen, a bylo to tak akorát. Celou dobu jsem vydržela jen po jedné manufaktuře na osvícené od každého druhu, řádně pokropené kouzlem. Ale je fakt, že jsem ve městě několikrát za den, takže jsem mohla produkci zadávat častěji. Kdo nemůže zadávat výrobu několikrát za den, tak asi potřebuje víc výroben. Manu jsem nějak zvládla, zásoba kouzel šla do kopru, ale to se rychle v turnaji doplní. Navíc mám všechno ve městě okouzlené na hooodně dlouho [smilie--sprite2].[BR][BR]Co se týče reklam, tak poslední dobou ty protivné zvukové se již nevyskytují, což je podstatně lepší. Samozřejmě, že odměny za reklamy nejsou nic závratného, ale já to využívám. Tím, že hraji převážně na PC, je přehrávání reklam asi jednodušší."}, {"8": "ano ano.. okouzlena dilna na 230d me vzdy pobavi [smilie--sprite8] treba s ni stihnu i dlasi kapitolu [smilie--sprite8][BR]ale aspon ten div na zvyseni rychlosti vyroby kouzel zacina davat smysl ... vetsi generator many >[smilie--sprite1]"}, {"3": "Pak stačí tu dílnu odteleportovat a kouzlo je fuč..."}, {"5": "...ono ji myslím stačí i vylepšit a pokud se mění rozměr, tak taky pryč"}, {"2": "A to se vyplatí"}, {"9": "no ja mam uz takhle okouzlenou dilnu tak asi 3.kapitolu takze myslim ze vylepseni nekazi okouzleni ale me to nijak nevadi mam 2 dilny jedna obcas okouzlena a jedna porad[BR][BR]@Ludi kdyz pises ze reklamy sledujes jakou vyrobu si vybiras? jestli nahodou naka za to nestoji"}, {"20": "@Elvinka12 teď v kapitole to bylo + 20% many, ale občas zvolím i něco jiného."}, {"6": "Zvuky mám na PC (notebooku) trvale vypnuty, páč jsou vesměs při delším poslechu svým opakováním nesnesitelné.[BR]Reklamy mi v podstatě nijak nevadí, ale v poslední době mi vadí reklama na morbidní střílení do lidí, kterému někteří šílenci říkají hra. Pakliže by šlo nějak tenhle typ reklam (nebo jiné vlezloviny) hráčem vypnut, docela bych to uvítal.[BR]Kromě toho mi připadá, že pro internet platí možnost uživatele omezit personalizaci reklam všeobecně, a tady se nás nikdo na nic neptá. Myslím, že to je docela v kolizi s příslušnými předpisy.[BR]Až budu mít více času, tak se na to ještě podívám."}, {"4": "Po ukončení kapitoly mám 2 dílny okouzlené na 854 a 863 dní dopředu [smilie--sprite2]"}, {"2": "Tak to je mazec.[BR]Takže za rok s další kapitolou pokoris hranici 1000 dní a pak už budeš plánovat pětiletky?"}, {"33": "ahoj, taky jsem dnes 21 dorazil a začala doba šperkování města"}, {"6": "Do 20. kola jsem řádil jako utržený vagon, abych všechno dohnal. [BR]Teď si třeba vychutnávám i vyložené zdržovací superblbiny, které mě u posledních kol většinou hned od začátku vyřazovaly z plnění úkolů. Při jejich plnění si zkouším třeba představit psychoportrét toho, kdo tam tu poťouchlost strčil. Nebo něco podobně ujetého.[BR]No a mezitím jsem se spokojeně přehoupnul do druhé poloviny plnění výzkumu, dodělávám výzkum 3-4 Diabhala a v klidu čekám, až dojde na nouzi v souvislosti s opatřováním hafo neomaleností.[BR]Do měsíce jsem tak jako tak hotový, tak co."}]