[{"1": "Od 27. července máte v rámci Sezóny vítězství možnost získat odměny za to, že splníte denní nebo týdenní úkoly. Těšíte se? Napište nám své názory a postřehy. [smilie--sprite1]"}, {"7": "Tak já se tedy těším![BR]Ale tady:[BR]\"A tady je hlavní odměna Sezóny vítězství, kterou naleznete na konci úkolové řady: Velkolepá aukce!\" [BR][smilie--sprite6] by mohl být přímý odklik na stránky iDavose, ať to nemusíme pracně doklikávat, o jakou budovu s výhodami doopravdy jde! [smilie--sprite1]"}, {"7": "Mimochodem, když si koupíš \" Prémiová Sezónní vstupenka\", dostaneš hned deset odměn.... ...zajímavé."}, {"6": "Mimochodem splnit \" Elvenarské hry\" (což je zřejmě tajný název Události) pro hráče, který nasadil hned na začátku komplexní útok na rejnoka a teď se plazí úkol za úkolem a přitom má týdenní povinnost 8 úkolů za splnit za týden, který má 7 dnů, je asi nějaké chucpe?[BR]Anebo se pletu, ale potom, ať mi to někdo obeznámený vysvětlí, páč nehodlám naším členům kázat postup jiný, než přepnout na alternativní úkol, což jsem ke své plné spokojenosti taktéž učinil.[BR]Howgh."}, {"18": "jen tak jak to tedy je s těmi změnami u sezónní vstupenky co před časem oznámili???? Oznámení jsem chápal tak že když si ji v této seónní události koupím třeba ve městě na arendylu tak mi bude platit pod stejným účtem i na winyandoru. Ale podle všeho tomu tak není, tedy alespoň co psal jeden z mých členů. Pochopil jsem to snad špatně? Může mi to někdo vysvětlit. Děkuji"}, {"19": "1. můžeš přepnout na alternativní úkol (jak jsi sám uvedl)[BR]2. týdenní úkoly nemusí být splněny během daného týdne, ale zůstávají v nabídce a nové jsou zařazeny do fronty, takže o nic nepřijdeš"}, {"19": "Ohledně sezónní vstupenky by mně zajímalo, proč je v jednom městě za peníze a v druhém (pod stejným účtem) za diamanty."}, {"11": "není to tím, že sis ji v jednom městě za peníze koupil a pak se v druhém nabízí za dia?"}, {"6": "Zmatek, zmatek, zmatek a výnosy jsou s otazníkem."}, {"20": "Hlavně buďme v klidu, Sezóna vítězství je jen vedlejší linka ve hře. A tak je to třeba brát. Většina úkolů je snadno splnitelných, občas v odměnách přijde pár vojáčků, takže nic proti ničemu. Zatím se mi úkoly vždy podařilo splnit tak nějak levou zadní. Až začne nová kapitola, tak tuhle část hry zřejmě vynechám."}, {"5": "Výnosem této sezony je na konci nej kulturní budova ve hře, takže velké plus a díky."}, {"21": "Tu naštěstí nepotřebuji tak to nemusím řešit"}, {"6": "Ve 21. kapitole budeme prstíčkem škrábat o další kulturní bonus pro komunitní práci, takže se kulturky budou velice hodit."}, {"11": "pochybuju"}, {"9": "ukoly jsou snadne jak bylo receno a s tou kulturou taky souhlas kdo nema moc obytek jako ja tak urcite v 21 kapitole za tu kulturu bude rad, na to jak casem castecne ztratila na vyznamu protoze minci a nastroju ma kazdy dost, ja resila kulturu hlavne kvuli mane a to uz pred casem[BR][BR]takze uz jsem protocila ukol 10 daru v kotliku a 10 obruci jsem proste protocila protoze se mi ani jeden ten ukol nehodil i tak tyto tydeni ukoly jsou v cajku a kdyz nesplnim kazdy den varku tech malych taky se tolik nestane, taky prevazne sbiram vojsko[BR]propustka mi prijde nezajimava to uz bych radej koupila ve vodnim eventu za dia tu druhou sadu odmen"}, {"20": "Potřeba kulturní budovy je s otazníkem. Ve městě pořád udržuji kulturu nad 200%, na což mi dávají jako základ hlavně divy. Kulturní budovy co mám, jsou různé eventovky, které mají i nějakou produkci. Až začne kapitola, tak hodně z těchto věcí půjde do skladu. Ale i tak se o kulturní bonus nebojím, důležité věci zůstanou, vylepším je, sem tam hodím kouzlo a bude to v cajku. Tím chci říct, že i když budova v Sezóně je dobrá, tak není pro hru stěžejní."}, {"9": "tak ono se ti vlastne nevylucuje kdyz si odlozis naky ty kulturky 4x4 ktere muzes postradat tak jedna 5x5 cista kulturka to muze v klidu pokryt rozdil kultury treba i za nekolik budov[BR]ja osobne davala pryc ciste kulturky hlavne proto ze jsem je nepotrebovala tak na co je mit"}, {"20": "@Elvinka12 5x5 je jedno rozšíření a to je nejdražší věc ve hře. Pokud ponechám ve městě kulturu, tak jen to, co pro město nutně potřebuji. Na kulturní bonus to bude stačit, kulturu mám výrazně podchycenou divy. Na nic zbytečného nebude místo, protože kvůli úrovni produktivity nebude možné uklízet budovy, které produktivitu zvedají. Město už mám rozpočítané, vyjde to tak akorát."}, {"9": "vim kolik to je, asi nevim co mas v plasnu uklizet beru to spis dle sebe kdybych uklidila nejake ty 4x4 vylepsovane treba 6-7 a nahradila bych je jednou kulturkou 5x5 tak porad jsem s mistem v + a s kulturou akorad, ale porad mam daleko do 21 jeste me deli cela kapitola a kousek a do te doby se to muze jeste zmenit i tak bych asi nedavala pryc kulturky ktere potrebuju na turnaj vez nebo trebas manu pokud bude hodne potreba to jsou detaily co budu resit az bude kapitola za dverma[BR]ale vim ze mam ted v meste i vyrobni kulturky ktere jsou uzitecne ale nejsou nezbytne, ale kdyz mam misto proc je nemit, trebas uz v hudbe budu delat velky poradek protoze i ta je pry na velky prostor tak uvidim"}, {"20": "@Elvinka12 přesně vím, které produkční kulturní budovy ponechám a proč. Dřív jsem taky měla ráda nějakou čistou silnou kulturku, ale kultura díky divům už dávno není pro moje město problém. Vyřešeno. Čistá kulturka už pro mě není výhodná. Podobně i další věci. Díky divům: mana - vyřešeno (+trochu mana kultury ponechám), unurium - vyřešeno, semínka - vyřešeno, orkové - vyřešeno. Samozřejmě mluvím o městě na cz2, tam jsem na konci výzkumu."}]