[{"9": "to mas fajn ja vim jen presne co nechci odstehovat ale je rada budov co muzu ale treba stehovat nebudu a ta kulturka se mi muze hodit pokud ve vysledku bude te kultury prilis malo - proste rezerva[BR]sice bych si mohla delat nejaky planek ale pro me to muze byt za pul roku a to se muze mnoho zmenit v meste takze mit neco v zaloze se pro me hodi ale neni jiste jak to ve vysledku budu mit[BR]nakonec chtela bych mit tvou jistotu ze mam vseho dost asi nakouknu k tobe do mesta co mas[BR][BR]@Ludi  takze jsem se podivala a chapu ze mas vseho dost, preci jen jsi dal o dost i s divama, ale treba i rozdil v poctu obytek muze rozhodnout u me jestli budu resit zvysenou kulturu (nad 170) nebo ne"}, {"20": "@Elvinka12 -  hraju už od roku 2017 a také jsem vždycky hrála dobrý turnaj v silném turnajovém spolku a to je na divech znát."}, {"2": "Já hlavní odměnu na betě i Arendyllu postavím.[BR]Na Winyandoru jsem na konci výzkumu a krom divů mi dávají kulturu budovy které jsem postavil kvůli jiným věcem.[BR]Mana, VB, ulonky, urina a kdo ví co ještě.[BR]Takže na čistou kulturu místo nebude.[BR]Ale velmi mě těší, že v tomhle kole sezóny je hlavní odměna něco zapamatovatelného.[BR]Ta plíva z minula, to byla fakt ostuda."}, {"5": "[IMG]https://i.ibb.co/Pxzmg1Q/https-cz-forum-elvenar-com-index-php-attachments-aukce-png-7006.png[/IMG][BR]+158 100 Kultury navíc, takže i druhou aukci určitě postavím....! [smilie--sprite1]"}, {"21": "To mě nestojí za námahu"}, {"6": "Asi ne. Stačí, že mi lezou na nervy omezenky k boji (stromky a zbrojíř), džin, bohyně, knihovna, stanice a Prátr. Tahle sestava k hlídání mi už stačí.[BR]A to nevím, jestli jsem ještě na něco na ploše nezapomněl."}, {"22": "Stává se někomu, že otevřete hru a máte splněný úkol ze Sezóny? Mě se to občas děje. Ne že bych si stěžovala [smilie--sprite8] Jen mě to zajímá. Nemyslím jako třeba získej kouzlo když přes noc skončí turnaj, to je jasný. Dneska jsem měla třeba hotové Splň úkol události, přitom žádný splněný nebyl. Jednou jsem měla už po ránu z poloviny hotový úkol sklidit 3 hod výrobu, aniž bych na něco klikla"}, {"2": "Úkol události je snadný, nesehrála jsi denních 35bodu?[BR]Ta tříhodinová, to je divný."}, {"9": "ukol spln ukol udalosti se splni vzdycky kdyz vyberte tech 35 jako kazdodeni odmenu, takze vlastne nemusite delat nic - neni to skvele?[BR]ale s tim sklizenim fakt netusim[BR]musim rict ze se s denima ukolama nijak netrapim vetsinou 3-4 splnim jen tim ze hraju"}, {"22": "Denní body nesplní úkol splň úkol události, to už jsem si dvakrát ověřila"}, {"23": "No ono když nesplníš nějaký úkol tak ti tam tuším zůstane do dalšího dne, proto jsi ho třeba měla splněný už z poloviny, protože jsi ho předchozí den nedodělala....."}]