[{"1": "Dear Humans and Elves,[BR][BR]Please use this thread to discuss the update to the Autumn Zodiac Event.[BR][BR]We're looking forward to your feedback![BR][BR]Kind regards,[BR]Your Elvenar Team"}, {"5": "Just saying... this is my FAVE event of the Year!! (Im an Autumnal little soul)  [smilie--sprite8]"}, {"16": "I love the Serpent's \"just woke up bed head\" look [smilie--sprite8]"}, {"17": "You are welcome to check my Event Scroll about important links for the Autumn Zodiac here.  You do not need an account to read the Forums, so enjoy [smilie--sprite1]"}, {"12": "Outstanding artwork! Inspiring even!   [smilie--sprite1] [BR][BR][IMG]https://i.ibb.co/9sBf0J1/https-en-forum-elvenar-com-index-php-attachments-1693303846695-png-7764.png[/IMG]"}, {"16": "\" Donate to Magic Academy (OR) Scout Provinces replaced with Use a Recruit Units Instant.\"[BR]Umm, not sure if this is any better as it depends on having an instant to use which in turn depends on RNG providing you with one.[BR]Unless we're expected to keep a few in stock just in case. (My inventory is starting to look like my garage which is full of \"just in case\" odds and ends)[BR][BR]Back to throwing orcs off the top of the spire for no particular reason [smilie--sprite1]"}, {"4": "SkyRider99 said:\t\t\tOutstanding artwork! Inspiring even!   [smilie--sprite1][BR][BR]View attachment 7764Click to expand...[BR]And perfect for todays Super Blue Moon. [smilie--sprite1]"}, {"8": "I'm hoping someone can help me. I'm a bit confused as to how the 'Tinlug, The Star Serpent' actually works. [BR]When I hover over Stage 1 in the Stage Overview window, the feeding effect shows the duration at 60hrs and is the same through to level 10.[BR]However below that is the 'Bonus CC every 'few' Tourney Ecounters' - the tournament tent has the number 10 next to it at levels 1 and 2 then drops to the number 9 at levels 3 and 4 then drops again to number 8 at levels 5 and 6, it drops again to number 7 at levels 7 and 8 and to number 6 at level 9 and finally to number 5 at level 10.[BR]Does this mean that if you are interested in collecting CCs you are better off to keep this at level 1, but if you want the bonus production you should aim to get it to level 10?"}, {"4": "That is the number of tournament encounters  you have to complete to earn a CC spell, so the higher the level the less tourney required to get the CC spell so you get more, so for example you do 30 encounters, at level 1 you get 3 CC and at level 10 you will get 6 CC."}, {"8": "Thank you @Martin, don't know why that didn't occur to me....lol [smilie--sprite1][BR]Edit - I thought I might get 10CCs (dreaming) at level 1 - but it's late evening, that's my excuse and I'm sticking to it. [smilie--sprite2]"}, {"6": "I posted this originally in the Beta forum (edited here for corrected information)...[BR][BR]60 h (2.5 days) Combining Catalyst / n Tournament Encounters, n from 10 at Stage 1 to 5 for Stage 10.[BR]Stage 10, that's better than 1 CC per completed 6-round Province.[BR]I did 16 Provinces, now am trying for 24. That's 96 to 144 Encounters, 19 to 28 CC.[BR]At 6 hours to produce a CC in the MA, that's 4.75 to 7 days worth of unboosted MA production.[BR][BR]Provided you have a Timewarp or Polar Bear with timing sufficient to complete Tourney in 2.5 days."}, {"12": "Arrggghhhh! Another mouth to feed!  But I couldn't resist getting one for my collection. A nice choice of feeding effects.  [smilie--sprite1][BR][BR][IMG]https://i.ibb.co/HdJtKNN/https-en-forum-elvenar-com-index-php-attachments-1693529560969-png-7776.png[/IMG]"}, {"12": "Jake65 said:\t\t\tMy inventory is starting to look like my garage which is full of \"just in case\" odds and ends\t\tClick to expand...But seriously honey, I can't throw it out. The day will come when I absolutely need that metric thing-a-ma-jig.  [smilie--sprite1][BR][BR][IMG]https://i.ibb.co/MBTn0Y8/https-en-forum-elvenar-com-index-php-attachments-1693571066195-png-7780.png[/IMG]"}, {"7": "Jake65 said:\t\t\tMy inventory is starting to look like my garage which is full of \"just in case\" odds and ends\t\tClick to expand...Honestly, I think everyone's garage looks like that [smilie--sprite8] Isn't that the whole purpose of having a garage/shed/attic/basement? [smilie--sprite2][BR][BR]SkyRider99 said:\t\t\tBut seriously honey, I can't throw it out. The day will come when I absolutely need that metric thing-a-ma-jig.  [smilie--sprite1][BR][BR]View attachment 7780Click to expand...And before you know it, you're buying a bigger house because you need more storage space for all your stuff xD"}, {"18": "The only complaint I have is that Tinlug is too small. Wish it was 4x4 so we could see it better. I know, weird xD"}, {"6": "Conspiracy Theory - Tinlug the 'Star Serpent' is actually a mammal.[BR][BR]4x4 Pets are all birds.[BR]3x3 Pets are all mammals."}, {"14": "[IMG]https://i.ibb.co/H41Z88N/https-en-forum-elvenar-com-index-php-attachments-1693597880435-png-7782.png[/IMG][BR][BR]@Herodite @anonglitch [BR]And here we go again. Forced province encounters in the event again. Something that has been discussed so many times, until Inno changed it, and now they are back at this crap again."}, {"12": "Sir Derf said:\t\t\tConspiracy Theory - Tinlug the 'Star Serpent' is actually a mammal.\t\tClick to expand...Killiak said:\t\t\tthey are back at this crap again.\t\tClick to expand...I definitely know that a carp is not a mammal though.   [smilie--sprite11]"}, {"4": "SkyRider99 said:\t\t\tI definitely know that a carp is not a mammal though.   [smilie--sprite11]Click to expand...[BR]Don't give them idea's next we will have Tuna and Marlin guest races lol, the Fishy Supper, chips on the side, Orc mushed peas. [smilie--sprite7][BR][BR]I Cod have put that Batter but I had a slaty finegar [smilie--sprite12][BR][BR]"}, {"8": "m4rt1n said:\t\t\tDon't give them idea's next we will have Tuna and Marlin guest races lol, the Fishy Supper, chips on the side, Orc mushed peas. [smilie--sprite7]Click to expand...I like it."}]