[{"9": "m4rt1n said:\t\t\tI Cod have put that Batter but I had a slaty finegar [smilie--sprite12]Click to expand..."}, {"8": "I took my Tinlug for a test run in this weeks tourney. He's currently only level 4 but he had a full belly (and a bad hair cut) [smilie--sprite2][BR]He fits in nicely alongside my bear family and their pet witty raccoon and even at level 4 the CCs gained is worth the pet food. [smilie--sprite1][BR]I like this new pet a lot. [smilie--sprite1]"}, {"19": "OldHag said:\t\t\tI like it.\t\tClick to expand...same except the tuna and marlin"}, {"16": "OldHag said:\t\t\tI took my Tinlug for a test run\t\tClick to expand...Me too.[BR]Any pet that looks cool and poops CCs is going to give my Witty Racoon a run for favourite spot [smilie--sprite1][BR][IMG]https://i.ibb.co/CBr2SMC/https-en-forum-elvenar-com-index-php-attachments-screenshot-20230905-212014-3-png-7797.png[/IMG]"}, {"4": "For me I have far more than enough CC already, my shortage is Spell Fragments so another one for the Inventory for the time being, May be brought out just for the FA's."}, {"20": "I feel that to buy 20 kp is already a tall order. Buying 27 kp is ridiculous, especially for smaller cities!"}, {"4": "BlueBlou said:\t\t\tI feel that to buy 20 kp is already a tall order. Buying 27 kp is ridiculous, especially for smaller cities!\t\tClick to expand...[BR]Not if you also use boosted goods, the prices are small and only increase by very small amounts, I have always used the buy kp to progress it is part of the game if used correctly, coin kp goes up in 500 increments as does goods kp so gets very cheap to buy 1000's of it."}, {"20": "m4rt1n said:\t\t\tNot if you also use boosted goods, the prices are small and only increase by very small amounts, I have always used the buy kp to progress it is part of the game if used correctly, coin kp goes up in 500 increments as does goods kp so gets very cheap to buy 1000's of it.\t\tClick to expand...Big difference if you are chapter 21 to chapter 6.  I have always tried to keep my goods numbers equal, so they have been increasing too.  If you have been playing a long time, buying kp is not cheap anymore.  Irrespective of the price of the kp, having to buy 20 kp is ridiculous, having to buy 27 is even more so. This should not even be considered as a task quest and this is my opinion. It should rather be replaced with spend x amount of kp."}, {"16": "OldHag said:\t\t\teven at level 4 the CCs gained is worth the pet food\t\tClick to expand...Quest: \"Gain 10 Combining Catalyst\"[BR]Tinlug: \"Hold my beer\"[BR][smilie--sprite8]"}, {"19": "BlueBlou said:\t\t\tI feel that to buy 20 kp is already a tall order. Buying 27 kp is ridiculous, especially for smaller cities!yye\t\tClick to expand...yeah"}, {"8": "I'm in the Silver League with 250 stars. I need 10 more.  I've got 3 quests and 84.32hrs left with 26 keys.[BR]I'm very nervous."}, {"4": "Got the 9th artefact today and so a fully upgraded evolving building, the leagues are in my opinion to show who spent the most money, I play for free and had a few lucky wins, always going for the most economical chest."}, {"12": "Jake65 said:\t\t\tTinlug: \"Hold my beer\"\t\tClick to expand...[BR][IMG]https://i.ibb.co/LQMNwYj/https-en-forum-elvenar-com-index-php-attachments-1694997313007-png-7835.png[/IMG]"}, {"8": "So today at 12.30pm, I took my Tinlug along to 'Tony the Barber' and got him a pink streak in the front of his hair (level 10) [smilie--sprite1]"}]