[{"1": "Dear Humans and Elves,[BR][BR]Please see the announcement for the Aqua Splendor here and let us know what you think about it![BR][BR]Kind regards,[BR]Your Elvenar Team"}, {"59": "We are fed up with events (with weak rewards) . Where are the chapters?"}, {"16": "Ingame notification banner appeared in 48h... despite client code with 3 days ahead notification. Please, make it scheduled at least 3 days ahead again before next FA."}, {"15": "Karvest said:\t\t\tIngame notification banner appeared in 48h... despite client code with 3 days ahead notification. Please, make it scheduled at least 3 days ahead again before next FA.\t\tClick to expand...Karvest said:\t\t\tIngame notification banner appeared in 48h... despite client code with 3 days ahead notification. Please, make it scheduled at least 3 days ahead again before next FA.\t\tClick to expand...\"In game notification\" What \"in game notification\"? I haven't seen anything in my Beta city. [BR]My most recent notification is for the migration."}, {"30": "@Mrietha - You are right. No information/notification via \"Posthorn\", only the locked lock"}, {"16": "Well, news with event notes usually appear ingame after event start, so I was talking about locked banner with countdown timer."}, {"15": "Brummbaer said:@Mrietha - You are right. No information/notification via \"Posthorn\", only the locked lock\t\tClick to expand...No timer, no lock.[BR]Without the Forum no clue anything is going to happen."}, {"30": "On browser[BR][BR][IMG]https://i.ibb.co/4Ykwzky/https-beta-forum-elvenar-com-index-php-attachments-1687711622944-png-11505.png[/IMG]"}, {"30": "A few moments ago[BR][IMG]https://i.ibb.co/MP10ZPJ/https-beta-forum-elvenar-com-index-php-attachments-1687713119545-png-11506.png[/IMG]"}, {"16": "wrong date in that announcement, btw"}, {"13": "Brummbaer said:\t\t\tA few moments ago\t\tClick to expand...Indeed. In-game bugs weren’t enough…"}, {"5": "With a Monday start, so no tournament, there will not be many people rushing to the lockout on day one."}, {"1": "That was my bad, my internet lagged and didn't apply the changes, it is fixed now. Thank you."}, {"15": "Brummbaer said:\t\t\tOn browser[BR][BR]View attachment 11505Click to expand...Just got Deadeye's announcement![BR]But still no timer on my phone/the app.[BR]Thanks Deadeye."}, {"1": "Sometimes the update for the app is a bit late and the event can start and app not having access to it, I don't know if that will be the case tomorrow but that might happen."}, {"5": "@Deadeye Jerry the lock is there in the android version, so this must be an apple store problem. Or maybe people without the lock need to manually update the app."}, {"113": "The event does not start... I play mobile on Android. No updates available. And i did had a timer..."}, {"28": "Unicorn88 said:\t\t\tThe event does not start... I play mobile on Android. No updates available. And i did had a timer...\t\tClick to expand...same in ios, but has happened before… so have to wait for update i suppose."}, {"8": "Unicorn88 said:\t\t\tThe event does not start... I play mobile on Android. No updates available. And i did had a timer..\t\tClick to expand...[BR]Same here. [BR][BR]So why not bring the update earlier if it is known, that an event will start?"}, {"10": "Also no event. Countdown lock disappeared but not game, only game art on login"}]