[{"114": "No event either. Had an event-clock.[BR]What are this people paid for?"}, {"28": "still nothing in apple store, but a little trickery seemed to… hmmm… do the trick.[BR]i opened my account in pc and completed a cpl of tasks, then opened my account in ios tablet and i can now see the event ending timer, tasks, etc.[BR]now, why would this work i don’t understand but remembered that i had done it before."}, {"114": "Heffernan said:\t\t\tstill nothing in apple store, but a little trickery seemed to… hmmm… do the trick.[BR]i opened my account in pc and completed a cpl of tasks, then opened my account in ios tablet and i can now see the event ending timer, tasks, etc.[BR]now, why would this work i don’t understand but remembered that i had done it before.\t\tClick to expand...That also works on android.[BR]Tried it right before.[BR]Thank you @Heffernan"}, {"115": "Heffernan said:\t\t\tstill nothing in apple store, but a little trickery seemed to… hmmm… do the trick.[BR]i opened my account in pc and completed a cpl of tasks, then opened my account in ios tablet and i can now see the event ending timer, tasks, etc.[BR]now, why would this work i don’t understand but remembered that i had done it before.\t\tClick to expand...Thanks @Heffernan Worked for me on Android too, so I can at least do the tasks, But still unable to open event Windows to spend event currency or see daily price"}, {"16": "That's why it was refusing to start without logging in in browser. App is not yet ready for this event."}, {"116": "I think mission 17, donate to the magic academy, could be a bit more explicit, at least in the information descriptor (which just states the same as the task). The only way I know of completing this task is by donating materials in the chauldron investigation phase, which means we are obliged to drink the sips right on a monday [smilie--sprite3][BR][BR][IMG]https://i.ibb.co/rGt898w/https-beta-forum-elvenar-com-index-php-attachments-1687783937694-png-11508.png[/IMG]"}, {"15": "Heffernan said:\t\t\tstill nothing in apple store, but a little trickery seemed to… hmmm… do the trick.[BR]i opened my account in pc and completed a cpl of tasks, then opened my account in ios tablet and i can now see the event ending timer, tasks, etc.[BR]now, why would this work i don’t understand but remembered that i had done it before.\t\tClick to expand...At 9am Eastern still nothing on Android app. No update available.[BR]As soon as I get my laptop reset up, have been away, I'll try your idea.[BR]But I do have to say, where I was had limited internet. Would be SUPER frustrating if I couldn't get my laptop going."}, {"9": "vircit said:\t\t\tI think mission 17, donate to the magic academy, could be a bit more explicit, at least in the information descriptor (which just states the same as the task). The only way I know of completing this task is by donating materials in the chauldron investigation phase, which means we are obliged to drink the sips right on a monday [smilie--sprite3][BR][BR]View attachment 11508Click to expand...Lol, Inno team in action again.[BR]Good that my main city has lv 32 Tavern, so it can scout twice a week now. Pity for those without Tavern."}, {"15": "Heffernan said:\t\t\tstill nothing in apple store, but a little trickery seemed to… hmmm… do the trick.[BR]i opened my account in pc and completed a cpl of tasks, then opened my account in ios tablet and i can now see the event ending timer, tasks, etc.[BR]now, why would this work i don’t understand but remembered that i had done it before.\t\tClick to expand...Worked for me too![BR][BR]Interesting bit of inconsistencies: On PC - have standard opening picture - but access to new event[BR]                                                     On App - opening picture matches the game - but no event until Heffernan's fix.[BR]Thanks again Heffernan!"}, {"57": "Unfortunately version 1.78 is needed for the event to be fully functional. The current app version is only 1.77. Once version 1.78 is released to the app stores you will be able to play the event fully on the app, but for now, browser is required"}, {"117": "Amy Steele said:\t\t\tUnfortunately version 1.78 is needed for the event to be fully functional. The current app version is only 1.77. Once version 1.78 is released to the app stores you will be able to play the event fully on the app, but for now, browser is required\t\tClick to expand...I've got 1.178 on andriod and still no game for me ;-((. hadthe asset download and no timer but no game either"}, {"2": "vircit said:\t\t\tI think mission 17, donate to the magic academy, could be a bit more explicit, at least in the information descriptor (which just states the same as the task). The only way I know of completing this task is by donating materials in the chauldron investigation phase, which means we are obliged to drink the sips right on a monday [smilie--sprite3][BR][BR]View attachment 11508Click to expand...There needs to be a better option than Scout a Province; what about Use 3 Spell Instants (since the other part is donate 3 times)."}, {"20": "The buying knowledge points requirement seems a bit excessive in my opinion, especially since the cumulative cost increase is not reversable.[BR]#17 Buy 7 Knowledge Points[BR]#20 Buy 7 Knowledge Points (optional)[BR]#36 Buy 14 Knowledge Points[BR]#43 Buy 20 Knowledge Points"}, {"5": "Ergolas77 said:\t\t\tThe buying knowledge points requirement seems a bit excessive in my opinion, especially since the cumulative cost increase is not reversable.[BR]#17 Buy 7 Knowledge Points[BR]#20 Buy 7 Knowledge Points (optional)[BR]#36 Buy 14 Knowledge Points[BR]#43 Buy 20 Knowledge Points\t\tClick to expand...[BR]This may be a problem for little cities, but in chapter 18, I buy KP every day, even without events, to keep my coins from being maxed when I collect from all my buildings each day. I am up to almost 5 million per KP on Beta, and in my US city, I am over 9 million per KP."}, {"15": "Heffernan said:\t\t\tstill nothing in apple store, but a little trickery seemed to… hmmm… do the trick.[BR]i opened my account in pc and completed a cpl of tasks, then opened my account in ios tablet and i can now see the event ending timer, tasks, etc.[BR]now, why would this work i don’t understand but remembered that i had done it before.\t\tClick to expand...New twist: I can see and complete tasks, collect the seahorse food and see the event icon with time and amount of food, but ...[BR]Can't click on the icon to play for prizes.[BR]Android app; version 1.177.1 ... (zzz1.178)"}, {"5": "These quests they are throwing now that require either fighting encounters in provinces or negotiating encounters in provinces, with no other options, have to go. I made it to quest 44 and have this yet again, either fight 4 or negotiate 4. The problem is that I have one province encounter left and my scout will not be done for another 72 hours, so I will not be advancing in the quests for the next three days, unless I burn enough time boosters to get the scout done sooner. One side note, if this event had started on a Tuesday or later, like normal, I would have had the tournament available for the Gain Relics quests and would not have had to burn through my open provinces for those.[BR][BR]@Deadeye Jerry can you please tell the people who wrote these quests that this is very poorly done and needs to be removed? Quests that only accept province encounters for completion should be banned."}, {"28": "Mrietha said:\t\t\tNew twist: I can see and complete tasks, collect the seahorse food and see the event icon with time and amount of food, but ...[BR]Can't click on the icon to play for prizes.[BR]Android app; version 1.177.1 ... (zzz1.178)\t\tClick to expand...yes, it’s a workaround to do the quests but isn’t perfect solution.[BR]as for the version apparently the (zzz1.178) part is just for show, what we need is the first version number to be 178 while it’s still at 177 now. i commented about this sometime last year, didn’t understand why have the zzz version displayed at all when it doesn’t seem to mean anything, it just confuses you thinking that you have the required version but actually you don’t."}, {"8": "Next time they should just start the event later if they could be sure that the update ist released in app store. [BR]It is not the first time that this is happening. [BR]Event start on Monday ist bad as well without tournament until Tuesday evening."}, {"45": "Souliena said:\t\t\tSo why not bring the update earlier if it is known, that an event will start?\t\tClick to expand...Turn it around... don't start an event until it is established (read 'tested') that the updates are available in the app-stores!"}, {"15": "Yes, this is Beta. Bugs, poor play ideas, and inconsistencies should be expected.[BR][BR]BUT! Not having the app up-to-date when the event starts is either poor planning, or poor management with two different \"departments\" (events & updates) are not speaking with each other.[BR]This is at least one day of playing lost for those who only have access to the app. [BR][BR]When I first started playing I had to update the app by hand for an event (thank you Forum for helping me with this way-back-when) but I haven't had to do that for along time. [BR][BR]Very  disappointing!"}]