[{"13": "We could change our point of view.[BR]Q. “Why are you here for… happy game testing?”[BR]A. “Nope, we are testing bugs. And we’re happy, they bug perfectly!”"}, {"118": "Mrietha said:\t\t\tYes, this is Beta. Bugs, poor play ideas, and inconsistencies should be expected.[BR][BR]BUT! Not having the app up-to-date when the event starts is either poor planning, or poor management with two different \"departments\" (events & updates) are not speaking with each other.[BR]This is at least one day of playing lost for those who only have access to the app.[BR][BR]When I first started playing I had to update the app by hand for an event (thank you Forum for helping me with this way-back-when) but I haven't had to do that for along time.[BR][BR]Very  disappointing!\t\tClick to expand...It's more than one day of no event being available considering the app doesn't get new updates until Thursdays. It would seem that inno would like to only test on the broswer version like theydo for rise of cultures."}, {"114": "But that there is no update is no bug. Its an error that Inno made, in starting the event on monday, but the update at thursday, as allways.[BR]I believe someone couldnt imagine that these two things have to start together.[BR]There is non excuse for that fault possible."}, {"49": "\"Dear Humans and Elves,[BR][BR]While we want you all to enjoy, play and preview the newest event on Beta, \"Aqua Splendor\", we have realized it is necessary to have the game version 1.178 of the game to play it on mobile.[BR][BR]This version is not yet available on mobile. You will be able to gradually upgrade to 1.178 from Thursday/Friday. Please consider using our regular web client for the time being. Thanks for your support and patience.[BR][BR]Kind regards,[BR]Your Elvenar Team\"[BR]@Deadeye Jerry Any chance this could be sent to all in-game players, so those who play on mobile (and who don't come to the forum) can be made aware of what is happening?"}, {"1": "Hey, I am creating ingame news right now, thank you for the reminder [smilie--sprite1]"}, {"49": "Thanks!!"}, {"117": "Wonderfully Useless Announcement. Guess what folks, not everyone can use the PC version. I've said it before and I'll say it again - it would be EASY to  COORDINATE with the various APP STORES via PHONE or EMAIL to confirm update is AVAILABLE BEFORE YOU START the EVENT!!!!!"}, {"14": "I'm very sorry, but it seems the same, old story... No blame is intended against beta mods and CM, but... how many headquarters employees have to be fired before left hand knows what right hand is doing? When will this lack of communication (or shallowness in communication) stop? And there are players complaining about players complaints..."}, {"15": "FaunaWillow & Deadeye, thank you for the official announcements. [BR][BR]We must remember we do not Blame the messengers."}, {"3": "PrimroseSylvia said:\t\t\t... how many headquarters employees have to be fired before left hand knows what right hand is doing?\t\tClick to expand...All but one? [smilie--sprite1]"}, {"57": "Mrietha said:\t\t\tWe must remember we do not Blame the messengers.\t\tClick to expand...Indeed, and thank you Mrietha! Folks, I realise feelings are running high about this but please remember your posts in this forum should be polite, constructive, and respectful (both towards other players and the moderation team). Posts that fall outside these guidelines, which are found in our rules, may be subject to deletion"}, {"15": "vircit said:\t\t\tI think mission 17, donate to the magic academy, could be a bit more explicit, at least in the information descriptor (which just states the same as the task). The only way I know of completing this task is by donating materials in the chauldron investigation phase, which means we are obliged to drink the sips right on a monday [smilie--sprite3][BR][BR]View attachment 11508Click to expand...Just got this quest....[BR][BR]Would someone please tell me how to \"Donate to the Magic Academy?\"[BR](Though I do have a Scout out now & they may complete thier mission before I make it to the Academy)[BR][BR]I haven't really figured out how to make this work to my benefit. Or perhaps I am benefiting, but don't know it.[BR]The Cauldren is still very much of a mystery to me.[BR][BR]Thank you ahead of time."}, {"14": "Mrietha said:\t\t\thow to \"Donate to the Magic Academy?\"\t\tClick to expand...You have to push \"donate\" button in Cauldron; in other words, it means that you have to use resources to buy witch points after brewing your potion(s)."}, {"114": "Hurray, one of my season- quests: \"Hopp through ring in Event!\".[BR]How shall I solve that on my mobil?[BR]And still no excuse from Inno."}, {"13": "Hurray 2, I cannot play in app and now[BR][IMG]https://i.ibb.co/9pp19JK/https-beta-forum-elvenar-com-index-php-attachments-immagine-2023-06-28-095806-jpg-11515.jpg[/IMG][BR][BR]Second attempt[BR][IMG]https://i.ibb.co/Phg0Dzj/https-beta-forum-elvenar-com-index-php-attachments-immagine-2023-06-28-100507-jpg-11516.jpg[/IMG]"}, {"57": "Hi @Uffauffa - that looks like the message you get while the game is being updated. This does not usually take long, so you should be able to log in again soon"}, {"8": "filiander said:\t\t\tHurray, one of my season- quests: \"Hopp through ring in Event!\".[BR]How shall I solve that on my mobil?[BR]And still no excuse from Inno.\t\tClick to expand...For problems like this there really should be an option to change one daily quest of the season."}, {"57": "filiander said:\t\t\tHurray, one of my season- quests: \"Hopp through ring in Event!\".[BR]How shall I solve that on my mobil?[BR]And still no excuse from Inno.\t\tClick to expand...Hi @filiander please send a ticket to our support, and we will change the quest for you"}, {"13": "Amy Steele said:\t\t\tHi @Uffauffa - that looks like the message you get while the game is being updated. This does not usually take long, so you should be able to log in again soon\t\tClick to expand...Telling the truth, I was aware about this kind of “problem”, but it went on so much long comparing an usual update, that’s why I reported it."}, {"54": "Just looking at the Grand Prize: Seapectecular Aquatics. The full set looks like it'll take up about a 6x11 space.  That's outrageous, imo. Sets are my least favorite grand prize because they are space hogs and space is limited. If we had unlimited space, this wouldn't be as big of an issue. [BR]Productions: supplies & coins (only needed in early chapters). Orcs, Mana, Divine Seeds, Vallorians, Sentient goods: I'll keep an eye out for those buildings and see how I fare with the RNG for winning prizes.[BR]Most players will end up picking and choosing (out of what they are lucky enough to win), and many will not be able to gain full productions.  I don't understand the rationale behind this.  Unless... it's, once again, bait, to spend diamonds to gain a full set, for which a player may or may not have the space to place.[BR][BR]Atop that: it took me about a dozen hoops to win 1 set building.  With these kinds of horrible odds, it's a discouragement to participate."}]