[{"20": "Is it possible to donate to the magic academy without brewing the potions on the first day of the week? If not, could we make that happen?"}, {"14": "@ZodiBeta you can get set buildings from daily prizes (4 of them), quest milestones (3 of them, in new tome) and (if you're lucky enough) from grand prizes (all 6 are there) and from silver and gold league (respectively 1 and 2 of them)."}, {"118": "Is the display image for the set wrong? There seems to be alot of the small little pieces not shown."}, {"85": "It seems to me that Inno doesn’t like iOS users. Still no event available! How are we supposed to test something which isn’t there? [BR]And the Season quest is just laughing at me “Solve event quests”. Ha. I’d love to, if I had the chance."}, {"57": "Hi @Hazel Caballus please contact our support and we will change that quest for you"}, {"16": "Spoiler: really?Yesterday it was ok.[BR][IMG]https://i.ibb.co/P6GF1nz/https-beta-forum-elvenar-com-index-php-attachments-1688037553536-png-11517.png[/IMG]"}, {"45": "ZodiBeta said:\t\t\tUnless... it's, once again, bait, to spend diamonds to gain a full set, for which a player may or may not have the space to place.\t\tClick to expand...It looks like you have answered your own question.."}, {"57": "Karvest said:Spoiler: really?Yesterday it was ok.[BR]View attachment 11517Click to expand...Thanks @Karvest, we'll get that reported!"}, {"15": "Is it me or is fishfood not dropping as often as the rewards in other events?[BR]I'm playing the garden in my real city - come back after several hours and collect 6 seeds. [BR]Been gone from Beta a few minutes longer and get only 4 Fishfoods. Granted I am on the App (By the way did any one noitice we're up to  version 1.177.1 ... (zzz1.179) ? ) but when I check on my pc no extra fishfood.[BR]It's happened before, but I thought I might have miscounted but now I'm not so sure."}, {"17": "Maybe I'm seeing this wrong, but....the barrier, bootlegger and hypnojelly require 3 connectors to get the full set bonus.  But whatever you put at the corner can only have 2 connectors."}, {"30": "The description say: connection to ONE set building not 3 connections"}, {"21": "Ibison2 said:\t\t\tMaybe I'm seeing this wrong, but....the barrier, bootlegger and hypnojelly require 3 connectors to get the full set bonus. But whatever you put at the corner can only have 2 connectors.\t\tClick to expand...Brummbaer said:\t\t\tThe description say: connection to ONE set building not 3 connections\t\tClick to expand...The describtion @Brummbaer is talking about just describes how every set-building has to be connected to the main hall.[BR][BR]I guess there must be a possibility to get three different kinds of bonus-situations because there are three different amounts dispayed.[BR][BR]Spoiler[IMG]https://i.ibb.co/FgR5Ggr/https-beta-forum-elvenar-com-index-php-attachments-1688073742800-png-11518.png[/IMG][BR]To me, it seems like Winter-Set. You can have the full set-bonus on some of the set buildings but not on all of them. [smilie--sprite2]"}, {"5": "Yeah, it is an odd set and I am not sure how you would get all the connections on the two little 1x1 buildings. It will take some experimenting in elven architect for that. This reminds me of the Moonstone Library set and trying to find all the connections for extras of the small parts."}, {"117": "Funny, I only play on my phone. All of the sudden my version was updated without me hitting the play store. Did INNO finally figure out they could push updates on mobile just like the browser version???  I'm a programmer. I could have told them that years ago. I don't do games. I do software for pharmacy and hospital. If I screw up people my die. If only INNO had the same attitude."}, {"5": "cancermage said:\t\t\tFunny, I only play on my phone. All of the sudden my version was updated without me hitting the play store. Did INNO finally figure out they could push updates on mobile just like the browser version???  I'm a programmer. I could have told them that years ago. I don't do games. I do software for pharmacy and hospital. If I screw up people my die. If only INNO had the same attitude.\t\tClick to expand...[BR]Beta updates are always push updates. Only the Live servers have to download from the different app stores."}, {"114": "cancermage said:\t\t\tFunny, I only play on my phone. All of the sudden my version was updated without me hitting the play store. Did INNO finally figure out they could push updates on mobile just like the browser version???\t\tClick to expand...I tried after reading your post.[BR]I got no update. I can play the event-quests on my mobil, because I started browsergame for a short time, but I cant hopp through the ring. This menu is not available."}, {"8": "I got the update now in Play Store / Android."}, {"117": "Enevhar Aldarion said:\t\t\tBeta updates are always push updates. Only the Live servers have to download from the different app stores.\t\tClick to expand...That's wrong because it's the first time I haven't had to wait for the play store"}, {"28": "cancermage said:\t\t\tThat's wrong because it's the first time I haven't had to wait for the play store\t\tClick to expand...i agree, quite often at the begin of an event game stops loading and directs me to the app store. both android and ios."}, {"15": "Heffernan said:\t\t\ti agree, quite often at the begin of an event game stops loading and directs me to the app store. both android and ios.\t\tClick to expand...Me too! [BR]I had to \"manually\" update this morning. Which is usual in Beta for me."}]