[{"5": "cancermage said:\t\t\tThat's wrong because it's the first time I haven't had to wait for the play store\t\tClick to expand...[BR]No, I have never had to go to the Play Store for a Beta update, only for the Live update."}, {"15": "Enevhar Aldarion said:\t\t\tNo, I have never had to go to the Play Store for a Beta update, only for the Live update.\t\tClick to expand...Not only did I have to update this morning, but when I got on around 3 Eastern I was asked/told that I needed to update. Two updates in one day?[BR][BR]And I should have said earlier that I need to update for an Event in Beta, but not for updates during other times."}, {"5": "Mrietha said:\t\t\tNot only did I have to update this morning, but when I got on around 3 Eastern I was asked/told that I needed to update. Two updates in one day?[BR][BR]And I should have said earlier that I need to update for an Event in Beta, but not for updates during other times.\t\tClick to expand...[BR]Yeah, that is weird. Maybe it has to do with your country's version of the Play Store? I am in the US."}, {"28": "i was buying the ”usually starts thursdays, now it started monday” line to explain the lateness for apps. but now it seems that even if it had started thurdays ios users would have been left behind.[BR]i’ve been thinking that inno is steering it’s games towards mobile market, but still something like this…[BR][BR]sure i had a workaround to play the quests, i have access to laptop, and android tablet. but having played my second account through these years in ipad now have resort to such workarounds… disappointed [smilie--sprite3]"}, {"15": "Enevhar Aldarion said:\t\t\tYeah, that is weird. Maybe it has to do with your country's version of the Play Store? I am in the US.\t\tClick to expand...I'm in the US too. [BR]Lots of little odd stuff and big issues this time."}, {"40": "Hi, the full set bonus. [smilie--sprite2][BR][BR][IMG]https://i.ibb.co/TBS5nvd/https-i-imgur-com-p2-E0bkd-png.png[/IMG][BR][BR]1. Skyfin Rodeo - 1 pcs.[BR]2. Windchasers Finale - 1 pcs.[BR]3. Sirens' Ballet - 1 pcs.[BR]4. Wavecrest Barrier - 2 pcs.[BR]5. Hypnojelly - 2 pcs.[BR]6. Bootleggers - 2 pcs."}, {"5": "The randomness of winning back bonus currency in these events can be so crazy sometimes. Earlier tonight, after collecting the free daily 35, I had just enough seahorse food to get to 260 points and get the final set building. I figured, with 3 quests and free dailies left, I would get maybe another 10 points and stay in Silver. Then the crazy randomness happened. After completing tonight's quest I did the 73-cost hoop and won 180 food. Then I won 180 two more times and 200 once. So I went from just getting to 260, to now at 293 and solidly in Gold, with still two more quests to complete. I do not normally get this kind of crazy luck in these events, but I will take it.   lol"}, {"104": "nearly over  [smilie--sprite2] ... it may be too difficult/too late/etc to change B4 the event goes to live servers but an annoyance...there are various text references to the spectacular aquatic event but the title banners that are a play-on-words of that description are misspelt - Seapectecular Aquatics -should be Seapectacular"}, {"28": "no random luck for me. finished questline early (despite app start hickup), logged in 3 times a day all event picking up event currency around the city. last day used about 2300 event currency, won extra currency a cpl of times.[BR]and ended in iron league last peace full 20 point round away. thinking back even at the beginning when app version were not available i logged in pc version to get the around the city currency. can’t think what i could have done different.[BR]not the first time i’ve missed the last piece, it seems to be the norm.[BR][BR]this time though, beta or not, the app start mess left me bitter and the end result didn’t improve my mood.[BR]as far as i’m concerned this event is sleeping with the fishes, won’t touch it in live worlds."}, {"74": "Heffernan said:\t\t\tcan’t think what i could have done different.\t\tClick to expand...Probably you should have chosen the rings differently. The rings are quite different: some are good for daily prizes, other are good to reach 260 and good placement in leagues. You should choose what you want and stick to it. You cannot have both [smilie--sprite6] [BR]BTW, INNO want you to spend real money in the events [smilie--sprite6]"}, {"5": "I ended at 307, exactly what was needed for Gold, with just good luck and no diamonds or money spent. I picked almost all 73 and 77 and, with a few exceptions, only picked the smaller ones when I was at 18 of 20 and had to."}]