[{"36": "Liebe Menschen und Elfen,[BR][BR]gerne wollen wir eure Meinungen zum neuen Kapitel \"Händler von Unur\" hören![BR][BR]Bitte verwendet wieder folgende Maske für euer Feedback:[BR][BR]Feedback zum Kapitel \"Händler von Unur\"[BR][BR]Was mir gefällt:[BR]Thema + BegründungThema + Begründung..Was mir nicht gefällt:[BR]Thema + BegründungThema + Begründung..Fazit: Euer Fazit[BR][BR]Viele Grüße[BR]Euer Elvenar Team"}, {"217": "Ha, da nun ein Strang eröffnet ist, mal ne Frage:[BR]Weiß irgendjemand bereits, welche Anzahl an Schiffen (klein, groß) in den Quests gefordert wird?"}, {"50": "Aufgabe 34. Besitze mindestens 1 Grosses Piratenschiff, 1 Grosses Gourmetschiff und 1 Grosses Sammlerschiff[BR]Aufgabe 44. Beschwöre alle kleinen Piraten-, Gourmet-, und Sammlerschiffe (hier noch keine konkrete Stückzahl gefordert), die man aufgestellt hat[BR]Aufgabe 55. Beschwöre mindestens 5 kleine Sammlerschiffe[BR]Aufgabe 61. Verkaufe mindestens 3 kleine Sammlerschiffe und Beschwöre 6 kleine Gourmetschiffe[BR]Aufgabe 68. Verkaufe mindestens 3 kleine Gourmetschiffe und Beschwöre 6 kleine Piratenschiffe[BR][BR]Es können generell je Art der Grossen Schiffe nur 3 Stück gebaut werden und von den kleinen Schiffen beliebig viele (begrenzt durch Platz und mögliche Verlinkung mit den grossen Pendants).[BR]Lt. mir vorliegender Story-Quest (siehe oben entsprechende Auszüge aus der Questreihe) sollten von jeder Art je 1 grosses Schiff und 5 kleine Sammlerschiffe (wahrscheinlich sind 6 sinnvoll) und von den beiden anderen je 6 Stück aufgestellt werden.[BR][BR]Für die Richtigkeit der Aufgabenstellung übernehme ich keine Garantie und Abweichungen von Beta zu Live sind immer möglich."}, {"218": "was ich persönlich überhaupt nicht schätze, sind Überschneidungen Event und Gastrasse"}, {"88": "das ist doch eigentlich kein Problem, es wurden in diesem Event so wenige spezielle Produktionen aus Werken oder Manus gefordert, damit sollte eigentlich schon jeder durch sein, dh man braucht keine kleinen Manus oder Werke die die Prodis fertig haben, also Brote, oder 3 und 9 h Prodis in den Manus, den diese Quests waren nur am Anfang des Events, man kann also problemlos mit der Gastrasse anfangen"}, {"81": "Questor Thews schrieb:\t\t\tdas ist doch eigentlich kein Problem, es wurden in diesem Event so wenige spezielle Produktionen aus Werken oder Manus gefordert, damit sollte eigentlich schon jeder durch sein, dh man braucht keine kleinen Manus oder Werke die die Prodis fertig haben, also Brote, oder 3 und 9 h Prodis in den Manus, den diese Quests waren nur am Anfang des Events, man kann also problemlos mit der Gastrasse anfangen\t\tZum Vergrößern anklicken....[BR]Er hat auch nichts von einem Problem geschrieben nur von einer persönlichen Präferenz.[BR][BR]Die Freigabe des neuen Kapitels wär nach dem kommen GA ein besserer Zeitpunkt gewesen."}, {"217": "Sardukar schrieb:\t\t\tDie Freigabe des neuen Kapitels wär nach dem kommen GA ein besserer Zeitpunkt gewesen.\t\tZum Vergrößern anklicken....Das seh ich anders, so hab ich die Chance, den Halloween Event-Preis bereits unter der neuen Rasse einzufordern.[BR]Zudem hab ich bis zum GA vermutlich eh nur den Handelsplatz zu bauen, ich gehör nicht zu denen, die regelmäßig WPs kaufen.[BR]Außerdem überleg ich, die Großen Schiffe nach quest 34 durch kleine zu ersetzen - mein verfügbarer Platz ist nicht gerade üppig."}, {"57": "gibts wo die Quests dazu?"}, {"219": "Ich würde ja meine Ersatz-Kristallkugel darauf verwetten, daß, sobald die Unur angekommen sind, es so einigen Spielern[BR]siedendheiss bewusst wird, daß sie doch die beiden antiken Wunder der Botschafter hätten erforschen sollen.  [smilie--sprite6]"}, {"25": "Wann geht es denn nun los ?"}, {"21": "Primus71 schrieb:\t\t\tIch würde ja meine Ersatz-Kristallkugel darauf verwetten, daß, sobald die Unur angekommen sind, es so einigen Spielern[BR]siedendheiss bewusst wird, daß sie doch die beiden antiken Wunder der Botschafter hätten erforschen sollen.  [smilie--sprite6]Zum Vergrößern anklicken....[BR]Nein, der Forschungsbaum geht auch ohne Wunder weiter[smilie--sprite7] zumindest auf dem beta^^[BR][BR]"}, {"6": "Sardukar schrieb:\t\t\tDie Freigabe des neuen Kapitels wär nach dem kommen GA ein besserer Zeitpunkt gewesen.\t\tZum Vergrößern anklicken....Und welchen Sinn sollte das machen?[BR]Nach dem nächsten GA folgt das nächste Event, folgt das nächste GA, folgt ....[BR]Innerhalb von 4 oder 5 Wochen wird wohl niemand die nächste Gastrasse durch haben."}, {"219": "Indianaking schrieb:\t\t\tNein, der Forschungsbaum geht auch ohne Wunder weiter[smilie--sprite7] zumindest auf dem beta^^[BR][BR]Anhang 21808 ansehenZum Vergrößern anklicken....[BR]na gut, danke [smilie--sprite1])[BR]aber sehe ich das richtig ?  nur 480 verlangte Provinzen ?"}, {"21": "Primus71 schrieb:\t\t\tna gut, danke [smilie--sprite1])[BR]aber sehe ich das richtig ?  nur 480 verlangte Provinzen ?\t\tZum Vergrößern anklicken....[BR]Jo, bei den Botschaften waren es 440."}, {"29": "Jetzt sind sie da!"}, {"219": "irgendwie kann ich die alten Quests nicht ablehnen, ist das gewollt?"}, {"21": "nicki19782 schrieb:\t\t\tirgendwie kann ich die alten Quests nicht ablehnen, ist das gewollt?\t\tZum Vergrößern anklicken....Erste Forschung fertig ?"}, {"219": "Lange her .. .. .. ... doch trotzdem Danke sehr  [smilie--sprite7][BR][BR][IMG]https://i.ibb.co/fSkktqr/https-de-forum-elvenar-com-index-php-attachments-1603978006774-png-21810.png[/IMG]"}, {"50": "Die ersten Aufgaben der Story-Quest-Reihe der Händler von Unur lauten:[BR]01. Kaufe 5 WP[BR]02. Verwende 10 Segen (z.B. WP-Segen, Münz-Segen, Vorrats-Segen)[BR]03. Sammel 20 Relikte[BR]04. Erkunde eine Provinz[BR][BR]Tja und nun heisst es auf den Kundschafter warten.  Aber dafür baue ich gleich meinen Marktplatz aus und dann wird fleissig  UNURIUM  gesammelt."}, {"220": "Danach kommt noch was mit 10x3h Werkzeug und dann sammle 500k Mana - sofern ich gerade nichts vergessen habe.[BR][BR]Edit: Aber ne Questliste hab ich bisher auch nicht gesehen? Oder hab ichs übersehen ^^"}]