[{"90": "Du kannst wenn dir egal ist wie lange du für das Kap. brauchst alle Güter mit den Flaggschiffen Prodden. Brauchst dann zwar Jahre fürs Kap aber wenns dir egal ist bitte."}, {"221": "An die Entwickler von @InnoGames[BR]ich hab die schn... so gestrichen voll das ich mich nun doch durchgerungen habe mein halbes dorf einzumotten und unmengen von den kleinen schiffen zu bauen. das ist das letzte mal leute. noch so ne nummer mach ich nicht mehr mit. wenn ihr uns spieler an euer spiel fesseln wollt dann bitte nicht auf so ne abartige art und weise. ein spiel soll spaß machen und nicht zur qual werden. Klo putzen macht mehr spass!!![BR]wenn das alles ist was euch einfällt um spieler im spiel zu halten tuts mir leid, aber dann solltet ihr euch nen anderen job suchen! sowas geht echt gar nicht. ne absolute frechheit uns sowas zuzumuten. und sorry aber freundlicher kann man dies selbst zur weihnachtszeit nicht formulieren."}, {"6": "Wie @A S L A N bereits angemerkt hatte: mit ausreichend vielen kleinen Schiffen (für den Anfang 15/15/15) kriegt man die Gastrassengüter in 8 Wochen zusammen. Die letzten 5 Wochen fühlt man sich dabei allerdings wie bei einem Dauer-Gemeinschaftsabenteuer.  [smilie--sprite8]"}, {"221": "Tobias1 schrieb:\t\t\tDu kannst wenn dir egal ist wie lange du für das Kap. brauchst alle Güter mit den Flaggschiffen Prodden. Brauchst dann zwar Jahre fürs Kap aber wenns dir egal ist bitte.\t\tZum Vergrößern anklicken....ja es ist ihm egal geworden und ich kann das auch sehr gut nachvollziehen. er spielt woanders. kluge entscheidung wenn du mich fragst. ich muss ne vollmeise haben mich überhaupt nochmal drauf einzulassen. ich suche keine beschäftigungstherapie für idioten sondern spass im spiel. ich denke nica gehts da genauso![BR][BR]und bevor es jemand hier in den falschen hals kriegt, ich wollte hier niemanden als idioten bezeichnen. ganz und gar nicht. nur das was man uns zumutet ist einfach nicht anders zu beschreiben. ein hirnloser stupider mist [BR]ich habe fertig!"}, {"219": "Weil hier drin die Wahrheit steckt .. .. bzw. die Äußerungen von Spielern sind, welche dies bereits gespielt haben und wirklich rein genervt waren.[BR]Spielen sieht meiner Meinung nach anders aus und Verständnis für so manche Aussagen und Handlungen seitens des Unternehmens habe ich hierfür persönlich nicht![BR][BR]\t\t\thttps://de.forum.elvenar.com/index.php?threads/h%C3%A4ndler-von-unur.20252/post-312778\t\t[BR]\t\t\thttps://de.forum.elvenar.com/index.php?threads/h%C3%A4ndler-von-unur.20252/post-313507\t\t[BR]HerrderWelten schrieb:\t\t\toder siehe Luna, die in einer Woche durch war.\t\tZum Vergrößern anklicken....Schuster bleib bei deinen Leisten, sie benötigte exakt 4 Wochen und wenn man dir nun sagt was da Dias geflossen sind, wäre das ein AUS-Kriterium für viele und das muss man auch nicht (Dias ausgeben). Sie jedoch macht es so und das ist auch völlig in Ordnung und ok. Wer kann der kann und wer mag, der mag. Aber bitte nicht übertreiben oder aus mehr weniger machen.[BR]Ein reiner Payer ist auch kein Vergleich, denn diese interessiert weder die Storyline noch sonst was. Einfach weg und fertig.[BR][BR]Aber ich spielte ohne den Einsatz von Diamanten und war mehr als genervt, obwohl die Idee dieser Gast-Rasse gut ist und sich auch die Storyline im Verhältnis zu den letzten Kapiteln, doch sehr angenehm liest.[BR]Lediglich investierte ich ein paar Turm- und Dschinn-Dias beim beschleunigen der Produktionen bei den großen Schiffen.[BR]Klar kommen mir nun auch die Mehr-Erweiterungen entgegen und ja auch kam mir sicherlich die weit über 100 Teleporter entgegen, doch hat dies jeder Spieler, spielt jeder Spieler den Turm Woche für Woche bis rauf? Muss man das denn? Nein, denn bei INNO heißt es doch immer, alles kann, nichts muss. Doch hier genau hier merkst du, wenn du eben nicht hier und da mitmachst, bleibst du enorm auf der Strecke.[BR]Auch ist es sicherlich nicht der Sinn in 8 Wochen wie in meinem Fall durch eine Gast-Rasse zu flitzen, doch ich spiele gern anbindend, soll heißen; ohne das ich das eine bereits Wochen voll habe, aber das andere noch XXX Wochen sammeln muss. Macht für \"mich\" keinen Sinn. Genauso Sinnlos ist der \"extreme\" Leerlauf der kleinen Schiffe oder das sammeln gewisser Mengen, die dann unnötiger Überschuss sind (spielt man die Storyline).[BR][BR]Ich kann nur für alle Nachkommen hoffen, dass hier A.) noch an das arbeitende sowie schlafende Volk gedacht wird und B.) das man diese enormen Summen angleicht an ein bisschen, nennen wir es, normalen Spielverlauf.[BR]3 und mehr Monate für ein Kapitel halte \"ich\" für ein Online-Spiel viel zulange, dies erzeugt lange weile, Frust und sorgt eher dafür, dass man Ausschau nach was neuem hält. Denn was der Spieler möchte nennt sich spielen und nicht warten. Zumindest so spielen, wo man einen Fortschritt sieht und den nicht erst nach Monaten.[BR][BR]Edit: [BR]Man senkt auf dem Beta die WPs in der Forschung für die ersten Kapitel, damit sie (Spieler) eben schneller voran kommen, doch für was? Dass sie dann gegen irgendeine Mauer im hinteren Teil des Spiels rennen und sich dann Fragen, \"Hä was dass denn, wo soll ich die Mengen her haben und wieso dauert alles auf einmal so lange\"."}, {"2": "ustoni schrieb:\t\t\tWie @A S L A N bereits angemerkt hatte: mit ausreichend vielen kleinen Schiffen (für den Anfang 15/15/15) kriegt man die Gastrassengüter in 8 Wochen zusammen. Die letzten 5 Wochen fühlt man sich dabei allerdings wie bei einem Dauer-Gemeinschaftsabenteuer.  [smilie--sprite8]Zum Vergrößern anklicken....haha - nur bräuchte ich alleine 6 Wochen, nur um das Unurium für diese 45 kleinen Schiffchen zusammen zu bekommen [smilie--sprite7] - nö - da mach ich lieber weiterhin laaaaaaaaangsam - die 3 Flagg- und 3 großen Schiffe, die bis dato rumstehen und vor sich hin prodden, stören mich im Moment nicht sonderlich, vielleicht mag ich ja nächstes (Früh-)jahr mehr aufstellen [smilie--sprite2]...."}, {"219": "Oder man baut eben auch Gebäude die im Spiel vorgesehen sind zu bauen und verzichtet hier auf die stets mehr und mehr werdenden Event-Gebäude, die im hinteren Teil (ab Kapitel 16) so oder so nur noch wenig bis gar keinen nutzen haben. Denn diese Gebäude, die man bauen sollte, geben dir genau das was du eben brauchst. ^^ Aber es soll durchaus Spieler geben, die mögen das und auch das ist völlig ok, jedoch dürfen sie dann auch nicht jammern, wenn es eben zu lang dauert. [smilie--sprite7][BR](Nein ich sehe das bei dir nicht als jammern, aber wollte es für andere loswerden.)[BR][BR]Mit dem Unrium haben denke ich, die wenigsten Probleme."}, {"2": "...ich jammere ja auch nicht ^^, der Unurium-Mangel ist mein eigenes \"Verschulden\" und nicht soooo schlimm, als daß ich an meiner Spielweise irgendwas ändern wollen würde - und deshalb sch.... drauf, dann dauert es halt länger - ist jedenfalls kein Sich-drüber-ärgern wert....[BR][BR](und künftig wird es gaaaaaanz bestimmt auch Event-Gebäude geben, die Unurium abgeben  [smilie--sprite7] )"}, {"219": "Romilly schrieb:\t\t\t(und künftig wird es gaaaaaanz bestimmt auch Event-Gebäude geben, die Unurium abgeben [smilie--sprite7] )\t\tZum Vergrößern anklicken....Ganz sicher wird es das und noch viel, viel mehr,  [smilie--sprite7] doch ich spiele jetzt und nicht in der Zukunft. ^^ [BR]OT beendet und raus ...."}, {"2": "A S L A N schrieb:\t\t\tGanz sicher wird es das und noch viel, viel mehr, [smilie--sprite7] doch ich spiele jetzt und nicht in der Zukunft. ^^\t\tZum Vergrößern anklicken....naja - Unurium (wer ist eigentlich auf den blöden Namen gekommen - mein Hirn will da immer Urinium draus machen - pfui pfui) wird man sicherlich auch noch in Kapitel 18+ brauchen...."}, {"21": "Romilly schrieb:\t\t\tnaja - Unurium (wer ist eigentlich auf den blöden Namen gekommen - mein Hirn will da immer Urinium draus machen - pfui pfui) wird man sicherlich auch noch in Kapitel 18+ brauchen....\t\tZum Vergrößern anklicken....[BR]Nachdem das Land Unur heißt ist das eigentlich naheliegend ....."}, {"2": "Indianaking schrieb:\t\t\tNachdem das Land Unur heißt ist das eigentlich naheliegend .....\t\tZum Vergrößern anklicken....ja - das ist mir schon klar - aber dieses Wort ist mir einfach unsympathisch - es fängt ja schon mal mit UN an - das assoziiert schon mal nix Gutes - und dann sind da zu viele Bögen drin, die ich in der derzeitigen Schreibschrift (als meine Kinder so schreiben mussten) immer ganz schlecht auseinanderhalten konnte - (u n r m [IMG]https://i.ibb.co/TLWfpJ4/https-de-forum-elvenar-com-index-php-attachments-unur3-png-22646.png[/IMG]) - und es erinnert von den Buchstaben her an Urin (und dann ist es auch noch optisch gelb und rund) - also 3x eine negative Verknüpfung - rein psychologisch wäre so etwas z.B. für einen Produktnamen total ungeeignet - würd ich nicht kaufen..."}, {"65": "@ Tobias1:[BR]Deine Zitate verwundern mich sehr,[BR]eher ohne Sinn oder iwi Ego.[BR][BR]1.) Wenn du die gastrassen güter zusammen hast, lagere doch einfach die Schiffe kurz ein, damit du wieder Wohngeb. aufbaust so das du wieder ein Bev + hast um dein Haupgeb auszubauen. ist es ausgebaut , hohl deine schiffe wieder raus und prode weiter.[BR][BR]Antwort: Ich haue doch nicht dauernd Teleporter rein für eine GR???[BR]Ist sehr überheblich, weil nicht alle Gefährten immer Teleporter machen können.[BR](Zählt nicht so für mich, aber für andere GM)[BR][BR]2.) Diese ausage ist falsch, du hast wenn man immer von jedem Schiff die selbe menge stehen hatt, ein Gewinn an Gütern. Bist du aktive und machst die kurzen Prod. dann hast du am ende des Tages halt mehr güter als wenn du nur immer die langen Prod. laufen lässt.[BR][BR]Antwort: Das ist ganz falsch. Es gibt in meiner GM viele Gefährten,[BR]die arbeiten teilw. auch im Gesundheitssystem[BR]und die können nicht die App. so auf 15 Minuten schalten.[BR](Auch ich habe ein RL und finde dein Schreiben sehr fragwürdig,[BR]was ist AKTIV? -Meine Gefährten sind die Besten!)[BR][BR]3.) Du kannst wenn dir egal ist wie lange du für das Kap. brauchst alle Güter mit den Flaggschiffen Prodden. Brauchst dann zwar Jahre fürs Kap aber wenns dir egal ist bitte.[BR][BR]Antwort: Du hast keine Ahnung was du schreibst [smilie--sprite1][BR][BR]Schöne Feiertage allen, MasterLu"}, {"221": "@MasterLu die schiffe kann man gar nicht einlagern, noch so ein geniestreich von inno [smilie--sprite2]"}, {"6": "Tanysha schrieb:\t\t\tdie schiffe kann man gar nicht einlagern, noch so ein geniestreich von inno [smilie--sprite2]Zum Vergrößern anklicken....Das gilt nur für die großen und mittleren Schiffe. Die kleinen Schiffe können eingelagert werden."}, {"90": "MasterLu schrieb:\t\t\t@ Tobias1:[BR]Deine Zitate verwundern mich sehr,[BR]eher ohne Sinn oder iwi Ego.[BR][BR]1.) Wenn du die gastrassen güter zusammen hast, lagere doch einfach die Schiffe kurz ein, damit du wieder Wohngeb. aufbaust so das du wieder ein Bev + hast um dein Haupgeb auszubauen. ist es ausgebaut , hohl deine schiffe wieder raus und prode weiter.[BR][BR]Antwort: Ich haue doch nicht dauernd Teleporter rein für eine GR???[BR]Ist sehr überheblich, weil nicht alle Gefährten immer Teleporter machen können.[BR](Zählt nicht so für mich, aber für andere GM)[BR][BR]2.) Diese ausage ist falsch, du hast wenn man immer von jedem Schiff die selbe menge stehen hatt, ein Gewinn an Gütern. Bist du aktive und machst die kurzen Prod. dann hast du am ende des Tages halt mehr güter als wenn du nur immer die langen Prod. laufen lässt.[BR][BR]Antwort: Das ist ganz falsch. Es gibt in meiner GM viele Gefährten,[BR]die arbeiten teilw. auch im Gesundheitssystem[BR]und die können nicht die App. so auf 15 Minuten schalten.[BR](Auch ich habe ein RL und finde dein Schreiben sehr fragwürdig,[BR]was ist AKTIV? -Meine Gefährten sind die Besten!)[BR][BR]3.) Du kannst wenn dir egal ist wie lange du für das Kap. brauchst alle Güter mit den Flaggschiffen Prodden. Brauchst dann zwar Jahre fürs Kap aber wenns dir egal ist bitte.[BR][BR]Antwort: Du hast keine Ahnung was du schreibst [smilie--sprite1][BR][BR]Schöne Feiertage allen, MasterLu[BR][Zu 1 Teleporter wer sie nicht nutzen will, oder hatt, der muss halt alle erst alle Güter auf lager haben, und die Schiffe dann abreißen, oder wenn man nicht warten kann halt dias ausgeben, das bleibt jedem selbst überlassen.[BR]zu 2. Für inno bist du aktive wenn du dauernd im Spiel bist um die 15 min Produktionen zu machen, wenn man sie nicht machen kann/will muß man halt die längeren Prod. machen ink dem leerlauf.[BR]zu 3 die aussage ist richtig die ganze gastrasse ist machbar zu beenden nur durch die Flagschiffproduktionen, dauert halt ewig.\t\tZum Vergrößern anklicken...."}, {"221": "ustoni schrieb:\t\t\tDas gilt nur für die großen und mittleren Schiffe. Die kleinen Schiffe können eingelagert werden.\t\tZum Vergrößern anklicken....super da müsste ich ja ne vollmacke haben wenn ich die die ganzen kleinen schiffe noch wieder alle einlagere jetzt. ich mache die rotzigen quests sowieso nicht. ich will den müll einfach nur schnellstmöglichst loswerden. die anforderungen sind derart geisteskrank das geht auf keine kuhhaut [smilie--sprite4][BR]ich hab jetzt sämtliche rüssis eingemottet und wenn das nicht bald fertig ist dann motte ich den rest der stadt auch noch ein. hauptsache ich werde diesen ekelhaften müll endlich los!!!!"}, {"21": "Tanysha schrieb:\t\t\tsuper da müsste ich ja ne vollmacke haben wenn ich die die ganzen kleinen schiffe noch wieder alle einlagere jetzt. ich mache die rotzigen quests sowieso nicht. ich will den müll einfach nur schnellstmöglichst loswerden. die anforderungen sind derart geisteskrank das geht auf keine kuhhaut [smilie--sprite4][BR]ich hab jetzt sämtliche rüssis eingemottet und wenn das nicht bald fertig ist dann motte ich den rest der stadt auch noch ein. hauptsache ich werde diesen ekelhaften müll endlich los!!!!\t\tZum Vergrößern anklicken....[BR]Naja ....Vollmacke ist relativ. Als ich hauptsächlich die Riesenmenge an Leckerein gebraucht habe kam ein Großteil der Piraten und Sammler ins Lager, nur die dafür benötigten Fütterschiffe blieben plus weitere kleine Gourmets. Als alle Leckereien komplett fertig waren kamen die Sammler wieder raus und zusätzlich um ein paar erweitert, und die Gourmets wurden bis auf die Fütterschiffe verkauft. Nachdem die Artefakte komplett fertig waren kamen letztendlich alle Piraten + erweitert auf 34 Stück + Fütterschiffe = fertig mit Kap 17 in 9 Wochen ohne Dias, lediglich mit ein paar Zeitboostern beim Aufbau zusätzlicher kleiner Schiffe. Ich habe nicht im 15 Min Takt gesammelt, ausser ich war mal länger on (WE, abends) Ansonsten 1 Std, hauptsächlich aber 3 Std Rythmus.[BR]Es war ja von Anfang an abzusehen daß es ohne jede Menge Schiffe elend lange dauern wird, deshalb hab ich in den sauren Apfel gebissen und gleich ganz früh ein gutes Viertel der Stadt eingelagert um tatsächlich einige Dutzend Schiffe stellen zu können. Questline spiele ich ohnehin nicht, also besser Stadt einfrieren und schnell durch.... und ich bin heilfroh daß ich es so gemacht habe. Ich konnte keine Schiffe mehr sehen .....[smilie--sprite12]"}, {"221": "ich hab zum glück ein großes gelände. muss den kleinramsch nicht einmotten. so viele teleporter hätte ich jetzt auch gar nicht mehr übrig.. ich hab für die ollen ga schon so viel verbraucht..[BR]irgendwie nervt mich das alles auch nur noch.. ich spiele eigentlich lange woanders.. aber ich hab halt ne tolle gemeinschaft.. und bevor ich ganz aufhöre schaff ich mir den ramsch halt jetzt nochmal vom hals und bau meine restlichen brunnen und die biblios wieder auf.. noch so ne rasse mache ich auch nicht mehr mit. bin doch nit bekloppt. da müsste ich schon geld für bekommen.. viel geld damit ich mir das nochmal antue. da ist ja nix aber auch wirklich gar nix dabei was spass macht oder hirnzellen abverlangt. einfach nur dummes vor sich hinsammeln und mengen die jeglicher beschreibung spotten gemessen am ertrag. und ich hab schon ne menge schiffe jetzt da stehen [smilie--sprite2]"}, {"217": "Naja, prinzipiell dreht es sich bei den Gastrassen doch immer darum, diese Gebäude aufzustellen und abzuernten, nur die Positionierung ist mal weniger oder mehr anspruchsvoll. Bei dieser ist halt das Abernten extrem stark im Vordergrund (das finden viele nervig). Und nachdem ich während meiner Anwesenheit mich nicht monatelang damit rumschlagen will, im Stundentakt zu ernten, hab ich's nun anderen nachgemacht und fast alle normalen Manufakturen und die Hälfte der Wohnhäuser eingelagert.[BR]Der Bedarf an Samen und Mana ist scharf an meiner Grenze des Machbaren um nicht Zeitverzögerungen zu erleiden; zium Glück hab ich bei früheren Events genug Gebäude dafür erworben.[BR]Was ich aber definitiv beanstande: es gab schon wieder keinen Kundschafter. Soll der Preis für neue Provinzen ins Unermessliche gesteigert werden (nach dem Motto: ein Kampf soll x Tagesproduktionen kosten) ? Schließlich wird bei jeder Gastrasse eine steigende Mindestzahl an eroberten Provinzen gefordert.[BR]Jetzt kommt eh die kalte Zeit, da kann ich in meiner Höhle ja \"Winterschlaf\" halten, und ich hoffe, daß ich's im März dann hinter mir habe.[smilie--sprite6]"}]