[{"6": "Wenn man den Forschungsbaum erledigt hat, gehts weiter:[BR]Für den Ausbau von 4 Magiestaubmanufakturen, 2 Elixiermanufakturen sowie den letzten Ausbau des HG werden 14400k Mana benötigt.[BR]Ist ja auch so nebenbei mal schnell erledigt. [smilie--sprite11][BR][BR]Ausgezeichnet geplante Gastrasse. [smilie--sprite4]"}, {"56": "Ich habe mir die Forschung und die Vorgaben der \"Händler von Unur\" gründlich angesehen (bin zwar noch bei \"Die Elvenar\"), aber das total \"sinnbefreite Sammeln\" setzt sich nun auch in Kapitel XVII fort (wie bereits in XV und XVI). Ich hatte so gehofft, dass das neue Kapitel mich erfreut (dann hätte ich auch die kitschigen Feen in \"Botschaften\" ertragen). Leider nein, denn wieder ist endloses sinnloses Sammeln angesagt![BR][BR]Den Begriff \"Spielhürde\" verstehe ich als geistige Anforderung. Langweiliges, langwieriges und frustierendes Sammeln irgendwelcher Güter gehört jedenfalls für mich nicht dazu. Wenn ich meine Zeit nur \"totschlagen\" möchte, dann ja, aber ich möchte mich an einem Spiel erfreuen und werde deshalb dieses Kapitel nicht spielen (und XVI nun auch nicht)! Ich bin es echt leid![BR][BR]Ich kann mich ohne solche \"Gastrassen\" viel besser am Bau meiner Stadt erfreuen und die Dinge nachholen, die ich bisher ein wenig vernachlässigt habe."}, {"219": "ustoni schrieb:\t\t\tAusgezeichnet geplante Gastrasse. [smilie--sprite4]Zum Vergrößern anklicken....Wie soll man das auch planen, wenn sie (die Gast-Rasse) bereits 2 Wochen später Live erscheint. Kein Beta Spieler hat die in 14 Tagen durch, sodass man ordentlich Feedback hätte bekommen können im Beta-Forum um so Schluss folglich das ein oder andere noch abzuändern.[BR]Nein, dass macht man dann wieder ein paar Monate später um den Frust der Spieler noch zu steigern, da dann viele durch sind und ihnen womöglich das ein oder andere erspart geblieben wäre.[BR]Was wirklich verwunderlich ist und mir zu denken gibt, warum so viele stehen bleiben und nicht weitergehen im Bezug Forschungsbaum.[BR]Hier erkennt man dann, dass etwas nicht stimmt. Sei es im Aufbau, der Planung oder generell und das nicht von Seiten der Spieler.[BR]Um das ganze aber nicht ins OT zu ziehen, hier nochmals der Wunsch nach:[BR]- ändert die in \"meinem Augen\" völlig unverschämten Produktionszeiten der kleinen Schiffe ab oder[BR]- nehmt die Begrenzung der großen Schiffe raus und[BR]- ändert, bzw. überdenkt nochmals die Mengen der Gast-Rassen-Güter, welche utopisch sind und nicht gerade für Freude am Spiel sorgen und[BR]- der Aufwand an Mana sollte nochmals überdacht werden, der erst im hinteren Verlauf des Kapitels enorm ist aber auch[BR]- der generelle Platz/Flächenverbrauch welcher ohne Teleport-Zauber nicht machbar ist, jedoch nicht jeder gern den Turm spielt um diesen zu ergattern[BR]Generell stimmen die Gast-Rassen-Güter nicht überein, wenn man die Storyline spielt, denn man hat bereits alles zusammen, jedoch werden in der Storyline noch gewisse Gast-Rassen-Güter verlangt, welche der Spieler aber nicht mehr benötigt, bzw. nichts damit anfangen kann.[BR]Restbestand nach Beendigung der Storyline: [IMG]https://i.ibb.co/K7s5wJB/https-de-forum-elvenar-com-index-php-attachments-1609576073925-png-22686.png[/IMG][BR]Weder kann ich diese GR-Güter irgendwie einsetzen (danach), noch macht es Sinn einen solchen Überschuss zu haben, da man das Kapitel ja beendet hat."}, {"80": "ASLAN, nur als kleiner Widerspruch – ich bin demnächst durch mit dem Kapitel, ohne Stress, aber auch nicht ohne mir zwischendurch wegen der Mengen an den Kopf gegriffen zu haben.[BR][BR]Trotzdem: mit meiner Spielart werde ich es problemlos schaffen, ohne Dia-Einsatz, ohne Zeitbooster, ohne Teleporter, nur mit intelligentem Ab- und Neuaufbau der kleinen Schiffe, von denen ich je nach Zeit und Typ zwischen 6 und 12 eingesetzt habe. Die eingesetzte Fläche reicht für je 8 der kleinen Schiffe.[BR][BR]Zwischendurch lasse ich sogar große und kleine Schiffe leer laufen, damit ich mit der einen Güterklasse schneller voran komme. Die dürfen auch stehen bleiben, solange kein GA in Sicht ist.[BR][BR]Auch Mana ist unterdessen kein Problem mehr, nachdem ich noch ein bisschen aufgerüstet habe und begonnen habe, jeden Morgen konsequent alle Manus zu verzaubern. Bis eine Elixiermanu auf dem nächsten Level war, hatte ich genügend Mana fürs nächste Update. Alle 4 Manus sind jetzt schon auf dem Maximum, und auch die noch fehlenden Ausbauten und Forschungen werden mir keine Probleme mehr bereiten.[BR][BR]Einen so großen Überschuss wie du werde ich nicht verzeichnen (im Gegensatz zu früheren Kapiteln).[BR][BR]Diese Gastrasse kam meinem Spielstil entgegen. Nicht alle spielen so, das ist klar. Und bei anderen Spielstilen kann das Kapitel tatsächlich zu großem Frust führen. [BR][BR]Aber das gilt nicht für alle."}, {"230": "Ich gebe Aslan völlig Recht, habe jetzt Diamanten eingesetzt um diese wirklich bescheuerte Rasse endlich abzuschliessen. Dieses Satdtabbauen um Schiffe zu bauen, die man jede 15 min oder Stunde ernten muss um vorwärts zu kommen, was kein normal arbeitender Mensch schafft geschweige denn die die ab und zu mal spielen,sorry Inno. Wie armselig ist das denn??????[BR][BR]Wenn Ihr Geld braucht sagt doch Bescheid, bin ja gerne mal bereit was zu investieren, wenn es sich denn wirklich lohnt.[BR][BR]Solltet Ihr bei der nächtsten rasse so weiter machen, muss ich mir echt überlegen ob es das noch Wert ist. Wenn Ihr normalo Spieler wollt müsst ihr das sagen. Kein Ding. Kann mir auch ein anderes Spiel suchen, was definitiv nicht von inno sein wird.[BR][BR]LG Sandeule"}, {"233": "Bin Baff, dass ihr wirklich ein ganzes Kapitel für die Himmelshändler gemacht habt?!?![BR]Genau das war mein Wunsch! [smilie--sprite1][BR][BR]Die Grafik und die Gebäude hauen mich um![BR][BR]Ich bin wohl noch weit weg? ... bei den Elvenar... [BR]Auch kämpfe ich noch mit der Stabilisierung meiner EGutWirtschaft... [BR]Mittlerweile freu ich mich, dass ich keine Verkaufsstände mehr brauche![BR][BR]Die Drachenarche und das Glücksorakel werden mir aber jede kleine Hürde wert sein!!!! [BR]Wahre Monsterwunder! [smilie--sprite8][BR][BR]Und dass es, wie scheint, verdammt knifflig wird, mit viel Hick Hack und schwierigem Gebäudeverrücken... freut mich umso mehr! [smilie--sprite1][BR]Für ein Spiel wie elvenar darf es auch mal knifflig werden...[BR][BR]An alle Schimpfer... Es ist ja erstmal das letzte Kapitel... Warum wollt ihr da so schnell durch???[BR]Genießt es doch! [smilie--sprite2][BR][BR]Ich genieße erstmal noch den Übergang zu den Botschaftern... [smilie--sprite1]"}, {"219": "Francesco Borromini schrieb:\t\t\tASLAN, nur als kleiner Widerspruch – ich bin demnächst durch mit dem Kapitel, ohne Stress, aber auch nicht ohne mir zwischendurch wegen der Mengen an den Kopf gegriffen zu haben.\t\tZum Vergrößern anklicken....Jou die Mengen sind schon arg, jedoch hast du die Storyline nicht gespielt, wenn doch, dann bist du noch lange nicht fertig.[BR]Denn in dieser wird verlangt eine Rüstkammer auszubauen (nicht ablehnbar). Ist glaub Aufgabe 60 rum von über 80.[BR]Die Hammermäßigen Sammelaktionen kommen nämlich erst danach und zu einer neuen Gast-Rasse, gehört eben für \"mich\" auch deren Storyline dazu. [smilie--sprite2][BR][BR]gergerw schrieb:\t\t\tAn alle Schimpfer... Es ist ja erstmal das letzte Kapitel... Warum wollt ihr da so schnell durch???[BR]Genießt es doch! [smilie--sprite2]Zum Vergrößern anklicken....Damit Spieler, die noch lange nicht soweit sind wie du, hier rumtrollen können und Feedback als \"Schimpfen\" darstellen. [smilie--sprite2][BR]Denn selber können sie ja kein Feedback abgeben. [smilie--sprite7]"}, {"219": "Tacheless schrieb:\t\t\tZu deiner Frage: Ich habe gerade beides getestet, nachdem ich die Bestätigung erhalten habe, dass beide Quests ablehnbar sein sollen. Und ja, sie sind beide ablehnbar. Leider kann ich anhand deines Screens nicht sehen, dass es anders sein sollte, da die eine Aufgabe schon erledigt ist. Aber da der Test bei mir das ausgab, was sein sollte, werde ich es auch nicht als Fehler weiterleiten, da es ja funktioniert, wie es sollte.\t\tZum Vergrößern anklicken....Bin nun auch auf dem Beta da und ja da ist sie ablehnbar und es lag wohl daran, dass ich das Söldnerlager bereits ausgebaut hate, bevor die Quest kam. Deshalb zeigte es sie beim als erledigt an und \"Logo\", da kommt dann keine Abfrage mehr.[BR]Habe es auch im Spoiler: Storyline <-- -- abgeändert."}, {"80": "A S L A N schrieb:\t\t\tJou die Mengen sind schon arg, jedoch hast du die Storyline nicht gespielt, wenn doch, dann bist du noch lange nicht fertig.[BR]Denn in dieser wird verlangt eine Rüstkammer auszubauen (nicht ablehnbar). Ist glaub Aufgabe 60 rum von über 80.[BR]Die Hammermäßigen Sammelaktionen kommen nämlich erst danach und zu einer neuen Gast-Rasse, gehört eben für \"mich\" auch deren Storyline dazu. [smilie--sprite2]Zum Vergrößern anklicken....[BR]Hmm - ich kenne nur die italienische Questlist. Nach der geht das wunderbar auf - verkaufen von kleinen Schiffen, die man nicht mehr braucht, sammeln von spezifischen Gütern, die ich noch brauche.[BR][BR]Die 20k Schlüssel habe ich soeben abgeschlossen, da werde ich noch 12k mehr brauchen. Dann kommen mal noch 80k Kügelchen, von denen ich noch 200k sammeln muss. Müsste eigentlich passen.[BR][BR]Und die Upgrades kriege ich auch hin. Die kleinen Schiffe, die ich nicht mehr brauche, geben genügend Platz für Trainingsgelände und Söldnerlager. Die Kaserne wird ja kleiner, das HG bleibt gleich.[BR][BR]Geduld wird es allerdings brauchen. Bin ganz froh, wenn kein GA ansteht [smilie--sprite1]"}, {"65": "Ich bin froh keine Italienisch Questliste zu haben,[BR]bei der Deuschen Questliste bin ich durch.[BR][BR]Danke für die Info [smilie--sprite1]"}, {"219": "Francesco Borromini schrieb:\t\t\tHmm - ich kenne nur die italienische Questlist.\t\tZum Vergrößern anklicken....Die ist auch nicht anders wie die Deutsche Storyline [smilie--sprite2][BR][BR]Francesco Borromini schrieb:\t\t\tDie 20k Schlüssel habe ich soeben abgeschlossen, da werde ich noch 12k mehr brauchen. Dann kommen mal noch 80k Kügelchen, von denen ich noch 200k sammeln muss. Müsste eigentlich passen.\t\tZum Vergrößern anklicken....Ja ist schon noch einiges, aber klar .. .. .. gehen tut das (in der Ruhe liegt die Kraft).[BR]Ich hatte weder die Geduld nach XXX Wochen noch bin ich von Haus aus nicht so für dieses GA-System, denn ich kam mir vor, wie im alten GA die Treant-Abzeichen. [smilie--sprite8][BR][BR]Francesco Borromini schrieb:\t\t\tUnd die Upgrades kriege ich auch hin. Die kleinen Schiffe, die ich nicht mehr brauche, geben genügend Platz für Trainingsgelände und Söldnerlager. Die Kaserne wird ja kleiner, das HG bleibt gleich.\t\tZum Vergrößern anklicken....Schaffst du schon. [smilie--sprite1][BR][BR]Francesco Borromini schrieb:\t\t\tGeduld wird es allerdings brauchen. Bin ganz froh, wenn kein GA ansteht [smilie--sprite1]Zum Vergrößern anklicken....Das (GA) hast du, wenn du stets die 15 Minuten machst. 23 so kleine Schiffchen hast doch stehen. Da geht das aber noch."}, {"80": "A S L A N schrieb:\t\t\tDie ist auch nicht anders wie die Deutsche Storyline [smilie--sprite2]Zum Vergrößern anklicken....[BR]Danke für den Link! Die Übersetzung basiert auf der italienischen Liste - mein Italienisch ist gut genug [smilie--sprite2][BR][BR]A S L A N schrieb:\t\t\tJa ist schon noch einiges, aber klar .. .. .. gehen tut das (in der Ruhe liegt die Kraft).[BR]Ich hatte weder die Geduld nach XXX Wochen noch bin ich von Haus aus nicht so für dieses GA-System, denn ich kam mir vor, wie im alten GA die Treant-Abzeichen. [smilie--sprite8][BR]Schaffst du schon. [smilie--sprite1]Zum Vergrößern anklicken....[BR]Ist so. Schaffe ich.[BR]Im Moment stehen 16 Gourmetschiffchen herum für die letzten Scampi, dann werden sie gegen Piraten getauscht für die letzten beiden Forschungen. End of Chapter in ca. 10 Tagen [smilie--sprite1]"}, {"54": "So, hab mich mal fleissig durchgelesen...[BR]--------------------------------------------------------------------------------------------------------------------------------------------[BR]danke, Aslan für deine Berichtigung.[BR]((Ich spiele ohne Kauf-Dias, wenn man den Turm gut nutzt, bekomt man über diese Schiene schon einiges zusammen, allerdings hab ich zu Beginn schon investiert in BM, AKA und Erweiterungen, zum Schneller Vorwärtskommen im Fortschritt oder wo sonst auch immer nutze ich keine,[BR]klare Aussage aber von mir: auf keinen Fall \"verdamme\" ich VielkaufDia-Spieler (ohne die gäb es auch das Spiel nicht), auf keinen Fall, Umgekehrt habe ich Hochachtung vor Leuten hier, die nur durch cleveres Ausnutzen angebotener Recourcen viel schneller zu ihren Zielen kommen als viele andere.))[BR]--------------------------------------------------------------------------------------------------------------------------------------------[BR]Hab nun auch agiert und 51 (!!) kleine Schiffe aufgebaut, die halbe Stadt ins Nirvana (Lager) geschickt (es gab man Zeiten ohne Teleporter - denk ich lieber mal nicht dran) und ernte im Stunden- und 3h-Takt wie ein Hirnloser, nur weil ich die \"Eindringlinge\" (Schiffchen) schnell wieder vertreiben will.[BR][BR]Zum Glück geh ich nicht nach der Quest (geh ich schon seit den Feen nicht mehr) , habe lediglich eine \"Buchführung\", wieviele der 3 Komponenten ich noch benötige, das funktioniert sehr gut, so werd ich hoffentlich die Dinger bis in 3 Wochen ca wieder los sein und dann macht das Spiel wieder Spass.[BR]Monatelang nur so Recourcen abarbeiten ist mir einfach zu doof - Spielspass = Null (dafür spielen wir doch, oder ?)[BR]Liegt wirklich daran, dass man, um zu \"überleben\" fast alles entfernen muss, was man sonst nutzen konnte, auch während einer Gastrasse.[BR]Langt ja, die Fortschritts-Balken abzuarbeiten, muss nicht die halbe Stadt dafür 2 -3 Monate platt sein.[BR][BR]OK, hab auch gelesen, man kann ja die 12 großen Schiffe 6 oder mehr Monate stehen lassen und die GR so gemütlich abarbeiten, aaber[BR][BR]Da gibt's ja noch das GA, die Events, Umbauten wegen Größenveränderungen etc, dazu will man schonmal die GR ganz weg haben wieder.[BR][BR]Und was macht man wenn dann überschneidend die nächste GR kommt wo man vl. 1 Jahr lang braucht ?[BR][BR]Nunja, hab nun meinen \"Weg\" gefunden, Augen zu und durch ist wohl auch mein Favorit wie bei den meisten hier auch.[BR][BR]HdW[BR][BR]ps hoffentlich kommen nicht wieder diese Jammerer auf den Plan, die nach 1 Monat ohne GR nach der neuen schreien,[BR]sie kämen um vor Langeweile ... eher isses grad umgekehrt [smilie--sprite1]"}, {"48": "@A S L A N hat in diesem Beitrag[BR]A S L A N schrieb:\t\t\tWie soll man das auch planen, wenn sie (die Gast-Rasse) bereits 2 Wochen später Live erscheint. K[BR]....\t\tZum Vergrößern anklicken....auf den Punkt gebracht, was an diesem Kapitel für die Spieler nicht stimmt. Ich stimme mit ihm in allen Punkten völlig überein.[BR]Inno sieht das wahrscheinlich völlig anders. Endlich ein Kapitel an dem der Großteil der Spieler länger als 2 Wochen spielt, bevor sie wieder nach einem neuen fragen."}, {"234": "Ein Kapitel das sich zieht und selbst wenn man durch ist muss man für die ausbauten der Manus je nach Menge (bei mir 40M ) so einiges an Mana ranschaffen was wieder sehr lange dauert ,das ist aber alles noch okey immerhin soll das Spiel im oberen bereich nicht leichter werden. Nun schwer kann man dieses Kapitel auch nicht nennen es ist Zeitaufweniger nicht mehr.[BR][BR]Das design der neuen Gebäude gefällt mir passt (ist aber geschmack sache).[BR]Was mich sehr stört ist das Inno seit den Halblingen nicht die Farben der Werkstätten,Wohngebäude und des Hauptgebäudes ändert es ist immer das selbe [smilie--sprite5]was denken die sich dabei[smilie--sprite11].Es gibt so viele Farben es muss ja nicht so Bund sein wie bei den Feen(Gott bewahre) aber seit knapp 10 Kapitel immer das selbe [smilie--sprite9].Inno muss seine Spieler ganz schön für ....einfach halten sag ich´s mal so.[BR][BR]Inno willst du mich mal vom hocker hauen, benutz endlich andere Farben [smilie--sprite5].[BR][BR]RK"}, {"235": "ich hab mich eigentlich immer auf die neuen wunder gefreut. ich hab sogar alle wunder aufgestellt... zumindest noch... weil ich sie schön finde und die meisten auch nützlich sind. aber, kann mir jemand verraten, warum man sich die neuen wunder, glücksorakel und drachenarche, auf- und ausbauen sollte???[BR]in der beschreibung im baumenü des glücksorakels steht:[BR][BR]\"Belohnt dich jedes Mal mit einer bestimmten Menge eines zufälligen erweckten Gutes, wenn du etwas per Handwerk herstellst. Die Menge hängt von der Anzahl der abgeschlossenen Provinzen ab.\"[BR][BR]prima! das liest sich im ersten moment ganz nett... vor allem, wenn man mit wenig gefragten erweckten gütern \"gesegnet\" ist und so vielleicht die anderen güter bekommen könnte. als ich die weiteren kosten für den ausbau im wiki nachgelesen habe, steht dort in der beschreibung allerdings, dass man pro handwerksleistung eine \"bestimmte menge eines erweckten geförderten gutes\" bekommt. das ist schon mal schlechter, weil es mir persönlich nur die unbeliebten güter bringt, die ich ohnehin schlecht tauschen kann! [smilie--sprite5][BR]das wunder kostet in der anschaffung schon 100k unurium, 100k seife, 100k pilze und 100k bismut. bei 500 provinzen bringt eine handwerksproduktion 1500 eines erweckten geförderten gutes... in meinem fall mondstein, samt oder bismut. selbst wenn es nur bismut ausspucken würde, dann müsste ich mindestens 200 handwerksproduktionen durchführen, damit sich der kaufpreis amortisiert. bei einer wahrscheinlichen gerechten aufteilung zwischen den gütern noch mal deutlich mehr. [smilie--sprite3] das unurium lassen wir mal unter den tisch fallen...[BR]nun könnte man vielleicht auf die idee kommen, dass es bei einem größeren ausbau besser/interessanter wird und dass die ausbauten (wie üblich) mit relikten bezahlt werden... weit gefehlt! ... denn jeder ausbau kostet wieder erweckte güter! ab jedem 5. ausbau sogar nochmal je 50k mehr. durch die größe muss man auch relativ viele forschungspunkte ausgeben. sorry leute, aber das ist vollkommen uninteressant.[BR][BR]wenn ich die drachenarche nicht schon gebaut hätte, dann würde ich sie wahrscheinlich auch nicht bauen. mein fehler, dass ich falsch gelesen habe und annahm, dass die herstellung eines mystischen objektes ein gebäude aus dem handwerk wäre. für ein mystisches objekt... also ein objekt aus der \"schatzkiste\" braucht man ungleich länger. ist das euer ernst??? für zwei kombinationsauslöser, die man viel leichter anders produzieren könnte? die 9000 bismut pro hauptquest können zwar hilfreich sein und helfen eine quest überhaupt interessant werden zu lassen... (quests, bei denen ich beispielsweise 40 turnierkämpfe bestreiten muss um 5 relikte [smilie--sprite12] zu bekommen, sind es jedenfalls nicht)... aber wenn ich alles in betracht ziehe, dann kann ich das wunder auch nicht empfehlen.[BR][BR]und von der optik??? die meisten wunder zeichnen sich durch eine tolle animation aus, aber die drachenarche ist relativ langweilig! die idee mit dem sternenhimmel im schiffsrumpf ist zwar ganz nett, aber die ausführung ist weniger \"galaktisch\" und in ihrer farbkombination auch etwas ... \"unschön\".[BR]das glücksorakel habe ich noch nicht aufgebaut gesehen und kann es nicht beurteilen.[BR][BR]wenn ich mir jetzt noch überlege, dass sich viele gebäude ab dem 15. kapitel nur noch in mikroschritten verbessern, das turniersystem sich verändert hat und viele spieler zu einem strategischen wechsel drängt, dann braucht ihr euch nicht wundern, wenn viele spieler kein interesse mehr an einem forschungsfortschritt haben... oder vielleicht sogar ganz aufhören.[BR][BR]um auch was positives zu sagen... das ausgebaute trainingsgelände, mit seinem kämpfenden cave-jumper, ist urschön!!! kompliment!"}, {"218": "j.fili schrieb:@A S L A N hat in diesem Beitrag[BR][BR]auf den Punkt gebracht, was an diesem Kapitel für die Spieler nicht stimmt. Ich stimme mit ihm in allen Punkten völlig überein.[BR]Inno sieht das wahrscheinlich völlig anders. Endlich ein Kapitel an dem der Großteil der Spieler länger als 2 Wochen spielt, bevor sie wieder nach einem neuen fragen.\t\tZum Vergrößern anklicken....[BR][BR]wer fragt da noch nach neuen Gastrassen, ich kenne keinen, wir sind alle froh ( die meisten die ich kenne, haben über die Gastrasse nur gekotzt) wenn sie ausbleiben, Spaß machen sie keinesfalls"}, {"11": "Gibt es eine quest liste??[BR] Ich bin jetzt bei besitze 2 Manus stufe 28, und würde gerne die kleinen schiffe abreißen"}, {"11": "hat ich erledigt"}, {"23": "\t\t\thttps://elvenarfan.de/events/karneval-2021/quests\t\t"}]