[{"190": "Wohnhäuser kann man auch einlagern in dem Kapitel ? Oder entstehen einem dadurch Nachteile außer das man nicht Ausbauen kann z.b"}, {"90": "ohne bev kannst du nichts bauen was sie braucht, ansonsten keine Nachteile außer weniger Gold am tag."}, {"190": "Danke Tobi für die Antwort..."}, {"60": "Nach 3½ Monaten bin ich froh, dass ich das Kapitel nun hinter mir habe. [BR][BR]Zeitlich brauchte ich nicht viel länger, als ich durchschnittlich für alle Kapitel gebraucht habe - aber gefallen hat mir das Kapitel nicht. Ich hatte den Weg mit nur kleinen Schiffen gewählt und das war unglaublich klicklastig. Ich fühlte mich wie in einem GA, welches in Dauerschleife lief. [BR][BR]Ob das eine gute Entscheidung war die mittleren Schiffe abzureißen und nur die kleinen zu nutzen, kann ich nicht sagen, sie waren dann ja weg und neu aufbauen war mir einfach zu teuer. Also machte ich die Nummer \"Augen zu und durch\" - was ich für eine Gastrasse eigentlich sehr schade finde, soll diese doch Freude und Spiellust bringen.[BR][BR]Die Grafik ist allerdings der Hammer, besonders die der regulären Gebäude. Auch wenn das Thema der Gastrasse so gar nicht meins ist, ist auch hier die Grafik super gelungen. Und zudem ist endlich bei der Edelstein-Manu das für mein Empfinden hässliche Design von den Konstrukten weg. Danke dafür. [smilie--sprite1][BR][BR]Ich hoffe, dass das Kapitel 18 nicht allzu schnell kommt, ich muss mich erstmal von diesem erholen [smilie--sprite8]"}, {"58": "Hallo,[BR][BR]ist jetzt schon paar Tage her, dass ich die Gastrasse fertig hab und ich hab auch bewußt mit meinem Kommentar gewartet.[BR][BR]Ergebnis: Ich hab sie abgeschlossen, um im Spiel weiter zu kommen aber gefallen hat mir nichts und Spaß hat es mir auch nicht gemacht.[BR]Das schlimmste für mich war, dass ich alle Gebäude zusammen schieben musste oder einlagern um unmengen Gastrassengebäude aufzustellen.[BR]Ja klar, ich kann mir ja Zeit lassen, aber geschätzt hätte ich dann bis Ende des Jahres gebraucht und auch bei mir gab es die Klick-Orgie um fertig zu werden.[BR]Jetzt hab ich meine Stadt wieder so aufgebaut, wie sie mir gefällt, produktiv aber auch mit vielen schönen Event-Gebäuden (wozu mache ich sonst Events?) [BR]Ich hoffe, dass ich sie so eine Weile genießen kann und bitte, bitte, bitte nicht gleich Kapitel 18. [BR][BR]Naja, die Hoffnung stirbt zuletzt, vlt ist das nächste Kapitel ja auch so toll, (gut in die laufende Stadt zu integrieren, Grafik usw.) dass es richtig Spaß macht es zu durchlaufen."}, {"11": "Kamajo schrieb:\t\t\tIch kann mich den vielen Vorschreibern nur anschließen - es ist alles auf den Punkt gebracht. Auch ich empfinde es als ein unnötiges in die \"Länge ziehen\" und das noch um Welten schlimmer als in K16.[BR]Das neue Kapitel ist auch aus meiner Sicht misslungen (bis auf die Grafik, auch wenn Schiffe so gar nicht mein Thema sind), keine GR hat mir bisher so wenig Freude gemacht. Schade, sehr schade.\t\tZum Vergrößern anklicken....Ich glaube die wollen nicht das so viele die Kapitel abschließen, und hoffen das welche genervt aufgeben und platz für neue ungebrauchte Spieler zu schaffen.[BR][BR]ps Ich habe nicht aufgegeben, und das Kapitel beendet [smilie--sprite7]"}, {"1": "@Schnalle 04 Würden wir das wollen, würden wir einfach aufhören, neue Kapitel zu erstellen. [smilie--sprite2]"}, {"236": "Auch meine Wenigkeit ist seit kurzer Zeit mit dem Kapitel und den links stehenden Aufgaben durch . . . aber abgesehen von der Optik war dies seit den Orks das bescheidenste . . . .[BR][BR]Mal ernsthaft: Wer investiert im RL, oder anderen Spielen Geld und/oder Güter in ein großes Schiff, nur um es per Aufgabe wieder vernichten zu müssen . . .[BR][BR]Nun brauche ich bloß noch auf Mana warten für die restlichen Ausbauten . . . dann mag ich auch eine Zeit lang kein neues Kapitel mehr sehen . . ."}, {"30": "Da ich nach den vorhergehenden Meinungen zu den Händler jetzt völlig anderer Meinung bin - vorab eine kurze Erklärung zu „meiner“ Spielweise:[BR][BR]Ich arbeite nur mit ganz wenigen Manus, liebe Eventgebäude und versuche so viele wie möglich zu platzieren. Ich verfüge selten über massenhaft Güter, musst also für den Forschungsbaum ab und an 2-3 Tage sammeln.[BR]Meine persönliche Meinung ist: wozu massenhaft Güter horten und sammeln? Raus damit, dafür sind sie schliesslich da! Egal ob im Turnier, im GA, im Turm oder bei den Gastrassen: dann wird sich halt mal platt gemacht- was solls [smilie--sprite1][BR]Daraus resultierend habe ich natürlich auch wenig arbeitende Bevölkerung und somit eine recht geringe Unurium Produktion.[BR][BR]Grundsätzlich spiele ich auch immer komplett die Questline durch. Und da die ja ausreichend gespoilert wurde, kann ich die die negativen Anmerkungen hierzu nicht nachvollziehen. Ich weiss, das ich bei Quest XY eine bestimmte Menge von  ZY produzieren muss. Also warum sollte ich die vorher ansammeln? Man kann im Forschungsbaum sehen, wann und wieviel benötigt wird. Wenn man nicht Unmengen WPs im Turnier sammelt, braucht man immer 2-3 Tage um ein Forschungsfeld zu füllen - reicht für die Güter ansammeln allemal.[BR][BR]Meine Saat hatte ich im Vorfeld durch Aufstellen von Verkaufsständen erhöht (hinterher geschreddert, nicht verschoben, kommen ja irgendwann mal wieder). Ich musst dennoch ab und zu die Produktion wechseln, war aber nicht wirklich zeithemmend.[BR][BR]Die Idee bei den Händlern von Unur ist leider nicht in der Ankündigung klar rübergekommen: Es geht um Handelsschiffe, die Waren liefern, ankaufen, andocken und wieder den Hafen verlassen um neue Güter zu kaufen, verkaufen etc. Im Gegensatz zu den bisherigen Gastrassen war es hier völlig unsinnig, gleich alles mit den Schiffen voll zu bauen. Ich habe die kleinen Schiffe je nach Bedarf an Platz gebaut, verkauft und wieder neu gebaut. Die Kosten hier waren moderat. Es war bei mir im Hafen also ein „Kommen und Gehen“.[BR][BR]Man konnte im Forschungsbaum und auch anhand der Questline sehen, das anfangs erst die einen Gastrassengüter in Massen benötigt wurden, später jedoch nur noch in geringen Mengen, dafür kamen mehr von den anderen. Es reichte für die Produktion der maximalen Menge von 7 kleinen Schiffen und ein oder auch 2 grosse Schiffe der anderen aus. Der Abriss der grossen Schiffe und dann doch kurzfristig ein Neubau tat wegen der Güter schon ein bisschen weh ...[BR][BR]Aber gerade dieses immer wieder neu Auftstelenn, das Kommen und Gehen fand ich eine durchaus spannende Idee. Eben nicht wie bisher 08/15 Gastrassengebäude aufstellen und produzieren. [BR][BR]Ja  - die 3 Stunden Produktion konnte man als nervig ansehen. Ich hatte aber nur max 9 stehen - und dann auch nur von einer Sorte, die anderen in dem Moment eben nur mit 3-4 Schiffchen (weil die anderen gerade wieder den Hafen verlassen haben, um neue Waren zu kaufen). Und wenn sie dann mal leer liefen, hat das die Dauer der Gastrasse nicht wirklich beeinträchtigt. Ich hatte bei einigen Gastrassen wegen meiner Arbeitszeit auch Probleme. Unglücklich war hier in jedem Fall der extreme Unterschied der Gütermengen bezogen auf die Produktionszeiten.[BR]Ich habe auch diesmal nicht länger als sonst benötigt und ich persönlich finde, das 3-4 Monate eine moderate Zeit sind.[BR][BR]Wer schnell durch die Gastrasse will und alle Gastrassengüter vorab schnell produzieren möchte, kann halt einfach die Questline nicht „abarbeiten“. Wer die Händler als Händler „spielt“ sollte mit der Questline kein Problem haben.[BR][BR][BR]Fazit: [BR]Tolle Grundidee, nicht mehr nur Gebäude zu bauen und stumpfsinnig die GR Güter produzieren, sondern für Flexibilität und Varianten sorgen. Hätte in der Kommunikation vorher eventuell besser rüber kommen können.[BR]Eventuell die Mengen der verschiedenen Zeitproduktionen prüfen und korrigieren.[BR]Auch wenn ich alle Schiffe von der Grafik her toll fand - sie waren einfach zu massig! Man konnte kaum den Gesamtbau erkennen, weil immer alles verdeckt war. Das fand ich schade."}, {"4": "Ich habe im Anfang dieses Threads von vielen Spielern gelesen, dass sie Platz geschaffen haben durch teleportien von Gebäuden und dadurch tief ins Minus mit der Bevölkerungsanzahl gegangen sind. Nur ist im Kapitel ja irgendwo der Ausbau vom Hauptgebäude angelegt, ohne gehts nicht mehr weiter.[BR][BR]Wie habt ihr das dann gemeistert? Gastrasse abgerissen? Häuser aufgebaut und Hauptgebäude ausgebaut, dann Häuser wieder weg und Gastrasse wieder aufgebaut? Oder gibts noch andere Lösungsmöglichkeiten?"}, {"90": "Du hast nur ein paar möglichkeiten 1. Habe genug Gastrassengüter für alle nachfolgenden Forschungen auf Lager um die Schiffe wieder  mit Häusern Dauerhaft zu ersetzen,[BR]2. Schiffe wieder Einlagen Häuser raus und nach dem Ausbau wieder Häuser einlagern und Schiffe raus.[BR]3. Die entsprechende Forschung per Dias freischalten.[BR]4. Manus einlagern und durch Häuser ersetzen."}, {"54": "salandrine schrieb:\t\t\tIch habe im Anfang dieses Threads von vielen Spielern gelesen, dass sie Platz geschaffen haben durch teleportien von Gebäuden und dadurch tief ins Minus mit der Bevölkerungsanzahl gegangen sind. Nur ist im Kapitel ja irgendwo der Ausbau vom Hauptgebäude angelegt, ohne gehts nicht mehr weiter.[BR][BR]Wie habt ihr das dann gemeistert? Gastrasse abgerissen? Häuser aufgebaut und Hauptgebäude ausgebaut, dann Häuser wieder weg und Gastrasse wieder aufgebaut? Oder gibts noch andere Lösungsmöglichkeiten?\t\tZum Vergrößern anklicken....bezieh mich auf das fettgedruckte:[BR]ähm - versteh ich nicht ganz ?[BR]mit ein bisserl Überlegen kann man die Bevölkerungszahl doch wunderbar steuern: Manus teleportieren, die man eine längere Zeit entbehren kann und schon hat man genug Bevölkerung zur Verfügung. Parallel dazu kann man Kulturen teleportieren, die keine Bevölkerung beinhalten, da man ja auch nicht soviel braucht dann.[BR]Nebenbei in den Evetns immer die Kulturen-Tagespreise herausfischen, die die meisten Personen \"beherbergen\", so ist man immer flexibel, wenn mann dann wieder mehr braucht durch den Ausbau der Manufakturen auf 31 zB.[BR][BR]HdW"}, {"30": "salandrine schrieb:\t\t\tIch habe im Anfang dieses Threads von vielen Spielern gelesen, dass sie Platz geschaffen haben durch teleportien von Gebäuden und dadurch tief ins Minus mit der Bevölkerungsanzahl gegangen sind.\t\tZum Vergrößern anklicken....Hey Salandrine, ich hatte in meinem Thread ja angemerkt, das ich eine eher minimalistische Stadt habe, weil ich die Eventgebäude liebe. Ich habe daher ohnehin wenige Manus und Wohngebäude. Ich hatte während der gesamten \"Händler Zeit\"  aber keinerlei Bevölkerungsprobleme. Auch der Platzmangel hielt sich in Grenzen. Im Gegenteil, ich habe sogar zwei Manus wieder aus dem Inventar geholt, damit mehr Unurium produziert wird. Dann allerdings einen Austausch vorgenommen, weil gerade GA begann und fast nur noch meine BoniGut1 Manus (5 Stk) stehen gehabt und nur noch jeweils eine von den erweiterten Gütern. Durch den Turm habe ich 5 Magische Wohngebäude und musste für den Quest mit dem Ausbau nochmal welche aus dem Inventar aufstellen. Dann kam netterweise das Winterevent. Hier habe ich viele alte Eventgebäude austauschen können und wieder mehr Bevölkerung bekommen. Der Ausbau des HGs kommt recht spät, wenn man mit dem Auf und Abbau der Schiffe so verfährt, wie ich es getan habe, ist zu diesem Zeitpunkt auch wieder ausreichend Platz, um ein Wohngebäude aus dem Inventar zu holen oder neue Eventgebäude mit Bevölkerung aufzustellen.[BR][BR]Das Ganze hängt natürlich von den Gegebenheiten deiner Stadt ab - lässt sich daher nicht einfach übertragen. Die Spieler, die tatsächlich Bevölkerungsmangel hatten, haben eben eine andere Spielweise - mit massenhaft Manus hat man entsprechend geringere Bevölkerung und empfindet auch den Platzbedarf als zu hoch. Dafür konnten die deutlich fixer Unurium produzieren als ich.[BR]Was ich sagen will: jeder hat mit jeder einzelnen Gastrasse irgendwelche Probleme zu bewältigen - nicht jedes Problem ist zwingend für jeden Spieler vorhanden bzw. umgekehrt nicht jeder Spieler hat zwingend die gleichen Probleme."}, {"219": "Deine Stadt gefällt mir sehr gut, Marloy,  gleicht einem Wimmelbild, überall was zu schauen und nach Jahreszeiten und Themen geordnet. Toll!"}, {"4": "Marloy schrieb:\t\t\tHey Salandrine, ich hatte in meinem Thread ja angemerkt, das ich eine eher minimalistische Stadt habe, weil ich die Eventgebäude liebe. Ich habe daher ohnehin wenige Manus und Wohngebäude. Ich hatte während der gesamten \"Händler Zeit\"  aber keinerlei Bevölkerungsprobleme. Auch der Platzmangel hielt sich in Grenzen. Im Gegenteil, ich habe sogar zwei Manus wieder aus dem Inventar geholt, damit mehr Unurium produziert wird. Dann allerdings einen Austausch vorgenommen, weil gerade GA begann und fast nur noch meine BoniGut1 Manus (5 Stk) stehen gehabt und nur noch jeweils eine von den erweiterten Gütern. Durch den Turm habe ich 5 Magische Wohngebäude und musste für den Quest mit dem Ausbau nochmal welche aus dem Inventar aufstellen. Dann kam netterweise das Winterevent. Hier habe ich viele alte Eventgebäude austauschen können und wieder mehr Bevölkerung bekommen. Der Ausbau des HGs kommt recht spät, wenn man mit dem Auf und Abbau der Schiffe so verfährt, wie ich es getan habe, ist zu diesem Zeitpunkt auch wieder ausreichend Platz, um ein Wohngebäude aus dem Inventar zu holen oder neue Eventgebäude mit Bevölkerung aufzustellen.[BR][BR]Das Ganze hängt natürlich von den Gegebenheiten deiner Stadt ab - lässt sich daher nicht einfach übertragen. Die Spieler, die tatsächlich Bevölkerungsmangel hatten, haben eben eine andere Spielweise - mit massenhaft Manus hat man entsprechend geringere Bevölkerung und empfindet auch den Platzbedarf als zu hoch. Dafür konnten die deutlich fixer Unurium produzieren als ich.[BR]Was ich sagen will: jeder hat mit jeder einzelnen Gastrasse irgendwelche Probleme zu bewältigen - nicht jedes Problem ist zwingend für jeden Spieler vorhanden bzw. umgekehrt nicht jeder Spieler hat zwingend die gleichen Probleme.\t\tZum Vergrößern anklicken....Danke für die ausführliche Antwort, auch an alle anderen, die sich die Mühe gemacht haben zu antworten, ein großes Danke.[BR][BR]Ich selbst hatte noch gar nicht angefangen mit den Händlern, ich fragte eher für einen Mitspieler. Ich ganz persönlich mag nicht gerne in einer Gastrasse so lange feststecken, ich mag Platz haben für Events und für die GAs. Mich persönlich nervt es, nur alle 14 Tage oder noch länger eine Forschung abschließen zu können. Das ist auch ein Grund, warum ich selbst noch nicht angefangen habe mit den Händlern. [BR][BR]Aber stimmt, wenn man Manus einlagert, fehlt das Unurium. Mit diesem Mitspieler habe ich die Vereinbarung, dass er derzeit von mir die erweckten güter erhält, ich brauche sie derzeit kaum. Dafür kann er seine Saat für die Produktion verwenden und Unurium beim Händler produzieren. Geht ganz gut. Wenn er durch ist, drehen wir es rum, er produziert die erweckten und ich kann dann ausreichend Unurium prodden. Muss man halt sicher sein, dass diese Vereinbarung hält.  Gibt halt auch Platz, wenn die erweckten wegzuräumen gehen."}, {"100": "Ich hab mit  Kapitel 17 angefangen  . [BR][BR]Und ich find  ihn  ......   [BR]Eine Stadt auf viel Bevölkerung  /Kultur umzubauen  ist total unlogisch  . [BR][BR]Millionen Saat auszugeben um die Rüstkammern von  31  auf 37  auszubauen ,nur um mehr  Kultur / Bevölkerung zur Steigerung von der Unurium -Produktion zu bekommen .  Ohne sonstigen Zweck .  Die Kaserne läuft nicht 1 min länger  [smilie--sprite4] .[BR]Manus aufstellen , obwohl  niemand die Güter benötigt  [smilie--sprite4] [BR][BR][BR]Jetzt hab ich  Dampf abgelassen , und finde den Feedbackfred beim nächsten Problem etwas schneller  [smilie--sprite1][BR]fg[BR]schwatz"}, {"6": "schwatzwurzel schrieb:\t\t\tEine Stadt auf viel Bevölkerung /Kultur umzubauen ist total unlogisch .\t\tZum Vergrößern anklicken....Gewöhn Dich dran. Gilt auch für die folgenden Kapitel. [smilie--sprite8]"}, {"4": "Natürlich läuft die Kaserne länger. Durch Ausbauten der Rüstis erhöht sich die Menge der Soldies, die ausgebildet werden können.  Dadurch verlängert sich in allen 3 Ausbildungsstätten die Ausbildungsdauer. [BR][BR]Und ja, du brauchst Unurium und Saat, beides wird durch Bev./Kultur beeinflusst."}, {"100": "Auf das reale übertragen  :  [BR]Gestern  bauten 5 Arbeiter  1 Auto in  2 Tg  .[BR]Heute   müssen  10 Arbeiter eingestellt werden um  1 Auto  in 2 tagen zu bauen  , damit die Stadt funktioniert  .[BR]Hatten wir das  nicht schon einmal , nur dort war es ein Land   in Deutschland  [smilie--sprite2]  ."}, {"100": "salandrine schrieb:\t\t\tNatürlich läuft die Kaserne länger.\t\tZum Vergrößern anklicken....Leider nicht  .[BR]4 Rüstkammern  der Stufe  31  können  mehr Effekt auf die Kaserne ausüben  , als[BR]3 Rüstkammern der Stufe   37 .[BR]Der Platzbedarf ist gleich  .  Bevölkerung bei  37 Rüsti verdoppelt sich  .  Der Kulturbedarf wird verdreifacht  .[BR][BR]Die Pilze sind ziemlich gut in der Wirkung in Verbindung mit Rüsti  und deren  Stufen[BR][BR]24 Rüsti  stufe  31  =  744 stufen  *42 Wundereffekt pilz   =  31248  Trainingsbonus + 6720  von Rüsti  =   37968  für Kaserne[BR]18Rüsti    stufe 37     =666 stufen  *42 Wundereffekt Pilze    =27972Trainingsbonus  +9000 von Rüsti   =   36972   für Kaserne  .[BR][BR]Rüsti 31  [BR]Verbrauch Kultur 140000,[BR]Bevölkerung   58320[BR]Fläche  504[BR][BR]Rüsti 37[BR]Verbrauch Kultur 368787[BR]Bevölkerung  118854[BR]Fläche 504"}]