[{"4": "Die Händler waren für mich das schlimmste und unangenehmste Kapitel überhaupt. Es tut sich so gar nichts, die Menge sind minimal und man muss ständig am Ball bleiben.[BR][BR]Ich war zwar in 2 1/2 Monaten durch, aber auch nur, weil ich ca. 50 kleine Schiffe stehen hatte und diese dann möglichst alle 15 Min. abgeerntet habe. Habe mir sogar einen Timer gestellt und so mind. 3 x in einer Stunde geerntet.[BR][BR]Nee, das muss ich nicht nochmals haben."}, {"120": "na dann richte ich mich mal auf ein Ende irgendwann im nächsten Jahr ein. Ich hab weder Lust, meine Stadt dafür komplett auseinander zu nehmen, noch Zeit alle 15 Minuten an den Laptop zu hechten."}, {"112": "ich hab mir dafür extra timer eingerichtet, die ich immer, wenn ich sowieso am pc war, laufen lassen habe um in dieser zeit den max ertrag zu haben. es war lästig und frustrierend. und ich brauch sowas auch nie wieder!"}, {"2": "...in Arendyll hab ich nur die Flaggschiffe stehen - das kann noch dauern [smilie--sprite2] ...[BR][BR]...5000 Shrimps sind ungefähr 650 Diamanten wert - find ich jetzt gar nicht mal so teuer ^^....[BR][BR][IMG]https://i.ibb.co/FsPgYmY/https-de-forum-elvenar-com-index-php-attachments-shrimps-png-34872.png[/IMG]"}, {"24": "Romilly schrieb:\t\t\t...in Arendyll hab ich nur die Flaggschiffe stehen - das kann noch dauern [smilie--sprite2] ...[BR][BR]...5000 Shrimps sind ungefähr 650 Diamanten wert - find ich jetzt gar nicht mal so teuer ^^....[BR][BR]Anhang 34872 ansehenZum Vergrößern anklicken....Vielleicht ist das der Sinn des Kapitels... Dias rauslocken damit es VORBEI ist [smilie--sprite8] [smilie--sprite8] [smilie--sprite8][BR][BR]Aber ja, das mit den TImern kenne ich auch. Aber: Keine Sorge. Wird noch heftiger im Schwarzmagiekapitel [smilie--sprite8] Aber da liegts zum Glück NUR an den Ress."}, {"120": "Feytala1986 schrieb:\t\t\tim Schwarzmagiekapitel [smilie--sprite8]Zum Vergrößern anklicken....Die Rache des Verbannten?[smilie--sprite11][BR]Heißt das Teamgeist ist nicht so arg?"}, {"24": "Kassiopeia24 schrieb:\t\t\tDie Rache des Verbannten?[smilie--sprite11][BR]Heißt das Teamgeist ist nicht so arg?\t\tZum Vergrößern anklicken....Ja, \"Die Rache des Verbannten\"... Oder auch \"Voldi\". [smilie--sprite7] Netter als die Händler wars dennoch. Es zog sich zwar auch wie Kaugummi, war aber, k.a... Interessanter ?[BR][BR]Teamgeist hat mir ehrlich Spaß gemacht [smilie--sprite1]"}, {"61": "[IMG]https://i.ibb.co/tb4B3yw/https-de-forum-elvenar-com-index-php-attachments-stadtplaner-4-jpg-35368.jpg[/IMG]"}, {"120": "kann ich auch[smilie--sprite7]"}, {"111": "Ich befürchte ich werde meine Stadt ausmisten müssen. Diese Mengen an Gastrassengütern sind ja einfach nur noch absurd.[BR][BR]Edit: Und die Portalos bringen so gut wie nichts um in der Forschung weiter zu kommen."}, {"120": "CMDWS schrieb:\t\t\tEdit: Und die Portalos bringen so gut wie nichts um in der Forschung weiter zu kommen.\t\tZum Vergrößern anklicken....und trotzdem sind sie grad hier wichtig damit dich das Drecks-Elvenarin nicht ruiniert [smilie--sprite2]"}, {"171": "Bin jetzt auch bei den Händlern von Unur und habe eine Heimtücke entdeckt:[BR][BR]Elvarin kann man mit Göttlicher Saat UND mit Mana herstellen.[BR][BR]Einmal verklickt, oweh, schwindet die Saat.[BR][BR]Ansonsten finde ich sie jetzt nicht gar so schlimm. Braucht halt Zeit, und mal sehen, ob ich die Flott-Schiffe überhaupt aufstellen muss. Die Flaggschiffe stellen ja selbst alles her, was man braucht. Und Zeit hab ich ja genug. [smilie--sprite1]"}, {"100": "Alidona schrieb:\t\t\tEinmal verklickt, oweh, schwindet die Saat.\t\tZum Vergrößern anklicken....Das Mana schwindet auch  [smilie--sprite1][BR]Das Unurium macht es natürlich richtig gemein . Blockt  den Verkäufer und die Saatproduktion .[BR]Portalos helfen aber  um Mana und saat einzusparen, welches sonst  in den Gastrassengütern versickert .[BR][BR]Ihr habt euch die Schiffe verdient [smilie--sprite2] .[BR]Schliesslich habt  Ihr die vorigen Kapitel auch geschafft  [smilie--sprite1][BR]Man flucht und schimpft  , bis man das letzte  schiff geschreddert hat [smilie--sprite1] und fertig ist ."}, {"238": "Was mich nervt ist dass alles so künstlich in die Länge gezogen wird und dass man so endlos viel Platz braucht für Gebäude die dann sowieso wieder gelöscht werden (Gastvölker). Die minimale Unuriumproduktion trägt auch dazu bei ja wenig Spaß aufkommen zu lassen.."}, {"111": "Mit unurium hab ich tatsächlich keine Probleme. Sobald ich das Portal auf 2 hatte hab ich auf Saat umgestellt und damit Elvenarin hergestellt. [BR][BR]Ab Stufe 3 kann man auch Seife, Pilze und Bismut verwenden, das ist am effektivsten was Herstellung und Kosten angeht."}, {"120": "Das Beste an den Händlern?[BR]Sie Stück für Stück aus der Stadt jagen zu können."}, {"171": "Kassiopeia24 schrieb:\t\t\tDas Beste an den Händlern?[BR]Sie Stück für Stück aus der Stadt jagen zu können.\t\tZum Vergrößern anklicken....[BR]Das einzig Gute ist, dass man bis auf das Portal nichts ausbauen muss. Reederei ist definitiv nicht mein Ding. Dabei hatte ich mich eigentlich auf die Schiffe gefreut, weil die optisch und thematisch gut zu meinem Strandeck passen würden. Aber die Freude ist mir vergangen. Platz geht mir aus."}, {"113": "Uiuiui, mit diesen Güterforderungen wird den SpielerInnen ganz schön was an Geduld abverlangt.[BR]Also gut - Ärmel hochgekrempelt und weitermachen."}, {"111": "Also die Güter waren das einzige, was mich nicht ausgebremst hat bei den Händlern. Am schlimmsten waren natürlich die Gastrassen-Güter und die Tatsache, dass man verdammt viele Schiffe brauchte um nicht wahnsinnig zu werden."}, {"113": "CMDWS schrieb:\t\t\tAlso die Güter waren das einzige, was mich nicht ausgebremst hat bei den Händlern. Am schlimmsten waren natürlich die Gastrassen-Güter und die Tatsache, dass man verdammt viele Schiffe brauchte um nicht wahnsinnig zu werden.\t\tZum Vergrößern anklicken....Ah, ich meinte natürlich die Güter meiner Gäste. [BR]Von meinen normalen Gütern hab ich genug, selbst Unurium."}]