[{"21": "GeorgeSB schrieb:\t\t\tDanach kommt noch was mit 10x3h Werkzeug und dann sammle 500k Mana - sofern ich gerade nichts vergessen habe.[BR][BR]Edit: Aber ne Questliste hab ich bisher auch nicht gesehen? Oder hab ichs übersehen ^^\t\tZum Vergrößern anklicken....[BR]Die Liste von den Italienern ist meist brauchbar. Einfach mit Google Übersetzer und etwas Interpretationsvermögen [smilie--sprite2][BR][BR]\t\t\t\t\t\tMercanti di Unur\t\t\t\t\tFan-Blog dei Cavalieri dello Zombiaco, dedicato al gioco Elvenar.  In nessuno modo collegato ad InnoGames Gmbh, proprietaria delle immagini.\t\t\t\t\tcavalieridellozombiaco.blogspot.com\t\t\t\t"}, {"220": "Merci - für den Anfang wird das reichen [smilie--sprite1] 500k Mana oder dann je 50k Saat und Unurium wird eh nicht so ganz flott gehen .. und dann hat ja ggf. es irgendwer übersichtlich und kopierbar auf Deutsch veröffentlicht [smilie--sprite8]"}, {"50": "Nach Ausbau meines Händlers habe ich jetzt auf Unurium umgestellt (es kommt ein Warnhinweis, dass die momentane Produktion \"Saat\" zurückgesetzt wird) geht es los mit dem Erzeugen von Unurium.[BR][BR][IMG]https://i.ibb.co/Jn5M8ms/https-de-forum-elvenar-com-index-php-attachments-1603979772384-png-21811.png[/IMG][BR][BR]Wie schon bei der Saat und zuvor Mana zerfallen auch bei Unurium 10% davon über Nacht.[BR][BR][IMG]https://i.ibb.co/pfT88ss/https-de-forum-elvenar-com-index-php-attachments-1603979884574-png-21812.png[/IMG]"}, {"86": "OMcErnie schrieb:\t\t\tWie schon bei der Saat und zuvor Mana zerfallen auch bei Unurium 10% davon über Nacht.\t\tZum Vergrößern anklicken....Da kommt mir doch gleich eine Idee für ein neues Wunder.  [smilie--sprite6][BR][BR]Wird ja dann echt eine Herausforderung, dass richtige mittel zu finden. Die Saat braucht man ja sicher auch weiterhin für erweckte Güter und Ausbauten."}, {"21": "Supernico schrieb:\t\t\tDa kommt mir doch gleich eine Idee für ein neues Wunder.  [smilie--sprite6][BR][BR]Wird ja dann echt eine Herausforderung, dass richtige mittel zu finden. Die Saat braucht man ja sicher auch weiterhin für erweckte Güter und Ausbauten.\t\tZum Vergrößern anklicken....[BR]Allerdings. Wenn man bedenkt daß man alleine für die Forschung und den Bau des Portals und der 3 Flaggschiffe 472 K Unurium braucht kann man sich ungefähr ausrechnen wie lange das dauert , selbst wenn man ausschließlich Unurium produziert [smilie--sprite11]"}, {"220": "Was ist den die ominöse Händlermacht beim neuen Händlerlevel? Fungiert als Multiplikator für den Unurium Ertrag - soviel ist mir schon klar. Aber bzgl. täglicher Produktion steht bei mir 10% Händlermacht und bzgl. Sammelbonus nur 1% ^^[BR]Steigt das dann mit den Händlerforschungen weiter an?"}, {"21": "GeorgeSB schrieb:\t\t\tWas ist den die ominöse Händlermacht beim neuen Händlerlevel? Fungiert als Multiplikator für den Unurium Ertrag - soviel ist mir schon klar. Aber bzgl. täglicher Produktion steht bei mir 10% Händlermacht und bzgl. Sammelbonus nur 1% ^^[BR]Steigt das dann mit den Händlerforschungen weiter an?\t\tZum Vergrößern anklicken....[BR]Also: der Ertrag in den 24 Stunden setzt sich aus den 10 % der arbeitenden BV zusammen und der Sammelbonus 1 % aus der benötigten KU.[BR]Sprich: 10 % deiner arbeitenden BV und 1 % der benötigten KU ergibt die komplette Unuriumproduktion. Aus diesem Grund habe ich für den Anfang ein paar Manus aus dem Lager geholt um die Produktion zu pushen da ich anfangs eh nicht soviel Platz brauche."}, {"50": "[IMG]https://i.ibb.co/tLj9nz4/https-de-forum-elvenar-com-index-php-attachments-1603983392600-png-21813.png[/IMG][BR][BR]Die 1% bei Händlermacht zeigt Dir an, wie sich der Bonus überhaupt zusammensetzt. Ich gehe davon aus, dass dieser Wert ein Fix-Wert und die Variable die KU ist. Sprich 1% deines KU-Wertes entspricht dem Bonus."}, {"21": "OMcErnie schrieb:Anhang 21813 ansehen[BR][BR]Die 1% bei Händlermacht zeigt Dir an, wie sich der Bonus überhaupt zusammensetzt. Ich gehe davon aus, dass dieser Wert ein Fix-Wert und die Variable die KU ist. Sprich ca. 1% deines KU-Wertes entspricht dem Bonus.\t\tZum Vergrößern anklicken....[BR]Ja, genau so. Als Beispiel: ich habe 815481 arbeitende BV und 914646 benötigte KU.[BR][BR]Meine 24 Stundenproduktion ist deshalb 10 % von 815481 = 81548. Dazu kommt der Sammelbonus von 1 % der benötigten KU = 9146. Ich kann deshalb knapp 20 K Unurium alle 3 Stunden abholen.[BR][BR]. [BR][BR]Solange ich meine benötigte BV - zB durch den Bau von Manus etc. und die dafür benötigte KU nicht verändere ist das ein Fixwert."}, {"220": "Wie sich das zusammensetzt, ist mir ja schon klar - also die 10% bzw. 1% - wie oben geschrieben. Aber dass da zweimal der gleiche Begriff mit unterschiedlichem Prozentsatz genutzt wird, finde ich schon unglücklich/leicht verwirrend. Zumal das nirgends weiter erklärt wird und sich bei anderen Gebäuden besagte Multiplikatoren ja durchaus durch Ausbauten (beim Händler logischerweise nicht) oder Forschungen erhöhen lassen. Dh prinzipiell könnte man den ganzen Kram mit Händlermacht weglassen und in ein Infofeld schreiben, dass sich die Boni so berechnen.[BR][BR]Aber gut .. weiß ich erstmal Bescheid [smilie--sprite1]"}, {"219": "OMcErnie schrieb:\t\t\tDie 1% bei Händlermacht zeigt Dir an, wie sich der Bonus überhaupt zusammensetzt. Ich gehe davon aus, dass dieser Wert ein Fix-Wert und die Variable die KU ist. Sprich 1% deines KU-Wertes entspricht dem Bonus.\t\tZum Vergrößern anklicken....Genau [BR]Indianaking schrieb:\t\t\tMeine 24 Stundenproduktion ist deshalb 10 % von 815481 = 81548. Dazu kommt der Sammelbonus von 1 % der benötigten KU = 9146. Ich kann deshalb knapp 20 K Unurium alle 3 Stunden abholen.[BR][BR]. Zum Vergrößern anklicken....Joar dann sammeln wir mal .. .. ..[BR][IMG]https://i.ibb.co/fkCS1qt/https-de-forum-elvenar-com-index-php-attachments-1603984481525-png-21815.png[/IMG][BR][BR]Danke für deine Tipps aus dem Beta Thread ;-)"}, {"57": "wie wärs wenn ihr die Tipps auch hier sagt...."}, {"219": "LuxuriantSilver schrieb:\t\t\twie wärs wenn ihr die Tipps auch hier sagt....\t\tZum Vergrößern anklicken....Das ist ja mehr oder weniger der Feedback Thread und den Neues vom Beta Server - Thread hast oder steht doch auch dir zur Verfügung.[BR]Da schrieb man doch schon um so mehr Kultur und Bevölkerung du benötigst umso mehr Unurium bekommst du.[BR]Von dem her sollte man erstmal nicht gleich alles abreißen/einlagern und Platz freischaufeln, sondern erstmal Unurium ansammeln, da du durch mehr Manus, Rüsis folglich auch mehr Kultur und arbeitende Bevölkerung brauchst und genau dies treibt das Unurium beim Händler/Marktplatz nach oben.[BR][BR][IMG]https://i.ibb.co/Y3jSXM4/https-de-forum-elvenar-com-index-php-attachments-1603985764456-png-21817.png[/IMG] bedeutet [IMG]https://i.ibb.co/V9GNSPq/https-de-forum-elvenar-com-index-php-attachments-1603985708745-png-21816.png[/IMG] folglich 93300 Unurium am Tag (24h)[BR][BR][IMG]https://i.ibb.co/ZWbK81f/https-de-forum-elvenar-com-index-php-attachments-1603985861523-png-21818.png[/IMG] bedeutet [IMG]https://i.ibb.co/60yL749/https-de-forum-elvenar-com-index-php-attachments-1603985892715-png-21819.png[/IMG] folglich 9342 alle 3h + das was sich bereits angesammelt hat [IMG]https://i.ibb.co/PQWfyCF/https-de-forum-elvenar-com-index-php-attachments-1603985977118-png-21820.png[/IMG] macht zusammen alle 3h = 21004 Unurium alle 3h[BR][BR]Ergo, umso mehr Bevölkerung bei dir im Einsatz ist (benötigt wird) und umso mehr Kultur du generell benötigst, umso mehr Unurium erhältst du."}, {"57": "danke @A S L A N"}, {"221": "@jens333 @Tacheless keine ahnung ob es schon jemand bemängelt hat. aber die quests lassen sich nicht wegklicken aus dem letzen kapitel?![BR]jetzt sagt bitte nicht das soll so sein.. ich bau doch jetzt nicht die gebäude nochmal neu auf [smilie--sprite9]"}, {"21": "Tanysha schrieb:@jens333 @Tacheless keine ahnung ob es schon jemand bemängelt hat. aber die quests lassen sich nicht wegklicken aus dem letzen kapitel?![BR]jetzt sagt bitte nicht das soll so sein.. ich bau doch jetzt nicht die gebäude nochmal neu auf [smilie--sprite9]Zum Vergrößern anklicken....[BR]Ich nehme an daß die erste Forschung fertig ist. Ganz rausgehen und neu einloggen hat geholfen."}, {"221": "ja sicher.. hab den händler schon umgebaut.. moment ich logge neu[BR]edit: Danke schön @Indianaking hattest recht [smilie--sprite1]"}, {"197": "[IMG]https://i.ibb.co/fC3WMZy/https-de-forum-elvenar-com-index-php-attachments-aufgabe-png-21826.png[/IMG][BR][BR][BR]Wer, kann eventuell mit dieser Aufgabe etwas anfangen, ich leider nicht"}, {"2": "Fee Gloeckchen schrieb:Anhang 21826 ansehen[BR][BR][BR]Wer, kann eventuell mit dieser Aufgabe etwas anfangen, ich leider nicht\t\tZum Vergrößern anklicken.......na, du sollst 10 Segen verwenden - z.B. Zeitbooster oder Münzregen oder altes Wissen..."}, {"197": "Danke Dir, das war irgendwie ein großer Denkfehler von mir, ich war auf Zaubersprüche ;-((((("}]