[{"87": "Danke schön, @InnoGames, für das[BR]Begrüßungsgeschenk.[BR][IMG]https://i.ibb.co/8xN9nhm/https-de-forum-elvenar-com-index-php-attachments-1604005380363-png-21828.png[/IMG][BR]​"}, {"85": "Neuer Topf, alte Suppe....[BR][BR]Bei mir reift der Gedanke immer mehr, dass es gar keinen Sinn mehr macht, die Kapitel zu spielen. Wozu soll ich z.B. Manufakturen noch ausbauen. Es werden ja nur noch die erweckten Güter gebraucht. Vielleicht findet jemand eine Begründung für mich, die mich trotz 29 Mio Edelsteinen dazu bringen kann, die Edelsteinmanus auszubauen. Ich habe schon einige Ausbauten mangels Sinnhaftigkeit nicht mehr vorgenommen. Da ja auch noch jede Weiterentwicklung mit Turniernachteilen verbunden ist und auch ich nicht gerade den angebotenen Wundern entgegen fiebere, fehlt mir jede Motivation für dieses Kapitel. Vieles, was in der Vergangenheit aufgebaut wurde, macht in den neueren keinen Sinn mehr. Ich könnte problemlos diverse Manus abreißen ohne meinen Spielfortschritt zu gefährden. Außerdem habe ich Unmengen an Portalsegen im Inventar, die im Spiel wie Kamelle im Karneval verteilt werden. Ich habe es schon mehrfach geschrieben, in den oberen Kapiteln gibt es von fast allem zu viel und auch noch großteils ohne Spielnutzen oder Verwendungsmöglichkeiten. Das beste an den Kapiteln sind die Graphiken und Ideen für die Gebäude. Für mich sollten Kapitel etwas bieten, um die Stadt durch Forschungen sinnvoll zu entwickeln und ich dann auch einen Nutzen habe, der über ein paar Ranglistenpunkte hinaus geht. Das ich einmal mit einem Plus von über 52.000 Bevölkerung in ein neues Kapitel gehe, weil so viel Ausbauten keinen Sinn gemacht haben, zeigt für mich eine schlechte Entwicklung des Spiels."}, {"110": "Vielen Dank für das Teleporter-Geschenk. [smilie--sprite8][smilie--sprite8][smilie--sprite8]"}, {"222": "Lorinar schrieb:\t\t\tVielen Dank für das Teleporter-Geschenk. [smilie--sprite8][smilie--sprite8][smilie--sprite8]Zum Vergrößern anklicken....Dem schließ ich mich an, ♥-lichen Dank dafür [smilie--sprite1] !"}, {"2": "...Kann man die Flaggschiffe eigentlich teleportieren?"}, {"219": "Romilly schrieb:\t\t\t...Kann man die Flaggschiffe eigentlich teleportieren?\t\tZum Vergrößern anklicken....Nein"}, {"21": "Ich hatte es befürchtet......[BR][BR]Das ist das langweiligste Kapitel ever..... da waren die Orks richtig spannend....oder die Elvenar .....[BR][BR]Ab der goßen Schiffe wird ja jeweils immer mit einem anderen Gastrassengut produziert, das sieht dann mit einem 2er Portal und einer Händlergilde auf 31( = Produktionsbonus 162 %)  so aus:[BR][BR][BR][BR]Bei den kleinen Schiffen funktioniert das genauso, nur mit dem jeweils anderen GR Gut.[BR][BR]Wenn man sich ausrechnet wieviel man für die Forschung braucht und wieviel jeweils die Produktions-Differenz = der \"Gewinn\" ist .......kann ich nur eines sagen: Winterschlaf machen.[BR][BR]Oder gleich nur mit den Flaggschiffen produzieren ..... beides dauert ewig."}, {"223": "Stimmt !!![BR][BR]Aber Gastrassen ziehen sich doch immer wie Kaugummmmmmmmi[BR]Das ist doch bekannt  [smilie--sprite2][BR][BR]Und .... ewig ???[BR][BR]Ich habe hier im Forum schon Stadtpläne der neuen Gastrasse gesehen -[BR]wenn da wirklich sooooo viele Schiffe gestellt werden - je mehr man stellen kann, [BR]umso besser - dann sollte man doch auch \"zügig\" durch das Kapitel kommen [BR][BR]Ich finde das Kapitel NICHT langweilig und die Schiffe sehen auch toll aus !!!"}, {"88": "Tja um viele Schiffe zu stellen, müßte ich aber auch viele Gebäude rausteleportieren, wodurch wieder Kultur und Arbeiter frei werden = weniger Unurium durch den Händler[BR]wie war das mit der Schlange die sich irgendwohin beißt ? [smilie--sprite11]"}, {"21": "King Luckybaby schrieb:\t\t\tStimmt !!![BR][BR]Aber Gastrassen ziehen sich doch immer wie Kaugummmmmmmmi[BR]Das ist doch bekannt  [smilie--sprite2][BR][BR]Und .... ewig ???[BR][BR]Ich habe hier im Forum schon Stadtpläne der neuen Gastrasse gesehen -[BR]wenn da wirklich sooooo viele Schiffe gestellt werden - je mehr man stellen kann,[BR]umso besser - dann sollte man doch auch \"zügig\" durch das Kapitel kommen[BR][BR]Ich finde das Kapitel NICHT langweilig und die Schiffe sehen auch toll aus !!!\t\tZum Vergrößern anklicken....[BR]Naja .... ich hab jetzt die 3 Flaggschiffe und je zwei von den großen stehen. Dazu kommen später noch 7/7/6 kleine Schiffe..... meine Hochrechnung liegt bei mindestens 16-18 Wochen mit normalem Spielverlauf ohne irgendwelche booster etc. Das ist schon ein ziemlich langweiliges Geduldsspiel ......."}, {"224": "Ich habe heute mal die Email geöffnet, bei der stand, hole dir zur neuen Gastrasse ein Geschenk ab. Ich klickte und startete das Spiel, aber bekam nichts ? Was sollte denn das Geschenk sein ?"}, {"2": "sable404 schrieb:\t\t\tIch habe heute mal die Email geöffnet, bei der stand, hole dir zur neuen Gastrasse ein Geschenk ab. Ich klickte und startete das Spiel, aber bekam nichts ? Was sollte denn das Geschenk sein ?\t\tZum Vergrößern anklicken....[BR]Cruller schrieb:Danke schön, @InnoGames, für das[BR]Begrüßungsgeschenk.[BR]Anhang 21828 ansehen[BR]​Zum Vergrößern anklicken.......na - ein Teleporter [smilie--sprite1]"}, {"224": "ok danke, aber da stand bei mir nicht dieses \"neu\" darüber [smilie--sprite3]"}, {"88": "jo, das Geschenk bekam dieses Mal jeder unabhängig davon ob er über die email reinging oder nicht, war einfach da"}, {"219": "@Indianaking :[BR]wenn man die kleinen Schiffe hat, kann man dann die grossen abreissen ?[BR]oder muss eins stehenbleiben ?"}, {"219": "Primus71 schrieb:\t\t\twenn man die kleinen Schiffe hat, kann man dann die grossen abreissen ?[BR]oder muss eins stehenbleiben ?\t\tZum Vergrößern anklicken....Kann man abreißen.[BR][BR]Edit:[BR]Wenn du das große Piratenschiff nicht möchtest, kannst du die kleinen Piratenschiffe auch mit der Red Perl verbinden.[BR][IMG]https://i.ibb.co/D4Nt2ZP/https-de-forum-elvenar-com-index-php-attachments-1605022685787-png-21990.png[/IMG][BR][BR]Die Red Perl, Esperia und die Sanfte Sorena musst du stehen lassen.[BR]Alle großen jedoch nicht, auch müssen die großen nicht zwingend mit diesen 3 obengenannten verbunden sein, wenn du kleine z.B. Piratenschiffe dazwischen setzt und dann wieder ein großes, dann geht das auch.[BR][BR]Edit 2:[BR][BR]Hier siehst du nun kein großes sondern nur keine angebunden an die Red Perl, Esperia und die Sanfte Sorena[BR][BR][IMG]https://i.ibb.co/qnMym3H/https-de-forum-elvenar-com-index-php-attachments-1605023498453-png-21991.png[/IMG][BR][BR].... und die kleinen laufen dann genauso ... ... ."}, {"21": "Primus71 schrieb:@Indianaking :[BR]wenn man die kleinen Schiffe hat, kann man dann die grossen abreissen ?[BR]oder muss eins stehenbleiben ?\t\tZum Vergrößern anklicken....[BR]Jo, hat Aslan eh schon beantwortet.[BR][BR]Ich hab reiflich hin und her überlegt ob ich die großen nicht doch wegen der längeren Produktionsdauer über Nacht stehen lassen, und zusätzlich die kleinen dranpacke. Bringt aber so gut wie nix, da die kleinen viel effizienter sind, auch in der ( leider am längsten) 3 Stunden Phase.[BR][BR]Also: wenn man die Möglichkeit hat öfter mal einzusammeln lohnen sich die kleinen Schiffe in jedem Fall, am besten noch in Zusammenhang mit ner gut ausgebauten Händlergilde. Dann können die großen Schiffe auch weg. Die Flaggschiffe müssen natürlich stehenbleiben. Bin seit gestern am Umrüsten, wegen Unurium dauerts halt. In ca. 2 Tagen wird das settlement dann stehen.[BR][BR][BR][BR]Dennoch: man muß ne ziemlich lange Zeit einplanen. In meinem Fall ca. 3-4 Monate."}, {"219": "ok, das mach ich dann auch so. bin eh des öfteren on[BR][BR]aber 3-4 Monate ???  bist du dir da sicher ?[BR][BR]auch wenn der Handelsplatz auf 4 ausgebaut ist ?[BR][BR]und ich habe ja bei weitem nicht soviel Platz übrig, kriege nur max 7 von den kleinen Schiffen jeweils hin [smilie--sprite3][BR][BR]allerdings ist meine Händlergilde auf 35, das könnte helfen [smilie--sprite1]"}, {"217": "Indianaking schrieb:\t\t\tDennoch: man muß ne ziemlich lange Zeit einplanen. In meinem Fall ca. 3-4 Monate.\t\tZum Vergrößern anklicken....Wow, ich werd grade mal die Hälfte an kleinen Schiffen unterbringen - das bedeutet dann wohl bis nächsten Sommer...."}, {"21": "Primus71 schrieb:\t\t\tok, das mach ich dann auch so. bin eh des öfteren on[BR][BR]aber 3-4 Monate ???  bist du dir da sicher ?[BR][BR]auch wenn der Handelsplatz auf 4 ausgebaut ist ?[BR][BR]und ich habe ja bei weitem nicht soviel Platz übrig, kriege nur max 7 von den kleinen Schiffen jeweils hin [smilie--sprite3][BR][BR]allerdings ist meine Händlergilde auf 35, das könnte helfen [smilie--sprite1]Zum Vergrößern anklicken....[BR]Naja, man darf ja nicht vergessen daß die Produktionen der Schiffe nicht zu 100% gerechnet werden können, da man immer einen gewissen Anteil eines anderen Gastrassengutes zum Produzieren benötigt. Ich habs mal überschlagen und komme auf ca. 35 % die man jeweils abziehen muß für den \"Reingewinn\".[BR]Beispiel: ich habe zZ 12 von den kleinen Piratenschiffen stehen. Mit meinem Handelsplatz auf 3 und der Händlergilde auf 32 kann ich bei 15 minütiger Abholung 1200 Luxusartikel pro Stunde abholen. ABER: kein Mensch kann wochenlang alle 15 Minuten die Schiffe abholen, nicht jeder hat eine hoch ausgebaute Händlergilde, dazu muß man noch die 35 % von den max. 1200 Luxusartikeln abziehen, d.h. man kommt auf aller allerhöchstens rund 750 pro Stunde. Diese Menge verringert sich natürlich bei den längeren Produktionen von 30 Min, 1 Std. bzw 3 Stunden, sodaß ich tagsüber als Stundenschnitt 500 Luxusartikel pro Stunde ansetze- das ist schon ziemlich aufwändig im handling [smilie--sprite11] - und letztendlich als Tagesschnitt 6000 - mal bißchen mehr, mal weniger - je öfter man halt abholen kann.[BR]Diese Mengen kann man auch auf die anderen Artikel ansetzen, da die Artefakte ca. die Hälfte der Luxusgüter betragen, die Delikatessen ca. das doppelte.[BR]Wenn man sich jetzt die Mengen die in der Forschung benötigt werden anschaut kann man erkennen daß sich die ganze Sache wirklich unheimlich hinzieht......"}]