[{"219": "Primus71 schrieb:\t\t\taber 3-4 Monate ??? bist du dir da sicher ?\t\tZum Vergrößern anklicken....Ja ganz sicher, es sei denn du beschleunigst mit Zeitis oder Dias, aber allein die Mengen die du benötigst für die Forschung sind \"abnormal\". [BR]So wie es @Indianaking ein post zuvor auch schon beschrieb, du hast ja keine 100% von dem was du da abfarmst bei den Schiffen, denn ein Teil geht ja wieder in die Produkt. anderer Schiffe um die wiederum zu starten. Das ziiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiieht sich wie Kaugummi."}, {"57": "wie macht ihr das mit der Saat?  [BR][BR]jetzt kommt ja fast nichts mehr dazu wegen dem Unurium und man kann ja auch keine Manus wegreissen für Saatgebäude, sonst kriegt man ja wenig Unurium und man soll auch noch weiter erweckte Güter produzieren...... [BR]Das ist schon *blöd* gelöst mit dem Händler, das man nur entweder/oder machen kann auf Dauer und die Schiffsflotte steht ja anscheinend monatelang in deiner Stadt.....?"}, {"2": "LuxuriantSilver schrieb:\t\t\twie macht ihr das mit der Saat?[BR][BR]jetzt kommt ja fast nichts mehr dazu wegen dem Unurium und man kann ja auch keine Manus wegreissen für Saatgebäude, sonst kriegt man ja wenig Unurium und man soll auch noch weiter erweckte Güter produzieren......[BR]Das ist schon *blöd* gelöst mit dem Händler, das man nur entweder/oder machen kann auf Dauer und die Schiffsflotte steht ja anscheinend monatelang in deiner Stadt.....?\t\tZum Vergrößern anklicken........hatte das schon im Beta-Thread geschrieben und auch jetzt Live schon umgesetzt - über Nacht/Langzeit Unurium produzieren und wenn man oft im 3-Std.-Rhythmus absammeln kann, besser Saat - kommt aber drauf an, wie bei dir der jeweilige Bonus ausfällt (außerdem hab ich die Sonnentürme gegen den Zerfall der Saat)...."}, {"57": "okay gute idee danke @Romilly , dann werd ich tagsüber Saat produzieren, so hab ich noch nicht gedacht [smilie--sprite10]"}, {"219": "Mein Kommentar :  uffuff   [smilie--sprite12]"}, {"4": "wenn ich das lese, hab ich absolut keine Lust auf die neue Gastrasse.[BR][BR]Hatte schon mal bei recht gut gefülltem Saatlager auf Unurium umgestellt, nach spätestens 2 Tagen hatte ich keine Saat mehr und mußte wieder auf Saat umstellen beim Händler.[BR][BR]Ich  mag gerne Platz haben, um den Anforderungen von Events und GA zu entsprechen und meine Gilde zu versorgen. Der Abriss bzw. das Einlagern von Häusern, um Platz zu haben für die Gastrasse, bedeutet im Umkehrschluss, dass ich monatelang nichts machen kann als nur die Gastschiffe abzusammeln. und das wiederum langweilt mich entsetzlich. [BR][BR]Oder wie macht ihr das?"}, {"21": "salandrine schrieb:\t\t\twenn ich das lese, hab ich absolut keine Lust auf die neue Gastrasse.[BR][BR]Hatte schon mal bei recht gut gefülltem Saatlager auf Unurium umgestellt, nach spätestens 2 Tagen hatte ich keine Saat mehr und mußte wieder auf Saat umstellen beim Händler.[BR][BR]Ich  mag gerne Platz haben, um den Anforderungen von Events und GA zu entsprechen und meine Gilde zu versorgen. Der Abriss bzw. das Einlagern von Häusern, um Platz zu haben für die Gastrasse, bedeutet im Umkehrschluss, dass ich monatelang nichts machen kann als nur die Gastschiffe abzusammeln. und das wiederum langweilt mich entsetzlich.[BR][BR]Oder wie macht ihr das?\t\tZum Vergrößern anklicken....[BR][BR]Genau so. Deshalb hatte ich letzten Mittwoch schon geschrieben daß das das langweiligste Kapitel ever ist [smilie--sprite10] Man kann echt nur die Schiffe absammeln und sonst so gut wie nix machen.... ausser Turnier, Turm und so. Aber Platz für GA oder events kann man sich für lange Zeit abschminken. Oder man opfert nicht soviel Platz und plant weitere Wochen ein ....[BR][BR]In jedem Fall ist es völlig unverständlich warum man ein solch langweilig-quälendes Kapitel designt, das noch dazu kaum spielrelevante Verbesserungen bringt."}, {"219": "Indianaking schrieb:\t\t\tGenau so. Deshalb hatte ich letzten Mittwoch schon geschrieben daß das das langweiligste Kapitel ever ist [smilie--sprite10] Man kann echt nur die Schiffe absammeln und sonst so gut wie nix machen.... ausser Turnier, Turm und so. Aber Platz für GA oder events kann man sich für lange Zeit abschminken. Oder man opfert nicht soviel Platz und plant weitere Wochen ein ....[BR][BR]In jedem Fall ist es völlig unverständlich warum man ein solch langweilig-quälendes Kapitel designt, das noch dazu kaum spielrelevante Verbesserungen bringt.\t\tZum Vergrößern anklicken...... .. .. und das schlimmste ist, du kannst nichts einlagern. [smilie--sprite10]"}, {"4": "Ich fand die Elvenar noch irgendwie machbar, die Botschaften waren absolut ätzend und haben kaum Vorteile gebracht. Ich war sehr froh, als ich diese hinter mir gelassen hatte. Wenn jetzt die Händler noch deutlich länger brauchen, nee, nicht mit mir. Macht mir absolut keinen Spaß mehr."}, {"225": "Romilly schrieb:\t\t\t....hatte das schon im Beta-Thread geschrieben und auch jetzt Live schon umgesetzt - über Nacht/Langzeit Unurium produzieren und wenn man oft im 3-Std.-Rhythmus absammeln kann, besser Saat - kommt aber drauf an, wie bei dir der jeweilige Bonus ausfällt (außerdem hab ich die Sonnentürme gegen den Zerfall der Saat)....\t\tZum Vergrößern anklicken....[BR]Das ist interessant, ich mache es genau andersherum, was natürlich auch mit meiner Stadt zusammenhängt.[BR]Ich habe immer eine große Fläche in der Mitte frei, für Events und vor allem GA. Daher ist meine Unuriumproduktion lächerlich (z.Z. 9.200/3h).[BR]Ich bin also auf den Abholbonus für Unurium angewiesen, um wenigstens ein bisschen zu Potte zu kommen.[BR]Für die Saat habe ich 6 Verkaufsstände aufgestellt, so dass ich Saat nur bei Bedarf anmachen muss, vorzugsweise über die Schlafzeit."}, {"226": "Ich kann die Questliste der Italiener übersetzen, aber nicht kopieren. Hat schon jemand eine deutsche?"}, {"219": "achilles7453 schrieb:\t\t\tIch kann die Questliste der Italiener übersetzen, aber nicht kopieren. Hat schon jemand eine deutsche?\t\tZum Vergrößern anklicken....Alle 84 Quests der Storyline (Zuletzt aktualisiert am: 10.12.2020 / Storyline beendet)[BR]Spoiler: Storyline - Händler von Unur[IMG]https://i.ibb.co/YyvN4L0/https-de-forum-elvenar-com-index-php-attachments-1607063647282-png-22381.png[/IMG][BR]01. Kaufe 5 WP[BR]02. Verwende 10 Mal Segen (z.B. WP-, Münz-, Vorrats-Segen)[BR]03. Sammle 20 Relikte[BR]04. Erkunde eine Provinz[BR]05. Produziere 10 x Bessere Werkzeuge (Werkstatt 3h)[BR]06. Schalte den verbesserten Händler frei[BR]07. Erwirtschafte 500.000 Mana[BR]08. Baue den Händler auf Stufe 6 aus[BR]09. Sammle 50.000 Göttliche Saat ein[BR]+ Erwirtschafte 50.000 Unurium[BR]10. Bilde 5000 Einheiten aus[BR]11. Produziere 10x Getränke (Werkstatt 5 Min.)[BR]12. Sammle 5.000.000 Münzen[BR]13. Erwirtschafte 20.000 Unurium[BR]14. Spende 5,000 Zauberspruch-Fragmente[BR]15. Schalte den Handelsplatz frei[BR]16. Erkunde 1 Provinz[BR]17. Gib 50 Wissenspunkte aus[BR]18. Baue den Handelsplatz[BR]19. Schalte das Flaggschiff der Piraten frei[BR]20. Lasst die Red Pearl vor Anker gehen[BR]21. Sammle 1.000 Luxuriöse Luxusartikel[BR]22. Schalte das Flaggschiff der Gourmets frei[BR]23. Lasst die „Sanfte Sorena“ vor Anker gehen[BR]24. Sammle 2000 Leckere Leckereien[BR]25. Schalte das Flaggschiff der Sammler frei[BR]26. Lasst die Esperia vor Anker gehen[BR]27. Sammle 500 Uralte Artefakte[BR]28. Sammle 40.000 Elvenarin Zero[BR]29. Schalte den Handelsplatz 2 frei[BR]+ Hab 490 Provinzen abgeschlossen[BR]30. Baue den Handelsplatz auf Stufe 2 aus[BR]31. Schalte die großen Piratenschiffe frei[BR]32. Schalte die großen Sammlerschiffe frei[BR]33. Schalte die großen Gourmetschiffe frei[BR]34. Besitze mindestens ein großes Piratenschiff[BR]+ Besitze mindestens ein großes Gourmetschiff[BR]+ Besitze mindestens ein großes Sammlerschiff[BR]35. Sammle 2000 Luxuriöse Luxusartikel[BR]+ Sammle 4000 Leckere Leckereien[BR]+ Sammle 1000 Uralte Artefakte[BR]36. Verwende 10 Booster Zauber (Zeit-Booster)[BR]37. Rufe alle (3 Stück) großen Piratenschiffe herbei[BR]+ Rufe alle (3 Stück) großen Gourmetschiffe herbei[BR]+ Rufe alle (3 Stück) großen Sammlerschiffe herbei[BR]38. Schalte den Handelsplatz 3 frei[BR]39. Bau den Handelsplatz auf Stufe 3 aus[BR]40. Handle 10 Mal mit dem Händler[BR]+ Gib 10 Handelsangebote in Auftrag[BR]+ Nimm 10 Handelsangebote an[BR]41. Schalte die kleinen Piratenschiffe frei[BR]42. Schalte die kleinen Sammlerschiffe frei[BR]43. Schalte die kleinen Gourmetschiffe frei [BR]44. Rufe mindesten 3 kleine Piratenschiffe herbei[BR]+ Rufe mindesten 3 kleine Gourmetschiffe herbei[BR]+ Rufe mindesten 3 kleine Sammlerschiffe herbei[BR]45. Gib 20 x Nachbarschaftshilfe[BR]46. Schalte den Handelsplatz 4 frei[BR]+ Habe 500 Provinzen abgeschlossen[BR]47. Baue den Handelsplatz auf Stufe 4 aus[BR]48. Gib 100 Wissenspunkte aus[BR]49. Erkunde eine Provinz[BR]50. Schließe 40 Provinz- oder 40 Turnierbegegnungen ab[BR]51. Spende 50.000.000 Münzen[BR]52. Schalte die Ausbauten für die traditionelle Elixiermanufaktur frei[BR]+ Schalte die Ausbauten für die Magiestaubmanufaktur der Goblins frei[BR]+ Schalte die Ausbauten für die Manufaktur der Geodenentkernung frei[BR]53. Besitze mindestens 2 Magiestaub-, Elixier- und/oder Edelsteinmanufakturen der Stufe 28 oder höher[BR]54. Sammle 20 Relikte[BR]55. Rufe mindestens 5 kleine Sammlerschiffe herbei[BR]56. Schalte die Festung, den Brunnen und den Palast frei[BR]57. Baue eines der drei neuen Kulturgebäude[BR]58. Schalte die Kasernen im Händlerstil frei[BR]59. Sammle 20.000 Uralte Artefakte[BR]60. Schalte die Stadterweiterung 51 frei[BR]61. Verkaufe mindestens 3 kleine Sammlerschiffe [BR]+ Rufe mindesten 6 kleine Gourmetschiffe herbei[BR]62. Schalte die Rüstkammern im Händlerstil frei[BR]63. Baue mindestens 1 Rüstkammer auf Stufe 38 aus[BR]64. Schalte die finalen Wohngebäude im Stil der Elvenar frei[BR]65. Besitze 10 Wohngebäude der Stufe 38[BR]66. Schalte das Trainingsgelände im Händlerstil frei[BR]67. Baue dein Trainingsgelände auf Stufe 29 aus[BR]+ Bilde 5000 ruppige Ork-Krieger aus[BR]+ Bilde 5000 leitende Ork-Strategen aus[BR]68. Verkaufe mindestens 3 Gourmetschiffe[BR]+ Rufe mindestens 6 kleine Piratenschiffe herbei[BR]69. Sammle 80.000 Luxuriöse Luxusartikel[BR]70. Schalte das Söldnerlager im Händlerstil frei[BR]71. Baue dein Söldnerlager auf Stufe 21 aus[BR]72. Hab 510 Provinzen abgeschlossen[BR]73. Verwende 10 Booster-Zauber (Zeit-Booster)[BR]74. Besitze mindestens 3 Werkstätten der Stufe 39 oder höher[BR]75. Spende 600.000 Mana[BR]76. Spende 60.000 Göttliche Saat[BR]77. Schalte das finale Hauptgebäude im Stil der Elvenar frei[BR]78. Sammle 20 Relikte[BR]79. Verwende 20 Zaubersprüche[BR]80. Produziere 20 x Getränke (Werkstatt 5 min.)[BR]+ Produziere 10 x Brot (Werkstatt 1 Std.)[BR]+ Produziere 5 Gemüsekörbe (Werkstatt 9 Std.)[BR]81. Erwirtschafte 60.000 Unurium (Hier gibt es die 200 Diamanten als Belohnung)[BR]82. Verkaufe deinen Handelsplatz[BR]83. Investiere 100 Wissenspunkte in ein Antikes Wunder eines anderen Spielers[BR]84. Leiste 50 x Nachbarschaftshilfe[BR][BR]-- -- -- -- -- -- -- -- -- -- -- -- E N D E -- -- -- -- -- -- -- -- -- -- -- --[BR][BR]!! Quest 67. und 71. ist Ablehnbar !![BR][BR]Quest 37. enthält ein Premium-Gebäude:[BR]"}, {"226": "Vielen Dank, Aslan"}, {"227": "achilles7453 schrieb:\t\t\tIch kann die Questliste der Italiener übersetzen, aber nicht kopieren. Hat schon jemand eine deutsche?\t\tZum Vergrößern anklicken....[BR]Ich hab die italienische Questliste aus dem Quelltext herauskopiert, separat als HTML aufgerufen und die Seite dann übersetzen lassen. Poste hier also mal alle 84 Aufgaben. (Die Übersetzung klingt teilweise etwas kauderwelschig, aber man kommt dahinter, was gemeint ist! [smilie--sprite2])[BR][BR]Spoiler: Storyline-Quests Händler von Unur Nr. 1–845 Stück kaufenNutze 10 MomenteHolen Sie sich 20 Relikte1 Provinz erkunden10-mal komplexe Werkzeuge herstellenschaltet den Advanced Trader 4 freiErhalte 500.000 Manaverbessert den Trader auf Level. 6Erhalte 50.000 göttliche Samen + 50.000 Unurientrainiert 5.000 Einheitenmache 10 mal Getränke5.000.000 Münzen erhaltenSie erhalten 20.000 UnurienGewährt 5.000 ZaubersplitterSchalte die Mall frei1 Provinz erkunden50 Wissenspunkte ausgebenBaue die MallSchalte das Schiff mit der Piratenflagge freiLass die Rote Perle vor Anker gehenSie erhalten 1.000 luxuriösen LuxusSchalte das Gourmet-Flaggschiff freiLass Gentle Sorena vor Anker gehenSie erhalten 2.000 köstliche Köstlichkeitenschaltet das Schiff mit der Sammlerflagge freiLass die Esperia vor Anker gehenHolen Sie sich 500 alte ArtefakteSie erhalten 40.000 Null Elvenarinschaltet Level 2 Shopping Center + 490 fertiggestellte Provinzen freiverbessert das Einkaufszentrum bei liv. 2schalte das große Piratenschiff freischaltet das große Sammlerschiff freischalte das große Gourmetschiff freibesitze mindestens 1 großes Piratenschiff + 1 großes Gourmetschiff + 1 großes SammlerschiffErhalten Sie 2.000 luxuriösen Luxus + 4.000 köstliche Köstlichkeiten + 1000 antike ArtefakteNutze 10 MomenteBeschwöre alle großen Piratenschiffe + große Gourmetschiffe + große Sammlerschiffeschaltet die Shopping Center-Ebene frei. 3verbessert das Einkaufszentrum bei liv. 310-mal mit dem Großhändler handeln + 10 Angebote platzieren + 10 Angebote annehmenschalte das kleine Piratenschiff freischalte das kleine Sammlerschiff freischalte das kleine Gourmetschiff freiBeschwöre alle kleinen Piratenschiffe + kleine Gourmetschiffe + kleine Sammlerschiffe20 Mal Hilfe für die Nachbarschaft leistenschaltet die Mall of Level frei. 4+ haben 500 abgeschlossene Provinzenverbessert das Einkaufszentrum bei liv. 4100 Wissenspunkte ausgeben1 Provinz erkundenLöse 40 Spiele oder TurnierspieleSpenden Sie 50.000.000 Münzenschaltet das Upgrade von Elixir + Magic Dust + Gems Manufacturing freiMindestens 2 Elixier- und / oder Magiestaub- und / oder Edelsteinmanufakturen auf Stufe haben. 28 oder höherHolen Sie sich 20 Reliktebeschwört mindestens 5 kleine Sammlerschiffeschaltet die Suche nach einer Festung, einem Brunnen und einem Palast freiBaue eines von drei neuen freigeschalteten Kulturgebäudenschaltet die Kaserne im Traders-Stil freiHolen Sie sich 20.000 alte Artefakteschaltet Erweiterung Nr. 51Verkaufe mindestens 3 kleine Sammlerschiffe + beschwöre mindestens 6 kleine Gourmetschiffeschaltet die Waffenkammern im Trader-Stil freiRüste mindestens eine Waffenkammer auf Lv auf. 38schaltet Residenzen im endgültigen Elvenar-Stil freibesitzen 10 Residenzen in liv. 38 oder höherschaltet Trainingsgelände im Trader-Stil freiVerbessere das Trainingsgelände auf Level 29 + trainiere 5.000 Kriegerorcs + 5.000 OrkstrategenVerkaufe mindestens 3 kleine Gourmetschiffe + beschwöre mindestens 6 kleine PiratenschiffeSie erhalten 80.000 luxuriösen Luxusschaltet das Söldnerlager im Trader-Stil freiverbessert das Lager der Söldner auf Level. 21eigene 510 fertiggestellte ProvinzenNutze 10 Momentemindestens 3 Laboratorien auf Stufe haben 39 oder höherGewährt 600.000 Manaspendet 60.000 göttliche Samenschaltet das Rathaus im endgültigen Elvenar-Stil freiHolen Sie sich 20 Relikteverwendet 20 ZauberProduziere 20 mal Getränke + 10 mal Brot + 5 mal Körbe mit LebensmittelnSie erhalten 60.000 UnurienVerkaufe die MallInvestiere 100 Wissenspunkte in das Ancient Wonder eines anderen SpielersHilf der Nachbarschaft 50 Mal"}, {"226": "Vielen Dank Nightwind"}, {"57": "hab eine wichtige Frage für Quest 37:[BR]37. Rufe alle (3 Stück) großen Piratenschiffe herbei[BR]+ Rufe alle (3 Stück) großen Gourmetschiffe herbei[BR]+ Rufe alle (3 Stück) großen Sammlerschiffe herbei [BR][BR]wenn man eben nicht soviel Platz hat um alle 9 gleichzeitig aufzubauen, reicht es wenn man die ersten 3 zb macht, damit der grüne Hacken kommt und dann löscht und die nächsten 3 aufbaut ? Gilt dann am Schluss die Quest als gelöst ?[BR][BR]Danke im voraus für eure Hilfe[BR]morgendliche Grüsse [BR]Silver"}, {"219": "LuxuriantSilver schrieb:\t\t\twenn man eben nicht soviel Platz hat um alle 9 gleichzeitig aufzubauen, reicht es wenn man die ersten 3 zb macht, damit der grüne Hacken kommt und dann löscht und die nächsten 3 aufbaut ? Gilt dann am Schluss die Quest als gelöst ?\t\tZum Vergrößern anklicken....In den letzten Kapitel'n hat genau das was du vor hast nicht gezählt, denn er löschte dann in der Storyline das häkchen wieder raus.[BR]Von dem her bin ich mir ziemlich sicher (zu 99%), dass es nicht geht, ergo du musst a' 3 Mal bauen.[BR][BR]Storyline - Händler von Unur (wird stets erweitert)! "}, {"57": "okay dankeschön das ist schlecht (für die Person), aber gut zu wissen @A S L A N"}, {"219": "LuxuriantSilver schrieb:\t\t\tokay dankeschön das ist schlecht (für die Person), aber gut zu wissen @A S L A N\t\tZum Vergrößern anklicken....Immer wieder gerne und auf Beta eben getestet - geht definitiv nicht dein Plan (wie ich zuvor schrieb).[BR]Captain Hook und Sparrow sind eben nicht so großzügig und haben unsere Pläne durschaut. [smilie--sprite2][BR][BR]Storyline - Händler von Unur (wird stets erweitert)!"}, {"11": "kann ich nur beim verbesserten händler unorium herstellen, oder gibt es da noch andere quellen??"}]