[{"6": "Solltest Du eine weitere Quelle finden, sag bitte unbedingt Bescheid!!!   [smilie--sprite1] [BR][BR]Spaß beiseite: geht bisher nur im Händler. In Kapitel 18 oder 19 werden aber bestimmt entsprechende Eventgebäude auftauchen."}, {"11": "ustoni schrieb:\t\t\tSolltest Du eine weitere Quelle finden, sag bitte unbedingt Bescheid!!!   [smilie--sprite1][BR][BR]Spaß beiseite: geht bisher nur im Händler. In Kapitel 18 oder 19 werden aber bestimmt entsprechende Eventgebäude auftauchen.\t\tZum Vergrößern anklicken....danke"}, {"6": "Ist dieser Quest wirklich euer Ernst? Echt?[BR][IMG]https://i.ibb.co/FHw0NdP/https-de-forum-elvenar-com-index-php-attachments-quest-jpg-22233.jpg[/IMG][BR]Vorherige Belohnungen mit je 5 Relikten waren schon ein Witz (ein schlechter).[BR][BR]Aber 50000 Schriftrollen? Ernsthaft?[BR]Ihr arbeitet also ernsthaft und intensiv am Schriftrollenproblem, soso.....[BR][BR]Wundert euch bitte nicht, wenn man euch nicht mehr wirklich ernst nimmt.  [smilie--sprite2]"}, {"21": "ustoni schrieb:\t\t\tIst dieser Quest wirklich euer Ernst? Echt?[BR]Anhang 22233 ansehen[BR]Vorherige Belohnungen mit je 5 Relikten waren schon ein Witz (ein schlechter).[BR][BR]Aber 50000 Schriftrollen? Ernsthaft?[BR]Ihr arbeitet also ernsthaft und intensiv am Schriftrollenproblem, soso.....[BR][BR]Wundert euch bitte nicht, wenn man euch nicht mehr wirklich ernst nimmt.  [smilie--sprite2]Zum Vergrößern anklicken....[BR]Was erwartest du? Die Quest heißt doch \"Eure Ansichten sind überraschend kurzsichtig \"[smilie--sprite7]"}, {"219": "Diese Händler von Unur sorgen für Unruhe [smilie--sprite7][BR][BR]So oft musste ich in diesen Forum folgenden Satz lesen .......... ...[BR]*\"Wir haben auch ein Real-Life und Familie ob man es glaubt oder nicht, wir schlafen auch .. ... . .. . .u.s.w.\"*[BR][BR]Doch nun kommt der Knaller, was denkt sich INNO eigentlich im Kapitel 17 oder hat man da generell nachgedacht?[BR][BR]Wärend INNO seine wohlverdiente Nachtruhe, Real-Life etc. möchte, dürfen oder sollen Spieler im Kapitel 17 einen 3 Stunden Schlaf vollbringen und vor die Hunde gehen?[BR][BR]Man soll laut Storyline XXX kleine Schiffchen bauen, aber hey INNO, ich schlafe mehr als 3 Stunden so wie ihr auch,[BR]warum also müssen diese kleinen Schiffe stehts einen unnötigen Leerlauf haben - Warum?[BR][BR]Da \"ich z.B.\" mehr als 6 stunden schlafe, steht alles jedes mal Stunden leer und was ist mit der arbeiten Bevölkerung?[BR]Hätte man hier nicht wenigstens einmal eine 6 Std. Produktionsphase einbauen können oder wollt ihr Spieler hier an den Rand des Nonsinns treiben?[BR][BR]Das Kapitel sowie deren Überlegungen sind gut, auch die Storyline, fast Fehlerfrei und nett geschrieben, aber diesen Punkt bitte ich zu überdenken! Denkt mal an eure eigenen Worte, \"wir haben auch ein Real-Life\".[BR]Ihr jedoch fesselt einen ja förmlich an die Matscheibe und kommt mir jetzt ja nicht mit dem Spruch, \"man muss das ja nicht\".[BR]Nein, wir lassen natürlich völlig Sinnbefreit alles leer stehen und schlafen natürlich lieber![BR][BR]Sind eh schon immense Mengen die da gefordert werden, aber dann noch diese unnötigen Leerpassagen - Wieso?[BR][BR]....... das ist 100% Feedback und soll definitiv zum nachdenken animieren, denn das ist in \"meinen Augen\" völlig Sinnbefreit![BR][BR]Laut Storyline soll man mind. 18 kleine Schiffe bauen (a' 6 von allen dreien). [BR](Ach ja .... und so klein sind diese kleinen Schiffe nicht mal, denn sie beanspruchen schon sehr viel Fläche)[BR]Demnach stehen bei Spielern die die Storyline spielen möchten, stets mind. 18 Schiffe völlig Sinnbefreit am Handelshafen, denn sie Produzieren nichts, weil man tatsächlich mehr als 3 Stunden schläft und nicht aller 3 Stunden vor der Matscheibe hocken möchte![BR][BR][IMG]https://i.ibb.co/pP4fHRN/https-de-forum-elvenar-com-index-php-attachments-1607154337220-png-22406.png[/IMG] [IMG]https://i.ibb.co/pW2XfzN/https-de-forum-elvenar-com-index-php-attachments-1607154569485-png-22407.png[/IMG] [IMG]https://i.ibb.co/jJmnR4M/https-de-forum-elvenar-com-index-php-attachments-1607154608848-png-22408.png[/IMG][BR][BR]Hinweis an das arbeitende Volk: [BR]Hier nimmt INNO GAMES \"Anscheinend\" weder Rücksicht an den gesunden Schlaf eines Menschen, noch an die arbeitende Bevölkerung.[BR][BR]Da man diese kleinen Schiffchen eine ganze (lange) Weile braucht und gar jede Menge davon, steigt der Frust über den Täglichen Verlust. Weil man eben zu oft Leerlauf hat! Es läuft dann eben Stunden nichts, es sei denn man schläft stets nur 3 Stunden und hockt ununterbrochen an der Matscheibe. Hier, genau hier vergeht einem der Spaß, so schön wie das Kapitel auch ist, aber das mindert den Spaß und die Freude extrem![BR][BR]Was man von einem hier erwartet erschließt sich mir nicht und dann muss ich aber Verständnis haben, wenn ich solche Sätze hier seitens INNO zu lesen bekomme (*siehe oben*).[BR][BR]Edit:[BR]Wie ihr, sind eure Spieler auch nur Menschen. Eine Maschine steuert dieses Spiel nicht!"}, {"6": "Dem kann ich in allen Punkten zustimmen.[BR][BR]Ich sehe noch eine mögliche alternative Lösung: nehmt die Begrenzung der großen Schiffe auf 3 je Typ raus, dann kann man auf die kleinen Schiffe verzichten und stattdessen mehr von den großen bauen.[BR]Ich persönlich kann auf die Questline verzichten."}, {"219": "ustoni schrieb:\t\t\tIch sehe noch eine mögliche alternative Lösung: nehmt die Begrenzung der großen Schiffe auf 3 je Typ raus, dann kann man auf die kleinen Schiffe verzichten und stattdessen mehr von den großen bauen.[BR]Ich persönlich kann auf die Questline verzichten.\t\tZum Vergrößern anklicken....Das wäre auch ein Möglichkeit. Ich lies gar alle 3 großen Schiffe stehen, damit wenigsten nicht gar so viel umsonst ist.[BR]Es ist verdammt ärgerlich, denn in keiner zu vorhergehenden Gast-Rasse, war es so EXTREM![BR][BR]Hier wurde nicht an die Spieler gedacht, denn dieses sind Menschen! Was man hier verlangt ist völlig daneben und dann diese enormen Mengen, sodass man mehr oder weniger mehr als nur a' 6 kleine Schiffe baut (sofern man kann).[BR][BR]Ich finde es schon fast dreist (meine Meinung), was man hier verlangt, aber das ist eben nur meine Meinung. Freunde macht man sich aber so definitiv nicht![BR]In jeder Manu. jeder Gast-Rasse, ist es so, dass die arbeitende Bevölkerung auch an diesem Spiel teilhaben kann.[BR]Hier jedoch soll man am Besten noch auf den Schlaf verzichten oder völlig Sinnbefreit etwas aufbauen, was ich aber niemals richtig nutzen kann? [BR][BR]Verstehen muss man ja zum Glück nicht alles, aber eines weiß ich persönlich nun ganz sicher, das hier keine Rücksicht genommen wird.[BR][BR]ustoni schrieb:\t\t\tIch persönlich kann auf die Questline verzichten.\t\tZum Vergrößern anklicken....Auf diese verzichten mittlerweile so viel wie du hier und da lesen kannst, dass sich die Schreiber eigentlich jedes mal umsonst die Mühe machen oder nur für einen ganz geringen Teil. Denn wie eben erwähnt, hier vergeht selbst mir die Lust und hier, genau hier hört Spaß auf![BR][BR]Edit: [BR]Im Atelier (Kapitel 15 - Elvenar) hat man doch auch 6 Auswahlmöglichkeiten und eben angemessene Zeiten! [BR]Warum kann man dies nicht auch bei den kleinen Schiffen tun (6 und 9 Stunden anhängen) oder eben wie von @ustoni beschrieben, die Begrenzung bei den großen Schiffen (nur 3 Stück) rausnehmen, denn dort habe ich Menschlich, machbare und angemessene Zeiten![BR][BR]Warum konnte man nicht noch ein wenig auf Feedback im Beta-Forum warten, bevor man dieses Kapitel (bereits 14 Tage später) auf den Live Server bringt.  Denn kein Spieler testet eine Gast-Rasse in Elvenar Grund- und Ausgiebig in nur 14 Tagen![BR][BR][BR]... .... und nein das stellt man nicht als IDEE in die IDEENSCHMIEDE, sondern dient hier als Feedback und ich appelliere hierbei besonders an die Menschlichkeit! Spielen soll Spaß machen!"}, {"6": "A S L A N schrieb:\t\t\tWarum kann man dies nicht auch bei den kleinen Schiffen tun (6 und 9 Stunden anhängen)\t\tZum Vergrößern anklicken....Das wäre ja noch nicht einmal nötig.[BR]Einfach die Produktionszeiten 15 Minuten und 30 Minuten herausnehmen und 6 Std. und 9 Std. einfügen.[BR]Ich kann mir beim besten Willen nicht vorstellen, dass sich jemand stumpf mehrere Stunden oder Tage an den PC setzt und alle 15 Minuten einsammelt und neue Produktionen anwirft. So stumpfsinnig kann einfach niemand sein.  [smilie--sprite2]"}, {"219": "ustoni schrieb:\t\t\tDas wäre ja noch nicht einmal nötig.[BR]Einfach die Produktionszeiten 15 Minuten und 30 Minuten herausnehmen und 6 Std. und 9 Std. einfügen.[BR]Ich kann mir beim besten Willen nicht vorstellen, dass sich jemand stumpf mehrere Stunden oder Tage an den PC setzt und alle 15 Minuten einsammelt und neue Produktionen anwirft. So stumpfsinnig kann einfach niemand sein. [smilie--sprite2]Zum Vergrößern anklicken......... oder so .... Na ja ich kenn da schon welche (mich eingeschlossen) jedoch keinen ganzen Tag. Ich hab das nun 2 mal ca. 6 Std. in 15 Minuten - Lauf gemacht (immer wieder mit Verspätungen, da auch ich nicht immer kann) um den Leerlauf wieder reinzuholen bzw. voran zukommen, aber danach bist du einfach nur frustriert, genervt, gelangweilt und fragst dich nur noch, was INNO sich dabei gedacht hat. Eine Art Old GA ala Brauerei-Abzeichen ohne Pause. Mitgedacht bzw. ordentlich nachgedacht wurde hier nicht. Auch nicht bei den Mengen der Siedlungsgüter, aber das ist eine andere Geschichte und hier vermute ich, hier wollte/möchte man lediglich die Spieler bremsen. Das ist auch noch in Ordnung, doch was absolut nicht in Ordnung geht ist der enorme Leerlauf pro Tag und man sitzt ja nicht nur 1-2 Tage in solch einer Gast-Rasse. Obendrein Frage ich mich dann auch, wie oder an was man hierbei gedacht hat, denn schlafen muss irgendwann jeder![BR][BR]Edit:[BR]Jemand der einen regulären 8 Stunden Arbeitstag hat und nicht in seiner Arbeitszeit mal eben ins Spiel kann etc., der wird hier gar doppelt bestrafft und hat stets und ständig einen Leerlauf. Doch daran hat \"anscheinend\" niemand gedacht und spätestens ab den Zeitpunkt vergeht es Spielern die eben nur außerhalb ihrer Arbeitszeit spielen können."}, {"219": "Primus71 schrieb:\t\t\tAls langjähriger Elvenarer hast du deinen Schlafrythmus noch nicht auf 2:59 umgestellt ?[BR][BR]tststs.....\t\tZum Vergrößern anklicken....Ja wenn du damit gut klar kommst und nur 3 Std. Täglich schläfst oder dein Schlaf verteilst am Tag, dann ist das deine Sache, dies macht aber sicher nicht die Mehrheit (die man hier ja immer so schön betont) und ich denke hier bewusst an all jene, die berufstätig sind und eben einen gesunden durchgängigen Schlaf brauchen und möchten! Demnach ist dein Sarkasmus unangebracht, denn ich spiele ein Spiel aus Spaß an der Freude nicht als Bestrafung."}, {"219": "ruhig ruhig  ich stimme dir ja zu  [smilie--sprite1]"}, {"219": "Primus71 schrieb:\t\t\truhig ruhig ich stimme dir ja zu [smilie--sprite1]Zum Vergrößern anklicken....Ich bin die Ruhe in Person ^^ nicht immer aber immer öfter [smilie--sprite7] OT-Ende[BR][BR]Ich habe 60 kleine Schiffchen da stehen und jeweils die 3 großen (also 9) sowie die 3 Hauptschiffe und es ist wahrlich ein graus zu sehen wie alles Stundenlang leer steht (völlig Sinnbefreit)."}, {"21": "Nun ja.... daß dieses Kapitel von vorne bis hinten Murks ist haben wir ja schon länger herausgefunden. Natürlich ist das mit den ausschließlich kurzen Produktionszeiten der kleinen Schiffe äusserst be....scheiden. Deshalb lasse ich mich aber doch nicht vom Spiel versklaven [smilie--sprite6] wenn ich länger on bin kann ich kurze Prodis starten.... sonst immer 3 Stunden + Leerlauf, was solls. Dauert ohnehin ewig und ist nach wie vor stinklangweilig und total unproduktiv."}, {"219": "Ich bin bei 45 Stück etwa (und auch nicht bereit die 10 Mondbiblio-Sets abzureissen,um noch mehr Platz zu haben)[BR]habe jetzt zwei Tage im 15min Takt verbracht und müsste noch 11 weitere so weitermachen um alles für die gesamte GR zu machen."}, {"219": "Indianaking schrieb:\t\t\tund ist nach wie vor stinklangweilig und total unproduktiv.\t\tZum Vergrößern anklicken....Genau so sieht es aus und das scheint dann im Interesse INNO zu sein ^^[BR]Das Spieler die Lust verlieren, es stinklangweilig finden etc. Mal nachdenken.[BR][BR][BR]Indianaking schrieb:\t\t\tNun ja.... daß dieses Kapitel von vorne bis hinten Murks ist haben wir ja schon länger herausgefunden.\t\tZum Vergrößern anklicken....Zum einen weil man ... ...[BR]A S L A N schrieb:\t\t\tWarum konnte man nicht noch ein wenig auf Feedback im Beta-Forum warten, bevor man dieses Kapitel (bereits 14 Tage später) auf den Live Server bringt. Denn kein Spieler testet eine Gast-Rasse in Elvenar Grund- und Ausgiebig in nur 14 Tagen!Zum Vergrößern anklicken...... ... .. dann hätte man noch etwas abändern etc. können (was man jetzt zwar auch noch kann, aber na ja).[BR]... ... und nein, niemand hat diesmal nach einer neuen Gast-Rasse geschrien, wenn ja, dann zeige man mir wo.[BR][BR][BR]Primus71 schrieb:\t\t\tch bin bei 45 Stück etwa (und auch nicht bereit die 10 Mondbiblio-Sets abzureissen,um noch mehr Platz zu haben)[BR]habe jetzt zwei Tage im 15min Takt verbracht und müsste noch 11 weitere so weitermachen um alles für die gesamte GR zu machen.\t\tZum Vergrößern anklicken....... ... und nun stelle dir all jene vor, die weder die Zeit haben, noch den Platz haben und obendrein ihren gesunden Schlaf brauchen. ^^[BR][BR]Ich spiele nun bereits 4 Wochen und bin ebenfalls noch lange nicht am Ende."}, {"6": "Soviel bringt der 15 min-Rhythmus meiner Meinung nach ohnehin nicht. Theoretisch könnte man so zwar 78% mehr als im 1 h-Rhythmus produzieren, in der Praxis dürfte das aber kaum möglich sein.[BR]Einsammeln und neue Produktionen anwerfen kostet etwas Zeit, außerdem wird es auch nicht wirklich gelingen, nach genau 15 Minuten wieder einzusammeln.[BR]Solange ich zu Hause bin und nichts anderes zu tun habe, verwende ich den 1 h-Rhythmus; das scheint mir der beste Kompromiss zu sein und man ist nicht zu sehr an den PC gebunden. Für mich sind damit sowohl die 15 Minuten als auch die halbe Stunde völlig überflüssig."}, {"228": "A S L A N schrieb:Diese Händler von Unur sorgen für Unruhe [smilie--sprite7][BR][BR]So oft musste ich in diesen Forum folgenden Satz lesen .......... ...[BR]*\"Wir haben auch ein Real-Life und Familie ob man es glaubt oder nicht, wir schlafen auch .. ... . .. . .u.s.w.\"*[BR][BR]Doch nun kommt der Knaller, was denkt sich INNO eigentlich im Kapitel 17 oder hat man da generell nachgedacht?[BR][BR]Wärend INNO seine wohlverdiente Nachtruhe, Real-Life etc. möchte, dürfen oder sollen Spieler im Kapitel 17 einen 3 Stunden Schlaf vollbringen und vor die Hunde gehen?[BR][BR]Man soll laut Storyline XXX kleine Schiffchen bauen, aber hey INNO, ich schlafe mehr als 3 Stunden so wie ihr auch,[BR]warum also müssen diese kleinen Schiffe stehts einen unnötigen Leerlauf haben - Warum?[BR][BR]Da \"ich z.B.\" mehr als 6 stunden schlafe, steht alles jedes mal Stunden leer und was ist mit der arbeiten Bevölkerung?[BR]Hätte man hier nicht wenigstens einmal eine 6 Std. Produktionsphase einbauen können oder wollt ihr Spieler hier an den Rand des Nonsinns treiben?[BR][BR]Das Kapitel sowie deren Überlegungen sind gut, auch die Storyline, fast Fehlerfrei und nett geschrieben, aber diesen Punkt bitte ich zu überdenken! Denkt mal an eure eigenen Worte, \"wir haben auch ein Real-Life\".[BR]Ihr jedoch fesselt einen ja förmlich an die Matscheibe und kommt mir jetzt ja nicht mit dem Spruch, \"man muss das ja nicht\".[BR]Nein, wir lassen natürlich völlig Sinnbefreit alles leer stehen und schlafen natürlich lieber![BR][BR]Sind eh schon immense Mengen die da gefordert werden, aber dann noch diese unnötigen Leerpassagen - Wieso?[BR][BR]....... das ist 100% Feedback und soll definitiv zum nachdenken animieren, denn das ist in \"meinen Augen\" völlig Sinnbefreit![BR][BR]Laut Storyline soll man mind. 18 kleine Schiffe bauen (a' 6 von allen dreien). [BR](Ach ja .... und so klein sind diese kleinen Schiffe nicht mal, denn sie beanspruchen schon sehr viel Fläche)[BR]Demnach stehen bei Spielern die die Storyline spielen möchten, stets mind. 18 Schiffe völlig Sinnbefreit am Handelshafen, denn sie Produzieren nichts, weil man tatsächlich mehr als 3 Stunden schläft und nicht aller 3 Stunden vor der Matscheibe hocken möchte![BR][BR]Anhang 22406 ansehen Anhang 22407 ansehen Anhang 22408 ansehen[BR][BR]Hinweis an das arbeitende Volk: [BR]Hier nimmt INNO GAMES \"Anscheinend\" weder Rücksicht an den gesunden Schlaf eines Menschen, noch an die arbeitende Bevölkerung.[BR][BR]Da man diese kleinen Schiffchen eine ganze (lange) Weile braucht und gar jede Menge davon, steigt der Frust über den Täglichen Verlust. Weil man eben zu oft Leerlauf hat! Es läuft dann eben Stunden nichts, es sei denn man schläft stets nur 3 Stunden und hockt ununterbrochen an der Matscheibe. Hier, genau hier vergeht einem der Spaß, so schön wie das Kapitel auch ist, aber das mindert den Spaß und die Freude extrem![BR][BR]Was man von einem hier erwartet erschließt sich mir nicht und dann muss ich aber Verständnis haben, wenn ich solche Sätze hier seitens INNO zu lesen bekomme (*siehe oben*).[BR][BR]Edit:[BR]Wie ihr, sind eure Spieler auch nur Menschen. Eine Maschine steuert dieses Spiel nicht!\t\tZum Vergrößern anklicken....Hallo zusammen. Ich bin zwar noch nicht so weit, aber wenn ich das alles so lese, dann vergeht mir schon jetzt die Lust auf diese Gastrasse. Ich hab es so schon nicht so leicht durch meine Arbeitszeiten, aber wenn ich mir das durchrechne werde ich viele Monate für diese Gastrasse benötigen. Da vergeht mir glaube ich schon jetzt die Lust. Es wäre wirklich schön, wenn man sowas wie Arbeitszeiten und Nachtruhen vielleicht berücksichtigen könnte. Vielen Dank im voraus."}, {"219": "[IMG]https://i.ibb.co/bQZv9hT/https-de-forum-elvenar-com-index-php-attachments-1607520930940-png-22480.png[/IMG][BR][BR]Ja, ja Arrrrrrrrrrrrrrr............ [BR]80k der Mann scheint was geraucht zu haben oder? [BR]Diese immensen Mengen sind echt ........ Arrrrrrrr!!!!![BR]Der Häuptling aller Piraten hat echt einen Hau-Degen weg.[BR][BR]Bremsen gut und schön liebes INNO TEAM, aber man kann es auch übertreiben ....... Arrrrrr! [smilie--sprite7][BR][BR]Das gibt so ein kleines Piratenschiffchen:[BR][BR][IMG]https://i.ibb.co/FwBNYmp/https-de-forum-elvenar-com-index-php-attachments-1607521168138-png-22481.png[/IMG][BR][BR]Arrrr!!! .......... Man erkennt die Bremse Arrrrrr!!![BR][BR]Ich hab 45 kleine Piratenschiffchen für den Ober-Guru der Schoschonen aufgebaut,[BR]doch es zieht sich wie Kauguuuuuuuuuummi Arrrr!!!![BR][BR]Das ist echt nicht lustig Arrr!!! [BR]und schon dreimal nicht wegen dem hier:[BR]Klickst du hier und liest du ........ Arrr!!! Vielleicht verstehst du dann die Ironie Arrr!!![BR][BR]Tolle Storyline (ohne Witz), aber die Mengen, die Leerläufe und die Belohnungen sowie[BR]der Frust der sich dadurch erzeugt, machen sie zur nichte, was ich sehr, sehr schade finde,[BR]denn die Grafik besonders vom Handelsplatz Stufe 4 ist beeindruckend.[BR][BR]Doch das hier ... ..... ...[BR][BR][IMG]https://i.ibb.co/KzVwg0t/https-de-forum-elvenar-com-index-php-attachments-1607521868564-png-22482.png[/IMG][BR][BR]... ..... sorgt von Sinn und Sinnlosigkeit. [BR][BR]Vielleicht haben ja die Nachzügler Glück und hier wird nochmal nachgearbeitet und ausgebessert, [BR]denn genau das ist der Grund, warum viele die Storyline gar nicht spielen, zumindest einer davon! [BR]Schade für den Schreiber und seine wirklich tolle Fantasie und Ideen.[BR][BR]Sollte es auch in der nächsten Gast-Rasse so sein, so werde ich auch keine Storyline mehr spielen,[BR]denn hier vergeht einem die Lust![BR]Angemerkt sei hier auch, man macht es in einem Gemeinschaftsabenteuer leichter [BR]und versucht den Spielern das viele ge-klicke zu nehmen,[BR]aber hier hat man dann das selbe in grün wieder zurück!?! .......Arrr!!![BR]Nur das man hier für Capitaine Jack Sparrow und Co. KG eben irgendwelche Murmeln anstatt Getränke einsammelt![BR][BR]Hier findest du die STORYLINE <<< anklicken!​"}, {"229": "Nightwind7KS schrieb:\t\t\tIch hab die italienische Questliste aus dem Quelltext herauskopiert, separat als HTML aufgerufen und die Seite dann übersetzen lassen. Poste hier also mal alle 84 Aufgaben. (Die Übersetzung klingt teilweise etwas kauderwelschig, aber man kommt dahinter, was gemeint ist! [smilie--sprite2])[BR][BR]Spoiler: Storyline-Quests Händler von Unur Nr. 1–845 Stück kaufenNutze 10 MomenteHolen Sie sich 20 Relikte1 Provinz erkunden10-mal komplexe Werkzeuge herstellenschaltet den Advanced Trader 4 freiErhalte 500.000 Manaverbessert den Trader auf Level. 6Erhalte 50.000 göttliche Samen + 50.000 Unurientrainiert 5.000 Einheitenmache 10 mal Getränke5.000.000 Münzen erhaltenSie erhalten 20.000 UnurienGewährt 5.000 ZaubersplitterSchalte die Mall frei1 Provinz erkunden50 Wissenspunkte ausgebenBaue die MallSchalte das Schiff mit der Piratenflagge freiLass die Rote Perle vor Anker gehenSie erhalten 1.000 luxuriösen LuxusSchalte das Gourmet-Flaggschiff freiLass Gentle Sorena vor Anker gehenSie erhalten 2.000 köstliche Köstlichkeitenschaltet das Schiff mit der Sammlerflagge freiLass die Esperia vor Anker gehenHolen Sie sich 500 alte ArtefakteSie erhalten 40.000 Null Elvenarinschaltet Level 2 Shopping Center + 490 fertiggestellte Provinzen freiverbessert das Einkaufszentrum bei liv. 2schalte das große Piratenschiff freischaltet das große Sammlerschiff freischalte das große Gourmetschiff freibesitze mindestens 1 großes Piratenschiff + 1 großes Gourmetschiff + 1 großes SammlerschiffErhalten Sie 2.000 luxuriösen Luxus + 4.000 köstliche Köstlichkeiten + 1000 antike ArtefakteNutze 10 MomenteBeschwöre alle großen Piratenschiffe + große Gourmetschiffe + große Sammlerschiffeschaltet die Shopping Center-Ebene frei. 3verbessert das Einkaufszentrum bei liv. 310-mal mit dem Großhändler handeln + 10 Angebote platzieren + 10 Angebote annehmenschalte das kleine Piratenschiff freischalte das kleine Sammlerschiff freischalte das kleine Gourmetschiff freiBeschwöre alle kleinen Piratenschiffe + kleine Gourmetschiffe + kleine Sammlerschiffe20 Mal Hilfe für die Nachbarschaft leistenschaltet die Mall of Level frei. 4+ haben 500 abgeschlossene Provinzenverbessert das Einkaufszentrum bei liv. 4100 Wissenspunkte ausgeben1 Provinz erkundenLöse 40 Spiele oder TurnierspieleSpenden Sie 50.000.000 Münzenschaltet das Upgrade von Elixir + Magic Dust + Gems Manufacturing freiMindestens 2 Elixier- und / oder Magiestaub- und / oder Edelsteinmanufakturen auf Stufe haben. 28 oder höherHolen Sie sich 20 Reliktebeschwört mindestens 5 kleine Sammlerschiffeschaltet die Suche nach einer Festung, einem Brunnen und einem Palast freiBaue eines von drei neuen freigeschalteten Kulturgebäudenschaltet die Kaserne im Traders-Stil freiHolen Sie sich 20.000 alte Artefakteschaltet Erweiterung Nr. 51Verkaufe mindestens 3 kleine Sammlerschiffe + beschwöre mindestens 6 kleine Gourmetschiffeschaltet die Waffenkammern im Trader-Stil freiRüste mindestens eine Waffenkammer auf Lv auf. 38schaltet Residenzen im endgültigen Elvenar-Stil freibesitzen 10 Residenzen in liv. 38 oder höherschaltet Trainingsgelände im Trader-Stil freiVerbessere das Trainingsgelände auf Level 29 + trainiere 5.000 Kriegerorcs + 5.000 OrkstrategenVerkaufe mindestens 3 kleine Gourmetschiffe + beschwöre mindestens 6 kleine PiratenschiffeSie erhalten 80.000 luxuriösen Luxusschaltet das Söldnerlager im Trader-Stil freiverbessert das Lager der Söldner auf Level. 21eigene 510 fertiggestellte ProvinzenNutze 10 Momentemindestens 3 Laboratorien auf Stufe haben 39 oder höherGewährt 600.000 Manaspendet 60.000 göttliche Samenschaltet das Rathaus im endgültigen Elvenar-Stil freiHolen Sie sich 20 Relikteverwendet 20 ZauberProduziere 20 mal Getränke + 10 mal Brot + 5 mal Körbe mit LebensmittelnSie erhalten 60.000 UnurienVerkaufe die MallInvestiere 100 Wissenspunkte in das Ancient Wonder eines anderen SpielersHilf der Nachbarschaft 50 MalZum Vergrößern anklicken....Nr. 69 von wegen erhalte 80.000 Luxusartikel, die muss man herstellen"}, {"219": "Glessier schrieb:\t\t\tNr. 69 von wegen erhalte 80.000 Luxusartikel, die muss man herstellen\t\tZum Vergrößern anklicken....Deswegen nimmst du die oben drüber, denn diese wird Live gespielt und ist 100%"}]