[{"229": "A S L A N schrieb:\t\t\tDeswegen nimmst du die oben drüber, denn diese wird Live gespielt und ist 100%\t\tZum Vergrößern anklicken....danke"}, {"6": "@A S L A N: Ich hab schon bei Aufgabe 53 aufgegeben:[BR]\" Besitze mindestens 2 Magiestaub-, Elixier- und/oder Edelsteinmanufakturen der Stufe 28 oder höher\"[BR][BR]Diese Ausbauten kommen bei mir erst, wenn die Stadt umgestaltet wird, also nach Erledigen des Forschungsbaums.[BR]Die 80000 Kügelchen würde ich auf keinen Fall einzahlen. Ich lass mich doch nicht vera....en.[BR]Die Mengen, die an Gastrassengütern in den Forschungsfeldern verlangt werden sind bereits ein sehr schlechter Witz - vorsichtig ausgedrückt."}, {"88": "Ustoni, in der Quest wird nix eingezahlt, sondern nur gesammelt, und zwar Zeug das du sowiso für die Forschung brauchst.[BR][BR]Ich sehe daher Aslans Problem auch nicht.[BR][BR]Das ist ne Quest die problemlos nebenher läuft, außer man bekäme diese erst am Ende der Forschung und hätte keine Verwendung mehr für die 80k Perlen."}, {"219": "ustoni schrieb:\t\t\t@A S L A N: Ich hab schon bei Aufgabe 53 aufgegeben:[BR]\" Besitze mindestens 2 Magiestaub-, Elixier- und/oder Edelsteinmanufakturen der Stufe 28 oder höher\"[BR][BR]Diese Ausbauten kommen bei mir erst, wenn die Stadt umgestaltet wird, also nach Erledigen des Forschungsbaums.[BR]Die 80000 Kügelchen würde ich auf keinen Fall einzahlen. Ich lass mich doch nicht vera....en.[BR]Die Mengen, die an Gastrassengütern in den Forschungsfeldern verlangt werden sind bereits ein sehr schlechter Witz - vorsichtig ausgedrückt.\t\tZum Vergrößern anklicken...... ... na ja ich bin ja neugierig und möchte die Geschichten lesen.[BR]Bereite dich auf viiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiel Mana vor, nur das Drachenkloster und Zauber wird nicht langen.[BR][BR]Mein DK ist auf Stufe 21 und gibt pro Zauber 20370. Ich hatte so Pie mal Daumen vor beginn der der Gast-Rasse weit über 1k verzauberte Vorräte und Mitgift. Doch diesmal langte selbst das nicht aus. [smilie--sprite3][BR]Allein für Ausbauten geht so viel Mana flöten, dass ich jeden nur wärmstens empfehlen kann, Mana-Gebäude aufzustellen.[BR]Durch Forschung, Ausbau geht so viel drauf, das ich bei 10 Millionen Mana aufgehört hab zu zählen und nein ich habe noch nicht einmal die Manus voll ausgebaut, sondern nur 6 von 12 und die nur 2 Stufen. Das HG und deren Forschung hat das meiste gefressen."}, {"219": "Questor Thews schrieb:\t\t\tDas ist ne Quest die problemlos nebenher läuft, außer man bekäme diese erst am Ende der Forschung und hätte keine Verwendung mehr für die 80k Perlen.\t\tZum Vergrößern anklicken....Stimmt nicht so ganz, denn spielst du nach der Storyline, hast du die geforderten Mengen für die Forschung längst fertig, jedoch sammelst du für die Katze weiter. ;-) Also nichts mit so nebenher ^^[BR][BR][IMG]https://i.ibb.co/zhp7gfP/https-de-forum-elvenar-com-index-php-attachments-1607526679428-png-22486.png[/IMG][BR][BR]Die Antike Wunder-Forschung sowie die Wege, kosten keine Siedlungsgüter mehr, von dem her bin ich fertig, aber nein da ist ja noch die Storyline!"}, {"88": "OK, ja dann verstehe ich deine Aufregung, das wäre für mich dann auch der Zeitpunkt wo ich die Storyline abbreche und aufs nächste Kap zum Ablehnen warte"}, {"219": "Questor Thews schrieb:\t\t\tOK, ja dann verstehe ich deine Aufregung, das wäre für mich dann auch der Zeitpunkt wo ich die Storyline abbreche und aufs nächste Kap zum Ablehnen warte\t\tZum Vergrößern anklicken....Ich habe exakt immer so geforscht und das ausgebaut sowie gebaut was laut Storyline gefordert wird. [BR]Ergo ich bin dem Pfad exakt so gelaufen, das ich nirgends lang warten musste und in der Tat immer alles vollzählig hatte [BR](sogar etwas mehr / da ich mehr kleine Schiffe baute, wie INNO sich das wahrscheinlich gedacht hat).[BR]Nach dieser Quest kommt nichts mehr was großartig Anstrengung kostet, nur so Sachen wie, stelle Getränke her etc. und schalte das HG letzte Stufe frei (welches ich dank Turnier und mehr Schiffe bereits habe), dennoch soll man für die Quest weiter produzieren. Demnach eine gewollte Bremse. Schade eigentlich, denn die Storyline liest sich bis dahin recht nett."}, {"88": "Ich schaus mir mal an wie weit ich komme, ich habe ja nicht so viel teleportiert wie du und dümpel mit 18 kleinen Schiffen rum, (die Großen habe ich stehen lassen und nicht alles auf kleine umgebaut, kost mich zuviel Unurium)[BR]ich wollte auch noch einen Puffer haben falls doch mal wieder ein \"normales\" GA kommt wo man Platz für kleine Werke und Manus braucht, und nicht wieder so ein GA wie letztes Mal, wo Platz nicht mehr das Problem ist"}, {"219": "Questor Thews schrieb:\t\t\tIch schaus mir mal an wie weit ich komme, ich habe ja nicht so viel teleportiert wie du und dümpel mit 18 kleinen Schiffen rum, (die Großen habe ich stehen lassen und nicht alles auf kleine umgebaut, kost mich zuviel Unurium)\t\tZum Vergrößern anklicken....Also die Sorge mit dem Unurium ist totaler Quatsch, denn ich hatte nie Probleme damit. Schau mal in die Forschung. Im hinteren Teil der Forschung wird fast nichts bis gar nichts benötigt, sodass man dies gut planen kann. Du selber kannst ja einschätzen, wann du die geforderten Mengen an Siedlungsgüter fertig hast für die Forschung. So kannst du auch rechtzeitig beginnen Unurium zu produzieren, zumal du dieses in den hinteren Forschungen nicht benötigst. Für die optionalen Forschungen ja, aber die kann man ja irgendwann ganz in Ruhe machen.[BR][BR]Edit:[BR][BR][IMG]https://i.ibb.co/PspbSxC/https-de-forum-elvenar-com-index-php-attachments-1607528310360-png-22487.png[/IMG][BR][BR]Ich hatte nach der Teleport-Aktion nur noch ca. 13k aller 3 Stunden (zuvor fast 21k) und kam damit sehr gut zurecht.[BR][BR]Edit 2: [BR][BR]Ich baute immer die gleiche Anzahl der 3 kleinen verschieden Schiffe, vielleicht war das mein Fehler. [BR]Hatte so nie Wartezeiten (jeweils 20 Schiffe). Doch nun stecke ich fest, weil die Quest, Sammle 80k Luxusartikel kam. [BR]Egal ob ich nur 6 oder 10 von jeden der kleinen Schiffe gebaut hätte, die Rechnung geht also mit gleichviel Schiffen nicht auf![BR]Vom Forschungsbaum her - ja, aber nicht mit dieser Quest."}, {"6": "A S L A N schrieb:\t\t\tAllein für Ausbauten geht so viel Mana flöten, dass ich jeden nur wärmstens empfehlen kann, Mana-Gebäude aufzustellen.\t\tZum Vergrößern anklicken....Müsste bei mir ganz gut hinhauen. Für die Forschung brauche ich noch 8500k Mana. Mein Karnevalsset liefert täglich 108k Mana, hinzu kommen noch 5 Dschinns, die noch 1 1/2 bis 2 Monate laufen. [BR]Die Hauptbremse bei mir sind die Gastrassengüter (hab nur 37 kleine Schiffe). Bis ich die jeweils zusammen hab, ist wieder genügend Mana vorhanden.[BR]Unurium ist inzwischen auch überhaupt kein Problem mehr.[BR][BR]Auf die Storyline werde ich aber wohl vollständig verzichten, da ich mir meinen Spielstil nicht von so einer Nebensache aufzwingen lassen will.[BR][BR]Allerdings hoffe ich, dass ich in den nächsten 6 bis 8 Wochen noch den einen oder anderen Dschinn erhalte. Das würde dann auch den Ausbau später etwas beschleunigen."}, {"219": "Hab oben mal Editiert ... .... .. Wenn du ohne Storyline spielst, geht es sehr gut mit der gleichen Anzahl der 3 kleinen Schiffe.[BR][BR]A S L A N schrieb:\t\t\tIch baute immer die gleiche Anzahl der 3 kleinen verschieden Schiffe, vielleicht war das mein Fehler.[BR]Hatte so nie Wartezeiten (jeweils 20 Schiffe). Doch nun stecke ich fest, weil die Quest, Sammle 80k Luxusartikel kam.[BR]Egal ob ich nur 6 oder 10 von jeden der kleinen Schiffe gebaut hätte, die Rechnung geht also mit gleichviel Schiffen nicht auf![BR]Vom Forschungsbaum her - ja, aber nicht mit dieser Quest.\t\tZum Vergrößern anklicken...."}, {"21": "Glessier schrieb:\t\t\tNr. 69 von wegen erhalte 80.000 Luxusartikel, die muss man herstellen\t\tZum Vergrößern anklicken....[BR]Ja klar, erhalten heißt ja herstellen, denn von woher sollten sie sonst kommen [smilie--sprite2]"}, {"219": "..... und wieder diese Unruhe bei diesen Händlern von Unur[BR][BR]Noch nie zuvor, also in keiner Storyline in zuvor-hergehenden Kapiteln [BR]war dies eine Pflicht-Aufgabe (nicht ablehnbar)![BR][BR]Hier werden all jene die nur verhandeln (Verhändler) oder die, die das Söldnerlager nicht bauen wollen,[BR]was man ja nicht muss, mehr oder weniger dazu gezwungen?!?[BR][BR]Tja dann heißt es für all jene Spieler, die es nicht haben, Ende - Gelände.[BR][BR][IMG]https://i.ibb.co/7zSsZnW/https-de-forum-elvenar-com-index-php-attachments-1607584897134-png-22491.png[/IMG][BR][BR]Das Söldner- sowie Trainingslager sind Gebäude, welche man jederzeit abreißen kann[BR]und sollte je so eine Quest erschienen sein, so konnte man diese stets ablehnen.[BR][BR]Auch in dieser Storyline, konnte man im Bezug Trainingsgelände die Quest 67. ablehnen![BR][BR][IMG]https://i.ibb.co/frNQZQX/https-de-forum-elvenar-com-index-php-attachments-1607584993579-png-22492.png[/IMG][BR][BR]Während ich also das eine ablehnen kann, \"muss\" ich das andere Rekrutierungs-Gebäude bauen?[BR][BR]Ich vermute, hier handelt es sich um einen Fehler, ansonsten erkläre mir einer den Sinn![BR]Vielleicht kannst du da mal nachfragen @Tacheless,[BR]andererseits haben Verhändler, die dieses Gebäude (Söldnerlager) nie bauen würden, schlechte Karten.[BR][BR]​"}, {"76": "Kann/muss ich die je 3 großen Schiffe abbauen, wenn ich die kleinen bauen muss? Wäre das dann überhaupt sinnvoll?"}, {"62": "juttaloewe schrieb:\t\t\tKann/muss ich die je 3 großen Schiffe abbauen, wenn ich die kleinen bauen muss? Wäre das dann überhaupt sinnvoll?\t\tZum Vergrößern anklicken....Für die Aufgabe schon, aber wenn du die erstmal nicht machen willst, musst du alle 9 neun großen (drei mal drei) nicht aufstellen.[BR]Soweit ich es verstanden habe, sind die kleinen effektiver als die großen (auch wenn es im Wiki anders steht), benötigen das andere der beiden Gastrassengüter und, das ist sicherlich der wichtigste Punkt, sie haben andere, kürzere Produktionszeiten."}, {"76": "sorry, hab mich wohl unklar ausgedrückt: Ich hab die je 3 großen gebaut. Da ich nicht so viel Platz habe, überlege ich die großen abzureißen und dann die Kleinen zu bauen. Weiß aber nicht , ob das sinnvoll ist, also quasi nur die Kleinen zu haben? Oder braucht man die 9 Großen noch später in der Questreihe?"}, {"21": "juttaloewe schrieb:\t\t\tsorry, hab mich wohl unklar ausgedrückt: Ich hab die je 3 großen gebaut. Da ich nicht so viel Platz habe, überlege ich die großen abzureißen und dann die Kleinen zu bauen. Weiß aber nicht , ob das sinnvoll ist, also quasi nur die Kleinen zu haben? Oder braucht man die 9 Großen noch später in der Questreihe?\t\tZum Vergrößern anklicken....[BR]Es kommt eine Quest bei der die je 3 großen abgefragt werden, weiß aber jetzt die Nummer der Quest grad nicht. Danach können die großen Schiffe nach und nach abgebaut und durch kleine Schiffe ersetzt werden, lediglich die 3 Flagschiffe müssen stehenbleiben.[BR]Die kleinen Schiffe benötigen- so wie die großen Schiffe auch- jeweils ein anderes Gastrassengut zum Produzieren und ja- sie sind natürlich effektiver als die großen Schiffe, obwohl sie so bescheuerte Produktionszeiten von 15 Min, 30 Min, 1 Sunde und max 3 Stunden haben  [smilie--sprite6][BR][BR]Anfangs hatte ich mir mal ne Hochrechnung gemacht wie lange es dauern würde ohne kleine Schiffe zu spielen: ohne jegliche Beschleuniger 8-10 Monate, kommt zB auch auf die Händlergilde an. Das hab ich dann gelassen und reichlich teleportiert um echt viele kleine Schiffe stellen zu können, wobei sich die kleinen auch teleportieren lassen und ich deshalb zB erst sehr viele Leckereien gemacht habe, und jetzt in der Schlußphase nur noch Luxusgüter. Deshalb habe ich zZ 34 kleine Piraten und eine kleinere Menge der benötigten \"Fütterschiffe\" stehen. Insgesamt habe ich so ohne zu beschleunigen für das Kapitel 17 knapp 8 Wochen gebraucht (ich spiele keine storyline) ,   - und das war schon ätzend genug.[smilie--sprite11]"}, {"1": "A S L A N schrieb:Ich vermute, hier handelt es sich um einen Fehler, ansonsten erkläre mir einer den Sinn![BR]Vielleicht kannst du da mal nachfragen @Tacheless,[BR]andererseits haben Verhändler, die dieses Gebäude (Söldnerlager) nie bauen würden, schlechte Karten.​Zum Vergrößern anklicken....Ich habe die Frage mal weitergeleitet. Vor nächster Woche werde ich aber keine Antwort darauf erhalten."}, {"219": "Tacheless schrieb:\t\t\tIch habe die Frage mal weitergeleitet. Vor nächster Woche werde ich aber keine Antwort darauf erhalten.\t\tZum Vergrößern anklicken....Danke!"}, {"11": "Ich brauche für die Forschung. Handelsplatz 4.  36k Luxusartikel und 22k Leckereien[BR]Ein kleines Schiff bringt in der Stunde 88 Luxusartikel - 16 Artefakte[BR][BR]Wenn jemand Arbeitet und danach nach viel spielt schafft man 15 -20 x einsammeln am Tag.[BR][BR]Habt ihr auch mal richtig überlegt, das das sehr sehr lange dauert.[BR][BR]Macht am besten noch Gestern bei den kleinen schiffen, 1-3-6-9 Std Produktionen"}]