[{"1": "A S L A N schrieb:\t\t\tDanke!\t\tZum Vergrößern anklicken....Zu deiner Frage: Ich habe gerade beides getestet, nachdem ich die Bestätigung erhalten habe, dass beide Quests ablehnbar sein sollen. Und ja, sie sind beide ablehnbar. Leider kann ich anhand deines Screens nicht sehen, dass es anders sein sollte, da die eine Aufgabe schon erledigt ist. Aber da der Test bei mir das ausgab, was sein sollte, werde ich es auch nicht als Fehler weiterleiten, da es ja funktioniert, wie es sollte."}, {"219": "Tacheless schrieb:\t\t\tZu deiner Frage: Ich habe gerade beides getestet, nachdem ich die Bestätigung erhalten habe, dass beide Quests ablehnbar sein sollen. Und ja, sie sind beide ablehnbar. Leider kann ich anhand deines Screens nicht sehen, dass es anders sein sollte, da die eine Aufgabe schon erledigt ist. Aber da der Test bei mir das ausgab, was sein sollte, werde ich es auch nicht als Fehler weiterleiten, da es ja funktioniert, wie es sollte.\t\tZum Vergrößern anklicken....Wäre ja gut und so sollte es sein. Bei mir war diese definitiv nicht ablehnbar. Wenn es jedoch so sein soll und so ist, wäre es so wie gewohnt. Denn in allen Storylines waren diese stets und immer ablehnbar."}, {"230": "Schnalle 04 schrieb:\t\t\tIch brauche für die Forschung. Handelsplatz 4.  36k Luxusartikel und 22k Leckereien[BR]Ein kleines Schiff bringt in der Stunde 88 Luxusartikel - 16 Artefakte[BR][BR]Wenn jemand Arbeitet und danach nach viel spielt schafft man 15 -20 x einsammeln am Tag.[BR][BR]Habt ihr auch mal richtig überlegt, das das sehr sehr lange dauert.[BR][BR]Macht am besten noch Gestern bei den kleinen schiffen, 1-3-6-9 Std Produktionen\t\tZum Vergrößern anklicken....Das ist der Sinn an dieser Gastrasse, Hauptsache es dauert lange und kostet viel, WP,Mana, erweckte Güter, Portalsegen und Saat.[BR]Sorry, aber kann keinen wirklichen Einsatz-Nutzen Effekt erkennen, das ist mit Abstande die schlechteste Gastrasse ever."}, {"217": "sandeule schrieb:\t\t\tDas ist der Sinn an dieser Gastrasse, Hauptsache es dauert lange und kostet viel, WP,Mana, erweckte Güter, Portalsegen und Saat.[BR]Sorry, aber kann keinen wirklichen Einsatz-Nutzen Effekt erkennen, das ist mit Abstande die schlechteste Gastrasse ever.\t\tZum Vergrößern anklicken....Was erwartest Du, wenn sich Piraten und Gourmets daran beteiligen? [smilie--sprite6] [BR]Es ist deren Natur Dich auszurauben und leerzufressen. [smilie--sprite2]"}, {"65": "Diese Gastrasse ist der größte Müll![BR]Ich merke es bei meinen brav arbeitenden (RL) Gefährten,[BR]die stark benachteiligte sind![BR]Auch Familie und Kinder wird hier nicht beachtet.[BR]Es dauert so 2-3 Wochen für eine Forschung,[BR]was soll das?[BR][BR]Wo ist der Spass, wo der Ausbau?[BR]Die 6h-9h und mehr GR-Produktionen,[BR]sind extrem benachteiligt![BR]Bitte lasst alle mitspielen![BR][BR]Ich ersuche ALLE unseren arbeitenden Helfer/innen,[BR]zu unterstützen![BR][BR]Mit schönen Grüßen, Thomas"}, {"54": "Ich finde eine Gastrasse, bei der man pro Forschung einige Wochen braucht (ohne Zeitpusher, die brauche ich für die Truppen), absolut kontraproduktiv und langweilig für das Spiel.[BR]Hab momentan ziemlich die Lust verloren - es bewegt sich einfach nichts, man hat nun gefühlt die halbe Fläche voll mit den Schiffchen stehen und hat keine Anforderung als nun ein halbes Jahr die gleichen Güter zu sammeln - laaaangweilig ...[BR][BR][BR]HdW"}, {"219": "Das liegt daran, dass INNO hier nicht an das Arbeitende Volk gedacht hat sowie der Meinung ist man schläft nicht länger als 3 Stunden maximal! Das in dieser GR Sinnlos Gebäude rumstehen und einfach nichts tun erwähnte ich ja ein paar posts zuvor und ist noch gar nicht so schlimm. Schlimmer finde ich die Aussagen seitens INNO dann wiederum generell, was Schlaf, Real-Life und Frei betrifft! Das widerspricht sich ein wenig. Mich hat es so sehr genervt, dass ich zum Schluss hin von allen kleinen Schiffen bis zu 35 Stk. stehen hatte und das kann niemals der Sinn sein. Denn baust du nur die vorgegebenen 6 Stück verweilst du Monate in der GR und das wiederum heißt, der Spielspaß die Freude und alles drumherum schwindet von Tag zu Tag."}, {"21": "\"Ich hatte es befürchtet......[BR][BR]Das ist das langweiligste Kapitel ever..... da waren die Orks richtig spannend....oder die Elvenar .....\"[BR][BR]Hab' ich am 4. November geschrieben....damals wollte ich noch mit 7/7/6 kleinen Schiffen poduzieren...[smilie--sprite6] das hab ich gelassen und ebenfalls letztendlich 34 Piratenschiffe gebaut. Viele (Mit) Spieler haben anfangs gesagt...\"na das wird schon nicht so schlimm werden, dauerts halt etwas länger... soviel Platz hab ich gar nicht....\"  Mittlerweile bauen auch diese Spieler kleine Schiffe im Dutzend, weil man dieses Kapitel einfach nur an die Wand klatschen kann, oder das Spiel ganz hinschmeissen. Spaß macht das nicht mehr."}, {"57": "am meisten nervt die Menge der Schlüssel, die man braucht zb für Kaserne und die Menge der Schlüssel die man produziert, das ist wirklich gefühlt endlos und fad. Da hätte man echt nachjustieren sollen. Nichts ist schrecklicher demotivierend wie diese Gastrasse.[BR][BR]Bitte nächstes Mal besser durchtesten das man nicht die Motivation am Spiel verliert.[BR]In diesem Sinne weihnachtliche Grüsse (xmascar) [BR]PS: Hier fehlen weihnachtliche Objekte wie Smileys"}, {"6": "Indianaking schrieb:\t\t\t...damals wollte ich noch mit 7/7/6 kleinen Schiffen poduzieren...\t\tZum Vergrößern anklicken....Ja, so naiv war ich anfangs auch.  [smilie--sprite1] [BR]Jetzt stehen neben den 3 großen und den 9 mittleren Schiffen noch 16/16/12 kleine.[BR]Damit erkennt man täglich wenigstens einen kleinen Fortschritt.[BR][BR]Wer allerdings den Turm nicht spielt und damit ausreichend Teleporter hat, hat ganz einfach verloren.[BR][BR]Was sich die Verantwortlichen bei Inno dabei gedacht haben, wird sich wohl nie ergründen lassen.[BR]Entweder wurden sämtliche Denkvorgänge abgeschaltet, oder man will auf die Art mehr Premiumerweiterungen verkaufen.[BR][BR]Dass für eine Gastrasse viel Platz benötigt wird ist ja normal. Die Hälfte der Stadtfläche ist aber nicht mehr normal. [smilie--sprite4][BR][BR]Trotzdem allen (auch Inno) frohe Festtage! [smilie--sprite2]"}, {"4": "Immer mehr drängt es mich dazu, diese Gastrasse gar nicht anzufangen.[BR][BR]Musste mich für die Botschafter schon sehr motivieren und fand diese schon recht ätzend mit max. 1 Forschung pro Woche, teilweise auch 10 bis 14 Tage für eine. Und diese Menge an Platz mag ich nicht zur Verfügung stellen, damit geht der Rest des Spiels nämlich den Bach runter. Wenn wenigstens irgendwas erfreuliches winken würde, wie die Zeitschleife z.B., aber auch die Wunder sind nicht witzig. [BR][BR]Wenn ich anfangen würde, hätte ich täglich absolut keine Motivation mehr, noch das Spiel zu öffnen und zu betreten."}, {"86": "ustoni schrieb:\t\t\tWas sich die Verantwortlichen bei Inno dabei gedacht haben, wird sich wohl nie ergründen lassen.[BR]Entweder wurden sämtliche Denkvorgänge abgeschaltet, oder man will auf die Art mehr Premiumerweiterungen verkaufen.\t\tZum Vergrößern anklicken....vielleicht soll man auch einfach so lange brauchen, bis die nächste gastrasse da ist und nicht nach 2-3 Wochen fertig sein [smilie--sprite2] nur weil eine handvoll spieler das gerne hätte, muss es inno ja nicht umsetzen.[BR]letztendlich kommt doch die Kritik bei jedem kapitel auf. das war schon bei den ersten gastrassen so. was sich inno dabei denkt: Beschäftigungstherapie, denn nichts anderes ist ein langzeit-aufbau-browser-game.[BR]leute denen das kein spaß macht, können ja auch im alten kapitel bleiben. die neuen bieten ja, außer den wundern, sowieso keine neuen vorteile mehr."}, {"1": "Ja, die Gastrassen werden anspruchsvoller und zeitintensiver. Genau aus dem Grund, dass man eben nicht nach 2-3 Wochen durch sein soll und dann einen ewig langen Leerlauf bis zur Veröffentlichung der nächsten Gastrasse hat. Dies wurde ja immer wieder bemängelt."}, {"219": "Tacheless schrieb:\t\t\tJa, die Gastrassen werden anspruchsvoller und zeitintensiver. Genau aus dem Grund, dass man eben nicht nach 2-3 Wochen durch sein soll und dann einen ewig langen Leerlauf bis zur Veröffentlichung der nächsten Gastrasse hat. Dies wurde ja immer wieder bemängelt.\t\tZum Vergrößern anklicken....Das ist doch schon seit den Elvenar und weit davor nicht mehr so ... .... ... das hier oder anderswo Spieler/die Community nach einer neuen GR rufen oder sich sehnen. Vielleicht mal die Frage, damit man dies eventuell mit einem GA oder Event noch Planen kann.[BR]Wenn ich mich irre, dann würde ich solch einen Beitrag hier gern sehen, denn seit über 1,5 Jahren las ich sowas hier nicht mehr.[BR][BR]Auch hat das eine nichts mit dem anderen zu tun, denn selbst nach 2 Monaten ist man noch nicht annähernd fertig, wenn man nicht so wie hier welche schreiben und was auch stimmt, XXX kleine Schiffchen baut und diese wiederum stehen Stundenlang völlig Sinnbefreit im Spiel, denn sie erfüllen dann keine Funktion. Wohlgemerkt in einem Aufbauspiel in dem Strategie stecken soll.[BR]Da man eben nicht nur 3 Std. schläft und da man eben nicht aller 3 Std. ins Spiel rennt, weil man eben auch arbeitet, schläft und vieles mehr. Ein sogenanntes Real-Life wie es du auch hast. Ich war nach 8 Wochen durch mit insgesamt a' 35 kleinen Schiffen (mitunter gar 45) + die 9 großen und den 3 Hauptschiffen. Was die Entwickler hier auch nicht bedacht haben, dass die WPs viel schneller gefüllt sind als man die Forschung mit den Siedlungsgütern freischalten kann. Dann eben die Produktionszeiten, diese sind in \"meinen\" Augen sehr unverschämt![BR]Ihr weist im Lade-Balken daraufhin mit, \"wusstest du, das man im Turnier viele WPs ergattern kann etc.\" bedenkt aber nicht, dass man diese vielen WPs schneller zusammen hat als die Siedlungsgüter, die enorm sind bei der geringen Produktionsmenge und der \"unverschämten\" Produktionszeiten."}, {"21": "Tacheless schrieb:\t\t\tJa, die Gastrassen werden anspruchsvoller und zeitintensiver. Genau aus dem Grund, dass man eben nicht nach 2-3 Wochen durch sein soll und dann einen ewig langen Leerlauf bis zur Veröffentlichung der nächsten Gastrasse hat. Dies wurde ja immer wieder bemängelt.\t\tZum Vergrößern anklicken....[BR]Daß Gastrassen anspruchvoller werden - dagegen hätte niemand was zu sagen, im Gegenteil: das würden viele betroffene Spieler sicherlich begrüßen. Was aber hier in Kap 17 passiert ist meilenweit entfernt von anspruchsvoll : stumpfsinniges, ödes Absammeln von möglichst vielen items ohne Strategie oder Verstand. So kann man Spieler auch zu Tode langweilen. [smilie--sprite10][BR]Dazu kommt daß sich seit den Elementaren niemand über irgendwelche Leerläufe aufregt. Denn damals kam Inno nicht in die Pötte und wir hatten ein knappes Jahr Wartezeit.... da hat man sich dann doch etwas aufgeregt...."}, {"1": "Indianaking schrieb:\t\t\tDaß Gastrassen anspruchvoller werden - dagegen hätte niemand was zu sagen, im Gegenteil: das würden viele betroffene Spieler sicherlich [BR]Dazu kommt daß sich seit den Elementaren niemand über irgendwelche Leerläufe aufregt. Denn damals kam Inno nicht in die Pötte und wir hatten ein knappes Jahr Wartezeit.... da hat man sich dann doch etwas aufgeregt....\t\tZum Vergrößern anklicken....Wo siehst du denn da ein Jahr Leerlauf?:[BR]03.2017 Zauberer und Drachen[BR]06.2017 Halblinge[BR]02.2018 Elementare[BR]08.2018 Amuni"}, {"6": "Tacheless schrieb:\t\t\tJa, die Gastrassen werden anspruchsvoller und zeitintensiver.\t\tZum Vergrößern anklicken....\"Bedeutungen \"anspruchsvoll\":[BR][BR][1] eine Person betreffend: nicht leicht zufriedenzustellen, mit hohen Ansprüchen[BR][2] ein Objekt betreffend: viel Kenntnisse werden benötigt, um es zu verstehen[BR][3] ein Objekt betreffend: viel Aufwand oder Qualität wird abverlangt[BR][4] ein Objekt betreffend: hochwertig, gut verarbeitet \"[BR][BR]Aus einer Gastrasse ein Dauer-GA zu machen, hat damit absolut nichts zu tun.[BR][BR]Tacheless schrieb:\t\t\tGenau aus dem Grund, dass man eben nicht nach 2-3 Wochen durch sein soll und dann einen ewig langen Leerlauf bis zur Veröffentlichung der nächsten Gastrasse hat.\t\tZum Vergrößern anklicken....Niemand außer euch redet hier von 2 bis 3 Wochen. Es sollte aber auch nicht auf eine Dauer von Jahren ausgelegt sein.[BR][BR]Tacheless schrieb:\t\t\tDies wurde ja immer wieder bemängelt.\t\tZum Vergrößern anklicken....Wie @A S L A N bereits anmerkte: wer bemängelt das wo? Bitte einfach ein Link zu einem Beispiel, das jünger als 3 Jahre ist. [BR][BR]Bei Kapitel 18 werde ich jedenfalls erstmal eine Zeit abwarten, bevor ich das beginne. Sollte dies dann ähnlich unüberlegt aufgebaut sein und nicht zumindest eindeutige Vorteile für Turnier oder Turm bringen, werde ich wohl eher darauf verzichten."}, {"1": "Einen Link aus dem deutschen Forum habe ich jetzt nicht parat. Aber ich verrate euch mal was: Nicht nur ein paar wenige geben uns im Forum Feedback. Nein, wir bekommen auch Feedback in z.B. Tickets, welches wir auch weiterleiten. Dieses Feedback sehen die anderen Spieler dann eben nicht, da nicht öffentlich. Auch gibt es Feedback auf den Social Media Kanälen und den Foren der anderen Sprachversionen. Aber auch da werde ich jetzt keinen Link raussuchen. Ihr dürft nicht immer davon ausgehen, dass nur die handvoll Spieler, die im deutschen Forum regelmäßig Feedback abgibt, die einzigen sind/ nur deren Feedback zählt."}, {"21": "Stimmt, vor den Elementaren waren es \"nur\" 8 Monate - die haben sich damals aber ewig lang gezogen kann ich mich noch erinnern. Seither hat sich die GR-Abfolge doch ziemlich eingependelt und niemand regt sich deshalb mehr auf- kein Wunder, irgendwas läuft ja immer [smilie--sprite6][BR][BR]Dennoch ist Kap 17 das ödeste was man sich vorstellen kann - um nicht off topic zu werden und beim Thema zu bleiben."}, {"2": "...die Elementare hatten sich deshalb so lang verzögert, weil zu wenig Leute für die erweckten Güter da waren (also fertig mit Kapitel XI) - und trotzdem wurde wegen den Engpässen im Handel gejammert.... ....die gingen erst 3 Wochen nach dem Beta-Start live..."}]