[{"219": "Ja das war ja auch 2018 und seither, bzw. darauf hab ich das eher weniger gelesen. Deswegen ja meine Aussage so ca. 1- 1,5 Jahre las ich das nirgendswo mehr, weil es sich so eingependelt hat (denke ich). Gejammert wird immer irgendwo, die Frage ist dann, wer, wie, was als jammern definiert. Kritik ist ja nicht gleich jammern, auch wenn das andere gern sehen oder gar schreiben, aber das weiß jeder selber.[BR]Klar ist auch, dass niemand weiß was beim Support eingeht, doch auch darum geht es ja nicht. Das hier ist ein Feedback-Thread und ich sehe das durchaus auch als Feedback, wäre dem nicht so, dann wäre es doch schon lang dem Löschstab zum Opfer gefallen oder?[BR]Was der Support erhält ist gut, schön und toll, aber mich verwies man damals seitens des Supports ins Forum, da es da besser aufgehoben wäre und da man da alles besser sammeln könne und man so eine bessere Übersicht hätte. Also ist für mich relevant was hier steht und nicht was eventuell INNO direkt bekommt oder der Support. Logisch das man auch von fliegenden Rosa Elefanten reden/schreiben kann, doch wer hat sie gesehen und stimmt das wirklich? Ich kann folglich nur über das Urteilen was ich hier und generell auf INNO Seiten öffentlich lese. Wenn man nun das vom Support (PN logischerweise) mit einbezieht, ja was ist das dann? Woher sollen das die User hier im Forum wissen, was der Support oder INNO PN bekommt? Also fehl am Platz. Das dann jedes Feedback gewertet wird ist schön, aber wie eben erwähnt, dass kann ja hier keiner sehen oder wissen, demnach darf man es auch keinen übel nehmen."}, {"1": "Ich habe nirgends geschrieben, dass nur das Feedback aus Tickets relevant wäre. Ich habe nur aufgezeigt, dass wir von verschiedenen Stellen Feedback erhalten, was alles weitergeleitet wird. Und ja, wir verweisen in der Regel immer auf das Forum, was aber nicht bedeutet, dass das Feedback in Tickets nicht weitergeleitet wird. Und für Inno ist jedes Feedback relevant, egal von wo es kommt."}, {"219": "Tacheless schrieb:\t\t\tIhr dürft nicht immer davon ausgehen, dass nur die handvoll Spieler, die im deutschen Forum regelmäßig Feedback abgibt, die einzigen sind/ nur deren Feedback zählt.\t\tZum Vergrößern anklicken....... dann gehe aber du auch nicht immer davon aus, dass jeder genauso denkt, ahnt, handelt wie du und demzufolge liest es sich so, als wären alle anderen nicht in der Lage zu denken/überlegen oder gar weiß Gott was. Nur weil man nicht gleich von allen möglichen ausgeht und alles exakt genauso sieht wie du oder einbezieht. Ich z.B. habe mich in der Tat nur auf diesen Thread hier Forum bezogen."}, {"6": "Tacheless schrieb:\t\t\tIch habe nirgends geschrieben, dass nur das Feedback aus Tickets relevant wäre.\t\tZum Vergrößern anklicken....Wirklich nicht? in Deinem vorherigen Post hat sich das aber genau so angehört, da es ja nur um [BR]Tacheless schrieb:\t\t\tdie handvoll Spieler, die im deutschen Forum regelmäßig Feedback abgibt,\t\tZum Vergrößern anklicken....geht und das hört sich so an, als wäre das der kleinste und unwichtigste Teil."}, {"1": "Ihr fangt schon wieder an, einem (bewusst) das Wort im Mund umzudrehen. Gerne können wir diese Diskussion an einer anderen Stelle fortsetzen, hier jedoch ist sie Offtopic. Also kommt bitte zurück zum Feedback zu den Händlern von Unur. Danke."}, {"6": "Tacheless schrieb:\t\t\tIhr fangt schon wieder an, einem (bewusst) das Wort im Mund umzudrehen.\t\tZum Vergrößern anklicken....Das machen wir nicht. Ich kann aber verstehen, dass es einfacher ist, das so zu sehen.[BR]Deshalb hier nochmals das, worum es geht:[BR][BR]Zwischen den Produktionsmengen der Gastrassengebäude und der geforderten Menge in den Forschungsfeldern - speziell im letzten Drittel des Forschungsbaums - existiert ein krasses Missverhältnis.[BR]Anhand der Questline kann man zunächst einmal davon ausgehen, dass es reicht, von den großen, mittleren und kleinen Schiffen die Anzahl 1/1/1, 3/3/3 und 6/6/6 aufzustellen. Das würde von der Fläche her dann auch in etwa dem Flächenbedarf der letzten Gastrassen entsprechen.[BR][BR]Mit dieser Menge an Gastrassengebäuden würde man aber selbst mit 1h-Taktung der Produktion ca. 2 Wochen je Forschungsfeld benötigen. Bei 33 relevanten Forschungsfeldern wäre das (da die ersten Felder schneller machbar sind) rund ein Jahr.[BR]Und ganz ehrlich: bei der Bearbeitung einer neuen Gastrasse möchte man zwischendurch auch mal ein Erfolgserlebnis haben (Super! Ein Feld geschafft!), sonst kommt sehr schnell Langeweile auf. Es muss ja nicht jeden Tag oder jeden 2. Tag sein, aber 2 Wochen???[BR][BR]Hat man das Glück, nicht mehr im Arbeitsleben zu stehen (Rente, Pension) und viel Zeit zu haben, lässt sich das Problem abmildern, indem man die Anzahl der kleinen Schiffe erhöht - in meinem Fall auf 16/16/12. Die Zeiten für das Erledigen eines Forschungsfeldes werden damit erträglich. Allerdings steigt damit auch der Platzbedarf für die Gastrasse massiv an. Spieler, die nicht regelmäßig den Turm spielen kriegen ohne die nötige Anzahl Teleporter damit ein Problem. Zwischen Auslagern und Löschen von Gebäuden gibt es nunmal einen relevanten Unterschied.[BR]Dabei taucht aber gleichzeitig ein neues Problem auf: ich darf dann jede Stunde erneut 57 Produktionen starten. Das ergibt eine Klickorgie, die man nur von früheren Gemeinschaftsabenteuern gewohnt war - macht auch nicht wirklich Spaß.[BR][BR]Steht man aber noch im Arbeitsleben, hilft eine Erhöhung der Anzahl kleiner Schiffe auch nicht weiter. Das liegt einfach an den viel zu kurzen Produktionszeiten, das Maximum liegt ja bei nur 3 Stunden. Während der meisten Zeit eines Tages würden die kleinen Schiffe damit völlig nutzlos herumstehen.[BR][BR]Folgende Änderungen wären daher wünschenswert:[BR][BR]1. Im Produktionsmenü der kleinen Schiffe sollte ein Feld integriert werden, mit dem die Produktion bei allen Gebäuden gleichen Typs gleichzeitig gestartet werden kann. Bei den Werkstätten habt ihr dies ja auch geschafft.[BR][BR]2. Die Produktionszeiten der kleinen Schiffe sollten von 15min/30min/1h/3h auf 1h/3h/9h/12h oder 1h/3h/6h/9h geändert werden, dies natürlich bei gleichzeitiger Anpassung (Erhöhung) der Produktionsmengen analog zur Änderung der Zeiten.[BR][BR]3. Idealerweise sollten die Anforderungen der Forschungsfelder verringert werden, damit man auch mit 6/6/6 kleinen Schiffen in vertretbarer Zeit durch die Gastrasse kommt.[BR][BR]Der \"Handvoll Spieler, die hier Feedback geben\" würden diese Änderungen zwar nicht mehr helfen, sie würden aber für deutlich weniger Frust bei nachfolgenden Spielern sorgen."}, {"65": "Danke ustoni, du hast es super erklärt![BR][BR]Von Tacheless:  Ja, die Gastrassen werden anspruchsvoller und zeitintensiver.[BR][BR]@ Tacheless: Das ist wohl der letzte Witz der Woche,[BR]wo ich in den Keller lachen gehe.[BR]Aber alles ist relativ![BR][BR]Einige Gefährten in meiner GM,[BR]rechnen mit Herbst 2021 mit der GR [smilie--sprite4]"}, {"219": "Spoiler: Mal Zahlen und Fakten, was brauche ich in der Forschung und was bekomme ich aus den Schiffen[IMG]https://i.ibb.co/kmGJ0R2/https-de-forum-elvenar-com-index-php-attachments-1608241117122-png-22558.png[/IMG]"}, {"65": "Vielen Dank ASLAN, die Zahlen beruhigen mich.[BR][BR]Bis ich durch bin mit der GR,[BR]ist Corona wieder nur mehr ein Biermarke [smilie--sprite1] [BR][BR]Super Arbeit ASLAN! Danke!"}, {"231": "wobei das beim Unurium nur die reinen Zahlen für den Forschungsbaum sind.[BR][BR]dazu kommt natürlich noch das, was man herstellen muss, um die verschiedenen Schiffe erstmal zu bauen"}, {"6": "Firmir schrieb:\t\t\tdazu kommt natürlich noch das, was man herstellen muss, um die verschiedenen Schiffe erstmal zu bauen\t\tZum Vergrößern anklicken....Außerdem beschreiben die Produktionszahlen der Gastrassengüter und die Zeiten einen Extremfall, der in der Praxis nicht erreichbar ist.[BR]Für diese Mengen müsste man durchgehend alle 15 Minuten einsammeln und ohne Zeitverlust neue Produktionen starten - und das 16 Stunden täglich, durchgehend bis Erledigung der kompletten Forschung.[BR]In der Praxis ist bei 1-Stunden-Taktung nicht einmal die Hälfte der Menge erreichbar."}, {"219": "Firmir schrieb:\t\t\twobei das beim Unurium nur die reinen Zahlen für den Forschungsbaum sind.[BR][BR]dazu kommt natürlich noch das, was man herstellen muss, um die verschiedenen Schiffe erstmal zu bauen\t\tZum Vergrößern anklicken....Exakt.[BR]ustoni schrieb:\t\t\tAußerdem beschreiben die Produktionszahlen der Gastrassengüter und die Zeiten einen Extremfall, der in der Praxis nicht erreichbar ist.[BR]Für diese Mengen müsste man durchgehend alle 15 Minuten einsammeln und ohne Zeitverlust neue Produktionen starten - und das 16 Stunden täglich, durchgehend bis Erledigung der kompletten Forschung.[BR]In der Praxis ist bei 1-Stunden-Taktung nicht einmal die Hälfte der Menge erreichbar.\t\tZum Vergrößern anklicken....Exakt.[BR]MasterLu schrieb:\t\t\tBis ich durch bin mit der GR,[BR]ist Corona wieder nur mehr ein Biermarke [smilie--sprite1]Zum Vergrößern anklicken....Ich benötigte knapp 8 Wochen und machte an einem verregneten Samstag alles alle 15 Minuten, allerdings mit knapp a' 35 kleinen Schiffen. Nach ca. 4-5 Std. gab ich auf, denn das ist purer Wahnsinn.[BR]Hätte und würde ich dies mit nur a' 6 kleinen Schiffen spielen, braucht man weit mehr als 2 Monate.[BR]Ergo, Tagelang ist die Forschung bereits gefüllt, doch man kann nicht öffnen, weil die Siedlungsgüter fehlen.[BR]Spielt man dann noch die Storyline, ist es zum Mäuse melken und macht definitiv kein Spaß."}, {"6": "Am Ende der Forschung wird die Verzögerungstaktik zusätzlich durch den Bedarf an Mana auf die Spitze getrieben.[BR]Für die letzten Forschungsfelder werden nochmal rund 7000k Mana benötigt.[BR]Wenn dies irgendwann erledigt ist, kann ich den Ausbau der Gebäude in der Stadt starten. Allein für die erste Ausbaustufe und die damit verbundenen Größenänderungen brauche ich nochmal rund 8000k Mana.[BR][BR]Diese Anhäufung kann man schon als böswillig bezeichnen - oder es wurde von Leuten veranlasst, die dieses Spiel noch nie gespielt haben. [smilie--sprite4]"}, {"226": "ich habe jetzt so an die 50 Schiffe aufgestellt, um eine Chance auf ein Ende der GR zu sehen, und ernte diese im 1h-Modus.[BR][BR]Langsam fühle ich mich wie im GA, so viel Klickerei ist das ! Diese GR ist wirklich weit weg von interessant, nur mehr mühsam ! Außerdem werden meine Truppen, Güter, Vorräte immer weniger, weil die Gebäude dafür in das Inventar mußten ! Und danach wartet noch der Mana-Hammer !!!![BR][BR]Ich hoffe sehr, dass Inno für die nächste GR etwas Besseres einfällt."}, {"47": "Ich sage nur laaaaangweilig zu dieser GA, ist ja schon alles gesagt worden. LT Inno: Hauptsache die Spieler sind schön lange beschäftigt und geben irgendwann entnervt auf und kaufen die Forschung frei"}, {"232": "Hätte kein Problem damit die 2Jahre in der Rasse zu bleiben. Nur kommen ja zwei Rassen im Jahr neu raus. Nach meiner Meinung passt dies nicht zusammen.[BR]Natürlich muss man die Rassen aufwändiger machen, wenn so viele Endgamer die Rassen schon nach 4 Monaten fertig haben. Leider trifft es die schwächeren, die es nicht bis zur nächsten Rasse schaffen.[BR]Die Portalsegen kann man sich nun auch irgendwo hinstecken. Dachte die wären zum überbrücken dieser Durststrecken. Was hat INO mit diesen vor?"}, {"189": "Rich3000 schrieb:\t\t\tDie Portalsegen kann man sich nun auch irgendwo hinstecken. Dachte die wären zum überbrücken dieser Durststrecken.\t\tZum Vergrößern anklicken....[BR]Die Portalsegen sind für Anfänger sehr hilfreich, so kommen sie schnell durch die ersten Gastrassenkapitel."}, {"6": "ErestorX schrieb:\t\t\tDie Portalsegen sind für Anfänger sehr hilfreich, so kommen sie schnell durch die ersten Gastrassenkapitel.\t\tZum Vergrößern anklicken....Nicht nur für Anfänger. Speziell in Kapitel 17 braucht man Unmengen davon. Wenn ich das Kapitel durch habe, werde ich wohl so um die 3000% verbraucht haben."}, {"85": "Tacheless schrieb:\t\t\tJa, die Gastrassen werden anspruchsvoller und zeitintensiver.\t\tZum Vergrößern anklicken....[BR]Worin siehst du den den höheren Anspruch? Das Kapitel ist auch im Spiel nicht zeitintensiver, es besteht hauptsächlich aus Wartezeiten. Das Kapitel stellt hohe Ansprüche an die Geduld und die Fantasie, sich den Spaß herbeizudenken. Da auch viele Ausbauten, insbesondere der Manufakturen die nicht für erweckte Güter benötigt werden, für effektive Städte schon länger keinen echten Sinn mehr haben, ist dieses Kapitel aus meiner Sicht nur ein Lückenfüller. Zumindest in der Hoffnung, dass nach Kapitel 16 und 17 vielleicht doch noch etwas kommt, was wieder mehr Spielspaß bringt."}, {"226": "Ohne die Portalsegen müßte man das Zero auch noch erzeugen, und die Güter dafür. Dann wäre ich schon weg und hätte ein neues Spiel begonnen."}]