[{"189": "ustoni schrieb:\t\t\tSpeziell in Kapitel 17 braucht man Unmengen davon. Wenn ich das Kapitel durch habe, werde ich wohl so um die 3000% verbraucht haben.\t\tZum Vergrößern anklicken....[BR]Bei den Zwergen kann ich ungebremst durchrauschen, wenn ich genügend Portalsegen habe, in Kapitel 17 kann ich zwar einen kleinen Teil meiner Portalsegen (ich verlass mich da auf deine 3000%) loswerden, nur hab ich trotzdem lange Wartezeiten. Darum gehe ich davon aus, dass der eigentliche Zweck der Dinger ist, den Anfängern das Aufholen zu erleichtern."}, {"6": "Der von Inno geplante Zweck der Dinger geht mir am selbigen vorbei.  [smilie--sprite1][BR]Ohne Portalsegen hast Du bei Kapitel 17 ein ernsthaftes Problem. Hat @achilles7453 ja schon kurz beschrieben.[BR]Wenn man das Elvenarin Zero auch noch mit Mana, Saat oder erweckten Gütern selbst erzeugen müsste, würde man ja nie fertig werden.[BR][BR]Hab jetzt nicht genau nachgehalten, aber die 3000% dürften ganz gut hinhauen. [smilie--sprite2]"}, {"21": "ustoni schrieb:\t\t\tDer von Inno geplante Zweck der Dinger geht mir am selbigen vorbei.  [smilie--sprite1][BR]Ohne Portalsegen hast Du bei Kapitel 17 ein ernsthaftes Problem. Hat @achilles7453 ja schon kurz beschrieben.[BR]Wenn man das Elvenarin Zero auch noch mit Mana, Saat oder erweckten Gütern selbst erzeugen müsste, würde man ja nie fertig werden.[BR][BR]Hab jetzt nicht genau nachgehalten, aber die 3000% dürften ganz gut hinhauen. [smilie--sprite2]Zum Vergrößern anklicken....[BR]Stimmt, 3000 können gut hinkommen. Zum ersten Mal war ich heilfroh in den Dingern zu \"ersaufen\", und ich habe noch immer jede Menge übrig obwohl ich durch bin. Wie meine Vorschreiber schon richtig anmerkten: wenn ich das Zero auch noch hätte produzieren müssen hätte ich wahrscheinlich den ganzen Mist erstmal hingeschmissen....."}, {"1": "Was ich hier rauslese ist, dass euch bestimmte Produktionszeiten nicht passen. Das werden wir gerne als Feedback (nochmals) weiterleiten. Desweiteren ist euch die Gastrasse zu langwierig da mit den Portalsegen nicht alles \"hergezaubert\" werden kann?"}, {"85": "Tacheless schrieb:\t\t\tWas ich hier rauslese ist, dass euch bestimmte Produktionszeiten nicht passen. Das werden wir gerne als Feedback (nochmals) weiterleiten. Desweiteren ist euch die Gastrasse zu langwierig da mit den Portalsegen nicht alles \"hergezaubert\" werden kann?\t\tZum Vergrößern anklicken....[BR]Das kann ich nicht bestätigen. Wenn jedoch alles nur darauf abzielt, möglichst lange zu dauern (vielleicht um den Entwicklern Zeit für Neues zu verschaffen oder um zurzeit fehlende Fantasie zu überdecken), dann empfinde ich dies nicht als Herausforderung im Spiel, sondern für meine Geduld und Motivation. Herausforderungen im Spiel beinhalten für mich auch stets die Möglichkeit durch taktisch richtige Entscheidungen, Einfluss zu nehmen. Hier kann ich nur warten. Wenn alles lange dauern soll, dann fände ich mehr Aufgaben besser, als wochenlang zur Erfüllung einer Forschung (die auch kaum noch sinnvoll für mich ist) mittels Wartezeit  zu spielen. Spielen bedeutet auch aktives Handeln und nicht passives Warten. Über die Inflation der Portalsegen habe ich mich hier schon frühzeitig geäußert und sie beklagt. Erst wird seitens der Entwickler alles in Mengen auf den Markt geworfen und dann werden Spielbremsen eingebaut, um genau die damit erzeugte Beschleunigung auszubremsen.[BR][BR]Ich vermisse nicht die Möglichkeit des einfachen \"Durchrauschens\" durch das Spiel. Vielmehr fehlen Herausforderungen für die ich auch planerisch und taktisch gefordert werde. Der ständige Mangel an fast allem im den ersten Kapiteln war interessanter als das stupide starten von Produktionen und das ewige Warten auf einen Fortschritt, der aber kein Fortschritt für das eigene Spiel ist."}, {"6": "Tacheless schrieb:\t\t\tDesweiteren ist euch die Gastrasse zu langwierig da mit den Portalsegen nicht alles \"hergezaubert\" werden kann?\t\tZum Vergrößern anklicken....Sorry, aber das ist Unsinn. Ich würde sogar ganz im Gegenteil sagen, dass die Portalsegen in der vorliegenden Form optimal eingesetzt werden.[BR]Die Portalsegen haben nun wirklich rein gar nichts mit dem zu tun, was bei dieser Gastrasse schief läuft.[BR][BR]Änderungsvorschläge habe ich bereits hier gemacht, wobei der 3. Vorschlag sich auf den unglaublichen Platzbedarf bezieht, den man benötigt, wenn man in vertretbarer Zeit durch die Forschung kommen möchte."}, {"189": "Tacheless schrieb:\t\t\tDesweiteren ist euch die Gastrasse zu langwierig da mit den Portalsegen nicht alles \"hergezaubert\" werden kann?\t\tZum Vergrößern anklicken....[BR]Den Teil mit den Portalsegen find ich eigentlich clever gelöst. Man verbraucht welche, ohne dass man deswegen gleich durchrauscht.[BR][BR]Das Hauptproblem ist, dass es keine einzige Forschung gibt, die mich motivieren konnte, das Kapitel überhaupt zu spielen. Wie schon bei Kapitel 16 ist die rationale Entscheidung (wegen Truppgröße im Turnier) es nicht zu spielen. Trotzdem hab ich vor einer Woche begonnen, weil **** Einheiten in den Gamefiles gesichtet wurden, was zumindest die Chance auf ein attraktiveres Kapitel 18 erhöht. [smilie--sprite1][BR][BR]Nachtrag: Im Detail scheint mir die stupide Klickerei auf Dutzende kleiner Schiffe, idealerweise im 15-Minuten Takt, ein nerviges aber leicht lösbares Problem zu sein. @ustoni s Vorschlag, das wie bei den Werkstätten zu lösen, scheint mir die einfachste Möglichkeit zu sein, das Kapitel angenehmer zu gestalten, ohne viel zu verändern."}, {"29": "Ich finde das Kapitel interessant. Bin zwar erst am Anfang und lange noch nicht am Ende, aber diese Materialschlacht hat was. Da muß ein ganzes Mathematikerteam an der Konzeptierung beteiligt gewesen sein, so mein Eindruck."}, {"62": "Einen Teil der Kritik verstehe ich ja, aber ganz ehrlich, ich bin froh, dass der Nutzen der Portalsegen, die sich bei den meisten \"Endgamern\" durch die Decke stapeln in Massen gebraucht und dabei nur eine beschränkte Wirkung haben. Denn während einzelne Portalsegen eine sinnvolle Beschleunigung für mich darstellen, wenn mal eine Forschung länger dauert, unterlaufen die Massen (bzw. die Menge an Gastrassengütern, die man durch diese bekommt) an Segen, die mittlerweile bei etlichen Spielern im Inventar liegen (durch Events, Gebäude wie den Handelsaußenposten, das Handwerk,...) den Zweck der Gastrassengütern, die Gastrasse anspruchsvoll zu machen und ja auch in die länge zu ziehen, denn für mich ist es nicht der Sinn eines neuen Kapitels, dass es nach zwei, drei Wochen abgeschlossen ist, nur damit man dann (verständlicherweise) sechs, neun Monate am Ende des Forschungsbaumes auf das nächste Kapitel wartet, nur damit dieses wieder keinen Monat hält.[BR]Auch frage ich mich, warum hier scheinbar ein Konsens bei vielen Spielern besteht, dass ein Kapitel innerhalb weniger Wochen bis Monaten geschafft sein muss. Klar, es gibt neue Ausbaustufen, aber hier im Forum wird oft genug geklagt, dass neue Ausbaustufen bei Wohnhäusern, Werkstätten und Manufakturen letztlich nur den Überschuss vergrößern. Auch wird mehr Platz benötigt und, da Stadterweiterungen jetzt einen Einfluss auf die Schwierigkeit beim Turnier haben, wird hierdurch der Vorteil von Truppenerweiterungen und schnellerer/größerer Truppenproduktion (weitestgehend) kompensiert. Also muss man hier auch nicht unbedigt mit einer der ersten sein, der ein neues Kapitel geschafft hat. Von den neuen Antiken Wundern, will ich hier gar nicht groß anfangen, dazu kann man hier in diesem Threat und zu dem der Kapitel davor genug Meinungen nachlesen.[BR]Bleiben noch zwei Punkte, Kreativität und Produktiosdauern.[BR]Über die Produktionsdauern wird sich endlos streiten lassen, selbst die Standardzeiten (der Werkstätten und Maufakturen) sind öfters in der Ideenschmiede in der Diskussion. Bisher war (und ist) es so, dass die Gebäude der Gastrassen die unterschiedlichsten Produktionszeiten haben. Ist dies gut, ist dies schlecht? Bevorteils dies aktive Spieler, bevorteils es Spieler, die nur ein, zwei Mal am Tag reinschauen (können)? Diese beiden Fragen wird jeder mit seiner eigenen Meinung beantworten können, wobei sich die Meinungen sicher, teils stark, unterscheiden. Hier müssen die Entwickler stets aufs Neue eine Balance finden. Bezüglich des aktuellen Kapitels ist es sicher so, dass das Portal auf Stufe drei, vier beidem gerecht wird. Aber was ist nun mit den Schiffen. Die Flagschiffe erfordern klar kein ständiges Abholen, ohne dass die Produktion darunter leidet. Bei den großen Schiffen fängt es aber schon an. Eine Stunde ist sicher nicht das, was jemand, der berufstätig ist, (sinnvoll) abholen kann, sprich schon hier würden diese Spieler längere Produktionen wählen, die pro Stunde/Tag dann zu einer geringeren Produktionen führen. Wie gravierend (und ob) diese Einbuße ist, ist wieder ein Thema für eine endlose Diskussion, ich sehe hier aber keine unnötige Ungerechtigkeit. Kommen wir zu den kleinen Schiffen, an denen sich hier die Geister scheiden. Ja, die Produktionen sind sehr kurz und man muss letztlich dauerhaft online sein, um diese Schiffe effektiv nutzen zu können. Damit sind sie für Berufstätige,... wenig geeignet. Dies führt dazu, dass Spieler, die dauerhaft online sein können, einen Vorteil gegenüber diesen Spielergruppen haben. Soweit so gut (wobei ich schon damit rechne, dass diese Feststellung umstritten ist). Aber ist dies schlecht oder ungerecht? Wie man schon in etlichen Ideen im Ideenbereich nachlesen kann (weitergeleitet, Archiv, Ideenschmiede), bin ich ein Verfechter von \"Aktivität sollte sich lohnen\". Genau deshalb verneine ich diese Frage. Wozu ich mir allerdings kein Urteil erlaube ist, ob dieser Vorteil (oder Nachteil der anderen) in dieser Höhe angemessen ist, denn klar ist, während ein flächenmässiges 1:1-Ersetzen der großen Schiffe durch kleine eine überschaubaren Änderung der Produktionsmenge bedeutet, sieht es ganz anders aus, wenn man statt/zusätzlich zu den großen Schiffen auf mehr Fläche kleine Schiffe aufstellt. Hier sollten aber die Entwickler, durch eigene Tests, Beta und mittlerweile auch Live, genug Daten haben, um sich ein (momentanes) Urteil gebildet zu haben, ob das Balancing ihren Vorstellungen entspricht. Da bisher hier keine Änderungen vorgenommen wurden, scheint hier kein (akuter) Handlungsbedarf gesehen zu werden.[BR]Es sei hier auch angemerkt, dass bei den vorherigen Kapiteln Wissenspunkte und erweckte Güter (sowie auch weiter \"vorne\" Mana oder Orks) die Forschung gebremst haben. Dies wurde ebenfalls kritisiert, mit dem Wunsch, dass hier eine andere Lösung gefunden werden solle.[BR]Letzter Punkt, die Kreativität.[BR]Vorne weg, ich bin von den Graphiken (wieder mal) angetan und aufs Neue positiv überrascht. Auch die Geschichte finde ich gelungen, auch wenn ich den politischen Unterton, den ich in dieses Kapitel wie auch das/die vorherigen herauslese, etwas fehl am Platz finde.[BR]Anders schaut es bei den Gastrasseproduktionen aus. Hier komme ich mir rückversetzt vor, weitestgehend zu den Konstrukten, teilweise zu den Zauberern bzw. ähnlich zu spielender Kapitel, denn letztlich wurden die \"bewährten Zutaten\" diese Kapitel etwas vermischt. Dadurch fühlt sich alles bekannt und angestaubt an und es fehlt diese erfreuliche Überraschung, die ich mir von jedem neuen Kapitel erhoffe. Allerdings ist dies nicht erst seit dem aktuellen Kapitel so und ich muss auch so fair sein zu schreiben, dass ich nicht wüsste, wie man mich hätte überraschen sollen und dass die Entwickler nicht mit jedem neuen Kapitel \"das Rad neu erfinden\" können.[BR][BR]Lange Rede, kurzer Sinn:[BR]Das Kapitel \"Händler der Unur\" ist meiner Meinung nach nicht besser oder schlechter hinsichtlich des Balacings als die vorherigen. Vielleicht leidet es etwas mehr als die Kapitel davon an \"Abnutzungserscheinungen\", aber diese hier hochkochende, teilweise aggressiv gegenüber den Moderatoren/Entwicklern/Inno geführte Diskussion, kann ich beim besten Willen nicht nachvollziehen."}, {"54": "Tacheless schrieb:\t\t\tJa, die Gastrassen werden anspruchsvoller und zeitintensiver. Genau aus dem Grund, dass man eben nicht nach 2-3 Wochen durch sein soll und dann einen ewig langen Leerlauf bis zur Veröffentlichung der nächsten Gastrasse hat. Dies wurde ja immer wieder bemängelt.\t\tZum Vergrößern anklicken....[BR]veto ![BR][BR]zeitintensiv und anspruchsvoll ist bei weitem nicht das Gleiche ![BR][BR]Was lange dauert, kann zwar trotzdem anspruchsvoll sein, aber das neue Kapitel aber ist einfach nur stumpfsinniges Produzieren von kleinen Mengen, die man dann irgendwann nach Wochen in ein Kapitel abgeben kann. das ist wirklich nicht das, was Elvenar bisher ausgezeichnet hat.[BR][BR]Das Spieler es bemängelt hatten (ich nicht !), dass es lange dauert zu einer neuen Gastrasse, muss ja nicht dazu führen, dass die GR nun mit Gewalt in die Länge gestreckt wird.[BR]Spielwitz kann sich auch anders präsentieren, muss nicht in Stumpfsinn enden ...[BR][BR]Man hat ja in den GR-Pausen auch andere Dinge zu tun, die auch nicht minder langweilig sind - warten auf eine neue Gastrasse ist ansich nicht Essenz ses Spieles - ok, einige wollen ständig schnell \"was Neues\", aber davon muss sich die Spiel-Entwicklungsleitung nicht mit Gewalt vorantreiben lassen.[BR][BR]Ich finde, allem voran steht der Spielspass ![BR][BR]und der wird bestimmt nicht besser, wenn man solche Dinge endlos in die Länge zieht, nur damit die Spieler nun nicht so schnell fertig werden.[BR][BR]Die, die das wollen, schaffen das sowieso (siehe Text ASLAN oder siehe Luna, die in einer Woche durch war.)[BR][BR]Aber es gibt auch andere, die \"normal\" spielen, von denen wird bestimmt einigen nach Wochen/Monaten sturem Abgeben der gleichen GR-Materialien die Lust am Spiel vergehen. Man muss schon das Gefühl haben, dass man irgendwie vorwärts kommt und nicht ständig auf der Stelle tritt.[BR][BR]HdW[BR][BR]ps Vorschlag fürs nächste Kapitel: [BR]jeden Tag 10-20 Rosen abgeben, wer dann 20.000 Rosen zusammen hat, ist dann durch.  [smilie--sprite1][BR][BR]ps2 ich finde die Kommentare hier dazu sehr gut , treffend und sachlich geschrieben !"}, {"60": "Ich kann mich den vielen Vorschreibern nur anschließen - es ist alles auf den Punkt gebracht. Auch ich empfinde es als ein unnötiges in die \"Länge ziehen\" und das noch um Welten schlimmer als in K16.[BR]Das neue Kapitel ist auch aus meiner Sicht misslungen (bis auf die Grafik, auch wenn Schiffe so gar nicht mein Thema sind), keine GR hat mir bisher so wenig Freude gemacht. Schade, sehr schade."}, {"65": "Das ist das erste Ausbauspiele,[BR]wo man nur durch Abbauen weiter kommt.[BR][BR]Selbst bei der früher gefürchteten Orks-GR,[BR]konnte man die Pilzfarmen und Sammelpunkte ausbauen,[BR]auch wenn es nervig war.[BR][BR]Bei der Unur-GR habe ich bald das fertige Produkt[BR]und ich kann nur mehr Manus und Rüstkammern löschen,[BR]um mich nicht 6 Monate zu quälen.[BR](GA Sperre vorprogrammiert [smilie--sprite3])[BR][BR]Alle die dieses Kapitel interessant oder gut empfinden,[BR]können mir in 6-9 Monaten nochmal schreiben.[BR]Ich will auch meine GM unterstützen und evtl. das GA spielen!!![BR](Ein paar Vorredner haben es auch mit Zahlen sehr gut belegt)"}, {"221": "diese gastrasse ist an langweiligkeit und langatmigkeit nicht mehr zu überbieten. eine absolute zumutung die mich dazu gebracht hat woanders zu spielen. das feedback in meiner gm ist da konform. jeder ist angeödet und verliert die lust aufs spiel."}, {"57": "das ist jetzt aber ein schlechter Scherz oder ??? ich hab die ganze Stadt voller Gastrasse und wegen eurem Unurium musste ich alle Wohnhäuser abreissen und hab natürlich Bevölkerungsminus und jetzt wollt ihr für die Forschung Finale Wohngebäude 55000K und ich kann nur 54000K Höchstmenge, weil mir natürlich der Ausbau des Hauptgebäudes fehlt, das aber nicht geht weil ich Bevölkerungsminus habe. [BR][BR]Wie stellt ihr euch das vor? Ich zahl doch jetzt nicht 70 Diamanten für sowas von euch. Und jetzt steck ich im Forschungsbaum sonst fest?[BR]Wer hat sich sowas ausgedacht, echt negativ, sry."}, {"90": "Wenn du die gastrassen güter zusammen hast, lagere doch einfach die Schiffe kurz ein, damit du wieder Wohngeb. aufbaust so das du wieder ein Bev + hast um dein Haupgeb auszubauen. ist es ausgebaut , hohl deine schiffe wieder raus und prode weiter."}, {"2": "...hmmmh - vielleicht habt ihr einfach zu viel Unurium ^^ - das ist bei mir absolute Mangelware, da ich nicht viele normale Gebäude habe und demnach auch wenig Arbeiter bzw. Kulturverbrauch. Auch prodde ich das Unurium eigentlich nur über Nacht, weil mir sonst die Saat ausgeht - meine Manus/Werkstätten will ich nicht einlagern, sonst hab ich da ja noch weniger Produktion an Unurium (und auch die anderen Sachen nicht) und alles was ich \"verschmerzen\" könnte, liegt ganz weit weg von den Gastrassengebäuden, die traditionell bei mir immer unten rechts zu finden sind - meine Stadt werd ich aber garantiert nicht deswegen komplett umkrempeln. Bis ich überhaupt die 24-30 Schiffe aufgebaut habe, die ich mal so im Architekten eingeplant hab, vergehen wahrscheinlich 3 Monate, in denen ich aber alle 2-3 Tage was bauen kann, was mich tatsächlich \"schneller\" macht (irgendwie) - bis dahin hab ich vermutlich auch einige Forschungen nebenbei erledigen können. Ich habs nicht eilig mit der Gastrasse - die läuft bisher einfach so nebenbei mit ohne daß ich sehr viel an meiner Stadt verändert habe - meine 6 extra Bibli-Sets, die ich für das letzte GA aufgestellt habe (und jetzt für das Event), werd ich noch ne zeitlang stehen lassen (nächstes GA) und dann kuck ich weiter - kommen ja neue Events/GAs [smilie--sprite1]"}, {"218": "Die Gastrasse werden von mal zu mal schlechter.  Eigentlich braucht man nur den Handelsplatz und die drei Anführerschiffe, da dies die Menge bestimmen, welche produziert wird, sehr gering zu dem was benötigt wird von 500  bis 200 Muscheln, Perle oder Schlüssel alle 6 Stunden, wenn für eine Forschung davon bis locker 50.000 oder mehr braucht.[BR][BR]Rest verteilt die Güter nur um, ja ich habe mir nicht mehr die Mühe macht ausrechnen, ob ich bei dem Hin und Her tauschen Gewinn machen kann.[BR][BR]Durch das Tauschen bekommt einzelne Forschung schneller, aber ich bin insgesamt nicht wirklich schneller, da die Gütermenge sich nicht verändert  [BR][BR]ich spiele hier nur noch nebenher und habe mich einen anderen Spiel zu gewendet. Alle Nebenwelten sind inzwischen still gelegt.  Das ich noch so hoch in der Rangliste stehen, werte ich als Indiz, dass die meisten Spieler die Gastrasse \"lieben\" und vor sich hin gammeln"}, {"2": "NIcanor de Corda schrieb:\t\t\tich habe mir nicht mehr die Mühe macht ausrechnen, ob ich bei dem Hin und Her tauschen Gewinn machen kann\t\tZum Vergrößern anklicken.......doch doch - Gewinn machst du schon - die 3 Gastrassengüter haben eine Wertigkeit von 4 (Shrimp), 2 (Perle), 1 (Schlüssel) - also 1 Schlüssel ist so viel wert, wie 2 Perlen oder 4 Shrimps...[BR]...in der Grundproduktion hast du immer (egal welche Produktion) doppelt soviel Einnahmen wie Ausgaben - dazu kommen dann noch Portal- und Wunderbonus....[BR][BR][IMG]https://i.ibb.co/64dHxkK/https-de-forum-elvenar-com-index-php-attachments-unur-png-22630.png[/IMG][IMG]https://i.ibb.co/Wyp463b/https-de-forum-elvenar-com-index-php-attachments-unur2-png-22631.png[/IMG] (16 Schlüssel sind soviel wert wie 32 Perlen - du brauchst aber nur 16 = Wertverdopplung)[BR][BR]...das sind jetzt zwar nur die Werte von den großen Schiffen, aber bei den kleinen müsste es der gleiche Ertrag sein (die hab ich noch nicht). Der zusätzliche, also Mehr-Betrag durch kürzere Produktionszeiten bezieht sich nur auf den Zeitrahmen, also wieviel kann ich an einem Tag herstellen - der Umtauschkurs bzw. der Mehr-Ertrag durch die Schiffchen sollte aber immer gleich sein.[BR][BR]Nochmal anders ausgedrückt - durch die Schiffchen kannst du den Ertrag aus den 3 Flaggschiffen verdoppeln oder gar vervielfachen (je nach Portal- und Wunderbonus) - die kleinen Schiffchen kannst du dabei öfters am Tag nutzen und dabei einen größeren Betrag verdoppeln - wer aber nicht oft on ist, für den sind die großen Schiffe hilfreicher - von denen kann man aber nur je 3 besitzen...ist also eine Platz- und auch eine Aktivitätsfrage, was man stellen soll/kann."}, {"90": "NIcanor de Corda schrieb:\t\t\tDie Gastrasse werden von mal zu mal schlechter.  Eigentlich braucht man nur den Handelsplatz und die drei Anführerschiffe, da dies die Menge bestimmen, welche produziert wird, sehr gering zu dem was benötigt wird von 500  bis 200 Muscheln, Perle oder Schlüssel alle 6 Stunden, wenn für eine Forschung davon bis locker 50.000 oder mehr braucht.[BR][BR]Rest verteilt die Güter nur um, ja ich habe mir nicht mehr die Mühe macht ausrechnen, ob ich bei dem Hin und Her tauschen Gewinn machen kann.[BR][BR]Durch das Tauschen bekommt einzelne Forschung schneller, aber ich bin insgesamt nicht wirklich schneller, da die Gütermenge sich nicht verändert [BR][BR]ich spiele hier nur noch nebenher und habe mich einen anderen Spiel zu gewendet. Alle Nebenwelten sind inzwischen still gelegt.  Das ich noch so hoch in der Rangliste stehen, werte ich als Indiz, dass die meisten Spieler die Gastrasse \"lieben\" und vor sich hin gammeln\t\tZum Vergrößern anklicken....Diese ausage ist falsch, du hast wenn man immer von jedem Schiff die selbe menge stehen hatt, ein Gewinn an Gütern. Bist du aktive und machst die kurzen Prod. dann hast du am ende des Tages halt mehr güter als wenn du nur immer die langen Prod. laufen lässt."}, {"218": "Romilly schrieb:\t\t\t...doch doch - Gewinn machst du schon - die 3 Gastrassengüter haben eine Wertigkeit von 4 (Shrimp), 2 (Perle), 1 (Schlüssel) - also 1 Schlüssel ist so viel wert, wie 2 Perlen oder 4 Shrimps...[BR]...in der Grundproduktion hast du immer (egal welche Produktion) doppelt soviel Einnahmen wie Ausgaben - dazu kommen dann noch Portal- und Wunderbonus....[BR][BR]Anhang 22630 ansehenAnhang 22631 ansehen (16 Schlüssel sind soviel wert wie 32 Perlen - du brauchst aber nur 16 = Wertverdopplung)[BR][BR]...das sind jetzt zwar nur die Werte von den großen Schiffen, aber bei den kleinen müsste es der gleiche Ertrag sein (die hab ich noch nicht). Der zusätzliche, also Mehr-Betrag durch kürzere Produktionszeiten bezieht sich nur auf den Zeitrahmen, also wieviel kann ich an einem Tag herstellen - der Umtauschkurs bzw. der Mehr-Ertrag durch die Schiffchen sollte aber immer gleich sein.[BR][BR]Nochmal anders ausgedrückt - durch die Schiffchen kannst du den Ertrag aus den 3 Flaggschiffen verdoppeln oder gar vervielfachen (je nach Portal- und Wunderbonus) - die kleinen Schiffchen kannst du dabei öfters am Tag nutzen und dabei einen größeren Betrag verdoppeln - wer aber nicht oft on ist, für den sind die großen Schiffe hilfreicher - von denen kann man aber nur je 3 besitzen...ist also eine Platz- und auch eine Aktivitätsfrage, was man stellen soll/kann.\t\tZum Vergrößern anklicken....[BR][BR]daran sieht man wie mich die Gastrasse ankotzt, dass mir dies schon egal ist"}]