[{"1": "Zapraszam do dyskusji."}, {"8": "Nagrodą główną jest w zasadzie Płonący Basen?[BR][BR]Dziękuję za dyskusję."}, {"4": "Zrozumiałem , że te sezony mają być zamiast odrzucanych zadań bocznych [BR]Dobrze to rozumiem ?"}, {"2": "Andrzej M napisał:\t\t\tZrozumiałem , że te sezony mają być zamiast odrzucanych zadań bocznych[BR]Dobrze to rozumiem ?\t\tKliknij aby rozwinąć...Tak"}, {"4": "To znaczy , że to dalszy ciąg zamiany gry z wiadomych zadań i nagród na losowość wszystkiego"}, {"18": "jarq napisał:\t\t\tZapraszam do dyskusji.\t\tKliknij aby rozwinąć...Szkoda że Sezon wyeliminuje zadania rotacyjne.[BR]Wymusi to niestety zmianę np. w moim wypadku strategii z młotkami poprzez dostawienie warsztatów."}, {"17": "no jak na razie Sezon nie wyeliminował zadań rotacujnych ,jak na razie , ale u mnie doszło zadanie z Kociołka , przeoczyłam to w zapowiedziach czy o zadaniach do Kociołka nic nie było ?"}, {"2": "miriella napisał:\t\t\tno jak na razie Sezon nie wyeliminował zadań rotacujnych ,jak na razie , ale u mnie doszło zadanie z Kociołka , przeoczyłam to w zapowiedziach czy o zadaniach do Kociołka nic nie było ?\t\tKliknij aby rozwinąć...Zadania z kociołkiem weszły wraz z wprowadzeniem kociołka, trzeba było jednak pominąć/zaliczyć jakieś rotacyjne, żeby się to z kociołka pokazało.[BR]Jak skończysz zadania z kociołkiem, to rotacyjne znikną całkiem."}, {"17": "dzięki Nusion [smilie--sprite1]"}, {"19": "w \"sezonie snów\" ukończyłam wszystkie nagrody dzienne i \"zdobyłam\" trzecią nagrodę -ludibria ventus, \"zdobyłam\" ale nie mogę jej odebrać, niby odblokowana ale jest na niej kłódka. Rozdział gry jest właściwy, płatków mam więcej a nagrody nie można zebrać. Ktoś wie o co chodzi ???"}, {"17": "pewnie to ta co potrzebna jest przepustka sezonowa ,czyli wykupienie jej za diamenty , powinna być nad nią taka czterolistna koniczynka"}, {"19": "Taak, nożna to nazwać koniczyną [smilie--sprite1] no ale za 3000 diamentów to jej nie wezmę. Nie jest warta 300 jak dla mnie. Dzięki za wyjaśnienie [smilie--sprite1] człowiek patrzy i patrzy i odkrywa, że ślepy jest [smilie--sprite1]))"}, {"20": "Josta po pierwsze gdybyś doczytała chyba że ja coś pokreciłam ale kupujesz przepustke raz i odblokowujesz wszystkie nagrody [BR]chyba  bo t brzmi tak [BR]\"po aktywacji przepustki sezonowej możesz odebrac wszystkie odblokowane do tej pory nagrody premium\"[BR]i w sumie dlatego czekam na koniec sezonu ba becie bo boje sie ze odblokuje tylko te ktore zdobyłam a nastepne znowu bede musiała kupic za diaksy [smilie--sprite1]"}, {"19": "Ależ napisałam że ślepa jestem [smilie--sprite1] i nie doczytałam na początku... wiem, że raz kupuję przepustkę i odbiorę sobie za nią wszystkie jakie dam radę odblokować. Obejrzałam wszystkie \"przepustkowe\" nagrody do końca wydarzenia i DLA MNIE nie są aż tyle warte. Co wcale nie znaczy, że dla innych też tak jest. Każdy gra i decyduje za siebie."}, {"8": "Cztery razy zaczynałem budowę miasteczka i zawsze było tak, że mechanika i nagrody z zadań rotacyjnych z linii fabularnej i tych drugich dawała na początku przyspieszony rozwój miasteczka. Było to po prostu najlepsze na tym najwcześniejszym etapie źródło najpotrzebniejszych zasobów. Monet i narzędzi.[BR][BR]To teraz tak nie będzie?"}, {"17": "blazius1 napisał:\t\t\tCztery razy zaczynałem budowę miasteczka i zawsze było tak, że mechanika i nagrody z zadań rotacyjnych z linii fabularnej i tych drugich dawała na początku przyspieszony rozwój miasteczka. Było to po prostu najlepsze na tym najwcześniejszym etapie źródło najpotrzebniejszych zasobów. Monet i narzędzi.[BR][BR]To teraz tak nie będzie?\t\tKliknij aby rozwinąć...no nie ma tych rotacyjnych zadań , chciałam cos sprawdzić , i odrzuciłam no i znikły rotacyjne , tak jak Nusion powiedziała"}, {"7": "blazius1 napisał:\t\t\tCztery razy zaczynałem budowę miasteczka i zawsze było tak, że mechanika i nagrody z zadań rotacyjnych z linii fabularnej i tych drugich dawała na początku przyspieszony rozwój miasteczka. Było to po prostu najlepsze na tym najwcześniejszym etapie źródło najpotrzebniejszych zasobów. Monet i narzędzi.[BR][BR]To teraz tak nie będzie?\t\tKliknij aby rozwinąć...[BR]Kociołek w grze dostępny jest od badania z rozdziału V , więc do momentu jego odblokowania zadania rotacyjne powinny być widoczne jak dotychczas [smilie--sprite1]"}, {"2": "Tajniakos napisał:\t\t\tKociołek w grze dostępny jest od badania z rozdziału V , więc do momentu jego odblokowania zadania rotacyjne powinny być widoczne jak dotychczas [smilie--sprite1]Kliknij aby rozwinąć...[BR]Nie, niestety nie.[BR]W moim iglicowym miasteczku w III rozdziale właśnie sprawdziłam, odrzuciłam jedno rotacyjne i już ich nie mam.[BR]Zniknięcie zadań rotacyjnych to zmiana, jaka weszła dzisiaj wraz z Sezonem Snów. Sezon zastąpił zadania rotacyjne. Znikną u każdego i nie ma to nic wspólnego z Kociołkiem.[BR]Zadania z kociołka to inna bajka, one się pojawiły u każdego, kto zbadał kociołek, jako takie jednorazowe \"specjalne\" pomiędzy rotacyjnymi. I jeśli ktoś ich nie zrobił wcześniej, to mu jeszcze wskoczą, a dopiero potem rotacyjne znikną całkiem"}, {"21": "Co to zadanie dzienne \"odkryj nowe wioski\" ? Co autor miał na myśli? Zakończyłem zwiad, zakończyłem prowincję i dalej zadanie nie zaliczone. O jaką wioskę chodzi?"}, {"2": "DETES napisał:\t\t\tCo to zadanie dzienne \"odkryj nowe wioski\" ? Co autor miał na myśli? Zakończyłem zwiad, zakończyłem prowincję i dalej zadanie nie zaliczone. O jaką wioskę chodzi?\t\tKliknij aby rozwinąć...[BR]Chodzi o te wioski w evencie[BR][BR][BR][BR]A więc musisz wydać walutę eventową na wioski/skrzynki/jak zwał"}]