[{"7": "Mam zadanie tygodniowe \"Zdobądz pokaźną ilość zasobów\" (6,9m) Użyłem strumień zasobów idąc na łatwiznę. Oczywiście zadania mi nie zaliczyło i teraz nie wiem czy to błąd gry czy błędnego sformułowania  treści zadania [smilie--sprite1]"}, {"13": "Ja dzisiaj dostałam w tygodniowych \"wykonaj 10 zadań z wydarzenia\" trochę kiepsko, bo z wydarzeniem jestem na bieżąco, a tydzień ma tylko 7 dni... Odświeżyłam i wylosowałam \"wykorzystaj zysk portalu\", niewiele lepiej, bo ostatnią rasę skończyłam już jakiś czas temu i niby mogę zużyć, ale dostane \"0\". Trochę to bez sensu. Po trzecim odświeżeniu piekę chlebki w warsztatach. [BR]Zasadniczo nie mam nic przeciwko większości z tych zadań, ale uważam, że odświeżanie powinno być naszym wyborem, a nie musem spowodowanym niemożliwością wykonania zadania. Przypominam, że ich wybór jest losowy i przy odrobinie pecha można mieć zablokowane zadania tygodniowe.  Zadania powinny być tak ułożone, żeby normalne konto ZAWSZE miało możliwość je wykonać."}, {"4": "Przy zadaniu \"Zdobądź pokaźną ilość zasobów\" , oraz \"Zdobądź pokaźną ilość monet\" u mnie juz od poprzedniego eventu nie działały strumienie zasobów i deszcze monet[BR]Tygodniowe zadania nie przepadają po zakończeniu tygodnia , więc nie trzeba ich robić w danym tygodniu , dlatego pomimo , że kiepsko to wygląda , ale jest dopuszczalne zadanie , którego nie jest się w stanie wykonać w danym tygodniu , bo można do niego wrócić w kolejnych tygodniach - niestety mamy losowość zadań i dlatego wychodzą takie niedogodności dla pojedynczych graczy"}, {"11": "Odpuściłam ten cały Sezon Snów. Nie widzi mi się marnowanie zaklęć, stawianie dodatkowych warsztatów, a już tym bardziej wykorzystywanie waluty na losowanie, gdzie mnie nagrody z danego dnia nie interesują. [BR][BR]Tajniakos napisał:\t\t\tMam zadanie tygodniowe \"Zdobądz pokaźną ilość zasobów\" (6,9m) Użyłem strumień zasobów idąc na łatwiznę. Oczywiście zadania mi nie zaliczyło i teraz nie wiem czy to błąd gry czy błędnego sformułowania treści zadania [smilie--sprite1]Kliknij aby rozwinąć...Działa tylko na monety a nie na młotki- tak było od zawsze w eventach, więc nie jest to błąd gry."}, {"13": "Charlene napisał:\t\t\tDziała tylko na monety a nie na młotki- tak było od zawsze w eventach, więc nie jest to błąd gry.\t\tKliknij aby rozwinąć...W ewentach jest ZDOBĄDŹ monety i WYPRODUKUJ zasoby. Różnica niby niewielka, ale jednak ;P"}, {"11": "Lanariko napisał:\t\t\tW ewentach jest ZDOBĄDŹ monety i WYPRODUKUJ zasoby. Różnica niby niewielka, ale jednak ;P\t\tKliknij aby rozwinąć...Racja, ale niestety mechanizm ten sam :/"}, {"24": "Gorzej jak w dziennych wypadnie zadanie \"wykonaj zadanie z wydarzenia\" [smilie--sprite1]"}, {"3": "Lanariko napisał:\t\t\tJa dzisiaj dostałam w tygodniowych \"wykonaj 10 zadań z wydarzenia\" trochę kiepsko, bo z wydarzeniem jestem na bieżąco, a tydzień ma tylko 7 dni...\t\tKliknij aby rozwinąć...[BR]Nagrodę dzienną zalicza jako zadanie wydarzenia. czyli nawet jak ktoś doszedł już do blokady, powinien się z tym zadaniem wyrobić.[BR]Natomiast zysk portalu można zużyć nawet jak się nie ma portalu. po prostu dostanie się zero towarów portalowych"}, {"2": "Lanariko napisał:\t\t\tJa dzisiaj dostałam w tygodniowych \"wykonaj 10 zadań z wydarzenia\" trochę kiepsko, bo z wydarzeniem jestem na bieżąco, a tydzień ma tylko 7 dni...\t\tKliknij aby rozwinąć...Zadania tygodniowe nie przepadają, jak się ich nie zrobi w ciągu 7 dni. Co tydzień dochodzą kolejne 4 i jeśli nie ukończyliśmy poprzednich, to nowe ustawiają się w kolejce. Jak zrobimy te zaległe, wskoczą nam następne z kolejki. Ważne, żeby zdążyć zrobić te tygodniowe zadania z kolejki przed końcem wydarzenia.[BR][BR]"}, {"13": "Nusion napisał:\t\t\tZadania tygodniowe nie przepadają, jak się ich nie zrobi w ciągu 7 dni. Co tydzień dochodzą kolejne 4 i jeśli nie ukończyliśmy poprzednich, to nowe ustawiają się w kolejce. Jak zrobimy te zaległe, wskoczą nam następne z kolejki. Ważne, żeby zdążyć zrobić te tygodniowe zadania z kolejki przed końcem wydarzenia.[BR][BR]View attachment 5691Kliknij aby rozwinąć...Tego nie doczytałam. Dzięki @Nusion to zmienia sytuacje [smilie--sprite1]"}, {"22": "witam[BR]A ja dzisiaj w zadaniach dziennych mam takie zadanie:[BR]\"odkryj nowe miejsca podczas wydarzenia Czarowników\"[BR]Proszę o podpowiedź co to jest"}, {"25": "juz byl ten temat wyzej  [smilie--sprite1] [BR]poprostu jedno miejsce mocy [BR]Tak to sie nazywa w tym wydarzeniu"}, {"22": "zadziałało[BR]dzięki"}, {"26": "Sama tego nie doświadczyłam, ale można trafić na zadania dzienne - wygraj 1 spotkanie w iglicy walcząc albo wygraj 1 spotkanie w iglicy negocjując (zadania mogą się pojawić, gdy do końca iglicy pozostaje więcej niż 2 dni). Trzeba więc pamiętać, żeby nie przeklikiwać iglicy do końca wcześniej niż w środę (bo rozumiem, że w czwartek i piątek zadanie nie ma szansy się pojawić).[BR]Podobnie z zadaniem dziennym - rozwiąż 3 spotkania turniejowe. Trzeba zostawić sobie jakąś początkową prowincję, jeśli w danym tygodniu turniej klika się we wtorek/środę. [BR]Niby mała rzecz, a irytuje..."}, {"27": "Te nagrody za dzienne zadania (losowe) są wręcz uwłaczające. Np. otrzymanie przyspiesza 10 minut na na celu poniżyć gracza? Jak jest inaczej to proszę o uzasadnienie zasadności otrzymania takiej nagrody.[BR][BR]Głęboki żal dla ciężko pracujących umysłów po stronie IG. Nie dziwię się, że następna grupa graczy podziękowała za grę. Chodziło o przyspieszenie tej decyzji, aby zwolnić miejsce na serwerach?"}, {"28": "Czasem brakuje kilku-kilkunastu minut w tworzeniu w AM ,to i takie male czasowki sie przydaja. Zadania dzienne sa banalne to i nie mozna oczekiwac kosmicznych nagrod."}, {"18": "Zadania dzienne wydają się być (bazując na ich zniknięciu) czymś co ma między innymi zastąpić zadania rotacyjne i zmienić rutynę (?).[BR]Z tej perspektywy - subiektywnie - nie można tego ocenić jednoznacznie pozytywnie. Zmiana jest ciekawa i to pozytyw, że coś się zmienia [smilie--sprite1] Z minusów pojawienia się sezonu & utraty zadań - zadania rotacyjne wymagały czasu ale jednocześnie były dodatkiem do produkcji (znaczącym jeżeli ktoś mógł poświęcić więcej czasu - patrz, robienie zadań wymagało by gracze byli zalogowani, a zadania likwidują taką potrzebę). Bardziej błędem było niedostosowanie wymogów wykonania i nagród do epoki niż sam fakt tego że były.[BR][BR]Czy zadania z sezonu są banalne czy nie, to dość subiektywna ocena - stosunkowo sporo z nich wymaga uwzględnienia określonych budynków czy zmiany strategii.[BR]Z pewnością, jeżeli ktoś jest zainteresowany codziennym a nie przypadkowym wykonywaniem (jak się uda) musi coś od siebie dołożyć. Stąd rozumiem że np. czekanie do ostatniej chwili z ostatnim bossem iglicy (bo może pojawi się zadanie na iglicę) i czysto hipotetycznie uzyskanie zadania na negocjowanie w iglicy, a następnie wydanie xx zasobów na negocjację by uzyskać nagrodę w postaci 1x przyśpieszenie 10 min może skutkować frustracją."}, {"29": "Dla mnie sezon całkiem nieźle. Jak już wspominałem wcześniej, oprawa graficzna bardzo mi się podoba, przyjemnie się otwiera całą \"zakładkę\" z sezonem. Jeżeli chodzi o zadania, to bez większych problemów realizuję większość - więc, oceniam trudność, jako średnią - zdarzają się zadania, które źle wkomponowały się w cykl turniejowo - iglicowy, ale są do przełknięcia. Płynnie sobie przechodzę od jednego dnia sezonowego, do drugiego. Nagrody - patrząc w kontekście zamiennika dotychczasowych zadań pobocznych, wielki plus, absurdalnie śmieszne kilka tysięcy złota/zasobów (ostatni raz zadania poboczne robiłem w epoce 6-7) zostało zamienionych, na zwykłe/żywe towary, czasówki, uzupełnienia oddziałów etc. Wg mnie, w odniesieniu do starych zadań pobocznych, całkiem nieźle to wygląda. Gorzej się mają nagrody premium [smilie--sprite5]  tutaj to IG przeszło same siebie, 3000  za \"mocno średnie\" budynki, plus uwieńczenie sezonu w postaci Sennego Basenu, to mocny żart, o ile w niektórych eventach jestem w stanie się pokusić o odblokowanie nagród premium, o tyle w sezonie, nie widzę najmniejszego sensu marnotrawienia takiej ilości diamentów.[BR][BR]Od samego początku nie traktowałem sezonu, ani kociołka jako \"game changerów\", więc aktualna ich postać w zupełności mnie zadowala. Oczywiście jet to pierwszy sezon i mocno wierzę, że przyszłe, będą mocniej zachęcały do regularnego udziału."}, {"4": "Biorąc pod uwagę tendencje IG w zmianach w nagrodach wydarzeniowych to raczej wartość tychże w sezonowych również będzie szła w dół , ale tym razem już są co najwyżej takie sobie i aż strach pomyśleć co nas czeka po zmianach [smilie--sprite2]"}, {"8": "Największa zaleta Sezonu jest taka, że nie trzeba w niego grać.  To, wbrew pozorom, duża zaleta.[BR]Największa wadą jest, że Sezon zastąpił zadania rotacyjne. Ta wada uderza najmniejszych graczy.[BR][BR]Nagród nie zmienią ponieważ jest jakie takie zainteresowanie tym eventem. O to pewnie chodziło i o nic więcej.[BR]To podobnie jak w Przygodach - nie o nagrody tu chodzi.[BR][BR]Malutki gracz jak się zangażował w zadania rotacyjne to był mocno wynagradzany. Szczególnie w pierwszej epoce. Teraz to przepadło."}]