[{"17": "Jak se na novinku v podobě Věže věčnosti těšíte? Zúčastníte se? [smilie--sprite1][BR][BR]Dejte nám vědět, těšíme se na vaše postřehy a připomínky!"}, {"16": "Dle mojí čerstvé zkušenosti z bety (vyčištěny vyjednáváním všechny 3 patra za použití kupy urychlovačů - bez nich musíte být u hry 24/7 abyste to vůbec stihli) půjdu více méně akorát po setu produkujícího katalyzátory a k tomu mi bude stačit po nějaký čas čistit první parto (i bez urychlovačů). Na druhém a třetím patře je to samé hádání z 5 a více surovin, což je v podstatě loterie, takže na většinu střetů spotřebujete tak 3 pokusy (při smůle i více).[BR]Armádu na věž plýtvat nehodlám, ta má lepší úkoly.[BR][BR]Pozor pro všechny: Kromě standardních surovin, na jaké jste z výkupů turnajů zvyklí, se můžete těšit i na používání dalších surovin (mana, semena, prošlé zboží). Pro město v kapitole elementálů vám bude stačit jen ta mana a semena, na prošlé zboží dojde ve vyšších kapitolách (nevím teď z paměti, zda je to posunuto o 1 nebo o 2 kapitoly)."}, {"24": "Som rád že môžem povedať, že zavedenie veže na live servery prišlo po tom, čo jej vývoj na bete stihol dosiahnuť taký stav, kedy je ju možné považovať za kompletnú a ucelenú funkciu (možno až na (mne) chýbajúce graficky odlišné bojové pole, ktoré sa aj napriek stretom v oblakoch odohráva na tráve).[BR][BR]Zúčastňovať sa veže budem. Mám na sklade milióny zboží, ktoré nedokážem nikde využiť, takže zrejme sa budem sústrediť hlavne na vyjednávanie. Najväčšou brzdou tam bude zrejme mana, ktorej stále nie je dostatok (stále sa snažím vyhnúť výstavbe bludiska).[BR]Hlavným cieľom zo začiatku bude získať kompletný set měsíčnej knihovny (najmä kvôli katalyzátorom), potom zrejme znížim počet odohratých stretov (i keď set samotný bude asi beh na dlhú trať).[BR][BR]Čo sa týka detailných informácií o nových budovách, ktoré sú súčasťou veže, nájdete ich v Speciální budovy - Věž věčnosti a set popísaný v Setové budovy - Sada měsíční knihovny."}, {"31": "Četla jsem na beta fóru, že obtížnost střetů ve věži se zvyšuje s úrovněmi prastarých divů.[BR][BR]A pro vývojáře: Budou do odměn při střetech opět přidány kouzelné obytné budovy a kouzelné dílny?[smilie--sprite12]"}, {"15": "Ráda bych věděla , jestli se budou požadavky přizpůsobovat úrovni hráčů . Jsem těsně před vstupem do trpaslíků , takže  nějaká mana a tak podobně u mně nehrozí .[smilie--sprite10]"}, {"24": "@Green Jane to áno, všetko to závisí od tvojho aktuálneho pokroku. Rovnako tak hráči pred elementálmi nebudú mať v diplomacii živoucí zboží."}, {"35": "co jsou katalyzátory?"}, {"36": "Katalyzátor = spojovací činidlo"}, {"16": "@donutka V originále je spojovací činidlo nazýváno Catalyst, což přeloženo jest Katalyzátor. Nevím, kdo měl ten výborný nápad pojmenovat katalyzátor \"Spojovací činidlo\". Takže většinou používám originální překlad."}, {"37": "Ahoj, na Věž se moc těším a určitě se zúčastním. Na Betě jsem ji nehrála, tak jdu \"do neznáma\"[smilie--sprite1]. Pochopila jsem, že je když se mi podaří získat set Měsíční knihovny a jsem teď momentálně v kapitole VII budu z něj mít odpovídající bonusy. Když se ale ve hře posunu dál, budu se znovu snažit získat celý set. Chápu to správně?"}, {"20": "Na betě jsem kdysi začala, ale přestala jsem tam hrát, takže s Věží zkušenosti nemám, jen to co jsem četla zde. Ze začátku budu opatrná, než si jí \"okouknu\", ale upřímně: zatím mě moc neláká. Ale třeba časem změním názor. [BR]Mám jen jednu dosavadní zkušenost ze hry: když chce člověk získat všechno, tak toho většinou jen zbytečně moc ztratí."}, {"24": "@Alliin keď sa posunieš ďalej a budeš chcieť, aby sa tomu prispôsobili aj jeho produkcie, bude treba jeho jednotlivé budovy vylepšiť pomocou královskej rekonstrukce."}, {"31": "@iDavis Anebo můžeš jednotlivé kusy prodat a pak se ti začnou znovu objevovat v truhlách se staty v nové kapitole.[BR]Jako šachový set, ne?"}, {"24": "@Prealiena oni sa objavujú vo veži aj potom, čo už ich máš získané. Ja mám napríklad na bete v inventári 3x blahovičník a ešte žiadnu knihovnu."}, {"16": "@iDavis No vidíš, já mám zase 2xKnihovnu + 2xMana Plant + 1x bránu."}, {"37": "Díky, Davisi. S Královskou rekontrukcí mám taky problém - je občas v nabídce Akademie kouzel, ale já ji nemůžu vyrobit: v požadavku na výrobu je taková kartička s hvězdičkou, nevím, co to je , ani jak to získat. Možná to zjistím na nějakém vyšším levelu. A ještě jedna otázka - když jsou to provázané budovy, musí být všechny na stejné úrovni nebo to bude fungovat, i když jsou z různých úrovní? Já vím, že podobná sada jsou i šachy, ale ty taky nemám, tak nemám zkušenost, jak to funguje..."}, {"3": "je to plánek, který se získá, pokud tvé společenství během turnaje dosáhne na poslední - desátou - truhlu. Je vzácný, ale mocný a za trochu snahy během turnaje to rozhodně stojí [smilie--sprite1]"}, {"24": "@Alliin sada bude fungovať, aj keď budú mať jej budovy rôzne levely. Každá z budov bude poskytovať produkciu danú svojou kapitolou."}, {"37": "Aha, tak to se k němu nedostanu, aspoň ne v dohledné době. My v turnaji otevíráme tak 3 bedny, snad se nám v dohledné době podaří i čtvrtá. Každopádně, do desáté bedny daleko[smilie--sprite1]. Moc vám oběma děkuji za odpovědi."}, {"5": "Věž: vyzkoušeno a pravděpodobně zůstane jako krásná dekorace okolo města...obrovské ztráty vojsk a surovin za neadekvátní !! odměnu a i když už se v truhle nějaká zajímavá odměna /pro mne budova/ vyskytne , tak ještě pod malou x % možností získání a to musí mít člověk ještě opravdu obrovské štěstí, aby mu padla.....Byl jsem velmi natěšen na Věž a tedy i nyní velmi zklamán.....nevím, jak v nižším kapitolách ale u nás ve 14. to sklady surovin a vojsko vyluxuje jedna radost /vše raději pošetřím na turnaj/..."}]