[{"69": "Tak ta věž věčnosti není obrovské zklamání ale vyloženě těžkej propadák..Odměny vůči ztrátám na vojsku nebo surovinách včetně many a semínek těžce neadekvátní.Párkrát jsem ji zkusil a tím to končí a to jsem nedošel až do úplného konce.To by ty ztráty byli ještě větší.No to se vývojáři opět vyznamenali.Vylepšete spíš DS které za nic nestojí...místo zlepšení se přidá do hry ještě větší pitomost."}, {"5": "Baxczi, přes prvopočátečné rozpaky k věži, jsem změnil na ní pohled...ano je náročná, ale některé budovy jsou nedocenitelné a průchod lze zvládnout ...někdo to zvládá jen skrze vojáky, já vše prakticky projedu se surovinami, kterých je stejně zatím nadbytek, třeba časem taky změníš pohled nebo něco ve městě a půjde ti to lépe a občas ji projedeš...drž se."}, {"59": "Ta rozporuplnost se mi na věži právě líbí. Někdy se daří, jindy se ukážou stinné stránky, ale o tom ta věž právě je. Možnost získat zajímavé odměny, které jinde ve hře zatím nejsou, ale možnost taky jen ztratit. Příjemně hodnotím i grafiku."}, {"16": "On ten výkup je i dost nevyvážen, třeba takové město v Elementálech je za chvíli bez semen (které stále ještě potřebuje na výzkum). Ale i takové konstruktí město, pokud si přidá manufaktury na prošlé zboží(2-2-1) začne mít díky věži problémy se semínky, pokud nemá moc úrovní divů. A pokud potřebuje T4/5 na výzkum a zároveň mu to luxuje věž, tak je to taky zábava - resp. je to na přerušení výkupu věže - výzkum má přednost."}, {"31": "Potvrzuji, se semínky mě ta věž dost vyšťavila. Holt budu muset začít více bojovat.[BR][BR]Mimochodem, včera jsem stihla první 2 oddíly třetího patra a pak mi došel čas.[BR]Veteráni, jak to stíháte? Je možné projít celou věž bez urychlování bran?"}, {"24": "@Prealiena je to možné, ale len tak tak. Celá veža trvá 126 hodín, z toho brány zaberú 111. Takže ak sa s priebežným hraním trafíš do tých 15tich hodín, môže to byť z hľadiska zesilovačov zadarmo."}, {"59": "Tak ono to vyšťavuje všechny suroviny. Je fakt, že i fazole mi trochu ubyly, protože je většinou zkouším jako první, zatím jsem je ve hře fazole skoro nepotřeboval, takže ubývají jen minimálně. V elementálech jsem jich měl neustálé přebytky, na rozdíl od many, která zase dost často dochází snad ve všech kapitolách. No hlavně to vyjednávání je divné v tom, že se přichází i o suroviny, i které nikdo nechce. Tak když je nikdo nechce, tak proč si je berou ;-). A když si je vezmou, tak by měli už mlčet, a ne chtít další.[BR][BR]Taky jsem zatím nikdy nestihl (i přes celkem jalové a přitom dost obtížné třetí patro), asi je to pro hráče, kteří nikdy nespí a tak to můžou stihnout."}, {"24": "Po mnohých neúspešných pokusoch, dnešným dňom mám konečne hotový set mesačnej knižnice (už to vypadalo na set mesačnej depresie [smilie--sprite11]). Chýbala knižnica, tá dnes padla z tajomnej truhly (fialovej). Stále avšak nie som presvedčený, že ho postavím. Jediným dôvodom by boli úlomky kouzel, ale tých mám toľko, že núdzu naozaj nepociťujem. Možno sa raz nejak zvýšia na ne nároky a potom budem uvažovať o postavení, ale zatiaľ to len bude bdieť v inventári a ja sa budem vytešovať z toho, že jednu zbierku z veže mám hotovú. [smilie--sprite1]"}, {"45": "gratulujem [smilie--sprite1], ja musim cakat dalej, mne padaju len DIA a mam 1x1 a 2x1 budovy. Mozno zajtra z 2.lv."}, {"16": "Mi chybí brána, zato blahovičník a manovec mám oba po dvou kusech.[BR]Já to postavím kvůli produkci katalyzátorů. Resp. on ten neúplný set už u mne stojí."}, {"70": "No ja na knihovnu stale cekam, v jakem patre jsi ji dostal?"}, {"24": "@richardll prekvapivo v prvej mape, ba dokonca ešte v jej 1. polovici. To naozaj len svedčí o tom, že hrať najviac prvé dve mapy je úplne dostačujúce."}, {"70": "Diky tak ja budu taky doufat..."}, {"45": "...ja by som potreboval aby veza mala aspon 10 lv. na to aby som sa dostal k setu. Prve tri veze som dal cele, z tejto mam uz 2 lv. za sebou a nic, stale nemam branu ani knihovnu, keby aspon dzin sa podaril..."}, {"20": "Jsou hráči, kteří hrají s bídou jen 1.patro a už mají celý set. A jiní hrají jak diví a nic moc. Dostat celý set není jen o tom, že budeš hrát pokaždé celou věž. Je to zase o štěstí."}, {"3": "ha, včera večer mi padla knihovna z tajemné (fialové) truhly na první úrovni [smilie--sprite1] tak už mi chybí jen ten zadní kousek"}, {"42": "Mě dnes padla druhá knihovna -_-, ale já do kompletního setu potřebuji manovec. [BR]Je to přesně tak jak to říkáš @Ludi, je to jen % loterie, ale tak věděli jsme to všichni již před zavedením [smilie--sprite2]. [BR]Já jezdím max druhé patro, a jen když se nudím."}, {"16": "@Fjorgyn [smilie--sprite8] Zrovna Manovce už mám 3, vyměním 2 za bránu."}, {"43": "@Fjorgyn @Lovec Krys Kéž by to šlo měnit [smilie--sprite8] Manovců už jsem měl 6 (rozčaroval), zato blahovičník a knihovna furt chybí"}, {"20": "Já mám manovců i blahovičníků několik, tak jsem je postavila cik-cak, kolem 2 brány a dává to celkem slušně živoucího - na to jak je to malé. Chybí mi Knihovna a Svitek. Na CZ1 mám zase 2 svitky [smilie--sprite1][BR]Když se hraje Věž v \"úsporném módu\", tak je to celkem dobrý. Už jsem si zvykla. A zdá se mi, že odměny jsou trochu lepší. Včera jsem dostala i urychlovač na 8 hod. [BR]Myslela jsem, že Džin se dá získat jen ve 3. patře, ale před chvílí mě vyvedla z omylu jedna hráčka v našem společenství, protože jí padl už v 2. patře."}]