[{"45": "...tak ja si vezu uzivam, jej narocnost je pre mna vyzvou, ktoru som zatial vzdy zdolal. Straty, ktore na nej mam + straty z turnajov dokazem vzdy za tyzden zmazat + vyrobim nieco navyse, takze mi vojsko pribuda (nie tak rychlo ako ked veza nebola, ale do hrobu si tie jednotky nevezmem [smilie--sprite1]). Ak by pridali dalsie 2 lv., tak by som vybojoval aj tie..."}, {"43": "@Ludi Džin je myslím v nějakých těch bonusových truhlách...každopádně víc blahovičníků by mi nevadilo, měl bych ten živoucí sajrajt na vykupování věže, ale manovce jsou mi celkem k ničemu, u konstruktů už člověk manu moc nepotřebuje"}, {"45": "...pokial stavas SIMIU a Casopriestor, tak tej many potrebujes tisice...."}, {"38": "Tak jsem částečně přehodnotil Věž Věčnosti.[BR]To špatné o Věži víme všichni, je třeba hledat v ní dobré a využít pro to možnosti, které máme třeba v přebytku surovin a díky Simia v menší míře i v armádě.[BR]Ve Věži začínám postupně ty přebytky s rozumem utrácet a hledám si ten pomyslný bod rovnováhy, aby se nenarušil chod mého stylu hraní, který je primárně turnajový. Třeba jen těch úlomků kouzel, urychlovačů, co to dává, otevírá dveře dalším možnostem v eventech, kde v případě nedostatku úlomků kouzel jsem dříve bral prioritně denní odměny tak, abych měl ty největší budovy. A tím pádem se mi minimalizovaly možnosti otáčet třeba určité dny studny či urychlovače.  Teď už si díky Věži vyberu, neb nejsou třeba další velké budovy z eventů..navíc ponížili zisk úlomků z budov a věcí.[BR]Věž mi věnovala už celý set Měsíční knihovny, kterou bohužel zatím nemám v plánu stavět, neb mě přijde jako jedna z nejhorších zatím. Co nabízí, nepotřebuji.[BR]Každopádně se na Věž začínám dívat už spíše herníma očima místo ekonomickýma. Na konci hry je třeba si hru nějak zpestřit, tak proč to nezkusit v podobě sebemotivace právě ve vybalancování Turnaje, Věže, surovin a armády tak, aby to optimálně vycházelo [smilie--sprite1][BR][BR]Pro ty, co rádi porovnávají hodnoty budov a setů mezi sebou, třeba i tu zmíněnou Měsíční Knihovnu, tady je aktualizovaný přehled výrob pro kapitolu Konstruktů se sběrem na 24h (Ráj jsem ponechal na těch 21h):[BR][BR][IMG]https://i.ibb.co/0C3Bq1B/https-cz-forum-elvenar-com-index-php-attachments-sada-2-jpg-3707.jpg[/IMG]"}, {"5": "Joi, mluvíš mi z duše k vyjádření k věži...opravdu palec nahoru [smilie--sprite1][BR]+ k měsíčnímu setu: nemusí se stavět celý, za mne hlavně Nekonečné svitky/2+1/ a k tomu třeba  1x1 /Blahovičník, Manovec/ a slušně to doplní produkci T2.[BR][IMG]https://i.ibb.co/hm07wX3/https-cz-forum-elvenar-com-index-php-attachments-d-ini-svitky-png-3708.png[/IMG] [IMG]https://i.ibb.co/WBx0yqp/https-cz-forum-elvenar-com-index-php-attachments-d-insvitek-png-3709.png[/IMG]"}, {"20": "@BiggJOEcz  Napsal jsi to moc dobře. Poslední dobou taky vnímám, že Věž je o hledání vyrovnanosti - jako v celé hře.  A jak píše ElfNostradamus, set se nemusí stavět celý. Já mám dvě brány a mezi tím cik cak blahovičník a manovec, což mi dodává příjemné množství živoucího.[BR]Ale přiznám se, že pokud by mi padl i zbytek setu, tak ho asi postavím [smilie--sprite1][BR][BR]Oprava v tabulce: Karnevalová sada dává v konstruktech 88650 many, ostatní jsem nekontrolovala"}, {"45": "...tak vezu c.4 mam hotovu. opat pridavam tabulku strat (na porovnanie aj predosla veza), resp. rozdielov v pocte. Pripravujem sa na turnaj drahokamov a tak aj ked som hral vezu a mal som nejake straty na kbazoch, tak mi za tie 2 dni aj tak pocet narastol o 33T) . O odmenach pisat nebudem [smilie--sprite1] mne v loterii padaju bud DIA alebo ine blbosti...[BR][BR][IMG]https://i.ibb.co/LJgFNGt/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-9-17-12-45-11-png-3712.png[/IMG]"}, {"59": "Koukám, že lidi (a elfi) začínají přehodnocovat. Zezačátku mi přišlo, že se většina vyjádřila, že jim to vyfouklo zdroje a armádu plácat nehodlají, protože na konci hry už potřebují jen VB na dopování divů, které dostanou jen v turnaji. Ale spatřuji, že ve věži někteří začínají pociťovat součást hry, a možnost z ní získat i něco ve svůj prospěch."}, {"3": "no, mám pocit, že mi věž opatrně po malých dávkách požírá týden co týden nasyslené zásoby. Ale na druhou stranu musím říct, že mě ta diplomacie prostě baví"}, {"20": "@Pauleo  Bereme věci takové jako jsou. Jak  napsal BiggJOEcz: \"To špatné o věži víme všichni ...\"  [BR]Když jsem hrála při první spuštění Věže celé 3 patra, ztráty silně převyšovaly zisk v odměnách. Takže 3 patra budu hrát jen opravdu výjimečně. Nemá smysl se pravidelně vydat ze surek i vojáků. Pořád platí, že kvalitně odehraný turnaj mi dá daleko víc. Toho se prostě nevzdám a turnaj bude u mě vždy priorita před Věží.[BR]Věž dává určité odměny, které jsou dobré, ale kápne se na ně velmi zřídka a ostatní jsou velmi slabé. Ale jde hrát v úsporném módu, takže zisk mírně převyšuje ztráty. Prostě 1, max 2 patra mě nezruinuje a přitom se dá něco slušného získat. To je celé."}, {"59": "Ludi >> No a to je to co tu říkám od začátku. A ani nikdo netvrdil, že by věž měla nahrazovat turnaj, je to prostě zcela jiná záležitost. Pak mě ještě napadlo, že se najdou i hráči bez společenství (sic jich asi moc není), pro ty to naopak může být možnost si něco vybojovat. Jediné co mi přijde podivné je přísun úlomků kouzel, je jich strašně moc, a někdy nepadá vůbec nic jiného, jestli se s tím něco neudělá, zcela tento předmět ztratí význam."}, {"20": "@Pauleo  Jasně, Věž má četná negativa. O tom žádná. Třeba se to časem doladí.[BR][BR]Nevím, jestli Věž bude využívat nějaký hráč samotář. Pokud některé z nich v okolí mám, tak spíš bych řekla, že asi jen výjimečně. Těmto hráčům dost vázne obchod, takže z toho plynou další problémy. Jen někteří hráči, kteří se osamostatnili už s velkou mapou, to můžou zvládat."}, {"64": "Ludi napsal/a:@PauleoNemá smysl se pravidelně vydat ze surek i vojáků.\t\tKlikněte zde pro zvětšení...Přesně tak, mně Věž zlikvidovala většinu armády a ta mi pak chyběla v turnaji..."}, {"59": "Saux >> Věž se musí hrát uváženě. Je to prostě možnost, a musí se vědět kdy přestat. Nakonec se nemusí hrát ani pokaždé."}, {"64": "@Pauleo Přesně to mám taky do budoucna na mysli [smilie--sprite1]"}, {"20": "Jdu potěšit všechny smolaře: za celé 2. patro mi nepadla ani jedna tajemná truhla [smilie--sprite4][BR]A u žabáka na několik opakovaných pokusů diplomacie a pak odměna 5% portálový bonus [smilie--sprite9][BR]že já pitomec jsem tam zase lezla [smilie--sprite8]."}, {"3": "mě tentokrát taky ani jedna, zato v prvním kole 3. alespoň žabák dal dia"}, {"20": "Já měla v prvním kole 1 tajemnou truhlu, ani si nepamatuju. co mi z ní padlo, prostě nějaká pitomost, takže Věž tentokrát úplný propadák [smilie--sprite8][BR]Trochu váhám, jestli mám jít do 3. patra, třeba by tam něco dobrého padlo, ale spíš zase nic. Prostě máme s Věží takový komplikovaný vztah [smilie--sprite7]"}, {"42": "@Ludi jestli Ti to udělá radost, tak jsem také teď dostal jen 5%portál z žáby na druhém patře [smilie--sprite8]."}, {"31": "Z žabáka jsem teď dostala 50 dia a jsem za to ráda. Nějaká tajemná truhla tam byla, ale jenom blahovičník z ní. Další odměny nestály za nic. Po zbytek týdne se asi budu soustředit na turnaj, třetí patro už bych stejně nestihla celé."}]