[{"59": "No aspoň jste se zmohli na žabí polibek, to já na něj nemám čas, ani prostředky.[BR][BR]Abych vás v tom nenechal samotné, tak poslední sekce (jako skoro celé patro) jsem dostal úlomky, úlomky, úlomky, a taky 5% portál, tak nesmutněte ;-)."}, {"15": "Jak koukám, tak jsme na tom skoro všichni stejně . Ale fakt je , že už mně to tak nebere .Člověk je ze začátku zvědavý , tak jede \"jak fretka\" a pak kouká na prázdné sklady. No co , je to dobrý pokus o zábavu .  [smilie--sprite11][smilie--sprite8][smilie--sprite8][smilie--sprite8]"}, {"71": "ElfNostradamus napsal/a:\t\t\tVěž: vyzkoušeno a pravděpodobně zůstane jako krásná dekorace okolo města...obrovské ztráty vojsk a surovin za neadekvátní !! odměnu a i když už se v truhle nějaká zajímavá odměna /pro mne budova/ vyskytne , tak ještě pod malou x % možností získání a to musí mít člověk ještě opravdu obrovské štěstí, aby mu padla.....Byl jsem velmi natěšen na Věž a tedy i nyní velmi zklamán.....nevím, jak v nižším kapitolách ale u nás ve 14. to sklady surovin a vojsko vyluxuje jedna radost /vše raději pošetřím na turnaj/...\t\tKlikněte zde pro zvětšení...Naprosto souhlasím, ačkoli jsem už v posledním levelu, zásob i vojska mám dostatek, nebudu dotovat něco, kde nelze vysledovat zákonitosti vyjednávání... Na věž jsem se vážně těšil, ale teď ji beru jen jako ozdobu, škoda ;-(  To taky raději pošetřím na turnaje a podpořím společenství."}, {"5": "Ahoj Sviku, můj názor se během měsíce co věž běží velmi a to že velmi zpozitivnil!! [smilie--sprite1] ...a nevím zda-li se postupně trochu nezměnili parametry nebo nás duchové tolika ,,nesmaží,, při hádání surovin, ale projíždím ji nyní pravidelně celou...bojuji opravdu pouze se 100% jistotou výhry a minimálních ztrát a při nakrmení ptactva v rámci turnaje. Zbytek se snažím vyjednat, nespěchám jedu dle harmonogramu věže, takže ztráty urychlovačů minimální, doplnkové vyjednávání ano dokupuji za diamanty, ale ty se obvykle v nějaké odměně zpravidla vrátí zpět...sumasumárum surovin mám dost a vyváženě je používám mezi turnaj a věž. Nakonec tedy zisky z věže převažují nad případnými ztrátami. Je nutné vidět, že tu věž již bude napořád nebo aspon na nějaký delší čas určitě a pokud to půjde a i kdyby zisk z věžě byla pouze jedna budova za týden, tak za rok je to 53 budov!! a z toho se dá již poskládat velmi zajímavý set, nehledě na další dílčí odměny úlomky, činidla, urychlovače,% bonus portály, požehnání. To vše vyváží mé ztráty surovin ve věži, sklady netrpí, jak píši jedu zatím vyváženě mezi turnajem a věží a daří se mi to - ano především díky ,,kvalitě,, mého města, připouštím že ne každý a v každé kapitole si může věž takto vyváženě projíždět celou,ale alespon část z ní ano.....přeji všem at´se jim to brzy podaří optimalizovat a přeji i zisky z truhel, protože budovy i další kvalitní odměny padají už i v prvním patře Věže věčnosti [smilie--sprite1] hezkou zábavu"}, {"20": "V podstatě to tu už padlo několikrát a je to jasné čím dál víc. Pokud hrát věž, tak jen 1. patro a 2. jen někdy. Třetí je úplná vykrádačka skladu. Teď jsem tam dala první střet a objevila se tajemná truhla. A hádejte kde? Až u vrcholu ... A v truhle navíc samé pitomosti.[BR][BR]Takže to shrnu pro věž tohoto týdne:[BR]1. patro - jedna tajemná truhla ze které mi padla nějaká nejapnost (už ani nevím co to bylo)[BR]2. patro - žádná tajemná truhla a u žabáka 5% portálový bonus[BR]3. patro - po prvním střetu se ukázala tajemná truhla bez významného obsahu, která se dá otevřít až v závěrečné části. Děkuji, nechci.[BR][BR]Co se týče zisku, tak nelepší bylo 1. patro, protože přeci jen pár drobných urychlovačů mi tu padlo, asi 3 katalyzátory a jinak úlomky.[BR]Píšu to sem proto. že někteří hráči se tu radovali, jaký jim Věž přinesla zisk. Řekla bych, že je to spíš výjimečné. Myslím, že většina hráčů to má podobně jako já.[BR][BR]@ElfNostradamus  Myslím, že hodně věž ovlivňuje, pokud diplomacii doplňuješ nákupem další možnosti volby za dia. Také jsem to zkusila, ale o návratnosti dia ve věži nemůže být ani řeč. Bylo to pro mě v dia těžce ztrátové, takže už to nedělám. Věřím, že pokud se do věže hází víc dia, tak odměny budou slušnější a je to v pořádku. Ale my ostatní, co s dia víc šetříme, tak ve věži nemáme moc šancí. To je realita.[BR][BR]Příspěvky sloučeny. Embla"}, {"5": "Ok Ludi pokusím se to více sledovat dia za výkupy dalšího vyjednávání / versus dia zpět v odměnách, s výsledkem někdy obeznámým [smilie--sprite1]"}, {"20": "Spíš zkus jednou hrát bez použití dia."}, {"3": "proč bez dia? Každý se tu chvástá, kolik má z eventů studen a tam ty manty padají. Já jedu dvě kola věže (třetí mi připadá ztrátové) a většinou končím cca -50 dia. To mi dá mých 9 studen za den, maximálně za dva. Kde je celý týden do další věže?"}, {"31": "@ElfNostradamus Můžeš, prosím, blíže popsat u které brány v kterém patře používáš urychlovače? Zajímalo by mě, jak si to organizuješ. Zjistila jsem, že prodlevy ve věži mi kolidují s prací, takže to bez urychlení nezvládám.[BR]A souhlasím s @Ludi, zkus si to někdy bez dia. Třetí patro už má na vyjednávání moc různých surovin, takže to na tři pokusy většinou uhádnout nejde. A na boj aby byl člověk připravený s dostatečnou zásobou jednotek, tak si to schovávám na týdny, kdy se nemusím rozjíždět v turnaji."}, {"16": "Já jedu pravidelně první dvě patra. Bez urychlovačů, bez diamantů a bez armády. Jen vyjednávám.[BR]Ono někdy něco užitečného padne (kus setu, zbrojíř, džin).[BR]Včera jsem z tajemné truhyl získal Džina.[BR][BR]Na cz2 a betě jsem věž přerušil kvůli nedostatku semínek, alespoň do doby, kdy nebudu potřebovat semínka na výzkum."}, {"24": "To ja som pre zmenu dostal zase 50% portálový bonus (z druhej mapy). A hádajte čo z jej bossa - 5% portálový bonus. Už ich radšej v tom inventári ani nepočítam.."}, {"20": "@Emhyr var Emreis II  i když mi studny dávají dia, tak ty si šetřím na něco jiného, než na plýtvání ve věži. Každá ztráta je ztráta. Navíc nový systém eventu zřejmě neumožní tak snadný zisk bodů, takže již  nezískám tak velký počet studen, jako dřív. [BR]Ale jsem také přesvědčena o tom, že hráči, kteří užívají ve věži dia, mají na ni celkové optimističtější pohled než ti, kdo hrají bez dia, protože bez dia je to těžší, větší ztráty a menší odměny. O tom jsem přesvědčená."}, {"3": "to je možné. J8 jsem je používat nechtěl, ale většinou mě první kolo donutí 1-2x 25 zaplatit a druhé tak 2-3x. TO jsme někde kolem 100 dia a zatím pokaždé jsem nějaké získal z truhel zpět"}, {"16": "@Emhyr var Emreis II To záleží na preferencích. Já např. raději budu hru \"Hádej, jaký chci úplatek\" s bossem 5x opakovat, než bych utratil dia."}, {"3": "ale to tě už pak vyjde hodně draho. A získat takové množství surovin mi přijde složitější, než těch 25 dia"}, {"20": "@Emhyr var Emreis II - je to o preferencích, jak psal Lovec Krys. Já si jen všimla, že většina lidí, kteří hodnotí přínos věže kladně, jsou ti, kdo používají dia. Ostatní, co hrají věž bez dia, jsou k ní kritičtější. Logické - větší ztráty, menší odměny. A pak je nejmenší kategorie hráčů, kteří to mají jako sport a mají jen chuť tu stvůru pokořit [smilie--sprite8]. Věž hraji, při troše rozumu se dá výjimečně získat něco slušného, ale pokud se trochu něco nezmění, tak z ní do kolen hned tak nepůjdu. To je celé."}, {"38": "Pořád dokola se řeší DIA...ta doba je už trošku ale jinde.  Před pár lety byly dia pojem.  Byly z 99% za peníze. Teď díky třeba studnám ztratily tu svoji \"jedinečnost\", neb je možnost je mít \"zadarmo\" . Proto, když vím, že třeba příklad mám 15.studní, a denně mi to vyprodukuje 100dia (700.týdně), proč by mělo být něco nestandartního, jako vložit na výkup 25.dia.  Opravdu..dia už je touto dobou jinde.  A jak už bylo i několikrát zmíněno..je to vždy o preferencích každého z nás. Někdo šetří dia na rozšíření, ok. Někdo než by našetřil 5000+ dia na rozšíření, tak raději investuje 25 na extra výkup (můj případ). Nikdo nedělá nic nestandartního..je to prostě o tom, jaké máme herní priority.  Nechme ty diamanty už minulostí..[smilie--sprite2]"}, {"20": "@BiggJOEcz  ale v této debatě přece vůbec nejde o dia jako takové. Nikdy mi nevadilo, že někdo investuje do hry, je to svobodné rozhodnutí každého.[BR]Jde tu o to, že hráči, kteří je ve věži dia používají, tak ji berou s daleko větším nadšením než ti, kdo tam dia nepoužívají.[BR][BR]Já mám v hlavním městě 30 studní a ve vedlejším dalších 10 a 100 dia mi to denně nedává. A to sbírám 2x denně. Občas mám i několik dní, že nedostanu nic."}, {"38": "@Ludi  je to o štěstí ty dia a studně. U nás taky poslední měsíc moc nepadají..skoro vůbec."}, {"59": "No asi tak, nejde o brilianty jako takové, ale o srovnávání různého postupu hráčů s bria nebo bez. S brilianty se prostě hraje jinak, takže nejde vše srovnat jako bez nich. A i když se dají získávat ze studen, stále se jedná o ne moc početnou prémiovou měnu. Studně jsem taky měl, získal nějakou dílnu a dalšího stavitele, ale už vypršely, a další událost mi skoro žádné nepřinesla, takže není pravda, že by stále šlo získávat brilianty a nebyl to pro mne pojem. Tak zákonitosti vyjednávání jsou prostě náhodné s malým počtem pokusů, takže to opravdu poznat nelze, je to jen o štěstí nebo ubriliantování, mě spíš štvě nelogičnost vyjenávání, že jim musím dávat suroviny i co nechtějí, resp. když je nechtějí, tak nevím kde končí, že je to vyžere. Jinak první patro na vyzkoušení elementu náhody a štěstí s možností padnutí něčeho kloudného nestojí skoro nic (už párkrát mi padly pro mě užitečné věci - džin, vícekrát 50% portál, 5h urychlovače, obchodní stanice (stále nejsem na konci, takže mě se hodí)), druhé už je na pováženou, někdy se něco ukáže, jindy ne, a už to něco vyžaduje, třetí hrát nehodlám, protože už na začátku jsou dost ztrátové souboje, a za těch několik dalších úlomků to nestojí, ty odměny v posledním patře jsou dost směšné na to, že i dochází čas."}]