[{"5": "...ještě drobná poznámka: při průchodu do vyšších pater se sice zvyšujícími náklady at´již doplnkově vykupováním dalších vyjednávání za dia nebo dalších surovin, ale se rovněž zvyšují i šance na zisk nějaké té budovy i třeba Džina a tím se ta návratnost mění v postupný zisk z kasírování Džina..samo je tu i cesta pomalejší méně nákladnější, jet jen pouze 1.patro a míti více štěstí navíc tedy u některých jiná vyšší alternativa ani prostě nepřipadá v úvahu, protože jejich město více holt nevyprodukuje nebo nemají zájem. [smilie--sprite1] /tím to nechci hanit či snižovat/ každý dle svých možností a taky chuti [smilie--sprite1][BR]PS: Praellieno: aktuální věž - chybí mi už jen poslední 1/4 patra k finále, ale další se tedy vynasnažím detailně zmapovat svůj průchod, byt´to už sem i někdo dával /iDavis video, takulky citellus/."}, {"36": "Jonas: Tak co lidi, co říkáte? Dostanu svůj poklad?[BR]Duch: Ááá! Mince, já nechci mince![BR]Jonas: Když je nemáš rád, proč si je necháváš?[BR]Duch: Nechám si, co chci![BR][BR]Na té věži je stejně nejlepší to video, které k ní vydali. [smilie--sprite8][BR][BR]Mně se ta věž líbí, hraju sice pouze první patro, ale náklady přijatelné a odměny se hodí (možná je to ovlivněno i tím, že jsem teprve v trpaslících, takže to po mě nechce žádné pokročilé zboží). Diamanty nepoužívám, zatím se mi nestalo, že bych dělal jeden střet více než 2x, tak by to asi byla škoda dia, mám jich málo."}, {"59": "Tak takhle je to, věrolomní prolhaní ducháči, tváří se jak neviňata že fér kšeft, a přitom nás chtěj obrat o všecko, nejradši by vysypali naše sklady.[BR][BR]No v prvním patře je to vyjednávání jednoduché, pokud nepadne nějaká záludnost."}, {"3": "vždycky pokud je během vyjednávání potřeba jedna surovina třikrát nebo i vícekrát, tak je to těžké trefit na tři pokusy"}, {"16": "@Emhyr var Emreis II Pokud jedeš podobnou taktiku jako já, tak ano. Pro mne je nejjednodušší vyjednávání, když je každá surovina právě jednou. Ale neplatí to vždy, občas jsou tam nehezky proházené a já se prostě netrefím. On ten algoritmus, co používám, není tak úplně exaktní, takže je to tak na půl algoritmus a na půl typovačka (při 5+ surovinách)."}, {"3": "samozřejmě. Při tříkolovém systému prostě musíš v prvním kole vyzkoušet co nejvíc typů. Jenže pokud zjistíš, že tam dva nejsou, zkusíš to ve druhém nakombinovat a pokud u ducha, kde minule byla červená trefíš znova červenou, tak ve třetím tipuješ ze dvou nebo někdy i tří a to je peklo..."}, {"5": "Dnes jsem se v platformě cz1 dostal se svým malým městečkem do 3.kapitoly a tím se mi tam věž zobrazila vůbec poprvé...výsledek 8 truhel 5x boj zcela jasně vítězný 3x vyjednávání bez nějakých doplnkových navíc...= zisk 3 činidla, 3000 úlomků, 25dia. Sice žádná bonus kouzelná truhlička, ale pro takovéto hráče musí být věž velmi zajímavá min. pro následnou výrobu v akademii, protože zisk např. úlomků je v této fázi dost náročný."}, {"20": "@ElfNostradamus[BR]Odměny jsou určitě výhodnější pro hráče nižších kapitol, to ano. Tam např. urychlovač na 2 hod. něco znamená, úlomky a činidla také.[BR][BR]Záleží také na tom, jakou má kdo Akademii. Kdo si nepřikoupil vylepšení, tak mu věž pomůže. Kdo má Akademii vylepšenou, tak to až taková pomoc není.[BR][BR]Ale pro hráče na konci výzkumu jsou odměny slabé a procento zisku opravdu kvalitních věcí je nízké. V tom názor nemohu změnit.[BR]Možná až mi padnou nějací Džinové, budu taky nadšená [smilie--sprite8], ale zatím se nic podobného neděje.[BR]Asi všichni se víceméně shodneme na tom, že 1. a 2. patro je přijatelné.[BR]Celou věž jsem hrála jen poprvé a od té doby se nakonec nechám zlákat na 2 patra a kus třetího, ale stále mě to víc a víc utvrzuje v tom, že je nejlepší hrát jen max 2 patra."}, {"3": "nemá smysl hrát kus patra - celé nebo nic [smilie--sprite8] a proto třetí patro vždycky otevřu, udělám první střet, abych si řekl, jaký jsem pitomec, že jsem se zase nechal nalákat a čekám na další neděli [smilie--sprite8]"}, {"24": "Vidím to tak, že so začiatkom ďalšej veže počkám až na pondelok. Jednak kvôli možným úlohám v podzimnej udalosti, ale hlavne kvôli naplánovanému kúzlu teleport (dá sa získať už zo 4. stretu). Bude to účinné kúzlo pre skladovanie dodatočných dielní medzi udalosťami."}, {"16": "@iDavis To není špatný nápad. Při 2 patrech se to dá stihnout v pohodě i se začátkem v pondělí."}, {"59": "To mi moc smysl nedává, odměny by měly být zřejmé už se začátkem další věže, tzn. v neděli. Pokud až v pondělí přibyde nové kouzlo, znamená to, že se objeví až v další věži (tzn. za další týden)?"}, {"24": "@Pauleo je tam písané že pri jeho zavádzaní prebehne krátka údržba, takže ja predpokladám že to bude rovno pri nej nahodené a hneď vo veži zmenené."}, {"59": "A jak se zajistí, aby se přepočítaly odměny z předchozího dne? Někdo může mít věž už celou hotovou např. Myslím když by to mělo být fér, a ne že každý dostává jiné odměny."}, {"42": "Tak jsem využil boostu životů co dává trpasličí kovář + jedinečné vylepšení jednotek + 11 level Kláštera bojových mnichů, čili jednotky měly o 88,5% života více a také velice přívětivého matchmakingu protivníků a projel jsem 3 patro na automat. Nakonec jsem byl tak rozjetý, že jsem použil i urychlovače na poslední bránu (což je -12hod celkem na celou věž). Co se týče odměn, tak to bylo určitě přes 12 činidel, cca 150 dia co si vzpomínám, nové trpasličí kováře, tisíce úlomků kouzel a x hodin urychlovačů a několik desítek % portálového bonusu (původně jsem neměl v plánu jet takové bomby, ale nahodil jsem boosty na šetření jednotek v turnaji, proto jsem nedělal důslednější statistiku). Za to uspokojení zdrtit posledního bose to prostě stálo [smilie--sprite8].[BR][BR]Takže pokud se povede složení protivníků a člověk má rozumný bojový základ v divech, nakrmený ohnivý fénix (já vím je to trapné ho pořád připomínat)  a připravené dočasné boosty, tak to není taková katastrofa na probojování se skrz.[BR][BR]"}, {"3": "tak jsi mě inspiroval a když už mám postavené ty bonusovky pro turnaj, tak jsem si s urychlovačema proběhl poslední patro a z finální truhly na mě vyskočil džin [smilie--sprite1]"}, {"20": "@Fjorgyn, @Emhyr var Emreis II  - Jste kluci šikovní [smilie--sprite1]. Takhle je to jasná možnost, jak věž zvládnout bez mega ztrát.[BR][BR]Přidáním nového kouzla do odměn věže o něco stoupne její význam. Doufejme, že v ní postupně budou přibývat i další pěkné odměny.[BR]Od vývojářů je to cesta správným směrem."}, {"59": "No jo, ale to není cesta pro smolaře, na které na konci nevyskočí džin, apod. Musí se dařit."}, {"72": "Zatím jsem věž prošel jen bojem, s pomocí posilovačů na zdraví jednotek, 1x kovář+2xposílení jednotek z akademie. Celkem spokojený. Ale zisk z posledního kola = trága![BR]Poslední truhla až 50 dia! :-("}, {"59": "moribundus >> To je právě ta zvláštnost věže, že je tak zrádná, že získané úlovky neodpovídají úsilí, které se do nich vloží. Někdy přijdou překvapivé odměny zcela na začátku a bez jakýchkoliv ztrát či vkladu, jindy přijde zklamání po poctivě odvedené výpravě v podobě pár usmolených briliantů na konci, protože hlavní strážce už stihl všechny ostatní cennosti rozdat \"hyenám\", popř. byly legendy plané. To je přesně to, co každý týden co týden odvažuje nové dobrodruhy vstupovat, riskovat nástrahy, nechat se mučit a umírat, a minimálně pak hodiny a hodiny poslouchat, jak se nechali nachytat, že ta věž je prokletá."}]