[{"5": "iDavis a co tento postup, Věž jet již ode dnes, ale truhly /bonusové/ otvírat až zítra? [smilie--sprite1]  bude to i takto fungovat, když se to má aktualizovat právě s otevíráním oněch bonusových?!"}, {"24": "@ElfNostradamus iste, ale teleporty sa dajú získať aj z tých truhlí v stretoch a bez vyzdvihnutia jednej sa nedostaneš k stretu ďalšiemu.[BR]Pokiaľ hrá človek 3 mapy tak to závisí od priorít, ale pre mňa, čo hrám mapy 2, je jasné že počkám až na zajtra."}, {"5": "Ano, čekal jsem, že teleport zařadí ,,jen,, do bonusových kouzelných, které leží vždy mimo cestu a dají se otevírat i zpětně, takto si tedy musíme počkat na zítra a zvýšit tím šance zisku kouzla teleportu [smilie--sprite1]  ...na konci Věže bude třeba sáhnout po časovačích a dojít do finále, ten dnešek mi bude chybět....ale ono nakonec jsou v eventu úkoly na střety právě i ve věži, tak se to hodí a nějak sladí [smilie--sprite1]"}, {"3": "vykašlal jsem se na čekání a první level mám hotový [smilie--sprite1] dokud mi fungovaly boosty"}, {"46": "Cekam u 9h brany a prislo mi to lehci nez driv (jen souboje). dokonce uz padlo asi 5 tajemnych truhel (teda ne ze by v nich bylo neco u ceho bych zarval hura). Jedu jen 1. cast a tak to zustane asi nafurt. Manovnik, neco malo cinidel, ulomky, par urychlovacu, dia.[BR]Jinak, pokud mam pri tom uplaceni ve 4. kole jistotu, ze to dam, tak radsi dam tech 25dia, nez pokouset stesti znovu.[BR]Zatim jsem postavil vse, co jsem dostal a vubec by mi nebylo lito to zbourat. (manovniky, blahovicnik, brana).[BR]Z meho pohledu je to stale jen ztrata casu a jednotek/surovin."}, {"59": "Taky čekám u 9h brány, po pravdě ani nevím na co bych měl čekat, ony se odměny v pevných v truhlách u každé další věže mění? Já měl za to, že jsou stejné, ale nepamatuji si to přesně. Protože pokud tam v průbehu něco podstrčí, pak bych to měl dostat, i když jsem už někde kdesi, aby každý nedostával jiné odměny. Kdyby byly náhodné, pak je to jiná. Mě záhadky padly asi dvě, v jedné zase 50% potrál, ten se mi hodí, pak nějaké urychlovače 5h a několik 2h, takže beru, ztráty jen neznatelné."}, {"48": "Právě probíhá aktualizace cz1 - Arendyll, což znamená oznámené přidání kouzla do Věže věčnosti..."}, {"68": "Tak dneska jsem začala věž a počkala až zaktualizují a jak mi padla záhadná truhla tak hned na poprvé zisk teleport...[smilie--sprite2] Mám radost [smilie--sprite8]"}, {"24": "Taktiež som rád, že som s hraním veže počkal až na dnes - 4. truhla = teleport. [smilie--sprite1]"}, {"20": "Teleport v obou městech. iDavis - dík za inspiraci hrát až dnes."}, {"59": "Dnes se mi objevil teleport ve věži, jenže já už mám první patro hotové, takže z toho usuzuji, že každý den dostávají hráči jiné odměny jak jsem se domníval, což mi přijde jako celkem nefér (pokud je to jinak, tak se autorům omlouvám), odměny se zpětně nepřepočítávají, docela rozbitý systém."}, {"36": "Pauleo: Ještě před začátkem věže bylo ve hře upozornění, že dnes bude do odměn ve věži přidán teleport. Všichni to věděli (mohli vědět), takže kdo chtěl, mohl si počkat, kdo nechtěl, mohl hrát hned. Já třeba po teleportu nijak zvlášť netoužím, takže jsem si klidně projel celé 1. patro před aktualizací (a dál nejdu), takže nevidím absolutně žádný problém."}, {"59": "Victorius1722 >> Tak ale nikde nebylo uvedeno, zda se odměny v onen den sjednocují, či bude někdo zvýhodněn. Mě by nenapadlo, že hra může odměny zcela rozdělit."}, {"36": "Mě by zase nenapadlo, že bych jeden den dostal odměnu a druhý den by mi ji vzali a dali jinou. [smilie--sprite8] Co kdybych tu původní už použil?"}, {"59": "Victorius1722 >> Tak mě se to od začátku zdálo moc dobře nerealizovatelné, pokud nemá být někdo znevýhodněn."}, {"36": "A mně se zase zdálo fajn, že si mohu vybrat, jestli budu hrát v neděli se starými odměnami nebo v pondělí s novými. Jak jsem už napsal, upozornění ve hře bylo, já osobně nevidím problém."}, {"59": "Já bral, že to mají nějak vyřešené, když se k takovému kroku odhodlávají, myslím si své, tady to řešit už nebudu."}, {"36": "Měli to vyřešené oním upozorněním ve hře, podle mě naprosto v pořádku."}, {"59": "Podle mě ne, protože tím nedávali najevo své úmysly někoho zvýhodnit."}, {"36": "Podle mě nikoho nezvýhodnili, každý si mohl vybrat, zda bude hrát v neděli nebo v pondělí."}]