[{"59": "Nemohl, protože nebyly zveřejněny přesné úmysly, že se budou dostávat jiné odměny, pouze bylo zveřejněno, že bude nová odměna zahrnuta do věže a za jakých podmínek by se měla dát získat."}, {"36": "Pokud si někdo myslel, že se zpětně budou měnit odměny, tak o tom si zase myslím své já."}, {"5": "Dnes první teleport do inventáře [smilie--sprite1] děkuji"}, {"35": "zajímalo by mě, proč teleport budovy nefunguje na divy"}, {"41": "Nefunguje na divy, ani na rozvinutelné budovy a ani na budovy co se nedají odstránit jako je hlavní sídlo, akademie kouzel a podobne.. [smilie--sprite1]"}, {"35": "takže takový danajsky dar"}, {"42": "Na schovávání dílen a manufaktur pro budoucí eventy, to bude dobré. Vtipné je to, že se to už nevyplatí použít na eventové budovy za účelem rozebrání na úlomky. Protože z věže je tolik úlomků, že toto kouzlo je bezpředmětné, když kouzlo padá právě z věže."}, {"35": "ja se prave tesila, ze schovam divy treba pri prestavbe nebo tak... no zas je tam ta horka pachut. bohužel"}, {"36": "A není při přestavbě jedno, jestli schováš div nebo něco jiného?"}, {"5": "...já schoval např. zbrojnici [smilie--sprite1]"}, {"16": "Možnost schovat div by se spíše hodila jako dočasně trvalé úložiště již neefektivního divu do doby, než z něj zase vývojáři udělají div efektivní. V případě, že jej nechají jako neefektivní, tak jako pernamentní úschova. Tzn. bez nutnosti div zbořit a ztratit tak tisíce investovaných knih. Pak by se spoustě hráčů asi uvolnilo místo, které tyto divy zabírají a zatím je těmto hráčům líto je zbořit."}, {"68": "ElfNostradamus Elfíku, když budeš chtít vrátit zpět zbrojnici, potřebuješ na to zase kouzlo, nebo ne? Ještě jsem to nezkoušela, zatím nehodlám, dokud to nebude potřeba.....[smilie--sprite1]"}, {"35": "ostatní budovy s klidnym srdcem zborim, ale divy ne"}, {"5": "Ahoj aikomi, taky jsem to ještě nezkoušel budu vracet až po Eventu, ale jsem přesvědčen, že nebude třeba již kouzlo, prostě se budova vrátí z inventáře do města jako jakákoliv jiná. Pokud nebude nějaké Inno překvapení [smilie--sprite1]"}, {"3": "je to perfektní, stačí nasbírat pár kouzel mezi eventy, přistavět si ze dvě T1 a dílny a vždycky na event si je přidat, jako předtím ty maličkaté... už je mi jasné, co bylo myšleno tím, že o kouzlo bude zájem... [smilie--sprite8]"}, {"47": "No, to mě taky celkem zklamali, že to nejde na divy, pár mi jich už překáží, ale bořit je nechci, tak třeba to ještě změní, na manufaktury nebo dílny to zatím používat nebudu, musel bych mít k tomu ještě další obytné budovy, na to si počkám až budu na konci vyzkumu"}, {"35": "Abych si jen nestezovala! tak od vcera me vyjednavani ve vezi tak zacalo bavit, ze se mi nekolikrat podarilo na druhy pokus uhodnout, prisla jsem tomu na chut a i pres to, ze me to pumpuje o statisice surovin, tak me to bavi, za chvili budu mit 3. patro komplet"}, {"73": "Lovec Krys napsal/a:\t\t\tAnebo si vytoč kupu studen přání v eventu.[BR][BR]ps: Sice jsem na rozdíl od ostatních teprve dneska projel zbytek prvního patra (nepoužívám ve věži urychlovače), ale zato mám první Měsíční knihovnu.[BR]Teď ještě ty další 3 zbývající budovy na katalyzátory (Blahovičník už mám (2x)).\t\tKlikněte zde pro zvětšení...[BR]@Lovec Krys   Vyměním blahovičník za manovec [smilie--sprite1]"}, {"15": "@Arwene  Takových by se našlo , co by měnili , o jé ! [smilie--sprite8][smilie--sprite8][smilie--sprite8]"}, {"3": "já už mám oba nejméně po třech a stavím kolem dokola setu [smilie--sprite8]"}]