[{"42": "Dnes se poštěstilo a z jediné (už jsem dokončil druhé patro) bonusové truhly, kterou jsem tento týden dostal, mi konečně padl manovec, tedy mám celý set a už jen čekám na prostor, jen nevím kam narvu ty 3 knihovny [smilie--sprite12]; (asi mi bude stačit jedna)[BR][smilie--sprite8]"}, {"3": "taky už mám druhou... asi ji rozemelu, až přijde v eventu úkol..."}, {"20": "Právě jsem dohrála celou věž, většina bojem. Zisk: 1x Nekonečný svitek, 1x Trpaslík, pár urychlovačů, katalyzátorů atd. V závěrečné bedně 50 dia.[BR]Stále mi do setu chybí Knihovna a Džina rovněž nemám. Prostě Věž mě nemá ráda [smilie--sprite2][BR][BR]Ještě dodávám, že jsem získala 2x teleport, málem bych zapomněla, no alespoň něco hodnotného"}, {"35": "Tak to jsme na tom stejně [smilie--sprite1] včetně 50 dia za konec 3.patra [smilie--sprite8]"}, {"3": "50 dia taky na konci [smilie--sprite8] ale zároveň se objevila fialová truhla a z ní padla knihovna. už třetí... radši bych toho džina [smilie--sprite8]"}, {"46": "Teleport se mi v inventari objevil taky. Nevim zac jsem si ho zaslouzil, bojem ve vezi teda fakt ne. Asi tema kecama tady [smilie--sprite1]"}, {"20": "Jestli dají po další aktualizaci jako možnou výhru do věže kouzelné budovy, tak to už bude o něčem jiném. Tato možnost dává věži úplně jiný lv. kvality."}, {"31": "Jo, teď jsem ráda, že jsem včera nekoupila kouzelné budovy, když mi přišla 10% sleva.[BR]Na tohle jsem čekala fakt dlouho.[smilie--sprite1][BR][BR]I have waited for a thousand years[BR]and I will wait for a thousand more (při šanci 5%[smilie--sprite1])"}, {"20": "Právě mi v tajemné truhle 2. patra padla Knihovna. Konečně mám celý set. 1 Katalyzátor denně je moc fajn, trochu živoucího, many a svitků, takže spokojenost. Zabere to dost místa, ale řekla bych, že se set vyplatí.[BR]Ještě mi u žabáka padl 1 teleport, jinak v 1. i v 2. patře pár Katalyzátorů a urychlovačů. Celkově hodnotím jako můj doposud nejúspěšnější zisk ve Věži."}, {"46": "Ja nevim, ale 2. patro je zklamani. V tom 1. jsou tajemne truhly, v tom 2. patre neni nic. To 2. patro ma smysl snad jen ted kvuli eventu. Jinak celkovy zisk za dobu chozeni do veze - neco manovniku, blahovicniku, 3 brany, 1 trpaslik, 2 transporty + drobnosti odpovidajici nejvyssimu procentu. Ve 3. patre jsem nikdy nebyl. Po eventu asi vic nez 1. patro delat nebudu. Nestoji to za to. Ted se chystam okouknout 3. Uvidime, ale ocekavam bidu 2. patra."}, {"3": "tajemné se objevují náhodně. A za těch několik věží to můžu potvrdit. Jednou jsem jich měl nejvíc v prvním kole, jednou ve třetím a dvakrát ve druhém..."}, {"42": "[smilie--sprite8] však se u každého boje v levém horním rožku (myslí, že to levý [smilie--sprite8] nemohu se teď podívat) je modré info okénko, které říká jaká je šance po úspěšném boji na vznik tajemné truhly (většinou to je okolo 10% -30%)"}, {"46": "Ja vim, ale ja jsem mel v poslednich 2 vezich v 1. patre vzdy 4 nebo 5 truhel... Tak jsem byl namlsany. Jestli je jich omezeny pocet na celou vez, rekneme 6, tak pokud jich dostanu v 1. patre 5, tak je to jasne... [smilie--sprite2][BR]A to ze mi to pise u kazde truhly 10% zas tak moc neznamena..."}, {"59": "Ludi >> Jé ty se máš, mě zatím knihovna nepadla ani jednou. Mám bránu, dva svitky, tři manovce, sedm blahovičníků, tři džiny ze záhadných thuhel, ale knihovnička stále nikde."}, {"31": "Stále čekám na bránu, zatím tři knihovny, čtyři svitky, tři manovce a čtyři blahovičníky.[smilie--sprite6]"}, {"20": "@Pauleo  Já zase nemám Džina. Skoro mám pocit, že když jsem minule udělala 3 patra a odměny nic moc, dostala jsem to teď."}, {"46": "@Prealiena  Branu bych vymenil hned, mam 2 a to uz jsem jednu rozcaroval (s...a  mi) [smilie--sprite2]"}, {"73": "@Prealiena dlouho jsme čekala na blahovičník, mám už celý set a ve skladu 4 manovce a 1 blahovičník, džin mi asi není souzen, škoda, že nejvíce padají úlomky a portálové bonusy, časovače a spojovací činidla spíše ojediněle, ale zatím mě věž baví, i když souboje jsou obtížnější, ale je to pestřejší než turnaj,,,"}, {"15": "Už se vám někdy stalo to co mně teď ? Ve věži jsem byla  při diplomacii u druhého tahu -najednou naskočil nápis řeješ si koupit 74 diamantů ?  a to mi zbývaly ještě dva tahy .dál to nešlo a když jsem to vypnula , tak mi to odečtlo nabídnuté zboží , aniž  bych měla možnost   zmáčknout nabídku . Poněkud mně to namíchlo . Tak je to chyba ve hře anebo schválnost , co myslíte ?[BR][smilie--sprite4][smilie--sprite4][smilie--sprite4]"}, {"53": "To se ti stane, když ti dojde zásoba nabízeného zboží. Taky se mi to stalo u kladívek, že už jsem jich neměla dost, tak mi to nabídlo dokoupit za dia.[BR][BR]Odstraněna citace. Embla"}]