[{"3": "jo, kladívka to žere neskutečně... (a všechno ostatní též [smilie--sprite8] )"}, {"62": "no já když věž napoprvé prošel celou, tak jsem přišel o téměř všechny orky (asi ze 100k na nulu...) nemluvě o hromadě mincových i kladivových požehnání. takže teď už jen první patro. minule jsem výjimečně prošel první 2, a zase koukám, že mi T1 suroviny neskutečně spadly. [BR][BR]věž je v pohodě, ale prostě ty náklady jsou obrovské. armáda by teoreticky na 1. patro v úvahu přicházela, ale jsem rád, že jsem se konečně s armádou pohnul tak, že neubývá ale přibývá. [BR][BR]a jinak si poctivě kontroluji skoro před každým střetem, jestli mám všeho dost [smilie--sprite1] kladiva, mince, živé zboží - ostatního je dycky dost (orkové už teď stačí, když jedu jen na 1 patro)."}, {"31": "Co orkové, mě ta věž úspěšně likviduje zásoby živoucího zboží a to si v nové kapitole nemůžu dovolit."}, {"59": "Tak mi napadaly zase další dvě brány, to je strašné, knihovna zase nikde. Aspoň že v poslední kapitole začly dávat místo měsíčníku bismuth."}, {"16": "Člověka nikdy tak nepotěší činidla z věže, jako když jich má kritický nedostatek[smilie--sprite8]"}, {"59": "Činidla potěší vždy, protože těch je furt nedostatek."}, {"31": "Tak dlouho nic a včera najednou v prvním patře dvě tajemné truhly a dvakrát brána.[smilie--sprite9]"}, {"73": "Prali, orků mám dost..... i po průchodu věží"}, {"16": "@Arweene Výkup ve věži + výkup v turnaji + trénování orků stratégů. Začínám mít pocit, že mi ani těch 5 zbrojnic s Kovárnou hrdinů nebude stačit. Počet mých orků už nějakou dobu setrvale klesá (aktuálně už jenom 547 tisíc, měl jsem jich skoro milion). Asi fakt zbourám bludiště (many dost) a místo toho postavím 6. zbrojnici."}, {"45": "...kniznica este ani zo 6 veze neprisla, ale dnes prvy pokus a hned:[BR][IMG]https://i.ibb.co/mhK0bvV/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-10-8-14-16-26-png-3748.png[/IMG]"}, {"73": "@Lovec Krys používám orky naprosto stejně a poměrně rozmařile, mám jen 3 zbrojnice u elementálů a dokonce uvažuju, že jednu zkusím dát do skladu a nahradit vykrmeným medvědem"}, {"74": "Otazka na tych dalej vo vyzkume. Ked uz vo vezi pri vyjednavani pyta aj manu a semena ake ine suroviny este pyta? Orkov, goldy, kladiva, t1,t2,t3? Zaujima ma ze co mi vypadne z vyjednavania. A ake asi mnozstva za jeden tip myslim many a semien?[BR]Dakujem za info"}, {"35": "chce to i t4 a t5... tzn. ze to chce vsechny suroviny, ktere jsou ve hre (mince, kladiva, t1, t2, t3, t4, t5, orci, mana, semena) , krome t6, ta bude ve vyjednavani az v kapitole 15.[BR][BR]semena to chce v prvnim patre po cca 1500, t4 a t5 po necelych 1000, ve druhem patre se to zvysuje cca v prumeru o 300 - 500, treti patro si nepamatuji a ted ho nedelam, ale odhaduji, ze narust bude obdobny, tzn. cca 500 surovin navic (bavime-li se o semenech a t4 a t5)"}, {"72": "Nevím jak ostatní, pár krát jsem zkoušel vyjednávat, a nepřijde mi to rozumné. Hraju turnaje tzn. Stavím podpůrné-dočasné budovy + nakrmím fénixe a nemám problém projít věží bojem."}, {"35": "@moribundus ja vez jedu pouze vyjednavanim a nemuzu si stezovat, vojaci me nebavi a uprimne jim stale nerozumim, i kdyz jsem cetla x navodu... podpurne budovy na vojsko nevedu, ale surovin mam stale v radech statisicu az milionu, navic me vyjednavani zacalo hodne bavit a casto uhodnu na druhy pokus, parkrat se mi povedlo i na první pokus [smilie--sprite1]"}, {"59": "Já to kombinuju, preferuju jednoduchý boj, když není nebo nemám jednotky, přehodnotím vyjednávání. Ale ne všechno se mi vyplatí, někdy jsou krvavé prodělky i u toho vyjednávání."}, {"75": "Taky jsem se na věž těšila, vyzkoušela jsem jí jednou a u toho i zůstanu. Pracně a dlouho budovaná armáda zmizí raz dva a k tomu vlastně někdy i úplně zbytečně díky prvku náhody. Za mě se dá hrát pouze jedno a to buď turnaj nebo věž, obojí dohromady prostě nejde. Škoda, že věž je postavená opět na náhodě ... stejně jako truhly v eventech, truhla v akademii kouzel atd. Ve hře mi trošku chybí něco co by člověka donutilo se zamyslet, nějaká hádanka či labyrint a hráč by tak měl možnost ovlivnit výši odměny svým vlastním umem - ale to je jen taková úvaha [smilie--sprite1]."}, {"68": "Podle mne se dá hrát společně s turnajem...Pak ovšem záleží jestli jedeš celou Věž....Já jedu vždy jen první kolo a vetšinou vykupuji surovinami, ale budu  muset to trošku zvážit a něco vybojovat, vzhledem k nové rase.....Ale to už je mimo téma.[BR]Za mne Věž super, ale nesmí se to přehánět a jet až na konec..Odměny z ní jsou vyhovující. Pokud si hráč uvědomí kolik mu za to stojí tam uhrát, aniž by ho zrujnovalo vojsko.....[smilie--sprite1]"}, {"16": "Já jedu první dvě kola věže společně turnajem (turnaj primárně boj, věž jenom výkup). Nároky nové kapitoly na prošlé zboží mi věž na nějakou dobu pravděpodobně omezí jen na první kolo, anebo ji zcela zastaví. Až dojedu ty nenasytné modré potvory, tak pak zase můžu dávat své dvě patra."}, {"45": "...aj ja som obmedzil vezu len na 2 kola + tretie idem po 4 truhlu a pokus o teleport. No ja som ostal verny len boju. Miniem armadu, ktoru viem doplnit za 2-3 dni (niekedy aj za menej, ked pouzijem bonusove budovy, alebo naposledy, ked som pouzil skracovace a medveda, tak som mal spat vsetko za 2 min. [smilie--sprite1]), zvysne 4 dni doplnam armadu pre turnaj...[BR][BR]Odstraněna citace. Embla"}]