[{"20": "Věž bude teď muset jít stranou, max 1. patro. Ale set už mám celý. Viděla jsem, že někteří hráči ho mají i 3x, ale to opravdu nechci, 1x stačí a je to fajn. Včera jsem na rozloučenou získala i Džina, ani ho zatím nebudu mít kam postavit [smilie--sprite2].[BR]Takže se teď soustředím na novou kapitolu, kde mám minimum místa na výrobu osadníků. Bude hodně zajímavé. Jsem na to zvědavá, jak to dopadne. Většina studen mi vydrží ještě skoro 2 měsíce..."}, {"3": "tak, knihoven mám už asi pět, poletí komínem, a věž užírá suroviny ve velkém, ale je to prostě sranda. Zatím mě to baví a zrovna dneska ráno z náhodné truhličky padl trpasličí zbrojíř. Ale je fakt, že musím přistavět nějaké manufaktury"}, {"15": "Ta to máš prima . U mně knihovna ´=0 , džin=0 , zato blahovičníků a podobně mám , že si můžu založit květinářství . A do třeího patra jsem šla jenom na začátku  a šmytec . Teď jedu jenom první a stačí.  [smilie--sprite8][smilie--sprite8][smilie--sprite8]"}, {"59": "Já jedu většinou první a druhé patro. Někdy nepadne nic, někdy zase docela pěkné odměny. Jen knihovna zatím nepadla ani jedna. Ostatních už mám dost."}, {"24": "Tak malý poznatok z najnovšieho kola veže - som už v 15. kapitole a vyjednávanie po mne chce už aj živoucí zboží T6. Stáva sa to tak ešte náročnejším (už popri semienkach, ktoré táto kapitola s chuťou požiera)."}, {"45": "...je potrebne bojovat [smilie--sprite1]"}, {"68": "Tak tak, chce to i T6, což teď nebude pro mne moc náročné vzhledem k nové rase..... Dneska jsem měla štěstí. Objevila se mi tajemna truhla a získala jsem 6xteleport [smilie--sprite1]"}, {"16": "No já si dávám s věží pauzu, dokud nedokončím Elvenárce, nároky na prošlé zboží a semínka mi ji prostě neumožňují hrát."}, {"45": "...prve kolo by si dal aj bojom, tam su minimalne straty...[BR][BR]Odstraněna citace. Embla"}, {"62": "mně ty ztráty nepřišly úplně minimální... ano, první kolo se bojovat dá, ale když chce člověk nějaké slušné body v turnaji, každý voják se počítá."}, {"16": "@citellus To se nestane - úkolem mých vojáků je čestně umřít v turnaji. Ve věži by zemřeli nečestně."}, {"24": "Vidím to podobne, behom prechádzania kapitolou zrejme zredukujem aktivitu vo veži - namiesto 2 máp budem hrávať len prvú (najmä kvôli šanci na obytnú budovu). Vojsko ide na turnaj, suroviny na výskum, nuž, veža si to asi odskáče.."}, {"3": "btw. všimli jste si, že místo 1x teleport te´dka dávají jako odměnu 2x teleport? [smilie--sprite1] příjemné"}, {"42": "V oznámení máš, že do 4.listopadu se počty vyhraných teleportů zdvojnásobují [smilie--sprite1]."}, {"3": "tak to jsem úplně minul, ale méně příjemné to není [smilie--sprite8]"}, {"20": "Dnes mi po dokončení 1. patra padla Knihovna, což je fajn. Než jsem získala první, tak jsem si musela počkat hodně dlouho. Už jsem vymazala starou a vyměnila za novou [smilie--sprite1]. Nepatřím k lidem, kteří mají i několik setů z Věže. Jeden mi stačí."}, {"70": "Vez jedu pouze prvni patro a tento tyden byla pomerne stedra, konecne mi dala knihovnu a navic i kouzelnou budovu dzina a zbrojire [smilie--sprite6]"}, {"15": "jak to lidi děláte ? U mně pořád nic - nula od nuly pojde - můj případ . Že bych měla štěstí v  lásce ? Protože ve hře  mám příkladnou smůlu , co se týče knihoven a džinů . [smilie--sprite3][smilie--sprite3][smilie--sprite3][smilie--sprite8]"}, {"76": "mě dala tentokrát kouzelnou obytku [smilie--sprite1]"}, {"59": "Green Jane >> Jo, přesně tím to je [smilie--sprite1]. Štěstí přeje nešťastným v lásce."}]