[{"3": "já jsem teď získal konečně druhou bránu a protože je místo, tak jsem ve městě postavil pětiknihovnový vláček [smilie--sprite8]"}, {"77": "na první úrovni jsem dostala 100 dia a kouzelnou obytku [smilie--sprite1]"}, {"78": "Dneska jsem získala kouzelnou dílnu. Jako děkuji, ale příště bych prosila raději obytnou. [smilie--sprite8]"}, {"3": "díky za očité svědectví. Dílnu bych chtěl hned! Místo toho ale šestá knihovna... prodloužím vláček [smilie--sprite8] ale potřeboval bych ještě alespoň jednu bránu"}, {"45": "...ja na svoju prvu knihovnu stale cakam [smilie--sprite1], no padla mi magicka opytna a hlavne DIA padaju. No ale ak by sa knihovna podarila, tak by to bol iba dalsi set v inventari, takze ma to nijak netrapi. Kedysi som planoval, ze ju postavim, no prehodnotil som plany a zatial bude cakat...[BR][BR]Odstraněna citace. Embla"}, {"28": "Tak mně ještě nepadla ani knihovna, ani kouzelná obytka/dílna, ani džin [smilie--sprite8] Snažím se hrát každý týden aspoň 1 patro, pokud to jde, někdy 1,5 (od spuštění jsem vynechala max 1 nebo 2x), ale Tajemné truhly mě nemají rády a téměř nepadají. Teď se budu snažit o 2 patra, pokud nebude nutné vyjednávat (chybí živoucí kvůli Elvenarům), potřebuji teleporty, abych se s novou rasou vešla d města [smilie--sprite11]"}, {"78": "Tak já kouzelnou získala až na konci 2 patra. Ale nechtěla sem jí, jedu věž jen pro ty teleporty. Právě proto, abych mohla některé budovy jen přesunout do ukrytu a když jich teď nabízejí dvojnásobek, tak proč toho nevyužít. [smilie--sprite2]"}, {"73": "@Green Jane ty lepší odměny padají ve 3. patře"}, {"59": "Obytnou dílnu? Tu bych bral taky, dva v jednom [smilie--sprite1]. Hlavně mi taky nějakou kouzelku nechte, třeba na příště."}, {"79": "Mne v prvním patře padly z tajemných truhel:5h zesilovač,50%portal bonus,3x 1h speed+boss kouzelní obytka [smilie--sprite8]. .V pulce 1patra se zjevili 2tajemny truhly,před bosem dalsi truhla[smilie--sprite8] dnes to bylo bohatý na tajemný truhlicky [smilie--sprite8]  cca 14 s5 nepadla v prvním patře ani jedna"}, {"77": "@CrazyWolf Cz takový nebo velmi podobný - jsem si nezapisovala -  mód jsem také měla v jednom městě [smilie--sprite11][smilie--sprite1] ..doufám že se mi objeví i v těch dalších [smilie--sprite8] ale brala bych spíš kouzelnou dílnu, i když z obytky z prvního patra mám taky radost [smilie--sprite1] dál Věž poslední dobou nehraji, event byl brutální na turnaje a tenhle svitkový snad než býval ještě víc, pevně věřím že se to zlepší, více krmení pro zvířátka a bylo by i na další ve Věži patra..."}, {"3": "tak tentokrát mi věž požrala strašně dia a moc nevrátila. Nicméně alespoň za posledního bosse padl zbrojíř [smilie--sprite1]"}, {"59": "Tentokrát jsem to fakt nevychytal, turnaj požral jednotky, vylepšěení města surky, a věž se mi zavřela před nosem, získáno pár urychlovačů, ale jinak nic moc."}, {"48": "@Emhyr var Emreis II : tak to bych osobně za dobrou výměnu nebrala, protože už mám čtyři. Naopak jiné části setu ani kus..."}, {"20": "@Arweene - nejlepší odměny padají v 1 a 2. patře. Třetí patro mi dalo něco dobrého jen málo kdy. I Džin mi padl v tajemné truhle 1. patra. Samozřejmě to je hodně věc štěstí a každý to máme trochu jinak. Poslední dobou jsem 3. patro hrála dost často a nic moc."}, {"73": "@Ludi  asi máš kliku, já pro něco lepšího musím do třetího"}, {"59": "Tak o patře to není, truhličky padají náhodně, pouze na vyšších úrovních je možná o něco větší pravděpodobnost. Třetí patro hlavně do půlky celkem bídné odměny v truhlách mi přijde, a už jsou přitom dost velké ztráty na všechno."}, {"20": "Je to hodně o štěstí. Já toho moc nevyhrávám, ale když něco lepšího, tak spíš v tajemných truhlách 1. a 2. patra. Kdykoli jdu do třetího, tak to nestojí za nic. A poslední dobou jsem ho hrála celkem často. Teď už ne, protože v Elvenarech to je o něco složitější, hlavně s živoucím zbožím, takže dávám trochu pauzu."}, {"71": "ElfNostradamus napsal/a:\t\t\tAhoj Sviku, můj názor se během měsíce co věž běží velmi a to že velmi zpozitivnil!! [smilie--sprite1] ...a nevím zda-li se postupně trochu nezměnili parametry nebo nás duchové tolika ,,nesmaží,, při hádání surovin, ale projíždím ji nyní pravidelně celou...bojuji opravdu pouze se 100% jistotou výhry a minimálních ztrát a při nakrmení ptactva v rámci turnaje. Zbytek se snažím vyjednat, nespěchám jedu dle harmonogramu věže, takže ztráty urychlovačů minimální, doplnkové vyjednávání ano dokupuji za diamanty, ale ty se obvykle v nějaké odměně zpravidla vrátí zpět...sumasumárum surovin mám dost a vyváženě je používám mezi turnaj a věž. Nakonec tedy zisky z věže převažují nad případnými ztrátami. Je nutné vidět, že tu věž již bude napořád nebo aspon na nějaký delší čas určitě a pokud to půjde a i kdyby zisk z věžě byla pouze jedna budova za týden, tak za rok je to 53 budov!! a z toho se dá již poskládat velmi zajímavý set, nehledě na další dílčí odměny úlomky, činidla, urychlovače,% bonus portály, požehnání. To vše vyváží mé ztráty surovin ve věži, sklady netrpí, jak píši jedu zatím vyváženě mezi turnajem a věží a daří se mi to - ano především díky ,,kvalitě,, mého města, připouštím že ne každý a v každé kapitole si může věž takto vyváženě projíždět celou,ale alespon část z ní ano.....přeji všem at´se jim to brzy podaří optimalizovat a přeji i zisky z truhel, protože budovy i další kvalitní odměny padají už i v prvním patře Věže věčnosti [smilie--sprite1] hezkou zábavu\t\tKlikněte zde pro zvětšení...[BR]Ahoj, musím úplně obrátit - na věž už nedám dopustit, je to super doplněk hry! Přesně jak jsi napsal, nespěchat, vyhrát si s tím, je to obrovský přínos.[BR]Pohodový večer [smilie--sprite1][BR][BR]Příspěvky sloučeny. Embla"}, {"3": "no mě dneska padla třetí brána, takže jsem připojil 6. knihovnu do vláčku. Ale potřeboval bych te´d svitek"}]