[{"3": "jestli to není účel, trošku ty syslí sklady provětrat [smilie--sprite8] nicméně věž očekávám s opatrnou zvědavostí. Betu nevedu, tak uvidíme."}, {"38": "Tak jsem právě dokončil 3. patra Věže. Výsledek i celkový dojem je špatný, , přestože jsem získal 4/5 setových budov :-( [BR]Celkové ztráty:[BR][BR][BR]Mince: 21.milionů[BR]Kladivka: 8.milionů[BR]Mana: 30.tis[BR]Semínka: 15.tis[BR]Orkové: 18.tis[BR]T1: 420.tis[BR]T2: 130.tis[BR]T3:   80.tis[BR]T4-6: 80.tis[BR][BR]Lehkooděnci:      60.oddílů[BR]Lučištníci:         120.oddílů[BR]Mágové:           130.oddílů[BR]Těžkooděnci:     90.oddílů [BR]Obrnění Střelci:  30.oddílů[BR][BR]První patro se dá hrát dobře armádou, 2.a 3.patro už převažuje vykupování. A přijde mi to jako rozumnější volba pro průchod Věží, než souboje. Trpí především Mince, kladívka a živoucí zboží.[BR]Fénixe jsem omylem zapnul na 2.pokus až ve 3.patře , takže bych viděl úsporu v oddílech armády tak 20% z výše uvedeného...ale i tak právě ty souboje budou to, co tuto hru pohřbí velice rychle, především pro Ty, co hrají turnaje, které jsou prostě lepší co se týká odměn.[BR][BR]Doufám, že programátoři rapidně sníží nároky na velikost oddílu, kdy v 2.patře je potřeba na jeden oddíl 14.115 vojáků, přitom 1.oddíl má na konci hry po vyzkoumání všech velikostí oddílů 3.984 vojáků.  Takže při plném osazení 5.armád a následné prohře neztratíme cca 20.000 vojáků, ale 70.575 vojáků.. Letí to rychle dolů..."}, {"39": "Nic proti novinkám, ale tahle věž je to nejhorší, co se tu mohlo objevit. 3 tahy na úplatky duchům? A pak za diamanty? A ještě při neúspěchu o ty suroviny přijdeš? Jako vážně? Děkuji, ale radši to už zkoušet nebudu. A ještě pár takových novinek a budu uvažovat o konci zde. I když mě ta hra baví."}, {"16": "@BiggJOEcz To už je po snížení [smilie--sprite8] Na začátku to bylo ještě horší. Ale souhlasím, že by to mohli snížit ještě.[BR][BR]@Daggoth32 Jo, loterie s 5/6/8 surovinami a 3 pokusy je luxusní (proto (a taky kvůli podobným odměnám) jsem se rozhodl čistit pouze první patro, kde to není tak hrozné)."}, {"39": "@Lovec Krys  kdybych nebyl zaseknutý v 1. patře, tak bych tu obtížnost i pochopil, ale takhle? Bohužel to se fakt nedá. A to se divím, že mi to tam nenabízelo i manu, kterou zatím neprodukuji, protože jsem čerstvě v lesních elfech."}, {"16": "@Daggoth32 Jestli ti to nabízelo vyjednávání za manu v lesních elfech - může se jednat o chybu - suroviny by měly být posunuty o 1 kapitolu - jen nevím, zda se to týká jenom prošlého zboží nebo i many/orků apod.[BR][BR]@BiggJOEcz Taky to může být stroj na likvidaci zesilovačů, přeci jen bez nich se to včas celé projet snad ani nedá (možná pokud člověk nepracuje ani nespí tak ano)."}, {"39": "@Lovec Krys  Píši, že se divím, že mi to ještě \"NEnabízelo\" úplatek za manu. A ten systém 3 kol boje bez šance doplnit armádu je fakt skvěle zvládnutý, když tam je nespočetná přesila. Musím fakt \"zatleskat\"."}, {"3": "tak, měla by to být zkouška taktiky. Z toho pohledu je škoda, že neúspěch (vlastně i úspěch) je tak bolestivý"}, {"39": "@Emhyr var Emreis II Moc taktiky tam použít nejde, když ta samá armáda, co je v 1.kole se ti pak objeví ve 3. přičemž ve 2. kole přijdeš o většinu taktické výhody a tím pádem ve 3. kole už má výhodu nepřítel jak v počtu jednotek, tak v bonusu jednotlivých jednotek.[BR][BR]A uplácet 5 duchů přes 6 surovin ve 3 tazích? To se fakt nedá."}, {"16": "@Daggoth32 Aha, omlouvám se. Pak je to tak i pro manu apod. - nároky na suroviny jsou posunuté o kapitolu, tzn. manu to po tobě na výkup bude chtít v čarodějích.[BR][BR]Osobně ve věži nebojuji. Po prvních asi 2 střetech na prvním patře mi na betě došla armáda a od té doby jsem tam nebojoval.[BR]Ani tady se nechystám bojovat - jen vykupovat - armádu mám celou na turnaje."}, {"39": "@Lovec Krys  Bojovat se ve věži dá jen proti 2 vlnám, ta třetí vlna už je devastující, pokud nemáš bonusy ze speciálních budov pro střelce a vylepšené bojové divy světa na min. 20. úrovni."}, {"20": "Na CZ2 město ve 14. kapitole, udělala jsem celé 1. patro, abych si to vyzkoušela. Pár urychlovačů, co jsem získala, padlo na doplnění vojska, pak jsem do toho dala nějaké suroviny, ale to hádání je celkově otravné. Ještě padlo pár drobností, ale naprosto neadekvátní odměny vzhledem ke ztrátám.[BR]Na CZ1 - město v 5. kapitole - zkušenost naprosto stejná.[BR]Možná pro někoho, kdo nehraje turnaje, to bude alternativa, ale hráče, co hrají turnaj na 10 beden, asi Věž nenadchne.[BR][BR]Škoda, Věž je krásná, muselo to dát spoustu práce, ale nakonec z toho vylezla taková podivnost [smilie--sprite3]"}, {"40": "Tolik humbuku kolem ničeho. Celá věž je jedno velké zklamání. Dnes jsem ji projel poprvé a pokud se nic nezmění, tak naposled."}, {"41": "Taky jsem zklamaná, pekné je i to, že u toho vyjednávaní, když se tam u nekterého ducha objeví napsané, že nikdo nepotrebuje napríklad mince, stejne mi ty mince stáhnou ze skladu.. Vetšinou ten první pokus je čistý typ,takže to tam nahážu náhodne,tak proč, když žádny duch nepotrebuje nejakou surovinu, mince,nebo kladivka,tak se mi to stejne odečte ze zásob.. Víte co myslím,že? [smilie--sprite8] To je taky na hlavu celkem [smilie--sprite8]"}, {"3": "no, je to žrout. Ale krmit to mincema nebo manou mi v těch začátcích problém nedělá. To spíš kladívek mi je líto, o ostatním ani nemluvím, ale to už se dá minimalizovat. Ale hned z první tajemné truhly padl kus setu, tak mě nalákali [smilie--sprite8]"}, {"42": "Evidentně to je Endgame/ high end záležitost, pro Ty co mají přebytky, je to nová výzva. [BR][BR]Také si myslím (zaměřeno pro ty co používají primárně bojové jednoty), že když napadá dost činidel/ úlomků kouzel/ časově limitovaných boostů na jednotky, tak půjde věž i turnaj točit celkem v pohodě, ale zatím je to na úrovni teorie [smilie--sprite2].[BR][BR]Já to také zatím  vidím jen na první stupeň a uvidím jaká bude periodicita, na začátku jmenovaných komodit. Protože vytvořením dalších boostů jednotek z řemeslné výroby se odlehčí boje v turnaji, tím pádem se budu moct pustit do vyšších pater. Takže nechť se časem ukáže jak to bude hratelné [smilie--sprite1]"}, {"43": "První mapa: všechno vybojováno, ztráty cca 30 oddílů šermířek, 25 střelců, jednotky ostatních, aktivován fénix, zisk hlavně činidla a zrychlovadla, za mě první mapa docela adekvátní, ale výš už nepolezu, nebyl bych schopen jet turnaje"}, {"44": "mam pocit ze jako asi polovina dalsich lidi jednou vez zkusim a uz nikdy nezapnu [smilie--sprite1] jednotky nedam a zivouci zbozi to žere rychleji nez manzelka muj bankovni ucet"}, {"10": "první patro v boji ještě šlo, ve druhém jsem se totálně vymazal z jednotek a nějak jsem nepochopil, co který duch chce a jak ho uspokojit, ztráty s surovinách maximální. Je někde návod, co který přibližně chce? Tedy alespoň okruh, že ten dotyčný chce z maximálně dvou věcí? Je to moc ztrát za takřka nulový výsledek."}, {"24": "Čakám na 9-hodinovej bráne 1. mapy. Zesilovače na ich skrátenie použiť odmietam, už bez toho mám pocit, že väčšinu odmien, ktorú z veže dostávam, do nej spätne zase vkladám, pre ďalšie strety (a obávam sa že v núdzových prípadoch pokročilejších máp dôjde aj na nejaký ten diamant).[BR]Tento týždeň to skúsim pokiaľ to pôjde a od budúceho nasadím len čisto rekreačné tempo (1. mapa a koniec). Na šance na set to bude stačiť. Inak ma veža zatiaľ nepresvedčila, že by náklady, ktoré do nej vložím, boli adekvátne ocenené (veľmi mi v nej chýba akákoľvek podoba súperenia medzi hráčmi, už aspoň niečo tak základné ako body do rebríčka).[BR]Väčšinu stretov vyjednávam, s výnimkou niektorých relatívne ľahko riešiteľných kvetinami."}]