[{"59": "Jak to děláš? Mě padá všechno, jen ne knihovny."}, {"73": "Většinou dojedu až nahoru, a mám 2 knihovny komplet, spousty manovců ve skladišti a od včera dokonce džina, ale musím pro to až do 3. patra, a často až do poslední truhly......."}, {"59": "Arweene >> Dle tvé odvahy už chápu co je to ta výzva :-D."}, {"3": "Pauleo napsal/a:\t\t\tJak to děláš? Mě padá všechno, jen ne knihovny.\t\tKlikněte zde pro zvětšení...nevím, radši bych jiné odměny... [smilie--sprite8]"}, {"24": "Tak poprvýkrát mi z veže padol džin (na prvej mape z fialovej truhly)."}, {"16": "@iDavis Já už jednoho mám (jestli je na 100 dní, tak skoro v půlce), teď kvůli rase věž nedělám. Tak na šanci na dalšího si musím počkat."}, {"5": "...tři gini na skladu a čekají na vypakování osadnictva z města [smilie--sprite1][BR]++ připomínám double teleport platí pouze do zítra"}, {"45": "tak mne padla uz druha magicka budova...[BR][BR][IMG]https://i.ibb.co/drx2C7R/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-11-3-17-49-29-png-3818.png[/IMG]"}, {"24": "@Lovec Krys veža mi tiež robí popri novej kapitole problémy (vyjednávanie so živoucím zbožím a už začínajú klesať aj orkovia), ale prvú mapu som si dal ako také povinné minimum, už len kvôli tej kouzelnej obytke."}, {"45": "iDavis, neskusal si bojovat? prva mapa je velmi jednoducha a straty su rychlo nahraditelne (menej ako den). Osobne len bojujem, minimum su 2 mapy a z tretej prve 4 suboje (po teleport), ale ked sa nudim dam celu (zatial som len tri veze nedal cele)..."}, {"59": "Mě teď vůbec nepadají záhadné truhly. Minulou věž padla jen jediná modrá (a to jsem delal i začátek třetího patra), a teď zatím nic. Ale ti džinové co mám mi zatím stačí, stejně bych neměl kam zasadit. Kouzelky by se hodily, ale ty se mi zatím vyhýbají."}, {"24": "@citellus bojujem väčšinou len v stretoch, ktoré vyžadujú mágov (tie sú obvykle takmer bezstratové). Inak prevažne vyjednávam, keďže zostava môjho vojska v táboroch je obvykle taká, že väčšina jednotiek má pod 5 oddielov (momentálne niektoré surovo na nule), až na výnimku tých, ktoré idú na najbližší turnaj (tie sa pohybujú v desiatkach až stovkách). Čiže šanca, že nepriateľský setup je spraviteľný jednotkami z najbližšieho turnaja, je pomerne malá."}, {"3": "věž je ke mě skoupá. Kouzelné budovy žádné, orkové taky začínají chybět, truhel se mi taky zdá poslední dobou míň a djinnové vůbec nedávají diamanty..."}, {"45": "...ja lahkoodencov nepouzivam na nic a tazkoodencov len v dvoch turnajoch a aj to na 50% bojov a vo vezi idem len z jednotkami utociacimi z dialky, tak ako aj skoro vo vsetkych turnajoch. Dolezite jednotky sa snazim udrziavat nad 200 oddielov (1 oddiel 3984 jednotiek), ale kusistov a knazov sa snazim drzat nad 400 oddielov (momentalne +500). No zacinam pomalicky cvivit aj jednotky z tabora zoldierov (nocna vyroba). Lesny strazca a zabi princ budu patrit k mojim oblubencom [smilie--sprite1]..."}, {"47": "Se musím pochlubit [smilie--sprite1] tenhle týden jsem šel jenom první patro, ale vypadlo mi 6 tajemných truhel, to byly žně [smilie--sprite1] ale džín nebo knihovna pořád nic"}, {"15": "To se tak někdo má . Já - i kdybych se přeškubla - pořád nic. Portálových bonusů a útržků mám na rozdávání, ale jinak... Asi mně  \"tam nahoře\" někdo nemá rád . [smilie--sprite5][smilie--sprite8][smilie--sprite8]"}, {"3": "mě teď v prvním kole padly 2 malé truhličky a jedna fialová. Z fialové teleporty, z malé katalyzátory, blahovičník (nebo manovec?). Ale klíčové je druhé kolo, já tu kouzelnou dílnu chci [smilie--sprite8]"}, {"46": "Stale stejne: hafo manovniku a blahovicniku, neco bran, svitku, jedna obchodni stanice (generuje 10% portalu [smilie--sprite1]), a jeden trpaslik - toho mam furt, vzdycky ho zapomenu postavit a ted vzhledem k te chybe ... Chybi knihovna do sady a dzin  - toho jsem snad ani nikde nevidel...[BR]Vyplati se tak 1. patro, pak uz to vychazi prilis draho a odmeny obvykle jen nejvyssi procento - cili vetsina celkem k nicemu.[BR]A cele 1. patro se da obcas vybojovat i na automat.[BR][BR]Ale vez je presne ten vyherni automat ke kteremu sedas i kdyz vis, ze zase prohrajes (teda automaty jsem nikdy nehral)."}, {"36": "Já dnes vyhrál měsíční knihovnu, což mi udělalo radost, ze setu mi chybí už jen nekonečný svitek, snad se ho dočkám, ale hraju jen 1. patro, tak to může trvat."}, {"42": "Já dnes dostal konečně kouzelnou obytku. Knihoven mám 5, ale měsíční brána mi padla jen jedna. Džin mi nepadl, ochodníci 1x, ale trpasličí zbrojíři cca 5x. Přísun činidel také oceňuji. Ještě by to chtělo tu kouzelnou dílnu [smilie--sprite8]"}]