[{"26": "Já mám od začátku věže 1x knihovnu, 1x džina, 1x kouzelnou obytku, jinak svitků, manovců, blahovičníků, bran a trpaslíků mám plný sklad.Vždy jedu první patro, občas druhé a celou věž jsem jel 2x (odsud mám toho džina). První patro vždy bojem na manuál, ve druhém už jen to, co zvládnou kněží, jinak vyjednávání.Jinak padají hlavně úlomky, činidla a mám přes 20teleportů.."}, {"31": "Mám už tři kouzelné obytky a minulý týden mi konečně padla i dílna. Takže si na chvíli dám pauzu a pojedu jenom první patra, to druhé už mi dost ruinuje jednotky a orky.[BR]Džinové stále nic a už pět zbrojířů, kdy je budu stavět, nevím, teď s tou chybou asi dlouho ne."}, {"59": "Copak džinové mi padli už čtyři, ale dnes mi padla moje první měsíčka,  zbytku mám už haldy, že mi to tvoří ve městě ostrov. Kouzelky zatím žádné. Zbrojíře bych nezatracoval, až se chyba opraví, tak si na své přijdou."}, {"40": "Tak se mi zdá, že odměny ve věži se změnily. Kouzelná budova už není, portálový bonus snížen z 50% na 25% a bůhví co ještě. Zaměřím se na to příští týden, třeba se jen mýlím."}, {"59": "Mě se to nezdá, kouzelné budovy mám, jen jsem je nedostal, portál 50% také je, v prvním patře jsem si jeden vylosoval."}, {"42": "Já v prvním patře stále vidím kouzelnou obytku."}, {"59": "Obytka je, dílna ve druhém taky, jen bych mohl mít více štěstí na to je získat [smilie--sprite1]."}, {"73": "Obytku jsem viděla jen jednou, a to ve 3. patře, na úplném konci (a padla), kouzelnou dílnu vůbec. Nešlo by snížit počet fasovaných úlomků? Mohla bych si s nimi zařídit velkoobchod [smilie--sprite1], jen netuším, kdo by je ode mě kupoval.."}, {"59": "Dnes mi nadělila ropuší královna ve druhém patře dílnu kouzelku, jakou já mám radost."}, {"64": "Mně zatím z věže vypadla jedna brána, jeden blahoš a jeden manoš, jinak celkem nic zajímavého, co bych nemohl získat i jinde (urychlovače, portálové bonusy, déšť mincí i kladívek), teda kromě teleportů, které se budou při přestavbách města určitě hodit."}, {"16": "@Saux A vidíš, takové využití mě nenapadlo. Ale já si obvykle nechávám nějaké místo navíc (dříve na eventy, dnes asi hlavně na osadníky)."}, {"20": "Díky věži mám celkem dost teleportů, takže na DS přeruším výrobu osadníků, vše teleportuji a zadám výrobu pro DS. Celý výzkum stejně trvá věčnost, takže těch pár dní navíc mě nezabije a pomůžu tím společenství. Až budou na mapě všechny 3 cesty hotové (což bývá celkem brzy, tak zase výrobu postavím. Nejedeme DS na pořadí, takže v pohodě."}, {"16": "@Ludi DS mi nestojí za to, abych přerušoval výrobu osadníků. Minimum zvládneme i bez toho.[BR]Navíc stejně tu výrobu dokončím ještě před DS, pak už budu moci jet jen přes požehnání."}, {"20": "@Lovec Krys  Není to o tom, že bychom DS bez mojí teleportace výroby osadníků nezvládli, ale takhle to půjde lépe a radostněji a to podstatné bude dřív hotovo [smilie--sprite1]. Než dodělám ty tři výzkumy a pojedu jen na portálové bonusy, mi stejně bude ještě dlouho trvat, tak těch pár dní přerušení mě nezabije."}, {"16": "@Ludi Tak já budu mít dost osadnických surovin na ty zbývající 2 ze 3 výzkumů pozítří (jeden už mám hotov).[BR]Otázka samozřejmě zní, zda osadnické budovy lze teleportovat."}, {"20": "Určitě ano, jelikož když si klikneš na kouzlo teleport, tak se objeví nad osadnickými budovami jeho ikonka."}, {"42": "V elvenarech nelze schovat portál, ale výrobní manufaktury ano."}, {"20": "Už jsem si to ověřila, dík za info, dřív jsem si toho nevšimla."}, {"28": "Na to je jednoduché pravidlo - cokoliv, čeho lze postavit jen omezený počet, nelze teleportovat [smilie--sprite1] + rozvinutelné budovy"}, {"20": "+ dočasné budovy. [BR]Ale opravdu stačí kliknout na kouzlo teleport a ukáže se, na které budovy lze použít. Prvně jsem si nevšimla, že nad portálem ikonka není, protože za ním mám dílnu a vypadalo to, že ikonka dílny je nad portálem. Když na to Fjorgyn upozornil, podívala jsem se ještě jednou a ikonka nad portálem opravdu není."}]