[{"28": "Pravda, na ty jsem zapomněla [smilie--sprite1] Ale šlo mi hlavně o ty budovy s omezeným počtem - Portál lze mít jen jeden od jednoho druhu, proto nejde teleportovat. Většina ostatních osadnických budov schovat půjde, ale například u Konstruktů má člověk smůlu právě kvůli omezenému počtu."}, {"64": "Tak jsem ukecal žabákovy poskoky a z toho slizkého obojživelníka vypadlo 100 dia. Ty ať si strčí někam, protože ty se mi vyrobí ve studnách, a když bude nejhůř, tak si je můžu koupit. Budovy nula, džíny nula. Zato urychlovače se mi už pomalu nevejdou do batohu [smilie--sprite1]"}, {"3": "mě tahle věž obšťastnila džinem z truhly a zbrojířem z posledního bosse. Docela fajn [smilie--sprite1] [BR][BR]větší sranda byla ale minule, kdy jsem během druhého patra dostal hned po sobě 4x nekonečný svitek [smilie--sprite8] (z truhel i malých bosů, nebo z čeho to padá - zkrátka 4 větší odměny po sobě)"}, {"59": "Emhyr var Emreis II >> Pravděpodobnostně zajímavé, ale něchtěl bych to, každopádně džin se zbrojířem, no nevem to, to je velmi hezká odměna."}, {"3": "tak, já mám ve městě šestiknihovnový vláček a kolem toho ty malé blbůstky. Ale pravda, teď už nepřistavuju a když padnou ty mršky, tak měním minulokapitolové za novější"}, {"59": "No já už asi ty budovy budu muset bourat, protože ty blbůstky zabírají moc místa, a to např. knihovna mi za celou tu dobu padla jen jedna. Jinak co jsem nepochopil, proč když získám jako odměnu nějakou budovu ze setu, tak se mi v náhledu po získání co umí zobrazí jen bonusy asi z první kapitoly, takže mi to vůbec nic neřekne, že např. brána dává pár žalostných kladiv, když ve skutečnosti mi bude dávat daleko víc bismuthu."}, {"73": "@Saux, vyměním jednu komplet knihovnu za ranec urychlovačů [smilie--sprite1][BR]@Pauleo  na bismuth je brána dobrá, pokud nejsi v Elvenarech [smilie--sprite1]"}, {"59": "Arweene >> Však brány už budu brzo bourat, abych uvolnil místo, jen mi nesedí ten popis."}, {"73": "@Pauleo  v základním provedení popisek sedí, u mě produkuje měsíční kámen [smilie--sprite1]"}, {"59": "Arweene >> A když se ti vylosuje odměna z bedny, tak ti to ukazuje měsíční kámen a nebo že produkuje jen pár kladiv? U mě to druhé. Teprve když si to najdu v garáži a nebo to postavím se dozvím co mi skutečně dá."}, {"73": "@Pauleo  ve shromaždišti mi to ukazuje produkci, tuším, že to závisí na levlu, kdy budovu získáš, mám celkem 3 brány - 2 elementálové, 1 konstruktivní, elementálová dává měsíční kámen (T4), konstruktivní bismuth (T6), dovozuji, aniž bych někde četla, že dává nejvyšší levl živoucího tvého bonusu +1, mám bonus na ocel - tedy pryskyřici  - posun o 1 je měsíční kámen, analogicky elixír - houby - bismuth."}, {"59": "Arweene >> Ale tam to právě ukazuje správně, já řešil to proč mi to vyskočí přímo ve věži s údaji někde snad z první kapitoly, a teprve pak si zalovím do (jak ty správně nazýváš) shromaždiště, a tam se teprve dozvím co aktuálně dostanu."}, {"2": "Ahoj, mám otázku na vojenské řešení předkládaných sestav.[BR]Už po několikáté jsem na konci první mapy vyfasoval směs pěšáků, mágů a obrněných střelců.[BR]Tři vlny[BR]v prvním -Brutální prastarý ork, Špinavý ork deserter, Uschlá trnová kouzlenice, Neohebný kamenochod a Šílený delostřelec[BR][BR]druhém - Uschlá trnová kouzelnice, Temný opat, Odporná zlodějka, Neohebný kamenochod a Brutální prastarý ork[BR][BR]třetím - Šílený dělostřelec, Rozzuřený pekelný ohař, Uschlá trnová kouzelnice, Rozzuřený pekelný ohař a Temný opat[BR][BR]Obrněný pěšák není dost rychlí, když jim přidám střelce, obrnění strelci ho zlikvidují v prvním střetu, pěšáci to taky nevydrží.[BR]Můžete mi někdo poradit?"}, {"31": "Šla bych s většinou kouzelnic, těžkooděnce a obr. střelce odělají, mágové jsou proti stejnému typu nastejno, záležet bude na kolíkáté je máš hvězdě, jaké máš posílení divy či jiné posilující budovy. Problém bude ta zlodějka a pekelný ohař. Asi by to chtělo jednoho obr. střelce, ale toho zlikvidují mágové, nebo dva kerbery.[BR]V každém případě to zkusit ručně, kouzelnice/víly smrti/tvoje nejsilnější magické jednotky budou chránit kerbery a psi budou chránit tvoje magické jednotky.[BR][BR]Případně to zkusit s nakrmeným ohnivákem all star mágové a ručně likvidovat přednostně obr. střelce a ve druhém patře zlodějku, ve třetím ohaře."}, {"38": "No... jsou situace, jako asi bude i tato, že je lepší zkusit ten výkup než to zkoušet třeba 3x neúspěšně a přijít přitom o cca 52.oddílů jednotek (což je v mém případě cca 3,5M kladívek + 49h plné výroby armády)"}, {"5": "Pokud nepůjde kombinace psi a mágové /nebo full mágové/...což se mi také líbí...tak zkus ještě toto: na 3x lovec 3hvězdy /nej aktivita/ + 2x žába 3hvězdy/lepší aktivita než moždíř/.... Určitě manuál... Lovec s nej aktivitou eliminuje 1.kolo kouzelnici a dle terénu, tak aby nebyl na dostřel obr.střelcům  /žába - doplnuje dle potřeby a pohybu nepřátel/. 2.kolo lovec eliminuje kouzelnici, opata a snižuje zlodějku, žába doplnuje opětovně zbytek. 3.kolo Lovec na kouzelnici a opata, případně snížení i ohaře, žába doplnuje zbytek...je třeba vyzkoušet, reál je jiný i terén... sám tam mám koukám jiné nepřátele...+samo určitě nakrmen fénix. GL"}, {"45": "lovec a zaby, najedeny fenix a nie je problem ziadna kombinacia [smilie--sprite1][BR]odporucam ist manualne..."}, {"31": "Netušila jsem, že by lovec a žába byli efektivní proti obr. střelcům a těžkooděncům. Ve statistikách mají specializaci na něco jiného. Ale až je dostanu na třetí hvězdu, tak vyzkouším. Díky za tip."}, {"45": "...celu vezu som presiel iba z tymito dvoma jednotkami (2 stretnutia som mal cisto magov). Ale je pravda, ze zalezi aj na divoch a fenixovi. Ja mam hroty full a [BR]chram ropuch na 16.lv. Lovec si vychutna strelcov, tazkoodencov, magov, ale da dost velku dmg aj lahkoodencom (vdaka pohybu 4 poli a dostrelu 4 polia sa vie pekne schovat za prekazky a davat dmg bez strat, alebo s min. stratami) a zaby daju dole obr. strelcov, kedze maju najvyssiu iniciativu, tak idu prve. Velakrat som mal zlozenie 1 lovec a 4 zaby. Poslednu vezu som mal stratu 90000 lovcov (za 3h vyrobim 12714) a 10000 ziab (za 3h vyrobim 2337)..."}, {"2": "Díky za nápady.[BR]Nakonec jsem to vykoupil, nemám jehly na max, ani ropuchy se třemi hvězdami, ale všechno bude."}]