[{"20": "Kapitola Elvenarů mě přinutila hrát Věž kompletně bojem, protože živoucí i Orkové mi dávají ve výzkumu a vylepšování zabrat. Priority se prostě obrátily: běžných surek mám mraky, kvalita bojovníků z Tábora jde nahoru, takže na čas je to jasná volba. Přeci jen bojovníci z Tábora, pokud už jsou rozvinutí, nepadají jak zralé švestky  [smilie--sprite2]"}, {"73": "Mě naopak na počátku konstruktů padají všechny jednotky jak lemry, a odměny typu úlomky a po 198. manovec mě fakt nebaví. A vyjednávání už chce poměrně dost živoucího, což si ne vždy mohu dovolit."}, {"20": "Priority ohledně surek a schopnost boje se v průběhu hry výrazně mění, to je jasná věc [smilie--sprite1][BR]Jinak se ziskem odměn ve Věži jsem poslední dobou spokojená. V malém městě na CZ1 už mi padly 2 obytky. V městě na CZ2 mi žádná kouzelná budova ještě nepadla, ale jinak zisk ostatních věcí je slušný. Takže po delší době spokojenost. Celkem se těším na Věž pro víc hráčů. Určitě to budeme mít u nás dobrovolné, ale dost lidí Věž hraje, takže by to mohlo být hodně dobré."}, {"73": "Ludi, nejde o to, že máš momentálně kliku, ale jak jsou nastavené odměny, a že jsou prabídné, vyměnila bych úlomky za časovače, třeba malé, ale alespoň ki něčemu, nevím, co si mám počít s 100k úlomků? Nebo pro jejich využití zavede Inno novou funkci? Tím zase diskriminuje slabší a méně vyvinuté hráče."}, {"59": "Nevím, odměny ve věži jsou takovou hrátkou přírody. Někdy padnou mraky věcí, jindy hrozná bída. Celkově mi přijde, že dřív mi padaly lepší odměny jak teď, zda došlo k nějaké změně, nebo jen nemám už takové štěstí, nevím. Každopádně tomu co mi už napadalo nemůžu nic vytknout, navíc kromě zmíněných hald úlomků padají pravidělně i urychlovače 1h a 5h (a těch taky ne úplně málo), takže za mě i tak spokojenost. Surky dostávají občas zabrat, jen je škoda, že mi nepadají žádné obytky kouzelky, dostaly by mě ze svízelné situace, a ono se jim pořád nechce."}, {"46": "Me prijde, ze co nedostanu v 1. patre, to v dalsich nedozenu. Hraju to na automatiku a ted uz vyjednavam jen, pokud tam neni zive. (orku,  many a seminek mam dost). 15. kapitola je priorita. Takze do 2. patra ani moc nechodim. Mam tu lesik bran a dalsich malych, ale ono to trochu ziveho dava, tak proc ne. Kompletni sadu nemam. Obcas je k zahlednuti nejaka kouzelna budova, ale nemam. Ted uz  je to zase jen cekani do nedele na dalsi vez. V 2. patre nic uzitecneho nevidim."}, {"24": "Motivácia hrať vežu sa určite zvýši, už konečne prichádzajúcou, vežou pre spoločenstvá. [smilie--sprite1] Momentálne hrám každý týždeň iba 1. mapu (odkedy využívam väčšinu živoucího zboží v 15. kapitole), avšak po zapojení celého spoločenstva zrejme zvýšim svoj cieľ na 2 mapy (voči 3. mape mám problém s nedostatkom času na brány, som rád, že som sa konečne dostal k 100% skráteniu prodlev v turnaji, nepotrebujem pridávať časovú stiesnenosť inde)."}, {"3": "mě došli orci... věž se najednou stává problémem. Už přistavuju zbrojnice, ale docela problém. V eventu asi není žádná orkobudova, co?"}, {"64": "Jsme na tom podobně. Jestli je nějaká orkobudova v eventu, to nevím, ale čas od času se dá v akademii vycraftit hnízdo orků.[BR][BR]Odstraněna citace. Embla"}, {"80": "Je to něco jako mastermind, kdo to zná. Tam se hádaly barvy a pozice."}, {"3": "mastermind (nebo česky Logik) je skvělá hra. Pokud má jít o reakci na věž, tak ano, je to podobné.[BR]Jenže v logikovi jsi byl omezený pouze počtem tahů, zatímco tady tě omezuje i množství vlastních dostupných surovin. A když mi orkové spadli skoro k nule, tak prostě střety s orky nemůžu vůbec ani zkoušet vyjednávat..."}, {"46": "A jeste, tady to mas na 3 pokusy. A to se, pokud vyloucis nahodu/stesti, ve vyssich levelech dat neda. V mastermindu tech pokusu bylo o dost vic a jedina penalizace  byla, zes byl za neinteligenta, kdyz jsi to nevymyslel do nejakeho pokusu (beru stolni variantu, na pocitaci jsem to nikdy nehral) ...  [smilie--sprite2][BR][BR](ten neinteligent je tam kvuli Emble, puvodne tam bylo neco jineho [smilie--sprite2] )"}, {"49": "Emhyr var Emreis II napsal/a:\t\t\tA když mi orkové spadli skoro k nule, tak prostě střety s orky nemůžu vůbec ani zkoušet vyjednávat...\t\tKlikněte zde pro zvětšení...Vyměním manu a orky za semena.. zn., levně xD[BR][IMG]https://i.ibb.co/S51WqSh/http-images-athlan-net-i-1950-1-ork-png.png[/IMG]"}, {"59": "athlan >> Zlikviduj červa, co ti žere fazole. Ale hezký [smilie--sprite1]."}, {"3": "beru, jak na to? [smilie--sprite6]"}, {"77": "nemůžu to nikde najít ani udržet v paměti, prosím v kolik hodin se zjeví Věž věčnosti?"}, {"3": "16"}, {"59": "Ona se zjeví, nebooj [smilie--sprite1]."}, {"16": "Tak jsme se konečně dočkali věže pro společenství. Na rozdíl od zpackaného eventu tohle hodnotím rozhodně pozitivně."}, {"24": "Funguje to po technickej stránke veľmi dobre. Oceňujem možnosť vidieť progres ostatných hráčov a tiež ich automatické aktualizácie - bez nutnosti zatvárať / otvárať lištu alebo odchádzať z veže."}]