[{"59": "Copak věž se jako obvykle povedla, akorát mě mrzí to omezení městských portálů, kde jich je najednou nějak málo, a jen jako nejvyšší cena u společenství. V dalších patrech ani nevím kde jsou, ale býváválo jich víc co si pamatuji. Někdo se na konec singlu ani nedostane, takže je nezíská. Kdyby tak do hry přibylo víc takových možností jako je věž vděčnosti [smilie--sprite1]."}, {"16": "@Pauleo Nejlepší portál je 50% z tajemné truhly. Takže trpělivost, stačí to čistit každý týden (klidně i jen 1. patro) a ono to napadá."}, {"5": "Obrovská pochvala za Společnou Věž Věčnosti !!!! [smilie--sprite1]  děkujeme"}, {"59": "Lovec Krys >> Myslel jsem kouzlo teleport, 50% portál samozřejmě využívám, a postupuji přesně dle tvého návodu, čištění určitě prvního, a většinou (někdy) i druhého patra."}, {"16": "Aha, jo těch je asi méně. Mně osobně to tolik nevadí, jelikož je nepoužívám, ale může to vadit těm, kteří je používají.[BR]Ale stále se dají získat i z beden v prvním patře (ať už tajemných nebo minimálně jedné standardní)."}, {"20": "Věž pro společenství je hodně podařená věc. Celá věc tím stoupla na podstatně vyšší lv. Hrajeme jí v pohodě, dobrovolně a přesto vidíme, jak nám společné odměny ve sloupci pěkně stoupají, takže mega spokojenost  [smilie--sprite1]. Vypadá to, že spojovacích činidel bude nyní z Věže dostatek, nějaké ty urychlovače a maličko diošů taky padne. Tohle se vývojářům hodně povedlo. Díky"}, {"3": "jo, věž zatím krásně stoupá, protože začátky hraje většina hráčů. Ale pak přijde ten zoufalý sek, až všichni dosáhnou stropu [smilie--sprite8] jsem zvědavý, jak moc bude společný postup pro některé motivační (a to nemluvím o těch diamantech [smilie--sprite8] )"}, {"42": "Když všichni dojedou první patro, tak je dost bodů pro odemčení skupinových odměn pro druhé patro. Začíná se to lámat u třetího patra, kde už to vyžaduje velkou účast ve druhém a třetím patře. Ve výsledku to pro běžného dříče, který končí po ukončení druhého patra, znamená, že má velkou šanci na získání skupinové odměny, i když jeho kolegové se plácají v první patře a to je fajn [smilie--sprite1].[BR][BR]myslím se, že psychologicky by to mohlo být motivace, když člověk vidí co by mohl dostat a jen to čeká na něj [smilie--sprite8]. Každopádně toto je opravdu povedený update věže."}, {"47": "Teď přemýšlím, že možná díky věži asi znova začnu vyrábět magickou výrobu v akademii, když budu každý týden dostávat z věže minimálně 5 činidel z prvního patra [smilie--sprite1]"}, {"73": "@mohyla98  už jsem ji zadala, namísto spojovadla, ano, odměny jsou lákavé a motivující, díky za ně a doufejme, že úspěšné zdolání věže a získání odměn nepovede k jejich následné degradaci"}, {"5": "Sdílím obavy degradace, ale třeba se rozbřesklo na lepší herní časy [smilie--sprite1]  .....a komu z nás nestraší ve věži?! [smilie--sprite1]"}, {"81": "ahojky věž pro společenství je super ale škoda že body nejdou do řebříčku,byla by to velká motivace a vzpruha pro všechny zkuste nad tím popřemýšlet díky,je to návrh"}, {"59": "Za mě i singl věž se povedla, nejen multi. Multi jen rozšířil obzory dalším hráčům, a trochu s tím rozhýbal, což mě samozřejmě těší."}, {"64": "Taky se přidávám s pochvalou za multiplayer. Pro mě osobně je to zajímavější, než dobrodružství společenství."}, {"73": "Rozhodně souhlasím s chválou věže, single i multi, hezká grafika, zajímavější než úmorné a nekonečné turnaje a v multiverzi rozhodně lepší než DS, sice se u DS už neuklikáme k smrti, ale moc dobrodružné není. Za mě díky. Prosím, jen nahraďte ty poslední přidané úlomky něčím jiným. Nebo pro úlomky nějaký trh, směnárnu, hernu - ruletu, ale to asi vzhledem k věku hráčů nelze."}, {"77": "I já děkuji za Věž v rámci společenství, teď už jí hrát plodí opravdovou radost! [smilie--sprite1]"}, {"5": "luterin: ...jéé nechcete mne do spolku, když se u vás ve věži tak hezky plodí [smilie--sprite1]"}, {"59": "Tak dobrozružství se propadá hlavně na celkem nicotných odměnách, a ještě by chtělo nějak nakopnout, jediné co se za poslední dobu povedlo je to zásobníkové provedení, ale jinak je vše při starém."}, {"82": "Forseti napsal/a:\t\t\tJak se na novinku v podobě Věže věčnosti těšíte? Zúčastníte se? [smilie--sprite1][BR][BR]Dejte nám vědět, těšíme se na vaše postřehy a připomínky!\t\tKlikněte zde pro zvětšení...Ahoj, jak se dostat do věže, zatím se mi to nepodařilo"}, {"3": "hlavní obrazovka - nahoře je věž - klikni na ni [smilie--sprite8]"}]