[{"1": "Hlavně musí být dokončen výzkum první technologie z kapitoly III. Perleťově bílá věž se pak nachází ve vrchní části vašich měst na pozadí. [smilie--sprite2]"}, {"77": "@ElfNostradamus , nemáme zrovna ani jedno místo volné, ale píšu si. [smilie--sprite1]"}, {"5": "..šlo spíše tedy o to plození než místo...ideálně tedy spíše ještě to čemu tomu plození předchází [smilie--sprite1][BR][BR]Odstraněna citace. Embla"}, {"83": "Ahoj, skúšam nájsť vež, ale ako klikám tak lkikám , a nič."}, {"24": "@Mesto1 je dostupná od 3. kapitoly a zobrazuje sa v ľavej hornej časti plochy od mesta."}, {"42": "Odměny mne už nedoženou, tím jsem si jistý [smilie--sprite8][BR][BR]"}, {"77": "Nás 3 a 3 už asi taky ne [smilie--sprite8]"}, {"3": "my jsme skončili ještě o jednu výš, ale vrchol je v nedohlednu"}, {"15": "Takových nás je , o jé !!   [smilie--sprite6]"}, {"11": "Taky jsem poprvý udělal třetí patro ale nevím no, záhadná truhla ve třetím patře ani jedna , v každým patře v poslední truhle ty drobný diamanty co spíš očekávám ze studní a to už tak mám asi 3. věže po sobě (2.patra) Ale skupinový odměny beru jako dobrý a celkově se mi hromadná věž líbí."}, {"3": "máš pravdu, záhadných truhel bylo nějak málo a fialovou už jsem neviděl ani nepamatuju. No a z bossů mi padají pořád knihovny. 6 mám postavených, 2 jsem už zbořil, 3 v inventáři... já chci něco jiného! [smilie--sprite8]"}, {"20": "Společná Věž byla fajn, odměny se moc hodí. Velká spokojenost."}, {"15": "@Emhyr var Emreis    Jak už jsem napsala dřív : to se tak někdo má . Já jsem konečně po dlouhé době získala jednu knihovnu , uff . Ale jinak ti to přeju . [BR]Hezké Vánoce !   [smilie--sprite6]"}, {"3": "dík, ale radši bych právě ty jiné odměny [smilie--sprite8] je tam džin, trpasličí zbrojíř nebo klasika diamanty a mě padá knihovna... [smilie--sprite8] a to samé z předchozích bossů"}, {"3": "Jen tak pro zajímavost, už jste někdo (společenství) dosáhli na vrcholek společné věže?"}, {"68": "Taky by mne zajímalo, jestli už byl někdo na vrcholu.[smilie--sprite1]"}, {"28": "U nás zatím ne... Pokud mě paměť neklame, končíme pravidelně 2 truhly pod vrcholem [smilie--sprite1] Zatím tomu necháváme volný průběh a žádné limity jsme nestanovili... [smilie--sprite1]"}, {"5": "Rovněž maximum dvě truhly před vyvrcholením [smilie--sprite1] ...a taky plná dobrovolnost, nikdo není do styku s věží nucen...[smilie--sprite1]"}, {"64": "Dneska mi na konci 1. patra vypadla kouzelná obytka [smilie--sprite1] Nečekal jsem to, o to víc jsem byl příjemně překvapen... škoda jen, že mi nepadla ve vedlejším světě, tam bych ji potřeboval víc..."}, {"5": "23:20 zatím nepřipsány odměny z Věže"}]