[{"52": "23:37,taky nic.Koukám na to jako blázen,kde nic tu nic..."}, {"46": "23:54 furt nic - mozna jsme neco prehledli a zrusili je  [smilie--sprite2]"}, {"52": "to zrušit nejde"}, {"11": "taky to zrovna slovně řešíme"}, {"31": "Po půlnoci a stále nic. Snad se zítra objeví"}, {"52": "No,já bych radši už dnes. [smilie--sprite1]"}, {"12": "To je v matrixu,mam nakrmene medvedy a nic se nedeje!!!"}, {"46": "Je globalni, viz forum na bete. Podle vseho se tohle na bete deje pomerne casto, odmeny pak dorazi nekdy casem.  Zrejme kdyz se nejaky suport probere a kopne do toho.[BR]Ted se tedy povedlo tenhle bug dostat i na ostatni servery. (je tam jmenovany en1,2,3 + hu1). Nejsme v tom sami [smilie--sprite1]"}, {"41": "Noo, 7:34 a porád nic, asi se ješte nikdo nevzbudil teda.. [smilie--sprite8] Tak snad tam nemají dovolenou [smilie--sprite8] [smilie--sprite8] [smilie--sprite8]"}, {"84": "Ahoj vsem tak z veze nikde nic neprislo copak to zase je :-( snad to dostanem ..... je 9:03"}, {"24": "Je to chyba ktorá sa k nám dostala poslednou aktualizáciou, na bete ju opisovali tak, že odmeny zvyknú chodiť s výrazným oneskorením (zväčša na ďalší deň)."}, {"5": "Tak u nás odměny již připsány...děkujeme [smilie--sprite1]"}, {"41": "U nás už taky odmeny na konte, dekujeme [smilie--sprite1]"}, {"49": "Vím že to ve školce přímo neučí, ale za to že ostatní dělají chyby se neděkuje [smilie--sprite1]"}, {"5": "Návrat do školky bych uvítal, hlavně to spinkání po obědě nemělo chybu [smilie--sprite1] ...a přesto že pozdě, tak hlavně že odměny přišly, také nemusely být vůbec, což by bylo daleko více nemilé. Navíc z chyb se člověk učí [smilie--sprite1]"}, {"19": "Navíc, předpokládám, že nikde není striktně uvedeno, v jakém časovém horizontu budou odměny připsány, takže se přímo o chybě mluvit asi nedá [smilie--sprite2]. Takže buďme rádi, že jsme je dostali a děkujeme vřele  [smilie--sprite8]."}, {"49": "Opakovaně se stane to, že se na betě objeví chyba a místo toho aby se vyřešila, se to pustí na live servery. [BR]Hlavně že je něco novýho. To je prostě blbě, ano tohle jsou drobnosti, ale ten přístup je takový ve všem."}, {"85": "Ja se priznam, ze neresim jestli odměny přijdou ihned, nebo az za par hodin. Tato hra ma stále dalsi nové prvky, vylepšení a novinky. Takže je určitě čím dál náročnější aby vše bylo perfektní. Věž věčnosti je skvělá. Díky za možnost vyjednávání. Díky tomu jsem se dostala daleko. Odměny byly super."}, {"86": "..už to tu padlo..odměny ve věži opravdu nereflektují náklady v momentě, kdy jsou ve hře zejména úlomky. Jinými slovy, procentuálně přednastavená pravděpodobnost, že padnou úlomky, je příliš vysoká a chtělo by to snížit, víc vyvážit...nevím kdo potřebuje desetitisíce tak snadno vyrobitelných úlomků, škoda slov...[smilie--sprite2] ..jinak to nemá chybu"}, {"85": "Tak nevim jak komu, ale mě úlomky padly jen 2x na začátku a jinak časovače, které se mi moc hodí, teleport apd. Ja jsem spokojená [smilie--sprite1][smilie--sprite2]"}]