[{"20": "S Věží je to na střídačku: jednou Zlodějka, po druhé Dobrodějka  [smilie--sprite2]. Ale celkově bych řekla, že výhody převažují. Zvláště nyní, když jsou i společné odměny."}, {"46": "Tak v mem p;ipade je to o ulomcich (kdyz je muzu dostat, tak je dostanu). Nicmene dneska jsem dostal dzina (prilezitost byla na 2). Jinak to, co dostanu za spolecenstvi. je o dost lepsi nez to, co si ubojuju sam. Ty odmeny jsou v mem pripade bidne a kdyz uvazim, co stoji jeden souboj, tak 1000 ulomku je docela vysmech. Stale si myslim, ze rozumne je koncit zabitim ropuchy (2. patro) a doufat, ze ve spolecentsvi tech 520 dame (obvykle ano)."}, {"5": "Kvituji včasnou/přímo bleskovou/ výplatu odměn z Věže [smilie--sprite1]"}, {"46": "Jojo prekvapili [smilie--sprite1]"}, {"87": "Toto kolo bylo obvzláště lahodné, 2 x džin, kouzelná obytná, trpajzlík atd... To je pomlaskáníčko. A 7mí v pořadí, na to, co jsme za lamy, je to super úspěch, takže jsem spokojen a pyšnej [smilie--sprite1]"}, {"3": "Mám teoretický dotaz. Pokud je věž v běhu a společenství:[BR]1) vyhodí člena => ztratí jeho body?[BR]2) přijme člena => získá jeho body, které už třeba získal?[BR]3) přijme člena => může se ten člen ještě vůbec zapojit do té společné věže? (nebo až příště)[BR][BR]máte někdo otestováno?"}, {"11": "řekl bych, že to bude jak u turnajů, body zůstávají tomu společenství ve kterém je hráč nahrál. Ale jen můj názor."}, {"72": "Bych si tipl 1-A 2-B 3-A, Body se nestratí, žádný předem nahraný nepřinese a proč by se nemohl zapojit?"}, {"42": "zúčastnění se ve věži je nezávislé na členství ve společenství. Otázka zní jak systém vyhodnocuje odměny za body společenství, když se hráč připojí v průběhu."}, {"11": "předpokládám, že by se na stupnici objevil tam, kolik má nahráno ale jeho dosavadní body se nepřičtou. Získá odměny společenství dle jeho stupnice, z předešlého spol. nezíská žádné."}, {"77": "Emhyr var Emreis II napsal/a:\t\t\tMám teoretický dotaz. Pokud je věž v běhu a společenství:[BR]1) vyhodí člena => ztratí jeho body?[BR]2) přijme člena => získá jeho body, které už třeba získal?[BR]3) přijme člena => může se ten člen ještě vůbec zapojit do té společné věže? (nebo až příště)[BR][BR]máte někdo otestováno?\t\tKlikněte zde pro zvětšení...mám (na betě) otestováno:[BR][BR]1) ano[BR]2) ne[BR]3) může se do věže zapojit ihned a všechny body, které od připojení do věže získá, společenství zůstávají"}, {"3": "perfektní servis, díky [smilie--sprite1] třeba čase využijeme"}, {"3": "Omlouvám se, že nespojuju příspěvky, ale tohle si zaslouží sólo.[BR][BR]Poslušně hlásím - VĚŽ DOBYTA!!! - Les Misérables (W) [smilie--sprite6][BR][BR]Skládám ohromnou poklonu svým spolubojovníkům. Už jen za to, že jsme to dokázali na dobrovolné bázi [smilie--sprite1][BR]Uvidíme, na kolika bodech se nakonec zastavíme. Snad nezapomeneme udělat nějaký screen [smilie--sprite8]"}, {"88": "[IMG]https://i.ibb.co/VNTP8c0/https-cz-forum-elvenar-com-index-php-attachments-1581109619867-png-4179.png[/IMG]"}, {"89": "Les Misérables - gratulace k minul věži. U nás (Česká legie) jsme se - po počátečním ignorování věže - po změně s příchodem hry pro společenství do věže aktivně taky zapojili a alespoň první patro už považujeme za skoro povinnost - minimálně v době turnaje při nakrmeném Ohnivákovi by to neměl být pro nikoho z nás problém. Ale většina už dokonce Věž hraje raději než turnaje."}, {"59": "Na dokončení věže u nás ještě celkem dost chybělo, nakonec nepadl ani předposlední bod, byl jen částečně splněn. Jinak jsem zjistil zajímavou věc, když vypadne kouzelka z věže, tak zatímco standardní vylepšení, i nákup nové kouzelky je ve vyšších kapitolách (a to i přes opětné zavedení pokročilých průzkumníků u Elvenarů, ale ve Wiki je správně uvedeno že to od Amunů výš tak prostě je) podmíněn vyzkoumáním patřičného výzkumu, tak u věže vypadává rovnou vylepšená varianta kouzelky z oné kapitoly."}, {"16": "@Pauleo Zřejmě se to řídí stejnými pravidly jako jiné budovy z věže/eventové, které taky dostáváš dle aktuální kapitoly a ne dle výzkumu."}, {"59": "Asi ano. Takže pro mě včera bylo daleko výhodnější, když mi padla dílna kouzelka z věže, než kdybych jí kupoval za briliant. A za přebytečný briliant z věže se dnes dala zlevněně pořídit obytka kouzelka, která se dá později vylepšit za \"ušetřený\" plánek."}, {"90": "Nevíte mi kdo hrajete Věž věčnosti poradit -nikdo to nepotřebuje.špatná osoba?"}, {"11": "\"nikdo nepotřebuje \" \"špatná osoba \" \"potřebuje jiný \" [BR]Co na tom chceš dál poradit?"}]