[{"91": "Když ti to píše \"špatná osoba\", to znamená,že ta surovina, kterou si tam vložil tam nepatří a musíš ji zkusit dát jinam.[BR]Pokud ti to píše \"nikdo to nepotřebuje\", to znamená, že na vyjednávání tato surovina není potřeba, a už se ti v nabídce neobjeví pro to současné vyjednávání."}, {"90": "Děkuji"}, {"91": "Maličkost, kdykoliv budeš potřebovat poradit, stačí napsat.[smilie--sprite2]"}, {"24": "Poslednú vežu som sa po nejakej dobe opäť rozhodol nahrať, tu sú videá z jednotlivých máp.[BR][BR][BR][BR][BR]"}, {"15": "  @iDavis Zhlédla jsem tu poslední věž a tvoje bojůvky - všechna čest ! To byl odvaz !   [smilie--sprite6]"}, {"87": "U nás už se to zase mele, je škoda, že Věž jedou komplet 2, max. 3 společenství. Zaslechl jsem názory, že se to nevyplatí. Rozhodně nesouhlasím.Opomenu li manovičníkovoblahovičníkovou plejádu, portály, časovače, sem tam kouzelka, džin, zbrojíř, paráda. Asi by bylo příliš odvážné chtít pro větší motivaci nějaké odměny pro 1ní 3 spolky, možná by se jich zapojilo víc, ale možná také ne, takže by z toho profitovali pořád ti stejní \" blázni \" . Chtěl bych moc džinů, mám je moc rád, ale jako správnej žebrák, mám jen 2 [smilie--sprite3] No každopádně takhle to vypadá po necelých 24ti hodinách..."}, {"36": "Což o to, ono by se to asi i vyplatilo, ale málo kdo má dost zdrojů, aby si mohl dovolit tu věž projet celou. Já obvykle končím před bossem 2. patra, výjimečně zkusím i toho bosse, ale dál už by to bylo příliš nákladné. Mince a zásoby mohou napršet, ale to další zboží když není, tak prostě není. Armádu ve věži nepoužívám, to se mi neosvědčilo, navíc ji potřebuji na turnaj."}, {"16": "@BombaySapphire Ono to není tak jednoduché, já např. skončil teď střet před koncem - posledního bosse jsem prostě tentokrát nedal - příliš mnoho neúspěšných pokusů, tak jsem to vzdal. A armádu používám 100% na turnaj a stejně bych ty 3 kolové bossy prostě nedal. Příště se zase vrátím ke 2 patrům a 1-2 branám ze třetího."}, {"59": "No já už bych džina snad ani nechtěl, protože u mě mi skoro nic kloudného nedává. Mám už pátého, resp. čtyři už dosloužili, takže vím co mi přinesli a co ne. A asi dost záleží kdo jaké má štěstí, každopádně mě nepřinesli téměř žádné brilianty (párkrát padly, ale na to aby se to vyplatilo je to fest málo, ty vyšší hodnoty minimálně za celou existenci nebo vůbec), oproti studnám, které je sypou každou chvíli. Knížky dávají zřídkakdy, někdy vypadne i 5h, ale taky skoro ne, fazole sice občas vypadnou, ale téměř vždy padá mana, kterou už téměř nepotřebuji. Ale také je pravda, že někomu briliant padl, co sjem zaslechl."}, {"42": "@BombaySapphire [smilie--sprite12]? protože někdo musí nutně projít věž hned pomocí urychlovačů tak to jako znamená, že ostatní tu věž nehrají nebo co? Protože ji prostě projíždí v klidu, jelikož není kam chvátat. A navíc pro lidi to je opravdu drahá záležitost a raději suroviny využijí při výzkumu a stavbě."}, {"5": "Rovněž projíždím pravidelně věž celou, část bojem, většinu ale vyjednáváním. jako spolek dáváme pravidelně 2 stupně od vrcholu ,,teploměru,,...více je opravdu dosti náročné- nákladné jak surovinově či vojskem i pro spolky v top dvacítce a ostatně až takový žhavý důvod k tomu zatím není to natolik masívně zadotovat, abychom byli na úplném vrcholu [smilie--sprite1] / o to více tleskám spolkům, kteří si na vrchol sáhly [smilie--sprite1] /. Za mne džin své místo ve městě má, proto 3 pravidelně stojí a měním je vždy za čerstvé [smilie--sprite1] a kromě kultury a estetiky dávají co dávají [smilie--sprite1] určitě si na ně nemohu stěžovat.... apropó není potřeba urychlovače, při rozumném časovém rozvržení se dá věž dělat bez, protože jde přeci o to z ní ty urychlovače získat ne je tam zpětně nacpat [smilie--sprite1]"}, {"44": "Fjorgyn napsal/a:@BombaySapphire [smilie--sprite12]? protože někdo musí nutně projít věž hned pomocí urychlovačů tak to jako znamená, že ostatní tu věž nehrají nebo co? Protože ji prostě projíždí v klidu, jelikož není kam chvátat. A navíc pro lidi to je opravdu drahá záležitost a raději suroviny využijí při výzkumu a stavbě.\t\tKlikněte zde pro zvětšení...[BR]píše o tom že věž komplet hrají max tři spolky což má pravdu. Pokud vím nahoru vylezly právě jen tři spolky. A když na konci dostaneš pokud se nepletu 33 ks 5h urychlovacu tak holt to urychleni tak nebolí. A zrovna Bombay a jeho spolek vylezly minulý týden prvně až nahoru tak v tom vidím spíš takovou pochvalu sama sebe před ostatníma než relevantní post [smilie--sprite1]"}, {"16": "@Anthalas Jak někdo napsal výše, věž na maximum znamená, že více než 20 hráčů společenství musí projet věž celou. [BR]To je podobné jako kdyby desátá truhla byla pro společenství nahrávajících 250k bodů (tzn. každý hráč by musel nahrát průměrně 10k bodů).[BR]Takže žádný div, že na max. dává věž jenom hrstka společenství."}, {"92": "Pokiaľ sa tu nachádzajú hráči, ktorí majú záujem čistiť vežu každý týždeň, tak mi kľudne napíšte v hre [smilie--sprite2] nie je podstatné koľko máte bodov, dôležitý je výkon vo veži."}, {"3": "Lovec Krys napsal/a:@Anthalas Jak někdo napsal výše, věž na maximum znamená, že více než 20 hráčů společenství musí projet věž celou.[BR]To je podobné jako kdyby desátá truhla byla pro společenství nahrávajících 250k bodů (tzn. každý hráč by musel nahrát průměrně 10k bodů).[BR]Takže žádný div, že na max. dává věž jenom hrstka společenství.\t\tKlikněte zde pro zvětšení...no, nás bylo 19 nebo 20. Takže nemusí úplně platit ta nerovnice [smilie--sprite8]"}, {"16": "@Emhyr var Emreis II To už je spíše detail. Důležité je, že na maximální odměnu ve věži je potřeba aby drtivá většina společenství jela na maximum možného (nebo blízko toho maxima).[BR]A takových společenství moc nebude, co by to byly schopny hrát pravidelně."}, {"20": "U nás pravidelně dáváme 9. odměnu. Několik lidí hraje Věž celou, ostatní podle možností. Abych řekla pravdu, tak vzhledem k odměnám je to fajn a vlastně to stačí. Myslím, že časem budeme zvládat i víc, ale dáváme tomu volný průchod a vše je dobrovolné.[BR]Věž je pro jednotlivého hráče někdy velmi výhodná, jindy méně. Když se ale hraje pravidelně pokaždé 3 patra (což už nějaký čas dělám), tak v průměru je nakonec určitě výhodná. Džin je moc fajn, v mém městě je vždy vítán."}, {"59": "Tak ono není třeba získat poslední odměnu, a přesto halda odměn těm co jsou dostatečně vysoko napadá. U nás se na poslední odměnu zatím nedosáhlo, a celkově není předpoklad moc často lámat rekordy, přesto mi přijde že se řada hráčů snaží, a výsledné odměny pak docela stojí za to. Pro mě jsou jinak nejcennější odměny 5h urychlovače, spojovací činidla, a místo džina uvolním místo raděj zbrojíři z řad trpaslíků, džin je u mě jen další budova na manu. Ale je možné, že vždy dostávám už nějakého recyklovaného, vycuclého od všech pokladů, které jinak snáší [smilie--sprite1]."}, {"93": "Tak zrovna sem odehrál snad nejvykutálenější síň ze všech.  Samý úlomky kouzel, který jsou úplně na nic. Ty by se vážně měly úplně vyřadit, protože každej jich bude mít bambilion a na co. Jinak ale celkově mi ceny padají slušně, kouzelný budovy a dílny, džinové který mě dávají víc dia než kdy studánky dávaly.[BR]Jen ty úlomky...[smilie--sprite9][BR][BR]Odstraněn nevhodný výraz. Embla"}, {"3": "mě opět dva první bosové dali portálové bonusy... za toho bych někoho zabil"}]