[{"20": "Vážení, neremcejte na špatné odměny z Věže [smilie--sprite2]. Mezi námi - úlomky jsou právě fajn, protože od doby Věže je to jedna z věcí, o které se vůbec nestarám a není nutné věci rozkládat na úlomky. Prostě můžu a nemusím. Stejně tak se nemusím nijak starat o portálové bonusy, za což bych před rokem dala kdoví co. Velmi to usnadňuje hru, jelikož člověk nemusí stavět celou \"výrobní linku\". Takže v pohodě. Samozřejmě nemůžou pokaždé padat kouzelky, Džinové atd. Od dob společných odměn je Věž každopádně výhodná. Elixíry, urychlovače - to všechno zvyšuje komfort hry."}, {"53": "Věž mi přijde přínosná, i když jsou hráči co ji z duše nenávidí... Prostě 2 tábory... Ale je pravda, že 1) bych uvítala snížení náročnosti na vojsko (počet), protože to množství jednotek co to chce na boj je fakt šílené. Dle mého by to hodně prospělo a přivedlo k hraní věže i hráče z řad odpůrců...  a 2) by opravdu mohlo být méně těch úlomků. Ano, jejich počet opravdu nemusím už řešit... Ale ve skladu se mi nyní množí stavby, které bych ráda rozmlátila, ale není k tomu důvod, bo úlomků mám víc než dosti.  Tož by to chtělo místo úlomků sem tam do bedny nějakou jinou odměnu... [BR]Ostatní odměny mi přijdou OK, ano je to o náhodě, co padne. A když padne to, co zrovna VŮBEC nepotřebuji, tak to naštve :-D... ale to už je hra, stejně jako to, jak často vám vypadnou z džina DIA...  Mě třeba dává poměrně často semínka, takže si nestěžuji... [smilie--sprite2]"}, {"3": "Ludi napsal/a:\t\t\tVážení, neremcejte na špatné odměny z Věže [smilie--sprite2]. .\t\tKlikněte zde pro zvětšení...já remcám jen o těch prpotálových onusech. mám jich tolik, že už nemusím nikdy rasy řešit a furt přibývají na úkor těch ostatních pěkných a pravděpodobnějších odměn,,,"}, {"77": "Věž se mi báječně doplňuje s turnajem, ve Věži vyjednávám na suroviny a z odměn utržené z ní časovače mi akorát vycházejí na závěr turnaje, kde nakrmím hnědého medvěda a protočím je v kasárnách na vojáky, které zas jedu v turnaji. Díky Věži mám nejen víc lepidel, časovačů a diamantů, oceňuji i teleporty a portálovky, ale i z turnaje více VB. [smilie--sprite1][BR]Džina jsem měla snad jen jednoho od počátku co Věž je, od té doby ho vídám už jen u sousedů, nevím proč nechce ke mně??? [smilie--sprite8]"}, {"42": "Odměny ve věži jsou v aktuálním stavu hry ok. Sice mi ještě ani jednou nepadl džin (už jsem se s tím smířil), ale mám 3 kouzelné obytky a 1 dílnu a asi tak 10 setů knihoven (když mi stačí jedna [smilie--sprite8]). Protože díky věži mohu jet nonstop řemeslnou výrobu a případně si ji i urychlit, když je více hezkých věcí. Takže je dost matroše na výrobu boostů a ty ulehčují turnaj i věž. Společenstvo pravidelně zvládá odměny až do 1 brány ve třetím patře, takže i z tohoto směru teče dost komodit, které umocní další progresi.[BR][BR]Za mě jedu nonstop jen pomocí armády. U mě už se celkem rozumně ukazuje nabídky žrádla. takže i medvědi nezahálejí a netrpí hlady a doplňují vojsko jedna báseň. Aktuálně jsem uklikaný ze všech tich bojů."}, {"94": "Někde jsem slyšel \"Čím více hvězd, tím méně člověk\",  a jelikož ze všech tich bojů je Věž asi hrátkou, tak mne napadá, je vážně důležité řešit tu věž tak vážně?"}, {"59": "Vážně důležité to není, ale kdo chce odměny, tak se musí zapojit."}, {"94": "že by Déjà vu ?"}, {"95": "Asi se mi porouchala věž, projel jsem první patra v obou světech,a ani jedna truhla,stalo se to taky někomu???[BR](ani uzavřená)"}, {"3": "stalo, ale ne ve dvou patrech po sobě. Bylo to v prvním a třetím v jedné věži.[BR][BR]Jinak dneska první boss a zase portálový bonus. Už mám minimálně 4 v řadě..."}, {"16": "@flego U každého střetu máš 10-30% šanci na bednu, takže někdy padá málo, někdy často, občas na patře nepadne vůbec, šance na to je sice malá, ale dostatečná aby se to občas stalo."}, {"38": "Nevím proč se stále tváří kladívka jako že je můžu použít, ikdyž je už nikdo nechce.  Dřív to už použít nešlo. Bacha na to."}, {"16": "@BiggJOEcz Tváří se tak někdy, ne vždy. Už jsem si toho všiml, že se tak občas děje, že surovinu, kterou již nikdo nechce, stále můžu použít."}, {"38": "u mě se to stalo za celou dobu věže právě poprvé, tak proto ten poplach [smilie--sprite1]"}, {"19": "Pozor, tohle je v \"pořádku\", kladívka by zmizela pouze v případě, že by při poslední nabídce přišla hláška 'nikdo to nepotřebuje'. To že je není komu nabídnout si bohužel musíme ohlídat sami."}, {"3": "radvanus to trefil. zase to nemůžeme mít tak primitivní, ne?"}, {"89": "Nad tím se děsně rozčilovala i manželka a psala to na podporu. Snad by se to dalo implementovat do hry, aby nemátla hráče. Ale zatím je to jen a jen na nás  a naší pozornosti."}, {"77": "@ElfMaGorr , asi toto nevadí, ale dala bych si pozor na \"bystré oko moderátorovo\" [smilie--sprite2] § 1 Komunikace: Je zakázáno kdekoliv nebo s kýmkoliv sdílet komunikaci mezi vámi a herní podporou . Tato komunikace je považována za důvěrnou a osobní."}, {"3": "byl jsem zvědavý, kdo si půjde pro zlatou trofej a zatím to vypadá, že nás na W nikdo nestíhá? Není to škoda? [smilie--sprite1]"}, {"28": "Všichni mají plné město dobrodružství a není místo na vojenské budovy, takže to docela chápu [smilie--sprite1] Jsem zvědavá na příští týden [smilie--sprite8]"}]