[{"36": "Tak jsem si už také zkusil věž věčnosti. Asi neudělám ani celé první patro, ale to nevadí, nějaké odměny jsem získal a za přijatelné náklady. A asi to tak budu dělat každý týden, vyřeším těch prvních pár nejjednodušších střetů, to bude fajn. Uvítal bych, kdyby horní panel ve věži obsahoval kromě množství dia a zbývajícího času i množství mincí, nástrojů a zboží."}, {"16": "K vyjednávání:[BR]Moje taktika začíná stejně: Nabídnu všem po jedné surovině (pro střety s 5+ surovinami). Tím se nejrychleji odhalí, pokud některá surovina není zapotřebí.[BR]V dalších dvou střetech se řídím tím, co napíší duchové, samozřejmě, čím více surovin, tím větší je to hádání a tím méně pomůže strategie.[BR][BR]Dá se říci, že je to taková úplatková loterie, aneb hádej, co chci za úplatek (s podtitulem, tohle jsem sice nechtěl, ale nechám si to, takže taková zlodějská úplatková loterie[smilie--sprite8] )."}, {"20": "@Lovec Krys [BR]Právě ta loterie mě nejvíc vadí. Nechtěla jsem jet všechno na boj, abych si nelikvidovala vojsko před turnajem, ale to hádání je skutečně na nic. V podstatě to dělám stejně, v prvním kole rozhodím všechny možnosti a pak uvidím, jestli se něco vyloučí. Jenže ono ani tohle většinou nepomůže. Výsledek, že duchové sežerou i to, co nechtějí, je naprosto nelogický. Kdyby to bylo jako v turnaji: buď vyhraješ nebo koupíš, tak je to fajn. I za cenu many, živoucího zboží a semínek. Ale to hádání, kdy propadnou věci jen tak, to mě štve."}, {"3": "blbé je, že ti řeknou, že to chce někdo jiný, ale když ti to řeknou dva u stejné suroviny, tak to neznamená, že to chcou dva jiní..."}, {"45": "...ahojte tento prispevok som napisal aj u nas na SK diskusii. Som jeden z tych \"chudakov\", ktory maju vsetky oddiely a tak moje turnaje a teraz aj veza je na pocet bojujucich jednotiek to max co moze byt.[BR]Chcel som vezu vyskusat a tak mam prvu vezu so vsetkymi troma lv. za sebou. Isiel som vsetko bojom s pouzitim ohniveho fenixa. Prisiel som o 65T strategov, 162T strelcov a 34T knazov, cize jednotky, ktore vyrobim za cca 6 dni. Ziskal som iba dve mensie budovy do setu a 255 DIA, kopec fragmentov cca 7000, katalyzatorov cca 20 a samozrejme urychlovacov, ktore som vsak spatne minal na otvaranie levelov (nakoniec som o 28 hodin vyuzil viac ako ziskal).[BR]Zaver je asi taky, ze pokial by som chcel hrat vezu kazdy tyzden, tak by som nemohol hrat turnaj a naopak, mozno ak by som skusal vykupovanie, no u mna to chcelo kopec many, semien a citiaceho tovaru, tento tovar sa rozpada a tak hrac ich nikdy nema na konte dost na rozhadzovanie a este k tomu ma ten nahodny system a pazravost duchov od toho odradil. Ak by som siel 5 dni vezu a urychlovace minal na vyrobu jednotiek, tak sa to da mozno s turnajom hrat subezne. Nabuduce to mozno vyskusam takto, uvidim a opat to zhodnotim..."}, {"46": "Takhle je to i na Forge a nejlepsi tam bylo, kdyz ti zbozi uprostred doslo. ;-) Je dobre predem zjistit, jestli mas nasobky pozadovaneho zbozi. ;-)[BR](Vlastne tam slo dokupovat za diamanty (nebo co to ve FoE bylo))"}, {"47": "Já ve věži vůbec nevykupukuji, chvíli jsem to zkoušel, měl jsem tam 5 druhů surovin, na třetí pokus jsem to stejně neuhádl, tak jsem si řekl, že to zavřu a když jsem to vykupování otevřel znova, tak ti samí duchové chtěli jiné suroviny, tak jsem se na to vykašlal, a už jenom bojuji, zatím jsem teda v prvním patře, tak potom uvidím, jak moc náročné budou ostatní patra."}, {"39": "Odměna za ty ztráty je tak tristní, že tu věž oželím a další týdny ani už zkoušet nebudu. 5% šanci na setovou budovu u hlavního bosse? 45% na 30 diamantů, když 1. patro sežere jednotky a suroviny tak za 1000 diamantů? :-D"}, {"48": "@iDavis:  Taky čekám na přesně stejném místě... Pro ty, co z nějakých důvodů Věž věčnosti ještě nenavštívili, tady několik mých screenů: [BR][BR]Před první bránou[BR] [BR][BR]Před druhou bránou[BR] [BR][BR]Diplomacie[BR]    [BR][BR]\"Stůj , tudy neprojdeš!\"[BR] [BR][BR]Prošla jsem... (+ náhled odměn)[BR] [BR][BR]Jen 4x spojovací činidlo...[BR] [BR][BR]A čekáme...[BR]"}, {"45": "ak dojdes na koniec, tak ta caka toto:[BR][BR]"}, {"24": "Podobne ako pri udalostiach, v rámci predstavenia veže mi došiel na email darček, v podobe jednej budovy Trpasličí zbrojíž."}, {"38": "Trocha přehled cen surovin a velikosti armády na konci 2.patra u Žabáka:[BR][BR][BR][IMG]https://i.ibb.co/0yXvdTk/https-cz-forum-elvenar-com-index-php-attachments-stage2-boss2-jpg-3629.jpg[/IMG] [BR][BR][BR][IMG]https://i.ibb.co/2g4NWtJ/https-cz-forum-elvenar-com-index-php-attachments-stage2-boss-jpg-3628.jpg[/IMG]"}, {"35": "tak to se fakt nepovedlo.... pardon"}, {"48": "Druhá metoda řešení - bojem (zde automatický)[BR]   [BR][BR]Nějaké odměny[BR] "}, {"35": "uprimne moc nechápu, jak mam uhrat 3 vlny utoku, kdyz nechci pouzit diamanty.... armadu mam vymlacenou a nic poradne z toho.. z truhel padaly největší kraviny samozřejmě"}, {"49": "Jako možná pro někoho kdo je v půlce výzkumu, ale ty požadavky na konci jsou fakt absurdní, od začátku živoucí zboží, u asi pátý truhly už je komodit pět, chce to na pokus 2k semínek.. děkuji.. a s pánembohem."}, {"50": "Věž vyzkoušeno...., za sebe říkám neadekvátní odměny...[BR]Prošla jsem úplně celou, kombinace boje i diplomacie dost velké ztráty.[BR]Pokud se nezmění nastavení odměn je to pro mě jen budova okolo města...."}, {"51": "Já to zkusil také. Ovšem každý uvádíte screeny kdy vyjednáte odměny. Ovšem zkuste si vyčerpat možnosti na vyjednávání a objeví se okýnko že pro pokračování za menší obnos diamantů a když to křížkem chcete zrušit tak prej se to vše resetuje ... no resetuje ale všechno co jste mezi tím nabízeli i opakovaně celková vynaložená suma čehokoliv. To už je lepší to investovat do turnaje, než sázet na náhodu dohody a nic z toho pro pokračování vyjednávací náhody to chce diamanty. Už je to tady velebnosti takový systém těch automatů z 90 let nejdřív nalákat s prvotními výhry v malém a pak se náhodné štěstí ve vyjednávání rovná štěstí jak ve sportce a tak v konečném důsledku se investuje víc za méně hodnotného než investice a odměny v turnaji. A nestačilo by upravit systém vyjednávání na většinovou dohodu? Kdy by se odměny dělili 5ti a když se dohodnu se třemi tak dostanu 3/5 z odměny.[BR][BR]Ono dokážu si dokonale představit jak si ti co vymýšlí takové události jo lámou hlavu s tím jak ty hráče ještě víc a víc o to ... no o .... (chápete a dovtípíte se)[BR]A najednou systém hry když už klikneš tak začne platit zákon skládky: co skládka schvátí to již nenavrátí! Myslím vynaložené suroviny při vyjednávání a když už jednou kliknete tak musíte pokračovat a této chvíli by se to dalo považovat za hazardní hru když pro pokračování to požaduje diamanty když selže vyjednávání. A pokud okno chci zavřít křížkem tak se mi odečtou nenávratně vynaložené suroviny co jsem se pokoušel vyjednávat. Ono by se dalo říct že to samotné slovo vyjednávat je opravdu hodně podobné slovu přesnější definici této hry [smilie--sprite8].  Diamanty jsou herním produktem za který máte možnost mít nějaké výhody. No investování diamantů a mít jako výhodu další (vyjednávání) když to nedopadne je fakt skvělá výhoda no ne? Jak by řekl klasik: a to se vyplatí !!! [smilie--sprite8][BR][BR]Příspěvky sloučeny. Embla"}, {"48": "@Turunen Ano, vyjednávání se resetuje, když nechceme po vyčerpání tří pokusů použít diamanty. Ale z nějakých asi šesti truhel se mi to stalo jen jednou, hned u druhé truhly. A screenovat mne napadlo až u první brány, tak ten screen prostě nemám... Zatím to vidím líp na diplomacii, než na boj (bez efektu fénixe na level 10, to zkusím zítra)."}, {"51": "@Vicky1177  A ono by to bez těch diamantů nešlo? Já myslím že trest úměrný odměnám je odečtení daných surovin které jsem investoval do vyjednávání. To že mi to nevyšlo není moje chyba ale vygenerovaný algoritmus náhody ale více podobný jako u těch slavných automatů systém že padnou tři citrony. Pozor někteří z Vás vnímají diamanty jako virtuální měnu, věž věčnosti jsem nazval sice hazardní hrou jako takovou, ovšem můžeme si to myslet všichni ale právě díky diamantům jako produktu za peníze to hazard není. A proč? Ono totiž diamanty jsou skvělá věc jak pro hráče tak víc pro záměry jako je pochybná věž věčnosti. Diamanty jsou produkty hry které se vyrábí bez času ale za reálné peníze, ovšem v momentě kdy se z peněz stanou diamanty tak je to jen produkt skoro jako každý jiný z manufaktur, akorát že jeho hodnota je nadsazená tím jak se nastaví za co se dají diamanty utrácet. Diamanty nejsou virtuální měnou proto směna diamantů za peníze není možná protože diamanty mimo hru nemají žádnou hodnotu. Proto věž věčnosti v konečném důsledku není hazardní hra. V případě že by byla vyobrazena čistě jen částka v reálných měnách pak už by to hazard byl. Nebo v případě bitcoinů. [BR][BR]No on by se kurz pro převod diamantů na peníze vypočítat dal a ono by to i šlo. Ovšem dle úroveň zabezpečení proti zneužití plus můj názor je že innogames nikdy neudělá to že by Elvenar byl pro profi hráče, kteří se hraním živí. A to že by to šlo převod diamantů na peníze i s maximálním možným zabezpečením není ovšem myšlení že kvůli tomu že diamanty něco stojí že samotné diamanty mají nějakou hodnotu protože nemají. [BR][BR]Proto si innogames může dovolit i větší nátlak na diamanty pomocí hry a událostí a nikdy to nebude nic víc než požadavek na produkci a nikoliv požadavky na peníze i když produkt diamanty jsou za peníze."}]