[{"16": "@Emhyr var Emreis II Vzhledem k nárokům se ani nedivím.[BR]Já sám obvykle končím na první až druhé bráně ve 3. patře. Společenství končí +- tamtéž."}, {"41": "A hlavne kvuli čemu se hnát pro zlatou trofej, když za to stejne nic víc nedostaneš.. [smilie--sprite1]"}, {"24": "Tak nejde o zlatú trofej ako takú, ale hlavne o všetky odmeny z multiplayer časti. Máme v spoločenstve niekoľko hráčov, ktorí čistia každotýždenne celú vežu, takže existuje snaha zapojiť sa do takej miery, aby si mohli vyzdvihnúť pokiaľ možno všetky nimi dosiahnuté odmeny (kvôli čomu sme akurát vykonali výraznejšie zmeny štruktúry zloženia členov).[BR][BR]Zlatej trofei hodnota \"pečiatky\" za dokončenú vežu myslím si stačí (pokiaľ viem, ešte stále majú nejaký ten nápad na zvýšenie motivácie do veže v pláne)."}, {"88": "Les Misérables (W) hlásí věž hotovou  [smilie--sprite2] [smilie--sprite1] Pokusíme se jí dojet na max."}, {"46": "Cili je to jeste vice symbolicke nez ten 2h urychlovac za ucast v DS (pro pro prvnich 100).   [smilie--sprite2][BR]Asi by to uplne symbolicke byt nemuselo. [BR]A kazdopadne by se to melo zapisovat (do poradi spolecenstvi)"}, {"88": "Les Misérables (W) právě dokončilo Věž věčnosti na maximální počet bodů. Zatím jsme v tomto světě jediní, kdo věž dohrál a zároveň první, kdo jí dal na max. Už nás NIKDO nepřekoná, jen vyrovná. Tímto bych chtěl poděkovat našemu společenství. Je mi velkou poctou mít ve spolku tak úžasný lidičky [smilie--sprite1]"}, {"41": "Skvelý výkon [smilie--sprite1] Gratulace [smilie--sprite1]"}, {"5": "...a veškeré symbolické odměny, jako že dostaneme zlatou mašli... časem padne v zapomnění, tak jako slibně se rozvíjecí se DS a jeho žebříček a systém odměn....pokud se k tomu nepřidá ještě jiná motivační hodnota....jinak dílčí odměny z věže pro jednotlivce a celkové pro spolek jsou velmi kvalitní [smilie--sprite1] přesto rovněž chybí určitá rozmanitost a obměna min. v budovách: manovníky, svitky, blahovičníky atd .... přetékají již sklady!"}, {"15": "[smilie--sprite6] Co se týče Blahovičníků a pod. tak už si můžu založit arboretum . [smilie--sprite6] [smilie--sprite6]"}, {"59": "Green Jane >> Ale zase všechno to blaho kolem [smilie--sprite1]."}, {"68": "@ElfNostradamus Na to už jsem psala návrh, aby nějak upravili budovy získané z věže [smilie--sprite2] Mrkni na návrh a popřípadě podpoř,. Kdyby si mel připomínky, uvítám je..... [smilie--sprite1]"}, {"5": "Ahoj aikomi, rovněž o stejném píši vlastně již zde:  https://cz.forum.elvenar.com/index.php?threads/trh.5898/ [smilie--sprite1]"}, {"68": "Ano, děkuji, četla jsem to.  Chtělo by to, aby s tím už něco dělali. Jinak Věž je super. Odměny stojí za tu námahu. Jen až vyřeší tento problém tak se trh vrátí časem do rovnováhy."}, {"10": "Dneska nová věž a ta dává [smilie--sprite1][BR][BR]1 boj - objevila se tajemná truhla[BR]2 boj - objevila se tajemná truhla[BR]3 boj - nic [smilie--sprite1][BR]4 boj - objevila se tajemná truhla + 25 dia[BR]1 truhla - manovec, zase[BR]5 boj - nic[BR]6 boj - objevila se tajemná truhla[BR]7 boj - nic[BR]8 boj - nic[BR]2 truhla - 3x5 hodin[BR][BR]4 tajemné truhly na 8 bojů, to je mazec [smilie--sprite1]"}, {"59": "No někdy to padá často, někdy zase vůbec nic."}, {"3": "taky mi naskákalo v prvním kole dost truhel. Hned první střet, fialová truhla a džin [smilie--sprite1]"}, {"96": "Je to individuální, mně ze 6ti bojů nepadlo skoro nic užitečného, jedna ta tajemná truhla umístěná tak vysoko za branami, že na ni stejně nedosáhnu."}, {"10": "@Emhyr var Emreis II Já už chci taky džina, ještě jsem žádného neměl."}, {"3": "tak, zrovna moc jich nepadá. Věže jedu na plno a zatím jsem stavěl 4 (2x 2 - víc se stejně nevleze) a mám teď v záloze už další dva. Kouzelné obytky zatím padly dvě, dílna žádná. Pravidelně si stěžuju na to, jak mi furt z bossů padají portálové bonusy [smilie--sprite8][BR][BR]PS: u těch dzinů, je zajímavé, že první dvojice dala jen 1x 200 dia, druhá dvojice už minimálně 3x (ne každý, ale dohromady)[BR][BR]Odstraněna citace. Embla"}, {"97": "Džiny miluju, měla jsem zatím dva, ten druhý se rozjel teprve ve druhé polovině svojí existence, ale teď se to z něj sype: 200, 100, 50, 100 [smilie--sprite1] . Jenže od té doby jsem narazila jenom na jednu fialovou truhlu a z té vypadlo cosi málo potřebného, už ani nepamatuju [smilie--sprite8]. Mému milému džinovi už času nezbývá a já nevím, co si bez něj počnu."}]