[{"10": "kouzelný budovy mi padly už tři z věže, pak jsem si jednu pořídil za dia ušetřené a k tomu jednu kouzelnou dílnu. Byl to valentýnský dárek [smilie--sprite1] když byly -10%[BR]Ted mám cca 600 dia a 200 dostanu za dokončení orků, takže chci čtvrtého stavitele. A to mi 2x padlo 500 dia z akademie asi z deseti otočení kompletu, což šlo [smilie--sprite1]"}, {"20": "Džin je moc fajn, dia sice nedává tak často, ale občas padnou a pak je to příjemné. Každopádně i urychlovače se hodí, semínka a vůbec všechno. Měla jsem kliku, tentokrát mi padla obytka i Džin (vše v 1. patře), tak mám 3 krasavce [smilie--sprite2]. Jinak už nějaký ten čas hraju Věž celou a většinou vyjednávám, protože momentálně mám hafo surek i ostatních věcí, tak šetřím armádu. Ale občas, když mi to uplácení nějak nevychází, tak to tam taky pomlátím."}, {"97": "Konečně fialová bedna [smilie--sprite1] a zase portálovka [smilie--sprite4]. Asi půjdu vraždit. Dál než na 1. patro se nedostanu, při frekvenci, v jaké dole padají fialové bedny mám vymalováno na několik týdnů. Proč nám chudým trochu nepřeje štěstí?"}, {"42": "@Jirinazel na džina musíš mít jen štěstí. já jezdím 2-3 patra pravidelně od zavedení a také mi ještě nepadl [smilie--sprite2]."}, {"19": "Jj, chce to štěstí, právě mi jeden vypad s fialové bedničky ve druhém patře."}, {"97": "Fjorgyn[BR]A to má být útěcha? Ještě jsem se z toho nevyspala. A to jsem do toho vrazila jeden déšť a dva malé urychlovače. [smilie--sprite3]"}, {"42": "@Jirinazel moc to žereš to je všechno. Věž je jen loterie (kromě odměn za snahu společenství). A investovaná snaha se může i nemusí vrátit a je jedno kde se plácáš. Čili polopaticky, protože jsem nebyl asi pochopen: Ani když děláš více pater, tak nemáš jistotu, že Ti nějaký džin padne."}, {"97": "Fjorgyn[BR]Hele, lopatu si nech, budeš jí třeba ještě potřebovat a já chápu docela dobře. Po té době co hraju už to taky nežeru a na fóru nejsem denně, tak to tu se mnou ještě chvilku vydrž. Ber to tak, že se zrovna nudím a ty mě docela bavíš  [smilie--sprite1]."}, {"59": "Džin mi asi po měsíci dal fazole a ne manu, hurá [smilie--sprite1]. A čas se mu taky už krátí, to se moc nepředvedl, brilianty nedal skoro žádné, a brzy už vyšumí."}, {"3": "mě z druhé várky džinů padaly dia jak divé. Během prvního týdne každý snad 3x. No a od té doby jak když utne a už nic. A to mají půlku za sebou..."}, {"31": "Ohledně nového nastavení: to snížení času u bran vítám."}, {"2": "Jsem zvědav, na reálný dopad změn, když pro zvýšení zisku diamantů je potřeba jí dohrát celou a to pro většinu společenství, jinak na všechny společné odměny nedosáhneš, tak lidi co věž krmí i diamanty možná naopak uberou.[BR]Zarazili i studny, jsem na to vážně zvědav."}, {"98": "Rozhodně vítám posunutí času začátku a konce, snad to tak nechají, protože ve věži  jen bojuji a  ve vyšších levelech jen ručně. Ale používám různá vylepšení pro armádu (magický násobitel, osvícená střelnice atd.) co má trvání 5 dní. Takže ta vylepšení lépe využiji i v turnajích. Na vykupování mi většinou nestačí božská semínka."}, {"24": "@Patamat to posunutie sa týka iba tejto veže.."}, {"98": "To je škoda. No já věž dělám jen jedno max. dvě patra. Tři jsem si zkusil jen jednou a byl to masakr i z vylepšením armády.[BR][BR]Odstraněna citace.  Embla"}, {"99": "Menej diamantov na sólo postupe = menšia účasť. Nie každý zdolá všetky poschodia. Malo to ostať aspoň tak ako to bolo a meniť iba čas otvárania brán."}, {"16": "No přeci by nám nenechali o těch pár dia navíc, kdyby nám věž normálně pustili už v neděli.[BR]Reálný dopad změn je jasný - drtivá většina hráčů dostane z věže méně dia."}, {"77": "já to tak tedy nevidím, protože jsme ještě se spolkem neodzkoušeli, na aktualizovanou Věž šetříme, a že jsou zkrácené časy před portály, tak se mnozí z nás dostanou ještě výše, a že odměny diamantů budou vyšší u bran a více jich bude z odměn společenství, spíše vypadá, že jich bude v odměnách ve finále více, jak teď ubudou studny z měst, Věž bude ta hlavní, kde se budou diamanty moct získat a podle mě je třeba se s městem a celým spolkem na ní prioritně přeorientovat"}, {"100": "uvidíme po prvej veži, či sa to oplatí, skôr som čakal zvýhodnenie tých jednotlivcov čo hrajú do najvyšších poschodí, aby bol motív sa veže zúčastňovať"}, {"59": "Ty časy mě moc netěší, v neděli mívám čas, v pondělí až večer, navíc takhle mě to vycházelo, že většinou jsem mohl další patro odehrát v rozumné době, abych se dostal výš, pokud bude čas trvání zkrácen, nahraji toho v tom důsledku méně (docela často mě vycházel ještě čas na poslední odehrání na poslední chvíli, aby se získalo víc odměn). Pokud v tom důsledku nebudou padat odměny, spousta hráčů přestane věž hrát."}]