[{"11": "jak už píše iDavis, platí to jen pro tuto věž"}, {"59": "Dobrá, jsem to nějak nepochytil, v tom problém nevidím."}, {"46": "Na bete zacala vez normalne. Snizili odmeny dia v truhlach tak na polovinu a zvysili na 150 odmenu na vrcholu. Odmeny u 1. a 2. patra jsou stejne. Takze spolecentsvi, co udela celou vez ziska celych 50 dia navic a to se vyplati."}, {"48": "Tak toto zmatené poselství jsem naprosto nepochopila [smilie--sprite11]. Zkus to ještě jednou, podle tvého popisu totiž nevidím nic, co by se mělo vyplatit..."}, {"11": "v poslední truhle je výhra pro společenství místo 100 dia 150 Toť vše."}, {"48": "Tak tomu už rozumím. Díky... [smilie--sprite2]"}, {"101": "Ahoj,[BR]Mám dotaz. Jde hrát Věž Věčnosti týmově nebo jen jednotlivci a ty trofeje se počítají do společenství ?"}, {"3": "dohrát jde tak i tak, ale trofeje jsou pouze za úspěch společenství, jako celku [smilie--sprite1]"}, {"42": "Samozřejmě, pokud si založíš společenství, kde budeš třeba i sám, tak dostaneš odměny společenství podle bodů, které nahraješ ty."}, {"77": "To se nevyplatí hrát víc než na první patro.[BR][BR]Jinak jestli správně čtu co je v oznámení, tak by se mělo i ze závěrečných střetů v patrech získat diamantů víc."}, {"101": "dotaz jak funguje Věž věčnosti v týmu ? jak se to hraje, jak se odměňuje...[BR]Děkuji za pomoc a odpovědi"}, {"16": "@zralok73 Funguje to tak, že se sečtou body všech hráčů společenství ve věži nahrané a za to po skončení věže dostane každý člen společenství další odměny, které závisí na tom, kolik jich společenství odemknulo a také na tom, jak vysoko dojel samotný hráč (tzn. pokud společenství nahraje dejme tomu 270 bodů, členové společenství, kteří došli do poloviny druhého patra anebo výše, dostanou odměny společenství z prvních 6 odměn společenství, hráči, kteří nahrají méně, dostanou odměn méně (hráč, který vyčistí jen první souboj - nedojde ani k prvnímu časové překážce - nedostane ze společných odměn nic))."}, {"101": "Ahoj, mám dotaz ohledně odměn z věže věčnosti. Jako společenství jsme dosáhli na odměnu 50 dia a portálový bonus. Kdo tu odměnu dostane celé společenství nebo jen kdo se účastnil ? děkuji za odpověď"}, {"42": "Odměna z věže není automatická. Aby hráč dostal odměnu z věže, sám se ve věži musí dostat na ten konkrétní milník. Čili pokud člověk odehraje jednu bitvu nedostane z odměn společenství ani tu první."}, {"101": "děkuji za odpověď"}, {"101": "takže bronzová truhla je ocenění společenství, co přináší? body do žebříčku?"}, {"24": "@zralok73 nemá žiadne využitie, je to len \"nálepka do albumu\" za dosiahnutý úspech."}, {"101": "Chtěl bych se zeptat, [BR]teď jsem dal věž do druhého patra, ale s trpasličím zbrojířem a ohnivým fénixem + asi dvakrát jsem uplácel.[BR]Otázka pomůže mi kdybych přidal jednu zbrojnici mám jich tři ???? Úroveň Pulčíci, velikost oddílu 36, zbrojnice 23.[BR]děkuji za vaše názory. [smilie--sprite6]"}, {"24": "Postavenie ďalšej zbrojnice ti zvýši počet produkovaných jednotiek. Nijak ale neovplyvní ich silu, takže ak si nejaké strety riešil vyjednávaním, pretože ich jednotky to proste nezvládli, ďalšia zbrojnica to nijak nevyrieši.[BR][BR]Vo všeobecnosti je ale známe, že jednotiek nikdy nie je dosť, takže pristaviť zbrojnicu zmysel určite má (ja mám 4 a po dokončení ambasád plánujem počet zdvojnásobiť)."}, {"102": "Chci poděkovat za rady ohledně věže  [smilie--sprite1] s fénixem a trpasličím zbrojířem se mi povedlo už 2x vybojovat celou věž a přišel Jsem jí na chuť za což vám díky a snažím se už nějakou chvilku přesvědčit i lidi v klanu,že je to opravdu přínosné a už se i několik hráčů přidalo a očekávám,že se přidají postupně i ostatní ..je to znát na výkonech celého klanu ..tak díky[smilie--sprite2][smilie--sprite1]"}]