[{"59": "hanz44 >> No pokud se dostatečně zapojí celá aliance, která využívá všech výhod odměn, tak se to určitě vyplatí, samozřejmě pro ty, kteří něco nahrají, protože odměny jsou úměrné výkonu. Na druhou stranu pro jednotlivce je zisk dost odvislý od štěstí, což se někdy ukazuje v trochu negativním světle, že padají přesně odměny co nejsou potřeba. Mě třeba poslední dobou ve velkém padají teleporty a portálové bonusy (úlomky a součástky sady lunární knihovny neberu jako odměny)."}, {"102": "@Pauleo Dlouhou dobu Jsem hrál jen první patro,ale @Ladus měl pravdu ve všem co říkal [smilie--sprite1]zkusil Jsem to a díky tomu Jsem posunul svou vlastní hru o lvl vejš [smilie--sprite1]"}, {"59": "hanz44 >> Tak on se zisk změnil především přidáním odměn pro společný postup. Do té doby jsi při občasné každodenní smůle mohl častokrát udělat věž celou, a nedostat téměř nic, padla ti se štěstím jedna, někdy dvě modré truhy, z kterých vypadl nějaký malý urychlovač, a to bylo celé. Takhle máš smůlu podchycenou aspoň společnými odměnami, které jsou jisté. Na druhou stranu, někdy se poštěstí a padne zbrojíř nebo pár 5h časovačů, a to už je daleko lepší."}, {"93": "Pravda že s teleportama a portálama se fakt roztrhnul poslední dobou pytel. Občas mi padla dílna, několikrát obytka,asi 8 džinů, je to opravdu o štěstí, někdy padnou dobrý ceny a někdy celá věž stojí za vyliž %+=?. Spousta zesilovačů asi za 900h, ty se hodí ale ještě víc smetí v podobě úlomků který sou naprd.[BR]Ale dělám jí pravidelně celou."}, {"102": "[smilie--sprite1]@Pauleo dlouhou dobu mi bylo líto armády a surek na výkup a tak Jsem jel jen jedno patro a byl Jsem přesvědčenej,že hrát věž víc nemá smysl ,ale má[smilie--sprite1]"}, {"59": "hanz44 >> Tak ono taky záleží v jaké fázi hry jsi, popř. na stavu budov podporujících boj. Ten kdo nemá obživlé zboží je na tom o něco lépe, dnes už je tolik budov na surky, že většinou se základními nemá problém, a obživlé to po něm nechce. A někdo kdo není zase na úplném konci hry (což spíš platilo, když už je tu nová kapitola), tak např. obživlé potřebuje po statisících, a ne ho uvalit ve věži. Stejně tak kapitoly náročné na fazole nebo orky asi moc na vyjednávání nebudou."}, {"102": "@Pauleo hraju už skoro tři roky a ve věž Jsem neměl důvěru a díky pár lidem tady Jsem změnil názor a to mi dalo dost a děkuji jim za to  [smilie--sprite1] 2x Jsem teď věž vybojoval celou a nemusel nic vkupovat a ještě Jsem si zvedl armádu a zvládl v pohodě i turnaj [smilie--sprite1]Sice jelikož to ještě není v mém společenství zrovna populární součást hry a většina jede právě jen to první patro tak nedostanu po skončení tolik urychlovačů co dostanou společenství která věž dokončují celou pravidelně ,ale i tak s tím Jsem spokojenej a vidím v tom pro celej svůj klan potenciál .Jsem u Ambasád a s živelnou se sice potýkám,ale tak nějak mám vše co potřebuju a ještě dokážu i pomáhat lidem v klanu,takže mě věž neomezuje ani kdybych musel sem a tam něco vykoupit[smilie--sprite1]"}, {"59": "hanz44 >> Hrál jsi jen s Felixem bez dalších budov a na automat? Ono taky dost záleží jaké tam jsou souboje, někdy mi přijdou jako dost lehké, a jindy docela blbé kombinace."}, {"102": "@Pauleo Fénix a trpasličí zbrojíř mi stačili a někdy ty kombinace jsou fakt divný,ale dá se to vymyslet a někdy jsou u některých bojů i větší ztráty,ale komplexně se to furt vyplatí ..z urychlovačů pak po skončení turnaje a věže nadělám armádu novou [smilie--sprite1] Ztráty nejsou ve věži nakonec tak drastické jak Jsem se bál,že budou a říkám ..mě se to vyplatilo zatím a vyplácí a začla mě věž bavit ,ale jak to mají ostatní nevím ..mám přehled trochu jen o lidech u mě v klanu [smilie--sprite1]"}, {"59": "hanz44 >> Tak zbrojíř dělá hodně, ale některým skoro nepadá, takže ho spíš šetří na některé turnaje. Já některé turnaje hraju bez ničeho, a pak je věž celkem náročná na boj. Myslím když vyprší Felix, a nemám žádné pomocné budovy. Jinak aby sis nemyslel, od začátku jsem tady spíš ten, kdo věž propagoval, že je zajímavá."}, {"102": "@Pauleo tak Já si neustále něco vyrábím v řemeslné ..málokdy se stane,že nevyrábím  [smilie--sprite1]Turnaje jsou některé lehčí a některé těžší,no,ale ještě nedávno Jsem jel jak už Jsem říkal pouze 1.patro ve věži a zbrojířů Jsem pár nachytal,ale nepoužíval Jsem žádné pomocné budovy ani v turnaji,takže se mi nahromadili a mám dost širokej výběr pomocných budov.Zbrojířů mám ještě dost na několik věží a zas nějaké snad nachytám ..[BR]Byl Jsem dost skeptickej co se týče věže a nevěřil Jsem ,že to tak jde,ale nedalo mi to a zkusil Jsem to a od té chvíle si to pochvaluju[smilie--sprite1] a ventiluju to i v chatu klanu a světe div se,ale podáváme najednou lepší a lepší výsledky,takže to už některé lidičky v klanu chytlo a to je moc dobře ..dobrej začátek po delší stagnaci[smilie--sprite1]"}, {"59": "hanz44 >> Taky hodně řemeslničím v akademii, ale pomocné budovy tam téměř vůbec nejsou. Zbrojíře nějaké nastřádané mám, ale ty si nechávám na klíčové turnaje, ze kterých se dá vymlátit hodně VB, ty jsou mi stále milejší než dohrát věž za každou cenu zcela do konce. Ve věži většinou končíme jako společenství na předposledním až předpředposledním bodě. Hlavně ty odměny na konci nejsou úměrné úsilí, takže spíš jde o společné odměny, kterých ale musí dosáhnout většina společenství. Džinové jako budova stojí celkem za prd, už jsem jich měl pět, a nic kloudného kromě občasných fazolí nepřinesli, takže dalšího bych asi ani nestavěl, zato zbrojíř, to je jiná."}, {"102": "@Pauleo tak ona ta řemeslná je o náhodě ..někdy čekáš na urychlovače nebo na krmení třeba i týden a pak zas potřebuješ něco jinýho a zas týden nic ..to tak je  [smilie--sprite1] To je normální .. Máte šikovný klan,když jedete takhle pěkně věž ..chválím a snad časem to půjde i u nás [smilie--sprite1]"}, {"59": "hanz44 >> To ano, ale pytlík s bobulemi padá celkem často, spíš se divím, když se někdy neobjeví. Stejně tak ostatní jako 100% zásob, VB, body do divů a urychlovače. Pomocné budovy padají velmi málo, je to spíš zázrak, když se nějaká vůbec někdy objeví, dokonce mi přijde, že pak je najednou všech pět polí plných užitečnsotí, z toho usuzuji, že se asi o kdovíjakou náhodu nejedná, sic algoritmus neznám [smilie--sprite1]. Tak ať se daří ve společenství."}, {"102": "@Pauleo tak Já dělám vše vždy nenásilně ..chci aby k tomu ,že je hraní věže stejně jako turnaje  dobré .. aby k tomu dospěli sami  a bez nucení je do toho[smilie--sprite2] [smilie--sprite1][BR]Pouze jim vždy nastínim výhody které to přináší a pak už je to jen na nich[smilie--sprite1] ..řemeslnou beru jako celkem v pohodě ..sem tam tam je co chci a když není tak beru požehnání na mince a zboží[smilie--sprite1] a díky a ať se daří i vám [smilie--sprite2]"}, {"3": "Martelan napsal/a:\t\t\t. Občas mi padla dílna, několikrát obytka,asi 8 džinů, je to opravdu o štěstí\t\tKlikněte zde pro zvětšení...za tohle mám chuť někoho zabít [smilie--sprite8] Na dílnu zatím marně čekám, kouzelný barák 3x a džin prozatím taky 8x"}, {"92": "Obaja ste na tom viac než dobre. Mne doposiaľ padol iba 1 džin."}, {"3": "a jezdíš pravidelně celou věž?"}, {"16": "@Emhyr var Emreis II Při té pravděpodobnosti je to dost o náhodě. Asi vám napadali ti jeho chybějící džinové."}, {"3": "tak, věž je tu někdy od podzimu, takže to znamená 1 džin měsíčně. To znamená každou 4 věž. Když připočtu v průměru jednu fialovou truhlu na věž (asi jich je ale míň...), tak máš pravdu, jsme spíš ti šťastnější."}]