[{"16": "@Emhyr var Emreis II Džin je 10% z poslední bedny (+ něco málo navíc z mystické). Průměrně tedy 1 co 2 měsíce. Kdo jich dostává více, je šťastlivec."}, {"3": "tak to jo, myslel jsem, že 5 %. V tom případě jsem v průměru [smilie--sprite1]"}, {"92": "Emhyr var Emreis II napsal/a:\t\t\ta jezdíš pravidelně celou věž?\t\tKlikněte zde pro zvětšení...Samozrejme. A aj ten jediný mi padol z fialovej truhly a nie za 3. poschodie."}, {"59": "Tak ona šance že vypadne z fialové truhly je podle mě znatelně vyšší (nebo aspoň u mě to tak platilo), přesto nemusí dlouhodobě vůbec padnout nikde. Jen aby vám pak ten džin plnil jen ta vaše vysněná přání, což u mě nějak nefungovalo, téměř vždy padala mana, asi nějaká podstrčená rozbitá náhražka džina."}, {"3": "pravda, z poslední truhly byl džin tuším 2x (určitě ale hned poprvé, co jsem věž dojel [smilie--sprite1] ), jinak všechno z fialové. Jednou dokonce hned po prvním střetu v prvním patře [smilie--sprite8][BR][BR]a těch cca 500 dia ten džin nakonec vždycky přinese. Za těch 100 dní minimálně 1x 200 dá, cca 2x 100 a 2x 50 tam bude."}, {"41": "Ja taky doted dostala Džina jen jednou [smilie--sprite1]) Ale je pravda, že jsem Vež dokončila až do konce možná tak 5x jenom [smilie--sprite1] Ale zdá se mi,že mi padl z fialové truhly [smilie--sprite1]"}, {"59": "Emhyr var Emreis II >> No to nevím teda, 200 briliantů jsem viděl tak jednou, a džinů jsem měl pět, a i ty ostatní hodnoty téměř nepadaly, to když vezmu čtyři studny, které jsem měl teď naposled, tak za každý výběr mi 25 briliantů padlo skoro vždy, spíš jsem se divil, když ne, a někdy ne až tak často dokonce ze dvou. Asi ty džinové u mě byli vážně nějací zakletí."}, {"101": "Taky děkuji za rady ale zatím jen druhé patro snad se mi to podaří už brzy"}, {"20": "Já měla období, že mi Džin padal celkem dost, jednou 2x za jednu Věž. Od té doby nic. No ještě mi 4 krasavci okouzlují město.[BR]Když dostanu v posledním střetu dia, tak je to vlastně víc, než by mi dal Džin. Takže z Věže vždycky nejradši beru  pěkně na ručičku. Ale Džin je taky fajn, občas z něj padne i urychlovač atd."}, {"24": "Ja by som bol rád za kouzelné obytné budovy. No za celý čas, čo vo veži existujú, mi nepadla ani jedna. Namiesto toho mi za posledný mesiac padla 3x kouzelná dielňa, ktoré sú mi ale nanič, keďže v meste ich mám 6 a nijak tento počet neplánujem navyšovať (možno jediné na čo budú dobré budú ušetrené plánky, keď namiesto vylepšovania súčasných dielní do ambasád ich nahradím tými novými).[BR]Džinov mám dokopy štyroch, z minulej veže sa podarili dvaja."}, {"15": "To se tak někdo má . Už to hraju dva roky a Džin ani jeden . Asi jsou v karanténě v Džinistanu .   [smilie--sprite6]"}, {"59": "Teď mi asi ze všeho nejvíc udělá radost zbrojíř a nebo obytka kouzelka."}, {"103": "Já pravidelně dělám dvě patra věže a mimo jiné už mi to přineslo 4 kouzelné obytky a 3 dílny, což mě fakt těší. Jako společenství taky děláme dvě patra, takže výnosnost dost dobrá, hlavně ty urychlovače. Uvažovali jsme, že zkusíme společně dojet na konec, ale zatím jsme se k tomu neodhodlali."}, {"59": "Poslední bod je už celkem oříšek, tam už se musí zapojit většina a dojet do konce."}, {"5": "Džini z věže asi celkem rovněž 8ks postupně...odměny 2xdenne velmi slušné.[BR]Vyzkoušel jsem odpojit některé divy z cesty, ale počty protivníků i moje se nezměnily... Takže buď je to tak chytré, že by se musel nějaký div asi až zbourat a tím to vyzkoušet nebo tam ten počet levelů divů nemá větší vliv na velikost a obtížnost postupu ve věži."}, {"20": "@ElfNostradamus také se mi nezdá, že by divy měli větší vliv na Věž. A pokud ano, tak minimální."}, {"45": "...je niekolko pokusov urcit vzorec na vypocet velkosti oddielov supera vo vezi. Vsade sa pocita s poctom lv. divov. No ci to dokazal niekto odhalit, tak to neviem posudit. Tu je link na jeden z nich...[BR][BR]\t\t\thttps://minmaxgame.com/spire-squad-size-model-v4-0/\t\t"}, {"19": "Prosté odpojení divů od cesty nebude mít vliv, jelikož se tím nezmění ani celkové skóre, tudíž systém hry s nimi nadále počítá."}, {"59": "A když se odpojí divy od cest, tak to sníží úroveň divů? To se mi nezdá, ta je daná aktuálním vylešením."}, {"20": "Když se div odpojí od cesty, tak se za něj odečtou body a div přestane být funkční. Takže jakoby nebyl postaven."}]