[{"59": "Určitě? Body myslíš úroveň prastarých divů? Protože body v žebříčku se neodečtou, takže ne zcela jakoby nebyl postaven. Dost pochybuji, že jestli bylo nějak potvrzeno, že úroveň divů hraje ve výpočtu roli, že stačí odpojit od nepotřebných divů cestu. Budovy osadníků taky nejdou odpojené používat, ale hra o nich např v úkolech ví a počítá.[BR][BR]Jinak úroveň prastarých divů po odpojení opravdu klesne, zkoušel jsem teď na mobilu. Otázka je, jak je přesnou definici pro výpočet z divů vývojáři použili."}, {"20": "@Pauleo, já když přeruším cestu k divu, tak se mi body za div odečtou a zmizí i funkce divu. Dokonce se odečtou i úrovně divů - např. v Tržišti, kde je bonus ke sběru, kde se násobí úroveň hl. sídla * úrovně divů. Zkoušela jsem to několikrát, takže to vím jistě. Jen množství surek chtěných za střet ve Věži se nezmění.[BR]Řekla bych, že úrovně divů na Věž opravdu nemají vliv.  A to, že to potvrdil moderátor na betě ... vzhledem k tomu, že tvůrci hry tuto informaci nezveřejňují, tak bych mu nevěřila.[BR]Určitě má vliv herní kapitola, možná i počet rozšíření, uvažovala jsem i o získaných provinciích, ale nejsem si jistá."}, {"59": "No např. z žebříčku se body neodečtou, to jsem zkoušel. Úroveň divů se odečte, kontroloval jsem přes termální prameny, které úroveň zobrazují. To že funkce chybí beru jako jasnou, výrobní budovy také nevyrábí, takže přestane i bonus. Každopádně se tu bavím hlavně o boji, zda se náročnost týká i vyjednávání nevím, další věc je kdy se nároky generují, zda to nějaká rozpojená cesta dokáže v reálném čase měnit. A hlavně s těmi divy zde padla někde zmínka už dřív, jen si už nepamatuji kdo to vynesl, popř. jaké informace při spouštění věže to pronesly, jen si pamatuji, že jsem to tu četl, proto jsem se velice divil, že by to mělo být jinak. Navíc mi přijde, že věž mám stále čas od času těžší na boj co se ztrát týče, a musím si pomáhat budovami, přitom oddíly nezkoumám, ale divy vylepšuji dost."}, {"20": "Mě se po odpojení divu body do žebříčku odečítají. Dokonce, když vypojím Trůny, veškerý efekt je pryč a body taky."}, {"78": "\"Pravdu máte vlastně oba. V appce se udaje (odpočet bodů) při odpojení divu neodečítají. Ovšem v Pc se odečtou. Osobně vyzkoušeno, protože já většinou funguji na Pc."}, {"59": "U trůnů je to funkce, tam bych to nepočítal. Jinak je to asi jak píše nataly111, normálně hraju na PC, ale teď jsem to zkoušel na mobu, tam se to neodpočítává."}, {"20": "Já hraju na PC, tam je to zřetelně vidět.[BR]A už proto divy nebudou mít na Věž nějaký zvláštní vliv, protože stačí odpojit a je to. Div jakoby nebyl.[BR]Kontrolovala jsem nejen cenu za výkup, ale i velikost oddílu. Odpojila jsem vlastně všechno ve městě, změna v cenách ve Věži a velikost oddílu nezměněna.[BR]Myslím, si, že náročnost Věže je dána prostě něčím, co nemůžeme tak snadno ovlivnit. Co tedy zbývá? Velikost oddílu, dosažená kapitola, počet rozšíření, pokrok na mapě světa a co já vím ještě. Ovšem výpočet bude určitě složitější. Něco z těchto proměnných může náročnost snižovat a něco naopak zvyšovat. Dokonce si myslím, že pravidelné hraní Věže až nahoru má na to taky vliv. Ale to jsou jen domněnky. Je prostě zajímavé, že i když mám Věž náročnou, hraje se mi ve velkém městě daleko snadněji, než v menším. V menším je to chvílemi nebojovatelné ani s Ohnivákem. Takže častěji musím smlouvat. Ve větším městě to většinou pomlátím bojem."}, {"3": "hlavně je možné, že se náročnost vypočítá před startem věže a v průběhu se už nezmění... chtělo by to vyzkoušet za stejných podmínek ve dvou po sobě jdoucích věžích..."}, {"20": "@Emhyr var Emreis II - na to už jsem taky myslela, možná to někdy zkusím."}, {"59": "No to je to co jsem psal, že není jasné kdy se nároky pro věž generují, navíc by to chtělo zkusit nějaký div např. vylepšit, stále není 100% důkaz, že odpojený div je zcela neaktivní i pro věž. A porovnat hlavně velikosti oddílu, ty mě zajímají především, protože kdyby to bylo lépe bojovatelné, tak raději bojuji. Takže přesně, musely by se porovnat dvě věže bez jakýchkoliv jiných změn ve městě (předpokládám, že se podmínky pro určitý bod ve věži za tu dobu nezmění), a jen se změnou divů, ideálně něco vylepšit nebo přistavět."}, {"42": "citellus napsal/a:\t\t\t...je niekolko pokusov urcit vzorec na vypocet velkosti oddielov supera vo vezi. Vsade sa pocita s poctom lv. divov. No ci to dokazal niekto odhalit, tak to neviem posudit. Tu je link na jeden z nich...[BR][BR]\t\t\thttps://minmaxgame.com/spire-squad-size-model-v4-0/\t\tKlikněte zde pro zvětšení...[BR]Toto jste přehlédly nebo neumíte ani trošku anglicky? [smilie--sprite1]"}, {"20": "@Fjorgyn četla jsem to, ale jednu podstatnou věc v uvedeném vzorci nevidím: ono ani tak nezáleží na tom, jak je velký oddíl nebo jaké jsou požadavky na smlouvání. Podstatná je schopnost hráče to zvládnout snadno nebo s potížemi. V menším městě mám podstatně méně divů, rozšíření atd., ale Věž mi tam dá daleko víc zabrat, než ve větším městě, kde je to zcela naopak. [BR]Věž mi poněkud připomíná náročnost při získávání provincií - zelená, žlutá, červená. Tím netvrdím, že je to stejné. Stačí ve výzkumu udělat vylepšení manufaktur, pak nějakou vylepšit a barva provincií na mapě se změní k lepšímu. To se samo týká i velikosti oddílu atd. Sice je všechno dražší, ale schopnost kupovat i vybojovat je lehčí, protože se vylepšily zároveň možnosti hráče. [BR]Pokud by znamenalo, že novým rozšířením, výzkumem a vylepšením divů se automaticky stává Věž těžší, tak by za chvíli byla nehratelná. Jde to ruku v ruce s tím, že i schopnost hráče se těmi všemi věcmi také vylepšuje. A daleko podstatnější, jsou podle mne, ty vylepšující faktory, Tedy vše, co dělá hráče silnějším."}, {"77": "První co bych odzkoušela je pokrok ve výzkumu, podle mě bude to hlavní a jediné, co má na Věž vliv, a to jak na výkup, tak i na boj. Na výkup nejspíš výzkum na mnf a na boj nejspíš vylepšení velikosti oddílu. Co se týká boje ve Věži vs. výzkum vylepšení velikosti oddílu, zajímalo by mě, jestli když na turnaje je lepší nezkoumat, zdali třeba \"zkoumat\" nebude zas lepší na Věž. [smilie--sprite1] Něco mi totiž říká, že právě hráči, co \"nechtěně\" vyzkoumali slepé větve vylepšení oddílu a mají to tedy na turnaje dražší/ těžší, si celkem na boje ve Věži libují, narozdíl ode mě, která to \"nezkoumání\" celkem podchytila a ve Věži mám tak početné protivníky že bych dala tak jedno patro a přišla o tolik vojáků co potřebuji na turnaj na 1*/40 provincií - jedu jen na automat. Jinak s těmi divy se mi to nezdá, že by měly nějaký na Věž vliv, jak na něco takového vůbec někdo přišel? ..a podložil to něčím \"hmatatelným/viditelným\"? ještě jsem nečetla ani neviděla nic, co by mě nějak přesvědčilo, tedy zatím jen samé domněnky bez důkazů."}, {"59": "luterina >> Důkazy nejsou, já to čerpal pouze z toho, že to tu někdo kdysi zmiňoval, že by to tak mělo být, víc si nepamatuji, tak jsem na to přišel já. To co ty nazýváš pokrokem ve výzkumu ale např. u normálního boje provincií znamená pokrok na mapě. Nějak se mi nezdá, že by na velikost nepřátelských oddílů měl např. výzkum čehokoliv. Kapitola by teoreticky mohla, ale zase za tu dobu co věž běží jsem ve hře moc nepokročil co se kapitol týče, a věž mi přijde na boj rozpoznatelně těžší než mi přislo na začátku, ale jsou to zase jen domněnky a moje pocity (dám pár soubojů, a jednotky mám vyřízené, ztráty jsou dost velké, a musím dost natrénovat, abych si vůbec souboj mohl dovolit, zatímco ztráty si dovolit nemůžu, abych o vše zase nepřišel, to u turnajů nemám). Teoreticky by šlo počítat z např. počtu vyzkoumaných provincií, sic moc nechápu proč by logicky tato hodnota měla ovlivňovat počet nepřátelských oddílů věže (i když v Elvenaru je možné naprosto vše), u mapy to logické být může, ovšem to není výzkum. Důkazy budou až to někdo dokáže, což já určitě nebudu, protože např. ve výzkumu jako na začátku nové kapitoly toho asi moc nedokážu, navíc nepovinné oddíly jsem nezkoumal, takže by to opět teoreticky mohlo být jak píšeš. Ona věž je celkově záludná, že boje se oproti turnaji skládají z několika soubojů, které se kolikrát na jednotky vylučují, což v turnaji není."}, {"16": "Tady je poslední model od MinMaxGamer:[BR]\t\t\thttps://minmaxgame.com/spire-squad-size-model-v4-0/\t\tNic lepšího nemáme.[BR][BR]Dle tohoto aktuálního modelu mají negativní vliv na věž: [BR]Počet povinných výzkumů (stejný pro hráče na konci výzkumu)[BR]Počet úrovní divů (významně se liší pro hráče na konci výzkumu - jsou hráči s počtem pod 100 a hráči, kteří jich mají 500+)[BR]Počet prémiových položených rozšíření (za dia)[BR]Počet neprémiových položených rozšíření (z výzkumu i z mapy, včetně počátečních na začátku hry)[BR][BR]Vliv divů na věž byl potvrzen i Innem - prý nejmenší, ale když spolu dostatečně dlouho násobíte malá čísla, nakonec vyjdou čísla velká - viz. ohromné rozdíly mezi počtem a úrovní divů mezi hráči.[BR][BR]Samozřejmě jediní, kdo ví, jak moc přesná nebo nepřesná ta formule je, jsou vývojáři Inna (a možná další zasvěcení), ale ti se s námi o tu formuli nejspíše nepodělí."}, {"28": "@luterina @Pauleo Jak píše @Lovec Krys , vliv divů na Věž potvrdil CM z bety a já nemám jediný důvod mu nevěřit. Sami se o tom můžete přesvědčit zde [smilie--sprite1]"}, {"20": "@Lovec Krys , @Angedev - možná, že nějaký malý vliv na náročnost Věže počet lv. divů má, ale řekla bych, že účinek např. bojových divů rovnováhu vychýlí nakonec do pozitiva. A kolik mám navíc surek, lidí a vůbec všeho díky divům, zase převáží vše do plusu.[BR]Samozřejmě, že vývojem ve hře jsou např. i turnaje a provincie stále náročnější, ale právě díky všemu, co je tu vyjmenováno jako ztížení Věže, se zároveň stáváme silnějšími hráči. Takže v konečném důsledku na zvládnutelnost Věže všechny tyto věci nejsou až tak podstatné. Když porovnám město v Ambasádách a město, které mám v Dracích, tak hratelnost Věže je naprosto jiná. A podle uvedených věcí bych měla být v Dracích ve výhodě, ale zřetelně nejsem. Takže je tam ještě nějaká proměnná, která reaguje na něco dalšího ve městě, co se v uvedeném vzorci nenachází."}, {"48": "Tak si to přeložíme  [smilie--sprite2]:[BR][BR]Obtížnost Věže je založena na mnoha faktorech, úrovně AW (divy) jsou zdaleka nejmenší z nich. Jejich vliv je velmi malý, ale ano, jak postupujete ve hře, s tím stoupá obtížnost Věže a úrovně AW jsou jen jedním z mnoha parametrů (jak bylo řečeno: ve skutečnosti nejmenším), podle kterých se počítá..."}, {"59": "Nevím z čeho čerpal zdroj, aby sestavil ten vzorec, a hlavně např. by mě zajímalo zda se např. Ludi v tom vzorci vidí (?). Výzkum teda nesedí, tam je to přesně naopak, divy údajně zanedbatelný vliv, rozšíření bych spíš viděl ve prospěch menšího města, což zase teoreticky nesedí, takže rozdíl je pouze v možnostech armády, popř. zdrojů? Zkušenosti stejné."}, {"20": "@Pauleo právě že ten vzorec mi v praxi nesedí. Dle toho vzorce bych na tom měla být lépe ve městě, kde jsem na tom s hratelností Věže hůř a tam, kde bych podle vzorce na tom měla být hůř, jsem na tom v praxi lépe [smilie--sprite2]. A moc ráda bych zjistila, v čem to skutečně je. [smilie--sprite6] Navíc Věž není vždy naprosto shodně postavená - co se náročnosti týče. Někdy je celkem lehká, a jindy těžší. Skoro bych řekla, že je poněkud náladová. Ale i to bude mít svůj důvod."}]