[{"24": "Tá formula na tej stránke je výsledkom akéhosi pozorovania na beta fóre a zhrnutia štatistík viacerých hráčov, tak verím tomu, že dôveryhodná môže byť."}, {"16": "@Pauleo Hlavní problém té formule je v tom, že se všechny ty parametry násobí. Takže stačí, aby některý z nich dostatečně narostl a zdražení věže se stane významné.[BR][BR]Např. když srovnám svoje město na cz1 vůči betě, tak mám o 50% vyšší náklady. Rozdíl ve vyzkoumaných technologiích je minimální (beta 2-3 pozadu). Rozšíření mám cca o tucet více na cz1 a úrovní divů mám cca o 150 více na cz1.[BR][BR]Cituji hráče CrazyWizard z anglického fóra:[BR]\t\t\tAs you can see these 3 variable are multiplied, change 1 variable and that change is multiplied by the other 2 variables[BR]I think this formula is inherently flawed as it is easy to create a runaway scenario.[BR][BR]In fact on 1 of my accounts I am already in this situation, it's a chapter 4 account with many premium expansions and it's unable to manufacture enough T1 goods for the spire, even when I am running 14 maxed out manufactories.\t\tKlikněte zde pro zvětšení...Neboli stačí aby si hráč v nízké kapitole koupil spoustu prémiových rozšíření a zdraží si věž tak, že je pro něj na nějakou dobu v podstatě nehratelná.[BR]Toho samého lze docílit dostatečným počtem úrovní divů, díky násobící formuli se i malý vliv může při dostatečném počtu úrovní divů stát velkým (bavíme se o stovkách - 100 nebude tak hrozné, ale 300 už poznat půjde a takových 600 to zdraží velmi výrazně).[BR][BR][BR]ps: Nová verze modelu výpočtu pro věž: https://minmaxgame.com/spire-squad-size-model-v5-0/[BR][BR]Cituji část k divům (beze změny oproti předchozí verzi):[BR]\t\t\tAW term is (0.003A+1), meaning that for every ~333 AW levels you get 1x Spire SS increase. E.g. if your Spire SS with no AWs whatsoever is 1x, then adding ~333 AW levels will double it to 2x, ~667 AW levels will triple it to 3x and 1000 AW levels will quadruple it to 4x.\t\tKlikněte zde pro zvětšení...Tzn.: Každých 333 úrovní divů (včetně aktuálně vylepšovaných) vzroste velikost nepřátel a cena ve věži o 100% (až na 400% při 1000 úrovních).[BR]Tolik tedy k malému vlivu - když je jich dostatečný počet, tak se to vynásobí do pěkně velkých čísel."}, {"20": "U divů na 600 lv. by znamenalo mít např. klášter na 30 lv. a všechny bojové divy hodně vysoko. Takže vzrůst náročnosti Věže v takovém případě nehraje v podstatě roli. A o tom to celé je. Samozřejmě, že takový hráč musí mít Věž o něco těžší, aby ji neprocházel až moc jednoduše. Podle mé zkušenosti je daleko důležitější to, co dělá hráče silnějším, než hlídat to, co mě znevýhodňuje. K čemu mi je, že v menším městě mám podle toho úžasného vzorce všeho toho, co Věž zhoršuje, podstatně méně než v městě velkém, když praktická hratelnost je ve větším městě naprosto v klidu a v menším je to fuška. Jasně, že mám ve větším městě všechno dražší, ale jsem ve výzkumu dál a zvládám to dobře. Ale postupně na tom pracuju i na menším městě a zlepšuje se to [smilie--sprite1]. Je to jednoduché. V podstatě co mě posiluje v turnaji, to mě posiluje i ve Věži. Cena střetů a velikost oddílu není rozhodující. Nepřátel se nebojme, na množství nehleďme [smilie--sprite2]. Navíc Věž sama poskytuje nápovědu co na ní platí díky Zbrojíři. Prostě jde o to mít víc výhod než nevýhod. Srovnat krok s Věží co se týká surek i vojska. Na turnaj hráč také potřebuje určité možnosti výroby a výcviku. Pokud chci hrát Věž i turnaj naplno, musím tomu přizpůsobit vše, co mě zvýhodňuje. A na to potřebuji divy, rozšíření atd.[BR]Jiná situace je ovšem tam, kde chce někdo postavit malé město, které by bylo vyladěné na Věž. Ale to se mě netýká."}, {"16": "@Ludi Samozřejmě, že hraje - ty parametry se násobí a trojnásobně drahé není o něco těžší.[BR]A zbrojíř ti rozhodně nepadá každý týden.[BR]Problém s násobícími se parametry je, že od jisté úrovně tu vzrůstající obtížnost prostě nemáš čím vykompenzovat, protože všechny existující možnosti a triky jsi už použila předtím.[BR]A časem se tam dostaneme, že se začnou objevovat hráči, kteří budou mít velká maximálně efektivní města, ale obtížnost věže jim prostě přeroste přes hlavu.[BR]Problém již existuje, jen zatím ještě není moc vidět, protože zatím ten nárůst obtížnosti jsme schopni ustát, ale to časem přijde.[BR]Nejde o to, že teď máme možnosti, jak nárůst vykompenzovat, ale zejména o to, že krok po kroku se dostáváme do stadia, kdy hráči na konci výzkumu nebudou mít jak vykompenzovat vzrůstající obtížnost věže, cokoliv udělají jim situaci zhorší.[BR]Jako první nastane problém s cenou výkupu v mincích a kladivech - jejich množství je zastropované, a v závěsu nejspíše s cenou výkupu semen - jejich produkce je asi nejomezenější ze všech rozpadajících se surovin."}, {"20": "@Lovec Krys - já mluvila o Zbrojíří v souvislosti s tím, že ukazuje na to, co platí na Věž. Nepadá každý týden a ani ho každý týden nepoužívám, není třeba. Chce to prostě pořádně vylepšovat klášter a podobné věci. Alespoň mě to pomáhá. Surky, mince, kladiva i semínka - u mě bez problémů. Ale také se snažím mít ve skladu nějaká ta kouzla na doplnění mincí i kladiv pro případ ztroskotání. To mi spíš hrozí, když doplňuji urychlovačema vojsko. [BR]Prostě to s Věží nevidím tak pesimisticky. Navíc by mě zajímalo, z jakého základu se vypočítává to případné zdražení o 100%. Prostě to určitě nemusí znamenat, že všeho bude skokově 1x tolik.[BR]Pocítila jsem jasné zdražení Věže, když jsem ve výzkumu vstoupila do poslední kapitoly. Nejdřív mě to zaskočilo, ale zjistila jsem, že praktická hratelnost není horší. A to to jde."}, {"59": "Lovec Krys >> Pokud se vše násobí, tak ani divy nejsou vůbec zanedbatelné, jak se tu psalo.[BR][BR]Ludi >> Klášter mám zatím na 16 a mám i nějaké další divy na boj, ale i přesto mi přijde, že bez zbrojíře a jim podobných jsou ztráty tak vysoké, že se mi vyplatí spíš vyjednávat, s turnajem problém není."}, {"16": "@Pauleo Ony jsou zanedbatelné, když jich je málo, ale když jich jsou stovky, tak už zanedbatelné nejsou.[BR][BR]@Ludi Těch 100% je dle toho, když budeš mít ostatní parametry stejné a přidáš úrovně divů. Např. když by jsi zbourala divy a snížila jejich úrovně ze svých 412na 112, měla by ti klesnout velikost nepřátel (a tedy i cena výkupu) +- na polovinu. Když přidáš dalších 300, tak se ti věž výrazně zdraží, ale to posílení už ani náhodou nebude takové, aby ti obtížnost zůstala stejná.[BR]Prostě není to o tom, že při 300 úrovních to už bude nehratelné, ale při růstu všech parametrů do budoucna to je problém (asi podobně jako když cena výkupu v turnaji roste s povinnými výzkumy armády rychleji než produkce manufaktur a ve vysokých provinciích tak není problém utratit několika hodinovou produkci manufaktur v jediném souboji). Bavíme se samozřejmě o průchodu věže až do konce."}, {"20": "@Lovec Krys já to všechno chápu, jen mi připadá zvláštní, že ten uvedený vzorec se tu bere jako nezvratná jistota. Já tomu vzorci prostě moc nevěřím, protože v mých městech nefunguje. Na CZ2 hraju celou Věž pravidelně každý týden už dlouho. Když prorovnám jak se mi hraje na CZ2 a na CZ1, je to nesrovnatelné. A přitom podle paramatrů vzorce by mi Věž na CZ1 měla jít daleko snáz, než na CZ2. A je to přesně naopak."}, {"28": "@Ludi myslím, že tady uniká základní myšlenka toho vzorce. Vzorec nic neříká o tom, že bude s mým postupem Věž náročnější, tedy že proti mně bude stát čím dál silnější soupeř. Poměr mého oddílu vůči soupeři je stále stejný. Vzorec pouze udává, jak velký ten oddíl bude. A čím je oddíl větší, tím déle mi trvá doplnit ztráty. Ve větším městě se ti Věž hraje lépe, protože máš posílené divy a tím pádem je snazší soupeře porazit, ale téměř vždy nějaké ztráty utrpíš a čím je větší oddíl, tím větší jsou absolutní ztráty a tím déle trvá obnovit vojsko. Polovina z oddílu velikosti 4000 je stejná, jako 4 oddíly 500, takže co se ve velkém městě zdá jako malá ztráta může zabrat stejně času na doplnění vojska, jako když malé město ztratí téměř všechny vyslané bojovníky. (Ano, vím, že je rozdílná rychlost tréninku, ale jde mi o podstatu věci.)[BR][BR]Jak to funguje se surovinami jsem zatím nezkoušela, k tomu se tedy nebudu vyjadřovat. Nicméně vzorec jsem testovala na 2 městech a opravdu mi to zatím vychází přesně, rozdíl je pouze v desetinách. V následujících týdnech se pokusím to sledovat dál [smilie--sprite1]"}, {"20": "@Angedev - mě neuniká podstata toho vzorce. Prostě ho nepovažuji za podstatný, jde mi o praktickou stránku schopnosti hrát Věž.[BR]Mám posílené divy, což by mělo vést podle vzorce ke zhoršení bojů ve Věži. A to se neděje, protože síla divů je větší, než ono \"zhoršení\", které by to mělo přinést. To je o čem tu diskutuji.  Je naprostý nesmysl nevylepšovat divy ze strachu, že mi to zhorší Věž, nebo ze stejného důvodu omezit rozšiřování města apod.[BR]Samozřejmě, že jak se ve hře rozvíjíme, tak se úměrně musí náročnost Věže také zvyšovat, abychom nebyli v příliš velké výhodě. To je jasné a logické. Jenže jak rosteme, tak se také zlepšuje naše schopnost doplnit vojáky, surky atd. Vůbec totiž nejde o velikost oddílu a cenu surovin, ale o to, jak se mi Věž hraje a jak ovlivňuje ostatní části hry. Některé věci jsem musela v městě přizpůsobit a pokračuji v tom, a tím pádem Věž ve větším městě není problém každý týden na 3 patra a k tomu velmi slušný turnaj (cca 6-7K+).[BR]V menším městě zatím udělám jen polovinu 3. patra a dál to nejde. Samozřejmě nedopustím, aby mi Věž zruinovala vojsko a sklad surek. Proto na CZ1  ještě nahraju Věž celou. Udržuji sklad i počet vojska na úrovni, pod kterou nechci klesnout. A nehraju s diamanty. Kdybych do hry ládovala dioše, tak dám Věž i v malém městě, jenže to nechci. Počkám, až to půjde bez křečí [smilie--sprite2].[BR]Věž je a bude dobře hratelná i navzdory vzorci. O to se nebojím."}, {"3": "otázka je, až to dojdou divy posilující boj. pak už si budeš věž jen ztěžovat [smilie--sprite2]"}, {"19": "Pořád se tady píše o zhoršování věže, ale jak už psala @Angedev , v podstatě nedochází ke ztížení bojů jako takových, ale k navýšení počtu armády, a to na obou stranách. Takže je dražší výkup, jsou vyšší a tím dražší (z hlediska doplnění) absolutní ztráty, ale boj je v základu stále stejný (pro danou úroveň města).[BR]Takže pokud se hráč soustředí hlavně na vojenské divy, i když to věž zdraží, tak zároveň usnadní boj, čímž se následně sníží absolutní ztráty."}, {"3": "Těch divů je 6. Pět posiluje typy jednotek, šestý dává zdraví. Až bude všech těchhle 6 divů na max, tak potom jakékoli další vylepšení ostatních divů ztíží věž bez možnosti si nějak pomoct. A to už napořád...[BR][BR]A samozřejmě problémem je i ten rostoucí oddíl, protože od určitých velikostí už je problém doverbovávat ty velikosti ztrát.[BR][BR][BR](neberte to jako stížnost, ale jako konstatování faktu, se kterým je třeba se popasovat. Nicméně tvrzení, že se s tím dá něco dělat, je prostě liché)"}, {"20": "@Emhyr var Emreis II - všechny bojové divy na max dotahovat neplánuji. Není třeba. Navíc divy pracují s % a ne s konečnými čísly. Nejde tu jen o bojové divy, co hráče výrazně posiluje. Ale nebudu to tady rozebírat. Paradoxně je někdy podstatnější u některých divů jejich tzv. druhořadý účinek.[BR]Na Věž jsem nadávala krátce po jejím spuštění. Čím ji hraju déle, tím jsem s ní víc spokojená [smilie--sprite2]."}, {"59": "Radvanus >> Tak já o ztrátách při bojích píšu celou dobu, že oproti turnajům mají boje ve věži značné ztráty, proto je pro mě snazší spíš vykupovat, když mám surky. A zatímco turnaje se pro mě stávají stále lehčí, u věže mi přijde, že je to spíš naopak."}, {"20": "@Pauleo - Způsob boje ve Věži je jiný než v turnaji. Stavba protivníka bývá komplikovanější, nehledě na opakované střety. [BR]Samozřejmě i já dávám přednost výkupu. Ale ve 3. patře už jedu většinu bojem, jelikož vybírat z tolika druhů surek je málokdy úspěšné."}, {"3": "Ludi napsal/a:@Emhyr var Emreis II - všechny bojové divy na max dotahovat neplánuji. Není třeba. Navíc divy pracují s % a ne s konečnými čísly. Nejde tu jen o bojové divy, co hráče výrazně posiluje. Ale nebudu to tady rozebírat. Paradoxně je někdy podstatnější u některých divů jejich tzv. druhořadý účinek.[BR]Na Věž jsem nadávala krátce po jejím spuštění. Čím ji hraju déle, tím jsem s ní víc spokojená [smilie--sprite2].\t\tKlikněte zde pro zvětšení...a mě by to právě zajímalo [smilie--sprite1] klidně pošli i SZ, pokud nechceš, aby se tu z toho strhla nějaká šílená diskuze plná nepochopení."}, {"20": "Nechci tady dělat školení o divech. Ze zkušenosti vím, že ne všichni hráči chápou jejich funkci, ale poradit si nedají. Takže s veškerými radami v tomto ohledu jsem už skončila. A bojových divů je podstatně víc než 6, ale ty je asi ve hře ještě nemáš otevřené. Ale SZ ti pošlu kde trochu napovím."}, {"59": "Ludi >> Tak je plno hráčů, kteří chtějí obsáhnout víc možností ve svém městě, než jen boj a jemu přiřazené divy."}, {"20": "@Pauleo ono se to právě i těch ostatních možností týká. Na úspěšnost v turnaji i ve Věži nestačí jen bojové divy. Všechno souvisí se vším. Ale už dost o tom. O divech tu diskutovat nechci."}]