[{"16": "Na základě diskuze o úlomcích ve spoilerech z bety, tady jsou odměny z věže:[BR][BR]Odměny v prvním patře:[BR][IMG]https://i.ibb.co/mzYV9Wf/https-cz-forum-elvenar-com-index-php-attachments-1592750999714-png-4573.png[/IMG][BR][BR]2. a 3. patro je stejné, liší se jen odměny z finálních bossů (zleva - 1. patro, 2. patro, 3. patro):[BR][IMG]https://i.ibb.co/KFPsbVP/https-cz-forum-elvenar-com-index-php-attachments-1592751044763-png-4574.png[/IMG][BR][BR]Úlomky tedy padají se šancí 40-60% v 9 ze 12 střetů v každém patře. Tzn., že šance získat úlomky při průchodu celou věží je celkem 27x na 40-60%.[BR][BR]ps: A samozřejmě odměny z beden, které se s 10-30% šancí mohou objevit po každém střetu, ale z těch úlomky nepadají."}, {"26": "Nezměnil se poměr sil při bojích ve věži?[BR]Mých 1546 tříhvězdičkových žabáků, posílených ohnivákem sestřelilo jen 263 tříhvězdičkových špinavých orků stratégů. (údajně rovnocenní soupeři)[BR]V následujícím tahu pak zbylých 605 těchto orků sundalo mých 302 žabáků.[BR]Připadá mi to jako velký nepoměr na to, že by to měli být rovnocenní soupeři..."}, {"31": "@karhol To už se měnilo dřív ve verzi 1.98[BR]\t\t\tAnalýza jednotky Žabího prince ukázala, že je silnější, než jsme původně zamýšleli, a proto byly jeho útok a výdrž poníženy o 8-9 %.\t\tKlikněte zde pro zvětšení...[BR]\t\t\thttps://cz.forum.elvenar.com/index.php?threads/verze-1-98.5886/\t\t"}, {"59": "To je pravda, teď už si z nich daleko snáz opečou žabínka, moc toho nevydrží. A v době kdy ještě princovali na bojišti, tak jsem měl ještě pulce, nevyvinuté ve výzkumu, takže nemám srovnání."}, {"104": "Lovec Krys napsal/a:\t\t\tNavíc budu nucen vyrábět v řemeslné výrobě doslova všechny požehnání na mince, abych byl vůbec schopen utáhnout alespoň nějaký výkup, jelikož do teď chtěl výkup v turnaji jen suroviny (a orky - alespoň tady se ten tlak na orky trošku sníží).\t\tKlikněte zde pro zvětšení...[BR]Proč? Mincí je neustálý přetlak ze sousedské pomoci a není problém nasbírat miliony mincí (samozřejmě podle vylepšení hlavního sídla) za výpomoc za den - stačí oklikat většinu provincí (na mobilu za 15-20 minut i při 400 otevřených sousedech - plus společenství). A jestli to povede k vyššímu zapojení hráčů do sousedské pomoci, jen dobře."}, {"20": "@kasimir - protože v Ambasádách je situace s mincemi podstatně horší, než v jiných kapitolách. A požadavky na mince i kladiva za všechno jsou příšerný. Kladiva si vyrobím, ale s mincemi je to špatné. Ani s když motivacemi udělám celou mapu (a že ji mám už mega velkou) nezaplním sklad. Dřív mi stačilo udělat půl mapy a sklad byl plný. Hlavní sídlo mám na max 37 lv. Budovy nedávají zdaleka tolik mincí, jako dřív. A to mám kulturu stále kolem 200% i víc."}, {"16": "@kasimir Hraju jen na pc, mám problém oklikávat denně i společenství (tam už je naštěstí rychlá motivace) natož trávit denně hodinu oklikáváním sousedů."}, {"20": "@Lovec Krys - už dlouho jsem nedělala motivace na mapě, jen ve společenství a vracela jsem pár sousedům. V Ambasádách občas zase musím na mapu. Kdybych neměla tablet, tak na to kašlu, ale na tabletu projedu celou mapu rychle. Ale i tak to dává ve srovnání s jinými kapitolami méně než dřív. Prostě zaplnit sklad mincemi dá zabrat a výdaje jsou takové, že sklad je prázdný na to šup. Zase něco vývojáři nedomysleli ..."}, {"59": "Já teda s mincemi problém nemám, stále jich mám celkem přebytek, že si za ně kupuji VB, a při tom stíhám i věž. Mapu obcházím jen prázdná pole, což je hotové během malé chvilky. Ovšem nový styl turnaje neschvaluji, protože přesně vyšlo to co jsem předpokládal, a sice že hlavní vliv to bude mít především na nemožný zisk odměn, což mě na hře nemálo (a v poslední fázi převážně) bavilo. Když k tomu připočtu pár dalších negativních věcí (některých i z toho odvislých), velmi zvažuji další účast na hře."}, {"20": "@Pauleo - nemáš problém s mincemi, protože máš ještě většinu obytek z předešlé kapitoly. Až je budeš vylepšovat, nespíš jich pár pošleš do skladu, kvůli místu. Nové obytky dávají hodně lidí, ale málo mincí. Sběr je možný po 3 hodinách a obyvatelé platí fakt mizerný nájem."}, {"59": "Ludi >> To je možné, sic pár kouzelek vylepšených mám. Ale on je hlavně fakt, že já mám dost velký příjem z oněch prázdných polí (jsem na kraji mapy). Výhoda s nevýhodou. Získám dost mincí, nevýhoda je horší obchod."}, {"20": "I když motivuji kompletně celou mapu, nestačí to."}, {"59": "Zatím neznám, ale celá mapa je zdlouhavá a nebaví mě, nemotivuji sousedy, co nemotivují mě."}, {"20": "@Pauleo - motivuji mapu díky tabletu, tam to jde rychle. Problém s nedostatkem mincí u mě nastal po dokončení Ambasád. V minulé kapitole mi taky mince přetékaly všude. Na mapu jsem vůbec nemusela chodit. Prostě, obytky dávají málo mincí a když ani motivace celé mapy nepomůže, tak tu zase vývojáři něco nedomysleli. Dřív cca půl mapy a sklad byl plný. Dnes mám mapu ještě větší a po motivaci celé mapy jen půl skladu zaplněno. To je prostě špatně.[BR]Věž dělám 3 patra každý týden."}, {"59": "Ludi >> Rychleji to jde, ale nebaví mě to klikat ani tam, furt je to výrazně delší jak ta prázdná pole. Jinak jako ano, přikláním se klidně ke zvýšení, protože je dost možné, že máš pravdu, já to ještě nepoznal, ale věž se také snažím jet co nejdál, někdy až do konce, někdy nějaký bod před. Ale boj je na mě, když není zrovna turnaj, kde se mi vyplatí pomocná budova, celkem dost obtížný, takže kromě prvních pár, nebo když je to primitivní, tak vykupuji. To je právě to příjemné, že se turnaje bojují jinak než věž, jinak se počítají, proto turnaje bojuji, a věž spíš vykupuji."}, {"72": "Končím Ambasády, a mince utrácím u obchodníka. S kladivy je to podobné, kultura padla na 150. Zatím nevidím problém či důvod k panice.  ?? Motivuji - klan+ motivující sousedy."}, {"20": "@moribundus - hodně je to znát díky Věži, protože dělám každý týden celou. První dvě patra většinou smlouvám, třetí bojuji. Problém je v tom, že když utratím mince, tak se velmi pomalu doplňují. A o to jde především. Nejvíc mě vadí, že ani motivace celé mapy není schopno zaplnit celý sklad. A to je špatně. Pokud začneme platit mincemi i v turnaji, tak to není dobré. Prostě je velice znát, že produkce mincí je v poslední kapitole špatně nastavená. S kladivama problém nemám, tam mohu výrobu víc ovlivnit. Za kladiva i několikrát denně nakupuji u obchodníka."}, {"72": "Tak to je zřejmě ONO, věž jedu čistě bojem, max 2 patra. Surky mám na turnaje a výzkum.."}, {"59": "voyager-1 >> Tak to je nejspíš nějaká chyba, potože i já např. kouzelky (sic mě stejně padají jen portály) mám.[BR]GorGlin >> A mě se zdálo, že se v drahokamu s něčím pohýbalo, akorát jsem si vždy myslel, že byly víc těžké jednotky, a v poslední době mě spíš nachytaly jen více duhů obrněných střelců, tak nevím, ono je to s trénováním jednotek pak docela zásadní."}, {"104": "Lovec Krys napsal/a:@kasimir Hraju jen na pc, mám problém oklikávat denně i společenství (tam už je naštěstí rychlá motivace) natož trávit denně hodinu oklikáváním sousedů.\t\tKlikněte zde pro zvětšení...Hraju taky na PC, ale to mi nebrání jednou za den na 10 minut vzít mobil a oklikat na mobilu. [BR]Ovšem - Věž i na 3 patra a turnaj - tak kolem 3000 jedu vše jen na vojsko - medvěd, ohnivák, trpasličí zbrojíř a další stromečkové budovy z akademie, většinou kolem 200% - a samozřejmě divy na vojsko. Mince utrácím u obchodníka, kladívka na vojsko (spolu s urychlovačema)."}]