[{"16": "@kasimir Na svém mobilu Elvenar nerozjedu - je to stará Nokia na telefonování (s tlačítky) a simulátor Androidu natolik nenávidím, že je nulová šance, že bych ho znovu instaloval.[BR]Těch budov nemůžeš získávat tolik, abys je mohl používat každý týden, mně například za poslední měsíc padl max. 1 zbrojíř, nehledě na to, že je mám primárně na turnaj (se 3k body bych ani neudržel relikvie na nepřetržitou výrobu v Akademii kouzel, což si sám sobě dávám jako primární úkol do nového turnajového systému)[BR]Já si to holt musím pořešit jinak (nehledě na to, že jak píše Ludi by mi to stejně moc nepomohlo - až budeš v Ambasádách, tak uvidíš sám (pokud Inno nedostane do té doby rozum a nezruší tu exponenciálu))."}, {"68": "Já nevím jak to děláte, ale že bych trpěla neustále nedostatkem mincí, to ne. Neříkám, že občas mám méně kvůli upgradu budov.A to neobíhám všechny sousedy. Ale jinak to celkem zvládám. A to hraju Věž pravidelně na 3.patra, turnaje okolo 5000 bodů. K tomu mám i dostatek mincí v inventáři a to mi zbývá cca 7 výzkumu do konce poslední kapitoly. Jako mám snad všechny kouzelné obytky, kromě asi 5 obyč.....  [smilie--sprite1]"}, {"78": "Já jsem v Ambasádách a mincí mám dostatek! Možností, jak získat mince je víc než dost. Stačí chtít a snažit se. Jo a než se na mě vrhnete, věž pravidelně vykupuji,(a i tak mám mincí víc než dost) bojuji jen v turnajích.[BR]Jinak na nové turnaje se těším a až budou tady na Cz vyzkouším je."}, {"48": "Já jsem sice teď trochu uvázla v Konstruktech (nedostatek času), ale mincí mám také dostatek. Kouzelné obytky, propast, fénix, nově i set vzdušných obchodníků... Nelíbí se mi něco jiného, popsala jsem to výše."}, {"104": "Lovec Krys napsal/a:@kasimir [BR]Těch budov nemůžeš získávat tolik, abys je mohl používat každý týden, mně například za poslední měsíc padl max. 1 zbrojíř, nehledě na to, že je mám primárně na turnaj (se 3k body bych ani neudržel relikvie na nepřetržitou výrobu v Akademii kouzel, což si sám sobě dávám jako primární úkol do nového turnajového systému)\t\tKlikněte zde pro zvětšení...Asi mám víc štěstí, ale v akademii vyrábím je řemeslnou výrobu a spojovací činidla - i tak jich mám skoro 200 díky věži. Relikví kolem tisíce. A zbrojíř - minulý týden mě ve věži padly dva. A každý týden dostanu a vyrobím tak cca 2-3 stromečkové budovy - vyrábím jen je, krmení a portálové bonusy, někdy VB. Takže v pohodě. Jsem v konstruktech - a jsem na tom asi velmi podobně jako Vicky - jen ten set obchodníků jsem nestavěl, protože mince fakt jen přetékají ze skladu. [BR]Pokud vykupuješ v turnaji a věži, tak je to začarovaný kruh a musíš na to moc vyrábět - a pak zase nemáš na nic jiného. A ještě jedna věc - věž i turnaj na 3000 se dá bez problémů stihnout za 4 dny, takže na 3 patra věže a turnaj na 2-3000 bodů (víc je v našem společenství na 10 truhel zbytečné) stačí jeden zbrojíř a dvě krmení fénixe - na 200 % vojska.[BR]Ale mám obavu, jestli neodbočujeme od tématu :-(."}, {"20": "@aikomi , @nataly111 - já na tom byla s mincemi pořád dobře, problém nastal po ukončení Ambasád. Během výzkumu Ambasád nebyl problém. A nevtrďte mi, že se nesnažím, když kvůli mincím motivuji teď celou mapu. Ale ani po motivaci mega mapy nezaplním sklad. Což považuji za chybu hry. A sklad vyprázdním velmi rychle. Mám i kulturu na mince, Propast na 30 a je to stále málo. Kulturní bonus stále cca 200%.[BR]Největší únik mincí je evidentně ve Věži, která dokončením výzkumu skokově zdražila. První dvě patra většinou vykupuji a šetřím tak vojsko, surek i kladiv mám habaděj. Jen to zlato je špatně. 3. patro bojuji. V turnaj bojuji, mám průměr 8K+.[BR]Není ani tak problém, že zlaťáky utratím, horší je, že zlato se ve hře doplňuje strašně pomalu. Když ani motivace celé mapy nestačí, je to špatně. A placky na zlato mi v Akademii nepřicházejí tak často.[BR]@kasimir hráči hrají turnaj na hodně bodů kvůli přímým odměnám, zvláště kvůli VB."}, {"77": "Věž jedu celou na 3 patra na výkup a spíše než na sběr mincí z města a ve světě se spoléhám na požehnání mincí od kutila, ten je co do přísunu mincí  pro město i pro Věž hlavním dodavatelem (včetně ta Věž v odměnách) + Zlatá propast, některé sety a rostoucí budovy."}, {"104": "Ludi napsal/a:@kasimir hráči hrají turnaj na hodně bodů kvůli přímým odměnám, zvláště kvůli VB.\t\tKlikněte zde pro zvětšení...Jistě - to nakonec já taky, ale pak si nemůžu stěžovat, že mám málo něčeho jiného, v tomto případě mincí. Prostě je to jako vždy něco za něco - nemůžeš chtít všechno a tvrdit, že je něco špatně, když to nedostaneš."}, {"20": "@luterina + @kasimir - opravdu už nevím, jak to mám vysvětlit, NIKDY DŘÍV, jsem neměla problém s výrobou mincí. Problém nastal po dokončení Ambasád. Ani během výzkumu, ale PO DOKONČENÍ AMBASÁD. Navíc mám pocit, že tu občas lidi reagují na mé příspěvky, ale vlastně ani nečtou, co jsem napsala.[BR]Špatná výroba mincí ve městě není něco, co bych nepřežila, ale výhledově je to značný problém. Prostě pokud s tím Inno něco neudělá, tak to poznáte, až dojdete ve hře tam, kde jsem teď já. Takže buďte rádi, že na to upozorňuji včas.[BR][BR]@kasimir  - mince, v pozdějších kapitolách, nehrají v turnaji žádnou roli. Zatím. Navíc v turnaji bojuji."}, {"68": "@Ludi V tom případě jsem zvědavá až budu na konci, jestli to taky budu mít. Já se snažím více bojovat ve Věži a méně vykupovat. Ale to závisí jaký zrovna jede turnaj...."}, {"20": "@aikomi  - ve Věži smlouvám první 2 patra - surek mám tolik, že mi lezou ušima, šetřím vojsko na turnaj. 3. patro bojuji, tam už to smlouvání moc nejde.  V turnaji bojuji.[BR]Opakuji znovu: není problém ani tak v tom, že mince utratím, ale že např. po motivaci celé obrovské mapy zaplním sklad něco málo přes polovinu. A to je špatně. Domy dávají zlata taky málo. V tom je hlavní problém.[BR]I když samozřejmě, exponenciální růst nákladů Věže je hodně špatná věc.[BR]A jestli to taky nastane v turnajích, tak tedy nevím."}, {"105": "obavy z toho, že se to přesune do turnaje jsou bohužel vysoké !!!"}, {"16": "@nataly111 Hlavní rozdíl mezi námi bude zřejmě v počtu obytných budov. Takže to vypadá, že alespoň prozatím je řešením mého nedostatku mincí vyndat z inventáře obytky a zrušit zbytek pop/kult hybridů, co ještě ve městě mám.[BR]Jinak k nedostatku u mně dochází hlavně během výkupu třetího patra věže, zejména, pokud mám zrovna smůlu a bosse dělám nejméně 10x.[BR][BR]@kasimir Turnaj bych výkupem nebyl schopen jet - to bych potřeboval produkci tak 20 měst, abych to byl schopen vykoupit. V turnaji primárně bojuji, vykupuji jen občas a něco. Jakmile začnu v některých turnajích vykupovat více, tak suroviny jdou velmi rychle dolů.[BR][BR]Ke všem: Nebojte, brzo bude problém s mincemi i u vás:[BR]Výkup 10. provincie v turnaji:[IMG]https://i.ibb.co/tm6W1NB/https-cz-forum-elvenar-com-index-php-attachments-1594746841679-png-4617.png[/IMG] (a 11. [IMG]https://i.ibb.co/fYSqf2D/https-cz-forum-elvenar-com-index-php-attachments-1594746871917-png-4618.png[/IMG])[BR]A jen připomínám, že pokud je vzorec na náklady stejný jako ve věži, tak na cz1 budu mít ty náklady nejméně o 76% vyšší, než na těchto obrázcích z bety."}, {"78": "Hybridy pop/kultury se mi nikdy nelíbili, proto sem po nich nikdy ani nešla.[BR]Je možné, že přebytek mincí je dán mým stylem hry. Mám v úschově spousty požehnání, hlavně z událostí, které vždy jedu naplno.[BR]Jinak věž všechny tři patra vyjednávám, a ani tak nemám problémy s mincemi nebo materiálem."}, {"38": "Ludi napsal/a:\t\t\tDomy dávají zlata taky málo. V tom je hlavní problém.\t\tKlikněte zde pro zvětšení...[BR]Ahoj Ludi.[BR]Na konci Ambasád ještě nejsem, takže díky za postřeh s nedostatkem mincí.[BR][BR]Každopádně jsi mi vnukla otázku, proč si teda nepřistavíš další obytné budovy navíc?[BR]Výhodu máš v tom, že jsi na konci hry, tedy je prostor si město strategicky optimalizovat za pomocí teleportů.[BR]Píšeš, že suroviny u Tebe přetékají..tak si prostě pár manufaktur teleportuj do skladu, to samé s Měsíčními knihovnami a ostatních budov, které teď nejsou zapotřebí, nasázej tam extra obytky. Vidím, že jich máš 27.  Ale popravdě nechápu, jak nemůžeš vycházet s mincemi, když máš navrch 200% kult.bonus [smilie--sprite1] [BR][BR]Každopádně jsem na to zvědavý, až budu na konci výzkumu, jestli Tě pak třeba v tomto pochopím [smilie--sprite1] [smilie--sprite6]"}, {"20": "@BiggJOEcz - jasně, mohla bych si zastavit celé město obytkama, už jsem o tom i přemýšlela, ale na co, když mám velký přebytek lidí? Navíc, ono by to zas až tak nepomohlo, protože obytky dávají celkem málo. Kdybych kvůli mincím zatížila město dalšíma obytkama, tak kulturní bonus půjde dolů a vlastně nic nezískám. Kulturní bonus kolem 200% je dobrá věc právě na produkci mincí i kladiv. (V tuto chvíli mám 220%)[BR]Velké množství surek všeho druhu mi vyhovuje, protože se prostě o to nemusím starat a když je třeba, tak mohu utrácet úplně v pohodě. Je tu ale rozdíl v bonusových surkách a ostatních. Bohusových mám sice dost, ale zdaleka ne tolik, jako nebonusových. Prostě omezit výrobu v manufakturách nemůžu. Je to dáno tím, že díky Čmelákovi v pohodě nakupuji třeba i několikrát denně u Obchodníka za kladiva. Rozdíl je opravdu velký:[BR][BR][IMG]https://i.ibb.co/qFswKws/https-cz-forum-elvenar-com-index-php-attachments-surky-jpg-4619.jpg[/IMG][BR]Je jasné, že úbytek mincí je dán hlavně skokovým zdražením Věže, po dokončení výzkumu Ambasád. A je chyba, že hra není schopna kompenzovat tyto ztráty. Dokonce bych i pochopila, že obytky nedávají tolik, kolik by bylo vhodné. Ale naprosto nechápu, že když motivuji celou mapu, dostanu něco přes půlku skladu zlata. To je naprostá nehoráznost. Případná námitka, že je to velkým skladem, neobstojí, protože i výdaje se právě odvozují od velikosti skladu. To vidím všude, kam se podívám.[BR]Měsíční knihovny jsem nedávno právě postavila, protože poslední dobou vyrábím v Akademii spoustu věcí a spotřeba Spojovadel výrazně stoupla, jelikož právě vyrábím placky na zlato, což jsem dřív nepotřebovala.[BR]Celý problém není v tom, že bych se s tím nedokázala vyrovnat a musela kvůli tomu výrazně omezit hru. Jenže co budu dělat v příští kapitole nebo když mi zase stoupnou jiné výdaje mincí?  [BR]Samozřejmě, dny, kdy nehraju Věž, sklad zaplním snadněji."}, {"77": "Tak já třeba uvažovat o tom, co budu dělat v příští kapitole můžu, když přede mnou ty kapitoly a hráči co je znají jsou a poradí, ale nechápu, jak můžeš uvažovat o něčem, co nevíš jak bude, když se to tady po dobu skoro pěti let neustále mění a nevíš co mají v plánu vývojáři? S tím si prostě hlavu lámat nelze. Dívala jsem se k tobě do města a dost jsem při tom co v něm máš budov na mince nechápala, jak se ti nemohou dostávat, ale ke konci píšeš, že jsi to vyvážila natolik, že hru výrazně omezit nemusíš? Kde se ti tedy, ve které oblasti nebo místě, ve hře mincí nedostává? Na co bych se tedy měla v Ambasádách zaměřit, že tam by to mohlo váznout? Já tam ještě nejsem, ale děkuji za každou dobrou radu. [smilie--sprite1][BR][BR]P. S. Ještě by mě zajímalo, jestli jsi nezkoušela tu kapacitu skladu hl. Sídla dosypat celou na požehnání, jak dlouho ti potom a jak plný ten sklad vydržel - např. jestli jsi ho tak musela vyprázdnit denně nebo ta jedna celá kapacita vydržela na chod města více dní, tedy i s tím, co jsi ještě posbírala mince ve městě a ve světě."}, {"20": "@luterina  - samozřejmě, že plním pravidelně sklad požehnáním 100%. No na pár střetů ve Věži to stačí. Jiné velké výdaje nemám, všechny budovy už mám vylepšené na max. Teď pokládám cestičky, ale z důvodů, jak jsou drahé, a jak těžko se mince doplňují, je to jen pár dlaždic denně.[BR][BR]Zatím se mi dost dařilo odhadnout, o co půjde v blížící se kapitole. Prostě poslední divy napoví. Například minule: div Termální prameny napověděl, že půjde do tuhého v lidech a kultuře. A je to tak. Proto mám kulturní bonus tak velký, jelikož jsem se připravila. A vyšlo to.[BR][BR]O co půjde dál? Na to nepotřebuji křišťálovou kouli, jelikož o zdroje jde už nyní."}, {"77": "@Ludi , takže jestli jsem to správně pochopila, vlastně na všechno tak nějak máš, jenom co je moc drahé, a nemáš tak rychle jak bys chtěla, jsou cesty? Ty jsem nějak nikdy moc neřešila, kultury mám pořád dostatek, něco tě tlačí mít je všechny hned? Tak já tedy nevím kdy přijde další rasa, ale vzhledem k nasazení nového systému turnaje, což bude ještě nějaký ten čas trvat než si \"sedne\", to máš ještě na tu pokládku cest nějaký ten čas. Zajímalo by mě, za jak dlouho vidíš, že bys je tímto tempem měla všechny položit? Dny, týdny, měsíce? A proč je tak nutné (u tebe) mít v Ambasádách nové cesty hotové co nejdříve?"}, {"20": "@luterina opět jsi nečetla pozorně, co jsem napsala. Cesty kladu pomalu, ty mě nezatěžují. Pro mě jsou velmi důležité, je to cenný zdroj kultury.[BR]Největší úbytek je teď ve Věži.[BR]Momentálně to tak nějak jde, ovšem až začnu v příští kapitole vylepšovat budovy, tak to bude hodně zlé. Už nyní v Ambasádách byly požadavky na zlato velmi vysoké.[BR]Hlavní problém je v tom, že zlato se teď velmi pomalu a těžko doplňuje. A když motivuji celou mapu a mám z toho něco přes půl skladu, tak to je chyba hry.[BR]Prosím, přestaň porovnávat svoje město s mým, to opravdu nejde, protože podmínky jsou naprosto jiné. V Amunech jsem byla naprosto v pohodě."}]