[{"16": "@luterina V Ambasádách stojí jedno políčko 2 miliony mincí (kapacita skladu je max 54M po vyzkoumání posledního výzkumu v kapitole). Takže žádný div, že to Ludi jde tak pomalu a já se vůbec neobtěžuji je zkoumat. Samo o sobě by to problém nebylo, ale tam je na mince drahé vše."}, {"20": "@Lovec Krys, když položím tak 5 políček denně, tak je to v pohodě, to mě nezruinuje. Nemám s tím kam spěchat. Ale je to kultura, která nezabere místo.[BR]Ale ty pálky ve Věži jsou podstatně horší. Nemůžu sem dát obrázek, teď už mám Věž hotovou."}, {"77": "@Lovec Krys ponechávám tuto diskuzi s @Ludi na tobě, moc tomu totiž nerozumím, když Věž má hotovou a aktuální problém s chodem města žádný, kromě tedy ihned nepoložených všech nových cest, co tedy k řešení nebo za problém s mincemi v Ambasádách je? Problém v kapitole, která ještě nenastala, za problém podle mě považovat nelze a jiný zmíněný nenacházím, asi opravdu čtu nepozorně."}, {"20": "@luterina takže znovu: v Ambasádách jsou výdaje mincí enormní.[BR]Problém je, že výroba mincí je strašně pomalá a ani motivace celé mapy nepomůže. Tohle v žádné předešlé kapitole nebylo. Když jsem šla dřív na mapu, zaplnila jsem sklad i 2x, nyní zaplním sklad něco přes půl za celou mega mapu. A má to důsledky na celou hru.[BR]Cestičky mě opravdu nezatěžují, není na ně spěch. V tom problém naprosto není.[BR]Už opravdu nevím, jak to mám vysvětlit. To, že mám hotovou Věž, neznamená, že to není spojeno s problémy a ty se týkají právě mincí.[BR]To, že výhledově vidím problém s další kapitolou, je prostě logika věci, která je úplně jasná. Pokud vývojáři alespoň nezvednou odměnu za motivaci, tak to bude hodně zlé.[BR]Nebo - změní vývoj růstu drahoty ve Věži a nyní i v blížícím se turnaji. Jde právě o exponenciální růst. Prostě křivka růstu strmě nahoru."}, {"77": "@Ludi promiň, ale já vývojářům pod ruku nevidím a proč udělali náhle sklad tak velký, že ho oproti předešlým kapitolám mincemi za motivačku a sběrem hned nezaplníš, jak jsme zvyklí byli, to opravdu nevím, ani jaké mají další plány, které tento zajetý koncept může klidně zbořit. Pokud ta celá panika okolo mincí v Ambasádách vznikla jen ze spekulací o nové kapitole na základě \"příliš velkého skladu\", tak to za chybu nepovažuji, např. chyba by byla, pokud by kapacita skladu byla příliš malá, že by např. nestačila na nějaký konkrétní náklad, třeba na vylepšení budovy, ale příliš velký sklad ničemu a nikomu bránit v chodu města nemůže, tedy o chybu se podle mě v tomto nejedná."}, {"20": "@luterina nejde o příliš velký sklad, vůbec ne a už jsem to tu v předešlých příspěvcích psala. Neznáš vývoj hry, zvětšení skladu nebylo skokové.  Jde o slabou výrobu mincí a malou odměnu za motivace a k tomu velké výdaje v mincích. Nejde o paniku, ale o logiku věci.[BR]Výrazné bylo zdražení Věže.[BR]Prosím, přestaň posuzovat situaci v Ambasádách, když tam nejsi."}, {"77": "@Ludi , neodvíjí se velikost motivace vždy od velikosti kapacity hl sídla tedy skladu? To by mělo platit napříč všemi kapitolami. Jinak situaci v Ambasádách neposuzuji, jen vycházím z toho, co jsi napsala, že problém v chodu města nemáš, Věž jsi uhrála a mince jako takové ti tedy nijak významně nechybí, tedy že se nedostatek mincí v Ambasádách nekoná, což tedy k řešení do budoucna za mě odpadá. Slabá výroba mincí, na základě zjištění, že nenaplním sklad celý, jak jsem vždy byla zvyklá, ještě slabou výrobu mincí znamenat nemusí, když se sklad zvětšil a když se mince na chod města a uhrání Věže, jak ze všech těch informací zde vyplynulo, dostává."}, {"16": "Hl. sídlo...kapacita...sousedská[BR]Amuni:.....31M...........56K[BR]Amuni2:...34M...........60K[BR]Konstr1:..38M...........64K[BR]Konstr2:..41M...........69K[BR]Elven1.....44M...........74K[BR]Elven2.....46M...........77K[BR]Amb1......50M...........83K[BR]Amb2......54M...........90K[BR]Přičemž v Ambasádách je první level výzkumu Hl. budovy v půlce kapitoly a druhý až úplně na konci, takže půlku kapitoly hraješ s Hl. budovou z Elvenarů. Navíc obě vylepšení stojí 90% kapacity skladu (a k tomu přes milion svitků a many).[BR][BR]Já vidím problém v kombinaci několika hlavních faktorů:[BR]Exponenciální růst ceny za výkup ve Věži (a brzo i v turnajích) *[BR]Vysoké ceny vylepšení budov v Ambasádách (např. 18M mincí za 1 úroveň zbrojnice, podobné ceny ostatních budov, to před koncem kapitoly dáš na plný sklad vylepšit 2 max budovy najednou)[BR]Slušný růst populace v obytkách spolu s jejich zvětšením (5x3>5x4) vede ke snížení počtu obytek a tím i k nízkému růstu produkce mincí (v některých případech i ke snížení produkce, pokud se to přežene - to byl asi i můj případ)[BR][BR]Každý z těchto problémů sám o sobě problémem zatím není, ale dohromady dokáží u slušné skupiny hráčů v Ambasádách vyvolat nedostatek mincí.[BR][BR]* Tohle bude do budoucna hlavní problém. Exponenciální růst je prostě potvora a dát exponenciálně rostoucí náklady při neexponenciálně rostoucí produkci bude způsobovat velké problémy rostoucímu počtu hráčů na nebo ke konci výzkumu.  Dát exponenciální růst nákladů do věže a brzo i turnajů je prostě chyba v návrhu a obojí se bude stávat pro pokročilé hráče (hlavně ty, co mají větší množství rozšíření a divů) nehratelné."}, {"77": "Problém je v tom, že se tu řeší něco, co u nikoho nenastalo, a jestli nastane se opravdu říct nedá, když se nelze spoléhat na zajeté koncepty, které se neustále mění, měnily a měnit budou, to je totiž zatím ta jedna jediná z jistot, které tato hra zaručuje. [smilie--sprite1] Jinak děkuji za vaše názory."}, {"20": "Řekla bych, že je na místě tyto věci připomínat a dávat podněty, aby se věci řešily včas.[BR]Už několikrát vývojáři zpětně opravovali některé věci v minulých kapitolách. Třeba i populaci domů v Orkách i jiné věci. Jenže, to už jsem je měla dávno za sebou.[BR]A nevím, proč bych měla být trestána ve Věži za to, že mám dokončený výzkum, divy a nová rozšíření města, která jsem koupila za dia."}, {"16": "@luterina Snižování zásoby požehnání na mince (tzn. mincovní deficit) bych nenazval jako \"nenastalo\".[BR]U mne zatím řešitelné zvýšením počtu obytných budov.[BR]Ale to, že exponenciální vzorec mi díky rozšířením a divům způsobuje o 76% vyšší náklady na věž oproti betě(obě v ambasádách) je prostě fakt."}, {"11": "tak pátá obchodní stanice po sobě. To na konci hry potěší. A aby toho nebylo málo tak jako bonus hafo PB. Už jich mám na asi 70 portálů [smilie--sprite3]"}, {"59": "Portály mě taky hrozně padají, z prvních dvou bosů naprosto pravidelně, takže normální, i ty nepotřebné budovy."}, {"3": "první patro věže - ani jedna truhla a na konci portálový bonus. TO nemluvím o tom, že ani jednou nepadla třeba činidla a spousta malých bossů dala 2000 úlomků (snad jen první 15 dia). To má být zábava? [smilie--sprite3]"}, {"42": "Dnes portálový bonus [smilie--sprite4] a džin [smilie--sprite9]v prvním patře z bonusových beden. Je to hold loterijní věž, nebo automat, cpeš tam zdroje a ono to občas padne [smilie--sprite8]."}, {"3": "já vím, ale tenhle pokus je zatím jeden z nejbídnějších, co jsem absolvoval. Snad to další patra zachrání..."}, {"59": "Tak u obou bosů prvních dvou pater zase jako vždy jen portály. Ještě že mi včera u bose ve třetím padl aspoň zbrojíř, ten vytvoří úsměv na tváři vždy."}, {"106": "Mám podobnou zkušenost i názor jako ElfNostradamus a to jsem teprve ve 4. kapitole. Kombinuji souboje s vyjednáváním hlavně v místech, kde již armáda ve třech kolech nemá šanci na úspěch. Taky nechápu autora hry, když rádci chtějí abych splnil úkol v získání provincie bojem. Je to holý nesmysl již v první kapitole. Jsem si vědom toho, že jistý stupeň obtížnosti je důležitý ale něco co se prostě splnit nedá ani s nejlépe vybavenou armádou v daném stupni hry, je nesmysl. Ani se nedivím, že spoustu potencionálních hráčů, tato hra odradí již na samém začátku ."}, {"107": "Já jsem dnes happy. Padla mi kouzelná obytná budova a konečně mám také první měsíční knihovnu (do série mi chybí ještě nekonečný svitek)"}, {"108": "Zdravím, ráda bych věděla, kolik  dostanu ve věži po skončení, když jsem byla ve tretím patře (na začátku)? Vybavuje se mi, že 75  za druhé patro, je tak? Dostala jsem jen 50 [smilie--sprite5]"}]