[{"24": "Prvá mapa dokončená, väčšina stretov riešená vyjednávaním. Z prechodu mapy som spravil video (v jeho popise sú uvedené celkové náklady).[BR][BR]"}, {"31": "Ten poslední střet na první mapě jsem se právě rozhodla bojovat. Protivníci převážně těžkooděnci, tak ručně 5x lučištník + nakrmený fénix a v pohodě. Zítra začíná turnaj, tak už můžu krmit, když mi to vyšlo cca na půlnoc."}, {"52": "Tak ta věž je totální nesmysl,vše jsem vybojoval až tu poslední truhlu se mi podařilo vykoupit a za to všechno jsem získal pár úlomků kouzel,činitelů,trocha mincí a nakonec když se podaří zdolat poslední truhlu,tak získám budovu s 50 procentním zdravím pro všechny jednotky,která za pár dní vyprchá,to snad nemyslíte vážně,větší ptákovinu jsem nevyděl..."}, {"31": "@papap Buď rád, že jsi z celé mapy nedostal akorát trapných 30 diamantů.[BR]Ten trpasličí zbrojíř se mi naopak líbí, lepší verze Jedinečného vylepšení jednotek.[smilie--sprite1]"}, {"53": "Tu věž vzdávám.... Boje jsou šílený, to potřebné množství vojska je naprosto neúnosné a neúměrné a vyjednávání je naprosto náhodné.... Líbilo by se mi, kdyby to bylo založené vyloženě na logice, ale tohle je loterie... Ale chápu strategii vývojářů, je to opět \"jak vymlátit z hráčů diamanty\" Odměny mi za to fakt nestojí. Jsem někde v elfech a raději suroviny a vojsko věnuji na rozvoj města a turnaje, než likvidačně na tohle..."}, {"35": "ja hlavne nechapu, proc po testu na bete to v takove verzi hodili na ostré servery.... [smilie--sprite5]"}, {"54": "Já jsem zatim spokojena [smilie--sprite1] 130 diamantu a pres 6000 ulomku kouzel mi prijde jako dobra odmena za prvni patro [smilie--sprite1] Bitvy jsou ze zacatku lehke a pak ano, neadekvatne se stizi. Tak muzete prejit na vyjednavani, ktere mi prislo super, da se to podle napoved vydedukovat a jen 2x sem mela 50 na 50 a to prave byla sranda [smilie--sprite1]. Za me zatim s mini mouchamy spokojenost."}, {"55": "Věž mě velmi zklamala,žrout obrovského množství armády...odměny žádná sláva...za mě špatná volba."}, {"50": "Moje odměny z věže:[BR]2x 25 dia[BR]1x 50 dia[BR]1x portálový bonus 50%[BR]2x blahovičník[BR]několikrát mince a urychlovače přesné počty nevím, několik činidel cca 8, větší množství úlomků kouzel cca 9000[BR]Podle těchto odměn nestojí věž za mou pozornost..."}, {"42": "První patro na boj zas tak strašné není, jen to chce být připraven (mám bojové divy okolo 10lvl, ohnivý fenix 10lvl).[BR][BR]Rozhodně kdyby každý týden z věže padl +50% boost na životy vůbec bych se nehněval. To by se pak věž i turnaj hráli lážoplážo"}, {"56": "Tak prvni mapa dokončena .No to samé jak na Foe tam to taky moc nedávám Hodně jsem do toho dala a nic moc z toho nemám .Aspon nějakou tu budovu kdyby mi to dalo no mám portalovy bonus jen 5%[BR]Ten mi dává fenix tak jako tak .No uvidím příště .Jo a raději jsem vyjednávala na boj me to stalo hodně a bude turnaj"}, {"46": "Jen prvni patro, zkusil jsem 4x vyjednavani  a 3x jsem mel desnou kliku (na 2.) a jednou mi to stalo 25 diamantu. Posledni boj jako Prealiena - 5 strelcu a skoro vsichni mi vratili domu. Postupem ziskany 2 manovce (kdyz je das vedle sebe tak se tvari jako spojene, ale na jejich produkci se to neprojevi), neco ulomku kouzel (nepotrebnych), par cinidel., tusim 30 diamantu... Jsem ze spolecenstvi, ktere si zaklada na ziskani 10. truhly, takze dal uz asi nejdu. Uvidim, na rozmysleni mam 12 hodin ;-) Hrano s Fenixem, trpasliciho zbrojire jsem nepouzil, jedna prohra, kdy jsem si nevsiml, ze je to na  vic kol..."}, {"20": "@iDavis  V podstatě jsem první patro hrála velmi podobně.[BR]Myslím, že jsem celkem optimisticky naložená a brala jsem s vděkem různé eventy, i když jiní nadávali na odměny. Tohle je poprvé, od doby co hraju, co jsem fakt naštvaná. A to už je co říct. Likvidace vojska a surovin a odměna urychlovač na 1 hod. ? Nebo na 2 hod.? To jako vážně? Jediná kvalitní věc, co mi padla, je Brána měsíčního kamene, ale jinak jsou všechny odměny mimořádně slabé v porovnání s náklady."}, {"35": "Paja hokejka napsal/a:\t\t\tJá jsem zatim spokojena [smilie--sprite1] 130 diamantu a pres 6000 ulomku kouzel mi prijde jako dobra odmena za prvni patro [smilie--sprite1] Bitvy jsou ze zacatku lehke a pak ano, neadekvatne se stizi. Tak muzete prejit na vyjednavani, ktere mi prislo super, da se to podle napoved vydedukovat a jen 2x sem mela 50 na 50 a to prave byla sranda [smilie--sprite1]. Za me zatim s mini mouchamy spokojenost.\t\tKlikněte zde pro zvětšení...130 diamantu a 6000 úlomků za to vojsko /suroviny fakt nestojí... 130 dia mam ze studen zadarmo a 6000 ulomku je za dva rozkraftene artefakty... takze pomer naklady / výnosy naprosto neadekvatni... pro lidi v mensich kapitolach asi ok, ale pro vyssi kapitoly na nic"}, {"20": "@Fjorgyn  Ano, první patro je hratelné, uhrála jsem ho. I já mám všechny bojové divy i Fénixe 10.  Jenže náklady absolutně neodpovídají odměnám."}, {"5": "Chtěl bych poděkovat tvůrcům za dárek k Věži, který byl v přihlašovacím emailu /hromadné případně spam - pro neznalé/.....bohužel, je to zatím jediný pozitivní zážitek z Věže, kromě tedy ještě krásného grafického ztvárnění, což doufám, že se vše nebo alespon něco z toho /náročnost či dostupnost % odměny/ do budoucna změní, byla by škoda, aby se Věž stala pouhou hezkou dekorací okolo města...[smilie--sprite1]"}, {"16": "@donutka Tohle už je zlevněná verze. V původní verzi ty náklady byly ještě vyšší.[BR]Samozřejmě skoro všem, kromě vývojářů, je jasné, že je to furt moc.[BR]V současném stavu je hratelné tak první patro, pak poměr nákladů vs zisku naroste do absurdních výšin."}, {"45": "...tak ja som presiel prve poschodie automatickym bojom az na posledny trojvlnovy boj. Dalsie dve som na 95% hral manualne. Straty su niekolnasobne vyssie ako pri turnaji. Mam miliony tovaru, minci a zasob plny sklad, no suroviny ktore maju denny pokles, tych clovek nenazbiera dostatok na to aby mohol skusat vyjednavanie, preto som sa o to ani nepokusal, kedze vylepsujem SIMIU a CASOPRIESTOR, tak many, semien a ani citiaceho tovaru nemam na rozdavanie. [BR][BR]Ja som vcera ziskal kopec urychlovacov a tak buducu vezu nedohram za dve hodiny ako vcera, ale rozplanujem to na cely cas a za urychlovace co ziskam vo vezi tak doplnim armadu..."}, {"57": "Těšil jsem se na Věž jako i ostatní hráči ale po vyzkoušení moje radost prudce opadła. Je to obdoba expedice ve FoE jenom že tam můžu si koupit tah navíc a jde z tím alespoň trochu zvýšit šanci na úspěch. Tady ve 3 tazích už na druhé úrovni Věže jsme ztraceni. Vyplacal jsem zásoby a diamanty a nemám nic. Škoda."}, {"16": "@eggoff Tak ono to jde vyjednat až do konce celé, ale ten počet pokusů je při troše smůly pěkný masakr."}]