[{"16": "Ve věži jsou 2 druhy odměn - individuální a odměna společenství.[BR]Zatímco individuální odměny závisí jen na hráči (dostáváš z beden, které sama ve věži nahraješ),[BR]odměna pro společenství závisí na 2 věcech:[BR]Kam se dostaneš ty sama.[BR]Kam se dostane celé společenství dohromady (součet bodů za jednotlivé střety = za každý střet 1 bod, za minibosse(před bariérou s časovačem) 2b, za finální bosse pater 3b (součtem pro celé patro je tak 21bodů, tzn. hráč, který vyčistí všechna 3 patra přinese společenství 63 bodů).[BR][BR]Společné odměny (po skončení věže) se pak rozdělují dle toho, kolik bodů nahrálo celé společenství a kam došel sám hráč.[BR]Tzn. hráč, který došel dál než součet bodů společenství (tvůj případ) dostane všechny společné odměny.[BR]Hráč, který nahrál méně než společenství dohromady, dostane jen část společných odměn.[BR][BR]V prohlížečové verzi je vlevo rozkliknutelné zobrazení věže s aktuálním postavením všech hráčů společenství i s možností zjistit aktuální společné odměny. Jestli a jak je toto zobrazeno v aplikaci, netuším."}, {"26": "Není nějaká změna v nastavení věže? Mám dvě celá patra a neobjevila se ani jedna záhadná truhla.."}, {"48": "Zajímavý... Mám sotva půl prvního patra a už jsem měla tři modré truhly."}, {"18": "Myslím, že je to náhodné."}, {"2": "když otevíráš bednu tak je tam napsáno jakou máš šanci na bonusovou bednu[BR]myslím, že to je nějakých 10%"}, {"16": "10%(běžný střet),20%(miniboss) a 30%(boss).[BR]Což znamená, že teoreticky můžeš dostat bednu z každého střetu anebo taky žádnou."}, {"3": "je to o náhodě. Někdy fakt nevyskočí skoro žádná, někdy i 3 fialové za patro"}, {"16": "A z těch 3 fialových 3 teleporty a 2 PP [smilie--sprite8]"}, {"31": "Z fialový měsíční knihovna, to naštve. [smilie--sprite1]"}, {"3": "já PP dneska, TO NAŠTVE [smilie--sprite2]"}, {"109": "já ani bednu, TO TEPRVE NAŠTVE [smilie--sprite6]"}, {"16": "Tak nám budou měnit odměny ve věži. Ještě někdo má z toho mrazení v zádech?"}, {"24": "Myslím si že sa skôr naráža na budovy z veže - napríklad nejaké nahradenie aktuálneho setu s knihovnou (ktorých mám momentálne v inventári 17!). Takže nie, obavy si nerobím, len sa ďalej snažím nahrabať toľko knihovní koľko sa dá (pre prípadný budúci deficit spojovacích činidel)."}, {"3": "charakterizoval bych svou náladu, jako \"opatrné očekávání\""}, {"45": "@iDavis ja mam 16 kniznic v meste a 6 v sklade, neviem si predstavit, ze by som potreboval viac katalyzatorov/cinidiel ako ziskavam a minam v tejto faze hry...[BR][BR]...resp. mozno aj novy set bude davat katalyzator/cinidlo a potom z mojho pohladu je to jedno, lebo len tento prvok ma v setoch zaujima [smilie--sprite1]"}, {"31": "Dnes jsem ve třetím patře dostala dvě fialové truhly.[smilie--sprite1] V obou případech z nich vypadl 3x Teleport.[smilie--sprite3]"}, {"110": "Ahoj.[BR]Já v této věži dostal bonusové truhly až ve třetím patře. Obě byly fialové. Z jedné měsíční knihovna a z druhé obchodní stanice, které mám ve městě 4. No a na vrcholu byl myslím zbrojíř.[BR]Klasika"}, {"2": "Bonusové bedny mi chodí jak se jim zachce někdy ani jedna, někdy i pět na patro.[BR]Prostě náhoda"}, {"11": "kdybych měl v každý věži zbrojíře, to bych i bral."}, {"2": "No to jo, když ho každý týden stavím"}]