[{"111": "To já jsem šťastný i na nízké úrovni . Teleportů mám nasysleno devět ."}, {"112": "Přísun Džinů ustal [smilie--sprite3]  Mám postaveny 4. Z toho 3 poběží 50 dní, čtvrtý 80 dní... a do skladu nepřibyl ani jeden!"}, {"93": "jo.jak ze začátku padali hodně, teď už mám jen jednoho a ten mele z posledního. Zato teleportů mám přes 70 [smilie--sprite11]"}, {"3": "4 je hodně... za těch 100 dnů při plných věžích bych to viděl průměrně na přírůstek 2-3 džiny. Mě teď momentálně taky stojí 4, ale předtím jsem měl jen dva. A dva další už mám zase v zásobě..."}, {"113": "ahoj, chci se zeptat, jestli ve věži někdo už získal nekonečný svitek do sady měsíční knihovny. Já už mám všechno ostatní, jen tenhle dílek nemůžu z té věže získat. Děkuju."}, {"11": "momentálně myslím ve věži nejsou ale mám jich plno"}, {"16": "@Xena princezna bojovnice Jestli to tu už je, tak kontroluj řemeslnou výrobu, jinak počkej na artefakty Stonehenge ve věži a pak by se tam měla objevit (v řemeslné výrobě).[BR]Bohužel to zřejmě zároveň znamená, že pro nové hráče už bude získatelné budovy setu pouze po jednom kusu."}, {"114": "Ahoj všem,[BR]budu se opakovat, už jsem to tu několikrát psal, ale vede mě k tomu marnost a zoufalství s odměnami ve věži věčnost:[BR][BR]1) Po delší době, jsem dojel věž až do konce a jen to potvrdilo to, že mi to nedá z odměn snad nic jiného, než úlomky kouzel (když pominu hlavní truhly).[BR]Dostanu úlomky i tam, kde jsou procentuálně nejníže postavené, tak mi to stejně dá úlomky kouzel, které mi přetékají ze skladu.[BR][BR]2) Po dobu šesti týdnů jsem si dělal sondu, co dostanu za odměny, dělám většinou tak jedeno a půl patra a odměny byly vždy naprosto stejné/pořád dokola to samé = tedy úlomky kouzel, jen minimálně sem tam snížení času, ale to jen opravdu minimálně.[BR][BR]Nepochopím to, že je odměna 60% úlomky, tak dostanu úlomky a o patro výše je 60% snížení času stejně mi to dá úlomky ??!! A tak pořád dokola, to je divné že ?! A to i ve vyšších patrech věže, kde jsou náklady na jednotky, suroviny a zásoby celkem markantní tak dostanu úlomky !![BR][BR]Proč se procenta možnosti získání tak nějak nesrovnají, aby se odměny střídaly, aby hráč nedostával pořád dokola to samé ??!![BR][BR]Kdyby to alespoň dávalo pokaždé něco jiné a to třeba snížení času nebo příděly zásob atd., ale z úlomků kouzel už se mi dělá zle [smilie--sprite1][BR][BR]No nic, stejně se nic nezmění a odměna bude pořád dokola úlomky kouzel a to je ta marnost a zoufalství !![BR][BR]Já bych tak chtěl, aby se odměny protáčely, abych  sem tam dostal kouzelnou budovu, portálový bonus, příděl zásob, pořádné snížení času nebo diamanty a ne pořád dokola úlomky kouzel !"}, {"3": "máš holt smůlu.[BR]Já mám vysledované, že z každé věže dostanu zpět víc urychlení, než kolik jich spotřebuju na projetí na jeden zátah.[BR]Momentálně mi moc nepadají zbrojíři, na druhou stranu před časem jsem jich ml v zásobě 11. Docela mi padají kouzelné obytky, zato dílny zatím jen dvě. Džinové se mi docela daří (momentálně jich mám ve skladu už 6 a před cca dvěma týdny jsem bořil 4 vypršelé).[BR]Úlomky nikdy moc nepotěší, ale tak to prostě je. Alespoň je nemusíme řešit. Odstranil bych je maximálně z malých bossů, tam je to i podle mě výsměch.[BR]Portálovky a obchodní stanice, to je kapitola sama pro sebe.[BR]Nicméně v dlouhodobém časovém horizontu ta statistika prostě vychází. [BR]PS: artefakty mi taky nepadají [smilie--sprite8]"}, {"16": "@Emhyr var Emreis II Tak už vím, kam zmizeli moji džinové [smilie--sprite8][BR][BR]ps: Já o džinech a dneska po dlouhé době hned 2."}, {"98": "Já nevím, zní to divně, ale když chci aby mě padaly úlomky s menší pravděpodobností, tak najedu myší na truhlu, zobrazí se seznam odměn, chvíli počkám,  2-3 vteřinky a potom kliknu. Schválně to zkuste jak to funguje u vás."}, {"115": "@Patmat - zajímavé řešení, ale logicky nedává smysl. Potažení myši by nemělo ovlivňovat algoritmus. [BR][BR]Můj přepoklad je že při otevření truhly systém náhodně vybere číslo 1-100 (pro nematemaické hodí stostěnnou kostkou[smilie--sprite1]) a pole čísla co padne přiřadí odměny, řekněme že je 60% šance na úlomky - tz. pokud padne 1-60 tak dostaneš úlomky - pokud 61-100 tak jiné odměny. Ještě je řeba vzít v úvahu takhle si hodíš u každé truhly (jev nezávislý na předchozích truhlách), takže je to o štěstí na RNG (Random Number Generator - generátor náhodných čísel).[BR][BR]Najetí myši na truhlu by toto doopravdy nemělo ovlivnit, ale kdo ví...... [smilie--sprite8]"}, {"98": "Myslel jsem najetí myši na truhlu s odměnami, tak se zobrazí seznam odměn, počkám nikam nepřejíždím myší a potom kliknu. Samozřejmě vím, že je tam nějakej generátor náhodnejch čísel. A je to jen můj dojem, že padá méně úlomků.[smilie--sprite1]"}, {"6": "Za poslední dvě Věže MAX ani budova. Bez komentáře."}, {"2": "On generátor náhodných čísel je celkově problém. Počítače házet kostkou neumějí.[BR]Já spíš přemýšlím jak lidi pořídí takové kvantum úlomků, že pak mají potřebu tu na to nadávat.[BR]Já dělám věž až nahoru, v současné době vyrábím asi 8 lepidel ta den a v zásobě mám stabilně cca 100k úlomků a 100 lepidel.[BR]Proč ty úlomky neutracite?[BR]Uznávám že tam taky občas mám věci které mě moc neláká ji, ale výrobu stát nenechám.[BR]Aspoň ty čmoudi mě posunou k další tajemné truhle a tam dostanu další sadu zimních lampionů.[BR]Ale co se dá dělat. VBcka, urychlovače diamanty i ty občas padnou.[BR]Proč nezkusite tu produkci využít?[BR]Až si lidi všimnou kolik tisíců maji relikvií a že v takovém počtu jsou k ničemu, taky tu bude slzavé údolí?[BR]Věž dává dziny, zbrojíře, magické obytky a dílny. [BR]A krom toho diamanty a teleporty.[BR]Ty budovy jsou tak cenné, že je nemůžeme mít každý týden jednu, podívejte jaký zmatek nadělali mesicni knihovny.[BR]A urychlovaču nebude nikdy dost."}, {"16": "@GorGlin Počet (přebytek) úlomků je přímo úměrný počtu setů knihoven. Nové hráče s max. 1 setem knihovny tento \"problém\" nemusí trápit.[BR][BR]Každý, kdo si stěžuje, že má něčeho dostatek(přebytek), by si měl uvědomit, že nejpravděpodobnější reakce ze strany vývojářů je omezení zdroje přebytku anebo zdražení produktů za tento zdroj pořizovaných (tzn. změna v neprospěch hráčů)."}, {"116": "ulomky ziskavaji vsichni v hojne mire ikdyz znam jednoho spoluhrace co si vyslovene stezuje ze ikdyz prochazi celou vez nic v ni neni a ze ulomku kouzel ma nedostatek[BR]kazdopadne ja porad cekam ze neco udelaji s tou knihovnou jen ji vyndali ale neudelali zatim snad si najdou cas a chut ji trosku prekopat ikdyby to bylo nejake omezeni kdyz narazim na meste kde jsou sviky zavrzeny 33 ocelaren a 2 prachovny vypada to docela silene ja se snazim s timto defektem stale bojovat a svitky vyrabim ikdyz mene"}, {"2": "I bez knihoven mi můžeš mít nadbytek střepů, pokud nevyrabis dost lepidla[BR][BR]Já si myslím, že knihovna se měnit nebude.[BR]Nová města už ji v takových počtech nepostaví a ta stará budou těžkou udržovat deset setu na aktuální úrovni a postupně zbydou.[BR]Takže efekt se naplno projeví cca za rok."}, {"117": "Já se taky divím, že si lidi stěžují na přebytek něčeho ... mnohem horší je mít něčeho nedostatek. [BR]A @Matesov  ... když jedeš věž jen jeden a půl patra, nediv se, že ti nepadá nic \"lepšího\" ... já třeba džiny získala, až v moment, když jsem se vyplácala z vojska a surovin a došla až do třetího patra. A i když je to věž nevděčnosti, tak pro lepší odměny je potřeba jít dál. Pokud to není tento týden, ani druhý týden, třetí týden už padne něco z toho, co chceš.  [smilie--sprite2]  Ale je potřeba chodit dál, výš. Většina hráčů ocení kouzelnou dílnu, já jí taky milovala. Ale mám jich už 6 ... a další už nechci. Už se mi stalo, že jsem jí musela prodat, protože byla nadbytečná. Teď to řeším tak, že je všechny v dané kapitole nevylepším a kdyby náhodou padla, prodám tu starou (v nižším levelu) a postavím novou.[BR]Nemysli si, taky si povzdechnu, že z poslední věže mi nepadá nic jiného než úlomky a portálový bonus ... ale co vím jistě, že se to zase zlepší. Artefakt Stonehenge nemám ani jeden a to ani na jednom světě, ale když byly artefakty ohniváků - těch jsem dostala dost. Je to prostě o náhodě a taky o ochotě -  kolik toho do toho věnuješ. [BR]@GorGlin  taky nenechávám výrobu v akademii stát, pořád je co kraftit, i když to není vždycky TOP. [smilie--sprite2]  Sada zimních lampiónů nebo já posledně modrý zmrazený plamen ... to je přece nej [smilie--sprite7][smilie--sprite7][smilie--sprite7]"}, {"3": "Reyahana napsal/a:\t\t\tJá se taky divím, že si lidi stěžují na přebytek něčeho ... mnohem horší je mít něčeho nedostatek.\t\tKlikněte zde pro zvětšení...pokud má něco sloužit jako odměna, pak ve chvíli, kdy se ti toho milion válí ve skladu, to rozhodně účel neplní..."}]