[{"4": "@Emhyr var Emreis II - no ne všem se toho válí ve skladu mraky a je lepší mít víc, než míň. Věž hraju kvůli časovačům a činidlům ze společných odměn a jsem rád, že nemusím ty úlomky vůbec řešit. Ve skladu mi nehnijou [smilie--sprite2]"}, {"117": "@Emhyr var Emreis II   já jich mám k dispozici 200 tis. a nevadí mi to, místo to nezabírá. Naopak, když jsem teď měnila za artefakty pro Ohniváka, nemusela jsem jejich počet vůbec řešit. [BR]Hráči, co nově věž odemknou, ti jich mají opravdu málo a musí rozčarovat věci v inventáři, aby mohli něco vykraftit v akademii. [BR]Nejsem taky extra nadšená, když jich padá víc než musí. Na druhou stranu si neumím představit hru, když by nebyly tak snadno dostupné a já je musela doplňovat rozčarováním z inventáře jako to mají začínající hráči. [BR]Pokud by vám vývojáři vyhověli a místo úlomků by padalo něco \"lepšího\", za chvíli by se nám snížily počty natolik, že by byly nedostatkové. [BR]Asi by se pohled všech změnil, když by chodily recepty na krmení, stromky, požehnání na kladívka a ony by chyběly úlomky kouzel??? Jak to pak vykraftíte?"}, {"118": "Úlomků mám taky dostatek. Akademie mi nikdy nestojí, takže jsem ráda, že je nemusím řešit. Stěžování na jejich přebytek by se mohl změnit na jejich nedostatek a na stížnosti, že v Akademii není možné vyrábět dle libosti. Na stížnosti typu mám toho mraky, udělejte s tím něco, bych byla velmi opatrná [smilie--sprite2]."}, {"3": "pavelb napsal/a:@Emhyr var Emreis II - no ne všem se toho válí ve skladu mraky a je lepší mít víc, než míň. Věž hraju kvůli časovačům a činidlům ze společných odměn a jsem rád, že nemusím ty úlomky vůbec řešit. Ve skladu mi nehnijou [smilie--sprite2]Klikněte zde pro zvětšení...já si taky úplně nestěžuju. Ale těm stěžujícím rozumím. Vyvinou nějakou snahu, mají slíbenou aodměnu a dostanou něco, co nepotřebují. Tím spíš, když vidí, že procentuální šance na něco užitečnějšího byla relativně vysoká... taky mi teď 2x po sobě prostřední boss ve věži hodil portálovku 10 %... to má být odměna? Ale ono se to zase otočí [smilie--sprite1]"}, {"77": "mám nedostatek času na hru, s tím by mohli vývojáři taky něco udělat [smilie--sprite8][BR][BR]GorGlin napsal/a:\t\t\tProč ty úlomky neutracite?\t\tKlikněte zde pro zvětšení...[BR]zlaté úlomky utrácím ostošest, mám jich totiž dostatek [smilie--sprite2][smilie--sprite1][BR][BR]S Věží, kterou jezdím pravidelně až nahoru, mám takovou zkušenost, že ona dlouho nedává a potom dává a stojí to za to, dlouho nic nic a najednou hromada dárků. Co bych v obou Věžích v obou světech viděla jinak, že na určitý typ odměn je štědřejší, v jedné pořád dostávám lepidla a ve druhé pořád úlomky, samozřejmě jak jinak, než to, čeho mám na skladě nejvíc [smilie--sprite7]"}, {"21": "mam 5 Mesicnich knihoven v sade a Akademie me ji nenabizi tak je to stejne jak u rostoucich budov"}, {"77": "jsem reagovala na něco, co neexistovalo, ale za odpověď, která sedí, @indian068 díky!"}, {"117": "Teď jsem brouzdáním na fóru zavítala do diskuze o řemeslné výrobě ... někdy kolem 11/2018, kdy to bylo poměrně nově zavedené a ony ty úlomky kouzel, na které se tu nadává, že jich je až moc, opravdu řešili rozčarováním inventáře a byl jich nedostatek. Nechtěla bych to zažít. [smilie--sprite9][BR]Vlastně jsem to zažila v začátku, kdy jsem měla akademii postavenou na konci l. věku a věž až od lll. věku.[BR]Buďte rádi, za cokoliv, co je navíc.[BR]Když tu občas čtu, co bylo/nebylo...tak je hra o kus dál a přijde mi, že se vývojáři snaží hráčům opravdu vyhovět a hraní zpříjemnit [smilie--sprite2]."}, {"97": "Ve Věži jsem vyhrála Kouzelnou obytku. Problém je v tom, že jí po čase budu muset zahodit, protože na vylepšení vyžaduje plánek a to já nemám. Dotaz zní: Je možné získat plánky jiným způsobem než v turnajích nebo DS? Třeba ve vyšších stupních Věže? Na mapě jsem viděla spoustu obytných budov na patřičné úrovni u hráčů, kteří hrají samostatně. Jak je vylepšují? Děkuji za případnou odpověď."}, {"19": "Plánky získáš výhradně v turnaji v 10 truhle. Kouzelné budovy se dají  kromě plánků vylepšovat ještě za diamanty - 300 Dia za jedno vylepšení."}, {"81": "ahojky také mám smůlu na vzácné věci z truhel a když už je to tak tak by bylo alespon dobré dát tu lepší truhlu 100% do každé lokace padni jak padni ,co vyleze už tak nebolí jako to když máte 10%,vymlátíte vše a pak zjistíte že ani nemá cenu tu věž dělat, MOTIVACE těch lepších truhel v každé sekci by přišla vhod alespon jako malá útěcha všem a člověk pak vidí smysl proč tu věž jet až nahoru ,můj názor"}, {"3": "je fakt, že portálový bonus 10 % z bosse je fakt zvláštní odměna..."}, {"4": "@reishi - pro mne jsou největším přínosem z věže časovače a činidla ze společných odměn. Truhličky jsou jen bonusem a padne-li něco lepšího, tak pak je to superbonus [smilie--sprite2]"}, {"2": "Ano, vež mi drží v chodu řemeslnou výrobu a doplňuje vojáky. Ostatní je bonus"}, {"6": "Nadával jsem na časovače, kudy jsem chodil, než jsem přišel na to, k čemu všemu vlastně jsou. Bez Věže bych s nimi a činidly měl neskutečný problém. Spíše mě sejří artefakty. Stone jsem dostal jenom 7 a přitom jsem jel věže až na vrchol. Mám tu hafo jiných artefaktů a základů z událostí a SD. Tak co s nimi?"}, {"117": "Emhyr var Emreis II napsal/a:\t\t\tje fakt, že portálový bonus 10 % z bosse je fakt zvláštní odměna...\t\tKlikněte zde pro zvětšení...A v bonusové truhle bokem třeba 50 % .... [BR]Teď jsem ráda i za port. bonus, protože nemám v plánu ráj panen stavět, tak bych nerada získala artefakt ... byl by mi k ničemu."}, {"119": "Ahoj všichni,měla bych dotaz,na mobilu se mi ve věži věčnosti objevil symbol,který nevím co znamená. Je hned nahoře při vyjednávání vedle truhličky na seznam surek co zrovna potřebuješ. Vypadá jako fialový disk nebo klobouk a je u něho v políčku 0. Nikde jsem o tom nenašla zmínku. V PC to není. Dík za odpověď"}, {"120": "@jirinas Fialové kolečko - počet bodů esence (ale tam je 1, 2, 3 vedle), případně modrý \"klobouček\" s nulou a procenty (či nějakým číslem) je počet objevivších se záhadných truhel. Myslíš něco z toho?"}, {"78": "[IMG]https://i.ibb.co/HBN9MHp/https-cz-forum-elvenar-com-index-php-attachments-v-jpg-5738.jpg[/IMG][BR][BR]Podle mě myslí toto a také by mě zajímalo co to je. [smilie--sprite1] Jo a mám to i v Pc."}, {"116": "no jo zase naka protekce ja mam kulove ale stejne si myslim ze to prijde az pozdeji no uvidime a mas k tomu nejaky popisek kdyz na to najedes?"}]