[{"119": "nataly111 napsal/a:Zobrazit přílohu uživatele 5738[BR][BR]Podle mě myslí toto a také by mě zajímalo co to je. [smilie--sprite1] Jo a mám to i v Pc.\t\tKlikněte zde pro zvětšení...jo tohle myslím[BR][BR]Hexik napsal/a:\t\t\tno jo zase naka protekce ja mam kulove ale stejne si myslim ze to prijde az pozdeji no uvidime a mas k tomu nejaky popisek kdyz na to najedes?\t\tKlikněte zde pro zvětšení...žádnej popisek,proto se ptám a na PC to nemám jen v mobilu"}, {"120": "Jo tak to tam nemám... Hm, tak nevím. :-("}, {"24": "Na bete sa tento fialový predmet objavil tiež, vtedy bol k nemu dostupný aj nejaký popis a hovorilo to niečo o nejakej výhode pri vyjednávaní. Zrejme to teda bude nejaký nový zberateľský predmet ktorý bude mať efekt na vyjednávanie vo veži."}, {"120": "V jiném vlákně na fóru se uvažovalo o souvislosti s novou funkcí Archiv věže, tak to asi nebude ono..."}, {"16": "@12alfa Ne, to je jiná funkce. S ní souvisí nové tlačítko s + na konci teploměru věže pro přidání uložených bodů, zřejmě viditelných jen zástupcům a veliteli."}, {"120": "@Lovec Krys Děkuji! Tak se tedy necháme překvapit. [smilie--sprite1]"}, {"121": "já tam popisek mám...Spektrální kámen - Nabídka přijatá všemi duchy, ale pouze jednou za diplomatický střet ve věží. Zvěsti o uvězněné duši poutají pozornost všech duchů...moudrá z toho ale nejsem [smilie--sprite8]"}, {"2": "To vypadá, že bude nějaká měna která ti umožní vykoupit výkup."}, {"116": "dle popisku to vypada ze tim nahradis kteroukoli surovinu v danem stretu a ze tim zaplacnes jedno vyjednavaci pole tak bych to pochopila ale zatim nevim ze by to bylo nekde k ziskani i na bete[BR]videt je to porad jen na mobilu uz jsem se dnes na to taky koukala tam jsou holt napred jako obvykle"}, {"122": "Ahoj, prosím co bude dále ve věži za artefakty ??"}, {"2": "Myslím že teď vychází Fenix chladného ohně"}, {"116": "je to jiste na bete jiz jsou a uz mi prisla i zde zakladna do vyroby ale kdy to vychazi netusim nepocitam ty veze"}, {"116": "tak uz mi padlo 5 dousku vyjasneni ve vezi ani jsem si nevsimla ze to v nakych truhlach je[BR]fajn neni to spatne ze jde ziskat i v te vezi"}, {"2": "A jsi si jistá že to bylo z věže?"}, {"4": "Bylo, mě též padly ze střetu ve 3. patře [smilie--sprite2]"}, {"2": "A z čeho?[BR]Boss, bonusová bedna?[BR][BR]Aha, tak už vím.[BR]A taky jsem je dostal."}, {"116": "jo padlo mi to pred posledni branou[BR][BR]Vcera jsem na to koukala 55% sance bohuzel jsem se nedivala jestli je i v jine truhle ale nejspis jen v te jedne"}, {"2": "@Matesov [BR]Tvůj příspěvek z perks mě vedl k zamyšlení.[BR]K čemu vlastně věž je?[BR][BR]Když tak vezmu jaké z ní padají odměny:[BR]urychlovače a instanty na zásoby z části sežere věž sama[BR]ulomky kouzel a kouzla pohání moji řeneslnou výrobu[BR]budovy, no, jak která, ale obecně bych to nazval příjemným bonusem[BR]a samozřejmě artefakty, jejichž potřeba se mění hráč od hráče[BR][BR]záměrně jsem vynechal teleporty a diamanty, které si hráč může pojistit vyšplháním až nahoru a mít je jak se říká jisté[BR][BR]já jezdím věž až nahoru a celkově vzato si myslím, že ke mě je štědrá.[BR]Mám v inventáři několik sad knihovny na horší časy, věž mi živý nejen řemeslnou výrobu, ale i vojenskou produkci, protože bez urychlovačů které z ní mám bych nezvládal vyprodukovat dostatek vojáků[BR]A ted  navíc mi dává Urinu která mi umožnuje plynulejší průchod rasou[BR][BR]Budovy jsou báječná věc a jestli dostanu i druhou dílnů už mi nebude scházet vůbec nic[BR][BR]Samozřejmě jsou chvíle kdy je ke mě věž skoupá, za sto dní trvání džinů mi nepadl ani jeden.[BR]Halt není každý den posvícení.[BR][BR]Ale celkově vzato, když tady čtu o ohromném přebytku úlomků kouzel, nebo urychlovačů, mám dojem že jsem asi divnej.[BR]Já ho nemám.[BR]Držím si nějaké zásoby, ale nerostou, co dostanu použiju.[BR][BR]Samozřejmě můj osobní názor, postoj a zkušenost, jsem si toho vědom.[BR]Jaký je váš?"}, {"26": "Já musím jen souhlasit, věž je dobrá a přínosná věc.[BR]Jen úlomků kouzel mám poměrně dost, ale od doby, kdy se začaly objevovat spojovací činidla za 5000 úlomků již nijak závratně jejich počet neroste."}, {"31": "Tedy já už přebytkem úlomků kouzel netrpím. Ty dva nové recepty za 5000 úlomků zásoby spolehlivě zlikvidují. Už jsem musela omezit kraftění urychlovačů a uchýlila jsem se i k nouzovému rozčarovávání budov v inventáři (dříve pouze v eventových úkolech). Zastaralé postavené eventovky už neprodávám, ale teleportuji zpět do inventáře na rozčarování. A za každých pár úlomků z věže jsem vděčná."}]