[{"10": "@[BR]Prealiena Teleportuji i budovy osadníků, které pak za úlomky měním. Pro event je to ideální, postupně se jich zbavuji. [smilie--sprite1]"}, {"116": "ty jo to me zase prijde skoda placat takto teleporty jinak taky uz u hexika poklesla zasoba diky receptum za 5k ulomku uz se musim divat jesti tento recept vyrobim a nebo nemam takovou zasobu ulomku abych mela i na jine recepty"}, {"123": "Věž je super a rozhodně se vyplatí jezdit ji až nahoru. Jasně, občas jsem trochu nešťastná, když mě souboje stojí moooc zdrojů a za odměnu mi padne PPčko [smilie--sprite1]. I tak to za to ale stojí. A teda úlomků mám dycky tak plus minus abych vydržela do další věže :-D."}, {"124": "Věž je supr dobrý zdroj na dia a teleportační kouzlo se také hodí Na A mi dává hodně zbrojířů což ovšem nemůžu říci o W tam je situace úplně opačná tam dostávám to co zrovna nepotřebuji čili úlomky,ale ty zas nedostávám na A kde musím často rozčarovávat v inv abych vydržel Je fakt, že na A jedu věž celou tak 1 max 2x za měsíc a na W jí jezdím každý týden až nahoru pokud není nějaká hoodně nepříznivá situace"}, {"125": "Opravdu by mne zajímalo, kdy konečně z Věže zmizí ty pro absolutní většinu hráčů naprosto zbytečné artefakty a vrátí se tam třeba Měsiční knihovna nebo něco jiného, využitelného opravdu pro všechny.[BR]Artefakty patří do řemesel, a taky se tam objevují, tak proč jsou i ve Věži? Zde bych očekával odměny, které využije každý k jejich primárnímu účelu, ale artefakty využije jen málokdo (buď má hotovo nebo ho to nezajímá) a pro ostatní (a je to absolutní většina) jde jen o předmět pro rozčarování na úlomky kouzel.[BR]Je to opravdu k pláči, když jen za první patro dostanu 2-3 artefakty Májového stromu nebo něčeho jiného stejně zbytečného."}, {"2": "Protože hráči co začali, řekněme v poledním roce, je nemají a pro ty, co poskládali druhou devítku, ted byla možnost koupit druhý májový strom[BR]Já sám čekám na některé aretfakty, nebo hráči s budovou, které po eventu neměli DSko a hráčům chybí poslední.[BR]Kdybych měl volit podle sebe, tak tam jsou jiné věci, ale tahle hra není jen pro jednoho hráče."}, {"125": "O to přece nejde, je mi jasné, že někdo to potřebuje (i když pro mne to je nepochopitelné, kromě Ohnivého Fénixe jde většinou o zbytečné budovy [smilie--sprite1]), ale proč z Věže? Ta má být pro všechny a nejen pro někoho, tedy ty odměny. Jak jsem psal - ty artefakty patří do řemesel (stejně tam jsou), kde si je může ten kdo je potřebuje vyrobit.[BR]Koneckonců těch, co o to mají zájem, je proti těm, co zájem nemají, asi absolutní menšina.[BR][BR]Odstraněna citace. Embla"}, {"18": "@SmolicekPacholicek to je možná pravda, ale na druhou stranu si uvědom, co ty artefakty v řemeslné výrobě stojí. A pokud nejsi ve spolku co dá pravidelně 10truhel aby měl plánek a současně máš ve městě kouzelné budovy a je jedno či dílny nebo obytky. Tak v okamžiku kdy už nějaký schrastíš si hóóódně rozmyslíš za co jej využiješ. Pak zbyde jediná možnost zaplatit výrobu diamantu diamanty."}, {"8": "tj vsichni maji zpusob je ziskat, \"zdarma\" v eventu, a ti co nehrali event tak \"zdarma\" tim, ze se obklopim schopnymi lidimi  a plni turnaje, \"zdarma\" tim ze sporim diamanty z veze akoupi si je, nebo si je proste za penize koupi dia za ne si je koupi."}, {"6": "Začíná  mi připadat, že hlavně ve druhém patře Věže, jsou sestavy postavené vyloženě tak aby \"trápily\" hráče. Třetí je pak většinou odpočinek. I když..."}, {"31": "Ok, proč mi střety ve věži stále ukazují artefakty Útočiště královny víl?"}, {"17": "Možnost získání Útočiště královny víl byla nakonec prodloužena z klasických 6 týdnů na 7 týdnů. Nicméně nemusíte se strachovat, v příštím kolem Věže věčnosti už budete moct získat avizované odměny spojené s Triumfem odlivu a přílivu. Omlouváme se za způsobené komplikace!"}, {"6": "Co to, Věž začíná v 16.00?"}, {"16": "Buď rád, že alespoň začala [smilie--sprite8]"}, {"126": "Kolik tak běžně padá artefaktů za 6-týdenní cyklus? Já jsem se dostal do stavu, kdy nemám problém projít celou věž, ale když mám 1 artefakt za týden, je to úspěch. Takže dostat cokoli na 10 je prakticky nemožné - a některé budovy jsou pod úrovní 5 vcelku slabé."}, {"8": "osobni rekord mam asi 4-5 artefaktu [smilie--sprite8] takze aby se miska vah vyrovnala jini meli utrum a nemeli nic [smilie--sprite2] ve skladu mam nekolik 8-ckovych artefaktu ktere mi jsou k prdu protoze k nim nemam druhou zakladnu. + nekolik zdvojenych zakladen a pres vez doplnenych. Takze jde to. A i kdyby to slo 1 artefakt za vez, tak to znamena za 2 mesice mas plnou. urcite nic nemozneho."}, {"16": "@GrizzlyTom Ony jsou většinově slabé i na lv 10. V průměrném počtu artefaktů z věže moc sloužit nemohu, jelikož kolik artefaktů dostanu z věže moc nesleduji (obvykle doufám v pro sebe užitečnější odměnu než je artefakt)."}, {"126": "Nevím, jak je to na vyšších kapitolách. Ve fázi, kde jsem já, jsou často lepší než fabriky na neposílené zboží (a zaberou méně místa). Pokud dávají zlato/zásoby/posílené zboží, tak jsou slabé.[BR]Za předpokladu 1 artefakt/týden a 6-týdenní cyklus by byl průměr úroveň 7 na budovu, ale většinou mám tak jeden za 2 týdny, což je hodně slabé. A v batohu asi 500 urychlovačů, ty padají jako o život."}, {"16": "@GrizzlyTom Ve fázi Lesních Elfů by tě něco jako neposílené manufaktury neměly už ani napadnout. Od toho jsou posílené + obchod. Já na to přišel někdy ve 4.-5. kapitole, když jsem začínal (tak v průběhu 5. kapitoly jsem všechny nebonusové zboural a místo nich přistavěl posílené a obchodoval (evo budovy (ani sety) tehdy ještě nebyly a stejně mi přijde rozumnější mít kupu manufaktur než kupu evo budov)."}, {"21": "Lovec Krys napsal/a:\t\t\tstejně mi přijde rozumnější mít kupu manufaktur než kupu evo budov).\t\tKlikněte zde pro zvětšení...Záleží na stylu hry já od začátku používám po jedné posilene manifakture, se základním zbožím neobchoduju od 5 kapitoly, evo budovy využívám dle mých potřeb"}]