[{"16": "@indian068 Pokud je máš na max. a v aktuální kapitole, tak klidně může být. Ale pokud někdo používá větší množství evo budov na nižších úrovních, případně ještě několik kapitol starých(*), tak to nemůže být efektivnější než produkce manufaktur, kulturních hybridů(mana, semena, ap. v aktuální kapitole), či čehokoliv jiného.[BR][BR](*) - neplatí pro evo budovy postavené kvůli produkci VB, činidel, kouzel, apod. postavené jenom kvůli této speciální produkci nezávislé na kapitole."}, {"21": "Lovec Krys napsal/a:\t\t\tneplatí pro evo budovy postavené kvůli produkci VB, činidel, kouzel, apod. postavené jenom kvůli této speciální produkci nezávislé na kapitole.\t\tKlikněte zde pro zvětšení...Jiné se nevyplatí"}, {"6": "Když dojedeš 20. kapitolu, tak jsou všechny manufaktury posílené. Záleží na zboží, které potřebuješ.[BR]Takže všichni, kterých se to týká, čekají, co vlastně v té vzývané 21. kapitole bude, a podle toho aktuálně sestaví své město. Zatím je to, alespoň u mne, většinou takové to blemcání od ničeho k ničemu a vykecávání se na fóru."}, {"21": "Schoenfeld napsal/a:\t\t\tKdyž dojedeš 20. kapitolu, tak jsou všechny manufaktury posílené.\t\tKlikněte zde pro zvětšení...Nemám v plánu pospichat do 20 a dal po letech hraní pod INO si chcu hru užít"}, {"126": "Lovec Krys napsal/a:@GrizzlyTom Ve fázi Lesních Elfů by tě něco jako neposílené manufaktury neměly už ani napadnout. Od toho jsou posílené + obchod. Já na to přišel někdy ve 4.-5. kapitole, když jsem začínal (tak v průběhu 5. kapitoly jsem všechny nebonusové zboural a místo nich přistavěl posílené a obchodoval (evo budovy (ani sety) tehdy ještě nebyly a stejně mi přijde rozumnější mít kupu manufaktur než kupu evo budov).\t\tKlikněte zde pro zvětšení...Ano, neposílené manufaktury jsem zahodil už dříve - myslím, že to bylo pávě někdy kolem 5. kapitoly. Vylepšitelné budovy mi přijdou dost individuální - některé dobré, některé nic moc, podle toho, co potřebuju. A budovy ze sad a událostí to pak dorazí."}, {"5": "Zatim plati co je staré je dobré...[BR]Poslední měsíce možná roky nic přímo zářného do města nepřišlo...tím považuji některou z budov v TOP první desítce: ať již kulturu, manu, obyvatele, semínka léoe sklízet v tržišti, urunium pak skrze divy...[BR]Na sraré sety nedám dopustit vůbec...[BR]Rozvíjející budovy z nouze ctnost pouze něco většinou končí ve skladu...[BR]Věž, turnaj každoťýdenní rutina...určiťé zpestření přináší DS - přesto stále bez adekvátních odměn za odvedenou práci a aktivitu...[BR]Občas něco přinese nějaký event, i když jak píšu nic zářného byť jen na výměnu do letitého města...takže nej očekávání se vkládají do nové rasy [smilie--sprite1] snad v září jako loni..."}, {"6": "A už to zase začíná v 17.00."}, {"126": "Ha, a jako tento týden, beztak dalších 0 artefaktů."}, {"127": "Tak mě tak napadá, proč po skončení věže není přístupná pro společenství tabulka, kde by byl seznam členů s počty bodů co nahráli.[BR]Stejně jak je pro turnaj plus by bylo dobré, pro ty co se nezúčastnili, kdyby byli uvedeni i ti hráči v tom seznamu s nulou. Vím, že je na to elvenarstats, ale nevím proč by to nemohlo být implementováno přímo ve hře i se zahrnutím věže věčnosti, byl by to užitečný nástroj pro velitele či zástupce, jak mít přehled o tom, kdo jak se zapojuje a myslím si, že by to mnoho společenství uvítalo.[BR]Nevím jestli už dříve něco takového projednáváno či zvažováno bylo, tak by mě zajímalo proč to nebylo zavedeno."}, {"9": "ano asi jiz mnohokrat navrhovana zmena jiste ne jen u nas na ceskem snad nas brzy vyslysi"}]