[{"35": "8[BR]Lovec Krys napsal/a:@donutka Tohle už je zlevněná verze. V původní verzi ty náklady byly ještě vyšší.[BR]Samozřejmě skoro všem, kromě vývojářů, je jasné, že je to furt moc.[BR]V současném stavu je hratelné tak první patro, pak poměr nákladů vs zisku naroste do absurdních výšin.\t\tKlikněte zde pro zvětšení...Tak to je pro me v tom pripade jeste vetsi wtf[smilie--sprite12]treba to jeste zmeni, jestli ne, tak to snad ani nikdo hrat nebude... protoze ani za diamanty ty odmeny nestojí"}, {"41": "Tak ja nedostala ani dárek na email.. Bohužel, takže tahle vež žádne pozitíva [smilie--sprite1]"}, {"3": "každý, kdo má potvrzený mail ho dostal. Problém bude na tvé straně. Mrkni do spamu nebo nastavení hry... při nejhorším napiš na podporu"}, {"41": "Mrkala jsem všude a nic [smilie--sprite1] Tak jim zkusim napsat [smilie--sprite8][BR][BR]Joo,už jsem zjistila čím to je a to tím,že nemám povolené,at mi posílají newsetlery [smilie--sprite1][BR][BR]Příspěvky sloučeny. Embla"}, {"48": "@Turunen psal, že každý postuje, jak si vyjednal odměny. Tak tady je ukázka mého pohoření s prvním bossem, kde jsem si to ovšem částečně zavinila sama jedním špatným ukliknutím při diplomacii. A Fénix na Level 10 (poškození jednotek 50 % aktivované) mě dostal přes dvě vlny, třetí už nedal. Na druhý pokus sice vyjednáno, ale ztráta surovin a za to jen 30 diamantů...[BR][BR]Úplně napravo dávám kladiva, zpátky se mi vrací \"Špatná osoba\"[BR] [BR][BR]A tady to ukliknutí, zase dávám úplně napravo kladiva...[BR] [BR][BR]... takže to dopadlo takhle.[BR] [BR][BR]Na podruhé vyjednáno až s pomocí dia. 25 vloženo, 30 vyhráno. Skvělé, ne? [smilie--sprite11] A čekáme, tentokrát 12 hodin na vstup do druhého patra.[BR]"}, {"56": "Škoda já na e-mail taky nic nedostala Minule jsem dostala dárek a teď nic[BR][BR][BR]Tak oprava e-mail přišel jen jsem slepá[BR][BR]Příspěvky sloučeny. Embla"}, {"58": "Věž je příliš obtížná. Souhlasím se všemi, komu se  nelíbí. Bojovat se dá  bez velkých ztrát  pouze  v první části. Odměny v truhličkách  nestojí za  ztrátu  vojáků ani za ztrátu  surovin a diamantů už vůbec ne!  Věž  je  pořádná zlodějka postavená na čerpání peněz  hráčům z kapes, protože  bez použití drahých  diamantů se hrát  nedá. Takže - adiós."}, {"42": "Věž je jen tak těžká, jak má člověk nedovyvinuté město. Uznávám, že slabé města si zde moc nezahrají, což vyvolává pocit nezadostučinění s \"novinkou\" ve hře. A opravdu je rozumné rozhodnutí tuto novinku ignorovat, dokud člověk na to nebude opravdu mít.[BR][BR]Skutečnost je taková, že věž není těžká, jen jste slabí na to, aby jste ji zvládli s prstem v nose a tento fakt je důležité si uvědomit.[BR][BR]Takže tuto novinku chválím je to hezká sólo výzva."}, {"15": "věž se mi líbí - ale jen po výtvarné stránce . Těšili jsme se- no co se  dá dělat, že . Na každém světě jsem projela jednu a zjistila jsem , že bych byla v jednom kuse na nule . Takže děkuji , stačilo.Snad to příště bude lepší . [smilie--sprite10][smilie--sprite3][smilie--sprite10][smilie--sprite8]"}, {"20": "@Fjorgyn  Mýlíš se. U většiny z nás, co se nám Věž nelíbí, není problém, že bychom jí nezvládli, ale nelíbí se nám celková koncepce. Kdybych nehrála turnaj na 10 beden, tak by pro mě Věž nebyla až tak těžká, ale šetřím vojsko. Na úplaty mám, ale plýtvat a pak dostat urychlovač na 1 hod.? Trapné. Přestože to je paskvil, tak to kvůli své paličatosti zkouším a 2/3 druhé mapy mám hotové."}, {"43": "@Fjorgyn To není upe pravda fjo, mám všechny bojové divy, fénixe na 10., jednotek že nevím co s nima, věž zvládám zatím vybojovat všechny střety (zatím druhé patro), ale i mně věž přijde neadekvátně těžká...utrácíš desetitisíce jednotek a statisíce surovin a za to dostaneš pár úlomků kouzel a zrychlovadlo na 2 hodiny? Věž může být těžká, ale odměny musí být adekvátní. Se současným nastavením malí hráči nemají stimul, aby se zlepšili kvůli věži, protože tam stejně není nic, o co by chtěli zabojovat. Je fakt, že kdyby poměr náklady/přínosy byl lepší, asi zase budou malí hráči prskat, že je to událost pro velké hráče, ale aspoň by měli tu vidinu toho, že jak se budou zlepšovat, dosáhnou na lepší odměny ve věži, což při současném stavu opravdu nehrozí."}, {"39": "@Fjorgyn  A můžu se zeptat, kolik ti admini poslali na účet diamantů za ten tvůj příspěvek?"}, {"31": "@stani A kdo tě nutí do toho proboha dávat diamanty?[BR]No tak nezvládneš vyjednávání na tři pokusy - tak začneme od začátku, nestojí to o nic víc, než dalších pár tisíc surovin. Ale když jsi do toho šel, viděl jsi, kolik bude potřeba, a počítal jsi s tím, že to budeš muset zaplatit více než jednou.[BR][BR]Tak už přestaňte skuhrat, že jste to nezvládli na první pokus a bezpodmínečně musíte do toho házet dia. Pro Krista pána za jakou kravinu ještě budete chtít utrácet příště?[BR][BR]Souhlasím s @Fjorgyn pokud se vám zdá věž v současnosti příliš těžká, tak ji nehrajte a zkuste si počkat o kapitolu výš. Alespoň máte motivaci se rozvíjet.[smilie--sprite1]"}, {"59": "Nevim no, mě se věž docela líbí, sic odměny možná nejsou úměrné výdajům. Třeba by to chtělo víc unikátních odměn, aby to bylo zajímavější, mě padaly povětšinou úlomky kouzel, kterých mám hromadu z artefaktů. Ale zase si nemyslím, že by to mělo být něco, co by měl hrát každý a za každých okolností. Všichni to hned přepočítávají na jistý zisk, a to asi nebyl záměr. Jistý zisk je např. turnaj."}, {"60": "Souhlasím s Nostrem  moc surovin a hlavně vojska taky končím.."}, {"42": "@veeelkyyy stavitel a @Ludi  - První patro jsem prošel téměř celé v klidu i bez nažrání fenixe. Toto jsem nakrmil pro jistotu na poslední 3 kolový boj a vyšel jsem vítězně s minimální ztrátou jednotek. Takže za sebe mohu říci, že pro mě je první patro tak jednoduché, že to jsou úlomky kouzel a činidla zadarmo, aniž bych ohrozil společenství v turnaji. A až posílím tak budu pokračovat v čistění druhého patra atd. Je fajn zjisti svůj limit ve hře.[BR][BR]Navíc pokud bude pravidelněji padat boosty na 150% životů nebo ty útočné, úplně se změní i náročnost v turnaji.[BR][BR]@Daggoth32 - Já jsem popsal fakt, nepotřebuji za to platit. Stále se budu držet toho, že je to jen o síle města a o strategii. Člověk prvně musí zesílit, aby mohl něco dokázat. Ani nemusím mít diamantové město, aby šlo hrát."}, {"20": "@Prealiena  Většina lidí tu nenaříká nad tím, že Věž je nehratelná. (I když někdo ano) Hrát se dá, ale v diskusi většina nesouhlasí s neúměrným množstvím výdajů ať na vojsko nebo na surky s odměnami, které jsou v porovnáním s výdaji naprosto směšné. Ale souhlasím s tebou, že vrážet do Věže dia je naprostý nesmysl.[BR][BR]@Pauleo  Samozřejmě, že za vložené zdroje chce každý úměrný zisk. Na tom nevidím nic špatného. Jistě, Věž je určitá výzva, ale přeci jen, ani kuře nehrabe zadara a natož se ztrátou [smilie--sprite2]"}, {"26": "Já jsem prošel komplet celé první patro celkem v pohodě, jednou jsem pro zajímavost zkusil vyjednávat. Boje je podle mně nutné hrát na PC na manuál, automat má nepřiměřené ztráty.Druhé patro už mi vzhledem k odměnám připadá jako plýtvání jednotkama, resp. surovinama. Myslím, že budu pravidelně hrát první patro - i tam lze nasbírat kompletní sadu měsíční knihovny, i když to asi potrvá dlouho.. Z prvního patra mám manovec a knihovnu.."}, {"31": "@Ludi Ano, taky bych ráda ve věži něco lepšího. I když, jak říká @Pauleo, není to jistý zisk. je to loterie, něco jako permanentní event. A možná právě proto jsou ty odměny nijak oslnivé. Dokážu si představit, že pojedu pravidelně první patro a jednou, třeba za devět týdnů, když nebudu hnát turnaj, tak zkusím věž o něco výš.[BR]Ale sakra ty kouzelné budovy by to chtělo. Alespoň do poslední truhly ve třetím patře s desetiprocentní šancí. To by vás v Hamburku nezabilo.[smilie--sprite8][BR][BR]A ano, ten předešlý příspěvek byl míněn na těch pár, co naříkají nad kupováním pokusů za dia. Dost mě zarazilo, když tu od prvního dne lidi píšou, jak tam hrnou diamanty a diví se, že nedostanou hromadu nazpět. Proč pro boha, copak hoří?"}, {"59": "Ludi >> Tak ať to nehraje, když je to zaručená ztráta, a kuře potřebuje hrabat najisto. Začátek mi určitě ztráta nepřijde, jen se tam mění něco za něco, někde i nic za něco (některé bezztrátové souboje). Pokud tam budou nějaké slušné unikátní odměny, které můžou padnout, určitě se najdou hráči, kteří je zkusí získat, i kdyby něčím zaplatili. Kdyby to bylo jisté, měl by hned vše každý, a nemělo by to moc smysl. Byl by to další turnaj, kde by se měnily kladiva na kouzla a VB, a bylo by nutné ztížit hru. Je to jako s řemeslničením v akademii, řada vrcholových hráčů jí bere jako zbytečnou, bezcenou a ztrátovou, přesto se najde nemálo hráčů, kteří tam nějaké doplňky občas vyrábí a užijí je."}]