[{"20": "@Pauleo   Tak právě jsem dokončila 2. mapu se žabákem a je tam čekání 24 hod. než se otevře další patro.[BR]Prostě a jednoduše: Věž jsem si vyzkoušela a tím to hasne. Jestli půjdu do 3. mapy nevím, uvidím, jak bude vypadat. [BR]Hrát pokaždé jen 1. patro je jistě určitá možnost, ale to mě nebaví. Prostě chybí motivace v podobě lepších odměn. On ani ten set není zase kdoví co, na to jaké místo zabere. Doposud jsem se bez něj obešla a nouzí netrpím [smilie--sprite8] [BR]To je celý problém: Věž je promarněná šance, ale třeba se ještě něco časem změní."}, {"54": "donutka napsal/a:\t\t\t130 diamantu a 6000 úlomků za to vojsko /suroviny fakt nestojí... 130 dia mam ze studen zadarmo a 6000 ulomku je za dva rozkraftene artefakty... takze pomer naklady / výnosy naprosto neadekvatni... pro lidi v mensich kapitolach asi ok, ale pro vyssi kapitoly na nic\t\tKlikněte zde pro zvětšení...Treba mi to jednou prijde naprd, ale vlo vojsko jsem skoro neprisla a co se tyce surovin, tak jsem sysel a nevim co a s nima [smilie--sprite8] takze prvni mapu klidne obcas zahraju...ale druha uz je o nicem, to je masakr..."}, {"61": "Věž jako taková dobrý nápad,ale není vybalancovaná obtížnost vs. odměny... Osobně věž zkusím asi jen do otevření třetího patra. Radši pojedu turnaj než věž. Navíc tu máme aktuálně event + turnaj + věž ... ještě otevřete DS a máme to komplet..[smilie--sprite9]. Pokud hráč nic nestaví a jinak neutrácí,snad to jde uhrát. [BR]Jak psala Ludi... bud zjednodušit průchod věží nebo dát atraktivnější odměny."}, {"48": "Jak píše @Paja hokejka jsem taky sysel a surovin mám dostatek (až do teď, po prvním nakouknutí do druhýho patra už malinko průvan). Ale taky jak píše @Ludi, začínám na to nahlížet taky jako na promarněnou šanci. První duch ve druhém patře, diplomacie zklamala a i přes aktivovaného Fénixe s 50% poškození vojska ani ťuk. Tak si rozmyslím, jestli vůbec pokračovat, to radši aktuálně spíš turnaj, odměny v truhle ducha nic moc...[BR] Event už je taky out, až na poslední den MP v lastuře nic zajímavého, navíc to po mě chtělo 4 glóby, které jsem měla udělané, ale hned potom devět dalších, které už jsem neměla, protože jsem měla hotový pece..."}, {"43": "@Fjorgyn Trochu jsem to špatně napsal, první patro je fakt v pohodě, tam mi ten poměr náklady výnosy přijde adekvátní, a dá se to v pohodě uhrát, ale třeba ve druhým patře je každej střet dvoukolovej a velikost oddílu dále narůstá, přitom odměny zůstávají prakticky stejný jako v prvním kole, a to už mi adekvátní nepřijde. Když bojuju těžší souboje, a musím vynakládat víc jednotek nebo surovin, měl bych za to taky vyhrát něco lepšího než v těch snazších střetech."}, {"5": "Tak mi to nedalo a projel jsem věž celou. Nadměrné ztráty vojska i surovin, k tomu padlo několik časovačů a samo i nějaké dia /bylo třeba některá kola vyjednávání rozšířit, protože při výběru např. z 8 druhů surovin, to fakt na 3 kola dáte jen s obrovským štěstím/. Mince a kladiva /vyšší patra chtějí i 1300k mincí, 130k kladiv na jedno zadání/ ty jsem ,,uměle,, pomocí požehnání doplnoval asi 4x, to samé s vojskem díky časovačům /přesto, že mám aktivované oba Ohniváky, tak to ve vyšších patrech bojujete i ve třech vlnách/. Důležité je vždy zkontrolovat stavy všeho dostupného, aby se vám v půlce vyjednávání nestalo, že vám něco z toho dojde, pak následuje restart a vše jde nazmar, žel ... Zžírá to dost i živého zboží, které je dobré míti ve skladu v dostatečné míře a vyváženě množtevně. Finále: nemám přesné počty nákladů/zisk ale rozhodně návratnost časovačů, dia, úlomků kouzel a činidel je v obrovském nepoměru nevýhodně pro náklady...to by se dalo ještě ,,překousnout,, pokud by byla zaručena dostupnost budov, pro které to /kromě zvědavosti/ člověk dělá...takže jsem získal po projetí všeho ,,pouze,, 3 budovy ze setu z toho Měsíční knihovna 2x, hráč tedy potřebuje ve věži i notnou! dávku štěstí k zisku něčeho svého vysněného či potřebného do města. Tady bych uvítal do budoucna bud´automatické získání některé budovy na konci každého patra nebo % zvýšení možnosti získání budovy, protože 10 nebo 20% oproti ,,zbytku relativně nepotřebných odměn,, je opravdu málo za veškerou snahu a množství ztrát. Závěr: Pojedu věž asi tak další dva tři týdny ,,naplno,, a uvidím zdali se mé štěstí k získávání budov nějak posune, protože zásoby nekonečné všeho nejsou a turnaje jsou v tomto co do náročnosti a následné zisky odměn značně zajímavější! ...případně, jak již zde mnozí psali jezdit pouze první relativně snadněji zvládnutelné patro a míti opětovně štěstí při zisku alespon nějaké budovy.[BR]PS: příští týden se polepším napíši podrobněji všechny náklady a ztráty versus zisky...Hezký den a štěstíčko ve věži všem [smilie--sprite1][BR]PS2: věž se mi jinak opravdu moc líbí co do vzhledu exteriéru i interiéru [smilie--sprite1]"}, {"20": "@ElfNostradamus  Jsi tu určitě jediný, kdo má dva ohnivé Fénixe na 10 lv., o dalších výhodách velmi rozvinutého města a divů nemluvě. Tušila jsem, že ti to nedá a projdeš to [smilie--sprite1]. Já zatím mám dvě patra a nevím, jestli do 3. půjdu. Urychlovač na otevření dveří použít nechci. Odměny na nic, ale hrála jsem to jen kvůli svojí paličatosti. Teď už je priorita turnaj. Nemíním snížit kvalitu turnaje přijít o všechny odměny ze hry kvůli Věžičce. Je moc krásná, o tom žádná, ale to je tak všechno."}, {"45": "ElfNostradamus napsal/a:\t\t\tTak mi to nedalo a projel jsem věž celou.....\t\tKlikněte zde pro zvětšení...[BR]...ako som uz tu pisal, ja som ju dal celu v prvy den, vsetko cisto bojom (prve poschodie automatom, druhe a tretie uz na 90% manualne, hlavne 3 vlnove sa inak ani nedali), bez jedineho vyjednavania, s vyuzitim fenixa +50%. Straty boli vysoke: Prisiel som o 65T strategov (30% z celkoveho poctu strategov v tabore), 162T strelcov (13%) a 34T knazov (6%), je to cca 6-dnova vyroba a vobec by ma to netrapilo, ak by odmeny boli adekvatne nakladom. Ja som ziskal iba dve budovy 1x1 a za zmienku stoji len zisk 255 DIA (ostatne odmeny som pisal na strane 3). Investoval som tiez casovace, (kedze celu vez som dal za 2 hod., bez prestavky) a v konecnom vysledku som o 28h casovacov investoval viac ako som ziskal...[BR][BR]...druhu vezu zahram tak, ze si boje rozlozim tak aby som pouzil co najmenej casovacov a naopak, vsetky ziskane casovace vyuzijem na dolnenie armady co stratim a urobim druhy zaver, pokial investicia bude len moj cas, ktory tu aj tak travim, tak si vezu zahram vzdy ako doplnok turnaja (ktory hram vsak automatom, alebo vykupom), pokial budem na vezi stale viac a viac stracat, tak sa na nu vybodnem, ci set bude alebo nebude..."}, {"62": "věž mám také hotovou, všechny 3 patra a nepadlo na to úplně málo zdrojů... ty průběžné odměny jsou slabší (snad vyjma svitků, na craftění, těch mám fakt mrtě). do setu mám 2 malé budovy, jednu z nich 2x. ty šance jsou fakt hodně malé... armádou jsem bral první patro, než jsem si uvědomil, jak brutální ty absolutní ztráty jsou, a dal už jsem jen vyjednával. diamantů také nepadlo málo na bonusové pokusy. [BR][BR]ale nejhorší je to fakt s živým zbožím. na trhu to chvíli trvá, takže použiju urychlovač na odemčení záclony abych zjistil, že musím čekat na výměnu živého zboží :-D (tím jsem nebyl dopředu moc zásoben). mince a kladiva neřeším, mana a semínka také v pohodě, ale třeba s orkama jsem šel fakt hodně dolů... zatím se mé zásoby orků nestihly vzpamatovat ze zvedání 2 konstruktích divů na 11 [smilie--sprite1])[BR][BR]abych to shrnul : věž je zajímavá. set je super. ale náklady? pořád se nemůžu rozmyslet, jestli mi to za to stojí. jednou jsem to dojel ze zvědavosti, na podruhé si dám určitě první kolo. dál se uvidí."}, {"24": "Druhá mapa dokončená, považujem ju za dosť nešťastnú. Odmeny na úrovni tých v prvej mape, avšak náklady sú zbytočne vyššie (kvôli nepozornosti v niektorých stretoch vo vyjednávaní). Našťastie to čiastočne vykompenzovalo šťastie v jednom strete kde som požiadavky správne tipol už v prvom pokuse, alebo relatívne dosť nízky počet pokusov na posledný stret.[BR][BR]"}, {"45": "odporucam posledny stret na 2 poschodi ist bojom, 1 strelec a 4 obrneny strelci, ist manualne, velmi dobre rozlozenie prekazok na bojovej mape. prejedene 3 vlny bez straty..."}, {"20": "Dokončila jsem celou věž, jelikož jsem paličatá ženská a chtěla jsem jí prostě dát. Nakonec jsem v posledním patře použila pár urychlovačů, abych to měla z krku. Ztráty na majetku nějaké jsou, ale živoucího jsem měla dost, many, semínek i orků taky, takže nejdu žebrotou [smilie--sprite8][BR]Původní stav skladu budu chvíli doplňovat.[BR]Prostě je to hratelné, ale náklady se ani nepřiblíží odměnám, natož aby se rovnaly. Na mých předešlých výhradách vůči Věži se nic nemění.[BR]Zisk pár urychlovačů, ale jsem v mínusu s tím, co jsem ve 3. patře investovala.[BR]Z budov celkem: 1x zbrojíř, 2x brána z měsíčního kamene, 1x makovec, 1x blahovičník."}, {"47": "Si tady všichni stěžují na vysoké náklady surovin, to se nedivím, když vyjednáváte, bojem je to daleko lepší.[BR]Abych to shrnul, zatím jsem udělal 2. patro a všechno bojem s nakrmeným fenixem[BR]Ztráty: za jednotky jsem utratil, nějakých 60h urychlovačů a na urychlení brány dalších 15h + za výrobu jednotek utratím nějakých 1,5 milionů kladívek, což je pro mě momentálně nějakých 75% skladu[BR]Zisky: 40 h urychlovačů, 35% kladívek, 4 malé budovy do setu, + mince a svitky[BR][BR]Výsledek: I po druhém patře se pro mě náklady rovnají ziskům, když k urychlovačům a kladívkám přičtu ty získané budovy, takže za mě to zase tak hrozný není, uvidíme dále po třetím patře [smilie--sprite1]"}, {"63": "fenix, fenix, fenix....a kdo ho nema, tak nema ani o čem polemizovat"}, {"20": "@mohyla98 Fénixe mám, něco ve věži jsem vybojovala (1. a 2. patro), ale ve třetím patře jsem vykupovala. Prostě dávám přednost turnaji. A plýtvat urychlovače ve velkém na doplnění ztraceného vojska se mi skutečně nechce.[BR]Každopádně odměny Věže jsou slabé vůči nárokům. Samozřejmě hodně záleží na tom, v jaké kapitole hry jsi. Hráče, kteří jsou v konstruktech, Věž skutečně v ničem nešetří [smilie--sprite2]"}, {"59": "Tak hráče, kteří jsou v nižší kapitole asi bude/nebude šetřit stejně, protože zase vyprodukuje méně jednotek nebo nejsou tak účinné (vlivem divů nebo nevyúrovňovaností některých jednotek). Já to poznal např. v tom, že do konce Elementálů jsem velmi trpěl na produkci na cvičišti, teprve od skončení této kapitoly se s ním dá trochu držet krok u určitých turnajů vyžadující psy (čerstvé vylepšení cvičiště + div na zrychlení výroby i zefektivnění útoků). To byl jen příklad.[BR][BR]Hohou >> Hráč, který nemá Felixe si nezaslouží žít a neměl by vůbec chtít spouštět Elvenar. Ale tak to není, ne všechno je třeba řešit Felixem, sic když ho někdo má, logicky ho využije, popř. využije paralelně s turnajem. Po pravdě nevím, proč se třeba dodnes neobjevil např. v obchodu za brilianty pro případ, že někdo už nehrál událost (třeba jen s podmínkou neexistence ve městě nebo garáži, aby někdo neměl milion Felixů, + možností získat určité množství artefaktů k němu), ale zase je dost možné, že se bude pravidelně objevovat v nějakých každoročních událostech, protože pochybuji, že bude tato nová mechanika (včetně zakrmování) využita na něco, co se už nedá nijak získat (a další využití na jiné mazlíky je zatím jen teorie, navíc pro někoho nemusí jít o atraktivní využití, když by měl jinak zájem jen a jen o něj).[BR][BR]Příspěvky sloučeny. Embla"}, {"3": "tak jsem to taky proběhl, no, štěstí jsem moc neměl. Ze setu mám jen ty dvě malé mrchy, pak jsem dostal zbrojíře a toho šaška, co vyrábí 50 dní 10 % k portálovému bonusu. Stálo mě to něco málo dia na přidávání pokusů (POZOR - ve finále zákeřně nejde přikupovat vyjednávání. Psal tu o tom už někdo?). Ale ty se mi do pár dní vrátí ze studen a nějaké jsem i vyhrál.[BR][BR]Celkově, je to zábava, ale hrozně drahá a ty ceny jsou fakt směšné [smilie--sprite3] Neříkám, že mají pořád padat budovy, ale fakt 1h urychlovač nebo déšť mincí... aby to stálo za to, mělo by z toho kápnout třeba i pár královských rekonstrukcí, když urychlovače, tak mnohem víc... asi to ještě jednou/dvakrát zkusím, ale pokud bude statistika pořád nekompromisně proti mě, tak to vzdám. A to mi ještě pomáhaly posilovače jednotek, které mám postavené pro turnaj. Jinak by mi vojsko vychcípalo mnohem signifikantněji..."}, {"48": "\"A ty ceny jsou fakt směšné\"[BR][BR]Do kamene vytesat. Věž jsem vzdala večer asi ve třetině druhého patra, když mi za celkem slušné množství zásob vložené do (vyhrané) diplomacie padl pouhopouhý déšť mincí. [smilie--sprite3] Což je pro mne totální zbytečnost, peněz mám pořád přebytek a za tenhle rok jsem použila z těch xx různých dešťů v inventáři jeden a to jen pro potřebu něco zadat a pak odejít zařídit něco nutného. Jinak je totiž používám výhradně do craftu...[BR][BR]Tohle je naprosto excelentní ukázka nevyrovnanosti odměn. Zamčená záhadná truhla (tedy něco extra) v půlce druhého patra.[BR]Máte stejnou 30% šanci na 3x portál. bonus po 5% nebo jeden 50% (který vám tutově nepadne). Při stejné šanci by měly být odměny plusmínus stejné. Dohromady 15 % oproti 50% je dost nepoměr...[BR][IMG]https://i.ibb.co/sFTqN6T/https-cz-forum-elvenar-com-index-php-attachments-schr-nka1071-jpg-3644.jpg[/IMG][BR][BR]Příspěvky sloučeny. Embla"}, {"59": "Mě ty odměny rozhodně špatné nepřijdou. Už v prvním patře mohl padnout posilovač na vojsko, který doteď ani nebyl v akademii, a i kdyby byl, jaká je pravděpodobnost. Jsem teprve v půlce druhého patra, takže relativně v pohodě, a už mi padlo něco činidel, tzakže jsem okamžitě mohl zadat v akademii 15% portál, načež se mi okamžitě vedle cesty objevila truhla s 50% portálem jistým, ten se snad ani nikde získat zatím nedal, to není vůbec špatné na to minimum ztracených životů jednotek, popř. pár surovin, když jsem se necítil. Jo jasně, občas padne déšť mincí, ale to v událostech padá každou chvíli, a taky to není bez zapláclého místa nebo se slzami v očích, když dojde čas. A to mi padnul další manovník, který jsem okamžitě napojil, takže už sosaj dva manovníky z jednoho blahovičníku (pro někoho slabé, ale na konec cesty proč ne). Kde jinde ty odměny jinak najdu."}, {"20": "@Pauleo  Jenže ono se nejedná jen o \"pár\" suroviny a \"minimum\" ztracených jednotek. [BR]Ještě tak 1. patro je celkem přijatelné, ale jak se postupuje dál v 2. patře, tak začíná přituhovat. A třetí patro je fakt drsné. Jenom many padlo přes 1 milion. Ale u té mi to zrovna nevadí, i tak jí mám dost. A živoucí zboží, orkové, semínka - vše jen letělo.[BR]Každopádně mi připadá v mém menším městě na CZ1, že je věž jednoduší (i v poměru k možnostem města), než ve velkém městě, co mám v konstruktech, kde jsem udělala věž celou. [BR]V menším městě (V. kapitola) jsem skončila ve 2. patře, jelikož na to teď nejsem připravená, ale celkově se to dá. I když 3. patro jsem tam neviděla. [BR]Možná je to taky tím, že set už dává na konci výzkumu i poslední živoucí zboží, takže nám to tam skutečně osolili. Set není špatný, ale upřímně, není to zase taková hitparáda a rozhodně to množství produkce mě nevytrhne. Řekněme lepší, než drátem do oka [smilie--sprite2]. Těm šíleným nákladů to ale neodpovídá. A odměny v jednotlivých truhlách? Urychlovač 1 hod, nebo 2 hod, ve 3. patře občas 5 hod., trochu mincí a sem tam Katalyzátor nebo úlomky (kterých mám záplavu) ... no, slabota. Abych hrála věž pravidelně, tak by to muselo vypadat jinak. Třeba sem tam Královská rekonstrukce nebo urychlovače alespoň 8 hod. To by bylo hned o něčem jiném."}]