[{"59": "Ludi >> Však jistě, já na třetí patro taky nejsem připraven (ani časově, nezačalo to od začátku), takže zatím ani dál nepůjdu, mám vysosané jednotky z předešlých turnajů, takže jsem to jen zkoušel. Na druhou stranu do půlky druhého patra ty ztráty nestály za řeč, jsem momentálně na začátku Amunů, a rozhodně jsem získal věci, které bych jinak nezískal a určitě mi budou přínosem. Dál jsem to nezkoušel, a je mi jasné, že to sranda nebude, ale zase mi ani nepadly kdovíjaké speciální budovy, které dál možná jsou, sic je otázka zda se vyplatí za ty ztráty. Takže pro mě to není problém si věž někdy zahrát pro to, abych si získal pár doplňků, které jinak musím dost dlouho vyrábet v akademii nebo i pár urychlovačů, které jsou sice bídné, ale v součtu mi nějaká ta osmihodinovka padne (doteď jsem tam urychlovače nepatlal, protože to nebylo třeba), popř. věci co se ani jinde získat nedají. Turnaj taky nehraju proto, aby mě kdovíjak bavil, ale především přeměňuji vojsko na VB, což je asi nejužitečnější věc turnajů."}, {"20": "@ Pauleo   Tak já mám výhodu, že turnaj mě pořád baví [smilie--sprite1] Jasně, hraju i kvůli odměnám. Nejen VB, ale i kouzla. Díky turnaji je nemusím vyrábět a v Akademii jedu jen Katalyzátory. No a pak relikvie a runy. Na to je turnaj skvělý."}, {"59": "Tak mě turnaj přijde už celkem jak kafomlejnek. Ve věži mě to aspoň nenutí hrát na automat, je to pár soubojů, turnaj odbouchám na automat a občas něco uplatím, to je celé, moc zábavné mi to nepřijde, to mě víc baví organizovat město. Zisk z turnaje nepopírám, i když nejcenější vidím furt hlavně VB, VB do divů a KR, zbytek příbývá víc než je třeba."}, {"47": "Právě, všichni tu srovnávají jak je turnaj lepší oproti věži, ale jak psal pauleo, v turnaji jsou vlastně dobrý jenom VB a královská rekonstrukce, ve věži jsou zase dobrý jenom ty budovy a vemte si, až třeba za chvíli budete mít od každé třeba 4 kusy nebo více, tak to potom bude jiná produkce [smilie--sprite1]"}, {"5": "Mno turnaje jsou zároven kromě VB a KR/plánek/ i vydatným dárcem kouzel a relikvií!! /na kterých následně stojí % výroba v manuf., vylepšení divů a výroba v akademii/ případně i pár úlomků ...a to vše za velmi rozumnou cenu, takže prioritu bude mít stejně více turnaj při současném ,,stavu,, věže....nyní má většina plné či poloplné sklady, ale pár týdnů /u některým hráčů možná stačí jeden pokus či dokonce jen 2.patro prvního pokusu/ ve věži spolu s turnaji zároven a sklady to vyluxuje dokonale a budeme stát před rozhodnutím, co tedy jezdit /několik spolků nemusí kvůli tomu dosáhnout na 10. truhlu, když se pár členů spolku vydá ve věži/.... a tím priorita turnaje myslím zatím vítězí..."}, {"59": "Turnaj ještě samozřejmě poskytuje plánky, na ty jsem trochu zapomněl, dá se pomocí nich provozovat řemeslo v akademii na KR např. Jinak priorita turnaje samozřejmě (ty relikvie mi ale opravdu nedochází, a některá kouzla se taky přehromaďují, spíš je vyplácám pak na doplnění many), nepředstavoval jsem si, že by věž měla nahrazovat výhody z turnajů, pouze mi nepřijde pravda, že by se jistý zisk nedal provozovat i s např. částečným projitím věže a získání pár výhod i tam."}, {"20": "Samozřejmě Věž je možné procházet jen částečně a pomaleji. Když za celou dobu otevření věže projdu jen 1. patro, tak ztráty nebudou velké a něco málo se dá získat. Jenže to mi přejde podobné, jako hrát turnaj na 200 bodů [smilie--sprite7]. [BR]I když možná na úspěšné vyjednávání existuje nějaká taktika, abychom nemuseli mít tolik opravných pokusů. Samozřejmě, co se objevuje svisle je jasné. Co duch odmítl, už nedostane. Jen mě napadlo, jestli neexistuje nějaká vazba i mezi tím, jak jsou úplatky řazené vodorovně. Prostě když je vpravo jedna věc, je vyšší pravděpodobnost, že vlevo by něco dalšího nemělo být. Ale možná je to náhoda. Časem uvidíme."}, {"3": "mě spíš štve, že když mi (příklad) dva duchové odmítnou mince s tím, že je chce někdo jiný, tak to neznamená, že opravdu dva jiní duchové chtějí mince. Může je chtít třeba jen jeden, což je matoucí [smilie--sprite3] Myslím, že ten druhý by už měl říct, že je nikdo nechce..."}, {"56": "Tak druhá mapa se pro me nedá vůbec hrát raději hraju turnaj .Tam mám odměny jisté.[BR]Snad až budu dal ve hře tak to bude lepší .Ted jsem u orků a goblinu tak to dal nedám .A ty odměny ani za tu druhou mapu nestáli za to .Za me zatím nic moc .Graficky moc pěkné za to chvalim ."}, {"59": "Ludi >> Jenže to je nesrovnatelné přirovnání. Turnaj na 200 bodů mi dá jen pár VB a ve zbytku nic kloudného, těch pár relikvií a kouzel je skoro běžný odpad. Zatímco do půlky druhého patra věže jsem se ve hře posunul o několik dnů (když spočtu kolik mě napadalo činidel a kolik hodin by se jinak vyráběly v akademii, kolik mě napadalo portálových bonusů (a jak dlouho by se jinak vyráběly v budovách z událostí), včetně toho za 50%, dokonce se mi činidly splnil úkol v události, nějaké ty urychlovače v hodnotě tak 8h), samozřejmě že bych rád zkusil jít i dál, ale už tohle mi nepřijde jako málo ve srovnání s turnajem na 200 bodů. Vyjednávání mi až na výjimky nečinilo do oné rané fáze věže žádné velké potíže, většinou jsem to do třetího pokusu uhodl, ale zkoušel jsem jen u soubojů, které by byly komplikovanější a mohly přinést ztráty. Já vlastně ani neměl natrénováno, bojoval jsem skoro z nuly, protože většinou padaly jednotky, které se nehrají v tomto turnaji.[BR][BR]Tak ne, + čtyři stanoviště a další dva 50% portálové bonusy, pokud to takhle půjde dál, už nebudou potřeba vůbec v akademii nebo událostních budovách."}, {"20": "@Pauleo   První patro se dá hrát celkem snadno a určitě ho příště dám, prostě pomalu, lázo-plážo. [BR]Ale všechno je relativní. Já mám např. portálových bonusů spoustu a k tomu Fénixe a další kupecné základny na skladě. Přeci jen, když jsem na konci výzkumu a nic z těch věcí neutrácím, hromadí se mi a tak mi nepřijdou tak vzácné. Ještě mi padly některé pěkné v eventu. Úlomků mám mraky, činidel taky dost. Ale budiž, na jejich růst bude první patro dobré. Je možné, že v změněné Řemeslné výrobě bude potřeba na dobré věci podstatně víc úlomků i činidel."}, {"59": "Ludi >> Tak pokud je někdo na konci hry, tak už je celkově spousta věcí tak nějak bez hodnoty. Byla doba, kdy relikvie měly hodnotu na zvyšování výroby nebo na vylepšování divů, ale pak přijde doba, kdy jich je tisíce do plusu a už nejsou potřeba vůbec hlídat. Už jsem si několikrát vytyčil kapitolu s kterou skončím hrát, popř. budu hrát jen pro společenství, ale vždy jsem se zase nějak rozehrál. Pokud někdo nehoní body v žebříčku, tak je pro něj spousta věcí zbytečných. Jinak ve věži se mi zdá zajímavé spíš druhé patro, tam padají občas zajímavější odměny, a přesto to není tak hrozné na hraní ještě, pokud někdo má aspoň nějaké bojové divy a pár jednotek stranou. Já činidel nemám nikdy dost, protože pak padne pár slušných receptů, a jsou vyfouklé."}, {"20": "@Pauleo  Konec výzkumu je bezva období na vylepšování divů. Takže turnaj je jasná priorita a pak všechno, co dává VB. První týden po dokončení výzkumu jsem měla celkem divný pocit, ale vlastně se pořád něco děje, někdy až moc [smilie--sprite1]"}, {"24": "@Ludi a obzvlášť keď má človek postavené studne, to sa potom vážne nenudí. [smilie--sprite1][BR][BR]Predieram sa inak 3. mapou, avšak jej náklady na vyjednávanie sú v porovnaní s predchádzajúcimi dvoma výrazne vyššie. Toto už je ten moment, kedy mi náklady silne prevyšujú zisky. Takže vidím to tak, že od budúceho týždňa budem pravidelne hrávať len prvú mapu, k tomu nejaký ten stret z druhej a hotovo."}, {"59": "Tak čas na vylepšování divů je časem po celou hru, to by mě ani nebavilo hrát a neustále se nesnažit si něco vylepšovat. A chodit s lapačem kolem studánek se dá taky kdykoliv, občas se to tam briliantem jenom hemží."}, {"16": "@Pauleo Pokud hráč hraje poprvé, tak není důvod, proč by se měl sekat dříve než u trpaslíků (tzv. osadnický šok). Pokud člověk ví, co dělá, před orky se nesekne. Tzn. vylepšování divů až někdy od těchto kapitol - a to pouze v omezené míře, pokud hráč postupuje kapitolami rychle.[BR]Případně pouze z požehnání, které získá.[BR]Taky na tom budu podobně jako iDavis - tzn. první patro pravidelně (kvůli setu hlavně) a případně část nebo celé druhé patro, ale asi ne pravidelně. Výhodou pro mne je, že na konci výzkumu nepotřebuju další T5&T6 do výzkumu a budov, takže ho můžu klidně celé utratit ve věži."}, {"64": "Věž sice lahodí oku hráče, bohužel už ne jeho zásobám a vojsku [smilie--sprite1] Takže vyzkoušeno, a příště se na to vykašlu, nebo maximálně tak první patro, jak tu píšou někteří z vás. Z truhel mi vypadlo převážně to samé, co mi padá v eventech, tedy déšť mincí, a ten při těch nákladech s klidem oželím [smilie--sprite1]"}, {"59": "Lovec Krys >> No já nemyslím, že by se měl někde sekat, prostě jako každý bojuje s nedostatkem místa, lidí, kladiv, nedostatečnosti vojska v turnajích. Stále mi to nevysvětluje to, proč vylepšovat divy až na konci hry, kdy je k postupu ve hře nepotřebuje (nebavím se o možném dalším obsahu). Mě divy pomáhají a neuvažoval jsem v jaké kapitole zrovna jsem, na začátku hry stejně ani není moc výběr, každopádně např. jehly nebo propast mi přijdou jako užitečné. Navíc cíl nemusí být jen hru bez sekání proletět, ale např. být přínosem pro fungující společenství, a tam už od věci nejsou.[BR][BR]Abych se neustále nevzdaloval od tématu, tak jen podotknu, že to je to co jsem o věži psal od začátku, první patro bez problému, a někdy není problém zabrousit i do druhého, popř. ho i uhrát a něco zajímavého ne/získat."}, {"16": "@Pauleo Tím seknutím myslím ve výzkumu, když člověk neprodukuje dost osadnických surovin, aby mohl všechny VB strkat do výzkumu.[BR]Samozřejmě během orků si hráči zvyknou, že půlku kapitoly budou strkat VB do divů místo do výzkumu (ti, co si na to nezvyknou s hrou v té kapitole praští).[BR][BR][BR]K věži: Pokud nehodlají ustoupit z nákladů, tak by nám alespoň mohli vylepšit odměny (zejména na vyšších patrech, ten nepoměr je příliš velký)."}, {"59": "Lovec Krys >> Jo, už vím jak jsi to myslel, souhlas. Já to myslel že mě bavilo všeobecně vylepšovat divy, takže i z bodů určených přímo jen pro ty, získaných např. z událostí, dobrodružství, atp.[BR][BR]Tak mohli by, jinak kde se dá vůbec získat ta budova Genie 4x3? Já třetí patro ani nestihl zahlédnout, druhé jsem dokončil, ale vyflákávat zesilovače se mi fakt nechtělo."}]