[{"16": "@Pauleo Myslím, že na třetím patře ve finálním souboji (tedy až úplně na konci - to hádání z 8 surovin je tam luxusní - jednou jsem to celé projel na betě)."}, {"20": "@Lovec Krys Navíc odměny, které jsem získala ve třetím patře, byly paradoxně úplně nejhorší z celé Věže."}, {"24": "Kompletný prechod vežou, všetky 3 mapy:[BR][BR][BR][BR][BR]Posledná 3. mapa mala náklady v porovnaní s predchádzajúcimi dvoma výrazne vyššie, takže ju rozhodne neplánujem tak skoro opakovať (zvažujúc fakt že jej odmeny neboli o nič lepšie). Posledný stret v 3. mape považujem za absolútne neúspešný a vlastne neviem, aký zmysel ho malo v mojom prípade robiť (presvedčte sa sami ^^).[BR][BR]Z celej veže mi v rámci setu padol 1x Manovec obecný a 1x Blahovičník, od budúceho týždňa budem pravidelne točiť len prvú mapu (a max pár stretov z druhej), čím sa budem snažiť získať zvyšok setu (i keď ešte stále nie som rozhodnutý, či ho vlastne postavím)."}, {"59": "Haha, jak vždycky u hlavního šéfa padne těch pár usmolených briliantů."}, {"3": "mě z hlavního šéfa padl ten obchodník, co dává portálový bonus 10 %. To bych snad radši ty briloše"}, {"5": "Tak dnes by měla startovat věž podruhé.....připomenme si finálovou nabídku odměn v truhle ve 3.patře: 1x měsíční knihovna 5% šance, 1x džin 10%, 1x portál.bonus 25% - 20%, 1x trpasličí zbrojíř 20%, 1x 50 diamantů 40% ......a to se vyplatí, příjemnou zábavu [smilie--sprite1][BR]Resumé: jet první patro a míti štěstí při otevírání dílčích truhel[BR][BR]PS: aktuálně 10:16 bez věže / že by Atlantida?? / [smilie--sprite1]"}, {"24": "@ElfNostradamus skôr to vypadá tak že do verzie \"rozšírená plocha bez štýlu morských panien\" zabudli pridať grafiku neaktivovanej veže. Každopádne veža už je naplánovaná na 16:00. [smilie--sprite1]"}, {"26": "Mně docela první věž přála - projel jsem první dvě patra a hned se mi poštěstilo a získal jsem knihovnu a k tomu ještě bránu a manovec. První patro asi budu hrát pravidelně, druhé občas a třetí asi vynechám, pokud nebude větší pravděpodobnost získání džina. Pro další věž mám v zásobě ještě tři zbrojíře."}, {"16": "Ty ceny v těch mincích asi vymysleli, aby nám zrušili ty zásoby požehnání na mince[smilie--sprite8]"}, {"59": "Tak v těch doplňkových truhlách může padnout cokoliv, i z vyšších pater nejspíš."}, {"16": "@Pauleo Myslel jsem ceny za vyjednávání."}, {"59": "Lovec Krys >> No já to myslel mimo to. Mě teď padl v prvním patře džin. Jinak s těmi mincemi asi jo, ale chtělo by to aby padaly deště na všechno, pokud má mít smysl vyjednávat ;-)."}, {"10": "první patro 500 + 1000 úlomků, 15%mince a 25 diamantů. Na další lvl kašlu"}, {"15": "@Pauleo  Mám dotaz : toho Džina jsi získal v normální truhle nebo v tajemné ? U mně je k mání až ve třetím patře v poslední truhle. [smilie--sprite11]"}, {"31": "V tajemné truhle jsem ho zahlédla už v prvním patře.[BR]Holt musíš doufat, že se ti objeví legendární tajemná truhla a padne to z ní.[smilie--sprite1]"}, {"16": "Anebo si vytoč kupu studen přání v eventu.[BR][BR]ps: Sice jsem na rozdíl od ostatních teprve dneska projel zbytek prvního patra (nepoužívám ve věži urychlovače), ale zato mám první Měsíční knihovnu.[BR]Teď ještě ty další 3 zbývající budovy na katalyzátory (Blahovičník už mám (2x))."}, {"59": "Green Jane >> Padá z tajemné. Objevila se mi nahoře u konce úrovně před otevřením truhly u brány před poslední sekcí jako zamčená, a odemkla se po otevření oné truhly k bráně. Asi to bylo štěstí, ale jeden hráč z našeho společenství měl džina zase někde v druhém patře. Ono celkově z těch tajemných truhel někdy padají vzácné odměny, u minulé věže mi ve druhém patře padl 3x 50% portálový bonus, přitom tam kde se dá normálně získat je jen jednou a ještě se směšnou pravděpodobností.[BR][BR]Lovec Krys >> No já se taky nesnažím patlat urychlovače, sic včera z věže padaly v prvním patře už i pětihodinovky."}, {"65": "Věž pro mě není nijak zajímavá a bohužel není ani zábavná. Náklady na její projetí jsou vysoké a není tam nic, co by stálo za to tam ty surky/armu topit.[BR]Spoiler[IMG]https://i.ibb.co/YhNHYHb/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-9-2-19-33-2-png-3651.png[/IMG][BR].....a to v řemeslné výrobě vyrábím dostAle třeba jednou s ní provedou něco, co si mou pozornost upoutá [smilie--sprite1] Aktuálně nemám motivaci ji hrát."}, {"38": "Taky tak... [BR][BR][IMG]https://i.ibb.co/VL4S88c/https-cz-forum-elvenar-com-index-php-attachments-pocet-jpg-3652.jpg[/IMG] [BR][BR]je to škoda s tou věží. Ale věřím, že nás v budoucnu něčím překvapí a zase ji pojedeme [smilie--sprite1]"}, {"66": "Jedním slovem zbytečnost."}]