[{"59": "Já jsem zatím celkem nadšen, ale budu jí hrát jen okrajově, nějak teď nic nestíhám a všeho mám málo."}, {"45": "...tak ja som opat presiel celu vezu, opat cisto bojom, tentokrat som dostal len trpaslika a 200 DIA (zvysok hlavne casovace a fragmenty). Straty boli porovnatelne na cas vyroby ako v prvej vezi, az na to, ze mi padlo viac kusistov a menej magov. Rozlozenie prekazok, hlavne vo finalovych truhlach bolo menej naklonene pre hru na strelajuce jednotky, mozno nabuduce to bude lepsie. Tu je moja tabulka strat:[BR][BR][IMG]https://i.ibb.co/6bZm7zK/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-9-2-22-46-20-png-3653.png[/IMG][BR][BR]...naspat to vyrobim za cca 5 dni, som si uz vravel, ze sa vykaslem na 3 lv. no som hrac a nedalo mi to, ze by som ju nepokoril"}, {"20": "Po minulé zkušenosti, kdy jsem prošla Věž celou, jsem tentokrát udělala jen první patro (na obou účtech). Odměny mi padly daleko horší než minule. Navíc nic z toho, co Věž dává, ani nepotřebuji. S Věží končím, dokud nenastane nějaká zajímavá změna v odměnách.[BR][BR]Ze setu mám jen věci na živoucí zboží po 2 kusech, k tomu + 1 manovník a vlastně ani víc nechci. Zatím to mám ve městě. Nepotřebuji ani tohle, ale trochu živoucího navíc se hodí. Pokud budu potřebovat místo, klidně to smažu."}, {"48": "Tentokrát jen v pohodě zkouším první patro a nastavení je o hodně víc přikloněno k boji než k diplomacii. Fénix nakrmen, + 50 % poškození jednotek funguje dobře i ve dvou vlnách boje. Jinak ale bída..."}, {"5": "Citellus, ještě by mne u tebe zajímaly ztráty vojska v turnajích, případně i zisky VB za takový to turnaj?! /viditelně při zisku 1,5k -4,5k  bodů v turnajích/ se dá ,,ušetřit,, i na věž /kde padne tedy cca 5.denní výroba vojska jak píšeš/.....když jezdím turnaje 6k-10k , tak aktuální vojsko padne skoro všechno a celý týden pak vyrábím nové na další turnaj [smilie--sprite1]"}, {"45": "@ElfNostradamus ...my ideme v turnajoch na 10 truhlicu, kde zahram vzdy len tolko aby sme ju mali, ked je potrebne tak zaberiem viac, inak otvaram cca 20 provincii, kde 10 idem po 5 VB z druheho kola a 10 dam na 5-6 lv., Su turnaje kde bojujem len prve tri kola a zvysok vykupujem (napr. zvitky, prach)[BR][BR]...raz som si skusil hrat turnaj naplno a dal som +10K (bol to turnaj mramoru a prisiel som v nom o 250T knazov a par dalsich jedntiek) no ja som v tejto hre relativny novacik, hram to necele dva roky a chybaju mi provincie aby som mohol turnaj vyhravat, len nedavno som dobil 459 provinciu...[BR][BR]...som pred dvomi mesiacmi skoncil konstruktov, isiel som s osadnikmi bez prestavky a tak nejak viac sa orientovat na turnaj nebol cas a tak mi armada rastla a rastie dalej. No v turnaji je kopec VB a rad by som si vylepsil divy, takze aj co sa tyka vysky bodov v turnaji by som rad sa dostal aspon na tych 5K bodov za turnaj..[BR][BR]...este sa mi aj sklady plnia hlavne drahokamov ktorych mam cca 6M a tak ak vidim, ze by straty mali byt vysoke, tak dane kolo vykupim...[BR][IMG]https://i.ibb.co/DCv7ff4/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-9-3-18-28-6-png-3656.png[/IMG][BR][BR]stale skusam, co by mi sedelo najlepsie a hlavne som magor do statistik a vsetko si preratavam v tabulkach a snazim sa zoptimalizovat moju hru. Pozeram sa na TOP hracov, citam diskusie a doplnam svoje poznatky. Napr. az velmi neskoro som zistil, ze mat vsetky oddiely je skor na skodu ako na osoh a tak sa musim s tymto popasovat (aj ked je pravda, ze skoro vsetky provincie som vybojoval, kedze boli modre max. zelene)...[BR][BR][BR]// Odstraněna citace. Příspěvky sloučeny. Jumala"}, {"67": "Abych řekl pravdu, tak Věž Věčnosti mě zklamala. Velké vojenské ztráty a strašně velké náklady na vyjednávání. Odměny za to nestojí. Určitě bych uvítal přepracování nákladů a odměn."}, {"48": "\"Odměna\" má být něco trochu hodnotného. Ale tohle je asi tak nějak, jako když bych řekněme odpracovala brigádně celou směnu v marketu a na konci mi šéf dal desetikorunu..."}, {"56": "Me se tento týden z věži daří víc Mám už tři budovy na měsíční knihovnu Jedu postupně .Akorat nevím neumím určit v jakem jsem patře nebo mapě .Myslim,ze druhá mapa jsem před tou ropuchou .[BR]Tak se mi začíná líbit"}, {"16": "Ropucha je na druhém patře.[BR]Na třetím si nepamatuji, co tam je - byl jsem tam jen jednou na betě."}, {"68": "Z věže věčnosti, jak jsme si mohli všimnout získáme hodně úlomků, či  činidel...Samozřejmě je to o náhodě.....Ale v hlavě mám jednu myšlenku...Při takovém množství zisku úlomků mne napadá, jestli nemají něco do budoucna v plánu....Takový přebytek, který brzy může získat každý hráč, který se bude účastnit věže....Je to nějaký úmysl, nebo třeba taky ne...[smilie--sprite11]"}, {"64": "Heruen napsal/a:\t\t\tAkorat nevím neumím určit v jakem jsem patře\t\tKlikněte zde pro zvětšení...Já taky ne. Intuitivně si myslím, že další patro začíná za těmi modře světélkujícími dveřmi, které jdou otevřít až za nějaký čas, ale stopro jistý si tím nejsem [smilie--sprite1]"}, {"45": "...tak veza c.4 a zatial 2 poschodia za mnou, opat cisto bojom, tentoraz z bonusom +2*25% na zivoty a +50% na strelcov + 50% ohnivak, na stratach je tento bonus viditelny..."}, {"24": "U mňa sa aktuálna veža javí so zatiaľ najlepšími odmenami. V polovici prvej mapy sa mi objavili až 2 zlaté tajomné truhly, z ktorých jednej odmena ma ale trochu zvláštne prekvapila - portálový bonus 50%. V inventári som napočítal za obdobie odkedy som dokončil výskum dokopy 500% portálových bonusov. Ono to pomaly ale isto začína vypadať ako by sa hráča snažili motivovať k tomu, aby kompletne preskočil kapitolu, len za použitia požehnání, napriek tomu že na ňu niekoľko mesiacov čaká (čo je môj prípad (čaká - technicky povedané, samozrejme)).[BR]Takže nevidím v tom nič iné než úlomky, počítam zhruba tak 30-40 tisíc. Začínam mať ale dojem, že by mohli zvážiť množstvo poskytovaných instantov, lebo cítim, že sme mierne za hranicou. Najlepšia by bola zrejme implementácia nejakého algoritmu, ktorý by dokázal zadeliť portálové bonusy medzi hráčov takým spôsobom, že čím by bol hráč bližšie k začiatku výskumu (resp. trpaslíkom), tým viac by bol schopný získať (hovorím o terajšom množstve), zatiaľ čo šance hráčov bližšie ku koncu výskumu by boli sústredené skôr na ostatné druhy odmien."}, {"16": "Já jedu jen v hlavním městě, v ostatních došla semínka, takže s nimi věž vynechávám. Armáda se pilně připravuje na turnaj a chlastá v kasárnách."}, {"5": "Dnes mi přijde drobné zvýšení odměn v jednotlivých truhlách ve formě časovačů...např. bylo jen 1x1hod nyní se objevuje 3x1hod"}, {"45": "...tak som vcera som dokoncil aj tretiu vezu, stale som bez setu [smilie--sprite1] Straty boli mensie ako predoslu vezu, dokonca strategov pocas hrania pribudlo a tak rychlejsie doplnim predosli stav...[BR][BR][IMG]https://i.ibb.co/ZLLf4WX/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-9-10-9-59-45-png-3697.png[/IMG]"}, {"5": "3.věž komplet hotová...večer/kouzelná truhlička/ a dnes ráno/poslední hlavní truhlička/ se konečně usmálo štěstí a padli dva Džinové, již stojí a mají i pěkný disajn, už jen aby něco slušně nasypali [smilie--sprite1] . Vše, kromě první úrovně- kde bojuji jen tam kde je 1x vlna nebo jsem si 100% jist vítězstvím svého vojska, protože to mám na turnaje, jsem tedy vyloboval přes ty nenasytné duchy surovinami, samozřejmě i dokupoval kola ,,hádání,, na víc za dia, které se ale +- vrací v ziscích z truhliček. Časovač pouze jeden, vše se dá stihnout s trochou načasovanosti a trpělivosti. Celkově tedy 3 komletní věže za 3 týdny - budovy: 2x Džin, 3x měsíční knihovna, 1x manovec, 1xsvitek, 1xbrána.... Hodně štěstí i všem ostatním. [smilie--sprite1][BR]První ranní sklizen: 3500semene"}, {"45": "@ElfNostradamus ...tie vybery ti zavidim, ja mam pri vyberoch smolu, zatial iba 2 x manovec a 1 x zivica a 1 trpaslik, za zmienku uz len stoji 580 DIA spolu zo vsetkych troch vezi...[BR][BR]// Odstraněna citace. Jumala"}, {"3": "taky mám na budovy zatím smůlu. Džin už ale jeden padl a po DS už snad bude i stát. V podstatě ale jedu vše diplomaticky. Jak píše elfík, těch pár dia, co je třeba doplatit se +/- vrátí a nebo to dorovnají studny"}]