[{"1": "Zapraszam do dyskusji."}, {"2": "LISTA ZADAŃ [smilie--sprite1]"}, {"4": "Coś wiadomo o nagrodzie głównej ?"}, {"1": "\t\t\thttps://pl.wiki.elvenar.com/index.php?title=Uczta_w_stylu_fusion_Mamy_Juul#Ewoluuj.C4.85cy_budynek\t\t"}, {"39": "Andrzej M napisał:\t\t\tCoś wiadomo o nagrodzie głównej ?\t\tKliknij aby rozwinąć...Nagrodą główną będzie satysfakcja z ukończenia Uczty [smilie--sprite1]"}, {"6": "Zegar dalej nie odlicza do eventu? Zostały 2 doby"}, {"31": "Nagroda główna ma produkować karmę pośród innych rzeczy a to już warte jest uczestnictwa"}, {"38": "Wewe1 napisał:\t\t\tNagroda główna ma produkować karmę pośród innych rzeczy a to już warte jest uczestnictwa\t\tKliknij aby rozwinąć...[BR]Tylko zwróćcie uwagę, że nagroda główna produkuje 3 sztuki karmy z prawdopodobieństwem 1%.[BR]Co oznacza, że po postawieniu budynku, przy pomyślnych wiatrach, z 16 na stałe zajętych kratek [BR]pozyskacie średnio między 9 a 12 sztuk karmy rocznie.[BR][BR]Jeśli szacujecie, że jest to dla was opłacalna inwestycja, zwłaszcza jeśli inne możliwe do wylosowania nagrody są również w jakiś sposób atrakcyjne, to śmiało [smilie--sprite1][BR]Tylko żeby potem nie było, że na forum płacz i zgrzytanie zębów, bo się komuś wydawało, że jak jest 6 możliwych nagród, to paczka karmy będzie wypadała raz w tygodniu [smilie--sprite2]"}, {"6": "Już lepsza by była jedna karma produkowana co tydzień ale na 100%..."}, {"34": "Jak rok temu dostaliśmy \"wirówkę\" z 5% szansy na 50PW to przez rok jak stoi u mnie trafiło mi się to 50PW chyba 4 albo 5 razy. Teraz przy 1% szansy na karmę ciężko to widzę... I jeszcze te 29% na monety xD nie no kurczę porażka...gdyby te 29% szansy było na fragmenty zaklęć już by człowiek na to inaczej patrzył.[BR]Nom chciałbym coś powiedzieć pozytywnego żeby nie zostawiać po sobie negatywnego nastawienia do tego eventu ale jak jeszcze pomyślę że będzie trzeba składać te wszystkie pionki to już po prostu przemilczę [smilie--sprite8]"}, {"25": "No troche meczace te składanie jest[BR]oraz 1% troche malo jest ale zawsze to cos  [smilie--sprite1] [BR]tez bym wolal zeby fragmenty mialy 29%"}, {"11": "Dla mnie nic przydatnego-nastawiam się na losowanie wzrostu witalności (o ile coś tam wyjdzie...) i ot cały event."}, {"38": "Wojtek90 napisał:\t\t\tNom chciałbym coś powiedzieć pozytywnego żeby nie zostawiać po sobie negatywnego nastawienia do tego eventu ale jak jeszcze pomyślę że będzie trzeba składać te wszystkie pionki to już po prostu przemilczę [smilie--sprite8]Kliknij aby rozwinąć...Jak dla mnie składanie pionków będzie w tym evencie najlepszą zabawą [smilie--sprite8][BR]Uwielbiałam to w zeszłym roku i w sumie nieważne było jakie nagrody wpadały [smilie--sprite2] [BR][BR]Mam nadzieję, że udało mi się wprowadzić trochę pozytywności [smilie--sprite6]"}, {"34": "W sumie to jest jedna pozytywna rzecz w tym evencie, którą mogę powiedzieć: waluta eventowa na obrzeżach miasta jest bardzo ładnie widoczna [smilie--sprite8]"}, {"38": "No to dalszy ciąg pozytywnych wiadomości - te magiczne grzybki 1x1, które można wylosować ze skrzynek i podwyższają produkcję towarów o 5%, działają nie tylko na manufaktury, ale też na wszystkie budynki ewolucyjne i eventowe, jakie produkują ten typ towaru [smilie--sprite1][BR][BR]I grafika tego eventu jest urocza [smilie--sprite8]"}, {"8": "Ja już na eventy narzekać nie zamierzam ponieważ eventy są najlepszym źródłem Unurytu. No... prawie najlepszym.[BR][BR]Składaniem pionków także jestem przerażony lekko, zwłaszcza że akurat z tego składania Unurytu nie przybędzie."}, {"6": "Oni muszą zacząć dawać większe ilości waluty za te questy bo te szare feniksy są kompletnie bezużyteczne, z takiej marnej ilości nawet +4% wychodzi maksimum +2 waluty..."}, {"20": "Witam to i ja dorzucę jeszcze, że bardzo trudno po zrobieniu wszystkich zadań zebrać 9 artefaktów mnie się nie udało na becie niestety i w sumie większość braciaków pisała to samo że że brakuje im do maxymalnego poziomu w moim przypadku zadecydował chyba o tym fakt iż moje zbieranie dodatkowych kapeluszy odbywało się tylko raz góra dwa razy na dzień (hahahahahaha) trudno poczekam na nie jak wejdą do iglicy [smilie--sprite1]"}, {"40": "Zdobycie 9 artefaktów bez dokupienia czapek graniczy z cudem - trzeba mieć wyjątkowy fart, aby z losowania dostawać od razu wysokie potrawy i szybko zaliczać nagrody. Mnie się parę razy udało, ale to dosłownie parę razy. Ponadto bardzo rzadko wypadały dodatkowe czapki z nagrody. Dodatkowa waluta z karmienia feniksa - żart, w porównaniu z innymi eventami daje bardzo mały efekt. Ponadto dzienna dawka czapek wyjątkowo niska - 20 sztuk. Nie jestem pewien, ale wydaje mi się, że w innych eventach było więcej, a i w miarę upływu czasu ta ilość się zwiększała.[BR]Jestem już na etapie \"jedno zadanie na dobę\", a nie dobrnąłem nawet do 180 pkt. Ale kupować niczego nie będę [smilie--sprite1]"}, {"29": "W moim odczuciu gra jest na etapie, w którym zostaliśmy zasrani eventami, przygodami i sezonami (całe szczęście, że nagrody w niektórych wydarzeniach \"nie zmuszają\" mnie do angażowania się w poszczególne tryby na 100%). To już drugi z rzędu event, w którym zdobycie 9 artefaktów jest dużo cięższe niż kiedyś, w zamian dostaliśmy znowu przeciętne nagrody i możliwość dokupowania waluty/przepustek za pieniążki, smutne to..."}]