[{"38": "Ja na razie nie będę uogólniać swojej opinii na temat eventu, bo do końca zostało jeszcze 9 dni.[BR]Na razie mam 6 artefaktów i 25% siódmego. [BR]Zadania zrobione do kłódeczki, chociaż kompletnie mi nie zależy ani na budynku ewolucyjnym, ani na nagrodach dziennych, niejako się zrobiły przy okazji, więc ewidentnie nie były jakoś trudne.[BR]No i na pewno nie będę w tym evencie wydawać diamentów, to się przekonam ile można zrobić \"na sucho\" [smilie--sprite1]"}, {"40": "Właśnie zdobyłem ósmy artefakt, przy tym było trochę szczęścia w postaci dodatkowych czapek w Smacznym Łupie, czy jak tam się nazywa ta tajemnicza paczka. Jeśli utrzymam się w Lidze Srebro, będzie dziewiąty artefakt.[BR]Teoretycznie jest szansa dojść do dziesiątego, jeśli serwować potrawy za trzy lub cztery punkty, przy czym chyba trzeba zbierać czapki przez te osiem dni i atakować dopiero w ostatnim dniu. I liczyć na fart w postaci dobrego losowania i czapek w Smacznym Łupie.[BR]Generalnie event nastrojony pod donatorów, którzy zechcą wydać pieniądze na dodatkowe czapki, bez których ciężko wyewoluować budynek na maksa. W poprzednim evencie było ciut łatwiej, a i dodatkowe piórka losowały się częściej. Tu mamy zaostrzenie warunków dla graczy idących bez zakupów w sklepie."}, {"8": "Gdyby budynek ewolucyjny był atrakcyjny, to dyskusja o kolejnym dokręceniu śruby byłaby żywa, lub nawet gorąca.[BR][BR]A tak - emocji jak na grzybach."}, {"40": "blazius1 napisał:\t\t\tGdyby budynek ewolucyjny był atrakcyjny, to dyskusja o kolejnym dokręceniu śruby byłaby żywa, lub nawet gorąca.[BR][BR]A tak - emocji jak na grzybach.\t\tKliknij aby rozwinąć...Obawiam się, że atrakcje skończyły się na brunatnym miśku."}, {"6": "ChrisBaggins napisał:\t\t\tZdobycie 9 artefaktów bez dokupienia czapek graniczy z cudem - trzeba mieć wyjątkowy fart, aby z losowania dostawać od razu wysokie potrawy i szybko zaliczać nagrody. Mnie się parę razy udało, ale to dosłownie parę razy. Ponadto bardzo rzadko wypadały dodatkowe czapki z nagrody. Dodatkowa waluta z karmienia feniksa - żart, w porównaniu z innymi eventami daje bardzo mały efekt. Ponadto dzienna dawka czapek wyjątkowo niska - 20 sztuk. Nie jestem pewien, ale wydaje mi się, że w innych eventach było więcej, a i w miarę upływu czasu ta ilość się zwiększała.[BR]Jestem już na etapie \"jedno zadanie na dobę\", a nie dobrnąłem nawet do 180 pkt. Ale kupować niczego nie będę [smilie--sprite1]Kliknij aby rozwinąć...Gra jest tak robiona żeby zdobyć budynek na 8/9 poziomie, jeden artefakt będzie z przygody.[BR][BR]blazius1 napisał:\t\t\tGdyby budynek ewolucyjny był atrakcyjny, to dyskusja o kolejnym dokręceniu śruby byłaby żywa, lub nawet gorąca.[BR][BR]A tak - emocji jak na grzybach.\t\tKliknij aby rozwinąć...[BR]Odkąd zabrali nieskończoną linię zadań to te eventy można umieścić wyłącznie w jednym miejscu pod względem atrakcyjności[BR]Event zajmujący 10 sekund dziennie to nie event"}, {"40": "Koval92 napisał:\t\t\tGra jest tak robiona żeby zdobyć budynek na 8/9 poziomie, jeden artefakt będzie z przygody.\t\tKliknij aby rozwinąć...Ale w linii nagród mamy siedem stron i zakres punktów do 540.[BR]Jawna aluzja pod finansowanie gry, jako że z tego, co daje nam Mama Juul można dojść jedynie do połowy linii, a i to z trudem.[BR]Koval92 napisał:\t\t\tOdkąd zabrali nieskończoną linię zadań to te eventy można umieścić wyłącznie w jednym miejscu pod względem atrakcyjności[BR]Event zajmujący 10 sekund dziennie to nie event\t\tKliknij aby rozwinąć...A z tym trudno się nie zgodzić. Zaczynam się zastanawiać, czy kontynuować tę zabawę."}, {"41": "Witam .. Ja właśnie po ponad roku grania porzuciłem Forge of Empire ... Tu jeszcze nie jest żle ... Tam pojawiły się znajdzki na mapie z reklamami po otwarciu których dostajecie jakieś tam drobne .. najczęściej jednak reklamy powodują zwiechę gry na  telefonie . Tu w evencie macie dodatkowe  nagrody za diamenty .. tam od jakiegoś czasu to cos koło 80pln . Też było za diaxy ale się skończyło . Jako , że FoE jest z tej samej stajni to kto wie jak tu się losy potoczą ."}, {"39": "he-he, na becie już są takie reklamy, a ostatnie eventy cisną na kasę mocniej niż kiedyś."}, {"3": "Koval92 napisał:\t\t\tGra jest tak robiona żeby zdobyć budynek na 8/9 poziomie, jeden artefakt będzie z przygody.\t\tKliknij aby rozwinąć...[BR]Ale do pewnego momentu (jakichś dwóch-trzech eventów wstecz) nie było większego problemu ze zdobyciem kompletu oraz drugiego budynku (czasem aby zdobyć drugi budynek trzeba było dokupić coś za diamenty, ale nie zawsze). A teraz możesz być w złotej lidze i nie zdobyć kompletu artefaktów, ta zmiana jest zauważalna.[BR][BR][BR]Koval92 napisał:\t\t\tOdkąd zabrali nieskończoną linię zadań to te eventy można umieścić wyłącznie w jednym miejscu pod względem atrakcyjności[BR]Event zajmujący 10 sekund dziennie to nie event\t\tKliknij aby rozwinąć...[BR]No nie do końca się zgodzę, było parę ciekawych budynków (zarówno dziennych jak i głównych) w eventach już po ograniczeniu listy zadań. Natomiast ogólnie to atrakcyjność eventów od dłuższego czasu zjeżdża po równi pochyłej, i coraz bardziej jakość przechodzi w ilość. Za chwilę będziemy mieli event co miesiąc, ale ich atrakcyjność będzie na poziomie sezonów."}, {"40": "Ovocko napisał:\t\t\tAle do pewnego momentu (jakichś dwóch-trzech eventów wstecz) nie było większego problemu ze zdobyciem kompletu oraz drugiego budynku (czasem aby zdobyć drugi budynek trzeba było dokupić coś za diamenty, ale nie zawsze). A teraz możesz być w złotej lidze i nie zdobyć kompletu artefaktów, ta zmiana jest zauważalna.\t\tKliknij aby rozwinąć...Potwierdzam. Mam kilka budynków eventowych z maksymalnym rozwojem, komplet artefaktów do większości zdobyłem bez problemów. To jest trzeci event, nastawiony na kupowanie wspomagających gadżetów. Jeśli ktoś ma naciułane diaxy - można dokupić trochę czapek, ale niewiele.[BR]Co do Złotej ligi - nie wyobrażam sobie dojścia do niej bez zakupów. No chyba że gra ma jakieś nie znane mi możliwości. Ja idę w evencie bardzo aktywnie, ale bez zakupów, parę razy wpadły mi ekstra czapki ze Smacznego Łupu - i kiwam się na pograniczu Brązu i Srebra. Możliwe, że robię coś nie tak, ale... liczba punktów przy grze bez zakupów jest raczej skończona (pomijając dodatki z pogranicza miasta  i ze Smacznego Łupu). I jeśli będzie sporo graczy dokupujących czapki, to ktoś zbierający tylko to, co wynika z gry, po prostu fizycznie się nie wyrobi, bo pułapy Srebra i Złota będą się sukcesywnie podnosić poza jego zasięg.[BR]A kupujący i będący przy tym w Złotej Lidze zbiorą dżekpot bez problemu."}, {"38": "Zwróćcie uwagę, że Złota i Srebrna Liga oznaczają odpowiednio 1% i 5% najlepszych graczy na danym serwerze.[BR]To raczej dziwne i nietypowe by było, żeby ot tak sobie grając event aktywnie, ale zwyczajnie, robiąc wszystkie zadania na bieżąco i regularnie zbierając walutę eventową wylądować wyżej niż Liga Brązowa (czyli grono 20% najlepszych graczy).[BR]Brąz w takim wypadku jest sytuacją normalną, naturalną i oczekiwaną, niczego dziwnego ani podejrzanego w tym nie ma [smilie--sprite2][BR][BR]Natomiast zdobycie Srebra lub Złota przy zwyczajnym graniu eventu, bez dokupowania waluty oznacza najprawdopodobniej jeden z poniższych scenariuszy:[BR]- albo mieliśmy wyjątkowe szczęście w losowaniu dodatkowej waluty (zdarza się);[BR]- albo mamy jakieś wspomaganie, którego inni nie mają (np. Ovocko ma nakarmione dwa Popielate Feniksy);[BR]- albo budynek końcowy jest tak mało interesujący, że mało kto dokupuje walutę, co automatycznie obniża poprzeczkę dla wszystkich Lig. [BR][BR]Aczkolwiek snucie teorii spiskowych jest ciekawe i ożywia dyskusję na forum, więc możecie spokojnie zignorować, to co napisałam [smilie--sprite8]"}, {"40": "Serengeti napisał:\t\t\tZwróćcie uwagę, że Złota i Srebrna Liga oznaczają odpowiednio 1% i 5% najlepszych graczy na danym serwerze.[BR]To raczej dziwne i nietypowe by było, żeby ot tak sobie grając event aktywnie, ale zwyczajnie, robiąc wszystkie zadania na bieżąco i regularnie zbierając walutę eventową wylądować wyżej niż Liga Brązowa (czyli grono 20% najlepszych graczy).[BR]Brąz w takim wypadku jest sytuacją normalną, naturalną i oczekiwaną, niczego dziwnego ani podejrzanego w tym nie ma [smilie--sprite2]Kliknij aby rozwinąć...Rzecz w tym, że w poprzednich eventach zdarzało mi się zawadzać o Srebro, przy czym poziom aktywności na Złocie i Srebrze było podobny, jak dzisiaj. Być może (już nie pamiętam) wiodło mi się w losowaniu dodatkowej waluty, albo po prostu było więcej szans na takie losowanie. A już na pewno były większe codziennie paczki waluty wydarzenia (obecnie 20 każdy dzień, bez zwiększania).[BR]Serengeti napisał:\t\t\tNatomiast zdobycie Srebra lub Złota przy zwyczajnym graniu eventu, bez dokupowania waluty oznacza najprawdopodobniej jeden z poniższych scenariuszy:[BR]- albo mieliśmy wyjątkowe szczęście w losowaniu dodatkowej waluty (zdarza się);[BR]- albo mamy jakieś wspomaganie, którego inni nie mają (np. Ovocko ma nakarmione dwa Popielate Feniksy);[BR]- albo budynek końcowy jest tak mało interesujący, że mało kto dokupuje walutę, co automatycznie obniża poprzeczkę dla wszystkich Lig.\t\tKliknij aby rozwinąć...To wszystko jasne, nie wątpię. Nie wiem tylko, czy dwa Popielate jakoś znacząco wpływają na walutę zrzucaną do lasu. Mój jeden, też nakarmiony, daje efekt mizerny w porównaniu z poprzednimi eventami. Niestety, nie mam możliwości przedstawienia porównania, nie notuję wszystkiego. Po prostu tak czuję.[BR]Serengeti napisał:\t\t\tAczkolwiek snucie teorii spiskowych jest ciekawe i ożywia dyskusję na forum, więc możecie spokojnie zignorować, to co napisałam [smilie--sprite8]Kliknij aby rozwinąć...IMHO to nie teoria spiskowa, a stwierdzenie faktu, że monetyzacja eventów jest coraz wyraźniejsza. Tym niemniej, do dziewiątego artefaktu najprawdopodobniej dojdę. A jeśli jakimś cudem załapię się na srebro, to może i do dziesiątego."}, {"8": "Myślę że udział Popielatych feniksów,nawet dwóch nakarmionych, nie gra tu żadnej roli.[BR][BR]Słaby Feniks i regularnie osłabiany. Praktycznie co event to ten feniks słabszy jest."}, {"40": "blazius1 napisał:\t\t\tMyślę że udział Popielatych feniksów,nawet dwóch nakarmionych, nie gra tu żadnej roli.[BR][BR]Słaby Feniks i regularnie osłabiany. Praktycznie co event to ten feniks słabszy jest.\t\tKliknij aby rozwinąć...Potwierdzam. Niewykluczone, że się go w ogóle pozbędę"}, {"38": "Popielaty Feniks nie wpływa na ilość waluty zbieraną z pola, tylko na nagrodę za zrobienie zadań eventowych.[BR]Jest tak wyważony, żeby za zrobienie kompletu zadań dawał mniej więcej ilość waluty, na której zakup trzeba by było wydać 500 diamentów.[BR]Zazwyczaj za tę cenę można kupić 100 sztuk waluty, w tym evencie zaś 60 sztuk, więc nie dziwne, że Popiołek też daje znacząco mniej na sztuki, wartość przeliczeniowa jest jednak taka sama.[BR]Dwa takie feniksy dają więc taki efekt jak wydanie 1000 diamentów na dokupienie.[BR]Możecie, oczywiście, swoje powyrzucać, wasze prawo, ale ja tam bym chciała mieć drugiego [smilie--sprite1] a i trzecim nie pogardzę [smilie--sprite2][BR]#diamondsarethegirlsbestfriends     "}, {"11": "Dzisiaj zdobyłam portret za 280 punktów bez dokupowania waluty- zostało mi jeszcze 28 czapek( mam 2 popielate) . Wybierałam wygodne opcje za 3 i 4 punkty, często wpadały mi smaczne łupy i to miało znaczenie, bo pierwsze losowanie robiłam jakoś w połowie eventu i już wtedy miałam przewagę 15-20 punktów od limitu złotej ligi. Może szczęście, może taktyka, albo jedno i drugie."}, {"3": "Serengeti napisał:\t\t\tZwróćcie uwagę, że Złota i Srebrna Liga oznaczają odpowiednio 1% i 5% najlepszych graczy na danym serwerze.[BR](...)[BR]Aczkolwiek snucie teorii spiskowych jest ciekawe i ożywia dyskusję na forum, więc możecie spokojnie zignorować, to co napisałam [smilie--sprite8]Kliknij aby rozwinąć...[BR]Obawiam się, że mylisz tutaj dwie rzeczy - zaliczenie konkretnej ligii oraz osiągnięcie określonego pułapu nagród. Jeszcze do niedawna nie było większym problemem (przynajmniej dla mnie) zdobyć komplet artefaktów + drugi budynek, niezależnie od tego w której lidze to wypadało (przy bardziej atrakcyjnych budynkach głównych złota liga zaczynała się daleko poza pułapem drugiej bazy).[BR]Od niedawna złota liga zaczyna się duuuużo niżej - można być w złotej lidze i nie mieć ani drugiego budynku, ani nawet kompletu artefaktów, co wcześniej się raczej nie zdarzało.[BR][BR]ChrisBaggins napisał:\t\t\tTo wszystko jasne, nie wątpię. Nie wiem tylko, czy dwa Popielate jakoś znacząco wpływają na walutę zrzucaną do lasu. Mój jeden, też nakarmiony, daje efekt mizerny w porównaniu z poprzednimi eventami. Niestety, nie mam możliwości przedstawienia porównania, nie notuję wszystkiego. Po prostu tak czuję.\t\tKliknij aby rozwinąć...[BR]Nie wpływają, a w każdym razie nie w jakiś bardzo istotny sposób. [BR]W tym evencie nie chciało mi się liczyć, w poprzednich różnica między jednym a dwoma feniksami to circa +60-65% w stosunku do przychodu z jednego (czyli jeśli jeden daje nam +119 waluty, dwa dają + 196), więc nie jest tak, że dwa dają dwa razy tyle co jeden. Im mniejsza nagroda za paczkę, tym całkowity przychód z feniksów, oraz różnica (ilościowa) między posiadaniem jednego a dwóch jest niższa.[BR][BR]W tym evencie, w mieście w którym mam dwa feniksy jestem co prawda w złotej lidze, ale portretu raczej nie zdobędę (nie mówiąc o drugim budynku). W innym, gdzie mam tylko jednego, jest szansa na drugi budynkek (w obu przypadkach bez kupowania waluty). Przy czym w waluta z newslettera poszła do miasta z dwoma feniksami, więc handicap jest jeszcze większy. [BR]Po prostu coraz większą rolę odgrywa losowość (zwróciliście uwagę, że w tym evencie nawet \"zamówienia\" od tych samych postaci potrafią się między sobą różnić wymaganym poziomem składników?)[BR]Między \"najgorszym\" a \"najlepszym\" miastem mam rozjazd sięgający ponad 50 punktów, to też raczej się wcześniej nie zdarzało (acz tu sobie za to nie dam uciąć ręki).[BR][BR]Dodatkowo obniżenie wartości punktów za zadanie (w tym evencie maksymalna nagroda to mniej niż połowa tego, co można było zdobyć w wielu wcześniejszych) obniża przychód z feniksów."}, {"8": "Twórcy próbują na siłę uatrakcyjnić eventy i to się zawsze kończy tym, że Feniks Popielaty staje się co raz to mniej przydatny.[BR][BR]Tak jakby spadek w przychodach z Feniksa oznaczał wprost proporcjonalny wzrost przychodów IG."}, {"22": "Jak zaczynałem swoją grę w elfenar to na obrzeżach miasta można było zebrać walutę ewentową z 7 miejsc.[BR]Od jakiegoś czasu ta liczba została okrojona do 6"}, {"3": "ryjuwka napisał:\t\t\tJak zaczynałem swoją grę w elfenar to na obrzeżach miasta można było zebrać walutę ewentową z 7 miejsc.[BR]Od jakiegoś czasu ta liczba została okrojona do 6\t\tKliknij aby rozwinąć...Zawsze było 6, chyba że zaczynałeś co najmniej 3+ lat temu (wtedy jeszcze nie grałem w elvenar, więc nie wiem)"}]