[{"40": "Charlene napisał:\t\t\tDzisiaj zdobyłam portret za 280 punktów bez dokupowania waluty- zostało mi jeszcze 28 czapek( mam 2 popielate) . Wybierałam wygodne opcje za 3 i 4 punkty, często wpadały mi smaczne łupy i to miało znaczenie, bo pierwsze losowanie robiłam jakoś w połowie eventu i już wtedy miałam przewagę 15-20 punktów od limitu złotej ligi. Może szczęście, może taktyka, albo jedno i drugie.\t\tKliknij aby rozwinąć...Ja szedłem podobnie i mam 222 punkty, opcje jakie brałem - wyłącznie 3 i 4 punkty (tylko dzisiaj wziąłem za dwa). Ale smaczne łupy z dodatkowymi czapkami miałem tylko dwa, na pięć trafionych.[BR]Popielaty feniks - jeden, tj. +2% do waluty. No nie bardzo bogato, nawet jeśli były by dwa lub więcej. Jeśli szczerze, w poprzednich eventach jakoś aktywniej dodawał, ale to może moje subiektywne odczucia.[BR]No cóż. Starczy 9 artefaktów, jeśli nie można inaczej."}, {"11": "ChrisBaggins napisał:\t\t\tJa szedłem podobnie i mam 222 punkty, opcje jakie brałem - wyłącznie 3 i 4 punkty (tylko dzisiaj wziąłem za dwa). Ale smaczne łupy z dodatkowymi czapkami miałem tylko dwa, na pięć trafionych.[BR]Popielaty feniks - jeden, tj. +2% do waluty. No nie bardzo bogato, nawet jeśli były by dwa lub więcej. Jeśli szczerze, w poprzednich eventach jakoś aktywniej dodawał, ale to może moje subiektywne odczucia.[BR]No cóż. Starczy 9 artefaktów, jeśli nie można inaczej.\t\tKliknij aby rozwinąć...Nie wybierałam wszystkich opcji 3 i 4, tylko jak mi nie pasowały, to czekałam na zamianę receptury. Metoda czasochłonna, ale raczej skuteczna."}, {"18": "ChrisBaggins napisał:\t\t\tAle w linii nagród mamy siedem stron i zakres punktów do 540.[BR]Jawna aluzja pod finansowanie gry, jako że z tego, co daje nam Mama Juul można dojść jedynie do połowy linii, a i to z trudem.[BR][BR]A z tym trudno się nie zgodzić. Zaczynam się zastanawiać, czy kontynuować tę zabawę.\t\tKliknij aby rozwinąć...[BR]zakres punktów w linii przesuwa się wraz z Twoim postępem w evencie - nie doszukiwałbym się tutaj czegokolwiek.[BR][BR]w kontekście wyniku - Charlene napisała przepis na sukces - u mnie taka sama metoda i 284 pkt (jeden feniks na 3 poziomie)"}, {"22": "Ovocko napisał:\t\t\tZawsze było 6, chyba że zaczynałeś co najmniej 3+ lat temu (wtedy jeszcze nie grałem w elvenar, więc nie wiem)\t\tKliknij aby rozwinąć...zacząłem grać jak rozpoczęła się pandemia.[BR]I chyba jednak grasz dłużej odemnie"}, {"40": "Aras Dynas napisał:\t\t\tzakres punktów w linii przesuwa się wraz z Twoim postępem w evencie - nie doszukiwałbym się tutaj czegokolwiek.\t\tKliknij aby rozwinąć...Ok, faktycznie, nie zauważyłem.[BR]Co nie zmienia tego, że punktów z zadań, bez dokupywania i bez fartu w postaci dodatkowych czapek ze smacznych łupów jest około 230.[BR]Nie przeczę, że właściwa taktyka w doborze opcji może pomagać - ale i tu mamy losowanie składników. Miałem przypadki, gdy random pomagał, jakieś 30%, mniej więcej. Pamiętam jeden raz z dwoma strzałami za pierwszym razem, trzecie danie złożyło się w dwóch strzałaty. W pozostałych traciłem czapki na składanie z niskich składników i nie zawsze ich starczało.[BR]Aras Dynas napisał:\t\t\tw kontekście wyniku - Charlene napisała przepis na sukces - u mnie taka sama metoda i 284 pkt (jeden feniks na 3 poziomie)\t\tKliknij aby rozwinąć...No to gratuluję. Widać moja podobna w sumie metoda nie zadziałała, albo po prostu mniej szczęścia w losowaniu było."}, {"3": "ryjuwka napisał:\t\t\tzacząłem grać jak rozpoczęła się pandemia.[BR]I chyba jednak grasz dłużej odemnie\t\tKliknij aby rozwinąć...[BR]No to w czasach pandemii nie było limitu wyższego niż 6[BR][BR]Aras Dynas napisał:\t\t\tw kontekście wyniku - Charlene napisała przepis na sukces - u mnie taka sama metoda i 284 pkt (jeden feniks na 3 poziomie)\t\tKliknij aby rozwinąć...[BR]Sęk w tym, że to nie jest (już) warunek wystarczający.[BR]Ja również odrzucałem mniej korzystne oferty (a także nieco sprytniej sklejałem potrawy, itd., itp.) a mimo to nie wszędzie udało się zdobyć komplet artefaktów. Grając w podobny sposób na trzech światach event zamykam zdobywając ponad 300 punktów w \"najlepszym\", oraz zaledwie dobijając do 250 punktów w \"najgorszym\" mieście.[BR]To daje nam rozrzut wyniku sięgający 20% pomimo takiego samego stylu gry.[BR]To dużo, i będę upierał się przy tezie, że jeszcze nie tak dawno ten rozrzut nie był aż tak wielki.[BR][BR]Osobną kwestią jest to, że progi dla lig znów są circa o 30-40 punktów niżej niż to przeciętnie bywało jeszcze kilka miesięcy temu, co znowu wskazuje, że ogólnie poziom wyników osiąganych przez graczy się obniżył"}]