[{"1": "Liebe Menschen und Elfen,[BR][BR]wir freuen uns auf euer Feedback zum Event \"Florales Erwachen\".[BR][BR]Viele Grüße[BR]Euer Elvenar Team"}, {"28": "Danke @Tacheless! Jetzt klappt es auch wieder mit dem Posthorn."}, {"118": "„Frühling“ ist ja schon bisl vorbei , ihr kommt selbst nicht mehr hinterher?!….[smilie--sprite7][BR]Freu mich sehr, mein liebstes Event neben Blumen sind nur noch die Meerjungfrauen. Kann los gehen[smilie--sprite1]"}, {"128": "Event, Event, die Sonne brennt[BR]erst eins[BR]dann zwei[BR]dann drei[BR]dann vier[BR]ich kann nicht mehr[BR]brauch Erdbeerbier[BR][BR]Test:  [BR][BR]funktioniert"}, {"118": "@Victorious496 schaffst du es eventuell bitte noch in Elvenarfan das neue Event einzupflegen?  Bin gespannt auf die Tagespreise…[BR]Biddöö *ganz lieb gugt* [smilie--sprite1]"}, {"4": "\t\t\thttps://idavis-elvenar.com/events.html#day1\t\t[BR]und dann oben auf den grünen langen Button gehen.[BR][BR]Es gibt an Tag 1 das Tierische Fang-Team mit guten Werten für Saat, zumindest für die Größe von 2 x 3.[BR][BR]Und das Evo gibt auf Stufe 10 dann 7 AW täglich, wahnsinnig."}, {"161": "Geschichte und Evo hören sich doch schon mal gut an..."}, {"24": "salandrine schrieb:\t\t\thttps://idavis-elvenar.com/events.html#day1\t\t[BR]und dann oben auf den grünen langen Button gehen.[BR][BR]Es gibt an Tag 1 das Tierische Fang-Team mit guten Werten für Saat, zumindest für die Größe von 2 x 3.[BR][BR]Und das Evo gibt auf Stufe 10 dann 7 AW täglich, wahnsinnig.\t\tZum Vergrößern anklicken....Ui, noch mehr AW... Wie war das noch mit dem Wälzer ? [smilie--sprite8] Updated das Ding mal. Wenn man sich die Evos anguckt ist der so aus der Zeit gefallen... [smilie--sprite2] Auf jeden Fall sehen die Gebäude hübsch aus, das ist ja schon was."}, {"28": "Feytala1986 schrieb:\t\t\tAuf jeden Fall sehen die Gebäude hübsch aus, das ist ja schon was.\t\tZum Vergrößern anklicken....Der valorianische Stil des 4x4ers sagt mir auch sehr zu, auch die verschiedenen Stadien sind mal wieder mit viel Liebe ausgestaltet worden.[BR][BR]In meiner Beta-Stadt steht das Drachenherz-Anwesen bereits auf Stadium 9 und liefert mir im Waldelfkapitel gerade Schriftrollen. [smilie--sprite2][BR][BR]Ich mag grundsätzlich die \"switchable production\", also dass ich mehrere Möglichkeiten zum Aussuchen habe was das Gebäude als nächstes produzieren soll."}, {"24": "Ich liebe diese \"floralen Statuen\", also diese Gartenschmückereien... Die sehen echt nach was aus."}, {"35": "Tacheless schrieb:\t\t\tDer Winter geht zu Ende und die ersten Spuren des Frühlings zeigen sich auf dem Kontinent Elvenar.\t\tZum Vergrößern anklicken....Schön poetisch, allerdings hinkt Elvenar wohl etwas hinter der Erde hinterher. [smilie--sprite2][BR][BR]\"Der Frühling geht zuende und die ersten Boten des Sommers zeigen sich mit heißen Tagen. Das Gras auf der Wiese sieht schon aus wie Heu und die Kirschen werden langsam rot.\""}, {"1": "@hobbitrose Ja, bei uns in der Welt. Aber in Elvenar ticken die Uhren doch ganz anders. Manchmal zumindest. [smilie--sprite2]"}, {"103": "[IMG]https://i.ibb.co/8gCNMSM/https-de-forum-elvenar-com-index-php-attachments-1687279690822-png-37132.png[/IMG][BR]Vom Eise befreit sind Strom und Bäche... aber noch nicht ganz [smilie--sprite6]"}, {"120": "ist eh schon egal, bei dem Tempo ist spätestens im September das Weihnachtsevent dran[smilie--sprite11]"}, {"35": "Ich werde mal bissel Umbau planen, denn diese Shuffle-Events liegen mir. Vielleicht ist sogar ein neues Fang-Team (Tag 1) drin? Die toben bei mir noch vom letzten Mal."}, {"11": "Event könnte was werden, aber Drachenherz-Anwesen, ist ja wieder ein neues Evolutions gebäude.[BR][BR]warum nicht vorhandene weiter ausbau machen, das lager ist voll mit Evolutionsgebäuden die nicht auf der insel passen."}, {"118": "Bei mir funktioniert der Email Link zur extra Währung nicht. Geht das noch jmd so?"}, {"35": "1. Tag: Die Lupe war gnädig und hat das Fangteam aufgedeckt, Doppler genutzt, so habe ich 3x Tierisches Fangteam bekommen. [BR]Das Event war schon erfolgreich für mich [smilie--sprite1]"}, {"19": "Bin wie immer voll dabei [smilie--sprite1][BR][BR]Auf Elvenarfan.de gibt es alles auch auf Deutsch [smilie--sprite6][BR][BR]https://elvenarfan.de/events/juni-2023[BR][BR]Die Aufgabenliste[BR]\t\t\thttps://elvenarfan.de/events/juni-2023/quests\t\t[BR]Die Tagespreise[BR]\t\t\thttps://elvenarfan.de/events/juni-2023/tagespreise\t\t[BR]Infos zum Evo [BR]\t\t\thttps://elvenarfan.de/events/juni-2023/drachenherz-anwesen\t\t[BR]Viel Glück/Spass !!!"}, {"126": "Ich freue mich sehr, dass es mal wieder gute Kultur-Gebäude gibt und ich eh vor hatte in beiden Live-Städten das Kapitel zu wechseln. Da kann ich gleich ordentlich tauschen [smilie--sprite1]"}]