[{"113": "Ohh, der Ladebildschirm ist ja wieder mal wunderschön, schon alleine deswegen lohnt sich das Event ;D"}, {"9": "[IMG]https://i.ibb.co/6g6LMRb/https-de-forum-elvenar-com-index-php-attachments-1687452423009-png-37162.png[/IMG][BR][BR]Danke!"}, {"164": "Schönes Evo, netter Beifang....schönes Event. Ich finde es recht lohnenswert und gelungen."}, {"159": "Cole6666 schrieb:\t\t\tGratuliere![BR][BR]Ich probiere es gleich noch mal. Habe zwar die Mail erhalten, aber kann das Geschenk nicht abholen\t\tZum Vergrößern anklicken....Du musst Dich direkt im Mail neu einloggen, dann solltest die Belohnung kriegen"}, {"159": "Cole6666 schrieb:\t\t\tDanke, schon 2x gemacht. Bin auch direkt ins Game weitergeleitet worden, aber da kam dann nichts. Ging ja sonst immer...[BR]Ich versuche es noch mal und wenn nicht dann kämpfe ich mich so dadurch  [smilie--sprite6]Zum Vergrößern anklicken....dann drücke ich die Daumen dass es doch noch klappt[smilie--sprite2]"}, {"118": "Cole6666 schrieb:\t\t\tDanke, schon 2x gemacht. Bin auch direkt ins Game weitergeleitet worden, aber da kam dann nichts. Ging ja sonst immer...[BR]Ich versuche es noch mal und wenn nicht dann kämpfe ich mich so dadurch  [smilie--sprite6]Zum Vergrößern anklicken....Ging mir auch so, hab ein Ticket aufgemacht, Papabear hats weiter geleitet…"}, {"120": "Cole6666 schrieb:\t\t\tBisher kann ich noch nicht all zu viel sagen, außer, dass es viele nützliche Tagespreise gibt.\t\tZum Vergrößern anklicken....ja, aber...[BR]... leider alle in den ersten Tagen"}, {"193": "Cole6666 schrieb:\t\t\tGratuliere![BR][BR]Ich probiere es gleich noch mal. Habe zwar die Mail erhalten, aber kann das Geschenk nicht abholen\t\tZum Vergrößern anklicken....Mir geht das genauso. Bin App Nutzer (iOS) und konnte früher die Belohnung aus dem Newsletter abholen, indem sich kurzfristig eine Browser-Version von Elvenar auf meinem Handy öffnete… auf meinem Tablet ging es noch nie, weil ich da immer auf die App verwiesen wurde. Jetzt werde ich auch am Handy auf den App Store verwiesen. Ich werde heute nochmal probieren, ob ich die Belohnung am Laptop abholen kann. Man sollte aber nicht darauf angewiesen sein, die Browser-Version zu nutzen, um das Geschenk bekommen zu können…"}, {"153": "Hazel Caballus schrieb:\t\t\tMir geht das genauso. Bin App Nutzer (iOS) und konnte früher die Belohnung aus dem Newsletter abholen, indem sich kurzfristig eine Browser-Version von Elvenar auf meinem Handy öffnete… auf meinem Tablet ging es noch nie, weil ich da immer auf die App verwiesen wurde. Jetzt werde ich auch am Handy auf den App Store verwiesen. Ich werde heute nochmal probieren, ob ich die Belohnung am Laptop abholen kann. Man sollte aber nicht darauf angewiesen sein, die Browser-Version zu nutzen, um das Geschenk bekommen zu können…\t\tZum Vergrößern anklicken....Link anklicken öffnet App Store, dann dort das Spiel starten und man bekommt die Belohnung. War bei mir schon immer so."}, {"118": "Auf Elvenarfan steht die mysterious Fee nirgends als Tagespreis. Angekündigt wurde sie im Video. [BR]Hab sie heute zufälligerweise durch Tausch gehabt."}, {"2": "Aleanca schrieb:\t\t\tAuf Elvenarfan steht die mysterious Fee nirgends als Tagespreis. Angekündigt wurde sie im Video.[BR]Hab sie heute zufälligerweise durch Tausch gehabt.\t\tZum Vergrößern anklicken.......die kommt am letzten Tag...also Dienstag in 2 1/2 Wochen...(wenn die Reihenfolge so bleibt, wie auf Beta)..."}, {"153": "Cole6666 schrieb:\t\t\tMach ich auch so, geht aber nicht... trotzdem danke  [smilie--sprite2]Zum Vergrößern anklicken....Evtl. klappts nach einem Geräteneustart?"}, {"113": "Da ich mich nicht vorab informiere, musste ich beim Namen des heutigen Tagespreises laut lachen. Da hat die Fantasie ja mächtig Blüten geschlagen.[BR]Aber schick schaut er aus."}, {"159": "Da haben die Schaufeln ja einen speziellen Platz gefunden [smilie--sprite2] [BR][IMG]https://i.ibb.co/DPXYgsf/https-de-forum-elvenar-com-index-php-attachments-screenshot-2023-06-23-095339-png-37171.png[/IMG]"}, {"3": "Hornuss schrieb:\t\t\tDa haben die Schaufeln ja einen speziellen Platz gefunden [smilie--sprite2][BR]Anhang 37171 ansehenZum Vergrößern anklicken....Krach! Ich hoffe dein Trainingsgelände übersteht den Absturz.[BR][BR]Ich bin bisher zufrieden mit dem Event. Ich freue mich über die Einhörner, die kleinen 1x1 Blumenbeete und auf manche Tagespreise ganz besonders. Und das Gute hierbei ist, dass man nur 400 goldene Schaufel ansparen muss, um einen Wunschpreis zu bekommen.[BR]Dafür gibt es keinen Glücksfaktor, mit dem man in die Goldliga kommen könnte, wenn man das wundervolle Einhorn-Portrait ergattern möchte. Aber egal, ich finde die anderen Preise auch sehr wünschenswert und freu mich drüber.[BR]Das Evo sieht toll aus und die Werte sind auch gut. Ich habe gerade herzlich gelacht über Stufe 3, wo die Blume den feinen englischen Rasen wässert.  [smilie--sprite8] [smilie--sprite8]"}, {"81": "Fayence schrieb:\t\t\tDafür gibt es keinen Glücksfaktor, mit dem man in die Goldliga kommen könnte..\t\tZum Vergrößern anklicken....Natürlich gibt es das![BR]Tile aufmachen bis man das x3 oder x4 erwischt dann nicht weiter aufmachen und am nächsten Tag fortsetzten.[BR]x2 nur auf x3 und x4 verwenden in den nächsten 3 Zügen.[BR]Und hoffen das die Felder mit x3 und x4 \"schneller kommen und mit dem doppel Bonus belegt werden können.[BR][BR]Ist viel Zufall und ein wenig Mathematik.[BR][BR]Darum gabs bisher bei der Eventform keine Liga aus genau diesem Grund aber die Gier von Inno beschert und sogar bei dem Eventformat eine Liga [smilie--sprite1][BR][BR]Auch wenn es wieder ein 0815 Event für die meisten Endgamespieler ist gibt es paar wenige Gebäude die Anfänger gut gebrauchen können [smilie--sprite1]"}, {"3": "Sardukar schrieb:\t\t\tNatürlich gibt es das![BR]Tile aufmachen bis man das x3 oder x4 erwischt dann nicht weiter aufmachen und am nächsten Tag fortsetzten.[BR]x2 nur auf x3 und x4 verwenden in den nächsten 3 Zügen.[BR]Und hoffen das die Felder mit x3 und x4 \"schneller kommen und mit dem doppel Bonus belegt werden können.\t\tZum Vergrößern anklicken....Ah, gut. Stimmt etwas Taktik ist dabei , obwohl ich mir nicht sicher bin, ob ich dieses Wissen richtig einsetzen kann.[BR]Also spiele ich lieber zugunsten der Tagespreise. [BR]Sollte ich die Goldliga aus irgendeinem Grund knapp verfehlen, kann ich mir noch überlegen, ob das schöne Einhorn-Portrait mir ein paar Dias wert sind."}, {"144": "Xxx"}, {"120": "Piepom schrieb:\t\t\tIch mag das, wenn Events schnörkellos sind- einfach nur aufdecken.\t\tZum Vergrößern anklicken....Seh ich genau so. Wenn ich bei dieser Art Event einen Tagespreis will, bekomm ich ihn. Auch zwei-, drei- oder viermal. Währung sparen, einsetzen, Gewinne einstreichen. Glücksfaktor minimiert"}, {"136": "hm, ich weiss ja nicht, was ich von dem Eventgebäude wirklich halten soll, zu mindest aber 'ganz nett'. Meine drei GezeitenDinger gefallen mir jedoch besser. Shuffeln nervt, denn viel zu selten ist unter der Lupe das versteckt, was ich 2x.machen will... wird wohl nix mit dem herrlichen Einhornkopf. Tagespreise... naja.[BR]Einzig die Gartensteine rocken, damit würde ich mir am liebsten meine Städte zu pflasern... ;o)[BR](Edit) P.S. ok, da ich kurz vor dem nächsten Kapitel bin, wird es mir Dank der Alraunen auf Khelo ein klein wenig mehr Freude bereiten [smilie--sprite8]"}]