[{"100": "Glück gibt es in vielen Formen . [BR][IMG]https://i.ibb.co/2vYgqRQ/https-de-forum-elvenar-com-index-php-attachments-1688588116182-png-37369.png[/IMG][BR]Morgen ist ein neuer tag und ein frisches shuffle board [smilie--sprite1]"}, {"12": "schwatzwurzel schrieb:\t\t\tGlück gibt es in vielen Formen .\t\tZum Vergrößern anklicken....Das gleiche ist mir vorgestern auch passiert, allerdings hatte ich 2 nicht brauchbare vorher mit der Lupe aufgedeckt."}, {"34": "Positiv[BR]1) Endlich die roten Begonienfelder[BR]2) schöne Graphiken[BR]3) Ligasystem[BR]4) Eventaufgaben sind Ok[BR]5) Drachenherz-Anwesen ist Ok[BR]6) Königlicher Preis gegen Diamanten kaufbar[BR][BR]Negativ[BR]1) Droprate der roten Begonienfelder ist niedriger eingestellt als bei den anderen Feldern[BR]2) Weiterhin beim Könglichen Preis und Hauptpreis Belohnungen die verfallen und damit keinen Wert haben (Kinetik-Kugeln und Feinstes Flugpulver)[BR]3) Beste Chance auf Tagespreise hat man immer noch bei den Kistenevents[BR]4) Tauschfunktion des Tagespreis dürfte nicht Random sein, sondern sollte die möglichen Tagespreise durchgehen aber nicht doppelt bringen, da 70 Diamanten schon teuer genug ist.[BR]5) Neues Kartenfeld gegen 45 Eventwährung ist zu teuer[BR]6) Gewinnbares Gebäude für Goldliga könnte besser sein"}, {"11": "Ich habe alle Aufgaben erledigt und mal wieder nur 7 Artefakte bekommen."}, {"17": "schwatzwurzel schrieb:\t\t\tGlück gibt es in vielen Formen .[BR]Anhang 37369 ansehen[BR]Morgen ist ein neuer tag und ein frisches shuffle board [smilie--sprite1]Zum Vergrößern anklicken....ja ZB hatte ich nie ein 4x dabei meist nur 2 mal 2x und selten ein 3x aber so ists es eben mit dem Glück."}, {"206": "SidKane schrieb:\t\t\t5) Neues Kartenfeld gegen 45 Eventwährung ist zu teuer\t\tZum Vergrößern anklicken....Hatte mir auf Khelo das kleine Schwarze Einhorn gewünscht - leider war es während der gesamten Event-Dauer nicht ein einziges Mal im Angebot. Darum hatte ich an letzen Tag versucht, mit \"neuen Feldern\" mein Glück zu versuchen. [BR]Dafür mußte ich im \"Feensaat-Feld\" auf \"Mischen\" klicken und dann mindestens eines der Felder öffnen, erst danach wurde der \"Mischen-Button\" grün - also erneut anwendbar.[BR]Damit kostete ein neues Set Feensaat jedes Mal 45 + 25 = 70 Eventwährung. [BR]Meine Schipp'chen schmolzen dahin... doch Glück hatte ich leider nicht damit.[BR]Immer wieder dieser blöde \"Zufall\"... [smilie--sprite5] *frust* ... wie eine kaputte Schallplatte mit 'nem Kratzer.[BR]Auf Sinya klappte es besser ... dort hab' ich zum Glück jetzt alle Einhörner komplett! *freu* [smilie--sprite1]"}, {"135": "Auch die Menge des Feebacks zeigt die Eventmüdigkeit. Haben frühere Events auch schon mal bis zu 40 (in Ausnahmefällen knapp 100) Seiten Feedback generiert, wurde es konsistent immer weniger und nun sind wir bei gerade 3 Seiten...[BR][BR]Mein Feedback: Sommerpause von Juni -August einschliesslich, keine Events. Dann freuen sich auch viele wirklich auf die Events ab September."}, {"35": "Mir hat das Blütensammeln gefallen. Auch die Nebenpreise.[BR]Noch schöner wäre es, wenn man bei regelmäßigem Spiel am Ende 9 Artefakte hätte. Das finde ich nämlich etwas frustrierend, dass mir 10 Blüten am 9. Artefakt gefehlt haben."}, {"113": "Ich trau mich schon fast nicht zu schreiben, dass ich in allen drei Städten die neun Artefakte bekommen habe. [BR]In beiden Gemeinschaftsstädten allerdings auf den letzten Drücker mit dem letzten Login-Bonus, in meiner Solostadt durch das Newslettergeschenk und die Eventwährung aus dem Königlichen Pass habe ich sogar noch den Avatar bekommen.[BR][BR]Mir hat das Event gefallen, ich mag Events, egal welcher Bauart, und ich freue mich auf das nächste, grad langweile ich mich ein wenig.[BR][BR]Xebifed schrieb:\t\t\tAuch die Menge des Feebacks zeigt die Eventmüdigkeit.\t\tZum Vergrößern anklicken....Ich bin definitiv nicht Event müde, aber immer nur zu schreiben \"gefällt mir\" ist halt für andere uninteressant."}, {"11": "Wenn ein event das nächste jagd, wird es irgendwann langweilig."}, {"9": "Schnalle 04 schrieb:\t\t\tWenn ein event das nächste jagd, wird es irgendwann langweilig.\t\tZum Vergrößern anklicken....Wenn du sie einfach nicht beachtest, läuft das Spiel dennoch weiter.  [smilie--sprite2] Wow ... [smilie--sprite12][BR]Scheint ja zu Genüge zu geben, die es eben mögen. [smilie--sprite1]"}]