[{"1": "Dear Humans and Elves,[BR][BR]Please use this thread to discuss the update to Chapter 21.[BR][BR]We're looking forward to your feedback![BR][BR]Kind regards,[BR]Your Elvenar Team"}, {"2": "\"For comprehensive details, insights, and more, we invite you to visit our blog on Innogame's Website and check out the article for Chapter 21. You can take a small peak.\"[BR][BR]Those details should be in the Wiki first and then, as discussion/ insights, in a blog, FB or elsewhere. [smilie--sprite1]"}, {"3": "I’m in the middle of chapter 20 and already excited for this one! I’d also appreciate info in the wiki!"}, {"4": "So far looking good, going to be tricky to rearrange layout currently, back to old skool as elven architect isn't recognising the chapter, however I appreciate that is a 3rd party site."}, {"4": "Just wondering here, does Community Work decay?"}, {"5": "m4rt1n said:\t\t\tJust wondering here, does Community Work decay?\t\tClick to expand...[BR]This is subject to 10% Decay each Night  [smilie--sprite1] [BR][BR]Kind Regards[BR][BR]Herodite."}, {"6": "That's some poor Community Work right there...[BR][BR]I mean, they just built a Gazebo in the park yesterday, and I go for my morning walk and find that the steps have collapsed and there's a hole in the roof."}, {"4": "Herodite said:\t\t\tThis is subject to 10% Decay each Night  [smilie--sprite1][BR][BR]Kind Regards[BR][BR]Herodite.\t\tClick to expand...[BR]Thanks, will make to order then as they seriously affect my Unurium amounts collected from my residences, a 3 hour Magic Residence making Community Work currently gives me 1 single Unurium compared to 0.144% of taxes for coins (level 26 Vallorian Seal Tower) which has been enough for me to run the trader fully on seeds. \"EDIT in here currently 694 Unurium per residence 3 hours\"[BR][BR]Not happy at all that my 16 residences require 3 individual clicks each to switch from coins to community work, my Carpel Tunnel will flare up again. [smilie--sprite3]"}, {"7": "So, to open the chapter, you have to have 640 completed provinces. Ok fine, that's doable. However, then when you arrive at quest 6 (so not halfway through the chapter, but at the very beginning), it already requires you to have 680 provinces completed! You expect us to complete 40 provinces in 1-2 days time??!! Wow Inno, WOW...![BR][BR]I mean, I'm lucky to have roughly 3 pages of provinces waiting at 7/8 completion, but still... the required amount is insane!"}, {"4": "C-Nymph said:\t\t\tSo, to open the chapter, you have to have 640 completed provinces. Ok fine, that's doable. However, then when you arrive at quest 6 (so not halfway through the chapter, but at the very beginning), it already requires you to have 680 provinces completed! You expect us to complete 40 provinces in 1-2 days time??!! Wow Inno, WOW...![BR][BR]I mean, I'm lucky to have roughly 3 pages of provinces waiting at 7/8 completion, but still... the required amount is insane!\t\tClick to expand...[BR]Luckily I had enough as I built the Scouts' Tavern after the last chapter and got it to max level 35, but I feel the pain."}, {"8": "I don't know which number quest it is, but it's early, maybe 5 or 6ish.[BR][BR]Complete 680 provinces (Are you insane?)[BR]or[BR]Scout provinces - it doesn't say how many provinces to scout?[BR][BR]Firstly, you need 660 for the new chapter expansion, that's just about doable for me - but I still need to finish another 20provinces to get the expansion.[BR]I have to finish another 40 provinces to finish this chapter quest![BR][BR]I think you need to rethink the number of provinces on this quest as 680 seems seriously unreasonable to me.[BR][BR]I'd also like to see the number of times I need to scout provinces as the alternative.[BR][BR]Edit :- I have 53 provinces scouted but not complete, so I could complete the quest, but why the hell would I want to be that overscouted, what is the benefit or negative impact?"}, {"4": "OldHag said:\t\t\tI don't know which number quest it is, but it's early, maybe 5 or 6ish.[BR][BR]Complete 680 provinces (Are you insane?)[BR]or[BR]Scout provinces - it doesn't say how many provinces to scout?[BR][BR]Firstly, you need 660 for the new chapter expansion, that's just about doable for me - but I still need to finish another 20provinces to get the expansion.[BR]I have to finish another 40 provinces to finish this chapter quest![BR][BR]I think you need to rethink the number of provinces on this quest as 680 seems seriously unreasonable to me.[BR][BR]I'd also like to see the number of times I need to scout provinces as the alternative.[BR][BR]Edit :- I have 53 provinces scouted but not complete, so I could complete the quest, but why the hell would I want to be that overscouted, what is the benefit or negative impact?\t\tClick to expand...[BR]I find the benefit of completed provinces from using the app to help everyone every day and refill my coins but everyone plays differently."}, {"8": "I don't use the app @martin, I play on the pc but even at that, going through my return visits via notifications always refills my coins, albeit it's way less then half of my map.[BR]Maybe it's just me but It feels like they just plucked a number out of nowhere without really putting much thought into it. I'm also very curious as to how many provinces you need to scout for the alternative. I've scouted more then the total of 680 - but the quest bar only show the number of completed provinces, so I hope I don't have to scout another 680 eek!"}, {"8": "I've just finished a scout and that completed the quest, phew. So it should read Complete 680 provinces or Scout 1 province."}, {"4": "m4rt1n said:\t\t\tSo far looking good, going to be tricky to rearrange layout currently, back to old skool as elven architect isn't recognising the chapter, however I appreciate that is a 3rd party site.\t\tClick to expand...[BR]Thankfully elven architect now recognises ch21 so I was able to check my layout so far. [smilie--sprite1]"}, {"8": "I love the look of the new level 43 barracks. [smilie--sprite1]"}, {"9": "m4rt1n said:\t\t\tThankfully elven architect now recognises ch21 so I was able to check my layout so far. [smilie--sprite1]Click to expand...yessssss!!!!!"}, {"4": "A bit puzzled here, wondering how to initially make Orcish Art, as all 3 of the settlement buildings need it for the first upgrade and I cannot see how to make it without that first upgrade, feel like I am missing the obvious."}, {"8": "Aren't they made in the workshop of Diabhal? I'm not that far ahead, so only going by what I see the benefits of each building are."}, {"4": "OldHag said:\t\t\tAren't they made in the workshop of Diabhal? I'm not that far ahead, so only going by what I see the benefits of each building are.\t\tClick to expand...[BR]Yes I see that now, but need a load of other stuff to be made first so they can be produced, thank you. [smilie--sprite1][BR][BR]Figured it out, new it would be obvious, brain freeze lol"}]