[{"10": "Are there any layouts to view anywhere please? I know there are some on the US forums...but any here? thankyou"}, {"9": "Kiltqueen said:\t\t\tAre there any layouts to view anywhere please? I know there are some on the US forums...but any here? thankyou\t\tClick to expand...I have not seen any here....but if you are on the US forum and see them, maybe post the link for it here so those that are not on the US forum can see as well [smilie--sprite8]"}, {"4": "Kiltqueen said:\t\t\tAre there any layouts to view anywhere please? I know there are some on the US forums...but any here? thankyou\t\tClick to expand...[BR]There are several layouts on the beta forum."}, {"2": "\t\t\t\t\t\tDiscussion - Chapter 21 - The Vallorian Legend\t\t\t\t\tI seriously pity anybody coming to Ch21 straight from Ch20 without the gap between chapters which many of us have had and which gave us time to work on our stocks of necessary resources.\t\t\t\t\tbeta.forum.elvenar.com\t\t\t\t"}, {"9": "Alcaro said:\t\t\t\t\t\tDiscussion - Chapter 21 - The Vallorian Legend\t\t\t\t\tI seriously pity anybody coming to Ch21 straight from Ch20 without the gap between chapters which many of us have had and which gave us time to work on our stocks of necessary resources.\t\t\t\t\tbeta.forum.elvenar.com\t\t\t\tClick to expand...holy crackers that's a lot of buildings, geez.......thanx for posting this @Alcaro"}, {"4": "kimkimkim said:\t\t\tholy crackers that's a lot of buildings, geez.......thanx for posting this @AlcaroClick to expand...[BR]And all 3 change in size as you upgrade them so quite a challenge this time around."}, {"10": "Alcaro said:\t\t\t\t\t\tDiscussion - Chapter 21 - The Vallorian Legend\t\t\t\t\tI seriously pity anybody coming to Ch21 straight from Ch20 without the gap between chapters which many of us have had and which gave us time to work on our stocks of necessary resources.\t\t\t\t\tbeta.forum.elvenar.com\t\t\t\tClick to expand...Than kyou so much [smilie--sprite2]"}, {"7": "m4rt1n said:\t\t\tThankfully elven architect now recognises ch21 so I was able to check my layout so far. [smilie--sprite1]Click to expand...Usually, when you want to prepare a city layout before the chapter officially releases on live servers, but after it's been released on beta, you can change the settings in the upper right corner of EA to beta and it does show the new buildings. Not sure if this was not the case now and if it indeed was delayed a bit, but just so you know this is usually an option [smilie--sprite1][BR][BR]Kiltqueen said:\t\t\tAre there any layouts to view anywhere please? I know there are some on the US forums...but any here? thankyou\t\tClick to expand...Also keep an eye out for iDavis' website, he has a dedicated section reserved for layouts, but it's still pending right now. https://idavis-elvenar.com/guestRaces/vallorianlegend.html#layouts"}, {"9": "C-Nymph said:\t\t\tUsually, when you want to prepare a city layout before the chapter officially releases on live servers, but after it's been released on beta, you can change the settings in the upper right corner of EA to beta and it does show the new buildings. Not sure if this was not the case now and if it indeed was delayed a bit, but just so you know this is usually an option [smilie--sprite1]Click to expand...did not know this, thanx @C-Nymph for the information"}, {"4": "@C-Nymph this time around, EA took 2-3 days of live before it worked as intended, all seems fine now though. [smilie--sprite1]"}, {"4": "m4rt1n said:\t\t\tNot happy at all that my 16 residences require 3 individual clicks each to switch from coins to community work, my Carpel Tunnel will flare up again. [smilie--sprite3]Click to expand...[BR]Worse than I thought, was actually 4 clicks per individual residence to change production, as I just changed them all back to coins for the FA, the coin badge needs a rethink going forward now residences have multiple functionality.  @Herodite @Silmaril @anonglitch"}, {"7": "Elven Architect really needs an update for the Report section that takes into account the amount of Prosperity you have, just like Culture... As it's going to get interesting to balance that when you fiddle around with a setup for the chapter..."}, {"7": "Just a note in case anyone else uses the research+guest race buildings calculator on ElvenArchitect's website to prepare for Chapter 21: there's a big discrepancy in numbers when you add the desired buildings + upgrades for the guest race buildings. Thought I'd share this so no one else is as unpleasantly surprised as I was and thinks they'll never have enough prosperity to get through the chapter [smilie--sprite7][BR][BR]It seems that EA mistakenly displays the required prosperity in a cumulative way and then adds the cumulative numbers together as costs in the calculator, so the calculator then uses these way too large numbers to calculate the total needed prosperity instead of just adding the single numbers together. This is only the case for the Vallorian Dragon Tower it seems, both types of workshops for the guest race don't have this error.[BR][BR]The needed prosperity for all 4 upgrades of the portal should be 600+27+26+27= 680, not 600+627+653+680=2560 as displayed by EA.[BR][BR]See here the difference between the correct wiki and the incorrect numbers on EA:[BR][IMG]https://i.ibb.co/184Knrz/https-en-forum-elvenar-com-index-php-attachments-1692307157714-png-7708.png[/IMG][BR][IMG]https://i.ibb.co/Lpj51tm/https-en-forum-elvenar-com-index-php-attachments-1692307511428-png-7711.png[/IMG][BR][IMG]https://i.ibb.co/rGPQg4n/https-en-forum-elvenar-com-index-php-attachments-1692307530958-png-7712.png[/IMG]"}, {"11": "OldHag said:\t\t\tI don't know which number quest it is, but it's early, maybe 5 or 6ish.[BR][BR]Complete 680 provinces (Are you insane?)[BR]or[BR]Scout provinces - it doesn't say how many provinces to scout?[BR][BR]Firstly, you need 660 for the new chapter expansion, that's just about doable for me - but I still need to finish another 20provinces to get the expansion.[BR]I have to finish another 40 provinces to finish this chapter quest![BR][BR]I think you need to rethink the number of provinces on this quest as 680 seems seriously unreasonable to me.[BR][BR]I'd also like to see the number of times I need to scout provinces as the alternative.[BR][BR]Edit :- I have 53 provinces scouted but not complete, so I could complete the quest, but why the hell would I want to be that overscouted, what is the benefit or negative impact?\t\tClick to expand...Ooohhhh dear, yet another challenging quest to look forward to.  Currently I’m stuck on the quest requiring 30 Vallorian Avenue since that will use over 100k of each of my basic sentient goods!  Could be on that one for a while."}, {"4": "I just hit a mandatory quest with no alternative to have 670 provinces."}, {"4": "Mana amounts required are insane compared to other resources in Portal productions, I thought when looking they had misplaced a decimal point. I am having to use 100's of spells with a level 31 Dragon Abbey and several chapter upgraded mana buildings.[BR][BR]Making the required Rude Obligations is wiping me out of Mana constantly and I started the chapter with over 40 million of it."}, {"9": "m4rt1n said:\t\t\tMana amounts required are insane compared to other resources in Portal productions, I thought when looking they had misplaced a decimal point. I am having to use 100's of spells with a level 31 Dragon Abbey and several chapter upgraded mana buildings.[BR][BR]Making the required Rude Obligations is wiping me out of Mana constantly and I started the chapter with over 40 million of it.\t\tClick to expand...same"}, {"4": "1970 Rude Obligations required, 930,000 per 10+10+2 if you have a level 30+ BTG  and Prosperity Surplus over 1000 (16 Magic residence, 6 Magic Workshop and upgraded Barracks) so 22 in my case, so 90 (89.54) x 970,000 = 87,300,000 so adding the 31,000,000 needed for research comes to a chapter total of 118 million Mana before upgrading anything."}, {"12": "m4rt1n said:\t\t\tI just hit a mandatory quest with no alternative to have 670 provinces.\t\tClick to expand...I'm all over it, like stink on a monkey.  [smilie--sprite1][BR][BR][IMG]https://i.ibb.co/kGXRntL/https-en-forum-elvenar-com-index-php-attachments-1694220901460-png-7813.png[/IMG][BR][BR]My insane compulsion to 'over' scout has been vindicated.  [smilie--sprite7]"}, {"4": "m4rt1n said:\t\t\t1970 Rude Obligations required, 930,000 per 10+10+2 if you have a level 30+ BTG  and Prosperity Surplus over 1000 (16 Magic residence, 6 Magic Workshop and upgraded Barracks) so 22 in my case, so 90 (89.54) x 970,000 = 87,300,000 so adding the 31,000,000 needed for research comes to a chapter total of 118 million Mana before upgrading anything.\t\tClick to expand...[BR]And then decay, not accounted for so that is approaching my first estimate over normal play of ch21 of needing to produce 1 Billion Mana, again I ask has the decimal point been accidentally moved @Herodite @Solanix[BR][BR]I will go as far as saying currently ch21 is impossible to complete unless you have a high level Dragon Abbey and huge amount of free spells or huge reserves of diamonds."}]