[{"12": "m4rt1n said:\t\t\tI will go as far as saying currently ch21 is impossible to complete unless you have a high level Dragon Abbey and huge amount of free spells or huge reserves of diamonds.\t\tClick to expand...Do I hear Inno designers and devs saying, 'Mission accomplished.' ?[BR][BR][IMG]https://i.ibb.co/1XfFkDT/https-en-forum-elvenar-com-index-php-attachments-1694230728000-png-7814.png[/IMG][BR][smilie--sprite6]"}, {"7": "m4rt1n said:\t\t\tMana amounts required are insane compared to other resources in Portal productions, I thought when looking they had misplaced a decimal point. I am having to use 100's of spells with a level 31 Dragon Abbey and several chapter upgraded mana buildings.[BR][BR]Making the required Rude Obligations is wiping me out of Mana constantly and I started the chapter with over 40 million of it.\t\tClick to expand...m4rt1n said:\t\t\tI will go as far as saying currently ch21 is impossible to complete unless you have a high level Dragon Abbey and huge amount of free spells or huge reserves of diamonds.\t\tClick to expand...Noticed this too. I ran out of Mana and was utterly shocked![BR]At first I noticed the required Mana needed for the tech tree was a little over the top, but then I needed to start making the Rude oblations and this is just insane! I can maybe start 1 production of Rude oblations per day without wasting spells, if I’m lucky… This will mean this chapter will take forever to complete![BR]I was really liking this chapter so far but now not so much anymore…[BR]Please tell us this is a design mistake and it will be fixed!"}, {"5": "Hi Guys! It is a Mana Heavy Chapter with the Research alone costing 34,100,000 Mana (as a whole) so I would definitely begin to stack up!! And of course that's not me taking Guest Race Resources or Upgrades into account.[BR][BR]The best I can do here is pass the feedback along!  [smilie--sprite5][BR][BR]Kind Regards[BR][BR]Herodite"}, {"12": "C-Nymph said:\t\t\tI was really liking this chapter so far but now not so much anymore…\t\tClick to expand...From what I'm hearing I won't be rushing to enter Ch XXI any time soon.  [smilie--sprite5]"}, {"7": "Herodite said:\t\t\tIt is a Mana Heavy Chapter\t\tClick to expand...That is putting it mildly...[BR][BR]Herodite said:\t\t\tI would definitely begin to stack up!!\t\tClick to expand...I was very well stacked, but it has simply evaporated![BR][BR]Herodite said:\t\t\tThe best I can do here is pass the feedback along!  [smilie--sprite5]Click to expand...Thanks, that's appreciated!"}, {"8": "I was also well stocked on Mana going into this chapter, I had over 90mil saved. I'm down to 24mil and have started putting away a few evolving buildings to add manta rays and lava eggs, I still have to make 1290 rude oblations @930k for 22...that's mucho mana gonna be needed....lol[BR]I'm actually enjoying the chapter and I'll soldier on. I'm bloody glad I didn't spend/waste any of my Mana in the Cauldron improving spell effects."}, {"13": "A high-level Dragon Abbey is already needed in earlier chapters. 118 M Mana does not seem a lot for a whole chapter, or am I wrong?"}, {"4": "Seems a lot to me, using 100's of spells as even with a Mana Rune 15 day expiring building I cannot make enough a day for 1 production in the portal, and then of course there is the decay."}, {"4": "Finding Mana buildings in inventory and used a Mana Tome 15 day expiring building I found in Sorceries and EE spells on them as I have a level 16 Lighthouse of good neighbourhood so may improve my situation a little."}, {"14": "Herodite said:\t\t\tThe best I can do here is pass the feedback along!  [smilie--sprite5][BR][BR]Kind Regards[BR][BR]Herodite\t\tClick to expand...[BR]Has any feedback you passed along ever led to any actual changes from Inno's side?  [BR][BR]Rhetorical question, I know."}, {"5": "@Killiak I am merely the enthusiastic messenger  [smilie--sprite8]"}, {"14": "Solanix said:\t\t\tA high-level Dragon Abbey is already needed in earlier chapters. 118 M Mana does not seem a lot for a whole chapter, or am I wrong?\t\tClick to expand...[BR]\t\tCode:\tResearch + Buildings:Chapter 15: Elvenar        2.75 million manaChapter 16: Embassies      2.73 million manaChapter 17: Traders       15.50 million manaChapter 18: Team Spirit   11.20 million manaChapter 19: Revenge          N/AChapter 20: Music            N/AChapter 21: Vallorian     34.10 million manaProduction:Chapter 15: Elvenar         Chapter 16: Embassies      Chapter 17: Traders          N/A             (Elvenarin can be pp'd)Chapter 18: Team Spirit  ~40   million mana  (info from min-max website)Chapter 19: Revenge       36.3 million mana    Chapter 20: Music         10.5 million mana (harmony grove upgrades, bars can  be PP'd after all)     Chapter 21: Vallorian     87.3 million mana ( ~82 if you get 23 per oblation production)[BR]I couldn't find the production info from Elvenar and Embassies anymore, but part of those could be PP'd anyway. Their demands were undoubtedly much lower.  The production numbers are a bit rough, because of all the boosts and what not, but close enough. [BR]I haven't looked at quests, since some demand Mana, some give a little bit of Mana, but it doesn't come nowhere near the (multi-)millions.[BR][BR]So the closest we have is Team Spirit at roughly 50 million mana, whilst Vallorian takes over DOUBLE of that at 113 ~ 118 million.[BR][BR]Conclusion;  Yes, you are wrong.[BR][BR][BR]Herodite said:@Killiak I am merely the enthusiastic messenger  [smilie--sprite8]Click to expand...[BR]I know you are, but the cynic in me says that your letters go straight to the bin."}, {"4": "To add here once I unlock my basic factory boost upgrade each one then needs another 2400k mana to upgrade. I have 6 of them so for me an extra 14.4 million mana to find on top, plus possibly other upgrades I am yet to check out."}, {"6": "A couple of my thoughts...[BR][BR][BR]Dragon Abbey does not improve its Mana reward by Chapter.  Game progress with increasing demands for Mana effectively means decreasing usefulness of Dragon Abbey.[BR][BR][BR]Mana decay rate does not increase by Chapter.[BR][BR][BR]Lava Egg, Chapter 18, 108.1 Mana/sq/hr    Lava Egg, Chapter 21, 210.9 Mana/sq/hr, 195.1%[BR]Watchful Winter Owl, Stage 10, Chapter 18, 109.4 Mana/sq/hr    Watchful Winter Owl, Stage 10, Chapter 21, 213.3 Mana/sq/hr, 195.0%[BR]Manta Ray, Chapter 18, 111.1 Mana/sq/hr    Manta Ray, Chapter 21, 218.8 Mana/sq/hr, 196.9%[BR]Somnial Pool, Chapter 18, 121.5 Mana/sq/hr    Somnial Pool, Chapter 21, 236.1 Mana/sq/hr, 194.3%[BR][BR]Mana producing buildings increased their output efficiencies by nearly double from Chapter 18 to Chapter 21.[BR]Mana requirements increased their request by slightly over double from Chapter 18 to Chapter 21."}, {"8": "The Dragon Abbey at level 31 gives 140% Mage Units Damage, which is more valuable then the amount of mana it gives, in my opinion."}, {"4": "OldHag said:\t\t\tThe Dragon Abbey at level 31 gives 140% Mage Units Damage, which is more valuable then the amount of mana it gives, in my opinion.\t\tClick to expand...[BR]Dragon Abbey gives Mana to any amount if you have the spells, by far the best source of Mana in the game, nothing else even comes close.[BR][BR]I get more Mana per spell cast than all but 2 Mana producing buildings I have over 24 hours, 35k per spell."}, {"4": "Sir Derf said:\t\t\tA couple of my thoughts...[BR][BR][BR]Dragon Abbey does not improve its Mana reward by Chapter.  Game progress with increasing demands for Mana effectively means decreasing usefulness of Dragon Abbey.[BR][BR][BR]Mana decay rate does not increase by Chapter.[BR][BR][BR]Lava Egg, Chapter 18, 108.1 Mana/sq/hr    Lava Egg, Chapter 21, 210.9 Mana/sq/hr, 195.1%[BR]Watchful Winter Owl, Stage 10, Chapter 18, 109.4 Mana/sq/hr    Watchful Winter Owl, Stage 10, Chapter 21, 213.3 Mana/sq/hr, 195.0%[BR]Manta Ray, Chapter 18, 111.1 Mana/sq/hr    Manta Ray, Chapter 21, 218.8 Mana/sq/hr, 196.9%[BR]Somnial Pool, Chapter 18, 121.5 Mana/sq/hr    Somnial Pool, Chapter 21, 236.1 Mana/sq/hr, 194.3%[BR][BR]Mana producing buildings increased their output efficiencies by nearly double from Chapter 18 to Chapter 21.[BR]Mana requirements increased their request by slightly over double from Chapter 18 to Chapter 21.\t\tClick to expand...[BR]OK, try ch21 without a Dragon Abbey, but thanks for the insight. [smilie--sprite1]"}, {"6": "Yes, and wasn't that the same 35k per spell you would have been getting in Chapter 18?"}, {"4": "Sir Derf said:\t\t\tYes, and wasn't that the same 35k per spell you would have been getting in Chapter 18?\t\tClick to expand...[BR]No as it increases in amount for every province completed."}, {"6": "I'm not saying it doesn't help.  I am saying that, as you have observed, you need to use it more to progress through Chapter 21 than 18, while the Mana-producing buildings are roughly as powerful in Chapter 21  as they were in Chapter 18."}]