[{"6": "m4rt1n said:\t\t\tNo as it increases in amount for every province completed.\t\tClick to expand...D'oh.[BR][BR]So, did you increase the number of your Scouted Provinces by 1.414 and your Wonder Levels by 1.414 since Chapter 18?"}, {"4": "Sir Derf said:\t\t\tD'oh.[BR][BR]So, did you increase the number of your Scouted Provinces by 1.414 and your Wonder Levels by 1.414 since Chapter 18?\t\tClick to expand...[BR]Being end game, I have been scouting for 3 years between 18-21 don't have the numbers but I currently have 855 completed, ch21 research so far asks for 670 but possibly 680 as that was a quest with an alternative.[BR][BR]Also yes I constantly use swap threads and increase wonder levels current 923."}, {"8": "m4rt1n said:\t\t\tI currently have 855 completed, ch21 research so far asks for 670 but possibly 680 as that was a quest with an alternat\t\tClick to expand...855 is impressive. I always forget to send my scouts out and about, so I just got the 670 that the quest required. [smilie--sprite1]"}, {"12": "Herodite said:\t\t\tI am merely the enthusiastic messenger [smilie--sprite8]Click to expand...[BR][IMG]https://i.ibb.co/zVvQFbh/https-en-forum-elvenar-com-index-php-attachments-1694394522725-png-7815.png[/IMG][BR][smilie--sprite1]"}, {"12": "m4rt1n said:\t\t\tbut I currently have 855 completed\t\tClick to expand...Now I feel less than adequate.  [smilie--sprite10][BR][BR][IMG]https://i.ibb.co/3hWcSKr/https-en-forum-elvenar-com-index-php-attachments-1694395997880-png-7816.png[/IMG]"}, {"13": "Perhaps, this just means that you should not try to rush through Chapter 21."}, {"4": "Solanix said:\t\t\tPerhaps, this just means that you should not try to rush through Chapter 21.\t\tClick to expand...[BR]Or you can pre-prepare for others reading so save up mana etc knowing so much is needed."}, {"14": "Solanix said:\t\t\tPerhaps, this just means that you should not try to rush through Chapter 21.\t\tClick to expand...[BR]Nah, it just means we have escalating costs because Inno is exploring various way to slow their players down, and/or would like to make people use diamonds more."}, {"6": "Or, just, y'know, escalating resource costs because, well, that's how a resource-management game gets harder, especially as said resource-management game includes improvements that increase the efficiency of said resource-producing buildings."}, {"14": "Sir Derf said:\t\t\tOr, just, y'know, escalating resource costs because, well, that's how a resource-management game gets harder, especially as said resource-management game includes improvements that increase the efficiency of said resource-producing buildings.\t\tClick to expand...[BR]Considering the cost doubled, yet efficiency on production did not; feel free to keep kidding yourself."}, {"6": "Killiak said:\t\t\tConsidering the cost doubled, yet efficiency on production did not; feel free to keep kidding yourself.\t\tClick to expand...[BR]Except it did...[BR][BR]Sir Derf said:\t\t\tLava Egg, Chapter 18, 108.1 Mana/sq/hr    Lava Egg, Chapter 21, 210.9 Mana/sq/hr, 195.1%[BR]Watchful Winter Owl, Stage 10, Chapter 18, 109.4 Mana/sq/hr    Watchful Winter Owl, Stage 10, Chapter 21, 213.3 Mana/sq/hr, 195.0%[BR]Manta Ray, Chapter 18, 111.1 Mana/sq/hr    Manta Ray, Chapter 21, 218.8 Mana/sq/hr, 196.9%[BR]Somnial Pool, Chapter 18, 121.5 Mana/sq/hr    Somnial Pool, Chapter 21, 236.1 Mana/sq/hr, 194.3%[BR][BR]Mana producing buildings increased their output efficiencies by nearly double from Chapter 18 to Chapter 21.[BR]Mana requirements increased their request by slightly over double from Chapter 18 to Chapter 21.\t\tClick to expand..."}, {"14": "Sir Derf said:\t\t\tExcept it did...\t\tClick to expand...[BR]Except it didn't, like you have just posted yourself. 194% is not double.[BR]And 227% is not \"slightly over double\", it's well beyond double.[BR][BR]Nor were those production facilities even close to enough in chapter 18 to smoothly keep up with increased mana demands.[BR][BR]The numbers are staring you, and us all, right in the face. My point stands firmly.[BR][BR][BR]Edit: I would also like to add that you selected a few of the higher end event buildings, which means people can't build those in great numbers to buff their mana production. Cherry picking these buildings is a false comparison at best, but even if we could build loads of them the numbers are still not in favor of your stance here."}, {"4": "Solanix said:\t\t\tPerhaps, this just means that you should not try to rush through Chapter 21.\t\tClick to expand...[BR]Yes, but I did, so now waiting on ch22, I did it for free, using game resources I had built up and the mana was an issue and some of the upgrades can wait as I rebuild mana, about 1500 spells placed to use the Dragon Abbey, put it this way, some of my culture and my workshops are spelled up now to the new year.[BR][BR]The new buildings I have so far have amazing graphics but the roads are a bit bright, I wish orc roads were not settlement locked as those were my favourite."}, {"15": "m4rt1n said:\t\t\tI wish orc roads were not settlement locked as those were my favourite.\t\tClick to expand...They are not anymore. You don't need settlement goods to build them, it has been changed a few months ago I think. They won't provide much culture though...."}, {"4": "Hekata said:\t\t\tThey are not anymore. You don't need settlement goods to build them, it has been changed a few months ago I think. They won't provide much culture though....\t\tClick to expand...[BR]Thank you, decided to use them for my temp buildings rather than just plain ones as improves the look of my city. [smilie--sprite1]"}, {"15": "That's a very nice idea, the plain footpath is a bit dull indeed [smilie--sprite1]"}, {"7": "Discovered a Mana Rune building in a tome in my Sorceries, which I decided to place to help with the high mana demand in this chapter, as it advertised it \"boosts the mana production in your city\" with 70% for 15 days! That seemed like a big help and you'd think it would then increase all mana production, but as always with Inno, it's less than advertised, because it doesn't get applied to all mana productions.[BR][IMG]https://i.ibb.co/RbxXrp7/https-en-forum-elvenar-com-index-php-attachments-1695027967090-png-7843.png[/IMG][BR]For regular mana-only producing buildings, it works well, the Dragon Rock Gorge gets a nice 70% bonus, and so do the Magical Mana Hut, Somnial Pool, and Burning Pool in my city (I assume if I were to place a Manta Ray or whatever mana focused event building, that would apply as well).[BR][BR]However, I also have a lot of Set Buildings and Evolvables in my city that provide mana, but the Set buildings don't get the bonus applied to the set bonus amounts, but only to the main mana number, which is only a small amount. Here's a screenshot of the Revelers Fountain to illustrate, where the actual bonus effectively comes down to only 15,56% and not 70%.[BR][IMG]https://i.ibb.co/dPBPy71/https-en-forum-elvenar-com-index-php-attachments-1695026755923-png-7837.png[/IMG][BR][BR]And another example where the bonus doesn't even get applied at all, is in most of my Evolvables. I have 10 evo's that give me mana, but only 3 of them get the bonus, the rest get 0% extra mana. Here's a screenshot of the Red Panda Master (with 70% bonus) and one of the Watchful Winter Owl (with 0% mana bonus from the Mana Rune, as you can see by the missing green boost-arrow).[BR][IMG]https://i.ibb.co/BzdF4h3/https-en-forum-elvenar-com-index-php-attachments-1695026857624-png-7838.png[/IMG][IMG]https://i.ibb.co/df56C0m/https-en-forum-elvenar-com-index-php-attachments-1695026911614-png-7839.png[/IMG][BR][BR]Overall, when I look at all mana producing buildings in my city and look at the actual percentage extra mana I get from the Mana Rune, it's only 31,36%, not 70%.[BR][IMG]https://i.ibb.co/7yC5Nj9/https-en-forum-elvenar-com-index-php-attachments-1695028242865-png-7844.png[/IMG][BR][BR]So like I said, I think the wording of the Mana Rune building is totally misleading and it needs added text that it doesn't apply to all your mana buildings. Right now it's just false advertisement again, or a load of orc dung, to stay in game terms.[BR][BR]Don't get me wrong, I'm still happy with any extra mana I can get my hands on because the chapter demand is so insanely high I'll count my wins any way I can, but that's not my point. Don't say a building gives a 70% boost to your city's mana production, if it doesn't do exactly that.[BR][BR]Edit: I wonder if this is actually working as intended or if this is actually a bug that some of my evolvables get 0% boost? I mean, for set buildings I can somewhat understand (not agree with, but understand, because that's how Inno usually works) that the bonus only gets applied to the main amount of a set building and not to the added set bonus amounts, but to actually get no boost at all in an evolvable seems odd... @Herodite could you maybe see if you can find out whether this is 'working as intended'?"}, {"16": "C-Nymph said:\t\t\tfalse advertisement\t\tClick to expand...The fine print on the underside of the building:[BR]\"Contents may differ from that shown on the packaging.[BR]Image for illustrative purposes only.\"[BR][smilie--sprite11]"}, {"5": "@C-Nymph Im sure i've come across this question before and found the answer! I DO believe it is as intended but let me get some clarification! [BR][BR]Kind Regards[BR][BR]Herodite."}, {"4": "The mana rune building enabled me to finish the chapter as quickly as I did in the end, a fellow of mine pointed out I may have it and it saved the day. [smilie--sprite1]"}]