[{"7": "m4rt1n said:\t\t\tThe mana rune building enabled me to finish the chapter as quickly as I did in the end, a fellow of mine pointed out I may have it and it saved the day. [smilie--sprite1]Click to expand...I never questioned its worth, I just think it either should give more mana bonus because of the way it's advertised, or the description needs some adjustments to match the truth of the situation. Because even though it's worth having one, it is a minor disappointment when you expect more from the way it's described."}, {"4": "C-Nymph said:\t\t\tI never questioned its worth, I just think it either should give more mana bonus because of the way it's advertised, or the description needs some adjustments to match the truth of the situation. Because even though it's worth having one, it is a minor disappointment when you expect more from the way it's described.\t\tClick to expand...[BR]Yes I totally agree there, I noticed also my sets boost was less than I expected."}, {"15": "C-Nymph said:\t\t\tAnd another example where the bonus doesn't even get applied at all, is in most of my Evolvables.\t\tClick to expand...I think it has been said before that in case of buildings that boost any kind of production in only applies to the building's main production. Your Red Panda's main production is mana and so it gets a 70% boost but your Owl's main production is supplies, therefore 0% boost.[BR]And the same logic probably applies to the set buildings.[BR][BR]Edit: I've had similar situations with buildings that boost coins and other stuff. And it also applies to potions etc..."}, {"11": "Good job that Dragon Rock Gorge is a great mana producer [smilie--sprite1]"}, {"4": "Lighthouse of Good Neighbourhood is a great help if you have a few mana event buildings and active neighbourly help, and spell them up with EE spells."}, {"8": "Finished [smilie--sprite1]"}, {"7": "OldHag said:\t\t\tFinished [smilie--sprite1]Click to expand...Well done! Me too! [smilie--sprite8][BR][BR]And now, for the first time in years, since I started being 'behind' on chapters in chapter 15 due to all sorts of real life stuff, I now get a break in between chapters! Woohoo![BR]And that leaves me also finally being able to place the expiring buildings I have been hoarding since then, most importantly the Genies and leftover Wishing Wells I had been holding onto ♥[BR][BR]See here my nice little farm that will hopefully give me a good amount of Diamonds in the next 100 days   [smilie--sprite1][BR]38 Genies, 8 Wishing Wells, 23 Goddesses of Wishes, 7 Monuments of Ancient Knowledge, and 3 Carting Libraries to fill it up [smilie--sprite1][BR][BR][IMG]https://i.ibb.co/kyJRbXj/https-en-forum-elvenar-com-index-php-attachments-1696180747152-png-7904.png[/IMG][BR][BR]And after they are all done, I have another 40 Ferris Wheels, 43 Carting Libraries, 20 Trading Stations, 9 Trading Outposts, and a bunch of those Begonia's/Amaryllis fields left in my inventory to place! That'll keep me busy until a new chapter arrives [smilie--sprite2]"}, {"8": "C-Nymph said:\t\t\tWell done! Me too! [smilie--sprite8][BR][BR]And now, for the first time in years, since I started being 'behind' on chapters in chapter 15 due to all sorts of real life stuff, I now get a break in between chapters! Woohoo![BR]And that leaves me also finally being able to place the expiring buildings I have been hoarding since then, most importantly the Genies and leftover Wishing Wells I had been holding onto ♥[BR][BR]See here my nice little farm that will hopefully give me a good amount of Diamonds in the next 100 days   [smilie--sprite1][BR]38 Genies, 8 Wishing Wells, 23 Goddesses of Wishes, 7 Monuments of Ancient Knowledge, and 3 Carting Libraries to fill it up [smilie--sprite1][BR][BR]View attachment 7904[BR][BR]And after they are all done, I have another 40 Ferris Wheels, 43 Carting Libraries, 20 Trading Stations, 9 Trading Outposts, and a bunch of those Begonia's/Amaryllis fields left in my inventory to place! That'll keep me busy until a new chapter arrives [smilie--sprite2]Click to expand...Congrats to you too. That pic is brilliant @C-Nymph [smilie--sprite1][BR]This is the fastest I've ever finished a chapter also. I don't have that kind of stash, but I've been putting my Evolving buildings and set buildings back in my city. I don't do pics....lol [smilie--sprite1]"}, {"16": "OldHag said:\t\t\tI don't do pics\t\tClick to expand...We'll accept a hand drawn sketch [smilie--sprite7]"}, {"4": "I did similar with wishing wells and genies after ch20 and now have just 8 genie in after ch21 with a few other expiring buildings, a couple of sets and most evolving buildings now they can be teleported."}, {"8": "Jake65 said:\t\t\tWe'll accept a hand drawn sketch [smilie--sprite7]Click to expand...My pencil broke [smilie--sprite1]"}, {"9": "C-Nymph said:\t\t\tWell done! Me too! [smilie--sprite8][BR][BR]And now, for the first time in years, since I started being 'behind' on chapters in chapter 15 due to all sorts of real life stuff, I now get a break in between chapters! Woohoo![BR]And that leaves me also finally being able to place the expiring buildings I have been hoarding since then, most importantly the Genies and leftover Wishing Wells I had been holding onto ♥[BR][BR]See here my nice little farm that will hopefully give me a good amount of Diamonds in the next 100 days   [smilie--sprite1][BR]38 Genies, 8 Wishing Wells, 23 Goddesses of Wishes, 7 Monuments of Ancient Knowledge, and 3 Carting Libraries to fill it up [smilie--sprite1][BR][BR]View attachment 7904[BR][BR]And after they are all done, I have another 40 Ferris Wheels, 43 Carting Libraries, 20 Trading Stations, 9 Trading Outposts, and a bunch of those Begonia's/Amaryllis fields left in my inventory to place! That'll keep me busy until a new chapter arrives [smilie--sprite2]Click to expand...I sit here in admiration........that's of course after I picked up my bottom jaw from the floor lol [smilie--sprite12][smilie--sprite12][smilie--sprite12][smilie--sprite12]"}, {"9": "OldHag said:\t\t\tFinished [smilie--sprite1]Click to expand...well done......I'm not too far behind, that gosh darn mana is holding me back grrrr [smilie--sprite4]"}, {"7": "kimkimkim said:\t\t\twell done......I'm not too far behind, that gosh darn mana is holding me back grrrr [smilie--sprite4]Click to expand...For the last bit I actually had help from the Cauldron of all places! Got a settlement resources boost for 30-something hours that let me make 29 oblations per slot instead of my usual 23. Which in turn also made me use the little mana I had more efficiently.[BR]I went for the mana boost but RNG gave me the settlement resources boost instead but that might have actually been better [smilie--sprite1][BR]So it might be worth it to try if the Cauldron can help you advance a little bit faster?[BR](Edit: the settlement resource boost is called Gift of the High Men btw)"}, {"8": "kimkimkim said:\t\t\twell done......I'm not too far behind, that gosh darn mana is holding me back grrrr [smilie--sprite4]Click to expand...I made everything else I needed (noble oblations mainly). whilst saving up my mana, but was only able to make 1 lot of rude oblations per day.......boring, so I started to use up my stash of PoP spells on my magic workshops to get enough mana to finish off the rude oblations, along with some 5hr time boosters to get them done as quickly as possible. I've now got 39days of spells on my W/S and I still have 2k of those spells left. I used quite a lot of EEs also, but I had way more PoP spells."}, {"7": "OldHag said:\t\t\tI've now got 39days of spells on my W/S\t\tClick to expand...[IMG]https://i.ibb.co/LZnhX5S/https-en-forum-elvenar-com-index-php-attachments-1696256001073-png-7915.png[/IMG][BR]My spells last just a 'tad' longer [smilie--sprite2] I did dump them all on one WS only, because I'm often maxed out on supplies already."}, {"4": "I have 6 workshops with 88 days on each and having to use the wholesaler every collect currently.[BR][BR]On my 9 hour collect I have to visit the wholesaler twice."}, {"8": "Mine are spread out over 7 w/s and like you @m4rt1n I'm at the wholesalers all the time at the moment. [smilie--sprite1]"}, {"7": "[IMG]https://i.ibb.co/LSFD1LT/https-en-forum-elvenar-com-index-php-attachments-1696328061460-png-7919.png[/IMG][BR]Why on earth does the placement of an ancient wonder now cost spell fragments, CC's and RR's?????!! Especially RR's are one of the rarest resources to come by, I am even spending diamonds to craft them because I'm always short and now I should just throw them away to be able to build an AW??? And every 5 levels the RR cost increases by 10.[BR]Of all the resources you could choose you go for this option... THIS IS NOT OK!!! [BR]May whoever came up with this nonsense get an incurable itch in an unreachable spot  [smilie--sprite4]"}, {"15": "C-Nymph said:\t\t\tMay whoever came up with this nonsense get an incurable itch in an unreachable spot  [smilie--sprite4]Click to expand...[smilie--sprite8] [smilie--sprite8] [smilie--sprite8][BR][BR]Seriously though, I'd maybe understand if it started with 1 RR and then added 1 RR every 5 levels, but we are talking about huge amounts here!"}]