[{"7": "The description of the Royal Restoration Spell even reads: upgrade summonable buildings obtained through events or created in Crafting. And the Wiki confirms that this is the only purpose of the RR, as the wiki says it allows you to upgrade your Culture, Population, and Production Event Buildings.[BR]They cost BLUEPRINTS or DIAMONDS to craft, how on earth is it acceptable that an ANCIENT WONDER requires those rare resources to build/upgrade????!!!! [smilie--sprite4] [smilie--sprite12][BR]This is simply unacceptable!!!"}, {"8": "C-Nymph said:\t\t\tMay whoever came up with this nonsense get an incurable itch in an unreachable spot  [smilie--sprite4]Click to expand...[BR][smilie--sprite8][BR]C-Nymph said:\t\t\tThe description of the Royal Restoration Spell even reads: upgrade summonable buildings obtained through events or created in Crafting. They cost BLUEPRINTS or DIAMONDS to craft, how on earth is it acceptable that an ANCIENT WONDER requires those rare resources to build/upgrade????!!!! [smilie--sprite4] [smilie--sprite12][BR]This is simply unacceptable!!!\t\tClick to expand...[BR]I'm not sure I'll be building either of them with those costs."}, {"4": "I have built both of the AW's mainly because I had a huge stash of RR and CC spells, but can see that the upgrades get increasingly expensive which I agree is unreasonable.[BR][BR]The Ascended Goods boosts for collecting community work are incorrect though on the Maman Le Pre Antique Shop, mine is level 5 and says 900% on ascended goods yet I am actually getting around 90% of 3 hour base production per 3 hour collect.[BR][BR]@Herodite could you please check this out. [smilie--sprite1]"}, {"5": "I'll look into it now..."}, {"5": "Right @m4rt1n i've had a look and it seems to be working as intended. The percentage is based on your Community Work Regular Production:[BR][BR][IMG]https://i.ibb.co/hFhzSHD/https-en-forum-elvenar-com-index-php-attachments-community-work-png-7921.png[/IMG][BR][BR]So in the above scenario (with a 900% AW Boost), when you collect your Community Work, you'll also collect an additional 864 Ascended Goods.[BR][BR]It doesn't increase your Ascended Good Manufactory Production.[BR][BR]Does that help  [smilie--sprite1][BR][BR]Kind Regards[BR][BR]Herodite."}, {"4": "Herodite said:\t\t\tRight @m4rt1n i've had a look and it seems to be working as intended. The percentage is based on your Community Work Regular Production:[BR][BR]View attachment 7921[BR][BR]So in the above scenario (with a 900% AW Boost), when you collect your Community Work, you'll also collect an additional 864 Ascended Goods.[BR][BR]It doesn't increase your Ascended Good Manufactory Production.[BR][BR]Does that help  [smilie--sprite1][BR][BR]Kind Regards[BR][BR]Herodite.\t\tClick to expand...[BR]Yes that explains it, I thought the percentage was base ascended goods not community work, so no where near as good as I thought, oh well."}, {"11": "Congratz to everyone who’s completed the chapter already.  I’m plodding thru at a modest pace but I’m well over halfway there!"}]