[{"36": "Liebe Menschen und Elfen,[BR][BR]hier ist Platz für euer Feedback zum Event Herbstliche Sternzeichen.[BR][BR]Viele Grüße[BR]Euer Elvenar Team"}, {"14": "ich freue mich auf das Event, da mir die Optik des Evo gut gefällt, [BR]es klein ist (3x3) und im Turnier Kombis bringen kann, vorausgesetzt man hat Futter[BR][BR]da das GA so gar nicht \"meins\" ist, ist es dann endlich wieder etwas, was mir Spaß macht  [smilie--sprite1]"}, {"157": "Das Gebäude sieht cool aus. Kompliment an die Grafiker. Ob ich es aufstellen werde, kann ich noch nicht sagen^^ Entscheide ich, wenn ich die Werte konkret vor mir sehe. Vielleicht fliegt dann einer der Bären raus [BR]Wenn ich es richtig verstehe, könnte man damit seine Kombivorräte boostern, wenn man fleissig Turnier spielt. Mal sehen, wie sich die Futtersituation durch das neue Update verbessert"}, {"6": "Masthor Sten schrieb:\t\t\tWenn ich es richtig verstehe, könnte man damit seine Kombivorräte boostern, wenn man fleissig Turnier spielt.\t\tZum Vergrößern anklicken....Auf Stufe 10: 5 Turnierbegegnungen = 1 Kombiauslöser"}, {"14": "der Futtereffekt hält 60 h[BR][BR]dieser Tinlug ist Stufe 8 (auf Beta):[BR][BR][IMG]https://i.ibb.co/c8T9hBy/https-de-forum-elvenar-com-index-php-attachments-screenshot-1036-png-38593.png[/IMG][BR]ich werde ihn auf jeden Fall stellen! [smilie--sprite1]"}, {"11": "Event ist super, ABER wieder ein neues evo Gebäude. Wieso nicht vorhandene weiter ausbaubar machen??"}, {"205": "Ich freu mich über neue, die wirklich gut sind.... da verabschiede ich mich doch gern von weniger effizienten Evos"}, {"153": "Wenn die Anzahl der Kombis so wie auf der Beta auch auf Live kommt, dann ist das Gebäude überraschend stark. Bin gespannt!"}, {"11": "Ich finde es schade das immer wieder neue kommen, und andere gute dann im müll landen"}, {"81": "Kann es sein das Inno dringend Geld braucht?[BR]Ich mein einmal ein gutes Evo zu bringen das viele Spieler 2-3 mal haben wollen lässt den Verdacht offen.[BR]Das kommt echt nicht oft vor [smilie--sprite2][BR][BR]Kommt das Event mit dem Anzeigebug im Evo (6 statt 5 Kämpfe pro Kombi)  life oder müssen wir länger darauf warten?[BR][BR]Ist für GA Spieler schon fast Pflicht [smilie--sprite1] da muss man die MA net wochenlang hochlaufen lassen und die MO's sparen für die Arche."}, {"103": "Sardukar schrieb:\t\t\tKann es sein das Inno dringend Geld braucht?[BR]Ich mein einmal ein gutes Evo zu bringen das viele Spieler 2-3 mal haben wollen lässt den Verdacht offen.[BR]Das kommt echt nicht oft vor [smilie--sprite2][BR][BR]Kommt das Event mit dem Anzeigebug im Evo (6 statt 5 Kämpfe pro Kombi)  life oder müssen wir länger darauf warten?[BR][BR]Ist für GA Spieler schon fast Pflicht [smilie--sprite1] da muss man die MA net wochenlang hochlaufen lassen und die MO's sparen für die Arche.\t\tZum Vergrößern anklicken....Nein, Inno erstellt keine Evolutionsgebäude für Events, weil es Geld braucht.[BR][BR]Ob Fehler vom Beta auf Live kommen, werdet Ihr sehen, wenn das Event startet. (auch wir sind keine Hellseher)"}, {"14": "in der Voranzeige für Stufe 10 scheint alles richtig zu sein mit 5 Turnieren auf Beta, ich weiß allerdings nicht, wie es aussieht, wenn gefüttert..[BR][BR][IMG]https://i.ibb.co/zX0mzkR/https-de-forum-elvenar-com-index-php-attachments-screenshot-1038-png-38623.png[/IMG]"}, {"9": "V.E.N.U.S schrieb:\t\t\tFeedback zum Event Herbstliche SternzeichenZum Vergrößern anklicken....Wenn Events schon nicht mehr zur Jahreszeit passen (zeitgemäß sind), dann ist das .......... ........[BR]Es war mal so. dass sonst Events angemessen im Bezug zur jeweiligen Jahreszeit oder Ereignis gestartet und geendet haben (Fakt).[BR][BR]Das am Beta getestet wird und alles etwas früher läuft ist ok, aber nun auch auf den Live-Servern?[BR][BR]Nur mal so mein Gedankengang, Herbstanfang ist auf der gesamten Nordhalbkugel am 23. September, doch da ist das Event schon beendet.[BR][BR]Frage, kommt dann das Winterevent schon im Herbst, ich meine, ich find's nicht schlecht, wer mag nicht schon Geschenke vor Weihnachten.[BR][smilie--sprite8] [smilie--sprite8] [smilie--sprite8][BR][BR]Wahnsinn, 8 Jahre lief fast immer alles identisch mit den Original (Real)- Zeiten, nun wird der Herbst bereits mitten im Sommer einkehren. [smilie--sprite8][BR][BR].. .. .. und wir lassen es dann bitte ab und an schon schneien, damit das ganze sehr realistisch wirkt und vergesst nicht die vielen bunten Herbstblätter in den Städten und das mitten im Sommer (einige gar noch Sommerferien). [smilie--sprite7]"}, {"3": "Ich freue mich auf Tinlug![BR]Das Sternzeichenevent ist mir immer am liebsten, weil die Grafik so schön gemacht ist. Meine Bären habe ich alle noch und werde mich von keinem trennen, wenn Tinlug in die Stadt einzieht.[BR]Kollidiert diesmal leider etwas mit meinem Urlaub, also weiß ich nicht, ob ich sehr weit komme. Aber dann steht eben ein junger Tinlug in meiner Stadt. Ist dann halt so."}, {"120": "Meteorologischer Herbstanfang ist immer am 1. September. Das Event startet ein paar Tage vorher, so what?"}, {"206": "Nichtmal eine Woche Pause zwischen GA und Event !?[BR]Und täglich grüßt das Hamster-Rad ... [smilie--sprite5]"}, {"9": "Kassiopeia24 schrieb:\t\t\tMeteorologischer Herbstanfang ist immer am 1. September. Das Event startet ein paar Tage vorher, so what?\t\tZum Vergrößern anklicken....Wenn dann die Sonne am Erdäquator schon in der Mittagszeit den Zenit erreicht,[BR]dann sind Tag und Nacht gleich lang und dieser Moment läutet den kalendarischen Herbstanfang ein.[BR]2023 ist das ganz genau um 08.49 Uhr am 23. September.[BR][BR]Herbstliche Sternzeichen[BR][BR][IMG]https://i.ibb.co/bsCn56x/https-de-forum-elvenar-com-index-php-attachments-1692911859262-png-38625.png[/IMG][BR][BR][IMG]https://i.ibb.co/R9RT3gj/https-de-forum-elvenar-com-index-php-attachments-1692912310461-png-38627.png[/IMG][BR][BR]...........  [smilie--sprite7] [smilie--sprite7] [smilie--sprite7][BR][BR]..... und[BR]Herbstliche Sternzeichen 2019 - Zwischen dem 23. September und dem 17. Oktober\t\t\t\t\t\tEvent - Herbstliche Sternzeichen\t\t\t\t\tLiebe Menschen und Elfen,  die Sternzeichen des Herbstes sind erschienen und es werden magische Ereignisse erwartet. Die Götter Kirit und Krarak haben ihre Kräfte vereint, um einen Zugang zu ihrer göttlichen Welt zu schaffen, und wie die Sterne es der Legende nach besagen, werden demnach drei...\t\t\t\t\tde.forum.elvenar.com\t\t\t\t.. .. ..​oha .. .. man kannte sich damals also aus ^^[BR]Mit der Meteorologie hat das Event so viel zu tun, wie ein Schuh im Kühlschrank.[BR]Eher mit dem astronomischen, wie auch jegliche Bilder des Events aufzeigen. [smilie--sprite2]​"}, {"120": "wenn du schon Erbsen zählen  willst, dieser Satz ist schlichtweg falsch[BR]AngelOfDead schrieb:\t\t\tHerbstanfang ist auf der gesamten Nordhalbkugel am 23. September, Zum Vergrößern anklicken....Bei uns in Irland beginnt der Herbst jedes Jahr am 01. September. Quelle met.ie ua"}, {"9": "Kassiopeia24 schrieb:\t\t\tbei uns in Irland beginnt der Herbst jedes Jahr am 01. September.\t\tZum Vergrößern anklicken....Aha .. ..[BR][IMG]https://i.ibb.co/ZG7KTxq/https-de-forum-elvenar-com-index-php-attachments-1692915520806-png-38629.png[/IMG][BR][BR][IMG]https://i.ibb.co/JB4HNtd/https-de-forum-elvenar-com-index-php-attachments-1692915565584-png-38630.png[/IMG][BR][BR]Keine Ahnung welches Irland du meinst, denn es ist.[BR]Herbstanfang auf der gesamten Nordhalbkugel am 23. September.[BR][BR]Kassiopeia24 schrieb:\t\t\twenn du schon Erbsen zählen willst,\t\tZum Vergrößern anklicken....Nö wollte und möchte ich nicht.[BR]Kassiopeia24 schrieb:\t\t\tdieser Satz ist schlichtweg falsch\t\tZum Vergrößern anklicken....Nö ist er nicht ^^[BR][IMG]https://i.ibb.co/Pj4vntp/https-de-forum-elvenar-com-index-php-attachments-1692916324800-png-38631.png[/IMG][BR][BR]Sorry fürs OT und Ende .. .."}, {"50": "Zum bevorstehenden Event gibt es eigentlich nicht viel zu sagen.[BR]Schöne grafisch gestaltete Gebäude, Aufgaben nach altbekannten Schema mit einigen, für den ein oder anderen, unschönen Aufgabenstellungen.[BR]Erreichen der benötigten Artefakte ist wie immer abhängig vom Glücksfaktor, ob man überhaupt zusätzliche EWs beim Öffnen der Spheren erhält oder eben nicht.[BR]----------------------------------------------------------------------------------------------------------------------------------------[BR]OT/Diskurs Jahreszeiten:[BR]Man sollte auch immer bedenken, dass es den meteorologischen und den kalendarischen Herbstanfang gibt und diese unterscheiden sich.[BR][BR]meteorologischer Herbstanfang begründet für Statistiken -> 01.09.2023[BR]kalendarischer Herbstanfang basierend auf die Astronomie -> 23.09.2023[BR][BR]Der meteorologische Beginn liegt immer am ersten Tag des Monats, in dem der kalendarische Jahreszeitwechsel stattfindet.[BR][BR]Nun kann man hier wieder anfangen die Erbsen zu zählen, welches der beiden Daten als Herbstbeginn herangezogen werden könnte bzw. sollte."}]