[{"153": "Da man im Event ja auch jahreszeitlich passende Gebäude gewinnt, finde ich es gut, wenn das Event gleich zu Beginn der Jahreszeit ist. Die Gebäude passen dann länger in die Jahreszeit. [BR][BR]Zum Beispiel ein Winter-Event im Februar würde mich sehr stören, weil ich im März dann schon keine Lust mehr habe auf Winterlandschaften.[BR][BR]OK, eine Woche später hätte im aktuellen Fall nicht geschadet, aber lieber zu früh als zu spät."}, {"24": "Okay... Das erste Mal seid langem, dass es umgekehrt ist, aber...[BR][BR]Toller Effekt, aber Sch... , ist das Vieh häßlich [smilie--sprite8]"}, {"11": "Events sind super, aber mal ein paar tage nur Insel pflegen wäre auch schön.[BR][BR]Und mal vorhandene weiter ausbau machen, und nicht immer neue, die eh kein platz finden."}, {"28": "Feytala1986 schrieb:\t\t\tToller Effekt, aber Sch... , ist das Vieh häßlich\t\tZum Vergrößern anklicken....Mit \"Vieh\" meinst Du vermutlich Tinlug die Sternenschlange?[BR][BR]Ich finde sie ja ganz putzig! [smilie--sprite2][BR][BR]Spoiler[IMG]https://i.ibb.co/b6QMkLH/https-de-forum-elvenar-com-index-php-attachments-1693066581477-png-38673.png[/IMG]"}, {"81": "Kassiopeia24 schrieb:\t\t\tMeteorologischer Herbstanfang ist immer am 1. September. Das Event startet ein paar Tage vorher, so what?\t\tZum Vergrößern anklicken....[BR]1 Sep. ist Starfield Zeit![BR][BR]Da wär mir der 23 Sept lieber...........[BR][BR]Mal schauen wie es wird. Spült sicher wieder genug Kohle in Innos Taschen [smilie--sprite1]"}, {"28": "Sardukar schrieb:\t\t\tIch mein einmal ein gutes Evo zu bringen das viele Spieler 2-3 mal haben wollen lässt den Verdacht offen.[BR]Das kommt echt nicht oft vor [smilie--sprite2]Zum Vergrößern anklicken....Da muss ich dir insbesondere mit Rückblick auf Mama Juls Reiseküche und den astralen Phoenix Recht geben.[BR]Mama Juls habe ich zwar auch hier und da stehen aber eigentlich fühlten sich hier vermutlich echt nur ganz wenig bis gar keine Spielerinnen und Spieler dazu verführt sich ein zweite oder sogar eine dritte Grundplatte zu holen.[BR][BR]Einerseits soll natürlich der kaufbare Vorteil kein allzu großes Ungleichgewicht zwischen Spielerinnen und Spielern die investieren und solchen die es nicht tun bringen, was es für INNO natürlich auch schwerer macht starke Anreize zu \"Mehrfachkäufen\" an sich zu schaffen.[BR]Ob und in welcher Zahl Geld mit Eventwährung-Zukauf verdient wird bzw. werden soll entzieht sich meiner Kenntnis, rein von der Logik her würde ich aber auch davon ausgehen dass je \"besser\" das Evo für eine möglichst große Mehrheit der Menschen und Elfen scheint oder auch sogar wirklich ist, desto eher würde ich davon ausgehen dass vermehrt Eventwährung nachgekauft werden würde.[BR]Wenn ich mir andererseits aber anfange vorzustellen dass bei Mama Juls Reiseküche z.B. ein \"Kaufanreiz\" evtl. dadurch geschaffen werden sollte, dass Menschen und Elfen sich 2 oder 3 Stück hinstellen um dann (immerhin [smilie--sprite1]) 2 oder 3 mal eine jeweils 1%ige Chance auf Tierfutter zu haben, dann bekomme ich irgendwie Kopfschmerzen.[BR][BR]Das letzte Evo was mir hier und da mal in Mehrfachplatzierung aufgefallen ist, war halt bei den eher \"kampforientierten\" Städten der Phönix der Morgendämmerung. Davon habe ich auch schon mal 6 Stück auf einem Haufen gesehen.[BR](Da habe ich mich dann auch kurz gefragt was sowas wohl in der Anschaffung kostet, hatte dann aber keine Lust es auszurechnen [smilie--sprite1])[BR][BR]Sardukar schrieb:\t\t\tIst für GA Spieler schon fast Pflicht [smilie--sprite1]Zum Vergrößern anklicken....Die zusätzlichen Kombinationsauslöser sind im GA bestimmt ganz nett, daher hier vielleicht der Kaufanreiz die \"Kombinationsauslöserbeute\" noch verdoppeln oder verdreifachen zu können.[BR]Ich hab Tinlug auf Beta, wie immer bei den neuen Evos in erster Linie zum reinen Betrachten und Ausprobieren, hingestellt - ist handlich auf 3x3 und bringt mir Mana und 3tes Bonusgut ein. Den Füttereffekt werde ich aber außerhalb von GAs wohl eher selten bis gar nicht nutzen.[BR][BR]Gespannt bin ich natürlich auch schon wieder auf das nächste Evo was sich mir dann auf beta anbieten wird - mal sehen was das so kann.[BR][BR]Sardukar schrieb:\t\t\tKommt das Event mit dem Anzeigebug im Evo (6 statt 5 Kämpfe pro Kombi) life oder müssen wir länger darauf warten?\t\tZum Vergrößern anklicken....littleFlex schrieb:\t\t\tOb Fehler vom Beta auf Live kommen, werdet Ihr sehen, wenn das Event startet. (auch wir sind keine Hellseher)\t\tZum Vergrößern anklicken....Es ist nun mal so, dass man das nie ganz ausschließen kann.[BR]Da ich den Fehler ja sehr frühzeitig am zweiten Beta-Eventtag gemeldet hatte lies sich der kleine Anzeigefehler auch erst sehr schnell und im 2ten Anlauf dann auch wirklich überall, also in allen Anzeigefenstern, auf beta beheben.[BR][BR]Selbstverständlich bin auch ich kein vollwertig ausgebildeter Hellseher aber es würde mich doch schon sehr wundern wenn dieser kleine Flüchtigkeitsfehler für die Live-Server nicht schon längst ausgemerzt wurde.[BR]Auf den Kombinationsauslöser-Ertrag an sich hatte dieser Fehler zudem auch gar keinen Einfluss.[BR]Tinlug hat ja direkt richtig geliefert - ist ja zum Glück ein ehrliches Reptil, war halt nur falsch beschriftet worden die Seeschlange [smilie--sprite2]"}, {"207": "Ich finde die Aufgabenliste nicht, [BR]bestimmt wieder blind vor lauter Herbsanfang ;-) [BR]zu diesem Thema, bei mir im Garten färben sich die Blätter der Buchen schon gelb, also für mich ist schon Herbst ;-) und den Blättern ist ganz egal, was der Kalender zeigt [smilie--sprite1]"}, {"28": "tassilo98 schrieb:\t\t\tIch finde die Aufgabenliste nicht,[BR]bestimmt wieder blind vor lauter Herbsanfang ;-)\t\tZum Vergrößern anklicken....\t\t\thttps://idavis-elvenar.com/events.html#quests\t\t[BR]Oben rechts unter der Weltkugel lässt sich die Sprache ändern."}, {"207": "Thebigunknown schrieb:\t\t\thttps://idavis-elvenar.com/events.html#quests\t\t[BR]Oben rechts unter der Weltkugel lässt sich die Sprache ändern.\t\tZum Vergrößern anklicken....Super, vielen Dank"}, {"24": "Thebigunknown schrieb:\t\t\tMit \"Vieh\" meinst Du vermutlich Tinlug die Sternenschlange?[BR][BR]Ich finde sie ja ganz putzig! [smilie--sprite2]Zum Vergrößern anklicken....Ja, tut mir leid... Ich finde die ganz ganz furchtbar...^^°"}, {"28": "Feytala1986 schrieb:\t\t\tJa, tut mir leid... Ich finde die ganz ganz furchtbar...^^°\t\tZum Vergrößern anklicken....Das muss dir ganz und gar nicht leid tun! Die Geschmäcker sind nun mal verschieden! [smilie--sprite1][BR][BR]Und ein Forum an sich dient ja unter anderem auch dazu dies widerzuspiegeln. [smilie--sprite2]"}, {"208": "Schönes Gebäude, wenn ich das jetzt teschnisch korrekt verstanden dann ist der Effekt des Gebäudes nicht so mein Ding (Fütterungseffekt) aber vllt. stell ich es allein aus optischen Gründen auf. [BR][BR]Es wäre manchmal ganz schön wenn man alte Gebäude aus 3-4 Jahren noch einmal wieder bringen würde oder man diese plötzlich über Stufe 10 aufwerten könnte. Das wäre interessant. [smilie--sprite1]"}, {"100": "[IMG]https://i.ibb.co/yS9YhfC/https-de-forum-elvenar-com-index-php-attachments-1693160753534-png-38694.png[/IMG]süsser kleiner Panda  .  Einen süssen kleinen Eisbär hab ich auch stehen .[BR]Ich darf mich auch  im nächsten Jahr daran erfreuen  . Weil es wohl keine Tausch artefakte gibt . Wie bei den letzten Herbstevents  . [BR]2 süsse kleine Bären  spielen in meinem Garten  , und sind zu sonst nichts gut  . Bin etwas angefressen ...."}, {"28": "[IMG]https://i.ibb.co/K0xSvHS/https-de-forum-elvenar-com-index-php-attachments-1693161604626-png-38695.png[/IMG][BR][BR]Hier mal meine beiden \"kleinen\" Bären meiner Kapitel 16-Stadt nach drei Jahren Elvenar.[BR]Auf den ersten Blick wirkt eigentlich nur der Eisbär auf Stadium 3 klein aber der stammt (immerhin [smilie--sprite1]) aus Kapitel 10.[BR][BR]Spoiler: Mondbär[IMG]https://i.ibb.co/4ZrY2Jp/https-de-forum-elvenar-com-index-php-attachments-1693162053275-png-38696.png[/IMG][BR]Für den Mondbär der zwar schon \"groß\" aber halt sehr alt ist, würde ich aktuell also 90 königliche Restaurierungen benötigen um ihn auf aktuellen Stand zu bringen und seine wahren Werte kennenzulernen.[BR][BR]Beim Eisbär wären es nur 54 Stück dafür fehlen mir dort aber auch weitere Artefakte - irgendwas ist immer! [smilie--sprite2][BR][BR]Da ich seitens unseres Community Managements gehört hatte, dass hier einige angeblich mit der angehäuften Anzahl königlicher Restaurierungen sogar angegeben haben sollen, möchte ich dies an dieser Stelle auch mal tun. [smilie--sprite1][BR][BR][IMG]https://i.ibb.co/CMN8FYq/https-de-forum-elvenar-com-index-php-attachments-1693162642191-png-38697.png[/IMG]"}, {"209": "Thebigunknown schrieb:Anhang 38695 ansehen[BR][BR]Hier mal meine beiden \"kleinen\" Bären meiner Kapitel 16-Stadt nach drei Jahren Elvenar.[BR]Auf den ersten Blick wirkt eigentlich nur der Eisbär auf Stadium 3 klein aber der stammt (immerhin [smilie--sprite1]) aus Kapitel 10.[BR][BR]Spoiler: MondbärAnhang 38696 ansehen[BR]Für den Mondbär der zwar schon \"groß\" aber halt sehr alt ist, würde ich aktuell also 90 königliche Restaurierungen benötigen um ihn auf aktuellen Stand zu bringen und seine wahren Werte kennenzulernen.[BR][BR]Beim Eisbär wären es nur 54 Stück dafür fehlen mir dort aber auch weitere Artefakte - irgendwas ist immer! [smilie--sprite2][BR][BR]Da ich seitens unseres Community Managements gehört hatte dass hier einige angeblich mit der angehäuften Anzahl königlicher Restaurierungen sogar angegeben haben sollen, möchte ich dies an dieser Stelle auch mal tun. [smilie--sprite1][BR][BR]Anhang 38697 ansehenZum Vergrößern anklicken...."}, {"209": "Thebigunknown schrieb:Anhang 38695 ansehen[BR][BR]Hier mal meine beiden \"kleinen\" Bären meiner Kapitel 16-Stadt nach drei Jahren Elvenar.[BR]Auf den ersten Blick wirkt eigentlich nur der Eisbär auf Stadium 3 klein aber der stammt (immerhin [smilie--sprite1]) aus Kapitel 10.[BR][BR]Spoiler: MondbärAnhang 38696 ansehen[BR]Für den Mondbär der zwar schon \"groß\" aber halt sehr alt ist, würde ich aktuell also 90 königliche Restaurierungen benötigen um ihn auf aktuellen Stand zu bringen und seine wahren Werte kennenzulernen.[BR][BR]Beim Eisbär wären es nur 54 Stück dafür fehlen mir dort aber auch weitere Artefakte - irgendwas ist immer! [smilie--sprite2][BR][BR]Da ich seitens unseres Community Managements gehört hatte dass hier einige angeblich mit der angehäuften Anzahl königlicher Restaurierungen sogar angegeben haben sollen, möchte ich dies an dieser Stelle auch mal tun. [smilie--sprite1][BR][BR]Anhang 38697 ansehenZum Vergrößern anklicken....Ja irgendwas ist immer.....Stimmt... wenn man keine Ahnung hat sollte man sich etwas zurück halten bevor man Schreibt!!!In meiner Kapitel17 Stadt kostet es mich zum Ausbau des Eisbären 9 Restaurierung. Und in deinem Kapitel 54? Solch eine Zahl habe ich noch nie gesehen [smilie--sprite1] 16 bei Evo Gebäuden ja aber sogar 90 wie du sagst bei dem Mondbär ? Wahnsinn bei meiner Nichte die  im Gleichen Kapitel wie du bist,kostet der Ausbau nur 9 Restaurierungen, Wissen oder sich gerne selber Lesen sind 2 Unterschiedliche Sachen!  Ich habe fast 300 Restaurierungen, wenn mein Kapitel durch ist baue ich aus , hatte noch nie ein Problem.[BR]Mein Fazit an dieser Stelle ist, man sollte nie so tun als  ob man etwas weiß und noch andere Belehren wollen, wenn man Fakten vor die Augen bekommt [smilie--sprite2]"}, {"28": "Mirkinho schrieb:\t\t\tJa irgendwas ist immer.....Stimmt... wenn man keine Ahnung hat sollte man sich etwas zurück halten bevor man Schreibt!!!In meiner Kapitel17 Stadt kostet es mich zum Ausbau des Eisbären 9 Restaurierung.\t\tZum Vergrößern anklicken....Ja, richtig @Mirkinho pro Feld und Kapitel sind immer je eine königliche Restaurierung fällig, daher würde es mich aktuell 54 königliche Restaurierungen kosten, um meinen Eisbären von Kapitel 10 auf Kapitel 16 zu bringen.[BR]Oder um mal mathematisch zu werden 6 x 9 = 54[BR]Die Restaurierungskosten sind selbstverständlich immer gleichbleibend ich habe lediglich die Anzahl der benötigten Kapitel mit einbezogen. [smilie--sprite2][BR]Der Mondbär (siehe Spoiler) ist, wie man im Screenshot unschwer erkennen kann auf Kapitel 5 - also müsste ich dort 90 Restaurierungen investieren um ihn auf mein aktuelles Kapitel zu bringen. Für dich zum Mitschreiben: @Mirkinho 10 x 9 = 90[BR][BR]Mirkinho schrieb:\t\t\tWissen oder sich gerne selber Lesen sind 2 Unterschiedliche Sachen!\t\tZum Vergrößern anklicken....Mirkinho schrieb:\t\t\tMein Fazit an dieser Stelle ist, man sollte nie so tun als ob man etwas weiß und noch andere Belehren wollen, wenn man Fakten vor die Augen bekommt [smilie--sprite2]Zum Vergrößern anklicken....Keine Ahnung welche Laus dir gerade über die Leber gelaufen sein mag aber ich kann dir nur wärmstens empfehlen die Beiträge anderer wenigstens erstmal aufmerksam zu lesen und diese auch wenigstens versuchen zu verstehen, bevor Du sie aus Gründen des eigenen Unverständnisses versuchst zu diskreditieren.[BR]Kommt gefühlt so wutgeladen/aggressiv daher und ich verstehe ehrlich gesagt absolut nicht warum."}, {"100": "Thebigunknown schrieb:\t\t\tAuf den ersten Blick wirkt eigentlich nur der Eisbär auf Stadium 3 klein aber der stammt (immerhin [smilie--sprite1]) aus Kapitel 10\t\tZum Vergrößern anklicken....Die Grundplatte meiner Bärchen wurden vor kurzem produziert  .  [smilie--sprite2][BR]Vor dem leidigen update  mit den bär/Phönix artefakten.[BR][BR]Ich kann es nicht ab , wenn Evos nur halb fertig sind  .[BR]Süss  ist eine Weile nett  [smilie--sprite1]   ,  aber irgendwann  nur noch unvollkommen . Daher kommen sie zurück in die Spielekiste.  Inventar .[BR][BR]Mirkinho schrieb:\t\t\tUnd in deinem Kapitel 54?\t\tZum Vergrößern anklicken....Das passt schon .  Es  muss den Bären  9 Kapitel ausbauen . Das sind den 54  königliche Restaurierungen .[BR]Oder bei 10 Kapiteln  sind es 90  Restaurierungen .[BR][BR]Ich hab eine 2te  Grundplatte für das Hexenhaus  . Die ist in Kapitel 3 .[BR]Ich bin in Kapitel 15  .[BR]12 Kapitel mal  16 sind  =    viele  königliche Restaurierungen[BR][BR]Edit :    oder so wie  @Thebigunknown     sagt[BR]Edit :   das 2te Hexenhaus ist aber auch süss [smilie--sprite1]"}, {"209": "Thebigunknown schrieb:\t\t\tDa muss ich dir insbesondere mit Rückblick auf Mama Juls Reiseküche und den astralen Phoenix Recht geben.[BR]Mama Juls habe ich zwar auch hier und da stehen aber eigentlich fühlten sich hier vermutlich echt nur ganz wenig bis gar keine Spielerinnen und Spieler dazu verführt sich ein zweite oder sogar eine dritte Grundplatte zu holen.[BR][BR]Einerseits soll natürlich der kaufbare Vorteil kein allzu großes Ungleichgewicht zwischen Spielerinnen und Spielern die investieren und solchen die es nicht tun bringen, was es für INNO natürlich auch schwerer macht starke Anreize zu \"Mehrfachkäufen\" an sich zu schaffen.[BR]Ob und in welcher Zahl Geld mit Eventwährung-Zukauf verdient wird bzw. werden soll entzieht sich meiner Kenntnis, rein von der Logik her würde ich aber auch davon ausgehen dass je \"besser\" das Evo für eine möglichst große Mehrheit der Menschen und Elfen scheint oder auch sogar wirklich ist, desto eher würde ich davon ausgehen dass vermehrt Eventwährung nachgekauft werden würde.[BR]Wenn ich mir andererseits aber anfange vorzustellen dass bei Mama Juls Reiseküche z.B. ein \"Kaufanreiz\" evtl. dadurch geschaffen werden sollte, dass Menschen und Elfen sich 2 oder 3 Stück hinstellen um dann (immerhin [smilie--sprite1]) 2 oder 3 mal eine jeweils 1%ige Chance auf Tierfutter zu haben, dann bekomme ich irgendwie Kopfschmerzen.[BR][BR]Das letzte Evo was mir hier und da mal in Mehrfachplatzierung aufgefallen ist, war halt bei den eher \"kampforientierten\" Städten der Phönix der Morgendämmerung. Davon habe ich auch schon mal 6 Stück auf einem Haufen gesehen.[BR](Da habe ich mich dann auch kurz gefragt was sowas wohl in der Anschaffung kostet, hatte dann aber keine Lust es auszurechnen [smilie--sprite1])[BR][BR][BR]Die zusätzlichen Kombinationsauslöser sind im GA bestimmt ganz nett, daher hier vielleicht der Kaufanreiz die \"Kombinationsauslöserbeute\" noch verdoppeln oder verdreifachen zu können.[BR]Ich hab Tinlug auf Beta, wie immer bei den neuen Evos in erster Linie zum reinen Betrachten und Ausprobieren, hingestellt - ist handlich auf 3x3 und bringt mir Mana und 3tes Bonusgut ein. Den Füttereffekt werde ich aber außerhalb von GAs wohl eher selten bis gar nicht nutzen.[BR][BR]Gespannt bin ich natürlich auch schon wieder auf das nächste Evo was sich mir dann auf beta anbieten wird - mal sehen was das so kann.[BR][BR][BR][BR]Es ist nun mal so, dass man das nie ganz ausschließen kann.[BR]Da ich den Fehler ja sehr frühzeitig am zweiten Beta-Eventtag gemeldet hatte lies sich der kleine Anzeigefehler auch erst sehr schnell und im 2ten Anlauf dann auch wirklich überall, also in allen Anzeigefenstern, auf beta beheben.[BR][BR]Selbstverständlich bin auch ich kein vollwertig ausgebildeter Hellseher aber es würde mich doch schon sehr wundern wenn dieser kleine Flüchtigkeitsfehler für die Live-Server nicht schon längst ausgemerzt wurde.[BR]Auf den Kombinationsauslöser-Ertrag an sich hatte dieser Fehler zudem auch gar keinen Einfluss.[BR]Tinlug hat ja direkt richtig geliefert - ist ja zum Glück ein ehrliches Reptil, war halt nur falsch beschriftet worden die Seeschlange [smilie--sprite2]Zum Vergrößern anklicken....Es ist für mich völlig Legitim, das man Dias kaufen muss um eine 2 Grundplatte zu bekommen. Inno muss irgendwo auch Geld verdienen um seine Mitarbeiter zu Bezahlen. Unser Elvenar Team hier solltest du wissen wird nicht Bezahlt und macht es fast Ehrenamtlich, was auch für alle anderen Spieler mal wichtig ist zu wissen. Aber 6 Gebäude sind mir schon sehr Utopisch! Damals bei den Bären ging das und da kam man , wenn man gut war auf 3 Gebäude.[BR]Die erste Platte bekommt man ohne Dias die 2 Kostet wohl Geld so ist das wohl. Ich Investiere dann Geld, weil ich finde [BR]es ist ein Super Evo Gebäude nach langem und ich will das haben, so einfach ist das. Man muss nix Kaufen was man nicht will, aber wenn ich was will,muss ich was dafür tun und wenn ich davon mehr will muss ich Zahlen !!! Steht jedem Frei!!!"}, {"4": "Meine Überlegung ist immer:[BR][BR]Was ist MIR wichtig an dem jeweiligen Evo? Beim Eisbären ist es die Zeitverkürzung, beim FeuerPhönix z.B. die Truppenstärkung. Und deshalb ist es MIR so egal, in welchen Kapitel z.B. Eisbär oder Feuerphönix rumhängen, weil der Rest, den diese Gebäude liefern, einfach nicht ins Gewicht fällt. [BR][BR]Genau so ist es bei der Mondbiblio, die ich auch weit unter derzeitigem Kapitel habe. Wichtig ist mir persönlich der grüne Kombi und den krieg ich, ob die Biblio nun auf Kap. 4 oder auf Kap. 20 ist"}]