[{"28": "Mirkinho schrieb:\t\t\tEs ist für mich völlig Legitim, das man Dias kaufen muss um eine 2 Grundplatte zu bekommen.\t\tZum Vergrößern anklicken....Mirkinho schrieb:\t\t\tDie erste Platte bekommt man ohne Dias die 2 Kostet wohl Geld so ist das wohl. Ich Investiere dann Geld, weil ich finde[BR]es ist ein Super Evo Gebäude nach langem und ich will das haben, so einfach ist das. Man muss nix Kaufen was man nicht will, aber wenn ich was will,muss ich was dafür tun und wenn ich davon mehr will muss ich Zahlen !!! Steht jedem Frei!!!\t\tZum Vergrößern anklicken....Hier muss ich dir wiederum völlig Recht geben! [smilie--sprite2]"}, {"209": "Thebigunknown schrieb:\t\t\tJa, richtig @Mirkinho pro Feld und Kapitel sind immer je eine königliche Restaurierung fällig, daher würde es mich aktuell 54 königliche Restaurierungen kosten, um meinen Eisbären von Kapitel 10 auf Kapitel 16 zu bringen.[BR]Oder um mal mathematisch zu werden 6 x 9 = 54[BR]Die Restaurierungskosten sind selbstverständlich immer gleichbleibend ich habe lediglich die Anzahl der benötigten Kapitel mit einbezogen. [smilie--sprite2][BR]Der Mondbär (siehe Spoiler) ist, wie man im Screenshot unschwer erkennen kann auf Kapitel 5 - also müsste ich dort 90 Restaurierungen investieren um ihn auf mein aktuelles Kapitel zu bringen. Für dich zum Mitschreiben: @Mirkinho 10 x 9 = 90[BR][BR][BR][BR]Keine Ahnung welche Laus dir gerade über die Leber gelaufen sein mag aber ich kann dir nur wärmstens empfehlen die Beiträge anderer wenigstens erstmal aufmerksam zu lesen und diese auch wenigstens versuchen zu verstehen, bevor Du sie aus Gründen des eigenen Unverständnisses versuchst zu diskreditieren.[BR]Kommt gefühlt so wutgeladen/aggressiv daher und ich verstehe ehrlich gesagt absolut nicht warum.\t\tZum Vergrößern anklicken....Nöö kein bisschen Wutgeladen oder Aggressiv! Dann musst du das besser Formulieren und nicht Schreiben was dich der Ausbau jetzt Kostet obwohl das für paar Stufen mehr Gerechnet ist ! Lese mal deinen eigenen Text![BR][BR]salandrine schrieb:\t\t\tMeine Überlegung ist immer:[BR][BR]Was ist MIR wichtig an dem jeweiligen Evo? Beim Eisbären ist es die Zeitverkürzung, beim FeuerPhönix z.B. die Truppenstärkung. Und deshalb ist es MIR so egal, in welchen Kapitel z.B. Eisbär oder Feuerphönix rumhängen, weil der Rest, den diese Gebäude liefern, einfach nicht ins Gewicht fällt.[BR][BR]Genau so ist es bei der Mondbiblio, die ich auch weit unter derzeitigem Kapitel habe. Wichtig ist mir persönlich der grüne Kombi und den krieg ich, ob die Biblio nun auf Kap. 4 oder auf Kap. 20 ist\t\tZum Vergrößern anklicken....Ich bin ganz deiner Meinung [smilie--sprite1]"}, {"28": "Mirkinho schrieb:\t\t\tNöö kein bisschen Wutgeladen oder Aggressiv!\t\tZum Vergrößern anklicken....Ok super, das beruhigt doch schon ein wenig.[BR]Mirkinho schrieb:\t\t\tDann musst du das besser Formulieren und nicht Schreiben was dich der Ausbau jetzt Kostet obwohl das für paar Stufen mehr Gerechnet ist ! Lese mal deinen eigenen Text!\t\tZum Vergrößern anklicken....Thebigunknown schrieb:\t\t\tHier mal meine beiden \"kleinen\" Bären meiner Kapitel 16-Stadt nach drei Jahren Elvenar.[BR]Auf den ersten Blick wirkt eigentlich nur der Eisbär auf Stadium 3 klein aber der stammt (immerhin [smilie--sprite1]) aus Kapitel 10.\t\tZum Vergrößern anklicken...."}, {"179": "Bin ich hier eigentlich der einzige, dem aufgefallen, ist, dass iDavis Seite seit ein paar Wochen komplett kaputt ist?[BR]ReferenceError: loadPage is not defined[Weitere Informationen] events.html:1:1[BR]TypeError: html_alert is undefined[Weitere Informationen] exception_handler.js:26:5[BR]ReferenceError: displayDailyPrizes is not defined[Weitere Informationen] events.html:1:13[BR][BR]Es wäre daher schön, wenn jemand die Questliste so posten würde, dass man sie auch lesen kann. Danke."}, {"210": "Rikku33 schrieb:\t\t\tBin ich hier eigentlich der einzige, dem aufgefallen, ist, dass iDavis Seite seit ein paar Wochen komplett kaputt ist?\t\tZum Vergrößern anklicken....Bei mir geht die Seite. [BR][BR]Warum hat eine Sternenschlange einen Gemüse in der Hand?[BR]Eine vegetarische chinesische Drachenschlange? Brr[BR]Das paßt doch nicht."}, {"206": "Rikku33 schrieb:\t\t\tEs wäre daher schön, wenn jemand die Questliste so posten würde, dass man sie auch lesen kann. Danke.\t\tZum Vergrößern anklicken....Klar ... kein Problem ... [smilie--sprite2][BR]Spoiler: Quest-ListeDie folgende Questliste wurde von idavis-elvenar.com am 28.08.2023 um 11:00 Uhr heruntergeladen.[BR]Behalte die Website im Auge, um über weitere Änderungen informiert zu werden.[BR]1. Gib 7x Nachbarschaftshilfe[BR]2. Produziere 2 Produkte einer beliebigen Manufaktur (3-stündige)[BR]3. Gib 4 WPs aus[BR]4. Produziere 4 Getränke[BR]5. Sammle eine Menge Münzen[BR]6. Produziere eine Menge irgendwelche Güter + Sammle 400 Zauberspruch-Fragmente ODER Erkunde 1 Provinz[BR]7. Produziere 6 Brote + Sammle 8 Relikte ODER Sammle 1 Kombinationsauslöser[BR]8. Gib 8 WPs aus + Erforsche 1 Technologie ODER Sammle 10-12 Visionsschwaden[BR]9. Produziere eine Menge Vorräte + Sammle 3x Hexenpunkte ODER Kaufe 14 WPs[BR]10. Schließe 6 Begegnungen (Provinz, Turnier oder Turm der Ewigkeit) ab + Investiere 10 WPs in ein beliebiges Antikes Wunder ODER Handle 2x beim Händler[BR]11. Schließe 4 Provinzbegegnungen über Verhandlungen ab ODER Schließe 4 Provinzbegegnungen im Kampf ab[BR]12. Produziere 4 Produkte einer Basismanufaktur (9-stündige) + Rekrutiere eine Menge Einheiten ODER Produziere 7 einfache Werkzeuge[BR]13. Produziere eine Menge Vorräte + Sammle 8 Relikte[BR]14. Kaufe 20 WPs + Sammle eine Menge Münzen[BR]15. Produziere 9 Brote + Benutze 3-4 Verzauberungen deiner Wahl ODER Benutze 2 Instants deiner Wahl[BR]16. Produziere eine Menge irgendwelche Güter + Baue 1 Gebäude auf Stufe 5 oder höher aus ODER Sammle 1 Verzauberung deiner Wahl[BR]17. Produziere 6 Produkte einer beliebigen Manufaktur (3-stündige) + Gib 8 WPs aus[BR]18. Produziere 4 Produkte einer beliebigen Manufaktur (9-stündige) + Schließe 8 Begegnungen (Provinz, Turnier oder Turm der Ewigkeit) ab ODER Sammle 15-18 Visionsschwaden[BR]19. Produziere eine Menge Vorräte + Sammle 2 Kombinationsauslöser ODER Schließe 1 Provinz[BR]20. Produziere 10 einfache Werkzeuge + Benutze 1 Zeit-Booster ODER Benutze or collect 6 Verzauberungen deiner Wahl[BR]21. Produziere 3 Produkte einer Basismanufaktur (9-stündige) + Schließe 6 Begegnungen (Provinz, Turnier oder Turm der Ewigkeit) ab ODER Benutze 3 Instants deiner Wahl[BR]22. Sammle 8 Relikte + Sammle 2 Kombinationsauslöser ODER Erforsche 1 Technologie[BR]23. Produziere eine Menge Vorräte + Kaufe 20 WPs ODER Schließe 1 Provinz[BR]24. Sammle eine Menge Münzen + Produziere eine Menge irgendwelche Güter[BR]25. Produziere eine Menge Vorräte + Sammle 4x Hexenpunkte ODER Sammle 8 Relikte[BR]26. Produziere 6 bessere Werkzeuge + Produziere 6 Produkte einer Basismanufaktur (3-stündige)[BR]27. Schließe 8 Begegnungen (Provinz, Turnier oder Turm der Ewigkeit) ab + Handle 3x beim Händler ODER Kaufe 20 WPs[BR]28. Benutze 1 Zeit-Booster + Erforsche 1 Technologie ODER Sammle 15-18 Visionsschwaden[BR]29. Gib 13x Nachbarschaftshilfe + Baue 2 Gebäude auf Stufe 5 oder höher aus ODER Sammle 600 Zauberspruch-Fragmente[BR]30. Produziere 4 Gemüsekörbe + Sammle 12 Relikte ODER Sammle 2 Verzauberungen deiner Wahl[BR]31. Produziere 6 Produkte einer Basismanufaktur (3-stündige) + Rekrutiere eine Menge Einheiten ODER Schließe 5 Provinzbegegnungen über Verhandlungen ab[BR]32. Produziere eine Menge irgendwelche Güter + Investiere 20 WPs in ein beliebiges Antikes Wunder ODER Handle 4x beim Händler[BR]33. Produziere 4 bessere Werkzeuge + Erstelle 3 Handelsangebote[BR]34. Produziere 16 Getränke + Benutze or collect 4 Verzauberungen deiner Wahl ODER Benutze 1x Vorratsregen[BR]35. Gib 12 WPs aus + Produziere eine Menge Vorräte[BR]36. Produziere 6 Produkte einer beliebigen Manufaktur (9-stündige) + Sammle 12 Relikte[BR]37. Sammle eine Menge Münzen + Schließe 4 Provinzbegegnungen im Kampf ab ODER Produziere 6 Produkte einer Basismanufaktur (3-stündige)[BR]38. Schließe 6 Begegnungen (Provinz, Turnier oder Turm der Ewigkeit) ab + Baue 1 Gebäude auf Stufe 5 oder höher aus ODER Sammle 600 Zauberspruch-Fragmente[BR]39. Produziere 6 bessere Werkzeuge + Sammle 12 Relikte[BR]40. Produziere eine Menge Vorräte + Sammle 4x Hexenpunkte ODER Rekrutiere eine Menge Einheiten[BR]41. Schließe 6 Begegnungen (Provinz, Turnier oder Turm der Ewigkeit) ab + Handle 3x beim Händler ODER Kaufe 20 WPs[BR]42. Sammle eine Menge Münzen + Produziere eine Menge irgendwelche Güter[BR]43. Produziere 4 Gemüsekörbe + Sammle 16 Relikte ODER Sammle 2 Verzauberungen deiner Wahl[BR]44. Produziere 6 bessere Werkzeuge + Produziere 6 Produkte einer Basismanufaktur (3-stündige)[BR]45. Gib 12 WPs aus + Erkunde 1 Provinz ODER Benutze or collect 6 Verzauberungen deiner Wahl[BR]46. Produziere 6 Produkte einer Basismanufaktur (9-stündige) + Erforsche 1 Technologie ODER Investiere 20 WPs in ein beliebiges Antikes Wunder[BR]47. Produziere eine Menge Vorräte + Schließe 1 Provinz ODER Sammle 20-24 Visionsschwaden[BR]48. Produziere 6 Produkte einer beliebigen Manufaktur (9-stündige) + Kaufe 27 WPs ODER Sammle 800 Zauberspruch-Fragmente[BR]49. Schließe 6 Begegnungen (Provinz, Turnier oder Turm der Ewigkeit) ab + Baue 2 Gebäude auf Stufe 5 oder höher aus ODER Sammle 4x Hexenpunkte[BR]50. Benutze 5-7 Verzauberungen deiner Wahl + Sammle 16 Relikte ODER Sammle 2 Kombinationsauslöser[BR]51. Produziere 7 Gemüsekörbe + Kaufe 20 WPs[BR]52. Sammle 20-24 Visionsschwaden + Produziere 10 Produkte einer beliebigen Manufaktur (3-stündige)[BR]53. Produziere 15 Brote + Schließe 8 Begegnungen (Provinz, Turnier oder Turm der Ewigkeit) ab[BR]54. Sammle 2 Kombinationsauslöser + Produziere eine Menge Vorräte[BR]55. Benutze 1 Zeit-Booster + Schließe 7 Provinzbegegnungen im Kampf ab ODER Schließe 7 Provinzbegegnungen über Verhandlungen ab[BR]56. Produziere 14 einfache Werkzeuge + Sammle 1000 Zauberspruch-Fragmente[BR]57. Kaufe 27 WPs + Sammle 3 Verzauberungen deiner Wahl[BR]58. Produziere eine Menge Vorräte + Gib 20 WPs aus[BR]59. Produziere 16 Getränke + Schließe 8 Begegnungen (Provinz, Turnier oder Turm der Ewigkeit) ab[BR]60. Sammle 2 Kombinationsauslöser + Sammle 12 Relikte[BR]- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -[BR]61. Produziere 8 bessere Werkzeuge + Sammle 3 Verzauberungen deiner Wahl ODER Erkunde 1 Provinz[BR]62. Kaufe 20 WPs + Investiere 20 WPs in ein beliebiges Antikes Wunder ODER Benutze 6-8 Verzauberungen deiner Wahl[BR]63. Schließe 10 Begegnungen (Provinz, Turnier oder Turm der Ewigkeit) ab + Erstelle 4 Handelsangebote ODER Schließe 5 Provinzbegegnungen im Kampf ab[BR]64. Produziere 10 bessere Werkzeuge + Produziere eine Menge irgendwelche Güter[BR]65. Sammle 1000 Zauberspruch-Fragmente + Handle 4x beim Händler[BR]66. Produziere 15 Brote + Sammle 20-24 Visionsschwaden[BR]67. Produziere 7 Produkte einer Basismanufaktur (9-stündige) + Benutze or collect 10 Verzauberungen deiner Wahl ODER Investiere 25 WPs in ein beliebiges Antikes Wunder[BR]68. Produziere eine Menge irgendwelche Güter + Sammle eine Menge Münzen[BR]69. Produziere 7 Produkte einer beliebigen Manufaktur (9-stündige) + Sammle 3 Kombinationsauslöser[BR]70. Produziere eine Menge Vorräte + Erkunde 1 Provinz ODER Produziere 6 Gemüsekörbe[BR]71. Sammle 1000 Zauberspruch-Fragmente + Handle 5x beim Händler ODER Rekrutiere eine Menge Einheiten[BR]Die folgende Aufgabe ist ab morgen verfügbar.[BR]Quelle: idavis-elvenar.comHier ist der Link dazu: \t\t\thttps://idavis-elvenar.com/events.html#quests\t\t"}, {"28": "Sumpf-Roeschen schrieb:\t\t\tBei mir geht die Seite.\t\tZum Vergrößern anklicken....Bei mir auch. Keinerlei Probleme! (Windows 11 / Google Chrome)[BR][BR]Sumpf-Roeschen schrieb:\t\t\tWarum hat eine Sternenschlange einen Gemüse in der Hand?\t\tZum Vergrößern anklicken....Ich denke es ist, passend zum Herbst, ein Kürbis den Tinlug in der Hand hat. [smilie--sprite2][BR][BR]Spoiler: Warum gibt es Kürbis nur im Herbst?Der Höhepunkt der Kürbis-Saison ist im Herbst, im September und Oktober. Sie endet schließlich mit dem ersten Frost, meist gegen Mitte November. Dennoch geht die Kürbiszeit im Grunde bis zum Winterende weiter, denn unbeschädigt sind die harthäutigen Früchte bei sorgfältiger Lagerung lange haltbar."}, {"1": "Ihr dürft dann gerne zum eigentlichen Thema, dem Feedback zum Event zurück kommen. Feedback, Bildchen und dergleichen von vergangenen Events könnt ihr in den entsprechenden Threads posten. idavis Seite geht nicht? Dann kontaktiert doch bitte dort den zuständigen. Wir können daran nichts ändern!"}, {"112": "ja klar. feedback zum event auf beta ---> bitte da abwerfen[BR]feedback zum event hier --- oops ist ja noch nicht also klappe halten.[BR]vorbereitungsstrategieen? aber bitte woanders."}, {"103": "gut erkannt !"}, {"112": "da frage ich mich allerdings: wozu ein feedback-Thema zu etwas wozu niemand was sagen kann (oder darf)?"}, {"103": "zB für ein Feedback des gestarteten Events auf dem entsprechenden Server[BR][BR]wie Du schon richtig eingeschätzt hast, beinhaltet das nicht Feedback zu anderen Servern und auch keine[BR]Strategiediskussionen. Feedback ist für die Entwickler, nicht für die Spieler."}, {"120": "also neuen Thread starten? Diskussion, Tipps & Co zum Event....?[BR]Wenn ihr meint das sei dann übersichtlicher.....[smilie--sprite11]"}, {"28": "Kassiopeia24 schrieb:\t\t\talso neuen Thread starten? Diskussion, Tipps & Co zum Event....?[BR]Wenn ihr meint das sei dann übersichtlicher.....\t\tZum Vergrößern anklicken....Das wäre die richtige Variante die es erlaubt auch Erfahrungen von anderen Servern und/oder Events mit einfließen zu lassen ohne im Feedbackthread allzu viel Verwirrung zu stiften bevor das Event überhaupt losgegangen ist.[BR][BR]Im US-Forum macht dies meine Kumpeline Lelanya zum Beispiel, wie ich finde, sehr vorbildlich vor.[BR][BR]Beispiel: https://us.forum.elvenar.com/index.php?threads/event-information.31230/#post-291834[BR][BR]Im deutschen Forum scheint es da bislang niemanden zu geben der sich die Mühe machen möchte.[BR][BR]Positiv aufgefallen im Spieler-Guide-Bereich auf DE sind mir bislang eigentlich nur @Melios mit seinem Wunderthread, der auch für mich schon mehrfach sehr lehrreich war, und halt der Taktik für Erzmagier/innen-Thread von @ZeNSiErT[BR][BR]In Sachen[BR]Kassiopeia24 schrieb:\t\t\tDiskussion, Tipps & Co zum Event....?\t\tZum Vergrößern anklicken....gibt es also augenscheinlich eine Lücke die jede(r) der oder die sich dazu berufen fühlt schließen könnte.  [smilie--sprite2]"}, {"98": "Noch 35 Stunden Event auf beta, hier mein Feedback: [BR][BR]An sich okay. [BR]Die Aufgaben etwas schwerer als sonst, aber nicht so, dass es mich nennenswert behindert hätte. Der Preis eigentlich nur für hohe Level sinnvoll, ich werde ihn auf beta wohl eher ignorieren. Ob hohe Level den allerdings überhaupt brauchen ist fraglich.Wie so oft ist die Optik des Evos am Anfang toll und es wird mit jeder Stufe hässlicher.Trotz Erfüllung aller Aufgaben und reichlich Sammelei reicht es mal wieder nur für Stufe 9.Immerhin gab es einige nette Tagespreise.Wie gesagt: an sich okay."}, {"32": "Thebigunknown schrieb:\t\t\tIm deutschen Forum scheint es da bislang niemanden zu geben der sich die Mühe machen möchte.\t\tZum Vergrößern anklicken....(Name ungenau) Culler hatte früher die Infos zu aktuellen Events immer in der Signatur ..[BR][BR]Der Thread hier dient mir normalerweise als extra Info um an mögliche Tips zum Event zu kommen - kann da Tacheless echt nur zustimmen; hier wird so viel Müll offtopic reingeschrieben (als mod, würd ich alle vergraulen und das Zeug löschen) Basta![BR][BR]Feedback:[BR]Die Questlinie sieht sehr herausfordernd aus; soviele 9-Stdn Produktionen gabs lange nicht mehr, und va sehr viel WP Kauf [smilie--sprite9][BR]#11 mit der forcierten Provinz..fertigung gefällt mir gar nicht, da wäre es schön auch eine Alternative zu haben.[BR]Freue mich auf den Tagespreis \"Kalligrafiekurs\" - hatten lange nicht mehr ein hohes Bev.-teil.[BR]pro/kontra folgt"}, {"206": "Dieses Spiel hat mich inzwischen arg zur Bescheidenheit erzogen ... [BR]denn viel zu oft wurde ich von diesem UN-Glücks-Generator frustriert. [smilie--sprite5][BR][BR]Diesmal hab' ich nur drei zwei Tagespreise ausgeguckt. Bin mal gespannt,[BR]was davon klappt ... oder ich nur einmal mehr enttäuscht werde. [smilie--sprite10][BR][BR]Habe z.Z. nur wenig Lust, hier noch viel Zeit und Energie rein zu stecken.[BR]Von meiner Motivation, echte Kohle dafür zu zahlen, ganz zu schweigen. [smilie--sprite11][BR][BR]Nun ja ... bin offen dafür, mich überraschen zu lassen ... ich werd 's ja seh'n ..."}, {"14": "Thebigunknown schrieb:\t\t\tIm deutschen Forum scheint es da bislang niemanden zu geben der sich die Mühe machen möchte.\t\tZum Vergrößern anklicken....doch, normal hat @Cruller alles zum nächsten Event immer hier in diesen Thread vorab gepostet:[BR][BR]https://de.forum.elvenar.com/index.php?threads/events.8465/page-5#post-452258[BR]und das Posting dann nach und nach bei neuen Infos angepasst: ich fand das immer toll und habe dort oft geguckt![BR][BR]diesmal allerdings noch nicht, evtl. ist auch mal jemand im Urlaub oder so[BR][BR]auf Beta im Winz-Level von V hab ich die Schlange bis auf Stufe 9 geschafft und da Bronzeliga wird sie wohl ohne GA auch nicht auf 10 kommen[BR][BR]ich fand die Aufgaben schwierig: für die Gütersammelquests hab ich teils 2 Tage gebraucht, für die WP-Käufe war mein Münzlager dann bis zum Anschlag leer und auch Güter mussten für den Kauf herhalten: ich fand das schlecht[BR]ebenso Visionsschwaden, wenn man noch kaum etwas herstellen kann in der Aka: übrigens fehlen mir dort am meisten Kombis[BR]einmal habe ich die Schlange auch gefüttert: der Effekt hält 60h, auch als kleiner Level kann man dann 3 Turnierrunden damit spielen:[BR]damit hat man dann mindestens 3 Kombis, je nachdem wie viele Provinzen man hat auch 6[BR]ja, es kostet 1 Futter, aber gerade Futter kommt momentan wirklich viel und man kann es dafür ausgeben[BR]Kombis in der Aka dauern ohne Höchstausbau (dafür fehlen die Dias), wirklich sehr lange[BR][BR]auf Live stelle ich das Evo auf jeden Fall, wenn ich es schaffe auch evtl. 2[BR]allerdings habe ich da eher Futterprobleme, weil ich da doch viel mehr gerne füttern möchte und dort sparen muss (für mich könnte da noch mehr Futter in der Aka kommen!)[BR][BR]1x die Woche ist Braunbär und Eisbär nötig[BR]und den Feurio und den Dämmerungsphönix möchte ich durchaus auch noch[BR]da fällt dann oft der rote Panda ganz raus, weil das Futter nicht reicht[BR]einmal wöchentlich wäre ab dem Event auch die Schlange dran[BR][BR]und für das Event den Aschephönix nicht vergessen [smilie--sprite1]"}, {"113": "WHOAABUMM[BR][BR]Der Ladebildschirm hat mich eben grade echt umgehauen, sowas von coooooooooooooooool! Holla"}, {"206": "Möchte diese komische \"Veggie-Schlange\" zwar nicht ... [BR]obwohl ... irgendwie witzig aussehen tut sie ja ...  [smilie--sprite2][BR][IMG]https://i.ibb.co/F30GYyp/https-de-forum-elvenar-com-index-php-attachments-tinlug-10-jpg-38738.jpg[/IMG][BR]Für die Animation der Evo-Stufen hier klicken![BR]Quelle: https://sites.google.com/view/public-druids/evo[BR]Dort findet Ihr auch andere Evo-Gebäude. [smilie--sprite2]"}]