[{"211": "lovelymonster schrieb:\t\t\tWHOAABUMM[BR][BR]Der Ladebildschirm hat mich eben grade echt umgehauen, sowas von coooooooooooooooool! Holla\t\tZum Vergrößern anklicken....Finde ich auch schick ... Schlange mit vier Beinen hatte mich irritiert, aber wieder etwas gelernt: vor etwa 100 Mio. Jahren hatten Terras Schlangen auch noch Beine, sagen etliche Seiten im Netz ...[BR]Noch mehr irritiert mich, dass das Gebäude ja nun eindeutig in die Nacht getaucht ist, zumindest mein erstes, bei dem das so klar ist ... Tempel der Sonne und des Mondes hingegen verlegt die Sternenklarheit in sehr tiefe Höhlen ... und alle anderen Gebäude bei mir sind ziemlich klar in die Sonne und den Tag getaucht. Und überhaupt brennt ja immer die Kultursonne, wenn ich in der Stadt unterwegs bin. Wenn's Nacht gibt, so bisher meine Vermutung, dann höchstens, wenn ich offline bin, vielleicht genau immer dann. Nun aber ist's gebäudeabhängig. Ähm, gibt mal bitte jemand einen Crash-Kurs in elvenarische Astronomie? Wie jetzt gleich kommt's, dass hier jetzt Nacht ist und überall drumherum Tag?"}, {"113": "Ranevle schrieb:\t\t\tWie jetzt gleich kommt's, dass hier jetzt Nacht ist und überall drumherum Tag?\t\tZum Vergrößern anklicken....Magie halt [smilie--sprite2]"}, {"2": "...das ist doch nett, wenn man 250.000 Güter sammeln soll... [smilie--sprite2][BR][BR][IMG]https://i.ibb.co/kB920mD/https-de-forum-elvenar-com-index-php-attachments-g-tersammeln-png-38721.png[/IMG][BR][BR]...EDIT: leider wird der Bonus in der Quest nicht angerechnet - ist das ein Fehler?..."}, {"126": "Ich finde die Kaufe WP Quests dieses mal extrem. 107 WP alternativlos und nochmal 101 für die es wenigstens ne Alternative gibt.[BR]Vor allem dieses mal einzelne Quests, die erfordern 27 WP zu kaufen. Neue Höchstmengen. Ich habe keine Schwierigkeiten damit, aber das heißt ja nicht, dass ich das Ganze gut finden muss."}, {"9": "Aufgabe 40 wurde abgeändert![BR][BR]Zuvor lautete sie:[BR][BR]40. Produziere eine Menge Vorräte[BR]+ Sammle 4x Hexenpunkte ODER Rekrutiere eine Menge Einheiten[BR][BR]Nun heißt sie:[BR][BR]40. Produziere eine Menge Vorräte[BR]+ Sammle 4x Hexenpunkte ODER Erkunde 1 Provinz[BR][BR][IMG]https://i.ibb.co/sghM7Hp/https-de-forum-elvenar-com-index-php-attachments-1693310993260-png-38722.png[/IMG][BR][BR][BR]... ach ja ... und vielen Dank @InnoGames![BR][BR][IMG]https://i.ibb.co/NLZg0qk/https-de-forum-elvenar-com-index-php-attachments-1693311704421-png-38723.png[/IMG]"}, {"118": "\t\t\t\t\t\tZodiaco Autunnale 2023 - Premi Giornalieri\t\t\t\t\tFan-Blog dei Cavalieri dello Zombiaco, dedicato al gioco Elvenar.  In nessuno modo collegato ad InnoGames Gmbh, proprietaria delle immagini.\t\t\t\t\tcavalieridellozombiaco.blogspot.com\t\t\t\t[BR][BR]Tagespreise"}, {"50": "Aufgabe 40 hieß ganz zu Beginn des Events (am zumindestens ersten Beta-Event-Tag) auf Beta vor den Änderungen der ominösen 3 Aufgaben schon ->[BR][BR]40. Produziere eine grosse Menge Vorräte UND Verwende 4x beliebiege Ressourcen für Hexenpunkte (Cauldron!) oder Erkunde 1 Provinz 57+2[BR][BR]Diese Aufgabe gehört anscheinend zu den 3 angekündigten überarbeiteten/geänderten Aufgaben vom Beta-Server, nachdem es berechtigte Kritik im Beta-Forum gab![BR]Es wurden damals die Erkundungs-Aufgaben mit ihren unschönen Alternativen und deren Häufigkeiten kritisiert.[BR][BR]Aber typisch INNO erreichen diese Änderungen die Live-Welten nicht und somit bekommen wir die Aufgaben, die es anfangs auf Beta vor den Änderungen gab.[BR][BR]Bereits Aufgabe 9 wurde nach der Kritik der Aufgabenstellung auf Beta geändert (eine von den ominösen 3 Aufgaben, die geändert werden sollten bzw. im Verlauf des Beta-Events geändert wurde), aber Live ist es wieder die ursprüngliche Aufgabenstellung -> Post von \"Aeva\"[BR]\t\t\t\t\t\tDiscussion - Theater Zodiac\t\t\t\t\t107 mandatory KPs to buy is utterly ridiculous. Say this goes live and I get that on my main account. Sure, I could afford it, but why would I even want to? I already am drowning in KP, so much so I hardly know what to do with them anymore.    In my chapter 21 US city, I only have one AW even at...\t\t\t\t\tbeta.forum.elvenar.com\t\t\t\t[BR]Das wird bereits im Beta-Forum thematisiert, dass die Änderungen nicht auf die Live-Welten gekommen sind.[BR][BR]Bekannt sind auch nur die Aufgaben 9 und 40, bei denen es zur Änderung der Aufgabenstellung im Laufe des Beta-Events kam. Die angeblich dritte geänderte Aufgabe wird dann im Pool der episodischen Aufgaben sein und somit wird gar nicht erkenntlich sein, welche Aufgabe es gewesen sein könnte.[BR][BR]Sind die Verantwortlichen von INNO unfähig nach eindrücklicher Kritik auf Beta die durchgeführte Änderungen, die auf Beta stattgefunden haben auf die Live-Welten zu übertragen?[BR][BR]Selbst der bekannte Fehler, dass EWs in der Stadt vorzufinden aber nicht einsammelbar waren (Beta), ist auf die Live-Welten gekommen![BR][BR]Mich persönlich stört es nicht wirklich, da ich es von INNO nicht anders gewohnt bin und unabhängig davon bereits mit den aktuellen Aufgaben fertig bin.[BR][BR]Trotzdem ist es für mich ein Armutszeugnis seitens INNO!"}, {"208": "Mal im Ernst! Der Ladebildschirm ist echt super schön. Kann man die Grafischen Assets irgendwo runterladen als Desktop Hintergrund? Danke für denn Hinweis. Echt schön!"}, {"120": "Positiv: Der Newsletter war pünktlich da.[BR]Ansonsten......es mag ja an meiner geänderten Einstellung zu diesem Spiel und seinen Machern liegen, aber für das, was dieses Event bietet, sind die Forderungen schon fast unverschämt."}, {"9": "Thuncal schrieb:\t\t\tMal im Ernst! Der Ladebildschirm ist echt super schön. Kann man die Grafischen Assets irgendwo runterladen als Desktop Hintergrund? Danke für denn Hinweis. Echt schön!\t\tZum Vergrößern anklicken....Wallpaper"}, {"139": "Sauer bin. Fast 2.000 Schlüssel und keinen (!) Tagespreis? Unendliche Münzen- und Vorratsregen, was allein als Eventpreis eine Enttäuschung ist. Ich spiele, um Spaß und kleine Erfolgserlebnisse zu haben und zwar je mehr, desto besser. Jetzt ärgere ich mich über einen/eine Entwickler, der/die sein Werk nicht beherrscht und mir meinen Spaß verdorben hat. Wenn das mit dem Ziel gemacht wurde, zum Erwerb von Diamanten zu animieren, dann ist das kein schlechter Gedanke. Allerdings sollte man doch einen vernünftiger Maß setzen.  [BR]Ich glaube, das wars dann für mich mit dem Event. Und es dauert noch ewig und lässt sich nicht abstellen ..."}, {"111": "Ok, selbst mit richtig pech sollten doch wenigstens ein paar preise drinnen sein. Auch wenn man dafür die \"falschen\" kisten nimmt, bekommt man immer ein paar ab. [BR][BR]Was das Event angeht, das find ich auch nur so mau. Der Questgeber ist der selbe wie seit Jahren, Die Tagespreise sind bis auf den ersten mau. Ich suche gute Kulturgebäude und die sind dieses mal auch nur so mittelschlecht. Die \"Zwischenpreise\", die man neben den Artefakten erhält sind mal wieder das selbe alte Zeugs."}, {"24": "Ich bin immer fasziniert wie ich der EW nachjage und keine gewinne [smilie--sprite8] Aber ich seh das mittlerweile locker, ist ja nicht so als bräuchte ich die neuen Avatare..."}, {"74": "Gibt es wo ne Tabelle mit Auflistung welche Truhe am besten ist für möglichst viele Schritte für Hauptpreis?"}, {"153": "Clarissa Pramheda schrieb:\t\t\tGibt es wo ne Tabelle mit Auflistung welche Truhe am besten ist für möglichst viele Schritte für Hauptpreis?\t\tZum Vergrößern anklicken....Ja, hier:[BR]\t\t\thttps://idavis-elvenar.com/events.html#spheres-theater_zodiac_xxiii_\t\tIn der Auswahl wo \"Default\" steht die Option \"Best Chests for Grand Prices\" auswählen."}, {"145": "Optisch gefällt mir das Evo wirklich gut, also werde ich es aufstellen. Ob ich den Füttereffekt brauche, weiß ich noch nicht... vielleicht in Events für \"erzeuge x Kombis\"-Aufgaben. Mangel an Kombis herrscht bei mir echt nicht.[BR][BR]Aufgaben: bisher machbar, aber ich bin auch noch nichgt sehr weit. 20 WP auf einen Rusch kaufen zu müssen ist allerdings schon heftig.[BR]Bei den Tagespreisen ist genau einer, den ich gern kriegen würde, und auch den wieder eher aus optischen Gründen.[BR][BR]Der Ladebildschirm ist wirklich toll.[BR][BR]Also: optisch ein schönes Event, von den Preisen her find ich gab es schon bessere."}, {"206": "Emma von Emstal schrieb:\t\t\tSauer bin. Fast 2.000 Schlüssel und keinen (!) Tagespreis?\t\tZum Vergrößern anklicken....[BR]Wald-Hexe schrieb:\t\t\tDieses Spiel hat mich inzwischen arg zur Bescheidenheit erzogen ...[BR]denn viel zu oft wurde ich von diesem UN-Glücks-Generator frustriert. [smilie--sprite5][BR][BR]Diesmal hab' ich nur drei zwei Tagespreise ausgeguckt. Bin mal gespannt,[BR]was davon klappt ... oder ich nur einmal mehr enttäuscht werde. [smilie--sprite10]Zum Vergrößern anklicken....[BR]Bin auch gespannt, ob ich die (nur!) zwei Tagespreise bekomme, die ich mir ausgeguckt habe.[BR]Was diesen (so genannten!) \"Zufalls-Generator\" angeht ... da habe ich inzwischen arge Zweifel,[BR]ob da alles mit rechten Dingen zugeht. [BR]Mich hat dieses blöde UN-Glücks-Teil schon sooo oft verarscht ... [smilie--sprite4][BR]Tja ... viel Hoffnung auf eine positive Veränderung habe ich nicht mehr - leider! Sorry, ist so. [smilie--sprite5]"}, {"28": "Wald-Hexe schrieb:\t\t\tWas diesen (so genannten!) \"Zufalls-Generator\" angeht ... da habe ich inzwischen arge Zweifel,[BR]ob da alles mit rechten Dingen zugeht\t\tZum Vergrößern anklicken....Ich auch! [smilie--sprite2][BR][BR]Mein Feedback nach gespieltem Event auf Beta:[BR]Erstmals seit ich Elvenar spiele, wollte ich mal das Portrait erspielen und habe es trotz Einsatz von 1700 Diamanten knapp nicht geschafft.[BR]Das hat mir gezeigt, dass ich in Zukunft wieder dazu übergehen werde die Ligen inklusive der enthaltenen Preise einfach grundsätzlich nicht mehr zu beachten.[BR][BR]Mit dem Event an sich war ich aber sehr zufrieden.[BR]Immerhin ist mein Beta-Tinlug schon auf Stadium 10 und für einen weiteren Beta-Baby-Tinlug hat es auch noch gereicht.[BR]Das Portrait wäre mir zwar lieber gewesen aber auch das Elvenar-Event-Leben ist nun mal kein Wunschkonzert. [smilie--sprite1]"}, {"212": "Das Event gefällt mir bisher sehr gut, die Sternzeichen gehören zu meinen Lieblingsevents. Der Ladebildschirm ist besonders gelungen, Kompliment an die Grafiker."}, {"35": "Thebigunknown schrieb:\t\t\tErstmals seit ich Elvenar spiele, wollte ich mal das Portrait erspielen und habe es trotz Einsatz von 1700 Diamanten knapp nicht geschafft.[BR]...[BR]Immerhin ist mein Beta-Tinlug schon auf Stadium 10 und für einen weiteren Beta-Baby-Tinlug hat es auch noch gereicht.[BR]Das Portrait wäre mir zwar lieber gewesen aber auch das Elvenar-Event-Leben ist nun mal kein Wunschkonzert. [smilie--sprite1]Zum Vergrößern anklicken....Das Portrait ist bei 280 und damit doch VOR der 2. Grundplatte (300). War das auf Beta anders?[BR][IMG]https://i.ibb.co/vXb6bvh/https-de-forum-elvenar-com-index-php-attachments-1693426696634-png-38761.png[/IMG]"}]