[{"30": "Bin mir echt nicht sicher, aber ich habe jetzt x-Mal gezählt und geschaut: kann es sein, das es diesmal mit \"normalem\" Durchlauf bis zum Porträt nur 8 Artefakte gibt`? Also ohne GA, Dias, Turm (wann auch immer die Tinlug Artefakte kommen) nur eine minimale bis gar keine Chance 9 Artefakte in diesem Event zu erreichen? Falls ich falsch liege, könnt ihr gerne korrigieren.[BR]Bisher bin ich immer irgendwie mit Hängen und Würgen auch ohne Dias auf die 9 Artefakte gekommen und daher bin ich diesmal etwas irritiert.[BR]Ich finde es ok, das die Quests mal wieder variiren und nicht beinahe 1:1 aus anderen Events übernommen wurden. Das nun wieder die massiven WP Käufe auftauchen find ich ebenso wie einige hier nicht gut. [BR]Bei den Tagespreisen ist für Spieler, die schon lange dabei sind nicht viel neues dabei, daher eher nicht so toll. Ich freue mich eigentlich immer auf neue Gebäude und nicht auf bereits vorhandene. Auch wenn die Werte jetzt besser sein mögen, als die, die ich stehen habe oder im Inventar lagern. [BR]Das ist aber auch Ansichtssache, neue Spieler haben diese Gebäude nicht und möchten das eine oder andere auch gerne haben und finden es toll, wenn diese wieder auftauchen. Für mich sind sie leider keinerlei Anreiz.[BR]Ich habe, wenn möglich, jetzt immer die \"24er Kugel\" genommen, in der Hoffnung auf Orks, die ich gerade in Massen benötige. Der Tagespreis war mir tatsächlich völlig egal und habe ihn dennoch an beiden Tagen bekommen und mit der Tauschoption schon weitere abgehakt. [BR]Wie immer finde ich die Quests nach Erreichen der Tagesquests innerhalb eines Tages immer machbar - die Anforderungen sind je nach eigener Spielweise manchmal lästig, manchmal völlig schnell erledigt. [BR]Im Grossen und Ganzen bietet das Event nicht viel Neues und Aufregendes, zumindest nicht für langjährige Spieler.[BR]Ich vermisse die schönen \"langen\" Storys zu den Events (bei denen man gerne mitgelesen hatte), abwechslungsreichere Quests und ausser dem Hauptpreis neue Gebäude. [BR]Die Grafiker bekommen von mir (eigentlich immer [smilie--sprite1] ) in jedem Fall ein ganz dickes Lob!!"}, {"28": "hobbitrose schrieb:\t\t\tDas Portrait ist bei 280 und damit doch VOR der 2. Grundplatte (300). War das auf Beta anders?\t\tZum Vergrößern anklicken....Ich meinte nicht das Portrait für die Ladys, dass es ab 280 gab und auf live jetzt auch gibt, sondern das Tinlug-Portrait, sorry da hatte ich mich nicht klar genug ausgedrückt. [smilie--sprite2][BR][BR]Das Tinlug-Portrait gibt es nur wenn man die Gold-Liga schafft.[BR][IMG]https://i.ibb.co/cFd5HSh/https-de-forum-elvenar-com-index-php-attachments-1693427458977-png-38762.png[/IMG]"}, {"126": "Marloy schrieb:\t\t\tBin mir echt nicht sicher, aber ich habe jetzt x-Mal gezählt und geschaut: kann es sein, das es diesmal mit \"normalem\" Durchlauf bis zum Porträt nur 8 Artefakte gibt`? Also ohne GA, Dias, Turm (wann auch immer die Tinlug Artefakte kommen) nur eine minimale bis gar keine Chance 9 Artefakte in diesem Event zu erreichen? Falls ich falsch liege, könnt ihr gerne korrigieren.[BR]Bisher bin ich immer irgendwie mit Hängen und Würgen auch ohne Dias auf die 9 Artefakte gekommen und daher bin ich diesmal etwas irritiert.[BR]Ich finde es ok, das die Quests mal wieder variiren und nicht beinahe 1:1 aus anderen Events übernommen wurden. Das nun wieder die massiven WP Käufe auftauchen find ich ebenso wie einige hier nicht gut.[BR]Bei den Tagespreisen ist für Spieler, die schon lange dabei sind nicht viel neues dabei, daher eher nicht so toll. Ich freue mich eigentlich immer auf neue Gebäude und nicht auf bereits vorhandene. Auch wenn die Werte jetzt besser sein mögen, als die, die ich stehen habe oder im Inventar lagern.[BR]Das ist aber auch Ansichtssache, neue Spieler haben diese Gebäude nicht und möchten das eine oder andere auch gerne haben und finden es toll, wenn diese wieder auftauchen. Für mich sind sie leider keinerlei Anreiz.[BR]Ich habe, wenn möglich, jetzt immer die \"24er Kugel\" genommen, in der Hoffnung auf Orks, die ich gerade in Massen benötige. Der Tagespreis war mir tatsächlich völlig egal und habe ihn dennoch an beiden Tagen bekommen und mit der Tauschoption schon weitere abgehakt.[BR]Wie immer finde ich die Quests nach Erreichen der Tagesquests innerhalb eines Tages immer machbar - die Anforderungen sind je nach eigener Spielweise manchmal lästig, manchmal völlig schnell erledigt.[BR]Im Grossen und Ganzen bietet das Event nicht viel Neues und Aufregendes, zumindest nicht für langjährige Spieler.[BR]Ich vermisse die schönen \"langen\" Storys zu den Events (bei denen man gerne mitgelesen hatte), abwechslungsreichere Quests und ausser dem Hauptpreis neue Gebäude.[BR]Die Grafiker bekommen von mir (eigentlich immer [smilie--sprite1] ) in jedem Fall ein ganz dickes Lob!!\t\tZum Vergrößern anklicken....[BR]Also ich hab in meinen beiden Beta-Städten mit 275 und 260 Punkten jeweils 9 Artefakte (die 2 von den Quests mitgerechnet) und somit das Evo auf Stufe 10. Alles wie immer."}, {"30": "Souliena schrieb:\t\t\tAlso ich hab in meinen beiden Beta-Städten mit 275 und 260 Punkten jeweils 9 Artefakte (die 2 von den Quests mitgerechnet) und somit das Evo auf Stufe 10. Alles wie immer.\t\tZum Vergrößern anklicken.... Depp ich... [smilie--sprite1] Jap, passt, habe das letzte Artefakt in der Questline nicht mitgezählt. Danke!!"}, {"135": "littleFlex schrieb:\t\t\tNein, Inno erstellt keine Evolutionsgebäude für Events, weil es Geld braucht.\t\tZum Vergrößern anklicken....Jeder einzige Pixel hat die Funktion, Geld zu verdienen. Inno ist ja kein Wohlfahrtsverein."}, {"113": "Vorneweg, ich spoiler mich nicht in Bezug auf die Quests, ich weiß also nicht, was mich an der nächsten Ecke erwartet, alles andere wäre mir zu langweilig.[BR]Also habe ich alle Manufakturen abgegrast für die Quest \"Sammel eine ordentliche Menge Güter ...\" und als nächstes kommt \"Produziere Güter deiner Wahl in 9 Stunden\". Ha! ich liebe das. Da hat sich jemand Gedanken gemacht, um mir das Ereignis ereignisreicher und das Spiel spannender zu machen. Freu [smilie--sprite8]"}, {"3": "Sumpf-Roeschen schrieb:\t\t\tWarum hat eine Sternenschlange einen Gemüse in der Hand?[BR]Eine vegetarische chinesische Drachenschlange? Brr[BR]Das paßt doch nicht.\t\tZum Vergrößern anklicken....Vielleicht will er uns ja das Gemüse schenken, weil er selbst es nicht mag."}, {"61": "Würde mir mal Zeitbooster als Tagespreis wünschen wollen beim nächsten Event."}, {"100": "[IMG]https://i.ibb.co/Pw4z1Vc/https-de-forum-elvenar-com-index-php-attachments-1693580530480-png-38798.png[/IMG][BR]Sollte das nicht   \"  Produziere reguläre Güter deiner Wahl mit der Option für   9 Stunden \" heissen . [BR]Ich löse diese aufgaben mit Harz und Urwelt- Mineralien . [BR]Tinte und  Pilze funktionieren nicht"}, {"113": "schwatzwurzel schrieb:Anhang 38798 ansehen[BR]Sollte das nicht   \"  Produziere reguläre Güter deiner Wahl mit der Option für   9 Stunden \" heissen .[BR]Ich löse diese aufgaben mit Harz und Urwelt- Mineralien .[BR]Tinte und  Pilze funktionieren nicht\t\tZum Vergrößern anklicken....Sollte es (ich habe das sogar schon mal angemerkt [smilie--sprite2]), aber der Begriff Basisgüter hält sich hartnäckig. [BR]Der taucht auch nur in den Eventaufgaben auf und ein Mal im Wiki, im restlichen Spiel habe ich ihn noch nicht bemerkt. [BR]Hat, meine ich zu erinnern, irgendwas mit der Übersetzung zu tun."}, {"100": "lovelymonster schrieb:\t\t\tHat, meine ich zu erinnern, irgendwas mit der Übersetzung zu tun.\t\tZum Vergrößern anklicken....Der fehlenden  oder fehlerhaften Überstzung  . Das denk ich auch  .[BR]Wenn der Übersetzer das Spiel nicht kennt ,  oder nicht gut kennt , passiert dies .[BR][BR]Das es sich aber Jahre  hält , ist das   Dumme ."}, {"9": "schwatzwurzel schrieb:[IMG]https://i.ibb.co/Pw4z1Vc/https-de-forum-elvenar-com-index-php-attachments-1693580530480-png-38798.png[/IMG][BR]Sollte das nicht \" Produziere reguläre Güter deiner Wahl mit der Option für 9 Stunden \" heissen .[BR]Ich löse diese aufgaben mit Harz und Urwelt- Mineralien .[BR]Tinte und Pilze funktionieren nicht\t\tZum Vergrößern anklicken....[IMG]https://i.ibb.co/1qVcRWn/https-de-forum-elvenar-com-index-php-attachments-1693587418579-png-38799.png[/IMG][BR]Nein die Aufgabe ist unverändert wie am Beta.[BR]Es gibt auch Aufgaben, da ist es egal welche Güter, also deiner Wahl, aber eben auch spezifisch geforderte.[BR][BR]Da du die Aufgabe auch schon gelöst hast ist der Informations-Button (i), so wie er unten bei der Aufgabe, \"verwende 3 Segen\" ist, weg.[BR]Wenn du auf dieses (i) gehst, bevor du solch eine Aufgabe löst, steht es da auch ausführlich in deutsch da, was verlangt wird.[BR][BR][IMG]https://i.ibb.co/0qMqdyw/https-de-forum-elvenar-com-index-php-attachments-1693588088598-png-38800.png[/IMG]"}, {"113": "AngelOfDead schrieb:[IMG]https://i.ibb.co/0qMqdyw/https-de-forum-elvenar-com-index-php-attachments-1693588088598-png-38800.png[/IMG]Zum Vergrößern anklicken....Es geht einzig um den Begriff \"Basis...\", den gibt es im normalen Spiel nicht.[BR][BR]Am PC heißen die Güter \"regulär\" (Standard, Erweckt, Erleuchtet,?)[BR][BR][BR][BR]am Handy \"normal\"[BR][BR](Da ist mir ein screenshot jetzt zu kompliziert)"}, {"100": "[IMG]https://i.ibb.co/wKNNwBD/https-de-forum-elvenar-com-index-php-attachments-1693602131583-png-38804.png[/IMG][BR]Auch unter der Information für  i  , steht  Basisgüter .  Auch dort müsste regulär stehen .[BR][BR]Die Fragen könnten ordentlich gestellt werden ,  dann bräuchte man auch keine infos dazu ."}, {"113": "Die Sphären, sortiert nach Anzahl Schlüssel für 1xSternenstaub[BR]21/42[BR]70 (23,4)[BR]24[BR]53(26,5)[BR]28[BR]115(28,75)[BR]90(30)[BR]64(32)"}, {"111": "Hier wird das detaillierter aufgeschlüsselt. https://idavis-elvenar.com/events.html#spheres-theater_zodiac_xxiii_[BR]einfach einstellen, was man haben möchte: [IMG]https://i.ibb.co/b6XZkTR/https-de-forum-elvenar-com-index-php-attachments-1693619640128-png-38806.png[/IMG]"}, {"167": "Aber die Reihenfolge bei idavis ist für die Hauptpreise nicht so ganz richtig - wenn man unterstellt, das der Hauptpreis ist, möglichst viel Sternenstaub für einen Schlüssel zu bekommen. Folgt man denen blind, dann macht man Verluste.[BR]Ich mache es genauso, wie @lovelymonster."}, {"153": "Falbala Di schrieb:\t\t\tAber die Reihenfolge bei idavis ist für die Hauptpreise nicht so ganz richtig - wenn man unterstellt, das der Hauptpreis ist, möglichst viel Sternenstaub für einen Schlüssel zu bekommen. Folgt man denen blind, dann macht man Verluste.[BR]Ich mache es genauso, wie @lovelymonster.\t\tZum Vergrößern anklicken....Die Wahrscheinlichkeiten für einen Schlüsselgewinn werden wohl bei idavis mitberücksichtigt. Ich bin damit bisher gut vorwärts gekommen."}, {"113": "CMDWS schrieb:\t\t\tHier wird das detaillierter aufgeschlüsselt. https://idavis-elvenar.com/events.html#spheres-theater_zodiac_xxiii_[BR]einfach einstellen, was man haben möchte: Anhang 38806 ansehenZum Vergrößern anklicken....Ich komme damit nicht wirklich klar, mir ist aber auch nur wichtig, möglichst viel Sternenstaub für möglichst wenig Schlüssel zu bekommen. Das kann ich mir selbst ausrechnen.[BR]Und dann nur spielen, wenn es einen für mich attraktiven Tagespreis gibt. [BR]Mir sind die ganzen Wahrscheinlichkeiten egal, die kann ich eh nicht beeinflussen.[BR]Mir ist es das Wichtigste, die 260 Punkte zu bekommen und das erreiche ich inzwischen (ca seit Kapitel 10) nahezu immer."}, {"14": "ich spiele nach:[BR]hohe Schlüsselwahrscheinlichkeit[BR][BR]ich nehme z.B. die Sphären gar nicht, die gar keine Schlüssel geben[BR][BR]so macht es wohl jeder anders [smilie--sprite1]"}]