[{"113": "Neris schrieb:\t\t\tso macht es wohl jeder anders [smilie--sprite1]Zum Vergrößern anklicken....Genau[BR]Ist das nicht schön?[BR][BR]Vielfalt ist was Feines."}, {"213": "Immer mehr WP kaufen was soll der Mist.[BR]Keine Tauschoption gegen Bärenartefakte.[BR]Hatte mich auf das Event gefreut, danke INNO für die nächste A....karte[BR]Bitte noch mehr an der Kundenunzufriedenheit arbeiten, denn unzufriedene Kunden zahlen nicht mehr!"}, {"35": "Ich bin am Anfang Kapitel 19. Am ersten Tag habe ich den Herbstteich ergattern können. Auf den letzten Drücker hat es endlich geklappt.[BR]Später noch einen unergründlichen See und an einem dritten Tag nach Hauptpreistausch noch einen Teich. Passend zum Manamangel einen Spiegel des Kosmos. Alles schon hingestellt.[BR]Ich bin schon jetzt zufrieden mit den Preisen.[BR][BR]Ob ich Tinlug auf 10 bekomme? Vermutlich nicht. Mal sehen, ob ich ihn dann stelle.[BR]Ich rechne damit, dass ich auf lange Sicht alle 10 Artefakte bekomme. Bei den Bären hatte es (nach ca. 2 Jahren) auch geklappt.[BR][BR]Die Quests sind für mich bislang gut zu schaffen. Und das ohne Spoiler. Ich sehe das ganz entspannt. Ich muss nicht an einem Tag bei den Tagesaufgaben sein. Im Moment bin ich bei Quest 52 und habe für die restlichen 21 noch 17 Tage Zeit. Das wird klappen, denke ich.[BR][BR]20 WP kaufen schreckt mich nicht. Notfalls nutze ich einen Münzsegen oder kaufe den Rest gegen Güter. Ich kaufe WP ohnehin nur in Events und das landet dann in einem Wunder. Eine 9h-Produktion zur \"Unzeit\" bremst mich eher aus, aber auch das ist ok für mich."}, {"6": "hobbitrose schrieb:\t\t\tIch bin schon jetzt zufrieden mit den Preisen.\t\tZum Vergrößern anklicken....Stimme da voll und ganz zu. Jeder Gewinn hat seinen Wert. Gemeckert wird hier und an anderen Stellen ohnehin meist nur über das eigene Unvermögen.  [smilie--sprite2]"}, {"213": "ustoni schrieb:\t\t\tStimme da voll und ganz zu. Jeder Gewinn hat seinen Wert. Gemeckert wird hier und an anderen Stellen ohnehin meist nur über das eigene Unvermögen.  [smilie--sprite2]Zum Vergrößern anklicken....Dann wollen wir mal nicht hoffen, daß in 5 Jahren 100-200 WP verlangt werden [smilie--sprite1] Wegen dem Unvermögen beizeiten zu kritisieren."}, {"144": "Xxxx"}, {"117": "Das Evo gefällt mir gut! [BR]was mir nicht gefällt ist das alte Leiden ..es muß wieder gefüttert werden ..bei mir stehen überall nur ausgewählte einzelne Gebäude der Phönixe und Bären  weil ich nie genug Futter für Alle hätte und deshalb genau überlege was mir wichtig ist ...[BR]vom Platzproblem ganz zu schweigen ..[BR]da ich kein Effizienzspieler bin fällt es mir immer sehr schwer die wunderschönen (älteren) Gebäude auszutauschen um Platz für neue zu schaffen"}, {"134": "mein Feedback nach 56 Aufgaben lösen: \"nichts worüber man reden müsste\""}, {"214": "Hallo zusammen,[BR]ich bin noch relativ neu in \"Elvenar\" unterwegs (erst ca. 6 Monate) und bisher finde ich das Spiel sehr gelungen und sehr schön gestaltet.[BR]Auch die bisherigen Events haben  mir gut gefallen, was ich aber von dem jetzigen nicht mehr so \"sagen\" kann:[BR][BR]Trotz der Einlage/Ausgabe von 200 - 350 Schlüsseln/Tag sind Tagespreise so gut wie gar nicht zu bekommen (das lief in den vorherigen Events wesentlich besser): bisher nur zu Beginn den herbstlichen Teich bekommen (und noch das Tinlug-Areal).[BR][BR]Ein paar Tage Pause gemacht beim Schlüssel-ausgeben und heute wieder 350 Schlüssel investiert (davon 150 geschenkt bekommen) und wieder keinen Tagespreis erhalten,... macht ehrlich gesagt, keinen Spaß auf diese Weise.[BR][BR]Zudem finde ich es sehr ärgerlich, wenn als Questaufgabe kommt: kaufe 20 Wissenspunkte (das möchte ich gar nicht) und abbrechen kann man die Aufgabe dann leider auch nicht.[BR]Seitdem stagniert die Questreihe bei mir,... schade drum. [smilie--sprite3] [BR][BR]Das wollte ich einfach nur als Feedback abgeben,... danke für's lesen.[BR](und danke an die Helferlein, die mir den \"Eintritt\" ins Forum ermöglicht haben,... das war ja nicht so einfach [smilie--sprite1] )"}, {"176": "Wieselflink schrieb:\t\t\tZudem finde ich es sehr ärgerlich, wenn als Questaufgabe kommt: kaufe 20 Wissenspunkte (das möchte ich gar nicht) und abbrechen kann man die Aufgabe dann leider auch nicht.[BR]Seitdem stagniert die Questreihe bei mir,... schade drum.\t\tZum Vergrößern anklicken....kann mich dem auch anschließen - bin zwar schon einige Zeit länger im Spiel und habe in den Events diese Aufgaben schon öfter mitgemacht, aber dieses Mal wird hier einfach zuviel verlangt. Das steigert sich ja noch - hatte gerade eine Aufgabe mit 27 WPs kaufen und auch wieder ohne Alternative. Meine Münzen und einige Güter sind dafür ganz schön drauf gegangen.[BR][BR]Bei nächsten Event wird bei mir die Questreihe wohl auch an der erst besten solcher Aufgaben stagnieren."}, {"205": "loselfe schrieb:\t\t\tAufgabe mit 27 WPs kaufen und auch wieder ohne Alternative\t\tZum Vergrößern anklicken....Da bin ich auch ganz deiner Meinung, dass das übergrenzwertig fragwürdig ist. Ansonsten bin ich mit dem Eventverlauf ganz zufrieden."}, {"156": "Diese Quest \"Kaufe 27 WP\" fand ich auch ziemlich heftig."}, {"157": "Grundsätzlich bin ich mit dem Event bisher auch zufrieden. Das Gebäude gefällt mir und ich habe es auch schon aufgestellt.[BR][BR]Die Tagespreise sind bisher eher nichts für mich. Krebse noch in der Eisenliga rum, weil ich bisher nur auf die paar Truppen-Segen gegangen bin. Mal sehen, was noch kommen wird...[BR]Ich spiele erstmals mit dem Gedanken, die königlichen Preise freizuschalten. Das dortige Porträt für 280 Punkte hätte ich schon gerne und die Preise bis dahin find ich auch interessanter als sonst. Wenn ich hochrechne, wie viel EW ich noch einsammeln werde, dann werden es wohl bei weitem keine 280 werden, selbst wenn ich die Schlüssel aus den KP dazurechne :/ Entscheide ich wohl kurzfristig. Extra-Dias werde ich auf jeden Fall nicht spenden[BR][BR]Was mir gar nicht gefallen hat, sind die vielen Kaufe-WP-Aufgaben."}, {"147": "Der Tinlug erfüllt seinen Zweck, das ist schon einmal gut! Schön? Na ja.. [BR][BR]Ansonsten im Westen nichts Neues. Ich kann aber jeden verstehen, der auf Tagespreise spielt und sich ärgert. Die fallen auch bei mir seltenst, es sei denn, es handelt sich um Runen oder AW^^ [BR][BR]Die Anforderungen an WP Kauf gegen Gold finde ich zwar nicht unlösbar aber doch extrem hoch. Ist ja nicht so, dass man das viele Gold nicht für weitaus nützlichere Dinge ausgeben könnte^^ [BR][BR]Zumal Gold mein nächstes Nadelör zu werden droht? 5 Käufe im Turnier und das Millionen Lager ist schon wieder leer gelaufen?"}, {"104": "Wofür kann man sonst Gold ausgeben? Ausbauten + Forschungen + Erkundungen können warten.[BR]Teure Verhandlungen vielleicht. Aber Event da immer 100x lukrativer. Notfalls ne ganze Woche gar kein Turm/ Turnier, Gilde hätte sicherlich Verständnis.[BR]Güter für Münzen kaufen, ob mit oder ohne Händlergilde, ist der Drain für überschüssiges am Ende.[BR][BR]Kaufpreis vs. Lager/ tägliche Einnahmen gilt natürlich zu beachten, nie außerhalb Events kaufen. Wenn aktuell teuer, dann zumindest zurückhalten, paar Kapitel weiter sollte es besser aussehen, falls da nicht ewig gebraucht.[BR]Münzzauber wo zu sehen, teils im Event zu gewinnen, immer sparen, 10.000% Münzsegen = 100x Lager voll als Reserve, besser. [smilie--sprite2][BR][BR]Sparen und dann Einsatz in Events steht immer an erster Stelle. Überstrahlt alles andere im Spiel zusammen mehrfach. Paar hohe Event-Gebäude aufzustellen geschafft, und täglich umsonst einzusammeln was sonst im Turnier mühsam und teuer zu erkämpfen/ erhandeln."}, {"147": "ForgeS44 schrieb:\t\t\tNotfalls ne ganze Woche gar kein Turm/ Turnier\t\tZum Vergrößern anklicken....[BR]Das ist sicherlich abhängig von der Spielstrategie .. eine Woche kein Turm/Turnier kann sich mein großer Account gar nicht leisten.. die 10 mag. Werkis haben nicht genug Verzauberungen, die Kultur Gebäude und damit der Vorrats- sowie Münzertrag laufen mit einem Bruchteil der Power, die Kombis sind alle, die Truppenproduktion stockt .. und und und.. ^^[BR][BR]Welches Eventgebäude sollte denn da mithalten können?? Bei den i.d.R. läppischen 6k pro Tag an Gütern? Eine Runde hummeln bringt mir aktuell rd. 240k T1-T2 .. das alle 3h!"}, {"14": "ich kann auch auf jeden Fall kein Turnier auslassen = ich habe sonst zu wenig Segen, den Rest nimmt man auch gerne mit (sind ja massig WP und Runen, auf die Relikte wäre ich nicht jedes Turnier angewiesen)[BR]den Turm kann man eher lassen, mir persönlich fehlen dann aber Zeitbooster für die Truppen[BR][BR]wenn meine Stadt also richtig rund laufen soll, brauche ich 'nen Gold-Turm und um die 12 k im Turnier (davon in der ersten Runde alle Provinzen, die ich habe): erst jetzt in Kapitel 15 fange ich mal an ein paar verzauberte Vorräte anzusparen (hab momentan 40 und die sind in 5 Tagen aufgebraucht)[BR]um die Münzen für die Event-WP zu haben, muss ich persönlich nichts auslassen[BR]aber die permanenten Forderungen dort sind schon happig, finde ich auch![BR]in meiner kleinen Beta-Stadt hatte ich selten genug Münzen und musste auch Güter dafür lassen, als das Event dort lief:[BR]schön ist was anderes!"}, {"100": "Ich bin auch kein uralter  . [BR]Kenne aber noch die Zeit ,  wo nur  1 Truppenproduktionsgebäude  produzieren konnte  . [BR]Man  konnte nur 5 Slots  in den Truppengebäuden belegen . [BR][BR]Heute sind es alle  15 slots  . [BR]Gleichzeitig können  Kaserne söldner und Trainigslager  produzieren . [BR]Eine verdreifachung  des Verbrauchs bei der Truppenproduktion . [BR][BR][IMG]https://i.ibb.co/4tcYpJL/https-de-forum-elvenar-com-index-php-attachments-1694691180203-png-39045.png[/IMG]Daher tun mir nur die Vorräte weh  . In dieser Stadt .[BR][IMG]https://i.ibb.co/8Nq0F7j/https-de-forum-elvenar-com-index-php-attachments-1694691340058-png-39046.png[/IMG]und ohne Konkurrenz der Hummel ,  werden solche Angebote gern angenommen.[BR]Bei den WP-Käufen nehm ich gern dir Güter . Das geht schnell  und noch billig."}, {"104": "monakuki schrieb:\t\t\tWelches Eventgebäude sollte denn da mithalten können?? Bei den i.d.R. läppischen 6k pro Tag an Gütern? Eine Runde hummeln bringt mir aktuell rd. 240k T1-T2 .. das alle 3h!\t\tZum Vergrößern anklicken....Ein gutes Eventgebäude bringt 3 WP am Tag, so auch das aktuelle, in der Woche 21 WP, ohne alle Kosten. Alles andere ist nur Beifang.[BR]Wofür Güter, abgesehen von endlichen Bedarf für die Kapitel, außer in Verhandlungen etwa wieder in paar WP umzuwandeln.[BR][BR]Für Mega-Super-Spieler ist der Tipp nicht, die haben aber hoffentlich auch keine Sorgen zu WP-Kauf. [smilie--sprite2][BR]Normalos in kleinen Kapiteln sollten nicht evtl. Turnier/ Turm paar Stationen weiter priorisieren, sondern Eventgebäude absolut bevorzugen.[BR]5 solcher Gebäude ersetzt kleines Turnier von 5 Provinzen komplett durchgespielt, für alle Zeit umsonst. 10 solcher Gebäude ersetzt.. Natürlich kann man immer noch Turnier oben drauf spielen, aber Hauptsache die Events. Eine Woche Turnier ja oder nein, kaum zu bemerken langfristig. Ein Event abgebrochen, 3 WP täglich für alle Zeit nicht zu haben. Na oder später dann Rest-Artefakte."}, {"61": "ForgeS44 schrieb:\t\t\tWofür kann man sonst Gold ausgeben? Ausbauten + Forschungen + Erkundungen können warten.[BR]Teure Verhandlungen vielleicht. Aber Event da immer 100x lukrativer. Notfalls ne ganze Woche gar kein Turm/ Turnier, Gilde hätte sicherlich Verständnis.[BR]Güter für Münzen kaufen, ob mit oder ohne Händlergilde, ist der Drain für überschüssiges am Ende.[BR][BR]Kaufpreis vs. Lager/ tägliche Einnahmen gilt natürlich zu beachten, nie außerhalb Events kaufen. Wenn aktuell teuer, dann zumindest zurückhalten, paar Kapitel weiter sollte es besser aussehen, falls da nicht ewig gebraucht.[BR]Münzzauber wo zu sehen, teils im Event zu gewinnen, immer sparen, 10.000% Münzsegen = 100x Lager voll als Reserve, besser. [smilie--sprite2][BR][BR]Sparen und dann Einsatz in Events steht immer an erster Stelle. Überstrahlt alles andere im Spiel zusammen mehrfach. Paar hohe Event-Gebäude aufzustellen geschafft, und täglich umsonst einzusammeln was sonst im Turnier mühsam und teuer zu erkämpfen/ erhandeln.\t\tZum Vergrößern anklicken....[BR]also zuerst mal wurde sich über \"Münzen ausgeben um Wissen zu kaufen\" beschwert und du fragst \"Wofür kann man sonst Gold ausgeben?\" ...[BR]... und nun schreibt ihr, wie nützlich die gekaufte Güter sind?[BR][BR]... dann noch eine Woche auf Turm/Turnier verzichten ??? weil die Eventaufgabe \"kaufe WP\" ja nicht auch mit Gütern erledigt werden kann und die Münzen auch an jeder Ecke im Spiel rumliegen?[BR][BR]... tägliche Einnahmen beachten aber nie außerhalb des Events kaufen ... warst gerade noch bei der Händlergilde ... ??? Was nicht kaufen? Münzen oder Güter? Und dann soll man lieber keine Münzen mehr einsammeln statt dafür Güter oder Wp zu kaufen, weil das Lager voll werden könnte? hört sich bisschen so an?[BR][BR]... sparen und dann Einsatz im Event ... Münzen zwischen zwei Events nicht mehr ausgeben? Auf täglich 200% bis 2000% Münzlagerkapazität verzichten und Münzen \"sparen\" die ich gar nicht über die Kapazität meines Lagers hinaus sparen kann?[BR][BR]... und wenn man dann das alles nicht macht und nur noch Eventaufgaben löst, sind die Events dann 100 x lukrativer als jede Woche über 500 Dias aus dem Turm und Blaupausen und Restaurierungszauber, Kombis und Fragmente für ein funktionierendes Handwerk, Relikte für eine funktionierende Güterproduktion und Magische Akademie, Runenscherben und -splitter für Antike Wunder, Wissen für Forschung und Altes Wissen für Ausbau von Wundern wird alles überstrahlt von Eventgebäuden, die du ohne Restaurierungszauber aus Turnieren auch gleich wieder abreißen kannst?[BR][BR]Also Sorry, ich hoffe, das glaubt niemand! Bitte nicht so spielen! Wenn ich in den 14 Tagen zwischen den Events keine Münzen ausgeben würde, wären das 140 Mio Güter Verlust."}]