[{"35": "Meine mag. Werkis sind mit VV dauerverzaubert. In letzter Zeit kaufe ich bestimmt 3-4x am Tag beim Händler gegen Vorräte. Der Kulturbonus läßt auch hier die Werte schön steigen, Hummel sei dank.[BR]Und 1-2x Vorratsregen verballern ist doch ok, wofür hat man das.[BR]Gilt natürlich nur für mich, andere können andere Balance haben."}, {"104": "ZeNSiErT schrieb:\t\t\tAlso Sorry, ich hoffe, das glaubt niemand! Bitte nicht so spielen! Wenn ich in den 14 Tagen zwischen den Events keine Münzen ausgeben würde, wären das 140 Mio Güter Verlust.\t\tZum Vergrößern anklicken....Was wohl sparen, die Münzsegen, welche ohne Verlust zu sparen sind um dann im Event komfortabel WP kaufen-Quests erledigen zu können, oder Münzen nicht ausgeben was nicht hilft? [smilie--sprite2][BR]Wenn man nur sucht, findet man in allem Konflikt, in der Tat..[BR][BR]Es ging eindeutig um Münzknappheit. Kann nur knapp sein wenn für anderes ausgegeben, aber alles andere ist weniger wichtig, besser für WP kaufen-Quest wenn dran."}, {"61": "ForgeS44 schrieb:\t\t\tWenn man nur sucht, findet man in allem Konflikt, in der Tat..\t\tZum Vergrößern anklicken....neee, steiten tun wir uns nicht mehr, dafür haben wir keine Zeit mehr [smilie--sprite1] [smilie--sprite1] [smilie--sprite1] [BR][BR]ich hatte noch Sarkasmus vermutet, aber Münzsegen kamen mir nicht in den Sinn [smilie--sprite1] [smilie--sprite1] [smilie--sprite1] [BR][BR]also Sorry, war mir bissel zu durcheinander und schwer zu verstehen, was du meinst, aber trotz dem nicht böse gemeint [smilie--sprite1]"}, {"215": "Mich ärgert das Kaufen von wissenspunkten beim Event unglaublich. Es ist nun schon das zweite Mal dass ich das Event nicht weiter Spiele da mir keine alternativmöglichkeit geboten wird außer diese wissenspunkte zu kaufen dann spiele ich eben nicht weiter, wenn denn alle Spieler mitmachen würden würden die Entwickler höchstwahrscheinlich auch mal ändern"}, {"35": "Wissenspunkte zu kaufen ist für mich so ziemlich die einfachste Quest in einem Event. Und das auf allen Welten, auf denen ich spiele.[BR]Allerdings habe ich auch immer Münzsegen (mehr als einen brauchte ich bislang nicht, pro Quest), nehme notfalls auch Ware und kaufe außerhalb der Events keine WP."}, {"100": "hobbitrose schrieb:\t\t\tWissenspunkte zu kaufen ist für mich so ziemlich die einfachste Quest in einem Event. Und das auf allen Welten, auf denen ich spiele.[BR]Allerdings habe ich auch immer Münzsegen (mehr als einen brauchte ich bislang nicht, pro Quest), nehme notfalls auch Ware und kaufe außerhalb der Events keine WP.\t\tZum Vergrößern anklicken....Es gibt immer questen die man nicht mag . [BR][BR]Für mich sind das billig gelöste Questen . [BR]Besser als  scoute Provinzen  oder löse Provinzbegegnungen  ."}, {"151": "Wissenspunkte kaufen ist ein Counter der nur eine Richtung kennt... irgendwann läuft man da vor eine Wand... Spieler die vorrausschauend planen finden es dooof ... und das ist absolut nachvollziebar und das dieses Event besonders exessiv damit umgegangen wird hat einen faden Beigeschmack, egal wie einfach es momentan für einzelne sein mag."}, {"216": "Guten Abend,[BR][BR]auf Beta ( in Kap 9 ) im neuen Event bin Ich seit heute Morgen bei den Tagesaufgaben. Bisher gab es u. A. 5 x alternativlos kaufe WP ( Gesamt 94 ) und 2 x kaufe 20 WP oder 5 x Hexenpunkte. Wohin die Richtung geht ist klar, langjährige Spieler dürften aber eigentlich nicht vor große Probleme gestellt werden. Wir wissen alle was in etwa kommt und können uns auch entsprechend vorbereiten wenn wir wollen. Für neue Spieler in den Kap. 1 - 5 sieht das natürlich anders aus.[BR][BR]MfG"}, {"14": "Noctem schrieb:\t\t\tWissenspunkte kaufen ist ein Counter der nur eine Richtung kennt... irgendwann läuft man da vor eine Wand... Spieler die vorrausschauend planen finden es dooof ... und das ist absolut nachvollziebar und das dieses Event besonders exessiv damit umgegangen wird hat einen faden Beigeschmack, egal wie einfach es momentan für einzelne sein mag.\t\tZum Vergrößern anklicken....man läuft aber nur gegen eine Wand, wenn man sein Hauptgebäude nicht weiter ausbaut (also nicht weiter forscht), sonst ist es so gut wie unmöglich diese Wand je zu erreichen [smilie--sprite1][BR][BR]aber ich finde es für kleinere Level auch nicht so doll: [BR]weil ich mit dem neuen Forschungsbaum bei Münzen Probleme hatte (und auch keine Münzsegen), waren die Aufgaben blöd"}, {"113": "Ha, heute war Schlüsselausgabe und zwar mit vollen Händen.[BR]Meine beiden Gemeinschaftsstädte sind sogar schon ettliche Schritte über die 260 Punkte, mal sehen, wie weit ich da noch komme.[BR]Meiner Solostadt fehlen noch 5, trotz Pass und Newsletter. Aber ich kriege mit heute ja noch 3 Questbelohnungen und den Loginbonus gibt's auch noch, das sollte reichen.[BR]In allen drei Städten habe ich fett Tagespreise bekommen.[BR][BR]Ich kann also sagen, ich bin sehr zufrieden.[BR][BR]Da ich zur Zeit im oberen Mittelfeld spiele, mache ich mir über die Aufgaben keine Gedanken, die arbeite ich genauso locker ab, wie die Aufgaben der Saison.[BR][BR]Optisch war, nein ist ja noch, das Event wieder ein Hingucker. [smilie--sprite8]"}, {"211": "lovelymonster schrieb:\t\t\tDie Sphären, sortiert nach Anzahl Schlüssel für 1xSternenstaub[BR]21/42[BR]70 (23,4)[BR]24[BR]53(26,5)[BR]28[BR]115(28,75)[BR]90(30)[BR]64(32)\t\tZum Vergrößern anklicken....bisschen pedantisch und auch spät, aber vielleicht fürs nächste Mal: 21 ist wahrscheinlichkeitstheoretisch deutlich schlechter als 42 und gehört nicht auf die gleiche Stufe ...[BR]42 (21)[BR]21[BR]70 (23,4)[BR]...[BR]wäre der präzisere Tipp gewesen.[BR][BR]Mal angenommen, ich verballer 1,5k Diamanten für eine Blaupause und Krams, also königliche Preise, würde ich auch 250 Schlüssel erhalten ... nehmen wir an, x Schlüssel habe ich eh noch übermorgen über ... hat irgendwer auf dem Schirm, wie viel Sternenstaub ich am wahrscheinlichsten mit 250+x Schlüsseln ergattern werde?"}, {"113": "Ranevle schrieb:\t\t\tbisschen pedantisch und auch spät, aber vielleicht fürs nächste Mal: 21 ist wahrscheinlichkeitstheoretisch deutlich schlechter als 42 und gehört nicht auf die gleiche Stufe ...[BR]42 (21)[BR]21[BR]70 (23,4)[BR]...[BR]wäre der präzisere Tipp gewesen.[BR][BR]Mal angenommen, ich verballer 1,5k Diamanten für eine Blaupause und Krams, also königliche Preise, würde ich auch 250 Schlüssel erhalten ... nehmen wir an, x Schlüssel habe ich eh noch übermorgen über ... hat irgendwer auf dem Schirm, wie viel Sternenstaub ich am wahrscheinlichsten mit 250+x Schlüsseln ergattern werde?\t\tZum Vergrößern anklicken....Nunja, ich schrieb in einem anderen Post, dass ich die Wahrscheinlichkeiten nicht berücksichtige, ich gehe nur nach den Kosten für einen Schritt und die sind nunmal bei beiden 21."}, {"211": "war so oder so nett von dir, wollte dich damit nicht vor den Kopf stoßen und hab den anderen Post wohl übersehen"}, {"113": "Ranevle schrieb:\t\t\twar so oder so nett von dir, wollte dich damit nicht vor den Kopf stoßen und hab den anderen Post wohl übersehen\t\tZum Vergrößern anklicken....Alles gut [smilie--sprite1][BR]Ich hab mich nicht gestoßen gefühlt"}, {"157": "Alles geschafft. Ausnahmsweise das 9. Artefakt bekommen und so mein Ziel erreicht. Für die Silberliga hat es trotzdem nicht gereicht.[BR]Hatte unheimlich viel Glück mit der Zusatzwährung. [BR]Habe mich dann doch gegen die königlichen Preise entschieden. Bleibe wohl auch prinzipiell dabei. Fast 10 Euro dafür auszugeben, bringt dann doch zu wenig Gegenwert.[BR][BR]Die Kaufe-WP-Aufgaben fand ich zu viel. Ich glaube, am Ende waren es bei mir 80-90 WP über das Event. Aktuell macht es mir zwar nichts aus, da ich alles im Überfluss habe, aber ich erinnere mich noch, wie schwierig die Aufgabe für mich in früheren Kapiteln war. Und so viele wurden noch nie in einem Event verlangt (glaube ich). Alle anderen Aufgaben waren wieder gut machbar. Konnte so auch mal wieder ein paar blaue Provinzen erledigen [smilie--sprite8][BR][BR]Warum habe ich alles im Überfluss? Weil ich mich durch das Spiel treiben lasse und kaum beschleunige. Nutze Segen sehr selten, Zeit-Booster auch kaum. Turm wird immer bis oben verhandelt, im Turnier werden 20-30 Provinzen gekämpft. Für mehr fehlt mir die Muße. Habe auch nur den einen Account. Das mag ich an dem Spiel. Es ist kurzweilig, aber frisst nicht so viel Zeit"}, {"135": "Masthor Sten schrieb:\t\t\tTurm wird immer bis oben verhandelt\t\tZum Vergrößern anklicken....[BR]Ab der 3. Etage sehe ich beim verhandeln kein Land mehr, bzw. die jeweils 4. Kiste pro Abschnitt würde 2 oder 3 x Dia Hilfe benötigen. [BR]Die Gütermenge ist dabei nicht das eigentliche Problem, nur bei so vielen Auswahlmöglichkeiten ist die Chance, ohne Dias durchzukommen gleich Null. Und wenn das für mindestens 4 Kisten gilt, zahlt man schon drauf."}, {"35": "Ich habe letzte Woche mal testweise den Turmzauberer für die letzte Ebene ausprobiert. Das kann ich nur empfehlen.[BR]\t\t\thttps://javascriptorian.com/spire-wizard/#\t\tAstralen Phoenix füttern, nach Vorschrift des Turmzauberers die Resis abgeben und abbrechen, wenn es beim 3. Versuch nicht klappt.[BR]Manchmal waren 3-4 Anläufe nötig pro Begegnung, aber es ging bis oben.[BR]Ich werde mal sehen, ob das öfter so geht.[BR]Bis Stufe 2 mache ich bislang mit meiner eigenen Strategie. Für Stufe 3 fand ich ihn im ersten ausprobieren ganz gut."}, {"135": "lol, der Turmzaubeer ist total falsch programmiert. Der schlägt fast nur Blödsinn vor. Bei 3 freien Feldern, auswählbare Resis Gold, Vorräte und Holz, wobei Holz bereits \"falsche Person anzeigt, Gold und Vorräte bereits in anderen Slots richtig liegen, soll ich Gold, Vorräte und Holz einsetzen (Versuch 2). Setzt man aber Gold und Vorräte ein, hat man danach 100% das Ergebniss statt bei 50/50 zu landen.[BR][BR]Ich kann es nicht gut beschreiben, auf jeden Fall lässt man, wenn man nicht alle Resis sicher richtig einsetzen kann, immer die Resi offen, die \"falsche Person\" anzeigt. Denn wenn am Schluss nur ein Slot übrig bleibt, aber man noch eine \"falsche Person Resi\" und 2 andere übrig hat...ist das Ergebniss eindeutig."}, {"61": "Total nutzloses Feedback für InnoGames, nur von einem einfachen Foren-User![BR][BR]War mal wieder ein richtig schönes Event. Habe sogar meine 2 Asche-Phöixe wieder aufgestellt und gefüttert. Aufgaben haben bis heute gereicht, auch ohne \"Tagesaufgaben\". Alle gewünschten Tagespreise bekommen. Habe mich sehr über den Hohlen Nussbaum von \"Eldrasils Erhebung\", der war damals 2017 einfach nicht zu kriegen ... aber habe damals zu den wenigen gehört, die alle 3 Hauptpreise gewinnen konnten [smilie--sprite1] Ich fand Eldrasils Erhebung war eines der schönsten Events in all den Jahren mit tollen Eventgebäuden. Freut mcih sehr, dass man die nun auf allen Servern sehen kann. [BR][BR]Die Schlüssel haben trotz 2 Asche-Phönixen nicht für 9 Artefakte gerecht. Fehlen aber nur noch 5 Schritte. [BR][BR]Früher, als wir noch wichtig waren, hätte man jetzt vielleicht ein paar Euros ausgegeben, um das letzte Artefakt noch zu bekommen, aber InnoGames möchte mein Geld nicht, dann behalte ich es eben. [BR][BR]Trotz dem tolles Event gewesen. "}, {"28": "ZeNSiErT schrieb:\t\t\tDie Schlüssel haben trotz 2 Asche-Phönixen nicht für 9 Artefakte gerecht. Fehlen aber nur noch 5 Schritte.\t\tZum Vergrößern anklicken....Dieses mal war mir selbst in meiner Erststadt mit Newsletter das \"Glück\" deutlich weniger hold.[BR]Bei mir hat es nicht mal für 8 Artefakte gereicht.[BR][BR]Stand nach Erledigung aller Quests und dem Einlösen der kompletten Eventwährung:[BR][BR][IMG]https://i.ibb.co/R6VxTN4/https-de-forum-elvenar-com-index-php-attachments-1695139541269-png-39122.png[/IMG][BR][BR]Zudem habe ich in dieser Stadt in diesen Event kein einziges Eventgebäude bekommen außer halt Tinlug natürlich.[BR][BR]Fazit: Wenn ich mein persönliches Ergebnis mit dem Ergebnis des letzten Events vergleiche, in dem ich es ohne Zukauf von Eventwährung erstmals sogar bis zum Portrait geschafft hatte, dann scheint mir der \"Glücksfaktor\" doch erheblich an Stellenwert zugenommen zu haben! [smilie--sprite2]"}]