[{"211": "Thebigunknown schrieb:\t\t\tFazit: Wenn ich mein persönliches Ergebnis mit dem Ergebnis des letzten Events vergleiche, in dem ich es ohne Zukauf von Eventwährung erstmals sogar bis zum Portrait geschafft hatte, dann scheint mir der \"Glücksfaktor\" doch erheblich an Stellenwert zugenommen zu haben! [smilie--sprite2]Zum Vergrößern anklicken....klingt eher nach: erheblich abgenommen ... oder alternativ hat der Pechfaktor bei dir erheblich an Stellenwert zugenommen.[BR]Bei mir war's das erste Event, bei dem ich Zukauf der königlichen Preise sinnvoll fand und damit an Tinlug Nr. 2 rankam ... ich glaube, das Ergattern eines zweiten Event-Hauptgebäudes durch Kauf königlicher Preise war für mich bislang noch fast nie mögich - und wenn, erschien es mir nicht hinreichend sinnvoll. Deine Abnahme des Glücksfaktors und meine Abnahme des Pechfaktors gleichen sich vermutlich halbwegs aus."}, {"110": "Also meine Kleine (Zauberer & Drachen) steht bei Quest 66 und mir fehlt noch 1 Pünktchen zum letzten Artefakt. Durch die Umstellung in der Verteilung der Relikte ist da eher Mangel und ich hab da momentan Kombiauslöserproduktionsstop. Aka auf Lv. 4, Lv. 5 brauch ich gar nicht erst nachzudenken. Insofern kann ich das Evo-Teil da ganz gut brauchen im Moment.[BR]Jedenfalls erschien es mir dieses Mal wesentlich leichter, die Artefakte zu erwirtschaften.[BR]Die Tagespreise ... na ja ... die wirklich guten Gebäude gibt's nur noch selten und oft nur noch am ersten Tag. Ist wohl der Preis für die Dauerbespassung. Bin da meistens eher auf die \"anderen\" \"Haupt\"preise gegangen.[BR]Der Beifang geht einigermaßen. Truppen sind immer schön, auch wenn's nur ein bißchen was ist und ein paar inzwischen für mich unheimlich wertvolle Münzsegen waren auch dabei. Das Evo ist für meine Großen nicht wirklich interessant, weil die genügend Rellikte für die Kombis haben und ich das Handwerk nicht bis zum Exzess betreibe."}, {"35": "Diesmal hatte ich öfter Zusatzwährung und mit der letzten Kugel gab es den letzten Stern fürs letzte Artefakt - Punktlandung in der Hauptwelt.[BR]Ein paar manaproduzierende Tagespreise stehen - Nußknacker, See, Herbstteiche, ich mag es pflanzlich.[BR]Tinlug wird benötigt für Kombis und steht auch schon, aber paßt farblich und optisch leider nicht so gut zu den anderen Bärchen. Schade.[BR]Alles in allem ein gelungenes Event.[BR][BR]Nur schade, dass die Discord-Überraschung am Eventende die Petersilie so verhagelt hat.[BR][BR]In der Nebenwelt kam ich nicht so weit wie in der Hauptwelt, aber da werde ich das Tierchen ohnehin nicht stellen."}, {"147": "Dieser Countdownzähler Event sieht mit der Umschaltung auf rote Schrift bei mir immer aus, wie Pixelfehler am Handymonitor. Eine kontrastreichere Farbgebung wäre wünschenswert.[BR][BR]Oder soll man das gar nicht lesen können? [BR]Wo doch die \"ältere Generation der Nicht-Discord-User sowieso unwichtig ist neuerdings?"}, {"61": "Thebigunknown schrieb:\t\t\tDieses mal war mir selbst in meiner Erststadt mit Newsletter das \"Glück\" deutlich weniger hold.\t\tZum Vergrößern anklicken....Jetzt haben am Ende noch 3 Schlüssel !!!! gefehlt für das 9. Artefakt .... und eine Sekunde vor Ende fallen noch mal Schlüssel vom Himmel ... anklicken konnte ich sie noch, aber ob noch 3 Schlüssel drin waren, konnte ich nicht mehr sehen, Event zu Ende .... aber ich freue mich, dass ich so ein tapferer Junge war und nicht 500 Dias für 3 Schlüssel ausgegeben habe [smilie--sprite1] [smilie--sprite1] [smilie--sprite1] ... das nächste Abenteuer kommt bestimmt"}, {"14": "anscheinend haben viele Spieler Dias investiert?[BR]in meiner Hauptstadt war mir für irgendwann ein zweiter Tinlug wichtig, bin allerdings wieder in Silber zurückgefallen, trotz Eventwährungskauf: die zweite Grundplatte und 2 Artefakte habe ich aber[BR][BR]in meinen Zweitstädten bin ich in einer in Bronze gelandet, obwohl Tinlug fertig steht[BR]in der anderen in Eisen mit Stufe 9[BR]also, Eisen ist mir echt noch nie passiert...[BR][BR][BR][IMG]https://i.ibb.co/S3nxpk3/https-de-forum-elvenar-com-index-php-attachments-screenshot-30-png-39136.png[/IMG][BR][BR]im neuen Event auf Beta läuft es mit Zusatzeventwährung weit besser, da ist das Evo fertig und ich noch nicht einmal bei den Tagesquests"}, {"2": "...zum letzten Mal die Endstände der Ligen - alles weitere spar ich mir...[BR][BR]Arendyll[BR][IMG]https://i.ibb.co/fVR4Zjv/https-de-forum-elvenar-com-index-php-attachments-arendyll-png-39137.png[/IMG][BR][BR]Winyandor[BR][IMG]https://i.ibb.co/64trCB9/https-de-forum-elvenar-com-index-php-attachments-winyandor-png-39143.png[/IMG][BR][BR]Felyndral[BR][IMG]https://i.ibb.co/wK9RqSd/https-de-forum-elvenar-com-index-php-attachments-felyndral-png-39140.png[/IMG][BR][BR]Khelonaar[BR][IMG]https://i.ibb.co/yNKwz8Z/https-de-forum-elvenar-com-index-php-attachments-khelonaar-png-39141.png[/IMG][BR][BR]Elcysandir[BR][IMG]https://i.ibb.co/h2BSvnc/https-de-forum-elvenar-com-index-php-attachments-elcysandir-png-39139.png[/IMG][BR][BR]Sinya Arda[BR][IMG]https://i.ibb.co/D92VBwQ/https-de-forum-elvenar-com-index-php-attachments-sinya-png-39142.png[/IMG][BR][BR]Ceravyn[BR][IMG]https://i.ibb.co/wCczVj1/https-de-forum-elvenar-com-index-php-attachments-ceravyn-png-39138.png[/IMG]"}, {"156": "Danke für das letztmalige Posten der Ligenendstände,@Romilly ! [smilie--sprite1]"}, {"11": "Um alle Stufen zu bekommen muß man schon Geld ausgeben.[BR] Ich bin immer sehr früh mit allen durch, Aber es fehlen immer 1-3 stufen.[BR][BR]Events finde Ich super, aber nicht so schnell hintereinander, und nicht immer neue EVO gebäude.[BR][BR]oder Bei jeden Event die möglichkeit Erweiterungen zu erspielen."}, {"126": "Der Glücksfaktor war mal wieder extrem. Also wie immer... Wozu auch immer man Feedback gibt, wenn es eh nicht interessiert. [BR]Auf Cerawyn, wo ich gerne schnell alle Artefakte gehabt hätte gerade mal 252 Punkte, auf Elcy, wo es nicht so wichtig war, 292 Punkte. Gleiche Spielweise und gleiche Kistenwahl."}, {"216": "Guten Morgen,[BR][BR]260 Schritte erreicht, Quests für langjährige Spieler kein Problem, Tagespreise wie immer ( Ich bevorzuge Einheiten AWWP Runen Herzen evtl WP evtl große Gebäude für Fragmente ), Evo gut ( gefüttert wird es allerdings nur bei dringendem Bedarf an Kombis ).[BR][BR]Für Neuanfänger sollten die Anforderungen an z. Bsp. WP Schwaden gesenkt werden.[BR][BR] MfG"}, {"4": "Für die ersten 6 Kapitel sind die Anforderungen an WP Kauf und Relikte und Schwaden eindeutig zu hoch. Hier muss dringend nachgebessert werden. Es reicht nicht, nur z.B. 3 Bücher weniger zu verlangen, die Hälfte ist hier noch genügend. Immerhin sollen gerade die Anfänger ein Erfolgserlebnis haben beim Spielen und nicht ständig nur Event Frust.[BR][BR]Leider keine interessanten Tagespreise. Ein Kap. 14 Account hat noch viele Teile, vor allem Kultur, aus Kap. X stehen, da es in keinem der letzten Events dafür adäquaten Ersatz gab. [BR][BR]Sehr viel Glück abhängig, es kommt mir vor, dass das Glück eine immer größere Rolle spielt. Teilweise nur 7 Artefakte erspielen können, teilweise die obligaten 8, 1 x sogar alle 9 Artefakte. Bei gleicher Spielweise und sehr ähnlicher Kistenwahl. [BR][BR]Das Evo ist vor allem beim GA angezeigt, ansonsten für alle interessant, die auch aufgrund der erhöhten Ausgaben für grüne Kombis, diese aktuell doch sehr benötigen. [BR][BR]Quests in höheren Kapiteln gut machbar, trotzdem Relikte wieder zur Unzeit, nämlich ganz zu Beginn des Events, wenn das Turnier noch nicht läuft. Trotzdem sehr hoher Kauf an Büchern notwendig."}, {"11": "mir fehlt bei Tinlug noch eine stufe, gibt es eine möglichkeit die noch zu bekommen??[BR]GA zb. oder kommt schon das nächste Event vorher??"}, {"14": "wenn es wie auf Beta läuft, kommt das Zwergenevent vorher (das kam direkt danach), wie es danach dann aussieht, weiß ich nicht, gemunkelt wird schon über ein 5-stufiges Evo mit zusätzlichen Setteilen, passend im Halloween-Outfit[BR]ob dazwischen noch ein GA passt?[BR][BR]aber sicher spätestens danach"}, {"35": "Üblicherweise gibt es kein GA für dieses Artefakt dann mehr, wenn es nicht gleich im Anschluß ans Event folgt. [BR]Vielleicht mal im Turm, Akademie oder in einem späteren Folianten? Das kann aber dauern."}, {"2": "...für ein GA bleibt nur ein kurzes Zeitfenster - das Zwergenevent soll ja am 28.9. starten und wird wieder ca. 3 Wochen dauern (bis 18.10.) - ein GA dauert aber ebenfalls knapp eine Woche, startet für gewöhnlich entweder an einem Dienstag oder Donnerstag, also entweder gleich am 19. oder es geht bis einen Tag vor Halloween - ich fände es aber ehrlich gesagt ziemlich blöd, wenn ein Halloween-Event hauptsächlich NACH Halloween abgehalten wird..."}, {"24": "Ich hatte dieses Mal extremste Schwierigkeiten. Weder habe ich alle Aufgaben geschafft (Ich spiele immer ohne Spoiler), noch hab ichs auch nur in die Bronzeliga geschafft, dazu fehlt mir ein Artefakt - Eigentlich WOLLTE ich diesmal Dias raushauen um ne zweite Grundplatte zu kriegen, aber es war für mich einfach unschaffbar. Auch keinerlei Bonuswährung. Echt verhext. Naja, was solls. Bleiben meine Bibs halt stehen. Schade aber, das wäre ne große Platzersparnis gewesen."}]