[{"1": "Liebe Menschen und Elfen,[BR][BR]nicht mehr lange und ein neues Kapitel wird in Elvenar aufgeschlagen. Euer Feedback zum Kapitel 19: Die Rache des Verbannten könnt ihr hier abgeben. Wir freuen uns darauf.[BR][BR]Viele Grüße[BR]Euer Elvenar Team"}, {"2": "...super super - freu freu ^^... da kann ich ja jetzt meine Infos hier posten..."}, {"69": "Ja, Romily. Zeig, ob du noch was Neues für uns hast ! [smilie--sprite2]"}, {"6": "Wird auf jeden Fall eine Herausforderung. Die Abläufe sind diesmal dermaßen ineinander verschachtelt .... [smilie--sprite10][smilie--sprite1]"}, {"2": "achilles7453 schrieb:\t\t\tJa, Romilly. Zeig, ob du noch was Neues für uns hast ! [smilie--sprite2]Zum Vergrößern anklicken.......wer neugierig ist, kann ja schon mal hier in den Beta-Thread kucken, aber ansonsten würd ich hier im Feedback dann lieber mit Bildern aus der deutschen Sprachversion arbeiten - ist besser verständlich..."}, {"27": "Es wäre super, wenn man es doch gleich auch in deutsch übersetzt hätte, da nicht jeder über sehr gute englisch Kenntnisse verfügt.  [smilie--sprite11]"}, {"182": "Hallo Robin, bin ganz Deiner Meinung, ehrlich [smilie--sprite2]"}, {"21": "Auf eines kann man sich aber mental schonmal einstellen: das wird das längste Kapitel bis jetzt [smilie--sprite6]"}, {"2": "Robin7 schrieb:\t\t\tEs wäre super, wenn man es doch gleich auch in deutsch übersetzt hätte, da nicht jeder über sehr gute englisch Kenntnisse verfügt.  [smilie--sprite11]Zum Vergrößern anklicken.......was meinst du? - auf dem Beta gibt es keine deutschen Texte (ist ein internationaler Testserver) - ich kann zwar die Foren-Beiträge übersetzen lassen, aber bei Bildern funktioniert das nicht...und hier ist das Kapitel ja noch nicht da - da musst du dich vorerst mit der Ankündigung begnügen...[BR][BR]...oder meinst du das Video? - da gibt es (wie immer) einen deutschen Untertitel)...huch - das Video ist verschwunden.."}, {"27": "Sorry, dies wurde bei der letzten Gastrasse auch schon so geschrieben, aber es liegt doch immer an einen selber wie lange man dafür braucht. [smilie--sprite2]"}, {"182": "Hallo zusammen,[BR]dieses neue Kapitel ist sehr verschachtelt [smilie--sprite11][BR]Wer sich dieses Kapitel antut, der muss schon eine hohe Intelligenz und eine guten Überblick besitzen, ehrlich ![BR]Ich werde es mir höchst wahrscheinlich nicht antun, da mir dieses Kapitel zu schwer zu lösen ist, ganz ehrlich !!![BR]Alle anderen Spieler wünsche ich viel Spaß & Erfolg in diesem neuen Kapitel, ehrlich ,,, !!![BR]Meine Meinung : viele Spieler werden dieses Kapitel nicht durchspielen, sondern nur anfangen, um zu sehen, wie weit man kommen kann in diesem Kapitel, ehrlich ,,, !!!"}, {"27": "Habe mir des Video angesehen und man konnte es noch nicht in deutsch sich ansehen. [smilie--sprite11]"}, {"6": "Don Tomato schrieb:\t\t\tdieses neue Kapitel ist sehr verschachtelt\t\tZum Vergrößern anklicken....Jepp, ist es.[BR]Don Tomato schrieb:\t\t\tWer sich dieses Kapitel antut, der muss schon eine hohe Intelligenz und eine guten Überblick besitzen, ehrlich ![BR]Ich werde es mir höchst wahrscheinlich nicht antun, da mir dieses Kapitel zu schwer zu lösen ist, ganz ehrlich !!!\t\tZum Vergrößern anklicken....Ein wenig logisches Denken sollte reichen. Mein Ziel ist es, spätestens Ende Februar fertig zu werden. Bin mal gespannt ob das klappt. [smilie--sprite6]"}, {"182": "und außerdem : das Video ist plötzlich verschwunden -> auch das noch, gelle ,,, [smilie--sprite11][smilie--sprite12][smilie--sprite11] ,,, !!![BR][BR]@ustoni : da haben Sie sich aber was gewaltiges vorgenommen, ehrlich ,,,[BR]viel Spaß & Erfolg dabei ,,, wünsche ich Dir dazu ,,, [smilie--sprite2] ,,,"}, {"85": "Ich bin sehr gespannt und erst einmal ohne weitere Kenntnisse erfreut, dass es endlich eine Abkehr vom ständig ähnlichen Ablauf der Kapitel gibt. Mich haben die letzten Kapitel eher angeödet und deshalb ist jede Änderung, gerade wenn es geistig herausfordernder wird , ein guter Schritt."}, {"27": "@ Don Tomato, was soll man denn machen? Man hat nur zwei Möglichkeiten es zu spielen oder aufzuhören???"}, {"6": "Don Tomato schrieb:\t\t\tviel Spaß & Erfolg dabei ,,, wünsche ich Dir dazu ,,, [smilie--sprite2] ,,,\t\tZum Vergrößern anklicken....Danke! Spaß werde ich auf jeden Fall haben. Obs im angestrebten Zeitrahmen klappt, werde ich dann sehen.  [smilie--sprite1]"}, {"182": "Hallo lieber @Robin : ,,,[BR]es gibt hier mehrere Möglichkeiten ,,,[BR]< 1 > man schreibt das Programmier-Team an und bittet darum, dieses Kapitel etwas zu entschärfen ,,, ![BR]< 2 > man wechselt im Elvenar-Spiel entweder vom Mensch zu Elfen oder umgekehrt und fängt an, eine neue Stadt aufzubauen ![BR]          habe ich getan und bin damit bis jetzt gut gefahren [smilie--sprite2] [BR]< 3 > Als letzte Möglichkeit kann man wechseln zum FoE-Spiel, um dort auch eine Industriestadt aufzubauen ,,, [smilie--sprite11] ,,,[BR]          diese Industriestadt ist ähnlich aufgebaut wie im Elvenarspiel und mit den Vorkenntnissen von Elvenar ist dieses nicht all zu schwer,[BR]          die Anforderungen im FoE-Spiel zu erfüllen, ehrlich !!![BR]Bin zur Zeit selbst im FoE-Spiel dabei und kann somit aus Erfahrung Ihnen dieses sagen ,,,, [smilie--sprite1] ,,,[BR]Aber die Entscheidung liegt selbstverständlich ganz bei Ihnen, gelle ,,, [smilie--sprite11] ,,,[BR]Ich hoffe für Sie, das Sie eine gute Entscheidung für sich treffen werden, denn spielen müssen Sie ja alleine, wie wir alle anderen auch, gelle !!![BR][BR]Hallo @ustino : Sie müssen ja ein hoch intelligenter Spieler sein ![BR]Na dann, wie gesagt, viel Spaß & Erfolg in diesem neuen Kapitel, gelle [smilie--sprite1]"}, {"183": "Ich bin sehr gespannt auf das neue Kapitel . Dauert zwar noch etwas , ich bin gerade in 15. Aber das hört sich sehr spannend an . Vielleicht mal eine andere Art der Herausforderung [smilie--sprite1]"}, {"54": "Ich werde erstmal abwarten, bis die infos in Deutsch da sind - englischen Kauderwelsch tu ich mir nicht an - noch nie ..."}]