[{"90": "Cavalieri dello Zombiaco: La vendetta dell'Esiliato - capitolo XIX, kannst dir die seite übersetzen lassen."}, {"85": "70 Seiten Angebote brennende Barren[BR]117 Seiten Angebote Allwissende Alraunen[BR]0 Seiten Angebote Urwelt Mineralien[BR][BR]Aerosole, Flugpulver und Wunderwachs werden auch nur angeboten, um Alraunen zu bekommen.[BR][BR]So sieht das viel zitierte Balancing im Markt aus![BR][BR]Prinzipiell finde ich die Kaufleute eine gute Spielidee. Nimmt es den Ungleichgewichten doch einen Teil der Problematik weg. Wenn aber der Handel, der ja die einzige Möglichkeit des Fortschritts ist, nur noch mit den Kaufleuten erfolgen kann, dann wird der Spielspaß komplett erledigt. Nur ser dann noch im 6 Stundenrhythmus online sein kann, kommt noch schleichend voran, Ansonsten verschwinden die Güter durch den zerfall schneller als benötigte Mengen aufgebaut werden können. Wer das Glück hat, das richtige Bonusgut zu produzieren, kann ganz entspannt spielen. Alle anderen dürfen sich wieder einmal über die fehlende Chancengleichheit ärgern. Die scheint aber bei den Entwicklern nicht wichtig zu sein."}, {"2": "...ich kann es nur immer wiederholen - sucht euch jemanden, der das hat, was ihr braucht - schreibt den an - und schon in wenigen Minuten sind dann 300k Flugpulver (oder was auch immer) getauscht...mach ich auch (gerade eben) so...."}, {"85": "Romilly schrieb:\t\t\t...ich kann es nur immer wiederholen - sucht euch jemanden, der das hat, was ihr braucht - schreibt den an - und schon in wenigen Minuten sind dann 300k Flugpulver (oder was auch immer) getauscht...mach ich auch (gerade eben) so....\t\tZum Vergrößern anklicken....[BR]Wie bitteschön kannst du in wenigen Minuten 300K Flugpulver tauschen. Das sind bei 2200 Gütern beim Händler 136,36 Tauschaktionen. Für alle, die nicht komplett in Elvenar leben, sondern ein echtes Leben haben, sind solche \"Tipps\" nicht gewinnbringend."}, {"2": "...1. hatte ich mein HG vor dem ersten Handel mit Flugpulver bereits ausgebaut und somit kann ich 4600 handeln - und 2. hab ich dann einfach jemanden aus den Top10 angeschrieben und gefragt und dann halt im Sekundentakt meine 3 Kaufmänner auf die Reise geschickt und mein Tauschpartner hat die dann angenommen - das war letzte Woche für Wachs - für Aerosole hab ich auch schon mal bei den Gildenkollegen (des Tauschpartners) nachgefragt - jetzt hab ich gerade eben wieder 300 k Flugpulver produziert (mit Stormy und Handelszentrum) und warte nur noch, bis meine Tauschpartner gefrühstückt haben (ansonsten schreib ich halt wen anderes an - Angebote gegen Aerosole würden ja sogar im Markt stehen - aber ich bevorzuge natürlich meine Handelspartner... das nennt sich: Kommunikation..."}, {"54": "Fuenarb schrieb:\t\t\t70 Seiten Angebote brennende Barren[BR]117 Seiten Angebote Allwissende Alraunen[BR]0 Seiten Angebote Urwelt Mineralien[BR][BR]-cut-\t\tZum Vergrößern anklicken....[BR]117 Seiten angebotene Alraunen ??? - seit Beginn des neuen Kapitels hab ich maximal 10 Angebote insgesamt gesehen ...  hm...[BR][BR]Die Idee von Romilly find ich ned schlecht.[BR][BR]HdW"}, {"2": "...hier nochmal die Links zu den Tauschbörsen (auch wenn bei den erleuchteten außer mir noch keiner vermerkt ist, aber vielleicht läuft das ja mal an)..[BR][BR]Auch wenn die neuen Güterklassen (erweckte Güter, erleuchtete Güter) global gehandelt werden können, kommt es leider immer wieder vor, daß man ein bestimmtes Gut nur zu ungünstigen Preisen oder auch gar nicht auf dem Markt erhandeln kann.[BR][BR]Als kleine Abhilfe können sich hilfsbereite Spieler in den Tauschbörsen eintragen, die bereit sind, ihre Güter bei Bedarf gezielt zur Verfügung zu stellen, falls jemand dringend ein bestimmtes Gut benötigt.[BR][BR]Zu den Tauschbörsen geht es hier....[BR][BR]Arendyll: https://de.forum.elvenar.com/index.php?threads/tauschbÖrse-für-neue-güterklassen-erweckte-erleuchtete.22078/[BR]Winyandor: https://de.forum.elvenar.com/index.php?threads/tauschbÖrse-für-neue-güterklassen-erweckte-erleuchtete.22077/[BR]Felyndral: https://de.forum.elvenar.com/index.php?threads/tauschbÖrse-für-neue-güterklassen-erweckte-erleuchtete.22076/[BR]Khelonaar: https://de.forum.elvenar.com/index.php?threads/tauschbÖrse-für-neue-güterklassen-erweckte-erleuchtete.22075/[BR]Elcysandir: https://de.forum.elvenar.com/index.php?threads/tauschbÖrse-für-neue-güterklassen-erweckte-erleuchtete.22074/[BR]Sinya Arda: https://de.forum.elvenar.com/index.php?threads/tauschbÖrse-für-neue-güterklassen-erweckte-erleuchtete.22072/[BR]Ceravyn: https://de.forum.elvenar.com/index.php?threads/tauschbÖrse-für-neue-güterklassen-erweckte-erleuchtete.22070/[BR][BR][BR]...so - mein \"Wachs-Dealer\" hat sich sehr gefreut, daß er noch 76k von meinem Flugpulver erwischen konnte und mit den insgesamt ca. 220 k eingetauschten Wachs hab ich nun weitere 5 Brutstätten gebaut und eingelagert - meine Stadt glitzert für die nächsten Tage sehr sehr weihnachtlich...[BR]...eigentlich hätt ich das heute noch gar nicht machen müssen, da meine Stadt noch 14 Tage von einer Horde Riesenräder blockiert wird (hab also eigentlich noch gar keinen Platz für die Gastrasse) - aber ich wollte halt mein rares Unurium möglichst gut ausnutzen, bevor das wieder zerfällt...[BR]...in 14 Tagen brauch ich dann so ca. 580k Aerosole - bis dahin kann ich wieder sparen (meine Tauschpartner sind aber schon informiert)..."}, {"57": "naja das ist alles gut und schön, aber der Handel sollte eigentlich so funktionieren, das man nicht erstmal tausende Leute anschreiben muss und \"betteln\" muss für seine Güter. [BR]meine 10 cent Meinung"}, {"6": "@Inno: ihr solltet mal den Materialbedarf für neue Gastrassen ernsthaft überdenken.[BR]Ich habe 14 Brutstätten aufgebaut, davon inzwischen 4 auf Stufe 4, der Rest auf Stufe 3.[BR]Der Verbrauch an Mana liegt bis jetzt bei ca. 60 Millionen, das ist aber längst noch nicht das Ende der Fahnenstange.[BR][BR]Wenn ihr den Abstand zwischen den Gastrassen von 6 Monaten auf 12 Monate anheben wollt, könnt ihr das auch machen ohne solch irrsinnige Materialmengen zu verlangen.  [smilie--sprite2]"}, {"82": "ustoni schrieb:@Inno: ihr solltet mal den Materialbedarf für neue Gastrassen ernsthaft überdenken.[BR]Ich habe 14 Brutstätten aufgebaut, davon inzwischen 4 auf Stufe 4, der Rest auf Stufe 3.[BR]Der Verbrauch an Mana liegt bis jetzt bei ca. 60 Millionen, das ist aber längst noch nicht das Ende der Fahnenstange.[BR][BR]Wenn ihr den Abstand zwischen den Gastrassen von 6 Monaten auf 12 Monate anheben wollt, könnt ihr das auch machen ohne solch irrsinnige Materialmengen zu verlangen.  [smilie--sprite2]Zum Vergrößern anklicken....man sollte es auf max eine rasse pro jahr beschränken dann müssen sie sowas gar nicht erst machen ! dann hätte man mal wieder richtig zeit sich um die stadt zu kümmern vor lauter events ga`s und was nicht alles .[BR]du hast vollkommen recht das ist nur beschäftigungstherapie . mir fehlen die schönen langen pausen zwischendurch [smilie--sprite1]"}, {"9": "ustoni schrieb:\t\t\tDer Verbrauch an Mana liegt bis jetzt bei ca. 60 Millionen, das ist aber längst noch nicht das Ende der Fahnenstange.\t\tZum Vergrößern anklicken...... .. .. und die Storyline völlig daneben. Das kann auch nie und nimmer einer in 14 Tagen auf dem Beta getestet haben, dann wirklich[BR]ustoni schrieb:\t\t\tden Abstand zwischen den Gastrassen von 6 Monaten auf 12 Monate anheben\t\tZum Vergrößern anklicken....und dafür ordentlich und ausgiebig durchdacht und getestet. Diese Mengen sind nicht nur purer Wahnsinn sondern auch irgendwo eine reine Beschäftigungstherapie, denn im Prinzip, könnte man die weiße und schwarze Materie auch einfach gegen die Güter tauschen, denn du gehst nur auf Ausbau und reißt für den erhalt der Materien unmittelbar danach oder gar während des Aufbaus wieder ab.[BR]Entweder das ist ein Fehler oder völlig Sinnbefreit. Du sammelst die Güter für den Turm des Lichts, baust diesen und 1 Sek. später (noch im Bau) verkaufst du den und hast deine weiße Materie. Bei der schwarzen Materie muss man eben einmal 2 Std. warten aber im Prinzip ist das nur Güter sammeln, hinstellen und wegreißen. Wer denkt sich den sowas aus, da ist ja gar keine Logik dahinter und obendrein lese ich dann in anderen Foren und Communitys, dass das viele gar nicht wissen, weil es eben völlig Sinnbefreit ist. Hier könnte man eben auch gleich die Güter gegen die Materien tauschen und spart sich sinnlose klicks.[BR][BR]Edit:[BR]Da waren ja die Händler von Unur mit den Zeiten und Platzbedarf noch besser, aber Kapitel 17 und 19 sind reine Beschäftigungstherapien. Sammle bis zum abwinken und verliere statt gewinne Spielspaß."}, {"21": "AngelOfDead schrieb:\t\t\t.. .. .. und die Storyline völlig daneben. Das kann auch nie und nimmer einer in 14 Tagen auf dem Beta getestet haben, dann wirklich[BR][BR]und dafür ordentlich und ausgiebig durchdacht und getestet. Diese Mengen sind nicht nur purer Wahnsinn sondern auch irgendwo eine reine Beschäftigungstherapie, denn im Prinzip, könnte man die weiße und schwarze Materie auch einfach gegen die Güter tauschen, denn du gehst nur auf Ausbau und reißt für den erhalt der Materien unmittelbar danach oder gar während des Aufbaus wieder ab.[BR]Entweder das ist ein Fehler oder völlig Sinnbefreit. Du sammelst die Güter für den Turm des Lichts, baust diesen und 1 Sek. später (noch im Bau) verkaufst du den und hast deine weiße Materie. Bei der schwarzen Materie muss man eben einmal 2 Std. warten aber im Prinzip ist das nur Güter sammeln, hinstellen und wegreißen. Wer denkt sich den sowas aus, da ist ja gar keine Logik dahinter und obendrein lese ich dann in anderen Foren und Communitys, dass das viele gar nicht wissen, weil es eben völlig Sinnbefreit ist. Hier könnte man eben auch gleich die Güter gegen die Materien tauschen und spart sich sinnlose klicks.[BR][BR]Edit:[BR]Da waren ja die Händler von Unur mit den Zeiten und Platzbedarf noch besser, aber Kapitel 17 und 19 sind reine Beschäftigungstherapien. Sammle bis zum abwinken und verliere statt gewinne Spielspaß.\t\tZum Vergrößern anklicken....[BR]Nachdem das auf dem beta schon so war hatte ich zB live im Vorfeld WP und Material für insgesamt 48 schwarze Materien gesammelt und mit dieser Methode mithilfe paar 2 Std boostern innerhalb von 10 Minuten nach Start die 48 schwarzen Materien fertig. Tja, wie sinnbefreit die ganze Sache ist frag ich mich eh nicht mehr, und ausserdem warum die nach 7 Tagen ablaufen.  Viele aber bauen die Türme nach und nach weil erst das Material herangeschafft werden muß obwohl sie wissen daß man die während des Bauen sofort wieder verkaufen kann."}, {"9": "Indianaking schrieb:\t\t\tNachdem das auf dem beta schon so war hatte ich zB live im Vorfeld WP und Material für insgesamt 48 schwarze Materien gesammelt und mit dieser Methode mithilfe paar 2 Std boostern innerhalb von 10 Minuten nach Start die 48 schwarzen Materien fertig. Tja, wie sinnbefreit die ganze Sache ist frag ich mich eh nicht mehr, und ausserdem warum die nach 7 Tagen ablaufen. Viele aber bauen die Türme nach und nach weil erst das Material herangeschafft werden muß obwohl sie wissen daß man die während des Bauen sofort wieder verkaufen kann.\t\tZum Vergrößern anklicken....Stimme ich dir 100% in allen Punkten zu. Hier wird der Spielspaß genommen anstatt gegeben. Die weiße Materie hat man ziemlich schnell und die schwarze holt man sich ganz nebenbei, lässt den Turm des Lichts ausbauen (2 Std.), dann ging ich auf ausbauen zum dunklen Turm und hab den auch gleich wieder verkauft. Hat man nun XXX Zeit-Booster geht es auch so wie du es bei der schwarzen Materie gemacht hast. Da man aber so oder so unendlich auf die Kreaturen etc. warten muss, hab ich hierfür keine Booster benutzt. Sinnbefreit ist es aber dennoch, denn hier kann man auch gleich Güter gegen Materie tauschen, denn was anderes ist das nicht."}, {"82": "und die summen der brutstätte  selbst sind dann auch noch ein witz ! man bekommt in 6 std 72  kreaturen des lichts (brutstätte auf stufe 2 )braucht aber insgesamt 70000 um die brutstätte weiter auszubauen ---verarschen kann ich mich alleine und dias werden definitiv nicht genommen ![BR]wenn sie uns hier halten wollen müssen sie schon etwas kreativer werden denke ich .[BR]und da rede ich nur von der forschung ,wenn ich dann noch die unverschämten aufgaben sehe kann man nur lachen.[BR][BR]fast vergessen bleiben die schwarze und weisse magie ! ok wir haben segen aber wenn die nicht wären wo sollen da bitte diese aber mio herkommen ? man kann ja max 9 türme ans portal stellen! und schlecht verteilt ist es in der forschung auch noch  ,man stellt weniger kreaturen des lichts her aber in manchen forschungen (wie zb. HG werden 40k licht und 20k nacht /  eine bibliothek und ein zu hause 60k licht und 30k nacht )  braucht man mehr als die der nacht ![BR]sieht so aus als wollte inno mit dieser rasse das geld auf ewig verdienen so wie es der letzte punkt der forschung erahnen lässt [smilie--sprite1][BR][BR][IMG]https://i.ibb.co/x86rp7v/https-de-forum-elvenar-com-index-php-attachments-bildschirmfoto-2021-12-24-um-12-10-21-png-27406.png[/IMG]"}, {"6": "Ja, das ist so ziemlich die unausgewogenste Gastrasse die sich Inno bisher geleistet hat.[BR][BR]Als Optimist würde ich normalerweise sagen, es kann in Zukunft nur besser werden. Aber ....."}, {"21": "Elvarius schrieb:\t\t\tund die summen der brutstätte  selbst sind dann auch noch ein witz ! man bekommt in 6 std 72  kreaturen des lichts (brutstätte auf stufe 2 )braucht aber insgesamt 70000 um die brutstätte weiter auszubauen ---verarschen kann ich mich alleine und dias werden definitiv nicht genommen ![BR]wenn sie uns hier halten wollen müssen sie schon etwas kreativer werden denke ich .[BR]und da rede ich nur von der forschung ,wenn ich dann noch die unverschämten aufgaben sehe kann man nur lachen.[BR][BR]fast vergessen bleiben die schwarze und weisse magie ! ok wir haben segen aber wenn die nicht wären wo sollen da bitte diese aber mio herkommen ? man kann ja max 9 türme ans portal stellen! und schlecht verteilt ist es in der forschung auch noch  ,man stellt weniger kreaturen des lichts her aber in manchen forschungen (wie zb. HG werden 40k licht und 20k nacht /  eine bibliothek und ein zu hause 60k licht und 30k nacht )  braucht man mehr als die der nacht ![BR]sieht so aus als wollte inno mit dieser rasse das geld auf ewig verdienen so wie es der letzte punkt der forschung erahnen lässt [smilie--sprite1][BR][BR]Anhang 27406 ansehenZum Vergrößern anklicken....[BR]Also ich habe keine einzige Kreatur gebraucht um die Brutstätten zu leveln [smilie--sprite6] - vlt erstmal gründlich informieren."}, {"82": "Indianaking schrieb:\t\t\tAlso ich habe keine einzige Kreatur gebraucht um die Brutstätten zu leveln [smilie--sprite6] - vlt erstmal gründlich informieren.\t\tZum Vergrößern anklicken....auch nicht für die forschung ?evtl mal vorher überlegen ! [smilie--sprite1]  oder richtig lesen reicht ,denn es steht sogar da das ich nur die forschung meinte oder ?"}, {"188": "@Elvarius[BR]Elvarius schrieb:\t\t\tman bekommt in 6 std 72 kreaturen des lichts (brutstätte auf stufe 2 )braucht aber insgesamt 70000 um die brutstätte weiter auszubauen\t\tZum Vergrößern anklicken....Du hast doch eindeutig geschrieben, dass man 70000 kreaturen des lichts braucht, um die Brutstätten weiter auszubauen? (mal vom Wahrheitsgehalt die Aussage abgesehen)"}, {"82": "Lord Maz schrieb:@Elvarius[BR][BR]Du hast doch eindeutig geschrieben, dass man 70000 kreaturen des lichts braucht, um die Brutstätten weiter auszubauen? (mal vom Wahrheitsgehalt die Aussage abgesehen)\t\tZum Vergrößern anklicken....und wenn du den ganzen text liest steht da das ich nur die forschung meinte oder ?denn nach stufe 2 kann man erst weiter ausbauen wenn man die forschung der brutstätten macht.und um dahin zu kommen brauchst du diese 70k kreaturen. [BR]liest du bei einem buch auch nur  einzelne sätze und weisst dann die ganze geschichte ?"}, {"188": "@Elvarius Dann drück Dich doch bitte in Zukunft so aus, dass dich jeder versteht - ich gehe mal davon aus, dass @Indianaking und ich nicht die einzigen sind, die denken, dass wenn du das hier schreibst;[BR]Elvarius schrieb:\t\t\tman bekommt in 6 std 72 kreaturen des lichts (brutstätte auf stufe 2 )braucht aber insgesamt 70000 um die brutstätte weiter auszubauen\t\tZum Vergrößern anklicken....dass Du meinst, Du bräuchtest die Kreaturen direkt zum ausbauen der Brutstätten (so wie Du es halt geschrieben hast) und nicht, dass Du die irgendwann in der Forschung brauchst, um weitere Ausbaustufen der Brutstätten freizuschalten."}]