[{"2": "Elvarius schrieb:und da rede ich nur von der forschungZum Vergrößern anklicken.......hast du denn keine Händlergilde (Hummel)? Vermutlich hast du auch deine Festung noch nicht ausgebaut, wenn du nur 72 Kreaturen alle 6 Stunden bekommst bei einer Brutkammer auf Stufe 2 (bei mir wären es 95 mit einer 1er-Festung - ich bin aber gerade dabei, meine Hummel weiter auszubauen - bei so einem Umfang zählt jede einzelne Kreatur, die man mehr bekommt)..."}, {"6": "Festung auf 3, Brutstätte auf 4 und Hummel auf 26 bringt 388 Kreaturen der Nacht bzw. 254 Kreaturen des Lichts.[BR]Etwas besser, wird aber immer noch langwierig. [BR]Irrsinn ist dabei der Bedarf an Mana für die Ausbaustufen. Mehr als 12 Brutstätten auf 4 passen vom Platz her bei mir aber ohnehin nicht. Dazu noch 2 Brutstätten auf 3."}, {"21": "Es wird in jedem Fall besser: mit ausgebauter Hummel bringt eine 4er Brutstätte + Portal lv 3 -410 schwarze und 269 weiße in 6 Stunden. Bei mir gibt das bei dreimaliger Abholung und 15 Brutstätten am Tag rund 12000 weiße und 18000 schwarze Kreaturen. Das geht und bringt ein Ende in Sicht [smilie--sprite1]"}, {"85": "Mich nervt das Kapitel auch extrem. Für die erste Forschung mit den Kreaturen und für die Forschung des ersten Ausbaus des Portals werden 50.000 Kreaturen des Lichts benötigt. Dafür liefert eine Brutstätte nur 40 pro 6 Std. Ich empfinde es als extrem stupide, langweilig und demotivierend, wenn ich für eine einzelne Forschung Wochen benötige. Die Kapitel werden leider immer öder und es scheint nur noch um Wartezeiten zu gehen. As das neue Kapitel angekündigt wurde war ich darauf gespannt, jetzt nur noch genervt."}, {"82": "Lord Maz schrieb:@Elvarius Dann drück Dich doch bitte in Zukunft so aus, dass dich jeder versteht - ich gehe mal davon aus, dass @Indianaking und ich nicht die einzigen sind, die denken, dass wenn du das hier schreibst;[BR][BR]dass Du meinst, Du bräuchtest die Kreaturen direkt zum ausbauen der Brutstätten (so wie Du es halt geschrieben hast) und nicht, dass Du die irgendwann in der Forschung brauchst, um weitere Ausbaustufen der Brutstätten freizuschalten.\t\tZum Vergrößern anklicken....wie ich schon sagte nicht nur das vorwort lesen sondern den ganzen text ! wo ist das problem war ja jetzt kein roman oder ?und es steht nirgends das man die kreaturen DIREKT zum ausbau braucht soweit ich das sehe .[BR][BR]@Romilly nein ich habe keine hummel aber das macht ja den kohl nicht fett wie viele sagen ![BR]es bleibt immernoch dieses unbehagen das inno uns hier einen unnützen zeitstempel aufdrückt![BR][BR]ich hätte die zeit bis zur nächsten rasse genutzt um die stadt mal wieder auf vordermann zu bringen denn dafür bleibt vor lauter events und ga`s ja leider wenig zeit ! haben wir denn nicht schon genug zeit verplämpert mit abzeichen sammeln in der letzten rasse? falls nicht warum wurden die anforderungen nach unten geschraubt ?[BR][BR]@ustoni  ja das kommt noch dazu das ist echt irre ! hatte 18 mio und hat nicht mal für 10 brutstätten stufe 2 und strasse gereicht ![BR]auch die anforderungen an erweckte ist nicht gerade wenig ,über den handel mit den neuen gütern ganz zu schweigen [smilie--sprite1]"}, {"188": "Elvarius schrieb:\t\t\tund es steht nirgends das man die kreaturen DIREKT zum ausbau braucht soweit ich das sehe .\t\tZum Vergrößern anklicken....wenn du das hier schreibst, frage ich mich, ob Du meinen Beitrag wirklich gelesen hast, ich hab das nämlich schon \"beantwortet\":[BR]Lord Maz schrieb:\t\t\tDann drück Dich doch bitte in Zukunft so aus, dass dich jeder versteht - ich gehe mal davon aus, dass @Indianaking und ich nicht die einzigen sind, die denken, dass wenn du das hier schreibst;[BR]dass Du meinst, Du bräuchtest die Kreaturen direkt zum ausbauen der Brutstätten (so wie Du es halt geschrieben hast) und nicht, dass Du die irgendwann in der Forschung brauchst, um weitere Ausbaustufen der Brutstätten freizuschalten.\t\tZum Vergrößern anklicken....Und ansonsten, wenn ich Deine Beiträge so lese, kommt mir immer wieder ein Gedanke:[BR]Lord Maz schrieb:\t\t\tDa geh doch einfach und such dir einen \"Dienstleister\" der deinen Ansprüchen entspricht.\t\tZum Vergrößern anklicken....[smilie--sprite1][smilie--sprite1][smilie--sprite1][BR]Es tut Dir sicher nicht gut, Dich die ganze Zeit aufzuregen, und den restlichen Forumsteilnehmern beschert es sicher auch keine Freude, die ganze Zeit Gemotze zu lesen."}, {"82": "Lord Maz schrieb:\t\t\twenn du das hier schreibst, frage ich mich, ob Du meinen Beitrag wirklich gelesen hast, ich hab das nämlich schon \"beantwortet\":[BR][BR]Und ansonsten, wenn ich Deine Beiträge so lese, kommt mir immer wieder ein Gedanke:[BR][BR][smilie--sprite1][smilie--sprite1][smilie--sprite1][BR]Es tut Dir sicher nicht gut, Dich die ganze Zeit aufzuregen, und den restlichen Forumsteilnehmern beschert es sicher auch keine Freude, die ganze Zeit Gemotze zu lesen.\t\tZum Vergrößern anklicken....meine güte jetzt kramst du die alten sachen auch noch aus [smilie--sprite1] wie kann man denn so nachtragend sein [smilie--sprite1] du hast nicht wirklich beantwortet sondern deine seite der wahrnehmng dargelegt !die mir aber immernoch sagt das du nicht richtig gelesen hast denn es steht da das es nur um die forschung geht .[BR]was heisst denn gemotze ? das sind tatsachen -einfach 3 zeilen mehr lesen und du weisst worum es geht und gut ist , und ein bisl mitdenken schadet auch nicht denn wir haben alle die gleiche forschung soweit ich weiss![BR][BR]ich rege mich nicht auf bin nur verärgert was aus dem einst so anspruchsvollen spiel von vor 6 jahren geworden ist.[BR][BR]Lord Maz schrieb:\t\t\tdass Du meinst, Du bräuchtest die Kreaturen direkt zum ausbauen der Brutstätten (so wie Du es halt geschrieben hast) und nicht, dass Du die irgendwann in der Forschung brauchst, um weitere Ausbaustufen der Brutstätten freizuschalten.\t\tZum Vergrößern anklicken....[BR]das mit dem direkt kam übrigens auch von dir wie du siehst  !!! denn bei mir kann ich das so nicht lesen . [BR]aber wenn es dir hilft mache ich dir demnächst genauere angaben wo was zu finden ist obwohl ich dachte das wir alle lesen können und das gleiche spiel spielen !"}, {"188": "Elvarius schrieb:\t\t\tmeine güte jetzt kramst du die alten sachen auch noch aus\t\tZum Vergrößern anklicken....Naja, deine Grundmeinung scheint ja durch, da wundert es mich, dass Du immernoch Elvenar spielst...[BR]Und nochmal zu der Sache mit dem Ausbauen, einmal versuche ich es noch: Das, was Du geschrieben hast, haben zumindest ich und @Indianaking  so interpretiert, dass Du die Kreaturen für den Ausbau brauchst, nicht für die Erforschung des Ausbaus. Das direkt habe ich nur zur Anschaulichkeit eingefügt, damit besser klar wird, wie man das, was Du geschrieben hast, wahrscheinlich interpretiert..."}, {"82": "Lord Maz schrieb:\t\t\tNaja, deine Grundmeinung scheint ja durch, da wundert es mich, dass Du immernoch Elvenar spielst...[BR]Und nochmal zu der Sache mit dem Ausbauen, einmal versuche ich es noch: Das, was Du geschrieben hast, haben zumindest ich und @Indianaking  so interpretiert, dass Du die Kreaturen für den Ausbau brauchst, nicht für die Erforschung des Ausbaus. Das direkt habe ich nur zur Anschaulichkeit eingefügt, damit besser klar wird, wie man das, was Du geschrieben hast, wahrscheinlich interpretiert...\t\tZum Vergrößern anklicken....ja klar brauche ich es am ende denn ohne die forschung geht es leider nicht weiter oder ?das ist also eine grundvoraussetzung wie es aussieht ![BR]warum ich noch elvenar spiele ? weil ich es angefangen habe ! in meinem alter wird alles zu ende gebracht was man anfängt sonst wäre es vergebene zeit ! ist ja das einzige spiel das ich mache [smilie--sprite1][BR]sagen wir mal so ich bin davon ausgegangen das ihr auch die forschung machen müßt ! wenn ihr da evtl auch drum herum kommt sagt mir wie ![BR]wenn ihr das so interpretiert ist das ja nicht meine schuld denn ich sehe immer das ganze (auch ein buch von vorn bis hinten ) nicht nur rauspicken was mir gerade gefällt ."}, {"2": "Elvarius schrieb:\t\t\t@Romilly nein ich habe keine hummel aber das macht ja den kohl nicht fett wie viele sagen !\t\tZum Vergrößern anklicken.......doch - 30 % oder mehr sind nicht wenig - und selbst wenn es im Endeffekt nur um eine Verkürzung um 1-2 Wochen geht, dann sind das trotzdem weniger Tage, an denen dir das Kapitel auf die Nerven geht..."}, {"21": "Elvarius[BR]@Romilly nein ich habe keine hummel aber das macht ja den kohl nicht fett wie viele sagen ![BR][smilie--sprite1][BR][/QUOTE][BR][BR]3 x Abholen täglich / davon durch meine Hummel täglich zusätzlich: schwarze Kreaturen 4590 / weiße Kreaturen 3015. Das sind dann schon einige Wochen weniger ..... in denen einem das Kapitel auf die Nerven geht [smilie--sprite6]"}, {"12": "Romilly schrieb:\t\t\t...doch - 30 % oder mehr sind nicht wenig - und selbst wenn es im Endeffekt nur um eine Verkürzung um 1-2 Wochen geht, dann sind das trotzdem weniger Tage, an denen dir das Kapitel auf die Nerven geht...\t\tZum Vergrößern anklicken....Irgendwie scheine ich anders zu ticken. Im gegensatz zu Kap.17 hat dieses einen angenehmen Zeitrythmus und geht mir vermutlich dadurch nicht auf die Nerven. In der Früh, der Mittagspause und abends abholen - das kann ich längere Zeit durchhalten.[BR]Ich hab auch keine Hummel, irgendwo muß man ja sparen bei beschränktem Platz - aber ich hab jetzt so viele Wohnblöcke wie möglich eingemottet um bis 12 Brutstätten aufzustellen - bis ich alles auf Stufe 2 habe + Wege kommt eh schon Silvester bei diesem Mana-Bedarf. Bin bei den erleuchteten Gütern aber eh nicht schneller, da ich nur selten ein Angebot finde und das meiste über die Kaufmänner abwickeln muß. Zumindest kehren diese manchmal relativ rasch zurück, was ich am Wochenende ausnützen kann.[BR]Bei diesem Zeitbedarf find ich auch den Vorschlag von weiter vorne gut, nur 1x/Jahr ein neues Kapitel zu generieren, dann könnten mal die 100-Tage Objekte stehen ohne ins neue Kapitel reinzukommen. Zudem hätte auch der Kundschafter genügend Zeit, neue Provinzen vorzubereiten (bin noch nicht sooo lange dabei um bereits jenseits der 600 zu sein).[BR]Fazit: für mich zwar ein lang-dauerndes, aber angenehmes Kapitel."}, {"2": "...bisher geht es mir auch noch nicht auf die Nerven - ob das in 6 Wochen auch noch so ist, kann ich aber jetzt noch nicht beurteilen [smilie--sprite2]"}, {"82": "und der mist geht weiter ! portal auf 2-endlich [smilie--sprite1][BR]jetzt bekomme ich ja immerhin statt 108 -130 kreaturen der nacht in 6 std -hurra[BR]das portal will jetzt 19200 davon und noch 440 des lichts und gibt mir dafür in 3 std grandiose 50 ultimative ! respekt inno ihr wisst wie man leute beschäftigt [smilie--sprite3]  .[BR][BR]das ist doch alles krank ganz ehrlich--habt ihr die werte gewürfelt oder auch mal bisl verstand walten lassen ?"}, {"1": "@Elvarius 1. Sollte jetzt nochmal etwas beleidigendes von dir kommen, dann fangen wir an zu löschen.[BR]2. Das Kapitel soll nicht innerhalb von 2 Wochen durchgespielt sein. Man muss eben ein wenig Geduld aufbringen. Es ist ein Aufbauspiel hier und kein Spiel, bei dem man alles sofort haben kann."}, {"82": "Tacheless schrieb:@Elvarius 1. Sollte jetzt nochmal etwas beleidigendes von dir kommen, dann fangen wir an zu löschen.[BR]2. Das Kapitel soll nicht innerhalb von 2 Wochen durchgespielt sein. Man muss eben ein wenig Geduld aufbringen. Es ist ein Aufbauspiel hier und kein Spiel, bei dem man alles sofort haben kann.\t\tZum Vergrößern anklicken....1: was ist denn beleidigend ?[BR]2:  2 wochen braucht man ja schon um einmal das portal bedienen zu können habe ich das gefühl ?[BR]jetzt wo du sagst aufbauspiel fällt mir noch etwas ein ! wann bekommt man denn mal zeit zum ausbauen ?event -ga -event -mega teure  rasse ( nebenbei weiter event -ga -event )usw. usw. usw ."}, {"1": "@Elvarius Du sprichst den Entwicklern den Verstand ab, was beleidigend ist. Also unterlasse sowas bitte einfach.[BR][BR]Du hast doch jetzt, während dem Kapitel, Zeit deine Gebäude auszubauen. Dafür brauchst du ja keine Gastrassengüter. [smilie--sprite2] Zumindest machen das ganz viele Spieler so. Oder war dir das aktuelle Kapitel zu schnell da? Andere Spieler waren schon am quengeln, dass es so lange gedauert hat, bis ein neues Kapitel kommt. Desweiteren kann man immer selbst entscheiden, vielleicht mal ein paar Tage einfach nur sich auf den Gebäudeausbau zu beschränken. Zeit zum Ausbauen seiner Stadt findet man also immer."}, {"82": "Tacheless schrieb:@Elvarius Du sprichst den Entwicklern den Verstand ab, was beleidigend ist. Also unterlasse sowas bitte einfach.[BR][BR]Du hast doch jetzt, während dem Kapitel, Zeit deine Gebäude auszubauen. Dafür brauchst du ja keine Gastrassengüter. [smilie--sprite2] Zumindest machen das ganz viele Spieler so. Oder war dir das aktuelle Kapitel zu schnell da? Andere Spieler waren schon am quengeln, dass es so lange gedauert hat, bis ein neues Kapitel kommt. Desweiteren kann man immer selbst entscheiden, vielleicht mal ein paar Tage einfach nur sich auf den Gebäudeausbau zu beschränken. Zeit zum Ausbauen seiner Stadt findet man also immer.\t\tZum Vergrößern anklicken....ja klar wenn man erweckte güter einfach herstellen könnte (leider braucht man die saat woanders)! ich dachte die braucht man in rauen mengen in der forschung ! ich spreche ihnen nicht den verstand ab sondern nur das sie über die zahlen nicht nachgedacht haben (und das ist nicht beleidigend sondern sollte mal zum nachdenken anregen )! das was am wenigsten produziert wird wird am meisten gebraucht !"}, {"1": "Die Zahlen sind nicht willkürlich ausgedacht und es wurde sehr wohl nachgedacht. Wie gesagt: Man soll nicht durch das Kapitel rasen können, sondern einige Zeit in diesem verweilen. Und somit kann es nun mal sein, dass man für die ein oder andere Forschung etwas länger sammeln muss."}, {"82": "Tacheless schrieb:\t\t\tDie Zahlen sind nicht willkürlich ausgedacht und es wurde sehr wohl nachgedacht. Wie gesagt: Man soll nicht durch das Kapitel rasen können, sondern einige Zeit in diesem verweilen. Und somit kann es nun mal sein, dass man für die ein oder andere Forschung etwas länger sammeln muss.\t\tZum Vergrößern anklicken....für mich sieht es so aus das die portalsegen weg sollen ! denn wenn ich nur die weisse magie brauche und die dunkle ständig überläuft haut etwas nicht hin !und das geht mit den kreaturen so weiter ! ich will nicht durch rasen aber so viel verschenken wollte ich auch nicht !"}]