[{"1": "Die Portalsegen können schon seit einigen Kapiteln nicht mehr für alles genutzt werden. Warum? Eben weil so viele damit durch die Kapitel nur so gerast sind. Demnach sind diese jetzt auf bestimmte Kapitelgüter begrenzt. [BR]Ja, das Kapitel wird langatmig, aber ich verstehe dein Problem gerade nicht. Du möchtest doch eh nicht durchrasen. Was ist also daran so schlimm, dass man dann ein paar Tage etwas sammeln muss, um z.B. eine Forschung freizuschalten?"}, {"82": "Tacheless schrieb:\t\t\tDie Portalsegen können schon seit einigen Kapiteln nicht mehr für alles genutzt werden. Warum? Eben weil so viele damit durch die Kapitel nur so gerast sind. Demnach sind diese jetzt auf bestimmte Kapitelgüter begrenzt.[BR]Ja, das Kapitel wird langatmig, aber ich verstehe dein Problem gerade nicht. Du möchtest doch eh nicht durchrasen. Was ist also daran so schlimm, dass man dann ein paar Tage etwas sammeln muss, um z.B. eine Forschung freizuschalten?\t\tZum Vergrößern anklicken....das sagste was [smilie--sprite1]  gemerkt haben wir das schon alle ( aber so einseitig eingesetzt machen sie noch weniger sinn als in den letzten rassen, da muss doch dann die frage gestattet sein warum ich im turm bei fast jedem endboss einen portalsegen bekomme und das mit gnadenlosen 10%)! aber sag mir mal wie ich diese mengen mit den türmen alleine zusammen bekommen soll ? passen ja leider nur 9 ans portal oder ?also ohne segen  braucht man da nicht 1 jahr sondern 1 jahrzehnt ."}, {"88": "du mußt ja nicht warten bis die Türme nach 7 Tagen ausgelaufen sind, sondern kannst sie auch direkt schreddern für die Materie,[BR]dann braucht man halt ein paar Portalsegen mehr, aber der Platz den man spart ist wertvoller"}, {"82": "Questor Thews schrieb:\t\t\tdu mußt ja nicht warten bis die Türme nach 7 Tagen ausgelaufen sind, sondern kannst sie auch direkt schreddern für die Materie,[BR]dann braucht man halt ein paar Portalsegen mehr, aber der Platz den man spart ist wertvoller\t\tZum Vergrößern anklicken....da haste recht aber wo kommt dann die magie her ausser aus den segen ?der platz ist doch gar nicht das problem sondern das ungleich gewicht zwischen den  gütern die man braucht und bekommt!"}, {"1": "Weiße und schwarze Magie kannst du doch mit den Portalsegen herstellen. Da ist es doch egal, wie viele Türme du dann stehen hast oder eben nicht. Und Brutstätten kannst du so viele hinstellen wie du möchtest, solange du ausreichend Wege (Magischer Kriegspfad) in der Stadt hast, welcher mit dem Portal verbunden ist."}, {"88": "Segen sollte man eigentlich in Kap 19 genug haben, ich hatte zB auch alle Handelsstationen und Handelsaußenposten in der Stadt stehen gehabt die fleißig Portalsegen produziert haben bis sie dann irgendwann ausliefen"}, {"1": "Na ja, aber @Elvarius müsste ja auch genug haben, bekommt doch im Turm, laut eigener Aussage, immer welche. [smilie--sprite2]"}, {"82": "Tacheless schrieb:\t\t\tNa ja, aber @Elvarius müsste ja auch genug haben, bekommt doch im Turm, laut eigener Aussage, immer welche. [smilie--sprite2]Zum Vergrößern anklicken....nur leider bekommt man immer nur die weisse magie da die schwarze immer voll ist ! da sie am anfang fast nicht gebraucht wird und somit verfällt ! aber gut das du es auch kannst [smilie--sprite1]"}, {"188": "Elvarius schrieb:\t\t\tnur leider bekommt man immer nur die weisse magie da die schwarze immer voll ist ! da sie am anfang fast nicht gebraucht wird und somit verfällt !\t\tZum Vergrößern anklicken....Deswegen muss man aber nicht länger warten [smilie--sprite2]"}, {"82": "Lord Maz schrieb:\t\t\tDeswegen muss man aber nicht länger warten [smilie--sprite2]Zum Vergrößern anklicken....aber sie verfällt was nützt da der segen ?[BR][BR]Tacheless schrieb:\t\t\tNa ja, aber @Elvarius müsste ja auch genug haben, bekommt doch im Turm, laut eigener Aussage, immer welche. [smilie--sprite2]Zum Vergrößern anklicken....das findet ihr wohl noch lustig wenn man beim 3. endboss nen portalsegen bekommt der sinnlos ist ????? man bekommt eh kaum noch etwas vernünftiges im turm in den letzten wochen ! diese artefakte sind zu hauf im lager und keiner braucht sie mehr und ihr macht euch nen spaß draus !"}, {"188": "Entweder brauchst du weiße Magie, dann bekommst Du sie durch den Segen. Oder du brauchst schwarze, davon ist Dein Lager ja angeblich voll und Du kannst sie verwenden. Aber zu sagen: Ich verwende den Portalsegen nicht, weil schwarze zerfällt, obwohl ich die nicht brauche und obwohl mir der Portalsegen die benötigte weiße gibt, ist ein bisschen unsinnvoll."}, {"2": "...du könntest die Türme des Lichts ja auch ne Weile stehen lassen und weiße Magie produzieren, bis du was von der schwarzen verbrauchst - zwingt dich doch keiner dazu, deine Portalsegen so einseitig zu nutzen..."}, {"1": "@Elvarius Du widersprichst dich andauernd in deinen Beiträgen. Ich habe eher so das Gefühl, dass du gar keine andere Sichtweise sehen möchtest und nur da bist, um sich zu beschweren, wie schwer doch alles ist. Aber die Tipps, die man dir gibt, die sind dann auch nicht richtig. Da bin ich dann jetzt raus."}, {"82": "Romilly schrieb:\t\t\t...du könntest die Türme des Lichts ja auch ne Weile stehen lassen und weiße Magie produzieren, bis du was von der schwarzen verbrauchst - zwingt dich doch keiner dazu, deine Portalsegen so einseitig zu nutzen...\t\tZum Vergrößern anklicken....das ich da nicht drauf gekommen bin meine güte die geben ja 24k aber warte mal für was reicht das nochmal ? kann ich damit eine brutstätte anwerfen ?[BR]@Lord Maz ich habe nicht gesagt das ich sie nicht verwende aber jedesmal gehen die schwarzen ins leere!ich weiss nicht warum du angeblich sagst = das sollte doch bei fast jedem das gleiche sein ![BR]@ tacheles   ja mit den tips das ist so ne sache genau wie mit dem widersprechen das sieht wohl jeder anders ."}, {"2": "...also ich hab deine Probleme jedenfalls nicht...(durch die Hummel liefern meine Türme auch wesentlich mehr weiße Magie - aber ne Hummel willst du ja nicht aufstellen)...."}, {"82": "Romilly schrieb:\t\t\t...also ich hab deine Probleme jedenfalls nicht...(durch die Hummel liefern meine Türme auch wesentlich mehr weiße Magie - aber ne Hummel willst du ja nicht aufstellen)....\t\tZum Vergrößern anklicken....das heisst also du hast genau soviel schwarze wie weisse ?das hat mit der hummel gar nichts zu tun oder ?es geht un das gleichgewicht zwischen den beiden und das stimmt nicht ! ich produziere mehr schwarze aber brauche mehr weisse !"}, {"188": "Elvarius schrieb:\t\t\taber brauche mehr weisse !\t\tZum Vergrößern anklicken....Portalsegen [smilie--sprite2] Hast ja wohl genug, wenn du behauptest, dass sie sinnlos sind."}, {"82": "Lord Maz schrieb:\t\t\tPortalsegen [smilie--sprite2] Hast ja wohl genug, wenn du behauptest, dass sie sinnlos sind.\t\tZum Vergrößern anklicken....lies doch mal richtig es ist sinnlos weil man die schwarzen verschwendet(also nicht bekommt weil voll) ! ja ich habe genug aber mit jedem benutzen verschwendet man sie eigentlich weil die abtsimmung zwischen schwarz und weiss nicht stimmt !"}, {"2": "Elvarius schrieb:\t\t\tdas heisst also du hast genau soviel schwarze wie weisse ?das hat mit der hummel gar nichts zu tun oder ?es geht un das gleichgewicht zwischen den beiden und das stimmt nicht ! ich produziere mehr schwarze aber brauche mehr weisse !\t\tZum Vergrößern anklicken.......genau so viel nicht - aber es ist ziemlich ausgeglichen bisher....[IMG]https://i.ibb.co/d5Jg3jc/https-de-forum-elvenar-com-index-php-attachments-magie-png-27444.png[/IMG]....und ja - ich hab schon etliche Portalsegen benutzt...[BR][BR]...wenn du mehr weiße brauchst, dann musst du wohl weiße produzieren - dazu sind die Türme doch eigentlich gedacht - dann lass die halt ne Woche stehen, bis du die verkaufst...das Ungleichgewicht hast du selbst erzeugt..."}, {"82": "Romilly schrieb:\t\t\t...genau so viel nicht - aber es ist ziemlich ausgeglichen bisher....Anhang 27444 ansehen....und ja - ich hab schon etliche Portalsegen benutzt...[BR][BR]...wenn du mehr weiße brauchst - dann musst du wohl weiße produzieren - dazu sind die Türme doch eigentlich gedacht - dann lass die halt ne Woche stehen, bis du die verkaufst...das Ungleichgewicht hast du selbst erzeugt...\t\tZum Vergrößern anklicken....bei mir sieht das leider etwas anders aus[BR][BR]Lord Maz schrieb:\t\t\tPortalsegen [smilie--sprite2] Hast ja wohl genug, wenn du behauptest, dass sie sinnlos sind.\t\tZum Vergrößern anklicken....du redest immer von dem was du im wiki liest ,du musst es mal machen um mitreden zu können oder ? die praxis zeigt den weg nicht nicht theorie"}]