[{"12": "Ich bin ja selber noch nicht so weit in der Forschung, aber stimmen die Zahlen von Elvarius, daß man an die 20000 Kreaturen braucht, um 50 ultimate in einer 3-Std.Produktion zu erhalten ? Nachdem die geringste Anzahl 1000 ultimative im Forschungsbaum sind wären das schon 20 x ca.5 Tage (also 100 Tage bei 12 Brutstätten) um nur eine Forschung zu erledigen. Und selbst wenn sich die Zeiten durch höheren Ausbau halbieren bleiben immer noch um die 1000 Tage (über den Daumen gepeilt) um die Forschung zu beenden - das sind fast 3 Jahre !! Drum kann ich die Zahlen kaum glauben, kann das jemand bestätigen?"}, {"82": "Ayla Ayla schrieb:\t\t\tIch bin ja selber noch nicht so weit in der Forschung, aber stimmen die Zahlen von Elvarius, daß man an die 20000 Kreaturen braucht, um 50 ultimate in einer 3-Std.Produktion zu erhalten ? Nachdem die geringste Anzahl 1000 ultimative im Forschungsbaum sind wären das schon 20 x ca.5 Tage (also 100 Tage bei 12 Brutstätten) um nur eine Forschung zu erledigen. Und selbst wenn sich die Zeiten durch höheren Ausbau halbieren bleiben immer noch um die 1000 Tage (über den Daumen gepeilt) um die Forschung zu beenden - das sind fast 3 Jahre !! Drum kann ich die Zahlen kaum glauben, kann das jemand bestätigen?\t\tZum Vergrößern anklicken....reicht dir das als beweis ? warum sollte ich das erfinden ?die 1000 verlangten kannste im forschungsbaum ja selber sehen [BR][BR][BR]prnt.sc/24zixao"}, {"12": "Elvarius schrieb:\t\t\tjetzt bekomme ich ja immerhin statt 108 -130 kreaturen der nacht in 6 std -hurra[BR]das portal will jetzt 19200 davon und noch 440 des lichts und gibt mir dafür in 3 std grandiose 50 ultimative\t\tZum Vergrößern anklicken....Ich hab im Wiki ein Bild gefunden, wo 19200 schwarze Magie angezeigt wird und nicht Kreaturen der Nacht (was ich aus Deinem Beitrag rausgelesen hatte). Damit sieht die ganze Rechnung von vorhin aber ganz anders aus.... da wären die 1000 Ultimativen innerhalb weniger Tage geschafft.[BR]Eine Bestätigung von jemand, der schon so weit ist, wäre ganz nett."}, {"50": "Ich habe mein Portal auf Stufe 3, was auch die letzte Stufe ist, in der im Portal produziert werden kann.[BR]Das sind die Kosten für Ultimative Kreaturen.[BR][IMG]https://i.ibb.co/x7f9VWh/https-de-forum-elvenar-com-index-php-attachments-1640716181905-png-27446.png[/IMG] [IMG]https://i.ibb.co/qkwtdbk/https-de-forum-elvenar-com-index-php-attachments-1640716195555-png-27447.png[/IMG]"}, {"188": "Elvarius schrieb:\t\t\tlies doch mal richtig es ist sinnlos weil man die schwarzen verschwendet(also nicht bekommt weil voll)\t\tZum Vergrößern anklicken....Einmal versuche ich es noch, dann bin ich entgültig raus. Du brauchst weiße Magie. Wenn Du Portalsegen verwendest, bekommst Du weiße Magie. Weil Du von der schwarzen zwar zu viel hast, aber sowieso genügend Portalsgen, ist es absolut sinnvoll, Portalsegen zu verwenden, weil du dann Deine weiße Magie bekommst. Problem gelöst[smilie--sprite2][BR]Elvarius schrieb:\t\t\tdu redest immer von dem was du im wiki liest ,du musst es mal machen um mitreden zu können oder ? die praxis zeigt den weg nicht nicht theorie\t\tZum Vergrößern anklicken....Das traurige ist ja, dass ich, obwohl ich nur die Informationen aus dem Wiki und dem Forum habe, es trotzdem besser weiß wie es geht als Du. Die Theorie zeigt dir, wie Du es machen musst, wenn Du es in der Praxis dann versemmelst, liegt es einzig und allein an dir und nicht an INNO oder irgendwelchen Programmieren ohen Verstand, die die Zahlen auswürfeln, andere Spieler in Kapitel 19 scheinen ja nicht solche Probleme zu haben."}, {"80": "Elvarius schrieb:\t\t\tpassen ja leider nur 9 ans portal oder ?also ohne segen  braucht man da nicht 1 jahr sondern 1 jahrzehnt .\t\tZum Vergrößern anklicken....[BR]Es passen 10 ans Portal. Plus 2 Straßen (eine normale und eine für Magische Kriegspfade. Und du kriegst das Kapitel problemlos in einem halben Jahr durch, wenn du dir ein paar Gedanken machst, welche Mittel du dafür brauchst. Und ja, Portalsegen und Zeitbooster gehören durchaus auch zu diesen Mitteln.[BR][BR]Ich weiß ja nicht, wie viele von den Portalsegen du im Lager hast. Bei mir reichen die jedenfalls dicke, egal wie viele ich davon ausgebe und wie viel oder wenig schwarze Magie ich dafür kriege."}, {"80": "OMcErnie schrieb:\t\t\tIch habe mein Portal auf Stufe 3, was auch die letzte Stufe ist, in der im Portal produziert werden kann.[BR]Das sind die Kosten für Ultimative Kreaturen.[BR]Anhang 27446 ansehen Anhang 27447 ansehenZum Vergrößern anklicken....[BR]Ich kriege 107 für die gleichen Kosten. Hummel auf 31, Produktionsbonus 182%. Das macht also einiges aus."}, {"80": "Nur so ein Beispiel für eine mögliche Strategie: bis man die Festung auf Stufe 2 ausbauen kann, benötigt man viel Zeit. Ich habe in dieser Zeit zuerst den Platz für 10 Türme und 10 Brutstätten Stufe 1 benutzt. Später habe ich reduziert auf 6 Türme, und mit dem zusätzlichen Platz habe ich die Brutstätten auf Stufe 2 genommen. Mit den Türmen habe ich die gesamten 72 Stück Schwarze Materie produziert. Danach habe ich alle Türme gelöscht und umgebaut von vertikaler Ausrichtung (Brutstätten oberhalb der Festung) zu horizontaler (rechts neben der Festung. Damit werde ich die 10 Brutstätten auf Stufe 4 ausbauen können mit dem minimal benötigten Platz.[BR][BR]Die 5. der mittleren Forschungen kriege ich morgen durch. Dann folgt die Forschung für den Ausbau der Brutstätten, und damit wird die Strategie aufgegangen sein. Der Rest ist Geduld und eine Forschung nach der anderen. Und Zeit, um die Manus auszubauen - der benötigte Platz ist dafür schon vorbereitet. Ich denke, im März, spätestens im April bin ich durch mit dem Kapitel. Mit komplett geleerten Lagern zwar, aber die füllen sich dann schon wieder."}, {"9": "Elvarius schrieb:\t\t\tpassen ja leider nur 9 ans portal\t\tZum Vergrößern anklicken....Nein, da gehen schon 10 ans Portal.[BR][BR][IMG]https://i.ibb.co/ZfpCxfY/https-de-forum-elvenar-com-index-php-attachments-1640771289226-png-27453.png[/IMG][BR][BR]Allerdings empfehle ich hier, dies zu tun, bevor man die Brutstatte auf Stufe 2 baut (bzw. die Quest 42 zu Erfüllen)[BR][BR][IMG]https://i.ibb.co/R4C8kbp/https-de-forum-elvenar-com-index-php-attachments-1640771409654-png-27454.png[/IMG][BR][BR]Wobei die Türme nicht zwingend am Portal stehen müssen.[BR]Sollte man Platznot haben (so wie ich ihn hatte), habe ich lediglich immer einen Turm am Portal gebaut und dann irgendwo hingestellt,[BR]denn sie müssen nicht zwingend am Portal stehen. Es langt aus, wenn sie in deiner Stadt aufgebaut stehen (wo ist egal).[BR][BR]Die Storyline an sich ist gut durchdacht, was die Aufgaben betrifft, denn sie sind bis jetzt alle gut lösbar/machbar.[BR]Lediglich die Texte (Geschichte) ist etwas eigen und gefällt mir gar nicht (bis jetzt).[BR][BR]Was die Mengen betrifft so ist es in der Tat viel und mMn völlig übertrieben, besonders der Mana-bedarf.[BR]Aber auch hier hat man ja Zeit und muss nicht alles sofort und in X-Facher Ausführung haben.[BR]Wenn man das möchte, z.B. 15 und mehr Brutstätte, dann kostet es eben. Es langen jedoch 10 für die Storyline.[BR]Mehr ist nur dann von Nöten, wenn du schneller voran kommen möchtest, doch für was?[BR]Um dann wieder 6 Monate auf eine neue Gast-Rasse zu warten? Na ja ist wohl Ansichtssache.[BR][BR]Klar ist es nicht gerade Spielfördernd, wenn man stets warten muss und festhängt, andererseits weiß man aber in diesem Kapitel, wie die Händler von Unur waren oder eben das Kapitel Teamgeist. Auch hier hing man, es sei denn man \"opferte\" Platz/Dias/Time-Booster etc.[BR][BR]Auch musst du die Türme des Lichts nicht einmal ausbauen, es langt wenn du sie aufbaust und sofort wieder Verkaufst (beim Turm des Lichts) um an die weiße Materie zu kommen (auch wenn ich das total Gaga finde, denn hier hätte man dann auch einfach die Güter verlangen können).[BR]Bei den Türmen der Dunkelheit, nimmst du entweder ein 2 Std. Zeit-Booster oder wartest eben die 2 Std. und machst im Prinzip den selben Vorgang. Du klickst den Ausbau auf Stufe 2 an und unmittelbar danach (noch im Bau) verkaufst du den Turm.[BR][BR]Die weiße sowie schwarze Magie gleicht sich aus, aber ich hatte das anfangs auch, dass bei mir schwarze Magie ins Nirvana flog.[BR]Mit den Ausbau der Brutstatten auf Stufe 4 und der Herstellung beider Kreaturen-Arten (Licht/Nacht) ist es jedoch sehr ausgewogen.[BR][BR]Generell sind lediglich die Mengen mMn zu Hoch, die Produktionszeiten und alles andere völlig i.O. wenn man mal von den Türmen und dessen Verkauf absieht."}, {"2": "AngelOfDead schrieb:\t\t\tWobei die Türme nicht zwingend am Portal stehen müssen.\t\tZum Vergrößern anklicken....[IMG]https://i.ibb.co/p2zzT5c/https-de-forum-elvenar-com-index-php-attachments-t-rmchen2-png-27455.png[/IMG]...der letzte ist auch gleich fertig und dann kann ich die Brutstätten ausbauen...(vorher Stormy füttern und schnell mal ein paar Hunderttausend Flugpulver prodden, welches ich dann geschwind in Aerosole tausche - muss bloß noch ein wenig Mana herbei zaubern)...."}, {"9": "Romilly schrieb:\t\t\t..der letzte ist auch gleich fertig und dann kann ich die Brutstätten ausbauen...(vorher Stormy füttern und schnell mal ein paar Hundert Flugpulver prodden, welches ich dann geschwind in Aerosole tausche - muss bloß noch ein wenig Mana herbei zaubern)....\t\tZum Vergrößern anklicken....So habe ich das auch gemacht, ergo..... ich habe diese Türme nicht ans Portal gestellt sondern lediglich die 10 gebaut und dann irgendwo hingestellt, damit ich eben die Quest erfüllen kann, denn Futter kann man immer brauchen und mich interessiert eben die Storyline/Geschichte."}, {"2": "[IMG]https://i.ibb.co/bdC3b82/https-de-forum-elvenar-com-index-php-attachments-t-rmchen4-png-27459.png[/IMG][BR][BR]....schwupps - 5 Brutstätten sind ausgebaut und in 2-3 Tagen werd ich die Straßen bauen können (für die Quest) und in ca. 7-10 Tagen dann die Festung ausbauen - in der Zwischenzeit kann ich das Mana für den Ausbau der anderen 5 Brutstätten ansammeln und weiterhin gemütlich Türmchen bauen für weitere schwarze Materie (hab jetzt 25), während ich an meiner Hummel arbeite...es läuft immer noch recht flüssig...(meine Mana/Saat-Bestände sind auch immer noch recht ordentlich)...[IMG]https://i.ibb.co/N2zZvnx/https-de-forum-elvenar-com-index-php-attachments-manasaat-png-27458.png[/IMG]...im Moment gibt es insgesamt nur 31 Gesuche nach Gut8 in Felyndral...."}, {"193": "Zu der Gastrasse selbst kann ich zwar nichts sagen, weil ich noch nicht so weit bin, aber ich muss sagen, dass der Markt bei den erweckten Gütern nach Erscheinen dieses Kapitels absolut belebt wurde. Selbst für Ladenhüter wie Elfenharz und Bismut kann man ** oder gar *** Sterne Handel ergattern. Ich konnte vorhin über 100k Platin gegen Elfenharz über ** und *** Sterne Angebote bekommen, das wäre vorher undenkbar gewesen. Insgesamt ist viel mehr Bewegung im Markt. [BR]Auf jeden Fall finde ich das super. Das Balancing in Bezug auf den Bedarf erweckter Güter scheint in diesem Kapitel gut geglückt zu sein."}, {"4": "Hazel Caballus schrieb:\t\t\tZu der Gastrasse selbst kann ich zwar nichts sagen, weil ich noch nicht so weit bin, aber ich muss sagen, dass der Markt bei den erweckten Gütern nach Erscheinen dieses Kapitels absolut belebt wurde. Selbst für Ladenhüter wie Elfenharz und Bismut kann man ** oder gar *** Sterne Handel ergattern. Ich konnte vorhin über 100k Platin gegen Elfenharz über ** und *** Sterne Angebote bekommen, das wäre vorher undenkbar gewesen. Insgesamt ist viel mehr Bewegung im Markt.[BR]Auf jeden Fall finde ich das super. Das Balancing in Bezug auf den Bedarf erweckter Güter scheint in diesem Kapitel gut geglückt zu sein.\t\tZum Vergrößern anklicken....ja, kann ich nur unterstreichen. Der Handel läuft wesentlich besser, es gibt mehr an Angeboten und Nachfrage.[BR][BR]Und seit Kapitel 19 läuft auch der Händler für die güter Kapitel 18 deutlich besser (bin erst Kapitel 18) als vorher."}, {"91": "Auch in Kapitel 18 war es so, dass man zum Ausbau der Zentren für Stufe 2 eine Ressource brauchte, für Stufe 3 die nächste und für Stufe 4 eine weitere. Die Entwickler hätten natürlich für jeden Ausbau alle Ressourcen gleichverteilt ansetzen können, das liegt auf der Hand. Dass sie es nicht getan haben kann man als Schikane deuten oder als Mittel zum Zweck: Spieldauer, unbequeme und fordernde Aufgaben, Lösungen entwickeln. Es gibt such Kapitel bzw. Phasen, wo überproportional Mana, Saat, Orks usw. gefordert werden. Diese Dysbalancen sind Herausforderungen, keine fehlerhaften Ungleichgewichte.Elvarius schrieb:\t\t\tlies doch mal richtig es ist sinnlos weil man die schwarzen verschwendet(also nicht bekommt weil voll) ! ja ich habe genug aber mit jedem benutzen verschwendet man sie eigentlich weil die abtsimmung zwischen schwarz und weiss nicht stimmt !\t\tZum Vergrößern anklicken...."}, {"194": "Ich kann mich einfach nicht anfreunden, was hier als Herausforderung gesehen wird. Wenn warten als solche gesehen wird von mir aus. Jedenfalls habe ich aufgrund des elenden Sammelns von weiß der Geier was, eigentlich kaum mehr Lust überhaupt eine neue Gastrasse zu beginnen."}, {"60": "Guten Abend und ein freundliches neues Jahr  [smilie--sprite1][BR][BR]Eine Frage zur Quest 42 (10 Türme und 10 Brutstätten gleichzeitig besitzen): Ist es egal, ob die Türme Licht oder Dunkelheit sind? Also kann man die mischen?[BR]Und noch eine Frage zur Quest 56 (Verkaufe 5 Türme des Lichts und der Dunkelheit - aus dem Italienischen übersetzt): Lautet die Quest wirklich so, ist das richtig übersetzt? Muss man wirklich je 5 Türme verkaufen?[BR][BR]Vielen Dank vorab für eure Antwort/en  [smilie--sprite1]"}, {"88": "ja ist egal welche Türme bei Quest 42, ist auch egal wo die stehen, wenn du Platzprobleme hast kannst du die auch sonstwo hinstellen, muß nicht am Portal sein, sie geben dann halt nur keine Magie[BR][BR]Und die andere Quest lautet im Deutschen verkaufe 5 Türme des Lichts oder der Dunkelheit, es reichen also auch 5 Lichttürme"}, {"60": "@Questor Thews vielen Dank für deine Antwort, das hilft mir ungemein bei meiner Planung.  [smilie--sprite1] [BR][BR]Das die Türme nicht am Portal stehen müssen, hatte ich schon weiter oben mitgenommen. [smilie--sprite2][BR][BR]Herzliche Grüße an Expect us [smilie--sprite1]"}, {"54": "Ich weiß zwar nicht, bei welcher Nr. der HQ ich gerade bin (züchte 500 ultimative Geschöpfe), aber ich bin gestern schon etwas zusammengezuckt,[BR]als plötzlich eine Aufgabe kam:[BR]produziere 4x schwarze Materie[BR][BR]Hatte nämlich schon zur Aufgabe mit den 10 Brutstätten/Türmen alle 72 schwarze produziert, damit ich keine Türme mehr benötige.[BR]reingefallen .. :-([BR][BR]Meine Frage nun:[BR][BR]Kommen noch mehr Aufgaben, wo man diese Türme benötigt ?[BR][BR][BR]mfG[BR]HdW[BR][BR]ps zu der Anmerkung eines mehrerer User, dass viele schnell fertig sein wollen und dann gelangweilt wieder auf eine neue Gastrasse warten:[BR][BR]Vielleicht bin ich da ne Ausnahme, aber ich finde es jedes mal entspannend und dem Spiel förderlich, auch längere Zeit mal keine Gastrassen-Aufgaben bedienen zu müssen.[BR]Es gibt immer etwas zu tun ...[BR]Monatelang immer wieder die gleichen Recourcen abzugeben, um in der Forschung weiter zu kommen ist mir irgendwann einfach zu langweilig ...[BR]Es gibt sogar Leute, die wochenlang einen riesigen Platz freilassen, weil irgendwann dann ja wieder eine neue Gastrasse (ok, inzwischen \"nur\" Kapitel) kommt - hm, werd ich nie verstehn ..."}]