[{"87": "HerrderWelten schrieb:\t\t\tKommen noch mehr Aufgaben, wo man diese Türme benötigt ?\t\tZum Vergrößern anklicken....Ja: \"Verkaufe 5 Türme des Lichts und Dunkelheit.\". [BR]Die Quests findest Du auf der italienischen Fanseite Knights of the Zombie - Revenge of the Outcast. Oben rechts ist der Google-Übersetzer. Ich lasse mir das auf Englisch übersetzen, ist besser als die deutsche Übersetzung. "}, {"54": "Cruller schrieb:Ja: \"Verkaufe 5 Türme des Lichts und Dunkelheit.\". [BR]Die Quests findest Du auf der italienischen Fanseite Knights of the Zombie - Revenge of the Outcast. Oben rechts ist der Google-Übersetzer. Ich lasse mir das auf Englisch übersetzen, ist besser als die deutsche Übersetzung. Zum Vergrößern anklicken....ach Mist ...[BR]soweit ich hier aber gelesen hab, kann man kurz 5 Türme aufstellen und dann sofort (ohne Ausbau) wieder abreissen, richtig ?[BR]oder muss man die 5 weißen ausreifen lassen ?[BR][BR]edit:[BR][BR]ok, habe eben die Aufgabe bekommen und ausprobiert:[BR]man muss lediglich 5 weiße aufstellen und dann direkt wieder abreissen, ohne die 2h warten zu müssen.[BR][BR]Ist also effektiver und besser, mit der weißen/schwarzen Materie für den Portal-Ausbau bis zu dieser letzten HQ zu warten, die die Türme betrifft.[BR][BR]Nun bin ich die endlich los - nach reichlich Lehrgeld bezahlt ... (und 4 schwarze und 5 weiße Materie zu viel hergestellt ...)[BR][BR]HdW"}, {"1": "HerrderWelten schrieb:\t\t\tps zu der Anmerkung eines mehrerer User, dass viele schnell fertig sein wollen und dann gelangweilt wieder auf eine neue Gastrasse warten:[BR][BR]Vielleicht bin ich da ne Ausnahme, aber ich finde es jedes mal entspannend und dem Spiel förderlich, auch längere Zeit mal keine Gastrassen-Aufgaben bedienen zu müssen.[BR]Es gibt immer etwas zu tun ...[BR]Monatelang immer wieder die gleichen Recourcen abzugeben, um in der Forschung weiter zu kommen ist mir irgendwann einfach zu langweilig ...[BR]Es gibt sogar Leute, die wochenlang einen riesigen Platz freilassen, weil irgendwann dann ja wieder eine neue Gastrasse (ok, inzwischen \"nur\" Kapitel) kommt - hm, werd ich nie verstehn ...\t\tZum Vergrößern anklicken....Aber wenn gerade kein aktuelles Kapitel da ist, dann ist es doch auch nichts anderes, als das man Ressourcen einsammelt. Wo ist denn der Unterschied? Also, wenn ein neues Kapitel da ist, hat man eben noch eine zusätzliche Aufgabe. Und es ist doch im Sinne des Spiels, wenn es nicht stehen bleibt sondern neue Aufgaben, in Form eines neuen Kapitels, hinzukommen."}, {"6": "Tacheless schrieb:\t\t\tWo ist denn der Unterschied?\t\tZum Vergrößern anklicken....Der Unterschied sind die Gastrassenresourcen. Darüber sollte man sich mal Gedanken machen.[BR][BR]Brutstätte auf 4 mit Blühender Händlergilde auf 26 erzeugt alle 6 Stunden 254 Kreaturen des Lichts oder 388 Kreaturen der Nacht.[BR][BR]Allein die letzten 4 Forschungsfelder, die Gastrassenresourcen verwenden, verlangen[BR][BR]150 000 Kreaturen des Lichts plus[BR]260 000 Kreaturen der Nacht.[BR][BR]Hinzu kommen die Ultimativen Kreaturen, in der Festung alle 3 Stunden 102 Stück, erzeugt u.a. mit 660 Kreaturen des Lichts oder 1000 Kreaturen der Nacht. Besagte 4 Forschungsfelder plus Ausbau der Festung auf 4:[BR][BR]22900 Ultimative Kreaturen, die entweder 148 170 Kreaturen des Lichts oder 224 500 Kreaturen der Nacht benötigen.[BR][BR]Kannst ja mal einen Taschenrechner nehmen und die Produktionszeiten bei z.B. 12 Brutstätten ausrechnen.[BR]Das würde ich dann mal - nett ausgedrückt - als langwieriges Sammeln der immer gleichen Resourcen nennen. [smilie--sprite2][BR][BR]Edit:[BR]Rechenfehler korrigiert."}, {"9": "HerrderWelten schrieb:\t\t\tproduziere 4x schwarze Materie\t\tZum Vergrößern anklicken....Das war oder du befindest dich bei der Quest-Aufgabe 53[BR][IMG]https://i.ibb.co/VHNj4ks/https-de-forum-elvenar-com-index-php-attachments-1641407404498-png-27497.png[/IMG][BR][BR]ustoni schrieb:\t\t\tDer Unterschied sind die Gastrassenresourcen. Darüber sollte man sich mal Gedanken machen.[BR][BR]Brutstätte auf 4 mit Blühender Händlergilde auf 26 erzeugt alle 6 Stunden 254 Kreaturen des Lichts oder 388 Kreaturen der Nacht.[BR][BR]Allein die letzten 4 Forschungsfelder, die Gastrassenresourcen verwenden, verlangen[BR][BR]150 000 Kreaturen des Lichts plus[BR]260 000 Kreaturen der Nacht.[BR][BR]Hinzu kommen die Ultimativen Kreaturen, in der Festung alle 3 Stunden 102 Stück, erzeugt u.a. mit 660 Kreaturen des Lichts oder 1000 Kreaturen der Nacht. Besagte 4 Forschungsfelder plus Ausbau der Festung auf 4:[BR][BR]22900 Ultimative Kreaturen, die entweder 15 114 000 Kreaturen des Lichts oder 22 900 000 Kreaturen der Nacht benötigen.[BR][BR]Kannst ja mal einen Taschenrechner nehmen und die Produktionszeiten bei z.B. 12 Brutstätten ausrechnen.[BR]Das würde ich dann mal - nett ausgedrückt - als langwieriges Sammeln der immer gleichen Resourcen nennen. [smilie--sprite2]Zum Vergrößern anklicken....Ganz wichtig ..... dazu kommt, dass dann keiner mehr weiß, was die Story eigentl. für eine Rolle spielt, denn du schließt ab und wartest dann und wartest und wartest und wartest und wartest und wartest und wenn du es dann letztendlich hast, sammelst du exakt den selben Brei von vorne."}, {"54": "Tacheless schrieb:\t\t\tAber wenn gerade kein aktuelles Kapitel da ist, dann ist es doch auch nichts anderes, als das man Ressourcen einsammelt. Wo ist denn der Unterschied? Also, wenn ein neues Kapitel da ist, hat man eben noch eine zusätzliche Aufgabe. Und es ist doch im Sinne des Spiels, wenn es nicht stehen bleibt sondern neue Aufgaben, in Form eines neuen Kapitels, hinzukommen.\t\tZum Vergrößern anklicken....[BR]Kann man so oder so sehen, Tacheless ...[BR][BR]Für mich bleibt das Spiel auch nicht \"stehen\", wenn mal kein aktuelles Kapitel am Start ist.[BR][BR]Ich baue Stück für Stück zB dann meine Manus aus, für die während des laufenden Kapitels nicht genügend Platz ist,[BR]baue neue auf/aus und schiebe die dann zur Vorbereitung ins Lager,[BR]kann endlich mal wieder genug Güter produzieren, da ich meine neu ausgebauten Manus aufstellen kann, die ja während des Kapitels[BR]zum großen Teil den GR-Gebäuden weichen müssen,[BR]kann mal wieder schön ein GA spielen,[BR]kann meine Stadt neu konzipieren, umbauen, neuen Look geben, usw[BR][BR]Das alles mache ich auch sehr gerne und gehört für mich ebenfalls zum \"Sinne\" des Spieles.[BR]Ich liebe halt die Abwechslung, nicht den stereotypen \"Dauermodus\".[BR][BR]HdW"}, {"9": "HerrderWelten schrieb:\t\t\tDas alles mache ich auch sehr gerne und gehört für mich ebenfalls zum \"Sinne\" des Spieles.[BR]Ich liebe halt die Abwechslung, nicht den stereotypen \"Dauermodus\".\t\tZum Vergrößern anklicken....Sehe ich ebenso. Da waren ja die Händler von Unur schon ein Kraus und die Abzeichen beim Teamgeist, aber diese Kreaturen übertreffen alles bisher dagewesene. Das ist eine ewige Dauersammelbaustelle die nicht gerade Spaß macht noch motiviert das oder sonst was."}, {"2": "ustoni schrieb:\t\t\t22900 Ultimative Kreaturen, die entweder 15 114 000 Kreaturen des Lichts oder 22 900 000 Kreaturen der Nacht benötigen.\t\tZum Vergrößern anklicken.......also ich zähle nur 16000 Ultimative in den letzten 4 Forschungen (eigentlich ja 3)...wo hast du die Zahl 900 her? find da nur 1000er-Angaben...[BR][BR]Edit - du hast + Ausbau geschrieben...[BR][BR]...du hast trotzdem nen fatalen Rechenfehler drin: du kannst mit 1000 Kreaturen der Nacht ja 102 Ultimative herstellen und nicht bloß 1 - also brauchst du nicht knappe 23 Millionen sondern \"nur\" 224.510...und das sind dann ca. 16 Tage mit 12 Brutstätten auf Level 4 (388 alle 6 Std.)"}, {"1": "Im Grunde sollte dann also erst ein neues Kapitel starten, wenn man mit seinem Auf/Ausbau fertig ist. Das gilt ja dann für alle. Also darf es nie wieder ein neues Kapitel geben oder es dürfen keine neue Spieler anfangen...[BR][BR]Ich würde euer Problem echt gerne verstehen. Aber ich verstehe nicht, wie ein neues Kapitel einem im Spiel stören kann. Wenn man noch nicht fertig ist mit dem Ausbau, dann wartet man halt einfach, wenn einem das wichtig ist.[BR][BR]Über die Mengen, die gefordert werden: Es wird nun mal mit Kapitel zu Kapitel mehr. Es wird immer herausfordernder. So wie in so ziemlich jedem Spiel auch. Ich meine, selbst in irgendeinem PC-Spiel, bei dem man was weiss ich tut, kämpfen in Allianzen, irgendwas aufbauen oder erkunden, da wird es doch auch immer anspruchsvoller, umso weiter man kommt. Aber vielleicht spiele ich auch nur die \"falschen\" Spiele, keine Ahnung."}, {"9": "Tacheless schrieb:\t\t\tIm Grunde sollte dann also erst ein neues Kapitel starten, wenn man mit seinem Auf/Ausbau fertig ist. Das gilt ja dann für alle. Also darf es nie wieder ein neues Kapitel geben oder es dürfen keine neue Spieler anfangen...\t\tZum Vergrößern anklicken....Nein, dann wenn es ausreichend auf dem Beta gespielt/getestet haben und ihr Feedback abgegeben haben, denn in 14 Tagen hat das Kapitel keiner wirklich gespielt um ausreichend Feedback abzugeben. So kommen neue GRs 14 Tage nach erscheinen auf die Live-Server und das wo man doch Feedback möchte.[BR]Tacheless schrieb:\t\t\tÜber die Mengen, die gefordert werden: Es wird nun mal mit Kapitel zu Kapitel mehr. Es wird immer herausfordernder. So wie in so ziemlich jedem Spiel auch. Ich meine, selbst in irgendeinem PC-Spiel, bei dem man was weiss ich tut, kämpfen in Allianzen, irgendwas aufbauen oder erkunden, da wird es doch auch immer anspruchsvoller, umso weiter man kommt. Aber vielleicht spiele ich auch nur die \"falschen\" Spiele, keine Ahnung.\t\tZum Vergrößern anklicken....Da stimme ich dir 100% zu, hier jedoch dauert es nicht nur länger sondern es ist stets das selbe, es ist keine Abwechslung vorhanden, du sammelst einfach und sammelst und sammelst und sammelst, wo ist das Herausfordernd oder wo muss man sich da anstrengen, überlegen oder nachdenken.[BR]Aufbauen-sammeln-sammeln-sammeln-irgendwann genervt und fertig, das ist alles."}, {"6": "Romilly schrieb:\t\t\t...du hast trotzdem nen fatalen Rechenfehler drin: du kannst mit 1000 Kreaturen der Nacht ja 102 Ultimative herstellen - also brauchst du nicht knappe 23 Millionen sondern \"nur\" 224.510...\t\tZum Vergrößern anklicken....Danke! Genau diesen Denkfehler hab ich gesucht. [smilie--sprite8] [smilie--sprite11] Die Zahl kam mir gleich viel zu hoch vor, eine ca. Verdoppelung schien mir logisch. Aber manchmal steht man echt richtig auf dem Schlauch und sieht den Wald vor Bäumen nicht. [smilie--sprite1][BR][BR]Romilly schrieb:\t\t\t...also ich zähle nur 16000 Ultimative in den letzten 4 Forschungen (eigentlich ja 3)...wo hast du die Zahl 900 her? find da nur 1000er-Angaben...\t\tZum Vergrößern anklicken....Für das letzte Forschungsfeld muss die Festung auf 4 ausgebaut werden. Das kostet nochmal 6900 Ultimative Kreaturen für den Ausbau. Also 22900.[BR][BR]Tacheless schrieb:\t\t\tAber ich verstehe nicht, wie ein neues Kapitel einem im Spiel stören kann.\t\tZum Vergrößern anklicken....Tut es ja nicht, sonst hätte ich ja längst aufgehört. [smilie--sprite2][BR]Tacheless schrieb:\t\t\tEs wird nun mal mit Kapitel zu Kapitel mehr. Es wird immer herausfordernder.\t\tZum Vergrößern anklicken....Da haben wir zwei wohl ein anderes Verständnis für den Begriff \"Herausforderung\". Stumpfes Einsammeln einer Unmenge identischer Resourcen würde ich eher als \"Beschäftigungstherapie\" bezeichnen.[BR]Lasst euch doch bitte mal etwas einfallen, das wirklich eine Herausforderung darstellt. Es soll ja eben nicht leicht sein, schön wäre es aber, wenn man dabei etwas denken müsste. [smilie--sprite2]"}, {"2": "ustoni schrieb:\t\t\tDanke! Genau diesen Denkfehler hab ich gesucht. [smilie--sprite8] [smilie--sprite11] Die Zahl kam mir gleich viel zu hoch vor, eine ca. Verdoppelung schien mir logisch. Aber manchmal steht man echt richtig auf dem Schlauch und sieht den Wald vor Bäumen nicht. [smilie--sprite1]Zum Vergrößern anklicken.......die war schon ein wenig arg hoch ^^ - hätte dann über 4 Jahre gedauert  [smilie--sprite7] [smilie--sprite7] [smilie--sprite7] ..."}, {"54": "Die neue Kapitel stören nicht, sie sind einfach nur zu stupide ...[BR][BR]Von mir aus bräuchten auch nicht neue, ins uferlos gehende Kapitel zu kommen, sondern vielleicht einfach mehr \"KLeine\" mit jeweils anderen Anforderungen, damit man im Spiel eine Abwechslung spürt. [BR][BR]Allerdings gibt es ja auch mindestens eine Spielerin, die schon durch ist ...[BR][BR]HdW"}, {"6": "Romilly schrieb:\t\t\t...die war schon ein wenig arg hoch ^^ - hätte dann über 4 Jahre gedauert [smilie--sprite7] [smilie--sprite7] [smilie--sprite7] ...\t\tZum Vergrößern anklicken....Jepp. [smilie--sprite8][BR]Ich hab während meiner Berufszeit eine Menge Testprogramme für Prüfautomaten geschrieben. Es sind auch bei der Softwareerstellung ausgerechnet meist die einfachen logischen Fehler, die am schwierigsten zu finden sind.[BR]Ich denke, die Programmierer von Inno werden da ein Lied von singen können. [smilie--sprite1]"}, {"2": "ustoni schrieb:\t\t\tJepp. [smilie--sprite8][BR]Ich hab während meiner Berufszeit eine Menge Testprogramme für Prüfautomaten geschrieben. Es sind auch bei der Softwareerstellung ausgerechnet meist die einfachen logischen Fehler, die am schwierigsten zu finden sind.[BR]Ich denke, die Programmierer von Inno werden da ein Lied von singen können. [smilie--sprite1]Zum Vergrößern anklicken.......naja \"Fehler erkennen\" und \"Fehler definieren\" sind 2 verschiedene Paar Schuhe..."}, {"195": "Für mich ist jedes Kapitel eine Herausforderung in den unterschiedlichsten Bereichen.[BR][BR]Die Rache der Verbannten macht mir bis jetzt  Spaß, ich habe viele Managebäude und Saatengebäude aufgestellt  und lasse meinen \"Überragenden Händler\" nur Unurium produzieren, das läuft ganz gut.[BR]Für mich liegt die Herausforderung im Ausbauen und Unterbringen von vielen Brutstätten.[BR]Den \"Tempel der Geister\" habe ich aufgestellt, werde ihn aber nicht ausbauen, ich warte da auf den \"Segelturm\".[BR]Das Sammeln der Gastrassengüter finde ich mit 6 h moderat.[BR]Für mich sind die Gastrassen nicht öde, nur oft eine Herausforderung an meine Geduld.[BR][BR]Das ist mein Weg, einer von vielen, ich erhebe keinen Anspruch auf Richtigkeit, Perfektion oder Einmaligkeit."}, {"54": "Noti4060 schrieb:Für mich ist jedes Kapitel eine Herausforderung in den unterschiedlichsten Bereichen.[BR][BR]Die Rache der Verbannten macht mir bis jetzt  Spaß, ich habe viele Managebäude und Saatengebäude aufgestellt  und lasse meinen \"Überragenden Händler\" nur Unurium produzieren, das läuft ganz gut.[BR]Für mich liegt die Herausforderung im Ausbauen und Unterbringen von vielen Brutstätten.[BR]Den \"Tempel der Geister\" habe ich aufgestellt, werde ihn aber nicht ausbauen, ich warte da auf den \"Segelturm\".[BR]Das Sammeln der Gastrassengüter finde ich mit 6 h moderat.[BR]Für mich sind die Gastrassen nicht öde, nur oft eine Herausforderung an meine Geduld.[BR][BR]Das ist mein Weg, einer von vielen, ich erhebe keinen Anspruch auf Richtigkeit, Perfektion oder Einmaligkeit.Zum Vergrößern anklicken....[BR]Unterschreibe ich - fast - alles, bis auf den Unterschied zwischen \"öde\" und \"Gerausforderung an meine Geduld\"[BR][BR]da liegt für mich der Grenzbereich, wenn es einfach \"nur\" Geduld erfordert, monatelang immer das Gleiche zu tun,[BR]bis man alles zusammen hat, ist das für mich öde ...[BR][BR]Klar, man kann ja mal ein paar Tage, 2-3 Wochen notfalls auf etwas warten, aber monatelang immer die gleichen Abläufe erledigen ist für mich nicht wirklich ein tolles Spielerlebnis ...[BR][BR]HdW"}, {"1": "Wenn kein neues Kapitel da ist, macht ihr dann groß was anderes als Güter produzieren, einsammeln. Turnier, Turm, ausbauen? Ich scheine echt ein anderes Spiel zu spielen...^^"}, {"112": "die stadt umbauen, optimieren, schöner machen, das mache ich wenn ich nach einer gast-rasse den platz habe. das sammeln ist auch immer da aber steht dann nicht mehr im vordergrund. und vor allem - nicht jede 15 min ... (kap.17)"}, {"6": "Tacheless schrieb:\t\t\tIch scheine echt ein anderes Spiel zu spielen...^^\t\tZum Vergrößern anklicken....Das scheint mir auch so - zumindest wenn Du wirklich keinen Unterschied sehen solltest. [smilie--sprite2]"}]