[{"19": "Ich finde die Gastrasse sehr nett !  [smilie--sprite1] [BR][BR]Die Gastrasse läuft bei mir – wie immer - so NEBENBEI mit [BR][BR]Man macht sich natürlich immer seine Gedanken darüber,[BR]wie man seine Stadt optimiert und baut sie dementsprechend um[BR][BR]Über Schnelligkeit mache ich mir keine Gedanken – da entstehen nur Probleme [smilie--sprite2][BR][BR]Selbst wenn im Forschungsbaum mal nichts mehr geht,[BR]dann freue ich mich darüber – und meine Wunder freuen sich auch[BR][BR]Somit passt man seine Stadt wieder den entsprechenden Verhältnissen an[BR][BR]Händlergilde auf Stufe 27 geht bald auf Stufe 28[BR]Dann produziert die Gastrasse wieder ETWAS mehr[BR][BR]Tempel der Geister auf Stufe 11 – sollte reichen[BR]Da nach dem Event gleich wieder ein Event kommt und als regelmäßiger \"Turmflitzer\" –[BR]sollte Unurium auch nicht ausgehen[BR][BR]Man verbessert sich da ein wenig – dann dort ein wenig – und schon läuft es besser[BR]Und irgendwann – siehe da – ist man mit dem Kapitel durch [smilie--sprite1][BR]Dauert eben nicht mehr 1 Monat wie früher - sondern - Kapitel für Kapitel \"etwas länger\" [BR][BR]Na und - bin da ganz entspannt !!! [BR]Habe Zeit [smilie--sprite6]"}, {"58": "neue Gastrasse - ja okay, ich will ja weiter kommen, aber Spaß? Es hat wirklich viel mit warten zu tun, das ist eigentlich auch nicht das Problem, warten hat aber nichts mit Spaß zu tun.[BR]Was micht stört, dass einiges an Platz in dieser Zeit nicht zur Verfügung steht, den ich gern für andere Sachen nutzen würde. Ich hab soviel schöne Eventgebäude im Gepäck, die ich gern aufstellen würde, auch mal wechseln, öfter umbauen, aber geht nicht, kein Platz und wenn dann irgendwann doch Platz ist, sind sie definitiv nicht mehr effizient. Ich sag nur schade um die viele Mühe, die sich die Designer machen.[BR]Danach, nach Effizienz, hab ich meine Stadt eh nicht gebaut, zuviel Straßen, zuviel grün....Hat halt jeder so seine Vorlieben, aber solange die Gastrasse läuft und die läuft lange, kann ich das vergessen. [BR]Ich baue gern an meiner Stadt, das kann ich während der Gastrasse nicht, und das ist es, was mich stört"}, {"2": "Haseli schrieb:\t\t\tIch baue gern an meiner Stadt, das kann ich während der Gastrasse nicht, und das ist es, was mich stört\t\tZum Vergrößern anklicken.......wieso nicht? Ich hab für Kapitel 19 fast alles ausgebaut, was ging - mehr Arbeiter/mehr verbrauchte Kultur ergeben auch mehr Unurium - wieso also warten, bis das Kapitel um ist?..."}, {"58": "ne, ich meine damit mal neue Gebäude aufstellen, andere Optik, die \"verschimmeln\" im Inventar,  kein Platz dafür, wenn die Gastrasse irgendwann fertig werden soll"}, {"2": "Haseli schrieb:\t\t\tne, ich meine damit mal neue Gebäude aufstellen, andere Optik, die \"verschimmeln\" im Inventar,  kein Platz dafür, wenn die Gastrasse irgendwann fertig werden soll\t\tZum Vergrößern anklicken.......naja - du hast schon recht viele Straßen - da wär schon mehr Platz da...alles zusammen geht halt nicht..."}, {"58": "hatte ich oben schon geschrieben, daß ich viel Straßen und grün hab, da können wir jedes einzelne wort nochmal durch diskutieren, es ist meine persönliche meinung, dass ich den platz über den relativ langen zeitraum gern anders nutzen würde, auch für straßen, alles geht nicht, stimmt, also gastrasse, aber gefallen muss mir das nicht"}, {"188": "Wenn Du zu wenig Platz hast, um Eventgebäude aufzustellen, dafür aber sehr viel Platz verwendest, um Straßen hinzustellen, ist es erstmal naheliegend, Straßen effizienter zu bauen, damit Du mehr Platz für Eventgenbäude hast. Wenn Du Deine Straßen aber behalten willst, sind die wohl wichtiger als die Eventgebäude. Dafür, dass Du so viele Straßen baust und dann kein Platz mehr für Eventgebäude hast, ist dann aber nicht die Gastrasse schuld.[smilie--sprite2]"}, {"58": "1. es geht mir um Optik und dazu gehören für mich auch Straßen u.a.[BR]2. das ist meine Spielweise[BR]3. es geht nicht um Schuld oder Schuldzuweisungen[BR]4. es war ein Versuch hier meine Meinung zu schildern, was so schnell nicht wieder passieren wird[BR]5. ich geb auf...."}, {"188": "Wen Du hier Probleme schilderst, gehst Du das Risiko ein, dass manche Leute auf die Idee kommen, Dir helfen zu wollen... ganz schlimm sowas[smilie--sprite10]"}, {"196": "Hallo zusammen,[BR]heute erstmal im Markt gesehen: 3 Sterne und 1 Stern bei erleuchtete Güter?!?!? [BR]Wie ist das möglich?!?!? Ich dachte die Mengen sind fest, man könnte die nicht ändern."}, {"6": "ella66 schrieb:\t\t\tWie ist das möglich?!?!?\t\tZum Vergrößern anklicken....Dafür dürfte wohl der nächtliche Zerfall verantwortlich sein. Die so entstehenden \"krummen\" Werte werden auf eine ganze Zahl gerundet.[BR]Dadurch kann es zu Abweichungen von +/- 1 erleuchtetes Gut kommen.[BR]Das Sternesystem interpretiert das dann als 3 bzw. 1 Sterne.[BR][BR]In der Praxis macht eine Abweichung von 1 erleuchteten Gut natürlich keinen spürbaren Unterschied. Die Sternebewertung bei erleuchteten Gütern kann man also getrost ignorieren."}, {"2": "ustoni schrieb:\t\t\tDafür dürfte wohl der nächtliche Zerfall verantwortlich sein. Die so entstehenden \"krummen\" Werte werden auf eine ganze Zahl gerundet.[BR]Dadurch kann es zu Abweichungen von +/- 1 erleuchtetes Gut kommen.[BR]Das Sternesystem interpretiert das dann als 3 bzw. 1 Sterne.[BR][BR]In der Praxis macht eine Abweichung von 1 erleuchteten Gut natürlich keinen spürbaren Unterschied. Die Sternebewertung bei erleuchteten Gütern kann man also getrost ignorieren.\t\tZum Vergrößern anklicken.......das betrifft auch eigentlich nur die Kreuzhandel, da hier unterschiedliche Mengen zerfallen/gerundet werden..."}, {"196": "ustoni schrieb:\t\t\tDafür dürfte wohl der nächtliche Zerfall verantwortlich sein. Die so entstehenden \"krummen\" Werte werden auf eine ganze Zahl gerundet.[BR]Dadurch kann es zu Abweichungen von +/- 1 erleuchtetes Gut kommen.[BR]Das Sternesystem interpretiert das dann als 3 bzw. 1 Sterne.[BR][BR]In der Praxis macht eine Abweichung von 1 erleuchteten Gut natürlich keinen spürbaren Unterschied. Die Sternebewertung bei erleuchteten Gütern kann man also getrost ignorieren.\t\tZum Vergrößern anklicken....Wenn so wäre, warum passiert bei Erweckte Güter so etwas nicht?[BR]Heute ist erstmal passiert, und Kapitel 19 läuft schon seit einiger Zeit.[BR]Es gibt 3 Sterne auch bei Kürzlich hinzugefügtes Angebote."}, {"2": "ella66 schrieb:\t\t\tEs gibt 3 Sterne auch bei Kürzlich hinzugefügtes Angebote.\t\tZum Vergrößern anklicken.......das ist allerdings nicht kürzlich hinzugefügt (fehlerhafte Anzeige) - kuck dir mal die Laufzeit an - solche Mengen kann man auch gar nicht einstellen - geht nur mit 2000, 2200 und dann kommt ein Sprung auf 4600 (gegen 6900 im Kreuzhandel)...[BR][BR]P.S: falls du Flugpulver oder Mineralien in Fely brauchst - schreib mich einfach mal an... [smilie--sprite2] [BR][BR]...also bei mir tritt dieses Phänomen schon seit längerer Zeit auf - ich würde diesen Kreuzhandel aber so oder so nicht annehmen...."}, {"197": "Hallo, [BR]gibt es denn schon 3 eine Liste mit den Quests auf Deutsch?[BR][BR]Wäre dankbar für eine Info, wo ich die finden könnte. Danke im Voraus."}, {"90": "Cavalieri dello Zombiaco: La vendetta dell'Esiliato - capitolo XIX [BR]Hier kannst du die volle questliste ansehen, und die sprache wie sie dir angezeigt werden soll kannst du selbst bestimmen."}, {"197": "Danke für die Info und noch einen schönen Abend."}, {"76": "Söldnerlager: [BR]Stimmt es, dass die Quest Söldnerlager auf STufe 24 nicht ablehnbar ist?"}, {"9": "juttaloewe schrieb:\t\t\tSöldnerlager:[BR]Stimmt es, dass die Quest Söldnerlager auf STufe 24 nicht ablehnbar ist?\t\tZum Vergrößern anklicken....Doch sie ist ablehnbar. [smilie--sprite2][BR][BR][IMG]https://i.ibb.co/Z6Jv0gy/https-de-forum-elvenar-com-index-php-attachments-1642168389132-png-27594.png[/IMG]"}, {"76": "oh super! vielen Dank! das ist eine Erleichterung [smilie--sprite1][BR]Gibt es eine aktuelle Liste der Quests? Auf der italienischen Seite wird das noch als nicht ablehnbar dargestellt."}]