[{"48": "Ich habe gerade die Quest \"Sammel 100 K Faulpilze.\" bekommen.[BR]Habe also 100 K Faulpilze durch Tausch gesammelt. Das nützt nichts. Die Quest ist nicht erfüllt.[BR]Jetzt meine Frage 1[BR]War es bei allen so, dass sie 100 K eines Gutes produzieren sollen, für das kein Bonus vorliegt ?[BR]Wenn Frage 1 zutrifft lautet Frage 2[BR]Habt ihr den Schuss nicht gehört, als ihr dieses bescheuerte Kapitel geplant habt?[BR]Sonst lautet Frage 2[BR]Gebt mir die Quest als gelöst. Denn ich habe 100 K Faulpilze durch Tausch gesammelt.[BR]Zante Edit sagt: Der 100k Tausch war von mir eingestellt. Bei der Annahme durch den Mitspieler war ich nicht on. Nun habe ich versucht einen Handel aus dem Markt anzunehmen[BR]Damit wurde der Zähler weiter gesetzt. Das hat also funktioniert. Also hat da anscheinend jemand Mist beim programieren gemacht?[BR]GEBT mir die Quest als gelöst!"}, {"87": "j.fili schrieb:\t\t\tHabe also 100 K Faulpilze durch Tausch gesammelt. Das nützt nichts. Die Quest ist nicht erfüllt.\t\tZum Vergrößern anklicken....[smilie--sprite1] Das würde ich dem Support melden. Die können in Deine Logs schauen und sehen, was da schiefgelaufen ist. "}, {"17": "mmh musst du die nicht einzahlen sprich an dem Balken ist ein grünes Plus?"}, {"48": "stone2345 schrieb:\t\t\tmmh musst du die nicht einzahlen sprich an dem Balken ist ein grünes Plus?\t\tZum Vergrößern anklicken....Nein. Sonst hätte ja der Tausch aus dem Markt nicht geklappt.[smilie--sprite2][BR]Cruller schrieb:\t\t\tDas würde ich dem Support melden. Die können in Deine Logs schauen und sehen, was da schiefgelaufen ist.\t\tZum Vergrößern anklicken....Das habe ich nach Tantes Edits Versuch getan. Ich war auch ein ganz klein wenig netter.[smilie--sprite7]"}, {"12": "j.fili schrieb:\t\t\tIch habe gerade die Quest \"Sammel 100 K Faulpilze.\" bekommen.[BR]Habe also 100 K Faulpilze durch Tausch gesammelt. Das nützt nichts. Die Quest ist nicht erfüllt.\t\tZum Vergrößern anklicken....-also Faulpilze produzier ich ja selber; aber ich hab Spaßseife und Bismut auf dem Markt eingetauscht, und die haben für die quests gezählt."}, {"198": "Ich habe das selbe Problem... mir wurde von supersupporter Pa... geantwortet das ich in den sauren Apfel beißen solle und die Pilze produzieren muss... das sind bei angenommen 1000 Pilzen pro Produktion und 2 x online gehen 50 Tage um dasquest zu erledigen, das ist so sinnlos... Übrigens wurde mein letzter Beitrag zu diesen thema gelöscht, weil sich ein suppoerter beleidigt fühlte weil ich ihn supersupporter nannte..."}, {"55": "Mutiger Goblin schrieb:\t\t\tIch habe das selbe Problem... mir wurde von supersupporter Pa... geantwortet das ich in den sauren Apfel beißen solle und die Pilze produzieren muss... das sind bei angenommen 1000 Pilzen pro Produktion und 2 x online gehen 50 Tage um dasquest zu erledigen, das ist so sinnlos... Übrigens wurde mein letzter Beitrag zu diesen thema gelöscht, weil sich ein suppoerter beleidigt fühlte weil ich ihn supersupporter nannte...\t\tZum Vergrößern anklicken....[BR][BR][BR]nachdem du ein Reelogg durchgeführt hast, oder du deine Welt aktualsiert hast,[BR]wird dein Gütertausch endlich angezeigt und die Quest wird als erledig angezeigt."}, {"198": "Anstandshalber antworte ich hier jetzt nicht ehrlich..."}, {"190": "Was verbessert sich durch den Ausbau?"}, {"2": "Alriel schrieb:\t\t\tWas verbessert sich durch den Ausbau?\t\tZum Vergrößern anklicken.......eigentlich nichts - aber du musst anschließend die Festung verkaufen und bekommst für den Verkauf wieder etwas, was du für die letzte Forschung brauchst - du kannst die Forschung für den letzten Ausbau der Festung aber sowieso erst ganz am Schluß erledigen (ist die vorletzte Forschung)..."}, {"48": "Alriel schrieb:\t\t\tWas verbessert sich durch den Ausbau?\t\tZum Vergrößern anklicken....Romilly schrieb:\t\t\t...eigentlich nichts - aber du musst anschließend die Festung verkaufen und bekommst für den Verkauf wieder etwas, was du für die letzte Forschung brauchst - du kannst die Forschung für den letzten Ausbau der Festung aber sowieso erst ganz am Schluß erledigen (ist die vorletzte Forschung)...\t\tZum Vergrößern anklicken....Die Festung der Rache wird scheinbar auch im nächsten Kapitel  benötigt. Dafür wird der Ausbau in der vorletzten Forschung nötig sein, auch wenn dieser keine Vorteile in Kapitel 19 bringt."}, {"12": "j.fili schrieb:\t\t\tDie Festung der Rache wird scheinbar auch im nächsten Kapitel benötigt. Dafür wird der Ausbau in der vorletzten Forschung nötig sein, auch wenn dieser keine Vorteile in Kapitel 19 bringt.\t\tZum Vergrößern anklicken....Ich hätte gedacht, man muß die Festung auf Stufe 4 verkaufen, um die letzte Forschung abschließen zu können (zumindest hab ich das irgendwo gelesen) ?"}, {"50": "Das ist auch laut ausgelesener Storyquest-Reihe so verlangt. Erst soll man die Festung der Rache auf Stufe 4 ausbauen und 2 Aufgaben später soll die Festung der Rache verkauft werden. Danach kommen noch einige Aufgaben, die nichts mehr direkt mit den Siedlungsressourcen zu tun haben.[BR][BR][IMG]https://i.ibb.co/0q92kF7/https-de-forum-elvenar-com-index-php-attachments-1642918775340-png-27758.png[/IMG][BR]Man sieht auch bei der letzten Forschung, dass \"eine\" Ressource benötigt (siehe eingekreisten Bereich) wird, die es erst für den Verkauf der Festung der Rache gibt."}, {"190": "Vielen Dank für die zahlreichen Antworten super..."}, {"9": "j.fili schrieb:\t\t\tDie Festung der Rache wird scheinbar auch im nächsten Kapitel benötigt. Dafür wird der Ausbau in der vorletzten Forschung nötig sein, auch wenn dieser keine Vorteile in Kapitel 19 bringt.\t\tZum Vergrößern anklicken....Definitiv nein (wird nicht im nächsten Kapitel gebraucht), es verhält sich so wie es @OMcErnie beschrieben hat. Der Ausbau auf Stufe 4 ist erforderlich um dann wiederum beim Verkauf die Ressource / Materie zu erhalten um die Forschung freizuschalten, bzw. das Ende zu erreichen."}, {"48": "Danke für die Aufklärung. Wollte hier eigentlich nicht gucken sondern einfach spielen. Habe nur wegen des o.g Fehlers von Inno hier reingeguckt.[BR]Wenn tatsächlich erst teuer ausgebaut und dann abgerissen werden soll, ist dieses Kapitel noch schwachsinniger als ich  vorher geglaubt habe. Dreck.[smilie--sprite4]"}, {"9": "j.fili schrieb:\t\t\tDanke für die Aufklärung. Wollte hier eigentlich nicht gucken sondern einfach spielen. Habe nur wegen des o.g Fehlers von Inno hier reingeguckt.[BR]Wenn tatsächlich erst teuer ausgebaut und dann abgerissen werden soll. Ist dieses Kapitel noch schwachsinniger als ich vorher geglaubt habe. Dreck.[smilie--sprite4]Zum Vergrößern anklicken....Ja aber das ist doch bei den Türmen schon so? Du baust diese ja eigentlich nur auf und reißt sie wieder ab um an die Materien zu kommen. Der Sinn wird dir ja also zuvor schon gezeigt/dargestellt. Er besteht bis auf die Brutstätten im Auf- und Abbau. Klar und da stimme ich dir zu, man könnte so auch gleich \"nur\" die Ressourcen verlangen im Tausch gegen die Materien etc. Was man sich dabei gedacht, weiß ich auch nicht. Lediglich muss man so dann eben mit dem Platz/Fläche hantieren/planen. Vielleicht war das der Plan. Ich find eher die \"Mengen\" die benötigt werden schon ein wenig arg übertrieben. Das Spiel wird auf der einen Seite eigentlich immer schneller (Dank Events und Co.), jedoch werden es dadurch ja auch nicht gerade mehr Ressourcen, eher weniger, weil man diese ja viel schneller benötigt. Dabei müssen diese \"Mengen\" auch erstmal erwirtschaftet, bzw. gesammelt werden. So hat man beispielsweise den Forschungsbaum längst mit WPs gefüllt und wartet jedoch dann auf die dementsprechende Ressource und das eben nicht 1-2 Tage, nein, Wochen. Von dem her schon ein bisschen unausgewogen. Denn es sollte jedem klar sein, dass wenn ein Spieler stets nur auf eine gewisse Ressource wartet, es ziemlich eintönig und langweilig wird, bzw. werden kann. Hätte man hier z.B. die Forschung auf 500 WPs angehoben, so wäre es etwas ausgewogener bei einigen. Doch so sind die Forschung bei den meisten bereits mit WPs gefüllt und man sammelt und sammelt und sammelt nur die \"eine\" fehlende Ressource/Materie oder Kreaturen. Das nimmt irgendwo den Spielspaß, wenn man eben fortlaufend nur wartet und hierbei stets dasselbe macht. Gegen die Zeiten oder die Größe der GR-Gebäude gibt es ja nicht einmal etwas einzuwenden aber das \"in meinen Augen\" Stumpfsinnige und eintönige sowie fortlaufende ewige sammeln ist echt nicht mehr feierlich. Aber gut sehen ja meine Vorredner eben so. Auf der einen Seite hat das Spiel eben durch die zahlreichen Events etc. total fahrt aufgenommen und auf der anderen Seite bremst man einen wieder aus. Na ja ich drück dir die Daumen @j.fili  das du nicht gar so lange warten musst. ^^"}, {"48": "Genau das ist ja der Grund, warum ich dieses Kapitel für schwachsinnig hielt, @AngelOfDead. Gebäude bauen um es ab zu reißen um es neu und aus zu bauen, um es abzureißen. Hirnriss ohne Ende.[BR]Und dann das ganze um ein anderes Gebäude zum Abreißen auszubauen. Wenn das Gebäude geblieben wäre, könnte ich es verstehen, aber so ist es schwachsinnig zum Quadrat und die Entwickler haben bestimmt Tränen gelacht, weil sie so eine fantastische und lustige Idee hatten.[BR]Tut mir leid aber die Entwickler haben hier das Thema Wegwerfgesellschaft so auf die Spitze getrieben, dass sogar Großkonzerne noch was lernen könnten. Allerdings glaube ich nicht, dass die Macher diesen Widersinn verstanden haben, wenn ich die Beschreibung zum Abriss lese.[BR]Der zweite Grund war tatsächlich du totale Unausgewogenheit, die du ansprichst, @AngelOfDead."}, {"2": "...vielleicht hat es aber auch einfach was mit der Story zu tun...."}, {"48": "Vllt? Aber die Symbolik bleibt für mich. [BR]Ich empfinde sie einfach als unerträglich. Kann ich nicht ändern"}]