[{"54": "so - endlich alle 16 Brutstätten auf Maximum ausgebaut (eine auf 2) und nun ist 2 (oder 3?) Monate langt Langeweile angesagt.[BR][BR]eine Forschung dauert bei mir mit 4x ernten pro Tag (ja, mehr als 5-6 Stunden schlaf ich nicht) ca 2 Wochen, da die ja immer umfangreicher werden, wahrscheinlich bald 3 Wochen (230 Kreaturen des Lichts x 16+100 = ca 3800 x4 = 14400 pro Tag + die schwarzen  + die ultimativen - kommt ungefähr hin)[BR][BR]ok, 4x geht ned immer, aber meistens ...[BR][BR]10 Forschungen hab ich noch + 4 Tage ca für das HG ...[BR][BR]Was ich meine, auch schon geschrieben habe, es ist einfach langweilig, auch wenn man noch was anderes machen kann (Wunder ausbauen, etc), das ist ja nett, aber kurzweilig is halt anders.[BR][BR]Vielleicht liegt meine Langeweile auch am Betrachten der hässlichen Brutstätten mehrmals täglich ???[BR][BR]Hab ja schon bei den Schiffen gemosert, bei den Zentren aber gelobt (fand ich echt \"netter\" und variabler), aber dieses Kapitel nun hat mich wieder auf den Boden der Tatsachen geholt ...[BR][BR]In Anbetracht der langen Entwichlungszeit hatte ich echt auf etwas kurzweiligeres und vor allen Dingen optisch anspruchsvolleres gehofft ...[BR][BR]HdW[BR][BR]ps, nein, ich spiele nicht mit Dias zur Zeitverkürzung[BR][BR]edit:[BR][BR]ich hab eben mal in mein Inventar geschaut: gerne würde ich das eine oder andere mal wieder aufstellen ...[BR]wenn man, um einigermaßen gut vorwärts zu kommen, alles mit Brutstätten, Saatgebäuden und Manus vollstellen muss, bleibt dafür kaum Platz.[BR]Ach ja, die Bibliotheken-Sets braucht man ja auch noch en Masse, um einigermaßen in der Aka was reissen zu können ...[BR][BR]Die Event-Gebäude füllen ansich nur das Lager, statt helfend in der Stadt aufgestellt werden zu können[BR][BR]Ok, man könnte Erweiterungen mit EG/Dias kaufen [smilie--sprite1])"}, {"27": "Viel spass, habe es hinter mir, es ist die blödes und langweiligste Gastrasse (Gastrasse kann man dazu ja eigentlich nicht sagen) gewesen, die ich je hier gespielt habe, dies ist meine persönliche Meinung dazu.[smilie--sprite3]"}, {"191": "Muß meine vorherige Bewertung nun doch korrigieren.[BR]Hab fast 20% meiner Stadt für die Gäste hergegeben (16 Brutstätten auf Stufe 4). Wenn ich richtig gerechnet habe, benötige ich trotzdem noch ca. 1,5 Monate für die restlichen 3 Forschungspunkte bei denen Gastgüter verlangt werden. [BR]Die Aussicht auf so lange monotone Klickerei und \"Dauerbelagerung\" der Stadt motiviert nicht sonderlich.[BR]Vielleicht wäre es doch mal ganz gut, das letztlich immer gleich wiederkehrende Konzept der Gastvölker zu überarbeiten. [BR]Hier gibt es viele kreative Köpfe, die bestimmt eine Menge Ideen dafür hätten..."}, {"54": "Vada schrieb:\t\t\tMuß meine vorherige Bewertung nun doch korrigieren.[BR]Hab fast 20% meiner Stadt für die Gäste hergegeben (16 Brutstätten auf Stufe 4). Wenn ich richtig gerechnet habe, benötige ich trotzdem noch ca. 1,5 Monate für die restlichen 3 Forschungspunkte bei denen Gastgüter verlangt werden.[BR]Die Aussicht auf so lange monotone Klickerei und \"Dauerbelagerung\" der Stadt motiviert nicht sonderlich.[BR]Vielleicht wäre es doch mal ganz gut, das letztlich immer gleich wiederkehrende Konzept der Gastvölker zu überarbeiten.[BR]Hier gibt es viele kreative Köpfe, die bestimmt eine Menge Ideen dafür hätten...\t\tZum Vergrößern anklicken....[BR]Hab jetzt 18 auf 4 - will die schnell wieder los werden, damit ich noch was hab von meiner schönen Stadt und nicht nur \"Fremdbauten\" ohne Wert ...[BR]Dauert trotzdem noch bis ca Ende März, denke ich (nein, ich nehme keine Zeitbooster zum Abkürzen)[BR][BR]Spielspass geht anders ...[BR][BR][BR]HdW[BR][BR]ps wenn dann direkt nochmal so ein Klops losgeht, neigt sich meine Spiellust dem Ende zu ...[BR](ok, ich kenne einige, die das Spiel sogar ohne Fortschrittsbaum spielen - nicht mein Ding, auf der Stelle treten ...)"}, {"8": "Mal ne Frage an alle endgamer die schon fleißig Wunder bauen:[BR][BR]Gewährt der vallorianische Siegelturm auch Unurium für Gold, das man bei evos und Sets einsammelt?[BR][BR](sorry falls es schon beantwortet wurde)"}, {"199": "gergerw schrieb:\t\t\tMal ne Frage an alle endgamer die schon fleißig Wunder bauen:[BR][BR]Gewährt der vallorianische Siegelturm auch Unurium für Gold, das man bei evos und Sets einsammelt?[BR][BR](sorry falls es schon beantwortet wurde)\t\tZum Vergrößern anklicken....Laut Beschreibung im Wiki gilt das nur für Wohnhäuser - was ich sehr schade finde, da ich ohne Wohnhäuser spiele und das auch nicht damit anfangen wollte. Leider sind dadurch mittlerweile mehrere Wunder für mich nur sehr eingeschränkt nützlich, aber ich finde Wohnhäuser - vor allem mehrere nebeneinander - nicht hübsch.[BR]\t\t\thttps://de.wiki.elvenar.com/index.php?title=Rache_des_Verbannte_Antike_Wunder#Vallorianische_Siegelturm_.C3.9Cbersicht\t\t"}, {"8": "Pelzchen schrieb:\t\t\twas ich sehr schade finde, da ich ohne Wohnhäuser spiele und das auch nicht damit anfangen wollte. Leider sind dadurch mittlerweile mehrere Wunder für mich nur sehr eingeschränkt nützlich, aber ich finde Wohnhäuser - vor allem mehrere nebeneinander - nicht hübsch.\t\tZum Vergrößern anklicken....Jop, entwickelt sich bei mir auch dazu.[BR][BR]Hab Dank für die Klarstellung.[BR][BR]===> Heißt für mich, dass ich beim Tempel der Geister ohne schlechtes Gewissen all in gehen kann [smilie--sprite1]"}, {"9": "Aus der Storyline: [BR][BR]Interessant das er das weiß, [smilie--sprite7] denn die Mengen die gefordert werden sind irgendwo jenseits zwischen Gut und Böse. [smilie--sprite7][BR]Aber ja, man hat ja das Drachenkloster und verballert Zauber über Zauber damit das klicken auch so richtig Spaß macht. [smilie--sprite7][BR][BR]Ich hätte da eine Antwort an den König Aelrindel:[BR]Sag mal du  mir sehr komisch erscheinender König Aelrindel,  ich weiß nicht was dir zugestoßen ist, aber entweder, man hat dir durch deinen eigenen Song (Hier in YouTube zu finden), die Sinne geraubt oder aber, man hat dir nicht so wirklich erzählt wie das mit dem Mana so abläuft. Doch da es dir ja egal ist, wenn du andere mit deinen ach so schlauen Sprüchen begehrst, wird es dir sicherlich auch egal sein, wenn ich dir sage,[BR]\"mit diesen Mengen und den in meinen Augen, völlig Sinnlosen sammeln, habt ihr echt ein wahres Meisterwerk vollbracht.\"[BR][BR][IMG]https://i.ibb.co/1vxZq6s/https-de-forum-elvenar-com-index-php-attachments-1644567646638-png-28059.png[/IMG][BR][BR]Nichts für ungut König Aelrindel aber du verdienst doch genug oder? Ich meine mit Apple ist man ganz gut gesonnen und schreibt ja gute zahlen.[BR]Naja, zumindest weiß man jetzt, wo so manche eurer Namen herkommen. [smilie--sprite2][BR]Fragt sich nur, ob sich deine Schöpfer wirklich von Elven Lullabies inspirieren ließen? [smilie--sprite11][BR]Ach ja, da bei Apple nichts umsonst ist, wechselte ich auf das Album bei YouTube. [smilie--sprite2][BR]Aber nun gut, denn ja die Schlinge zieht sich zu. [smilie--sprite7][BR][BR]Bitte beachtet das nächste Mal die Mengen in diesem Kapitel generell, wenn ihr euch schon so entspannte Musik aussucht - Danke! [smilie--sprite1][BR][BR]Fortsetzung aus der Storyline:[BR][BR][IMG]https://i.ibb.co/wKfskyL/https-de-forum-elvenar-com-index-php-attachments-1644603805101-png-28064.png[/IMG][BR][BR]Mmm .... ich würde sagen:[BR]Keine Ahnung ob König Aelrindel und sein Waldelfenvölkchen so naiv ist, viel schlauer kannst du jedoch auch nicht sein, denn ich brauchte diese Zauberer, da sie mir einst das Drachenkloster schenkten, bzw. mir ein Wunder gaben, welches ich zu 100% in diesem Kapitel nutzen muss.  [smilie--sprite11][BR]Das es nur dich braucht, halte ich für ein Gerücht, denn ich brauche so allmählich auch einen Nervendoktor, denn dieses endlose sammeln macht einen im wahrsten Sinne des Wortes ganz Gaga. [smilie--sprite7][BR]Die Bedeutung sowie den Sinn des ewigen \"sinnbefreiten\" sammeln verstehe ich zwar nicht, aber eure Text-Passagen machen Hoffnung.[BR]Hoffnung darauf, Elvenar den Rücken zu zudrehen, denn motivieren und Spaß sieht bei einigen dann doch anders aus. [smilie--sprite7][BR][BR]Oha und dann kam er wieder, der Sprücheklopfer dem irgendwie alles egal ist ... ...[BR][BR][IMG]https://i.ibb.co/QcrWDjH/https-de-forum-elvenar-com-index-php-attachments-1644603036807-png-28063.png[/IMG][BR][BR]Darf ich laut lachen König Aelrindel und dir folgendes hier im Feedbackthread mitteilen, damit es auch deine Schöpfer lesen?[BR][BR]Also .. .. zum einen, ich halte dich und dein Waldelfenvölkchen nicht für naiv, aber deine Verbindung liest sich wirklich fragend.[BR]Doch die andere Sache ist, ich und zig andere Spieler währen dir in der Tat Dankbar, wenn du diesem Treiben ein Ende setzt, denn ich glaube wir drehen uns hier im Kreis mit diesem, sammle hier sammle da und trallala. [BR]Junge, bring es einfach hinter mich, denn das gleicht einem Kreuzzug der kein Ende nimmt.[BR]Langweilig ist hier noch liebevoll ausgedrückt. [smilie--sprite2][BR][BR]Nur Gott und das von Gott geschaffene Entwickler-Team, weiß wie diese Geschichte ausgeht.[BR][BR]- Werden Spieler das weite suchen, weil das sammeln kein Ende nimmt?[BR]- Werden einige \"verblöden\" an diesem, ok nennen wir es, \"Spielkonzept\"?[BR]- Werden wir jemals wieder Spaß haben oder bleiben wir in dieser Einöde und dem Eintönigen sammeln stecken?[BR]- Werden wir jemals wieder nachdenken müssen, anstatt nur Erbsen und Bohnen zu sammeln?[BR]Fragen, über Fragen ..... man weiß es nicht, aber was man weiß ist,[BR].... und wenn sie nicht gestorben sind, dann ......RICHTIG..... dann sammeln sie noch Morgen. [smilie--sprite2][BR][BR]Psssst .. ... ich sag es mal durch die Wand, \"ein langweiliges Kapitel\" doch ich versuche es mit Humor zu nehmen. [smilie--sprite7]"}, {"38": "Mich juckts grad irgendwie danach - Kriegt man noch eine 2.    Ultimative Materie wenn man das Portal zum 2.mal auf Stufe 4 aufbaut und abreißt?[BR]Hat das wer ausprobiert oder ist das für wen, dem extrem fad ist?"}, {"6": "Bertram von Traunstein schrieb:\t\t\tHat das wer ausprobiert oder ist das für wen, dem extrem fad ist?\t\tZum Vergrößern anklicken....Letzteres. [smilie--sprite8][BR]Warum sollte man das tun? [BR]Ich war froh, das Kapitel abhaken zu können. War nervig genug."}, {"38": "ustoni schrieb:\t\t\tLetzteres. [smilie--sprite8][BR]Warum sollte man das tun?[BR]Ich war froh, das Kapitel abhaken zu können. War nervig genug.\t\tZum Vergrößern anklicken....Wie lang dauert das bis das Ding auf Stufe 4 ist?[BR]Würdest es nicht nochmal probieren?"}, {"2": "...naja - um das Portal ein 2. Mal auf Stufe 4 auszubauen, braucht man auch weitere 72 schwarze Materie und muss dazu auch weitere 144 Türme des Lichts aufbauen - ich glaube nicht, daß irgend jemanden jemals so langweilig sein wird..."}, {"38": "Was krieg ich, wenn ich das ein 2. Mal machen werde, INNO? [smilie--sprite8][BR]@Tacheless [BR](Noch bin ich eh Jahre entfernt)"}, {"1": "Bertram von Traunstein schrieb:\t\t\tWas krieg ich, wenn ich das ein 2. Mal machen werde, INNO? [smilie--sprite8][BR]@Tacheless[BR](Noch bin ich eh Jahre entfernt)\t\tZum Vergrößern anklicken....[BR]Was ganz ganz tolles. Willst du es wirklich wissen? Oder willst du dich nicht lieber überraschen lassen? Richtig neugierig? Na, dann klick auf den Spoiler. [smilie--sprite1] [BR]Spoiler: Überraschung für Bertram von TraunsteinDu erhältst die Antwort auf folgende Frage:[BR]Bertram von Traunstein schrieb:\t\t\tMich juckts grad irgendwie danach - Kriegt man noch eine 2.    Ultimative Materie wenn man das Portal zum 2.mal auf Stufe 4 aufbaut und abreißt?[BR]Hat das wer ausprobiert oder ist das für wen, dem extrem fad ist?\t\tZum Vergrößern anklicken...."}, {"104": "Das Video in der Ankündigung ist privat? [smilie--sprite2][BR]\t\t\thttps://de.forum.elvenar.com/index.php?threads/kapitel-19-die-rache-des-verbannten.23767/\t\t"}, {"38": "Tacheless schrieb:\t\t\tWas ganz ganz tolles. Willst du es wirklich wissen? Oder willst du dich nicht lieber überraschen lassen? Richtig neugierig? Na, dann klick auf den Spoiler. [smilie--sprite1][BR]Spoiler: Überraschung für Bertram von TraunsteinDu erhältst die Antwort auf folgende Frage:Zum Vergrößern anklicken....Na geee[BR]Wo isn da die Besonderheit? [smilie--sprite8]"}, {"9": "Bertram von Traunstein schrieb:\t\t\tNa geee[BR]Wo isn da die Besonderheit? [smilie--sprite8]Zum Vergrößern anklicken....Da gibt es keine, weil es gar keinen Sinn macht. Wer sollte das alles nochmals bauen und machen um dann so eine extra Kugel im Lager zu haben mit der ich aber nichts mehr anfangen kann?"}, {"68": "AngelOfDead schrieb:\t\t\tDa gibt es keine, weil es gar keinen Sinn macht. Wer sollte das alles nochmals bauen und machen um dann so eine extra Kugel im Lager zu haben mit der ich aber nichts mehr anfangen kann?\t\tZum Vergrößern anklicken....[BR]Wer weiß das schon, wahrscheinlich nichtmal Inno, aber[BR][BR]da ja in den letzten Kapiteln immer mehr Gastrassenvölker uns gleichzeitig erfreuen, könnte ja auch irgendwann mal in der Zukunft (bei Inno sicher 2 Jahre +) eine Gastrasse kommen, wo man von allen bisherigen Gastrassen wieder das Portal und Produktionsstätten aufbauen muss, um das Kapitel abzuschließen (und nein, Portalgewinne zählen nicht), und da macht es schon Sinn so was schon auf Vorrat zu haben  [smilie--sprite7][BR][BR]Genial wäre es natürlich alle Portale gleichzeitig in der Stadt haben zu müssen, damit es ein \"wenig\" herausfordernder wird und ein wenig Abwechslung in die Städte bringt. Natürlich gibt es dafür einen nicht ablehnbaren Quest alle Portale in der Stadt zu haben, dafür kommen anschließend die End-Quests jedes Portal einzeln abzureißen und als Belohnung gibt es immer 1 und als Abschlußgeschenk zum Ende dieser Gastrasse die \"Elvenar-Teleportier-Rolle\", welche es einem ermöglicht, eine zukünftige Gastrasse komplett zu überfliegen (alle Forschungen werden natürlich automatisch erledigt). (Gleich mal in die Ideen-Sektion schreiben)."}, {"200": "Moin Forengemeinschaft,[BR]brauche eure Hilfe. In der Aufgabe 80 verlangt Vignom, ich soll ein federleichtes Kettenhemd produzieren. Wird wohl aus feinstem Flugpulver produziert. Wie und wo kann ich das Kettenhemd herstellen? [BR]Gruß Pepe"}, {"2": "...das wird nicht aus feinstem Flugpulver produziert, sondern das ist einfach die 9-Std.-Produktion von feinstem Flugpulver....[BR][BR][IMG]https://i.ibb.co/6Zv1L2k/https-de-forum-elvenar-com-index-php-attachments-kettenhemd-png-28594.png[/IMG]"}]