[{"200": "Danke Romilly [smilie--sprite1]"}, {"24": "Ich spiele es jetzt seid einigen Wochen.[BR][BR]Oh. Mein. Gott.[BR][BR][BR]Die Manakosten sind derart immens dass trotz Level 31 Drachenkloster und mehreren Manaproduzierenden Gebäuden sich alles nur im Schneckentempo ausbauen lässt. 1 einzelnes Stück Gastrassenweg koste 450k (450.000) Mana ! Nicht zu sprechen von den 500-750k für den Ausbau eines einzelnen Miniproduktionsgebäudes. Soviele Zauber hab ich nicht auf Halde. Die Forschungen erfordern das Gastrassengut im fünfstelligen Bereich... Pro Forschung. Produziert werden können die minimal und maximal im 6-Stunden-Turnus (Kosten: 3100 Mana oder 310 Saat. Ich benutze Saat, weil Mana zu rar ist, man stelle sich vor...) ... Auf Level 2 ausgebaut mit ca. 100 (Auf L30 ausgebaute Hummel) des Gastrassengutes pro Produktionsstätte. Die derzeit anstehende Forschung kostet mich 30k. Mühevoll habe ich mittlerweile 10 Level2 und ein Level 1-Produktionsgebäude stehen... Dazu 21 Wegstücke um sie anzubinden. Den Platzbedarf den die Dinger verlangen führe ich gar nicht erst aus. Das bedeutet, für EINE (!) Forschung brauche ich 30k/1050 = ~29 Produktionszyklen. Gehen wir von dreien am Tag aus (Ich schlafe und bin nicht auf Elvenar getaktet) sind das 10 Tage. Pro Forschung. Und die werden noch merklich teuer (über 45k, bis 200k Gastrassengüter...!). Dazu habe ich aleine für die bisherigen Ausbauten bereits rund 22 MILLIONEN Mana verbraucht. Fazit: Ich muss meine halbe Stadt abreissen, kann nicht in annehmbaren Zeitzyklen produzieren ausser ich stelle mir Nachts den Wecker, kriege soviel Mana abverlangt dass ich es im Turm nicht mehr ausgebe weils zu wertvoll ist und werde trotzdem bis zum Sanktnimmerleinstag nicht fertig... Und ich dachte das Händlerkapitel wäre schlimm gewesen. Team ging ja wieder.[BR][BR]Ahm... Sorry, aber... Daumen runter. Ich mag Herausforderungen. Aber das ist keine Herausforderung. Das ist Arbeit."}, {"119": "Da hast du in allem recht. 19 war ein hartes Stück Arbeit. gottseidank fertsch [smilie--sprite1]"}, {"60": "Feytala1986 schrieb:\t\t\tIch spiele es jetzt seid einigen Wochen.[BR][BR]Oh. Mein. Gott.[BR][BR][BR]Die Manakosten sind derart immens dass trotz Level 31 Drachenkloster und mehreren Manaproduzierenden Gebäuden sich alles nur im Schneckentempo ausbauen lässt. 1 einzelnes Stück Gastrassenweg koste 450k (450.000) Mana ! Nicht zu sprechen von den 500-750k für den Ausbau eines einzelnen Miniproduktionsgebäudes. Soviele Zauber hab ich nicht auf Halde. Die Forschungen erfordern das Gastrassengut im fünfstelligen Bereich... Pro Forschung. Produziert werden können die minimal und maximal im 6-Stunden-Turnus (Kosten: 3100 Mana oder 310 Saat. Ich benutze Saat, weil Mana zu rar ist, man stelle sich vor...) ... Auf Level 2 ausgebaut mit ca. 100 (Auf L30 ausgebaute Hummel) des Gastrassengutes pro Produktionsstätte. Die derzeit anstehende Forschung kostet mich 30k. Mühevoll habe ich mittlerweile 10 Level2 und ein Level 1-Produktionsgebäude stehen... Dazu 21 Wegstücke um sie anzubinden. Den Platzbedarf den die Dinger verlangen führe ich gar nicht erst aus. Das bedeutet, für EINE (!) Forschung brauche ich 30k/1050 = ~29 Produktionszyklen. Gehen wir von dreien am Tag aus (Ich schlafe und bin nicht auf Elvenar getaktet) sind das 10 Tage. Pro Forschung. Und die werden noch merklich teuer (über 45k, bis 200k Gastrassengüter...!). Dazu habe ich aleine für die bisherigen Ausbauten bereits rund 22 MILLIONEN Mana verbraucht. Fazit: Ich muss meine halbe Stadt abreissen, kann nicht in annehmbaren Zeitzyklen produzieren ausser ich stelle mir Nachts den Wecker, kriege soviel Mana abverlangt dass ich es im Turm nicht mehr ausgebe weils zu wertvoll ist und werde trotzdem bis zum Sanktnimmerleinstag nicht fertig... Und ich dachte das Händlerkapitel wäre schlimm gewesen. Team ging ja wieder.[BR][BR]Ahm... Sorry, aber... Daumen runter. Ich mag Herausforderungen. Aber das ist keine Herausforderung. Das ist Arbeit.\t\tZum Vergrößern anklicken....Ich kann mich dir nur anschließen ... ein furchtbares Kapitel. Wenn es schon so lang dauert, dann wäre es zumindest schön gewesen, dass es weniger Platz verbraucht. Und ja, die Manamengen sind gelinde gesagt eine Unverschämtheit."}, {"2": "Kamajo schrieb:\t\t\tfruchtbares\t\tZum Vergrößern anklicken....hihi - fruchtbar oder dann doch eher furchtbar?..."}, {"24": "Zumindest bin ich mit meinem Leid nicht aleine...^^°"}, {"8": "Also auf Manamangel bin ich vorbereitet. Hab alle Manawunder stehen, die es gibt![BR][BR]Kapitel 19 kann kommen![BR][BR]Der Baum der Erleuchtung gefällt mir wirklich sehr [smilie--sprite1]"}, {"4": "Wer hängt denn da? Ist das ein böser Treant, der eine Waldelfe schaukelt? (Portal auf 1)[BR][BR][IMG]https://i.ibb.co/FwZmdT5/https-de-forum-elvenar-com-index-php-attachments-1652024631474-png-28950.png[/IMG]"}, {"4": "gergerw schrieb:\t\t\tAlso auf Manamangel bin ich vorbereitet. Hab alle Manawunder stehen, die es gibt![BR][BR]Kapitel 19 kann kommen![BR][BR]Der Baum der Erleuchtung gefällt mir wirklich sehr [smilie--sprite1]Zum Vergrößern anklicken....hihi, ja, meinste, ich hatte weit über 5 Mio an Mana auf lager, jetzt muss ich schon wieder boostern, um welches zu erhalten. Ich produziere über ne 600.000 Mana am Tag und kann dann damit gerade mal 1 Stück mag. Kriegspfad kaufen."}, {"91": "Dieses Nadelöhr gibt in dieser Phase schlichtweg dem Takt vor, da beißt die Maus keinen Faden ab! [smilie--sprite1]"}, {"9": "BlackLabelSociety schrieb:\t\t\tda beißt die Maus keinen Faden ab\t\tZum Vergrößern anklicken...... .. oder du wartest 1-2 Jahre und bist dann in der Lage.  [smilie--sprite2][BR][BR]Denn so wie jeder weiß, gibt es dann Dank Inno alles zum kleinen Preis.[BR]Weil man stets nach balanciert, das hat selbst der \"dümmste\" schon kapiert! [smilie--sprite7][BR]Hast du es jedoch eilig und willst schnell fertig sein, tja, dann musst du Bluten und zahlst drauf obendrein. [smilie--sprite2][BR]Warum das so ist, weiß man auch ganz genau, egal ob Mann oder Frau.[BR]Unmittelbar nach dem Beta erscheinen, kommt es Live, weil sonst viele wartende jammern und weinen.[BR]Doch wirklich getestet hat das in dieser kurzen Zeit auf Beta niemand, dass ist Tatsache und fester Bestand.[BR]So lass dir Raten, es lohnt zu warten. [smilie--sprite2][BR]Erst wurden die Amuni nach balanciert, dann die Elvenar'en und ich hab es dann kapiert. [BR]Denn nun kamen auch die Händler von Unur und Botschafter im nachhinein dran und man fragt sich irgendwann.[BR]So läuft man schnell durch eine Rasse und der Nachfolgende Sturm steht lachend hinter dir in einer Gasse. [BR]Zeitbooster, ja gar Dias nutzte man, denn man wollte stets schnell bzw. fortlaufend voran.[BR]Doch kurze Zeit darauf, bekommst du eine drauf.[BR]Denn du stellst fest, dass es Nachzügler nun um längen leichter haben, tja, mehr muss man dazu nicht mehr sagen. [BR]Die Moral von der Geschichte ist, nimm es hin oder warte mit List. [BR]Ach ja, selbst in den unteren Kapiteln wurde heftig nach balanciert, ganze Forschungen fast halbiert, [BR]doch was soll man dazu noch sagen, hat noch irgendjemand Fragen?"}, {"4": "In allen anderen Kapiteln war es doch immer sinnvoll, zuerst das Portal zu leveln, und dann erst die Gastrassengebäude, da sich die Portalerhöhung ja auf alle Gebäude gleichzeitig auswirkte.[BR][BR]Nun ist es aber dieses Mal so, dass ich 50.000 Kreaturen des Lichts benötige, nur um die Forschung für den Ausbau Portal auf 2 freizuschalten. Und das bei gerade mal 56 Kreaturen in 6 Std. Die Händlerbiene ist auf 30. Das sind rund 950 Produktionen. Derzeit hab ich gerade mal 6 Brutstätten, also pro Brutstätte rund 150 Produktionen. Bei max. 4 Produktionen/Tag sind das nur fürs Freischalten der Stufe 2 vom Portal knapp 40 Tage.[BR][BR]Wie kann ich das ganze beschleunigen? [BR][BR]Ausbauen der Brutstätten oder andere, bessere Möglichkeit.[BR][BR]Immerhin dauert es auch ewig lange, die Materialien für den jeweiligen Bau/Ausbau zu erwirtschaften. Ich brauche noch rund 10 x schwarze Magie und 5 x weiße Magie. Danach kann ich dort noch eine Brutstätte bauen.[BR][BR]Ideen?"}, {"90": "Booster, oder mit mehr Brütern arbeiten, hatte am ende 14  auf 4 stehen gehabt, und andere hatten noch mehr stehen gehabt."}, {"91": "Genau, du brauchst definitiv mehr Brutstätten. Ansonsten sehe ich den Grundsatz erst Portal, dann den Rest nicht umgeworfen. Es dauert halt einfach alles länger, unendlich lang in diesem Kapitel"}, {"128": "In Kapitel 20 braucht es 1,7 Millionen Saat für eine Wegkachel.[BR][BR][BR]Mindestens."}, {"201": "Endlich lohnt es sich mal wieder, Portalsegen einzusetzen! Ich habe die lange nicht gebrauchen können und entsprechend viele durch den Turm angesammelt aber hier wäre ich ohne ganz schön aufgeschmissen."}, {"4": "Avenahar schrieb:\t\t\tEndlich lohnt es sich mal wieder, Portalsegen einzusetzen! Ich habe die lange nicht gebrauchen können und entsprechend viele durch den Turm angesammelt aber hier wäre ich ohne ganz schön aufgeschmissen.\t\tZum Vergrößern anklicken....Für Portalsegen gibts aber kein Mana, nur für MM. Oder was meinst du?"}, {"50": "Dank des Portalsegens kann man die \"weiße\" und \"schwarze\" Magie, die man im Kapitel XIX in doch recht umfangreicher Menge benötigt erzeugen und spart sich den Platz für die Türme des Lichts (auf Stufe 2 ausgebaut Türme der Dunkelheit).[BR][IMG]https://i.ibb.co/hy632Fg/https-de-forum-elvenar-com-index-php-attachments-1653112978187-png-29113.png[/IMG][BR][BR]Daher wäre ein guter Weg, sich zu Beginn des Kapitels mit den benötigten 72 \"schwarzen\" Materie für alle Ausbaustufen des Portals (Festung der Rache) zu beschäftigen (144x Türme des Lichts, aus denen 72x Türme der Dunkelheit durch Ausbau auf Stufe 2 entstehen).[BR]Danach benötigt man diese Türme durch Nutzung von Portalsegen überhaupt nicht mehr, was wiederum mehr Platz für z.B. die Brutstätten bedeutet.[BR][BR]Die Massen an Mana, die für das Kapitel benötigt werden, hat nichts mit den Portalsegen zu tun."}, {"202": "Spoiler - Ich habe mal die Quests von der italienischen Seite in vernünftiges Inno-Deutsch übersetzt:[BR][BR]Sammle 60.000 göttliche Samen[BR]Erkunde eine Provinz oder schließe 600 Provinzen ab[BR]Schalte die Gewappneten Kasernen frei[BR]Du hast eine Rüstkammer Lv. 41 oder höher + Zugeinheiten (?)[BR]Besitze eine Seiden-/Kristall-/Schriftrollen-Manufaktur mindestens auf Level 16 + Münzen spenden[BR]Schalte die Erleuchtete Dünenkristallmanufaktur frei[BR]Besitze eine Seiden-/Kristall-/Schriftrollen-Manufaktur mindestens auf Level 24[BR]Schalte die Erleuchtete Schriftrollenmanufaktur der Drachen frei[BR]Besitze eine Seiden-/Kristall-/Schriftrollen-Manufaktur mindestens auf Level 28[BR]Schalte die Erleuchtete Seidenmanufaktur der Feen frei[BR]Besitze eine Seiden-/Kristall-/Schriftrollenmanufaktur mindestens auf Level 32[BR]Schalte den Produktionsbonus für erleuchtete Güter frei[BR]Besitze eine Seiden-/Kristall-/Schriftrollen-Manufaktur mindestens auf Level 33 + 570 Provinzen[BR]Kaufe 10 Wissenspunkte oder investiere 50 Wissenspunkte in das Wunder eines anderen Spielers[BR]Schalte die Festung der Rache frei[BR]Sammle 2.000.000 Mana + Baue eine Festung der Rache[BR]Benutze 10 Zauber + Benutze 10 Segen[BR]Schalte Turm des Lichts und Turm der Dunkelheit frei[BR]Sammle 200.000 Weiße Magie[BR]Besitze 5 Türme[BR]Schalte die Gewappneten Werkstätten frei[BR]Werte 4 Werkstätten auf Level 42 auf + Produziere 10 Getränke + Produziere 5 Brot[BR]Schalte den ausgebildeten Händler frei[BR]Besitze den Kaufmann auf Level 8 + Heuere einen Händler an oder benutze ihn 10 Mal[BR]Verkaufe 2 Türme des Lichts + Baue 2 Türme des Lichts[BR]Besitze 4 Türme der Dunkelheit + Sammle 300.000 Schwarze Magie[BR]Schalte das Gewappnete Hauptgebäude frei[BR]Werte das Hauptgebäude auf Level 42 auf[BR]Gib 80 Wissenspunkte aus[BR]Sammle 50 Visionsschwaden[BR]Schalte Magischer Kriegspfad frei + Sammle 500.000 Weiße Magie + 500.000 Schwarze Magie[BR]Besitze mindestens 10 magische Kriegspfade[BR]Schalte den Schwertakrobat II frei[BR]Helfen Sie der Nachbarschaft 60 Mal[BR]Schalte Gewappnete Wohngebäude frei[BR]Werte 10 Wohngebäude auf Level 42 auf[BR]Sammle 100.000.000 Münzen + verwende 3 Beschwörungen (?) aus dem Inventar[BR]Sammle 100.000 göttliche Samen[BR]Schließe bis zu 580 Provinzen ab[BR]Schalte die Brutstätten frei[BR]Sammle 200.000 Unurium[BR]Besitze 10 Brutstätten + Besitze 10 Türme[BR]Schalte die Steinherzen-Straße frei + Besitze mindestens 40 Steinherzen-Straßen[BR]Erwecke 10.000 Kreaturen des Lichts + 15.000 Kreaturen der Dunkelheit[BR]Rüste das Trainingsgelände auf Level 32 auf[BR]Schalte die Ausbauten der traditionellen Elixiermanufaktur frei[BR]Sammle 100.000 Spaßseife[BR]Schalte die Ausbauten der Goblin-Magiestaubmanufaktur frei[BR]Sammle 100.000 Faulpilze[BR]Schaltet Upgrades der Manufaktur der Geodenentkernung frei[BR]Sammle 100.000 Kosmisches Bismut[BR]Sie haben 8 Brutstätten des Levels 2 oder höher[BR]Schalte die Ausbauten der Festung der Rache frei und sammle Schwarze Materie[BR]Verbessere die Festung der Rache auf Level 2[BR]Erwecke 500 Ultimative Kreaturen[BR]Verkaufe 5 Türme des Lichts und der Dunkelheit[BR]Schalte die Ausbauten der Brutstätten frei[BR]Sie haben 6 Brutstätten des Niveaus 3 oder höher[BR]Rüste das Söldnerlager auf Level 24 auf (optional)[BR]20.000 Ranger Pro II trainieren + 8 Begegnungen lösen (optional)[BR]Schalte die Optimal gewappneten Werkstätten frei + schalte das Optimal gewappnete Hauptgebäude frei[BR]Rüste das Hauptgebäude auf Level 43 + Rüste 4 Werkstätten auf Level 43 auf[BR]Habe 4 Brutstätten auf Level 4 + Schließe bis zu 590 Provinzen ab[BR]Schalte die Ausbauten der Marmormanufaktur der Elementare frei[BR]Besitzen Sie eine Marmormanufaktur Level 33 oder höher[BR]Schalte den Stahlmanufaktur der Zwerge-Ausbau frei[BR]Besitzen Sie eine Stahlmanufaktur Level 33 oder höher[BR]Schalte den Ausbau der Manufaktur der gedeihenden Hölzer frei[BR]Sie besitzen eine Holzmanufaktur Level 33 oder höher + 8 Manufakturen Level 33 oder höher[BR]Verbessere die Festung der Rache auf Level 3 + Besitze 10 Brutstätten Level 4[BR]Schalte Eine Bibliothek und ein Haus frei[BR]Erwecke 4000 Ultimative Kreaturen oder opfere 1000 Ultimative Kreaturen[BR]Schalte den Unheimlichen Zerberus II frei[BR]Spende 500.000 Mana[BR]Mindestens 10 Wohngebäude Level 43 haben[BR]Schalte den Vallorianischen Siegelturm oder den Baum der Erleuchtung frei[BR]Schmiede eine Rune[BR]Leiste 30 Mal Nachbarschaftshilfe[BR]Schalte die Ultimative Festung der Rache frei[BR]Verbessere die Festung der Rache auf Level 4[BR]Produziere 1 superleichtes Metallgewebe (?) (Seidenherstellung)[BR]Verkaufe die Festung der Rache oder schalte die Ultimative Macht frei[BR]Kaufe 1 Wissenspunkt[BR]Schalte die Ultimative Macht frei[BR]Sammle 20 Visionsschwaden[BR]Investiere 100 Wissenspunkte in das Wunder eines anderen Spielers[BR]Sammle 500.000 Mana + 50.000 göttliche Samen + 100.000 Unurium[BR]Produziere Aromatherapie für Katzen (Kristallmanufaktur)[BR]Löse 10 Begegnungen[BR]Verwende 15 Sofort (?) + Erhalte 5.000 Zaubersplitter[BR]Verwenden Sie 15 Zauber + Produzieren Sie einen versiegelten Friedensvertrag (Schriftrollenmanufaktur)[BR][BR]Verbesserungen der Liste sind natürlich willkommen."}, {"12": "Polarbear schrieb:\t\t\tSpoiler - Ich habe mal die Quests von der italienischen Seite in vernünftiges Inno-Deutsch übersetzt\t\tZum Vergrößern anklicken....Kannst ja mal mit meiner Liste vergleichen (bin schon fertig)[BR]Spoiler: SpoilerSammle 60000 Göttliche SaatErkunde Provinzen (1)   oder   Schließe 600 Provinzen abSchalte die gewappneten Kasernen freiBesitze eine Rüstkammer der Stufe 41 oder höher & Trainiere xxx EinheitenBesitze eine Kristallmanufaktur der Stufe 16 oder höher & Spende xxx MünzenSchalte die Erleuchtete Dünenkristall-Manufaktur freiBesitze eine Kristallmanufaktur der Stufe 24 oder höherSchalte die Erleuchtete Schriftrollen-Manufaktur der Drachen freiBesitze eine Kristallmanufaktur der Stufe 28 oder höherSchalte die Erleuchtete Seidenmanufaktur der Feen freiBesitze eine Kristallmanufaktur der Stufe 32 oder höherSchalte den Produktionsbonus für Erleuchtete Güter freiBesitze eine Kristallmanufaktur der Stufe 33 oder höher & Schließe 570 Provinzen abKaufe 10 Wissenspunkte oder Investiere 50 WP in ein Antikes Wunder eines anderen SpielersSchalte die Festung der Rache freiSammle 2000000 Mana  &  Baue die Festung der RacheVerwende 10 Zaubersprüche  &  Verwende 10 SegenSchalte die Türme des Lichts und der Finsternis freiSammle 200000 weiße MagieBesitze 5 TürmeSchalte die gewappneten Werkstätten freiBaue 4 Werkstätten auf Stufe 42 aus  &  Produziere 10 Getränke  &  Produziere 5 BrotSchalte den gewappneten Händler freiBesitze einen Händler der Stufe 8  &  Heuere einen Kaufmann an oder nutze ihn 10 MalVerkaufe 2 Türme des Lichts  &  Errichte 2 Türme des LichtsBesitze 4 Türme der Finsternis  &  Sammle 300000 Schwarze MagieSchalte das gewappnete Hauptgebäude freiBaue dein Hauptgebäude auf Stufe 42 ausGib 80 Wissenspunkte ausSammle 50 VisionsschwadenSchalte den magischen Kriegspfad frei  &  Sammle 500000 weiße Magie  &  Sammle 500000 schwarze MagieBesitze mindestens 10 Felder des Magischen KriegspfadsSchalte Schwertakrobaten II freiLeiste 60 NachbarschaftshilfeSchalte die gewappneten Wohngebäude freiBaue 10 Wohngebäude auf Stufe 42 ausSammele 100M Münzen ein  &  verwende 3 BeschwörungenSammle 100000 Göttliche SaatSchließe 580 Provinzen abSchalte die Brutstätten freiSammle 200000 UnuriumBesitze 10 Brutstätten  &  Besitze 10 TürmeSchalte die Steinherzen-Straße frei  &  Besitze mindestens 40 Steinherzen-StraßwnZüchte 10000 Geschöpfe des Lichts  &  Züchte 15000 Geschöpfe der NachtBaue dein Trainingsgelände auf Stufe 32 ausSchalte die Ausbauten für die traditionelle Elixiermanufaktur freiSammle 100000 SpaßseifeSchalte die Ausbauten für die Magiestaubmanufaktur der Goblins freiSammle 100000 FaulpilzeSchalte die Ausbauten für die Manufaktur der Geodenentkernung freiSammle 100000 Kosmisches BismutBesitze 8 Brutstätten der Stufe 2 oder höherSchalte die Ausbauten der Festung der Rache frei  &  Sammle 4x Schwarze MaterieBaue die Festung der Rache auf Stufe 2 ausZüchte 500 Ultimative GeschöpfeVerkaufe 5 Türme des Lichts oder Türme der DunkelheitSchalte die Ausbauten der Brutstätten freiBesitze 6 Brutstätten der Stufe 3 oder höherBaue dein Söldnerleger auf Stufe 24 aus  &  Schalte die Pro-Ranger II freiBilde 20000 Pro Ranger II aus  &  Schließe 8 Provinzbegegnungen abSchalte die Optimal gewappneten Werkstätten frei  &  Schalte das Optimal gewappnete Hauptgebäude freiBaue dein Hauptgebäude auf Stufe 43 aus  &  Baue 4 Werkstätten auf Stufe 43 ausBesitze 4 Brutstätten der Stufe 4 oder höher   &   Schließe 590 Provinzen abSchalte die Ausbauten der Marmormanufaktur der Elementare freiBesitze eine Marmormanufaktur der Stufe 33 oder höherSchalte die Ausbauten der Stahlmanufaktur der Zwerge freiBesitze eine Stahlmanufaktur der Stufe 33 oder höherSchalte die Ausbauten der Manufaktur der gedeihenden Hölzer freiBesitze eine Holzmanufaktur der Stufe 33 oder höher   &   Besitze 8 Manufakturen der Stufe 33 oder höherBaue die Festung der Rache auf Stufe 3 aus   &   Besitze 10 Brutstätten der Stufe 4 oder höherSchalte eine Bibliothek und ein Zuhause freiZüchte 4000 Ultimative Geschöpfe oder opfere 1000 Ultimative GeschöpfeSchalte den Unheimlichen Zerberus II freiSpende 500000 ManaBesitze mindestens 10 Wohngebäude der Stufe 43Schalte den Vallorianischen Siegelturm frei oder Schalte den Baum der Erleuchtung freiSchmiede eine RuneLeiste 30x NachbarschaftshilfeSchalte die Ultimative Festung der Rache freiBaue die Festung der Rache auf Stufe 4 ausProduziere 1 Federleichtes KettenhemdVerkaufe die Festung der Rache auf Level 4 oder Schalte die Ultimative Macht freiKaufe einen WissenspunktSchalte die Ultimative Macht freiSammle 20 VisionsschwadenInvestiere 100 Wissenspunkte in ein Antikes Wunder eines anderen SpielersSammle 500000 Mana & Sammle 50000 Göttliche Saat & Sammle 100000 UnuriumProduziere 1 Katzen-AromatherapieSchließe 10 Provinz-Begegnungen abVerwende 15 Segen & erhalte 5000 Zauberspruch-FragmenteVerwende 15 Zaubersprüche & Produziere 1 Versiegelten Friedensvertrag"}]