[{"40": "Grenzen eigentlich die benötigten Mengen bereits an Sadismus oder erwartet uns dieser erst in Kapitel 20?[BR]Ich bin gespannt."}, {"6": "Dominus00 schrieb:\t\t\tGrenzen eigentlich die benötigten Mengen bereits an Sadismus ...\t\tZum Vergrößern anklicken....Zumindest beim Bedarf an Mana wurde die Grenze bereits deutlich überschritten.[BR]Das gilt übrigens auch für den Manabedarf für den Ausbau der Wunder aus Kapitel 18 und besonders 19.[BR]Insgesamt würde ich da bei der Bewertung sogar noch einen Schritt weiter gehen: das ist nicht nur einfach sadistisch, das ist schon regelrecht pervers.[BR][BR]Nachtrag:[BR]Baum der Erleuchtung und Vallorianischer Siegelturm benötigen für den Ausbau auf Stufe 30 jeweils 15,83 Millionen Mana!"}, {"8": "ustoni schrieb:\t\t\tDas gilt übrigens auch für den Manabedarf für den Ausbau der Wunder aus Kapitel 18 und besonders 19. Insgesamt würde ich da bei der Bewertung sogar noch einen Schritt weiter gehen: das ist nicht nur einfach sadistisch, das ist schon regelrecht pervers.\t\tZum Vergrößern anklicken....[BR]Ey das sind doch moderate Mengen: 500k, 600k Mana pro Level[BR]Ausbauzeiten von bis zu 3 Tagen...[BR]===> Wer da nicht viel Zeitboostert sammelt in den 3 Tagen ganz nebenbei das notwendige Mana fürs nächste Level an.[BR]Auch WP oder Runen zum Tauschen muss man erstmal sammeln.[BR]Das zieht die Manasammelzeit in die Länge...[BR][BR]Mein Glücksorakel auf Stufe31 zu ziehen, war pervers!!![BR]Das Teil brauchte Mana, Orks, Saat und Unurium!!![BR]Alle Zerfalls- und Turnierbremsgüter gleichzeitig!!! [smilie--sprite9][BR][BR]Hatte weder Tempel der Geister noch Schrein der Champions um mir das Leben zu erleichtern...[BR][BR]richtig zusammen zucken würde ich erst, wenn 20 Mio. mana pro Ausbau oder 40 Mio. pro Forschung verlangt würden"}, {"85": "Das Kapitel sollte in \"Zeiten des Wartens\" umbenannt werden. Die größte Herausforderung liegt darin, nicht den Spielspaß gänzlich zu verlieren. Besonders im letzten Drittel ist es kein Spiel mehr, sondern nur noch stupides Warten. Wie wäre es mit einer konsequenten Fortführung in Kapitel 20. Statt Gütern wird dann in der Forschung die jeweilige Wartezeit in Wochen oder Monaten angezeigt."}, {"24": "Bericht: Ein Monat nach meinem letzten Post.[BR][BR]Ich habe weitergearbeitet. An Forschungen diejenigen fokussiert, die erluaben Portal und Brutstätten auszubauen.[BR]Der Manamangel ist immer noch merkbar. Ich habe 14 Brutstätten, die ich grade versuche von Level 2 auf Level 4 auszubauen.[BR]Eine Forschung dauert derzeit - Bei konstanter Anwendung, realistisch sind eher 20-40% mehr Zeit - Ca 5 Tage. Schnellerer Ausbau scheitert an Manamangel. Auch Erleuchtete Güter sind rar, das empfinde ich aber eher als normal.[BR]Die meisten meiner Zauber gehen für mehr Mana drauf, daher sind die Zauberspeicher relativ leer. Ich kann mir vorstellen dass es für die richtig harten Turnierspieler (40 Provinzen+) leichter ist, ich als normalspieler mit 25-30 habe davon jetzt konstant zu wenig. Wie sich dieses Kapitel für Leute ohne L30+ Drachenkloster anfühlt will ich mir gar nicht ausmalen.[BR][BR]Den Platzmangel durch die eher großen GR-Gebäude bei gleichzeitigem Mehrbedarf an Mana, Samen und Unurium merkt man aber.[BR][BR]Trotzdem hat es sich mittlerweile eingependelt und das Ende fühlt sich in Sicht an. Wenn die Geschwindigkeit so weiter geht, sollte ich in 2-3 Monaten durch sein."}, {"24": "Update. Stehe jetzt kurz vor Kapitelende. Die letzten Forschungen ziehen sich über Wochen. Sobald man alle Brutstätten ausgebaut und verbunden hat braucht m,an kein Zusatzmana mehr... Das dauert aber. Aufgrund der unintuitiven 6-Stunden-Bauzeit für die Monster dauert es gefühlt sehr lang. Man dümpelt halt weiter. Viel umbauen wollen sollte man in diesem Kapitel nicht, eher noch mehr abreissen. Auf der andren Seite... Naja. Ich musste auch nicht viel denken. Und die erleuchteten Güter braucht man kaum. Ich kam mit je einer Manufaktur prima hin. Man braucht sie primär für den Ausbau der Türme... Und die Kosten sind recht locker, zumal man die Türme eh nur für den Verkauf baut (die Ress die sie bringen kriegt man besser per Segen).[BR][BR]Letztlich ist das Kapitel abgesehen vom Platz- und Manabedarf sehr simpel gehalten. Nur dass es sich eeewig zieht, ohne das kleinste bisschen taktieren... Baut euer DK aus, wenn ihr das nicht schon habt.[BR][BR]Ich empfand das Kapitel... Als langwierig. Mal gucken was als nächstes kommt. In 1-2 Wochen sollte ich durch sein. Vielleicht auch 3."}, {"4": "Feytala1986 schrieb:\t\t\tUpdate. Stehe jetzt kurz vor Kapitelende. Die letzten Forschungen ziehen sich über Wochen. Sobald man alle Brutstätten ausgebaut und verbunden hat braucht m,an kein Zusatzmana mehr... Das dauert aber. Aufgrund der unintuitiven 6-Stunden-Bauzeit für die Monster dauert es gefühlt sehr lang. Man dümpelt halt weiter. Viel umbauen wollen sollte man in diesem Kapitel nicht, eher noch mehr abreissen. Auf der andren Seite... Naja. Ich musste auch nicht viel denken. Und die erleuchteten Güter braucht man kaum. Ich kam mit je einer Manufaktur prima hin. Man braucht sie primär für den Ausbau der Türme... Und die Kosten sind recht locker, zumal man die Türme eh nur für den Verkauf baut (die Ress die sie bringen kriegt man besser per Segen).[BR][BR]Letztlich ist das Kapitel abgesehen vom Platz- und Manabedarf sehr simpel gehalten. Nur dass es sich eeewig zieht, ohne das kleinste bisschen taktieren... Baut euer DK aus, wenn ihr das nicht schon habt.[BR][BR]Ich empfand das Kapitel... Als langwierig. Mal gucken was als nächstes kommt. In 1-2 Wochen sollte ich durch sein. Vielleicht auch 3.\t\tZum Vergrößern anklicken....Ich bin in den letzten Zügen, noch die beiden letzten Forschungen machen. Und die ziehen sich halt. Insgesamt ist dieses Kapitel extrem manaintensiv, ich kriege um die 1 Mio Mana täglich aus meinen Managebäuden und habe trotzdem rund 1.000 FF verbraucht bei einem Drachenkloster auf 30. Dafür brauche ich aber insgesamt rund 3 Monate insgesamt für dieses Kapitel, was für mich schon recht lange ist. [BR][BR]Anfangs hatte ich auch 3 erleuchtete Manus und teilweise 3 Händler. Damit wars machbar.[BR][BR]Ich habe derzeit 16 Brutstätten auf 4, 2 auf 1 und eine auf drei. [BR][BR]Mein Mann hat gerade das Kapitel beendet, indem er die letzte Forschung und den letzten Ausbau des Portals auf 4 einfach geboostert hat, allerdings gingen dafür rund 500 5h Zeitbooster drauf. Insgesamt war er rund 5 Monate am Kapitel."}, {"91": "Was man mit 500x 5h hätte an Truppen produzieren können [smilie--sprite12]"}, {"4": "Ich habs geschafft! Habs mir aufgeschrieben, das allererste Gebäude aus diesem Kapitel für die Gastrasse habe ich am 2. Mai 2022 gestellt und heute bin ich fertig. Genau 3 Monate und 2 Tage.[BR][BR]Nur heute hab ich die letzten 20.000 schwarzen Kreaturen geboostert, ansonsten normal gespielt. Allerdings hab ich die gesamten Gebäude nicht ausbauen lassen, sondern alle Ausbauten mit Zeitboostern abgekürzt, so dass gesetzte Gebäude auch sofort verwendbar waren.[BR][BR]Insgesamt standen bei mir am Schluss 16 Brutstätten auf 4, 1 x auf 3 und 2 x auf 2, mehr Platz war einfach nicht da."}, {"98": "Seit März habe ich mich geweigert, überhaupt anzufangen, aber nun habe ich vor ein paar Tagen begonnen und baue noch Türmchen auf und ab. Ziemlich sinnlos vom Gefühl her, und schon an diesem Punkt unangenehm langwierig: 144 weiße Türme, 72 schwarze. Dabei hat der wirklich nervige Teil mit dem Sammeln der Kreaturen noch gar nicht angefangen. [BR]Haseli schrieb:\t\t\tneue Gastrasse - ja okay, ich will ja weiter kommen, aber Spaß? Es hat wirklich viel mit warten zu tun, das ist eigentlich auch nicht das Problem, warten hat aber nichts mit Spaß zu tun.[BR]Was micht stört, dass einiges an Platz in dieser Zeit nicht zur Verfügung steht, den ich gern für andere Sachen nutzen würde. Ich hab soviel schöne Eventgebäude im Gepäck, die ich gern aufstellen würde, auch mal wechseln, öfter umbauen, aber geht nicht, kein Platz und wenn dann irgendwann doch Platz ist, sind sie definitiv nicht mehr effizient. Ich sag nur schade um die viele Mühe, die sich die Designer machen.[BR]Danach, nach Effizienz, hab ich meine Stadt eh nicht gebaut, zuviel Straßen, zuviel grün....Hat halt jeder so seine Vorlieben, aber solange die Gastrasse läuft und die läuft lange, kann ich das vergessen.[BR]Ich baue gern an meiner Stadt, das kann ich während der Gastrasse nicht, und das ist es, was mich stört\t\tZum Vergrößern anklicken....Das ist genau auch mein Problem mit Gastrassen: Schöne Eventgebäude, die ich gern hinstellen würde, müssen im Inventar bleiben. Dafür habe ich über Monate und Monate immer dieselben langweiligen Gastrassengebäude stehen. [BR]Schön wäre es, wenn man alle Gastrassengebäude, auch das Portal, einlagern könnte. Dann könnte man sich zwischendurch mal ein paar Wochen Verschnaufpause gönnen und etwas anderes sehen."}, {"21": "Cailin schrieb:\t\t\tSeit März habe ich mich geweigert, überhaupt anzufangen, aber nun habe ich vor ein paar Tagen begonnen und baue noch Türmchen auf und ab. Ziemlich sinnlos vom Gefühl her, und schon an diesem Punkt unangenehm langwierig: 144 weiße Türme, 72 schwarze. Dabei hat der wirklich nervige Teil mit dem Sammeln der Kreaturen noch gar nicht angefangen.[BR][BR]Das ist genau auch mein Problem mit Gastrassen: Schöne Eventgebäude, die ich gern hinstellen würde, müssen im Inventar bleiben. Dafür habe ich über Monate und Monate immer dieselben langweiligen Gastrassengebäude stehen.[BR]Schön wäre es, wenn man alle Gastrassengebäude, auch das Portal, einlagern könnte. Dann könnte man sich zwischendurch mal ein paar Wochen Verschnaufpause gönnen und etwas anderes sehen.\t\tZum Vergrößern anklicken....Die Türme kann man gewaltig beschleunigen (sofern man die Ressourcen hat) indem man sie hinstellt und sofort wieder verkauft- ohne Aufbauzeit, ohne Platzbedarf.... so hab ich das damals gemacht^^"}, {"4": "Vorsicht, nicht alle Türme schwarz und weiß komplett bauen. Es gibt nachher noch Quests, die ebenfalls schwarze und weiße Türme verlangen."}, {"203": "Ich hoffe nur, dass Inno einen Warnhinweis für Spieler unter 18 Jahren einfügt, denn wenns inzwischen sadistisch und pervers ist, würden die Probleme bekommen... Aber wenn man so über das schöne Spiel denkt, kann man auch aufhören damit. Wird niemand gezwungen so ein Spiel zu spielen"}, {"103": "in diesem Spiel ist nichts sadistisch und auch nichts pervers,[BR]ich bitte darum, von solchen Aussagen abzusehen, die jetzt hier mehrfach angebracht wurden."}, {"8": "littleFlex schrieb:\t\t\tin diesem Spiel ist nichts sadistisch und auch nichts pervers,\t\tZum Vergrößern anklicken....Sowas liegt immer im Auge des Betrachters [smilie--sprite2][BR][BR]Zu SM gehört immer auch M! lauter M's... die Fanbase! [smilie--sprite6][BR]...deshalb ist der Erfolg dieses schönen Spieles bereits vorprogrammiert![BR]salandrine schrieb:\t\t\tVorsicht, nicht alle Türme schwarz und weiß komplett bauen. Es gibt nachher noch Quests, die ebenfalls schwarze und weiße Türme verlangen.\t\tZum Vergrößern anklicken....Du, ich bin selbst grad an dem Punkt... Allerdings sind die Türme echt billig... 33k ErlGut1 für einen Blackchip... davon kann ich 2 pro Tag bauen wenn ich fair handle... wenn ich mir aber das Zeug über Kreuz hole, kann ich locker 5 Türme pro Tag bauen!!![BR][BR]...überhaupt: Genug Kreaturen für die ersten Portalausbauten zu bekommen dauert Wochen...[BR]Also keine Sorge [smilie--sprite2][BR]einfach loslegen[BR][BR]Bis kurz vor Ende war das Kapitel echt amüsant... langsam wachsen die leckeren Äpfel...[BR][BR]Aber dann die letzten paar Technologien fühlten sich wie ne Olympus Mons Besteigung an![BR][BR]Mittlerweile:[BR]Es war echt nicht übertrieben mit den Forschungszeiten! [BR]3 Wochen für die letzte Technolgie... \"ultimative Festung\" Endlich geschafft! [smilie--sprite1][BR][BR]Gut, dass auch sonst immer was los ist in elvenar![BR][BR]Ich weiß nicht, welches Kapitel schlimmer war?[BR]Orks, Botschafter oder Rächer???[BR]Zumindest jetzt mit Portalos steht das Ork-Kapitel nicht mehr zur Wahl... Dort kann man jederzeit den Turbo einlegen![BR]Im Gegensatz zu Kap.19  [smilie--sprite6] [BR][BR]Allen Nachfolgenden wünsch ich Sitzfleisch aus Stahl!"}, {"204": "littleFlex schrieb:\t\t\tin diesem Spiel ist nichts sadistisch und auch nichts pervers,[BR]ich bitte darum, von solchen Aussagen abzusehen, die jetzt hier mehrfach angebracht wurden.\t\tZum Vergrößern anklicken....Wenns mehrfach genannt würde, würde mir das zu denken geben xD [BR]Wobei meine persönliche Einstellung eher die ist, das man mit stupidem Warten (um die harmlosere aussage zu wiederholen) seine Spieler auch vergraulen kann. Weil irgendwann schlichtweg keine Herausforderung mehr gegeben ist. Und das langweilt mich."}, {"103": "dann spielst Du vielleicht ein anderes Spiel, als ich^^"}, {"4": "Die letzte Forschung in diesem Kapitel dauert wirklich ätzend lang. Ich hatte dann letztlich abgekürzt mit mit vielen Zeitboostern und auch Dias."}, {"203": "Vielleicht spielt man ein anderes Spiel - allein letzte Woche hörten 7 Spieler auf mit denen, wo ich schrieb... und auf einer Seite kann man ohne Probleme sehen, wieviel Prozent aufhörten zwischen Kapitel 3 und 20 (eine Zahl darf ich ja nicht nennen)... aber das mit den bösen Wörten fiel auch früh auf (Mai - Oktober... auch Elvenarzeit)"}, {"32": "gergerw schrieb:\t\t\trichtig zusammen zucken würde ich erst, wenn 20 Mio. mana pro Ausbau oder 40 Mio. pro Forschung verlangt würden\t\tZum Vergrößern anklicken....das wär doch mal ne gute herausforderung! [smilie--sprite8] [BR]> dacht ich hat mich bei Ustoni's Bemerkung \"Ausbau auf Stufe 30 jeweils 15,83 Millionen Mana!\" verlesen (hab mich auch) - wär mal was neues"}]