[{"184": "Bin noch nicht soweit, freue mich aber immer, wenn ein neues Kapitel die Geschichte von Elvenar weiter erzählt.[BR][BR]Offtopic: Wieder einmal zeigt es sich, daß man es nicht allen recht machen kann.[BR]Werden Kapitel \"einfacher\" gemacht, finden einige, daß es zu einfach und nur stupides Einsammeln ist.[BR]Werden Kapitel \"schwieriger\" gemacht, finden einige daß es zu verschachtelt und kompliziert ist. Na ja........."}, {"185": "Robin7 schrieb:\t\t\t@ Don Tomato, was soll man denn machen? Man hat nur zwei Möglichkeiten es zu spielen oder aufzuhören???\t\tZum Vergrößern anklicken....Da gibts noch andere Optionen:[BR]Pause machen ist doch auch eine Option. Die Option hat den Vorteil das man das Spiel ganz entspannt sehen kann. Man kann ja jederzeit zurueckkehren. Fuer meinen Teil, ich spiele ein oder zwei Jahre... und lege dann mal eine groessere Pause ein... warte eben ein oder zwei Jahre bis ich wieder Lust habe. Innogames hat zwar ein paar Spiele eingestampft, aber die meisten haben eine Laufzeit von ueber 10 Jahren.[BR][BR]Man kann im Spielverlauf stehen bleiben, also nicht mehr weiterforschen. Fuer meinen Teil, wenn ich aktiv bin, mache ein oder zwei Kapitel pro Jahr und wechsle immer dann wenn ich mal ein paar neue Gebaeude sehen moechte."}, {"186": "Ich habe da mal eine Frage zum neuen Wunder vallorianischer Siegelturm. In der Ankündigung steht \" gibt Unurium für das Einsammeln von Gold bei Wohngebäuden \". Wie ist das genau? Gibt es dann Unurium pro einer bestimmten gesammelten Münzmenge, oder pro Abholung von Wohngebäuden?[BR]Falls wirklich das zweite der Fall ist, könnte man sich ja einfach jede Menge Stufe 1-Wohnhäuser in die Stadt stellen. Die kann man schneller und öfter absammeln.[BR]Oder zählen da nur Wohngebäude bestimmter Stufen? Wie ist das, gibt es da schon Infos drüber?"}, {"21": "Melios schrieb:\t\t\tIch habe da mal eine Frage zum neuen Wunder vallorianischer Siegelturm. In der Ankündigung steht \" gibt Unurium für das Einsammeln von Gold bei Wohngebäuden \". Wie ist das genau? Gibt es dann Unurium pro einer bestimmten gesammelten Münzmenge, oder pro Abholung von Wohngebäuden?[BR]Falls wirklich das zweite der Fall ist, könnte man sich ja einfach jede Menge Stufe 1-Wohnhäuser in die Stadt stellen. Die kann man schneller und öfter absammeln.[BR]Oder zählen da nur Wohngebäude bestimmter Stufen? Wie ist das, gibt es da schon Infos drüber?\t\tZum Vergrößern anklicken....[BR]Das geht nach Prozenten - sonst wärs echt zu einfach. Auf meinem Beta screenshot müsste es bei 0,024 % starten auf Stufe 1 - demnach müsste ein - als Beispiel- magisches Wohngebäude Kapitel 18, das in 24 Stunden 740 000 Münzen abwirft mit 0,024 % dann rund 177 Unurium generieren. Bei durchschnittlich 30 Häusern ..... knapp 5330 Unurium in 24 Stunden. Wenn das so stimmt .... für Stufe 1 besser als nix. Meiner Meinung nach ist das Wunder auch eigentlich hauptsächlich dazu gedacht den Unuriumzerfall zu mindern, der Rest ist ne nette Draufgabe.[BR][BR][BR][BR]Turbina hat im Beta-Forum dazu auch einen interessanten Beitrag verfasst -->>https://beta.forum.elvenar.com/inde...-revenge-of-the-exile-discussion.17218/page-3"}, {"2": "Indianaking schrieb:\t\t\tBei durchschnittlich 30 Häusern ..... knapp 5330 Unurium in 24 Stunden\t\tZum Vergrößern anklicken.......hihi - hab bald nur noch 10 (magische) - aber ich freu mich trotzdem auf den Turm - die Verringerung des Zerfalls bringt da aber denk ich wesentlich mehr ^^...."}, {"12": "Auf der Ankündigungsseite gibt es ein ausgegrautes Video, das nicht verfügbar ist (seit mindestens Do. abend).[BR]Frage: Bekommen wir das noch zu sehen bevor das Kapitel in ein paar Tagen anfängt?"}, {"1": "Ayla Ayla schrieb:\t\t\tAuf der Ankündigungsseite gibt es ein ausgegrautes Video, das nicht verfügbar ist (seit mindestens Do. abend).[BR]Frage: Bekommen wir das noch zu sehen bevor das Kapitel in ein paar Tagen anfängt?\t\tZum Vergrößern anklicken....Leider können wir dazu derzeit keine Antwort geben. Frühestens am Montag werden wir selbst darauf eine Antwort erhalten. Ist halt leider Wochenende."}, {"116": "Wie ist das denn mit dem Upgrade der magischen Wohnungen/Werkstätten aus? Kann man das gleich nach der ersten Forschung machen (wie in Kap18), oder muss man dazu erst die neuen Wohnungen erforschen, wie das in Kap 17(?) war?"}, {"91": "Indianaking schrieb:\t\t\tTurbina hat im Beta-Forum dazu auch einen interessanten Beitrag verfasst -->>https://beta.forum.elvenar.com/inde...-revenge-of-the-exile-discussion.17218/page-3Zum Vergrößern anklicken....Diese Rechnung ist wirklich sehr umfassend und detailliert, feine Sache.[BR][BR]Vor einiger Zeit habe ich mal den Tempel der Geister grob hochgerechnet und bin auf durchschnittlich ~60k Unurium täglich gekommen, wobei diese im Zuge der Events natürlich recht unregelmäßig kommen. Also eigentlich ist die Ausbeute dem vallorianischen Siegel überlegen, ähnlich wie beim Drachenkloster - Labyrinth[BR]ABER:[BR]Ich spiele sehr intensiv mit Blühender Händlergilde zzgl Glockenturm und Leuchtturm der guten Nachbarschaft.[BR]Ich habe also locker den doppelten Kulturbonus bei Münzabholung wie Turbina angenommen hat (>300% statt 150%). Mit 20 mag. Wohngebäuden hochgerechnet komme ich dann tatsächlich auch auf etwa 60k Unurium täglich, quasi gleichwertig.[BR]Dabei bekomme ich aber zusätzlich weniger Zerfall und das Unurium kommt gleichmäßiger als beim Tempel der Geister.[BR]Das ist natürlich sehr grob und nicht verallgemeinerbar. Aber wenn man sich für eins der beiden Wunder entscheiden möchte lohnt sich der genaue Blick auf die individuelle Situation. Bei normalem Kulturbonus ist der Tempel der Geister aber mMn klar überlegen"}, {"21": "BlackLabelSociety schrieb:\t\t\tDiese Rechnung ist wirklich sehr umfassend und detailliert, feine Sache.[BR][BR]Vor einiger Zeit habe ich mal den Tempel der Geister grob hochgerechnet und bin auf durchschnittlich ~60k Unurium täglich gekommen, wobei diese im Zuge der Events natürlich recht unregelmäßig kommen. Also eigentlich ist die Ausbeute dem vallorianischen Siegel überlegen, ähnlich wie beim Drachenkloster - Labyrinth[BR]ABER:[BR]Ich spiele sehr intensiv mit Blühender Händlergilde zzgl Glockenturm und Leuchtturm der guten Nachbarschaft.[BR]Ich habe also locker den doppelten Kulturbonus bei Münzabholung wie Turbina angenommen hat (>300% statt 150%). Mit 20 mag. Wohngebäuden hochgerechnet komme ich dann tatsächlich auch auf etwa 60k Unurium täglich, quasi gleichwertig.[BR]Dabei bekomme ich aber zusätzlich weniger Zerfall und das Unurium kommt gleichmäßiger als beim Tempel der Geister.[BR]Das ist natürlich sehr grob und nicht verallgemeinerbar. Aber wenn man sich für eins der beiden Wunder entscheiden möchte lohnt sich der genaue Blick auf die individuelle Situation. Bei normalem Kulturbonus ist der Tempel der Geister aber mMn klar überlegen\t\tZum Vergrößern anklicken....[BR]Für mich ist der Aspekt der Unuriumgewinnung durch die Turmtruhen beim Tempel der Geister eigentlich die Hauptsache. Ich spiele mit Minimalkultur was aber egal ist da ja die erforderliche KU zur Berechnung herangezogen wird. Da Unurium (noch) nicht zB im Turm oder Turnier beim Verhandeln verlangt wird kann man so einfach nebenbei ansammeln und startet in ein neues Kapitel mit genügend Lagerbestand. Ob ich das Vallorianische Siegel aufstelle wird sich zeigen, falls ja dann hauptsächlich um den Zerfall zu reduzieren wenn Unurium in Zukunft permanent gebraucht werden wird."}, {"62": "Ein paar Fragen, die durch die Ankündigung nicht eindeutig beantwortet werde:[BR]-Es gibt keine weiteren Erweiterungen per Weltkartenprovinzen, oder?[BR]-An den Höchststufen der Antiken Wunder wird nichts geändert, oder?[BR]-Welche Güter sind beschränkt, welche nicht, sprich inwieweit helfen Portal-/Gastrassensegen?"}, {"2": "Sreafin schrieb:\t\t\tWelche Güter sind beschränkt, welche nicht, sprich inwieweit helfen Portal-/Gastrassensegen?\t\tZum Vergrößern anklicken.......zumindest das kann ich dir beantworten: mit den Portalsegen lassen sich weiße und schwarze Magie herstellen, die du auch in den Türmen des Lichts bzw. der Dunkelheit herstellen kannst und für die weitere Produktion der Kreaturen in den Zuchtfarmen und im Portal brauchst - die Türme musst du aber trotzdem bauen, da du bei deren Verkauf (sind ablaufende Gebäude - 7 Tage) jeweils 1 weiße bzw. schwarze/dunkle Materie bekommst, die du wiederum für die Umwandlung von Turm des Lichts in Turm der Dunkelheit bzw. zum Ausbau des Portals benötigst - du wirst dazu mindestens 144 Türme bauen müssen (das wird teuer)...ob die dann aber jeweils stehen bleiben müssen, bis sie abgelaufen sind oder man die sofort wieder verkaufen kann, weiß ich leider bisher immer noch nicht...[BR]...laut bisherigen Infos gibt es eine Quest, in der du gleichzeitig 10 Türme und 10 Zuchtfarmen (Lvl 1) haben sollst - die Zuchtfarmen kann man dann aber - gemäß Storyline - wohl reduzieren, denn für Lvl 2 brauchst du dann nur noch 8, für Lvl 3 nur noch 6 (die werden dafür aber größer)....[BR][BR]...für alle Tüftler - auf www.elvenarchitect.com kann man seine Stadt schon mal vorplanen - dabei muss man aber oben rechts die Sprache auf: BETA stellen - in der deutschen Ausgabe ist Kapitel 19 noch nicht enthalten...[BR][BR]...(ich denke schon, daß es wieder eine Erweiterung über Provinzen bzw. 2 neue Premium + 2 neue in der Forschungs gibt, denn es passen noch genau 5 ins derzeitige Umfeld von 13x13 Erweiterungen hinein - für Kapitel 20 brauchen wir dann weitere Reihen)..."}, {"21": "Romilly schrieb:\t\t\t...zumindest das kann ich dir beantworten: mit den Portalsegen lassen sich weiße und schwarze Magie herstellen, die du auch in den Türmen des Lichts bzw. der Dunkelheit herstellen kannst und für die weitere Produktion der Kreaturen in den Zuchtfarmen und im Portal brauchst - die Türme musst du aber trotzdem bauen, da du bei deren Verkauf (sind ablaufende Gebäude - 7 Tage) jeweils 1 weiße bzw. schwarze/dunkle Materie bekommst, die du wiederum für die Umwandlung von Turm des Lichts in Turm der Dunkelheit bzw. zum Ausbau des Portals benötigst - du wirst dazu mindestens 144 Türme bauen müssen (das wird teuer)...ob die dann aber jeweils stehen bleiben müssen, bis sie abgelaufen sind oder man die sofort wieder verkaufen kann, weiß ich leider bisher immer noch nicht...[BR]...laut bisherigen Infos gibt es eine Quest, in der du gleichzeitig 10 Türme und 10 Zuchtfarmen (Lvl 1) haben sollst - die Zuchtfarmen kann man dann aber - gemäß Storyline - wohl reduzieren, denn für Lvl 2 brauchst du dann nur noch 8, für Lvl 3 nur noch 6 (die werden dafür aber größer)....[BR][BR]...für alle Tüftler - auf www.elvenarchitect.com kann man seine Stadt schon mal vorplanen - dabei muss man aber oben rechts die Sprache auf: BETA stellen - in der deutschen Ausgabe ist Kapitel 19 noch nicht enthalten...[BR][BR]...(ich denke schon, daß es wieder eine Erweiterung über Provinzen bzw. 2 neue Premium + 2 neue in der Forschungs gibt, denn es passen noch genau 5 ins derzeitige Umfeld von 13x13 Erweiterungen hinein - für Kapitel 20 brauchen wir dann weitere Reihen)...\t\tZum Vergrößern anklicken....[BR]Die Türme müssen nicht 7 Tage stehenbleiben sondern können nach dem Bau sofort verkauft werden. Die Zuchtfarmen für die Quest zu verkaufen ist echt kontraproduktiv - da durch die große Menge an benötigten hellen, dunkel und ultimativen (Kreaturen) jede Zuchtfarm gebraucht wird. Meine Planung sieht letztendlich 15 davon vor [smilie--sprite6]"}, {"2": "Indianaking schrieb:\t\t\tDie Zuchtfarmen für die Quest zu verkaufen ist echt kontraproduktiv - da durch die große Menge an benötigten hellen, dunkel und ultimativen (Kreaturen) jede Zuchtfarm gebraucht wird\t\tZum Vergrößern anklicken.......naja - kommt halt auf den vorhandenen Platz an [smilie--sprite2] - aber wenn die Türme gleich wieder weg können - hilft mir das auch weiter [smilie--sprite1][BR][BR]...die Zuchtfarmen sollte man ja auch einlagern können..."}, {"19": "Im Beta Wiki gibt es die ersten Infos zur neuen Gastrasse [BR][BR]\t\t\thttps://en.wiki.elvenar.com/index.php?title=Revenge_of_the_Exile\t\t"}, {"57": "um wieviel Uhr kommt den jetzt das Update, wir warten schon alle ? [smilie--sprite7]"}, {"6": "Die Ankündigung zum Update ist im Spiel gerade erschienen. Wird also wohl 14 Uhr werden."}, {"21": "ustoni schrieb:\t\t\tDie Ankündigung zum Update ist im Spiel gerade erschienen. Wird also wohl 14 Uhr werden.\t\tZum Vergrößern anklicken....[BR].....oder wie beim letzten Mal nach 16.00 Uhr, bis dann alle updates auf allen servern durch sind ....."}, {"90": "Indianaking schrieb:\t\t\t.....oder wie beim letzten Mal nach 16.00 Uhr, bis dann alle updates auf allen servern durch sind .....\t\tZum Vergrößern anklicken....Auch beim letzten mal war es kurz nach 14:00 soweit."}, {"16": "Also bei mir hat das Update gerade gestartet - zumindest wurde ich mit einer \"wir Warten gerade\"  Meldung aus dem Spiel gekickt^^"}]