[{"21": "Tobias1 schrieb:\t\t\tAuch beim letzten mal war es kurz nach 14:00 soweit.\t\tZum Vergrößern anklicken....[BR]Definitiv nicht, bei den posts von 14.59 am 29. April wars noch nicht da, ist aber eh wurscht.[BR][BR]Ich füg mal das Zitat von Jens ein - beim letzten Kapitel:[BR][BR][BR]29. Apr 2021[BR]#40Ihr spielt schon so lange und jedesmal müssen wir sagen, erst wenn das Update bei allen Sprachen durch ist (DE ist nicht allein^^) , dann wird das neue Kapitel aktiviert. [smilie--sprite2]"}, {"57": "ist trotzdem noch nicht angekommen..."}, {"6": "Allerdings ohne Kapitel 19.[BR]Sicher, dass das heute noch beginnt?"}, {"16": "jens333 schrieb:\t\t\tIhr spielt schon so lange und jedesmal müssen wir sagen, erst wenn das Update bei allen Sprachen durch ist (DE ist nicht allein^^) , dann wird das neue Kapitel aktiviert.\t\tZum Vergrößern anklicken....Ich zitiere hier mal ganz frech aus dem Feedbackthread des letzten Kapitel  (und ja ich hatte das auch wieder vergessen, das die Freischaltung dann ja später erfolgt - my bad).[BR]Mit anderen Worten: Wir hätten es bisher zumindest noch nicht erfahren, dass es nicht heute beginnt [smilie--sprite2] Also abwarten und Tee trinken - heute hat ja noch einige Stunden [smilie--sprite1]"}, {"88": "ist ja auch nicht so das die Gastrasse nicht schon seit ca einem Monat verspätet ist, die letzten Jahre kam die 2. Gastrasse des Jahres immer gegen Ende Oktober"}, {"50": "Die zugehörige Provinzerweiterung zu Kapitel XIX wurde mit dem Update bereits freigeschaltet. Also heisst es noch abwarten, bis die Gastrasse dann auch endlich Einlass in die Welt von Elvenar erhält."}, {"21": "LexiTargaryen schrieb:\t\t\tIch zitiere hier mal ganz frech aus dem Feedbackthread des letzten Kapitel  (und ja ich hatte das auch wieder vergessen, das die Freischaltung dann ja später erfolgt - my bad).[BR]Mit anderen Worten: Wir hätten es bisher zumindest noch nicht erfahren, dass es nicht heute beginnt [smilie--sprite2] Also abwarten und Tee trinken - heute hat ja noch einige Stunden [smilie--sprite1]Zum Vergrößern anklicken....[BR]Hab ich doch oben schon geschrieben [smilie--sprite7][BR]Questor Thews schrieb:\t\t\tist ja auch nicht so das die Gastrasse nicht schon seit ca einem Monat verspätet ist, die letzten Jahre kam die 2. Gastrasse des Jahres immer gegen Ende Oktober\t\tZum Vergrößern anklicken....[BR]...und das stimmt, genau einen Monat verspätet. Bin ja schon froh daß sie überhaupt noch kommt nach den messages vom beta-server vor einigen Wochen- von wegen kommt erst nächstes Jahr ..... und so....[smilie--sprite10]"}, {"6": "Questor Thews schrieb:\t\t\tist ja auch nicht so das die Gastrasse nicht schon seit ca einem Monat verspätet ist,\t\tZum Vergrößern anklicken....Stimmt, so gesehen macht die Wartezeit jetzt bestenfalls ein paar Promille aus. [smilie--sprite8]"}, {"1": "Die Gastrasse verzögert sich noch. Vielleicht hat sich der Verbannte verlaufen oder findet nicht mehr aus.dem Nebelwald, vielleicht ärgert er auch nur gerade ein paar Devs die gerade daran arbeiten, ein Problem zu lösen..."}, {"21": "Tacheless schrieb:\t\t\tDie Gastrasse verzögert sich noch. Vielleicht hat sich der Verbannte verlaufen oder findet nicht mehr aus.dem Nebelwald, vielleicht ärgert er auch nur gerade ein paar Devs die gerade daran arbeiten, ein Problem zu lösen...\t\tZum Vergrößern anklicken....[BR]deja vu [smilie--sprite6]"}, {"1": "Indianaking schrieb:\t\t\tdeja vu [smilie--sprite6]Zum Vergrößern anklicken....Wir wollten euch halt jetzt nicht erschrecken, wenn es tatsächlich ganz ohne Probleme direkt laufen würde. [smilie--sprite2]"}, {"6": "Tacheless schrieb:\t\t\tDie Gastrasse verzögert sich noch. Vielleicht hat sich der Verbannte verlaufen oder findet nicht mehr aus.dem Nebelwald, vielleicht ärgert er auch nur gerade ein paar Devs die gerade daran arbeiten, ein Problem zu lösen...\t\tZum Vergrößern anklicken....Solch präzise und ausführliche Aussagen verblüffen mich immer wieder. [smilie--sprite11]"}, {"1": "ustoni schrieb:\t\t\tSolch präzise und ausführliche Aussagen verblüffen mich immer wieder. [smilie--sprite11]Zum Vergrößern anklicken....Echt? Du bist doch schon so lange dabei, da solltest du meine Aussagen doch aber kennen! Ich nehme das jetzt persönlich... [smilie--sprite7]"}, {"6": "Tacheless schrieb:\t\t\tEcht? Du bist doch schon so lange dabei, da solltest du meine Aussagen doch aber kennen!\t\tZum Vergrößern anklicken....Und? Ist doch kein Hinderungsgrund. [smilie--sprite2][BR]Torsten Sträter schau ich auch immer wieder gerne - und das auch schon seit Jahren. [smilie--sprite1]"}, {"36": "Torsten Sträter mag ich auch sehr gerne, immer wieder! [smilie--sprite1][BR][BR]& Kapitel 19 sollte jetzt aktiv sein. [smilie--sprite2]"}, {"1": "So, jetzt ist das neue Kapitel da. Dürft euch jetzt wieder beruhigen. [smilie--sprite8]"}, {"86": "Jetzt sind sie ja da und alle hoffentlich zufrieden. [smilie--sprite2] Da die Wunder diesmal Pflicht sind, muss ich wohl noch länger warten.."}, {"57": "keine quests ?"}, {"88": "Hast du schon die erste Forschung durch ?"}, {"57": "klar, schon turm des lichts usw freigeschaltet sogar[BR]edit: hat sich aufgeklärt musste Quests ablehnen, jetzt hab ich Quest Dunkle Omen"}]