[{"16": "Schon versucht mal eine Schleifenquest zu erledigen oder abzulehnen?"}, {"187": "Was ist eine Schleifenquest?[BR]Bei uns in Khelonaar ist noch nix passiert.[BR][BR]Was muss man tun, damit das Event startet?"}, {"52": "Irgendeine Quest mal abbrechen, dann sollten die Storyquests für das neue Kapitel starten."}, {"187": "hmm, was zählt denn zu Questen?[BR]Unsere Gemeinschaft wundert sich, dass niemand am Kapitel 19 mitmachen kann.[BR]Habe z.B. nur eine Produktion laufen.[BR]Oder muss man die 18 Kapitel vorher mitgemacht haben?"}, {"1": "@OnkelFax Ja, du musst natürlich erst mal die vorhergehenden Kapitel erledigt haben."}, {"187": "Ok, dann können wir alle ja wieder zur Tagesordnung übergehen.[BR]Wir sind alle noch recht neu in der Gemeinschaft.[BR][BR]Danke für die Infos.[BR][BR]Also ein Event nur für alte Hasen.[BR]Schade.[BR][BR]Wird ja bestimmt auch mal wieder ein Event für alle geben."}, {"188": "OnkelFax schrieb:\t\t\tWird ja bestimmt auch mal wieder ein Event für alle geben.\t\tZum Vergrößern anklicken....Ein Kapitel ist kein Event, der Forschungsbaum wurde einfach nur für die verlängert, die schon durch sind, damit denen nicht langweilig wird... [smilie--sprite2]"}, {"21": "Tja, das wird bissl dauern .....[BR][BR]Mit voll ausgebauter Hummel gibts dann auf Stufe 2 der Brutstätte in 6 Stunden wenigstens schonmal 106 Kreaturen .... 30 K weiße brauchts für die nächste Forschung [smilie--sprite6][BR][BR]"}, {"57": "wenn turm des Lichts abgelaufen ist, kann ich ihn trotzdem noch zu Turm Dunkelheit ausbauen?"}, {"2": "...wieso habt ihr es denn alle so eilig?....mir fehlt schon wieder Unurium, wird Zeit, daß wieder ein Event läuft  [smilie--sprite2] ..."}, {"189": "Tacheless schrieb:\t\t\tSo, jetzt ist das neue Kapitel da. Dürft euch jetzt wieder beruhigen. [smilie--sprite8]Zum Vergrößern anklicken....[BR]Ganz im Gegenteil, denn ich darf es ja leider nicht spielen, weil ich die beiden Wunder und alle Forschungen auf dem Weg dahin nicht erforscht habe. In den letzten Gastrassen brauchte man die nicht, um weiterzumachen, dieses mal merkwürdigerweise schon. Welchen Sinn Inno darin sieht, Spieler, die die nicht brauchen, dazu zu zu zwingen, die alte Gastrassensiedlung noch mal aufzubauen, erschließt sich mir nicht."}, {"2": "ErestorX schrieb:\t\t\tGanz im Gegenteil, denn ich darf es ja leider nicht spielen, weil ich die beiden Wunder und alle Forschungen auf dem Weg dahin nicht erforscht habe. In den letzten Gastrassen brauchte man die nicht, um weiterzumachen, dieses mal merkwürdigerweise schon. Welchen Sinn Inno darin sieht, Spieler, die die nicht brauchen, dazu zu zu zwingen, die alte Gastrassensiedlung noch mal aufzubauen, erschließt sich mir nicht.\t\tZum Vergrößern anklicken.......kuck nochmal genau hin bei den Wundern - die Anforderungen wurden extra geändert..."}, {"21": "LuxuriantSilver schrieb:\t\t\twenn turm des Lichts abgelaufen ist, kann ich ihn trotzdem noch zu Turm Dunkelheit ausbauen?\t\tZum Vergrößern anklicken....[BR]Hab ich nicht ausprobiert... ich hab mal 48 helle Türme gebaut, nach und nach natürlich, dann gleich 24 davon verkauft und die restl 24 mit der daraus gewonnen hellen Materie gelevelt zu schwarzen Türmen, und die auch gleich wieder verkauft. Jetzt hab ich die fertige 24 x schwarze Materie für den Bau des Portals auf lv 2.[BR]Für die Brutstätten braucht man dann T8 aus den gelevelten Manus. Und damit es nicht zu Missverständnissen kommt: die Fläschchen mit der hellen bzw dunklen Flüssigkeit ist die helle und dunkle Magie- nicht Materie! - und die kann man mit den Portalsegen erzeugen. Das ist auch das einzige was die hellen und dunklen Türme produzieren, deshalb kann man die auch sofort verkaufen, so man möchte.[BR][BR]So oder so wirds dauern. Ich hab jetzt mal mein angespartes Material fast komplett verbraucht und muß für die nächsten Schritte auch wieder ein paar Tage sammeln [smilie--sprite2]"}, {"1": "ErestorX schrieb:\t\t\tGanz im Gegenteil, denn ich darf es ja leider nicht spielen, weil ich die beiden Wunder und alle Forschungen auf dem Weg dahin nicht erforscht habe. In den letzten Gastrassen brauchte man die nicht, um weiterzumachen, dieses mal merkwürdigerweise schon. Welchen Sinn Inno darin sieht, Spieler, die die nicht brauchen, dazu zu zu zwingen, die alte Gastrassensiedlung noch mal aufzubauen, erschließt sich mir nicht.\t\tZum Vergrößern anklicken....Romilly schrieb:\t\t\t...kuck nochmal genau hin bei den Wundern - die Anforderungen wurden extra geändert...\t\tZum Vergrößern anklicken....Korrekt: Man braucht keine Gastrassengüter für die zwei Wunder. Nur Saat und Güter. Wurde mit dem heutigen Update geändert, so wie zuvor auch auf dem Beta-Server."}, {"189": "Tacheless schrieb:\t\t\tMan braucht keine Gastrassengüter für die zwei Wunder.\t\tZum Vergrößern anklicken....[BR]Die zwei Wunder sind nicht das Problem, all die \"Forschungen auf dem Weg dahin\", die man nicht für das authentische Söldnerlager braucht und die man daher auslassen konnte, dagegen schon!"}, {"2": "ErestorX schrieb:\t\t\tDie zwei Wunder sind nicht das Problem, all die \"Forschungen auf dem Weg dahin\", die man nicht für das authentische Söldnerlager braucht und die man daher auslassen konnte, dagegen schon!\t\tZum Vergrößern anklicken.......das wundert mich jetzt aber schon - bist du tatsächlich davon ausgegangen, daß du die Forschungen für die Werkstätten bzw. Manus nicht brauchen wirst?..."}, {"189": "Romilly schrieb:\t\t\t- bist du tatsächlich davon ausgegangen, daß du die Forschungen für die Werkstätten bzw. Manus nicht brauchen wirst?.\t\tZum Vergrößern anklicken....[BR]Für die t7 Manus hab ich sicherheitshalber vorproduziert, aber wenn ich das neue Kapitel anschaue, wäre selbst das überflüssig gewesen, wenn man wie bisher auch ohne Erforschung der Wunder das Kapitel hätte wechseln können! Selbstverständlich hab ich keine Forschung gemacht, die mir höhere Kosten im Turnier bringt, aber sonst nichts Wesentliches!"}, {"57": "kann man gegen den Mineralienmangel bitte irgendwas unternehmen von Innos Seite aus, das ist echt zäh und fast kein Nachschub. [smilie--sprite3]"}, {"69": "Mir macht der letzte Forschungspunkt der neuen GR Kopfzebrechen...es liest sich wie das Ende von Elvenar.[BR][BR]Was sagt Inno dazu? Geht es weiter?"}, {"2": "achilles7453 schrieb:\t\t\tMir macht der letzte Forschungspunkt der neuen GR Kopfzebrechen...es liest sich wie das Ende von Elvenar.[BR][BR]Was sagt Inno dazu? Geht es weiter?\t\tZum Vergrößern anklicken.......naja - an einen Untergang glaube ich jetzt nicht - da hätten sie die neuen Features nicht einführen brauchen und es fehlen ja auch noch einige Technologien in der logischen Reihenfolge - es könnte aber sein, daß die 20er Kapitel wirlich mal komplett anders und viel viel düsterer werden - diese Elemente fehlen mir hier eigentlich auch schon immer..."}]