[{"4": "Ging ja eigentlich gar nicht anders. Ich habe mich schon gefragt, wie die Bauten immer noch prachtvoller, hochherrschaftlicher usw. werden sollen. Alle Bauwerke waren ja irgendwie in der Skala nach oben schon ausgereizt. [BR][BR]Ich denke, mind. 1 Kapitel wird es noch geben, dann muss sich Inno entweder was einfallen lassen oder ....[BR][BR]Also, mind. 1 Jahr kannst du noch sicher Elvenar spielen."}, {"2": "....oooohhhh - wieso gibt es denn nur 3 neue Portraits für Kapitel 19?  [smilie--sprite3] [smilie--sprite3] [smilie--sprite3] [BR][BR][IMG]https://i.ibb.co/x8qmWNY/https-de-forum-elvenar-com-index-php-attachments-avatar-png-26989.png[/IMG]"}, {"17": "achilles7453 schrieb:\t\t\tWas sagt Inno dazu? Geht es weiter?\t\tZum Vergrößern anklicken....logisch gesehn muss es mindestens noch das 20. Kapitel geben für erleuchtete Güter 3 danach werden sie sich was neues denken."}, {"57": "also was ich nicht so prickelnd finde, das man sich die Mineralien/Alraunen/Barrenhandelstelle jetzt im Endeffekt auch noch mit den neuen Gütern teilen muß, und auf Deutsch auf höchstens 6 Möglichkeiten begrenzt sind und nichtmal abbrechbar. Da solltet ihr nochmal drüber nachdenken."}, {"184": "Für mich ist Elvenar eine schöne (Märchen)geschichte, an der ich teilnehme.[BR][BR]Für Kapitel 19 hat man sich wieder einiges einfallen lassen.[BR]Deshalb an dieser Stelle einmal vielen Dank an die Entwickler.[BR][BR]Ich hoffe, daß diese Geschichte noch einige Jahre andauert......."}, {"57": "gibts wo die Quests ?"}, {"90": "LuxuriantSilver schrieb:\t\t\tgibts wo die Quests ?\t\tZum Vergrößern anklicken....Mach eine der 2 Schleifen Quest, oder lehn sie mal ab, dann kommen sie auch zu dir."}, {"2": "Tobias1 schrieb:\t\t\tMach eine der 2 Schleifen Quest, oder lehn sie mal ab, dann kommen sie auch zu dir.\t\tZum Vergrößern anklicken.......ich glaub nicht, daß das damit gemeint war - @LuxuriantSilver sucht bestimmt nach einer Questaufstellung bzw. einem Spoiler..."}, {"57": "ich meine eine Liste aller Quests der Verbannten"}, {"90": "Nur hier:  Cavalieri dello Zombiaco: La Vendetta dell'Esiliato"}, {"57": "wow danke !"}, {"37": "was ich wieder mal schlecht gelöst finde ist, dass Holzproduzenten ( Alraunen ) wieder 5 Kaufleute kaufen müssen, nur um an die Urweltmineralien zu kommen. Da das ja Dia's kostet finde ich es ( so wie bei der letzten Gastrasse auch schon ) ungerecht. Wieso kann man da nicht die Materialien durchwechseln? Wir haben 43 Seiten Urweltmineraliengesuche und kein einziges Angebot, egal wie oft ich gucke. Diese Schiefstände finde ich einfach nicht gut. Vor allem wenn sie wie gesagt Dia's kosten, denn ohne die 5 Kaufleute kommt man gar nicht voran."}, {"2": "Sunwind schrieb:\t\t\twas ich wieder mal schlecht gelöst finde ist, dass Holzproduzenten ( Alraunen ) wieder 5 Kaufleute kaufen müssen, nur um an die Urweltmineralien zu kommen. Da das ja Dia's kostet finde ich es ( so wie bei der letzten Gastrasse auch schon ) ungerecht. Wieso kann man da nicht die Materialien durchwechseln? Wir haben 43 Seiten Urweltmineraliengesuche und kein einziges Angebot, egal wie oft ich gucke. Diese Schiefstände finde ich einfach nicht gut. Vor allem wenn sie wie gesagt Dia's kosten, denn ohne die 5 Kaufleute kommt man gar nicht voran.\t\tZum Vergrößern anklicken.......dann such dir doch jemanden, der Mineralien liefert und tausch dann gezielt mit dem..."}, {"37": "Romilly schrieb:\t\t\t...dann such dir doch jemanden, der Mineralien liefert und tausch dann gezielt mit dem...\t\tZum Vergrößern anklicken....deshalb ist es doch immer noch ungerecht, dass ich Dia's zahlen muss und Mineralienprodder nicht."}, {"57": "derzeit findest aber niemanden für Mineralien, von Aerosolen und Flugpulver ganz zu schweigen. Der Kreuzhandel macht jetzt alles nur noch schlimmer. Wenn man Wunderwachs als Bonusgut hat, ist man mal wieder der Ge........ [smilie--sprite4][smilie--sprite11].[BR]Flugpulver zb wird jetzt gegen Mineralien angeboten, denkt mal drüber nach. [smilie--sprite2]"}, {"190": "Da Kapitel läuft, erst paar Tage geduldig sein du musst..."}, {"62": "Im deutschen Wiki steht, dass die 4*-Zerberusse +20% Schaden durch leichte Fernkämpfer nehmen, ebenso steht es im englischen Wiki. Ist dies ein Tippfehler oder ein \"neues Feature\"?[BR]Spoiler: Bild aus dem Wiki[IMG]https://i.ibb.co/rZph4VZ/https-de-forum-elvenar-com-index-php-attachments-1638102481295-png-27034.png[/IMG]"}, {"2": "Sreafin schrieb:\t\t\tIm deutschen Wiki steht, dass die 4*-Zerberusse +20% Schaden durch leichte Fernkämpfer nehmen, ebenso steht es im englischen Wiki. Ist dies ein Tippfehler oder ein \"neues Feature\"?[BR]Spoiler: Bild aus dem WikiAnhang 27034 ansehenZum Vergrößern anklicken.......das ist bestimmt falsch - genau wie das Plus bei den Priestern....[BR][IMG]https://i.ibb.co/rv1K65Z/https-de-forum-elvenar-com-index-php-attachments-kampf-png-27035.png[/IMG]"}, {"21": "Alriel schrieb:\t\t\tDa Kapitel läuft, erst paar Tage geduldig sein du musst...\t\tZum Vergrößern anklicken....[BR]Da gehts nicht um Geduld denn die Ungleichgewichte werden sich wieder und weiterhin komplett weiterziehen , seit Anfang Kapitel 18 ! gibt es kaum Mineralien durchgehend, und das wird sich durch die Unausgewogenheiten der Güterverteilungen auch nicht ändern. Und eben deshalb ist das kein Problem von Geduld sondern von schlechtem Güterbalancing. Geht jetzt auch mit T8 so weiter - da werden die Aerosole die neuen Mineralien[smilie--sprite11] - zumindest in W2.[BR][BR]Romilly schrieb:\t\t\t...dann such dir doch jemanden, der Mineralien liefert und tausch dann gezielt mit dem...\t\tZum Vergrößern anklicken....[BR]Ja was glaubst Du was wir machen in der Gilde? Wir sind ja auch nicht grad' auf der Nudelsuppe dahergeschwonnen als Topgilde von W2. Wenn es aber insgesamt ein schiefes Güterbalancing gibt zieht sich das selbstredend auch durch die Gilden, und backen kann sich die Mangelgut-Produzenten  leider keiner ....."}, {"88": "da hast ja auch noch die Möglichkeit T8 in T7 umzuwandeln, mit den Kaufleuten, mache ich in Arendyll auch so, bei uns sind die Alraunen das gesuchteste T7 Gut, und ich habe mir 2 x T8 Manus gestellt, und noch brauche ich ausschließlich T7"}]