[{"21": "Questor Thews schrieb:\t\t\tda hast ja auch noch die Möglichkeit T8 in T7 umzuwandeln, mit den Kaufleuten, mache ich in Arendyll auch so, bei uns sind die Alraunen das gesuchteste T7 Gut, und ich habe mir 2 x T8 Manus gestellt, und noch brauche ich ausschließlich T7\t\tZum Vergrößern anklicken....[BR]Das hab ich natürlich auch gemacht, habe auch 2 x T8 und brauche bis auf die letzten 24 Materien + für Material fürs Portal lv 4 Ende des Kapitels keine T 7 Güter mehr weil ich vorproduziert hatte  [smilie--sprite2] Aber meine Mitgildis und alle anderen brauchen noch viel - und deshalb regt mich die verkorkste Schieflage bei den T 7 + T 8 so auf [smilie--sprite3]"}, {"63": "Es macht so kein Spaß wenn der Handel nicht funktioniert und die 6 std Wartezeit ist gepart mit den geringen Mengen und dazu noch der 10% Verfall einfach misst. Das zu beheben seitens inno ist eine Kleinigkeit also ist das Absicht,  dafür ein riesen Dank an inno von mir macht weiter so."}, {"2": "...bitte nicht erschrecken bei Aufgabe 2...[BR][IMG]https://i.ibb.co/KXY3mTD/https-de-forum-elvenar-com-index-php-attachments-k19ab-png-27056.png[/IMG]...man muss keine 600 Provinzen erkunden - es reicht eine...[BR][IMG]https://i.ibb.co/Qc89fsj/https-de-forum-elvenar-com-index-php-attachments-k19ac-png-27057.png[/IMG]....und die Quest ist erfüllt...[BR][BR]@V.E.N.U.S  - das könnte man dann vielleicht im Text abändern in: erkunde eine Provinz"}, {"190": "Gibt es den schon eine richtung wie man die Siedlungsgebäude aufstellen möchte in welcher menge meine ich.Sonst steht ja minium 6 oder wie auch immer."}, {"2": "Romilly schrieb:\t\t\t...laut bisherigen Infos gibt es eine Quest, in der du gleichzeitig 10 Türme und 10 Zuchtfarmen (Lvl 1) haben sollst - die Zuchtfarmen kann man dann aber - gemäß Storyline - wohl reduzieren, denn für Lvl 2 brauchst du dann nur noch 8, für Lvl 3 nur noch 6 (die werden dafür aber größer)....\t\tZum Vergrößern anklicken.......danach kommt eine Quest, in der du für Lvl 4 dann auch 4 Stück brauchst - allerdings soll später auch noch eine Quest folgen, in der man 10 Zuchtfarmen auf Level 4 benötigt...[BR][BR]....wenn du genug Portalsegen hast, baust du die Türme eigentlich nur, um sie zu verkaufen - von den Zuchtfarmen solltest du aber so viele bauen, wie du irgendwie unterbringen kannst....[BR][BR]...man müsste die Zuchtfarmen auch einlagern/teleportieren können..."}, {"190": "Danke....."}, {"50": "Die erste Aufgabe, in der eine vorgegebene Anzahl an Siedlungsgebäuden für die Storyquest-Reihe abverlangt wurde, war: [BR]20. Besitze 5 Türme -> 2x 5% Portalsegen[BR][BR]Da ich aber einen anderen Forschungsweg eingelegt habe, hänge ich noch ein Weilchen an Aufgabe 21.[BR][BR]Die erste richtig nervige Aufgabe war:[BR]16. Sammle 2.000k Mana UND Baue die Festung der Rache -> 2x Kombinationsauslöser[BR].... und die 2.000k Mana hatte bei mir schon ein paar Tage gedauert, bis ich sie zusammen hatte."}, {"9": "Romilly schrieb:\t\t\t...man muss keine 600 Provinzen erkunden - es reicht eine...\t\tZum Vergrößern anklicken....Nein muss man auch nicht, die Quest ist nur Blöd formuliert ... .. [BR][BR]Erkunde 1 Provinz[BR]oder[BR]Habe mind. 600 Provinzen[BR][BR]So wäre sie korrekt. hier hatte man bereits weit über 600 Provinzen und somit ist die Quest bei vielen bereits automatisch abgeschlossen.[BR][IMG]https://i.ibb.co/YkYQDPT/https-de-forum-elvenar-com-index-php-attachments-1638276841084-png-27060.png[/IMG]"}, {"2": "AngelOfDead schrieb:\t\t\tNein muss man auch nicht, die Quest ist nur Blöd formuliert ... ..\t\tZum Vergrößern anklicken.......das hab ich doch geschrieben - es reicht, eine zu erkunden und die Quest ist erfüllt... - das ODER ist eine Alternative, die ich aber auch nicht bräuchte, wenn ich ebenso 600 Provinzen erkundet haben hätte müssen... und ja, ist blöd formuliert, weil da Provinzen steht - also Mehrzahl..."}, {"9": "Romilly schrieb:\t\t\t...bitte nicht erschrecken bei Aufgabe 2...[BR][IMG]https://i.ibb.co/KXY3mTD/https-de-forum-elvenar-com-index-php-attachments-k19ab-png-27056.png[/IMG] ...man muss keine 600 Provinzen erkunden - es reicht eine...[BR][IMG]https://i.ibb.co/Qc89fsj/https-de-forum-elvenar-com-index-php-attachments-k19ac-png-27057.png[/IMG] ....und die Quest ist erfüllt...\t\tZum Vergrößern anklicken....Romilly schrieb:\t\t\t...das hab ich doch geschrieben - es reicht, eine zu erkunden und die Quest ist erfüllt... - das ODER ist eine Alternative, die ich aber auch nicht bräuchte, wenn ich ebenso 600 Provinzen erkundet haben hätte müssen... und ja, ist blöd formuliert, weil da Provinzen steht - also Mehrzahl...\t\tZum Vergrößern anklicken....Lese ich nirgends heraus aber gut"}, {"17": "Romilly schrieb:\t\t\twenn ich ebenso 600 Provinzen erkundet haben hätte müssen\t\tZum Vergrößern anklicken....ja und genau das ist eben falsch 600 erkundete reichen nicht.[BR]entweder eine erkunden oder 600 fertig abgeschlossen haben und nix dazwischen."}, {"9": "stone2345 schrieb:\t\t\tja und genau das ist eben falsch 600 erkundete reichen nicht.[BR]entweder eine erkunden oder 600 fertig abgeschlossen haben und nix dazwischen.\t\tZum Vergrößern anklicken....Danke!"}, {"2": "stone2345 schrieb:\t\t\tja und genau das ist eben falsch 600 erkundete reichen nicht.[BR]entweder eine erkunden oder 600 fertig abgeschlossen haben und nix dazwischen.\t\tZum Vergrößern anklicken.......genau das sag ich doch schon die ganze Zeit - man braucht da nicht erschrecken... und \"eine erkunden\" steht da eben nicht da - da steht: erkunde Provinzen oder schließe Provinzen ab - also Mehrzahl - und danach kommt ein Zähler...die Aufgabe ist irreführend formuliert..."}, {"21": "Erstens: Brutstätten lassen sich einlagern.[BR]Und egal ob Quest spielen oder nicht: unter 10 Brutstätten auf 4 würd ich gar nicht rechnen, denn das dauert ansonsten wirklich viele Monate ....."}, {"54": "Hallo zusammen, [BR][BR]da ich des englischen kaum mächtig bin und auch nicht übersetzen möchte, warte ich bei einem neiuen Spielelement/Gastrasse immer auf die Items und Item-Erklärungen sobald diese da sind und ich einfach mal drauflos gespielt habe.[BR]Nun habe ich Kapitel 19 angefangen und dementsprechend 2,3 Fragen dazu.[BR]Bitte ned böse sein, wenn die eine oder andere schonmal beantwortet wurden, aber alles durchlesen dauert viel länger als kurz jemanden fragen, der alles dort schon kapiert hat.[BR]Auch gibt es bestimmt einige, die schon ganz weit sind und Erfahrungswerte haben.[BR][BR]Habe gestern einige Lichttürme aufgestellt und gesehen, dass weisse ind schwarze Magie mit Portalsegen hergestellt werden kann.[BR]Wollte daher schauen, was passiert, wenn man diese abreisst und sehe nun meine erste Frage beantwortet: weiße Materie.[BR][BR]Also genügt es, die Türme aufzustellen und sofort wieder abzureissen, richtig? (HQ interessierte mich noch nie)[BR]Wieviel weiße Materie sollte/muss man dann einsammeln, um alle oder einen Großteil der Forschungsaufgaben handeln zu können ?[BR]Dementsprechend zu Beginn aufstellen/abreissen was geht und dann die Brutstätten aufbauen ?[BR][BR]Wie bekomme ich nun die schwarze Materie ? (muss man die Brutstätten auch abreissen dafür?)[BR]Die Kreaturen muss man wohl in den Brutstätten proden.[BR]Wie kommt man dann zu den ultimativen Kreaturen ?[BR][BR]danke im Voraus[BR]HdW"}, {"87": "HerrderWelten schrieb:\t\t\tWie bekomme ich nun die schwarze Materie ? (muss man die Brutstätten auch abreissen dafür?)[BR]Die Kreaturen muss man wohl in den Brutstätten proden.[BR]Wie kommt man dann zu den ultimativen Kreaturen ?\t\tZum Vergrößern anklicken....Aus dem wiki - Die Rache des Verbannten[BR][BR] Schwarze Materie - Erhältst du nur, wenn du deinen Turm der Dunkelheit verkaufst. Kreaturen des Lichts – werden in der Brutstätte produziert Kreaturen der Nacht - werden in der Brutstätte produziert Ultimative Kreaturen – werden in in der Festung der Rache Stufe 2 und 3 produziert"}, {"6": "HerrderWelten schrieb:\t\t\tAlso genügt es, die Türme aufzustellen und sofort wieder abzureissen, richtig?\t\tZum Vergrößern anklicken....Richtig.[BR]HerrderWelten schrieb:\t\t\tWieviel weiße Materie sollte/muss man dann einsammeln, um alle oder einen Großteil der Forschungsaufgaben handeln zu können ?\t\tZum Vergrößern anklicken....Die weiße Materie wird benötigt um den Turm des Lichts zum Turm der Dunkelheit auszubauen. Beim Abriss des Turms der Dunkelheit wird 1x schwarze Materie erzeugt.[BR]Für den Ausbau der Festung der Rache auf Stufe 2 werden 24 schwarze Materie benötigt. Ich meine, dass ich irgendwo gelesen habe, dass diese Menge auch für den Ausbau auf Stufe 3 und 4 benötigt wird.[BR]Folglich werden 72 Türme des Lichts benötigt um 72 weisse Materie zu erzeugen um daraus dann 72 schwarze Materie zu machen.[BR][BR]Ich habe nach Bau der Festung der Rache zunächst 72 Türme des Lichts gebaut und abgerissen.[BR]Die 72 schwarze Materie  erzeuge ich jetzt so nach und nach während ich gleichzeitig Brutstätten baue.[BR]Dazu brauche ich aber erst wieder Unurium - das ist nämlich für den Ausbau des HG und die Forschung der Brutstätten draufgegangen."}, {"17": "HerrderWelten schrieb:\t\t\tDementsprechend zu Beginn aufstellen/abreissen was geht und dann die Brutstätten aufbauen ?\t\tZum Vergrößern anklicken....ja[BR]HerrderWelten schrieb:\t\t\tWie bekomme ich nun die schwarze Materie ? (muss man die Brutstätten auch abreissen dafür?)\t\tZum Vergrößern anklicken....nach dem du 72 Türme des Lichts gebaut hast und abgerissen hast, musst du weitere 72 Türme des Lichts bauen und diese zu Dunklen Türmen ausbauen und dann abreisen.[BR]HerrderWelten schrieb:\t\t\tDie Kreaturen muss man wohl in den Brutstätten proden.\t\tZum Vergrößern anklicken....die Kreaturen des Lichts und Nacht werden in der Brutstätte produziert.[BR]HerrderWelten schrieb:\t\t\tWie kommt man dann zu den ultimativen Kreaturen ?\t\tZum Vergrößern anklicken....die kannst in der Festung Stufe 2 und 3 produzieren."}, {"54": "Danke euch 3 für die schnelle und kurz-gennaue Beschreibung, danke ustoni für den kleinen Produktions-Bericht[BR][BR]Das mit dem Turm der Finsternis = Ausbau Turm des Lichts wusste ich nicht.[BR][BR]Ich bin froh, dass ich den Geistertempel so schnell hochgezogen habe. (auf 28 nun),[BR]warte nun nur noch auf das neue Event, dann gibt's gut Unurium ...[BR][BR]Ich seh eher das Problem in den erleuchteten Gütern - zum Glück hatte ich damals 4 Manus auf 32 hochgezogen, hatte die ganze Zeit 2 genutzt, habe nun mal einen dritten wieder rausgeholt.[BR]Genauso bei den nun gebrauchten erleuchteten Gütern Stufe 8, da hab ich 2 vor längerer Zeit hochgezogen und nun ist bald die dritte Manu einsatzbereit.[BR]Bleibt noch das Saat-Problem - da bin ich etwas verärgert, dass offenbar zeitgleich mit dem Bedarf die Angebote der Verkaufsstände in der AKA kräftig reduziert wurden.[BR][BR]Ich habe seit Beginn des neuen Kapitels gerade mal einen bekommen, vorher wesentlich öfter ...[BR]Ich mache ab und an Tests mit 10-20x die Aka neu starten - weit und breit kein Verkaufsstand mehr in Sicht -[BR]auch in anderen Welten/Accounts nichts ...[BR][BR]Da ja bekanntlich die Häufigkeit einstellbar ist von Seiten Inno, finde ich das sehr \"überraschend\", weil bestimmt so geplant,[BR]warum auch immer ...[BR](Das gleiche gab es eine Zeit lang mit dem Futter: viele Event-Hauptpreise zum Füttern zu gewinnen und im gleichen Maße weniger Futter in der AKA (zum Dschinn, damals Brunnen sag ich jetzt nix, da OT)[BR][BR]HdW"}, {"87": "HerrderWelten schrieb:\t\t\terleuchteten Gütern\t\tZum Vergrößern anklicken....Hier ist eine Tabelle mit den Forschungskosten Kapitel 19. Original ist auf Englisch: Revenge of the Exile Ch19[BR]Wenn Du selber Eintragungen machen möchtest: Oben links, Datei, \"Kopie erstellen\".[BR]EDIT: Quelle der Tabelle ist debwot. "}]