[{"54": "Cruller schrieb:Hier ist eine Tabelle mit den Forschungskosten Kapitel 19. Original ist auf Englisch: Revenge of the Exile Ch19[BR]Wenn Du selber Eintragungen machen möchtest: Oben links, Datei, \"Kopie erstellen\".Zum Vergrößern anklicken....Danke für die Tabelle ! - Top Arbeit ![BR][BR]Die Forschungskosten hatte ich mir selbst mal ausgerechnet anhand der ersten Kopie des Forschungsbaumes auf beta[BR]nur die \"Feinheiten\", die ich gerade erfragt habe, kann man ja erst rausbekommen, sobald der Baum in Deutsch eingeblendet wird - ist ansich nicht wirklich tragisch, man muss je eh erstmal die Grund-Forschungen erledigen und hat so immer genügend Zeit, sich in eine neue Gastrasse hineinzuarbeiten, wie ich es gerade mache.[BR][BR]edit:[BR]Habe eben eine ganz wichtige Info entdeckt, die bisher hier niemand geschrieben hatte:[BR][BR]Die erste Runde Türme hatte ich mit Zeitboostern fertig gestellt.[BR][BR]Nun habe ich mal probiert, einen Turm aufzustellen und sofort wieder abzureissen - gibt sofort eine weiße Materie ! (Zeit/Booster gespart)[BR]Für die schwarze Materie muss man dann die 2h durchlaufen lassen (wenn man Zeit hat), ausbauen und dann sofort löschen und hat direkt eine schwarze Materie[BR]Da muss man also nie auf einmal machen, sondern immer mal zwischendurch, wenn Materie gefordert ist.[BR](Meist muss man ja eh auf irgendwas anderes noch warten)[BR][BR]Also braucht man ansich nur einen Platz für einen weißen Turm und kann den resltichen Platz für die Brutstätten nutzen, die man ja in größerer Menge aufstellen muss.[BR][BR]Coole Sache - nicht so Platzintensiv wie befürchtet ...[BR][BR]HdW"}, {"87": "HerrderWelten schrieb:\t\t\t- Top Arbeit !\t\tZum Vergrößern anklicken....Die englische Tabelle ist von debwot. Möchte mich da nicht mit fremden Federn schmücken. [smilie--sprite10]"}, {"54": "stone2345 schrieb:\t\t\t-cut-[BR]nach dem du 72 Türme des Lichts gebaut hast und abgerissen hast, musst du weitere 72 Türme des Lichts bauen und diese zu Dunklen Türmen ausbauen und dann abreisen.[BR]-cut-\t\tZum Vergrößern anklicken....[BR]Nochmal zum Nachhaken:[BR][BR]also brauche ich 72 weiße Materie, um 72 schwarze Materie herstellen zu können, richtig ?[BR][BR]wozu brauche ich die 72 schwarze Materie ?[BR][BR]HdW"}, {"87": "HerrderWelten schrieb:\t\t\twozu brauche ich die 72 schwarze Materie ?\t\tZum Vergrößern anklicken....Für den Ausbau der Festung der Rache.[BR][IMG]https://i.ibb.co/st54b7D/https-de-forum-elvenar-com-index-php-attachments-1638378678142-png-27101.png[/IMG]"}, {"54": "Cruller schrieb:Für den Ausbau der Festung der Rache.[BR]Anhang 27101 ansehenZum Vergrößern anklicken....[BR]Wollte nur sicher gehen, dass da nicht was übersehen wurde ...[BR]also brauche ich die weiße Materie ansich ausschliesslich, um schwarze herstellen zu können.[BR]für nix anderes ...[BR][BR]ok, alles klar[BR][BR]HdW"}, {"12": "@Cruller:[BR]wo hast Du denn die Übersicht für die Festung her? Bei mir kommt im Wiki unter der Kachel \"Festung der Rache\" noch immer eine leere Seite. (Wenigstens hat die Turm-Seite bzw. Brutstätte einen Inhalt.)"}, {"87": "Ayla Ayla schrieb:\t\t\two hast Du denn die Übersicht für die Festung her?\t\tZum Vergrößern anklicken....Ganz normal im Wiki ausgewählt. Gastrassen, Rache des Verbannten ... Festung der Rache Übersicht ...  Evtl. hast Du noch nen alten Cookie drin?"}, {"12": "Cruller schrieb:Ganz normal im Wiki ausgewählt. Gastrassen, Rache des Verbannten ... Festung der Rache Übersicht ...  Evtl. hast Du noch nen alten Cookie drin?Zum Vergrößern anklicken....Sehr sonderbar. Nachdem ein refresh im Chrome nichts fruchtete hab ich extra Edge (den ich sonst nie benutze) aufgemacht, und auch dort kommt dann über die Kacheln eine leere Seite  Fortress of Revenge – Elvenar Wiki DE .[BR][BR]Nachtrag: über den link im Text auf der Turm-Seite kommt eine Seite mit Inhalt: https://de.wiki.elvenar.com/index.php?title=Festung_der_Rache - offenbar ist die Kachel falsch verlinkt worden."}, {"87": "Ayla Ayla schrieb:\t\t\tüber die Kacheln eine leere Seite\t\tZum Vergrößern anklicken....Komisch. Bei mir funktionieren die Kacheln. Hast Du mal die wiki-Cookies gelöscht?[BR][BR]Edit: Habe es rausgefunden. Wenn Du in der Kachel auf den Elvenar-Baum klickst, kommt diese Fortress of Revenge-Seite. Man muss also auf das Geschriebene (Verlinkung) klicken."}, {"12": "Cruller schrieb:Komisch. Bei mir funktionieren die Kacheln. Hast Du mal die wiki-Cookies gelöscht?[BR][BR]Edit: Habe es rausgefunden. Wenn Du in der Kachel auf den Elvenar-Baum klickst, kommt diese Fortress of Revenge-Seite. Man muss also auf das Geschriebene (Verlinkung) klicken.Zum Vergrößern anklicken....Oh, hab ich gar nicht bemerkt, daß sich hinter der Kachel 2 links verbergen - ich hab immer auf den Baum geclickt, funktioniert bei den 3 anderen Grafiken ja auch...   Danke [smilie--sprite1]"}, {"54": "So, ich hab mich nun nochmal genau damit beschäftigt und 2 \"Stolpersteine\" gefunden[BR][BR]Was keiner geschrieben hatte: man muss ja die weiße Materie wieder abgeben, um die schwarze zu erhalten.[BR]Nun hatte ich den Fehler gemacht, zuerst mal die Türme des Lichts wieder abzureissen, da ich die Ausbauten auf schwarze Türme wegen Alraunemangel noch nicht erledigen konnte.[BR]Wenn ich nun irgendwann wieder schwarze Materie herstellen kann (Alraunen sind leergefegt auf dem Markt und ich muss meist 6h warten (schonwieder ...)), stelle ich ja immer wieder weiße Materie neu her, also wäre die weiße Materie der gelöschten weißen Türme wohl verloren ...[BR]Inclusive vieler tausend wertvoller erleuchteter Güter ...[BR][BR]Damit andere da nicht auch reinfallen, formuliere ich das nun so (für Portalsegen-Nutzer !):[BR][BR]Man sollte (zwingend) die weißen Türme zuerst auf schwarze upgraden können (erweckte Güter prüfen !), bevor man sich entschliesst, diese aufzustellen.[BR]Da doch sehr viele Güter verlangt werden, wär ein Tip von mir, die weißen/schwarzen Türme Stück für Stück nur dann aufzustellen und sofort nach Erhalt der schwarzen Materie wieder abzureissen, also (mein Fehler) nicht die weißen Türme abreissen, wie ich aus den ersten Infos fälschlicher Weise gemacht hatte.[BR]Es langt dafür ansich ein einziger 4x4-Platz beim Portal, den restlichen Platz kann man für die Brutstätten verwenden.[BR]Man verwendet ja jeweils 24 schwarze Materie pro Ausbau, also kann man sich ja Zeit lassen und immer mal wieder zwischendrin ein paar schwarze Materien herstellen, bis die Forschung so weit erreicht ist.[BR][BR](hab ich jetzt nicht für die geschrieben, die mit Eiltempo immer fertig werden wollen)[BR][BR]Hier die benötigten erleuchteten Güter für die 72 schwarzen Materien:[BR][BR]Stahl-BG:[BR][BR]8900 Barren x 72 = 640.800 Barren[BR]24.000 Alraune x 72 = 1.728.000 Alraune[BR][BR]Holz-BG:[BR][BR]640.000 Alraune[BR]1.728.000 Mineralien[BR][BR]Marmor-BG:[BR][BR]640.000 Mineralien[BR]1.727.000 Barren[BR][BR]und das bei 2200 pro Tausch (bis zum ersten HG-Ausbau) ....   :-([BR][BR]HdW"}, {"2": "HerrderWelten schrieb:\t\t\tstelle ich ja immer wieder weiße Materie neu her, also wäre die weiße Materie der gelöschten weißen Türme wohl verloren ...[BR]Inclusive vieler tausend wertvoller erleuchteter Güter\t\tZum Vergrößern anklicken.......Häh? Wieso? Wenn du einen weißen Turm verkaufst, bekommst du weiße Materie um einen anderen weißen Turm zu einem schwarzen Turm umbauen zu können, bei dessen Verkauf du dann schwarze Materie bekommst, die du wiederum zum Ausbau des Portal brauchst - ist doch eigentlich ganz einfach - insgesamt wirst du 144 weiße Türme bauen müssen, von denen du dann die Hälfte, also 72, in schwarze Türme umwandeln (und verkaufen) musst...und ja, das kostet enorm viel - ist aber die Hürde in diesem Kapitel und das Kapitel ist nicht darauf ausgelegt, daß man in 6 Wochen damit fertig ist..."}, {"54": "Romilly schrieb:\t\t\t...Häh? Wieso? Wenn du einen weißen Turm verkaufst, bekommst du weiße Materie um einen anderen weißen Turm zu einem schwarzen Turm umbauen zu können, bei dessen Verkauf du dann schwarze Materie bekommst, die du wiederum zum Ausbau des Portal brauchst - ist doch eigentlich ganz einfach - insgesamt wirst du 144 weiße Türme bauen müssen, von denen du dann die Hälfte, also 72, in schwarze Türme umwandeln (und verkaufen) musst...und ja, das kostet enorm viel - ist aber die Hürde in diesem Kapitel und das Kapitel ist nicht darauf ausgelegt, daß man in 6 Wochen damit fertig ist...\t\tZum Vergrößern anklicken....[BR]Wie gut, dass ich das oben geschrieben hatte, ja du hast recht, man bekommt ja die weiße Materie erst beim Abriss des weißen und muss dann den weißen nochmals aufbauen und die vorher erhaltene weiße nutzen zu können zum upgraden.[BR][BR]Ok, dann doch nix verschwendet...[BR][BR]danke[BR][BR]HdW"}, {"6": "Die Grundidee mit den Kaufleuten ist ja prinzipiell nicht schlecht. Theoretisch sollte es beim Start eines neuen Kapitels ja so aussehen, dass die erleuchteten Bonusgüter relativ gleichmäßig verteilt sind. Bei T7 (Mineralien, Barren, Alraunen) funktioniert dies ja inzwischen auch sehr gut.[BR][BR]Bei T8 sieht das leider wieder völlig anders aus. 56 Seiten Angebote von erleuchteten Gütern. Davon 3 Seiten T7 und 53 Seiten T8.[BR]Die 53 Seiten bestehen ausschließlich aus Angeboten von Wunderwachs - klar, ist ja auch mein Bonusgut.[BR][BR]Soweit also zu Theorie und Praxis. Es wird wohl noch recht lange dauern, bis sich das wieder einpendelt.[BR]Speziell zu Beginn eines neuen Kapitels sollte sich Inno etwas einfallen lassen um dem Ungleichgewicht entgegenzusteuern.[BR][BR]Ist ja jetzt schon abzusehen, dass das gleiche Problem auch bei Kapitel 20 bei den T9-Gütern auftauchen wird."}, {"80": "ustoni schrieb:\t\t\tDie Grundidee mit den Kaufleuten ist ja prinzipiell nicht schlecht. Theoretisch sollte es beim Start eines neuen Kapitels ja so aussehen, dass die erleuchteten Bonusgüter relativ gleichmäßig verteilt sind. Bei T7 (Mineralien, Barren, Alraunen) funktioniert dies ja inzwischen auch sehr gut.[BR][BR]Bei T8 sieht das leider wieder völlig anders aus. 56 Seiten Angebote von erleuchteten Gütern. Davon 3 Seiten T7 und 53 Seiten T8.[BR]Die 53 Seiten bestehen ausschließlich aus Angeboten von Wunderwachs - klar, ist ja auch mein Bonusgut.[BR][BR]Soweit also zu Theorie und Praxis. Es wird wohl noch recht lange dauern, bis sich das wieder einpendelt.[BR]Speziell zu Beginn eines neuen Kapitels sollte sich Inno etwas einfallen lassen um dem Ungleichgewicht entgegenzusteuern.[BR][BR]Ist ja jetzt schon abzusehen, dass das gleiche Problem auch bei Kapitel 20 bei den T9-Gütern auftauchen wird.\t\tZum Vergrößern anklicken....[BR]Stell dir mal die Frage, wovon Inno mehr profitiert - von einem ausgeglichenen oder von einem schiefen Markt?[BR][BR]Dass es mit dem gewählten System IMMER zu genau einem Gut, das praktisch als einziges angeboten wird, kippt, ist systemimmanent. Da es sehr einfach ist, das zu simulieren, gehe ich nicht davon aus, dass Inno das nicht gewusst hat. Und wenn sie es gewusst haben, haben sie es bewusst eingebaut. Und wenn sie es bewusst eingebaut haben, geschieht mit T9 was? Genau - das gleiche wie mit T7 und T8. Hat Inno ein Interesse daran, da was zu ändern? Nicht wirklich. Die Kaufleute sind ein (ziemlich intelligenter) Beruhigungsmechanismus, weil die Vorauszahlung etwas, aber nicht zuviel, Luft aus dem Ballon nimmt.[BR][BR]Wir können das System durchaus austricksen, es ist aber nicht ganz einfach. Man suche sich 2 Mitspieler im gleichen Kapitel, die jeweils ein anderes Bonusgut haben. Voraussetzung ist, dass alle 3 genügend vom eigenen Bonusgut am Lager haben. Dann vereinbart man eine Zeit, in der man sich trifft. Nun schickt der erste seinen Kaufmann mit Bonusgut 1 auf der Suche nach Gut 2 auf die Reise. Der zweite macht das gleiche mit seinem Bonusgut 2 und sucht Gut 3. Der dritte ebenfalls, er sucht Gut 1.[BR][BR]Dann nehmen alle im Markt das Angebot des Kollegen an, der das eigene Bonusgut sucht, und danach schickt man den Kaufmann wieder los. Nach einer Weile dreht man die Drehrichtung um, Spieler 1 sucht jetzt Gut 3, Spieler 2 Gut 1 , Spieler 3 Gut 2. In ein paar Minuten haben so alle drei die benötigten Güter zusammen, und man braucht einen einzigen Kaufmann dafür."}, {"2": "...was sollen sie denn daran ändern? - die Bonusgüter der Kapitel19-Spieler wurden doch bereits vor 3-6 Jahren zugeteilt - sie haben doch schon eine Abhilfe geschaffen: nennt sich Kaufmann....[BR][BR]...ausgleichend wäre es, die erleuchteten Güter komplett vom allgemeinen Markt zu lösen und den Kaufmännern ein paar Turnschuhe zu sponsern, damit sie schneller laufen können..."}, {"6": "Francesco Borromini schrieb:\t\t\tWir können das System durchaus austricksen, es ist aber nicht ganz einfach. Man suche sich 2 Mitspieler im gleichen Kapitel, die jeweils ein anderes Bonusgut haben.\t\tZum Vergrößern anklicken....Das was Du beschreibst, funktioniert bei T7 automatisch, da genügend Spieler vorhanden sind.[BR][BR]Das momentane Problem (zumindest auf Arendyll) ist, dass noch nicht genügend Spieler soweit sind, dass sie überhaupt T8 benötigen.[BR]Für den Bau der Brutstätte wird Bonus-T8+2 benötigt, für den ersten Ausbau Bonus-T8+1.[BR]Alle T8-Angebote stammen von knapp einem Dutzend Spielern. Offenbar haben alle in diesem Sinne momentan aktiven Spieler Wunderwachs als Bonusgut, ein Tausch zwischen den Spielern ist folglich noch gar nicht möglich.[BR][BR]Romilly schrieb:\t\t\t- sie haben doch schon eine Abhilfe geschaffen: nennt sich Kaufmann....\t\tZum Vergrößern anklicken....Sehr sinnvolle Aussage! Ich applaudiere stundenlang leise vor mich hin. [smilie--sprite11]"}, {"4": "-seit Kapitel 19 draußen ist, sind offenbar ne Menge Spieler in Kapitel 18 eingetreten. Die bisher sehr zögerliche Annahme durch Kaufmann wurde nun auf recht schnell umgedreht. Ich kann nicht nur mehr 3 x am Tag handeln, sondern deutliche öfters als 10 x, hängt auch von meinem online-sein ab.[BR][BR]Sicherlich haben viele Spieler gezögert mit Kapitel 18 und starten erst jetzt. Das wird noch dauern, bis die dann in 19 angekommen sind, mich eingeschlossen. Hatte einfach auch mal ne Pause eingelegt, da mir das 15-minütige Abholen der Schiffe irgendwie für recht lange gereicht hatte und ich lieber nur so vor mich hin spielte."}, {"80": "ustoni schrieb:\t\t\tDas was Du beschreibst, funktioniert bei T7 automatisch, da genügend Spieler vorhanden sind.[BR][BR]Das momentane Problem (zumindest auf Arendyll) ist, dass noch nicht genügend Spieler soweit sind, dass sie überhaupt T8 benötigen.[BR]Für den Bau der Brutstätte wird Bonus-T8+2 benötigt, für den ersten Ausbau Bonus-T8+1.[BR]Alle T8-Angebote stammen von knapp einem Dutzend Spielern. Offenbar haben alle in diesem Sinne momentan aktiven Spieler Wunderwachs als Bonusgut, ein Tausch zwischen den Spielern ist folglich noch gar nicht möglich.\t\tZum Vergrößern anklicken....[BR]Nun, ich kann immerhin Flugpulver anbieten. Noch nicht so viel, weil ich das HG noch nicht ausgebaut habe, aber annehmen kann ich die größeren Mengen natürlich. Schick mir ne PN, wenn du dringend was brauchst."}, {"6": "Danke fürs Angebot, da komm ich gerne drauf zurück.[BR]Dauert allerdings ein paar Tage; meine 12 Brutstätten stehen, 2 sind bereits einmal ausgebaut.[BR]Da ich den nächsten Turm erst Freitag nachmittag mache (gibt ca. 150k Unurium), werde ich in den nächsten Tagen erstmal die noch fehlenden 61 Schwarze Materie erzeugen.[BR]Danach geht's an den Ausbau der Brutstätten, bei Bedarf melde ich mich dann."}]