[{"80": "Allgemein als Hinweis, an alle in den Kapiteln ab 18, die seltene Güter produzieren: nehmt bei schiefem Markt keine Angebote der Güter T7 und höher an, wenn sie keinen Hut mehr haben, auch dann nicht, wenn ihr das Gut gerade brauchen könnt! Meist hat es ja genug dieser Angebote. Stellt, wenn es keine hat, lieber eure eigenen Angebote ein, es dauert ja nur Sekunden, bis sie angenommen sind.[BR][BR]Der Grund liegt darin, dass der Ersteller des Angebots nur dann einen Nutzen hat, wenn sein Kaufmann dadurch wieder frei wird. Und das ist nur der Fall, wenn der Hut noch da ist. Die anderen Angebote sollten wir verfallen lassen, denn so werden im System Güter erzeugt, die gar niemand produzieren musste.[BR][BR]Wenn wir diese Angebote annehmen, werden unsere seltenen Güter im Prinzip vernichtet. Der virtuelle Kaufmann spielt da Kreditgeber mit unendlich großem Warenkorb, und wenn wir die Angebote verfallen lassen, schädigen wir eigentlich ihn. Da er aber nie Konkurs anmelden muss, funktioniert das Spielchen zu unseren Gunsten.[BR][BR]Ist ein bisschen wie beim FIAT-Geld  [smilie--sprite2]"}, {"11": "Ich hatte im Letzen Kapitel, Urwelt Mineralien als Erleutertes gut.[BR]kann ich Urweltmineralien gegen das neue Erleutertes gut tauschen zb. gegen Flugpulver??"}, {"87": "Schnalle 04 schrieb:\t\t\tkann ich Urweltmineralien gegen das neue Erleutertes gut tauschen zb. gegen Flugpulver??\t\tZum Vergrößern anklicken....LuxuriantSilver schreibt:[BR]LuxuriantSilver schrieb:\t\t\tFlugpulver zb wird jetzt gegen Mineralien angeboten, denkt mal drüber nach.\t\tZum Vergrößern anklicken...."}, {"11": "Icxh habe nicht alles gelesen, und habe noch lange nicht den händler ausgebaut.[BR][BR]Aber danke für die super antwort[smilie--sprite11]"}, {"46": "Hallo ist euch schon aufgefallen, was passiert , wenn ihr den Händler ausbaut? Ich war gestern total irritiert, als mein Helfer mit Mineralien meine Kaufleute nicht fand:[BR][BR]Hallo Egoine65,[BR][BR]vielen Dank für deine Supportanfrage.[BR]Die Angebote können nur von Mitspielern gekauft werden, die auch den Verkäufer auf 8 haben.[BR]Deine eingestellten Waren müssen gekauft werden, ansonsten musst du 5 h warten.[BR]Wir wünschen dir weiterhin viel Spaß in Elvenar! Wenn du weitere Fragen hast, dann zögere nicht, uns erneut zu kontaktieren."}, {"69": "Gibt es noch immer keine Quest-Übersicht in deutscher Sprache? Die Übersetzung aus dem italienischem ist nicht immer eindeitig !"}, {"2": "Curiosus schrieb:\t\t\tHallo ist euch schon aufgefallen, was passiert , wenn ihr den Händler ausbaut? Ich war gestern total irritiert, als mein Helfer mit Mineralien meine Kaufleute nicht fand:[BR][BR]Hallo Egoine65,[BR][BR]vielen Dank für deine Supportanfrage.[BR]Die Angebote können nur von Mitspielern gekauft werden, die auch den Verkäufer auf 8 haben.[BR]Deine eingestellten Waren müssen gekauft werden, ansonsten musst du 5 h warten.[BR]Wir wünschen dir weiterhin viel Spaß in Elvenar! Wenn du weitere Fragen hast, dann zögere nicht, uns erneut zu kontaktieren.\t\tZum Vergrößern anklicken.......hattest du Gut 7 eingestellt gegen die Mineralien oder Gut 8? Mit Gut 8 kannst du erst handeln, wenn dein Händler auf 8 ausgebaut ist (war aber bei den erweckten Gütern auch schon so)..."}, {"87": "achilles7453 schrieb:\t\t\tDie Übersetzung aus dem italienischem ist nicht immer eindeitig !\t\tZum Vergrößern anklicken....Ja, die ist wirklich nicht gut. Hast Du es mal mit der englischen Übersetzung versucht? Ich finde die besser ..."}, {"37": "also bei den Mengen an Gütern die man für das neue Kapitel benötigt, kann einem die Lust vergehen, wenn man die \"falschen \" Bonusgüter hat. Brutstättenausbau 58K Aerosole. [BR]Blöd nur dass ich Flugpulver prodde. Es gibt bei uns 100 Seiten Aerosolgesuche und egal wie oft ich gucke, keine Angebote. ich momentan nur 2,200 einstellen. D.h ich benötige 2 Tage meine Kaufleute um die Güter für 1 Aufbau zu bekommen. Ach ne, ich brauch die Kaufleute ja auch noch für die Urweltmineralien, da gibt es bei uns 201 Seiten mit gesuchen. ( ich prodde Alraunen ). Achja und brennende Barren brauch ich ja auch noch, da gibt es auch keine Angebot im Markt. [BR]Fazit, kein einziges meiner Bonusgüter wird am Anfang benötigt. Kein einziges. Das passt doch was nicht. Das ist einfach unfair. Spieler die zufällig mit den richtigen Bonusgütern gesegnet sind, sparen sich dann auch noch Dia's für die Kaufleute. Ohne die ich überhaupt keine Chance hab, weil mir die Güter sonst im Lager schneller zerfallen, also ich sie zum Bau zusammen habe. Wo bleibt denn da der Spielspaß und die Gerechtigkeit? Das schlimmste an der Sache ist aber aus meiner Sicht, dass es bei der letzten Gastrasse schon so war und es wieder nicht angepasst wurde. Wo wäre das Problem, die benötigten Waren für den Aufbau der Häuser an die jeweiligen Bonusgüter anzupassen, das man zumindest 1 Bonusgut selbst erzeugen kann und nicht alle am Markt tauschen muss. Bei uns im Clan ist die Bonusgutverteilung genauso schief wie am Markt, bzw. die Spieler noch gar nicht im letzten Kapitel. Und die Mengen die man benötigt steigen von Kapitel zu Kapitel"}, {"6": "Sunwind schrieb:\t\t\tSpieler die zufällig mit den richtigen Bonusgütern gesegnet sind, sparen sich dann auch noch Dia's für die Kaufleute.\t\tZum Vergrößern anklicken....Unsinn! Von den erleuchteten Gütern wird grundsätzlich BG+1 oder BG+2 verlangt. Daher kann kein einziger Spieler seine Bonusgüter einsetzen."}, {"2": "ustoni schrieb:\t\t\tUnsinn! Von den erleuchteten Gütern wird grundsätzlich BG+1 oder BG+2 verlangt. Daher kann kein einziger Spieler seine Bonusgüter einsetzen.\t\tZum Vergrößern anklicken.......so war das nicht gemeint - Spieler mit den Mangelgütern können einfach Angebote annehmen und brauchen keine (oder kaum) Kaufmänner einsetzen - allgemein rate ich zu etwas mehr Geduld - viele Spieler (so wie ich) haben noch nicht einmal richtig mit der Produktion der neuen Güter angefangen, da sie ihr Unurium vorerst lieber woanders einsetzen (z.B. für den HG-Ausbau) - das wird sich schlagartig ändern, wenn endlich einmal das Event angefangen hat (und auch mal mehr Platz vorhanden ist)...."}, {"6": "Und wie ist das dann zu verstehen?[BR]Sunwind schrieb:\t\t\tWo wäre das Problem, die benötigten Waren für den Aufbau der Häuser an die jeweiligen Bonusgüter anzupassen, das man zumindest 1 Bonusgut selbst erzeugen kann und nicht alle am Markt tauschen muss.\t\tZum Vergrößern anklicken...."}, {"2": "ustoni schrieb:\t\t\tUnd wie ist das dann zu verstehen?\t\tZum Vergrößern anklicken.......naja - damit die mit den Massengütern halt auch nicht so viele Kaufmänner bzw. Handel benötigen...[BR][BR]...was tatsächlich ein Mangel- und was ein Massengut ist, wird sich aber erst noch raus stellen, wenn mal ALLE, die schon bei Kapitel 19 angekommen sind, die regelmäßige Produktion aufgenommen haben - dafür ist es aber mMn einfach noch zu früh...."}, {"6": "Romilly schrieb:\t\t\t...naja - damit die mit den Massengütern halt auch nicht so viele Kaufmänner bzw. Handel benötigen...\t\tZum Vergrößern anklicken....... und die Gastrasse in 6 Wochen erledigt ist. [smilie--sprite8][BR]Geduld gehört zum Spiel. Auf Arendyll wird nur mein Bonusgut Wunderwachs angeboten. Hab ich ja weiter oben schon geschrieben. Das muss sich erst einpendeln. Wird kein Problem mehr sein, wenn genügend Spieler die Gastrasse erreicht haben."}, {"2": "ustoni schrieb:\t\t\t... und die Gastrasse in 6 Wochen erledigt ist.\t\tZum Vergrößern anklicken.......das wird bei den allermeisten Spielern wohl eher nicht funktionieren...[BR][BR]...von INNOs Seite aus ist das wohl eher auf mind. 6 Monate ausgerichtet - von daher wird es auch keine Änderungen geben..."}, {"6": "Romilly schrieb:\t\t\t...das wird bei den allermeisten Spielern wohl eher nicht funktionieren...\t\tZum Vergrößern anklicken....Nein, aber das wäre möglich, wenn man seine Bonusgüter direkt - also ohne Umweg über die Kaufleute - verwenden könnte. Dann wären meine Brutstätten schon längst alle auf Stufe 2. So wie es ist, kümmere ich mich erstmal um die Schwarze Materie. Bis ich davon 72 habe wird sich der Markt hoffentlich etwas entspannen."}, {"2": "...der Vorschlag kam ja auch nicht von mir  [smilie--sprite2] - ich habs ja nur erklärt - ich persönlich sehe keinen Grund, warum ich mich selbst hetzen sollte - ich freu mich erst einmal auf meinen großen Stadtumbau nächste Woche und dann mag ich Geschenke auspacken bevor ich am Untergang von Elvenar arbeite ^^...."}, {"50": "Ich sehe unter dem Aspekt, dass das Kapitel gerade einmal 10 Tage alt ist, keine wirklichen Probleme obwohl mein 2. erl. BG Wunderwachs auf Arendyll ist. Das ich für meine Verhältnisse bisher durch die Forschung gerast bin (neben den viele WPs aus dem Turnier auch zusätzlich immer wieder WP gekauft) und so eher mit Unurium zu kämpfen habe, bin ich mit 15 erledigten Forschungen und dem Warten auf ausreichend Unurium für die Freischaltung der Brutstätten (16. Forschung) sehr gut mit meinen 3 Kaufleuten voran gekommen.[BR]Im Quervergleich zur Storyline des Kapitels (bin bei Aufgabe 35), scheinen meine Entscheidungen auch relativ passend gewesen zu sein. Hätte ich nicht für den Ausbau des HGs (Stufe 42) und das Ansammeln von Unurium für die Forschung der Brutstätten mit den Türmen ausgesetzt, hätte ich die fehlenden 33 Türme auch bereits und somit die notwendigen 72x Schwarze Materie für alle Ausbaustufen des Portals zusammen.[BR]Wie ustoni schon geschrieben hat, der Markt muss sich auch erst einpendeln."}, {"80": "Romilly schrieb:\t\t\t...so war das nicht gemeint - Spieler mit den Mangelgütern können einfach Angebote annehmen und brauchen keine (oder kaum) Kaufmänner einsetzen - allgemein rate ich zu etwas mehr Geduld - viele Spieler (so wie ich) haben noch nicht einmal richtig mit der Produktion der neuen Güter angefangen, da sie ihr Unurium vorerst lieber woanders einsetzen (z.B. für den HG-Ausbau) - das wird sich schlagartig ändern, wenn endlich einmal das Event angefangen hat (und auch mal mehr Platz vorhanden ist)....\t\tZum Vergrößern anklicken....[BR]Du brauchst auch so keine Dias für die Kaufleute auszugeben. Ich komme mit einem einzigen durch. Ist nur eine Frage des Spielstils."}, {"37": "ustoni schrieb:\t\t\tUnd wie ist das dann zu verstehen?\t\tZum Vergrößern anklicken....die Anforderungen für die Gebäude und den Ausbau sind ja heute immer für alle gleich. Ich fände es toll, wenn ein Teil dynamisch je Spieler mit seinem jeweiligen Bonusgut gebaut werden kann.[BR]Turm des Lichts benötigt Mineralien--> hab ich nicht[BR]Ausbau des Turms benötigt Barren --> hab ich nicht[BR]Brutstätte benötigt Wunderwachs --> hab ich nicht[BR]Ausbau der Brutstätte benötigt Aerosole --> hab ich nicht[BR]am Markt wird nichts davon angeboten. Ab und zu Barren und Wunderwachs[BR][BR]Wenn nun die Stufe 1 der jeweiligen Gebäude keine festen Güter hätten, sondern immer da jeweilige Bonusgut des Spielers, wäre der Markt besser mit Waren versorgt. Ab Stufe 2 könnte man dann ja wieder feste Güter machen. Aber zumindest 1 Stufe sollte sich am Spieler und dessen Bonusgut orientieren. Das wäre dann viel ausgeglichener. Ich kann mit meinen 3 Kaufleuten 3- Mal am Tag 6600 Aerosole tauschen, brauchen tu ich 58K. Die anderen beiden Kaufleute brauch ich für die Mineralien und Barren. Ich befürchte, dass die Aerosole schneller zerbröseln als ich sie verbauen kann"}]