[{"6": "Sunwind schrieb:\t\t\tWenn nun die Stufe 1 der jeweiligen Gebäude keine festen Güter hätten, sondern immer da jeweilige Bonusgut des Spielers, wäre der Markt besser mit Waren versorgt. Ab Stufe 2 könnte man dann ja wieder feste Güter machen. Aber zumindest 1 Stufe sollte sich am Spieler und dessen Bonusgut orientieren.\t\tZum Vergrößern anklicken....Da hast Du was falsch verstanden. Alle erleuchteten Güter, die für die Gastrassengebäude benötigt werden, beziehen sich auf das jeweilige Bonusgut der Spieler. Es wird immer nach Bonusgut plus 1 oder Bonusgut plus 2 verlangt, niemals nach dem Bonusgut selbst. Die Voraussetzungen sind also für alle Spieler gleich, niemand kann sein Bonusgut direkt verwenden.[BR][BR]Zu Beginn kommt es zu einem Ungleichgewicht, weil noch nicht viele Spieler bei Kapitel 19 sind und die Bonusgüter noch nicht optimal verteilt sind. Das sollte sich aber nach und nach geben.[BR][BR]Nochmal: jeder Spieler muss über Markt und/oder Kaufleute gehen, um weiterzukommen."}, {"37": "es kommt immer zu einem Ungleichgewicht. weil die Bonusgüter auf den Welten einfach sehr schief verteilt sind. Selbst nach 2 Jahren werden bei uns z.B. Faulpilze nie 1:1 getauscht, immer zu einem schlechteren Kurs. Somit ist das Argument \" Zu Beginn kommt es zu einem Ungleichgewicht\" einfach falsch. Die Spieler, die mit Bonusgütern gesegnet sind, die sonst fast kein Spieler hat, benötigen keine Dia's für die Kaufleute, da sie 100 Seiten zur Auswahl haben, um zu tauschen. Darum geht es mir. Das ist unfair. Nicht mehr und nicht weniger.[BR]Das Kapitel ist auf 6 Monate ausgelegt, soweit ich es gelesen habe[BR]alle 20 Tage brauch ich 300 Dia's für den Kaufmann = 2700 Dia's = 20,-€"}, {"2": "Sunwind schrieb:\t\t\tSelbst nach 2 Jahren werden bei uns z.B. Faulpilze nie 1:1 getauscht\t\tZum Vergrößern anklicken.......in Winyandor? - Na, das wüsste ich aber (ist ja mein Bonusgut dort) - vielleicht hast du einfach nicht ausreichend Kontakte..."}, {"17": "Sunwind schrieb:\t\t\tes kommt immer zu einem Ungleichgewicht. weil die Bonusgüter auf den Welten einfach sehr schief verteilt sind. Selbst nach 2 Jahren werden bei uns z.B. Faulpilze nie 1:1 getauscht, immer zu einem schlechteren Kurs. Somit ist das Argument \" Zu Beginn kommt es zu einem Ungleichgewicht\" einfach falsch. Die Spieler, die mit Bonusgütern gesegnet sind, die sonst fast kein Spieler hat, benötigen keine Dia's für die Kaufleute, da sie 100 Seiten zur Auswahl haben, um zu tauschen. Darum geht es mir. Das ist unfair. Nicht mehr und nicht weniger.[BR]Das Kapitel ist auf 6 Monate ausgelegt, soweit ich es gelesen habe[BR]alle 20 Tage brauch ich 300 Dia's für den Kaufmann = 2700 Dia's = 20,-€\t\tZum Vergrößern anklicken....erstens ist es nicht nötig die Kaufleute für Dias zu kaufen und es gibt genug aus dem Turm sag nicht du musst dafür einzahlen das so nicht wahr.[BR]Wenn du natürlich ungeduldig bist ist das was anderes."}, {"6": "Sunwind schrieb:\t\t\tSelbst nach 2 Jahren werden bei uns z.B. Faulpilze nie 1:1 getauscht, immer zu einem schlechteren Kurs. Somit ist das Argument \" Zu Beginn kommt es zu einem Ungleichgewicht\" einfach falsch.\t\tZum Vergrößern anklicken....Wem die Argumente ausgehen, der erfindet welche die im gerade passen. Du vergleichst Pferdeäpfel mit Birnen.[BR][BR]Faulpilze gehören zu den erweckten Gütern, die jeder zu einem beliebigen Kurs im Markt einstellen kann, und zwar völlig unabhängig von der Verteilung der Bonusgüter.[BR][BR]Die Rede war bisher von den erleuchteten Gütern und nur um diese geht es hier.[BR]Erleuchtete Güter werden grundsätzlich immer 1:1 getauscht - geht vom Prinzip her gar nicht anders."}, {"80": "Sunwind schrieb:\t\t\talle 20 Tage brauch ich 300 Dia's für den Kaufmann = 2700 Dia's = 20,-€\t\tZum Vergrößern anklicken....[BR]Brauchst du nicht. Hol dir einfach keine, arbeite mit den 1-3, die Gold kosten, und gut ist. Es gibt nur 3 Dinge, die du beachten musst:[BR]- keine Eile[BR]- HG schnellstmöglich ausbauen[BR]- aktiv handeln"}, {"20": "und leider läuft die Glocke wieder über, wenn der Handel floriert. Da sollte dringend Abhilfe geschaffen werden. Also wieder bei jedem Login goldene Hände polieren, oder es fallen Nachbarn raus. [smilie--sprite11]"}, {"6": "FCL001 schrieb:\t\t\tAlso wieder bei jedem Login goldene Hände polieren, oder es fallen Nachbarn raus. [smilie--sprite11]Zum Vergrößern anklicken....Einfach über die App NBH in der Weltkarte geben. Dauert nur wenige Minuten und bringt den maximalen Gewinn."}, {"191": "Das Kapitel gefällt mir bislang sehr gut. Deutlich besser als die vorherigen.[BR]Eine Ungleichverteilung der Güter sehe ich aber auch, weshalb ich diese Aussage nur bedingt unterstützen kann:[BR]ustoni schrieb:\t\t\tZu Beginn kommt es zu einem Ungleichgewicht, weil noch nicht viele Spieler bei Kapitel 19 sind und die Bonusgüter noch nicht optimal verteilt sind.[BR]Das sollte sich aber nach und nach geben.\t\tZum Vergrößern anklicken....[BR]In Elcy gibt es aktuell jeweils mehr als 25 Seiten mit Angeboten für Alraunen oder Urwelt-Mineralien und exakt 0 Angebote für Brennende Barren.[BR]Seitenweise Barren gab es dort bislang noch nie. Und das sind die Erleuchteten aus dem letzten Kapitel... Entsprechend sieht es bei Wunderwachs aus. Leider trat also bislang kein Gleichgewicht ein. \"Nach und nach\" scheint für die 18er Güter also erst bei Kapitel 20 einzutreten [smilie--sprite2][BR]Ich betrachte dies aber als zusätzliche Herausforderung und bleibe beim Lob für das 19. Kapitel."}, {"21": "ustoni schrieb:\t\t\tDa hast Du was falsch verstanden. Alle erleuchteten Güter, die für die Gastrassengebäude benötigt werden, beziehen sich auf das jeweilige Bonusgut der Spieler. Es wird immer nach Bonusgut plus 1 oder Bonusgut plus 2 verlangt, niemals nach dem Bonusgut selbst. Die Voraussetzungen sind also für alle Spieler gleich, niemand kann sein Bonusgut direkt verwenden.\t\tZum Vergrößern anklicken....[BR]Das ist ja logo, dennoch konnte man im letzten Kapitel zB mit dem eigenen Bonusgut erstmal anfangen was zu bauen, und mußte nicht mühsam anfangen zu tauschen. Das würde den Start zB schonmal sehr erleichtern.[BR][BR]ustoni schrieb:\t\t\tZu Beginn kommt es zu einem Ungleichgewicht, weil noch nicht viele Spieler bei Kapitel 19 sind und die Bonusgüter noch nicht optimal verteilt sind. Das sollte sich aber nach und nach geben.[BR] Noch Fragen ?[BR][BR]Dieses Ungleichgewicht besteht seit Beginn Kapitel 18 ... also seit vielen Monaten. Das hat absolut nichts mit ....\"das wird sich schon noch ausgleichen\" zu tun- das ist eine permantente Schieflage die sich- seit ich hier spiele - quer durch die Kapitel zieht und anscheinend niemanden interessiert.\t\tZum Vergrößern anklicken....[BR]Romilly schrieb:\t\t\t...in Winyandor? - Na, das wüsste ich aber (ist ja mein Bonusgut dort) - vielleicht hast du einfach nicht ausreichend Kontakte...[BR][BR]Manchmal frage ich mich wirklich in welchen Welten du spielst, denn die Elvenarwelten können nicht gemeint sein, da es bei dir immer und überall anders läuft als bei allen anderen. Ausserdem sind anscheinend andere Spieler doof, unwissend, kontaktscheu usw . Selbstredend sind Pilze seit Anfang an beim Händler ein Mangelgut in W2 - das werden viele Spieler bestätigen können. Und obwohl im Augenblick mehr Pilzangebote drinnen sind weil in Kapitel 19 auch mal endlich paar andere erweckte Güter gebraucht werden sieht die Lage augenblicklich dennoch so aus:\t\tZum Vergrößern anklicken...."}, {"17": "Indianaking schrieb:\t\t\tDas ist ja logo, dennoch konnte man im letzten Kapitel zB mit dem eigenen Bonusgut erstmal anfangen was zu bauen, und mußte nicht mühsam anfangen zu tauschen. Das würde den Start zB schonmal sehr erleichtern.\t\tZum Vergrößern anklicken....ja, kann man so sehen oder man betracht Kap18 als anfang zum lernen wie das neue System geht und jetzt wird normal gespielt.[BR][BR]Mal davon ab, die Festung gibs nach 7 Forschungen, da ist genug Zeit zu sehen was gebraucht wird, herzustellen, zu tauschen, bevor man die Forschung vollendet. Außer für die 3 die alles gleich und jetzt wollen, sorry kein Mitleid wenn auch ihr 3 Tage warten müsst."}, {"21": "stone2345 schrieb:\t\t\tja, kann man so sehen oder man betracht Kap18 als anfang zum lernen wie das neue System geht und jetzt wird normal gespielt.[BR][BR]Mal davon ab die Festung gibs nach 7 Forschungen da ist genug Zeit zu sehen was gebraucht, wird herzustellen, zu tauschen bevor man die Forschung vollendet. Außer für die 3 die alles gleich und jetzt wollen sorry kein Mitleid wenn auch 3 Tage warten müsst.\t\tZum Vergrößern anklicken....[BR]Sorry, aber aus dem Buchstabengewirr kann ich nicht herauslesen was eigentlich gemeint ist."}, {"2": "...ihr dürft mich gerne anschreiben - in Winyandor (und auch anderswo).....oder die anderen 8 Uhus, die Faulpilze als Bonusgut haben..."}, {"192": "Mal ein erster Eindruck vom neuen Kapitel: übel...[BR][BR]Es gab im letzten Kapitel in meinen Augen 2 Kapitalfehler. Einerseits die Unausgewogenheit der Güter und die Nachrichtenfunktion des Händlers. Beide Dinge sind natürlich übernommen worden.[BR]1. Unausgewogenheit der Güter. Es wäre schon hilfreich, wenn ein Bau statt die Summe X von Gut A es lieber X/3 von A, X/3 von B und X/3 wäre. Allein die 120k Kristall vom Portal haben bei mir fast eine Woche gedauert. Das wäre mit 40k/40k/40k flüssiger zu spielen, da es alle gleichermaßen trifft und es nicht zu so starken Verzerrungen kommt. Das wir dann für die neuen Güter die gleichen lumpigen Händler haben schlägt dem Fass den Boden aus, wenn man bei 2 Gütern der Gekniffene ist. Motivation ist daher nahe dem Nullpunkt.[BR][BR]2. Die NBH und der Händler: Ich habe im letzten Kapitel fast alle Nachbarn in der NBH verloren, weil durch den Händler die NBH Anzeigen hinten rausgefallen sind. Und hier mal ganz ehrlich: Ihr wollt das so oder? Das ist jetzt echt lange genug bekannt und es wäre möglich gewesen, dafür entweder eine separate Anzeige zu machen oder die Menge der Anzeigen zu verdoppeln. Die erste Variante wäre besser, aber mit der zweiten hätte ich auch leben können. Daher ziehen die im Spiel, die nur 2 mal am Tag einloggen den Kürzeren, weil die NBH nicht zeitnah bedient wurde.[BR][BR]Ich finde dies als Start in ein neues Kapitel mehr als frustrierend. Es geht hier nicht um maximale Geschwindigkeit oder so, sondern einfach nur um den Eindruck, dass dieses Kapitel noch beschissener wird als das letzte. Da hatte ich schon drei Kreuze gemacht, als ich durch war. Aber selbst danach habe ich noch Wochen gebraucht, um die Gebäude nachzuleveln dank astronomer Mana-, Saat- und Unuriumkosten. Und dieses Kapitel sieht da ja schon wieder schlimmer aus. Ich verstehe es ehrlich gesagt irgendwann nicht mehr.[BR][BR]Liebes Innoteam: Ein neues Kapitel sollte Lust auf Mehr machen und Spaß. Eure Entwickler machen aus meiner Perspektive leider genau das Gegenteil. Da helfen eure tollen Grafiker leider auch nicht mehr."}, {"21": "Tolle Grafik- schon aber auch total grausam. Hat sich mal jemand die Staubmanus auf lv 33 genauer angeschaut? Welche armen Kreaturen sind denn da festgebunden und werden gefoltert ? Und auch manche Texte find ich so gar nicht prickelnd, zB die unschuldigen Kinder des Waldes, die mit weißer bzw schwarzer Magie behandelt wurden .... das hat für mich einen ganz miesen Beigeschmack.[smilie--sprite10]"}, {"87": "Ragnarokh schrieb:\t\t\t2. Die NBH und der Händler: Ich habe im letzten Kapitel fast alle Nachbarn in der NBH verloren, weil durch den Händler die NBH Anzeigen hinten rausgefallen sind. Und hier mal ganz ehrlich: Ihr wollt das so oder? Das ist jetzt echt lange genug bekannt und es wäre möglich gewesen, dafür entweder eine separate Anzeige zu machen oder die Menge der Anzeigen zu verdoppeln. Die erste Variante wäre besser, aber mit der zweiten hätte ich auch leben können. Daher ziehen die im Spiel, die nur 2 mal am Tag einloggen den Kürzeren, weil die NBH nicht zeitnah bedient wurde.\t\tZum Vergrößern anklicken....Dem kann ich nur zustimmen. Je weiter man voranschreitet, umso schlimmer wird es (mehr Provinzen = mehr NB). Allerdings fände ich es besser, wenn NB-Hilfen, die jünger als z.B. 25 Std. sind, einfach nicht gelöscht werden. Denn auch mit getrennten Meldungen, also ohne Handel, kann es vorkommen (mit vielen aktiven NB), dass NB-Hilfen (insb. Golden Hände) hinten aus den Meldungen fliegen."}, {"85": "Sunwind schrieb:\t\t\tes kommt immer zu einem Ungleichgewicht. weil die Bonusgüter auf den Welten einfach sehr schief verteilt sind. Selbst nach 2 Jahren werden bei uns z.B. Faulpilze nie 1:1 getauscht, immer zu einem schlechteren Kurs. Somit ist das Argument \" Zu Beginn kommt es zu einem Ungleichgewicht\" einfach falsch. Die Spieler, die mit Bonusgütern gesegnet sind, die sonst fast kein Spieler hat, benötigen keine Dia's für die Kaufleute, da sie 100 Seiten zur Auswahl haben, um zu tauschen. Darum geht es mir. Das ist unfair. Nicht mehr und nicht weniger.\t\tZum Vergrößern anklicken....[BR]Interessante Aussage. Warum stellst du dann selber ständig Ein-Sterne-Angebote mit Faulpilzen ein? Du nutzt das Ungleichgewicht doch selber kräftig aus. Du könntest deine Faulpilze doch auch fair anbieten."}, {"54": "Mal ne Frage zu der Hauptquest:[BR][BR]Ich hatte gerade eine Quest mit 60 NbH's, gerade eine mit 100K göttlicher Saat (damit Auskenner wissen, wo ich gerade bin),[BR][BR]Frage nun:[BR][BR]Kommt danach noch eine/mehrere Quests, dass man Türme aufstellen soll, egal ob schwarz oder weiß ?[BR][BR]Wenn das so wäre, müsste man sich ja dafür den Platz freihalten, wenn nicht, könnte man mehr Platz für die Brutstätten verwenden.[BR][BR]-------------------------------------[BR]und noch was zu Sunwind's Aussage über das \"Ungleichgewicht\":[BR][BR]Klar sind die Güter ungleichmäßig verteilt, das weiß jeder.[BR]Und nun ist es wohl so, dass es weniger BG1-Produzenten für Marmor als für die anderen zwei G1-Güter gibt.[BR](in unserer Gem leider nur ein Spieler von 6-7 die in kapitel 18 sind)[BR]Das bedeutet natürlich, dass BG1-Marmorproduzenten ihre Alraune einfach durch Annehmen der Angebote tauschen können,[BR]die brauchen die Kaufleute wenig bis garnicht, während ich als Stahl-BG1ler nachts oft die ganzen 6h aussitzen muss, bis mir einer Alraune gegeben hat.[BR]Und daher musste ich auch (zu Beginn von K18 und jetzt gerade) einmal die 100 Dias ausgeben, und ja, man bekommt die über den Turm,[BR]aber a bisserl ungerecht ist das schon ... (die 100 Dias würde ich lieber für was anderes verwenden)[BR][BR]HdW"}, {"50": "Du befindet dich mit den 100k Göttliche Saat bei Aufgabe 38[BR] -> 38. Sammle 100k Göttliche Saat -> 2x 10 WP-Segen[BR][BR]Ja, es werden noch Türme in der Storyquest abverlangt.[BR]-> 42. Besitze 10 Brutstätten UND Besitze 10 Türme -> 2x Runensplitter und 1x Tierfutter"}, {"54": "OMcErnie schrieb:\t\t\tDu befindet dich mit den 100k Göttliche Saat bei Aufgabe 38[BR]-> 38. Sammle 100k Göttliche Saat -> 2x 10 WP-Segen[BR][BR]Ja, es werden noch Türme in der Storyquest abverlangt.[BR]-> 42. Besitze 10 Brutstätten UND Besitze 10 Türme -> 2x Runensplitter und 1x Tierfutter\t\tZum Vergrößern anklicken....oh je - habs befürchtet ... - na dann bin ich mja vorgewarnt und kann das so einrichten, danke schön[BR]Gibt es da eine Auflistung der HQ in Deutsch ?[BR][BR]HdW"}]