[{"91": "Již brzy zamíří do našich měst nová kapitola Obchodníci z Unuru. Těšíte se? Jste náležitě připraveni přijmout další výzvu? Napište nám jakékoliv vaše poznatky, které se týkají nové kapitoly. Za jakoukoliv vaší připomínku jsme rádi.[smilie--sprite2]"}, {"2": "díky za další posun, velký dík taky všem lidem okolo jako je elvenwiki, že informace o budovách je tu už ted"}, {"24": "Za mňa je táto kapitola celkom podarená, tématika púta pozornosť (čo sa v mojom prípade nestalo už asi dve kapitoly). Rovnako si nejakým spôsobom vážim nápad s unuriom - keď som sa o tom prvýkrát dozvedel, že ho bude produkovať tržiště, nejak bez pomyslenia som počítal s tým, že sa bude produkovať na závislostiach ako božské semienka, teda hlavne prastaré divy, ale nápad, s ktorým došli napokon - teda pracujúce obyvateľstvo a spotrebovaná kultúra, považujem za veľmi vydarený a originálny (a mám dojem, že tým pridali akúsi novú stratégiu, ktorou sa pre mňa kapitola stáva ešte zaujímavejšou (keďže jožinkovsky odteleportovať \"polku\" mesta kvôli osadníkom riešenie nebude)).[BR][BR]Či nové divy postavím alebo nie som sa zatiaľ nerozhodol, to bude zrejme závisieť od toho, ako sa mi v priebehu kapitoly ukáže náročnosť produkcie živoucího zboží popri unuriu (ak ale budem schopný ťahať vežu aj výskum bez nejakých problémov, budú to asi divy, ktorými si nejaké tie VB zase ušetrím (keďže ani jeden z ich sekundárnych bonusov (KR, činidlá) nepotrebujem))."}, {"2": "Divy jsou zvláštní věc.[BR]efekt vztažený k rasové řadě úkolů v téhle fázi hry , v základu je mi div půlku času k ničemu.[BR]celé když na to koukám, tak to jsou první divy které nepostavím"}, {"38": "Tak myslím, že Unuroví osadníci půjdou naskládat celkem dobře:[BR][BR][BR][BR]Spoiler: 20x22 políček[IMG]https://i.ibb.co/vJD7QRb/https-cz-forum-elvenar-com-index-php-attachments-17-jpg-5029.jpg[/IMG]"}, {"16": "Jenom pokud máš tolik místa. [BR]A velké a malé lodě bych nedával dohromady. Malá loď má téměř stejnou produkci (neznám vstupy) jako velká, takže se po vyzkoumání malých se vyplatí velké zbourat a na jejich místo dát malé."}, {"2": "Jak se budou skládat budovy je otázka, velké a malé lodě jsou značené jako sety, takže jejich napojení může významě ovlivnovat produkci."}, {"165": "v ukolu bude pořiď 6 malých lodí od každeho typu  pozor je to nezávazný"}, {"16": "@krix Tolik místa nemám. Naštěstí úkoly už od Lesních elfů plním stylem odklikání v další kapitole (takže po vyzkoumání tržiště splním úkoly Ambasád (aktuálně úkol daruj čaje a piva, který jsem nehodlal splnit))."}, {"38": "@Lovec Krys  Už snad od dob Lesních Elfů si ve městě, pokud to jde, udržuju plochu pro Osadníky cca 4x5 parcel.   I v době, kdy jsem čekal na příchod nové rasy. Takže místo bude. Uvidím pak v praxi, hlavně jak píšeš, že by se daly eventuálně zbourat ty velké lodě na úkor malých. Betu nehraji, ani to tam nijak nesleduju a raději se nechám překvapit naživo. Uvidíme [smilie--sprite6]"}, {"2": "Taky takovou parcelu mám, mimo rasu ji používám na eventy a DSka.[BR]Trochu mi udelali čáru přes rozpočet navázáním produkce na lidi a kulturu, protože teď nemůžu jen tak uvolnit další místo, takže to budu muset ještě řádně promyslet."}, {"11": "u mě místo taky nebude problém, jenom vyhodím ten poslední set a měsíční knihovny. Spíš vidím komplikaci v otočení mnoha budov."}, {"16": "Já problém (u sebe) v otočení budov moc nevidím. Stejně začíná být velmi obtížné vylepšovat budovy ještě během kapitoly, takže já je vylepším až po jejím dokončení - a to už otočení nebude problém s místem po osadnících."}, {"11": "tak po kapitole  to u mě taky nebude problém, mám to už v elvenarchitektu, ale jestli tak dlouho vydržím čekat. [smilie--sprite1][BR]ale bylo by to asi nejlepší řešení."}, {"16": "@voyager-1 Když nebudeš mít semena na upgrady, tak určitě vydržíš čekat[smilie--sprite1]"}, {"11": "aha, tak to si mě uklidnil [smilie--sprite1]"}, {"16": "@voyager-1 Produkce semen bude omezena produkcí unuria (nevyrábí se současně, ale přepínáš se mezi produkcí semen a unuria v tržišti lv. 6+.[BR]Jelikož produkce unuria je závislá na pracující populaci a spotřebované kultuře, jsou 3 scénáře:[BR]1) Budeš produkovat obojí v tržišti (pokud máš dostatečně vysokou pracující populaci a zejména spotřebovanou kulturu a dostatečně přebytečnou produkci semen)[BR]2) Budeš produkovat obojí v tržišti, sníženou produkci semen nahradíš kulturními hybridy.[BR]3) Budeš produkovat v tržišti jen unurium a semena jen z kulturních hybridů a divů (asi zejména hráči s nízkým počtem úrovní divů, kteří už nyní produkují podstatnou část semen z kulturek).[BR][BR]Jo a něco přeci jen můžeš vylepšit ještě během kapitoly: Obytky - jejich výzkum je ještě před velkými loděmi (tzn. ve stavu osadníků portál +3 vlajkové lodě), takže ještě budeš mít místo na otočení obytek - místo zabírají stejné (jejich vylepšení žere unurium a díky zvýšené spotřebě spotřebě kultury ti za odměnu produkci unuria navýší)."}, {"11": "a kolik semen tak za den vyrobit aby se mohlo říct  \"to jde\" ?[BR]EOC mám jen na lvl. 11"}, {"16": "@voyager-1 To je individuální, závisí na příliš mnoha parametrech, než aby se to dalo říci univerzálně. [BR]Základní spotřeba je definována produkcí prošlého zboží (T4-6), dále pak případnými výkupy ve věži a případnými vylepšeními budov a divů, které semena na vylepšení potřebují."}, {"2": "Já doufám, že mám dostatečnou produkci semen abych si mohl dovolit je chvíli nedělat.[BR]Mám hodně divu a platím za to v každé věží a teď už i turnaji.[BR]Tak snad to k něčemu bude."}]