[{"16": "Jo, trošku se ta kapitola zvrhává do závodů, kdo si zvládne odteleportovat větší část vesnice, aniž by si příliš snížil produkci unuria a ochromil další funkce a schopnosti města."}, {"2": "Já bych to typoval na čekací kapitolu.[BR]Zboural jsem ve městě co se dalo abych nepřišel úplně o produkci té věci na U.[BR]A stejně sedím a čučím než se mi vytvoří to či ono.[BR]Klikat několik dní suroviny na jeden výzkum, jako dobře, ale mít kvůli tomu rozkopané celé město je trochu opruz.[BR]Jeslti je záměr, že budu dělat rasu dva roky, protože s každým eventem a DSkem rasu zbourám a postavím znovu ze surovin kterých si nemůžu udělat zásobu, tak upadl na hlavičku.[BR]Když jsem klikal orky na betě, tak jsem si toho ani nevšiml, když jsem tam vlezl, naklikal jsme co šlo a zase vypadl.[BR]Když jsem je dělal na českém serveru, tak jsem trpěl jako zvíře, protože byla jen jedna cesta a to čekat a já svoje město chtěl rozvíjet.[BR]Ted čekám, když to jde, klikám co hodinu, ale s tím se počítalo, takže to nepomáhá a já furt čekám, takže mi to klikání co hodinu pěkně pije krev."}, {"38": "Automatický propočet lodí v tabulce.[BR]Stačí zadat jen počty malých a velkých lodí, jak to máte namyšlené:"}, {"20": "@BiggJOEcz - tak ta poslední tabulka na výpočty je skvělá, i když ta doba čekání mě vyděsila. Každopádně velké díky!"}, {"11": "v čem se to otevírá?"}, {"38": "@voyager-1  je to OpenOffice (free náhražka Microsoft Office).[BR][BR]@Ludi ta doba čekání na \"konec\" bude ale ještě delší, neb se ty intervaly sběrů 5x denně určitě nepodaří plnit pravidelně po celou dobu [smilie--sprite1] [BR]Ale aspoň máme nějaké vodítko[BR][BR]// Příspěvky sloučeny. Jumala"}, {"20": "Tak to je jasný, i když já to asi většinou asi stíhat budu. Nechci stavět mega flotilu a spoléhám na Kvetoucí cech, že mi pomůže. Prostě nějaký ten měsíc s tím strávím. Chci najít rozumný kompromis mezi kapitolou a zbytkem hry."}, {"5": "...takže do Vánoc hotovo [smilie--sprite1][BR]PS: je třeba oželet body a masivně použít teleporty, k čemu je vlastně jinak syslit [smilie--sprite1]"}, {"2": "Jo, to by bylo fajn.[BR]Jako dárek pod stromeček dostat rasově suroviny na dokončení kapitoly.[BR]To by bylo senza."}, {"38": "@ElfNostradamus koukal jsem na tu Tvoji plantáž lodí a Voyager-1 je sesazen [smilie--sprite6][BR]Nevím, jak daleko jsi ve výzkumu, ale ten nedostatek lodí na perly bude pracovat u Tebe hodně kontraproduktivně. Podtrženo těmi 20.loděmi krevetek, které k výrobě potřebují právě ty perly. A tady je právě ten případ, kdy je lepší postavit u Tebe místo malých lodí právě ty velké, aby se vykompenzovaly ty náklady.[BR]Ideální varianta mít místo 23.malých klíčů jen 17, místo 12.malých perel mít 14 a k tomu +2.velké perly.[BR][BR][BR]Spoiler: Aktuální[IMG]https://i.ibb.co/9qym4Jk/https-cz-forum-elvenar-com-index-php-attachments-elf01-jpg-5151.jpg[/IMG]Spoiler: Potom[IMG]https://i.ibb.co/K252WKC/https-cz-forum-elvenar-com-index-php-attachments-elf02-jpg-5152.jpg[/IMG]"}, {"5": "ahoj Joí, děkuji za projekty /jsem si říkal, kdo mi aktualizoval elvenstats/, začínal jsem právě se třemi velkými perlami a obráceném celkovém poměru a postupně velké ubíral, jak šel čas [smilie--sprite1] ...místo versus čas sklizně.  A opětovně se budu pomalu vracet k prvotnímu poměru tedy nejvíce perel a nejméně klíčů...úkoly neplním /drobná malichernost Elfa [smilie--sprite1] / ...jinak odhaduji, že do Vánoc jistě hotovo, vše k tomu směřuji, aby byl pak na svátky od rasy již klid a pohoda. msf"}, {"11": "BiggJOEcz napsal/a:@ElfNostradamus koukal jsem na tu Tvoji plantáž lodí a Voyager-1 je sesazen [smilie--sprite6]Klikněte zde pro zvětšení...[BR]snad se s tím naučím žít [smilie--sprite1][BR][BR]tak poslední dvě malý lodě a kašlu na to , padlo 40 teleportů, polovina co jsem měl ,s výrobou unuria jsem klesl na 12k/3 hod ale myslím že to bude v pohodě. V tabulce jsem se dostal na 40 denní výrobu ale bude to samozřejmě rychleji. Město je mrtvé, 170 k lidí v mínusu. Ale obyvatelé se nevzdávají, vědí že koncem roku opět přijde doba blahobytu. [smilie--sprite1][BR][BR]// Příspěvky sloučeny. Jumala"}, {"38": "@ElfNostradamus Jsem si právě říkal, že zrovna Ty by jsi to neměl nějak propočítané [smilie--sprite8][smilie--sprite2] No s úkoly jsme na tom hodně podobně..první zásek a už to nesleduju. Ikdyž občas nakukuju kvůli trocha rozumnějším odměnám třeba v podobě živoucího zboží, to se hodí vždy. Jsem zvědavej, jestli to stihneš do těch vánoc, pak třeba poreferuj. Já si ten konec nadělím (snad) na synovo vysvědčení [smilie--sprite6] [BR]Hodnoty v Tabulce jsou fixně dané, ale my jsme přece jen flexibilní [smilie--sprite2]. tsmf a asd. [smilie--sprite7]"}, {"16": "voyager-1 napsal/a:\t\t\tMěsto je mrtvé, 170 k lidí v mínusu\t\tKlikněte zde pro zvětšení...To může být problém při vylepšování Hl. sídla - a to budeš potřebovat na Obytky II (a tím pádem vše, co na ně navazuje) - 55M mincí, tzn. kapitola nejde projet bez vylepšení Hl. sídla na lv 38 (pokud to již nemáš).[BR][BR]ps: Samozřejmě díky tomu, že suroviny na výzkum nejsou omezené, si je můžeš v kuse nastřádat a poté lodě zrušit, vrátit obytky, vylepšit hl. Sídlo a dozkoumat zbytek. To je taky cesta."}, {"38": "@Lovec Krys myslím, že ta absence lidí pro vylepšení Hlavního sídla zas takový problém nebude pro většinu hráčů v 17.kapitole.  Koupí se to jednodušeji za diamanty, neb ten poměr  je zhruba 12.300 mincí za 1.diamant Takže tedy bude potřeba na ten 1.milion mincí cca 90.diamantů.   Zrovna dnes mi u jednoho výzkumu chybělo přibližně 1.milion mincí a když jsem je doplnil, tak potřeba diamantů klesla o 88ks) . A těch \"pár\" diamantů pro hráče v 17.kapitole, nejen jako je Voyager, nebude určitě problém."}, {"16": "@BiggJOEcz Teda na vylepšení budovy by mě ani nenapadlo plýtvat dia (a je mi jedno, kolik to stojí).  Stejně jako diamanty z věže zásadně získávám, ani jednou jsem je nepoužil (občas to chce dost disciplíny, al princip je princip). V řemeslné výrobě jsem je použil jednou - abych měl stíhatelný čas pro letní i zimní čas. To už bych raději použil tu variantu se zpětným dovýzkumem po získání potřebného počtu surovin na všechny výzkumy (ale to mně osobně netrápí, já mám populaci v +50K a obytky si nemůžu dovolit všechny odteleportovat i kvůli výkupů ve věži = tolik požehnání na mince zase nemám, abych je mohl měsíc používat denně)."}, {"38": "@Lovec Krys Zásady jsou zásady a to já beru.  Taky jsem nikdy na vylepšení budovy nepoužil diamanty. Ani to nebyla třeba, neb jsem vše měl tak naplánované.[BR]Občas ale osobně udělám ústupky z rozumu a dovedu přehodnotit staré zásady. Třeba bych to udělal právě tady v tomto konkrétním případě, neb těch  90.dia podle mě výborná investice, navíc je teď doba, kdy diamanty už jsou celkem dosažitelné, než tomu bylo dříve a nemusí Tě stát ani korunu. Jen čas, který ale stejně tu trávíme. Další důvod bych viděl v té spotřebě desítek teleportů, času plánování a nejen toho. Vždycky říkávám, že hra je dobrá, když má spád a když se něco děje [smilie--sprite6] Ta varianta zpětného dovýzkumu by mě asi nebavila.[BR]Je to na preferencích každého z nás."}, {"11": "jj, na výzkum obytek se musí mega mincí dokoupit, hlavní budova navýšit nepůjde a jak píše BiggJoe není to ani 100 dia. Ono co jinýho zbývá než to koupit, přeci nebudu kvůli myslím 80 dia překopávat město. Zrovna tak budou končit úkoly rádce až přijde úkol zvednout T3 manuf.[BR][BR]edit : I když, koukám, na ten výzkum obytek navazujou už jen tři výzkumy kde jsou třeba lodě, takže nadělat si suroviny dopředu a lodě zbourat by byla taky varianta"}, {"171": "Moc se mi líbí \"Zadat počty lodí\". Jen mi nějak vrtá hlavou, proč mám[BR]Hlavní loď klíče 107 x 4 = 428 a ne 430?[BR]Hlavní loď perly 215 x 4 = 860 a ne 858?[BR]Hlavní loď krevety 434 x 4 = 1736 a ne 1728?[BR]Něco jsem přehlédla? Je to klikání 4x za den po 6ti hodinách, že?"}, {"2": "Není to nějaká zaokrouhlovací chyba?"}]