[{"171": "Už to vidím. Hlavní loď se počítá 12h + 6h + 6h. Já jsem počítala 4 x 6h, ale nemám portál ještě na 4.level.[BR]Jsem se právě sekla u jeho výzkumu, který potřebuje 36 000 perel, které mi vůbec nepřibývají, proto jsem tady přišla čumákovat."}, {"16": "4x6 se ti podaří jedině pokud spíš méně než 6h denně, počítal bych spíše buď těch 12+6+6 anebo 9+9+6 (myslím, že ta druhá varianta vychází o pár surovin lépe, ale už jsem to dlouho neověřoval)"}, {"171": "Ano, to je logické. Jsem se snažila dostat co nejblíž k těm číslům. Až pak jsem si uvědomila, že mám portál na 3.level a tamto je počítáno na 4.level. Teď bych potřebovala poradit, jak co nejrychleji s portálem na 3.level vyrobit těch 36 000 perel. Urychlovačů mi rychle ubývá, takže mi nezbývá než čekat."}, {"2": "Jestli máš ostatního dost, tak nepouzivej lode co žerou perly"}, {"24": "V snahe dokončiť kapitolu čo najrýchlejšie, aby som sa mohol čo najskôr vrhnúť na preorganizovanie mesta podľa svojho náčrtu z architekta, som si pripravil miesto na výstavbu malých lodí. Odniesli si to obytné budovy a kapitole dávam nový názov: Demolátori z Unuru.[BR][BR][IMG]https://i.ibb.co/XDZWs5T/https-i-ibb-co-r-Gny7w-W-EL-17-kapitola-obyvate-stvo-5-12-2020-png.png[/IMG]"}, {"45": "@iDavis nie si sam, co ma polku mesta prec [smilie--sprite1][BR][BR]17 kapitola - Lodky"}, {"2": "Já jsem tak daleko nešel, žiji v bláhové naději, že plnit úkoly má aspon trochu smysl a třeba dostanu nějaké rasové suroviny a tím si rasu zkrátím.[BR]Dám vědět jak jsem dopadl[BR]snad ještě letos"}, {"45": "@GorGlin osobne plnim aj ulohy..."}, {"26": "Já jsem neteleportoval nic, držím si místo na rasu, které v době \"čekání\" využívám na časově omezené budovy nebo eventy, přpadně i na DS. Využil jsem 20% slevu na rozšíření a utratil našetřené dia. Takže mám všech 9 velkých lodí a 6+6+7 malých lodí a nějak to snad přečkám. Teď šetřím 36K perel,to je hrozně zdlouhavé,ještě to pár dní zabere.. Až bude OC na maximu, snad to půjde rychleji.."}, {"2": "máš o jednu malou lod víc nežli já a moc rychlé to není.[BR]spočítej si kolik suroviny uděláš az den a porovnej to s požadavky na výzkum[BR]já například výzkum na elixíry klikám pět dní[BR]Naštěstí dělám suroviny současně i na další výzkumy, takže s roztoucí cenou to bude stále pomalejší, ale věřím, že udržím pempo a budu koumat aspon dva výzkumy za týden."}, {"16": "@iDavis Máš v plánu získat suroviny a pak dojet zbytek výzkumu?[BR]Já si nechal akorát dost popky, abych mohl vylepšit sídlo, takže můžu zkoumat průběžně (je ale fakt, že těch výzkumů vyžadujících sídlo lv38 už moc není).[BR][BR]@karhol Já nemám rád příliš velké prázdné plochy u sebe ve městě - jednak neprodukují nic užitečného a jednak nedávají žádné body. Proto mám tak rád rasy, kde mi stačí portál a spamování portálových požehnání.[BR][BR]S touhle kapitolou se dá vyrovnat 3 způsoby:[BR]1) Trpělivá - postavit pár lodí dle místa a smířit se s tím, že to bude trvat dlouho (i půl roku, pokud se jede např. jen s velkými loděmi)[BR]2) Teleportovací - odteleportovat maximum města aby zůstalo ještě funkční a postavit pořádnou flotilu[BR]3) Šílená klikačka - postavit velkou flotilu malých lodí a uklikat se 15 minutovými výrobami[BR][BR](pro maximální možnou rychlost průchodem kapitolou se dají body 2 a 3 zkombinovat)[BR](a pak ještě bod 4 pro milionáře - naklikat si výzkum přes diamanty)"}, {"24": "@Lovec Krys ak dobre pozerám, týka sa to iba jednej vetvy na konci, čo je dostatočne malé množstvo technológií na to, aby som to prežil. S vylepšovaním behom kapitoly aj tak nepočítam, takže veľa sa v tomto nemení."}, {"11": "já ted pravě úkolem vyzkoumat všechny T3 manuf. dočasně s úkolama končím."}, {"2": "Další je abys dvě zvedl, že?"}, {"11": "ano"}, {"16": "Jo, to je dobrý úkol, když člověk nemá populaci (bo teleporty) ani místo (bo absurdně velká flotila, aby to netrvalo věčnost). Takže úkoly skončí jako vždy - nedokončené (vsadím se, že je za tím nějaký úkol typu vyrob xxxx perel/krevet/klíčů, který už nebudeme plnit, protože výzkum bude hotov)"}, {"45": "69. uloha je vyrobit 80K peral, potom su uz ulohy bez rasy ak neratam 82. ulohu, kde je potrebne predat centrum. No do 69. ulohy je potrebne okrem zberu a pod. mat aj nejakych ludi, kedze su ulohy na velepsenie, manufaktur, cviciska a zbrojnice. Ja som teleportoval tak, ze ak isla zbrojnica alebo manufaktura, tak sla aj obytna/e a to tak aby som mal cca 20K ludi pripravenych na vylepsenie, kedze ja som poctivy plnic uloh pri kazdej rase [smilie--sprite1] (aj ked je pravda, ze velakrat ma uloha stoji viac ako odmena, ale je to hra, tak to neriesim, ide predsa o zabavu [smilie--sprite1])"}, {"16": "@citellus Jinak řečeno, my všichni, co jsme si nechali populaci max. na vylepšení Hl. sídla anebo ještě méně (viz. mínusovky výše) můžeme na dokončení úkolů (opět) zapomenout.[BR]Já už jsem zvyklý, úkoly jsem plnil naposledy snad u Orků. Od lesních elfů nahoru jsem vždy narazil na úkol, který jsem nebyl schopen nebo ochoten splnit."}, {"45": "@Lovec Krys pri troche ochoty by si bol schopny vzdy [smilie--sprite1], ale je pravda, ze niekedy tie ulohy su polozene na hlavu a velakrat som uz vyrabal alebo vylepsoval nieco co som uz nepotreboval a pod."}, {"20": "@Lovec Krys - Já jdu trochu jinou cestou. Základem všeho je Čmelák, který mi dává + 36% a to už je hodně znát. Když není zrovna výroba osadníků, celou dobu no využívám na kupování surek (za první nákup mám např. T1 49K za 540K kladiv nebo 5400K zlata, které mám ráno vždy ve velkém přebytku). Na tomto lv. je obchodník úplně o něčem jiném a T1, T2 a T3 kupuji na trhu jen výjimečně.[BR]Teleportovala, případně vymazala, jsem jen kulturu, co jsem měla kvůli produkci. Původně jsem si myslela, že uchovám kulturu na semínka, ale není to k ničemu, nechávám jen to, co mi produkují sety a rozvinutelné budovy. A kupodivu to jde. Živoucí vyrábím ob den, manuchy nakouzlím a je to.[BR]Měla jsem ve hře pauzu 3 týdny, tak nyní dělám výzkum portálu na 4.lv. , ale nejpozději zítra ho budu mít. Není třeba klikat po 15 minutách, ale normálně po 3 hod., hlavní lodě po 6+6+12.[BR]S plánováním mi moc pomohla tabulka od BiggJOE.cz a také jsem to s ním konzultovala. Je skvělý a moc mi pomohl.[BR]Mám to spočítané na výrobu za necelé 2 měsíce, takže koncem ledna, nejpozději v polovině února bych to měla mít. Navíc se to dá trochu urychlit, protože něco budu mít dřív, tak prohodím počet lodí, aby zbytek šel rychleji. Flotila ještě není kompletní, ale plán je tento:[BR][IMG]https://i.ibb.co/gP3VHkm/https-cz-forum-elvenar-com-index-php-attachments-17-kap-3nov-jpg-5183.jpg[/IMG][BR][BR]P.S: Já nemám mezi kapitolami místo na výrobu celé zastavěné. Používám to na DS a případně kulturu s produkcí."}]