[{"16": "@Ludi Celé ne, portál a hlavní lodě by se mi tam vlezly i bez dodatečných rozšíření s novou kapitolou.[BR]Ale flotila velkých lodí už ne (natož ty malé).[BR]Mincí mám přebytek maximálně v Sobotu (kdy neběží věž) a v pátek byl na mně Golem mimořádně hnusný - raději jsem ani nepočítal počet pokusů, jen vím, že jsem použil 3 100% požehnání na mince i kladiva (a pro bojovníky z věže, kombinace byla nebojovatelná bez použití posilovacích budov).[BR][BR][BR]@iDavis Možní spíše Otrokáři z Unuru, když tě připravili o populaci[smilie--sprite1]"}, {"45": "@Lovec Krys ak mam fenixa, tak pri mojich bonusoch z divov uz nie je taka kombinacia, co by som bojom nedal [smilie--sprite1]"}, {"16": "@citellus Já ty divy mám taky, ale při tříkolových soubojích se dost často stává, že první a třetí kolo mají opačné bonusy, takže cokoliv, co není rozsekáno v kole prvním, rozseká kolo třetí.[BR]Možná to je hratelné ručně, ale automatem v takových případech ne."}, {"45": "@Lovec Krys mas pravdu, ze niektore bez manualu su nehratelne, no ked mam chut a cas, tak ja idem manualom aj take, co by automat mal minimalne straty a ja si ho zahram bez strat [smilie--sprite1] kazdy sa zabava inak [smilie--sprite1][BR][BR]...inak u nas na SK serveri uz su hraci co su na konci rasy, resp. min. jeden, co uz rasu ukoncil a postavil obidva nove divy..."}, {"16": "No když se mu je chce stavět, ... já je nebudu ani zkoumat natož stavět."}, {"2": "Já si myslím že jsem na betě taky viděl město které si zvolilo střední diamantovou cestu."}, {"24": "Jediný div, nad ktorým momentálne z tejto kapitoly uvažujem je Věštba štěstí, kvôli živoucímu, ale zatiaľ stále nemám pocit, že by s ním bol popri unuriu nejaký zásadný problém, takže asi toto bude druhá kapitola za sebou, v ktorej tie VB ušetrím.."}, {"31": "Jediné, co mne napadá, je jednou za čas postavit Dračí archu, vybrat nashromážděné tajemné objekty a zbořit. U Věštby štěstí mě hrozně mrzí ta týdenní výroba. Kdyby to bylo kratší, dalo by se nad tím uvažovat.[BR]Uvidím, jestli v příští kapitole nebude enormní nárok na živoucí zboží a nepůjde to řešit efektivněji (Časový skok, Simia Sapiens, Pyramida očištění, Uskladňovací vír), tak tyto divy nějak necítím."}, {"2": "@Prealiena [BR]Jak to myslíš s tím nashromážděním?[BR]Necháš tajemný předmět být a počítadlo se ti dál plní stále dokola a když ho pak vyzvedeš, ukáže se ti další k vyzvednutí?[BR]Je to ozkoušené?[BR]Zajímavá možnost, ale to předpokládá div na lvl 1, tedy dvě činidla za truhlu a třebaže to je pěkný šolich, tak činidlové hospodářství to zas tolik neovlivní.[BR]Já jsem si to počítal na lvl 16, to mi přijde jako rozumný střed.[BR]Dračí archa pak dá 8 činidel za tajenmý objekt (na jeho získání jich potřebuješ cca 70)  a skoro 40k živoucího zboží[BR]Což mi nepřijde špatné, nicméně jsou tu ale.[BR]Produkce živoucího zboží je náhodná a omezená jen na rasové úkoly. [BR]Jak si zlepšit produkci živoucího zboží mi to nepřijde jako takové terno.[BR]Věštírna dá 4 rekonstrukce týdně a tak 6-6,5k živoucího zboží za recept.[BR]4 rekonstrukce az týden není mnoho, ale s ohledem na další možnosti získávání mi to nepřijde špatné. Živoucí zboží za předpokladu 4 receptů za den mi vychází lépe než u archy, menší náhodné příděli ve výsledku dávají stabilnější produkci.[BR]Nemluvě o tom, že není omezena doba platnosti divu.[BR]Ale i tady mi to připadá jako dolňkový efekt a jeslti optřebuješ řešit produkci nějakým zásadnějším způsobem, tak to samo stačit nebude."}, {"16": "@GorGlin Je to odzkoušené. Můžeš je klidně střádat půl roku a pak jich najednou vybrat třeba 30. Osobně jsem to používal po eventech, kdy byla eventová měna v truhlách (a nižší šance na dia)."}, {"5": "Tak nová rasa hotová [smilie--sprite1] ...poklidný předvánoční shon a pohodové svátky vám všem ostatním."}, {"2": "vyměnil jsi klid na vánoce za dimanty?"}, {"38": "@ElfNostradamus kolik padlo urychlovačů?"}, {"5": "V první vlně mraky urychlovačů těžko vyčíslit nějak jsem to neřešil, když se válely ve skladu, tj rychle portál na lv4 pak místo, neřešil jsem body a postavení, vyndal jsem asi 60budov: sety, některé manu a obytka...jel jsem převážně malé lodě /karanténa pomohla s časem na klikání/ v závěrečné fázi něco přes 70 malých lodí dohromady, ale obyvatelstvo -298k , takže se nedalo po celou tu dobu nic přistavět ani vylepšit, nicméně efektivní."}, {"16": "Ono se to celé nějak zvrhlo do \"Najít správný okamžik, kdy je možné odteleportovat půlku vesnice a postavit co největší flotilu\"."}, {"2": "Pokud jsou ti jedno úkoly, tak můžeš po vyzkoumani portálu.[BR]Pak už nepotřebuješ tolik té věci na U.[BR]Ale asi i záleží na tom kolik máš času.[BR]Já když makám, míň než tříhodinovky nestíhám, takze bych si vypnul město na mnohem delší čas, než někdo, kdo má čas klikat 15 minut."}, {"20": "@GorGlin  Klikat na lodě po 15 minutách opravdu nejde, to by z toho člověk dostal zánět šlach nebo něco podobného. [BR]I po 3 hodinách je dost, když k tomu jsou i manufaktury."}, {"24": "Demolátori z unuru ma tak trochu vracajú do éry starých turnajov (pokiaľ ide o množstvo klikania, na malých lodiach).."}, {"44": "No jo pridat tlacitko hromadna vyroba jako v dilnach uz bylo moc , tak si zahrajeme v elvenaru klikfest jak v diablu"}, {"11": "na prosinec 2020 holt budeme vzpomínat. Coronavirus a do toho bezduché klikání na lodě.[BR] edit : máme rok 2020 ne? Už jsem z toho nějak zblblej [smilie--sprite1]"}]