[{"16": "Která chytrá hlava zase vymýšlela ty úkoly?[BR]Dostal jsem se přes vylepšení manufaktury, dokonce jsem postavil i tu novou budovu na manu (jediná možnost z těch 3 nových kulturních budov, ostatní jsou za dia), a šup 20K klíčů. No hezké, já jen, že předpokládám, že tam budou i podobné úkoly na krevety a perly, což fakticky znamená, že až dostanu ten třetí, budu mít hotovo, protože my hráči nevyrábíme ty jejich suroviny jednu po druhé ale všechny najednou.[BR][BR]Jen by mě zajímalo, jestli si vývojáři ty úkoly zkoušejí, anebo prostě kouknou, kolik surovin je celkově potřeba a ty čísla a jednotlivé úkoly prostě nastřelí bez testování, jak kapitola bude reálně probíhat."}, {"2": "Jestli platí seznam úkolů který tu je, tak tě pak už čeká jen úkol na 80k perel.[BR]Tedy úkol na rasovou výrobu.[BR]Je dost daleko, nejsem si jistý že jich v době kdy přijde budu ještě tolik potřebovat.[BR]Myslím že to se tu řešilo už několikrát.[BR]Je jeden způsob jak hru hrát. Ten je zpravny a podporovány.[BR]Kdo přijde na jiný je kverulant a bude za to pikat.[BR]Byly doby kdy jsem to tady taky řešil. Ale ztratil jsem víru.[BR]Nicméně poslední dva sloupce výzkumů potřebuji 180k perel, takže by to mohlo vyjít."}, {"16": "Jo, už to vidím, takže jsem se vůbec nemusel obtěžovat.[BR]Příště, až budu mít chuť ty úkoly zase zkusit, tak bych si je nejdříve měl znovu přečíst."}, {"5": "...úkoly jsem neřešil, s další rasou pouze odklikám...přesto pro nadšené zájemce, kdo by chtěl, tak pokud postaví div Dračí archa, která je žel ve výzkumu až na samém konci /logicky/, tak za každý splněný úkol hlavní úkolové linie je odměna mimo jiné i živé zboží z T6. GL[BR][BR]Cvičiště lv 30, krásně graficky ztvárněný Basejumping :  https://cs.wikipedia.org/wiki/BASE_jumping[BR][IMG]https://i.ibb.co/BZDVXwm/https-cz-forum-elvenar-com-index-php-attachments-jump-png-5214.png[/IMG] [IMG]https://i.ibb.co/b6bV4f0/https-cz-forum-elvenar-com-index-php-attachments-jump2-png-5215.png[/IMG]"}, {"24": "Pokiaľ ide o grafiku, u mňa vedú zbrojnice na lvl 39. Pre mňa osobne mimoriadne sympatické, už ich predbieha asi len avatar z časoskoku.."}, {"2": "já mám naopak jen jednu budovu která mě zas tolik neoslovila[BR]a to jsou kasárna, jinak to bude pěkné městečko"}, {"16": "Pár poznatků ke kapitole:[BR][BR]Produkce Elvenarin0:[BR]Pokud odmyslíme masívní použití portálových požehnání a/nebo masívní použití urychlovačů, tak produkce Elvenarin0 nestačí ani na pokrytí produkce hlavních lodí. Což znamená, že hráčům s nízkou zásobou a příjmem obojího se tak vytvoří ve městě nemalé zabrané mrtvé místo naprosto bez užitku pro průchod kapitolou (= hlavní lodě budou sloužit jen jako spojení velkých a malých lodí a bez užitku zabírat místo, jelikož nebudou mít z čeho produkovat, zejména pokud hráč potřebuje nasbírat Elvenarin0 i na výzkum, který jej přímo požaduje).[BR]Řešení je jasné: Zvýšit produkci Elvenarin0 tak, aby bylo možné vyrábět ve vlajkových lodích a ještě našetřit na výzkum bez použití portálových požehnání nebo urychlovačů.[BR][BR]Úkoly typu:[BR][IMG]https://i.ibb.co/sqLHvC5/https-cz-forum-elvenar-com-index-php-attachments-1608118530275-png-5216.png[/IMG][BR]Tohle jako vymyslel zase kdo?[BR]To je úmyslná sabotáž měst hráčů, kteří poctivě plní úkoly?[BR]Anebo se autor neobtěžoval si ty úkoly vyzkoušet na sobě tím, že si cvičně projde celou kapitolu, aby zjistil, jak velký nesmysl to navrhl?[BR]Obvykle nebývá zvykem takové nesmyslné bourání a zase stavění (teleporty zanedbáme, ne všichni jich mají 100+ jako já, spousta hráčů jich má jen pár nebo i 0) jednotlivých typů osadnických budov (v tomto případě různých typů malých lodí), ale postaví si určitý počet (obvykle více méně druhově vyrovnaný) těchto budov a na nich pak dojede celý výzkum.[BR]Takovéto bourání a zase stavění jak požadují tyto úkoly je prostě nesmyslný postup a jen to zbytečně spotřebovává hráčovy zdroje (pokud to není úmyslné, pak se vracíme k té sabotáži).[BR]Nakonec se tedy vracíme k \"úkoly nemá smysl dělat\" a já osobně lituji toho, že jsem si byť na chvilku myslel, že ty úkoly pro jednou zkusím. Jen jsem si potvrdil, že můj předchozí postoj k úkolům je správný (ignorovat a odklikat v další kapitole)."}, {"11": "pak tam bude[BR]prodej alespoň 3 malé lodě pro labužníky + přivolej alespoň 6 malých pirátských lodí [smilie--sprite1]"}, {"2": "ten první ještě jakž takž chápu, krevet je potřeba nejvíc, ale ten druhý je totální haluz.[BR][BR]já na tenhle úkol teprve čekám, a jsem fakt zvědav, jestli tam bude nějaký komentář že jako oni odlítají a přilétají[BR]bych jim tu satvební sut strčil někam, kašparům."}, {"11": "mě při včerejší rekapitulaci v tý tabulce vyšlo, že musím přidat pirátský lodě, tak jsem 4. přidal a mám jich ted nejvíc, takže určitá logika v tom úkolu možná je."}, {"2": "To je zvláštní že nám to vychází jinak"}, {"11": "možná jsem někde udělal chybu při přepisování údajů v tabulce, jak to vychází Tobě?[BR][BR]ale ve výzkumu vidím že potřebuju vyrobit ještě kolem 200k krevet a 120k perel. A krevety jdou zhruba dvojnásobně rychle"}, {"38": "@voyager-1 Přepsal jsi ten celkový počet zbývajících surovin (krevety, perly, klíče) do sloupce \"K\" v červených oknech?  Pak by to mělo být správně ten výsledek.[BR]Co se týče toho, co jde rychleji a co pomaleji.. pokud si nastavíš hodnoty na co nejvíce stejné, tak to kalkuluje průměrnou dobu pro celý výzkum stejně (jednou bude chtít výzkum poměrově méně krevetek, a zase bude výzkum, který bude chtít poměrově více třeba klíčů, než v přibližném výrobním poměru 1:2:4[BR]ten průměr tedy značí přibližně zlatou střední čekací cestu"}, {"11": "jj, přepsal jsem ty červený údaje, myslím že je to dobře jsem se na to ještě koukl. u všech tří surovin chybí 16 dní, plus mínus pár hodin"}, {"2": "Já vrábím stále všechno, takže perel ted mám kopec[BR]mě to ted vychází, že klíče budu klikat ještě dva týdny, zato krevety tři"}, {"11": "já taky vyrábím od OC 4 všechno ale měl jsem mírnou převahu lodí na krevety, ted se to otočilo"}, {"2": "Aha, tak tím to možná je, já měl všeho stejně celou dobu.[BR]Já jsem ted ve fázy, kdy do výzkumu potřebuji 51500 klíčů, 203000 perel a 296000 krevet[BR]Ale perel mám hromadu ve štrozoku[BR]jeslti budu mít čas, tak věřím, že do konce roku ty tajtrlíky vypoklonkuju, ale je to záležitost hodinových výrob[BR]je fakt, že ten chlap s kachnou na rameni mi fakt pije krev a jsem připraven potit krev abych ho už nikdy nemusel vidět"}, {"38": "tato 17.kapitola se mi líbí v té logice výrob (velké lodě +1, malé lodě +2 výroby), ale je to totálně pohnojený těmi nesmyslnými počty výrob pro dokončení výzkumu, podtrženo neuvěřitelně přehnanými nároky na Elvenarin0, jak píše Lovec. Tyto hodnoty vytvářel asi někdo, komu dali \"nůž na krk\" za to, jak jsme se tady rozepisovali, kolik máme portálových bonusů na skladě a k tomu jsme z eventů se zaměřovali převážně na urychlovače...vše jsme dostali jako obrácený feedback zpět. Smutný toto...  Už jen čekám, kdy nám opět něco provedou \"naschvál\" ..třeba nasadí v dalších kapitolách dálší levely pro divy - 36-40, kde už bude vše v pořádku, takže by nás donutili těch 5.levelů 31-35 prostě udělat... No ale doufám, že 18.kapitola bude mít už trocha rozumnější jak úkoly, tak i logiku danou pro naše reálné možnosti výroby..."}, {"172": "BiggJOEcz napsal/a:\t\t\t... je to totálně pohnojený těmi nesmyslnými počty výrob pro dokončení výzkumu, podtrženo neuvěřitelně přehnanými nároky na Elvenarin0, jak píše Lovec ...\t\tKlikněte zde pro zvětšení...[BR]Tady jde možná jen o úhel pohledu. Vývojáři Inna zřejmě dostali úkol zabavit hráče na 6 měsíců do další kapitoly. A vy místo toho abyste si to užívali, tak ještě kafráte, že kapitolu nedokážete projet za týden [smilie--sprite1]"}, {"2": "Já vám nevím, ať an to koukám z jakékoly strany, tak mi zůstane nějaké ale.[BR]Snaha vyprázdnit sklad portálových bonusů má problém s hráči, kteří postupně proplouvají kapitolami a žádné velké zásoby nemají.[BR]Navíc jich bude mnohem víc, než těcho co čekají na konci výzkumu.[BR]Když vezmu základní sadu rasové produkce z úkolů, tak mi s pravidelným příchodem dobrodružství a podobných kratochvílí nevychází předsatva, že si nechám takhle rozkopané město půl roku.[BR]Jako kdyby přišli s rasou, kterou opečuji jednou budovou 3x3 pole, nechám jí v klidu ve městě trčet půl roku.[BR]Ale s myslenkou, že DSko přijde cca v půlce ledna chci mít ty šmelináře z města pryč co nejdřív."}]