[{"16": "Ještě upřesnění problému s Elvenarin0:[BR]Produkce portálu lv 4: 60000/den (při 24/7 výrobě)[BR]Spotřeba vlajkových lodí: 65100/den (při 6h+2x9h výrobě)[BR]Takže bez použití portálových požehnání anebo urychlovačů není možné udržet ani výrobu ve vlajkových lodích, natož našetřit na výzkumy, které vyžadují Elvenarin0 (pro hráče s nízkou zásobou portálových požehnání/urychlovačů)."}, {"2": "to je nějaké zvláštní, nezapoměl jsi započítat nějaké bonusy?[BR][BR]Tak jsem to prostudoval a jsem trochu zmatený.[BR]produkce je podle lvl 2, 3, 4 a 5 tisíc[BR]a taková produkce i je, takže bonus je již do tohoto čísla započítán, nebo se z nějakého důvodu neaplikuje.[BR]Já Lovcem zmíněný problém nemám, protože díky čmelákovy mám produkci 74400 za den.[BR]s tím, že mám produkci přesně navýšenou o bonus čmeláka.[BR]jako by se bonus z portálu nezapočítával.[BR]To je záměr?"}, {"16": "5000/2h, tzn. 12*5000=60000."}, {"24": "Ak je nejaká potenciálna výhoda, ktorú budú mať hráči \"po nás\" (zn. nečakajúci pravidelne na konci výskumu), na úkor povedzme nedostatku PB, tak to môžu byť nové zdroje unuria, ktoré my nemáme. Je to nová surovina takže v našich časoch tejto kapitoly neexistuje žiadna, napr. budova z udalostí, ktorá by ho produkovala, takže istým spôsobom to bude môcť byť pre nich kompenzácia a nejaké vyladenie toho, aby náročnosť a dĺžka priebehu kapitoly boli \"zhruba rovnaké\". Nie je to presné, ale pocit ku kompenzácii to môže byť.."}, {"2": "Máš pravdu, že hráči mohou mít budovy, které jim budou produkovat unurium.[BR]Tedy za předpokladu, že se na celou vec patřičně připraví a hned po prvním výzkumu je zvednou pomocí královské rekonstrukce[BR]ale zero ti to nevyřeší[BR]Jestli je záměr mít tři největší budovy jen jako napojení ostatních na portál a suroviny množit kupčením, tak to potěž koště"}, {"11": "já nevím, vždyt toho unuria   je dost, spíš přebytek, a to nemám vysokou produkci, ted mám zbytečně 200k, spíš jedu semínka, ale těch je taky dost. Jenom na začátku jsou na unurium trochu větší požadavky. A Zero neřeším vůbec, však každej nadával jak mu PB lítaj odevžad tak je to asi úmysl vývojářů abychom se alespon části zbavili ale zároven nám to v postupu ve výzkumu moc nepomohlo.[BR][BR]edit: tak 70 dia stojí ten výzkum obytek bez navýšení hlavní budovy"}, {"2": "otázka je, jeslti těch bonusů bude mít dost hráč, neparkuje půl času na konci výzkumu.[BR]na druhém světě mám město malé"}, {"11": "v malým městě nemáš co utrácet PB ale šetřit je do dalších kapitol. Standardní hráč má opravdu PB dost. [smilie--sprite1][BR]PB jsou nutnost od kapitoly Elvenarů, do tý doby by měl každej  nima zacházet opatrně."}, {"2": "máte někdo vyzkoušené jestli na to bourání stačí teleport?"}, {"3": "voyager-1 napsal/a:\t\t\tv malým městě nemáš co utrácet PB ale šetřit je do dalších kapitol. Standardní hráč má opravdu PB dost. [smilie--sprite1][BR]PB jsou nutnost od kapitoly Elvenarů, do tý doby by měl každej  nima zacházet opatrně.\t\tKlikněte zde pro zvětšení...jedu na ně od draků a zásoby neustále narůstají..."}, {"2": "Tak to je fajn"}, {"11": "@Emhyr var Emreis II no vidíš, PB není třeba řešit [smilie--sprite1]"}, {"24": "voyager-1 napsal/a:\t\t\ttak 70 dia stojí ten výzkum obytek bez navýšení hlavní budovy\t\tKlikněte zde pro zvětšení...Posledná tretina demolátorov sa mi zdá byť celkom priateľská voči živoucímu zboží (od seba som napočítal už iba 3 (povinné) technológie ktoré ho vyžadujú), takže možno začnem uvažovať nad tým, že tých 70 diamantov obetujem, prepnem produkciu na unurium a začnem ho na vylepšovanie obytiek používať už v priebehu.."}, {"16": "GorGlin napsal/a:\t\t\totázka je, jeslti těch bonusů bude mít dost hráč, neparkuje půl času na konci výzkumu.[BR]na druhém světě mám město malé\t\tKlikněte zde pro zvětšení...Nebude - viz. např. moje beta město, které na konec výzkumu dorazilo teprve nedávno (pár týdnů před nasazením Unurů).[BR][BR]@Emhyr var Emreis II Ono taky záleží, zda někdo jede pravidelně celou věž nebo jenom první patro, nebo zda (ne)vyrábí portálová požehnání v akademii (a zda (ne)má z čeho). [BR]On je dost rozdíl mezi hráčem majícím tisíce procent portálových požehnání a hráčem, kterému došly a přijde mu výzkum požadující přes 100K E0 a musí na několik dní zastavit výrobu ve vlajkových lodích, aby jej našetřil (těch pár zbývajících urychlovačů mu na to stačit nebude)."}, {"38": "@Alatriste tady vůbec nejde o kafrání jak píšeš. Ale o fakta.. psalo se tu, že máme hodně many - na to nám v této kapitole nastavili denní spotřebu many na 840.000 jen pro produkci Elvenaria0(schválně, jakou máš produkci many? (sám mám tisíce kouzel pro Dračí opatství, ale brzy jsem pochopil, že ta mana by ty kouzla spolkla velmi brzy). Další bylo to, jak jsme získali stovky portálových bonusů - tak nám znemožnili se jimi vypomoct v průchodu kapitolou a ztenčí se nám nepřiměřeně ve skladech (kdo jich má vícero) právě pro výrobu Elvenarin0, která je asi nejrozumnější volba pro to. Ta možnost získat Elvenarin0 pomocí semínek při jiné volbě je celkem špatný vtip, která je umocněna výrobou unuria, která výrobu semínek zastavuje na minimum a ty tři další možnosti za živoucí zboží, kde Ti padne za 1.den přes 18.000 ž.zboží, což jsou snad 3/4 celkové denní normální výroby, ....je trocha hazard. Nepatřím k těm, co kapitolu projíždí za týden..ani za 2.měsíce..ale v průměru za 3-3,5 měsíce.[BR]To kafrání z mé strany není o tom, že bych si tu kapitolu nedovedl užít..ale o tom, jak z našich kladných zpráv vývojáři udělali záporné věci... To je ten správný feedback?[BR]Kapitolu budu mít cca za celkově 3.měsíce tak či onak projetou, takže časově je to pro mě normál. Neb mám hodně surovin a kouzel v zásobě.[BR]Ale Ti, co takové možnosti z jakéhokoliv důvodu nemají, Ti budou mít ten problém se touto kapitolou prokousat. Né každý má chuť či možnosti si odteleportovat část města, aby ty výroby dávaly nějaký smysl mít ten pocit hrát směrem vpřed a né jen tak něco vyrábět a najednou si říct, že vlastně vyrábí něco, co je jim jedno...[BR][BR]Ty jsi ještě v 15.kapitole...tak věřím, že si tím projdeš sám a pochopíš to."}, {"2": "Já se s kapitolou taky popral celkem úspěšně.[BR]Ale díky stylu hry jsem měl zásoby uplně všeho.[BR]uvidíme jak narazí mrňous[BR]můžete mi někdo říct jak je to s tím portálovým bonusem na výrobu zera[BR]proč se neuplatnuje?"}, {"38": "@GorGlin jak to myslíš to neuplatňuje? [smilie--sprite1]"}, {"2": "na wiki je produkce obchodáku lvl4 5k zera[BR]pokud si správěn pamatuji, je tam uvedena základní produkce, která je následně vylepšena portálovým bonusem[BR]a ještě když se při výrobě podrží myš na správném místě, se výroba rozklíčuje, co je základ a co bonus a odkud[BR]ted ne[BR]jako by zero nebyla rasovka"}, {"38": "No nevím, jestli jsem Tvůj dotaz pochopil správně..[BR]Ale musíš rozlišovat produkci rasy:[BR]1. Portál vyrábí portálovou surovinu (v 17.kapitole je to jen Elvenarin0)[BR]2. Budovy (tady lodě) mají vlastní produkci zboží (ne portálovou)[BR][BR]Možná tomu bylo v minulosti dříve jinak, že všechna rasová produkce se uchovávala do portálu, ted už pár kapitol tomu tak není. Důvod je asi jasný..[BR][BR]takže, ikdyž portál dává bonus lodím, Ti si tu svoji produkci hmatají jen pro sebe, tím pádem se na ně nevztahuje Portálový bonus Portálové požehnání"}, {"2": "portálový bonus se an lodě vztahuje, tam je všechno jak ná[BR]velká zběratelská loď, v lezu tam a ukáže se mi 16 klíčů +10 za portál[BR]ale u zera ne[BR]ale v přehledu je jako zdroj osadníků"}]