[{"38": "aha [smilie--sprite1] Ty jablka a já hrušky.. [smilie--sprite6] Ta poslední věta.. \"..nevztahuje Portálový bonus\"    bylo myšleno Portálové požehnání. Sry."}, {"2": "Aha, to mi vůbec nedošlo.[BR]Já myslím bonus od portálu(obchodního centra)"}, {"12": "prodat alespoň 3 malé lodě pro labužníky + přivolat alespoň 6 malých pirátských lod-to je úkol,to zase někdo na něčem fičí!!"}, {"2": "Tak udržovat si nějakou malou rasovou základu, která bude zajištovat dostatek všech tří surovin a pak k tomu hromadu malých lodí které budou vyrábět právě to co aktuálně potřebuji je určitě možnost.[BR]Nepřijde mi moc výhodná, protože neustálé stavění a bourání přináší další následné výdaje, ale základní stav, že mi malé lodě v poměru cca 1:3 pomnoží co už mám se nic nemění.[BR]S ohledem na různou velikost a tvar budov nezvládnu na dané místo dát stejný počet různých lodí, nebo na to musím v parcele počítat s rezervou.[BR]Tedy všeliké přestavování v principu, podle mě, k ničemu není, ale člověk se tím zabaví."}, {"45": "...osobne som nemal nikdy rovnaky pocet lodi na perly, krevety a kluce a vzdy som mal vyssi pocet tych lodi, ktorych suroviny co vyrabali prekracovali poziadavky ostatnych a tak ked prislo na buranie v ulohach, tak som nemal problem zburat male lodky a vystavat lodky na perly,lebo to bolo v mojom plane...[BR]...na rasu nepouzivam casovace (zvacsa idem 3h vyroby, vecer to trochu niekedy zrychlim, ale zvacsa sa mi nechce [smilie--sprite1]), momentalne mi chybaju uz len 2 technologie a 1 div este doskumat, som na ulohe ziskaj 80K peral a na ukoncenie rasy potrebujem 81K peral, takze aj tuto ulohu splnim bez toho aby som vyrabal nieco navyse..."}, {"38": "@citellus tak ono možná bude trocha rozdíl v tom, pokud se někdo snaží plnit úkoly, kdo má celkově 20, 30. či s 55.malých lodí.[BR]U 55. si můžeš prakticky dovolit téměř vše i bourat dle libosti, neb ta výroba oproti nákladům je několikanásobná a tak nějak to lépe a plynuleji bez větších prodlev mezi výzkumy funguje. U těch 20. se výzkum může prodloužit celkem znatelně..."}, {"2": "na velikosti záleží"}, {"45": "@BiggJOEcz jasne, ja to beriem, ja len som dal pohlad na ulohy aj z druhej strany spektra hracov, ktorym ta uloha nie je az tak nelogicka a korešponduje so stylom hrania, resp. poňatím strategie ako danu rasu som si zvolil prejst...[BR][BR]...osobne mi ulohy vadia najmenej, su tu ine veci, co z danej rasy robia klikaci mataton a v istom okamihu uz to nie je zabava, resp. nebola..."}, {"2": "Nemám tam tolik místa, ale brzy budu mít dostatečnou zásobu klíčů, tak půjdou všechny malé lodě pryč[BR]Možná i nějaká velká, to musím ještě spocitat[BR][BR]Tak jsem si to spočítal a začal bourat.[BR]nevydržím koukat na nehotové úkoly a tím mě dostali[BR]vyselo by mi to tu čtvrt roku[BR]ale když bych to tu nezboural, tak budu kvůli výrobě 80k perel dělat něco co nebudu nepotřebovat.[BR]Snad jsem to spočetl dobře a ted udělám dost klíčů a krevet abych pak musel dělat jen ty perly.[BR]bude to stát cca milion T1 surovin"}, {"2": "Tak hotovo, ještě nějaké bourání mě čeká, ale už tahám baráky ze skladu a vracím život ve městě do pohody.[BR]Dozvěděl jsem se z úkolů věci které mě vážně překvapili.[BR]Lidi mi ve městě hladoví a vojáci jsou živí o chlebu a čaji.[BR]Z videa o věží si pamatuji, že původní úvaha byla jeskyně, ale to zavrhli protože elvenar je příliš sluníčkový na tak temnou věc. [BR]A přitom nechávám každý týden zemřít v turnaji statisíce vojáků a ani jim nedám najíst.[BR]Jsem netušil co jsem za gaunera."}, {"16": "@GorGlin Ale ti vojáci se přeci nepočítají[smilie--sprite1] (a ti orkové na výkup(do otroctví) a zamíchaní v maltě na vylepšení budov taky ne).[BR]Ale moji obyvatelé jsou zvyklí - já mám v avataru draka a ten už toho sežral... Naposledy kupu obchodníků z Unuru (těch, co nestihli uletět).[BR]Poslední úkol mi přistál prodej+postav lodě. Samozřejmě nesplním, když jsem už všechny lodě zboural i s portálem. A znovu je kvůli úkolu stavět nebudu ani náhodou."}, {"11": "taky budu zítra končit, zbývá pár klíčů a perel"}, {"2": "Je to super pocit"}, {"11": "no schází tam ten dobrý pocit, jak píšeš, že mám splněný úkoly. Ale dělat dalších 20k klíčů a perly, nad tím hodně váhám a asi se poprvý na úkoly   vykašlu."}, {"2": "Mě by to děsně štvalo a vím to o sobě tak jsem podle toho plánoval.[BR]Samo že to nebylo bez obětí.[BR]Tu kulturou jsem postavit chtěl, ale úkol na to přišel v naprosto nesmyslný okamžik. Tři sběratelské lodě jsem boural a dvě hned zase postavil. Ale byli tam i věci které bych udělal i sam. Veskera vojenská produkce šla nahoru hned jak to šlo.[BR]Možná by nebylo od věci, když by autor úkolů uvedl jak si představuje průchod kapitolou"}, {"45": "Ja som ukončil rasu a s ňou aj všetky úlohy, tie búracie mi presne zapadli do doby kedy som ich menil za perlolodky. Momentálne si užívam už kľud a tie dlhé časy na vylepšenia mi vyhovujú aspoň je čas nazbierať manu alebo citiaci tovar, tiez som rad, ze mam späť zbrojnice lebo som klesol s orkami k hranici 2M a tak je čas opäť si vytvárať rezervu..."}, {"2": "Ano, dostavba města bude pěkně pozvolná.[BR]Syslit přes milion many chvilku zabere"}, {"11": "3 mega many mám momentálně ve skladu [smilie--sprite1]"}, {"16": "Ještě milion many na vylepšení sídla(mám 800K z 1,8M). A dalších +-30 na vylepšení T3+T6 manufaktur."}, {"2": "Já to vidím na řekněme pár týdnů stále spotřeby.[BR]Jsem moc rád za každý div s manou spojeny. Od bludiště po maják."}]