[{"16": "Já z inventáře vytáhl 15 lávových vajec (sice 2 kapitoly staré, ale díky směšným nárůstům produkce many v posledních 2 kapitolách stále dobrých). Pak je zase schovám pro další upotřebení.[BR]Jediné, co budu mít ve vesnici navíc trvale, je kdysi zbourané bludiště (kvůli snížení rozpadu many)."}, {"2": "Já mám produkci cca 300k many za den.[BR]K tomu mi něco hodí velvyslanectví nebo opatství.[BR]Jednou za pár dní něco zvednu.[BR]Dohromady mám jen 5 T3 manufaktur, takže to taková hrůza nebude"}, {"16": "@GorGlin To máš jen o 1 méně než já (za předpokladu, že máš 2 T6 - to jsou taky v podstatě T3, jen s jiným bonusem), takže to máš jen o +-5M many méně."}, {"2": "ne, já mám 5 manufaktur dohromady[BR]zas mi do toho zasahují divy, ted mi tu stojí termální pramen protoře chce 600k many a já musím šetřit na jiné"}, {"20": "Grafika poslední kapitoly se mi nelíbí. Výroba osadníků je sice pěkná, ale obytné budovy i dílny jsou moc tmavé, zbrojnice nic moc a kasárna taky hrůza. Kam se vše hrabe na grafiku předešlých kapitol. Dost mě to mrzí, protože hezká grafika je pro mě v této hře zásadní."}, {"45": "@Ludi mozno o 4 mesiace uz sa budes pozeran na inu [smilie--sprite1]. Osobne sa mi kasarne pacia teraz viac, ale magicke budovy by mohli byt o nieco svetlejsie, zbrojnice boli krajsie predosle, no osobne to nijak neprezivam, kedze tato hra je este stale ziva, a vsetko sa meni [smilie--sprite1]"}, {"11": "tak jsem koupil asi 8 mega many přes opatsví a je vystaráno [smilie--sprite1] Udělal jsem poslední dva výzkumy, zvedl hlavní a do úkolu dvě T3. Vlastně by nebyl problém koupit pro celou kapitolu."}, {"24": "Na zbrojnice nesahať, u mňa sú na 39. leveli najsympatickejšou budovou v hre.. [smilie--sprite1]"}, {"20": "@iDavis každý máme jiný vkus. Já osobně doufám, že další kapitola bude mít grafiku o něco hezčí. Zatím se mi vše moc líbilo, kromě orků. No nic, budu se zatím chodit utěšovat do menšího městečka na CZ1, tam mám Benátky, což je graficky jedna z nejhezčích kapitol. [smilie--sprite2]"}, {"2": "Mě se zrovna zbrojnice taky líbí, včetně toho jak střílí orky nekam od zdi.[BR][BR]@voyager-1, na jak dlouho jsi ty kulturky očáral? tos musel opatstvím prohnat víc jak 500 kouzel"}, {"11": "jo, kolem 500, ale přes 2k mi jich zbývá. Já je nandal na víc budov, V. skaliska jsou např. na skoro 200 dní ale stejně mám kulturu 100% tak to ničemu nepomůže, šlo jen o tu manu. Před chvílí jsem prohnal dalších pár a zvedám T6. Ted už bez urychlovačů."}, {"2": "Každý barák ti teď s packou dává 5%[BR]Já mám maják, takže to mám znasobene a prodloužené a na manovych kulturách mi to nese bonus i na manu.[BR]Je to pár procent, ale když jich okouzlus víc, tak to nakonec hodí docela zajímavá čísla.[BR]bohužel nemám vánoční strom, ale fontánu hýřilů, která sice many sype dost, ale má tak malou kulturu, že na ní packu nikdy nedostanu."}, {"45": "...mne dava draci chram 26400 many za kuzlo, na vystavbu casovace nepouzivam a idem tak, ze kolko many nazbieram do konca vystavby, tak zvysom naklikam cez kuzla a zbieram dalej, kuziel mam viac ako dokazem minut a kedze hram teraz turnaje o 50% viac ako klikacie, tak stale pribudaju...[BR]...skoda, ze podobny div nie je aj na semena, alebo na unurium [smilie--sprite1], ale to by som asi vela chcel..."}, {"11": "no jo, mám tam účinek kouzla 10%, nevím jak jsem přišel na to, že kouzlo působí až od druhýho lvl. kulturního bonusu. Mohl jsem to rozdělit na víc budov. Asi mi to takhle kdysi někdo vysvětlil.[BR]citellus určitě nevyřadím na dva týdny vojenský budovy, tam jedině urychlovače. Na zbrojnice nebo obytky si taky třeba počkám."}, {"2": "Taky si užívám 5 stavitelů."}, {"45": "@voyager-1 vojenske som dal vyssie este pocas rasy, bolo par uloh na nich (na kazdu som skratil po jednom 20h casovaci na kazdy lv., tie neviem pouzit na vyrobu jednotiek, lebo nemam taky dlhy casovy rad ). Osobne mam vyrobu 14h a tak pri nakrmenych medvedoch je vyhodnejsie tie casovace pouzit po dostavbe na jednotky ako na vystavbu bez bonusu. (rovnaky pocet casovacov no viac jednotiek)...."}, {"24": "Demolátori boli v mojom meste konečne zdemolovaní, zostáva mi síce ešte jedna povinná technológia, ale suroviny sú pripravené, takže lode mohli ísť preč. Zrejme zajtra, po tom čo ju vyskúmam (za VB z turnaja), predám portál a na miesto rasy pôjdu poprvýkrát džinovia (ktorých sa za ten čas nazbieralo z veže 10) a po dlhej dobe aj pár studní. Do mesta zároveň pribudli ďalšie zbrojnice, najmä kvôli vysokým nárokom na kultúru, čím sa stávajú výborným zdrojom unuria..[BR][BR]"}, {"2": "ještě 15k perel a následuji tě"}, {"173": "chybí mi 80k perel a vb na 5 technologií. poprvé jsem nedělala úkoly a tak nevím, co můžu bezpečně odstranit,  prosím o radu"}, {"2": "pokud neděláš úkoly, můžeš odstranit co prebývá"}]