[{"173": "dík"}, {"2": "Tak už taky bourám.[BR]Je to dobrý pocit."}, {"12": "Proč se budovy s každou novou rasou zvětšují? Myslím si ,že když hraji dlouho tak bych měl mít výhody a to je třeba, že budou menší.Do 17.-té kapitoly se hráč nedostane za 14 dní. Odměny v událostech taky nejsou žádná sláva a tak si říkám,  že by si to každý vývojář měl nejprve zkusit zahrát.Pak by jim to šlo možná lépe! Chápu že priorita je z hráčů vymlátit prachy,ale ten balíček dobrodruha to je fakt výsměch.To si snad nekoupil ani ANCARY."}, {"2": "Budovy se zvětšují, ale roste i jejich produkce na pole.[BR]Takže z původních deseti manufaktur mám jen šest.[BR]Což považuji za výhodu, protože nahodit město zabere mnohem méně času."}, {"26": "Konečně jsem se i já dostal na konec.. Ale že to trvalo...Už čekám jen na manu, ale ta se díky dvěma vánočním stromům doplňuje rychle.."}, {"11": "no, na vylepšení T3 a T6 jí něco padne [smilie--sprite1]"}, {"16": "2 vánoční stromy mám taky. A k tomu 15 vajec na manu, už vylepšuji měsíc a ještě pár týdnů vylepšovat budu. Takže zase tak rychle to nejde (pokud člověk nemá těch manufaktur málo)."}, {"11": "dva stromy, fontánu, sovu ze setu, přidal jsem 4 jezírka, plno manovců a další ale nemám bludiště tak navyšuju jeden level po třech dnech a potřebuju nasadit 28 levelů. No urychlil bych to snadno kdybych ještě jednou použil pár stovek fialových kouzel."}, {"2": "Já toho mám méně, ale zase s bludištěm, tak zvedám taky jedlou za tři dny.[BR]Celkově potřebuju jen 24 lvl a to do příští rasy stihnu, takže pohoda"}, {"26": "Já už něco vylepšil během rasy, takže mi ve městě zbývá udělat jen 14lvl, ale k tomu ještě hlavní sídlo na 39.[BR]Navíc ještě jednu manufakturu (4lvl), kterou mám v inventáři a mezi kapitolama ji připravuju do vzdálené budoucnosti na surovinu T9 (stejně jako už mám v inventáři na max. T7 a T8).."}, {"11": "tak mě taky schází zvednout jen 15 krát. Těch 28 jsem bral od začátku navyšování. [smilie--sprite1]"}, {"38": "Jako ta mana je darda....za 1.manufakturu z lv27 na 31 to spolkne 4,6milionu many + 3,4milionu za Hl,.Sídlo, kde u mě to dělá cca 45milionu Many.[BR]Ale asi mě to vadit nebude, alespoň je co dělat, v pokapitolovém čase, a to celkem bez námahy [smilie--sprite1]"}, {"20": "Výzkum končím během dneška, něco už mám vylepšeného, takže v klídku a pohodě [smilie--sprite2]. Těším se, až si dám, alespoň na čas, město do pořádku."}, {"2": "To je věc která mě v rase žene nejvic dopředu.[BR]Ten pocit klidu a pohody v přestavěném městě.[BR]Jen nahození města zabere čtvrtinu času."}, {"16": "@BiggJOEcz Dneska jsem si dělal malý přehled (cena many sídla, produkce many hybridů (Žhavé jezírko a Pila)) a vyšlo mi z toho, že mezi kapitolami 9 a 14 rostla cena hl. sídla  o 40-45% za kapitolu a produkce many z hybridů o 30-34% za kapitolu.[BR]Mezi kapitolami 14 a 17 (a to i přes malý pokles ceny hl. sídla v kap. 15) vzrostla cena hl. sídla na dvojnásobek, zatímco produkce many o 22-24%.[BR]A pak nemáme vývojářům nadávat, když musíme pracovat s takovým nepoměrem růstu nákladů a výroby."}, {"38": "@Lovec Krys Díky za přehled.[BR]Bohužel tyto herní brzdy asi už budou součástí herního (pomalejšího) vývoje oproti rychlosti dohrání kapitoly.[BR]A v této době se nad tím dá asi přivřít oči, byť se mě to takto nelíbí...[BR]Dříve se často lidi dožadovaly nové kapitoly, že nemají co dělat a teď paradoxně je drtivá většina end game hráčů rádo za tu \"chvíli\" pauzy na reorganizaci města a minihry."}, {"18": "Třeba jsem to přehlédl, ale mám možná , a to přiznávám, STUPIDNÍ otázku. Dá se unurium získat  ještě jinde než v Akademii? P.S.: Teprve jsem u hlavních lodí."}, {"11": "To není stupidní otázka, myslíš tržiště, ne akademii, zatím ne, v poslední kapitole bude div který něco dá a momentálně můžeš získat trochu v eventu když si koupíš bonusový odměny."}, {"2": "@WinterPhoenix [BR]A trocha je za úkoly."}, {"8": "Unurium se da ziskat i z postaviltelne kulturni budovy - Muzem unuru (nejen za diamanty)  a na zaver z divu za sbirani eventovych surovin kolem mesta a z kazde truhly otevrene uvnitr veze"}]