[{"16": "K té kulturní budově jenom dodám, že množství unuria z ní je vysloveně směšné.[BR]To už se vyplatí přepnout tržiště na unurium a semena získávat z festivalových obchodníků (případně i z divů a evo budov*) a šetřit je např. tím, že pojedu T4-T6 po 1 kuse a okouzlím je (pokud mám dostatečnou zásobu a přísun kouzel).[BR][BR][BR]*např. Triumf přílivu a odlivu dává v kap.18 8850 semen/24h"}, {"2": "To ale píšete o jiné kapitole"}, {"174": "Dobrý den.[BR]Hru hraji asi čtvrtý rok a vždy mně bavila. Ale poslední dobou se mi zdá že hraní je spíš trestem abych postoupil dál. Jsem v 17 kapitole a jak jsem koukal tak abych splnil a mohl otevřít jednu technologii mi bude trvat tak tři měsíce. Třeba u soreny je výroba 410 kusů za 6 hodin . Abych otevřel technologii vylepšení cvičiště nebo zbrojnice chcete 100 tisíc kusů. U té Soreny mi to bude trvat několik měsíců. To je opravdu zábavné a opravdu mi to připadá jako stráta času. hra má člověka bavit a né zbavovat času čekáním . U portálového bonusu jsem mohl u minulé kapitoly navíšit vše ,i to co po mně chcete abych vyrobil. to jsou další klacky pod nohy. Nebo můžete říci,že mám postavit další budovy (lodě) abych toho vyrobil víc. Ale budovy zabírají tolik místa,že je nemám kam dát a nemíním jiné budovy teleportovat abych neztrácel peníze nebo zásoby a přepočítaval kultůru a obyvatelstvo.[BR]Nechci aby dotyčný nedopadl jako já ,že mu po čtyřech letech bude hra spíš pít krev než aby v ní viděl zábavu.[BR][BR]Odstraněna část textu. Embla"}, {"129": "Tiež mi dala tato kapitola zabrať....S odstupom času si ale vravim , že namaha stala za to ... tymy kapitolamy pred tym sa dalo doslova preletieť teraz od Obchodnikov už tomu tak nebude .A možno ďalej pojdu len skutočny fajnšmejkry Elvenaru .V obchodnikoch pak v kapitole  pride zburať velke lode a postaviš k zakladnym male lode (su efektivnejšie) .Od tohoto momentu sa vyraznejšie v kapitole pohneš.Chce to ale hafu prostoru a hodne malych lodi k tym zakladnym lodiam .Za tuto radu vďačim Lovcovi Krys inak by som sa možno v kapitole Obchodnikov placal ešte doteraz [smilie--sprite8][smilie--sprite8][smilie--sprite8][smilie--sprite8] vela šťastia a držim palce ...maš sa na čo tešiť v tymovom duchu ,pekna grafika i budovy a .... [smilie--sprite8][smilie--sprite8][smilie--sprite8][smilie--sprite8] veď pak uvidiš...[BR][BR]P.S.   Myslim si , že teraz v poslednych kapitolach budu len skutočny ryzi hrači Elvenaru .....každy,  kto tam dorazi ,vie čim si prešiel cez tie ťažke kapitoly Obchodnici,Tymovy duch, a Posledna kapitola. Ten pohlad na hračov v tychto kapitolach je iny (neak viac pohlad na nich z rešpektom ) ako na tych ktory sa zastavia v ambasadach alebo Obchodnikoch a nedaju to ... je to vyzva no ..."}, {"144": "@Skobla[BR]Ozvi se mi ve hře - Silversnake - spolek Lordi, něco s tím vymyslíme,  děkuji"}, {"16": "@Skobla Cvičiště je v Unurech ke konci kapitoly. Pokud chceš kapitolu projet v rozumném čase, už dávno jsi měl mít postavené malé lodě (nebo všechny velké lodě + malých lodí, kolik se vejde - dle toho, jak často se do hry přihlašuješ (velké lodě mají výrobu max.9h, malé max. 3h. Malé jsou efektivnější, ale jen pokud se do hry jsi schopen přihlašovat dostatečně často, abys vykompenzoval ztrátu malých lodí oproti velkým přes noc(/práci))).[BR]Dělat výzkum jenom třemi základními loděmi v této kapitole prostě v rozumném čase nelze.[BR]Poslední kapitoly jsou prostě náročné a každá neefektivita ve městě je znát (u tebe např. Enar nebo ty několik kapitol staré kult a pop/kult budovy).[BR][BR]Zrovna tuto kapitolu lze významně urychlit - stačí si postavit dostatečně velkou flotilu malých lodí - případně i za cenu ochromení města (např. tím, že odteleportuji všechny obytné budovy a na uvolněné místo postavím co nejvíce lodí. To, že pak budu mít zápornou populaci pouze znamená, že nemůžu nic stavět ani vylepšovat - ale to můžu udělat poté, co vše vyzkoumám).[BR]Extrémisti jako já si pak prostě odteleportovali půlku města do inventáře a nastavěli tam obří flotilu lodí (u mne přes 70) a byli hotovi s výzkumem za pár týdnů.[BR]Nicméně i s množstvím někde kolem 6-10 lodí od každého druhu by to nemělo trvat tak moc dlouho. Zejména, když už máš část toho výzkumu za malými loděmi hotového."}, {"6": "Lovec Krys Dík za radu. Konečně nějaký použitelný návod. K dispozici je 70 teleportů. Teď pro ně mám smysluplné užití. Amby profrčím koncem února (za 3 měsíce) a začal jsem si už drbat hlavu, co bude s kšefťáky. Schlamstnu je k dvouletému výročí působení ve hře."}, {"12": "Lovec Krys napsal/a:\t\t\tExtrémisti jako já si pak prostě odteleportovali půlku města do inventáře a nastavěli tam obří flotilu lodí\t\tKlikněte zde pro zvětšení...iDavis kapitolu Obchodníci z Unuru nazval \"Bořitelé z Unuru!\"-to město jsme měli fakt vyčištěné všichni -200 000 obyvatel v mínusu byla normálka."}, {"2": "Velké bourání bylo i v lodích, kdo nechtěl dělat na sklad, tak pořád boural a dostavoval lodě.[BR]Teď s hromadným nahrazováním to musí být paráda, ale předtím nahodit 70 lodi, to bylo za trest."}, {"16": "Dělat na sklad při neomezené skladovací kapacitě není problém. Prostě nějaké suroviny bude chvilku přebývat a o kousek dál ve výzkumu se to srovná/otočí. Je to vedlejší důsledek omezení užitečnosti PPček.[BR]Bourání lodí se dá udělat během posledních výzkumů, kdy už některá surovina bude vyrobena na zbytek výzkumů a zůstane jí jen tolik lodí, aby se udržela výroba vstupních surovin pro ostatní typy lodí.[BR]Podle mne je celkový čas kapitoly důležitější než samotný čas každého dalšího výzkumu, rozhodně bych kvůli tomu po každém výzkumu neboural/stavěl lodě pořád dokola.[BR]A to i přesto, že bourání se dá nahradit i teleporty, těch taky není nekonečno, abych po každém výzkumu odteleportoval 5-10 lodí a ve výsledku stejně strávil ten samý čas v kapitole jako bez nich."}, {"12": "Já měl na mysli ,že jsme vybořili obytky,manufaktury atd.Ne že jsme bourali a nahazovali lodě jak se zmiňuje Velmistr."}, {"11": "hlavně obytky, popkulturky a rozvinutelné budovy. Manufaktury dost ovlivňují výrobu urunia n v tržišti"}, {"6": "Můžu už otevřít truhlu s Tržištěm 4, když mi ale chybí ještě vyzkoumat ulici a dva divy v ambách, aniž bych tím zlikvidoval možnost dokončení jejich výzkumu? Ono je vůbec v označení tržišť pěkný zmatek, protože na ploše mám už Tržiště 5 a otevírat budu teprve Tržiště 4."}, {"175": "Teď si to tu tak čtu a celkem se u toho bavim [smilie--sprite8][BR][BR]místo mam 20x30 ( cca ) ... což mi přijde zatim dostačující . Momentálně cpu VB do portálu úrovně 2 . [BR][BR]Denní přísun semínek mam cca 90k ( soumračky 21 a v tržnici dělam jen Unurium ) a stejně je to podle mě málo ( vyrábim živoucí a něco sežere věž ) . Chci mít Unuru za 2 měsíce z krku , tak uvidíme [smilie--sprite11][BR][BR]Schoenfeld napsal/a:\t\t\tMůžu už otevřít truhlu s Tržištěm 4, když mi ale chybí ještě vyzkoumat ulici a dva divy v ambách, aniž bych tím zlikvidoval možnost dokončení jejich výzkumu? Ono je vůbec v označení tržišť pěkný zmatek, protože na ploše mám už Tržiště 5 a otevírat budu teprve Tržiště 4.\t\tKlikněte zde pro zvětšení... ulici a 2 divy zkoumat nemusíš ..... dá se to dodělat zpětně a je to ( podle mě ) ztráta VB [smilie--sprite11][BR]Já stavim cesty OB jednu nebo i ob 2 ( ve výzkumu ) . Mam teď STOUPAJÍCÍ ulice a ty ulice odborů fakt stavět nebudu ...."}, {"18": "@Nitramek Tak to přeji hodně štěstí. V Arendyllu jsem v obchodnících z unuru asi 4 měsíce a ještě tak minimálně na 2 až 3 to vidím. Jestli to s tímhle místem zvládneš za 2 měsíce tak ti Velmi rád poblahopřeji. Ale nějak tomu nevěřím."}, {"16": "@Nitramek Myslím, že se současným místem (bez teleportace dalších budov) to za 2 měsíce nedáš. Jestli se ti tam vleze 20 malých lodí, tak to jsem možná ještě optimista.[BR]Od vyzkoumání malých lodí mi to trvalo dojet do konce 3 týdny, a to s více než 70 loděmi klikanými většinu dne po 15 minutové výrobě (tak 1-2x 1h + 3h přes noc při cca 6-7h spánku).[BR]Takže i kdybys to s 20 loděmi klikal po 15 minutách, tak to za méně než 9 týdnů nedáš (pokud tedy nejsi robot, který nemusí vůbec spát)[BR]A při 3 hodinové výrobě ten čas můžeš ještě vynásobit 2,7x (15minutová výroba je přibližně 2,7x efektivnější než 3hodinová, a jakákoliv výroba velkými loděmi je ještě horší, pokud máš čas klikat alespoň každé 3h).[BR]Zkrátit to může Kvetoucí obchodní cech, ale ten u tebe nevidím (taky jsem jej považoval za zbytečný, ale během posledních kapitol jsem změnil názor - už ho nepovažuji za zbytečný ale za nezbytný kvůli rychle rostoucí časové náročnosti kapitol).[BR][BR]Takže pokud nebudu počítat bonus z cechu, tak od vyzkoumání malých lodí do konce odhaduji:[BR]70+ lodí 15 minut - přibližně 3 týdny[BR]70+ lodí 3h - přibližně 8 týdnů (2 měsíce)[BR]20 lodí 15 minut - přibližně 9 týdnů (2,5 měsíce)[BR]20 lodí 3h - přibližně 24 týdnů (5,6 měsíce)[BR][BR]Kratší vlivem Kvetoucícho cechu."}, {"175": "WinterPhoenix napsal/a:@Nitramek Tak to přeji hodně štěstí. V Arendyllu jsem v obchodnících z unuru asi 4 měsíce a ještě tak minimálně na 2 až 3 to vidím. Jestli to s tímhle místem zvládneš za 2 měsíce tak ti Velmi rád poblahopřeji. Ale nějak tomu nevěřím.\t\tKlikněte zde pro zvětšení...Mezi námi ...já taky ne[BR]Lovec Krys napsal/a:@Nitramek Myslím, že se současným místem (bez teleportace dalších budov) to za 2 měsíce nedáš. Jestli se ti tam vleze 20 malých lodí, tak to jsem možná ještě optimista.[BR]Od vyzkoumání malých lodí mi to trvalo dojet do konce 3 týdny, a to s více než 70 loděmi klikanými většinu dne po 15 minutové výrobě (tak 1-2x 1h + 3h přes noc při cca 6-7h spánku).[BR]Takže i kdybys to s 20 loděmi klikal po 15 minutách, tak to za méně než 9 týdnů nedáš (pokud tedy nejsi robot, který nemusí vůbec spát)[BR]A při 3 hodinové výrobě ten čas můžeš ještě vynásobit 2,7x (15minutová výroba je přibližně 2,7x efektivnější než 3hodinová, a jakákoliv výroba velkými loděmi je ještě horší, pokud máš čas klikat alespoň každé 3h).[BR]Zkrátit to může Kvetoucí obchodní cech, ale ten u tebe nevidím (taky jsem jej považoval za zbytečný, ale během posledních kapitol jsem změnil názor - už ho nepovažuji za zbytečný ale za nezbytný kvůli rychle rostoucí časové náročnosti kapitol).[BR][BR]Takže pokud nebudu počítat bonus z cechu, tak od vyzkoumání malých lodí do konce odhaduji:[BR]70+ lodí 15 minut - přibližně 3 týdny[BR]70+ lodí 3h - přibližně 8 týdnů (2 měsíce)[BR]20 lodí 15 minut - přibližně 9 týdnů (2,5 měsíce)[BR]20 lodí 3h - přibližně 24 týdnů (5,6 měsíce)[BR][BR]Kratší vlivem Kvetoucícho cechu.\t\tKlikněte zde pro zvětšení...Díky , \" potěšil jsi mě \" :-D [BR][BR]KOC zatím fakt v plánu nemám ."}, {"119": "Lovec Krys napsal/a:@Skobla Cvičiště je v Unurech ke konci kapitoly. Pokud chceš kapitolu projet v rozumném čase, už dávno jsi měl mít postavené malé lodě (nebo všechny velké lodě + malých lodí, kolik se vejde - dle toho, jak často se do hry přihlašuješ (velké lodě mají výrobu max.9h, malé max. 3h. Malé jsou efektivnější, ale jen pokud se do hry jsi schopen přihlašovat dostatečně často, abys vykompenzoval ztrátu malých lodí oproti velkým přes noc(/práci))).[BR]Dělat výzkum jenom třemi základními loděmi v této kapitole prostě v rozumném čase nelze.[BR]Poslední kapitoly jsou prostě náročné a každá neefektivita ve městě je znát (u tebe např. Enar nebo ty několik kapitol staré kult a pop/kult budovy).[BR][BR]Zrovna tuto kapitolu lze významně urychlit - stačí si postavit dostatečně velkou flotilu malých lodí - případně i za cenu ochromení města (např. tím, že odteleportuji všechny obytné budovy a na uvolněné místo postavím co nejvíce lodí. To, že pak budu mít zápornou populaci pouze znamená, že nemůžu nic stavět ani vylepšovat - ale to můžu udělat poté, co vše vyzkoumám).[BR]Extrémisti jako já si pak prostě odteleportovali půlku města do inventáře a nastavěli tam obří flotilu lodí (u mne přes 70) a byli hotovi s výzkumem za pár týdnů.[BR]Nicméně i s množstvím někde kolem 6-10 lodí od každého druhu by to nemělo trvat tak moc dlouho. Zejména, když už máš část toho výzkumu za malými loděmi hotového.\t\tKlikněte zde pro zvětšení...taky moc díky za rady,nedávno jsem je začala a smiřuju se s ročním výzkumem,ale ta hra mě prostě baví"}, {"6": "Lovec Krys Dík opět za rady. Moc se mi do té sedmdesátky nechtělo, ale teď v tom vidím nezbytnost. Celých 70 (nebo spíš 3x23) - nevím. Zkusím to propočítat na 3x16. Cílem jsou 4 měsíce. Za původně stanovené 2 roky od začátku mé hry (4. 6. 2020) to sice nestihnu dohrát (tehdy ještě nebyly na světě poslední dvě kapitoly), ale botky si kvůli tomu nerozkoušu.[BR]Jenom mne napadá, cos ve hře ty dva měsíce vlastně dělal, když jsi měl kulturky a paneláky ve skladu? Hrát jen Turnaj, Věž, Událost a SD, to mi připadá poněkud nezáživné."}, {"16": "@Schoenfeld Vylepšoval divy, nějakou dobu trvalo vylepšit všechny budovy, které jsem nevylepšoval v průběhu kapitoly (buď byly odteleportované anebo nebylo místo), sbíral produkty dočasných budov nashromážděných mezitím v inventáři (zejména džinové, bohyně přání, knihovny ap.) a ještě měl dostatek místa na události / DS (po skončení této kapitoly ještě nešlo teleportovat evo budovy, takže ještě nepřibyla farma na VB (mám je všechny na 10 a některé i dvakrát, z toho se dá nasbírat taky dost VB))."}]