[{"6": "To by také šlo, ale uvidím až dorazím k malým lodím."}, {"175": "WinterPhoenix napsal/a:@Nitramek Tak to přeji hodně štěstí. V Arendyllu jsem v obchodnících z unuru asi 4 měsíce a ještě tak minimálně na 2 až 3 to vidím. Jestli to s tímhle místem zvládneš za 2 měsíce tak ti Velmi rád poblahopřeji. Ale nějak tomu nevěřím.\t\tKlikněte zde pro zvětšení...Lodě 12-12-14( zatím ) ..zkoumám OC 4.  Za 2 měsíce to nedám , ale na 3 si věřím"}, {"175": "19-21-19 ... a dnes otevřu OC 4 .. tak to začne . [smilie--sprite6][smilie--sprite7][smilie--sprite8][smilie--sprite9]"}, {"6": "Může mi někdo sdělit na co šlapou velké a malé pirátské lodě? Velké zatím nevyrábím (až ke konci k úkolům) a malé začnu chrlit tak do týdne, ale mám podezření, že na výrobu budou potřebovat něco, čeho je v Unurech málo. Třeba unurium."}, {"124": "@Schoenfeld šlapou na to co vyrobíš v jiných lodích"}, {"6": "Aha, dík. Něco jako v Hobitíně. To je ta méně horší varianta ze dvou, které jsem čekal."}, {"6": "Mrňolodě jsou boží! 20% plus z květocechu k tomu dává tu správnou šťávu. Spláchnu 4. centrum, postavím 54 mrňolodí a uvidíme. Do týdne a do dna začne ta správná jízda."}, {"6": "Takže zatím nejpřesnější propočet vychází na 20 malpirlodí, 18 malgurlodí a 15 malsběrlodí s termínem dokončení lodní výroby za cca 27 dní. A to ještě nemám 4. centrum. Uvidíme."}, {"38": "@Schoenfeld ..no, nechci Tě strašit, ale 27.dní to určitě nebude [smilie--sprite10] (pokud jsi teda nemyslel dobu výstavby těch lodí [smilie--sprite8] )[BR][BR]Tvá výroba by v tomto poměru G+P+S lodí by vypadala takto:[BR]Spoiler: P20 + G18 + S15[IMG]https://i.ibb.co/7rWWH9Q/https-cz-forum-elvenar-com-index-php-attachments-plan-a-jpg-6054.jpg[/IMG][BR]Doporučuji si ty malé lodě postavit třeba takto:[BR]Spoiler: P17 + G19 + S17[IMG]https://i.ibb.co/8Kp4K4t/https-cz-forum-elvenar-com-index-php-attachments-plan-b-jpg-6055.jpg[/IMG][BR]A ta doba pro dokončení kapitoly startuje hned po otevření výzkumu Obchodního Centra lv4."}, {"6": "Dík za upřesnění. U mne to byl první nástřel.[BR]Skutečně mi vychází optimální složení P17+G19+S17. V současnosti jsem se čmelákem na úrovni 4. centra. Až ho dobuduju, bude ještě lépe.[BR]Troufám si tvrdit, že pak bude výše uvedený termín docela reálný.[BR][BR]Tak mám centrum 4 a mám P13+G15+S14. S tímhle ansáblem a čmelákem 16 (+24%) to zvládnu za 21 dní. Když to dám na 17-20-17 (Unurium ve vymláceném městě se blbě vyrábí.), tak  to zapíchnu za cca 16 dní.[BR]Úzký profil je elvenarin, ale čtyřka centrum trochu urychlí výrobu, tak uvidíme. Celé bych snad mohl stihnout do měsíce, jestli tam není někde ještě nezakalkulovaný zakopaný pes.[BR][BR]Byl by to fofr, kdybych se furt někde neflákal (sic).[BR][BR]15-15-14. Dějí se věci. Prča. Díky Lovče, i dalším borcům."}, {"6": "Nakonec P17+G20+S17. [BR]Asi třetinu plochy mi zabírají unurské lodě, což je poněkud šílené. Ovšem do 14 dnů bych mohl být hotov. [BR]Záleží na produkci many. [BR]Začnu zřejmě uvažovat nad pořízením Bludiště, obzvláště když mana bude úzkým profilem ve dvou následujících kapitolách, jak praví Fórum."}, {"2": "To bude, ale bludiště ti hlavně pomáhá kumulovat větší objemy, musíš nějak pořešit i produkci samotnou.[BR]Pul milionů za den mám jako zdravé minimum"}, {"6": "No to mi s nasazením čerstvě získaných vajec a bazénů jakš takš vychází. Ale stejně to dá cca 17-20 dnů. Ale z toho už se extra nepoprdím.[BR]A bludiště jsem taky raději postavil hned."}, {"16": "Ještě je dobrá možnost vysoká úroveň Dračího opatství a dostatečné množství kouzel (ale třeba na betě jsem v poslední kapitole vyplýtval téměř všechna kouzla)."}, {"3": "Je třeba být opatrný, jinak kouzla mizí jak pára nad hrncem. Aktuálně produkují cca 1,3M many denně, ale potřeboval bych mnohem víc :-D"}, {"2": "Ono je asi jedno jaký zdroj člověk zvolí.[BR]Ale je samozřejmé že pokud si zvolí opatství, musí mít pořešený zdroj kouzel.[BR]A počítat s tím, že zatímco produkce stoupá v desítkách, každá provincie přidá na lvl 35 46 many za kouzlo, tak spotřeba roste v statisících na budovu.[BR]A to nemluvím o tom, co nás může potkat v další rase.[BR]O kolik stoupnou náklady na vylepšení budov, kolik sežere rasa, nemáme tušení."}, {"175": "WinterPhoenix napsal/a:@Nitramek Tak to přeji hodně štěstí. V Arendyllu jsem v obchodnících z unuru asi 4 měsíce a ještě tak minimálně na 2 až 3 to vidím. Jestli to s tímhle místem zvládneš za 2 měsíce tak ti Velmi rád poblahopřeji. Ale nějak tomu nevěřím.\t\tKlikněte zde pro zvětšení...[BR]hotovo za 2 měsíce , 4 dny ;-)"}, {"8": "tak to jsi o 4 dny prosvihnul blahoprani [smilie--sprite2]"}, {"175": "[smilie--sprite8] bez toho se asi i obejdu .[BR][BR]Odstraněna citace. Embla"}, {"6": "Gratulka. Jde to. Unury jsem začal 27. 2. a malolodní produkce bude hotova do 30. 4. Zbývá problém s manou, ale po radě Lovce a Gora ze včerejška rozhodně nebudu nikam spěchat a raději budu vylepšovat příslušné divy. I když 1405 kouzelných magdarů a silzásob jsou dosti slušnou rezervou."}]