[{"2": "Tak unuruim se rozpadá, to jsem nevěděl. když udělám výzkum, budu potřebovat zaplatit ten a další desetitisíce na stavbu.[BR]No, pekny to nebude."}, {"16": "@GorGlin Jo, už od many nám do hry nepřidali nic, co by se nerozpadalo. Tak co čekat jiného u nové suroviny."}, {"3": "mohla by se nerozpadat, ale působit rozpad něčeho jiného v závislosti na jejím množství. To by byla chuťka.[BR]Nebo by mohla třeba zabíjet vojáky ve skladu..."}, {"2": "Když tak osekaly VBcka, tak jsem netušil že nás chtěli brzdit ještě víc.[BR][BR]Takže v příští rase bude div, který bude rozpad omezovat?"}, {"16": "@GorGlin To nikdo v tuto chvíli neví (možná vývojáři). Ale počítal bych s tím, že v některé z následujících kapitol bude."}, {"2": "U many a semene to tak bylo.[BR]Jestli je unuruim nová surovina kterou budeme trvale vyrábět, tak to že na to neudělali barák je docela solich."}, {"16": "@GorGlin Dle mě to tak udělali schválně. Jednak aby nemuseli dělat novou budovu a jednak, aby nám to zkomplikovali.[BR]Pokud se nemýlím, tak unurium potřebuješ na průchod kapitolou a pak na vylepšení obytek.[BR]Horší to bude v kapitole další - tam je předpoklad, že se z unuria asi bude vyrábět T7 (podobně jako T4 ze semen), takže pak bude potřeba už pořád."}, {"2": "No super.[BR]Necháme se překvapit."}, {"11": "tak mám hned začít vyrábět uranium nebo zůstat zatím u semínek ?"}, {"16": "@voyager-1 To záleží, zda chceš vyzkoumat hned další technologii v pořadí - portál, který chce 80K unuria."}, {"11": "jo to o. centrum bych zítra chtěl, přepnul jsem na to uranium[BR][BR]tak výroba urania za den bez bonusů je desetina pracujících lidí. To jsou velký města dost zvýhodněná. Já mám kolem 56k a vedoucí hráči skoro 100k."}, {"16": "Pouze pokud vybíráš jednou denně, jinak je stejně jako u semen důležitější bonus (1% z použité kultury).[BR][BR]ps: Tak beru částečně zpět. Ale mít oboje co nejvyšší znamená, že si hráč bude moci dovolit vyrábět i semena."}, {"11": "s kulturou (bonus) půjdu taky ještě dolu až vyhodím knihovny a set. Kde vlastně ty semena budou třeba? Ještě jsem je nenašel. Výroba surovin osadníků?"}, {"26": "Podle mně hlavně na výrobu živoucího zboží.Ale ještě jsem to moc nestudoval..[BR][BR]Unurium lze získat pouze na tržišti? To potom získám s bonusem jen cca. 10.000 za tři hodiny a jestli se ještě rozpadá tak to potěš koště.."}, {"16": "Semena potřebuješ na výrobu prošlého zboží (T4-6) a objevuje se při výkupu ve věži. V Ambasádách bylo potřeba i na vylepšení zbrojnic a manufaktur, teď tam není.[BR]Unurium lze zatím získat jenom na tržišti (dokud nám nepřidají nějaké kulturní hybridy nebo divy, které by jej produkovali).[BR][BR]ps: A ještě potřebují semena divy při vylepšování (31+ anebo 1+ ty novější jako je Termální Pramen Mládí)."}, {"169": "nevíte k čemu je a čím se zvedá síla obchodníka v nové kapitole?"}, {"2": "Voyager-urunium se počítá z pracujících a použité kultury, takže když zbouras knihovny, nic by se nemělo stat[BR][BR]Co je síla obchodníka?[BR][BR]// Příspěvky sloučeny. Jumala"}, {"11": "jj, je to tak, já nejdřív myslel že se počítá z volný kultury."}, {"169": "když rozkliknu tržiště a najedu myší najedu třeba na výrobu tak se mě tam ukáže síla obchodníka 10% a když najedu na bonus ke sběru tak mám jen 1ˇ%"}, {"26": "Úkol číslo 2  z úkolové řady 17. kapitoly - použij 10 požehnání - co mám udělat, co je požehnání - ikonku, která je v úkolu nikde nevidím. Ani v náhledech nových budov.. Asi jsem slepej."}]