[{"18": "Taky je za chvíli budu mít z krku. chybí poslední dvě položky výzkumu. hlavní sídlo a jeden div. A propó vyplatí se některý z nich stavět?[BR]Půl roku v kapitole, mítvíc teleportů zvládnu to rychleji."}, {"2": "Je to zdroj lepidel a královských rekonstrukci[BR]Používáš je?[BR]Jestli ti třeba dračí archa umožní uklidit tři měsíční knihovny, tak se to asi vyplati"}, {"31": "Dračí archa ano, každé spoj. činidlo dobré, při mém nepřetržitém craftícím tempu. A Věštbu jsem také přistavila, nějak se mi navýšil počet evo budov a setů, které budou chtít rekonstruovat každou kapitolu.[smilie--sprite7][BR][BR]Asi záleží, jaký jsi maniak do craftu a vylepšování fénixů a medvědů. Za mě, když už mi tam stojí, tak alespoň aktuální."}, {"2": "Budovy které mám kvůli vbckum to tolik nepotřebují, ale vojáci, mana a podobně ty musí jít nahoru"}, {"6": "Co to je \"a podobně\"? Mana je jasná. Pro jistotu honím orky a semena. V unuriu cítím zradu. A vojáci? Kdybych měl čas, tak hraju 40 stanů, ale takhle jedu 20-25 stanů, což mi připadá jako bohatej stačák. Tím pádem u vojska řeším jenom žoldáky, jejichž spotřeba je, po vzoru Římanů ve svém posledním stádiu, nepříjemně enormní.[BR]Samostatnou kapitolou jsou prachy, zboží a zásoby, ale tam už na rozdíl od kapitol 1-9 necítím nějaké obzvláštní křeče.[BR][BR]Jenom zkus  občas za svých výšin na nás, co se pachtíme pod nižšími úrovněmi, milostivě shlédnout. Nechci tě nasejřit, ale vy nahoře máte občas vrchnostejří prázdné poučovací manýry."}, {"2": "Pro mě \"a podobně\" je semeno, urina a vojáci."}, {"129": "Schoenfeld - Tak s tym Unurium v Tymovom duchu (za chvilku tam seš) neni žadny problem za chvilku ju končim a už len 2 vyzkumy predo mnou.[BR]Stači mať Boblinovu expresnu službu ,ktora dava Unurium a vystačiš si uplne v pohode .Tržište mi prakticky celu kapitolu produkuje semena a neprepinam ho na unurium /semena tak šilene ako v v Obchodnikoch.[BR]Kapitolu hram v klide od Ledna se 4 živlamy od každeho s tym,  že som mal pauzu od hry 7 dni kvuli povinnostem.[BR][BR]Večšia šilenosť je 2 hodinova produkce portalu zadavani vyroby a vyber !"}, {"6": "Jo dík, Boblina mám desítku. Kvůli němu jsem se v Události honil jak nadmutá koza.[BR]Po 15 minutovém třítýdenním martýriu mi dvouhodinová produkce portálu zní jako hudba sfér.[BR]Když o tom psal Lovec jako o možnosti, tak jsem netušil, co je to za pakárnu. Ještě tři dny a začnu pouštět malé lodě po vodě a vzduchu někam k čertu."}, {"18": "Tak konečně hotovo."}, {"6": "Pozor na předzávěrečnou záludnost: Výzkum koncových elvenařích budov potřebují 55000K keše, což sídlo 37 nevyprodukuje ani omylem. Nezbývá než zlikvidovat malolodě po dokončení potřebné výroby fujtablů, navýšit baraby na potřebný stav, zlepšít sídlo na 38, a teprve pak můžeš pokračovat.[BR]Toto ale platí jenom pro zrychlený režim produkce maloloděmi při úložce běžné zástavby![BR]Neví někdo co znamená z rychlopřekladu Vicky1177:  \"Svolat všechny velké pirátské lodě + velké labužnické lodě + velké sběratelské lodě\"? (Viz https://cz.forum.elvenar.com/index.php?threads/obchodníci-z-unuru.6874/page-4#post-129214.)"}, {"124": "@Schoenfeld  nemusíš stálo to tuším 60dia Já už bourám a tak přemýšlím nad tím jestli se tam pak neskrývá úkol jako třeba zbourej Obchodní centrum za 200dia Svolat je postavit myslím,protože od každého můžeš postavit 3lodě Takže svolejte(postavte) 3x3 velké lodě"}, {"2": "Líbilo  se mi krátké video o tom jak tam ti tři tajtrlici plkaji sva moudrá a pak se ukázalo že od nikud nic neprileti a že jsem jim všechno musel postavit.[BR]Nakonec bych je vyhnal z města a všechno to zapálil."}, {"6": "27. února jsem otevřel kapitolu a před chvilkou dojel potřebnou lodní výrobu. Teď už jenom závěrečné šmrdolení kolem elvenaria, unuria a hlavně many. Never more. Jak říká anglický klasik.[BR]Na úkoly z vysoka kašlu. Na to už nemám nerva."}, {"18": "úkol za dia tam je a mám pocit že se netýká bourání ale nasbírání něčeho. Mám pocit unurium, ale nejsem si přesně jistý"}, {"124": "@WinterPhoenix  děkuji budu doufat,že to bude něco mimo výrobu lodí už je mám částečně zbourané a nahrazené manufakturama a domečkama aby se rychlejš vyrábělo U"}, {"6": "60 tis unuria za 200 mantů klidně přetrpím, ale žádné jiné velešaškárny.[BR][BR]A tak jsem jenom před závěrečnými branami a princezna je blízko."}, {"6": "Neříkej hop, dokud jsi nepřeskočil. Nebo podobná mudra. [BR]Před závěrečným finišem jsem zjistil, že jsem si do výpočetní tabulky malolodní produkce zadal pár hausnumer a bylo veselo. Naštěstí jsem si nechal cca půlku malolodí (Co kdyby?), takže se to zvládlo bez ztráty kytičky, páč mana byla náročná. [BR]Naštěstí byla boží minulá Událost, kde jsem ukořistil 6 vajec a 3 jezírka, takže to spolu s kouzly docela dobře sypalo.[BR]Poučení?[BR]Bacha na správnost údajů v tabulce a alespoň každé 2 dny kontrola a případné korekce.[BR]Dnes frčím do Týmoducha, takže si tu na příště budu maximálně hrát na chytrého.[BR]Po 74 nabitých dnech sbohem."}]