[{"16": "Funguje to jednoduše - ukážu to na sobě:[BR]Denní produkce unuria = 10% z pracující populace (10% z 622599 = 62260 unuria / den)[BR]Bonus ke sběru = 1% z použité kultury (1% z 753037 = 7530/výběr. Čím více výběrů, tím více unuria (např. při 6 výběrech/den to dělá 45182/den))."}, {"38": "@karhol  klikni do Inventáře, tam máš 3.záložky - Kouzla, Požehnání, Skladiště(Vyvolání)"}, {"11": "@karhol např. použít sílu zásob nebo doplnit sklad mincema[BR][BR]@mates123456 to Ti oznamuje že bonus se počítá  1% z kultury. To číslo nezvedneš ale můžeš vylepšit potřebnou kulturu. Ale bude tam stále 1 ale bonus bude větší"}, {"26": "Díky za radu, to mně vůbec nenapadlo. Naklikal jsem armádu a úkol splněn."}, {"169": "díky moc"}, {"49": "Ta metodika produkce tržiště je zvláštní.[BR]Pořád se snaží všechny zprůměrovat, zavádí zpětné úpravy pro \"zvýhodnění\" těch neaktivních a pak takhle jednoznačně zvýhodní velký hráče. Jsem jen zvědav, kudy se nám to vrátí [smilie--sprite1]"}, {"170": "GorGlin napsal/a:\t\t\tJak se budou skládat budovy je otázka, velké a malé lodě jsou značené jako sety, takže jejich napojení může významě ovlivnovat produkci.\t\tKlikněte zde pro zvětšení...Kde jsi viděl že jsou značené jako sety?"}, {"24": "Je to len podmienka napojenia (aby boli funkčné, musia byť nejak prepojené k hlavným lodiam), ale nijak to nepredstavuje získavanie bonusu ako v setoch. Je to podobne ako v ambasádach, kde sa napr. trpaslíčie pivovary napájali na buď iné trpaslíčie pivovary, alebo ambasádu trpaslíkov."}, {"2": "Aha, tak to je zklamání.[BR]takže postavím ty tři jmenované lodě, ke každé tři velké a jakmile vyzkoumám malé, tak velké zbourám a postavím tolik malých kolik se mi tam vejde.[BR]A to je to jejich nemůžeme být pořád na jenom místě.[BR]To že jsem ty lodě pracně vynalezl a posatvil, zatím co ta parta kašparů mi tam jen dělají stafáš nebudeme rozmazávat.[BR]No, nechám se hřát představou jak je pak všechny zapílím, než je vykopu z města."}, {"11": "to je asi jedno kterou vlajkovou lod začnu zkoumat první,že, nebo je nějaký tip?"}, {"2": "Já jedu perly a krevety první, protože je potřebuju na další portal.[BR][BR]Až potom podporuju zloděje na obytky"}, {"2": "No, ale na jeho vyzkoumání potřebuješ mít vyrobeno 2k perel a 4k krevet.[BR]Tedy musim začít tím."}, {"2": "Aha, tak díky.[BR]V tom případě přesně obracene.[BR]Takže portálové bonusy jsou mi tentokrát jen na to abych mohl šetřit manu?"}, {"11": "vždyt je skoro v každým výzkumu portálový zboží."}, {"2": "To máš pravdu.[BR]Ale je to jediná surovina s omezenou kapacitou, takže, pokud se nechceš v rase zahrabat, budeš muset celý výrobní aparát postavit.[BR]Tedy ti to neušetří klikání, ani prostor ve městě. Jen, pokud to tak autoři nastavili, jich bude potřeba aby ta celá věc zůstala v pohybu.[BR]Což mohli udělat nesplnitelnou spotřebou many, nebo nedostatečným výkonem portálu.[BR]Mohli se poucit z minula."}, {"16": "@GorGlin Můj typ je, že oni chtěli, abychom museli mít postaveny celé osadníky namísto abychom měli jen portál a jen spamovali požehnání (můj oblíbený průchod osadníky)."}, {"70": "Ahoj lidi. [BR]Kdypak jdou u této rasy vylepšit kouzelné budovy. Obchodník vyzkouman ale stále mi svítí rasa červeně"}, {"44": "po vyzkoumani obytnych budov"}, {"70": "Tak to jsem moc chvátal"}, {"11": "tak ti osadníci,pokud si dobře pamatuju se museli postavit i v předchozích dvou kapitolách, něco vyrobit a pak zbourat. Jen, myslím, u amunů to jde komplet přes PB, ale tenkrát u mě ještě nebyly."}]