[{"2": "To je zajímavé, uvažuju jestli se tedy opaltí utrácet tu věc na U.[BR]Velké lodě stojí děsný kotel a s oheldem na zabrané místo se nevypaltí.[BR]Tahle kapitola jede na instantech.[BR]Nebo aspon mě to tak připadá.[BR]Portálový bonus je základ abych udržel produkci zera, protože za 6 hodin vyrobím 7k, ale spotřebuji 18k[BR]perly a podobně honím urychlovaci aby se mi nerozpadala ta věc na U.[BR]Ještě že je máme."}, {"45": "...kedze ja, mozno ako jeden z mala, poctivo plnim ulohy, tak osobne postavim vsetkych 9 (3+3+3) velkych lodi (myslim, ze je to 37. uloha) a po ukonceni ulohy ich zburam a postavim potom uz len male. V podstate sa da rasa prejst len z vlajkovymi lodami, ale to by bolo velmi zdlhave, alebo by to zozralo velke mnozstvo casovacov...[BR]...portaloviek mam ce 10000% takze aspon o to zero sa nemusi starat [smilie--sprite1] (ako vycsina hracov co su v 17. kapitole)..."}, {"16": "Ono je ještě otázka, jak s tou produkcí zamíchají časy výroby.[BR]Min. čas na velké lodě je 3h, max. 9h[BR]Min. čas na malé lodě je 15 min, max. 3h[BR]S tím, zda se vyplatí malé nebo velké lodě ještě tedy může zamíchat čas přes noc(nebo jiné činnosti), kdy malé lodě nebudou vyrábět a ochota klikat co 15 minut.[BR]S ohledem na tyto 2 faktory se může klidně stát, že pro nemalou část hráčů může mít smysl mít postavené lodě velké a kašlat na ty malé (zatím nemám k dispozici, jak vypadá produkce malých lodí a zda např. při 3h cyklech se efektivita malých lodí nepropadne pod produktivitu těch velkých).[BR][BR]@citellus 3 velké lodě tam možná narvu (vyžaduje odteleportování 2 knihoven a přidání 2 rozšíření), ale pak už nebudu mít místo ani na jednu malou. Takže u mne úkoly dopadnou tak jako vždy (stejně jako u Lesních elfů prostě nebudu mít místo na to, abych ten úkol splnil a s teleporty se mi nebude chtít šaškovat, nemluvě o unuriu, které utratím na postavení budov, které pak zase ihned zbourám)."}, {"45": "@Lovec Krys nastastie ulohy su dobrovolne [smilie--sprite1], takze z pohladu uspory tovaru, unuria a miesta je tvoj postup logicky, no ja som hrac a proste mi neda tie ulohy neurobit [smilie--sprite1]. Osobne zatial s unuriom problem nemam, kedze mam skor problem pouzit casovace na vyrobu luxusu a spol. (tie pouzivam v akademii, vezi a na armadu ak je potreba), takze idem rasou o trochu pomalsie ako inokedy...[BR][BR]...ako som hore pisal, tak neplanujem mat vsetky velke lode s malymi naraz a v istom okamihu uz ostanu asi len male. Do plnej osadnickej vystavby este odteleportujem 10 stavieb (v sklade 70 teleportov k dispozicii), no robim to pomaly tak aby bol vzdy vyroba unuria co najvyssia. No ved uvidime, sme este len na zaciatku a osobne sa vela ucim a tak sa moze stat, ze to co som tu napisal este prehodnotim [smilie--sprite1]"}, {"11": "oni se mají velké lodě stavět po třech? Já myslel podle obrázku který tu někde je, že po jedný a potom malý."}, {"16": "@voyager-1 Velké lodě mají limit 3. V popisu lodí je přímo nebo nepřímo spojeno s vlajkovou lodí, takže pokud pojedeš malé lodě teoreticky bys neměl velké lodě vůbec potřebovat (tady jen záleží, zda chceš ty velké po vyzkoumání těch malých bourat nebo ne)."}, {"45": "@voyager-1 to nemusis, ale je takato moznost a podla info aj jedna z uloh..."}, {"68": "Nová kapitola je sice pěkná, ale jedno velké ALE. To obrovské množství živoucího zboží co po nás chce výzkum je teda hodně nesmyslný. Mam od každého živoucího po jedné manuf., kromě T6, ty mám dvě. A už mám nedostatek surovin a to je vyrábím už nějaký ten pátek nonstop i okouzlene.....Asi začnu uvažovat, že po skončení této kapitoly postavím další T4 a T5. Jen se obávám, že bude pak problém s božským semínkem....."}, {"2": "Mám to stejně jako ty a s živoucím zbožím nemám problém.[BR]Tedy krom platiny, to je fakt malér.[BR]Na stavbu je úkol jedna od každé.[BR]Je otázka co znamená ten úkol, svolat všechny velké lodě."}, {"45": "...prve co bolo potrebne po konstruktoch urobit je postavit SIMIU a vylepsit ju co najskor na max. na ukor vsetkych ostatnych divov. 2% rozklad je dost citelny, hlavne ked si medzi rasami alebo vyskum dlhsie trva. Osobne mam len po jednej manufaktire s kazdeho a drzal som citiaci cca 700K-1M z kazdej, teraz mam cca 500K z kazdej. Pre mna je citiaci/zivouci tovar najmenej problemovy a predpokladam, ze aj pre kopec inych hracov, ktori si vytiahli SIMIU. Niekedy je potrebne predvidat, citat diskusie a dat si rady, resp. prisposobit hranie toku co moze prist...[BR][BR]...osobne mi aj pomaha citiaci, co dostanem zo 14 zbrojnic a aj 16 setov kniznic nejake to zbozi doda..."}, {"2": "Ano, simia je základ.[BR]Oba efekty jsou velmi cenné."}, {"68": "Tak já sice nemám Simii na 30, ale na 24lvl a to je taky slušné. Stejně si myslím, že to přepískli. A 7 zbrojnic je dost. Nevím kam bych dala další. Spíš je už vše povinnost mít, a nutnost. Do města si pomalu nemůžeš dát nic, když to směřuje jen na budovani zivouciho, a to ještě buďme rádi, že není v turnaji. [smilie--sprite8]"}, {"5": "GorGlin: Nevíte někdo, jak malé lodě fungují?[BR]...malé zatím nevím, ale výroba ve velkých ti sžírá produkci z jiné velké lodě /cca 1/3 hodinové produkce potřeba na hodinou produkci v jiné velké lodi/."}, {"45": "@ElfNostradamus par sprav vyssie tu dal @Lovec Krys  - vyroba 17 kapitoly na en forum, kde je velmi trefny obrazok ako funguje produkcia, ale v malych je to podobne ako vo velkych len opacnym smerom...[BR][BR]@aikomi mas rovnaky pocet rozsireni ako ja, tak sa mozes inspirovat [smilie--sprite1], osobne mam rad ak mi nic nechyba, s orkami neklesam pod 3M, s manou pod 2,5M, vyrabam nonstop vo vsetkych troch armadnych budovach (v cvicisku idem iba strategov) a pod. Tovaru nemam vela len od 14-22M, ale na druhu stranu ho ani vela neminam (vezu idem na 100% bojom a novy turnaj na 99%)...[BR][BR]Příspěvky sloučeny. Embla"}, {"68": "@citellus Mrknu, děkuji za inspiraci. Třeba mě u tebe něco zaujme a využiji to ve svém městě. [smilie--sprite2]"}, {"5": "Obrázek jsem viděl, je pěkný, ale nejsou tam konkrétní čísla, takže uvádím, že u velkých se produkce navzájem třetinově sžírá, což opětovně zpomaluje postup výzkumem..."}, {"45": "@ElfNostradamus za rovnaky cas vyrobis vo vlajkovych lodiach artefakty 100 (to je len priklad, kazdy ma ho iny), luxus, ktory ma dvojnasobnu hodnotu, cize 200 a 400 kreviet, ktore maju oproti artefaktom 4-nasobnu a oproti lususu 2-nasobnu hodnotu.[BR][BR]Napr. u mna velka piratska lod za hod. meni u mna 32 kreviet na 44 peral, cize za 6 hodin mi z 192 kreviet vyrobi 264 peral, no ak by sme brali pomer 1:2, co je medzi perlami a krevetami, tak je to zo 192 jednotiek mi vyrobi 528 jednotiek, cize mi moje osadnicke suroviny za 6h znasobi 2,75x...[BR][BR]...osobne si myslim, ze sa oplati mat velke a neskor male lode, no mozno som v mojich prepoctoch urobil chybu a ak sa to stalo, opravte ma [smilie--sprite1]"}, {"2": "Užírá, ale s postupujícím výzkumem a lvl tržiště bude směna stále výhodnější.[BR]A kdo má čmeláka tak bude v určité výhodě hned z kraje.[BR]Když jsem si sčítal spotřebu many, tak jsem se docela prohnul.[BR]Je tu někdo kdo jede manu výhradně přes opatství?"}, {"16": "5000% PP dokáže spotřebu many výrazně snížit. A ne, kromě opatství mám 2 Ledové vánoční stromy (necelých 200K many denně)."}, {"144": "Tak zjišťuji opět velkou nevyváženost v herním systému. Delší dobu chybí nabídka vtipného mýdla = pouze 3 stránky nabídky u obchodníka, v současnosti nabízí jen jeden hráč a to s marží 41% ! = 1:1,41 ....zatímco bizmutu se nabízí 74 stránek a houbiček 38 stránek (+-)1:1"}]