[{"2": "Jo, mýdlo mi taky dochází, ale když bude nejhůř, dám poptávku za houby a tam jsem zatím vždycky uspěl.[BR]Nezavidim městům co dělají bismut, ty se u nás můžou spolehnout jen na členy."}, {"26": "Ono je pořád něčeho nedostatek a něčeho přebytek, já si pamatuju, že když přišly Ambasády bylo velmi obtížné sehnat právě bismut.."}, {"2": "Už je to opravdu dlouho, možná že si to jen nepamatuji, ale co mám set knihovny, mám bismutu nejvíc."}, {"44": "Jak byla vymyslena tahle rasa pro lidi kteri nemaji plno portalovek a produkci many za kterou by se nestydel ani Gandalf s brumbalem dohromady ? tipuji tak na rok ne ?[BR][BR]Odstraněn nevhodny na"}, {"3": "by mě zajímalo, kdo v téhle kapitole nemá plno portálovek..."}, {"16": "@Emhyr var Emreis II Někdo, kdo nehraje celou věž jako my. Pokud jedeš jen první patro, tak jich zase tolik nepadá. A pokud ji nehraješ vůbec nebo jen velmi málo, tak je prostě nemáš."}, {"2": "jsou lidi co nehoblují věž každý týden  a podobně[BR]ty to budou mít hodně smutný[BR]v nižších kapitolách je to super pomocník, ale ted si to bez nich nechci ani představovat[BR]na začátku obchodní centrum nezvládne uživit ani první tři lodě a to musíme vyrábět zero i na výzkum[BR]pak se to zlepší, ale několik milionů many které jsem měl jsou pryč[BR]když jsme viděl co xinn na betě postavil za flotilu, tak jsem jen naprázdno polkl[BR]já budu tuhle rasu hodně kouzlit"}, {"3": "vždyť já jsem jich měl přebytek už předtím, než věž přišla do hry. To množství těch malých eventových domečků, eventové truhly apod... padalo to z fénixe. Ano, byly to vesměs 5 a 10%, ale bylo jich spousta. No a teď s věží už to jsou taková kvanta. Škoda, že to kouzlo nejde použít dvěma způsoby. Třeba jako portál bonus a zároveň VB do divu nebo čarování kladiv nebo bonus k výrobě. Zkrátka něco užitečného"}, {"2": "Můžeš to rozbít v řemeslné výrobě z toho udělat bonusy o kterých mluvíš"}, {"3": "jo, kdyby se to dalo rozsypat na činidla, tak možná... úlomků kouzel mám přes 800.000 a to ani nic nerozbíjím (prostě věž)"}, {"16": "Já rozbíjím jen na úkoly v eventech."}, {"44": "tak jsem rad ze je to vyreseny , vsichni v teto kapitole maji portalovek plnej sklad , dekuji za vysvetleni . uvidime za pul roku az tam dorazi lidi kteri vymlati portalovky na predesle kapitoly a nehraji to od zacatku jak nekteri."}, {"11": "portálovky jsou nutný až od kapitoly Elvenarů, s její příchodem byly zavedeny i teleporty. Musí holt v předcházejících kapitolách trochu šetřit pokud jim nepadají ze všech stran."}, {"44": "to nic nemeni na tom ze postavit kapitolu tak aby sla projit normalnim zpusobem pouze a jen pres pozehnani je podle me kravina . A to ze portalovky jsou potreba az od elvenaru je sice mozny ale pochybuju ze nekdo v orkach bude premyslet nad posledni kapitolou a bude setrit portalovky [smilie--sprite1]"}, {"11": "no vidíš a já to tak na malým světě dělat, že jsem před elvenarama použil jen nějaký  minimum a ted jsem v elvenarech a mám jich dostatek i pro příští kapitolu."}, {"3": "Anthalas napsal/a:\t\t\ttak jsem rad ze je to vyreseny , vsichni v teto kapitole maji portalovek plnej sklad , dekuji za vysvetleni . uvidime za pul roku az tam dorazi lidi kteri vymlati portalovky na predesle kapitoly a nehraji to od zacatku jak nekteri.\t\tKlikněte zde pro zvětšení...to je nemožné. Portálovky sypu od půlky draků, kdy mě přestal bavit stále stejný princip spřátelených ras a i přesto mi zásoba portálovek raketově roste. Můžu si dovolit používat jen 5% PB, na skladě se mi hromadí všechny ty padesátky, třicítky a kdoví, co ještě a těch pětek mám pořád stovky. K čemu je tohle dobré?[BR][IMG]https://i.ibb.co/ChPM7pc/https-cz-forum-elvenar-com-index-php-attachments-3-png-5109.png[/IMG]"}, {"38": "@Emhyr var Emreis II ono bude lepší se o tom moc tady nezmiňovat, nebo to zjistíme hned v další kapitole, k čemu je to dobré [smilie--sprite6]"}, {"3": "pochybuju, ve hře se takhle hromadí bez užitku víc věcí:[BR]runy[BR][IMG]https://i.ibb.co/ZLHZGb9/https-cz-forum-elvenar-com-index-php-attachments-1-png-5110.png[/IMG][BR]relikvie[BR][IMG]https://i.ibb.co/ByBhKVg/https-cz-forum-elvenar-com-index-php-attachments-2-png-5111.png[/IMG][BR]některá kouzla[BR][IMG]https://i.ibb.co/58WyrG1/https-cz-forum-elvenar-com-index-php-attachments-3-png-5112.png[/IMG][BR]úlomky[BR][IMG]https://i.ibb.co/X422fYf/https-cz-forum-elvenar-com-index-php-attachments-4-png-5113.png[/IMG][BR]některé budovy a další a další.[BR][BR]A to určitě nejsem zdaleka rekordman [smilie--sprite1][BR][BR]Edit: ale tím už končím a omlouvám se za příspěvek mimo téma!"}, {"11": "ty krmení by se mi hodily"}, {"44": "tak treba se pletu , zatim si nikdo nestezoval ze cela kapitola bez portalovek je peknej omrsk . jen si neumim predstavit je nemit a tuhle kapitolu hrat ,jak dlouho by me to bavilo nez bych s tim prastil ? [smilie--sprite1]"}]