[{"118": "@Emhyr var Emreis II  - už se těším na dobu, kdy budu mít taky takové zásoby"}, {"105": "@Ladonka - tak ta doba už nikdy nepřijde neb Emhyr si to nasyslil v dobách starých turnajů. Maximálně pokud budeš sjíždět věž každý týden až nahoru, tak nějaká ta lepidla a portály získat můžeš [smilie--sprite1]"}, {"11": "vy co už máte velký lodě postavený, dostali jste tu dvoupolíčkovou popkult.  budovu za odměnu? Já ji nikde ve skladu nevidím."}, {"45": "@voyager-1 mas ju na konci v sklade"}, {"11": "no jo, je tam [smilie--sprite1] já jí hledal hlavně mezi odměnama z kapitoly.[BR][BR]edit: aha, to je budova co nepůjde zvednout takže žádná kapitola."}, {"2": "je to diamantová kulturka z elvenarů[BR]už jednou takovou budovu rozdávali"}, {"11": "pls.,kolik bude úkol vyžadovat přivolat malých lodí ?"}, {"45": "@voyager-1 pozaduje 6 malych lodi, ale su tam aj ulohy, kde musis mat 6 malych lodi a ine 3 mas predat..."}, {"11": "jako od každý 6 nebo po dvou?"}, {"2": "S ohledem na vývoj rasy jsem dnes přestal vyrábět tu věc na U[BR]Semene mi zbývalo na necelý den[BR]Snad mi to bude takhle vycházet i dal"}, {"11": "já už taky jedu dva dny semínka, než se vyzkoumaj malý lodě, to je na tejden a na výzkum ta věc na U není třeba. Před tím zase přepnu."}, {"2": "udělal jsem si nějaké pročty[BR]Velké lodě/malé lodě[BR]produkce na malých lodích má menší výkon, takže menší rozměry jsou vyváženy nižším ziskem, k tomu maximální produkce na tři hodiny, takže přes noc budou stát.[BR]celé my to vychází, že se velké lodě nevypaltí bourat[BR][BR]jak to vychází vám?"}, {"11": "myslíš nechat velký a postavit i malý?[BR]Ta max. 3hod. produkce je fakt zádrhel, taky přemejšlím jak pokračovat, dneska výzkum malých dokončím. Problém u velkých je zas ten že postavíš jen tři."}, {"2": "velké lodě mají skoro dvojnásobnou plochu, ale dělají méně a v noci stojí[BR]buseš si to muset spočítat sám na sebe[BR]já ty produkce na 15 a 30 minut moc nevyužiju a tak jsem srovnával  hodinu a tři a když připočítám opakované investice té věci na U[BR]využiji naplno teleport a postavím řádnou megastavbu"}, {"16": "Ony se nejspíše vyplatí, pokud se někomu chce klikat po 15 minutách (nebo je tam dokonce 5?).[BR]Mám vypsanou produkci na 3h z bety, kde je právě stavím, ale efektivitu zatím nemám spočtenou.[BR]Zatím nejpravděpodobněji se jeví varianta, kdy si nechám velké a přistavím k tomu malé (teď si představte projíždět tuto kapitolu bez teleportů)."}, {"11": "Tak jsem rozjel variantu nechat velký lodě a přidat po deseti malých."}, {"2": "Na to nechci ani pomýšlet, uklidil jsem cca deset budov, bez teleportu, znovu to muset stavět, to by se prostě nevyplatilo.[BR]malé lodě mají výrobu 15 minut, 30 minut, 1 hodina a 3 hodiny."}, {"11": "teleportů mi po úklidu zbylo přes padesát ale pořád jsem nepochopil jakou variantu Ty chceš postavit"}, {"2": "Necham si velké lodě a pristavim male[BR]Cca 6 od každé, uvidíme jestli se tam v jde vic"}, {"38": "Za mě zůstanu u varianty této, jak jsem psal dříve."}]