[{"11": "@GorGlin  tak prakticky to samý jak já"}, {"2": "@BiggJOEcz  počítal jsi kolik ti to bude dávat?"}, {"38": "@GorGlin Zatím ještě ne. Bude to ale stejně hodně individuální a každý to bude mít jinak, neb se malé a velké lodě  odvíjí od četnosti sběrů - jinačí poměr malé a velké.[BR]Spočítám to, jakmile budu mít i ty malé ve městě."}, {"11": "tak to radši nepočítej, nebo s takovým minimem lodí se z toho zblázníš [smilie--sprite1] Sranda, ale ne daleko od pravdy [smilie--sprite1]"}, {"38": "@voyager-1 [smilie--sprite1][BR]Možná to spočítám jen tak pro svůj přehed, jak to mám nastavené, neb tady nejde jen tak spočítat univerzální čísla, záleží na mnoha faktorech.[BR]No  ale přijde mi, že tato 17.kapitola jede tak nějak sama, žádné větší sekance ve výzkumu při výsledku VB/osadnické suroviny (možná i díky snížení VB z turnajů) až do výzkumu malých lodí, kde se chvíli počká na ty kreveto-perlo-klíče.[BR]Dál se uvidí. [BR]Zatím ale dobrý [smilie--sprite6]"}, {"11": "Tak mi vychází orientačně, že se třemi velkými a 10 malými pirátskými loděmi, vyrobím za den zhruba 4700 perel. Počítal jsem 15 hodinových výběrů plus nějakou noční produkci velkých lodí a mateřské lodě. Na výzkum OC 4 jich potřebuju 36k."}, {"2": "@voyager-1 já do města poskládal jen 6 malých lodí[BR]víc se mi jich ta prostě nevejde, nemůžu dál bourat abych udržel produkci té věci na U.[BR]jsem zvědaví na ty úkoly na bourání[BR]vychází mi to, že poměr surovin na výzkum je 1:2:4[BR]takže jakékoly bourání je nesmysl, tak doufám, že jsem to jen špatně pochopil"}, {"11": "Zajímavej bude výzkum konečných obytek. Hodně hráčů včetně mě je s lidma v mínusu a ten výzkum vyžaduje zvednutí hlavního sídla. Nebo dokoupit mega mincí za dia, kolik to může stát..."}, {"16": "@voyager-1 Nesmíte si v unurech odteleportovat příliš mnoho obytek. Já mám aktuálně populaci v plusu (97501), takže klidně v případě potřeby můžu odteleportovat dalších 6 obytek a ještě mi na vylepšení zbyde.[BR]Další možností je, že část těch obytek před koncem kapitoly vrátíte zpátky (ať už dočasně nebo trvale = malé lodě odteleportovat jdou)."}, {"2": "@voyager-1 [BR]možností je několik, můžeš začít zvedat termální prameny[BR][BR]@Lovec Krys [BR]Velké nejdou?[BR]Myslel jsem si, že teleport nefunguej jen na budovy s limitem 1"}, {"16": "@GorGlin Nejdou. Ten limit není jen na budovy s limitem 1, ale na všechny budovy s omezeným počtem, tedy i na velké lodě."}, {"11": "já jsem v mínusu 100k lidí, tam to TP nevytrhnou, jediná možnost je udělat místo a vrátit 7 obytek. Holt to bude stát další balík teleportů."}, {"45": "...osobne som velke lode vsetky zbural, 1 velka lod vyrobi cca tolko ako 1 mala a na cca dvojnasobnej ploche, takze kto sa vie cca kazde 3 hodky pripojit, tak ani strata 6h v noci mi nevadi (osobne spim [smilie--sprite1]) a prinesie mi to viac osadnickych surovin ako keby som tam nechal velke lode...[BR]...male lode som pristavoval postupne a postupne som teleportoval budovy do skladu, takze zo 16K unuria kazde 3h, som klesol na 9K, no stale je to produkcia, ktora bohate staci na zisk potrebneho mnozstva v danom case, kedze vyroba peral a spol. je bez casovacov alebo DIA poriadne zdlhava a tie mnozstva su naozaj obrovske (ani casovace a ani DIA pouzivat nechcem a nebudem)...[BR]...takze aby som nestal velmi dlho, tak som postupne vystaval az 16 lodiek na perly a na krevety a 14 na kluce a celkom pekne sa to zacalo hybat [smilie--sprite1][BR][BR]17 kapitola - Lodky"}, {"11": "nad tou variantou nakonec přeci jen zbourat velký lodě taky přemýšlím, jak píšeš, ta ztráta v noci vynahradí denní produkce. A člověk nemusí hlídat na kterou výrobu klikne, protože je to u každýho typu lodí jinak."}, {"2": "Já podléhám lidské lenosti a nebudu dál řešit[BR]Už takhle je to drsného klikání, nechci jich mít víc.[BR]A taky na to nemám tu věc na U"}, {"38": "@GorGlin  Tak nakonec mě to nedalo a i přes tu variabilitu jsem se na ty výroby kouknul.[BR]Propočítal jsem 3.varianty, jak pro lenochy s jen velkými loděmi, tak trochu rozšířenou variantu, co jsem tady psal dříve ,tak i větší variantu s více malými loděmi cca 5x5 parcel. Výsledek je zajímavej...[BR][BR][IMG]https://i.ibb.co/vYXTPxC/https-cz-forum-elvenar-com-index-php-attachments-17-chapter-ships-jpg-5137.jpg[/IMG]"}, {"2": "koukám že jsi to vzal z gruntu[BR]Ale vidím v tom odchylku od mých čísel[BR]mě vychází poměr surovin 1 klíč, 2perly, 4krevety[BR]A z toho i budov mám stejně jednu lod pojmenovanou, tři velké a 6 malých[BR]Protože i součet spotřeby ve výzkumu jsou ve stejném poměru.[BR]jdu se podívat jeslti jsem se někde neseknul"}, {"38": "@GorGlin  ono to není 1:2:4, jsou tam jednotkové odchylky, ale to je ve výsledku jen drobnost. Jde o ten princip.[BR]Pro ty čísla jsou zohledněné všechny 3.druhy lodí produkující Kl+P+Kr. Jak je popsané v pdf[BR]A jako součet v celém výzkumu to není. Ten celkový součet všech výrob  je přesně až PO vyzkoumání portálu na 4.úroven jako prvního výzkumu hned po všech 3.malých lodí.  Klíče budou potřeba průběžně vyrábět ve stejném tempu, navíc v 1.polovině výzkumu od portálu 4 převažují rapidně krevetky, perly se začnou stupnovat až v 2.polovině."}, {"11": "já nakonec zvolil jinou variantu. Vyrábím hlavně perly a nevyrábím produkci který perly žerou. Dopoledne jich bude na OC 4  dost. A zároven i ostatního, i na zvednutí Díky kombinaci velkých a malých lodí ostatních surovin  jsem mohl vyrábět omezeně i ostatní dva produkty bez použití perel. Takže už nejsem zastánce toho, mít jen malý lodě.[BR]Vykoumali to tentokrát zajímavě."}, {"2": "Tím si ale urychlujes zisk jedné suroviny na úkor jiné a některé budovy ti tím pádem budou stát, ne?"}]