[{"11": "ano, u jedné sur. stojí velké u druhé malé ty druhé vyrábějí bez použití perel, ale výzkum OC4 je docela důležitý a přesto mám dost klíčů a dobrot na výzkum a zvednuti OC a čekám už jen na unurium, pak se zaměřím na dobroty, uvidím."}, {"2": "To je pravda a při deseti malých lodích je ta spotřeba už určitě znát.[BR]Mě brzdí stále ta věc na U[BR]Bohužel jsem dal dost semene do divu, takže musím už výrobu střídat a tak mi ještě pár dní potrvá než  ho vyzkoumam."}, {"31": "Dle Elvenarchitecta se v kapitole obchodníků opět zvyšuje produkce many u setových budov (Ledový vánoční strom, Fontána hýřilů aj.) Může to někdo potvrdit?"}, {"16": "Ano, vzrostla. Mám vylepšené oba stromy na manu."}, {"2": "Ale nebyla to žádná velká čísla, pokud jsem si všiml."}, {"11": "mohl bych poprosit o přesnější čísla? Jestli to má význam kvůli tomu zvedat o dvě kapitoly. Protože navýšení do 16. kapitoly nic nepřináší."}, {"31": "Ani na architektovi to nebyla nijak závratná čísla.[BR]\t\t\thttps://www.elvenarchitect.com/buildings/details/a_evt_winter_xviii_set_a_ice_tree/\t\t\t\t\thttps://www.elvenarchitect.com/buildings/details/a_evt_car_xix_set_a_fountain/\t\t"}, {"11": "po tisícovce... nevím jestli má význam za to obětovat desítky KR"}, {"16": "@voyager-1 Aktuální produkce v Unurech je 24k (+24K a +48K za bonusy), tzn. 96K/den s plným mana bonusem. Navíc dává 14,6K kultury k tomu, což se hodí k udržení výrobního bonusu, pokud vykupuješ věž (která ve 3. patře snadno dokáže vyluxovat i plný sklad mincí)."}, {"20": "Já staré sety vylepšuji, protože jejich produkce je pořád velmi dobrá, chci je ve městě uchovat a potřebuji posílit hlavně kulturu. Ono se to zvedne třeba jen trochu, ale díky divům (Maják + Ruiny) se to pak násobí při sousedské pomoci a celkový přínos je velký. Pauzu jsme měli mezi kapitolami dlouhou, takže KR jsem měla našetřeno z turnaje dost. Navíc teď získáváme v turnajích většinou 8 KR, tak to přibývá lépe. Prostě vylepšuji vše, co chci ve městě uchovat. Ať už medvědy, Fénixe, atd. Když už zabírají určitá políčka, tak ať mají co nejlepší produkci, kterou mohou dát.[BR][BR]Ještě k produkci lodí - hodně záleží na tom, jestli máte Kvetoucí obchodní cech. Přidaná procenta v produkci jsou hodně znát. Jelikož jsem měla nucenou herní pauzu (asi 3 týdny), tak nejsem tak daleko jako zdejší borci. Právě stavím velké lodě, ale se stavbou těch malých asi nebudu spěchat. No, ještě je nemám vyzkoumané [smilie--sprite2]. Stejně čekám na produkci Unuria, jelikož občas musím přepnout na semínka, abych je doplnila. Velké se mi zatím nechtějí bourat, ale uvidím. Vždycky si složitě plánuji, jak postavím výrobu a pak, když začnu hrát, udělám to většinou jinak. Mám plán setu na malé lodě, ale jestli na to dojde zatím nevím."}, {"11": "@Lovec Krys  tak 4k za strom navíc za cenu 36 KR, za dva stromy a fontanu 90KR kde bych je vzal. Ne, věž vykupuju vyjímečně."}, {"2": "Nemá, ale výkon je lepší než všechno co máme a tak pro budoucí generace to smysl má.[BR]Tedy ty moje, já zvedl všechno co ve městě mám."}, {"11": "pomalu, ale jistě, z toho začínám bejt opravdu otrávenej. První rasa co mě vyloženě nebaví. [smilie--sprite3]"}, {"2": "bryz se toho zbavíš[BR]máš lodí jak jak smetí"}, {"11": "no, řekneme si to někdy v lednu."}, {"2": "Jo, taky mi to tak vychází.[BR]Dnes konečně zvednu portál, tak si k tomu večer Sednu a uvidím co mi hodí Excel za předpověď."}, {"68": "No mě už předposlední kapitola nebavila. I když mám dost portálu, tak stejně musím vyrábět. Pozitivní je, že není tolik VBcek ve výzkumu, ale zase hodně těch surovin. Tak nějak bych chtěla postavit všechny lodě a rychle to projet...."}, {"2": "Druhá polovina výzkumu v Ambasádách se dala táhnout přes pozehnani.[BR]Tady jsou požehnání potřeba, aby vůbec zakladni výroba zůstala v chodu a suroviny na výzkum musím pokrýt přes urychlovace.[BR]Uvidíme jestli jich mám dost."}, {"16": "Já to na betě řeším tak, že vyrábím E0 z mýdla a zbytek si pomáhám PP, kterého tam mám málo.[BR]Na cz1 to neřeším, tam mám PP tuny, takže E0 vyrábím jenom z PP.[BR][BR](E0 = Elvenarin zero, PP=Portálová požehnání (pro ty, co nejsou zběhlí v herních zkratkách))[BR][BR][BR]ps: Asi se tomu bude přezdívat také teleportovací kapitola."}, {"38": "Tak musím říct, že ty Malé a Velké lodě pořádně mávají s produkcí díky těm surovinám, co potřebují k výrobám.[BR]Je tam třeba si propočítat správný poměr V.+M. lodí u každé ze 3.produkcí, a to tak, aby u jedné nepřebývaly suroviny a naopak u druhé nechyběly.[BR]Ty \"hrubé\" propočty, co jsem DÁVAL ZDE , jsou hodně nepřesné, právě kvůli těm surovinám, které musím použít pro výroby.[BR][BR]Tak jsem zkusil vytvořit tabulku, která to zohledňuje. Stačí si tam zadat údaj, kolik máte malých a velkých lodí, rozlišit, které (klíče, perly, krevety), pak to mezi sebou ručně propočítat (na automatický výpočet jsem už byl lenošnej [smilie--sprite6]  )[BR][BR]U všech lodí jsem to počítal takto:[BR]Produkce Malých lodí za 1.den : 3h+3h+3h+3h+3h[BR]Produkce Velkých lodí za 1.den : 9h+3h+3h+3h+3h[BR]Produkce Hlavních lodí za 1.den :12h+6h+6h.[BR]Je už započítaný bonus +60% k produkci surovin z portálu lv4.    Bez divu Kvetoucí obchodní cech[BR]Pak celkové hodnoty surovin jsou počítané přesně PO vyzkoumání Portálové budovy na level4, jako první výzkum hned po výzkumu malých lodí.[BR]Propočty jsou pro tyto pravidelné sběry, takže se výsledek bude lišit při prodlevách. Takže to berte spíše orientačně.[BR][BR]Jako příklad jsem vzal ten obří přístav lodí, co má právě @voyager-1 (snad se nebudeš na mě zlobit [smilie--sprite6] ). Zatím jsem větší flotilu ještě neviděl [smilie--sprite2][BR][BR]Včera to měl takto:[BR][IMG]https://i.ibb.co/1283XLS/https-cz-forum-elvenar-com-index-php-attachments-voyager-1-old-jpg-5148.jpg[/IMG][BR][BR]..a dnes přidal po 1.malé lodi u všech 3. Tím si zkrátil dobu do konce kapitoly o 3.dny. Dobrá práce za ten \"kolos\"[BR][IMG]https://i.ibb.co/M6SfJPm/https-cz-forum-elvenar-com-index-php-attachments-voyager-1-new-jpg-5149.jpg[/IMG]"}]