[{"45": "Dear Humans and Elves,[BR][BR]Please use this thread to discuss the Tournament Changes that will come to Elvenar on the 18th of August.[BR][BR]We're looking forward to your feedback. [smilie--sprite1][BR][BR]Kind regards,[BR]Your Elvenar Team"}, {"22": "It's interesting that EN Live is being used a Beta Mk 2, but at least it perhaps means that nothing is finalised, as is often the case once something comes to Live.[BR][BR]For anyone except the most casual players (who are, incidentally, only a tiny percentage of the player base, but probably means most people who read these forums), tournaments are going to get much harder to reach higher scores. They have now adjusted their initial announcement to say that this will apply to any score about 2,500 points.[BR][BR]My first comment here is similar to the point I've been making - I understand that it's going to get harder to score big and get good rewards. That much is fine. I still have a major concern, however, that there may be a net negative impact of either placing expansions or upgrading some AWs. If this is the case for either one then it seems to me that something is broken in the game. They have taken a step in the right direction in reducing the impact of expansions, but Ancient Wonders have still not been mentioned. So I will keep banging this drum and I would be grateful to know if it is being investigated at least. As it stands, owning and upgrading certain AWs, such as Thrones of the High Men, Blooming Trader Guild, etc, will do nothing but damage people's games... Surely this can't be right."}, {"14": "Here's the feedback:[BR][BR]Inno created a terribly bad formula, that will punish their (paying) customers for growing a big city.[BR]There is 57 pages worth of reactions on the Beta forum, almost all of them telling Inno that the current implementation is a very bad idea and that they need to fix their formula, before they break their own game even further.[BR][BR]Stop being dumb. Stop hitting everything with the heaviest nerf-hammer. Listen to your customers for once."}, {"73": "I’m spent complaining. [BR]Ready to test for you with the hope that more balancing is yet to come. [BR]@Silmaril : since we are acting as Beta 2, would you please ask devs to add battle boosters to en player inventory for 2-3 weeks, so we can do extensive testing ?"}, {"22": "JollyElf said:\t\t\t@Silmaril : since we are acting as Beta 2, would you please ask devs to add battle boosters to en player inventory for 2-3 weeks, so we can do extensive testing ?\t\tClick to expand...Interestingly, when the new tournaments hit Beta there was a period of about 5 days when the combat buildings turned up in everyone's MA at the rate of more than one a day, before it then went back to normal."}, {"73": "Pauly7 said:\t\t\tInterestingly, when the new tournaments hit Beta there was a period of about 5 days when the combat buildings turned up in everyone's MA at the rate of more than one a day, before it then went back to normal.\t\tClick to expand...I don’t mind crafting them. But why should others spend game currency. If we are testing for them, it should be free."}, {"45": "Don't forget guys this is the modified version after beta changes have already been added after the first wave of testing. We are all still testing this for a few weeks and all feedback once you are able to play this will be invaluable."}, {"20": "I see my chapter 3 city will now have to cater tier 2 products, where it previously did not have to. Not looking forward to this."}, {"15": "Really not excited to be a guinea pig. If I wanted that I'd have an account on Beta. Also not entirely fair that other servers get to enjoy the old tournaments for at least 3 weeks longer than the EN one."}, {"14": "Silmaril said:\t\t\tDon't forget guys this is the modified version after beta changes have already been added after the first wave of testing. We are all still testing this for a few weeks and all feedback once you are able to play this will be invaluable.\t\tClick to expand...[BR]Yes, the modified version which will still punish people HARD for building a strong city with a lot of expansions and AW levels. It was only tuned down a little bit, which seems to be the strategy. Put in a huge nerf, with giant added costs for catering, and then tuning it down to try and calm down the angry outburst.[BR]Oh please; how transparent can you be?[BR][BR]You do realize the high end people were scoring 800+ kp often, hitting 15K scores if not higher? Marindor has stated on the Beta forum that the difficulty will now sharply increase at the 2.500 point mark, meaning people will lose out on their weekly gain and their weekly activity.[BR][BR][BR]Silmaril said:\t\t\tTournament Encounters are now played directly from the World Map. To achieve this, the 4 Encounters per Tournament Province have been merged into 1 Province Encounter, combining the efforts of 4 Encounters into just 1. This also means that the Goods required for Catering, and the Units faced in Battle have been scaled up accordingly, to keep the general requirements of each Province comparable while having only one Encounter.\t\tClick to expand...[BR]This was the ONLY change that was requested.[BR]Everything else Inno did with the tournament was not asked for, not wished for, and most certainly not appreciated.[BR][BR]Why not just come out and say you don't want people to gain so many KP every week?"}, {"22": "Killiak said:\t\t\tThere is 57 pages worth of reactions on the Beta forum, almost all of them telling Inno that the current implementation is a very bad idea and that they need to fix their formula, before they break their own game even further.\t\tClick to expand...57 pages was just the second thread."}, {"74": "@Silmaril can you please confirm if it is intentional that battles should be literally unwinnable? Previously \"difficulty\" (the ratio between our squads and enemy squads) was capped at 160% for six stars. 145% for five stars which gives the KP. Looking at Beta forum it appears over 200% ratio is rapidly possible and there is no cap ... That means that the tournament is not harder for fighters it becomes literally impossible to win a fight. [BR][BR]Is that really reasonable or intentional? Getting more expensive is one thing but there should be a cap on difficulty ratios so that it's at least possible to win the fight even if it's expensive."}, {"32": "Why would you ask for feedback if it's going into the trash anyway,[BR][BR]Looks like almost none of the feedback is used and they are just pushing it to live anyway as is, with fake ideas that feedback[BR]is appreciated.[BR]Guess there main goal is to see how many paying players they will loose in the timespan of 3 weeks, and if the losses are acceptable they will push it trough and if they loose to many then they might scrap it."}, {"68": "\" The chances of Coins and Supplies as possible costs for Catering a Tournament Province were lowered. The same was applied to Orcs and Mana, but these resource requirements were made even more rare than Coins and Supplies.\"[BR][BR]Oh, if only this was true, I've been playing in Beta for quite a while and am in Ch15, I've been forced to place a Stage 2 Fire Phoenix to waste pet food on, I have 1 brown bear and although I do the spire every week I never have enough windfalls to use all the time boosts.[BR][BR]This week I've had to stop on Province 26 1*.  Saying that mana and orc requirements are even more rare than Coins and Supplies is meaningless when faced with this:[BR][BR][IMG]https://i.ibb.co/Y8KJ7tG/https-en-forum-elvenar-com-index-php-attachments-steel-tourney-1-png-4620.png[/IMG][BR][BR]This wasn't the first province asking for orcs either, earlier provinces were asking for 5k+.  It doesn't matter how much we're told that the requirements have been reduced when they are so big.  The game has been killed for those who were primarily catering, and yes those people are playing.[BR][BR]Province 23 on live is asking for just 372 orcs, I can't think that province 26 will be much more than that.[BR][BR]You can forget the big numbers now in tournaments, unless of course its your final tournament before quitting...[BR][BR][IMG]https://i.ibb.co/xYRv1Q2/https-en-forum-elvenar-com-index-php-attachments-steel-tourney-2-png-4621.png[/IMG][BR][BR]Its a great business model, encourage people to spend money on the game and then penalise any benefit they might give by significantly reducing the returns.[BR][BR]I have millions of goods on Beta because I can no longer use them for a few provinces and there's no point building more armories for extra troops as they are just cannon fodder."}, {"75": "CrazyWizard said:\t\t\tWhy would you ask for feedback if it's going into the trash anyway,[BR][BR]Looks like almost none of the feedback is used and they are just pushing it to live anyway as is, with fake ideas that feedback[BR]is appreciated.[BR]Guess there main goal is to see how many paying players they will loose in the timespan of 3 weeks, and if the losses are acceptable they will push it trough and if they loose to many then they might scrap it.\t\tClick to expand...One could perhaps be a little cynical ...[BR][BR]The new tourney version has more or less worn out its welcome in Beta; exhaustion, and a feeling of not being listened to, has to some extent set in.[BR]However Beta is well populated with players who know what they are doing and are often very advanced in Live worlds.[BR][BR]This move to EN is an opportunity for Inno to evaluate the overall response, including from many less knowledgeable and smaller cities, for whom the tournament will probably be a little easier. [BR]So they'll likely respond positively (which will look good as feedback) not realising that they should probably stay small and that any expansions, AWs or research that they subsequently undertake may come with a (hidden?) penalty for tournament."}, {"76": "The only good thing about this move is that it will allow more testing on the more extreme cities (those with more than 300 wonder levels and more expansions) which don't occur as much on the beta server.[BR][BR]Has there been any mention of reducing the need for kp in the game, as later levels of AW and recent chapters research + recent AW have seen a big increase in kp required due to the high kp output of tournies. If these stay the same but the kp source is cut by 50-80% then it will be really unfair on players who haven't reached that point and could cause major frustration and lead some to leave the game."}, {"14": "pompeywolf said:\t\t\tHas there been any mention of reducing the need for kp in the game, as later levels of AW and recent chapters research + recent AW have seen a big increase in kp required due to the high kp output of tournies. If these stay the same but the kp source is cut by 50-80% then it will be really unfair on players who haven't reached that point and could cause major frustration and lead some to leave the game.\t\tClick to expand...[BR]No mention whatsoever.[BR][BR]In fact, I only see conflicting messages. [BR]- The maximum tournment points anyone can achieve is getting a super-nerf, but at the same time chest 11-20 is added.[BR]- Level 31-35 of AW's is getting introduced, but takes a lot of KP.  At the same time, we get a hard nerf to KP you can gain per week, AND AW levels will now hurt your tournament performance. (and Spire, too)[BR][BR][BR]Do we still have one set of Devs, or do we now have multiple teams working against eachother on this game?"}, {"75": "Killiak said:\t\t\tDo we still have one set of Devs, or do we now have multiple teams working against eachother on this game?\t\tClick to expand...[BR]Home Office communication breakdown?"}, {"15": "I just have 1 questions about the new system. Let's say when it starts, next week, with my 114 expansions and 172 wonder levels I can do 2k points. What happens when I have 216 extensions and 215 or 250 WL? Will I still be able to do the 2k or will even that be difficult/impossible?"}, {"22": "Hekata said:\t\t\tI just have 1 questions about the new system. Let's say when it starts, next week, with my 114 expansions and 172 wonder levels I can do 2k points. What happens when I have 216 extensions and 215 or 250 WL? Will I still be able to do the 2k or will even that be difficult/impossible?\t\tClick to expand...Somebody with a better handle on the numbers will be able to answer this better than me, especially as I haven't tested with an advanced city, but I haven't encountered anyone struggling for 2,000 points yet."}]