[{"14": "alsael said:\t\t\twell,2 things can be done to help the players.Open all 3 military buildings so we can train at the same time\t\tClick to expand...[BR]This does not help in the slightest if the enemy squad size is so big that you just get smushed."}, {"93": "I am sorry but if Inno want to get rid of players who in the past couple of years worked hard to build their cities by punishing them in tournaments for advances in aw,s and expansions. They should just have said. I normally played between 20- 30  provinces. Today at #15 i was losing troops big time. The excuse of \"less clicks\" is a complete fallacy. In the past those of us who put in the work to \"click\" meant we got the rewards. I am completely discouraged. If Inno makes this format the new normal i do not think this game will be worth playing. The spire already guzzles my goods. I cannot produce random troops fast enough for the losses. The other argument of manual fighting does not apply  to the app anyway. The sad thing is that i do not believe Inno will pay any heed to our feedback anyway."}, {"89": "alsael said:\t\t\tgive it time girl.Still early to tell.We are the live testers remember? [smilie--sprite1]Click to expand...[BR]\"live testers\" - That's an utter joke. Honestly, that thing got heavy critics in the beta already and it seems like they changed... nothing. That's exactly what the beta-servers are for. Things that are launced at the live servers should be already balanced when included. I'm not paying money at the live servers to be their damn tester - especially as i'm now getting penalities for spending real money. Well besides i would spend that real money into training, negotiating or the Magic Academy to be lucky with booster buildings.[BR][BR]Only ppl i saw here that said \"EASY PEASY\" where ppl that listed 1 or 2 hands full of booster buildings. Nobody without any sorts of real money investment or 10th chest + 3 stages spire fellowship could do that every week. For me it seems like exactly that: Another try to \"motivate\" players to throw their money at INNO for something that was easy before and now has to be paid with real money to be fun.[BR][BR]Even the most active members in my fellowship alltogether only see bad things in that change and feel demotivated to do even the 2nd round. There is only one good thing: less clicks, but that thing comes at a very very VERY damn high price.[BR][BR]That \"easier for beginners\" thing is *sigh*... most people that didn't do much before (only a few provices at best) won't do anything more, only because it's some clicks less.[BR][BR]You're loosing (paying) players inno? Implementing 1 good thing for 3 bad things at the same time is exactly the way how that happens."}, {"94": "Was looking forward to doing planks with my fellowship,it's the one tourney we manage to get ten chests for,as only a few players go all in after saving up on troops and boosts to score as high as possible.Thought before i started that the new changes would at least help with my hand going numb with clicking so many times and yes it does,so thumbs up for that.Sadly though it's left me feeling really unhappy that after so much effort to train troops and save up boosts and resources that the battle mechanics have been for me ruined,seems others have complaints too.You should have informed us you were still testing and monitering feedback before going live.I for one will not spend anymore money on this game,so good luck with recruiting new players,who hopefully have deep pockets and too much time on their hands.[BR]I've noticed that even with all my boosts active that the first round of 74 provinces has cost me about 600k troops,i had reckoned that before tourney changes that it would have been around 300k.I'd trained enough troops and more for what i needed to complete the 74 provinces over 6 rounds,but with the new difficulty settings it means i'll probably run out of troops on round 4 and will on round 5.I've used 27 boosts,sounds silly,but they help a lot in the later rounds and in the spire(can even do the spire the following Sunday if you time right).All that effort and resources wasted because the difficulty goes way too high,hopefully you adjust down,or at least limit it on the later provinces.Why bother adding another 9 chests that few of us will ever have the chance to win,can't even see the top fellowships winning all 19,but good luck to them.[BR]Can understand you wanting to increase revenue by making the game more attractive to new players,but making it less attractive for long time players isn't so good,more so when a lot of them have spent a lot of money on the game to improve their experience.Some i know in the game play across the three worlds and beta,christ what a bloody nightmare,one is enough for me.Our oldest player is 80 from Australia,i think there are older players on Elvenar and a lot of retired players who enjoy the sedate playing experience,so the tourney changes will probably make little difference to them,for me they've killed the little bit of fun i had from this game.Pretty event buildings and friendly chat for me,the rest is now just a distraction that i will hardly bother with,playing the game building and improving my city,till the content runs out for that.Sorry for venting and going on so much,just upset you messed up something i was looking forward to.Thankyou."}, {"35": "In the old tourney format I was a pure auto-fighter.  So it's nice that some of the catering costs have come down, so I can mix things up a bit.[BR][BR]The pure goods caters are very nice, worst I saw was a combined total of T1, T2 and T3 of 560K, which was near province #60 and is about 1/750 of my stored up goods, so is no big deal.  In 57, 58 and 59 I was getting catering costs of nearly 60K Orcs, that still sucks and is totally unrealistic, so I had to auto-fight those.  The other issue I have with catering is the ones that want over 20M coin, I can't make coins that fast, aside from instants, but with the number of times those come up I'd run out quickly, so not a viable option.  Supplies were fine, around 2M at worst, which I can make in about 45 minutes using PoP enchants on my magic workshops.  I couldn't go beyond province 60 as I only have 60 planks provinces completed on the world map.[BR][BR]If the fight looked easy - for example 5 enemy Light ranged, even at a squad size of 222% of mine, Orc Strats can slap them down with minimal losses - for those easy looking fights I auto-fought.[BR][BR]If the fight looked average difficulty I manually fought it.[BR][BR]If the fight looked like a total cluster**** I catered it, except when it required Orcs or Coin.  It was pretty annoying to come up against a mean combination of enemies at 220%+ your squad size and have the catering option be a big no-no.  In those cases I just had to manually-fight and suck up the higher than usual losses.[BR][BR]I like that it takes less time and less clicks now and that catering is now generally an option too.  It was the sheer boredom that stopped me doing round 6 for every province I had every week, I could easily keep the troop numbers up every week to clear every province and round.  So this 1 fight per province instead of 4 is a very welcome change.[BR][BR]The enemy squad sizes are a bit silly at the later provinces if you get a horrible combination of enemy unit types.  That's where catering should be the better option, but when you get a ridiculous catering request (huge pile of coin or Orcs) it feels like you're being trapped into taking big troop losses.[BR][BR]For me the higher squad sizes aren't much of an issue as I rarely catered before, so I can offset some troop losses by catering instead now, so it'll probably work out at the same troops losses as before, maybe a tad higher, but now I'll also be spending my goods which I didn't really have a use for before.  I just really don't like the 'trap' encounters, where catering is not an option and the 220+% my squad size enemy also has a horrible unit combination!  Horrible unit combinations were okay to deal with before when the enemy couldn't be more than 160% of your size.  I did like randblade's suggestion above of capping the enemy squad size relative to the players, but increasing the size of the squads used a bit instead.  This at least gives you a fair chance to manual fight well and save yourself huge, unavoidable losses."}, {"78": "The only negatives in the change, for me, is always having to face 5 opponents and the seemingly increased chance that one of them, at least, will be a mist walker. Coupled with the general increase in difficulty these could ultimately become boring and a major turnoff.[BR][BR]Without changing the overall difficulty level, some variation in the number of enemy units would be much more interesting (fun) and provide the opportunity to develop some less 'mechanical' battle skills. The inability to occasionally scope the terrain without excessive deprivation by mist walkers seems less than equitable."}, {"95": "This has broken the game for me. What’s the point in me having 55+ Provence’s if I can’t fight past Provence 17 on one stars. If your aim was to loose lots of players. Well done I think you have achieved it. At least you have with me."}, {"96": "Well this is the first time i have done 18 provinces in a tournament. auto fought up to 10 (when the enemy squad got bigger than mine) then catered to 18 in about 5 mins. had 1 province that wanted 3800 orcs, so that was fine. [BR]minimal troop losses, and any i did lose would have been freebies from the last few events as i dont train much.[BR]Didnt really take notice of the resources used but they were mostly around 10000 of whatever goods, so very managable with a few mill in stock.[BR]I am liking it so far[smilie--sprite1] will see at the end of the tourny if im still liking it[smilie--sprite2]"}, {"97": "Where is the announcement about the changes in game? Is inno actually hoping that people would not notice such change? Announcing it in forum is not good enough.[BR][BR]Did two stars in first 18 provinces. Not liking how many troops I'm loosing. Autofight. Also catered last 3.  Using fire phoenix as well. But so far I have definitely taken more losses than usually by this stage."}, {"26": "I've finished the tournament for this week and now I can give a full feedback on the new system. In short it's terrible, and all the fears about it that I had since it first appeared on beta were released exactly as I imagined. I don't know who came up with these changes, but it feels like this person either has little to no idea about the game or just hates the active players and wants to punish them for playing.[BR][BR]I always loved the tournaments and had plenty of fun developing my city in a way that my tournament performance constantly improves. Over the past two years this got me up to 12k tournament average and clearing all my available provinces each week. Sure, it required a lot of clicking, bit I always considered it an acceptable price for the amount of stuff I was getting. Besides everyone had a choice if they want to grind for the rewards, or not. [BR][BR]So to the numbers, as @Silmaril asked us. I was playing this tournament with 4xUUU and 4xELR and a fully evolved fire phoenix, which is an above average setup in my opinion. This got me to 40 provinces up to 2* and 30 provinces up to 5*. Already at the end of the first round I knew that 40 provinces were a mistake, but leaving them without collecting KP was a waste of resources. To do all this I've dumped about 300h of time instants with two fed brown bears. In comparison, normally I was doing around 60 provinces up to 5* each week and needed either 4xUUU or that many time instants. Under the new system getting much lower results became absolutely unsustainable, not to mention that two brown bears are now impossible to acquire, which leaves me in a much better position than many players. As a bonus, for me the tournament went from a fun experience to a chore that I want to be done with as soon as possible, because watching how the squads 10x my normal squad size are dying like flies is the exact opposite of fun in my opinion.[BR][BR]I don't even want to know how the new tournaments feels without all the boosters, but I can venture a guess that doing 20 provinces 5* should become an achievement now. One of the big questions I have thought is why are the devs acting that inconsistently: just recently we had the phoenix event in which the main prize was obviously geared towards the new players to help them grow and catch up with the older ones. The recent event arguably targeted newer players as well. What was the point of all this, if the tournament change makes it now absolutely impossible to catch up and basically divide the playerbase to those who levelled their AWs under the old system and those who started too late?[BR][BR]As a bonus in an attempt to nerf the KP gain devs created the issues with, to name a few:[BR]- getting enough relics for crafting CCs nonstop (and, if rumours about upcoming +2 boosts are true, with collecting enough relics for the maximum boost at the same time);[BR]- getting enough spells for everyday use (and producing mana from the DA);[BR]- new chapters becoming almost unplayable if the KP requirements stay the same as in the chapter 16;[BR]- glass ceiling on how far you can go in the tournaments, which results in a less incentive to actively play, grow your city, and, most importantly, spend money.[BR][BR]Overall this is a destruction of the tournaments in my opinion, and, with a big part of the game being built around them for years, this will also lead to plenty of unpleasant side effects as a bonus."}, {"98": "I've heard stuff about seperating the \"Que's \" for building troops, any truth to that?"}, {"99": "Before I dissect the update properly a quick note: this tournament update has successfully killed tournaments.[BR][BR]What I learned about enemy squad size increases, relative to my own squad size:[BR]They increased at 12% per province, on top of any previous increases, up to about province 9/10. I say, \"About,\" as I failed to capture squad size information on a few provinces throughout the tournament.They increased at 5% per province, on top of any previous increases, up to about province 15/16.They increased at 3.6% per province, on top of any previous increases, up to a province in the mid-30s.After that they increased at 1% per province, on top of any previous increases. I stopped at province 45.I was hitting enemy squads in excess of 200% from about province 31.[BR]Now the dissection:[BR]4 encounters per province merged into 1: A superb idea and one I was really looking forward to.[BR]The aim of allowing easier entry into tournaments: This is a joke, right? Entry into tournaments was always easy. Completing the first 10 provinces for 6 rounds was easy pre-AWs, pre-UUU/ELR/MMM/DA, pre-Fire Phoenix, pre-Brown Bear, pre mass fire sale of time instants and supply windfalls, and whatever else I've missed.[BR]The aim of better contribution from new players: Also a joke, right? Enemy squad size, relative to players' squad size, was in excess of 150% from about province 16. Unless the plan was that they stopped at province 10? Which, as previously stated, was always REALLY REALLY REALLY easy.[BR]Maintaining an interesting challenge for more advanced players: There was no \"challenge\", per se; simply a bigger drain on resources. I can tell you now that losing 300 or so squads in the first round was not challenging or funny. That was whilst manual fighting, too. Then the negotiation costs? I make about 1 million in steel a week and the T1 negotiation cost of one encounter was 213k. I'd like to say it only came up once or that it was an outlier but, no, the negotiation costs towards the high end of the 45 provinces were debilitating.[BR]Manual fighting 45 provinces took me a couple of hours. At first it was \"fun\" but it very quickly became very dull and very repetitive. However, I don't have 12 hours in my week that I can dedicate solely to manual fighting the tournament. But, as mentioned above, going to 45 provinces in just the first round had costs that were completely disproportionate, so I won't be doing that ever again...after my second round tomorrow. I may as well get those 5 KPs now. 25 provinces will probably be my limit, which will take about 1 hour to do per round. How many players have 6 hours per week to dedicate solely to manual fighting in tournaments?[BR]Tournament difficulty is determined by progression, city development and research: It's already been said but I will reiterate the point...what kind of backwards nonsense is this? You punish paying players, new players that try to unlock as many province expansions as possible by blitzing the world map, people that invest heavily in AWs irrespective of whether or not those AWs provide any advantage to tournaments in the first place, etc.[BR]Difficulty now increases with each Province and provides a steady increase in difficulty for each province/round: As far as I was aware difficulty already increased with each new province, so that's not exactly a new thing. And shooting from enemy squad size, relative to players' squad size, of 12.64% in round 1 to in excess of 150% after round 15 isn't a \"steady\" increase by any stretch of the imagination.[BR]Catering costs lowered significantly: I refer you to my previous point where in round 1 the T1 negotiation cost for a single encounter topped 213k. So, that new benefit wasn't exactly 100% true. Then again; if I had to cater towards the high-end of the 45 provinces I used to do, previously, it was never for all 4 encounters within a province; so maybe I'm being slightly unfair. However, it's somewhat arbitrary to assume that people who went that far would either fight or negotiate the entire province.[BR]Requested Goods in Catering: Including coins and supplies again is just a massive headache but that's simply a gripe. I could probably adapt to that long term. What I want to point out are the orc requirements. I've said it before but there are simply not enough ways to produce a good amount of orcs for everything they're needed for: research, troop production, AW upgrades (8 million+ Orcs to upgrade all existing AWs past level 30, assuming they can all be upgraded, as I haven't checked), manufactory upgrades, guest race goods, Spire convincing, Tournament negotiating, FA costs, etc.[BR]The enemy always having 5 squads/units: This is the only other positive.[BR]Randomised enemy unit types: So, not only is the enemy squad size ridiculous but now we don't know what we're going to be facing each week? That basically ruins UUU/ELR/MMM/DA strategy. Yes, I know it's weighted towards the usual suspects but now I could be facing Mistwalkers every single week? Oh, and the weighting is garbage, FYI. The number of times today a Heavy Ranged unit was added was enraging. Facing the Ancient Orc and Dryad on their own is bad enough but throw in a Heavy Ranged AND Heavy Melee. Are you serious? That isn't \"challenging\", that's just farcical.[BR]Tournament bonus chests: A nice idea, in principle, and one that's been asked for many a time. Under the old tournament structure it would have been something to strive for but under this new update it doesn't work. Allow me to explain. Increasing difficulty means that a handful of players can no longer carry their FS, as earning 10k+ per tournament just won't happen now except for maybe an elite few. This means that more of the FS will have to contribute higher scores; which is a nice idea, in principle. But there are already too many FSs that don't hit 10 chests. This update now makes it even harder for them to reach 10 chests. So...why dangle 9 bonus chests after the initial 10? Is the point simply to taunt? The other thing is that high scoring players will probably team up with other high scoring players to chase those 9 bonus chests. So, FSs that had people that carried them in tournaments will lose their heavy hitters, meaning that those FSs will no longer hit 10 chests or be even further from hitting it. This will result in even fewer FSs getting 10 chests and a tiny fraction of elite FSs that not only get 10 chests but also win the 9 bonus chests, too. In effect, this update doesn't encourage balance or teamwork, it encourages elitism.[BR]Lolz, forgot my conclusion. In short, this update benefits NO ONE. It doesn't help new players, mid-game players or advanced players. All that's been done is to dump obstacles within tournaments but dressed it up as something wonderful. To quote Archer, \"You can't put lipstick on a pig.\" Either rethink or revert back to pre-update. Also, there was absolutely no justification in dumping this onto live worlds for further testing when virtually all feedback from beta was negative. You know, beta, that place where testing is supposed to happen. What's the point in asking for their feedback if you're just going to ignore ALL of it? Poor decisions all around."}, {"22": "aqualin said:\t\t\tI've heard stuff about seperating the \"Que's \" for building troops, any truth to that?\t\tClick to expand...They said on Beta that they're looking at that, but no further details and no mention of whether they would plan to cut the training speed of each queue down."}, {"83": "alsael said:\t\t\tgive it time girl.Still early to tell.We are the live testers remember? [smilie--sprite1]Click to expand...[BR]Great.  I understand this live testing is going to go on for 3 weeks or so?  Maybe they will stop the test before that.  [BR][BR]The tournament changes are so incredibly stupid.  When each of us was a smaller city, we looked at the big guys not with envy, but with admiration, knowing that if we worked hard, grew our cities and our AWs, that one day we too could be one of the big guys - one that earns lots of points in the tournaments and is able to invest a lot of that earned KP into our AWs.  That is the whole idea of the game.  You grow with work and planning, trading, and fighting.[BR][BR]But no - not so fast. Just when we are on the verge of being able to do just what the people we admired so much could do, here comes INNO with socialism for all.  If you have worked hard, fought hard, grown both your city and AWs according to the rules, suddenly the rules change.  You are penalized for having a big city and built-up AWs.  Just when you should start to the see some big rewards for all your hard work, INNO changes the tournaments.  They are trying to insure equal outcomes no matter what.  Totally unfair.  Unless INNO changes the tournament rules back to what they were, I will no longer be playing this game."}, {"98": "Pauly7 said:\t\t\tThey said on Beta that they're looking at that, but no further details and no mention of whether they would plan to cut the training speed of each queue down.\t\tClick to expand...Thx for the reply. [smilie--sprite1]"}, {"88": "MinMax Gamer said:\t\t\tThanks for confirming it. This means that ramp up in terms of the provinces/stars have NOT been changed from beta. So all we need to do is figure out the base squad size calculation.[BR][BR]Have you also checked catering amounts per province, do these also line up?\t\tClick to expand...[BR]@MinMax Gamer the amount of goods needed matched to the letter. [BR]Just the squad size amount both on my and enemy side were off a bit, possible as I entered integer for my first tournament province, since the calculated value from the sheet did not match.[BR]I am not sure whether I entered something wrong or the formula needs adjusting."}, {"100": "Susananna said:\t\t\tGreat.  I understand this live testing is going to go on for 3 weeks or so?  Maybe they will stop the test before that. [BR][BR]The tournament changes are so incredibly stupid.  When each of us was a smaller city, we looked at the big guys not with envy, but with admiration, knowing that if we worked hard, grew our cities and our AWs, that one day we too could be one of the big guys - one that earns lots of points in the tournaments and is able to invest a lot of that earned KP into our AWs.  That is the whole idea of the game.  You grow with work and planning, trading, and fighting.[BR][BR]But no - not so fast. Just when we are on the verge of being able to do just what the people we admired so much could do, here comes INNO with socialism for all.  If you have worked hard, fought hard, grown both your city and AWs according to the rules, suddenly the rules change.  You are penalized for having a big city and built-up AWs.  Just when you should start to the see some big rewards for all your hard work, INNO changes the tournaments.  They are trying to insure equal outcomes no matter what.  Totally unfair.  Unless INNO changes the tournament rules back to what they were, I will no longer be playing this game.\t\tClick to expand... Totally agreed, That´s exactly my actual situation, I would have to erase my fighting AWs so difficulty of the tournaments gets lower. My hard work and dedication now means nothing, even the diamonds I did spend is totally worthless. Totally feels you my friend [smilie--sprite3]"}, {"100": "So disappointed in this game, I was starting to have more income and see the results of my hard work during all this time playing, now all that means Sh.... nothing"}, {"73": "Susananna said:\t\t\tGreat.  I understand this live testing is going to go on for 3 weeks or so?  Maybe they will stop the test before that.  [BR][BR]The tournament changes are so incredibly stupid.  When each of us was a smaller city, we looked at the big guys not with envy, but with admiration, knowing that if we worked hard, grew our cities and our AWs, that one day we too could be one of the big guys - one that earns lots of points in the tournaments and is able to invest a lot of that earned KP into our AWs.  That is the whole idea of the game.  You grow with work and planning, trading, and fighting.[BR][BR]But no - not so fast. Just when we are on the verge of being able to do just what the people we admired so much could do, here comes INNO with socialism for all.  If you have worked hard, fought hard, grown both your city and AWs according to the rules, suddenly the rules change.  You are penalized for having a big city and built-up AWs.  Just when you should start to the see some big rewards for all your hard work, INNO changes the tournaments.  They are trying to insure equal outcomes no matter what.  Totally unfair.  Unless INNO changes the tournament rules back to what they were, I will no longer be playing this game.\t\tClick to expand...Not exactly socialist as it’s an ultra huge capitalist that’s sitting behind [smilie--sprite2]"}, {"14": "Perhaps all of us should tell our FS to no longer play the tournament?[BR][BR]See if we can organize as much of a server-wide strike as we can. We are not guinea pigs, and this new system is so utterly crap that I see no point in playing/testing it for Inno."}]