[{"24": "Can´t really post proper feed back, I have 10 booster buildings in this week. Which is onviously not sustainable. But if it was I had no problem with the new tourney system lol.[BR][BR]Anyway: The have made tourneys easier and easier of the past what 2 years? now they make them harder for the first time since then. I am thinking I will still make more in tourneys now than I did 2 years ago... Could it have been done better? Absolutely yes. I still don´t like the formula for SS at all. Punishing the wrong markers. [BR][BR]Research sure[BR]Expansions sure: should punish those low chapter/no progress pure tourney towns. [BR]Premium expansions should not go entirely free (otherwise we easily get a pay to win situation), but might be weighted lower.[BR]AWs: Yes they are making tourneys easier so they could also be taxed a little bit[BR][BR]So apparently I agree with everything [smilie--sprite1] EXCEPT: the fact that you multiply all the factors with each other. WHY should anyone with lots of AWs be punished harder for expansions than some one with fewer AWs? Or why should someone at the end of the research tree be punished harder for his AWs than a small town? Why does someone with lots of expansions (or even premium expansions) need to be punished harder for every AW they upgrade than someone with fewer expansions? Where is the logic in that???[BR][BR]Make the Factors additive instead of multiplicative and I am on board.[BR][BR]Other than that: I like the fewer clicks but time investement sure doesn´t go down with all the manual fighting..."}, {"89": "Killiak said:\t\t\t... I see no point in playing/testing it for Inno.\t\tClick to expand...[BR]Especially as testing belongs to beta-servers... but they didn't like the feedback of the \"hardcore players\" there... hoping for more positive feedback by the beginners here. Like \"Hey we will try it until enough ppl are saying it's an awesome change!\"[BR][BR]Looking at their facebook-page it even worked. There are beginners that are writing \"hey i only managed to do 2 before, now i'm able to do 6, wuhuuu!\". Great... i did so much work to get further as that and now i'm stuck with beginners-stuff too, as the rewards above that are at some point not worth the investment."}, {"90": "@Silmaril, that I am saying now that I don't like it, IS, still feedback. It will help you immensely with your communication with the developer team because then they'll know that this was a complete failure of an idea. I don't play on beta but I have mostly kept up with the developments there and the fact that Inno, despite all the moaning and groaning at the expense of the Beta players, Inno still proceeded to implement this nightmarish plan, where is the justification behind that? [BR][BR]You've articulated the reasons for trying out this redesign of the Tournaments. All done and frighteningly so. [BR][BR]Now explain why Inno chose to ignore the feedback from the Beta tests, explain why Inno chose not to test further with the Beta testers and explain why an unfinished, unpolished, unbalanced update got implemented on the Live servers. We aren't supposed to be guinea pigs Round 2! What is the point of having a Beta server if you're going to fob us off with the same thing? Were you expecting us to be docile and accepting of this change blindly? You're hoping it'd go unnoticed?[BR][BR]So please, help me understand why Inno is so dead set on implementing this. All this brouhaha talking about wanting to simplify process, making thing challenging for veteran players while making it easier for newer players is a cover. There are truths you refuse to admit and that, has been a greater disappointment than this farce of an update. [BR][BR]Revoke, reverse, revert. Please."}, {"78": "Round 2 - DA, ELR, Fire P - chapter 16 - 187 AW points[BR][BR]23 provinces[BR][BR]I found round 2 losses roughly equivalent to round 1 (22 provinces). Autofight worked effectively at higher levels - I used mostly auto to province[BR]19 whereas in round 1 it was much less useful after province 12. There were considerably fewer mist walkers in round 2 which certainly helped with scoping the terrain for manual and IMO reduced auto losses.[BR][BR]As far as I can see, the changes reduce the impact of individual big hitters in favour of strong, well co-ordinated and active FSs. For me that's an acceptable and desirable trade-off."}, {"54": "Ephraim Heart said:\t\t\tNow explain why Inno chose to ignore the feedback from the Beta tests, explain why Inno chose not to test further with the Beta testers and explain why an unfinished, unpolished, unbalanced update got implemented on the Live servers. We aren't supposed to be guinea pigs Round 2! What is the point of having a Beta server if you're going to fob us off with the same thing? Were you expecting us to be docile and accepting of this change blindly? You're hoping it'd go unnoticed?\t\tClick to expand...[BR]I think the main reasons were, that the numbers that they saw from looking at the data was not in reference to the feedback that they were gettting.[BR]This might be true because a lot of high end players on live servers, have smaller citys on beta, so they vent/predict what these changes will do to their live server citys, while in fact its no so bad for their current beta citys.[BR][BR]So for me testing this on a live server makes sense, then they should notice the beta feedback isnt exaggerated.[BR][BR]On the other hand, this change just opens the doors widely for push accounts/push fellowships. Do a minimal of tournament points on your big city, transfer your goods to a low chapter account and do a lot of points on those accounts quite easily and cheaply.  Smart players saw that as soon as the announcements came and prepared for that already, so the numbers from data might indeed say that more people do more points now.... if only inno realises that its the wrong kind of progress. (also i doubt pushers spend a lot of diamands, and if they did it would be stupid because it would only make it more expensive again lol..)"}, {"88": "@Silmaril , concerning these changes. From our FS, I am the one trying to do keep a similar big score with this setup[BR][BR]BuildingsDA, UUU, LR, MR, Phoenix lvl10 and fedChapter16, 2 research completedStarting Squad Size of 1st province583Units trained before start of tournament~180 squads Forest Wardens[BR]~180 squads Blossom Princess[BR]~200 Vallorian Champions[BR]~200 Frog Princes[BR]~180 GolemsUnits mostly used in fightsMostly Forest Wardens, Golems[BR]Used on different occasions of Elven Archers, Frog Princes1* Provinces completed402* Provinces completed38Remaining units after 2* provinces completed~22 Forest wardens !!!!!![BR]~154 Blossom Princess[BR]~183 Vallorian Champions[BR]~84 Frog Princes - mainly because they lost in matchups which they would usually win without issue[BR]~82 Golems[BR]Directed at you @Silmaril , as you are the one who can forward this to the devs![BR]I expect some answers from your side and not just a comment about forwarding this to dev, design, management![BR][BR]This is now only round 2 in the tourney and my city is already struggling with squads, where I will not be able to keep up with the need.[BR]Keep in mind that my city has boosting buildings deployed. I don't even want to think about how a city will be doing with for example just the Phoenix deployed, which would be a sustainable scenario![BR][BR]@Silmaril , how are we supposed to ever achieve anything in this new tournament style, when there are no boosting buildings available?[BR][BR]@Silmaril , how are we supposed to achieve a decent score even with boosted buildings that will support ones own city?[BR][BR]@Silmaril , how are we supposed to achieve a decent score even with boosted buildings that will our whole FS, without draining cities to a point where building up for the next tournament is still possible?[BR][BR]@Silmaril , how are we supposed to assist our FS members with KP trades now? The score of my city will be higher than my fellows, but this is with boosted buildings, so a normal score will be lower, with less KP and interaction.[BR][BR]@Silmaril , I did cater some encounters as it was cheaper than trying to match encounters, but i have nowhere the resources to keep this up.[BR]How are we expected to counter this? The numbers don't add up as a whole anymore.[BR][BR]This tournament implementation will have a major negative impact, not only on tournaments themselves, but every other aspect of the game! Spire progression as a fellowship, trading, KP exchange with other fellows and so forth. This implementation feels as complete punishment for whatever we are trying to achieve.[BR][BR]@Silmaril, why are these changes introduced, because as someone detailed further up, the reasons given are simply matching up to what the outcome is now![BR][BR]This current implementation should go right to the bin. @Silmaril, as you fellow moderator @Marindor on the Beta forum can attest, that feedback for this style of tournament is overall the same on EN live servers as it is on Beta.[BR][BR]@Silmaril , please take this information and feedback, print it out and show it to persons responsible. The natives are not happy! This game is supposed to be fun overall and up until now I enjoyed every aspect of the game.[BR][BR]Summary[BR]Negative: See above[BR]Positive: Less provinces to fight"}, {"88": "Heymrdiedier said:\t\t\tI think the main reasons were, that the numbers that they saw from looking at the data was not in reference to the feedback that they were gettting.[BR]This might be true because a lot of high end players on live servers, have smaller citys on beta, so they vent/predict what these changes will do to their live server citys, while in fact its no so bad for their current beta citys.[BR][BR]So for me testing this on a live server makes sense, then they should notice the beta feedback isnt exaggerated.[BR][BR]On the other hand, this change just opens the doors widely for push accounts/push fellowships. Do a minimal of tournament points on your big city, transfer your goods to a low chapter account and do a lot of points on those accounts quite easily and cheaply.  Smart players saw that as soon as the announcements came and prepared for that already, so the numbers from data might indeed say that more people do more points now.... if only inno realises that its the wrong kind of progress. (also i doubt pushers spend a lot of diamands, and if they did it would be stupid because it would only make it more expensive again lol..)\t\tClick to expand...[BR]Regarding Testing, I have to say, that choosing live server with paying customers is an absolute NOGO!![BR]INNO should have their own separate Alpha, Beta Server, where they can feed information from live servers and then run tests with those numbers. Very easy to see what the outcome is then, instead of making the natives restless![BR]The information is there! Elvenstats and Elvenarchitect use that information. Hell, then INNO should be able to use that too and do some Testing on their own with live data and not embarrass themselves with this absolutely unbalanced update which they fed to us all here!"}, {"101": "I actually like new tourney update.[BR][BR]Before i could do all 55 provinces i have, but it was a chore of 1-1.5h a day, and got kinda boring.[BR]It was easier, but it was pretty much simple tactic. Gather large numbers of troops and auto battle. Having fighting AWs just to minimize losses. At least until province 50, maybe after those quality beats quantity.[BR]IMHO it was easier for endgame players to gather large numbers of KP and simple upgrade AWs at high speed, which would make them simply unreachable,and develop at linear or even exponential line.[BR][BR]Now i did 30 provinces with 40% auto battle, 50% cater, 10% manual battle. And i think that gold could become problem(at least for me, for some time), as i had more catering with coins than with orcs.[BR]Is it too hard compared to old?    Yes it is.[BR]I know that i need to adapt new tactic.[BR][BR]I think now all AWs actually could have benefits in tourneys, and there are different approaches how solve lot of provinces. And that bears and phoenixes now have even greater use than before.[BR]And i do agree with @axelbloodaxe that now activity of FS more matters, especially with 10+ chests.[BR][BR]I think that end players will need few months or so to adapt to new tourney system, and then we'll pretty much have soon same scores as we did before.[BR][BR]Ephraim Heart said:\t\t\tNow explain why Inno chose to ignore the feedback from the Beta tests, explain why Inno chose not to test further with the Beta testers and explain why an unfinished, unpolished, unbalanced update got implemented on the Live servers. We aren't supposed to be guinea pigs Round 2! What is the point of having a Beta server if you're going to fob us off with the same thing? Were you expecting us to be docile and accepting of this change blindly? You're hoping it'd go unnoticed?\t\tClick to expand...[BR][BR]I would say that point of beta is to see if mechanic is working, if there are game breaking bugs and some hard rigged stuff, and to prepare us live that something new is coming (after all we all know a minute something new comes to beta)[BR][BR]For fine adjustment of data and parameters, you could use as much players and play styles to see what to change, and your changes in place.[BR][BR]Summed up: I like new tourney due to faster playing and challenge to do it better.[BR]But I'll wait month or so till fine adjustments are made, and i test several tourneys.[BR]Then i can give more honest review."}, {"89": "Heymrdiedier said:\t\t\tI think the main reasons were, that the numbers that they saw from looking at the data was not in reference to the feedback that they were gettting.[BR]This might be true because a lot of high end players on live servers, have smaller citys on beta, so they vent/predict what these changes will do to their live server citys, while in fact its no so bad for their current beta citys.\t\tClick to expand...[BR]Even if that makes sense to some part, i agree, that should've been announced ingame. With all the needed details, like it'll be easier in lower provinces, but it'll get much harder very early. But there was no comm. They've just pushed out that major change without any note ingame. When it's needed for whatever reason to do so, there should be an ingame note so everyone may be able to inform himself and to adapt beforehand.[BR][BR]I'm playing on live worlds and not on beta, as i'm expecting to be no \"guinea pig\". I'm on @Melianora side: Testing with paying costumers should be a NOGO, but exceptions may exist under strict circumstances.[BR][BR]And even penalizing paying costumers with a new systems is a nogo too. Why should i buy diamonds if it makes things harder, while i would expect that things will get easier? Is that some sort of joke i'm too dumb to understand? I'm part of the paying ppl that make it possible that everyone else can enjoy that game for free. I'm part of those ppl that are paying the devs. This feels like a big \"Thanks for your money sh*thead - f*ck you! But give us your money soon again! <3\""}, {"28": "ShadowVision said:\t\t\tI'm playing on live worlds and not on beta, as i'm expecting to be no \"guinea pig\". I'm on @Melianora side: Testing with paying costumers should be a NOGO, but exceptions may exist under strict circumstances.\t\tClick to expand...You do know that even on Beta they sell diamonds, right? [smilie--sprite2]"}, {"89": "MinMax Gamer said:\t\t\t...\t\tClick to expand...[BR]I do, but when playing on a beta server i expect it to be faced with untested and unbalanced stuff, that's why it's beta... if you decide to play on beta, you do that at your own risk."}, {"78": "The reason for testing this here is not to 'test' the basic mechanics of the change but to uncover as many unintended consequences as possible. This seems like a reasonable approach."}, {"89": "axelbloodaxe said:\t\t\t...\t\tClick to expand...[BR]Like i already said, if it's needed to do so, there should've been an announcement ingame. To prepare the ppl, to let them know this is no final thing, and maybe even give a first timeframe how long those tests may last. That's the most basic community-management thing that you could do.[BR][BR]But inno decided that shit should hit the fan.[BR][BR]But even then... i would not agree how they did it. The beta already gave a ton of negative feedback and they decided to change... nothing. Like the beta feedback is not already an big indicator to show that something is off there.[BR][BR]It's somehow above my mind how ppl can support that strategy and even those changes. I mean... there is only a benefit for beginners (good) and you save time (very good) but they take away a heavy benefit in terms of profits from the tourneys, including the possibility for more casual fellowships to achieve the 10th chest again, as before high-score players where able to compensate lower scores of others or even missing players, that's history now if you don't want to throw in a hand full of bonus stuff each week. I and my whole fellowship are loosing more as we gain. Not only in benefits, but also in terms of troops, goods and everything else. You are now penalized by advancing, by expanding and by upgrading AWs.[BR][BR]Hell if i was able to manage a layout where i could fit in most of the AWs (even without premium-expansions) and we had a big exchange within our fellowship to upgrade those, i'm now even penalized for that. I'm penalized for good space-management, for diamond investments and cooperation/exchange within my fellowship.[BR][BR]That's crazy. I'm getting better and better, trying to get the most out of everything to be penalized to death. I don't get it how one could support that strategy."}, {"39": "An update: Finished round 2 for 30 provinces, catered most of them again. Squad sizes are enormous, so are the losses.  Even with the brown bear and time boosters from the spire it's not possible to keep up with losses, I guess that this solves a multi brown bear and fire bird issues, hah...My strongly military oriented city is now crippled and cannot fight. I already mostly cater Spire and now it looks like that it's going to be the same for the tourneys, so I have to completely change my strategy and concentrate on more goods productions???  I can forget about doing more than 30 provinces, provided I will be able to do them to 5 stars this tournament, if not - then even less provinces next tourney. Is it going to be sustainable to cater spire and tourney week after week? Probably not. There should be a balance between catering and fighting, we should be able to do both. Also, we need a strong indication of what troops to train for each tourney, because it's impossible to train all of them in obscene quantities that are now required.[BR][BR]So, pet food, brown bears, fire birds, military AWs, all of these become redundant. The question then, what was I doing for the past 2 years playing this game, upgrading my military AWs??? This kind of drastic game direction change has a massive psychological impact on your players. You'd think it's just a game, but ever since you've introduced this changes to beta, I haven't slept well and I feel really stressed. So, my next question to you is: Do I really need this in my life??? There are plenty of other games out there..."}, {"58": "When I look at the numbers alone, it's not that bad. More than one third of the rewards for one sixth of the effort (in auto fight). So a much better reward to effort ratio.[BR][BR]But...[BR]it just doesn't feel this way. It feels like the Spire. Slaughter your troops and deplete your resources. The rewards might be worth it, but it's no fun anymore.[BR][BR]It is fine to adjust the tournament difficulty somewhat with chapter progression, since there are techs that help you with fighting and catering. However, turning each and every city progression against the player removes a great deal of the incentive to play this game."}, {"93": "Killiak said:\t\t\tPerhaps all of us should tell our FS to no longer play the tournament?[BR][BR]See if we can organize as much of a server-wide strike as we can. We are not guinea pigs, and this new system is so utterly crap that I see no point in playing/testing it for Inno.\t\tClick to expand...[BR]sounds like a plan to me!"}, {"102": "I like the one fight per province change. And that's about it...[BR][BR]The squad sizes are now so massive that, despite training units with a fed lvl 10 brown bear active, using time boosters from the spire, I get through most of them in 15-20 provinces, going ONE ROUND. That's preposterous![BR][BR]Tournaments were my favourite part of the game - I loved the fact that if I had a lot of research to do or wanted to quickly upgrade a wonder, I could push myself and get lots of KP. That is now impossible. Why have so many military buildings and wonders available when you're going to render them absolutely useless??[BR][BR]Not a positive change, at all...[BR][BR]Edit: And I do NOT appreciate being made a guinea pig without choice - if I wanted to test out the new mechanics, I'd have started a city on the Beta server. I was not interested. And, quite frankly, if these changes were permanent, I'd probably quit the game - so I'd very much like to be able to make my mind up in one week of the new system, rather than hope that this mess will be fixed some time in the future..."}, {"83": "JollyElf said:\t\t\tNot exactly socialist as it’s an ultra huge capitalist that’s sitting behind [smilie--sprite2]Click to expand...[BR]Oh definitely!  They are making money off us while forcing us to be socialists.  The less we work, the more we get.  Those who have worked harder, built up their cities and AWs are penalized.  Meanwhile, INNO is loving it and hoping more of us buy their diamonds."}, {"93": "Susananna said:\t\t\tOh definitely!  They are making money off us while forcing us to be socialists.  The less we work, the more we get.  Those who have worked harder, built up their cities and AWs are penalized.  Meanwhile, INNO is loving it and hoping more of us buy their diamonds.\t\tClick to expand... well said! and Inno can forget about me spending a cent again till they fix this rubbish the force on us. that is if i do not find another non Inno game to play first and leave Elvenar."}, {"2": "Susananna said:\t\t\tOh definitely!  They are making money off us while forcing us to be socialists.  The less we work, the more we get.  Those who have worked harder, built up their cities and AWs are penalized.  Meanwhile, INNO is loving it and hoping more of us buy their diamonds.\t\tClick to expand...[BR]Princess Penelope said:\t\t\twell said! and Inno can forget about me spending a cent again till they fix this rubbish the force on us. that is if i do not find another non Inno game to play first and leave Elvenar.\t\tClick to expand...I declined last three offers of double diamonds. Not a single cent from me, not until Elvenar becomes AGAIN a player-friendly game.[BR]And if this doesn't matter, there are always places where reviews can be placed. Beware Inno, do not bite the hand that's feeding you."}]