[{"60": "I acquired 2 ELR boosters so have put them down to see how it goes now. I have UUU+ 2 ELR as boosters. I lose at the 16th province in the first round. What am i meant to do against this? Catering costs are a ridiculous 18k+ goods so thats out of the question. Again, squad size is 825 so thats 15 squads worth of troops gone in one fight.[BR][BR][IMG]https://i.ibb.co/PMPmDNL/https-en-forum-elvenar-com-index-php-attachments-1597833701711-png-4650.png[/IMG][BR][BR]So 2 boosters that are hard to get hold of give me a whopping 4 new provinces. This is completely and utterly broken. It wont be fixed though since virtually all the feedback you have gotten from those of us who take time to give it here on the forums and in beta is negative and you still continue with it. It would be great if the person/people who insist on pushing ahead with this would spend an hour or two actually speaking to us about it but i wont hold my breath."}, {"32": "alsael said:\t\t\twell,2 things can be done to help the players.Open all 3 military buildings so we can train at the same time,and merge the bonus damage temp buildings to one,giving +125% damage to all your units.That will also compensate for those who do not have fire phoenix\t\tClick to expand...This has many consequnces, they might decide to lower the training speed making it a dud,[BR]It also imbalances players a lot more, as training speeds differ greatly, you now need 3 wonders and buildings instead of 1 of each , and 1 wonder is only aviable late in game.[BR]And then the 3rd issue, is you get a lot of sub par units. quite often 1 unit out of the 3 is the best, but now you have to use all 3 buildings instead.[BR]For example training grounds are you going to produce cerberus units 9 weeks in a row 7 das a week 24 hours a day?[BR]If not then what else will you produce? Orc Strategist that require an unattainable amount of orcs? Or or generals who are sub par to any unit and also need orcs? Dryads? I rather make either Archers or Forest Wardens, and banshees who are so bad they won't win you any good battle, they are marginally better than mortars as a heavy range equivalent in poor performance.[BR][BR]So even if you could make so much more units, many of those units are to weak to be usable to win difficult battles.[BR]They will have little impact on the overall result because of this, if you want to win those hard battles what you need are the best possible units, not weak units that will loose that match no matter how many you own.[BR][BR]Gargon667 said:\t\t\tCan´t really post proper feed back, I have 10 booster buildings in this week. Which is onviously not sustainable. But if it was I had no problem with the new tourney system lol.[BR][BR]Anyway: The have made tourneys easier and easier of the past what 2 years? now they make them harder for the first time since then. I am thinking I will still make more in tourneys now than I did 2 years ago... Could it have been done better? Absolutely yes. I still don´t like the formula for SS at all. Punishing the wrong markers.\t\tClick to expand...I do not know how much you did 2 years ago, but when you consider that 2 years ago there was no fire bird, no brown bears, no combat buildings (outside a one off event) and no massive bunch of time boosters from the spire or crafting as both did not exist even if you could still do a little more, it's still a huge downgrade from 2 years ago, as you now need all that just to perform a little bit better.[BR][BR]Melianora said:\t\t\tRegarding Testing, I have to say, that choosing live server with paying customers is an absolute NOGO!![BR]INNO should have their own separate Alpha, Beta Server, where they can feed information from live servers and then run tests with those numbers. Very easy to see what the outcome is then, instead of making the natives restless![BR]The information is there! Elvenstats and Elvenarchitect use that information. Hell, then INNO should be able to use that too and do some Testing on their own with live data and not embarrass themselves with this absolutely unbalanced update which they fed to us all here!\t\tClick to expand...Beta is not a \"test server\" but a pre-release server.[BR]If it truly was a test server they would not ask for money (buy diamonds), and they would provide test functionality for example:[BR]*cities could be removed if testing requires it.[BR]* They offer huge diamonds amounds to build a city quickly to a stage they want for testing[BR]*they would allow importing your live city for testing purpose.[BR][BR][BR]Instead it's just a server like this server, with pre-release, and no warranty on bugs (if you're screwed, to bad for you, no-loss returns)[BR][BR]Beta is just a live server, with bad support as a price for being the first to see all the new bugs."}, {"2": "CrazyWizard said:\t\t\tBeta is not a \"test server\" but a pre-release server.[BR]If it truly was a test server they would not ask for money (buy diamonds), and they would provide test functionality for example:[BR]*cities could be removed if testing requires it.[BR]* They offer huge diamonds amounds to build a city quickly to a stage they want for testing[BR]*they would allow importing your live city for testing purpose.[BR]Instead it's just a server like this server, with pre-release, and no warranty on bugs (if you're screwed, to bad for you, no-loss returns)[BR]Beta is just a live server, with bad support as a price for being the first to see all the new bugs.Click to expand...[BR]Do not forget that beside all you've already mentioned, in Beta there are NO offers, NO discounts on diamonds or magical buildings and NO reward for testing (more or less) Inno's \"improvements\" [smilie--sprite8] [smilie--sprite8] [smilie--sprite8][BR]EDIT - NO discounts on Premium expansions either. Lol"}, {"88": "CrazyWizard said:\t\t\tBeta is not a \"test server\" but a pre-release server.[BR]If it truly was a test server they would not ask for money (buy diamonds), and they would provide test functionality for example:[BR]*cities could be removed if testing requires it.[BR]* They offer huge diamonds amounds to build a city quickly to a stage they want for testing[BR]*they would allow importing your live city for testing purpose.[BR][BR][BR]Instead it's just a server like this server, with pre-release, and no warranty on bugs (if you're screwed, to bad for you, no-loss returns)[BR][BR]Beta is just a live server, with bad support as a price for being the first to see all the new bugs.\t\tClick to expand...[BR]@CrazyWizard, so we do agree that this is not really a good way to do testing! [smilie--sprite6][smilie--sprite8][smilie--sprite12][BR][BR]Alcaro said:\t\t\tDo not forget that beside all you've already mentioned, in Beta there are NO offers, NO discounts on diamonds or magical buildings and NO reward for testing (more or less) Inno's \"improvements\" [smilie--sprite8] [smilie--sprite8] [smilie--sprite8]Click to expand...[BR]@Alcaro , oh so wonderful. So you put yourself out there for free, to see what's new and when you give feedback it's like \"Who said something? Ah we'll push to live server now...\""}, {"75": "30158729 said:\t\t\tIt would be great if the person/people who insist on pushing ahead with this would ....\t\tClick to expand...... perhaps stop taking backhanders from the opposition? [smilie--sprite3]"}, {"88": "@Silmaril, when will there be a statement on the communicated issues from whoever responsible on your side? [BR]I think you are aware that this is not going well in any way?"}, {"57": "@Silmaril, I have read the whole thread and find some of your comments disconcerting (lets ignore the fact that you made two conflicting points earlier in the thread).  You want quantitative rather than qualitative observations. I play the game for fun (qualitative). I enjoy puzzles so I enjoy the spire and the tournament (qualitative). Previously I would auto fight through provinces until they became 'interesting' (qualitative) from where I would manual fight, beating the machine (a qualitative response). Many in my fellowship thought that I would enjoy (qualitative) the new format; I have not (qualitative) enjoyed the new format. [BR]The tournament has become too repetitive and too unforgiving. Where is the fun (qualitative) of seeing the enemy trapped behind the terrain (although it happened to me too often during encounters).[BR]If the game isn't fun (qualitative) people will stop playing.[BR]ps Put down a dwarven armourer, an Unleashed Unit Upgrade and fed the (maxed out) Fire Phoenix. Round one - Province 21 was almost impossible. I felt uncomfortable trying to fight past province 22 in round 2. I lost 40% of one type of squad in the first two rounds. Unsustainable!"}, {"88": "Melianora said:Summary[BR]Negative: See above[BR]Positive: Less provinces to fight\t\tClick to expand...[BR]@Silmaril, one other positive thing: The advantage of manual fights can be felt quite good now. Now when is manual fights coming to Mobile App?"}, {"57": "@ Silmaril. Apologies, Your conflicting comments were made on the[BR]Part of the city is not displayed[BR]thread, not on this thread."}, {"91": "Melianora said:@Silmaril, one other positive thing: The advantage of manual fights can be felt quite good now. Now when is manual fights coming to Mobile App?\t\tClick to expand...Now I guess everyone is aware of the benefits of manual fighting.Inno,include that in app version.We need that.[smilie--sprite4][smilie--sprite4]"}, {"103": "It is bad news that the enemy is fixed at 5 unit.[BR]It was advantageous to have more or less."}, {"84": "Killiak said:\t\t\tSee if we can organize as much of a server-wide strike as we can. We are not guinea pigs, and this new system is so utterly crap that I see no point in playing/testing it for Inno.\t\tClick to expand...[BR]While i think that everyone refusing to do the tourney is probably the only way to make the devs take notice i also think that it will never happen. In the past when players have come to the forum saying how much they disliked events or whatever most of the time those same players still played the events. FOMO is one of the devs best weapons."}, {"22": "Haha, now we get the in-game notification about the tournament changes... better late than never, eh?"}, {"2": "in Beta some of us had a problem with 12th encounter, both 1st round and 2nd too. I personally lost whatever I tried.[BR]A tip from QA -[BR]\"Well I can already tell you that for each province there is 1 layout now, so 1 star or 6 stars, the map layout is always the same. So if you encounter an impossible to (auto)fight layout, you will encounter it at each star level for that province. That might explain why you loose at the same province every time.[BR]This is intentional, so you can also use this to your benefit. No need to scout the province each time at a different star level, if you remember the layout from star 1\"[BR]I thought to add this here too, maybe will help some of you. [smilie--sprite1]"}, {"88": "Pauly7 said:\t\t\tHaha, now we get the in-game notification about the tournament changes... better late than never, eh?\t\tClick to expand...[BR]I was just about to post that....[BR]This is a joke now, right? See below... [BR]The text reads like its set in stone [smilie--sprite7][BR][BR][IMG]https://i.ibb.co/yYWbM6W/https-en-forum-elvenar-com-index-php-attachments-elvenar-fantasy-city-builder-game-png-4651.png[/IMG]"}, {"104": "stucon said:@Silmaril, I have read the whole thread and find some of your comments disconcerting (lets ignore the fact that you made two conflicting points earlier in the thread).  You want quantitative rather than qualitative observations. I play the game for fun (qualitative). I enjoy puzzles so I enjoy the spire and the tournament (qualitative). Previously I would auto fight through provinces until they became 'interesting' (qualitative) from where I would manual fight, beating the machine (a qualitative response). Many in my fellowship thought that I would enjoy (qualitative) the new format; I have not (qualitative) enjoyed the new format.[BR]The tournament has become too repetitive and too unforgiving. Where is the fun (qualitative) of seeing the enemy trapped behind the terrain (although it happened to me too often during encounters).[BR]If the game isn't fun (qualitative) people will stop playing.[BR]ps Put down a dwarven armourer, an Unleashed Unit Upgrade and fed the (maxed out) Fire Phoenix. Round one - Province 21 was almost impossible. I felt uncomfortable trying to fight past province 22 in round 2. I lost 40% of one type of squad in the first two rounds. Unsustainable!\t\tClick to expand...tourney is no longer fun in new form period, will not play as much in future if it stays this way"}, {"68": "Timneh said:\t\t\tWhile i think that everyone refusing to do the tourney is probably the only way to make the devs take notice i also think that it will never happen. In the past when players have come to the forum saying how much they disliked events or whatever most of the time those same players still played the events. FOMO is one of the devs best weapons.\t\tClick to expand...For me, FOMO is being replaced by CBA..."}, {"2": "Piglets For All said:\t\t\tFor me, FOMO is being replaced by CBA...\t\tClick to expand...LMAO [smilie--sprite8] [smilie--sprite8] [smilie--sprite8]"}, {"105": "been playing for over 5 years had trouble getting anywhere with tournament, no you have made it impossible  to get any where with this change ...just a matter of time before i throw in the towel......."}, {"106": "Unexpected random enemy troops suck.[BR][BR]Catering costs have not been reduced. Quite the opposite and some of the resources needed, eg. supplies, makes a Tourney more draining.[BR][BR]The only plus is fewer fights needed."}]