[{"68": "sh2002 said:\t\t\tUnexpected random enemy troops suck.[BR][BR]Catering costs have not been reduced. Quite the opposite and some of the resources needed, eg. supplies, makes a Tourney more draining.[BR][BR]The only plus is fewer fights needed.\t\tClick to expand...I find its so much quicker than before, when provinces become unwinnable and the catering costs too expensive then the difference between 1 encounter per province or 4 makes no difference - the tournament is over for that round."}, {"80": "What annoys me the most is that we spend years upgrading our cities , especially AWs , to improve our troops so that we can do better in the tournaments  , then the Dev's , in their wisdom , decide that we should be disadvantaged for having higher AWs , more expansions etc.  The balancing is way off , they seem to want beginners to have an equal standing with veterans , which is ridiculous and defeats the point of upgrading anything at all.  I'm in chapter 15 and have all AWs up to that point  , which now don't seem to give me any extra help whatsoever. The costs of catering were said to be \"greatly\" reduced , but that is not the view of anyone from what I've read.  Plus it's a good way to cut your income by making purchases of expansions cause greater difficulty in the game , DOH ! [smilie--sprite11][smilie--sprite3]"}, {"88": "Piglets For All said:\t\t\tFor me, FOMO is being replaced by CBA...\t\tClick to expand...ROTFL dear piglets [smilie--sprite8][smilie--sprite8][smilie--sprite8]"}, {"107": "I have finished Ch.16 so for me it is all about optimising my city, helping my FS and competing in tournaments, spire and events.  This change has really left me feeling in limbo and I can't make any informed decisions that may or may not help with this new style of tournament play as it is still in its 'testing phase'.  [BR][BR]For example.....[BR]- do I go back and complete all the SSU that I missed?  They are currently sat filled with KP and I don't know whether to activate the research or not?[BR]- do I look to remove any 'non-essential' AWs to try and lessen the losses?  (This would be a very bitter pill to swallow due to time and investment!)[BR]No-one can enlighten me on either of these points as we simply do not have the knowledge .... yet![BR][BR]Any action I take now may have a negative effect if further changes are made, so I am just sat biding my time, and instead of competing, I am just participating!   The severe losses to troops and goods are simply not worth trying to get into the rankings - its not sustainable and more importantly, its not fun![BR][BR]I am totally aghast that you are asking players from a 'Live' server to comment and critique this new system, especially when any changes we make to try and better our outcomes may be detremental to us in the long run if yet further changes are made to this 'testing phase'.  There is no incentive or compensation to 'testing' and no reverting back if we make changes to try and improve outcomes. I am therefore at a total loss as to how we are able to give any constructive feedback to this when our cities are not built or optimised to accomodate it?   The only feedback I can give is negative and has been aired by many, many players already![BR][BR]We have spent vast amounts of time (and for some money) designing and building our cities to maximise efficiency and you have effectively just done a U-ey and moved the goalposts.  All that strategic thought and planning, time and investment potentially wasted.[BR][BR]What I can tell you is that you have sucked all the fun out of the weekly tournaments and I am now sat here clueless.[BR][BR]Keep any testing in Beta and only bring to Live worlds once a final decision is made.  I may not like the final outcome, but at least I can make informed choices, once I know where the new goalposts are, and can move forward to get out of this unfinished disappointment that you have introduced with these tournament changes."}, {"88": "@Silmaril - Summary from all of the above: The reasons you gave for the changes to not reflect in what everyone is experiencing![BR][BR]Reduced Catering Costs - Nada, didn't really happen with reasons you will find further up.[BR]More challenging tournament encounters - Nada (they become impossible fast)[BR]1 instead of 4 encounters - Well this looks to have been taken literally in terms of units, so whenever you hit a wall where you do not have enough units to have enough squads, the round is over. With 4 instead of one, you could still be going on, as the required squad size is lower for each single encounter. So here as well - Nada, Failed, Take a seat, repeat the class![BR][BR]What has been accomplished?[BR]Annoyed players who have advanced their cities far with or without buying diamonds.[BR]Who are those who have advanced their cities far? Oh its THOSE players, that LOVE investing A LOT OF TIME in this game![BR]Please put this live on all the other servers, so you can see your revenue and respect from others flow away like a Tsunami sweeping over Elvenar [smilie--sprite1][smilie--sprite9][smilie--sprite11]"}, {"88": "Glitter3296 said:\t\t\tI have finished Ch.16 so for me it is all about optimising my city, helping my FS and competing in tournaments, spire and events.  This change has really left me feeling in limbo and I can't make any informed decisions that may or may not help with this new style of tournament play as it is still in its 'testing phase'. [BR][BR]For example.....[BR]- do I go back and complete all the SSU that I missed?  They are currently sat filled with KP and I don't know whether to activate the research or not?[BR]- do I look to remove any 'non-essential' AWs to try and lessen the losses?  (This would be a very bitter pill to swallow due to time and investment!)[BR]No-one can enlighten me on either of these points as we simply do not have the knowledge .... yet![BR][BR]Any action I take now may have a negative effect if further changes are made, so I am just sat biding my time, and instead of competing, I am just participating!   The severe losses to troops and goods are simply not worth trying to get into the rankings - its not sustainable and more importantly, its not fun![BR][BR]I am totally aghast that you are asking players from a 'Live' server to comment and critique this new system, especially when any changes we make to try and better our outcomes may be detremental to us in the long run if yet further changes are made to this 'testing phase'.  There is no incentive or compensation to 'testing' and no reverting back if we make changes to try and improve outcomes. I am therefore at a total loss as to how we are able to give any constructive feedback to this when our cities are not built or optimised to accomodate it?   The only feedback I can give is negative and has been aired by many, many players already![BR][BR]We have spent vast amounts of time (and for some money) designing and building our cities to maximise efficiency and you have effectively just done a U-ey and moved the goalposts.  All that strategic thought and planning, time and investment potentially wasted.[BR][BR]What I can tell you is that you have sucked all the fun out of the weekly tournaments and I am now sat here clueless.[BR][BR]Keep any testing in Beta and only bring to Live worlds once a final decision is made.  I may not like the final outcome, but at least I can make informed choices, once I know where the new goalposts are, and can move forward to get out of this unfinished disappointment that you have introduced with these tournament changes.\t\tClick to expand...[BR]Thanks @Glitter3296 ! [smilie--sprite6] [BR][BR]Sidenote: For now you can forget about completing the research on the optional squad sizes. They have currently NO influence whatsoever on the tournament"}, {"22": "Brienne said:\t\t\tWhat annoys me the most is that we spend years upgrading our cities , especially AWs , to improve our troops so that we can do better in the tournaments  , then the Dev's , in their wisdom , decide that we should be disadvantaged for having higher AWs , more expansions etc.  The balancing is way off , they seem to want beginners to have an equal standing with veterans , which is ridiculous and defeats the point of upgrading anything at all.  I'm in chapter 15 and have all AWs up to that point  , which now don't seem to give me any extra help whatsoever. The costs of catering were said to be \"greatly\" reduced , but that is not the view of anyone from what I've read.  Plus it's a good way to cut your income by making purchases of expansions cause greater difficulty in the game , DOH ! [smilie--sprite11][smilie--sprite3]Click to expand...Marindor eventually backtracked about the catering costs - He came back with the argument that they have been reduced as a ratio compared to the new increased cost of fighting. In actual fact the cost of catering has greatly increased."}, {"88": "Pauly7 said:\t\t\tMarindor eventually backtracked about the catering costs - He came back with the argument that they have been reduced as a ratio compared to the new increased cost of fighting. In actual fact the cost of catering has greatly increased.\t\tClick to expand...Wonderful INNO communication! Another slap in the face :[ - Thanks for that information @Pauly7"}, {"76": "Had wanted to leave posting any thing but want to say this. In my orc chapter negotiation city (still doing orc poo) i have manged the same amount of provinces as last week for less goods used, true coins and supplies have taken those points but so far i can handle them. So there is some truth but i think it depends on where you are in the chapters."}, {"108": "I am sickened, the tournament is now pointless, this is all about money.[BR]I used to do about 25 to 30 provinces, but now I could only do 23 and my troops were decimated, the squad size differences are  astronomical.[BR]Even by province 10 I was starting to struggle with the loss of troops.[BR]Would it make any difference if I went all the way back to chapter 1 and start researching all the SS growth levels that most us who are manual and auto fighters left out because it made it easier.[BR][BR]INNO, take a long hard look at yourself in the mirror.               ;-("}, {"89": "RodgerR said:\t\t\tWould it make any difference if I went all the way back to chapter 1 and start researching all the SS growth levels that most us who are manual and auto fighters left out because it made it easier.\t\tClick to expand...[BR]As far as i've tested it, it doesn't make any difference now - no matter if you did research it or not, as the calculations don't take the squad size as a variable anymore.[BR][BR]You can research it, tourneys will neither get harder or easier. (EDIT: For now!)"}, {"88": "RodgerR said:\t\t\tI am sickened, the tournament is now pointless, this is all about money.[BR]I used to do about 25 to 30 provinces, but now I could only do 23 and my troops were decimated, the squad size differences are  astronomical.[BR]Even by province 10 I was starting to struggle with the loss of troops.[BR]Would it make any difference if I went all the way back to chapter 1 and start researching all the SS growth levels that most us who are manual and auto fighters left out because it made it easier.[BR][BR]INNO, take a long hard look at yourself in the mirror.               ;-(\t\tClick to expand...[BR]The optional SS upgrades have NO influence whatsoever on the tournament. @MinMax Gamer  alr add found that out with the formula used. I used the Tournament Calc Sheet from @MinMax Gamer in this tournament and it fits with the values!"}, {"73": "RodgerR said:\t\t\tWould it make any difference if I went all the way back to chapter 1 and start researching all the SS growth levels that most us who are manual and auto fighters left out because it made it easier.\t\tClick to expand...True. It doesn’t change tournament anyway NOW. But better wait for the 3 week test period. [BR]We are unanimously upset and for once  if Inno listens and rolls back to the old system, we don’t want to permanently damage ourselves by doing those optional SS techs."}, {"73": "Melianora said:\t\t\tThe optional SS upgrades have NO influence whatsoever on the tournament. @MinMax Gamer  alr add found that out with the formula used. I used the Tournament Calc Sheet from @MinMax Gamer in this tournament and it fits with the values!\t\tClick to expand...Waiting 3 weeks doesn’t hurt. (Above post)"}, {"84": "All this leaving feedback is pointless and a waste of time. Most of the players that have been here for a few years know deep down that there are not going to be any substantial changes made, when the devs introduce something to the game they introduce in the way they want it and no amount of feedback is going to make any difference. They ask us for feedback but i think that is just to try and make us feel that we actually have some input into the game while it is actually ignored. On the very rare occasions they the devs do make any changes those changes are so small that they make no difference. Lets take expansions as an example, they say they have reduced the impact on tournaments from expansions and premium expansions but the reduction is so small that it is not noticeable and if what has been said earlier on this thread is right they have increased some other thing so there is no difference at all.[BR]Maybe instead of refusing to do the tournament we should refuse to give them feedback although they would probably then say we didn't say we didn't like the changes so they must have been good."}, {"60": "@Silmaril The vast majority of feedback is very negative. Is there any hope at all that this will be changed significantly?"}, {"109": "MinMax Gamer said:\t\t\tDifficulty per se is not affected by your expansions or AW levels. Just like with any other fighting in this game, it is only affected by the ratio of your own SS vs enemy's, boosts, troops lineup and the terrain. None of that depends on expansions / AW levels\t\tClick to expand...[BR]Actually, in the new version of tournament, the difficulty IS affected by those exact things. AW levels, Expansions added, etc. It's no longer based solely on how many SSS upgrades you've done."}, {"28": "tat2mikki said:\t\t\tActually, in the new version of tournament, the difficulty IS affected by those exact things. AW levels, Expansions added, etc. It's no longer based solely on how many SSS upgrades you've done.\t\tClick to expand...You may want to reread what I posted. Difficulty, as in percentage losses, is not impacted by the base squad size."}, {"78": "To the dev team -[BR][BR]We have a cosy relationship - you chuck challenges at me and I try to solve them. I like your challenges well enough to contribute regularly to your ability to continue doing what you do so well. [BR][BR]However the introductory info for the current change is, frankly, dire. Many of the negative comments you are getting result from players just not having basic information to enable them to play the game with confidence.[BR][BR]And that, my friends, you cannot do without."}, {"99": "Having completed round 2 I found that the enemy squad size percentages were the same as round 1. Interestingly; this round was slightly, and only ever so slightly, easier than round 1. That makes little sense unless the difficulty was adjusted mid-tournament. Of the 45 provinces done I captured full information on only the last 35, so it's on those that the below information is based.[BR][BR]First, the issue of random enemy units with the usual suspects having an alleged greater weighting:[BR]Of the 35 provinces Mistwalkers (MW) appeared 19 times. That's over 50% of the time. Mistwalkers weren't previously part of the Planks Tournament.Of the 35 provinces Heavy Ranged (HR) units appeared 17 times. That's about 50% of the time. Heavy Ranged units weren't previously part of the Planks Tournament.Of the 35 provinces Mage (M) units appeared 9 times. That's about 25% of the time. Mage units weren't previously part of the Planks Tournament.Of the 35 provinces there were 16 instances where a MW/HR or MW/M or HR/M combo occurred. That's just under 50% of the time.Of the 35 provinces there were 8 instances where 4/5 different enemy unit types showed up in the same line-up. That's just under 25% of the time.Of the 35 provinces ONLY the usual suspects appeared...5 times. There are a few caveats here, as Dryads didn't appear once and Ancient Orcs appeared a lot less frequently than they did yesterday. That latter point is why I'm thinking that the difficulty was adjusted mid-tournament. So, when I say, \"Usual suspects,\" I mean any Light Ranged, Light Melee and Heavy Melee units but EXCLUDING Mistwalkers.Take what you like from the above but the so-called weighting is a joke.[BR][BR]The next part is on catering, so some info on my city:[BR]Chapter: 12[BR]Coin limit: 22m[BR]Supplies limit: 2.2m[BR]T1 production/day: c. 240k[BR]T2 production/day: c. 180k[BR]T3 production/day: c. 220k[BR]Orc production/day: c. 5800[BR][BR]The orc production rate came from my 3 armories and level 24 Heroes' Forge. But how many people are running around with a level 24 or greater Heroes' Forge? That figure does exclude my 26 Orc Ships and 6 Orc Nests, though. My educated guess is that the number of people running around with that number of Orc Ships and Orc Nests is even less than the number of people with a level 24 or greater Heroes' Forge.[BR][BR]These were the catering requirements of provinces 11 through 45:[BR]1121k T1 - 16k T2 - 4k orcs1246k T1 - 17k T21324k T1 - 12k T3 - 39k mana1440k T2 - 13k T315220k supplies - 56k T11630k T1 - 23k T2 - 15k T317250k supplies - 48k T21833k T1 - 25k T2 - 6.6k orcs1935k T1 - 26k T2 - 17k T32036k T1 - 56k T22138k T1 - 19k T3 - 61k mana2280k T1 - 20k T3233.3m coins - 21k T3 - 8.3k orcs24350k supplies - 33k T2 - 8.7k orcs2545k T1 - 34k T2 - 72k mana2636k T2 - 46k T32774k T2 - 78k mana2876k T2 - 25k T32952k T1 - 26k T3 - 83 mana3082k T2 - 27k T33156k T1 - 42k T2 - 11k orcs32460k supplies - 57k T1 - 11k orcs33470k supplies - 59k T1 - 95k mana34490k supplies - 61k T1 - 30k T335500k supplies - 63k T1 - 31k T33664k T1 - 98k T23766k T1 - 66k T33852k T2 - 34k T3 - 110k mana39140k T1 - 53k T24071k T1 - 72k T34173k T1 - 56k T2 - 36k T342600k supplies - 75k T1 - 57k T243152k T1 - 38k T34478k T1 - 60k T2 - 39k T3456.4m coins - 640k supplies - 61k T2[BR]The catering requirement for province 11 was already asking me for nearly 10% of my T1, T2 and orc daily productions. And the costs just escalate from that point. Province 20 asked me for 15% of T1 and over 30% of T2 daily production. I'm a slow advancer anyway, with some chapters having taken me about 6 months to complete, as I've spent a lot of time and KP upgrading my AWs. But those kind of figures are going to cripple cities that don't take as laid back approach as I do to the research tree. And the orc requirements? They were just mind-boggling. Province 18 wanted more than my daily orc production. Province 24 wanted 1.5 of my daily orc production. Coin and supplies requirements, as you can see, were also relatively high but with coin and supply instants in stock it's swings and roundabouts...until they run out.[BR][BR]The above is yet more evidence that the tournament update is helping NO ONE.[BR][BR]EDIT: I should add that I have 12 of each T1, T2 and T3 manufactories. I understand that the average is 6 of each, so my 10% is someone else's 20% and my 30% is someone else's 60%. Those kind of figures are not equitable long term."}]