[{"2": "Silent Tempest said:\t\t\tEDIT: I should add that I have 12 of each T1, T2 and T3 manufactories. I understand that the average is 6 of each, so my 10% is someone else's 20% and my 30% is someone else's 60%. Those kind of figures are not equitable long term.\t\tClick to expand...Jeez! I only have 6 T1, 5 T2 and 4 T3 (and 2-2-3 Sentient manufactories). I think \"my 10% is someone else's 20%\" it's an understatement [smilie--sprite8] Your 10% is my 30-60%. Oh, now I am so disheartened."}, {"78": "Just rattling through the figures to get all the chests - it's needs an average of 6,640 points from every player in a FS. With the current difficulty levels it's really difficult to see how this could be possible."}, {"110": "After 4+ years with Elvenar I've learnt that giving feedback to Inno is pointless. Similar to making a phone call to a deaf person.[BR]I can only conclude they are reading that book yet again \"How to upset all your customers and get your redundancy cheque quicker\""}, {"73": "@Silmaril : Lost 2500 squads auto battling so far. [BR]7500 tournament points. [BR]Since I agreed to test for you. Not for kp ;p [BR]Feedback : Not sustainable in the long run.[BR][BR]PS : I manual battled a few encounters. Low losses, yes. But got bored. Trust me, no one 3-4 months into the game can do manual battle on and on. It’s very repetitive."}, {"27": "There are two kinds of difficulty in the tournament:[BR]1) Difficulty of winning a battle. That's directly related to the ratio between my and enemy squad size (who brings more troops, has easier time).[BR]2) Difficulty of replacing losses. That's directly related to the size of my squad (the bigger squad, the more individual troops I need to replace after (won) battle).[BR][BR]I believe a lot of people don't realize how the difficulty of winning a battle in the new tournament got changed. And I believe that picture (or at least colorful table) speaks better than words. Here's an attempt for visualization of the new vs. old tournament difficulty of winning the battle. (Many many many thanks to @MinMax Gamer for the info he provided to the comunity, the first column is copied directly from his table.)[BR][BR]- There are few provinces that are EASIER than EVER before - that's the green part above the first thick line. In the \"old\" tournament the difficulty started at around 0.85 (it could slightly differ when there were not exactly 5 squads).[BR]- Also some higher stars are easier that the same stars in the \"old\" tournament. 1* reach the same difficulty in the 7th province, 2* in the 8th province, 3* also in the 8th province, 4* in the 11th province, 5* in the 13th province and 6* in the 16th province.[BR]- But also from the break points listed just above the higher stars or the following provinces are always tougher than the same stars in the \"old\" tournament.[BR]- But also by province 21 we are starting to face TOUGHER fights than EVER before. In the \"old\" tournament the difficulty was topped at around 1.6 ratio.[BR][BR]I strongly believe that the sole purpose of the rebalance is to prevent us to go to high numbered provinces every week and harvest the knowledge points in the second (and some players even in the fifth) round. I hate the dishonesty of the style in which Inno presents these changes.[BR][BR]Personally, when I try to distant myself from my heated emotions, I must say that spirit of the change itself does make some sense. The possibility to get huge amounts of KPs was probably hurting the game balance in the long run. Probably. The delivery of the change was awful. And I'm not persuaded, that this was the only solution or even one of the top ones.[BR][BR]One more personal note: I started farming the knowledge points from the second round of the tournament only this year. Why? Because the last chapters were so slow to go through! The possibility to slowly level up my wonders gave me some sense of progress. I even built several wonders I originally decided to skip. That's ironic, because that decision is what hurts me in the new tournament in the other kind of difficulty (replacing losses), lol."}, {"84": "KermitsDad said:\t\t\tAfter 4+ years with Elvenar I've learnt that giving feedback to Inno is pointless.\t\tClick to expand...[BR] Wow i'm surprised it took that long.[BR][BR][BR]KermitsDad said:\t\t\tI can only conclude they are reading that book yet again \"How to upset all your customers and get your redundancy cheque quicker\"\t\tClick to expand...[BR]My thoughts are that they don't worry about upsetting the players they have now because they know new players are joining the game all the time that don't know what the game was like so just accept things the way they are."}, {"78": "4th round – I’ve changed my mind (and so should the devs)[BR][BR]Changing the Tourney in the way suggested affects every other part of Elvenar – “Everything is connected”. A change of this magnitude shakes the foundations of the game as we know it.[BR][BR]The announcement of the change contains little evidence that any thought has been given to its wider impact and what is planned to ameliorate these effects. The result is doubt, which leads to loss of loyalty.[BR][BR]The actual changes to the Tourney are huge – up until this point I had a sustainable average of 6-7k. This week I expect no more than 5k and I suspect that might require some Herculean replacement effort. And, of course, a very significant reduction in kp, spells and relics. There is little and confusing information on how I might improve. More doubt.[BR][BR]I would not like the AMs job of recruiting a FS where every member can stump up the 6.6k points required to get all the chests. More doubt.[BR][BR]It goes without saying that you should have ensured that everyone on EN got the message in plenty of time. The ‘back door’ approach to communication leads to more - guess what ?"}, {"14": "Indeed @FieryArien [BR][BR]Inno is miserable at communicating with their players, terrible at being honest, and disastrous at actually listening.[BR][BR]They always say \"We are looking forward to your feedback\". It's a flat out lie to our faces."}, {"20": "I do not think there are provinces easier than before.  For me the old system felt like the coloured table going around now.  Round 1 was easy and getting more difficult wrt to troop size required as well as the increase in star rating of the enemies.  Every round increased in difficulty due to numbers and more difficult terrain. Round 6 was brutal. Never got to it a lot due to time and highest I think was around tent 5 or 6. No more troops by that time.  Does it make the present model easier for round 6? Likely not, as it already wants twice the number of troops in round 2 than it does in round 1.  I do not consider myself as a super tourney player, average, but with an understanding of how to do it (old model) sustainably."}, {"32": "BlueBlou said:\t\t\tI do not think there are provinces easier than before.  For me the old system felt like the coloured table going around now.  Round 1 was easy and getting more difficult wrt to troop size required as well as the increase in star rating of the enemies.  Every round increased in difficulty due to numbers and more difficult terrain. Round 6 was brutal. Never got to it a lot due to time and highest I think was around tent 5 or 6. No more troops by that time.  Does it make the present model easier for round 6? Likely not, as it already wants twice the number of troops in round 2 than it does in round 1.  I do not consider myself as a super tourney player, average, but with an understanding of how to do it (old model) sustainably.\t\tClick to expand...[BR]The very first battle is easier, even if you select your units with your eyes closed and they are all the wrong units you will still win [smilie--sprite2][BR]But you were right, the first provincies have always been easy in the old tournaments as well, if people do not like the tournaments then they still will not like it now. that is nog going to change. the easy part is just a facade."}, {"90": "I suppose it'd be daft of me to even try and ask what is the retention rate of new players starting this game eh @Silmaril, cause I do wonder why the developers always favour the new players over experienced players. Because the odds are so stacked against the new players just on the basis of Tournaments alone. They won't have had the Fire Phoenix, they certainly will never see the Brown Bear ever again and with Inno's policy of not allowing Artifacts to be produced in the MA, and with no option of buying those Artifacts either, how do you suppose that new players will find these Tournament changes benefits them? [BR][BR]And once word gets out that by buying diamonds and advancing their cities detriments their ability to, as you put it, enter into Tournaments easier, what do you think will happen to that segment of your player base? You think you can pull a Thanos and wipe the slate clean such that the new player base will never know better? [BR][BR]Revoke, reverse, revert. Please."}, {"90": "I cannot even get past Round 2. The catering costs are too high for me. 40k in supplies just for one province? Ridiculous. I'm basically telling my Fellowship to do as much of Round 1 as they can and stop there."}, {"14": "Ephraim Heart said:\t\t\tI cannot even get past Round 2. The catering costs are too high for me. 40k in supplies just for one province? Ridiculous. I'm basically telling my Fellowship to do as much of Round 1 as they can and stop there.\t\tClick to expand...[BR]The first 6-8 provinces are actually very cheap and easy. [BR]The way it is designed now is that this part is like a small incline, and that you can finish those up to 6-star easilly enough. After that, the costs and difficulty rise before you like the freaking Cliffs of Dover."}, {"70": "Yup, my little beta city is happy, my big Winyandor city is a bit screwed haha, from five digits scores to low four digits."}, {"60": "So Beta just got the Moon Bear event. These are the stats at Dwarves level 10 [BR][BR][IMG]https://i.ibb.co/hZScT82/https-en-forum-elvenar-com-index-php-attachments-1597926343054-png-4665.png[/IMG][BR][BR]I dont want to be a downer and the prizes from the chests look like an improvement on the last event at first glance but could this bear not have been helpful to help sort out the tournament situation? Should this be taken as a sign that there wont be any changes? I have noticed @Silmaril has been quiet for a while."}, {"93": "I find it interesting that there are countless \"@Silmaril\"  questions but not a single reply from Silmaril"}, {"88": "Princess Penelope said:\t\t\tI find it interesting that there are countless \"@Silmaril\"  questions but not a single reply from Silmaril\t\tClick to expand...Playing dead since the feedback from us all started..."}, {"32": "Princess Penelope said:\t\t\tI find it interesting that there are countless \"@Silmaril\"  questions but not a single reply from Silmaril\t\tClick to expand...[BR]Because it's a battle you cannot win, and will only end agony, so then it's best to not say anything [smilie--sprite2]"}, {"88": "CrazyWizard said:\t\t\tBecause it's a battle you cannot win, and will only end agony, so then it's best to not say anything [smilie--sprite2]Click to expand...[smilie--sprite8] [smilie--sprite8] [smilie--sprite8] [smilie--sprite8] [smilie--sprite11]"}, {"22": "30158729 said:\t\t\tI dont want to be a downer and the prizes from the chests look like an improvement on the last event at first glance but could this bear not have been helpful to help sort out the tournament situation? Should this be taken as a sign that there wont be any changes?\t\tClick to expand...I doubt that they are going to clip our wings in the tournaments and then decide to immediately increase our firepower again."}]