[{"111": "CrazyWizard said:\t\t\tBecause it's a battle you cannot win, and will only end agony, so then it's best to not say anything [smilie--sprite2]Click to expand...[BR]It’s the same tactic used by the developers."}, {"10": "First of all, I commend the fact we only have one click per province, this is a very welcome improvement. That's where the improvement ends. The new Tournament is just awful, troops are absolutely anhilated, and it doesn't matter how many boost buildings you have in play. Never mind the total lack of getting the chance to make Pet Food in the Magic Academy. ~I'm no good with calculating numbers and percentages etc, all I know is there are very few cities that will be able to keep up with the demand for this tournment...and if you enjoy the Spire as well....forget about it. All games should be a challenge...but this one is ridiculous. Good luck to any FS that acutally get all chests. I come from a FS that achieved them all and then some, every single week, without fail. The same with the Spire, we're usually in the Top 3 every single week..winning most weeks. Inno give on one hand and take away with the other...that's their default position. I would suggest anyone who isn't happy with this new tournament to raise a ticket...not a lot of good it will do, but if we say nothing, nothing is exactly what we'll receive. I'd say those rich in diamonds will be the ones winning here....and that's ok...but at least give the rest of us a fighting chance."}, {"93": "CrazyWizard said:\t\t\tBecause it's a battle you cannot win, and will only end agony, so then it's best to not say anything [smilie--sprite2]Click to expand...Is it worthwhile to even continue playing? It is suppose to be a game and fun. Not a punishment to force you to spend money."}, {"68": "kiltqueen said:\t\t\tFirst of all, I commend the fact we only have one click per province, this is a very welcome improvement. That's where the improvement ends. The new Tournament is just awful, troops are absolutely anhilated, and it doesn't matter how many boost buildings you have in play. Never mind the total lack of getting the chance to make Pet Food in the Magic Academy. ~I'm no good with calculating numbers and percentages etc, all I know is there are very few cities that will be able to keep up with the demand for this tournment...and if you enjoy the Spire as well....forget about it. All games should be a challenge...but this one is ridiculous. Good luck to any FS that acutally get all chests. I come from a FS that achieved them all and then some, every single week, without fail. The same with the Spire, we're usually in the Top 3 every single week..winning most weeks. Inno give on one hand and take away with the other...that's their default position. I would suggest anyone who isn't happy with this new tournament to raise a ticket...not a lot of good it will do, but if we say nothing, nothing is exactly what we'll receive. I'd say those rich in diamonds will be the ones winning here....and that's ok...but at least give the rest of us a fighting chance.\t\tClick to expand...Inno's default position is to give something which has been asked for with one hand but with the other take away twice the given benefit."}, {"99": "Round 3[BR][BR]The enemy squad size percentages changed slightly:[BR]Previously, they increased at 12% per province up to province 9/10. In round 3 they increased at 12.6% up to province 5.They then increased at 8.8% per province up to province 8.Previously, they increased at 5% per province up to province 15/16. In round 3 this was up to province 13.Previously, they increased at 3.6% per province up to province 33. In round 3 this was up to province 30.After that they increased at 1% per province.Enemy squads were still at 150% at province 16 despite this new \"steady\" increase. The base percentage in province 1 was just higher in round 3.Previously, enemy squads were in excess of 200% from province 31. In round 3 this was from province 30.[BR]Apparently, I'm a glutton for punishment and completed 45 provinces again. The catering costs were:[BR]1420k coins - 4k T2 - 2.6k T327k T1 - 7k T2317.4k T1 - 6.6k T2410k T1 - 7.9k T2 - 5.2k T3518.6 T2 - 19k mana6110k supplie - 11k T2 - 22k mana71.3m coins - 12k T2 - 7.8k T381.4m coins - 140k supplies - 8.7k gems919k T1 - 15k T2 - 9.6k T31021k T1 - 16k T2 - 10k T31134k T2 - 11k T31224k T1 - 38k T2132.1m coins - 26k T1 - 13k T31428k T1 - 5.6k orcs - 44k mana15240k supplies - 30k T1 - 15k T31631k T1 - 24k T2 - 16k T317260k supplies - 33k T1 - 17k T31835k T1 - 26k T2 - 17k T31928k T2 - 18k T3 - 58k mana2029k T2 - 19k T3 - 61k mana2140k T1 - 40k T22242k T1 - 32k T2 - 21k T32343k T1 - 33k T2 - 22k T32445k T1 - 23k T3 - 9k orcs2547k T1 - 36k T2 - 23k T32674k T2 - 24k T327400k supplies - 50k T32880k T2 - 26k T329430k supplies - 41k T2 - 27k T3304.4m coins - 56k T1 - 28k T33144k T2 - 29k T3 - 11k orcs32118k T1 - 30k T33360k T3 - 12k orcs3463k T1 - 31k T3 - 100k mana3564k T1 - 98k T236132k T1 - 50k T237104k T2 - 110k mana3853k T2 - 35k T3 - 110k mana39142k T1 - 14k orcs40112k T2 - 15k orcs41MISSED426.1m coins - 58k T2 - 120k mana4378k T1 - 120k T24480k T1 - 61k T2 - 40k T3456.5m coins - 82k T3[BR]It looks like tournament strategies that rely heavily on catering are no longer sustainable.[BR][BR]The legend for the below table is:[BR]MW - MistwalkersLR - Light RangedLM - Light MeleeHR - Heavy RangedHM - Heavy Melee[BR]The troop mix for each province was:[BR]1MW - LR x 42MW x2 - HM x23MW x2 - LM - HM - Mage4LR x 4 - HM5MW - LR - LM - HR x26LR x2 - LM - HM x27MW x2 - LR x2 - Mage8LR x2 - LM x2 - HM9MW x2 - LR - LM - Mage10MW - LR - LM - HR - Mage11LR x3 - HR - Mage12MW x2 - LM x313MW - LR x3 - HR14MW - LR - LM - HM - Mage15MW x2 - LR - HR - HM16LR - LM - HM - Mage17MW x3 - LR - Mage18MW - LR x3 - HM19MW x2 - LR x320MW - LM - HM - Mage21MW - LR - HR x2 - Mage22MW x2 - LR x323MW - LR - LM - HR - Mage24LR x3 - LM x225LR x4 - HM26LR x2 - HR x2 - HM27LR x3 - LM - HM28LR x4 - HM29LR x2 - HM x2 - Mage30LM x2 - HR - HM - Mage31LR x2 - LM x2 - HR32MW - LR x3 - LM33MW - LR x2 - LM - Mage34MW x2 - LR x2 - Mage35MW - LR - LM x2 - Mage36MW - LR - LM x2 - HR37MW - LR x2 - LM x238MW x2 - LR x2 - HM39LR x2 - LM - HM - Mage40LR x2 - HM - Mage x241MISSED42LR x2 - LM - HM x243LM x2 - HM x2 - Mage44LM x2 - HR - Mage x245MW - LR x3 - HM[BR]I didn't record anything for province 41, so the below information is based on the 44 provinces I did capture data on:[BR]Mistwalkers (MW) appeared 26 times; nearly 60% of the time. This was up from the 50% in round 2.Heavy ranged units (HR) appeared 11 times; 25% of the time. This was down from the 50% in round 2.Mage units (M) appeared 20 times; just over 45% of the time. This was up from the 25% in round 2.Reminder: MW, HR and M were not previously part of the Planks Tournament.There were 19 instances where a combo of MW, HR and/or M occurred; just under 45% of the time. This was down from the 50% in round 2.There were 8 instances where 4/5 different enemy unit types showed up in the same line-up; just under 20% of the time. This was down from the 25% in round 2.There were 8 instances where ONLY the usual suspects appeared. This was an ever so slight improvement on their appearance in round 2. As before there were some caveats. Dryads didn't appear once but Ancient Orcs were more frequent than in round 2. \"Usual suspects\" are any Light Ranged, Light Melee and Heavy Melee units but EXCLUDING Mistwalkers. Mistwalkers are not comparable to Dryads and are the single most deadly enemy unit...imho.[BR]When I talk about \"difficulty\" I'm referring to troop loss. Any other definition is meaningless to me, as troop loss is what I need to \"fix\" following the completion of a tournament. Difficulty is, of course, affected by enemy squad size and troop mix plus terrain. In round 3 I found troop loss even more negligible up to province 20. There were some instances of significant troop loss up to province 30 but overall difficulty was down on round 2. Difficulty on provinces up to 40 increased exponentially. With the exception of province 41 the others past province 40 could not be fought and had to be catered. However, in retrospect, considering the losses on province 41 that should really have been catered, too.[BR][BR]All things considered, it appears that difficulty has been adjusted once more mid-tournament."}, {"32": "kiltqueen said:\t\t\tFirst of all, I commend the fact we only have one click per province, this is a very welcome improvement. That's where the improvement ends. The new Tournament is just awful, troops are absolutely anhilated, and it doesn't matter how many boost buildings you have in play. Never mind the total lack of getting the chance to make Pet Food in the Magic Academy. ~I'm no good with calculating numbers and percentages etc, all I know is there are very few cities that will be able to keep up with the demand for this tournment...and if you enjoy the Spire as well....forget about it. All games should be a challenge...but this one is ridiculous. Good luck to any FS that acutally get all chests. I come from a FS that achieved them all and then some, every single week, without fail. The same with the Spire, we're usually in the Top 3 every single week..winning most weeks. Inno give on one hand and take away with the other...that's their default position. I would suggest anyone who isn't happy with this new tournament to raise a ticket...not a lot of good it will do, but if we say nothing, nothing is exactly what we'll receive. I'd say those rich in diamonds will be the ones winning here....and that's ok...but at least give the rest of us a fighting chance.\t\tClick to expand...[BR]Why would those rich in diamonds be the winners here?[BR]Crazy enough I would claim the other way around, thats the crazy part, those who are hurt the most by these changes are often the paying players.[BR]They are competitive enough to be willing to spend the money, but with this change the opposith might happen and it's not unlikely they grab there stuff and move on.[BR][BR]There are plenty of area's where now it's not wise anymore to spend money on:[BR]Premium Expansions - Since they changed the formula numbers it's unknown how much these add and therefore unknown how these will influence the game,Wonderlevels, with this counting it might be wise to be very selective with your wonderd, this makes space less of a premium and it might lead to buying less premium expansionsMagic Academy: since it's much harder and unlikely for all but a select few to get enough relics to keep your academy active 24/7 at level 5 there is no longer a need to spend money here to speed up production.There are more but these are already plenty enough reasons to spend less money on the game, other big spenders might quit because of the inability to compete in the tournaments due to many wonderlevels.[BR][BR]So these changes might hurt elvenar more then just the annoyance, and off course 3 weeks is too little to really see the effect, as people will be waiting hoping agains knowing better of things will change as \"this is a test\"."}, {"22": "CrazyWizard said:\t\t\tThere are more but these are already plenty enough reasons to spend less money on the game, other big spenders might quit because of the inability to compete in the tournaments due to many wonderlevels.\t\tClick to expand...With particular reference to levels 31-35 of AWs. It's difficult to explain how any of these levels for any wonders can be of benefit now. There is someone on our server who has levelled every single AW to 35, presumably by spending big on diamonds (if not pushing). He will no doubt now be absolutely crippled in the tournaments. What would that be... a quarter of a million KPs, just for those levels?"}, {"53": "Lots of fresh and interesting changes have made to the tournament, and the variety and new challenges which these provide are welcomed by me. As others have noted however, we don't have everything well right yet. In particular I'd like to highlight some fairly extreme catering imbalances.[BR][BR]On Felyndral I have an advanced end-game city optimised for ranking as well as tournaments.[BR]On Arendyll and Winyandor I have more casual, but still reasonably well developed cities.[BR]In all three cities I'm currently allocating about 6% of my space to Tier 1 manufactories.[BR]The advanced city is MUCH worse in respect of the production time required for catering resources (by a factor of 3)[BR][BR]Details:[BR][BR]Arendyll: Chapter 10, Tier 1 boost 618%, 94 expansions, 16 wonder levels, 8 fully upgraded T1 manufactories (3x6)[BR]6.1% of my city is tier 1 manufactories[BR]The 9 hour production from each tier 1 manufactory is 3813 (total 3389 per hour)[BR]The tier 1 catering cost on round 1 province 9 is 4700 (1.38 hours of city production)[BR][BR]Felyndral: Chapter 16, Tier 1 boost max, 148 expansions, 705 wonder levels, 8 fully upgraded T1 manufactories (5x5)[BR]5.4% of my city is tier 1 manufactories[BR]The 9 hour production from each tier 1 manufactory is 12384 (total 11008 per hour)[BR]The tier 1 catering cost on round 1 province 9 is 49000 (4.45 hours of city production)[BR][BR]I'd need to allocate proportionally treble the space for manufactories in my advanced city relative to casual cities to have the same catering ability. This would also require a corresponding increase in support buildings such as residences, workshops etc. [BR][BR]This looks completely unbalanced to me. I assume that the catering difference is due primarily to the many ancient wonder levels in my advanced city. The wonder benefit to manufactories (notably via Mountain Halls) is already included in the above figures. Additionally Wonders do save some space by improving the efficiency of certain other buildings (such as residences), but they also take up a lot of space themselves (15-20% in my city) and I can't see an obvious justification for the above discrepancies."}, {"30": "Let me try to provide a viewpoint without getting carried away with the fact that I cannot any longer collect a large number of KPs by just doing the first two rounds for 50 provinces. Over time we have figured out certain strategies to make the best use of the tournament. Now we have to rethink and find different use cases. However, I feel the game designers have overlooked the fact that a strategic player will look at the return on investment and give up fighting beyond a certain point and then rest of the encounters will become not at all useful. Then it is like an exam where you will never be rewarded with an A+ even though there is an A+ rating in the marking scheme.[BR][BR]I have look at some numbers in terms of troop size. I am in chapter 16 with close to 200 wonder levels. Still, the number of units required for the first round of a province is less than 4 times earlier requirement of an encounter of a province. So I can't complain. But I am not sure what will be the case if I reach 400 wonder levels. Furthermore, I have not checked the negotiation cost which I may not do much since I will have time to manual fight. Sorry, if one is only a mobile player. Also in the first encounter (in my case), the enemy troop size is 13% of my troop size. Certainly, it will make things easier for new players to figure it out.[BR][BR]Then there is this pattern of logarithmic like increase in enemy troop size when going through province 1, 2, 3, 4, etc while there is a constant troop size increase of 25% on mine. Furthermore, there is a pattern where 2nd round of 1st province is equivalent to 1st round of 2nd province and so on. In my case, the 1st round of 20th province presented an enemy troop size 158% of my troop size making it almost equivalent to previous 6th round of the 20th province. Meaning any fights beyond this point will make it difficult than before.[BR][BR]Unless the above logarithmic pattern ensures the difficulty stops at a realistic level my above concern stays. I am the 2nd best fighter in our fellowship. Yet, I don't want to throw in my troops to test this beyond this point since it is not worth it. Since I want to make good progress in the spire I don't want to risk major losses."}, {"32": "skelve said:\t\t\tLet me try to provide a viewpoint without getting carried away with the fact that I cannot any longer collect a large number of KPs by just doing the first two rounds for 50 provinces. Over time we have figured out certain strategies to make the best use of the tournament. Now we have to rethink and find different use cases. However, I feel the game designers have overlooked the fact that a strategic player will look at the return on investment and give up fighting beyond a certain point and then rest of the encounters will become not at all useful. Then it is like an exam where you will never be rewarded with an A+ even though there is an A+ rating in the marking scheme.[BR][BR]I have look at some numbers in terms of troop size. I am in chapter 16 with close to 200 wonder levels. Still, the number of units required for the first round of a province is less than 4 times earlier requirement of an encounter of a province. So I can't complain. But I am not sure what will be the case if I reach 400 wonder levels. Furthermore, I have not checked the negotiation cost which I may not do much since I will have time to manual fight. Sorry, if one is only a mobile player. Also in the first encounter (in my case), the enemy troop size is 13% of my troop size. Certainly, it will make things easier for new players to figure it out.[BR][BR]Then there is this pattern of logarithmic like increase in enemy troop size when going through province 1, 2, 3, 4, etc while there is a constant troop size increase of 25% on mine. Furthermore, there is a pattern where 2nd round of 1st province is equivalent to 1st round of 2nd province and so on. In my case, the 1st round of 20th province presented an enemy troop size 158% of my troop size making it almost equivalent to previous 6th round of the 20th province. Meaning any fights beyond this point will make it difficult than before.[BR][BR]Unless the above logarithmic pattern ensures the difficulty stops at a realistic level my above concern stays. I am the 2nd best fighter in our fellowship. Yet, I don't want to throw in my troops to test this beyond this point since it is not worth it. Since I want to make good progress in the spire I don't want to risk major losses.\t\tClick to expand...[BR]I am fine with the loss of many KP, but here you say one of my main gripes.[BR]You said 200 wonderlevels, this means 66% difficulty from the wonderpart of the formula, at 400 it's 133% difficulty[BR]This will mean your base SS (and everything based on that) is 50% bigger, this means your stock of units needs to be 50% higher, the negotiating costs will be aprox higher and your losses in the tournaments will be 50% higher.[BR][BR]The difficulty difference between 2 players at the same stage of the game can be as extreme as 400%, have you ever seen wonder inprove your production of units and goods improve by more than 400%?"}, {"74": "CrazyWizard said:\t\t\tI am fine with the loss of many KP, but here you say one of my main gripes.[BR]You said 200 wonderlevels, this means 66% difficulty from the wonderpart of the formula, at 400 it's 133% difficulty[BR]This will mean your base SS (and everything based on that) is 50% bigger, this means your stock of units needs to be 50% higher, the negotiating costs will be aprox higher and your losses in the tournaments will be 50% higher.[BR][BR]The difficulty difference between 2 players at the same stage of the game can be as extreme as 400%, have you ever seen wonder inprove your production of units and goods improve by more than 400%?\t\tClick to expand...Its not just that but honestly speaking - if levelling up Wonders is going to hurt you then what is the point of winning KP in the first place once you're end game?[BR][BR]Frequently in the past from Dwarves onwards I've used Wonders as a dumping ground for KP when I had no research to do and now I've finished the game and am playing for Tournaments etc its just a game of levelling Wonders - but I have my favourite Wonders like Flying Academy maxed out already.[BR][BR]So I've taken recently to working on wonders for fun that don't really help me, like the Blooming Trader Guild. But the logical thing for me to do now would be to sell off Wonders like that . . . and then do what? I can win KP, but if I have nothing to invest them into without it being counter productive then what is the point of continuing?[BR][BR]Wonders as an almost bottomless distraction were fun but now if they're as bad as optional SS were previously then should I just sit there with thousands of KP in my bar?"}, {"15": "randblade said:\t\t\tIts not just that but honestly speaking - if levelling up Wonders is going to hurt you then what is the point of winning KP in the first place once you're end game?[BR][BR]Frequently in the past from Dwarves onwards I've used Wonders as a dumping ground for KP when I had no research to do and now I've finished the game and am playing for Tournaments etc its just a game of levelling Wonders - but I have my favourite Wonders like Flying Academy maxed out already.[BR][BR]So I've taken recently to working on wonders for fun that don't really help me, like the Blooming Trader Guild. But the logical thing for me to do now would be to sell off Wonders like that . . . and then do what? I can win KP, but if I have nothing to invest them into without it being counter productive then what is the point of continuing?[BR][BR]Wonders as an almost bottomless distraction were fun but now if they're as bad as optional SS were previously then should I just sit there with thousands of KP in my bar?\t\tClick to expand...[BR]This idea that upgrading aws is hurting us (at least after a certain level) is like a thorn in my brain. I have no problem with tournaments being hard and not being able to do more than 20 provinces but this \"fear\" that upgrading aws is gong to make it even harder is ruining the game for me. I haven't upgraded a single one since the news of the new tournament system came out and I already feel less excited to do tournaments. Even if I could still get 200 kps from provinces I wouldn't know what to do with them. The devs took the two most popular activities of the game - tournament and Aws - and wracked them with one swing."}, {"22": "Hekata said:\t\t\tThis idea that upgrading aws is hurting us (at least after a certain level) is like a thorn in my brain. I have no problem with tournaments being hard and not being able to do more than 20 provinces but this \"fear\" that upgrading aws is gong to make it even harder is ruining the game for me. I haven't upgraded a single one since the news of the new tournament system came out and I already feel less excited to do tournaments. Even if I could still get 200 kps from provinces I wouldn't know what to do with them. The devs took the two most popular activities of the game - tournament and Aws - and wracked them with one swing.\t\tClick to expand...I agree completely... as you know.[BR][BR]Finally I played the first round of the tournament in my Live city now. It's tough, sure. I'm going to be rewarded less, sure, but I can live with all of that if I don't have to sit here wondering how much progression of any sort is going to damage my game.[BR][BR]As far as the new mechanics go, I'm just staying within myself and am going to gradually feel it out to find my (current) level. I played through 27 provinces on level 1 and I think that's nicely within my means. I've even been getting on board and doing some manual fights when the troop line up looks tough. @MinMax Gamer I keep meaning to give you data, but every time I open the spreadsheet I play with it for a bit and then decide I still don't know what I'm really doing with it. (It may just be me being thick here). So yeah, I keep just thinking I'll give it another crack next time. The plan for this tournament is to do 26, 25, 24, 23, 22 provinces in the next rounds and then just see where I am, properly take stock of what my losses were. Hopefully not cripple myself first time out.[BR][BR]To stress again, though, I cannot abide the idea that levelling up wonders, taking expansions, opening researches all may make it more difficult than it is now. I also can't abide the idea that I am being summarily punished by the developers just because I have previously decided to build and upgrade a Thrones of the High Men. Lastly, I can't abide the idea that two people at the same stage of development can have tournament squad sizes so wildly different that one is more than double the other."}, {"84": "The demand for coins and supplies is unsustainable if i want to cater tourneys and do the spire. 1.1 million coins and 97K supplies just for one province, even using coin and supply instants i can't keep those amounts up for long."}, {"28": "Ephraim Heart said:\t\t\t...they certainly will never see the Brown Bear ever again...\t\tClick to expand...They will see Brown Bears right in the next event."}, {"78": "Underneath the flimflam, the fact remains that we have bought stuff from you and we are now being told that some of what we invested our time and money in is no longer 'fit for purpose'.[BR][BR]Litigation under the consumer protection laws in many of the countries you serve is a possible route to explore for redress however an apology and compensation via Elvenar itself is a more sensible option for everyone."}, {"32": "randblade said:\t\t\tIts not just that but honestly speaking - if levelling up Wonders is going to hurt you then what is the point of winning KP in the first place once you're end game?[BR][BR]Frequently in the past from Dwarves onwards I've used Wonders as a dumping ground for KP when I had no research to do and now I've finished the game and am playing for Tournaments etc its just a game of levelling Wonders - but I have my favourite Wonders like Flying Academy maxed out already.[BR][BR]So I've taken recently to working on wonders for fun that don't really help me, like the Blooming Trader Guild. But the logical thing for me to do now would be to sell off Wonders like that . . . and then do what? I can win KP, but if I have nothing to invest them into without it being counter productive then what is the point of continuing?[BR][BR]Wonders as an almost bottomless distraction were fun but now if they're as bad as optional SS were previously then should I just sit there with thousands of KP in my bar?\t\tClick to expand...I have pointed this out as well when it was announced.[BR][BR]Part of the fun is finding progression in the game, but where is the progression now?[BR]It's like a deathblow to the game. no reason to spend money anymore[BR][BR]there is also no competition anymore to drive those sales, because there is no longer a point, to play the tournaments well you better quit progress in your game.[BR][BR]Whats next building a tournament account, where you can just kill the tournaments en then push the KP to another account? because hell yeah they are not going into my own., but hey pushing ain't allowed. So even then I am not allowed to play :S[BR][BR]My little spire town already looks like this because  I refuse to place any wonders.[BR][BR][IMG]https://i.ibb.co/W08wMDn/https-en-forum-elvenar-com-index-php-attachments-1597949577534-png-4668.png[/IMG][BR]Guess for some people this is going to become the new norm [smilie--sprite3]"}, {"30": "CrazyWizard said:\t\t\tI am fine with the loss of many KP, but here you say one of my main gripes.[BR]You said 200 wonderlevels, this means 66% difficulty from the wonderpart of the formula, at 400 it's 133% difficulty[BR]This will mean your base SS (and everything based on that) is 50% bigger, this means your stock of units needs to be 50% higher, the negotiating costs will be aprox higher and your losses in the tournaments will be 50% higher.[BR][BR]The difficulty difference between 2 players at the same stage of the game can be as extreme as 400%, have you ever seen wonder inprove your production of units and goods improve by more than 400%?\t\tClick to expand...I have checked this with my 2nd city which has about 180 wonder levels and in chapter 16. Yes, the troop size requirement is about 8% less but the ratio between enemy troop size and mine is the same for both cities. This means my chances of winning is the same if I have that many troops to send in. Therefore, you have a valid point. Can the increase in wonder levels contribute to higher unit production at this rate? Since I have a lot of military wonders the answer is yes for me. My first city product 14% more troops compared to the second city. I don't know how it will work for a player who is more into negotiation."}, {"32": "skelve said:\t\t\tI have checked this with my 2nd city which has about 180 wonder levels and in chapter 16. Yes, the troop size requirement is about 8% less but the ratio between enemy troop size and mine is the same for both cities. This means my chances of winning is the same if I have that many troops to send in. Therefore, you have a valid point. Can the increase in wonder levels contribute to higher unit production at this rate? Since I have a lot of military wonders the answer is yes for me. My first city product 14% more troops compared to the second city. I don't know how it will work for a player who is more into negotiation.Click to expand...This only counts for a certain amount of wonderlevels. once you have maxed out those military wonders in theory you could max out unit production and power with ~ 200 wonderlevels if you target specific wonders after that your unit power and production will no longer rise, while your SS still grows and grows and grows."}, {"112": "Should have read the Beta testing, I had held off investing in the final chapters optional Squad size increase but with the launch of the new Tourney system I finally maxed out the squad size option, only to struggle to complete provinces that were easy in every other tourney. My city is maxed on expansions and has researched and built all the final Chapters technology and I am finding I cant complete a lot of Round 2 encounters now through battle, and that is forcing me to burn far more resources than before through catering. Very disappointing Elvenar, I have used twice the resources to get half as far as I would normally. I can see a lot of people leaving the game if this isn't handled better."}]