[{"100": "I absolutely know my comment would be ignored for Elvaenar team support and developers but:[BR][BR]- My score have dwarfed from being one of the top ranking players in my FS to be a medium not relevant one.[BR][BR]- I just lost 32 squads of LR´s ( from elite archers, dryads and raiders) and 15 squads of HR´s just to barely reach the 16th province in the 3 star round of the plank tournament, and all this to get less than half of what I was achieving in the old tourney system[BR][BR]- I was waiting so much for some good diamond offer so I could buy 3 new premium expansions but NOT NOW, cause if I do that, instead of benefiting me would affect me, and beyond that, you Elvenar devs  would think we are \"enjoying\" your new prank of tournament system.[BR][BR]So very disappointed since I was working hard to reached a decent level in tourneys ( the old tournament system), and now all that means crap and is useless... What kind of company betrayed their most loyal costumers in that manner I wonder?"}, {"80": "Having done 10 chests plus one , so far , I am very disappointed that the rewards for gaining an extra chest are so poor , just one RR and 10 kp instant.  I also think that chest 11 should only require 9k points , not 10k , then all others 1k cheaper.[smilie--sprite3]"}, {"25": "MinMax Gamer said:\t\t\tThey will see Brown Bears right in the next event.\t\tClick to expand...We have a bear in Beta in the fall event.  It is a very distant cousin to the Brown Bear we had in the past.  For Chapter 16 I can receive 2640 tier 5 sentient goods in 24 hours.  I currently make many times that much from a top level, tier 5 boosted ... in 3 hours, not 24 hours. [BR][BR]It looks like a bear.  End of similarity."}, {"28": "Maillie said:\t\t\tWe have a bear in Beta in the fall event.  It is a very distant cousin to the Brown Bear we had in the past.  For Chapter 16 I can receive 2640 tier 5 sentient goods in 24 hours.  I currently make many times that much from a top level, tier 5 boosted ... in 3 hours, not 24 hours.[BR][BR]It looks like a bear.  End of similarity.\t\tClick to expand...Um, you will be able to get the exact 2019 bears in the next event. These would be craftable in the MA, and you can exchange new artifacts into old."}, {"103": "I think the difficulty can be determined based on the first Research of each chapter."}, {"54": "CrazyWizard said:\t\t\tI have pointed this out as well when it was announced.[BR][BR]Part of the fun is finding progression in the game, but where is the progression now?[BR]It's like a deathblow to the game. no reason to spend money anymore[BR][BR]there is also no competition anymore to drive those sales, because there is no longer a point, to play the tournaments well you better quit progress in your game.[BR][BR]Whats next building a tournament account, where you can just kill the tournaments en then push the KP to another account? because hell yeah they are not going into my own., but hey pushing ain't allowed. So even then I am not allowed to play :S[BR][BR]My little spire town already looks like this because  I refuse to place any wonders.[BR][BR]View attachment 4668[BR]Guess for some people this is going to become the new norm [smilie--sprite3]Click to expand...you could put your kp from tournament in the wonders of your competitors, then they get a harder tournament while you don't [smilie--sprite2]"}, {"113": "Hey. I must admit that I haven't taken the time to read through all 16 pages of comments, but most players seem to be complaining...I don't mind most of the changes, in fact I have still managed to do 20 provinces up to and including 4*. Will see later, how I will go with the rest. [BR]I do NOT like the one click provinces! This game is not a race, why would you turn the tourney into one? It also makes it a lot harder to fight the higher provinces, as the troops that you have in stock, must be 4x larger than before, as four fights have now been put into one...hard to do at the end of the tourney![BR][BR]@Silmaril maybe an idea would be to open up more slots in the training areas or let all buildings train at the same time, as has been previously suggested, without raising the time it takes to train troops, but maybe lowering the time required...?[BR]Thanks for taking my suggestion into consideration [smilie--sprite2][BR]Have a lovely day all, and Happy gaming!"}, {"114": "Dicke01 said:\t\t\tHey. I must admit that I haven't taken the time to read through all 16 pages of comments, but most players seem to be complaining...I don't mind most of the changes, in fact I have still managed to do 20 provinces up to and including 4*. Will see later, how I will go with the rest.[BR]I do NOT like the one click provinces! This game is not a race, why would you turn the tourney into one? It also makes it a lot harder to fight the higher provinces, as the troops that you have in stock, must be 4x larger than before, as four fights have now been put into one...hard to do at the end of the tourney![BR][BR]@Silmaril maybe an idea would be to open up more slots in the training areas or let all buildings train at the same time, as has been previously suggested, without raising the time it takes to train troops, but maybe lowering the time required...?[BR]Thanks for taking my suggestion into consideration [smilie--sprite2][BR]Have a lovely day all, and Happy gaming!\t\tClick to expand...So the quote 'survival of the fittest', does not apply[BR]Conform [BR]Everyone gets a participation prize[BR]Boring[BR]Just like life[BR]This is where we escape ?[BR]I grew up where you have to work to get food[BR]I don't want to live in a country that panders to the unachievable nor do I want to play in a game that does the same thing[BR]Grrrrrr"}, {"22": "Brienne said:\t\t\tHaving done 10 chests plus one , so far , I am very disappointed that the rewards for gaining an extra chest are so poor , just one RR and 10 kp instant. I also think that chest 11 should only require 9k points , not 10k , then all others 1k cheaper.[smilie--sprite3]Click to expand...The extra chests are supposed to not detract from the idea that 10 chests stays as the main pinnacle and goal for fellowships. They added the extra chests purely for those teams who wish to compete for records and against themselves, so now it will record a higher number. The prizes in those chests are just nominal and I'm in support of that. No one wants the awesome prizes to be in the 19th chest and then have fellowships trying to force their fellows to do way more than they can."}, {"24": "CrazyWizard said:\t\t\tI do not know how much you did 2 years ago, but when you consider that 2 years ago there was no fire bird, no brown bears, no combat buildings (outside a one off event) and no massive bunch of time boosters from the spire or crafting as both did not exist even if you could still do a little more, it's still a huge downgrade from 2 years ago, as you now need all that just to perform a little bit better.\t\tClick to expand...[BR]That is exactly what I meant, they have been giving new goodies that make tourneys easier for the last 2 years and now they make tourneys harder to catch up with all the goodies. Typical Inno fashion as always. Boost the hell out of something and then burning it down to the ground instead of gradual balancing. But anyway."}, {"21": "Thanks for your feedback everyone. We're still actively reading along, and have spotted the following points we'd like to address in some more detail, listed below in no particular order:[BR]Random enemy units can be (too) challenging to beat, and/or cause too many losses. - We have already taken some steps to make the enemy unit selection less than fully random, meaning that every Tournament type comes with a focus on one or more enemy unit types. For the current Planks Tournament, that is a \"strong focus\" on Light Ranged enemies. Using the combat pentagon, we can see that it's typically beneficial to use Heavy Ranged or Light Melee units to defeat the Light Ranged units in the Tournament provinces. Another thing we should state explicitly, is that the battles in the old Tournaments were skewed in their balancing, which was a problem on our part. It was possible to fight through the Tournaments with (very) minimal, or in some cases even no losses. In the new Tournaments, we aim to balance them more fairly, especially in comparison with catering: We want to make catering a more viable option to participate in the Tournaments. We've made adjustments in both ways: Battle will - especially on higher Provinces - result in more losses, but we've also made catering cheaper (also see the next bullet point below).[BR][BR]\"Catering costs got much more expensive!\" - Generally speaking, this is untrue. However, we can see why it might feel like that, especially in later Provinces. Please remember that we drastically changed how the difficulty is distributed over the Tournaments with these changes (see this post on the Beta forums, or check our video for more information). Not only the province level, but also the province number is relevant in that calculation now. Especially if you're doing a lot of Tournament provinces (even on level 1), you will see the costs increase in a different distribution than you would have seen in the old Tournaments. However, that doesn't mean that all catering is more expensive - in fact, when we accumulated all the costs for the previous 4 Encounters into 1 big Encounter, we halved the outcome we got from that for each Province. That said, we did add more resources to the Tournaments that can be asked for: Coins, Supplies, Mana, and Orcs. While many players may have large amounts of Goods, that may not necessarily be the same for these resources, and that could make it feel more expensive, even though it factually isn't. To compromise on this, we have already lowered the chances for these resources to appear as cost requirements for catering a Tournament Province. This change was made before the start of the first new Tournament on Elvenar International. And, in addition to that, the very first Tournament Provinces are easier and cheaper to complete than the easiest Provinces in the old Tournaments.[BR][BR]Uncertainty if Squad Size Upgrades should be completed. - From our point of view: yes. With the Tournament improvements, we took away the one negative factor regarding optional Squad Size Upgrade technologies, namely that they made Tournaments harder. Optional technologies have no influence on the new Tournaments whatsoever anymore and, therefore, there are no downsides to unlocking these technologies. It is, of course, up to you if and when you would like to do so.[BR][BR]Uncertainty if Ancient Wonders make the Tournaments significantly more difficult. - From our point of view, they do not. Therefore, it should not be necessary to remove any Ancient Wonder nor to cease upgrading any existing ones further. While they are part of the costs calculations, the increase of costs caused by more or higher-leveled Ancient Wonders pales in comparison with the benefits the Ancient Wonders give. And because of that, the nett result is still a (very) positive one.[BR][BR]Questions on why (Premium) Expansions are involved in the cost calculations. - The calculations for the costs consist of many factors, of which the number of places Expansions is indeed one. With our formula, we aim to create a fair playing field, and to scale the Tournaments towards player progression, so that newer players can also participate in the Tournaments in a meaningful way. We'd like to state explicitly that each individual factor, like the number of Expansions placed, is just a small part. Premium Expansions are also (significantly) less impactful in those calculations than non-Premium ones, and their impact in general has already been decreased since the first Beta launch of the new Tournaments. You might wonder why especially Premium Expansions are included in the calculations at all, and the answer to that is simple: While we want to make sure that Premium gives an advantage, we must also balance it in a way that still ensures a fair playing field in general, for all players - those who opt to pay for something, as well as those who don't. And, in similar fashion to the Ancient Wonders, the benefits that additional Expansions (Premium or not) give, are still much greater than what any additional cost in the Tournament would be, because the more space you have available, the more and the larger buildings you can place in your city, which will produce more resources and provide other advantages. Again, netting in a positive result for you as a player.[BR][BR]Confusion on why we're testing the changes on Elvenar International (EN) and not on Beta. - We're doing both. On Beta we started testing the new Tournaments in July, and while this started mostly as a technical test, the feedback we receive there is also very important to us. You can read up on the changes we've made before the Tournaments came to EN in our announcement. Why would we test on EN at all? Simply because we are confident that, technically, the Tournaments are doing well, and we need to get more feedback and data that Beta simply cannot offer us. Therefore, we have extended the regular roll-out of new features a bit more, and included EN in that process, before activating it on all different versions at the same time. We will still wait several weeks before activating it on any further language versions to be able to process your feedback, as well as the data we're collecting on how the feature is used and if our balancing expectations match reality. It's possible that we'll still make some tweaks before further releasing the feature, and we also still have some small quality of life changes we'd like to make, to make playing the Tournaments more convenient and enjoyable. However, we cannot guarantee any changes right now, as we're still analyzing and processing feedback and data before making decisions, and we will be doing that for at least a few more weeks. We have also seen some suggestions on copying or cloning our Live worlds so that these copies could be used to try the feature instead. Unfortunately, this is not a viable option for us: Not only is it technically complex to set up, it would also not give us the information we are looking for, as we'd have fewer people playing the feature (not everyone will additionally play on a copy of their account), and player behavior would be very different on such a world, too. Example: Spending resources is much less of a concern on a copy of your account, and while it could make for a nice technical test, we are mostly looking for real player behavior with the feature right now, because the technical part is already doing well.[BR]We hope that this will give some further insights and clarifications on the topics that are being discussed at the moment. Is there anything we've missed in the discussion so far? And of course please keep further feedback coming! As also stated above, we'll continue to monitor the Tournaments closely - both the feedback we receive from you, our community, as well as the data we have. Combining this, we'll be tweaking the Tournaments if and where necessary before releasing them to further versions. [smilie--sprite1]"}, {"22": "Thanks for the detailed reply, @Muf-Muf. It is, however, largely the same things that Marindor was saying when the new tournaments were first launched on Beta and some of these things are no more true now than they were then. I will let some of the people who understand the numbers fully reply and say why these AWs and expansions do still make a big difference and how there is now a massive displacement, person to person, regarding tournament squad size. Whilst some things are somewhat unconfirmed, I get the feeling that @MinMax Gamer has a better understanding, by this point, of the formula that is being used and how it affects gameplay, than the Inno devs do.[BR][BR]For me, I will just pick on the part that I feel the most passionate about:[BR][BR]Muf-Muf said:Uncertainty if Ancient Wonders make the Tournaments significantly more difficult. - From our point of view, they do not. Therefore, it should not be necessary to remove any Ancient Wonder nor to cease upgrading any existing ones further. While they are part of the costs calculations, the increase of costs caused by more or higher-leveled Ancient Wonders pales in comparison with the benefits the Ancient Wonders give. And because of that, the nett result is still a (very) positive one.\t\tClick to expand...This is almost the exact same quote from a month ago and yet we have been repeatedly ignored in responding on how flawed this idea is. Yes, I have no doubt that upgrading a Sanctuary or a Flying Academy will increase a player's fighting power. I can also accept the cumulative benefit of the AWs that indirectly help, by increasing a city's power (Mountain Halls and Golden Abyss, to name just a couple.) However there are certain other Ancient Wonders that have no influence on tournaments (i.e. Thrones of the High Men and Vortex of Storage). These will absolutely do nothing now except hurt performance and yet you have still said there should be no need to delete an AW. There are also several more \"fringe\" wonders that I would have serious doubts about their ability to help now (i.e. Enar's Embassy, Blooming Trader Guild). The fact remains that if you blanket all AWs with the same formula then there are some that will become nothing but an anvil around people's necks until they are deleted.[BR][BR]There's a second element to this too, which I don't think has ever been addressed - AW levels 31-35. At these top end levels all the AWs have had their most useful power removed, so these levels too, will surely weigh people down, no matter what the wonder. Many people have accepted the reduced benefit of them anyway, and they have worked on levelling them (@ 2000KP+ per wonder, per level) just for the sake of having something else to do, previously safely in the knowledge them levelling them up at least does no harm. Do you really think these levels should be treated the same as the first 30?[BR][BR]Muf-Muf said:\t\t\tThat said, we did add more resources to the Tournaments that can be asked for: Coins, Supplies, Mana, and Orcs. While many players may have large amounts of Goods, that may not necessarily be the same for these resources, and that could make it feel more expensive, even though it factually isn't.\t\tClick to expand...What is your definition of expense? It's a measure of how freely available something is and how much of it needs to be used. It is driven by the situation in front of people. To this end a cost of 5,000 orcs is probably more \"expensive\" than 250,000 T3 goods, to many people. I will also add that Marindor already admitted that catering is now more expensive than it was before the change and that it is now only cheaper if you compare it as a ratio to the increased cost of fighting.[BR][BR]And finally...[BR][BR]Muf-Muf said:\t\t\tUsing the combat pentagon, we can see that it's typically beneficial to use Heavy Ranged or Light Melee units to defeat the Light Ranged units in the Tournament provinces.\t\tClick to expand...There's a \"combat pentagon\"? [smilie--sprite8]"}, {"99": "@Silmaril[BR]@Muf-Muf[BR][BR]Re your point about the randomness of enemy units, in my round 3:[BR]Mistwalkers (MW) appeared nearly 60% of the time. Heavy ranged units (HR) appeared 25% of the time. Mage units (M) appeared just over 45% of the time. Reminder: MW, HR and M were not previously part of the Planks Tournament.Note: Mistwalkers are not comparable to Dryads and are the single most deadly enemy unit.A combo of MW, HR and/or M occurred just under 45% of the time. 4/5 different enemy unit types showed up in the same line-up just under 20% of the time. Fighting these without losing or, at the very least, incurring HEAVY casualties was impossible.ONLY the usual suspects appeared just over 20% of the time. There were some caveats. Dryads didn't appear once. \"Usual suspects\" are any Light Ranged, Light Melee and Heavy Melee units but EXCLUDING Mistwalkers. So, yes, the randomness is completely out of control. There may be a focus on Light Ranged but if that includes Mistwalkers along with Heavy Melee and/or Heavy Ranged and/or Mage and/or Ancient Orc units the difficulty of that battle just increases exponentially. Also, facing Mistwalkers (the single most deadly enemy unit) and Ancient Orcs (the deadliest Light Melee enemy unit) in the same battle is completely ridiculous from a difficulty point of view.[BR][BR]Re your point about catering costs being too expensive, in my round 3 the catering costs through to province 20 were:[BR]5,220,000 coins750,000 supplies281,400 T1277,100 T2169,900 T35,600 orcs[BR]My resource limits/productions are:[BR]Coin limit: 22mSupplies limit: 2.2mT1 production/day: c. 240kT2 production/day: c. 180kT3 production/day: c. 220kOrc production/day: c. 5800[BR]So, in just ONE round I needed:[BR]Nearly 25% of my max coin supplyNearly 35% of my max supplies supplyNearly 120% of my daily T1 productionNearly 155% of my daily T2 productionNearly 80% of my daily T3 productionNearly 100% of my daily orc production[BR]However, I have 12 each of T1, T2 and T3 manufactories. I understand that the average is 6 of each; so adjusting for that, the percentages for someone with only 6 of each manufactory would be:[BR]Nearly 240% of their daily T1 productionNearly 310% of their daily T2 productionNearly 160% of their daily T3 production [BR]However, that also assumes that they're running a level 23 Mountain Halls like I do. How many people are running around with a level 23 Mountain Halls in chapter 12? So, if those are the percentages for just ONE round up to province 20 consider the cost of SIX rounds up to province 20. Even running Magical Manufacturing 24/7 players wouldn't make enough just to cover the cost of tournaments; never mind upgrade costs, research costs, spire costs, etc.[BR][BR]Re your point about AWs making tournaments more difficult, you're saying that the benefits they provide outweigh their contribution to the cost calculation. So, how do you account for the anecdotal information provided in this thread and amongst FSs? I have 372 AW levels and in just round 1 I lost over 300 squads getting to province 45. The rounds seem to be of equal difficulty now, so over 6 rounds I'd lose 1,800 squads. My AWs do not allow me to replace 1,800 squads in just one week and I'm running all available military AWs. What about someone that's not running any military AWs? They would not be getting any tournament benefit but would be similarly punished. Far Reach and a high-ranking player in my FS have reported similar stories re catering costs on their different cities. Their cities with fewer AW levels are getting significantly smaller catering costs than their main cities with many AW levels. My guy is reporting a 60% reduction on their smaller (re AW levels) city. No collection of AWs is going to make up for that kind of increase in catering costs.[BR][BR]So, what's the point in doing well in a tournament today to earn rewards that, when used, will make my tournament tomorrow harder, which will eventually lead to my earning less rewards? I upgrade all my AWs to max and all of a sudden my max potential in tournaments EACH week is vastly reduced. I'm no longer regularly in the top 10. I can't make up for any shortfall in my FS due to holidays or leavers. Why does making my city better, re AWs AND research, make my tournaments worse?"}, {"22": "Silent Tempest said:\t\t\tHowever, I have 12 each of T1, T2 and T3 manufactories.\t\tClick to expand...Wow, that's a lot!"}, {"32": "Muf-Muf said:\t\t\tThanks for your feedback everyone. We're still actively reading along, and have spotted the following points we'd like to address in some more detail, listed below in no particular order:[BR]Uncertainty if Ancient Wonders make the Tournaments significantly more difficult. - From our point of view, they do not. Therefore, it should not be necessary to remove any Ancient Wonder nor to cease upgrading any existing ones further. While they are part of the costs calculations, the increase of costs caused by more or higher-leveled Ancient Wonders pales in comparison with the benefits the Ancient Wonders give. And because of that, the nett result is still a (very) positive one.Click to expand...[BR]Thanks for your response, but from our point of vieuw they do. we have detailed plenty of ways in which we think they do.[BR]I think the minds of the most active playergroup who is uniformly not agreeeing with your statement is more \"valuable\" then the statements of a casual playing development team who never plays tournaments like we do.[BR][BR]It's not that we do not have years of top level tournament experience or so. unlike some others.[BR]From our point of vieuw the best way is to nuke your town and concentrate on a handfull of wonders once you maxed those out, you should no longer progress. the potential gains simply do not benefit the losses.[BR][BR]Tournaments are for many end game players the reason to keep playing, waiting for a new chapter, waiting to spend money once again."}, {"60": "@Muf-Muf Have you made changes to the randomness since the tournament started? I came up against this. With a UUU and 2 ELR buildings my troops were decimated. This troop combination should never occur as its simply too difficult. With 135% health and 214% attack compared to the regular stats of my light ranged, they dont come close to winning with manual fighting. This was the first round of province 16.[BR][BR][IMG]https://i.ibb.co/PMPmDNL/https-en-forum-elvenar-com-index-php-attachments-1597833701711-png-4650.png[/IMG][BR][BR]Worth noting my squad size is 825 so it costs 15 squads to lose this fight."}, {"24": "Silent Tempest said:4/5 different enemy unit types showed up in the same line-up just under 20% of the time. Fighting these without losing or, at the very least, incurring HEAVY casualties was impossible.Click to expand...[BR]One thing you may have missed in the above statement: This is not an accident, this is intentional. They do NOT want it to be possible to play through tournaments on low/no losses. [BR][BR]And btw. I do agree. It should not be possible and especially it should not be easy (which it was)."}, {"60": "@Gargon667 It was easy because people managed to get booster buildings. Was there anything wrong with the old difficulty if you were to remove the boosts? Surely that would be a better and simpler change than this disaster if you were intent on crippling peoples performances."}, {"89": "Gargon667 said:\t\t\tOne thing you may have missed in the above statement: This is not an accident, this is intentional. They do NOT want it to be possible to play through tournaments on low/no losses.[BR][BR]And btw. I do agree. It should not be possible and especially it should not be easy (which it was).\t\tClick to expand...[BR]It's one thing to have losses, it's another thing to be ripped into single pieces by loosing troops worth of one or multiple days training that early. But that's not the only issue..[BR][BR]While i agree that there should be an increase of difficulty, i'm getting not as near as far as i could without any boosts before (besides AWs) and now i barely get that far with 50% additional atk-dmg while having much higher losses / costs.[BR][BR]I understand that there may've been an issue with ppl \"farming\" excessive amounts of KPs in tourneys, but the current action doesn't justify to punish a major part of tourney-players because of the actions of a few excessive ones. I would argument that any reward above 20 is not even closely worth the investment. Everything you have to throw in to get further will only provide a hand full of additional provinces (at best).[BR][BR]Personal rewards in tourneys got from \"very attractive\" to \"not worth it\"."}, {"83": "Princess Penelope said:\t\t\twell said! and Inno can forget about me spending a cent again till they fix this rubbish the force on us. that is if i do not find another non Inno game to play first and leave Elvenar.\t\tClick to expand...[BR]This is the only way we can persuade INNO to stop this ridiculous beta-2 test.  Can you imagine it?  They already tested it in Beta, and the players there hated it.  So we get to test it again.  Why?  So we can hate it too?  Of course we hate it.  Insanity is doing the same thing over and over and expecting a different result.  But INNO is probably not insane.  They are just greedy.[BR][BR]Anyone who is even thinking about buying diamonds, please don't do it until INNO fixes the tournament they so badly damaged.  If they do not fix it, I will be leaving the game for something much more fun and having nothing more to do with INNO ever."}]