[{"90": "To sum the gist of your points @Muf-Muf, you just don't want anyone to have an advantage. Isn't that right? Because having an advantage is bad am I right? Because it's unfair isn't it? This is a casual game! Of course! There's no need for a competitive advantage. [BR][BR]So why don't you do away with the Tournament altogether? [BR][BR]Why give us the option of working together in a Fellowship? Because that's an advantage in itself isn't it? Cause then we can trade resources regardless of the trader rating, get help for Ancient Wonders, communicate amongst ourselves away from these forums and your forum moderation... Won't you agree that a Fellowship is an advantage towards players? Where the more advanced cities can basically carry the Tournament simply because they can produce more, train more units, have more upgrades, have more provinces open? Isn't that an advantage?"}, {"83": "Alcaro said:\t\t\tI declined last three offers of double diamonds. Not a single cent from me, not until Elvenar becomes AGAIN a player-friendly game.[BR]And if this doesn't matter, there are always places where reviews can be placed. Beware Inno, do not bite the hand that's feeding you.\t\tClick to expand...[BR]Good for you!  And a good example for everyone to follow.  Don't buy any diamonds until INNO fixes what they broke."}, {"24": "Big scores are still possible if one tries hard enough, but it should not be the standard to score big (it wouldn´t be big after all if it was standard). I for one am OK doing more than 10k points on a special occasion and otherwise just do a smaller tourneys. I am even happy that finally the number of explored provinces is not the sole deciding factor on how many tourney points you get. That was quite ridiculous.[BR][BR]I applaud high difficulty in the tourneys, because I like challenges. The old tourney was an exercise of mind-numbing brainless clicking. I am happy for it to be gone. I have fought 50 provinces 6 times this week. Not a single fight was impossible to win, but I decided to cater maybe 5 or so of them, because I would have had high losses in a fight, I would still have one them for sure, but I didn´t feel like losing 50-100k troops in a winning fight. And the bigger overall loss of units means I will not intend to do the same every week. Which is a good thing. It means more chances for other people to make it into the Top10 for example.[BR][BR]I do not think that tourneys will cease to be an integral part of playing, but yes, there will be fewer rewards for everybody except the lowest tier players (which probably are most in number). I will be in the group of the hardest hit, but if I get a more fun tourney I am all fine with it. And I have to say I have had much more fun this week than I had in a long time.[BR][BR]Everybody here complains about how expansions make it harder and how premium expansions make it harder and how research makes it harder and how AW levels make it harder. But seriously what do you want tourney difficulty to be based on??? Some progress factors have to make the tourney harder, otherwise tourneys would be complete nonsense![BR][BR]So I find the choice Inno made rather logical:[BR]1. Research techs: the more you progress in the tech tree the harder it should be (supposedly you get techs that improve your city, not like chapter 16 but that´s a different discussion)[BR]2a. Expansions: More expansions means you have more space to produce goods/troops so yes tourneys should get harder, too[BR]2b. Premium expansions: I do not want a pay-to-win game, so yes also Premium expansion should be \"taxed\", but of course less so than regular ones, otherwise they would be pointless.[BR]3. AW levels: Here I am not completely on board, because of all the useless AWs out there. Strong AWs sure can be \"taxed\" as they make tourneys much easier, but all the useless ones, are punishment enough for people that build them lol, no need for extra punishment on top of it.[BR][BR]So the factors they chose make mostly sense! What better ones do you propose if you dislike the above?[BR][BR]I really have only one big issue with this system: The formula is multiplicative, which makes no sense at all.[BR][BR]It means that towns at the end of the game (high expansions and tech count) are punished much harder for AW levels than small towns are. Or looking at it from the other direction, if you level up your AWs quickly, you are much harder hit for continuing research than someone with low AW levels. This discrepancy is what bothers me and it is what apparently none of the Forum mods here understand. I would assume the devs should, but one cannot be sure...[BR]The effect of AW levels alone is probably small enough for it to be overall beneficial to upgrade AWs, but in addition to its own cost comes the bigger impact of expansions (both regular and premium) as well as the research tech number when the AW number is high.[BR][BR]Exponential growth is a bad idea!"}, {"24": "30158729 said:@Gargon667 It was easy because people managed to get booster buildings. Was there anything wrong with the old difficulty if you were to remove the boosts? Surely that would be a better and simpler change than this disaster if you were intent on crippling peoples performances.\t\tClick to expand...[BR]I surely would not prefer the silly old tourney without booster buildings, no! I rather have boosters and new tourneys any day.[BR][BR]How would making the old and crappy system worse make anything better?"}, {"26": "Muf-Muf said:\t\t\tWith our formula, we aim to create a fair playing field, and to scale the Tournaments towards player progression, so that newer players can also participate in the Tournaments in a meaningful way.\t\tClick to expand...What is your definition of fairness? The formula you are using is multiplicative, so what's exactly fair that with each completed research and each placed expansion the benefit of ancient wonders become smaller? Or that with each added AW level you are punished more for the space you have? I'm sorry, but in my opinion this is the exact opposite of fairness. Do you seriously find it fair that with each completed chapter and each expansion placed even those AWs that are still beneficial would be loosing their value? Despite of what you are claiming some of them already hurting your tournament performance and with the formula you came up with it would become only worse in the future. It seems to me that your idea of fairness is some messed up socialist junk, and what you are actually trying to do is make everyone equal, so no matter how much work you put into your city you would perform relatively the same as someone who just recently started playing. If that's what you are trying to achieve - just say so, but please don't pretend that this is an improvement and that this should make things fair to everyone."}, {"14": "@Muf-Muf[BR]Repeating the same old tired stance from the Beta does not suddenly make it true. Your statements are full of falsehoods and half-truths, as is already shown by several other replies. Many detailed replies in the Beta threads already called Inno out on this, and they were flat out ignored[BR][BR]So you can take this back to your developers and managers; I sincerely hope Inno suffers some heavy financial repercussion to their bottom line from the blatant disrespect you all show to your customers with this change."}, {"26": "Gargon667 said:\t\t\tEverybody here complains about how expansions make it harder and how premium expansions make it harder and how research makes it harder and how AW levels make it harder. But seriously what do you want tourney difficulty to be based on??? Some progress factors have to make the tourney harder, otherwise tourneys would be complete nonsense![BR][BR]So I find the choice Inno made rather logical:[BR]1. Research techs: the more you progress in the tech tree the harder it should be (supposedly you get techs that improve your city, not like chapter 16 but that´s a different discussion)[BR]2a. Expansions: More expansions means you have more space to produce goods/troops so yes tourneys should get harder, too[BR]2b. Premium expansions: I do not want a pay-to-win game, so yes also Premium expansion should be \"taxed\", but of course less so than regular ones, otherwise they would be pointless.[BR]3. AW levels: Here I am not completely on board, because of all the useless AWs out there. Strong AWs sure can be \"taxed\" as they make tourneys much easier, but all the useless ones, are punishment enough for people that build them lol, no need for extra punishment on top of it.[BR][BR]So the factors they chose make mostly sense! What better ones do you propose if you dislike the above?\t\tClick to expand...Aside from questionable (at least from the marketing standpoint) decision to punish for the premium expansions, I too find the factors they chose to base difficulty on to be ok (although AWs definitely should be weighted differently, and with how much work they take to upgrade I'm not sure that they should be included at all. Ideally I would tie the difficulty solely to the research progression like it was done before). My main problem is that they multiply influence from all these factors, so the more you progress the less benefit you get from everything. And on top of that there shouldn't be 400% difference in squad size between all AWs, all premium expansions and no AWs no AWs no premium expansions, even that much extra space and all the AWs don't make up for such a drastic difference in the tournament requirements. So I'm not against the idea of balancing per se, I have issues with the chosen implementation of this idea."}, {"74": "@Muf-Muf the point about Ancient Wonders has been made time and again by players: certain Ancient Wonders help but most of them do not and and counting them towards your formula makes them counter-productive. Its like optional squad sizes all over again - the smart thing to do is not to do them. Simply repeating time and again about their benefits doesn't actually give them any benefits.[BR][BR]I do the Tournament each week and do so by fighting so certain Ancient Wonders, most notably the Flying Academy, absolutely do help. But most of them do not, they are fluff that I'd be better off nuking. If you really think they're giving an advantage can you please address what advantage these give?[BR][BR]Tome of Secrets: My first Wonder, I keep this as a legacy just because I created it years ago. It gives me 2kp per day and some supplies once every SIX DAYS as that's how long my Scouting takes now. What possible advantage do you think this is conferring? I keep it as its a legacy part of my city but I'd be better off selling it.[BR][BR]Blooming Trader Guild: Gives a marginal advantage in guest races of which I don't have one at the minute, does absolutely nothing for the Tournament.[BR][BR]Dwarven Bulwark: Between my SSS and Academies I have 24 hours of training size without this. The few Swords I get per day (my least favoured unit) are not meaningful. What advantage does this give?[BR][BR]Or how about we take the new chapter's two newest Wonders? Spire Library and Tournament Arena. What advantage do they give?[BR][BR]Please don't keep saying \"they give an advantage\" without actually addressing what. They don't, we know that. [BR][BR]Finally you never even attempted to address why the ratio of enemy squads to our squads is so broken? To have battles where the enemy has well over double the starting troops as we do, meaning that some battles can't be won even with unlimited troops. What are we meant to do about that? Please restore a cap to the ratio of enemy troops to our troops - even then if our troops are increasing so it becomes more expensive, it is the escalating ratio that is breaking the combat. Please can you answer this, or are you intending that we can't win battles so can go no further no matter how much we train and spend?"}, {"99": "Gargon667 said:\t\t\tOne thing you may have missed in the above statement: This is not an accident, this is intentional. They do NOT want it to be possible to play through tournaments on low/no losses.[BR][BR]And btw. I do agree. It should not be possible and especially it should not be easy (which it was).\t\tClick to expand...[BR]But to make 1 in every 5 provinces impossible to fight? That forces players to cater but the inherent difficulty would make the catering cost huge. Not exactly much choice there. I don't mind an increase in difficulty but they've bumped difficulty to the extreme end of the spectrum with enemy combinations of 4 or 5 unique troop types. Never mind the Mistwalker AND Ancient Orc combos for the rest of the provinces, which alone wreak havoc.[BR][BR]Gargon667 said:\t\t\tBig scores are still possible if one tries hard enough, but it should not be the standard to score big (it wouldn´t be big after all if it was standard). I for one am OK doing more than 10k points on a special occasion and otherwise just do a smaller tourneys. I am even happy that finally the number of explored provinces is not the sole deciding factor on how many tourney points you get. That was quite ridiculous.[BR][BR]I applaud high difficulty in the tourneys, because I like challenges. The old tourney was an exercise of mind-numbing brainless clicking. I am happy for it to be gone. I have fought 50 provinces 6 times this week. Not a single fight was impossible to win, but I decided to cater maybe 5 or so of them, because I would have had high losses in a fight, I would still have one them for sure, but I didn´t feel like losing 50-100k troops in a winning fight. And the bigger overall loss of units means I will not intend to do the same every week. Which is a good thing. It means more chances for other people to make it into the Top10 for example.[BR][BR]I do not think that tourneys will cease to be an integral part of playing, but yes, there will be fewer rewards for everybody except the lowest tier players (which probably are most in number). I will be in the group of the hardest hit, but if I get a more fun tourney I am all fine with it. And I have to say I have had much more fun this week than I had in a long time.[BR][BR]Everybody here complains about how expansions make it harder and how premium expansions make it harder and how research makes it harder and how AW levels make it harder. But seriously what do you want tourney difficulty to be based on??? Some progress factors have to make the tourney harder, otherwise tourneys would be complete nonsense![BR][BR]So I find the choice Inno made rather logical:[BR]1. Research techs: the more you progress in the tech tree the harder it should be (supposedly you get techs that improve your city, not like chapter 16 but that´s a different discussion)[BR]2a. Expansions: More expansions means you have more space to produce goods/troops so yes tourneys should get harder, too[BR]2b. Premium expansions: I do not want a pay-to-win game, so yes also Premium expansion should be \"taxed\", but of course less so than regular ones, otherwise they would be pointless.[BR]3. AW levels: Here I am not completely on board, because of all the useless AWs out there. Strong AWs sure can be \"taxed\" as they make tourneys much easier, but all the useless ones, are punishment enough for people that build them lol, no need for extra punishment on top of it.[BR][BR]So the factors they chose make mostly sense! What better ones do you propose if you dislike the above?[BR][BR]I really have only one big issue with this system: The formula is multiplicative, which makes no sense at all.[BR][BR]It means that towns at the end of the game (high expansions and tech count) are punished much harder for AW levels than small towns are. Or looking at it from the other direction, if you level up your AWs quickly, you are much harder hit for continuing research than someone with low AW levels. This discrepancy is what bothers me and it is what apparently none of the Forum mods here understand. I would assume the devs should, but one cannot be sure...[BR]The effect of AW levels alone is probably small enough for it to be overall beneficial to upgrade AWs, but in addition to its own cost comes the bigger impact of expansions (both regular and premium) as well as the research tech number when the AW number is high.[BR][BR]Exponential growth is a bad idea!\t\tClick to expand...[BR]*cough*[BR][BR]Didn't you say that you placed a combination of 10 ELRs/MMs/UUUs? With that kind of boost I'd also hope that no fight was impossible [smilie--sprite2][BR][BR]@Silmaril @Muf-Muf An alternative proposal: Following on from @Gargon667 's issue with the multiplicative nature of the formula how about reducing the overall tournament squad sizes for each province? The issues are the size of the troop losses and the linked catering costs. If these weren't so punitively high the other difficulty factors wouldn't be so off-putting. My general squad size is 1584 but my squad size for province 10 was 6451, just over 4 times my general squad size, so I had 20 squads to lose in one battle. In province 20 my squad size was 11826, just under 7.5 times my general squad size, so I had 37.5 squads to lose in one battle. On their own they don't sound like much but cumulatively over 20 provinces AND 6 rounds the numbers add up. But even a 50% reduction in tournament squad size wouldn't be good enough. You'd need to look at a reduction in excess of at least 60%."}, {"74": "Oh and @Muf-Muf about Premium Expansions - I have space in my city that is literally blank as I'm not doing a Guest Race at the minute. The premium expansions are for that and the space is going idle. So if you think having extra blank space is productive I'd like to know why you think that?[BR][BR]For training troops you can only build the barracks and the armories etc and once you've got a long enough training queue then adding more armories doesn't give you any more troops. There is little productive to do with the space. I'd be better off without my premium expansions whatever you think of it so I hope you're prepared to refund my premium expansions?"}, {"89": "Okay, i try to analyze that whole thing without getting emotional this time...[BR][BR]First, let's get to @Muf-Muf points:[BR][BR]Random enemy units can be (too) challenging to beat, and/or cause too many losses. - I see that there can be an issue with loosing close to no units at all, but this change affects all parts of earlier tourney-preperation tactics.[BR][BR]Before i had to prepare myself with mostly 1-2 main units and a few additional types - no matter how far i wanted to get, i could prepare for it. It was worth it to know your facts about different tourneys. Besides of the first dozen encounters, it's now totally randomized. I can't prepare for anything after that.[BR][BR]But not only you did make it more difficult with more randomized units, you also increased the difficulty in the growth of the enemy squad size, the difference between our and the enemies squad size PLUS the general needed squadsize in fast growing steps. This seems like overkill.[BR][BR]Now you argument that you want to make negotiations more attractive and i'm okay with that. So in ordner to make negotiations more attractive, annihilating tons of troops, what's now x times more usual as ever, seems to be the right way? I mean... if i negotiate, i'm done with that province 100% safe. With fighting the chances are very high that i'll loose multiple squads - even if i win. Currently there seems to be a heavy inbalance between negotiation and fighting. I'm not asking for raising the negotiation costs, i'm asking for lowering the fighting difficulty in terms of needed squad size (at least).[BR][BR]\"Catering costs got much more expensive!\" - Generally speaking, this is true. - Compared to stuff before. Of course, i can sell a 500$ TV for 1000$, while it's \"50% off\" at the same time. I only need to raise its price to 2000$ before. It looks exactly like that right now. And using more or less rare stuff like mana or orcs there is also a bit off, as there are so many things asking for mana, orcs, etc, including the spire. At one point i could be capped to progress further, as i'm out of mana, because i upgraded my MH or did reasearch something before, only to face that one unfightable province that is asking for mana in return. I can't buy mana, i can't boost mana (except i have a Dragon Abbey and enough enchamentments - wich i get less in the future as i'm locked in tourney progress), but at least: i could buy that province with diamonds.[BR][BR]\"[...] the very first Tournament Provinces are easier and cheaper to complete than the easiest Provinces in the old Tournaments.\" And this seems to be the excuse for everything. Some small part - that even was easy before - got easier, so everything on top of that must be a deathtrap now.[BR][BR]Uncertainty if Squad Size Upgrades should be completed. - Honestly, with the current changes of the tourney i feel unsafe with EVERY progress i now make somewhere, as you may use it against us in the future.[BR][BR]Uncertainty if Ancient Wonders make the Tournaments significantly more difficult. - Why even bother to take something into account that players invest into? We're building up these things to get better. To penalize that in every way, no matter how big or little, is illogical. \"Build this up to make things easier but harder\" <- What?[BR][BR]Questions on why (Premium) Expansions are involved in the cost calculations. - Same as with the AWs, i would think that i profit from those things, but again \"Use this to make things easier but harder\". It again doesn't matter how big or little the penality is: Why should you penalize someone that expands (no matter if Premium or not), especially as you do everything that we NEED to expand. Yes, more expansions = more goods, culture, etc - While at the same time you're asking us for more of everything at every corner. Isn't that already enough? Why must there be a \"hidden variable\" of making tourneys harder?[BR][BR]Confusion on why we're testing the changes on Elvenar International (EN) and not on Beta. - I understand why you did that, but you did that very bad (IMHO). There was no (ingame) announcement before, we're thrown in the cold water, trying to get as far as possible to be annihilated in the first round with the usual tactics. And we even don't know how to act from yet, as nothing is final and things will change. That's a stressfactor that shouldn't exist on a casual-live world.[BR][BR]As the feedback was already very bad on beta-servers this also seems to be some bad excuse to force that change to be final at the end, as \"a rollback would be too complicated right now\" and \"new players already adapted to it\".[BR][BR]Also there are many veterans playing at the beta-servers and the changes are mostly (or only) benefitial for beginners. To outweight the veterans voices, you now collect beginners feedback to justify that change, as they'll have mostly positive feedback, as there is nothing in there that changed to worse for them. At least not that they know of now and they'll never know of, as that part is history now.[BR][BR][BR]Conclusion[BR][BR]I understand that there was an issue with some sort of \"open end\" in the tourneys until yet, and you could've made some changes to make higher provinces more difficult as lower ones, but you did overdo it.[BR][BR]Where is the reason to unlock more and more provinces for tourneys, if there is virtually no way to ever get there? At least not without throwing in a whole years collection of booster buildings, enchantments and time-instants. If players upgrade all their AWs, manage to gain 4 dwarven armories (or something alike) and they manage to fight to province 60 so be it. This should be a valid option. It should be reasonly hard, but not unreasonly impossible.[BR][BR]That's something endgame-players can aim for. That's something they can do while they're waiting for new stuff. At least that's what they did do until yet.[BR][BR]That also has nothing to do with \"we don't want to adapt\". That's no adaption in the current way, that's a pure rip-off. Plus the income from tourneys (KP, enchantments, relics, etc.) is connected with everything else.[BR][BR]Lower income in tourney:[BR]- lower exchange of KP within fellowships = less feeling of progress especially if you're techlocked (it's all about positive feelings in a game!)[BR]- less enchantments = less goods/tools/coins for everything else, like the spire + you need those for the tourneys now too![BR]- less relics = less crafting in MA, especially for new players[BR][BR]While we did talk about positive feelings... yes beginners have more positive feelings with the tourneys for now, but there will be no increase in that. They'll be stuck there, as everything above that, is unreasonable hard. There is no real progress achieveable for them without any heavy investment.[BR][BR]Before i was able to tell my fellows (especially the beginners) what they need to do, to be prepared for the next tourney, so they could improve by using better tactics. They could feel progress and they could be motivated to do more than just 4 provinces, as they learned how to use their stuff - progress from learning, progress from doing things right, progress by developing yourself.[BR][BR]The positive feeling you're now giving them is a farce, as like you already explained: the first provinces are now easier as any province before. You could do everything wrong, but you would still win. This positive feeling will not last and the current system will offer nothing to develop that further at a reasonable price or with reasonable rewards.[BR][BR]I'm okay with making it easier for beginners, i don't mind that, but that shouldn't be used as an excuse to make things above that MUCH harder.[BR][BR]At the End: Why do you need to make such complicated formulas? There are chapters, there are keypoints in those chapters and thats what you did use until now. Why make a difference between a player that placed all AWs and a player that placed none? It's not like those players don't have the same chance to place that aw or not.[BR][BR]Why mind expanions? If someone in chapter 1 already owns 30 expanions so be it. Why make things harder for him as for some other player in chapter 1? Because he got more space? Well... take out premium expansions at all and that would be no issue at all. Don't like that idea? I don't care both ways, but that player most likely spend money so that the player without those premium expansions can enjoy his free experience. Why give him any penality (like already said).[BR][BR]This game has no PvP, so why even bother.[BR][BR]Balance between beginners and advanced players? What's the reason for being advanced if i can only beat the same amount of provinces at even higher costs as an beginner? An advanced player should be able to do more by the nature of being advanced.[BR][BR]All that stuff could've been fixed by finetuning stuff. What you did is to shoot a-bombs at mosquitos."}, {"60": "Gargon667 said:\t\t\tI surely would not prefer the silly old tourney without booster buildings, no! I rather have boosters and new tourneys any day.[BR][BR]How would making the old and crappy system worse make anything better?\t\tClick to expand...[BR]It would be much less disruptive and overall better than these changes. As you are using 10 booster buildings i dont think you understand the difficulties people are having and just how bad it is now. Everything is easy to you right now. [BR][BR]Refer to my post a bit further up, as far as i can tell, it is an unwinnable fight with any combination of troops or strategy."}, {"84": "Muf-Muf said:\t\t\tThanks for your feedback everyone. We're still actively reading along, and have spotted the following points we'd like to address in some more detail, listed below in no particular order:[BR]Random enemy units can be (too) challenging to beat, and/or cause too many losses. - We have already taken some steps to make the enemy unit selection less than fully random, meaning that every Tournament type comes with a focus on one or more enemy unit types. For the current Planks Tournament, that is a \"strong focus\" on Light Ranged enemies. Using the combat pentagon, we can see that it's typically beneficial to use Heavy Ranged or Light Melee units to defeat the Light Ranged units in the Tournament provinces. Another thing we should state explicitly, is that the battles in the old Tournaments were skewed in their balancing, which was a problem on our part. It was possible to fight through the Tournaments with (very) minimal, or in some cases even no losses. In the new Tournaments, we aim to balance them more fairly, especially in comparison with catering: We want to make catering a more viable option to participate in the Tournaments. We've made adjustments in both ways: Battle will - especially on higher Provinces - result in more losses, but we've also made catering cheaper (also see the next bullet point below).[BR][BR]\"Catering costs got much more expensive!\" - Generally speaking, this is untrue. However, we can see why it might feel like that, especially in later Provinces. Please remember that we drastically changed how the difficulty is distributed over the Tournaments with these changes (see this post on the Beta forums, or check our video for more information). Not only the province level, but also the province number is relevant in that calculation now. Especially if you're doing a lot of Tournament provinces (even on level 1), you will see the costs increase in a different distribution than you would have seen in the old Tournaments. However, that doesn't mean that all catering is more expensive - in fact, when we accumulated all the costs for the previous 4 Encounters into 1 big Encounter, we halved the outcome we got from that for each Province. That said, we did add more resources to the Tournaments that can be asked for: Coins, Supplies, Mana, and Orcs. While many players may have large amounts of Goods, that may not necessarily be the same for these resources, and that could make it feel more expensive, even though it factually isn't. To compromise on this, we have already lowered the chances for these resources to appear as cost requirements for catering a Tournament Province. This change was made before the start of the first new Tournament on Elvenar International. And, in addition to that, the very first Tournament Provinces are easier and cheaper to complete than the easiest Provinces in the old Tournaments.[BR][BR]Uncertainty if Squad Size Upgrades should be completed. - From our point of view: yes. With the Tournament improvements, we took away the one negative factor regarding optional Squad Size Upgrade technologies, namely that they made Tournaments harder. Optional technologies have no influence on the new Tournaments whatsoever anymore and, therefore, there are no downsides to unlocking these technologies. It is, of course, up to you if and when you would like to do so.[BR][BR]Uncertainty if Ancient Wonders make the Tournaments significantly more difficult. - From our point of view, they do not. Therefore, it should not be necessary to remove any Ancient Wonder nor to cease upgrading any existing ones further. While they are part of the costs calculations, the increase of costs caused by more or higher-leveled Ancient Wonders pales in comparison with the benefits the Ancient Wonders give. And because of that, the nett result is still a (very) positive one.[BR][BR]Questions on why (Premium) Expansions are involved in the cost calculations. - The calculations for the costs consist of many factors, of which the number of places Expansions is indeed one. With our formula, we aim to create a fair playing field, and to scale the Tournaments towards player progression, so that newer players can also participate in the Tournaments in a meaningful way. We'd like to state explicitly that each individual factor, like the number of Expansions placed, is just a small part. Premium Expansions are also (significantly) less impactful in those calculations than non-Premium ones, and their impact in general has already been decreased since the first Beta launch of the new Tournaments. You might wonder why especially Premium Expansions are included in the calculations at all, and the answer to that is simple: While we want to make sure that Premium gives an advantage, we must also balance it in a way that still ensures a fair playing field in general, for all players - those who opt to pay for something, as well as those who don't. And, in similar fashion to the Ancient Wonders, the benefits that additional Expansions (Premium or not) give, are still much greater than what any additional cost in the Tournament would be, because the more space you have available, the more and the larger buildings you can place in your city, which will produce more resources and provide other advantages. Again, netting in a positive result for you as a player.[BR][BR]Confusion on why we're testing the changes on Elvenar International (EN) and not on Beta. - We're doing both. On Beta we started testing the new Tournaments in July, and while this started mostly as a technical test, the feedback we receive there is also very important to us. You can read up on the changes we've made before the Tournaments came to EN in our announcement. Why would we test on EN at all? Simply because we are confident that, technically, the Tournaments are doing well, and we need to get more feedback and data that Beta simply cannot offer us. Therefore, we have extended the regular roll-out of new features a bit more, and included EN in that process, before activating it on all different versions at the same time. We will still wait several weeks before activating it on any further language versions to be able to process your feedback, as well as the data we're collecting on how the feature is used and if our balancing expectations match reality. It's possible that we'll still make some tweaks before further releasing the feature, and we also still have some small quality of life changes we'd like to make, to make playing the Tournaments more convenient and enjoyable. However, we cannot guarantee any changes right now, as we're still analyzing and processing feedback and data before making decisions, and we will be doing that for at least a few more weeks. We have also seen some suggestions on copying or cloning our Live worlds so that these copies could be used to try the feature instead. Unfortunately, this is not a viable option for us: Not only is it technically complex to set up, it would also not give us the information we are looking for, as we'd have fewer people playing the feature (not everyone will additionally play on a copy of their account), and player behavior would be very different on such a world, too. Example: Spending resources is much less of a concern on a copy of your account, and while it could make for a nice technical test, we are mostly looking for real player behavior with the feature right now, because the technical part is already doing well.[BR]We hope that this will give some further insights and clarifications on the topics that are being discussed at the moment. Is there anything we've missed in the discussion so far? And of course please keep further feedback coming! As also stated above, we'll continue to monitor the Tournaments closely - both the feedback we receive from you, our community, as well as the data we have. Combining this, we'll be tweaking the Tournaments if and where necessary before releasing them to further versions. [smilie--sprite1]Click to expand...[BR]That is quite a speech but you could have saved yourself a lot of time and effort by simply saying this is what we are giving you, this is what you have got, learn to live with it or leave the game.[BR]You say that changes might be made but if they are (going on past experience) they will be so small that they will make no noticeable difference to players. There might be a difference to Inno's overall data but not to individual players.[BR]Catering costs are cheaper ? i can say that i can not see that and the amounts of coins and supplies are insane. 3 provinces in a row wanted supplies in the catering costs 1st one wanted 120K 2nd one wanted 130K and the 3rd wanted 140K how are those amounts sustainable ? Those 3 provinces were 7, 8, and 9 so not even deep into the round."}, {"53": "Muf-Muf said:Uncertainty if Ancient Wonders make the Tournaments significantly more difficult. - From our point of view, they do not. Therefore, it should not be necessary to remove any Ancient Wonder nor to cease upgrading any existing ones further. While they are part of the costs calculations, the increase of costs caused by more or higher-leveled Ancient Wonders pales in comparison with the benefits the Ancient Wonders give. And because of that, the nett result is still a (very) positive one.\t\tClick to expand...[BR]I'm intrigued by the fact that there appears to be a complete disconnection between the (no doubt sincere) views expressed by Inno on the one hand and the commenting players on the other. Leaving aside the question of who is right, it might be helpful to understand why the opinions are so different.[BR][BR]Speculating wildly, I have a theory. My guess is that Inno picked some likely factors for tournament performance (such as Wonder points and boosts) and then used data science techniques with these to construct the difficulty formula. (In other words they used data from previous tournaments to predict which city characteristics corresponded to high tournaments and developed a formula which applies some penalties to them.) During the current testing phase, they are assessing how well their formula is working by verifying that the same factors still help the player, but to a lesser extent than beore. My personal expectation is, even in this new tournament, that players with plenty of wonder levels will still be outscoring those with few levels on average. [If so then this would seem to support Muf-Muf's statement.][BR][BR]Where the logic falls down (at least in my opinion) is that the data doesn't tell us whether players are successful in tournaments because of Wonders, or just that successful tournament players tend to have more Wonder levels for other reasons (e.g. earning lots of kp from tournaments, commitment, game knowledge etc.). I think that there is an element of both: military Wonders certainly do help tournament play significantly, but most Wonders are largely irrelevant.[BR][BR]It might be helpful to have a view from the developers about whether this speculation is correct, or whether there is another explanation for the inconsistent views."}, {"22": "Far Reach said:\t\t\tIt might be helpful to have a view from the developers about whether this speculation is correct, or whether there is another explanation for the inconsistent views.\t\tClick to expand...It would so often be helpful to have the view of the developers, but it doesn't ever happen. Not once in the three and a half years I've been on this forum."}, {"35": "Can you undo the recent stupid debuff on Frogs now please?  They're utterly worthless when the enemy squad size is double your own.[BR][BR]Frogs are designed as a cliff-edge unit.  In that their base damage is lower than most other units as they have more range so should be able to kill most units before they reach them.  Indeed this works in the spire, you can send your Frogs against e.g. 1 LM, 2 HR and 2 HM, manual fight and come away with little to no losses. However, in this new tourney format, with the enemy having such a high squad size, Frogs are incapable of doing enough damage to even a single rogue enemy HM unit in the enemy squad, where all other units are meant to be countered by Frogs.  With these squad sizes Frogs are so weak against even other HR units and Mist Walkers kick their butts too due to their low health and the evil attack debuff they leave on them.[BR][BR]Mist walkers are ridiculous at huge squad sizes, always attack first, 4 movement and 4 attack range = 8 targeting range, hit like a truck, even against units designed to counter them, leave a massive attack damage debuff on your unit that was attacked, leaving your nerfed unit, with already low base damage, to tickle the 200+% enemy squads.  Oh, and don't forge about their ranged strike-back too![BR][BR]Ranged units are the worst affected by these massive enemy squad size.  All ranged units have the cliff-edge design to some degree, but at least for LR and Mages, we have the ELR and MMM buildings, there's no way to increase Frogs' damage beyond 190% in the game at all.  Unless you feel like giving us a way to get more Fire Phoenixes? - yeah, didn't think so...[BR][BR]Frogs being so weak means when you want a HR you need to turn to Orc Strats, or your Golems / Mortars.  I came to a realisation today that Orc Strats is not a sustainable unit in these tournaments, okay, it might be better than catering with 60K Orcs, but if you're going to lose 20-30K Orc Strategists to win one fight, a fight for which they should be a pretty much the optimal counter (e.g. enemy of 4 LR and 1 HR), you're still losing tens of thousands of Orcs in battles anyway.  Orcs are so slow to replace you cannot afford to lose so many units that require them to train. That leaves Golems for me, good against LM, not so good against LR.  It almost feels like you're leaving us without any viable counter to enemy LR now when facing 200+% squad size enemies.[BR][BR]The 'cliff-edge' on all our ranged units due to the huge enemy squad sizes pretty much means that if catering is a no-go on a particular encounter, I'm throwing Treants and Vallorians at fights they're not designed to win, but they are winning, albeit with heavy losses, just because they have the health to keep up and fight back."}, {"22": "Paladestar said:\t\t\tCan you undo the recent stupid debuff on Frogs now please? They're utterly worthless when the enemy squad size is double your own.\t\tClick to expand...I've noticed the frogs being a bit ineffective too. I thought maybe I was imagining it. I've done some manual fighting in this tournament and after a while I'm realising that I'm trusting my mortars more."}, {"30": "Pauly7 said:\t\t\tThe extra chests are supposed to not detract from the idea that 10 chests stays as the main pinnacle and goal for fellowships. They added the extra chests purely for those teams who wish to compete for records and against themselves, so now it will record a higher number. The prizes in those chests are just nominal and I'm in support of that. No one wants the awesome prizes to be in the 19th chest and then have fellowships trying to force their fellows to do way more than they can.\t\tClick to expand...I am also in agreement with Pauly7. Giving more attacking rewards to chests beyond 10th will to lead disharmony in fellowships."}, {"30": "I think most players are frustrated with the huge squad size requirement as one move up the provinces. I push myself to the 24th province and still, I can win it with a manual fight but losses are much larger since the enemy squad is now 172% compared to my squad. That stops me pushing it further since I have to preserve my troops to fight the next rounds in earlier easier provinces. One bad fight could put you out of play for the week even on easier provinces unless you have enough time boosters to through in. Furthermore, in chapter 16, Orcs is a huge challenge.[BR][BR]However, on the positive side, most of the players in my FS is doing better than before and we still reach the 10th chest."}, {"73": "Overall : brutally expensive for rewards that’s abysmal compared to what we are used to. [BR][BR]Since we are used to good rewards, if feels frustrating. After all games are for gratification. We already have daunting challenges in real life, and we want a nice relaxing, rewarding game. [BR][BR]Please make the game enjoyable and rewarding Inno. This is one game where there’s significant frustration than enjoyment. After all, we are here to for a distraction from our real life problems!!! [BR][BR]So : here’s the feedback[BR]1. I like the 1 battle [BR]2. Catering is insanely expensive. Need to Flatly bringing it down to 30% without trying to balance elsewhere. Trust me, you are not very good at balancing anything. [BR]3. SS Formula should be re worked in the long run, but make the fights decent. A flat 50% cut and still the losses would be brutal. [BR]4. Opponents beyond 190% of player SS, should not occur. Opponent increase should be less steep and beyond 190% , 0.5-1% increase per province and round. [BR]5. And don’t worry too much about giving us loads of kp. The current system with aw level 31-35 has the potential to keep us occupied for next 3-5 years. And doing 1 chapter 16 for half a year. Why is it so scary to you that we make kp. [BR]PS : [BR]1. I made a 10k only to test the system. Data from my city should in no way be relevant to your data collection/ feedback. Such scores are not sustainable."}]