[{"57": "@Muf-Muf @Silmaril [BR]As I have progressed in the tournament I have enjoyed it more. The re-balancing of the type of units mean that a can look at a fight and think there is  chance of winning. Please just make the terrains a bit more interesting with a bit more variety"}, {"25": "The one thing that Inno doesn't seem to take into consideration is human nature.  When a new player comes into a game it is natural for them to see players that have been with the game for a lengthy duration. That senior player's ability may determine whether a new player wants to stay with the game in order to be able to achieve that greatness.  A new player may attempt the tournament and not get very far, but they see the Archmage with the big city and diamond expansions is able to come online on a Saturday and wipe out province after province to save the fellowship and get that elusive 10th chest for everyone to enjoy.  This is was why players made such an effort to progress.  They wanted to become an end game player.[BR][BR]You have now taken away the reason to build and expand AW's.  You removed any logical reason to purchase diamonds to enlarge a city.  You negated any rational reason to progress.  Why emulate the AM and the mages when they can't outperform the players in the middle of the tech tree that purchased nothing?  There's little left for them to aspire to become but a lower level player with a small city and very few AW's.[BR][BR]I see nothing intelligent about this.  Nothing.  My next expansion was going to cost a pile of diamonds.  That is NOT going to happen if this lunacy keeps up."}, {"84": "Muf-Muf said:Uncertainty if Ancient Wonders make the Tournaments significantly more difficult. - From our point of view, they do not. Therefore, it should not be necessary to remove any Ancient Wonder nor to cease upgrading any existing ones further. While they are part of the costs calculations, the increase of costs caused by more or higher-leveled Ancient Wonders pales in comparison with the benefits the Ancient Wonders give. And because of that, the nett result is still a (very) positive one.\t\tClick to expand...[BR]What about the fact that AWs hurt players twice ? Every AW level counts to how hard the tourney is so that is the first hit. Players build AWs to help them progress through the game, progression through the game also counts to how hard the tourney is so that is the second hit. Do the devs think it is fair to punish players twice for building AWs ?"}, {"115": "Well I've just finished the new style tournie in Arendyl, currently top of the board but with 7+ hours to go I will lose that. Anyway 16200 points scored, cost me an arm and a leg in troops and goods (not diamonds). I had to make troops using timers and brown bear every day to compete , luckily had some spare goods to help out. My fellowship has done 12 chests and the extra two are not worth the effort for the paltry prize!! Give us a blueprint in each extra chest or say 50 diamonds then it's worth it but I won't be going mad in the tourney again, ten chests will be the limit. All in all not a good change except for the one 'hit' approach, that at least saves bandaging wrists every week."}, {"14": "All you people scoring high against enormous losses; [BR][BR]You do realize you are making Inno think all is well with the world? They won't look at your losses, just at your scores and go; \"Oh look at that, they still doing fine, all those people crying foul must be wrong. Our stats look fiiiiine\""}, {"22": "Killiak said:\t\t\tYou do realize you are making Inno think all is well with the world? They won't look at your losses, just at your scores and go; \"Oh look at that, they still doing fine, all those people crying foul must be wrong. Our stats look fiiiiine\"\t\tClick to expand...Or, worse still... they'll look at a 16k score and think that they didn't make it hard enough. Inno has a hard time looking at the big picture and at long term effects so all they are really going to do is gauge results in these initial 3 weeks' testing. If too many people perform at an unsustainable level then that is what they will take away from it.[BR][BR]I have one round left to do. I am trying to carefully watch my losses. The aid I have is a fed Fire Phoenix and 1 x DA, because that is the maximum amount of boosts that I see as being sustainable now, in the long run. I will score 6,500 points after my last round, but my troop losses have been considerably greater than if I had scored 12k in the old system.[BR][BR]The way the enemies are set up, I expect Planks to be one of the tougher tournaments from now on, but I still would have lost more than I can replenish. I would hazard a guess that I can sustain about 5,500 - 6,000 points week in week out. This is probably a little better than I was doing two years ago, before all the crazy troop bolstering silliness started."}, {"115": "Yeah well its ok to moan and complain about high scorers and I appreciate your concerns about the new system however I usually score about 2k in most tournies and I doubt I'll go mad in others like I did for this one BUT I wanted to test the new parameters to see if they were beatable and yes they are. I did 60 provinces for 6 rounds, yes I lost a lot of troops and spent a lot of goods etc but it's not as bad as it's made out. The single click is good, the extra chest rewards are crap and yes troop losses and cost of goods is high. The parameters do need to be looked at and some of them reduced because without a doubt it's the big city player who loses most under this new system but then again so many big city players have made their cities as war machines so what do they expect? The smaller city player is also penalised because now they won't be sure whether they should research or build AWs etc. Yes, the system needs adjusting but don't blame high scoring players because you're angry at Inno."}, {"76": "Coming to the end of Orc Chapter – negotiation[BR][BR]Provinces 21,21,10,10,10[BR][BR]I have managed to do the same provinces as last week for less goods  however the coins and supplies were more than I was expecting. As this increased slightly in later rounds, I am a bit worried about how I will do spire, tournament and city progression from now on, as eventually I will run out of instants.[BR][BR]At the end of Elvenar chapter but not completed senate research – Fighting[BR][BR]Provinces 21,21,10,10,10[BR][BR]Base 2856[BR][BR]Province 1 1 star 748 – 95[BR][BR]Province 21 1 star 15703 – 25377[BR][BR]Using only Fire Phoenix, I’ve gone to level 21, I could go on but potential losses are too high and enemy are to diverse meaning there is never 1 unit that can fight all without high losses.[BR][BR]Have gone to province 21 on 2nd star some losses on auto fight seem excessive when the unit’s placed should have been fine but lose more than should have.[BR][BR]Rounds 3-5 have been easy to do with no Fire Phoenix but more troops died in province 10 then I think is acceptable[BR][BR]Conclusion [BR][BR]The 4 encounters to 1 encounter is a great thing, I especially like that you don’t have to load the province screen.[BR][BR]Negotiation the balance and amounts of goods (tier 1- 3) seem alright at low chapters but not at high chapters. I think this shows the formulae might not scale the chapters correctly. but the amounts of coins and supplies could become very disruptive to complete gameplay (tournaments, spire, researches, scouting, upgrading buildings and so on)[BR][BR]Fighting[BR][BR]With fighting it seems up to luck if you will be able auto fight or not depending on the type of enemy units. When you have HR/HM/M/LR in one battle its stupid to auto fight which means it’s not challenging but annoying as this was never the case with old system.[BR][BR]I fear like with the spire the large squad size will scare people away from doing a lot of provinces as they fear the losses they could receive.[BR][BR]I fear like others that there is a lack of reward for progression, one fellow in my fellowship in orcs found fighting with just Phoenix and one DA that they could do the same amount of provinces for the same cost as with the old system, where I can tell from what I did that my Elvenar city would not be able to do the same provinces for the same cost as before."}, {"14": "Matohuska said:\t\t\tYes, the system needs adjusting but don't blame high scoring players because you're angry at Inno.\t\tClick to expand...[BR]Warning does not equal blaming."}, {"35": "Killiak said:\t\t\tAll you people scoring high against enormous losses;[BR][BR]You do realize you are making Inno think all is well with the world? They won't look at your losses, just at your scores and go; \"Oh look at that, they still doing fine, all those people crying foul must be wrong. Our stats look fiiiiine\"\t\tClick to expand...[BR]Yeah it's a bit tougher, overall I don't really like the change either, but it can still be done and I'm not gonna leave KP on the table in the meantime.  A handful of people being able to cope against a backdrop of many complaining, doesn't distort the overall picture.  \"One swallow doth not a summer make.\"  Inno can clearly see how hated this change is.[BR][BR]The truth is they're never going to balance it to be the same effort for everyone with their current formula.  It's clear that most people are struggling, but there's always going to be people who can cope too.  They need to look at their new system again.[BR][BR]Spoiler: I don't notice much of a difference in my inventory before and after tourneyTourney done, still looking pretty stocked...[BR][BR][IMG]https://i.ibb.co/0K2N4qJ/https-en-forum-elvenar-com-index-php-attachments-post-tourney-22-aug-2020-png-4675.png[/IMG]"}, {"27": "The planks tournament is finished in my chapter 16 city. So what is my feedback after playing it in my real and advanced city?[BR]-- I was shocked by the size of my squad size.[BR]-- My score is just about 2500 instead of my lately usual 5000 and I didn't get the usual KPs to invest into my wonders. On the other hand I don't feel the need to invest into my wonders anymore. At the moment I only do it for FA Wonder Society badges.[BR]++ Just 1 encounter instead of 4. Very positive change by itself.[BR]+- Our fellowship scored comfortably 6 chests. We did them more often than not in the past weeks, so there doesn't seem to be change in that. However, I'm not sure if people will keep their performance, or if it was just curiosity combined with attempts to get some spells for FA.[BR]+- Just 1 encounter instead of 4 & at the same time doing less provinces means that I'm much more at mercy of luck. Everything in the tournament is being randomized now. That's a trend I really don't like.[BR]-- The only reason I did my usual 6 rounds (in first 9 provinces) is my significant time reduction. For some reason I just couldn't be bothered to do the tournament on schedule as I did in the past. The drive is not there anymore.[BR]-- The harder fight highlights the problem of missing manual combat in the app. I can't look at the terrain, I can't lead my troops myself against tricky combination of enemies. The risk of losing a lot of troops (or all!) is very high in the app.[BR]-- With this setup I don't believe our fellowship will be able to do 10 chests once in a cycle (we used to do it in steel tournament). This is extremely bad impact of the tournament redesign."}, {"14": "Paladestar said:\t\t\tTourney done, still looking pretty stocked...\t\tClick to expand...[BR]Even with your numbers, I think that if you keep pushing it high, you will start to see it go down. Looking at your previous post, you are dropping a lot of daily productions in there, and a lot of instants.[BR]Also, elvenstats won't load me up your city, so how many boosters did you place? Since that is another thing that should be included in the concept of sustainability."}, {"35": "Killiak said:\t\t\tEven with your numbers, I think that if you keep pushing it high, you will start to see it go down. Looking at your previous post, you are dropping a lot of daily productions in there, and a lot of instants.[BR]Also, elvenstats won't load me up your city, so how many boosters did you place? Since that is another thing that should be included in the concept of sustainability.\t\tClick to expand...[BR]I placed two DA.  No UUU, ELR or MMM.  Got 5 DAs left and 18 UUUs left, so I can sustain +100% hp every week for almost a couple of months with just what is already in stock.[BR][BR]Same on my Felyndral city (Achasson), just two DA (10 DA and 16 UUU left on this city).  Did 5 rounds to 65 provinces.  Tourney actually felt easier there, but that city is much less developed, way fewer expansions, way less AW levels etc., so guess the formula just isn't so punishing there."}, {"84": "Sustainability is the key point. How many of the high scoring players this week could do it every week ? The devs will look at the data for this 3 week test and take from it what they want to take and ignore the rest. Anyone that has played this game for a good amount of time should by now know that is what they do. If players push things to their limits in this 3 week test periodit is going to give false data to the devs if those players could not do those scores week in week out. If those high scoring players suddenly dropped their scores after 5 or 6 weeks because they could not sustain their high scores would inno have another look at the data ? not a chance."}, {"45": "I am sorry I have not been very present guys, had to be offline for a couple of days due to some rl emergency. But I am getting back now and reading through to catch up. [BR]Please keep leaving your feedback as we come to the end of week one and see what experiences are before heading into week two."}, {"22": "Paladestar said:\t\t\t+100% hp every week for almost a couple of months with just what is already in stock.\t\tClick to expand...For a couple of months, but that doesn't make it sustainable. Over the last two months I have been able to craft 1 x UUU and I think I've maybe won 3 x DAs from the Spire, going to the top each week. I'm guessing (I'm hoping) that I've been unluckier than most, but I can't imagine how anything more than +50% HP per week is sustainable."}, {"62": "Well here is my prognosis, Im happy with the tournament. My FS got its first 10 chests. [smilie--sprite8][BR]I fought about the first 6 provinces through to 5 star then catered the rest. Didnt use any troop boosts, didnt train any troops.[BR][BR]Carried on as normal with trading and productions in my city. Not really much of a hit on resources or troops.[BR][BR]Finished up with 3294 points. only real significant hit was supplies. The mana is out because of a research i did during.[BR]But i can see my FS going for 10 chests every week from now on. We dont want to go any further at this stage for the AWkp and RR chests.[BR][BR]Spoiler: ResoucesTourney start.[BR][IMG]https://i.ibb.co/cy9Yr29/https-en-forum-elvenar-com-index-php-attachments-tourney-start01-jpg-4677.jpg[/IMG][IMG]https://i.ibb.co/ZxJ7srr/https-en-forum-elvenar-com-index-php-attachments-tourney-start02-jpg-4678.jpg[/IMG][IMG]https://i.ibb.co/DYJ0jP8/https-en-forum-elvenar-com-index-php-attachments-tourney-start03-jpg-4679.jpg[/IMG][BR][BR]Tourney end.[BR][BR][IMG]https://i.ibb.co/3NFXv3f/https-en-forum-elvenar-com-index-php-attachments-tourney-r5-end01-jpg-4680.jpg[/IMG][IMG]https://i.ibb.co/hVXM3hP/https-en-forum-elvenar-com-index-php-attachments-tourney-r5-end02-jpg-4681.jpg[/IMG][IMG]https://i.ibb.co/xzyPb5Q/https-en-forum-elvenar-com-index-php-attachments-tourney-r5-end03-jpg-4682.jpg[/IMG]"}, {"100": "So...[BR][BR]- What´s the use of upgrading Martial Monastery if the enemy squad size would increase in the same proportionality of my suppose \"benefit\" from this AW?[BR][BR]- What´s the use of upgrading Needles of the Tempest if my archers now with that upgrade would fight versus a bigger squad size enemy all the time it is upgraded? Meaning that this improvement in their attack it´s banal and, beyond that, it doesn´t matter how faster my barracks is, how many brown bears or 5hrs boost timers do I get they would die so much faster that I won´t be able to recover as good as previous Tournament changes, and all this goes for the Flying Academy & Victory Springs also.[BR][BR]-What´s the use of upgrading my Dragon Abbey if now ( like the needles) my mage units would fight vs bigger squad sizes anytime I upgrade this AW??? What´s the use of receiving Mana everytime I use a spell if now enchantments like ensorcelled endowment and power of provision will be very scarce and we would hardly keep this Wonder running constantly?[BR][BR]-What´s the use of even bother keep my Shrine of the Shrewdy Shrooms in my city if any extra free unit I have from this would mean nothing for the tournament system? Having bigger squad production if my troops are destroyed easily and faster ?[BR][BR]- And so on and on with many fight helping AWs and many more that would be affected also.[BR][BR]I would love a good explanation of this irrational decision Elvenar Team support and Elvenar Developers."}, {"93": "Gargon667 said:\t\t\tBig scores are still possible if one tries hard enough, but it should not be the standard to score big (it wouldn´t be big after all if it was standard). I for one am OK doing more than 10k points on a special occasion and otherwise just do a smaller tourneys.\t\tClick to expand... Big scores does NOT come by itself. Players work at it.BUT it should be the player's choice not there for Inno to try and make this impossible"}, {"93": "Timneh said:\t\t\tWhat about the fact that AWs hurt players twice ? Every AW level counts to how hard the tourney is so that is the first hit. Players build AWs to help them progress through the game, progression through the game also counts to how hard the tourney is so that is the second hit. Do the devs think it is fair to punish players twice for building AWs ?\t\tClick to expand...i agree but why punish players who play the game the way Inno told us it was supposed to be played at all. i worked hard to upgrade the aw's."}]