[{"115": "End results for me were good, First place in Arendyl, 5th place in Winyandor and 5 th place in Felyndral - I have never achived that before although I have been 1st in all 3 before. My conclusion is that despite not liking all the changes that have happened and certainly appalled at just getting an RR and a few kps in the extra chests, overall the changes did not make to much difference. As previous posters have pointed out, I am not likely to do this every week but once in a cycle to help my fellowships get ten chests should be easier than before. I agree that fights gave more troop losses but compensated with less cost in catering. I'm happy enough with it but do think some of the more drastic increases should be reduced."}, {"116": "I see positives and negatives with these changes.  Hopefully Inno will keep the positives and fix the negatives:[BR][BR]+ I am seeing a lot of fellowships that never hit 10 chests before doing it this week.  I suppose that's a good thing, promoting play across the board, rather than having so many fellowships struggle to get to that point.  More players than ever benefiting from the tournament.[BR][BR]+ Just one battle per province is good, my thumbs thank you Inno.[BR][BR]+ Mixing up the battle types, and limiting the enemy to 5, all good.[BR][BR]- (and a big - in my book) What's was the goal behind making it so much harder for larger end-game cities?  Why am I being punished for spending diamonds on expansions, magic buildings, etc. over the years, and working a very long time to grow my AW's?  This was the toughest tournament I've played in a long time, and I played way below my average.  I hit a wall and just couldn't afford to keep going.[BR][BR]Without players who purchase diamonds, there would be no game, period.  No Inno.  No jobs.  The tournaments are a contest.  You have tipped the scales unfairly, in favor of the players who have less invested in the game."}, {"73": "Forced, enforced communism is dictatorship."}, {"54": "JollyElf said:\t\t\tForced, enforced communism is dictatorship.\t\tClick to expand...its their property, they can do with it as they please. If they think this will make them more money on the long run, then good for them.[BR]But i dont agree with your communism statement, if anything inno are capitalists"}, {"73": "Heymrdiedier said:\t\t\tif anything inno are capitalists\t\tClick to expand...[smilie--sprite2] that’s the irony isn’t it. [BR]Socialism/equality/communism for gamers. [BR]Capitalism for owner."}, {"25": "Heymrdiedier said:\t\t\tif anything inno are capitalists\t\tClick to expand...If they are capitalists they're not exactly doing a great job of it.  It's not generally a capitalist notion to punish players for paying for something.  You want people coming back for more, not the opposite.  [BR][BR]\"Sure, buy our diamonds, then stand over there so we can shoot at you.\"[BR][BR]Nope.  Doesn't sound like someone at Inno is quite understanding the capitalistic rules."}, {"22": "I see that the 19th chest was cracked at the first time of asking. So much for them saying that no one would be able to do it right away. Well done Tourney Bandits!"}, {"70": "We got 12 chests, and several of us went with caution. I had a greater effort resource and army wise, but I only used the duck, no buffer buildings. I see we can make the 19 chests fine too.[BR][BR]I did a bit over 7K pts, 6 starring the first 25, and did a bit more until 30th.[BR][BR]Next week with buffer buildings, and boosters for troops I will be able to make more, maybe even upkeep my average score between 7000-12000"}, {"73": "Pauly7 said:\t\t\tI see that the 19th chest was cracked at the first time of asking. So much for them saying that no one would be able to do it right away. Well done Tourney Bandits!\t\tClick to expand...Thanks. But as I said, testing and we dont like the system. So please don’t assume things Inno. The testing is not representative of data or feedback."}, {"7": "JollyElf said:\t\t\tThanks. But as I said, testing and we dont like the system. So please don’t assume things Inno. The testing is not representative of data or feedback.\t\tClick to expand...Well, all you did then is show Inno it is still possible. According to what they wrote before, getting the 19 chests should be nearly impossible. So if anything, their conclusion will probably be that it's still too easy and any edits they do make will be to make it even harder. So not sure what you were trying to accomplish by testing the limits of the new system, but I hope you understand that Inno reads the delivered data in a VERY different way than we do.[BR][BR]We say \"tested it, it cost us way too much, not happy with it!\", but all they do is look at the numbers, not the feedback. So this can only go very wrong again."}, {"30": "C-Nymph said:\t\t\tWell, all you did then is show Inno it is still possible. According to what they wrote before, getting the 19 chests should be nearly impossible. So if anything, their conclusion will probably be that it's still too easy and any edits they do make will be to make it even harder. So not sure what you were trying to accomplish by testing the limits of the new system, but I hope you understand that Inno reads the delivered data in a VERY different way than we do.[BR][BR]We say \"tested it, it cost us way to much, not happy with it!\", but all they do is look at the numbers, not the feedback. So this can only go very wrong again.\t\tClick to expand...I don't think Inno will just go by what we have written here. They have all the data and must be using some machine learning to analyse it.  [smilie--sprite8][BR][BR]However, I checked the effect of AW upgrades using the spreadsheet shared by @MinMax Gamer. Yes, it is a little worrying. But I think we should hear from a player with 400+ AW levels."}, {"33": "For me this tournament felt like a game again and not like a part time job. So I'm very positive on the new format.[BR][BR]The 1 fight/province is the most important change. But I also like that the fighting has become moire challenging. Earlier it was often so easy that you just loaded the same five units and won with light losses. No thinking or skill involved. Now you must think a bit before just pressing auto (I always autofight) and maybe think about catering if it looks to costly to fight. A game is supposed to be a challenge. If it's too easy it becomes boring.[BR][BR]A bit surprisingly I scored as usual (maybe even a bit better). Earlier I did all possible provinces to level 2 and the first two pages to level 6 or 5. Now I did fewer to level 2 but a lot more to level 5.[BR][BR]My only negative input is that the rewards for the extra chests are not that great."}, {"39": "So, do we know what units we are leading to slaughter this coming tourney? Whom to train?"}, {"7": "Regina8 said:\t\t\tSo, do we know what units we are leading to slaughter this coming tourney? Whom to train?\t\tClick to expand...No, just pick a few that you dislike and send them on the suicide mission."}, {"39": "C-Nymph said:\t\t\tNo, just pick a few that you dislike and send them on the suicide mission.\t\tClick to expand...hahahaha, that's what I thought."}, {"22": "Regina8 said:\t\t\tSo, do we know what units we are leading to slaughter this coming tourney? Whom to train?\t\tClick to expand...Bias your troop production to heavy melee."}, {"39": "Pauly7 said:\t\t\tBias your troop production to heavy melee.\t\tClick to expand...Thank you Pauly [smilie--sprite1], BTW I loved your tennis analogy on beta forum, LMAO"}, {"32": "AstralSoul said:\t\t\tWe got 12 chests, and several of us went with caution. I had a greater effort resource and army wise, but I only used the duck, no buffer buildings. I see we can make the 19 chests fine too.[BR][BR]I did a bit over 7K pts, 6 starring the first 25, and did a bit more until 30th.[BR][BR]Next week with buffer buildings, and boosters for troops I will be able to make more, maybe even upkeep my average score between 7000-12000\t\tClick to expand...[BR]You are exactly at the sweetspot we predicted, when this change was announced[BR][BR]Low chapter, \"maxed out needles\" (31 since you don't have sentient unlocked for a while) for max units, and very limited on wonders (157 levels)[BR]You are the ultimate proof that progress is regress. you just have what you need and nothing more."}, {"60": "@Silmaril and @Muf-Muf Is there any chance we could get some comments or a summary of how the tournament looked from the devs perspective? Would be interesting to see some stats."}, {"25": "30158729 said:\t\t\t@Silmaril and @Muf-Muf Is there any chance we could get some comments or a summary of how the tournament looked from the devs perspective? Would be interesting to see some stats.\t\tClick to expand...In a previous game I played every time something new was completely broken and unplayable the lead developer would call it \"working as intended.\"  Since the much maligned (67 pages worth) upgrade to the tournaments made it from Beta to here, I'd say that you're going to be told  that this is working as intended."}]