[{"28": "Hekata said:\t\t\tI just have 1 questions about the new system. Let's say when it starts, next week, with my 114 expansions and 172 wonder levels I can do 2k points. What happens when I have 216 extensions and 215 or 250 WL? Will I still be able to do the 2k or will even that be difficult/impossible?\t\tClick to expand...Difficulty per se is not affected by your expansions or AW levels. Just like with any other fighting in this game, it is only affected by the ratio of your own SS vs enemy's, boosts, troops lineup and the terrain. None of that depends on expansions / AW levels (BTW, you can't have 216 expansions [smilie--sprite2])[BR][BR]What is impacted is your ability to recover troops and goods. So your city progress won't make any of the individual fights unwinnable if they were winnable before, but it may prevent you from reaching the same overall level in the tournament consistently.[BR][BR]For the SS/catering calculation you can use https://minmaxgame.com/tournament-requirements-calculation/ (there is also a link to a spreadsheet calculator). This does not incorporate their most recent changes to expansions, but this change seems to be fairly insignificant."}, {"15": "MinMax Gamer said:\t\t\t(BTW, you can't have 216 expansions)\t\tClick to expand...Lol, I know it was a typo, I meant to write 116  [smilie--sprite8] [BR][BR]MinMax Gamer said:\t\t\tWhat is impacted is your ability to recover troops and goods. So your city progress won't make any of the individual fights unwinnable if they were winnable before, but it may prevent you from reaching the same overall level in the tournament consistently.\t\tClick to expand...Ok, thanks for explaining it.  With my current city set up and the current tournament system I can on occasion do 40 provinces but my max is usually 30 and on the hard ones even less. I just don't have enough troops (even with the help of the brown bear). So if I'm limited by troops now, what will it look like with the new tournaments if I keep upgrading my AWS? I feel like I won't be able to do anything. [BR][BR]Thanks for the link I'll try it out, but unlike a lot of people here I'm not a big fan of maths and numbers. I just like to be able to do the same amount of provinces every week (let's say 15? no idea what to expect until I try it) without it getting harder to have enough troops and without having to crunch numbers each time I want to upgrade an AW. For me that sucks the fun out of the game. [smilie--sprite3] [BR]I'm one of those weird players who'd like to upgrade their Sunset Towers just for the fun of it and with this new formula it seems like it's shooting oneself in the foot."}, {"15": "Pauly7 said:\t\t\tSomebody with a better handle on the numbers will be able to answer this better than me, especially as I haven't tested with an advanced city, but I haven't encountered anyone struggling for 2,000 points yet.\t\tClick to expand...That's good to know. As you can see I have very much lowered my expectations  [smilie--sprite8]"}, {"58": "Looking at the formula (which Inno failed to provide [smilie--sprite3]), every city progress makes the tournaments more expensive. It seems the intention that advanced cities shall not be sucessfull at the tournaments. I guess the idea is to block players near end-game to give the the lower chapter players the chance to catch up.[BR]Which would be fine for the smaller cities. Many end game players had fun going deep in tournaments, they're going to be very disappointed with these changes.[BR][BR]In my opinion, AW levels and City Expansions must not influence the tournament squad size because that just promotes stagnation. [BR][BR]I'll wait until next week to see how bad it really is, but I'm really not looking forward to it."}, {"28": "Hekata said:\t\t\tOk, thanks for explaining it. With my current city set up and the current tournament system I can on occasion do 40 provinces but my max is usually 30 and on the hard ones even less. I just don't have enough troops (even with the help of the brown bear). So if I'm limited by troops now, what will it look like with the new tournaments if I keep upgrading my AWS? I feel like I won't be able to do anything.\t\tClick to expand...With the new changes you might be unable to go provinces 30+ at all - regardless if you have troops or not. In the current tournament your max difficulty is in 6* provinces, and the factor of enemy SS vs yours is 1.6x. Which is tough, but somewhat doable. If you go deep in 2* provinces than it is much better as you always face something like 1.0x enemies. And this factor does not scale with the number of provinces, only with star levels - so 6* province #1 is 1.6x, and 6* #40 is 1.6x.[BR][BR]Now, in the new format you'd be hitting 2.0x (e.g. twice as many enemies as your troops) by about province #30 - and that is in 1*. 2.0x fights by Inno's own classification are supposed to be practically impossible. Having extra troops won't help if you're taking a complete loss."}, {"45": "We have just made a slight adjustment to the announcement as Crystal should have read Silk[BR] '' For each Tournament type (Marble, Steel, etc.), a certain selection of Units is more likely to appear in the enemy army. This is not necessarily one Unit type. Example: The Steel Tournaments will have a strong focus on Mage units as enemies, and the Crystal Silk Tournaments have a focus on Light and Heavy Melee enemy units.''"}, {"32": "Focus on light and heavy melee units?[BR]hmmm, that sounds like a horrible combination."}, {"27": "\t\t\t\t\t\t\tSilmaril said:\t\t\t\t\t\t\t\tWe are currently aiming to release the new Tournaments to Elvenar International (EN) on the 18th of August.\t\tClick to expand...Oh well, my poor last chapter city. I’m not looking forward to finding out how far I can (not) go in the tournament from now on. :-([BR][BR]My fresh beta city is only in the third chapter, so I only had easy tournaments with 1-3 provinces. Here on EN it will hurt. Not happy about the changes at all. I wonder why couldn’t we just get the simple change of 1 fight per province instead of 4 ...[BR][BR]EDIT: at least we got the last steel tournament where my alliance can push for 10 chests for the last time. Thanks for that. I mean it, this is not an irony."}, {"22": "I've seen the numbers a lot of times, but I've only tested this with my chapter 5 city so I at least have a passing morbid curiosity as to how that will translate on my advanced city. Certainly with the small city doing 6 rounds of 10 provinces is a breeze I can do with my eyes closed. If that much is harder with my main city then something will seem really wrong with that.[BR][BR]No, I'm not looking forward to it either though. From a personal point of view I'll be losing 4-500KP a week so the novelty will quickly wear off (after week 1, I think.) After my initial testing I will probably be making decisions as to which Ancient Wonders to delete."}, {"77": "I have not seen one positive post/comment about these changes that are due to come into effect from the 18th August.[BR][BR]With only 4 days to go why doesn’t Inno Games make a comment or some kind of acknowledgement?[BR][BR][BR]¯\\_(- _ -)_/¯"}, {"32": "StarZ arc said:\t\t\tI have not seen one positive post/comment about these changes that are due to come into effect from the 18th August.[BR][BR]With only 4 days to go why doesn’t Inno Games make a comment or some kind of acknowledgement?[BR][BR][BR]¯\\_(- _ -)_/¯\t\tClick to expand...[BR]There will be positive comments from people who did 200 points and like it that now they can do 300 points with less effort [smilie--sprite2]"}, {"33": "CrazyWizard said:\t\t\tThere will be positive comments from people who did 200 points and like it that now they can do 300 points with less effort [smilie--sprite2]Click to expand...[BR]I'm positive with the changes and I do a bit more than 200 points [smilie--sprite2][BR][BR]Most happy for the less clicking required. Also positive that it will be a real challenge, as now the fights are mostly easy to win. [BR]Also if you can't see it, the tournament was giving away to much kp. So reducing the amount of kp given out is a good thing to avoid to much inflation. Many of you who write here sounds like you would enjoy a button that gave free instant kp's.  How fun would that be? A game is meant to be a challenge."}, {"32": "valle said:\t\t\tI'm positive with the changes and I do a bit more than 200 points [smilie--sprite2][BR][BR]Most happy for the less clicking required. Also positive that it will be a real challenge, as now the fights are mostly easy to win.[BR]Also if you can't see it, the tournament was giving away to much kp. So reducing the amount of kp given out is a good thing to avoid to much inflation. Many of you who write here sounds like you would enjoy a button that gave free instant kp's.  How fun would that be? A game is meant to be a challenge.\t\tClick to expand...[BR]I am fine with less KP, I am not fine with that 2 players in the same chapter have up to a 400% difference in SS.[BR]For me that kills the entire change.[BR]Thats not a challenge thats competition killing."}, {"27": "valle said:\t\t\tAlso if you can't see it, the tournament was giving away to much kp. So reducing the amount of kp given out is a good thing to avoid to much inflation. Many of you who write here sounds like you would enjoy a button that gave free instant kp's.  How fun would that be? A game is meant to be a challenge.\t\tClick to expand...In the feedback I read (I joined beta because of the tournament changes) it didn’t seem to me that people are demanding back those huge amounts of KPs. Yes, they regret the loss (who wouldn’t?), but from what I read people understand that it was a bit too much. ;-) Therefore I find your accusation unfair and above all simply false.[BR]Anyway, there are other ways to address this problem. It doesn’t call for changing tournament into Spire 2. Just an example of less dramatically changes: Inno could simply change the rewards in provinces 10+, or maybe it would be enough to keep the rewards rotation similarly as it is in 1-9 provinces (doing just 2 easy rounds wouldn’t give all those KPs then).[BR]The bad thing about the Spire system is that it prevents players to take over the load for missing players (vacations, real life issues, smaller fellowships or simply for players disinterested in tournaments). It also pushes for doing more rounds and therefore being online on the clock which is very inconvenient for players with 16 hours cool down or in less favorable time zones.[BR]All the relevant feedback is in the two feedback threads on beta forum, but it’s rather hard to go through it now with over 1000 posts."}, {"15": "MinMax Gamer said:\t\t\tNow, in the new format you'd be hitting 2.0x (e.g. twice as many enemies as your troops) by about province #30 - and that is in 1*. 2.0x fights by Inno's own classification are supposed to be practically impossible. Having extra troops won't help if you're taking a complete loss.\t\tClick to expand...See this is the part that doesn't make sense to me. Why not allow people do go past a certain point? If they don't want people to get more KPs the easiest solution, as @FieryArien has also pointed out, is to just change the rewards. But Inno seems to never want to cap rewards (like for the Phoenixes and bears etc...) and the only explanation I have for that is that they want people to only be able to get those rewards if they pay for it. Which is fine, they have to earn money after all. But in this case, even if someone would actually buy all the troops they can afford, they couldn't go passe that 2.0x fights point. So what's the point of leaving the option if even with diamonds no one could go past it? It would be far more logical to cap/change the rewards and let people who like to compete and get high scores just do it for the scores."}, {"22": "Hekata said:\t\t\tBut in this case, even if someone would actually buy all the troops they can afford, they couldn't go passe that 2.0x fights point. So what's the point of leaving the option if even with diamonds no one could go past it? It would be far more logical to cap/change the rewards and let people who like to compete and get high scores just do it for the scores.\t\tClick to expand...You could still cater the encounter with diamonds."}, {"15": "Pauly7 said:\t\t\tYou could still cater the encounter with diamonds.\t\tClick to expand...Right, I forgot about that. I don't see many people doing that though."}, {"22": "Hekata said:\t\t\tRight, I forgot about that. I don't see many people doing that though.\t\tClick to expand...No it would be very costly. I imagine that they are intending to remove everyone's stockpiles of T1-3 goods though so we all go back to living hand to mouth."}, {"33": "FieryArien said:\t\t\tIn the feedback I read (I joined beta because of the tournament changes) it didn’t seem to me that people are demanding back those huge amounts of KPs. Yes, they regret the loss (who wouldn’t?), but from what I read people understand that it was a bit too much. ;-) Therefore I find your accusation unfair and above all simply false.\t\tClick to expand...[BR]Just by reading this thread you see people writing about the loss of kp they will suffer. Personally I do as many fights as I do solely for the kp rewards, no way I would do all that mindless clicking if I didn't get anything back. I usually do all possible provinces to level 2 + 18 first to lvl 6.[BR]So I'm pretty sure, all those kp's are a big factor for doing many provinces.[BR]Then there might be a few that only want #1 spot, but I don't think they are that many as there is only 1 #1 spot [smilie--sprite2]"}, {"70": "That screenshot over there is scary... I am happy to see this, and I guess it will be the last time:[BR][IMG]https://i.ibb.co/9425Fz0/https-en-forum-elvenar-com-index-php-attachments-photo-jpg-4623.jpg[/IMG][BR](First time I get to page #6) And not sure if six-star them all or not, as I see I better save my units.[BR][BR]IMHO, this change is due to new player base sticking with the game. Maybe Elvenar has a high quit ratio, and for players to like more the game, they need to enjoy the tournament. My tiny town in beta, on purpose as I am emulating a real life place, is six starring 9 provinces, before, I could only do 500 pts or so.[BR][BR]Expect good comments, yes...[BR][BR]In my big city, where I bought several expansions, I have 42K worth of AW pts (only at S&D), I am going to be very screwed. But what you gonna do?[BR][BR]I honestly think that it's not worth for INNO that we get 600-2000 KPs every week, and AW are powerful, with such knowledge injections, you can grow exponentially even more, and fast. Especially, if you are in the right FS. When you need to boost a 32-hour left AW because is time to work on it again, you will understand it.[BR][BR]With spire sets, working your spire, and crafting the right stuff non-stop, you can perform quite well in the tournament, and complete the spire. You will get back worth in tools and boosters the extra investment, plus a host of spells and KPs. If you know how to do it right, you can get a lot, check my city at Wynador... Of course, with the former tournament, let's enjoy this last steel [smilie--sprite8].[BR][BR]Those CC will become much more valuable, as our supply of runes is going to reduce massively, and no one is paying attention to the runes... and that will be a problem in a few months if you keep producing CCs, and crafting non-stop, something required to upkeep this ring of progress... Probably not worth it, and INNO is a business, after all, Elvenar a product, they need this change, and it will be probably better game-wise, even though is worse personal-wise for some of us.[BR][BR]But it will be a \"new reality\" in elvenar, where we all exponentially will grow much slower, but more new people will stick to the game due easier tournies for the game, something great for the game, as they will grow, and good for INNO, so Elvenar continues to be worth running, otherwise, it takes a few clicks to delete Elvenar from the servers, and in our T&C we agreed to this, whether we spent $0, or $20K in the game."}]