[{"84": "I have to agree with @Maillie"}, {"54": "Timneh said:\t\t\tI have to agree with @MaillieClick to expand...think as players we all agree on everything, but does that matter? [smilie--sprite1]"}, {"30": "valle said:\t\t\tFor me this tournament felt like a game again and not like a part time job. So I'm very positive on the new format.[BR][BR]The 1 fight/province is the most important change. But I also like that the fighting has become moire challenging. Earlier it was often so easy that you just loaded the same five units and won with light losses. No thinking or skill involved. Now you must think a bit before just pressing auto (I always autofight) and maybe think about catering if it looks to costly to fight. A game is supposed to be a challenge. If it's too easy it becomes boring.[BR][BR]A bit surprisingly I scored as usual (maybe even a bit better). Earlier I did all possible provinces to level 2 and the first two pages to level 6 or 5. Now I did fewer to level 2 but a lot more to level 5.[BR][BR]My only negative input is that the rewards for the extra chests are not that great.\t\tClick to expand...[BR]I agree that we should take it as a new experience. However, this change makes the manual fight a lot more important in order to preserve the troops due to the huge squad size. It will take days to recover from one bad encounter. Then what about Mobile App players? I read somewhere that Inno will not look at manual fights in the Mobile App at this point."}, {"70": "CrazyWizard said:\t\t\tYou are exactly at the sweetspot we predicted, when this change was announced[BR][BR]Low chapter, \"maxed out needles\" (31 since you don't have sentient unlocked for a while) for max units, and very limited on wonders (157 levels)[BR]You are the ultimate proof that progress is regress. you just have what you need and nothing more.\t\tClick to expand...[BR]I am well aware that I have a lot of AW level for my chapter level, but is my play style. Sure, it's fewer KPs, we all know that but honestly I thought that it would be even worse, and several of my high-leveled guildies.[BR][BR]Oh, for level 31 I had to pay diamonds already as I did not have the stuff it asked me, I had the 250K orcs available, but not the other three RSS, but it would be worth in 72 days (already), however, level 32-25 is not worth it... not even with sentient goods, but the 2K KPS it requires."}, {"117": "I must still give my feedback. Was a bit busy with preparing for the FA.  I play chapter 3 cities and I am probably worse off than @AstraSoul wrt to AW levels as that is where all my kps go.  My Golden Abyss is level 30. Can not upgrade further, as someone in their wisdom thought than only high  chapter cities will be interested in upgrading further. Asking for ridiculous amounts of orcs and sentient goods, which is not available at this level.  My Needles is also fairly advanced and some random players just love giving me kps, but that is besides the point.[BR][BR]Goods to cater/negotiate:[BR]Old way: Coins, tools and t1.  Any time I just saw coins and tools, I catered. Saved on troops and allowed me to do a province or two more.  This was with only one non compulsory squad size upgrade not done. Was able to do 2000+ points on certain tourneys.[BR]New way:  Coins, tools, t1, t2 - with seeing t1 and t2 between 60 to 80% of the time.[BR][BR]T2 for this level only came into play at the end of chapter 3 under the old system if all squad size researches were done.  Chapter 3 cities are therefor worse off than they were before.  This is not right. [BR][BR]I am going to show the requirements for my first province and my eight province (where the squad sizes were about equal).  The second picture will also include my stock I have built up over a long time and which I would like to consider as my sustainable level.  Although I do not have to keep goods for expanding provinces or doing research, spire eats a lot of goods and catering in tourneys is not an option either with the amounts of goods needed in the new way.[BR][BR]Fighting:[BR]Fighting under the old system had its advantages as once you got to tent 10, you usually got only 2 kinds of opponents. Under the new system you can get all 5 which makes it far more difficult, which leads to more troop losses, resulting in less provinces done and less points scored.  I also did not get as far as I usually do in planks, which is supposed to be an easy province.  I play on app.[BR][BR]I prefer the old system, even with its many clicks.[BR][BR][BR][BR]"}, {"45": "@30158729 Devs are still collating the information and have yet to come back to us. As soon as we get anything that we can pass on we will do so.[BR]Meanwhile we are amazed that the full 19 chests were indeed done on week one, that is amazing and kudos to the Fellowship for this."}, {"25": "Silmaril said:\t\t\tMeanwhile we are amazed that the full 19 chests were indeed done on week one\t\tClick to expand...[BR][BR]The fact that a fellowship was able to do the 19 chests shows that the ones that skirted the old tournament parameters, along with many other teams, are going to blow this away also.  Is that a punishable offense?  Of course not.  They're playing to the best of their ability with whatever tools you gave them. The ones that are hurt are the average players in the late chapters, for no logical reason.[BR][BR]I'm not sure if those that finished Embassies, strangled by their accumulated diamond expansions and AW's, are wanting to hear that this is \"working as intended.\"  I believe it must be or it wouldn't be in the EN world."}, {"73": "Maillie said:\t\t\tI'm not sure if those that finished Embassies, strangled by their accumulated diamond expansions and AW's, are wanting to hear that this is \"working as intended.\" I believe it must be or it wouldn't be in the EN world.\t\tClick to expand...Most of us are thinking of losing AWs , which is counter gaming, yearning to roll back on premium expansions and undo tech upto those 3* military units.  [BR][BR]And then where to dump the kp? [BR](I own an aquarium) prevalent stagnation of the fish is a sure sign of sickness and eventual death.[BR][BR]PS : no one (I know of at least) would buy those diamonds for expansions or tech or other stuff anytime soon, knowing there is a hidden variable in these, that’s going to work against you."}, {"33": "JollyElf said:\t\t\tyearning to roll back on premium expansions\t\tClick to expand...[BR]Think a bit. A player with all premium expansion is surely able to advance further in Tournament than one with none. Even if the player wilth all expansion might do a few less provinces by fighting, all those premium expansions will make it possible to cater more provinces. So the net effect will be positive."}, {"20": "It seems like the general assumption is if you have more expansions, of whatsover nature, you will have more room for manus and armories.  I do not think that is the case for all.  For me, just to progress from chapter to chapter, you need more space as all buildings get bigger and associated requirements get more.  That is even without taking into account the massive amount of space you need to be even able to play the guest race requirements at a half decent pace.  Yes, I have seen cities with 13 armories, but on average, most people just have 2."}, {"22": "The reward in each bonus chest is 10 AWKP + 1 x RR spell."}, {"93": "thanks Pauly. then it is really not worth the effort."}, {"22": "Princess Penelope said:\t\t\tthanks Pauly. then it is really not worth the effort.\t\tClick to expand...Not really. Those bonus chest prizes are fairly nominal. They're really there for teams just wishing to push for records. The 10th chest is still the main goal."}, {"54": "Princess Penelope said:\t\t\tCan anyone here tell me what was the prize for the first bonus chest after the 10 chests were done? I was under the impression that it was a blueprint and kp.[BR][BR]I asked support and got this wonderful answer:[BR]DELETED AS AGAINST FORUM RULES[BR]We already played the tournament last week! [smilie--sprite4][smilie--sprite4][smilie--sprite4]Click to expand...hmmm don't ask me why, but i also tought it would contain blueprints. I guess we both read while we were wishfull thinking, or they changed the reward in their announcement."}, {"70": "Princess Penelope said:\t\t\tCan anyone here tell me what was the prize for the first bonus chest after the 10 chests were done? I was under the impression that it was a blueprint and kp.\t\tClick to expand...[BR][IMG]https://i.ibb.co/8nyxBCj/https-en-forum-elvenar-com-index-php-attachments-prizes-jpg-4699.jpg[/IMG][BR][BR]12 chests, the four-five of us that work the hardest the tourneys, we can probably deliver 40% more, so I see 13-16 chests fine in my FS with pushes to 19th.[BR][BR]Those are all chest rewards, we have to add all the individual rewards, in my case 25 provinces six-star, 26th and 27th 2 stars, and 28th-30th one star (to satisfy my \"OCD\" and reach a 7K score hehe)[BR][BR]11th-19th is one RR I think and one 15KP spell (or was it ten?) did not pay much attention, but as per the image above 10+2extra chests."}, {"118": "Hi all, yes our fellowship did 19 chests, but it was a test run and also we are overachievers enthusiastic and capable people so whenever we have a challenge we try to crack it [smilie--sprite1][BR]Several of us dislike the FA and look at where we are ... [smilie--sprite7][BR][BR]We were 24 at the time, so it was even harder and there was some struggle, I won’t deny it, me included, I have 357 AW levels, and I was greatly penalised by the new format, it was at times almost impossible so I had to find the time to play manually or to even cater several encounters... I used a lot of instants and pet foods... I really hope Inno will listen to our struggles and make some changes as I too believe that higher chapter players are more penalised with the present format.[BR][BR]We are still wondering as a team if this is sustainable which I am not sure at all, but hence the reason of the 3 weeks test I guess [smilie--sprite1][BR]This is a new challenge though and challenges are part of a game![BR][BR]So we will see in 2 weeks, if the tournament becomes a chore and if Inno doesn’t do anything to soften the system a bit, for sure a few people that I know of will be looking for another game, as game is ment to be fun not create more hassle.[BR][BR]Cheers! <o"}, {"70": "Yeah, we are a similar type of FS, just went a bit easier and not deplete ourselves the first week. We are trying with buffers this week, and see... [BR][BR]We are also doing gentle-FA this round, most of us were not pumped for this one and/or caught us badly. [BR][BR]I saw today in beta they are softening provinces, that is an addition."}, {"93": "Kaliartis said:\t\t\tI have 357 AW levels, and I was greatly penalised by the new format\t\tClick to expand...Karliartis,  agree with you and I sincerely hope Inno has the ability not to compare apples with pears. [BR][BR]The people on this forum who raved about the new format was the smaller players with less aw upgrades and in a lot lower chapters than us.  You see players who boast here about their accomplishments and how easy it is but if you look closely you see that their AM has exactly the same view as us and complains just as hard. For larger players it is unfair to \"punish\" them for expanding, progressing and upgrading ancient wonders in the manner that was promoted to us when we started playing 3 years ago.I am glad for the small players but at the same time when we were that size Inno did not make it easier for us. In life nothing come for free you have to the work otherwise you do not appreciate the rewards.[BR][BR]I would like to give Inno the benefit of the doubt but i suspect they will do \"selective\" analysis and only prefer to acknowledge the very very few positive comments and ignore the discontent and unhappiness of the majority of loyal long time players. But in that case we move to another game and definitely not one designed by Inno."}, {"25": "I have to believe that the devs need to look into other forms of rewards for the tournament.  Some time ago they changed the reward system from kp that could be used anywhere to Ancient Wonder tokens.  Now they have poisoned the Ancient Wonders to work against us.  Why are we earning AW tokens in a tournament that's harder if we use AW tokens?"}, {"20": "Nothing is sustainable if you need a lot of instants and pet foods!!!!"}]