[{"118": "BlueBlou said:\t\t\tNothing is sustainable if you need a lot of instants and pet foods!!!!\t\tClick to expand...[BR]How do you think I have 13-14k average in tournaments [smilie--sprite2], with lots of pet foods and instants that is why we always finish The Spire because of all the tourney goodies the 3 stages provide [smilie--sprite8]"}, {"14": "valle said:\t\t\tThink a bit. A player with all premium expansion is surely able to advance further in Tournament than one with none. Even if the player wilth all expansion might do a few less provinces by fighting, all those premium expansions will make it possible to cater more provinces. So the net effect will be positive.\t\tClick to expand...[BR]If the province requires more than 100% of your regular daily production, a few extra premium expansions will not help you cater more. It will just increase the costs of the catering."}, {"32": "Kaliartis said:\t\t\tHow do you think I have 13-14k average in tournaments [smilie--sprite2], with lots of pet foods and instants that is why we always finish The Spire because of all the tourney goodies the 3 stages provide [smilie--sprite8]Click to expand...[BR]Spire doesn't give out pet foods [smilie--sprite2] but yeah loved the spire for just that.[BR][BR]valle said:\t\t\tThink a bit. A player with all premium expansion is surely able to advance further in Tournament than one with none. Even if the player wilth all expansion might do a few less provinces by fighting, all those premium expansions will make it possible to cater more provinces. So the net effect will be positive.\t\tClick to expand...Maybe you should be more reserved with that remark,[BR]They have made changes(lowered the number for expansions), but the preliminary results arent that favorable. it seems the lowering is minimal but untill the new formula is known for sure we cannot tell.[BR][BR]And no the person with all expansions unlocked is not always able to advance further in the tournaments, I wish it was that way.[BR]Each expansion, research and wonderlevel make the tournaments more expensive. and to make it worst the values are multiplied with eachother.[BR]At a certain point the \"other values\" could be zo big that an extra expansion adds more difficulty to the tournaments than you gain from the extra space.[BR][BR]example with fake values to demonstrate this:[BR]Expansion value rises from 3 to 4[BR]Reseach value is 7[BR]Wonder level value is 0.5 in case 1 and 2.1 in case 2. (~150 vs 700 wonderlevels)[BR][BR]Case1 :[BR]3*7*0.5 = 10.5[BR]4*7*0.5 = 14[BR]---------------------[BR]Difference added by expansion is 3.5[BR][BR]Case2:[BR]3*7*2.1=44.1[BR]4*7*2.1=58.8[BR]---------------------[BR]Difference added by expansion is 14.7[BR][BR]Just because \"other\" parameters are different the added value from can differ greatly, and depending on those values the difference in this case from the same expansion for a player at the same stage in game, the difference is 420% in how much the expansion adds in tournament difficulty.[BR][BR]Do not forget those 700 wonderlevels also take precious space so it's a double whammy in this case.[BR][BR][BR][BR]If values would have been added up, then yes you could day that space would have a net gain but as long as multiplications are used you have to be very reserved with telling people to think.[BR]In addition to that it looks likes with the last changes to the formula that advancing in the tech tree will have a greater negative effect than in the past, as a counter to the slightly lowered expansion rate, since this is en exponential number, even the tiniest change might have huge effect when we get new chapters added, the change might be so huge that the next chapter will be worse for your tournament results than the current last chapter.[BR][BR]Go figure."}, {"118": "CrazyWizard said:\t\t\tSpire doesn't give out pet foods [smilie--sprite2] but yeah loved the spire for just that.\t\tClick to expand...[BR]Spire doesn’t give pet foods per say but with the diamonds and the time instants you get from it, you can use them to craft more from the MA [smilie--sprite1]"}, {"60": "Thanks @Silmaril looking forward to it.[BR][BR]For this weeks tournament they have changed the enemy troop types as they are much less random and mist walkers arent in 60% of fights. This is a positive change im glad to see."}, {"76": "Not a fan of the enemy troop combination for this tournament, With only the fire fed (what most do most weeks) i was losing 1-2 of my squads per battle from province 10 on with squads size being so big that would be 3-5 real squads per battle squad lost, and that was only getting to 20 provinces.[BR]With the main combinations of M,HR,LM i could never field one type, which generally rules out auto as using more than one type gets heavy losses. [BR]And even doing manual combat my units still died quickly. 2 cannoners (enemy mortar units) managed to bring a full health priest down to under a 1/4 health in one round."}, {"84": "Kaliartis said:\t\t\tSpire doesn’t give pet foods per say but with the diamonds and the time instants you get from it, you can use them to craft more from the MA\t\tClick to expand...[BR]You can if you get the pet food recipes. The only reason i say this is because i have not seen pet food in crafting for a few days and i check regularly."}, {"65": "Timneh said:\t\t\tYou can if you get the pet food recipes. The only reason i say this is because i have not seen pet food in crafting for a few days and i check regularly.\t\tClick to expand...of course, if you just wait and look, you don't get enough pet foods and troops buildings, but Spire gives you enough diamonds to roll on good recipes"}, {"118": "Timneh said:\t\t\tYou can if you get the pet food recipes. The only reason i say this is because i have not seen pet food in crafting for a few days and i check regularly.\t\tClick to expand...It's the opposite for me, I see it more often than before, but I guess it's random...[BR]When I am in high need of pet food though and I have some diamonds to spare, I shuffle the MA by paying 50  until I get some [smilie--sprite1][BR]kurgkurg said:\t\t\tof course, if you just wait and look, you don't get enough pet foods and troops buildings, but Spire gives you enough diamonds to roll on good recipes\t\tClick to expand...Exactly that [smilie--sprite2]"}, {"20": "Kaliartis said:\t\t\tIt's the opposite for me, I see it more often than before, but I guess it's random...[BR]When I am in high need of pet food though and I have some diamonds to spare, I shuffle the MA by paying 50  until I get some [smilie--sprite1][BR][BR]Exactly that [smilie--sprite2]Click to expand...We surely live on different planets, but that is fine with me.  I just hope that your style, ability and way of play is taken as the exception and not the norm. If not, I am a screwed MacBlue."}, {"118": "BlueBlou said:\t\t\tWe surely live on different planets, but that is fine with me.  I just hope that your style, ability and way of play is taken as the exception and not the norm. If not, I am a screwed MacBlue.\t\tClick to expand...Good thing with this game is there are many ways to play it....relaxed, casual, hardcore.....[BR]Our fellowship has been score ranked several times no1 in tournaments globally (in all servers) so we must be the \"hardcore\" ones... Those who go deep into the game..[BR]Don't worry BlueBlou, you're not screwed...just giving tips to those who would like to experiment [smilie--sprite2]"}, {"89": "Honestly i'm just about to sell all my damn AWs as they seem to punish me instead of everything else.[BR][BR]Nah i'm even about to quit as it's no fun. The squad-size needs and the negotiation costs will strip me naked within some weeks, while i never had ANY issues with that - not even remotely close to that - before. Just for doing something around 20 provinces or even less. Honestly... f*** that."}, {"119": "I'm just doing 22 provinces round 1+2 and can't rebuild the troops I lost until next tourney. And I don't want to play tourney every day and do just the easy provinces"}, {"99": "Round 1 of the Crystal Tournament - completed 30 provinces[BR][BR]Troop mix per province:[BR]1HRHMMMM2MMMMMW3HRHRHRLMLM4HRLMLMHMM5HMHMMMMW6HRHRHRLMM7HRHRLMMLR8LMMMMM9HRHMMMM10HRHRMMLR11HRHRMMWMW12HRHRMMM13HRLMMMHM14HRHRHRHRHM15HRHRMHMHM16HRHRLMMHM17HRHRMLRLM18HRHRMLMLM19HRHRHRMLR20HRHRMMWLM21HRHRMHMHM22HRMMMM23HRHMMLMLM24HRHRHRMMW25HRHRMMLM26HRHRHRMLR27HRHRMMMW28HRHRMMLR29HRMMMLR30HRHRHRMLM[BR]Feedback:[BR]The troop mix was much friendlier than that of the previous tournament.It also felt like the terrain favoured me most of the time.Of the 13 times Light Ranged units appeared there were 6 instances where they were Mistwalkers, i.e. nearly 50% of the time. Considering the variety of available Light Ranged units the weighting towards Mistwalkers is thh high.Note: Light Ranged units weren't previously part of the Crystal tournament.There were 7 instances where there were 4/5 unique enemy troop types, i.e. nearly 25% of the time. However, whilst this is higher than in the last tournament (in Planks it was roughly 20%) the friendlier troop mix didn't make all these fights impossible. If this trend continues then this kind of difficulty is ACCEPTABLE. However, if the troop mix is purposefully friendlier in some and completely hostile in other tournaments then this occurrence percentage is too high.[BR]Squad sizes per province:[BR]My SSEnemy SSEnemy : Me %Increase15456912.66%12.66%2108927525.25%12.59%3163461837.82%12.57%42178109850.41%12.59%52722171563.01%12.59%63267247075.60%12.60%73811336288.22%12.61%84356424397.41%9.19%949005204106.20%8.80%1054446261115.01%8.80%1159897187120.00%5.00%1265338167125.01%5.01%1370789202130.01%5.00%14762210290135.00%5.00%15816611433140.01%5.00%16871112509143.60%3.59%17925513624147.21%3.61%18979914777150.80%3.59%191034415972154.41%3.61%201088917204157.99%3.59%211143318476161.60%3.61%221197719787165.21%3.61%231252121136168.80%3.60%241306622526172.40%3.60%251361023954176.00%3.60%261415525423179.60%3.60%271469926929183.20%3.60%281524328474186.80%3.60%291578830061190.40%3.60%301633231685194.01%3.60%[BR]Feedback:[BR]7 provinces increasing at c. 12.6%, 3 at c. 9%, 5 at c. 5% and the rest at c. 3.6% is a lot better in terms of a \"steady increase\". However, it's still too steep in the beginning provinces to be considered a \"steady increase\". I don't understand the fascination with making province 1 very very very easy. Increase the base SS and make the initial increases smaller.Enemy SS didn't hit 150% until province 18, so a little later. Unclear why this can't wait until province 20, which would be a naturally expected cut off point.Ideally, hitting 150% should be even later than province 20, as being virtually 200% by province 30 is still TOO HIGH. There is a caveat here in that due to the friendlier troop mix the battles towards the end weren't terrible, despite the enemy SS. As before, if this trend continues then the SS% is ACCEPTABLE.I lost c.120 squads, which is also acceptable."}, {"99": "Catering costs per province:[BR]CoinsSuppliesT1T2T3OrcsMana1003,6000880002280,00003,5000070003005,3008,0000004560,0000003,5001,40005070,00006,7004,400006840,00000010,600007099,00012,000002,500080028,00007,0000090016,00012,0007,90000100018,00026,000000110019,00009,7003,9000120021,00016,0000034,0001300017,00011,0004,6000142,000,000025,000012,000001500040,00013,00000160230,00028,00021,0000001700046,00015,00000180064,000016,00000190033,00025,00006,700020000036,000056,000213,000,000074,0000000220039,000019,000062,000233,200,000040,000020,00000243,400,000042,000008,4000250044,00068,000000260046,00070,000000270096,000024,00000283,900,00000050,0000029000052,000082,000304,200,000053,00000084,000[BR]Feedback:[BR]Unfortunately, a friendlier troop mix didn't translate into better catering costs. The catering costs are still TOO HIGH.[BR]Overall feedback:[BR]The tournament squad sizes are still too high, which is making the catering costs too high. By province 15 I already had more than 25 actual squads at risk per battle. By province 30 this was up to over 50 actual squads at risk per battle.So, again, I implore you; keep your formula, for better or worse, but apply a modifier to reduce the actual tournament squad size. One slip of the finger or a bad move could cause catastrophic casualties.It was a better experience than the previous tournament but there are still things to improve on."}, {"78": "Silent Tempest said:\t\t\tIt also felt like the terrain favoured me most of the time.\t\tClick to expand...[BR]Thanks for the data Silent Tempest - the only niggle I have is with the combination of new enemy unit complexity and the terrain.[BR][BR]I ended up fighting most of the encounters manually - to reduce losses. The auto probably needs more 'I' in the AI. At higher levels, reducing losses requires increasingly sophisticated tactics - which adds to the time. It now takes me roughly 50% more time to complete 20 provinces. I don't have any issues with that.[BR][BR]I've always found that the terrain has more of an impact when faced with 5 enemy units and so far as I can tell we're still using the same terrains, with the same frequency of appearance as the old tourney. I found the old terrains, coupled with the new unit mix to be even more punitive in terms of loss because of the increased randomness. Round 1 replacement cost for me of 7.1 days (for 27 provinces) - obviously not sustainable.[BR][BR]My wish list would be:[BR][BR]New terrains optimised for 5 on 5 combat only.[BR]More availability MMM,ELR,UUU,DA and food[BR]More events containing troop and time boost prizes[BR]Increased chances of time boosts in the Spire"}, {"33": "axelbloodaxe said:\t\t\tThe auto probably needs more 'I' in the AI.\t\tClick to expand...[BR]But with moe 'I' also the enemy units will fight better. So for auto it will probably be not much difference as both sides will fight better, but manual fighters might get into problems if the enenmy suddenly becomes a lot smarter. So watch up with what you ask for [smilie--sprite2]"}, {"39": "Also, why should there be so much of disparity between two races, elves just suck big time. Not only goods are at the much lower level than humans', but in the tournament they are having the worst time of their lives lol. I have human and elven city, both of them I keep at the same level with the same number of manus and AW levels. Humans can recover faster and do much better in tourney, elves have so many weak and useless units. So if initially the idea was that elves are a peaceful nation and should cater tourneys mostly, shouldn't they produce more goods and then the person running human city would expect to fight and the person running elven city would expect to cater mostly? What is the point of such differences in their fighting strengths and capabilities if they are expected to deploy the same strategies and tactics as humans?"}, {"93": "ShadowVision said:\t\t\tHonestly i'm just about to sell all my damn AWs as they seem to punish me instead of everything else.[BR]Nah i'm even about to quit as it's no fun. The squad-size needs and the negotiation costs will strip me naked within some weeks, while i never had ANY issues with that - not even remotely close to that - before. Just for doing something around 20 provinces or even less. Honestly... f*** that.\t\tClick to expand...i totally agree with you.  well this week i can fight to... whoa... wait for it province 15. what an improvement from being able to do 30 plus provinces before! NOT. this is ridiculous and people rave about how much better this week is? sorry, Inno its is still messed up big time."}, {"24": "valle said:\t\t\tThink a bit. A player with all premium expansion is surely able to advance further in Tournament than one with none. Even if the player wilth all expansion might do a few less provinces by fighting, all those premium expansions will make it possible to cater more provinces. So the net effect will be positive.\t\tClick to expand...[BR]That is Innos theory, yes. And I agree it is true up to a certain point. [BR]However the formula multiplies your expansions with your tech and your AWs, which means that someone at the end of the research tree with a lot of AW levels will most likely not be this case, because every expansion costs him multiple times as much as a low chapter/low AW town, where this theory is true."}]