[{"32": "Gargon667 said:\t\t\tThat is Innos theory, yes. And I agree it is true up to a certain point.[BR]However the formula multiplies your expansions with your tech and your AWs, which means that someone at the end of the research tree with a lot of AW levels will most likely not be this case, because every expansion costs him multiple times as much as a low chapter/low AW town, where this theory is true.\t\tClick to expand...[BR]Not just wonderlevels, the same counts for research, at some point the multiplication makes any advancement \"bad\" for spire / tournaments. for each wonderlevel / expansion / premium expansion / research it will be at a different point in game and depending on the other factors. it's very complicated since it's all connected to eachtother so the turn over point for each depends on the other factors.[BR][BR]It also depends on the \"impact\" of the wonder / research / building you can build/level, complete of build."}, {"24": "Silent Tempest said:\t\t\tFeedback:[BR]The troop mix was much friendlier than that of the previous tournamentClick to expand...[BR]It sounds like you believe the devs to have planned or changed anything since last week. That is not the case. this is Crystal tourney and last week was Planks. I of course cannot guarantee anything, since I don´t know what they did, but so far we are getting exactly the troops we expected, and I assume this will continue.[BR][BR]The game has reduced its options to 3 kinds of each type of unit I believe, that makes a total of 15 possible units. I wonder why they limit themselves that much, because one of their goals was more diversity.[BR]Each weak 1 or 2 types (3 or 6 units) will be favored. [BR][BR]Planks has always been with a main unit of LR, so it was also in the new one. Means most units you encounter every time is LR. I assume that each of the 3 LR units has the same chance of showing up (but that may not be true).[BR][BR]Crystal has always been a weird tourney, with the main type being mages, but the tourney actually being focused on the 2 support types, one of which (HR) had a greater variety of units than the main type. So now we get a tourney with 2 Main types, the previous main type Mage and the previously most diverse type HR. [BR][BR]At least so far we have been getting what was expected. But even if the trend does not not continue (I think they mentioned something about HM in Silk???) I am sure that all the main units for all the tourneys have already been set. They are not going to change them based on feedback every week.[BR][BR]The bad news for you: next week is scrolls tourney, which has always been a LR tourney, which means Scrolls will be exactly the same tourney as Planks. the only possible difference I can see is the introduction of a second main type (M or HR), if they wanted to make sure that no 2 tourneys are exactly the same. introducing another main type would reduce LR (and therefore Mistwalker) occurrence a little bit compared to Planks, but up from this weeks Crystal.[BR][BR]Anyway I am glad units are not completely random, so we actually get different tourneys every week, I personally would like it if they kept the old main types with potentially a second main types (out of the previous supporting types), so the tourneys stay similar to what they used to be in at least some way. eventhough of course difficulties will change a lot and for example Planks and Scrolls would end up being a similar difficulty.[BR][BR]Silent Tempest said:Of the 13 times Light Ranged units appeared there were 6 instances where they were Mistwalkers, i.e. nearly 50% of the time. Considering the variety of available Light Ranged units the weighting towards Mistwalkers is TOO HIGH.Click to expand...[BR]I do not see any evil design here. Apparently they have reduced the pool of available units to 3, which means the MW is going to be 33% of all LR occurrences at only 6 of 13 occurrences that means only 1 or 2 more than the average suggests. You simply have not been lucky to get less than average. Of course there is a possibility that MWs have a higher probability than the others, but it will require far bigger sample sizes to sure.[BR][BR]Silent Tempest said:Note: Light Ranged units weren't previously part of the Crystal tournament.Click to expand...[BR]True but irrelevant. All unit types now have a chance to appear in any tourney. That was one of the goals (bigger diversity) Inno outlined for the changes.[BR][BR]Silent Tempest said:There were 7 instances where there were 4/5 unique enemy troop types, i.e. nearly 25% of the time. However, whilst this is higher than in the last tournament (in Planks it was roughly 20%) the friendlier troop mix didn't make all these fights impossible. If this trend continues then this kind of difficulty is ACCEPTABLE. However, if the troop mix is purposefully friendlier in some and completely hostile in other tournaments then this occurrence percentage is TOO HIGH.Click to expand...[BR]I find 20 or 25 % of more than 3 types also acceptable, more would make it too close to the other option (\"completely random\") but much less would simply bring us back to what it was before, which is not necessary either, I like more diversity myself, the problems are in other places.[BR][BR]Troop mix is certainly going to be different in different tourneys, some will be harder, some easier, just as it has always been. I am happy with that."}, {"117": "Crystal tourney:[BR][BR]Previously could do 20 provinces with ease. Now, even with red phoenix activated, can only do 11 in round 1.  This sucks!"}, {"22": "pompeywolf said:\t\t\tNot a fan of the enemy troop combination for this tournament\t\tClick to expand...Me either. This week seems way harder than last week. I haven't yet had one sensible troop combination."}, {"35": "Yeah this tourney the troop combinations do feel tougher, but then, the Crystal tourney was one of the tougher ones before the change too.  I hate to think what awaits us next week for the dreaded Scrolls tourney!  [smilie--sprite5]"}, {"22": "Paladestar said:\t\t\tYeah this tourney the troop combinations do feel tougher, but then, the Crystal tourney was one of the tougher ones before the change too.  I hate to think what awaits us next week for the dreaded Scrolls tourney!  [smilie--sprite5]Click to expand...This week I've found myself needing to use light ranged, mage and heavy melee troops in almost equal proportion and almost as many light melee. The only one I am not using is heavy ranged. Due to the way the troop combinations are appearing there has been almost nothing suitable for auto-fighting."}, {"2": "This tourny sucks. I never EVER had to cater before. I think, for the last year (maybe more) I never catered. Expensive or not (in terms of lost troops) I never lost a battle. Today, I had to cater most of provinces after I lost several in a row. I am between ch.16 and maybe ch.17, so I have lots of mana and orcs to waste but to cater isn't a viable long term solution. Not when one encounter asks the orc production for a day - and were many!.[BR]I do not like the new tourny (except the 1 encouter instead of 4). Actually I lie .... I Hate This New Tourny!!!!"}, {"88": "@Silmaril , @Muf-Muf , I have some feedback regarding planks and crystal tournament. In both my city had a DA, UUU, LR, MM deployed and fire chicken has been fed.[BR][BR]The variety of enemy units looked pretty much the same as in the previous format with some odd balls and differences here and there. A good amount of the encounters had me thinking on how to beat the enemy. That I enjoyed quite a lot.[BR][BR]In addition with the merge into one province, this puts one a bit on edge, since a loss can deal a blow. This I appreciated as well.[BR][BR]With the boosters above deployed I have been able to do 30 provinces up to 5 * and some 6* at the top.[BR]Previously I would have been able to get up to 40 5* and when training around 400 squads of required units I was able to do all the currently possible provinces on my map.[BR][BR]The way city seems to be setup now at the beginning of Chapter 16 seems favourable towards how I can cope with the tournament, so from my personal point of view i'd say I am quite happy.[BR]I did cater some of the provinces in-between and mostly also provinces from 25 - 30.[BR][BR]Now however some of my fellows and member here in the forum are not doing well at all!! So this makes me wonder whether these obvious imbalances will be addressed properly to ensure an overall more even field. How will you address this?! Again some response would be much appreciated.[BR]How would play with less boosters look I would still have to try, though I guess this would be brutal.[BR]Currently I am able to sustain creating booster buildings in the MA and do have buildings in stock for about 8 weeks.[BR]Would this then be considered the new way? No or very hard play without boosters?[BR][BR]Cheers, Meli"}, {"88": "Pauly7 said:\t\t\tThis week I've found myself needing to use light ranged, mage and heavy melee troops in almost equal proportion and almost as many light melee. The only one I am not using is heavy ranged. Due to the way the troop combinations are appearing there has been almost nothing suitable for auto-fighting.\t\tClick to expand...[BR]I can confirm this. I had about the same distribution of needed units. LR, M, HM, LM"}, {"89": "Melianora said:\t\t\t[...] In both my city had a DA, UUU, LR, MM deployed and fire chicken has been fed.[BR][...] Now however some of my fellows and member here in the forum are not doing well at all!!\t\tClick to expand...[BR]I would guess not all of them have Fire-Phoenix + DA + UUU + LR + MM in their setup.[BR][BR]From my observation, without anything, you hit the first wall around province 12.[BR]The Fire-Phoenix may get you up to around province 18.[BR]A Dwarven Armory may boost that up for another 6 provinces.[BR]Any other boosts like UUU, LR, MM may also squeeze out like 2 provinces each if combined with DA / Fire-Phoenix.[BR][BR]*EDIT: The above numbers are depending on the tourney-type. In crystalls i get ~2 provinces less far with the same setup as i did in planks. That may be even 4 less in scrolls, if scrolls will be still the hardest within the new tourney-mechanic.[BR][BR]But that is in no way sustainable on a weekly basis. I rarely get any booster out of the MA on the 2 cities i play. Maybe 1, at best 2 a week. I'm already happy if i get 2-3 pet-foods out of the MA each week. Except you spend diamonds into the MA, but with spire-bronze or even silver (like your FS) this is far from sustainable.[BR][BR]But even with the above setup of yours, i would guess you have to feed the brown-bear + time-boost your training, as 1 lost match will already kill  a whole days (or more) troops production.[BR][BR]Looking at my fellowship, less advanced players have less problems with the tourney as i do. Reports are \"it's easier as ever\", while i can't confirm that in any way. I was the top-scorer in the past at every tourney, now i'm close to the middle-field, while already playing the tourney in a near unsustainable way. The ppl above me are less advanced players and tell me they have no issues at all.[BR][BR]I'm a bit baffled that you have such an easy time, as there are not that big differences between us, besides 2 chapters difference (14 vs 16) and you have 9 less expansions and 14 less AW-levels.[BR][BR]But even if it's possible to reach 30 provinces with like 5 booster-buildings + fire-phoenix + brown-bear + time instants... it's not even closely worth it. The investment to gain only some more KP, Enchantments, Relics and Runes is simply not worth it.[BR][BR]Yet alone i have to go further within the spire to barely gain the needed amount of time-boosters for training, costs a furtune of goods, mana, seeds and other stuff, only to invest another load of the same stuff into the tourney anyway, as even with all of the above, there are provinces you simply won't win and those are asking for a whole days production of x or even more.[BR][BR]There may come a point where i have to decide if i want to do the spire, the tourney, research or if i want to upgrade my buildings. That wasn't the case in the past, as thx to the old tourney, it was worth it to invest into the tourney and make profit out of it. I could reduce my workshops, as i gained a good amount of enchantments. Same with factories. Now my stock of enchantments will deplete with each week.. unless i invest more into the tourney as i could ever get back from its rewards.[BR][BR]The relation between investment <-> reward, in my eyes, is broken now.[BR][BR]The fights may be more intense, as there is some more diversity, that's something i can accept and i may even like it, but it's a big downside for auto-fighers/mobile players. But the losses you have, make it no fun, but only frustrating."}, {"88": "ShadowVision said:\t\t\t*EDIT: The above numbers are depending on the tourney-type. In crystalls i get ~2 provinces less far with the same setup as i did in planks. That may be even 4 less in scrolls, if scrolls will be still the hardest within the new tourney-mechanic.\t\tClick to expand...Yes, scrolls will be interesting! [smilie--sprite9][smilie--sprite9][BR]I would surely worry should I once run out of booster buildings [smilie--sprite3] [BR][BR]ShadowVision said:\t\t\tBut even with the above setup of yours, i would guess you have to feed the brown-bear + time-boost your training, as 1 lost match will already kill  a whole days (or more) troops production.\t\tClick to expand...Since we started climbing the Spire I have always been using the time booster to make troops, combined with the Brown Bear when possible. That is the only way this has been working for me well, even before the testing tournament format, since I do like to have ample troops ready![BR]What certainly also makes is Simia Sapiens in addition with Brown Bear.[BR][BR]ShadowVision said:\t\t\tI'm a bit baffled that you have such an easy time, as there are not that big differences between us, besides 2 chapters difference (14 vs 16) and you have 9 less expansions and 14 less AW-levels.\t\tClick to expand...Yes, that is something that is worrying me a lot, since we don't know what will break or make your city successful in tournaments with this testing format [smilie--sprite3] - Someone who has it easy now, might cry after some city development and someone who is struggling now, might suddenly be cheering that everything is simple! [smilie--sprite11][smilie--sprite12][BR][BR]ShadowVision said:\t\t\tBut even if it's possible to reach 30 provinces with like 5 booster-buildings + fire-phoenix + brown-bear + time instants... it's not even closely worth it. The investment to gain only some more KP, Enchantments, Relics and Runes is simply not worth it.\t\tClick to expand...That I will disagree upon. Even if the KP, Spells, Relics and so forth are lower now in return, those are what keep my city running and makes it possible for me to not have to worry about Supplies, Spells to support goods/supplies production and so on. Without the items our fellowship wins for each of us in the tournament, no matter if old/new format, there would be a city sitting there, completely underdeveloped, worrying about supplies and goods the whole time. - That would be no fun at all! no matter which tournament format is played."}, {"32": "I have no quarrel with less provinces it's part of the game,[BR]They should just have told and explained they wanted people to do less provincies since it was to much, instead of trying to claim it as an \"improvement\" just openly call it a nerf and explain why it was needed.They should have kept a progression format, instead of regression.there is no longer a competition between players in the same stage of the game.The more randomised troops and the steep growth in losses is detrimental for learning how to fight, making it a much steeper difficulty to enter as at the start there is no learning (to easy, you can win with any troops even the wrong ones) then there are a few fights in which you can learn, and then you get within to much losses territory.Boring, all battles feel like spire battles now, it's boring.Mistalkers are horrible, they were and are worse now.To much focus on manual battles (which not all players could do even if the want to as not all platforms have access to it.)"}, {"25": "I have an old, actually ancient, city in Arendyll.  It was abandoned in another of the great decisions to slow us down by removing population from the event buildings that we had worked hard to get.  I was in Dwarves and moving into Fairies when I logged in to discover I had -436 population and upgrading every single house I had wasn't going to be enough to make up for the loss.  I was strangled and couldn't move ahead.  When both my main city and my beta city were pretty well settled I brought this poor thing back to life.   With the help of the tournaments and a decent fellowship I was able to get it all the way to the Constructs chapter.[BR][BR]This is where it gets interesting.  This city has NOTHING.  Zilch in the way of ANYTHING that should make the tournament or Spire more difficult.  The next diamond expansion costs 1500 diamonds, and it has only completed 378 provinces.  I need 400 to move into the next chapter.  The AW level is a pathetic 53. For this city to hit a brick wall in the tournament means that strictly the chapter level has to be the main culprit here.  It has accomplished nothing else, nor did it need to.[BR][BR]My only recourse now is to spend a lifetime in Constructs, getting 1 kp an hour, or simply abandon it again.  This was my \"small\" city that I enjoyed playing in and doing tournaments.  I have had a fellowship that could do 10 chests.  I needed nothing from this little city but some fun from building, tournaments, Spire, and a decent fs.  I hate that I have to throw it back on the shelf and make an event city that goes nowhere beyond Orcs with the ugly buildings.[BR][BR]Nothing about this makes any sense."}, {"32": "Yup made some calculations and started a revided a town, in chapter 8 it will have a tournament starting SS of 23!! with the ability to have a level 30 needles with max production.[BR][BR]Very balanced game [smilie--sprite2][BR]only downside is it will take some time to become a tournament immortal lol"}, {"24": "CrazyWizard said:\t\t\tYup made some calculations and started a revided a town, in chapter 8 it will have a tournament starting SS of 23!! with the ability to have a level 30 needles with max production.[BR][BR]Very balanced game [smilie--sprite2][BR]only downside is it will take some time to become a tournament immortal lol\t\tClick to expand...[BR]Just as long as you are human, an elf town would be garbage in comparison.[BR][BR]Another idea might be to get the barrack upgrade in chapter 9, the speed increase might be worth the tech number increase (since your other factors are low, the tech impact wouldn´t be too big). Also depends on which techs you were planning on in the Orc chapter of course. I assume Armories? Or were you going Orc Nest only? After that it´s not far to the Orc Barracks, then to the 3star HM units. After that it would be only so much to woodelven barracks (with an advance scout thrown in for free). The speed difference between fairy barracks (19) speed 71 to woodelven barracks (25) speed 164 is more than double, with lvl 30 Needles the speed goes from 142 up to 328.[BR][BR]And of course don´t place the expansions you get if you don´t absolutely have to, might even buy a couple cheap premiums instead of placing normal ones... I am wondering if low expansions/low catering might be better than max expansions/max catering, even at such a low AW/tech count.[BR][BR]Anyway there is a lot of fun things that could be tried [smilie--sprite1] Only I really can´t be bothered to start another town lol. But I wish you the best of luck crushing the server (in a year or 3, no idea how long it will take you to scout 500 provinces in Orcs Chapter) [smilie--sprite8]"}, {"32": "Gargon667 said:\t\t\tJust as long as you are human, an elf town would be garbage in comparison.[BR][BR]Another idea might be to get the barrack upgrade in chapter 9, the speed increase might be worth the tech number increase (since your other factors are low, the tech impact wouldn´t be too big). Also depends on which techs you were planning on in the Orc chapter of course. I assume Armories? Or were you going Orc Nest only? After that it´s not far to the Orc Barracks, then to the 3star HM units. After that it would be only so much to woodelven barracks (with an advance scout thrown in for free). The speed difference between fairy barracks (19) speed 71 to woodelven barracks (25) speed 164 is more than double, with lvl 30 Needles the speed goes from 142 up to 328.[BR][BR]And of course don´t place the expansions you get if you don´t absolutely have to, might even buy a couple cheap premiums instead of placing normal ones... I am wondering if low expansions/low catering might be better than max expansions/max catering, even at such a low AW/tech count.[BR][BR]Anyway there is a lot of fun things that could be tried [smilie--sprite1] Only I really can´t be bothered to start another town lol. But I wish you the best of luck crushing the server (in a year or 3, no idea how long it will take you to scout 500 provinces in Orcs Chapter) [smilie--sprite8]Click to expand...[BR]Chapter 9 unlocks orcs (1 chapter after it's introduction)[BR][BR]btw you don't need 500 provinces in fact I am not unlocking normal expansions, and premium only with diamonds from the tower.[BR]You only need the provinces for the tournamet. and I doubt anyone would do 50 provincies weekly [smilie--sprite2][BR][BR]I am an elf, its priest vs mortar, both have there weakness in this stage of the game.[BR]But thats why we have negotiations, if your starting SS is insanly low your negotiaton cost are reasonably low as well according to minmax calculations, these are the starting costs for negotiations.[BR][BR]CoinsSuppliesT1T2T36,000600755738[BR]Over time it should be possible to do some crazy stuff [smilie--sprite1]"}, {"89": "Melianora said:\t\t\tThat I will disagree upon. Even if the KP, Spells, Relics and so forth are lower now in return, those are what keep my city running and makes it possible for me to not have to worry about Supplies, Spells to support goods/supplies production and so on. Without the items our fellowship wins for each of us in the tournament, no matter if old/new format, there would be a city sitting there, completely underdeveloped, worrying about supplies and goods the whole time. - That would be no fun at all! no matter which tournament format is played.\t\tClick to expand...[BR]For me, the investment is not worth it. Before i could gain enough workshop enchantments to run 5 workshops boosted for maybe the whole week. To achieve that now, i would have to invest tons of everything. The investment itself would be much higher as the gain.[BR][BR]Factory enchantments are capped at 12 anyway (up to 6 at 6* prov. 9 + 6 for 9 chests) so i don't even gain anything worthfully by going further to regain my goods.[BR][BR]Neighborly help enchantments did help with mana income, but i would have to invest much more mana to gain those enchantments at 10+ 4*, as i could ever get back by using them (combined with the dragon abbey).[BR][BR]Gaining a meaningful amount of KP in tourneys is also off now. But... well upgrading AWs with those is counter-productive anyway now, as that is what i've used those mostly for.[BR][BR]I should note, that i'm talking about a sustainable strategy here, not by using 5 or more booster buildings + everything else. In Fact it's the first time i'm worried about every ressource i piled up (millions of goods, hundrets of enchantments, relics etc). I had a pretty sustainable/profitable city until yet. I managed to pile up millions of goods, while only having 3-4 t1 + t2 factories and 2 t3 factories, while always offering 3* offers. I even still made profit while accepting high 0* trades in tourneys with my fellowship, just to increase our chances to unlock the next chest.[BR][BR]There are only 2 reasons for me to take part on the tourney now: The reward-chests + the personal rewards of the easy chests. There is no real profit into going much further as prov. 16. This now only makes sense for the sake of points/ranking. There is no more feeling of progress by going further, as the used formula will use everything that should improve my chances against me. Only to make less advanced players feel more powerful in terms of tourney-contribution. Fore me, the tourney now feels more like a chore as it did before. I mean... before i actually gained something by that chore. That chore made my city work. Now i'm only motivated to do the bare minimum to support my FS and to gain the easy rewards, as anything after that starts to feel unrewarding pretty fast.[BR][BR]I started with 132 points in my very first tourney, did 318 in the 2nd, improved that to 1k+ pretty fast and was able to increase that to 3k+ over time (pre- fire-phoenix / brown-bear). That was possible by knowing the right strategies, by unlocking more provinces to fight and ofc. also by using the right booster buildings at the right time, not by just throwing in x different ones, as every enemy type could appear. My AWs also helped alot. I wasn't able to do that by day 1, i was able to earn that by advancement. My biggest motivation to even do that, besides increasing the FS-Rewards, was the personal rewards i could gain.[BR][BR]Now that exact advancement is used against me. I can't prepare for a specific tourney anymore, as there will be up to 5 different enemy units in a fight pretty quickly.[BR][BR]I'm not even saving time, as instead of auto-fighting 4 encounters / province, i have to fight manually (never needed to do that before) to keep my losses low, mostly with maps that aren't in my favour. The only time i'm saving is that i only do half of the provinces compared to before.[BR][BR]All in all i only have disadvantages by this new system, but inno wants me to like it. They're only taking away from me, but they don't give me anything. They even punish me for the progress i made + they punish me for the hundrets of € i've spend for my expansions."}, {"24": "CrazyWizard said:\t\t\tbtw you don't need 500 provinces in fact I am not unlocking normal expansions, and premium only with diamonds from the tower.[BR]You only need the provinces for the tournamet. and I doubt anyone would do 50 provincies weekly [smilie--sprite2]Click to expand...[BR]Not any one I agree, but I think there will be someone every week getting there or close enough. So for total domination you will have to do something around that ballpark every week. And I don´t believe it will be very hard to do other than getting the provinces. Your SS will be orders of magnitude smaller than anyone else with that many provinces to do those scores. [BR]The only question I see is if even big towns will figure out ways to do high scores on a weekly basis. [BR]I think right now that is very hard to guess at. We haven´t even been trying, we were lazy, there was no need to put in an effort to do 15k or 20k points if you had the provinces, there were many different ways of doing that, we will see which ones will survive now, and we´ll learn to optimize we´ll have to actually go to our limits and only when we have done that for a while will we know what we can sustainably do. But if I had to guess, in a while there will be some people above a 10k average with their big towns. So you´ll have to have to have a lot of provinces to beat them."}, {"24": "ShadowVision said:\t\t\tThere are only 2 reasons for me to take part on the tourney now: The reward-chests + the personal rewards of the easy chests. There is no real profit into going much further as prov. 16. This now only makes sense for the sake of points/ranking. There is no more feeling of progress by going further, as the used formula will use everything that should improve my chances against me. Only to make less advanced players feel more powerful in terms of tourney-contribution. Fore me, the tourney now feels more like a chore as it did before. I mean... before i actually gained something by that chore. That chore made my city work. Now i'm only motivated to do the bare minimum to support my FS and to gain the easy rewards, as anything after that starts to feel unrewarding pretty fast.\t\tClick to expand...[BR]Actually I think that is a pretty good way of looking at it.[BR][BR]The tourney now has 2 parts:[BR][BR]An easy and rewarding part that everybody can do (compare all recent events), if everybody in the FS does that part it should also more or less coincide with an easy 10 chests. Overall rewards will be easy to achieve, but of course not be the insanely high amounts we used to get.[BR][BR]A difficult and costly part for those that want a challenge. It means spending a lot more resources than you get back for the sake of doing it. This is also shown by all the additional chests, which are basically devoid of rewards. They are there for the challenge, for the ones who like to do more than just the easy part."}, {"60": "Have other people been seeing an increase in the amount of booster buildings and pet food they are getting from the MA this week? I have got around 4 of both which is significantly more than usual. Itd be good if it wasnt just a fluke."}]