[{"22": "30158729 said:\t\t\tHave other people been seeing an increase in the amount of booster buildings and pet food they are getting from the MA this week?\t\tClick to expand...I've been getting quite a few ELRs and MMMs, but I've still only seen 1 UUU in about the last two months. I don't have a problem with pet food supply though."}, {"32": "Pauly7 said:\t\t\tI've been getting quite a few ELRs and MMMs, but I've still only seen 1 UUU in about the last two months. I don't have a problem with pet food supply though.\t\tClick to expand...[IMG]https://i.ibb.co/f1V2FWW/https-en-forum-elvenar-com-index-php-attachments-1598651123437-png-4729.png[/IMG][BR]#IWantItAll (well 4 of them the middle one they can keep)"}, {"22": "CrazyWizard said:\t\t\t#IWantItAll (well 4 of them the middle one they can keep)\t\tClick to expand...Oh that's a nice little selection to get [smilie--sprite1]"}, {"2": "30158729 said:\t\t\tHave other people been seeing an increase in the amount of booster buildings and pet food they are getting from the MA this week? I have got around 4 of both which is significantly more than usual. Itd be good if it wasnt just a fluke.\t\tClick to expand...I did, but what's the point in having those recipes if in Spire I rarely get CC (so rare that I am more glad for them than for a genie) and can't produce only CC 24/7, I need also MM and I just can't have enough of any of them."}, {"33": "Alcaro said:\t\t\tI did, but what's the point in having those recipes if in Spire I rarely get CC (so rare that I am more glad for them than for a genie) ....\t\tClick to expand...[BR]Ypu must be extremely out of luck. With normal luck you should get a fair amount of them if you do the full spire. Also if doing spire a lot you should have some of those buildings that gives one CC every day. I say those are the best to have."}, {"65": "3-4 moonstone libraries (with whole set), Spire always to max and you may do more in MA if needed - so you don't have problem with this"}, {"80": "Having seen the formula for determining tournament difficulty I realise that there is now no point in upgrading my city further or buying more expansions or indeed playing this game.[smilie--sprite4][smilie--sprite3][smilie--sprite11][smilie--sprite7] It is very obvious that the developers don't actually play this game or have any idea about the best way of keeping players interested in a game. The highest ranked players that have spent years and lots of money on this game have now been effectively severely \"punished\" for having upgraded AWs , bought expansions and done all the researches. We did that to improve our cities ability to do well in tournaments , not to make it harder !  Elvenar developers you are bleeping stupid .[smilie--sprite11]"}, {"32": "Alcaro said:\t\t\tI did, but what's the point in having those recipes if in Spire I rarely get CC (so rare that I am more glad for them than for a genie) and can't produce only CC 24/7, I need also MM and I just can't have enough of any of them.\t\tClick to expand...[BR]I train CC 24/7 on a level 5 academy, only interrupted by the 20kp bar inspiration.[BR]Why do you need that many MM?[BR][BR]tournament doesn't give enough?[BR][BR]On my miniture account I own a level 2 academy, and own 5 libraries from the spire, that also rewards plenty of CC to keep crafting.[BR][BR]It's all about making choices."}, {"2": "@CrazyWizard - I use 7 MM/ day. Now that I'm done with the ch.16 I don't have to produce sentients every day but I still have to do it at least twice a week, for Spire.[BR]@valle - it seems I am an unlucky person [smilie--sprite8] I get genies, time boosters, freaking huge amounts of spell fragments, Mana plant & Gum trees that I could make a forest only with those, rarely an Armory and even rarer those CC. At least in the past 3 weeks, CCs I got mostly from the team rewards.[BR]@kurgkurg - I have 2 libraries but by far are not enough.[BR][BR]The point is, I am going lower and lower on the relics - some worse than others since are needed for MM and CC and the new tournament formula will stop me to go wild in certain tournaments and grab loads of relics. <<< and this is only ONE negative side of the new tourny."}, {"32": "7 is way way way to much and unsustainable in any way or form.[BR][BR]You can make 3 per day with a level 5 academy and you can get 6 a week at the tournaments?[BR]You should find other solutions."}, {"120": "To put it simply, this change to tournaments is an unmitigated disaster. Well done Inno!!"}, {"62": "10 chests again, purely catered. loving the new tourney format.[smilie--sprite8][BR]Congrats to Inno on a job well done.[smilie--sprite8]"}, {"27": "FieryArien said:\t\t\t+- Our fellowship scored comfortably 6 chests. We did them more often than not in the past weeks, so there doesn't seem to be change in that. However, I'm not sure if people will keep their performance, or if it was just curiosity combined with attempts to get some spells for FA.\t\tClick to expand...And after the second week of the new tournament I have my answer. Our fellowship scored 5 chests. The novelty is gone and it looks like we are back at 5-6 chests. That's real-server data.[BR][BR]For our relaxed fellowship the new tournament seems to have the following real impact:[BR]* We reach similar number of chests as before, namely 5-6. (I'm hoping for more sixes, but time will show.)[BR]* The distribution of points have changed. The points of top player(s) are significantly lower and apparently they are now compensated by smaller players. The sad thing is, that the low provinces in the old tournament weren't hard at all. People could have been scoring those points even before, if they wanted.[BR]* I have another city on live world, where the new tournament system isn't implemented yet. There we found out shortly before the end of tournament, that we are short of few thousand points. Few people got together and reached the chest in last minute(s). This experience was sad for me, because I realized that this wouldn't be possible here in my city on EN server. Here a lot more people would need to be online and they would have to be willing to pay significantly higher prize for such an achievement.[BR][BR]Personally, the new tournament affected me in a bad way. A lot less KPs per week, while having huge KP requirements in the 16th chapter. Projected insufficient spells gain for enhancing my city and relic gain for Magic Academy - I do have some in stock, but if I keep using more that I gain, I'll deplete it eventually. Loss of blueprint once per cycle, because there is no way our relaxed fellowship could score 10k in the new system. Generally a loss of interest in the tournament. Actually I like Spire more now. Who would have thought?[BR][BR]What I hope for is, that Inno will soon come up with balancing changes for the rest of the game (KP, spells, relics), because the new tournament messed everything up. It's crystal clear, that the new tournament is there to stay. Fine, there's nothing I can do to change that. Now I need Inno to clean up all the unintended consequences and adjust/find new balancing mechanisms."}, {"25": "When I tried this disaster in Beta I was well aware of the possible outcome for the live cities.  My city in Winyandor was an awesome bunch of people, but they are mostly low to mid level, chapter wise.  We were getting 10 chests about once a month, and it was a great thrill for us.  Some of the bigger players would come in on a Saturday and complete province after province to get us through the 10th chest, with smaller players jumping in to do the best they could.  It was such fun for us.  [BR][BR]Players actually bought diamond buildings, knowing that they could upgrade them.  I had sheer dread of what was going to happen when this fun was snatched from us, and I was right.  Two of my players that had been with me since their days of a couple houses and a workshop found other fellowships.  We are no longer able to do what we could do.  The bigger players can't save the fellowship now, and this is a loss for the ones that need the blueprints.  [BR][BR]Not only will it be a disadvantage to purchase diamonds for expansions, it's now pretty useless for any smaller players to buy magic buildings.  This is called shooting yourself in the foot.  Not a very wise move, I'm afraid.  You want as many teams as possible to get 10 chests any way that they can."}, {"89": "Maillie said:\t\t\t[...] it's now pretty useless for any smaller players to buy magic buildings.  This is called shooting yourself in the foot.  Not a very wise move, I'm afraid.  You want as many teams as possible to get 10 chests any way that they can.\t\tClick to expand...[BR]Actually it's quite the opposite now. Smaller playerers now have a more easy time with tourneys as before. Only the less active tourney players (no matter how advanced or not) will hurt you more as before, as the more active players can't compensate them that easily anymore.[BR][BR]If you got 20 smaller players that'll do 10 provinces @5 stars (= 2000 pts / player <- very doable), you'll gain the needed points for the 10th chest.[BR]If you got 25 smaller players that'll do 8 provinces @ 5 stars (=1600 pts / player <- very very doable), you'll gain that also.[BR][BR]Those 10 or 8 rounds are much easier as before, so starters will have some easy time - IF - they're active.[BR][BR]BUT that's the problem in casual fellowships. I'm leading one by myself and we have no strict rules regarding activity (no \"be active x/7 days\" or \"gain at least xy points in tourneys\") as i like to let my fellows play like it fits them the best: Fun + real life comes first.[BR][BR]Before our top-scorers were able to compensate the less active tourney players. Sadly the less active players don't start to get much more active as before... well mostly at least. Instead of only doing 1 province they now do something around 2-4. That activity may flatten out as soon as the new tourney system isn't that new anymore."}, {"32": "ShadowVision said:\t\t\tActually it's quite the opposite now. Smaller playerers now have a more easy time with tourneys as before. Only the less active tourney players (no matter how advanced or not) will hurt you more as before, as the more active players can't compensate them that easily anymore.[BR][BR]If you got 20 smaller players that'll do 10 provinces @5 stars (= 2000 pts / player <- very doable), you'll gain the needed points for the 10th chest.[BR]If you got 25 smaller players that'll do 8 provinces @ 5 stars (=1600 pts / player <- very very doable), you'll gain that also.[BR][BR]Those 10 or 8 rounds are much easier as before, so starters will have some easy time - IF - they're active.[BR][BR]BUT that's the problem in casual fellowships. I'm leading one by myself and we have no strict rules regarding activity (no \"be active x/7 days\" or \"gain at least xy points in tourneys\") as i like to let my fellows play like it fits them the best: Fun + real life comes first.[BR][BR]Before our top-scorers were able to compensate the less active tourney players. Sadly the less active players don't start to get much more active as before... well mostly at least. Instead of only doing 1 province they now do something around 2-4. That activity may flatten out as soon as the new tourney system isn't that new anymore.\t\tClick to expand...[BR]The main issue is that if they did not like tournaments and mostly ignored it, they won't magically start playing it now \"just because it's easier\".[BR]Nor am I certain if it's really that much \"easier\" than before."}, {"89": "CrazyWizard said:\t\t\t...\t\tClick to expand...[BR]I'm 100% on your side there.[BR][BR]But yes, the first provinces are much easier as before... at least until something around province 8. 12+ is much (much) harder as before.[BR][BR]So effectively they made it easier for full fellowships with ~20(+) active tourney players, but MUCH harder for casual fellowships with less than 20 fellows or with less active tourney fellows in general, as big players are unable to compensate that now - at least at reasonable costs.. at some point a big player may be even stopped by empty mana for the rest of the tourney, while still sitting on millions of everything else.[BR][BR]Top fellowships won't be bothered by that, as there are mostly 20-25 very active fellows with only a very few cases of inactivity.[BR][BR]In theory they've improved the chances for casual fellowships by making it easier - but it's exactly what you said: not everyone takes part there, no matter of how easy it is. It wasn't even that hard before. You could even prepare for each specific tourney before.[BR][BR]Now you have to decide if you only recruit tourney-active players (recruiting is already hard enough without any strict rules... at least without being a top 10 FS or offering 10 chests / gold spire weekly right at the start), or to just swallow that pill that you'll have some harder time to gain high rewards in the tourney now. Not only regarding personal, but also regarding fs rewards.[BR][BR]Still some ppl like that new \"challenge\". They like that inno steals tons of rewards you had before... while giving nothing back. (No the 1-click thing doesn't equalize that). Inno won't change anything big about that, as \"people like it\"."}, {"99": "Having completed 30 provinces for 6 rounds I can now provide a full analysis of the Crystal Tournament. I can post the corresponding data tables, if wanted, but I kept them out to save space.[BR][BR]Troop mix per province per round:[BR]The troop mix was much friendlier than that of the previous tournament for all 6 rounds. This isn't just about unit types but the specific unit faced.The terrain favoured me more often than not for all 6 rounds. Where it was 50/50, or thereabouts, fighting depended on troop mix. Where the terrain disadvantaged me I simply catered.Note: Light ranged units weren't previously part of the Crystal tournament. The reason I keep bringing them up is because they're the most difficult enemy unit, especially for human players, until the T3 Mercenary Camp units are available. At this point I don't have T3 Mercenary Camp units, which will arguably be the same for the majority of players.Per round, Light Ranged units appeared 43.33%, 40.00%, 36.67%, 40.00%, 33.33% and 33.33% of the time. This is TOO HIGH.Per round, of the Light Ranged unit appearances, Mistwalkers appeared 46.15%, 58.33%, 63.64%, 25.00%, 50.00% and 30% of the time. This is TOO HIGH.From Round 4 Mistwalkers didn't appear in provinces above 20.Per round, there were 4/5 unique enemy troop types appearances 23.33%, 20.00%, 26.67%, 30.00%, 13.33% and 20.00% of the time. This is TOO HIGH.The friendlier troop mix and terrain advantage didn't make all these fights impossible. If this trend continues then this kind of difficulty is ACCEPTABLE. However, if the troop mix and terrain type is purposefully friendlier in some and completely hostile in other tournaments then the above occurrence percentages are TOO HIGH.[BR]Squad sizes per province per round:[BR]In Round 1 player squad size increases, per province, by their squad size in Province 1 (+0/-1). In my case, this was 545 in Province 1, 1089 in Province 2, 1634 in Province 3, etc.In subsequent Rounds the SS of each Province of the new Round was the same as the SS of each Province +1 of the previous Round. For example; Province 1 of Round 2 had the same SS as Province 2 of Round 1, Province 2 of Round 2 had the same SS as Province 3 of Round 1.Once the enemy squad size was at 200%+ the losses increased exponentially, more so if there were more unique unit types in the line up.The way that the squad sizes changed per Round created the interesting phenomenon of troop loss decreasing per Round until Round 5, where it started increasing again.[BR]Catering costs per province per round:[BR]Same as before, a friendlier troop mix didn't translate into better catering costs. The catering costs are still TOO HIGH.[BR]Overall feedback:[BR]Overall troop loss was tolerable, i.e. 679 units. This was actually higher than it should have been, as I made some silly mistakes in Round 2.The tournament squad sizes are still TOO HIGH, which is making the catering costs TOO HIGH. By province 15 (-1 per following Round) I already had more than 25 actual squads at risk per battle. By province 30 (-1 per following Round) this was up to over 50 actual squads at risk per battle.So, again, I implore you; keep your formula, for better or worse, but apply a modifier to reduce the actual tournament squad size. One slip of the finger or a bad move could cause catastrophic casualties.It was a better experience than the previous tournament but there are still things to improve on.People who had set up their cities to fully cater or fully fight are completely disadvantaged by these changes, as the changes only benefit those who take a more all-rounder approach. Changing a city to accommodate these changes isn't a simple ask. For some it will mean building and upgrading AWs that they previously didn't need. For others it may mean building more manufactories. This will take time and resources and sacrifices. People aren't going to think, \"Ooh, a new challenge!\" That's just going to make people really irate.However, building or upgrading AWs has become a pointless task. I know that if I sell off ALL my AWs I may train troops less quickly and produce fewer goods and decrease my potential progress speed through chapters but the trade off is that I can bash through tournaments every single week at huge scores and minimal losses...for rewards that I may as well not use. So, what's the point?[BR]EDIT: I lost 679 Squads, not Units.[BR]"}, {"33": "ShadowVision said:\t\t\tThey like that inno steals tons of rewards you had before... while giving nothing back.\t\tClick to expand...[BR]Well, I actually score higher and get more reewards from this new tournament format, so you don't speak for everybody. Scored +10k for the first time in last tournament. Maybe you do something wrong [smilie--sprite2]"}, {"32": "Silent Tempest said:Overall feedback:[BR]Overall troop loss was tolerable, i.e. 679 units. This was actually higher than it should have been, as I made some silly mistakes in Round 2.[BR]Click to expand...[BR]Could you also provide how much you negotiated, how much manual combat how much auto?[BR]And your game statistics.[BR][BR]671 units says nothing without proper contect, which chapter and is that chapter finished? how many expansions and how many wonderlevels?[BR]This gives context to a number."}]