[{"99": "Gargon667 said:\t\t\tIt sounds like you believe the devs to have planned or changed anything since last week. That is not the case. this is Crystal tourney and last week was Planks. I of course cannot guarantee anything, since I don´t know what they did, but so far we are getting exactly the troops we expected, and I assume this will continue.[BR][BR]The game has reduced its options to 3 kinds of each type of unit I believe, that makes a total of 15 possible units. I wonder why they limit themselves that much, because one of their goals was more diversity.[BR]Each weak 1 or 2 types (3 or 6 units) will be favored.[BR][BR]Planks has always been with a main unit of LR, so it was also in the new one. Means most units you encounter every time is LR. I assume that each of the 3 LR units has the same chance of showing up (but that may not be true).[BR][BR]Crystal has always been a weird tourney, with the main type being mages, but the tourney actually being focused on the 2 support types, one of which (HR) had a greater variety of units than the main type. So now we get a tourney with 2 Main types, the previous main type Mage and the previously most diverse type HR.[BR][BR]At least so far we have been getting what was expected. But even if the trend does not not continue (I think they mentioned something about HM in Silk???) I am sure that all the main units for all the tourneys have already been set. They are not going to change them based on feedback every week.[BR][BR]The bad news for you: next week is scrolls tourney, which has always been a LR tourney, which means Scrolls will be exactly the same tourney as Planks. the only possible difference I can see is the introduction of a second main type (M or HR), if they wanted to make sure that no 2 tourneys are exactly the same. introducing another main type would reduce LR (and therefore Mistwalker) occurrence a little bit compared to Planks, but up from this weeks Crystal.[BR][BR]Anyway I am glad units are not completely random, so we actually get different tourneys every week, I personally would like it if they kept the old main types with potentially a second main types (out of the previous supporting types), so the tourneys stay similar to what they used to be in at least some way. eventhough of course difficulties will change a lot and for example Planks and Scrolls would end up being a similar difficulty.[BR][BR][BR][BR]I do not see any evil design here. Apparently they have reduced the pool of available units to 3, which means the MW is going to be 33% of all LR occurrences at only 6 of 13 occurrences that means only 1 or 2 more than the average suggests. You simply have not been lucky to get less than average. Of course there is a possibility that MWs have a higher probability than the others, but it will require far bigger sample sizes to sure.[BR][BR][BR][BR]True but irrelevant. All unit types now have a chance to appear in any tourney. That was one of the goals (bigger diversity) Inno outlined for the changes.[BR][BR][BR][BR]I find 20 or 25 % of more than 3 types also acceptable, more would make it too close to the other option (\"completely random\") but much less would simply bring us back to what it was before, which is not necessary either, I like more diversity myself, the problems are in other places.[BR][BR]Troop mix is certainly going to be different in different tourneys, some will be harder, some easier, just as it has always been. I am happy with that.\t\tClick to expand...[BR]It's not that I believe that the devs will change anything each week but given that feedback has been asked for that is what I'm providing. Where I have made one comment one week and a similar comment is still relevant in the next week I'll use language like \"still TOO HIGH\". I could simply structure comments each week as if they haven't been stated previously but does the tense(?) really matter? Whether troop occurrences are \"TOO HIGH\" previously, currently, in the future or on just ONE occasion the point of it being \"TOO HIGH\" doesn't really change.[BR][BR]At the same time what would be the point of live testing and not being prepared to make tweaks here and there based on feedback? I wouldn't expect huge tweaks, nor do I believe that my feedback is going to sway the devs anymore than anyone else's. First, of course this is live testing. Anyone that says otherwise is just lying. If it wasn't live testing this would have been rolled out across every single server. BETA testing ironed out the bugs, so that box has already been ticked. Why else restrict it to EN servers? I'd like to believe this was more than a vanity experiment to tally up all the \"yays\" and \"nays\", as that would not be the action of a competent business.[BR][BR]If the troop mix each week was completely random then each of the 15 units would have an equal weighting. This could be done 1 of 2 ways. First, the 15 units would each be given a weighting of 6.67%. Second; the 5 unit types would each be given a weighting of 20%, then there would be a second \"roll\" where each unit in the winning unit type would be given a weighting of 33%. I'm going to assume it's the second method used, as the numbers are easier to visualise.[BR][BR]But we know that the troop mix isn't random and it's weighted towards the usual suspects. In Crystal we know that the troop mix was M, LM, HR and HR. I don't know what the weightings actually are but logically:[BR]We know that if troop mix was random each unit type would have a 20% weighting.We know that M, LM and HR should appear more often, also assuming that HR will appear twice as many times as either M or LM.It'd be disingenuous to say that we'll meet the usual suspects more often but then make the percentage discrepancies negligible, so it wouldn't be too far out there to assume that we should meet M and LM twice as often as we would HM and LR.So, let's say the weighting for HM and LR are 10% each. That leaves 80% to be distributed amongst M, LM and HR x2.This would make the weighting per unit type: 10% HM, 10% LR, 20% M, 20% LM and 40% HR. That works perfectly into the assumptions.[BR]Working on the basis that there are 5 troop slots per province, of the 30 provinces, there are 150 troop slots overall. Interestingly, Light Ranged units did appear roughly 10% OVERALL each round, so I concede the point that they MAY be appearing as often as expected, depending on expectation. But is tournament difficulty most affected by LR units' overall appearance throughout the round OR is difficulty most affected by LR units appearing less often per province but in more provinces overall? Obviously, the latter is far more difficult and difficulty is the problem being discussed by all the people who have a problem with the change. That's why Light Ranged units appearing 43.33%, 40.00%, 36.67%, 40.00%, 33.33% and 33.33% per round, relative to provinces, is a much better indicator of difficulty. And, yeah, too high.[BR][BR]Re Mistwalkers, they clearly have the heavier weighting of the 3 LR units, judging by the percentages last tournament and this one; i.e. 46.15%, 58.33%, 63.64%, 25.00%, 50.00% and 30% of the time LR units appeared. You could argue that the sample size isn't big enough to be making these comments but at this point that's a nothing argument. If the sample size isn't big enough for negative comments then it isn't big enough for positive comments either, which means this whole exercise is pointless. So...why ask for feedback?[BR][BR]Noting that Light Ranged units weren't previously part of the Crystal tournament isn't irrelevant. In any experiment or test any report will make it very clear of the effects of a new variable. The introduction of LR units was a new variable, so when I referred to them it would have been somewhat lax of me not to note that. Plus, the people reading the forums aren't just experienced players but newbies and maybe even people thinking about taking up the game. I simply covered all the bases.[BR][BR]The appearance of 4/5 unique unit types in a single line up is too high. The chances of the line up being fight-worthy were slim and highly dependant on terrain. If one of the units was a Mistwalker you basically sacrificed a huge number of units simply to scout the terrain. If the potential losses were likely to be too high then the only other option was catering. If you want the challenge of manual fighting that line up then fair play but, long-term, it's unsustainable; so the majority of players are likely just to cater. Being forced to cater 1 in every 4/5 provinces doesn't add challenge or diversity to tournaments. But what it does do is potentially create a situation where players don't want to fight or cater, e.g. as the catering cost requires a punitive number of orcs, which just causes frustration."}, {"99": "CrazyWizard said:\t\t\tCould you also provide how much you negotiated, how much manual combat how much auto?[BR]And your game statistics.[BR][BR]671 units says nothing without proper contect, which chapter and is that chapter finished? how many expansions and how many wonderlevels?[BR]This gives context to a number.\t\tClick to expand...[BR]Fair point.[BR][BR]City stats:[BR]Chapter: 12 (just started)[BR]General squad size: 1584[BR]AW levels: 377[BR]Expansions: 134[BR]Coin limit: 22m[BR]Supplies limit: 2.2m[BR]T1 production/day: c. 240k[BR]T2 production/day: c. 180k[BR]T3 production/day: c. 220k[BR]Orc production/day: c. 5800[BR][BR]Negotiation costs:[BR][BR]Round 1 - 9 of 30 provinces (just because they were cheap, relatively)[BR]ResourceCoinsSuppliesT1T2T3OrcsManaTotal1,680,000​169,000​68,400​128,700​34,380​4,600​0​[BR]Round 2 - 4 of 30 provinces[BR]ResourceCoinsSuppliesT1T2T3OrcsManaTotal560,000​56,000​12,300​22,800​4,400​700​8,400​[BR]Round 3 - 6 of 30 provinces[BR]ResourceCoinsSuppliesT1T2T3OrcsManaTotal1,800,000076,00086,40063,6003,20054,000[BR]Round 4 - 8 of 30 provinces[BR]ResourceCoinsSuppliesT1T2T3OrcsManaTotal1,300,000​56,000​225,800​142,000​96,000​2,100​17,000​[BR]Round 5 - 6 of 30 provinces[BR]ResourceCoinsSuppliesT1T2T3OrcsManaTotal4,100,000​850,000​153,800​133,400​29,000​0​23,000​[BR]Round 6 - 5 of 30 provinces[BR]ResourceCoinsSuppliesT1T2T3OrcsManaTotal0​420,000​106,000​71,000​65,300​2,100​110,000​[BR]All Rounds[BR]ResourceCoinsSuppliesT1T2T3OrcsManaTotal9,440,000​1,551,000​642,300​584,300​292,680​12,700​212,400​[BR]Combat was all manual fought:[BR]Round 1 - 21 of 30 provincesRound 2 - 26 of 30 provincesRound 3 - 24 of 30 provincesRound 4 - 22 of 30 provincesRound 5 - 24 of 30 provincesRound 6 - 25 of 30 provinces[BR]Also, it should read 679 squads lost, not units, lolz."}, {"27": "Silent Tempest said:\t\t\tOverall troop loss was tolerable, i.e. 679 units squads.\t\tClick to expand...Silent Tempest said:\t\t\tGeneral squad size: 1584\t\tClick to expand...1) What is your training speed? With 377 AW levels, I imagine your training speed is probably very high.[BR]2) Also how many squads per week do you get from other sources - like wonders or small troops-producing buildings?[BR]I'm asking, because I'd like to know how many squads do you get per week without using time instants. In the 12th chapter, you don't have Simia yet, so there is no production bonus to complicate the counting.[BR][BR]Anyway, as I understand it, the relation between training speed and number of basic units trained in a week = training_speed*5*24*7. Is there someone who understands the mechanics? Is that right? Wiki says barracks at level 1 train 1 basic unit in 12 minutes. Speed increases the number of units trained in those 12 minutes, right? That means speed is the same as number of basic units trained in 12 minutes, right? Then *5 gives number of basic units per hour (12*5=60 minutes in an hour), then *24 gives number per day (24 hours in a day) and finally *7 gives number per week (7 days in a week). I would be really grateful, if someone could confirm or correct this equation.[BR][BR]In terms of squads the number per week is ((training_speed)*5*24*7)/squad_size. In Silent Tempest's case the squad size is 1584; to replace 679 squads in a week only by training in barracks/grounds/camp, the training speed would have to be ~1280. The reality will be lower of course, because from those 690 squad we need to subtract the number of squads gotten for \"free\" from various AWs and buildings."}, {"89": "valle said:\t\t\tWell, I actually score higher and get more reewards from this new tournament format [...]\t\tClick to expand...[BR]Wow, you used 3 dwarven armorers,  1 UUU, 4 MMM and 1 ELR as far as i can see it.[BR][BR]+ 2 Brown Bears and a Fire phoenix.[BR][BR]Something less/different in your other city.[BR][BR]With that it's not really that a big achievement to gain 10k points. You make it sound like you did that with nothing of that and that could be done every week by anyone. Throwing in a 2-3 weeks booster-collection is far from sustainable - at least for ppl that are not sitting in a top 4, 10th(+) chest / each week and tourney focused fellowship. Rollin the MA for 50 diamonds to gain more booster-buildings is also out of question for a sustainable way - even with spire-rewards - it's purely RNG to get something there.[BR][BR]Before, you could have gone even 50% further with that. If you now get further as ever, you did something VERY wrong before, as the higher provinces are harder now in fact. I would even assume that you didn't even tried that before, maybe even because it was too tedious to do 48 5* or 38 6* provinces with 4 encounters each.[BR][BR]Looking at your citiy (half of your space is a wasted mess), if you wouldn't have those premium residences / workshops you wouldn't be able to perform even remotely close to that. 7 T1, 7 T2 and 7 T3 factories couldn't be placed without those. Yet alone you would need double the amount of residences. Being in a 10 chests a week fellowship for years has its advantages.[BR][BR]It's nice that your overall situation allows you to go that far, but that isn't the norm and it doesn't mean that someone who doesn't get that far, is just doing something wrong.[BR][BR]I could also empty my booster-inventory to just reach some high scores once, even beating Paladestar if my provinces count allows me that - still i would need to invest much more as i ever needed to do before, to gain the same rewards as before. Hence, they are taking away rewards by making them very hard to get, without giving me anything besides the \"one click challenge\".[BR][BR]It's not that they simply took away some rewards, it's that they changed everything i did calculate/work with. Making any progress in this game is now slowed down big time. Not only by the means of KP income, but also by the means of anything else. I need to negotiate more now and the tourney takes away much more as it did before. Not only in terms of goods, but also mana and orcs. The spire already needed a good amount of that - i didn't mind that until yet, as i rarely needed to negotiate in tourneys before.[BR][BR][BR]Yes i could simply adapt to all of that. Simply make my peace with that Inno just makes the game harder in a core-part of the game, slows down progress in any way, while the devs alone are the only ones that really win something by that. Less rewards = less progress = less need to add new content, as it'll now take ages to get anywhere without investing either diamonds or high amounts whatever, while it's at the same time harder to get \"whatever\" as you have to invest more of \"whatever\" only to gain a hand full of KP. Don't mind the other rewards, as those are not even remotely worth the trouble in any calculation anymore. People are now busy for a longer time, without the need of providing new content.[BR][BR]But why do i even bother to explain myself. It doesn't change anything. Looking at your attitude you're the best of all and everyone else is just doing things wrong and is simply incapable, and inno - out of the history of everything - won't change things anyway."}, {"14": "ShadowVision said:\t\t\tWow, you used 3 dwarven armorers,  1 UUU, 4 MMM and 1 ELR as far as i can see it.[BR][BR]+ 2 Brown Bears and a Fire phoenix.[BR][BR]With that it's not really that a big achievement to gain 10k points. You make it sound like you did that with nothing of that and that could be done every week by anyone. Throwing in a 2-3 weeks booster-collection is far from sustainable - at least for ppl that are not sitting in a top 4, 10th(+) chest / each week and tourney focused fellowship.\t\tClick to expand...[BR]It's not sustainable, even if you are in such a fellowship.[BR][BR]There is no need to put any stock into anything valle says, as the math and number crunching has already made clear what has happened to the tourney, and how higher scores are simply unsustainable unless you really feel the urge to spend diamonds like crazy for the crafter.[BR]I am sure several people who are high up there in the scores can keep it up for a while thanks to their current stockpiles, but they will dwindle in time, and then so will their scores.[BR][BR]Using large numbers of boosters to push the crunch-moment back a bunch of provinces, then saying everything is all right in this system without showing your own parameters, is simply shortsighted and misses the overall bigger picture of people now being punished for growing their city. In fact, it is highly disingenuous to boot."}, {"89": "Silent Tempest said:\t\t\t...\t\tClick to expand...[BR]BTW big THX to you and all your work to put together all those numbers. Solid work in terms of professional feedback! [smilie--sprite1] (unlike my own more emotional driven posts)"}, {"33": "ShadowVision said:\t\t\tWow, you used 3 dwarven armorers, 1 UUU, 4 MMM and 1 ELR as far as i can see it.\t\tClick to expand...[BR]You are wriong, it was 2 DA and 2 MMM used. Same in both cities (on W and F world). If you saw any other buildings it's old ones that ain't active. If you think about it why would I use ELR in this tournament, would be a real waste. So don't believe everything you see.[BR][BR]So you base most of what you write on something that isn't true. Good job.[BR][BR]About my boosts I think that level is sustainable for some time. A DA can of course be replaced with 2 UUU if short on DA. I've been doing spire to the end from the beginning so I got a few DA's in stock."}, {"33": "Killiak said:\t\t\tThere is no need to put any stock into anything valle says\t\tClick to expand...[BR]That is what you write we shouldn't believe as it's built on a bad guess from another player.[BR][BR]Problem is that you believe that ShadowVision has the facts. As I wrote above he makes the faulty conclusion that all booster buildings he found in my city was used in the last tournament. If I had used all those buildings I agree that it would have been insustainable."}, {"99": "FieryArien said:1) What is your training speed? With 377 AW levels, I imagine your training speed is probably very high.[BR]2) Also how many squads per week do you get from other sources - like wonders or small troops-producing buildings?[BR]I'm asking, because I'd like to know how many squads do you get per week without using time instants. In the 12th chapter, you don't have Simia yet, so there is no production bonus to complicate the counting.\t\tClick to expand...[BR]Barracks training speed: 450[BR]This is made up of:[BR]a level 29 Barracks, providing 250 training speeda level 23 Needles of the Tempest, providing +80% (or +200) training speed[BR]Barracks training size: 5204[BR]This is made up of:[BR]a basic barracks training size of 63 level 27 Armories, each providing +215 training size or +645 overalla level 23 Shrine of the Shrewdy Shrooms, providing +2592 training sizea level 24 Dwarven Bulwark, providing +1961 training size[BR]As before, my squad size is 1584. I can train one slot of 5204 units every 2 hours 18 minutes. Given the overall training time with all 5 slots filled my Barracks is always training. [BR][BR]In terms of free troops I get:[BR]1961 T3 Barbarians, per 3 hours, from a level 24 Dwarven Bulwark476 T3 Priests, per 3 hours, from a level 23 Flying Academy317 T3 Mortars, per 3 hours, from a level 23 Temple of the Toads1901 T3 Crossbowmen, per 3 hours, from a level 23 Shrine of the Shrewdy Shrooms[BR]I collect my free troops, on average, 4 times per day; so, in a week I get:[BR]54,908 Barbarians or c. 35 squads13,328 Priests or c. 34 squads8,876 Mortars or c. 34 squads53,228 Crossbowmen or c. 34 squads[BR]In terms of replacing lost troops:[BR]I start with a base of at least 1000 squads of each unit. My military buildings can rarely keep up with troop loses each week. Every 3 weeks I feed my 2 Brown Bears, which provide a unit production bonus of 100%, and use time instants to top up my troops back to the 1000-squad base. "}, {"14": "valle said:\t\t\tThat is what you write we shouldn't believe as it's built on a bad guess from another player.[BR][BR]Problem is that you believe that ShadowVision has the facts. As I wrote above he makes the faulty conclusion that all booster buildings he found in my city was used in the last tournament. If I had used all those buildings I agree that it would have been insustainable.\t\tClick to expand...[BR]And as I said before, the math and number crunchers have already shown that it is a big nerf, and that it is unsustainable to keep those numbers up.[BR][BR]So you can keep on pushing that tournament like you never did before and saying that you hardly used a thing; your problem, aside from that utter chaos-fest of a city,  will be that nobody believes you.[BR]The math applies to you equally; your losses in troops and goods will be large, and your stockpiles will dwindle in time."}, {"74": "valle said:\t\t\tYou are wriong, it was 2 DA and 2 MMM used. Same in both cities (on W and F world). If you saw any other buildings it's old ones that ain't active. If you think about it why would I use ELR in this tournament, would be a real waste. So don't believe everything you see.[BR][BR]So you base most of what you write on something that isn't true. Good job.[BR][BR]About my boosts I think that level is sustainable for some time. A DA can of course be replaced with 2 UUU if short on DA. I've been doing spire to the end from the beginning so I got a few DA's in stock.\t\tClick to expand...So you used up your stockpile - big whoop. Anyone can do that.[BR][BR]When the stockpile's gone, then what?"}, {"121": "I inadvertently started a huge but valuable debate in the general discussion when I posted my feelings after trying to play the new tournament. The thread there now has 4 pages of comments![BR][BR]I still feel that the changes over recent times have been leading up to this and it feels like a classic gambling ploy, hooking us with the time instants, the troop instants and the spire with its wonderful prizes (all of which we didn't really need until new very difficult chapters were introduced). Now we have become accustomed to all those extras and s..snap... the rug is pulled.[BR][BR]Anyway, I began expressing my anger that this is supposed to be a game not a hamster wheel that adds more stress ... best check out the post: https://en.forum.elvenar.com/index....s-become-just-a-chore.12987/page-4#post-78910"}, {"53": "The new tournament design encourages us to think about how we might want to rebalance our cities to address the new requirements we face. (As an example, catering now asks for less Tier 3 goods relative to those of Tier 1. This might lead us to reduce our number of Tier 3 manufactories, replacing them with Tier 1 factories.) [BR][BR]A different way of optimising cities is to attempt to exploit imbalances in the difficulty formula. In the old tournament this was commonly done by avoiding optional squad size techs. There are probably more, and potentially more significant opportunities to exploit the embryonic new tournament formula. One example (as outlined earlier in this thread) would be a city specialised in fighting which avoids placing expansions and developing non-military wonders in order to minimise the fighting difficulty. A similar (although more difficult) option would be for a fighting city to artificially maintain a low production bonus by spending any boosting relics in the Academy.[BR][BR]My suspicion is that both the developers and (a large chunk of) the players are happy in principle with the first kind of approach, but not the second. Lots of the concerns here seem to relate to it (the second approach).[BR][BR]A big part of the problem would seem to me to be that factors which affect only catering are used to determine fighting difficulty, and vice-versa. One approach to remedy this would be to have separate difficulty formulae for catering and fighting. Another option would be to have a single difficulty factor (as now), but make it the maximum, or average, of two numbers corresponding to catering and fighting respectively. If these two numbers were each computed using the current formula, then we'd get the exact same difficulty value that we do currently. The advantage however is that it would be easy to tweak the catering and fighting formulae individually. One might for example choose to replace the effect of production boosts on the fighting number with a constant, and/or rebalance the effects of wonders and expansions on the two numbers. Such changes would make the difficulty formula much more robust against attempts to game it."}, {"33": "randblade said:\t\t\tSo you used up your stockpile - big whoop. Anyone can do that.[BR][BR]When the stockpile's gone, then what?\t\tClick to expand...[BR]I usually get at least one DA every week from spire. Sometimes 0, but sometimes more than 1. MMM and ELR I think I'll get enough of from crafting to use 2 in those tournaments where they will be useful. Also some UUUs come from crafting.[BR][BR]The only thing I'm unsure of is if I can do 2 DAs for a very lcng period, but if thats not possible I'll just go with one DA + one UUU. That should be possible.[BR]I've crafting running as much as I can and have never done any rerolls for 50 diamonds. I also do every recipe I want, using time instants if needed.[BR][BR]You only seems to see problems where I see opportunities.  This sounds like when spire got live. Almost everyone here complained and said it was impossible. Then after some time people obviously lerned how to do it. So give it a try."}, {"113": "Reading all of the latest comments and looking at my Fellowship, I agree that smaller cities are finding it easier to hit higher points than before, but larger cities cannot reach the same amount of tourney points they used to.[BR]In plain English: a new player starts out with this game and is happy to see a quick success and growth in the tourney, just to figure out after 2 years of carefully planning their city and having fun growing it, that a point has been reached, where any further progress in the tourney has become impossible, and the tourney has just become a tedious and expensive and boring part of the game (I for one used to enjoy the 4 battles per tourney!!!)....Now can someone please explain where the sense lies in this???"}, {"33": "Killiak said:\t\t\tSo you can keep on pushing that tournament like you never did before and saying that you hardly used a thing; your problem, aside from that utter chaos-fest of a city, will be that nobody believes you.\t\tClick to expand...[BR]Could you please tell me anything that I've said that is untrue. You have no clue at all and if my chaos city works better then yours I say you got a problem.[BR][BR]I've got high losses both in troops and supplies. But I think I can manage that. And if I couldn't I don't see that as a big problem as the only effect will be that I will not go as long in tournament. No big deal.[BR][BR]So I've not said that I hardly used a thing. Don't know where you got that from."}, {"7": "Far Reach said:\t\t\tartificially maintain a low production bonus by spending any boosting relics in the Academy.\t\tClick to expand...You can't spend your boosting relics in the MA as making spells requires only non boosted relics. Unless you've found another way...?"}, {"14": "valle said:\t\t\tCould you please tell me anything that I've said that is untrue. You have no clue at all and if my chaos city works better then yours I say you got a problem.[BR][BR]I've got high losses both in troops and supplies. But I think I can manage that. And if I couldn't I don't see that as a big problem as the only effect will be that I will not go as long in tournament. No big deal.[BR][BR]So I've not said that I hardly used a thing. Don't know where you got that from.\t\tClick to expand...[BR]valle said:\t\t\tYou are wriong, it was 2 DA and 2 MMM used.\t\tClick to expand...[BR]You said so right there, compared to what ShadowVision said you used that is a significant difference, and for a 10K score those 2DA and 2MMM is hardly a thing. Meaning you lost big in troops and goods, which I very much doubt you will be able to handle continuously. Ya know; Math and looking at what you can produce.[BR][BR]The only one who has no clue here is you. The math is clear, you actually have quite a chaotic city, and the point of the entire discussion is that this IS a hefty nerf and people ARE being punished for growing their city.[BR]Perhaps it is \"no big deal\" to you, but you are a very, very, very small minority who seems to think so (on this forum, that is), and you are skipping out on the bigger picture as it has been painted by so many replies already. Woosh, right over your head every time.[BR][BR]This is not about \"learning how to do it\".  It's about Inno nerfing down on their big, and paying, players, effectively punishing them for all the effort they put into their cities over the years.[BR]The reasoning put forth in the Beta announcement has absolutely zero basis for a nerf like this and gives zero reason for punishing long term players in this way. If the reason is too high KP gains, or too high rewards in general, then Inno should just come out and say so.[BR][BR][BR]Edit: mind you, I already have a plan on how to adapt to this nerf. I am simply principally opposed to this change."}, {"89": "Killiak said:\t\t\tThis is not about \"learning how to do it\".  It's about Inno nerfing down on their big, and paying, players, effectively punishing them for all the effort they put into their cities over the years.[BR][BR]Edit: mind you, I already have a plan on how to adapt to this nerf. I am simply principally opposed to this change.\t\tClick to expand...[BR]THIS![BR][BR]And if people are saying it got \"easier\" to gain 10k points... well i don't know how that would be possible, as the new formula clearly does the opposite. Not only by adding a higher difficulty at base, but also by adding difficulty values for expansions and AW levels that didn't exist before (and i'm still strictly against those 2 things!).[BR][BR]They didn't add a challenge, they've added another \"sink\" for whatever you have. I was fine with that regarding the spire... players who have too much of everything could sink in everything they got there. It was a new elemet that didn't change big parts of old things, besides stuff regarding time-instants and wishing wells. Even if i didn't like that change personally, it was okay when looking at it at the big picture. Now the Spire and the Tourney are both sinks. They replaced something rewarding with something unrewarding.[BR][BR]It is not even fair for new players. Even if they have some easier time with the first provinces now, but they'll have a possibly harder time to advance in general, as they won't have the same chances to gain kp compared to older players. CH16 players are already complaining about new techs that are very costly in terms of KP - well, just look at new players that still have to do the whole tech-tree, including that one too, but without having months/years of gaining endless KPs within the tourneys.[BR][BR]Only to add that: I don't mind some increased difficulty on tourneys by adding some spice to higher tourney provinces, but they totally nerfed it from a loot cave to a simple sink, starting at very early provinces. Hence they effectively removed large parts of income without giving me something else, besides a \"sink\" to lose even more.[BR][BR]There could have been so many ways to change the tourney... to spice it up and to replace the \"endless KP farm\" with something different. Maybe add some RNG, maybe implement some sort of \"currency/tickets\" you can earn by the tourney, to invest those into boxes you know from the MA or the events, maybe add the low chance to earn diamonds by that, but still have good chances to earn different amounts of KP.. etc. etc. etc.[BR][BR]So you could increase the difficulty but you could reason that by possible better/different rewards. That's just some simple idea i did come up while writing those lines.[BR][BR]But simply adding higher difficulty / sink-mechanics but keeping everything connected to it the same... nah. I don't see the reason why i should be happy about such a change or even accept it."}, {"24": "Far Reach said:\t\t\tA similar (although more difficult) option would be for a fighting city to artificially maintain a low production bonus by spending any boosting relics in the Academy.\t\tClick to expand...[BR]very interesting point! I have never thought of this one![BR][BR]I don´t think there are many ways to get rid of T1-T3 boost relics. making enchantments does not take boosted, so the only thing I can think of right now would be T3 relics by crafting pet food? Well one other way would be to constantly build/upgrade AWs that take these relics for upgrading and then selling the AWs, but also that would be a very slow and tedious process. The formula takes the biggest of your 3 boosts unless I remember that wrongly. So only getting rif of a T3 boost won´t do. If there is a way to get rid of all three T1-3 boosted relics it might be a hilarious town for tourneys, can´t play the 3 boosted tourneys of course (too many relics incoming), but completely dominate the other 6."}]