[{"32": "Far Reach said:\t\t\tMy suspicion is that both the developers and (a large chunk of) the players are happy in principle with the first kind of approach, but not the second. Lots of the concerns here seem to relate to it (the second approach).\t\tClick to expand...For me this is correct, the second part is the biggest issue for me,[BR]The first part I can understand, I can understand that there had to be a reduction in provincies in the tournaments.[BR][BR]The part I have issues with are the part that discourages developent, and create huge imbalance issues between players.[BR]For a while in the past chapter 4 cities where a bane in the tournaments, so easy did they get the near impossible 7020 points at that time untill the fire phoenix arrived and other players were able the get close or beat those scores by a little consistently.[BR][BR]This time the there is nog small crevasse like in the past between chapter 4 accounts and advanced players and between players in general we went from ~30% gap to the ability to reduce that to ~10% (the gap SS gap from when it was introduces to the recent past)[BR]This formula creates another bunch of chapter Y imbalances like the former chapter 4, and creates possible gaps between players in excess of 400%[BR][BR]Acknowledging the SS issue in the introductionary post and then create one thats not slightly bigger but in the magnitude of dozens of times is just ridicule.[BR][BR]valle said:\t\t\tCould you please tell me anything that I've said that is untrue. You have no clue at all and if my chaos city works better then yours I say you got a problem.[BR][BR]I've got high losses both in troops and supplies. But I think I can manage that. And if I couldn't I don't see that as a big problem as the only effect will be that I will not go as long in tournament. No big deal.[BR][BR]So I've not said that I hardly used a thing. Don't know where you got that from.\t\tClick to expand...[BR]valle said:I usually get at least one DA every week from spire. Sometimes 0, but sometimes more than 1. MMM and ELR I think I'll get enough of from crafting to use 2 in those tournaments where they will be useful. Also some UUUs come from crafting.[BR][BR]The only thing I'm unsure of is if I can do 2 DAs for a very lcng period, but if thats not possible I'll just go with one DA + one UUU. That should be possible.[BR]I've crafting running as much as I can and have never done any rerolls for 50 diamonds. I also do every recipe I want, using time instants if needed.[BR][BR]You only seems to see problems where I see opportunities.  This sounds like when spire got live. Almost everyone here complained and said it was impossible. Then after some time people obviously lerned how to do it. So give it a try.\t\tClick to expand...This is the first part, even if thats true so far (I expect a percieved one)[BR]It's actually ~100-125% per 2 weeks, this is a combination of UUU and DA combined. at least thats what my long term actual data tells me.[BR]MMM and ELR are ~6 each per 9 weeks[BR]So unless you can stretch those items over a 2 tournament period, instead of a 1 tournament period your HP bonusses are highly overrated.[BR][BR]As always with randoms, there are better periods where numbers go above this, and bad periods where numbers cannot match this.[BR][BR]Also it now takes a lot more time to reach those same scores as some with good scores already,if you want to reach a score like 10K it will force you to do manual combat on almost all provinces instead of 4x autocombat.[BR]so even \"if\" you are able to het those scores much easier now, it comes at a hefty price.[BR][BR]Off course it might be that your city build accidentally falls in one of the sweetspots that makes if easier for you than for others, but as some said, math never lies.[BR]Maybe you are depressed by the negativity of this topic and are trying to spin some positivity in it, which is fine as long as it's fairly displayed.[BR][BR]It's a fact you got higher scores now, but the part that is missing is what is the price for that score, it does not come \"for free\" or \"thanks to this change\" there is something else in play, a price for that score that has not been displayed \"yet\""}, {"32": "Gargon667 said:\t\t\tvery interesting point! I have never thought of this one![BR][BR]I don´t think there are many ways to get rid of T1-T3 boost relics. making enchantments does not take boosted, so the only thing I can think of right now would be T3 relics by crafting pet food? Well one other way would be to constantly build/upgrade AWs that take these relics for upgrading and then selling the AWs, but also that would be a very slow and tedious process. The formula takes the biggest of your 3 boosts unless I remember that wrongly. So only getting rif of a T3 boost won´t do. If there is a way to get rid of all three T1-3 boosted relics it might be a hilarious town for tourneys, can´t play the 3 boosted tourneys of course (too many relics incoming), but completely dominate the other 6.\t\tClick to expand...I tried this but you cannot maintain this.[BR]The problem is it uses the best of all 3 bonusses. and this disallows you essentially to play any of those 3 tournaments.[BR]I actually tried this approch at first, since I could get full production using buildings  (spire set) instead of factories.[BR][BR]The problem is that it's very hard to get rid of \"boosted\" relics, it's easy to get rid of stuff like sentient relics but not the base relics.[BR]And you aquire quite a handfull each tournament."}, {"24": "Silent Tempest said:We know that if troop mix was random each unit type would have a 20% weighting.Click to expand...[BR]This is what they had in the beginning of the beta test, they have changed that before the start on EN. [BR]Now we have preferred units in each tourney. Either 1 or 2 of them (3 has never been mentioned) each week. This was info in an announcement a while back. Which ones they are have already been set and we will now discover which ones they are. Planks is LR, Crystal is Mage+HR.[BR][BR]Silent Tempest said:We know that M, LM and HR should appear more often, also assuming that HR will appear twice as many times as either M or LM.Click to expand...[BR]No, never more than 2 (AFAIK), so in Crystal they chose M and HR, LM is not a preferred unit.[BR][BR][BR]Silent Tempest said:It'd be disingenuous to say that we'll meet the usual suspects more often but then make the percentage discrepancies negligible, so it wouldn't be too far out there to assume that we should meet M and LM twice as often as we would HM and LR.So, let's say the weighting for HM and LR are 10% each.That leaves 80% to be distributed amongst M, LM and HR x2.This would make the weighting per unit type: 10% HM, 10% LR, 20% M, 20% LM and 40% HR. That works perfectly into the assumptions.Click to expand...[BR]The main units were M and HR (I assume the same percentage for each of these two), we should meet them more often than LM,LR,HM (again I would assume the same percentage for each of these 3) I have no idea on what exact percentages that would be, but I agree the difference between the 2 groups should show up in your percentages. However small sample size is definitely something to consider. [BR]If I had to fix the percentages for 2 main units out of five, I would pick 35% for both mains and 10% for the 3 others... And for 1 main unit I would pick 40% (or 60%) main and 15% (or 10%) for the other 4. But that is a completely arbitrary guess, because I like round numbers. [BR][BR][BR]I assume over a longer time period collecting more data, it would be easy to get the actual percentages, however to me that is unimportant, for game play purposes it suffices to say that there are main units more likely to be enountered, based on which I can decide on which booster buildings to use in any given week (and of course recommend which units types are going to be more important to train). However I believe training one single type of unit is now a bad idea anyway, but if people ask there is something one can tell them. I believe it makes more sense to aim for an equal amount of the most important units and after the tourney replenish the losses, so as to get back to that equal distribution, like training units after the tourney instead of before the tourney."}, {"33": "Killiak said:\t\t\tYou said so right there, compared to what ShadowVision said you used that is a significant difference, and for a 10K score those 2DA and 2MMM is hardly a thing. Meaning you lost big in troops and goods, which I very much doubt you will be able to handle continuously. Ya know; Math and looking at what you can produce.\t\tClick to expand...[BR]I don't know if you failed to read what I wrote before. ShadowVision did not know what I used, he counted all boost buildings he could find (I bet he missed some). So he counted a lot of buildings that were used in earlier tournaments. So his findings had nothing to do with what I used. Understand? It's ShadowVision who doesn't have a clue.[BR][BR]About losses, I think I can manage it. You don't. I think I'm better judging what I can replace than you are. Or maybe I'm optimistic by nature and you are a born pessimist.[BR][BR]Killiak said:\t\t\tThe only one who has no clue here is you. The math is clear, you actually have quite a chaotic city, and the point of the entire discussion is that this IS a hefty nerf and people ARE being punished for growing their city.\t\tClick to expand...[BR]It seems to be you who have no clue. What has the chaoticness of my city to do with this? That city serves me well and I don't care that you don't like it. But if it makes you happy that your city is better looking, be my guest [smilie--sprite2][BR]The people that are punished are the people that are unable to adapt. Nothing new with that."}, {"33": "ShadowVision said:\t\t\tAnd if people are saying it got \"easier\" to gain 10k points... well i don't know how that would be possible, as the new formula clearly does the opposite. Not only by adding a higher difficulty at base, but also by adding difficulty values for expansions and AW levels that didn't exist before (and i'm still strictly against those 2 things!).\t\tClick to expand...[BR]It got easier as I earlier couldn't stand doing all those extra mouse clicks that would be needed to get that score. Much less effort to restock those extra troops/supplies lost."}, {"14": "valle said:\t\t\tI don't know if you failed to read what I wrote before. ShadowVision did not know what I used, he counted all boost buildings he could find (I bet he missed some). So he counted a lot of buildings that were used in earlier tournaments. So his findings had nothing to do with what I used. Understand? It's ShadowVision who doesn't have a clue.\t\tClick to expand...[BR]I did read what you posted. I actually QUOTED it in my previous post. So perhaps you would like to reread that previous post of mine, it seems you failed to read something there.[BR][BR][BR]valle said:\t\t\tAbout losses, I think I can manage it. You don't. I think I'm better judging what I can replace than you are. Or maybe I'm optimistic by nature and you are a born pessimist.\t\tClick to expand...[BR]It means I can actually use a calculator. It is a very simple equation, of your production facilities, assuming you have a 700% boost, and then applying other bonusses such as (but not limited to) AW's.[BR][BR][BR]valle said:\t\t\tIt seems to be you who have no clue. What has the chaoticness of my city to do with this? That city serves me well and I don't care that you don't like it. But if it makes you happy that your city is better looking, be my guest [smilie--sprite2][BR]The people that are punished are the people that are unable to adapt. Nothing new with that.\t\tClick to expand...[BR]It means you are losing out on a lot of potential space, which would make your city even more efficient. It has nothing to do with looks, but with efficiency, but I suppose this concept is as lost on you as most things in this discussion are.[BR][BR]Also, you seem to fail to understand that this whole thing has nothing to do with adaptation. Everybody will adapt, and devise new tactics, since Inno obviously gives them no choice in the matter.[BR]Everybody in this game, every player (yes, this includes you), is being punished with this formula for growing their city.[BR]- Get an expansion? Negative for tournament[BR]- Grow your AW? Negative for tournament[BR]- Open up a new chapter? Negative for tournament[BR][BR]This is simply an undeniable and proven fact, we know the formula and we know the impacts everything has on the tournament.[BR]Do try to wrap your head around that, instead of spouting your inane nonsense. It's actually not a hard concept."}, {"2": "Wow! You two! @valle  and @Killiak - you should agree to disagree and let it go. Obviously, you do not share same opinions and you will never come to a common ground. [smilie--sprite8]"}, {"14": "Alcaro said:\t\t\tWow! You two! @valle  and @Killiak - you should agree to disagree and let it go. Obviously, you do not share same opinions and you will never come to a common ground. [smilie--sprite8]Click to expand...[BR]Facts and math agree with me, so I wonder why it would be considered 'opinion'.[BR][BR]That said, you are correct in that one can lead a horse to water, but one cannot make it drink."}, {"89": "valle said:\t\t\tThe people that are punished are the people that are unable to adapt. Nothing new with that.\t\tClick to expand...[BR]At this point i will stop arguing with you...[BR][BR]Sure you can \"adapt\" to it, by throwing out much more of whatever, to gain the same rewards as before.[BR][BR]It's like your boss is asking you to do double the work, but for half of the money - for no reason. You can \"adapt\" to that, or you could simply tell him to **** off. I'm able to adapt to that new tourney-system, still doesn't change the fact that i'm punished for doing nothing wrong.[BR][BR]EDIT: PS: Clicks are no currency/good in this game. That only means you could have gone even further before, but you didn't because of \"too many clicks\". So you only got further this tourney because of less clicks, not because it got easier at its base. That only means you potentially heavily underperformed in tourneys before, now hitting limits in a way you've never encountered in the old tourney."}, {"2": "ShadowVision said:\t\t\tAt this point i will stop arguing with you...[BR][BR]Sure you can \"adapt\" to it, by throwing out much more of whatever, to gain the same rewards as before.[BR][BR]It's like your boss is asking you to do double the work, but for half of the money - for no reason. You can \"adapt\" to that, or you could simply tell him to **** off. I'm able to adapt to that new tourney-system, still doesn't change the fact that i'm punished for doing nothing wrong.\t\tClick to expand...in Valle's vision, those weak or unable to adapt for whatever reason must be punished and eventually excluded. Real life!!!! Stay out of this game!!!"}, {"32": "Last time I checked clicks only increased under manual combat, not to speak about time.[BR][BR]Old: (auto)[BR]Open provincie 1 click[BR][BR]open fight 1 click[BR]select units ~5-6 clicks[BR]Press fight 1 click[BR]-------------------------------[BR]8 clicks times 4 battles + opening battle = 33 clicks[BR][BR]New: (manual)[BR]Open provincie / battle 1 click[BR]Select units ~5-6 clicks[BR]pres manual fight 1 click[BR][BR]Move unit 1 click[BR]Attack or stand 1 click[BR]times 5 units = 10 clicks[BR][BR]3-4 rounds = 30-40 clicks[BR][BR]------------------------------------[BR]total 38-48 clicks[BR][BR]So not really less clicks, and since manual is a drag nor a time saver."}, {"24": "CrazyWizard said:\t\t\tLast time I checked clicks only increased under manual combat, not to speak about time.\t\tClick to expand...[BR]true, however manual fighters are an extreme minority in this game. I have to admit I am slacking myself, went from 50% manual fighting in Planks (a completely unsustainable practice) to 99% autofighting in Crystal. Of course a few thousand points less as a result, but so what... much more convenient playing [smilie--sprite1][BR][BR]I still prefer the new tourneys over the old, if they would just remove the \"*\" from the formula and replace them with \"+\" and give us an AW teleport ability, I´d be as happy as you can be. Well and that new nonsense with the separate production queues... I guess I am not that happy after all lol..."}, {"26": "valle said:\t\t\tThe people that are punished are the people that are unable to adapt. Nothing new with that.\t\tClick to expand...It's not about adaptation at all. If you take a look at the tournament squad size formula you will notice that now the more you progress in the game the less benefit you are getting from AWs, or the more AWs you build the less profit you are getting from each added expansion and so on. This (and the unlimited difficulty growth) is the main issue most of the players have with the changes. [BR]For now you can throw boosters and keep saying that it's fine, even better than before, but you are absolutely missing the bigger picture. This has nothing to do with being a pessimist or an optimist, it's about looking at the math behind the changes and making conclusions about the long-term consequences."}, {"32": "Gargon667 said:\t\t\ttrue, however manual fighters are an extreme minority in this game. I have to admit I am slacking myself, went from 50% manual fighting in Planks (a completely unsustainable practice) to 99% autofighting in Crystal. Of course a few thousand points less as a result, but so what... much more convenient playing [smilie--sprite1][BR][BR]I still prefer the new tourneys over the old, if they would just remove the \"*\" from the formula and replace them with \"+\" and give us an AW teleport ability, I´d be as happy as you can be. Well and that new nonsense with the separate production queues... I guess I am not that happy after all lol...\t\tClick to expand...[BR]True. but since valle claims 10k is \"easy\" since he could not be bothered all the clicks in the old tournament.[BR]10K is over 37 provinces, we all know there is no way that you can \"sustain\" that as he claims with autocombat, this means he does it all manual as thats the only way you might possibly be able to do this sustainable as he claims.[BR][BR]In that case from \"can't be bothered\" because to many clicks autocombat to more clicks manual combat is a conundrum to me."}, {"14": "Gargon667 said:\t\t\tI guess I am not that happy after all lol...\t\tClick to expand...[BR][BR][BR]So. Where you at? [smilie--sprite7]"}, {"24": "CrazyWizard said:\t\t\tTrue. but since valle claims 10k is \"easy\" since he could not be bothered all the clicks in the old tournament.[BR]10K is over 37 provinces, we all know there is no way that you can \"sustain\" that as he claims with autocombat, this means he does it all manual as thats the only way you might possibly be able to do this sustainable as he claims.[BR][BR]In that case from \"can't be bothered\" because to many clicks autocombat to more clicks manual combat is a conundrum to me.\t\tClick to expand...[BR]Ah I didn´t realize the talk about valle is still going on, I jumped over the whole bit there. Of course valles statement is nonsense 10k points is not easier now than it was before if all else is kept equal (unless you use an artificially constructed case which his town does certainly not fit). I can of course build a city on the architect that will do 10k easier now than before, but that is besides the point. For normal cities the resource input to reach a big score has gone up. That is a fact, it is also intentional and not a problem at all.[BR][BR]What I do buy instantly is that he enjoys the new tourney more than the old one (I agree, the old one was a horrid mindless clicking nonsense) and because he enjoys it more, he tries harder or he just wants to show off, or just simply do it for the sake of novelty or whatever. Tons of reasons why he could do better now than before, all of them valid. I didn´t read the details to check if he ever claimed it was easier than before or if he just said it is easy. 10k really isn´t that big a deal if one really wants to. Done it twice now, we´ll see if I do a third one today or not... But it sure is more difficult than it used to be [smilie--sprite1] I am happy to overspend now for a while, since all my resources were just piling up mountains before. I find a game should require me to spend my resources to achieve top scores. Before I did top scores while piling resources on top of old resource piles, it made absolutely no sense and should simply not be possible, so the new requirement to actually use resources is much more sensible.[BR][BR]If valle or anyone else feels like acknowledging an increased resource drain or not (not even saying he did, because I didn´t read those posts in detail) is hardly important, some people may not even feel the resource drain, because they do not pay close attention to everything that is going on. Actually very few people have a detailed inventory of everything pre and post tourney with every production during the tourney recorded, so missing things is the standard, not the exception.[BR][BR]Maybe I should add that real life time is another game resource, so yes changing autofighting the old to manual the new would be a way to make the new tourney \"easier\" as well... but not without an increased input of a resource."}, {"24": "Killiak said:View attachment 4735[BR][BR]So. Where you at? [smilie--sprite7]Click to expand...[BR]lol sounds like bargaining I would say... but I skipped the first two, then i will move directly to the last one and do my thing to get those 19 chests. It will just no be another 20k tourney any time soon I think, although it would be an actual challange to attempt that haha [smilie--sprite8]"}, {"27": "Silent Tempest said:\t\t\tBarracks training speed: 450[BR]This is made up of:[BR]a level 29 Barracks, providing 250 training speeda level 23 Needles of the Tempest, providing +80% (or +200) training speed[BR]Barracks training size: 5204[BR]This is made up of:[BR]a basic barracks training size of 63 level 27 Armories, each providing +215 training size or +645 overalla level 23 Shrine of the Shrewdy Shrooms, providing +2592 training sizea level 24 Dwarven Bulwark, providing +1961 training size[BR]As before, my squad size is 1584. I can train one slot of 5204 units every 2 hours 18 minutes. Given the overall training time with all 5 slots filled my Barracks is always training.[BR][BR]In terms of free troops I get:[BR]1961 T3 Barbarians, per 3 hours, from a level 24 Dwarven Bulwark476 T3 Priests, per 3 hours, from a level 23 Flying Academy317 T3 Mortars, per 3 hours, from a level 23 Temple of the Toads1901 T3 Crossbowmen, per 3 hours, from a level 23 Shrine of the Shrewdy Shrooms[BR]I collect my free troops, on average, 4 times per day; so, in a week I get:[BR]54,908 Barbarians or c. 35 squads13,328 Priests or c. 34 squads8,876 Mortars or c. 34 squads53,228 Crossbowmen or c. 34 squads[BR]In terms of replacing lost troops:[BR]I start with a base of at least 1000 squads of each unit.My military buildings can rarely keep up with troop loses each week.Every 3 weeks I feed my 2 Brown Bears, which provide a unit production bonus of 100%, and use time instants to top up my troops back to the 1000-squad base.Click to expand...Thanks so much for your detailed response. The training of your one slot corresponds with the formula I wrote in the previous post, so I suppose it's correct. And I bet if someone saw a mistake, they would happily tell me so. ;-) I'm addressing you, but I'm really using you as source data to figure out how to approach this tournament. I still don't know how to deal with it. :-/[BR][BR]With 450 speed and squad of 1584 you need 42 minutes to train one squad. squad_train_time = squad_size * 12 (that's one unit base training time) / speed. It also corresponds with your \"5204 units every 2 hours 18 minutes\" info.[BR]So per week you get 3*34+35=137 squads for free and almost 239 squads from your barracks. That's 376 squads. You lost 679 squads. Which means you are at pure loss of 303 squads. You are going to replace them eventually at a price of two pet food and some time instants. You are actually going to replace just 303/2=151,5 squads, because two brown bears give 100% bonus. To train 1 squad you need about 42 minutes. To train 151 squads you need cca 105 hours. As long as you can get this amount of time instants per week, these losses are sustainable.[BR][BR]PS: This analysis got obsolete very quickly. :-/ On beta Inno separated the three training queues today. Let's suppose you would be able to train in all three buildings at the 450 speed. I'm now ignoring the fact that the units are not equally usable, especially for elves. That would mean you get 137 squads for free and 3*239 squads from training facilities. That's 854 squads. You lost just 679, so you could have gotten even further provided the fight difficulty allowed that. ;-)"}, {"89": "Killiak said:\t\t\tSo. Where you at? [smilie--sprite7]Click to expand...Skipped first and went to 2 directly. Currently i may be somewhere between 3 and 4. \"Acceptance\" won't happen.[BR][BR]If they force big changes in such a dumb way, it's only a question of time until they do something like that again. I'm pretty sure there are creative minds working at inno, but they did a bad job there.[BR][BR]I'm getting more and more friends with the mind to just stop playing. So there is the \"leaving\" option missing in your picture. [smilie--sprite8][BR][BR]*Edit: Made one sentence sound a bit friendlier."}, {"14": "ShadowVision said:\t\t\tI'm getting more and more friends with the mind to just stop playing. So there is the \"leaving\" option missing in your picture. [smilie--sprite8]Click to expand...[BR]Yeah, left it out on purpose [smilie--sprite2]"}]