[{"33": "CrazyWizard said:\t\t\t10K is over 37 provinces, we all know there is no way that you can \"sustain\" that as he claims with autocombat, this means he does it all manual as thats the only way you might possibly be able to do this sustainable as he claims.\t\tClick to expand...[BR]Why do you speak about sometning you don't have a clue on. I autofight all (have not done a manual fight in years) and when I think losses will be too high I cater. Simple and quick."}, {"33": "ShadowVision said:\t\t\tEDIT: PS: Clicks are no currency/good in this game. That only means you could have gone even further before, but you didn't because of \"too many clicks\". So you only got further this tourney because of less clicks, not because it got easier at its base. That only means you potentially heavily underperformed in tourneys before, now hitting limits in a way you've never encountered in the old tourney.\t\tClick to expand...[BR]As the time I've got to spend on this game is limited it means that I now can do things I couldn't do before. In that way it's easier for me to get a high score in tournament now than befoe. Is that so hard to understand. Time available dictates a lot of things. You will for example be able to produce a lot more if you always can run 3 hours productions compared to if you do 9 hours."}, {"33": "Killiak said:\t\t\tIt means I can actually use a calculator. It is a very simple equation, of your production facilities, assuming you have a 700% boost, and then applying other bonusses such as (but not limited to) AW's.\t\tClick to expand...[BR]But you don't even now how much I did spend on catering or how many troops I lost. Without knowing that you have no idea if it's sustainable for me or not. You speak of things you have no idea about."}, {"14": "valle said:\t\t\tBut you don't even now how much I did spend on catering or how many troops I lost. Without knowing that you have no idea if it's sustainable for me or not. You speak of things you have no idea about.\t\tClick to expand...[BR]You mean the average cost per province / star on which data has been gathered ever since the start of this form of the tournament on Beta? For which the total cost has already been calculated to be far beyond the daily / weekly production capabilities of an average town, and even beyond that of those with well above average production power, when people want to push for higher scores (for example, 10K)?[BR][BR]It's amusing that you actually think you still have any kind of decent argument in this discussion, when you have been slapped around  by everybody telling you that you are simply wrong.[BR]Take a hint already.[BR][BR]@CrazyWizard @MinMax Gamer You guys feel the urge to educate, based on the Beta findings? There's 100's of pages in there, but I am guessing you guys still know which page all this info is on."}, {"84": "I think the best solution here is to put the idiot on ignore, he is never going to accept that he might possibly be wrong."}, {"22": "I very much doubt anyone will be able to sustain 10k points in this new tournament style. If anyone can then I doff my cap to them and it will be someone who manually fights and has some serious knowledge of how to do that and how to build a town for military efficiency.[BR][BR]For anyone else, they may be able to do it for a certain time by burning through accrued resources. If @valle started this process with large amounts of goods, combat buildings and troops then we cannot say how long it may last. [BR][BR]In order for it to be sustainable you will need to finish a week with exactly as many troops, goods, combat buildings, time instants and supplies instants as you started the week. If you are managing that after a 10k tournament @valle then I invite you to feed all your tournament data to @MinMax Gamer as I for one would be really interested to see how it's done."}, {"4": "My first comment in this thread after the 3rd tourney start.[BR][BR]The biggest dislike for me is that all tourneys now seem the same, I cannot see the weighted troop type differences, doing 25 provinces to round 6 for the first 2 and 25 provinces for round 1 on scrolls.[BR]Dislike 2 has to be the loss in round 1 of fights where as a very experienced tourney player they are a total loss, auto or manual and troops selected to normally easily defeat an enemy twice my size. This is most prevalent when 4 mages and 1 light ranged are the enemy set up but also occurs with other set ups.[BR][BR]Please increase the weighting of enemy troops faced more, to give me more variety each week, and give players at least some chance of focusing on certain troops. As the changes are aimed for newer players, the weighting could increase with the provinces solved so 10+ would have more weighting of troop type for example. This could be an escalation, 2% weighting increase per province solved for example.[BR][BR]Positives, 1 fight per province for sure saves me time and repetitiveness and makes manual fighting time allowable for me once more. Also the bonus chests are a nice addition even if we as a 10 chest fellowship before now only gain 2 or 3 extra. Also I see our smaller players scores have increased by up to 50% more so thank you for making smaller cities feel like they now can contribute more."}, {"74": "Pauly7 said:\t\t\tI very much doubt anyone will be able to sustain 10k points in this new tournament style. If anyone can then I doff my cap to them and it will be someone who manually fights and has some serious knowledge of how to do that and how to build a town for military efficiency.[BR][BR]For anyone else, they may be able to do it for a certain time by burning through accrued resources. If @valle started this process with large amounts of goods, combat buildings and troops then we cannot say how long it may last.[BR][BR]In order for it to be sustainable you will need to finish a week with exactly as many troops, goods, combat buildings, time instants and supplies instants as you started the week. If you are managing that after a 10k tournament @valle then I invite you to feed all your tournament data to @MinMax Gamer as I for one would be really interested to see how it's done.\t\tClick to expand...10k is sustainable but you'd have to work on it. [BR][BR]I'm extremely confident I could do 10k each week, but I've built my city as a lean, green fighting machine. I think for normal players playing normally it will be very difficult.[BR][BR]But what's absolutely undeniable is its harder. Much, much harder. I managed to complete the tournament last week, but I burnt through a lot of resources doing so and wouldn't sustain that so unlike valle I certainly never felt the desire to come here and gloat about how much I could do (while ignoring the fact I'm burning my resources while doing so)."}, {"32": "valle said:\t\t\tWhy do you speak about sometning you don't have a clue on. I autofight all (have not done a manual fight in years) and when I think losses will be too high I cater. Simple and quick.\t\tClick to expand...[BR]So you claim 10K is sustainable, on autofight ect ect ect.[BR][BR]This only proofs your're [BR]Pauly7 said:\t\t\tI very much doubt anyone will be able to sustain 10k points in this new tournament style. If anyone can then I doff my cap to them and it will be someone who manually fights and has some serious knowledge of how to do that and how to build a town for military efficiency.[BR][BR]For anyone else, they may be able to do it for a certain time by burning through accrued resources. If @valle started this process with large amounts of goods, combat buildings and troops then we cannot say how long it may last.[BR][BR]In order for it to be sustainable you will need to finish a week with exactly as many troops, goods, combat buildings, time instants and supplies instants as you started the week. If you are managing that after a 10k tournament @valle then I invite you to feed all your tournament data to @MinMax Gamer as I for one would be really interested to see how it's done.\t\tClick to expand...[BR]It might be sustainable by a few, obviously not under the circumstances that valle posted.[BR]Either he is lying or using many stocked recources maybe even without knowing it since thats easy if you do not maticiously note those down.[BR][BR]But yeah a lean mean machine with the stamina to manual fight might be able to pull that off.[BR][BR]Someone like Dony for example could pull it off, also on beta some of the rules changed that might possible make it possible in the future, maybe...[BR]I have no clue where I'll end up be, I have to figure out if manual fighting is doable for me, and even at the end of the scale I still might pull a off a good score, but thats only because I can use double boosters each week compared to most others, you need every edge when you are fighting mixed enemies that are 210+% your size.[BR]On the other had I will have SS at provincie 30 round 1 of ~16 time my own SS, that means each squad lost will be 16 squads.[BR]6 round loosing 1-2 squads on each battle will cost 96-192 squads for 1 province[BR][BR]So yeah 10k? for me highly unlikely unless I find a way on manual battles to keep the losses near 0 somehow."}, {"33": "Pauly7 said:\t\t\tIn order for it to be sustainable you will need to finish a week with exactly as many troops, goods, combat buildings, time instants and supplies instants as you started the week. If you are managing that after a 10k tournament @valle then I invite you to feed all your tournament data to @MinMax Gamer as I for one would be really interested to see how it's done.\t\tClick to expand...[BR]I don't agree on that definition. I would say that you can do about the same results in tournament for the forseeable future would be a better definition. Because you can adapt your play after the resources you have. The resource I've got in smallest amount is orcs. So when I hit a province demanding orcs I can select to fight even if I normally wouldnt do that since the losses would be to high. I also could skip that province (not for level 1 province) and that way avoid spending orcs.  Provinces demanding resources that you have no problems to replace like mana and coins can be catered more often to save troops, That way you can cope with beeing low on certain resources.[BR][BR]Also don't get fixated with 10k. That was my result for last week. As always in tournament some weeks will be better and some worse. This week the tournament seems harder than last (not unexpected)."}, {"63": "Fortunately for most of us given time, we can adapt to change. It is a very long time since I put in the effort required to finish in the weekly top 100 to earn some of the ranking points and the time since has been doing what was needed to unlock research etc. Typically that involved going after the extra KP in round 2 provinces 10 and above. Now I can do less provinces and take them out laterally to round 5 and gain the extra KP that I want for around the same cost as before. I keep numbers for kp swap threads yet never saw a need of archiving tournament results so not going to try confusing myself or others with numbers I don't have. Just, I have adapted to the new requirements. This week I will see if I can reach 3,000 points without feeding my brown bear and tossing 30 x 5hr timers at my barracks."}, {"89": "Rarely Here said:\t\t\t...\t\tClick to expand...[BR]That's 15 x 5* or 12 x 6*[BR][BR]If you got a fire-phoenix, that should be easily possible without investing too much of anything else. Only thing you have to toss in are 2-3 pet foods, depending on your willingness to do 5* or 6* and how much goods etc. you want to invest. Some negotiations will be still part of the thing. Some manual fights will also increase the chances to need less troops."}, {"90": "I've largely stayed out of the conversation not because I don't come back to it; I do in fact, and quite often at that but rather I've resigned to the fact that Inno, its development team and the community managers here don't care. In essence, this forum, these threads of discussion aren't about working with the game developers into making the game experience more enjoyable. It cannot be, because in principle, what we want out of the game is in stark contrast to what the game designers want.[BR][BR]We want a game that rewards us for the way we play it, whether it is carefully judged, chaotic, lazy or manic. We find pride in ourselves for finding exploits and loopholes and clever tactics to outsmart the system so that we can reap the best benefits while doing not so much.[BR][BR]They want a game that drives traffic. It's all about numbers for the business, there's no space in their consideration for feelings and opinions. The bottom line is when a player has the means and is desperate enough he will purchase diamonds. Ignorant players who don't now better will still purchase diamonds. And they don't realise that it will come to haunt them later on but that doesn't matter to Inno. Rather, they want that, because people played Elvenar are likely to try out their other games too and that means money still flows into the accounts.[BR][BR]This outrage we have now for the new Tourney design stems from the fact that we now lose access to the norm we had then. It made us feel uneasy, we are grossly uncomfortable with what the new system requires of us. By all rights this is just a game, and if we don't derive any further enjoyment from this, there's nothing to stop you from abandoning it.[BR][BR]But before you take that drastic decision, there's a simpler solution: scale down how much effort you put into it. [BR][BR]By now you must have noticed how different my tone was from my earlier posts. That's because the rage has mostly passed and now I'm making my peace with it. In the past where I had been able to, without the aid of Fire Phoenix and Brown Bear or any booster buildings, managed to get to 18 provinces, now I just settle to do the first 6. I'm not required to produce any more than I had before, I am not spending any more boosters either. I just get less from the end of the Tourney. It means it'll take longer for me to accumulate the Royal Restorations. Doesn't mean I won't get enough eventually.[BR][BR]You data-crunchers, nay-sayers,  eternal optimists out there are wasting your breath fighting. Community managers are tasked to keep things civil, they aren't tasked to play the game. So there's no common ground between us and them. You're better off venting to a potted plant as science has proven that potted plants respond to criticism."}, {"90": "And with that, I propose this thread be closed. After all, it cannot be upcoming Tournament changes if the changes have already happened can it? [BR][BR]If nothing has been changed from the first week of its release till now, then it is safe to assume it won't ever. The variance in data you pick up is largely to do with the different week it is of the Tourney. Long term we can see the writing on the wall. It is no longer sustainable to achieve high scoring Tourneys. So the solution as I proposed earlier is to pick your push weeks."}, {"22": "Ephraim Heart said:\t\t\tIf nothing has been changed from the first week of its release till now, then it is safe to assume it won't ever.\t\tClick to expand...Changes have already been made... and the next one is about to hit."}, {"22": "randblade said:\t\t\t10k is sustainable but you'd have to work on it.[BR][BR]I'm extremely confident I could do 10k each week, but I've built my city as a lean, green fighting machine. I think for normal players playing normally it will be very difficult.\t\tClick to expand...CrazyWizard said:\t\t\tBut yeah a lean mean machine with the stamina to manual fight might be able to pull that off.[BR][BR]Someone like Dony for example could pull it off\t\tClick to expand...If anyone can sustain that level I imagine it's people like you guys and Dony. I'm not saying there aren't others too, but I do believe it will come down to an in depth knowledge of manual fighting and people who are prepared to do all the things that are required.[BR][BR]valle said:\t\t\tI don't agree on that definition.\t\tClick to expand...My definition is sound. In order to find a sustainable level, then whatever you're doing you have to not be losing resources as you do it, including troops, goods, Orcs, time instants, supply instants, combat buildings. If any of these are reducing then it is not sustainable in the long run.[BR][BR]For me, I'm still operating a controlled experiment. This means I am using a single DA per week and a fed Fire Phoenix. No more buffs, because the way things are looking right now it doesn't seem that we're going to be winning more HP buildings than that. During the week I'm using my Brown Bear to replenish the troops. I'm doing some manual fighting - maybe one encounter every five - I won't do more than that because in the long run I'm not going to commit more time to it. I scored in the high 6,000s the first week, a little less the second, and it looks like back up in the third. At these levels I am able to reproduce everything that I've lost, with the exception that I am a little down on supply instants from where I started. As I get a little more used to manual fighting, though, it looks like 7,000 may be a workable level for me.[BR][BR]I will continue like this for the first 9 weeks to get a controlled picture of each tournament type and only after that will I start throwing ELRs and MMMs into the mix. These should push my average scores up a little higher, but I'm trying not to muddy the waters right now. I'm also sitting on tons of troops so I will have the scope to have a few big weeks when I want them, after the experiment.[BR][BR]Of course changes are also being made as we go, so the control is not really a proper control."}, {"84": "Ephraim Heart said:\t\t\tAnd with that, I propose this thread be closed. After all, it cannot be upcoming Tournament changes if the changes have already happened can it?\t\tClick to expand...[BR]This thread is to give feedback about the new tournament system and as the test is still going on it does not really make any sense to close it."}, {"33": "Pauly7 said:\t\t\tMy definition is sound. In order to find a sustainable level, then whatever you're doing you have to not be losing resources as you do it, including troops, goods, Orcs, time instants, supply instants, combat buildings. If any of these are reducing then it is not sustainable in the long run.\t\tClick to expand...[BR]You are thinking to static. In this game you can change your production to adapt to different needs. So say my stock of X is diminishing every week. As a response to that I can increase production of X at the expense of something I've got to much of. Also there is always an incoming stream of resources from events that will fill up stock of maybe time instants. So for that reason you can manage weekly decreaising of certain resources.[BR]As an example I've built all orc producing buildings I could find as orcs are my current weak spot. But if you continue just as before I can imagine you will run into problems. You must adapt to the new environment."}, {"22": "valle said:\t\t\tYou are thinking to static. In this game you can change your production to adapt to different needs. So say my stock of X is diminishing every week. As a response to that I can increase production of X at the expense of something I've got to much of. Also there is always an incoming stream of resources from events that will fill up stock of maybe time instants. So for that reason you can manage weekly decreasing of certain resources.[BR]As an example I've built all orc producing buildings I could find as orcs are my current weak spot. But if you continue just as before I can imagine you will run into problems. You must adapt to the new environment.\t\tClick to expand...Of course it's about adaptability. I am not thinking statically, as you would say, but I am considering where the resource is coming from to replenish the resources I am using. If you have enough Orc Nests and Orc Ships to cater for your Orc needs then great, check that one off. For most other things when you are increasing the level of production then it comes at some expense. For example, I will boost my supplies production with the use of PoP spells. I have getting on for 1,500 of those in stock, but that doesn't matter. If I am continually using more of them than are coming in then in the long run that is not sustainable. You may be using a lot more goods to cater. In response to that perhaps you are using MM spells to compensate, but if you are using more than is coming in then it is not sustainable. In that eventuality you may need to start crafting those spells, but that comes at the expense of crafting CCs, which means another resource gets into shorter supply.[BR][BR]Rewards from events are the curve ball because we never know what and how much we will be given. We do know, however, that the value of these rewards are being reduced event on event and that pattern is showing no sign of changing. Long term you can only bank on quite a modest amount of things coming from them.[BR][BR]You say that my thinking is static, whereas I think I am considering a much broader long term view of supply and demand. I suspect that you are very much more living in the moment, and that is fine for you - you may not even want to keep doing this long term, but it doesn't mean that you will be able to do the same thing forever."}, {"1": "That's correct, as[BR]Timneh said:\t\t\tThis thread is to give feedback about the new tournament system and as the test is still going on it does not really make any sense to close it.\t\tClick to expand...[BR]Indeed, this thread will remain open because its very valuable feedback for the developers.[BR][BR]As you could observe, we are still applying changes in the tournament, such as the ability to queue all three army generating buildings and some adjustments made to the actual tournament. [BR][BR]Allowing all three Barracks, Mercenary Camp, and Training Grounds to \"burn\" at the same time, allocate more strategy, and more gameplay.[BR][BR]We are aware of the impact as far as army power that this change that affect the balance between humans and elves."}]