[{"7": "valle said:\t\t\tevents that will fill up stock of maybe time instants.\t\tClick to expand...You must be playing different events than I am, because the last 5 or so events (6 if you count the one currently running on beta) there have been no time instants among the rewards any more and they're probably not coming back..."}, {"89": "C-Nymph said:\t\t\t...\t\tClick to expand...Confirmed. Time instants you could gain within events were moved to the spire. Since the spire was implemented, there was no more time instants in any event. At least not as a daily/farmable reward."}, {"22": "C-Nymph said:\t\t\tYou must be playing different events than I am, because the last 5 or so events (6 if you count the one currently running on beta) there have been no time instants among the rewards any more and they're probably not coming back...\t\tClick to expand...ShadowVision said:\t\t\tConfirmed. Time instants you could gain within events were moved to the spire. Since the spire was implemented, there was no more time instants in any event. At least not as a daily/farmable reward.\t\tClick to expand...With the exception of the odd 100% supply instant as a 'grand' prize, plus I think in the last event they gave out a 25% as a daily. There are certainly not many of them though."}, {"7": "Pauly7 said:\t\t\tWith the exception of the odd 100% supply instant as a 'grand' prize, plus I think in the last event they gave out a 25% as a daily. There are certainly not many of them though.\t\tClick to expand...Those are still not time instants [smilie--sprite2]"}, {"73": "anonglitch said:\t\t\tThat's correct, as[BR][BR][BR]Indeed, this thread will remain open because its very valuable feedback for the developers.[BR][BR]As you could observe, we are still applying changes in the tournament, such as the ability to queue all three army generating buildings and some adjustments made to the actual tournament. [BR][BR]Allowing all three Barracks, Mercenary Camp, and Training Grounds to \"burn\" at the same time, allocate more strategy, and more gameplay.[BR][BR]We are aware of the impact as far as army power that this change that affect the balance between humans and elves.\t\tClick to expand...[BR]Here’s some feedback / what I’d expect given the new system is here to stay. [BR][BR]1. Frequent troop boosters in crafting. They just give us 20-30 extra kp - as the difficulty growth is exponential (SS formula). So generous amounts of boosters won’t hurt the game / balance. [BR]2. Probably “all” unit attack boosters.[BR]3. Elves need barrack troop balancing as 3x training is soon to be allowed. Elves need powerful troops :  After all it’s Elvenar, not Humanar."}, {"22": "C-Nymph said:\t\t\tThose are still not time instants [smilie--sprite2]Click to expand...Whoops, sorry, I'm not reading properly!"}, {"7": "To me, the simultaneous queuing is not so much a ‘compromise/gift’ to us as they make it seem, since it is capped by the amount of time instants we get, which is limited..."}, {"73": "valle said:\t\t\tBut you don't even now how much I did spend on catering or how many troops I lost. Without knowing that you have no idea if it's sustainable for me or not. You speak of things you have no idea about.\t\tClick to expand...Hi buddy. Friendly suggestion. Don’t expose yourself too much. [smilie--sprite1][BR]I believe you have no idea of the exact numbers in terms of expense vs production(all means, including instants). [BR]I appreciate you striving for something though. But things are fully calculated and can be reproduced and checked."}, {"73": "C-Nymph said:\t\t\tTo me, the simultaneous queuing is not so much a ‘compromise/gift’ to us as they make it seem, since it is capped by the amount of time instants we get, which is limited...\t\tClick to expand...Yes. It’s an addition. SS formula Is exponential. Addition can never beat exponential. [BR]But yeah 20 kp more, why not."}, {"7": "JollyElf said:\t\t\tElves need powerful troops :  After all it’s Elvenar, not Humanar.\t\tClick to expand...Hear hear![BR]Would love it if the elves would just have the same troops in the barracks as the humans now do. Or at least provide us with some troop instants that are not barracks-troops!"}, {"89": "JollyElf said:\t\t\t3. Elves need barrack troop balancing as 3x training is soon to be allowed. Elves need powerful troops :  After all it’s Elvenar, not Humanar.\t\tClick to expand...[BR]With that they try to \"fix\" something they have broken with the new formula. They wouldn't need to add that, if they wouldn't increase the needed squad-size that fast. While this is some sort of \"addition\", many casual players will struggle to support 3x training with their tools. I may even add 1-2 workshops by myself, as everything was fine with 5 by now, but it won't if 3 training queues are running 24/7...[BR][BR]But... what units should i train there? Most of the additional units are very situational or no real alternative at all. If they cost orcs, it doesn't even makes sense to train them for the tourney, as it may be even cheaper to negotiate provinces with orcs. compared to sending in orc-units worth of 2 weeks orcs-income.[BR][BR]It's nice that they try... to change things... but for me this is some sort of \"desperate move\" to somehow show the ppl \"look we're listening! - look what we did for you!\".[BR][BR]IMHO they should revert that change and revisit that whole thing. I'm open for any changes regarding the tourney, i'm open to spice things a bit more up, implement some more RNG units, increase SS growth and so on, but there still should be a rewarding part and it should be reasonable. Not getting from super easy prov. 1 to super-hard at prov. 12~14 (without anything), if you could even go further in the old tourney-system without any booster. Think about why you want to change some thing and make a proper approach, not just artifically limit things by making those things unreasonable hard. You want to limit the KP-income? Alter the way how the tourney is rewarding players. Make the drops RNG, add some additional stuff to it (like diamonds / RR or MM spells or even big KP-Packages - but at a very low chance) and that could be used as a reason why things may be harder, but more interesting now. With diamonds or other rare-drops there is also a reason, besides for the sake of \"points\", to push your limits now and then.[BR][BR][EDIT:] You could even make tourney-events that increase these chances of those rare things to even motivate less active tourney players to take part there. Look... an event that doesn't take much work! [smilie--sprite8] No costum sprites for new buildings etc., but ppl would be happy about such an event. Gosh the possibilities if you just think about that whole thing for 5 minutes![BR][/EDIT][BR][BR]Look at the spire, you did nearly the same there. The difference between those 2 would be still the rewards (time instants / CC / scrolls vs enchantments / relics / etc.) and the open end (in theory) of the tourneys.[BR][BR]And finally: take out that AW/Expansion BS and never ever think about that again."}, {"33": "C-Nymph said:\t\t\tYou must be playing different events than I am, because the last 5 or so events (6 if you count the one currently running on beta) there have been no time instants among the rewards any more and they're probably not coming back...\t\tClick to expand...[BR]I wrote \"maybe time instants\". I don't know what future events will give, so I wrote 'maybe'."}, {"33": "Pauly7 said:\t\t\tYou say that my thinking is static, whereas I think I am considering a much broader long term view of supply and demand. I suspect that you are very much more living in the moment, and that is fine for you - you may not even want to keep doing this long term, but it doesn't mean that you will be able to do the same thing forever.\t\tClick to expand...[BR][BR]This game is a moving target so you can not have that much 'long term view' as in that period the game has probably evolved enough that all current calculations are worthless. As they say in the military, 'No plan survives first contact with the enemy' [smilie--sprite2][BR]I've played this game long enough so I'm sure I'll detect in ample time if I will get into trouble with specific resources. And I expect to be able to react to it. Putting spells to workshops I expect to be able to do for how long I want as opening about 50 provinces will give me a lot of spells and I've got +1k in stock. I haven't started using spells on goods buildings yet, but should I see the need I'll surely do it. I'm receiving a lot more of those spells now then before so stock is building up nicely."}, {"7": "ShadowVision said:\t\t\tYou want to limit the KP-income? Alter the way how the tourney is rewarding players. Make the drops RNG, add some additional stuff to it (like diamonds / RR or MM spells or even big KP-Packages - but at a very low chance) and that could be used as a reason why things may be harder, but more interesting now.\t\tClick to expand...[BR]Or at the very least, apply the province 1-9 rewards to the provinces from 10 and up. Change it up a little, give a few less kp here and there, maybe even throw in some time instants [smilie--sprite2] But don't make it impossible. If you want to nerf the rewards, then nerf the rewards; don't destroy the whole tournament!"}, {"73": "ShadowVision said:\t\t\tWith that they try to \"fix\" something they have broken with the new formula. They wouldn't need to add that, if they wouldn't increase the needed needed squad-size that fast. While this is some sort of \"addition\", many casual players will struggle to support 3x training with their tools. I may even add 1-2 workshops by myself, as everything was fine with 5 by now, but it won't if 3 training queues are running 24/7...[BR][BR]But... what units should i train there? Most of the additional units are very situational or no real alternative at all. If they cost orcs, it doesn't even makes sense to train them for the tourney, as it may be even cheaper to negotiate provinces with orcs. compared to sending in orc-units worth of 2 weeks orcs-income.[BR][BR]It's nice that they try... to change things... but for me this is some sort of \"desperate move\" to somehow show the ppl \"look we're listening! - look what we did for you!\".[BR][BR]IMHO they should revert that change and revisit that whole thing. I'm open for any changes regarding the tourney, i'm open to spice things a bit more up, implement some more RNG units, increase SS growth and so on, but there still should be a rewarding part and it should be reasonable. Not getting from super easy prov. 1 to super-hard at prov. 12~14 (without anything), if you could even go further in the old tourney-system without any booster. Think about why you want to change some thing and make a proper approach, not just artifically limit things by making those things unreasonable hard. You want to limit the KP-income? Alter the way how the tourney is rewarding players. Make the drops RNG, add some additional stuff to it (like diamonds / RR or MM spells or even big KP-Packages - but at a very low chance) and that could be used as a reason why things may be harder, but more interesting now. With diamonds or other rare-drops there is also a reason, besides for the sake of \"points\", to push your limits now and then.[BR][BR][EDIT:] You could even make tourney-events that increase these chances of those rare things to even motivate less active tourney players to take part there. Look... an event that doesn't take much work! [smilie--sprite8] No costum sprites for new buildings etc., but ppl would be happy about such an event. Gosh the possibilities if you just think about that whole thing for 5 minutes![BR][/EDIT][BR][BR]Look at the spire, you did nearly the same there. The difference between those 2 would be still the rewards (time instants / CC / scrolls vs enchantments / relics / etc.) and the open end (in theory) of the tourneys.[BR][BR]And finally: take out that AW/Expansion BS and never ever think about that again.\t\tClick to expand...Not disagreeing. But I said, [BR]“ given the new system is here to stay. “[BR][BR]I guess there’s been quite some movement, including the 3x training in beta. That I’m more inclined to think the changes are here to stay (not that I want the SS increasing so rapidly)"}, {"75": "The exponential aspect of the formula seems to be handled like something dropped in by senior management and everyone else at Inno's too scared to suggest that the Emperor has no clothes ..."}, {"26": "anonglitch said:\t\t\tIndeed, this thread will remain open because its very valuable feedback for the developers.[BR][BR]As you could observe, we are still applying changes in the tournament, such as the ability to queue all three army generating buildings and some adjustments made to the actual tournament. [BR][BR]Allowing all three Barracks, Mercenary Camp, and Training Grounds to \"burn\" at the same time, allocate more strategy, and more gameplay.[BR][BR]We are aware of the impact as far as army power that this change that affect the balance between humans and elves.\t\tClick to expand...Honestly, separating the queues doesn't seem like the changes needed to address the current issues. Maybe you can ask the devs to at least explain the idea behind the multiplicative formula? For example why should each unlocked research make ancient wonders less valuable? [BR]I'm sorry, but inflating the troop requirements and then allowing to produce more troops doesn't look like our feedback is even remotely valuable to the devs. You can't fix the broken engine by placing ribbons on it, and that's exactly what this change is struggling to achieve. \"Hey, we broke the core formula, but maybe you will ignore it if we allow you to produce a few extra troops\". And no, it doesn't allocate for more strategy, because the only strategy left in the game now is to find the right place in the research tree, build just the right AWs, and then never progress, upgrade any AWs or buy any expansions, since any change in your city stats will make your game harder."}, {"75": "Errandil said:\t\t\tMaybe you can ask the devs to at least explain the idea behind the multiplicative formula? For example why should each unlocked research make ancient wonders less valuable?\t\tClick to expand...Yes, that ... an explanation of the logic behind that would be most helpful ..."}, {"33": "Errandil said:\t\t\tAnd no, it doesn't allocate for more strategy, because the only strategy left in the game now is to find the right place in the research tree, build just the right AWs, and then never progress, upgrade any AWs or buy any expansions, since any change in your city stats will make your game harder.\t\tClick to expand...[BR]Sounds like you are playing the game 'Tournament'. There are other parts of this game. If you don't want to develop your city above a certain limit beacuse of prioritizing tournament, whats the point of doing tournament then? You will not have anywhere to place all the kp's you win. I think it's better to develop your cities with the help of resources you get from tournament."}, {"54": "Verde said:\t\t\tYes, that ... an explanation of the logic behind that would be most helpful ...\t\tClick to expand...Didn't they explain this properly?[BR]If you are bigger/Stronger it should be a bit harder for you, so that people who are just beginning in the game get a chance to score high as well and are able to join the competition instead of defaulting in the last places.[BR][BR]They also said, the benefit from being a bit bigger/stronger should always be bigger then the penalty you get from that. Now there's still some work on that formula since thats obviously not the case, since some wonders who don't help you at all also increase the difficulty and theres a 400%+ difficulty difference between people with or without wonders"}]