[{"7": "Heymrdiedier said:\t\t\tDidn't they explain this properly?[BR]If you are bigger/Stronger it should be a bit harder for you, so that people who are just beginning in the game get a chance to score high as well and are able to join the competition instead of defaulting in the last places.\t\tClick to expand...[BR]And that’s where most of us completely disagree with the devs. We’ve worked hard for years to get our cities to where they are now. Why should beginning players be able to get the same results as players who have progressed their cities with hours and hours of work? Isn’t that the whole point of wanting to progress - to get better results?"}, {"75": "Heymrdiedier said:\t\t\ttheres a 400%+ difficulty difference between people with or without wonders\t\tClick to expand...Does this not seem just a little high?"}, {"26": "Heymrdiedier said:\t\t\tDidn't they explain this properly?[BR]If you are bigger/Stronger it should be a bit harder for you, so that people who are just beginning in the game get a chance to score high as well and are able to join the competition instead of defaulting in the last places.\t\tClick to expand...If that were their intention, this could've been done with the additive formula. Which, btw, would be much easier to control so it wouldn't result in 400% difference. I don't mind the idea of making it harder for bigger players (although I'd argue that if you are just starting the game you normally can't expect to compete with those who are playing for 3+ years, otherwise what's the point of developing your city?), but there's literally no logical explanation why the penalty for each change in the city depends on other stats. As an example, if I have maxed FA or Needles I can't get more from an expansion than someone who doesn't have them, so why should this expansion add more to my tournament SS?"}, {"54": "Verde said:\t\t\tDoes this not seem just a little high?\t\tClick to expand...Its not, it's a number i can see myself.[BR]this is what has been tested and found out and posted on beta:[BR][BR]\t\t\tcity at the end of ch16 with max advancemet has 2255 squad size in first province 1*[BR]city at the end of ch16 without AWs and expansions has 10 squad size in first province 1*[BR](yep AWs and expansions has minor impact...)\t\tClick to expand...[BR]so I could even say a 22500% difference, but thats of course edge case scenario's, so thats why I toned it down."}, {"24": "Heymrdiedier said:\t\t\tDidn't they explain this properly?[BR]If you are bigger/Stronger it should be a bit harder for you, so that people who are just beginning in the game get a chance to score high as well and are able to join the competition instead of defaulting in the last places.[BR][BR]They also said, the benefit from being a bit bigger/stronger should always be bigger then the penalty you get from that. Now there's still some work on that formula since thats obviously not the case, since some wonders who don't help you at all also increase the difficulty and theres a 400%+ difficulty difference between people with or without wonders\t\tClick to expand...[BR]No, it does not explain the multiplicative nature of the formula at all. If this was the explanation for a formula, it would be the explanation for an additive formula, which would make perfect sense btw. But this is not the case.[BR]It would say:[BR]AWs get more powerful if you upgrade them[BR]More expansions are more powerful than few expansions[BR]More reseached technologies, means you have better buildings in your city.[BR][BR]There are 3 progress factors, each of them make the game easier and therefore it makes sense to add the 3 together and make the tourneies harder accordingly. This makes perfect sense! But this is not the reality![BR][BR]The reality is the following and the explanation for this is missing:[BR][BR]Why do AWs get more powerful by placing more expansions or doing research?[BR]Why do expansions get more valuable if you have more research done or more AWs upgraded?[BR]Why does your progress in the research tree get more powerful if you have AWs upgraded and a lot of expansions?[BR][BR]The formula says all these things. I cannot find any answer to any of those questions. And assume they are not true, yet this is how the game operates."}, {"24": "Heymrdiedier said:\t\t\tIts not, it's a number i can see myself.[BR]this is what has been tested and found out and posted on beta:[BR][BR][BR][BR]so I could even say a 22500% difference, but thats of course edge case scenario's, so thats why I toned it down.\t\tClick to expand...[BR]This is rather irrelevant, a city that is 400% better can deal with 400% more costs, a city that is 22500% stronger can deal with a tournament that is 22500% more difficult.[BR][BR]The question is the following: You improve your city by 200% AW levels, 200% research and 200% expansions, I would expect the tourney to get 600% (2+2+2+=6) more difficult and it would be fine. However the game will make the tourney 800% (2*2*2=8) more difficult.[BR][BR]If you go to higher level of progress the difference will get bigger, if you could go backwards in progress the difference would get smaller. Since expansions and research cannot be undone, the only way to get back to a better place is by deleting all non-essential AWs.[BR][BR]These numbers are completely arbitrary and just used to explain the difference between addition and multiplication, because a lot of people seem to not understand the difference between the two..."}, {"75": "Gargon667 said:\t\t\tYou improve your city by 200% AW levels, 200% research and 200% expansions, I would expect the tourney to get 600% (2+2+2+=6) more difficult and it would be fine. However the game will make the tourney 800% (2*2*2=8) more difficult.\t\tClick to expand...Perhaps it's a typo (well actually two of them)? Easy to fix ...  [smilie--sprite1]"}, {"24": "Verde said:\t\t\tPerhaps it's a typo (well actually two of them)? Easy to fix ...  [smilie--sprite1]Click to expand...Sorry I don´t see it, not saying there aren´t any typos, I usually produce tons of those, but nearly as often I don´t see them after producing them... not sure that´s a condition or just a second language thing..."}, {"75": "Gargon667 said:\t\t\tSorry I don´t see it, not saying there aren´t any typos, I usually produce tons of those, but nearly as often I don´t see them after producing them... not sure that´s a condition or just a second language thing...\t\tClick to expand...Not a typo by you @Gargon667, a typo by Inno when they implemented the formula. Perhaps they meant to write '+' and put '*' instead ...."}, {"24": "Verde said:\t\t\tNot a typo by you @Gargon667, a typo by Inno when they implemented the formula. Perhaps they meant to write '+' and put '*' instead ....\t\tClick to expand...Hahaha you really had me looking for typos for 5 minutes.[BR]I doubt it was a typo, it is just Inno, they came up with a formula that produced OK results under normal circumstances (noone ever checked for the logical error) and as always refused to think of long term consequences (or in this case extreme cases). Now they have it and don´t feel like going back to the drawing board, it´s too much work. So they try and fix a couple patches over it, until the outrage blows over.[BR][BR]Most people will never notice or understand the problem anyway."}, {"54": "Gargon667 said:\t\t\tMost people will never notice or understand the problem anyway.\t\tClick to expand...Most people do understand it, except those who have to power to change it. thats the only issue. [smilie--sprite1][BR]Theres a reason the feedback threads are so long and all have 90% the same response, and its even worse when you realise most players have a burn-out of all this feeding the back, without seeing proper results."}, {"78": "After 2.5 sessions with this new tourney, I'm coming to grips with it. I begin to understand what is sustainable.[BR][BR]The question is to what purpose ?[BR][BR]Is the game more interesting ?[BR]Is there a path forward to anything worthwhile ?[BR]Is it fun ?[BR]Can I grow ?[BR]Does it help my FS ?[BR]To do what ?[BR][BR]I do believe Inno, that you have taken what was a great game, screwed it up and stuffed it where the sun don't shine.[BR][BR]It was, by the way, one of the best collaborative strategy games on the planet."}, {"32": "C-Nymph said:\t\t\tAnd that’s where most of us completely disagree with the devs. We’ve worked hard for years to get our cities to where they are now. Why should beginning players be able to get the same results as players who have progressed their cities with hours and hours of work? Isn’t that the whole point of wanting to progress - to get better results?\t\tClick to expand...[BR]You want them within relative distance of other players.[BR]This is why we had the 5% of SS per prvince rule[BR][BR]This way also a new player could earn a spot in a 10 chest fellowship and they aren't \"useless\" for most of the game. its fin that a lower level player can be within 50-80% of the top if they wanted to. this keeps all players \"relevant\"[BR]I do agree with that principle,[BR]That said advancing should always have a positive impact, this is where they fail miserably this time.[BR][BR]In fact any advancement beyond the elvenar seems to be a 100% negative in any scenario, and it looks like chapter 17 won't fare better.[BR][BR]and with the current change to triple production queue, even several combat wonders are no longer \"worth it\" as there impact has been greatly reduced on the overall unit production.[BR][BR]The more they seem to \"tweak\" it, the more they seem to screw it up.[BR]Yet fixing the basics seems to be a pride issue, they seem to be to pride to acknowledge there mistake and fixing it, instead they come up with circumstancial \"fixes\" that either have no, little, the wrong or a worse impact."}, {"15": "anonglitch said:\t\t\tWe are aware of the impact as far as army power that this change that affect the balance between humans and elves.\t\tClick to expand...This is interesting. I think this means they will be making some adjustments to the barrack troops to make them more equal. However since we know how the devs work I'm inclined to think that the equality will be obtained not simply by making the elven mages as good as the human ones but rather by making the human mages less effective.[BR]To me it makes no sense that the barrack troops are different in the first place (other than the name of the troops). When people join this game they don't know what to expect and by the time they realise the differences between troops they have advanced enough through the chapters that they might not feel like staring over.[BR]An alternative to changing the troops to be equal for humans and elves would be that elven factories produce much more goods. that way they can make up with catering what they loose by having less efficient troops. The emphasis here being on MUCH more, since what the devs consider to be a big increase in production is never even close to it, as demonstrated by the increase given to the moon bear (combines with the removal of coins and supplies, Inno seems completely incapable of just increasing/changing something without nerfing 3 other things in the process)"}, {"24": "CrazyWizard said:\t\t\tIn fact any advancement beyond the elvenar seems to be a 100% negative in any scenario, and it looks like chapter 17 won't fare better.[BR][BR]and with the current change to triple production queue, even several combat wonders are no longer \"worth it\" as there impact has been greatly reduced on the overall unit production.\t\tClick to expand...[BR]I agree with your post, but I still am interested in chapter 17, at least they have to have new barracks (suddenly at least of some use again) and Merc Camp, and then there are many things of interest that could possibly come up, I guess advanced scouts loose value now, but maybe new unit upgrades are possible? Something that would make all those junk units in the Training grounds and barracks worthwile? That would make me play chapters again [smilie--sprite1] And there hasn´t been a good AW since constructs, on top of it, they now have to make super strong AWs to make it worth adding them to a city. I doubt a lot of chapter 15 and 16 AWs will survive the new tourneys (in active tourney playing towns that is)... along with all the others that have been turned from soso into a concrete block on you feet.[BR][BR]The last part I don´t quite understand. Are you talking about the speedup AWs? If you have all three at level 30 you get 100% speed boost on all your troops, that was the same before the change is still true now. The advantage of the old system was you could have 100% speed boost on all your troops with only 1 lvl 30 AW (if you only train in the one building). So I kind of feel the opposite, having all 3 is more useful now than it used to be... even I as an outspoken Training grounds hater consider the idea of building a Vic Springs (at least of a small level, which is far more than I have had so far)"}, {"32": "No I am talking about all direct producing unit wonders,[BR]This also counts for (event) buildings that make units, like the evo building of 2 events ago that made wizard?[BR][BR]The amount of units these buildings produce has stayed the same, while the \"barracks like\" buildings togerther now produce up to 3 times as much.[BR]This makes the relative impact of these buildings less relevant.[BR][BR]example:[BR]If you can produce 10 units in \"barracks like\" buildings and in the same time period you make 5 units from a wonder/event building the impact of that building is 50%[BR][BR]Now that we produce up to 3 times a smuch so 30 units, the impact of 5 units is now reduced 3 fold for a total of 16.6%[BR]This is a huge difference and makes the building less prominent.[BR][BR]These numbers are random numbers but they show the concept that this new change created.[BR]This makes the wonders much less powerfull, when we still add the same amount of difficulty to each wonderlevel, this makes them a lot less desirable. we already know that wonders beyond a point are more a burden than an improvement when it comes to spire / tournaments. and this possibly lowers that bar even further allowing even less wonders to be build for optimal performance."}, {"63": "I have been reading some of thing things dealing with the so-called burning all 3 training facilities simultaneously. Haven't yet seen if there will be a single queue to put our timers into or if we are going to need to expand our training size to drop 5hr timers into each individually."}, {"73": "CrazyWizard said:\t\t\tThis makes the wonders much less powerfull, when we still add the same amount of difficulty to each wonderlevel, this makes them a lot less desirable.\t\tClick to expand...Placing a bigger stick close, makes a small stick look smaller. [BR]But yeah, I’m thinking of AWs to loose, but their secondary effects makes them valuable. Eg. Sss, Da, temple. Db is good after doing optional SS. Pyramid is equivalent/close to a sentient manufactory. [BR]Overall, nothing has been removed."}, {"17": "I have tourneyed on Beta,  and here. I have to say that it's important to be cautious and not assume that everything that was possible this past spring would be possible today.  I am certain that we will adapt, and continue to fight, for the sheer joy of it if nothing else (insert appropriate emoji).  By the way can we have new opponents soon?? Please???[BR][BR]The fact is that the number cruncher players are going to be unhappy with the rebalance.  The repetitive nature of the remarks does make for some long reading, and I for one am pages behind.  [BR][BR] I play because I like the game,  I fight because I love this aspect.  But I think with the rebalance our squad size starts off too weak, and escalates too quickly.   Can we come to a compromise on this?  Give us page 2 before lowering the boom.  I mean,  my big cities will be fine, of course.   But for smaller cities, this is just too hard to progress.  I still have no troops on Beta (grumpy Lel here!).  Leave us some resources to use to keep on enjoying the game.   [BR][BR]Otherwise,  as always, I do want to shout out a big THANK YOU to those folks who are making it possible for us to continue enjoying Elvenar - whether it be a developer,  a Forum moderator,  a clever resource developer,  or hard working volunteers.  [BR]Happy Gaming"}, {"32": "JollyElf said:\t\t\tPlacing a bigger stick close, makes a small stick look smaller.[BR]But yeah, I’m thinking of AWs to loose, but their secondary effects makes them valuable. Eg. Sss, Da, temple. Db is good after doing optional SS. Pyramid is equivalent/close to a sentient manufactory.[BR]Overall, nothing has been removed.\t\tClick to expand...[BR]A sentient factory doesn't increase your tournament difficulty"}]