[{"1": "Thank you @Lelanya we appreciate gratitude a lot, and I am definitely no parrot repeating the same thing. Still, I like to give you all reminders that \"all within the Elvenar world it ain't so terrible\" as with everything, you did notice changes. Remember how the Spire was at first, and how it is now. The tournament already received some changes, and we understand they might not yet be ideal. However, you all have proof that it did change from when it was first released on beta.[BR][BR]It is precisely one reason we have a new format here in life. To ensure player satisfaction, we need to collect all your feedback about the troop's power, barrack's speed, AW effects on the tournament, etc., and thanks to all of you, these changes are arriving.[BR][BR]It is imperative to be a little patient; we get weekly updates and fixes, proving that our developers have their hands on Elvenar, rather than setting it aside as some people claimed. It is essential to think about the big picture; it is not only \"The Spire\" or \"The Tournaments\" or \"This event\" nope. It's a collective of all that brings changes to prizes, tournaments, events, etc.[BR][BR]Sometimes, what it is called nerfing, it means adjusting, as that nerfing will prevent unbalancing the game, although it might look ugly if you look at the small picture of not getting time boosters in the events (last year we didn't get troops, this year we do). However, it's rebalanced elsewhere, or approached with a different perspective. [BR][BR]For example, skipping squad sizes was a good option due to the prior tournament's and Spire's format. However, you are seizing your own game by:[BR]- Not completing your research tree.[BR]- Seizing several AW and other buildings.[BR][BR]Now, squad size upgrades can be researched, and therefore, every collection affected by your squad size it will not be seized. The same goes for expansions. As per the last few updates, expansions will make a smaller impact in both the tournament and the Spire (so the Spire gets a bit easier as a \"side effect\"). Heroe's Forge will give you more orcs, for example, as you won't be seizing expansion. Who doesn't want more orcs?[BR][BR]Everything has a delicate balance, and with updates, that balance may be compromised, but thanks to the feedback, changes keep on coming. Even if you think that there is no balance right now (and maybe even there isn't), there is a reason behind it, and it is taken into account in future events, future chapters, future changes, etc."}, {"24": "CrazyWizard said:\t\t\tNo I am talking about all direct producing unit wonders,[BR]This also counts for (event) buildings that make units, like the evo building of 2 events ago that made wizard?\t\tClick to expand...[BR]I totally agree with you then, I never even counted those AWs as of military use before and will not start doing that now. [BR]I agree also on the Wise Golem, never even added the few Sorcs to any calculations before. [BR]I do still like the Orc Strategists and Vallorian buildings, simply because they make troops I would otherwise have to make by some other means. Strategists for me without training grounds are rather high value (subject to change now I guess), Vallorians would take up queue time in my Merc camp i rather use on more important units. But yes their overall number contribution will go down with this change. But that´s not really the problem with this change...."}, {"24": "anonglitch said:\t\t\tSometimes, what it is called nerfing, it means adjusting, as that nerfing will prevent unbalancing the game, although it might look ugly if you look at the small picture of not getting time boosters in the events (last year we didn't get troops, this year we do). However, it's rebalanced elsewhere, or approached with a different perspective.[BR][BR]Everything has a delicate balance, and with updates, that balance may be compromised, but thanks to the feedback, changes keep on coming. Even if you think that there is no balance right now (and maybe even there isn't), there is a reason behind it, and it is taken into account in future events, future chapters, future changes, etc.\t\tClick to expand...[BR]I am completely with you on that one, however this is also exactly the point that is lacking: Balance![BR][BR]tournaments absolutely needed a nerf (or balance whatever you want to call it) they handed out resources in numbers that made those same resources completely worthless. So yes a new balance was a good idea.[BR][BR]The big problem is that the new formula has introduced a mathematical problem. It is now possible to hit a wall where progress is NEGATIVE for your cities performance. I agree this is only a problem for a few of the players in the game and not for the majority. But simply introducing the POSSIBILITY of this happening sounds like an incredibly stupid idea. Why would anyone do this? This is what needs to be balanced.[BR][BR]A second thing that needs to be balanced is the fact that in the current tourney system, many AWs have turned into being NEGATIVE for a cities performance. While there is an easy fix for this problem: Delete them all, this is not a good idea for a city building type of game, it is one of the main reasons why people hate the new tourney so much. This is a very good idea to send thedevelopers to work on balancing! rather than making everybody delete their hard worked for AWs. At the very least make them teleportable so people can bring them back when the game changes t something more intelligent.[BR][BR]The 3 separate queues are hardly balancing any of the underlying problems. What they do is, they give everybody more troops, yes, it is very popular with people, because it is a tangible number that is easy to see, making things easier for them. However the difficulty never really was the problem in the first place. The raised difficulty was part of the necessary balancing of tourneys, so now instead of fixing the problems, they do something to counteract what was the main reason for doing all this in the first place, just to buy goodwill with people. Fine by me, but it is not a fix of any problem! Indeed it is introducing a BIG and NEW imbalance to the game, buy extremely favoring human over elven towns. Humans get an extra traing queue with high quality units, while elves get an extra training queue with cannon fodder, while both get a third queue with more cannon fodder. How on earth can this be called balancing???"}, {"75": "@anonglitch, it was originally said that the new tourney version would be 'Live tested' for three weeks on the EN servers.[BR]Are you able to confirm whether or not it will be implemented on the other Live servers next week?"}, {"14": "anonglitch said:\t\t\tHowever, you all have proof that it did change from when it was first released on beta.\t\tClick to expand...[BR]While you spin a sweet tale, it's just the same old Inno position in a new package. If the problem was getting too many resources from the tournament, then reduce the amount of resources we were getting per province. Just come out and say so, instead of saying you wanted to make the tournament more accessible for new players; it already was, and making it one straight fight would have sufficed for that purpose.[BR]This would actually have have been a defendable position, something we could have actually understood. Just like Wishing Wells were phased out, and time instant sources were reduced. This is all understandable and would have been displeasing of course, but anyone with half a brain would have understood it was neccesary.[BR][BR]Instead, what you do is now slam down a gigantic nerfhammer on something you yourselves let get out of hand, and are now actively punishing people for growing their city, which was already the case in the spire but has now extended to the tournament.[BR]I remember Marindor saying back then that there were no plans to extend the Spire formula to the tournament, in response to people being really worried they'd get screwed over on the tournament. And tadaaaa; here we are anyway![BR]And once more we get the same tale in a new shape; with a new mod saying you all are really listening? The same old tale every mod and community manager has spun to us all the time. Well, excuse me for having very, VERY little faith in that, considering the history so far.[BR][BR]So, moving on from that introduction to my point; the changes that Inno does make, that you state are proof the Devs are listening, are minor and they always are. It makes me feel like a big giant slamdunk nerf is introduced, and then tweaked back down where it is just barely acceptable for people to keep playing. Perhaps this is not the intention, but it sure is how it makes me feel, and the communication every time feels like a rinse/repeat re-word.[BR][BR]In conclusion @anonglitch @Silmaril ; If you let players work out strategies to get hundreds of KP / Runes / Spells, and then let that go on for a solid year, then people will feel entitled to these things and rightly so. You handed it to them, made it possible.[BR]Inno is the one who made it possible to grind out like crazy, with losses that were manageable, with event buildings and evolvables that only made it easier and easier. Consequently saying things like \"we listen to you\" is not a believable position to take, and will hurt your game and your believeability.[BR]So perhaps Inno can TRY to not let things get so out of hand every time, for extended periods of time, but instead keep things balanced properly as they go along? The only thing you are creating this way is anger and resentment when you take away things the players had begun to take for granted; I feel you need a longer term, and more nuanced, vision for the game stats/specifics and balance.[BR][BR][BR]anonglitch said:\t\t\tHeroe's Forge will give you more orcs, for example, as you won't be seizing expansion. Who doesn't want more orcs?\t\tClick to expand...[BR]Sorry, but this is a terrible example. The HF gives very low Orcs/square compared to Orc nests, unless you have it at a high level, where it is actively hurting your Spire/Tournament difficulty.[BR]This AW is lucky that helps your Heavy Melee damage, but most tournaments will rely on Ranged Units. Therefor it has actually been devalued a good bit by the change (personal opinion disclaimer), and like @Gargon667 keeps saying, AW's like this are a problem within the multiplicative nature of the formula.[BR][BR]Again, change it to additive to flatten out the %squadsize graph as provided by @MinMax Gamer , or even hard-cap it. This will STILL put a giant hurt on those who have the will and capacity to go nuts in the tournament, but at least NOT make it nigh impossible to do so."}, {"45": "@Verde It is not planned for next week, due to the amount of feedback we have had."}, {"26": "anonglitch said:\t\t\tRemember how the Spire was at first, and how it is now. The tournament already received some changes, and we understand they might not yet be ideal. However, you all have proof that it did change from when it was first released on beta.\t\tClick to expand...The only thing that really changed in the spire since the release is the rewards, and this change made it worth the effort. And since the goal of the current changes is to nerf the tournament rewards I don't think that this is a valid comparison. Besides at the introduction of the spire people didn't know the formula, which made arguing about it much harder. Now we are aware of it,  and the changes that you are making now to the tournaments in no way are addressing the core issue most of us are concerned with.[BR][BR]anonglitch said:\t\t\tTo ensure player satisfaction, we need to collect all your feedback about the troop's power, barrack's speed, AW effects on the tournament, etc., and thanks to all of you, these changes are arriving.\t\tClick to expand...I'm sorry, but some of these is simply strange. You came up with the multiplicative formula which allows things get out of hand and after a certain point punishes for any in-game progress. Yet instead of testing it and throwing out of the window you need players to reverse-ingeneer it and then give you feedback on the AWs effects on tournaments? Really? Same goes for the troops power, you have access to all the data, besides it has been said for years that the basic troops are not balanced (for example elven mages are unusable). Yet now you are collecting the feedback on this?[BR][BR]anonglitch said:\t\t\tIt is imperative to be a little patient; we get weekly updates and fixes, proving that our developers have their hands on Elvenar, rather than setting it aside as some people claimed. It is essential to think about the big picture; it is not only \"The Spire\" or \"The Tournaments\" or \"This event\" nope. It's a collective of all that brings changes to prizes, tournaments, events, etc.\t\tClick to expand...When instead of fixing the core issue with the new system the devs are making fixes that are barely noticeable - then yes, it seems like they are just pretending to work and wait till everyone is burned out from providing the feedback that is ignored. And no, we are looking at the bigger picture. Each chapter exponentially increases the research multiplier, so in the bigger picture the AWs will be less and less useful. Because for some obscure reason their number is multiplied with the research and with the amount of expansions. [BR][BR]anonglitch said:\t\t\tFor example, skipping squad sizes was a good option due to the prior tournament's and Spire's format. However, you are seizing your own game by:[BR]- Not completing your research tree.[BR]- Seizing several AW and other buildings.[BR][BR]Now, squad size upgrades can be researched, and therefore, every collection affected by your squad size it will not be seized.\t\tClick to expand...Now this is simply wrong. Either you are not familiar with the game, which is kind of sad coming from a representative of Inno, or you are hoping that we are not familiar with it, which is kind of insulting. First: the spire never depended on the map squad size. Second: since the old tournament operated with the percentages of your SS and the AWs are producing a certain percentage of your SS this researches made zero impact on the AW production as far as the tournaments are concerned. And third: now you made a system where it's beneficial to not progress in the research tree at all after the chapter 15 (unless chapter 17 brings something truly amazing to beat the 27% increase in the research multiplier), where it's beneficial to never build a good half of the AWs and where it's beneficial to use as few expansions as possible. A great improvement from skipping the SS upgrades, right?[BR][BR]anonglitch said:\t\t\tEverything has a delicate balance, and with updates, that balance may be compromised, but thanks to the feedback, changes keep on coming. Even if you think that there is no balance right now (and maybe even there isn't), there is a reason behind it, and it is taken into account in future events, future chapters, future changes, etc.\t\tClick to expand...You meant \"despite the feedback\"? Because so far it seems exactly like it. And I'm asking you again, could devs at least disclose the logic behind the multiplicative formula if we are forced to live with it? Because so far each of your arguments seems to avoid the core issue, like there's no explanation behind it and you are trying to focus our attention on other things."}, {"58": "anonglitch said:\t\t\tNow, squad size upgrades can be researched, and therefore, every collection affected by your squad size it will not be seized. The same goes for expansions. As per the last few updates, expansions will make a smaller impact in both the tournament and the Spire (so the Spire gets a bit easier as a \"side effect\"). Heroe's Forge will give you more orcs, for example, as you won't be seizing expansion. Who doesn't want more orcs?\t\tClick to expand...[BR]While it is true that the impact of expansions has been somewhat reduced, the Spire did not get easier for everyone because of increased penalization of research progress.[BR][BR]The old tournament did not take expansions into account at all. We could place any expansion happily, and buying premium expansions was the recommended way of spending diamonds.[BR][BR]So holding back on placing expansions is useful with the new tournament, it was never a sensible approach before. So the Heroes Forge would be worse off now than before - if its power depended on expansions - which is not the case."}, {"32": "anonglitch said:\t\t\tThank you @Lelanya we appreciate gratitude a lot, and I am definitely no parrot repeating the same thing. Still, I like to give you all reminders that \"all within the Elvenar world it ain't so terrible\" as with everything, you did notice changes. Remember how the Spire was at first, and how it is now. The tournament already received some changes, and we understand they might not yet be ideal. However, you all have proof that it did change from when it was first released on beta.[BR][BR]It is precisely one reason we have a new format here in life. To ensure player satisfaction, we need to collect all your feedback about the troop's power, barrack's speed, AW effects on the tournament, etc., and thanks to all of you, these changes are arriving.[BR][BR]It is imperative to be a little patient; we get weekly updates and fixes, proving that our developers have their hands on Elvenar, rather than setting it aside as some people claimed. It is essential to think about the big picture; it is not only \"The Spire\" or \"The Tournaments\" or \"This event\" nope. It's a collective of all that brings changes to prizes, tournaments, events, etc.[BR][BR]Sometimes, what it is called nerfing, it means adjusting, as that nerfing will prevent unbalancing the game, although it might look ugly if you look at the small picture of not getting time boosters in the events (last year we didn't get troops, this year we do). However, it's rebalanced elsewhere, or approached with a different perspective.[BR][BR]For example, skipping squad sizes was a good option due to the prior tournament's and Spire's format. However, you are seizing your own game by:[BR]- Not completing your research tree.[BR]- Seizing several AW and other buildings.[BR][BR]Now, squad size upgrades can be researched, and therefore, every collection affected by your squad size it will not be seized. The same goes for expansions. As per the last few updates, expansions will make a smaller impact in both the tournament and the Spire (so the Spire gets a bit easier as a \"side effect\"). Heroe's Forge will give you more orcs, for example, as you won't be seizing expansion. Who doesn't want more orcs?[BR][BR]Everything has a delicate balance, and with updates, that balance may be compromised, but thanks to the feedback, changes keep on coming. Even if you think that there is no balance right now (and maybe even there isn't), there is a reason behind it, and it is taken into account in future events, future chapters, future changes, etc.\t\tClick to expand...Gargon667 said:\t\t\tI am completely with you on that one, however this is also exactly the point that is lacking: Balance![BR][BR]tournaments absolutely needed a nerf (or balance whatever you want to call it) they handed out resources in numbers that made those same resources completely worthless. So yes a new balance was a good idea.[BR][BR]The big problem is that the new formula has introduced a mathematical problem. It is now possible to hit a wall where progress is NEGATIVE for your cities performance. I agree this is only a problem for a few of the players in the game and not for the majority. But simply introducing the POSSIBILITY of this happening sounds like an incredibly stupid idea. Why would anyone do this? This is what needs to be balanced.[BR][BR]A second thing that needs to be balanced is the fact that in the current tourney system, many AWs have turned into being NEGATIVE for a cities performance. While there is an easy fix for this problem: Delete them all, this is not a good idea for a city building type of game, it is one of the main reasons why people hate the new tourney so much. This is a very good idea to send thedevelopers to work on balancing! rather than making everybody delete their hard worked for AWs. At the very least make them teleportable so people can bring them back when the game changes t something more intelligent.[BR][BR]The 3 separate queues are hardly balancing any of the underlying problems. What they do is, they give everybody more troops, yes, it is very popular with people, because it is a tangible number that is easy to see, making things easier for them. However the difficulty never really was the problem in the first place. The raised difficulty was part of the necessary balancing of tourneys, so now instead of fixing the problems, they do something to counteract what was the main reason for doing all this in the first place, just to buy goodwill with people. Fine by me, but it is not a fix of any problem! Indeed it is introducing a BIG and NEW imbalance to the game, buy extremely favoring human over elven towns. Humans get an extra traing queue with high quality units, while elves get an extra training queue with cannon fodder, while both get a third queue with more cannon fodder. How on earth can this be called balancing???\t\tClick to expand...Killiak said:\t\t\tWhile you spin a sweet tale, it's just the same old Inno position in a new package. If the problem was getting too many resources from the tournament, then reduce the amount of resources we were getting per province. Just come out and say so, instead of saying you wanted to make the tournament more accessible for new players; it already was, and making it one straight fight would have sufficed for that purpose.[BR]This would actually have have been a defendable position, something we could have actually understood. Just like Wishing Wells were phased out, and time instant sources were reduced. This is all understandable and would have been displeasing of course, but anyone with half a brain would have understood it was neccesary.[BR][BR]Instead, what you do is now slam down a gigantic nerfhammer on something you yourselves let get out of hand, and are now actively punishing people for growing their city, which was already the case in the spire but has now extended to the tournament.[BR]I remember Marindor saying back then that there were no plans to extend the Spire formula to the tournament, in response to people being really worried they'd get screwed over on the tournament. And tadaaaa; here we are anyway![BR]And once more we get the same tale in a new shape; with a new mod saying you all are really listening? The same old tale every mod and community manager has spun to us all the time. Well, excuse me for having very, VERY little faith in that, considering the history so far.[BR][BR]So, moving on from that introduction to my point; the changes that Inno does make, that you state are proof the Devs are listening, are minor and they always are. It makes me feel like a big giant slamdunk nerf is introduced, and then tweaked back down where it is just barely acceptable for people to keep playing. Perhaps this is not the intention, but it sure is how it makes me feel, and the communication every time feels like a rinse/repeat re-word.[BR][BR]In conclusion @anonglitch @Silmaril ; If you let players work out strategies to get hundreds of KP / Runes / Spells, and then let that go on for a solid year, then people will feel entitled to these things and rightly so. You handed it to them, made it possible.[BR]Inno is the one who made it possible to grind out like crazy, with losses that were manageable, with event buildings and evolvables that only made it easier and easier. Consequently saying things like \"we listen to you\" is not a believable position to take, and will hurt your game and your believeability.[BR]So perhaps Inno can TRY to not let things get so out of hand every time, for extended periods of time, but instead keep things balanced properly as they go along? The only thing you are creating this way is anger and resentment when you take away things the players had begun to take for granted; I feel you need a longer term, and more nuanced, vision for the game stats/specifics and balance.[BR][BR][BR][BR][BR]Sorry, but this is a terrible example. The HF gives very low Orcs/square compared to Orc nests, unless you have it at a high level, where it is actively hurting your Spire/Tournament difficulty.[BR]This AW is lucky that helps your Heavy Melee damage, but most tournaments will rely on Ranged Units. Therefor it has actually been devalued a good bit by the change (personal opinion disclaimer), and like @Gargon667 keeps saying, AW's like this are a problem within the multiplicative nature of the formula.[BR][BR]Again, change it to additive to flatten out the %squadsize graph as provided by @MinMax Gamer , or even hard-cap it. This will STILL put a giant hurt on those who have the will and capacity to go nuts in the tournament, but at least NOT make it nigh impossible to do so.\t\tClick to expand...[BR]I agree with both responders.[BR]There is no balance and this so called \"proof\" is no proof at all.[BR]From the start we pointed out the main flaws of this change. while changes are made, none of these changes solve the flaws we pointed out.[BR][BR]The closest they got is changing a value in the formula, but that value is not the problem. the formula itself is.[BR]Every other change is pointless.[BR][BR]It's like a wreck of a car with square wheels, you can totally fix and replace every single part of that car making it look like new, as long as you do not fix it's square wheels everything else is pointless. it serves no purpse nor does it fix or change anything about the car not working as intended as long as it wheels stay as squares."}, {"122": "If this is not getting rolled out to all servers does that mean we are still testing this ????   while all other servers get the reward of playing the old way and we get punished with this new system [BR]How long is this so called testing going to last ?????[BR]I for one feel this to be very unfair ..it was 3 weeks testing and now it looks like your going to keep it going for longer  without even giving us any notice about it  (but that does seem normal for Inno )"}, {"86": "Silmaril said:@Verde It is not planned for next week, due to the amount of feedback we have had.\t\tClick to expand...So after 3 weeks of testing and 73 pages of feedback on beta and A further 3 weeks of testing and 35 pages across 2 threads here on EN, you are happy to continue in this fashion. It might be a good idea, to roll this back, have a proper re-think, and re-test on Beta instead of prolonging this...it seems to me that it obviously is not ready."}, {"89": "Joemork said:\t\t\t....it seems to me that it obviously is not ready.\t\tClick to expand...[BR]Nah, there seems to be plenty of room to make it even worse. While trying to balance that new thing, they unbalance everything else with other changes! Wuhuu! . [smilie--sprite8][BR][BR]I honestly feel sorry for Silmaril and anonglitch. I think they're in a pretty bad position here. They may even understand the problem at core, but it's not their job to give out their opinion on that - no matter if it is positive or negative - as it would only kindle the fire even more. Their job is to ensure peace so they do their best present innos strategy in a neutral/good way. By the given things they're trying their best, but they also can only provide the solutions the lead/devs are offering/working on."}, {"15": "I appreciate your effort @anonglitch   to try to appease us here, but I have a slightly different view of some things you mention here.[BR][BR]anonglitch said:\t\t\tIt is essential to think about the big picture; it is not only \"The Spire\" or \"The Tournaments\" or \"This event\" nope. It's a collective of all that brings changes to prizes, tournaments, events, etc.\t\tClick to expand...It might be hard for players to look at the big picture if they don't know what's to come and whether the future of the game justifies the current changes to the tournament. If the devs want us to be more understanding of the changes they should give us some hints about what's planned and why this nerf was necessary. However the only explanation we got is that this will make the tournament more enjoyable for everyone and as it's obvious from the response on the forum that's clearly not the case.[BR]Since we don't know about the game's future plans we can only go on on the info we currently have and based on that it looks to me like some players here are looking at the big picture more than the devs.[BR]For instance, including the AWs in the formula forces players to chose between being tournament oriented or developing their city to the fullest. That's becasue the claim that upgrading Aws will always be more beneficial than the penalty it brings is simply not true.[BR]Let's take the case of the sunset towers. Upgrading them would improve some aspects of my city but has no direct impact on the tournament whatsoever. One could argue that by upgrading it we can remove a building that produce seeds and place an armoury in it's place. Well I've done the maths and, putting aside that one might not need another armoury or factory (they might need space for a guest race for instance), if I'd upgrade my ST to level 30 I might get almost as much seeds per day as I would get from 2 amuni ships (and that's including what I get from less decay too, not just what I get from the chests). So yeah, in that space I might be able to place an armoury. But we are talking about a 30 level AW here, the amount of time and kps to get there... lol.[BR]And the biggest problem being that the difficulty those 30 levels would add to the tournament (or rather the tournament SS) could never be compensated by anything we could place in that spot. So we are forced to chose: do we want to be able to do more in tournament or to develop our cities. Did the devs take that into consideration? Can we get an answer form them why some wonders that have nothing to do with the tournaments are included in the formula?[BR]Another question is: what are we supposed to do with kps once we reach a certain point? Let's say we can't use them in the tech tree for various possible reasons (my current is super slow production in chapter 15). We can upgrade our military wonders to find the right balance between difficulty and benefits and what then? Upgrading the other wonders that would help our city in other ways will just break the balance again. So I really feel the devs should reconsider some wonders and leave them out of the formula. We really need to be able to progress in other aspects of the game without being punished in the tournaments/spire for that.[BR][BR][BR]anonglitch said:\t\t\tFor example, skipping squad sizes was a good option due to the prior tournament's and Spire's format. However, you are seizing your own game by:[BR]- Not completing your research tree.[BR]- Seizing several AW and other buildings.[BR][BR]Now, squad size upgrades can be researched, and therefore, every collection affected by your squad size it will not be seized.\t\tClick to expand...This is true but again the problem is that every now and then the devs change things that affect the game and can't be undone by players. Researching optional SS upgrades was harmful before but not all players knew about it and by the time they discovered it the damage was already done and they couldn't unlearn it. Now researching them would bring us some benefits but what if the devs change things again? The optional researches are currently not included in the formula, how do we know they won't change it?[BR]The  AWs were advertised as the best thing in this game and players invested a lot in them and now suddenly they bring penalties with them. Same goes for expansions. We can't unlearn tech, and we can't downgrade Aws and we can't teleport them. And we can't remove expansion either. If you keep changing the rules of the game ofc the players will be unhappy and won't trust the Elvenar team and what they say.[BR][BR]anonglitch said:\t\t\texpansions will make a smaller impact in both the tournament and the Spire (so the Spire gets a bit easier as a \"side effect\").\t\tClick to expand...This is not true for me. The Spire got more difficult because what you removed form expansion you added to techs. My Halflings city used to be able to complete the Spire with some difficulty but it could, now it's almost impossible. My Elvenar city used to do it without major problems, now it's draining much more resources.[BR][BR]I think most players here agree that the tournament needed to be adjusted as we were getting too many rewards, but what they disagree is on the way it was done. Cap the prizes, or add some other new kind of difficulty. (4* enemy troops, magic keys one needs to collect/craft/whatever to be able to fight in provinces higher than whatever Inno thinks is the acceptable limit etc) just don't go an change core aspects of the game on which people have worked hard for years and don't force us to chose if we want to just do tournaments or develop our cities."}, {"45": "@malph As per our announcement linked to this discussion thread; ''The new Tournaments will not go to further Live worlds than EN for at least another 3 weeks after the start of the first new Tournament on EN''"}, {"122": "@Silmaril [BR]This is the 3rd week of testing on EN   [BR]What i would like to know is after this tournament ends  what is going to happen ???[BR]As you said  it was announced   it was a 3 week test   [BR]can i get a reply please"}, {"84": "anonglitch said:\t\t\tI am definitely no parrot repeating the same thing.\t\tClick to expand...[BR]I take it that this is in relation to the comment i made on the A game should be fun this is becoming a chore thread so let me correct you on something. I did not say you were a parrot i said if you keep on saying that \"feedback is passed to the devs\" and \"changes have been made\" that you would start to sound like a parrot. You do seem to like telling players those 2 things so i stand by my post"}, {"84": "@malph The important part of the announcement are the words \"at least 3 weeks\". They can leave it as it is for as long as they want to."}, {"122": "@ timneh ..  thats true [BR]All the other players on other servers must be having a good laugh at our server   they get all the rewards from the old tournament system while we get to see our troops slaughtered and alot less rewards   ALL IN THE NAME OF TESTING [smilie--sprite4]"}, {"17": "Folks [BR]You have been given the clues: if you do not like what has been presented please propose an alternative."}, {"15": "Lelanya said:\t\t\tFolks[BR]You have been given the clues: if you do not like what has been presented please propose an alternative.\t\tClick to expand...A lot of alternatives and suggestions have been made, especially on beta. Quite a few players good at stats have suggested variations to the formula, others have suggested other ways of making this better and so far one of the suggestion them has been implemented: 3 separate queues which I think will be a good thing, at least for me. I have suggested a bit earlier today that they exclude some Aws from the formula (I'm not the only one, it has been suggested before, at least on beta), so we are doing just that, giving suggestion. But there is only so much we can suggest if we don't know what exactly the devs are aiming for and what other (new) factors of the game we don't know about should be taken into consideration."}]