[{"32": "AstralSoul said:\t\t\tThat screenshot over there is scary... I am happy to see this, and I guess it will be the last time:[BR]View attachment 4623[BR](First time I get to page #6) And not sure if six-star them all or not, as I see I better save my units.[BR][BR]IMHO, this change is due to new player base sticking with the game. Maybe Elvenar has a high quit ratio, and for players to like more the game, they need to enjoy the tournament. My tiny town in beta, on purpose as I am emulating a real life place, is six starring 9 provinces, before, I could only do 500 pts or so.[BR][BR]Expect good comments, yes...[BR][BR]In my big city, where I bought several expansions, I have 42K worth of AW pts (only at S&D), I am going to be very screwed. But what you gonna do?[BR][BR]I honestly think that it's not worth for INNO that we get 600-2000 KPs every week, and AW are powerful, with such knowledge injections, you can grow exponentially even more, and fast. Especially, if you are in the right FS. When you need to boost a 32-hour left AW because is time to work on it again, you will understand it.[BR][BR]With spire sets, working your spire, and crafting the right stuff non-stop, you can perform quite well in the tournament, and complete the spire. You will get back worth in tools and boosters the extra investment, plus a host of spells and KPs. If you know how to do it right, you can get a lot, check my city at Wynador... Of course, with the former tournament, let's enjoy this last steel [smilie--sprite8].[BR][BR]Those CC will become much more valuable, as our supply of runes is going to reduce massively, and no one is paying attention to the runes... and that will be a problem in a few months if you keep producing CCs, and crafting non-stop, something required to upkeep this ring of progress... Probably not worth it, and INNO is a business, after all, Elvenar a product, they need this change, and it will be probably better game-wise, even though is worse personal-wise for some of us.[BR][BR]But it will be a \"new reality\" in elvenar, where we all exponentially will grow much slower, but more new people will stick to the game due easier tournies for the game, something great for the game, as they will grow, and good for INNO, so Elvenar continues to be worth running, otherwise, it takes a few clicks to delete Elvenar from the servers, and in our T&C we agreed to this, whether we spent $0, or $20K in the game.\t\tClick to expand...[BR]if you want to enjoy the tournaments you should not be done with it in 3 minutes [smilie--sprite2][BR][BR]the loss of playerbase has been going on for a while now, and I am pretty sure it ain't tournament related."}, {"15": "Pauly7 said:\t\t\tNo it would be very costly. I imagine that they are intending to remove everyone's stockpiles of T1-3 goods though so we all go back to living hand to mouth.\t\tClick to expand...That might be their plan but I don't intend to start catering in tourneys, so I think I'll be keeping my goods [smilie--sprite8] On the other hand I see people on Beta pouring millions of each tier in the current tourney. I couldn't do that even if I wanted to, I'm nowhere that rich  [smilie--sprite12]"}, {"73": "AstralSoul said:\t\t\tThat screenshot over there is scary... I am happy to see this, and I guess it will be the last time:[BR]View attachment 4623[BR](First time I get to page #6) And not sure if six-star them all or not, as I see I better save my units.[BR][BR]IMHO, this change is due to new player base sticking with the game. Maybe Elvenar has a high quit ratio, and for players to like more the game, they need to enjoy the tournament. My tiny town in beta, on purpose as I am emulating a real life place, is six starring 9 provinces, before, I could only do 500 pts or so.[BR][BR]Expect good comments, yes...[BR][BR]In my big city, where I bought several expansions, I have 42K worth of AW pts (only at S&D), I am going to be very screwed. But what you gonna do?[BR][BR]I honestly think that it's not worth for INNO that we get 600-2000 KPs every week, and AW are powerful, with such knowledge injections, you can grow exponentially even more, and fast. Especially, if you are in the right FS. When you need to boost a 32-hour left AW because is time to work on it again, you will understand it.[BR][BR]With spire sets, working your spire, and crafting the right stuff non-stop, you can perform quite well in the tournament, and complete the spire. You will get back worth in tools and boosters the extra investment, plus a host of spells and KPs. If you know how to do it right, you can get a lot, check my city at Wynador... Of course, with the former tournament, let's enjoy this last steel [smilie--sprite8].[BR][BR]Those CC will become much more valuable, as our supply of runes is going to reduce massively, and no one is paying attention to the runes... and that will be a problem in a few months if you keep producing CCs, and crafting non-stop, something required to upkeep this ring of progress... Probably not worth it, and INNO is a business, after all, Elvenar a product, they need this change, and it will be probably better game-wise, even though is worse personal-wise for some of us.[BR][BR]But it will be a \"new reality\" in elvenar, where we all exponentially will grow much slower, but more new people will stick to the game due easier tournies for the game, something great for the game, as they will grow, and good for INNO, so Elvenar continues to be worth running, otherwise, it takes a few clicks to delete Elvenar from the servers, and in our T&C we agreed to this, whether we spent $0, or $20K in the game.\t\tClick to expand...Early quitters are mostly veterans starting a push account and abandoning it. [BR]And the genuine newbie will hit the slope very soon. 20 provinces won’t take too long to get and the wall is impenetrable there at 200% difficulty. [BR]Absolutely not sure, what they have in mind as a business model. When almost all the gamers providing feedback are unanimously upset, time to take notice."}, {"22": "JollyElf said:\t\t\tAnd the genuine newbie will hit the slope very soon. 20 provinces won’t take too long to get and the wall is impenetrable there at 200% difficulty.\t\tClick to expand...Yeah, you can get there in a couple of months... Faster if you're really trying to fast track yourself and/or spend money."}, {"68": "It seems to me that Inno is mostly benefitting the smaller players because they spend more money than the long term players who are closer to end game.  After all they need an income from somewhere and by the time those small players hit the problems that Beta have already encountered it won't matter as there will be more new players coming along behind them.[BR][BR]I would think that Inno have statistics that show low level/casual players are spending more money than the higher level players - however those higher level players have spent money on the game in order to achieve more and are now being penalised for it.[BR][BR]I'm pretty sure that people aren't saying that they want the whole game to be free regardless as after all this is a business for Inno and they need an income stream. Up to now I have spent money in all my cities (ch15, Amuni and Dwarves) but I won't be spending any more as I can see that I'll be quitting long before I had intended to."}, {"22": "Piglets For All said:\t\t\tI would think that Inno have statistics that show low level/casual players are spending more money than the higher level players\t\tClick to expand...This idea has been banded about quite a bit - i.e. their business model shows that they would rather have a big turnover of new players than invest further in the seasoned ones. If this is the case, though, I can't imagine why they have not set up a system of micro-transactions. That is the way to farm a lot of money from a big quantity of new players. There should be plenty of options where you can buy a Main Hall upgrade for 99p, or buy one squad of troops for 79p, that type of thing, rather than asking people to invest a minimum of £5 to get a supply of diamonds."}, {"78": "Very interesting comments - as usual - but I'd like to try it out first before recording my reaction. I'm happy when battles are tricky to win but not when they're impossible - that's just frustrating - but we'll see.[BR][BR]The changes seem to penalise push cities and alt slavers with huge AW upgrades - maybe that was a cheaper option than tracking them down individually. I just hope they've been diligent enough with their calculations not to lump 'play harders' into that group."}, {"32": "Pauly7 said:\t\t\tYeah, you can get there in a couple of months... Faster if you're really trying to fast track yourself and/or spend money.\t\tClick to expand...JollyElf said:\t\t\tEarly quitters are mostly veterans starting a push account and abandoning it.[BR]And the genuine newbie will hit the slope very soon. 20 provinces won’t take too long to get and the wall is impenetrable there at 200% difficulty.[BR]Absolutely not sure, what they have in mind as a business model. When almost all the gamers providing feedback are unanimously upset, time to take notice.\t\tClick to expand...20 is way to generous.[BR][BR]Hekata said:\t\t\tThat might be their plan but I don't intend to start catering in tourneys, so I think I'll be keeping my goods [smilie--sprite8] On the other hand I see people on Beta pouring millions of each tier in the current tourney. I couldn't do that even if I wanted to, I'm nowhere that rich  [smilie--sprite12]Click to expand...What do players who are about to quit do?[BR]If you see a unexpected player making a splash in the tournaments it's often the last thing they do.[BR][BR]Also there are possibilities if you are able to do it all on manual mode with the occasional negotiation.[BR]The main issue will be how do we get all the combat buildings we need for it?"}, {"75": "AstralSoul said:\t\t\t... it takes a few clicks to delete ...\t\tClick to expand...... Ancient Wonders (shame about the expansions)[BR][BR]Will be curious as to how many (unnecessary) Wonders are quite quickly deleted ... there's probably no way for us to find out but for sure Inno would be able to check statistics. Would love to know ...."}, {"15": "Verde said:\t\t\t... Ancient Wonders (shame about the expansions)[BR][BR]Will be curious as to how many (unnecessary) Wonders are quite quickly deleted ... there's probably no way for us to find out but for sure Inno would be able to check statistics. Would love to know ....\t\tClick to expand...That's exactly the problem with this new system. No AW should be considered unnecessary and potentially deleted. The game gave us all these buildings we can build. If someone found a use for some less popular AWS they should be able to have it without being penalised because it's not one of the 100% military ones that do add direct benefits to the tournaments."}, {"14": "Hekata said:\t\t\tthey should be able to have it without being penalised\t\tClick to expand...[BR]The Devs seem to disagree."}, {"34": "(This is my opinion only) [BR][BR]First, the squadsize adjustment is just good for the first few rounds of t'ment, which rounds up the player's weighted troops and rounds down the ememy's one. (for example, a player's vallorian guard having a SS of 7(1) will be rounded up to 12(2), while the enemy's one remains 6(1) ) However, the update combines 4 encounters into 1, which makes this far less significant. Also with the single encounter with the 4 times larger SS players will have to suffer a big loss of squads when testing strategies. [BR]The high catering costs is just to encourage players to fight rather than conquering the province by simply catering, then why make a balance for catering? If they really do so, most players will head for the catering option instead of using their troops to fight carefully and waste their time, tho i know that mobile players will be struggling to deal with the troops owing to the absence of manual fight option.[BR]Other changes of the game doesn't have big impact on me."}, {"79": "Guys a question:is it now a good idea to research the optional squad upgrades or not?"}, {"22": "alsael said:\t\t\tGuys a question:is it now a good idea to research the optional squad upgrades or not?\t\tClick to expand...Many people are holding off, just in case there are still changes to be made. In terms of your game, completing them all will make province encounters a lot easier to fight, but it will still create a very slight negative in tournaments as they are extra researches completed, which factors into the equation."}, {"79": "well,thanks for your answer @Pauly7.Those upgrades can boost some military AW,also bigger training sizes with brown bear=bigger bonus troops.IF the impact in tourney is managable of cource [smilie--sprite1]"}, {"32": "AstralSoul said:\t\t\tThose CC will become much more valuable, as our supply of runes is going to reduce massively, and no one is paying attention to the runes... and that will be a problem in a few months if you keep producing CCs, and crafting non-stop, something required to upkeep this ring of progress... Probably not worth it, and INNO is a business, after all, Elvenar a product, they need this change, and it will be probably better game-wise, even though is worse personal-wise for some of us.[BR][BR]But it will be a \"new reality\" in elvenar, where we all exponentially will grow much slower, but more new people will stick to the game due easier tournies for the game, something great for the game, as they will grow, and good for INNO, so Elvenar continues to be worth running, otherwise, it takes a few clicks to delete Elvenar from the servers, and in our T&C we agreed to this, whether we spent $0, or $20K in the game.\t\tClick to expand...Pauly7 said:\t\t\tMany people are holding off, just in case there are still changes to be made. In terms of your game, completing them all will make province encounters a lot easier to fight, but it will still create a very slight negative in tournaments as they are extra researches completed, which factors into the equation.\t\tClick to expand...[BR]Unless changed it only counts mandatory researches (unfortunatly we do not know the recernt changes they have made)[BR]The last 3 researches of the last chapter now also count as mandatory researches."}, {"22": "CrazyWizard said:\t\t\tUnless changed it only counts mandatory researches (unfortunatly we do not know the recernt changes they have made)\t\tClick to expand...Sorry, my bad. Still, something could change and we can't undo a research. [BR][BR][BR]alsael said:\t\t\tThose upgrades can boost some military AW,also bigger training sizes with brown bear=bigger bonus troops.\t\tClick to expand...That much is also true. Those extra researches will give lots of extra power to the Bulwark and Shrooms."}, {"27": "Pauly7 said:alsael said:\t\t\tThose upgrades can boost some military AW,also bigger training sizes with brown bear=bigger bonus troops.\t\tClick to expand...That much is also true. Those extra researches will give lots of extra power to the Bulwark and Shrooms.\t\tClick to expand...Just small remark: to the Bulwark yes (it increases training size based on researched squad size); to the Shrooms no (it increases training size based on sum of levels of all built Armories)."}, {"22": "FieryArien said:\t\t\tJust small remark: to the Bulwark yes (it increases training size based on researched squad size); to the Shrooms no (it increases training size based on sum of levels of all built Armories).\t\tClick to expand...Whoops I never even noticed that. I just assumed it was the same as Bulwark."}, {"80": "I just hope that when calculating tournament battle difficulty the developers remember that we are striving to upgrade our AWs and other buildings to try and improve our chances of winning battles by making troops stronger in attack and defence. It seems like we are being hamstrung for having higher AWs and buildings and even more expansions. Please realise that we buy expansions to improve our cities , NOT to make it more difficult for us in tournaments. If Inno want us to buy expansions then they'd better realise their obvious mistake in making purchases have a negative effect. I really hope the dev's read this.[smilie--sprite11][smilie--sprite5]"}]