[{"1": "malph said:@Silmaril[BR]This is the 3rd week of testing on EN[BR]What i would like to know is after this tournament ends  what is going to happen ???[BR]As you said  it was announced   it was a 3 week test[BR]can i get a reply, please\t\tClick to expand...[BR]Let's face it; there is still a lot of feedback on-going about the tournament changes. We have almost thirty pages worth of lengthy and very useful feedback Hence the reason @Silmaril shared above about the extension of further testing. We are all familiar with the game, and we love the game the same way you do, and we all go through the same funnel. Keep that in mind, this is why we keep everything into consideration, and the Spire formula has also been improving @Errandil hence my message. We do know well the Spire. [smilie--sprite1][BR][BR]However, @malph, you are also proving the point; you are upset because we are extending the testing further in this server. What did you prefer? For the tournament to be as it is today? We are saying that due to all the feedback, we are going to extend this a few more weeks to keep working on our new tournament system. Sure, other servers are using the old format, but it does not make a difference in our server, so there is no reason to worry about that.[BR][BR]The fact that the time is extended is a blessing because, in other words, we are saying, \"We are working on making the tournament better for everybody,\" and that is positive if you look at the big picture, who cares what happens at Elvenar US, for example.[BR][BR]Keep in mind that the tournament as we know it is not final yet, hence the extension. And even if we do not refer to all of you, we consider all your notes such as yours @Hekata @CrazyWizard and several more [smilie--sprite1]"}, {"122": "anonglitch you said The fact that the time is extended is a blessing because, in other words, we are saying, \"We are working on making the tournament better for everybody,\" and that is positive if you look at the big picture, who cares what happens at Elvenar US, for example. [BR][BR]well i dont think its a blessing more of a curse to be honest and I care what is happening on other servers  ..As we are the new test centre we are losing a massive amount of troops testing this and now we get told we got another 3 weeks testing thats even more troops lost and what do we get  less rewards as cant do so much prov  .but the other servers got the blessing of not having to do this testing "}, {"32": "Lelanya said:\t\t\tFolks[BR]You have been given the clues: if you do not like what has been presented please propose an alternative.\t\tClick to expand...[BR]how many proposals would you like?[BR]One of my proposals was already forwarded to the devs to no avail.[BR][BR]One that actually accomplisched what they wanted and is easy adjustable if the game requires it.[BR]They seem to foolhary stick with there \"solution\" at all cost, in no way does it look like they even attempted to look at anything else.[BR][BR]Maybe (some) devs want to change but a PM looked the the hours already spend and refuses it or whatever.[BR]I have no clue whats going on in the devs mind to fiecefully stick with a formula that was already hated when the spire was released.[BR][BR]anonglitch said:\t\t\tLet's face it; there is still a lot of feedback on-going about the tournament changes. We have almost thirty pages worth of lengthy and very useful feedback Hence the reason @Silmaril shared above about the extension of further testing. We are all familiar with the game, and we love the game the same way you do, and we all go through the same funnel. Keep that in mind, this is why we keep everything into consideration, and the Spire formula has also been improving @Errandil hence my message. We do know well the Spire. [smilie--sprite1][BR][BR]However, @malph, you are also proving the point; you are upset because we are extending the testing further in this server. What did you prefer? For the tournament to be as it is today? We are saying that due to all the feedback, we are going to extend this a few more weeks to keep working on our new tournament system. Sure, other servers are using the old format, but it does not make a difference in our server, so there is no reason to worry about that.[BR][BR]The fact that the time is extended is a blessing because, in other words, we are saying, \"We are working on making the tournament better for everybody,\" and that is positive if you look at the big picture, who cares what happens at Elvenar US, for example.[BR][BR]Keep in mind that the tournament as we know it is not final yet, hence the extension. And even if we do not refer to all of you, we consider all your notes such as yours @Hekata @CrazyWizard and several more [smilie--sprite1]Click to expand...[BR]unless there is even the slightest hint there willing to actually look at the real problem, instea of changing and announcing changes that are unrelated you can keep trying to spin some positivity in the negative sentiment, but it's like moping the floor with an open water tap.[BR][BR]it's pointless. no matter how much I would like to defend the changes there is zero ground for me and as you can see for many to do so."}, {"22": "malph said:anonglitch you said The fact that the time is extended is a blessing because, in other words, we are saying, \"We are working on making the tournament better for everybody,\" and that is positive if you look at the big picture, who cares what happens at Elvenar US, for example.[BR][BR]well i dont think its a blessing more of a curse to be honest and I care what is happening on other servers  ..As we are the new test centre we are losing a massive amount of troops testing this and now we get told we got another 3 weeks testing thats even more troops lost and what do we get  less rewards as cant do so much prov  .but the other servers got the blessing of not having to do this testing Click to expand...What @anonglitch is trying to say is that if this testing period was over and it was being rolled out to others servers that would mean the job is now done and there will be no more changes. If they feel the need to extend the testing period then we have to take some positivity from that. We may not be optimistic, but it isn't over. It sucks that it is EN that is being given the head start on the reduced rewards, etc, but at least they are still looking into it."}, {"79": "So,now we can \"safely\" research those optional squad upgrades,or not yet?"}, {"118": "axelbloodaxe said:\t\t\tThe question is to what purpose ?[BR][BR]Is the game more interesting ?[BR]Is there a path forward to anything worthwhile ?[BR]Is it fun ?[BR]Can I grow ?[BR]Does it help my FS ?[BR]To do what ?[BR][BR]I do believe Inno, that you have taken what was a great game, screwed it up and stuffed it where the sun don't shine.[BR]It was, by the way, one of the best collaborative strategy games on the planet.\t\tClick to expand...[BR]Gargon667 said:\t\t\tThe big problem is that the new formula has introduced a mathematical problem. It is now possible to hit a wall where progress is NEGATIVE for your cities performance. I agree this is only a problem for a few of the players in the game and not for the majority. But simply introducing the POSSIBILITY of this happening sounds like an incredibly stupid idea. Why would anyone do this? This is what needs to be balanced.[BR][BR]A second thing that needs to be balanced is the fact that in the current tourney system, many AWs have turned into being NEGATIVE for a cities performance. While there is an easy fix for this problem: Delete them all, this is not a good idea for a city building type of game, it is one of the main reasons why people hate the new tourney so much. This is a very good idea to send the developers to work on balancing! rather than making everybody delete their hard worked for AWs. At the very least make them teleportable so people can bring them back when the game changes t something more intelligent.[BR][BR]The 3 separate queues are hardly balancing any of the underlying problems. What they do is, they give everybody more troops, yes, it is very popular with people, because it is a tangible number that is easy to see, making things easier for them. However the difficulty never really was the problem in the first place. The raised difficulty was part of the necessary balancing of tourneys, so now instead of fixing the problems, they do something to counteract what was the main reason for doing all this in the first place, just to buy goodwill with people. Fine by me, but it is not a fix of any problem! Indeed it is introducing a BIG and NEW imbalance to the game, buy extremely favoring human over elven towns. Humans get an extra traing queue with high quality units, while elves get an extra training queue with cannon fodder, while both get a third queue with more cannon fodder. How on earth can this be called balancing???\t\tClick to expand...[BR]CrazyWizard said:\t\t\tI agree with both responders.[BR]There is no balance and this so called \"proof\" is no proof at all.[BR]From the start we pointed out the main flaws of this change. while changes are made, none of these changes solve the flaws we pointed out.[BR][BR]The closest they got is changing a value in the formula, but that value is not the problem. the formula itself is.[BR]Every other change is pointless.[BR][BR]It's like a wreck of a car with square wheels, you can totally fix and replace every single part of that car making it look like new, as long as you do not fix it's square wheels everything else is pointless. it serves no purpse nor does it fix or change anything about the car not working as intended as long as it wheels stay as squares.\t\tClick to expand...[BR]As a testimony of the only fellowship that is successful in completing the whole tournament (however at a huge cost each week), I’d like to say, especially to Inno and its representatives, that very few of my fellows do really appreciate or are happy with the new format, the new formula.[BR][BR]We had actually our first casualty last week with a dear team mate dropping the game altogether mainly due to those changes. And I can understand him, the disparity between players as to the adjustments they will need to do to keep up in the tournaments is huge.[BR]I have personally a hard time being happy with this formula also, if you consider my progress in general but especially in AWs, as with my 491! actual levels, I will need to get rid of at least 100 to be able to be competent in tournaments from now on .. (I know players who quit playing for less in the past - deleting an AW by mistake for instance..).. Don’t get me wrong, I love being challenged, and I understand that the tournament was getting a bit out of hand, but having to erase AWs, AWs that have been leveled up with time and effort is so cruel, wrong and almost irrational.[BR][BR]A few are talking around me that they are losing their fun in tournaments, and since they are mainly playing this game because of them, I do not want to bet on their longevity into the game if this format/formula is here to stay the way it is right now. Others wonder if they should indeed delete some AWs but are afraid to do so as it is irreversible and we are not sure if Inno is going to implement the AWs lvl coefficient in the end...[BR][BR]I support the majority of you who believe the formula is wrong, and that there is no real balancing. This is far from being an improvement and I hope it’s not definitive because I don’t see a lot of the main actual actors of the tournaments sticking to it.[BR][BR]Cheers! <o"}, {"15": "alsael said:\t\t\tSo,now we can \"safely\" research those optional squad upgrades,or not yet?\t\tClick to expand...The optional researches are currently not in the formula. Whether they are safe to complete or not is another matter. When the spire came out players on beta got very worried the same formula will be applied to tournaments and the answer from the elvenar team was: Don't worry, that's not going to happen. And yet here we are [smilie--sprite1]"}, {"22": "alsael said:\t\t\tSo,now we can \"safely\" research those optional squad upgrades,or not yet?\t\tClick to expand...I'm going to leave all mine as they are until we know for sure this is done. They don't actually provide much benefit, other than easier province fighting, but I figure that can be kept on ice for a while.[BR][BR]I did delete two Ancient Wonders already (I'm sure someone asked us to report when we did so.) It may have been hasty, but they are two Wonders I could happily have lived without even without the tournament change. One is Endless Excavation. It did previously make sense to have that Wonder because it gave out a decent amount of free tools that weren't dependent on population and culture, but considering I had the excess population it made no sense for me to keep those extra AW levels hanging around my neck to hurt my tournament scores. I replaced it with another workshop. The second one was Lighthouse of Good Neighbourhood. That was a fun project of mine. I think it looks really cool and it was helping quite a bit with my culture bonus, but there was no sense continuing the experiment as it was only hurting me.[BR][BR]To be clear, I'm very bitter about deleting Ancient Wonders. I'm bitter that I would even have to be considering it to myself. I really hope that Inno are going to see some sense and amend the formula where they are concerned so not too many others feel the need to do the same and so I don't have to remove any others."}, {"1": "malph said:anonglitch you said The fact that the time is extended is a blessing because, in other words, we are saying, \"We are working on making the tournament better for everybody,\" and that is positive if you look at the big picture, who cares what happens at Elvenar US, for example.[BR][BR]well i dont think its a blessing more of a curse to be honest and I care what is happening on other servers  ..As we are the new test centre we are losing a massive amount of troops testing this and now we get told we got another 3 weeks testing thats even more troops lost and what do we get  less rewards as cant do so much prov  .but the other servers got the blessing of not having to do this testing Click to expand...[BR]Hello,[BR][BR]Well, to be honest, you shouldn't. This is Elvenar International, and here, behind the words, shows that these servers are of greater importance.[BR][BR]If you have a city on another server, enjoy it, but if you don't, what difference does it make?[BR][BR]Give it a thought, you complain because we get three more weeks... but if we \"didn't get those three more weeks\", we still would have this new format as we know it now. Unless you find satisfaction in other servers going through the same challenges we are going through. I can't understand your point.[BR][BR]The only difference is that as you indeed say, other servers will continue with the old format, so? Give your best constructive feedback of what you want to see in the tournament, this is how you can voice your opinion the best for this, our server, and the rest of Elvenar servers across the world.[BR][BR]CrazyWizard said:\t\t\tunless there is even the slightest hint there willing to actually look at the real problem, instead of changing and announcing changes that are unrelated you can keep trying to spin some positivity in the negative sentiment, but it's like moping the floor with an open water tap.[BR][BR]it's pointless. no matter how much I would like to defend the changes there is zero ground for me and as you can see for many to do so.\t\tClick to expand...[BR]I get your point, however, I stand still, we extended three more weeks, that should mean something, doesn't it?[BR][BR]Pauly7 said:\t\t\tWhat @anonglitch is trying to say is that if this testing period was over and it was being rolled out to others servers that would mean the job is now done and there will be no more changes. If they feel the need to extend the testing period then we have to take some positivity from that. We may not be optimistic, but it isn't over. It sucks that it is EN that is being given the head start on the reduced rewards, etc, but at least they are still looking into it.\t\tClick to expand...[BR]Thank you.[BR][BR]And by the way, we wouldn't advise for players to take drastic decisions, as things are not final yet [smilie--sprite1]"}, {"118": "@anonglitch & @Silmaril[BR][BR]As a fellow of mine correctly asked, so Inno will be testing on our stocks for at least 6 weeks.[BR]Will we get any compensation for that? Wouldn't it be fair to get something in return for our testing since it wasn't our choice and we didn't apply for any of this?[BR]I am asking as my fellowship, which is essentially tournament focused (we are not called \"Tourney Bandits\" by chance [smilie--sprite2] ), is competing globally in Tournaments for fun, accomplishing several times the 1st spot globally... Now the rest of the global fellowships will have a huge advantage over us as they will not have depleted all their stock like we are for Inno's testing sake..."}, {"8": "anonglitch said:\t\t\tI get your point, however, I stand still, we extended three more weeks, that should mean something, doesn't it?\t\tClick to expand...[BR]It's a bigger mess then we realised?  [smilie--sprite1]"}, {"113": "Has anyone tried to disconnect the roads to their AW before the start of a tourney to see if rendering them unusable will make any difference in difficulty?"}, {"118": "Dicke01 said:\t\t\tHas anyone tried to disconnect the roads to their AW before the start of a tourney to see if rendering them unusable will make any difference in difficulty?\t\tClick to expand...[BR]Not tried but one of my fellows saying that he believes that squad size is fixed at the beginning of each tournament, so we will have to test it next time I suppose.."}, {"22": "Dicke01 said:\t\t\tHas anyone tried to disconnect the roads to their AW before the start of a tourney to see if rendering them unusable will make any difference in difficulty?\t\tClick to expand...I haven't tried it myself, but the idea has been raised. As far as I'm aware it doesn't work. Even if it did, it would be an oversight which they'd now fix."}, {"14": "anonglitch said:\t\t\tAnd by the way, we wouldn't advise for players to take drastic decisions, as things are not final yet [smilie--sprite1]Click to expand...[BR]As I mentioned before; zero faith, zero trust."}, {"113": "It has been mentioned that it is/will be possible to train in all three army buildings simultaneously. Has that bern already implemented for pc? I play app only, and so far there has been no update. Cheers"}, {"22": "Dicke01 said:\t\t\tIt has been mentioned that it is/will be possible to train in all three army buildings simultaneously. Has that bern already implemented for pc? I play app only, and so far there has been no update. Cheers\t\tClick to expand...It's implemented on Beta, but not yet on Live"}, {"73": "anonglitch said:\t\t\tAnd by the way, we wouldn't advise for players to take drastic decisions, as things are not final yet\t\tClick to expand...You mean I should wait to do all those optional SS upgrades?[BR]1. What about people who have already started completing optional SS techs.[BR]2. And people who have started deleting AWs ?"}, {"63": "anonglitch said:\t\t\tThe fact that the time is extended is a blessing because, in other words, we are saying, \"We are working on making the tournament better for everybody,\" and that is positive if you look at the big picture,\t\tClick to expand...Thanks, although I have only once gone out to round 2 in the at the time all 59 provinces, who knows maybe the option of doing it again one day will be useful to me."}, {"54": "I think the lack of clear intentions from innogames is what is causing this mess, and is what's also causing your statistical data to be wrong.[BR][BR]Some people are trashing AW and researching optional SS, if this change ends up being rolled back, you will likely loose those players, since they adapted and are punished for it.[BR][BR]Some people already stopped playing because of these changes, they don't like the game with these changes anymore and have no confidence it will be tuned into something better.[BR][BR]Some people are still optimistic, and are considering quitting, but are hoping things will still change and it won't be as bad as it is now. Those people might still look good in your statistical data, but you might loose them as soon as they realise these changes are final.[BR][BR]We just need a clear perspective of what to expect, and only then you will get statistical data thats helpful to you.[BR][BR]I for one have no problem with doing less provinces in the new format, since I realise some players were doing too many in the past. While others will quit just over this simple fact. (we always got 1000 ecurrency, and now we can only get 100 ecurrency anymore, im not gonna bother anymore)[BR][BR]We give you feedback over and over, for the past 2 months now, but we don't even know if the feedback is even being considered or if its thrown off the table as soon as its on there. Don't worry, we won't be mad if a suggestion gets trashed, if you give a good explanation of why its trashed. Some of us will even defend your decisions if thats the case.[BR][BR]We just lack information, and that way you are killing your own game, and turning all forums into a very negative spiral.[BR][BR]We have Q&A on facebook ofter, but if its only used as a promotional talk and to cherrypick comments like: ooh i like how this new building looks, and when are we gonna be able to rotate buildings then its not really a QA anymore."}]