[{"73": "Heymrdiedier said:\t\t\tWe just lack information, and that way you are killing your own game, and turning all forums into a very negative spiral.\t\tClick to expand...That and quite frequent rule changes.[BR]The rules are so frequently changed that we don’t know what to do in the game."}, {"32": "JollyElf said:\t\t\tThat and quite frequent rule changes.[BR]The rules are frequently changed that we don’t know what to do in the game.\t\tClick to expand...[BR]Incremental small rulechanges aren't that bad and very sometimes something drastic is needed, it's part of a living game.[BR]As soon as this is not the case anymore the game is dead.[BR][BR]just an example every new even buiolding is in ptential a game changer, every chapter could be.[BR][BR]The main issue now is that the core game is changing, from progres is always good to progress may lead to..... regression on certain parts of the game"}, {"73": "CrazyWizard said:\t\t\tIncremental small rulechanges aren't that bad and very sometimes something drastic is needed, it's part of a living game.[BR]As soon as this is not the case anymore the game is dead.[BR][BR]just an example every new even buiolding is in ptential a game changer, every chapter could be.[BR][BR]The main issue now is that the core game is changing, from progres is always good to progress may lead to..... regression on certain parts of the game\t\tClick to expand...Yeah. Which side is my goal post [smilie--sprite2][BR]It’s like changing the direction of goal post every 2 mins that the footballers are confused."}, {"24": "alsael said:\t\t\tSo,now we can \"safely\" research those optional squad upgrades,or not yet?\t\tClick to expand...[BR]I would say yes, it is rather safe to say that this is the only point that for sure will not change. Of course 100% certainty does not exist ever...[BR][BR]Why I think it is safe to do SS if you want to do so (I personally have done all by now, from minimum SS befoe):[BR]This change is a bigger change that would have come even independently from all the other changes, it has been asked for since they started using the old formula. This change is positive and is not AFAIK a point of complaint by anyone. The old way of making SS growth negative for your progress (just as now expansions, tech and AWs can be) was a bad idea, getting rid of it now is one of the 100% positive parts of the change. Noone will appreciate this change disappearing, neither has Inno any interest in reversing it that I can see.[BR]Changes we can at least hope for are changes that either address the big problems or changes that will mollify all the upset people to a point of accepting the new tourneys (like the divided training queues).[BR][BR]The only way of the SS part changing would be a full rollback of the new to the old tourney format and I bet anything you want that that is not going to happen, Inno has invested far too much into this change by now. The new tourneys will stay, even if every single forum user quits the game today because of it.[BR][BR]So I say the SS are safe to take if you want to, not that it will make a huge difference, but since the positive (troop instants, \"free troop\" AWs and Map provinces) outweigh the negative effects (KP, Orc and other resource costs or as someone mentioned, more difficult quest requirements), I did them, I feel like I need every little thing I can get to help me with the new tourneys.[BR][BR]I will certainly start deleting AWs as soon as I am sure that that part is not going to change, it will have a bigger effect, but I am not 100% sure we have seen the last changes in that part of the new tourneys yet..."}, {"17": "Ah thank you @Gargon667 you have helped me see why the staff and developers have continued to promote the optional squad size upgrade.  [BR]I know sometimes their decisions seem arbitrary to those of us in the trenches but as we are without clear sight, this makes sense now.   Yes my troop producing Wonders were starting to fall behind but now I see why that is occurring."}, {"53": "anonglitch said:\t\t\tIt is precisely one reason we have a new format here in life. To ensure player satisfaction, we need to collect all your feedback about the troop's power, barrack's speed, AW effects on the tournament, etc., and thanks to all of you, these changes are arriving.\t\tClick to expand...[BR]You solicited more feedback, and below I give an analysis of what I think was by far the biggest imbalance in the old tournament, together with some suggestions about how it could be reduced. (My aim with these suggestions is to encourage surgical changes which affect very little beyond the imbalance itself.) I'll use my city as an example, but I expect that a similar analysis will apply to almost all high scorers in the old tournament.[BR][BR]In my city I have:[BR]Flying Academy at level 30+ (giving 100% speed up to the Mercenary Camp)[BR]Simia Sapiens at level 30+ (giving a 40+% increase to troop production)[BR]I earn about 200 hours of time boosters per week (mostly from reaching the top of the Spire in a Gold Medal fellowship)[BR]I have one brown bear.[BR][BR]Periodically (say once a week), I feed my brown bear and use all of my time boosters on the mercenary camp. This gives me about 760 hours of my favoured troops. I also get about 470 hours of troops accumulated over the rest of the week (with the wonders boosting my base production by a factor of 2.8). This means I get about 7.3 times the troops of a player without any of the above advantages. (A player with multiple brown bears could increase this multiple further). The biggest problem in the old tournament was that this number of troops was often enough to auto-fight all of your provinces.[BR][BR]The above imbalance is so extreme because the benefits of the assets (wonders, time boosters, bears) were multiplied together. It could be significantly reduced if we changed that. As an example we could not apply the wonder benefits to troop production when time boosters were used. At a stroke this would reduce the troop production multiple to 4.5 times over the base player, and to just 1.6 over the player with the time boosters and bear but no relevant Wonder levels. (These reductions are even bigger when multiple bears are used.) This change would have (as far as I can see) no other significant gameplay effects though. It would be a low impact rebalancing measure.[BR][BR]Another similar change would be to have the Simia Sapiens act independently of the Flying Academy (i.e. for their contributions to be added, rather than multiplied) although the effect of this would be smaller. (Options which don't apply the brown bear boost when the time boosters are applied, or which prevent time boosters being used for troop production would probably make the bear not worth having - so I don't suggest those here.)[BR][BR]As an aside, the new difficulty formula, really doesn't address the troop production at all. There is a small penalty for the 60 wonder levels, but nothing else. The introduction of three queues for the three production buildings will have a bigger effect (to reduce the imbalance) of course but may bring in other problems."}, {"100": "Idiotic changes, the only way I could conclude this tournament new format, what kind of game take the fun away? If I play manual the province I´m providing below I will probably lose cause enchantress would target-kill my Golems with a single hit, the stainling would destroy all my archers and worst if I use mages... And you know what INNO? With those huge enemy squad sizes whatever unit, EVEN ARCHERS could take care of my golems, cause those enemy squad sizes are just ridiculous, these are a big \"F.Y.\" in the face of your customers and the people who love playing tourney, and do you know what province this is happening? In the 9th province!!!! WITH THE FED CHICKEN!!!  With the supposed easier new tournament patch!!!! This never, ever happened to me in such a early province, and the only possible way I could advance further in the tournament would be with a bunch of Dwarven armorers and UUU´s, (very very rare and scarce) things you wont give us for free and in big supply, and all this for the same prizes of the old model of the tourney? I mean difficulty in the roof but prizes equal to the old model, yeah...[BR][BR]But you @Muf-Muf INNO devs did it, you did want everyone playing much more the Spire, and focus armies and resources in the Spire, you made it, you made players go that russian roulettte and spend all their diamonds there, and afterwards spend more money to get more diamonds to spend more of those in it, and so on and on... Perfect, The next step is making tournament cattering just like the spire, with several attempts and with diamonds involved for more attempts...  Great work destroying this beautiful game..."}, {"84": "DunkelSaturn said:\t\t\tBut you @Muf-Muf INNO devs did it, you did want everyone playing much more the Spire, and focus armies and resources in the Spire, you made it, you made players go that russian roulettte and spend all their diamonds there, and afterwards spend more money to get more diamonds to spend more of those in it, and so on and on... Perfect, The next step is making tournament cattering just like the spire, with several attempts and with diamonds involved for more attempts... Great work destroying this beautiful game..\t\tClick to expand...[BR]You are blaming the wrong person when you name Muf-Muf, community managers and moderators have nothing to do with making and introducing these changes. You need to blame the game designers and developers, they are the ones responsible for this mess."}, {"73": "Timneh said:\t\t\tYou are blaming the wrong person when you name Muf-Muf, community managers and moderators have nothing to do with making and introducing these changes. You need to blame the game designers and developers, they are the ones responsible for this mess.\t\tClick to expand...Or the sales managers and financial department?"}, {"45": "Kaliartis said:@anonglitch & @Silmaril[BR][BR]As a fellow of mine correctly asked, so Inno will be testing on our stocks for at least 6 weeks.[BR]Will we get any compensation for that? Wouldn't it be fair to get something in return for our testing since it wasn't our choice and we didn't apply for any of this?[BR]I am asking as my fellowship, which is essentially tournament focused (we are not called \"Tourney Bandits\" by chance [smilie--sprite2] ), is competing globally in Tournaments for fun, accomplishing several times the 1st spot globally... Now the rest of the global fellowships will have a huge advantage over us as they will not have depleted all their stock like we are for Inno's testing sake...\t\tClick to expand...[BR]Not quite sure where the idea of compensation comes from? The International server is generally the server of choice for having all changes in the game earlier than any other live server, even our updates are earlier here. [BR]I personally am more than grateful that we are having our voices heard here, rather that waiting like the others are to see what improvements we are pivitol in making."}, {"8": "Gargon667 said:\t\t\tI will certainly start deleting AWs as soon as I am sure that that part is not going to change, it will have a bigger effect, but I am not 100% sure we have seen the last changes in that part of the new tourneys yet...\t\tClick to expand...[BR]I currently have 210 AW levels, spread over 17 aws, which just about covers my need for seeds at my trader. I think I was quite choosy in which aws I placed and I upgraded them not only for the benefits they gave but also to increase my seed collection from my trader. Deleting any of them would result in me having to wait for and then place temporary seed buildings, should I be lucky enough to win some in any upcoming events. Unless you no longer need seeds I honestly don't understand how deleting aws would be beneficial.[BR]Am I missing something? Is there a magic aw level number that we shouldn't go past?"}, {"24": "OldHag said:\t\t\tI currently have 210 AW levels, spread over 17 aws, which just about covers my need for seeds at my trader. I think I was quite choosy in which aws I placed and I upgraded them not only for the benefits they gave but also to increase my seed collection from my trader. Deleting any of them would result in me having to wait for and then place temporary seed buildings, should I be lucky enough to win some in any upcoming events. Unless you no longer need seeds I honestly don't understand how deleting aws would be beneficial.[BR]Am I missing something? Is there a magic aw level number that we shouldn't go past?\t\tClick to expand...[BR]You already mentioned the solution: You can place event seed buildings instead, they do not increase tourney difficulty and come for free in events or crafting. If you need seeds for sentient production, using MM enchantments reduces your need for seeds as well.[BR][BR]You can of course delete some of those 17 AWs you have and upgrade the more important ones to keep AW levels (and tourney difficulty) at least stable rather than have them increase.[BR]I have currently 324 levles in 15 AWs and as I said I am definitely going to sell some of them, because they are not essential to gameplay. I suppose I will end up with 11 or 12 AWs in the end."}, {"7": "Silmaril said:\t\t\tNot quite sure where the idea of compensation comes from? The International server is generally the server of choice for having all changes in the game earlier than any other live server, even our updates are earlier here.[BR]I personally am more than grateful that we are having our voices heard here, rather that waiting like the others are to see what improvements we are pivitol in making.\t\tClick to expand...The difference is in the fact that you call them \"improvements\", where we (if you still hadn't noticed by now) do not see them that way at all! We do not see it as a benefit to be part of a test, we didn't ask for it, we just made an account on one of the live servers, thinking this would have the best game play, as beta is for testing... However, suddenly here we are, testing out those \"wonderful improvements\" that somehow make everyone want to run away from the game..."}, {"75": "anonglitch said:\t\t\tUnless you find satisfaction in other servers going through the same challenges we are going through ...\t\tClick to expand...Yes, please [smilie--sprite1]"}, {"75": "Gargon667 said:\t\t\tI have currently 324 levles in 15 AWs and as I said I am definitely going to sell some of them, because they are not essential to gameplay. I suppose I will end up with 11 or 12 AWs in the end.\t\tClick to expand...In the previous version of the tournament, it was never publicised that researching optional Squad Size Increases was going to make tourney more expensive for a city. Despite that, word got around that this was the case and many players stopped doing them.[BR][BR]It would be naive of Inno to expect that word will not similiarly spread, that buying premium expansions, placing (any) expansions, placing Ancient Wonders, upgrading Ancient Wonders, will all now make the tourney (and Spire) more expensive for a city."}, {"84": "Silmaril said:\t\t\tNot quite sure where the idea of compensation comes from? The International server is generally the server of choice for having all changes in the game earlier than any other live server, even our updates are earlier here.[BR]I personally am more than grateful that we are having our voices heard here, rather that waiting like the others are to see what improvements we are pivitol in making.\t\tClick to expand...[BR]I think the thing that is annoying players is that Elvenar already has a test server, BETA. EN servers are not test servers they are normal game servers. Players playing on the EN servers are having to pay MUCH higher amounts of troops and goods in the new tourney system and that is putting them at a massive disadvantage when trying to compete with other servers in tournaments. Players can volunteer to be test players by joining Beta but here we have been forced to be test players on a server that is not a test server.  I can understand why some players think they should be compensated for being put at a disadvantage in tournaments against other servers when the other servers have a much easier/cheaper tournament.[BR][BR][BR]Verde said:\t\t\tIt would be naive of Inno to expect that word will not similiarly spread, that buying premium expansions, placing (any) expansions, placing Ancient Wonders, upgrading Ancient Wonders, will all now make the tourney (and Spire) more expensive for a city.\t\tClick to expand...[BR]You forgot to mention progress through the tech tree also makes it harder/more expensive."}, {"75": "Timneh said:\t\t\tYou forgot to mention progress through the tech tree also makes it harder/more expensive.\t\tClick to expand...Thought about it but figured that was almost unavoidable for normal players, if they played/continued to play the game at all ..."}, {"24": "here is some practical game play example for @anonglitch @Silmaril @herodite @Muf-Muf [BR][BR]The idea was: Progress makes tourneys easier so difficulty should increase accordingly (I fully agree with this idea)[BR][BR]Here is an example of what the tourney formula does: [BR]City 1: @Far Reach ranked number 1 in our world (EN3):[BR]Expansions: 148[BR]Research: Finished chapter 16[BR]AW levels: 712[BR][BR]City 2: Gargon667 ranked somewhere between 100 and 200.[BR]Expansions: 129[BR]Research: Beginning of chapter 16[BR]AW levels: 324[BR][BR]Looking at those numbers and the underlying idea: Far Reach should be easily able to beat me in tourneys every single week. [BR]In reality I pity him. His town has become a huge block of concrete on his feet while trying to swim the ocean of new tourneys... Why? Because the formula is complete nonsense![BR][BR]lets look at it in detail:[BR][BR]He has 20 expansions more than I do, what´s the best possible thing he can do with it? Well not much he can do for troop production, but he could fill them with Orc Startegists or vallorian valor for some extra troops. How many squads a week would that produce? Lets say we talk about province 40. Maybe 1 encounter? maybe 3? As an alternative he could fill the 20 expansions with Magic houses and Factories for catering. What´s that give him? 12 houses 6 factories? I think he probably would cater even fewer than those possibly 3 encounters with what he can make in those factories.[BR][BR]He has a chapter worth of research on me: What does it help him? Zilch, the chapter is a complete waste of resources to play and then shoots you in the foot during the tourney as a bonus. It gives absolutely nothing worth talking about in return. Not a single tech that would the tourney easier, while every single one of them makes it harder. Yes there is a training ground upgrade in there, a building so useless I never built it to start with, now with the 3 separate queues I will build it (why not?), it will give me a bunch of free cannonfodder troops. None of those troops will win a fight in province 40 (with the exception of the Orc Strategist which noone makes in there because of ridiculous costs)[BR][BR]If you think the above two are bad, we now come to the absolute killer:[BR][BR]AW levels: He has more than double the AWs compared to me! He is completely destroying me in troops production and can bulldoze tthrough the tourney? I wish it was (then I had a goal ahead). In reality he has exactly the same troop production I have. Needles/FA/Simia at lvl 31 (OK he has a 32 simia lol) with the 3 queues his VicSprings 30 will guarantee he gets double my cannonfodder (YAY!) [BR]At least it means his units must be way better than mine then? The 3 most used units are LR,M and HR, he has a total of 3 AW levels on me for another week or 3. His HM and LM are better than mine for sure (YAY better cannonfodder!)[BR]The rest of his AWs does pretty close to nothing for his tourneys (other than making it double as hard for him). And to be honest I have 2 brown bears instead of his 1, so in reality I have an extra 50% bonus that he doesn´t have. All the cannonfodder in the world is not going to make up for that one. So his tourneys are way harder than mine, while I have far more of the useful troops to fight them.[BR][BR]now finally we reached the end you hope? Unfortunately not. Everything so far is actually OK. Sucks for him, sure, but he chose to do all those things, now he has to life with it. That´s how the progress factors work. They are not perfect and can of course never be perfect. but in general we could say at least he gets a little bit out of having all those things.[BR][BR]The really completely insane part comes here: We don´t just add all his factors up, we MULTIPLY THEM WITH EACH OTHER! [BR][BR]This poor guy is stuck in the muck so deep now he can hardly move! Last weeks tourney I saw him climbing the tourney ranks in the end trying to catch me just before the end. Out of habit I make it a bit harder for him to pass me and did a couple extra encounters just to tease him, but he immediately stopped moving! Why? well because just doing 5 encounters has cost him an insane fortune! I felt bad for doing it after! I should have let him pass me for all the effort he put in! And this situation is truly ridiculous! I should not have to feel pity for a town 4 times my size![BR]From now on it is me who decides to let him pass me instead of him deciding to do all his provinces or not lol. I assume he has zillions of resources of all kinds saved up and he could probably push his way past me once, but only by completely wrecking his reserves.[BR][BR]I want a fair fight, we never had one, not in the old tourney, nor in the new one. I like the new difficulty of the tourneys, but blocking big tourney towns like Far Reach from competeing on a fair level is just not OK, yes his town is the exception, but still a formula that does that should never have passed a first draft! So somebody go and fix it! It really doesn´t look good on any devs CV to have a piece of junk like this for a formula on it. No matter how elegantly it is programmed a basic understanding of maths is still essential and this formula is a complete fail."}, {"1": "Verde said:\t\t\tYes, please [smilie--sprite1]Click to expand...[BR]Well, sorry, there is no point with that, it would only un-please players. As @Silmaril said, we get some releases early here, and we can speak up here.[BR][BR]@Timneh about competing with other servers, what are you exactly refer too? How does the US server play a difference in your gaming experience and competition here?[BR][BR]@C-Nymph they are still improvements, especially when we are testing still. I am sure that while some call the Spire a Russian roulette, several FS reach and accomplish their top medals. I am sure several people are happier now with the Spire, and they wouldn't want it to disappear, for example. [BR][BR]And to @Far Reach and a few more, I am forwarding your feedback to the devs, thank you. [BR][BR]We still have more testing time, if other servers don't, that's their business, but they will get a final product whether they like it or not, this is why we want constructive feedback [smilie--sprite1]"}, {"24": "Verde said:\t\t\tThought about it but figured that was almost unavoidable for normal players, if they played/continued to play the game at all ...\t\tClick to expand...[BR]I am already telling everybody that asks, to stop researching alltogether as soon as you have the 3 star frog in chapter 15... After that it´s all downhill from there.[BR][BR]The perfect tourney town in my eyes, will stop research in this place, put down less expansions than they get and have 11 or 12 lvl 30 AWs.[BR][BR]Of course some more extreme versions like low chapter caterers have been discussed and are in theory an option, but I believe that tourneys are still too easy for big towns (meaning high enough scores will be reached every week by someone) that a small caterer can have enough provinces to compete for the win."}]