[{"45": "Well you know my feelings on this, I am grateful we are being asked to feedback to help mould the new Tournaments as we could have been just handed the original changes. Which is after all how most games work these days."}, {"75": "anonglitch said:\t\t\tWell, sorry, there is no point with that, it would only un-please players.\t\tClick to expand...On other Live Servers? If the new tourney is already sufficiently good and well thought out (for EN), how could it possibly be that players on other servers would be un-pleased?[BR]On this Server, hmmmm ... not sure that it would un-please players here."}, {"27": "Silmaril said:\t\t\tWell you know my feelings on this, I am grateful we are being asked to feedback to help mould the new Tournaments as we could have been just handed the original changes. Which is after all how most games work these days.\t\tClick to expand...The issue here is that it doesn’t feel like we are helping to “mould the new tournaments”.[BR]There are some changes *), but those don’t mould the tournament. They are not at all touching the principles on which the new tournament stands. Some are easing the most horrible design missteps (random troops with common 4-5 troops types encounters; or huge orcs and mana drain), others are cosmetic (difficulty curve between 10-20) and some bring other serious problems (simultaneous training).[BR][BR]*) It’s quite a few already (the first two were done on beta already, they have nothing to do with our feedback here):[BR]- the enemy troops selection is not fully random anymore and the “all 5 types of troops encounters” are now exception, not common scenario;[BR]- the frequency of mana and orcs in negotiations was lowered I think;[BR]- minor change of difficulty curve in the second tens of provinces;[BR]- enabling troops training in all three military buildings simultaneously (currently on beta)."}, {"33": "opposition is to heavy, just cater it[BR]Gargon667 said:\t\t\tI am already telling everybody that asks, to stop researching alltogether as soon as you have the 3 star frog in chapter 15... After that it´s all downhill from there.\t\tClick to expand...[BR][BR]What's the point of doing Tournament if you stop reasearch? I assume you also should stop building up AWs.[BR]The main reward from Tournament are a lot of kp and following your advice you will not need any kp. I don't understand that. The only possible usage of such a town is a push account to feed kp into other towns, but as thats against the rules I hope thats not the plan.[BR][BR]Personally I do Tournament in order to get kp to use to develop my city. If I didn't get any reward from Tournament I wouldn't do it.[BR]So building a city as you advice sounds utterly meaningless as you are unable to use the reward."}, {"7": "anonglitch said:@C-Nymph they are still improvements, especially when we are testing still. I am sure that while some call the Spire a Russian roulette, several FS reach and accomplish their top medals. I am sure several people are happier now with the Spire, and they wouldn't want it to disappear, for example.\t\tClick to expand...Again, comparing apples with pears. We're not talking about the spire here. We're talking about the new tourney system. It blows my mind how you keep trying to change the subject.[BR]And also, they're not improvements if you first destroyed the base. Putting a pretty flag on top of a destructed building does not make it any better. There's a saying in Dutch... \"Al draagt een aap een gouden ring, het is en blijft een lelijk ding\". Seems very accurate here..."}, {"75": "FieryArien said:\t\t\tThe issue here is that it doesn’t feel like we are helping to “mould the new tournaments”.[BR]There are some changes *), but those don’t mould the tournament. They are not at all touching the principles on which the new tournament stands. Some are easing the most horrible design missteps (random troops with common 4-5 troops types encounters; or huge orcs and mana drain), others are cosmetic (difficulty curve between 10-20) and some bring other serious problems (simultaneous training).[BR][BR]*) It’s quite a few already (the first two were done on beta already, they have nothing to do with our feedback here):[BR]- the enemy troops selection is not fully random anymore and the “all 5 types of troops encounters” are now exception, not common scenario;[BR]- the frequency of mana and orcs in negotiations was lowered I think;[BR]- minor change of difficulty curve in the second tens of provinces;[BR]- enabling troops training in all three military buildings simultaneously (currently on beta).\t\tClick to expand...Even with the changes listed, curious as to how many were really based on EN feedback and how many were based on/already in the pipeline from Beta feedback"}, {"26": "anonglitch said:\t\t\tWell, sorry, there is no point with that, it would only un-please players. As @Silmaril said, we get some releases early here, and we can speak up here.\t\tClick to expand...Oh, really? So at least you are aware that this change un-pleases players, glad to hear that. Still blows my mind though that instead of having a proper beta server to which you can clone your live city or just build/remove anything you want, Inno has just the usual server labelled beta, but with more bugs and fewer players, which results in the current situation where you have to force players on live server to test changes. But I could live even with that if the feedback that were given for five weeks of beta testing was heard or at least answered to. For the past three weeks we are giving exactly the same feedback as there were on beta, that the multiplicative formula is wrong. And still Inno didn't even care to admit that there might be issues with this, or explain why it's necessary to multiply AWs with expansions and researches. Instead we are getting a few cosmetic changes and constantly being told that our feedback is heard, when in fact it has been ignored for two months. Don't you think that this un-pleases players? And now you are extending the test period for what? Are we getting the next week tournament based on different formula? Or there will be another 3% change in the difficulty of five provinces and you will say that you are listening to the feedback? Don't devs at Inno think that if they decide to test their bright ideas on live worlds they should at least get better at communication and tell what they are doing and why? That would be a nice change instead of telling us for two months that the feedback is heard and you are making improvements, when in reality the improvements address anything but the core issue of your system which we keep pointing out."}, {"8": "Gargon667 said:\t\t\tYou already mentioned the solution: You can place event seed buildings instead, they do not increase tourney difficulty and come for free in events or crafting. If you need seeds for sentient production, using MM enchantments reduces your need for seeds as well.\t\tClick to expand...@Gargon667 I do appreciate your replies and whilst I understand what you mean, I don't see this as a solution at all. It's actually not that long since I deleted all my mana and seeds temp buildings as they were no longer needed. I thought that was game progress.[BR]For me, it would be like taking 2(0) steps backwards to move 1 step forward (if I'm lucky) at great cost to my city development, which is something I enjoy doing........or at least I did.....now it seems that any progress I would like to make in the game is a waste of time, I might aswell be a dwarf again.[BR]As someone posted previously, the goalposts have been moved and I don't know where mine are anymore."}, {"118": "Silmaril said:\t\t\tNot quite sure where the idea of compensation comes from? The International server is generally the server of choice for having all changes in the game earlier than any other live server, even our updates are earlier here.[BR]I personally am more than grateful that we are having our voices heard here, rather that waiting like the others are to see what improvements we are pivitol in making.\t\tClick to expand...anonglitch said:\t\t\tWell, sorry, there is no point with that, it would only un-please players. As @Silmaril said, we get some releases early here, and we can speak up here.\t\tClick to expand...Ok, I get that your job is to respond by avoiding politely to really address our objections here, but telling us that we should be happy to be the designated guinea pigs just because we can express our opinion here, opinion that is obviously dismissed, is a bit condescending to say the least...[BR][BR]I am sure that you are happy with the situation, as you are to work for free for Inno, which was completely your choice, we didn't chose to test this new format on live and deplete ALL our stocks, be it resources, instants, troops, AWs and everything that has value in Elvenar.[BR][BR]When I said compensation, (I knew pretty well the answer to this), I meant maybe we could receive compensation instants, be it time, troops or even the faster/boosted manufactories days to help us recover faster.[BR][BR]anonglitch said:@Timneh about competing with other servers, what are you exactly refer too? How does the US server play a difference in your gaming experience and competition here?\t\tClick to expand...You may don't know it maybe because you are overload with work, but there is a global-server competition going on, we are part of it as a fellowship, we try to be 1st on this server and globally competing with all the servers and beat the other tournament fellowships in scores, when we do, except for the extra thrills that it gives us, (excitement that helps keeping people playing the game..), we cultivate a mutual respect between competing fellowships and congratulate each other …[BR]Now that we are the only ones under the test-format we are penalized from the get-go….[BR][BR]anonglitch said:\t\t\tAnd to @Far Reach and a few more, I am forwarding your feedback to the devs, thank you.[BR]We still have more testing time, if other servers don't, that's their business, but they will get a final product whether they like it or not, this is why we want constructive feedback [smilie--sprite1]Click to expand...As the representative of the ONLY fellowship who completed all the chests 3 weeks in a row, you can forward to the devs, that we are completely dried out, a few of us are talking that this is the end of Elvenar as we know it, also please next week record some numbers because we won’t be completing all the chests again, and please forward to the devs something very important:[BR]Although under the new format, my fellowship “Tourney Bandits” probably managed to be 1st in all servers this week (scrolls is not a favorite globally).. Do you imagine, if my fellowship, which I am telling you is not favorable to the new format and still struggles with it, is higher in total score that the other servers, how much difficulty the other servers will encounter and the outrage that will rise up? Think about it [smilie--sprite2]"}, {"32": "Verde said:\t\t\tThought about it but figured that was almost unavoidable for normal players, if they played/continued to play the game at all ...\t\tClick to expand...[BR]valle said:\t\t\topposition is to heavy, just cater it[BR][BR]What's the point of doing Tournament if you stop reasearch? I assume you also should stop building up AWs.[BR]The main reward from Tournament are a lot of kp and following your advice you will not need any kp. I don't understand that. The only possible usage of such a town is a push account to feed kp into other towns, but as thats against the rules I hope thats not the plan.[BR][BR]Personally I do Tournament in order to get kp to use to develop my city. If I didn't get any reward from Tournament I wouldn't do it.[BR]So building a city as you advice sounds utterly meaningless as you are unable to use the reward.\t\tClick to expand...Thats the dumb stupid thing about this change, it gives \"incentives\" to stop playing[BR]If there is no reason to advance in the reseach treeif there is no reason to level a wonderWhats the point of playing the tournamernts if you cannot do anything with the KPWhats the point of playing? other than if it's a tournament killer secondary account, but then what about your main?"}, {"45": "@Verde Changes from the Beta feedback were made prior to reaching our server.[BR]All changes since are down to the feedback we are gathering from this thread."}, {"24": "valle said:\t\t\tWhat's the point of doing Tournament if you stop reasearch? I assume you also should stop building up AWs.[BR]The main reward from Tournament are a lot of kp and following your advice you will not need any kp. I don't understand that. The only possible usage of such a town is a push account to feed kp into other towns, but as thats against the rules I hope thats not the plan.[BR][BR]Personally I do Tournament in order to get kp to use to develop my city. If I didn't get any reward from Tournament I wouldn't do it.[BR]So building a city as you advice sounds utterly meaningless as you are unable to use the reward.\t\tClick to expand...[BR]My town exists to make my FS better at team events.[BR][BR]Research is only one way to achieve that, as soon as it does not make me better at team events, it becomes \"utterly meaningless\" and I stop research.[BR][BR]There are a lot of other things I find \"utterly meaningless\" playing tourneys without any rewards at all would not be one of them. FAs have \"utterly meaningless\" rewards and are my favorite event of them all.[BR][BR]AWs used to be a nearly unlimited sink of KP, now they are not anymore. When I looked through them I found 11 or 12 that in my opinion will be worth upgrading even under the current tourney regime, so that should make somewhere between 300 and 350 \"useful\" AW levels. However, it will take a while for most towns to get there, so KP won´t be useless for most people for a long time. In my personal case I am rather close to finishing all the important ones, I may as a hobby continue to do the last few levels on AWs that are included in the list, even though they are not strictly necessary (Like GA and MH etc.). If I decide not to do that I will have to find other uses for KP. First of all I will post suggestion on the forum to introduce new things to do with KP that don´t affect tourneys. Maybe we could start making instants in the MA by paying KP? I don´t know I am sure things are possible. Until then I´ll probably invent some other pass-time. KP after all are a fun resource because they can be shared, maybe I´ll start ingame competitions for my FS with AW levels as a grand prize? No idea...[BR]You are definitely right in that they will not be of any use to myself anymore as it stands right now. So what? There are other things to gained from tourneys than just KP [smilie--sprite1] As mentioned above my FS tourney score is why I play the tourney in the first place. The KP only made my AWs better so I could produce the better tourney scores for my FS. Once I reach the max possible, KP will simply go do something else or in the worst case I do nothing at all with them, gathering KP is not the goal of my game, they are just a means to an end.[BR][BR]All the rewards in the game are only means to the same end. Some resources are useless and serve no more funtion at all, it has happened before and it will happen again. Usually the reason is inflation (like the old tourney has caused with a lot of resources, like relics, runes and enchantments), The spire still causes with Spell Fragments. Now the new tourney does not cause inflation, but it simply reduces the need for a certain resource (KP) beyond a certain point. Btw this is one of my points of critisism against the new format, but by far not the most important one. I always dislike wasted resources, because I like efficient city building.[BR][BR]Anyway I find your idea of playing the game rather pointless, but it is your game, so play it any way you like. I have never understood anyone playing chapters just for the sake of playing chapters like a hamster in a wheel. Also I have never understood anyone outside the Top 10 placing a thrones or any other building for the sake of ranking points. Placing 3 nonsensical buildings and jump from 133 to 97... that is pointless in my eyes.... I do understand a serious attempt to go for first place in the ranking list, after all one can choose this ranking as a measure of success just as well as any other measure, but then one should give it a serious try at least and not fool around with it in the back of the pack. It is a very one-dimensional and simple goal and would not keep my attention long enough to keep at it until then end, so I never even tried and leave it to others who are actually interested in it.[BR][BR] I find playing a town just for its own sake too simple, it is no real challenge. A FS is a far more complex entity than a town and it keeps my interest much more than a simple city building game. Without my FS I would have quit the game after a few weeks or month of playing, or at the very latest after reaching the end of research. Quickly hamster my way through all chapters and move on. I find much more interesting things in the game than that. To bring 25 people from all over the planet together to form a unit in which everybody does more than just follow some minimum target, that is a real challenge and that is what keeps my interest in this game."}, {"24": "Kaliartis said:\t\t\tAs the representative of the ONLY fellowship who completed all the chests 3 weeks in a row, you can forward to the devs, that we are completely dried out, a few of us are talking that this is the end of Elvenar as we know it, also please next week record some numbers because we won’t be completing all the chests again, and please forward to the devs something very important:\t\tClick to expand...[BR]Well there is the fact that 19 chests were never intended to be (as per official announcement) finished at all right away, much less every week. So if you could do it without loosing resources, the new tourney would be broken and would have to be made much more difficult.[BR][BR]btw Kudos to you guys for pulling it off!"}, {"75": "Silmaril said:@Verde Changes from the Beta feedback were made prior to reaching our server.[BR]All changes since are down to the feedback we are gathering from this thread.\t\tClick to expand...So then why is feedback still being sought on Beta? Or should we perhaps suggest to the mods on Beta that they close the feedback/discussion thread there?"}, {"58": "Personally, I do not mind testing the new tournament, but I can understand those that do. I'm losing approximately half of the tournament rewards during that test phase compared to someone on a different server. It's worth it for me if I can \"help mould the new Tournaments\" (wishful thinking).[BR][BR]In my opinion, there are too many changes to the tournament at once to provide an optimal result. Reduction of the encounters, more randomness in enemy troop types, new calculation of province difficulty, new calculation of the tournament squad size and simultaneous training of multiple troops all at the same time will make game balancing a very challenging endeavor. It makes giving feedback challenging too since it is nearly impossible to comment on all changes.[BR][BR]So just the worst change to me: the new Squad size calculation. It is perfectly ok to increase the squad size with research. Taking AW levels into account is overkill, but they even accounted for expansions. This devalues the Ancient Wonders, the expansions and the tournaments all at once. Please remove any influence of AW levels and expansions from the calculation.[BR][BR]Revising this formula will also have an impact on the Spire fighting/bribing, so maybe less hatred towards the Spire too."}, {"32": "Gargon667 said:\t\t\tAnyway I find your idea of playing the game rather pointless, but it is your game, so play it any way you like. I have never understood anyone playing chapters just for the sake of playing chapters like a hamster in a wheel. Also I have never understood anyone outside the Top 10 placing a thrones or any other building for the sake of ranking points. Placing 3 nonsensical buildings and jump from 133 to 97... that is pointless in my eyes.... I do understand a serious attempt to go for first place in the ranking list, after all one can choose this ranking as a measure of success just as well as any other measure, but then one should give it a serious try at least and not fool around with it in the back of the pack. It is a very one-dimensional and simple goal and would not keep my attention long enough to keep at it until then end, so I never even tried and leave it to others who are actually interested in it.\t\tClick to expand...This might have been the worst random number picking ever [smilie--sprite2][BR]Reach the T1000, T500, T100, T50 or T10 are very viable goalposts for many players.[BR]In your example that player just reacht the T100, a milestone many would like to achieve if they could.[BR]If you sayd from 144 to 107 or so that would have made more sense [smilie--sprite2]"}, {"84": "anonglitch said:\t\t\t@Timneh about competing with other servers, what are you exactly refer too? How does the US server play a difference in your gaming experience and competition here?\t\tClick to expand...[BR]I think that has been answered very well above by @Kaliartis [BR][BR][BR]anonglitch said:\t\t\tWe still have more testing time, if other servers don't, that's their business, but they will get a final product whether they like it or not, this is why we want constructive feedback\t\tClick to expand...[BR]How is it the business of other servers if they don't have testing time ? The other servers don't have a choice about if they want to test something in the game or not the same as we did not get a choice here, we just got told the new tourney was getting released on EN servers to test it further.[BR]\"The other servers will get a final product whether they like it or not\" What a disgusting attitude from a moderator, you should be ashamed of yourself."}, {"45": "Ah so @Verde does this now mean you are happy with the version we now have if you wish to ask for no more feedback? Or are you just unhappy that we are still collating as much as we can get our hands on to make more changes?"}, {"75": "Silmaril said:\t\t\tAh so @Verde does this now mean you are happy with the version we now have if you wish to ask for no more feedback? Or are you just unhappy that we are still collating as much as we can get our hands on to make more changes?\t\tClick to expand...If you read my response carefully you will see that I was asking whether the thread in BETA may no longer be necessary, if, as you say,[BR]\"All changes since are down to the feedback we are gathering from this thread\" i.e. the EN feedback thread."}, {"5": "@Timneh I think what @anonglitch was trying to say here, is that it is our hope to collate enough valuable feedback via you guys, and that feedback would/will speak for the majority, including those that are not currently involved with this testing."}]