[{"74": "Silmaril said:\t\t\tAh so @Verde does this now mean you are happy with the version we now have if you wish to ask for no more feedback? Or are you just unhappy that we are still collating as much as we can get our hands on to make more changes?\t\tClick to expand...No there are two major issues that need addressing and please can you reply.[BR][BR]#1 Upgrading AWs makes the Tournament harder which means if it's an unproductive Wonder (eg BTG) there is no point upgrading it. Which means we have nothing to do. Something needs to be done about this. An ability to Teleport Wonders would help with this so they don't count, even if it meant the Wonder perhaps had a cooldown before it was placed back again to prevent exploits. [BR][BR]#2 the difficult ratios (100% Vs 220% for instance) in battles makes battling almost impossible later on not just expensive. A cap on the ratio of enemies to our squads would make it more reasonable. [BR][BR]Please can you reply if there's any intention to address either of these issues?"}, {"73": "herodite said:@Timneh I think what @anonglitch was trying to say here, is that it is our hope to collate enough valuable feedback via you guys, and that feedback would/will speak for the majority, including those that are not currently involved with this testing.\t\tClick to expand...Hi. [BR]en is as much a live server as others. And we didn’t sign up for testing. [BR]probably, mostof the anger is cuz testing is forced down on us : Guinea pigs, as Kaliartis mentioned."}, {"26": "herodite said:\t\t\t@Timneh I think what @anonglitch was trying to say here, is that it is our hope to collate enough valuable feedback via you guys, and that feedback would/will speak for the majority, including those that are not currently involved with this testing.\t\tClick to expand...Then could you please explain why this \"valuable\" feedback has been ignored for five weeks on beta and for three more weeks now on live? Why Inno keeps releasing cosmetic changes, but can't do as much as even admitting that there can be issues with the multiplicative formula? It would help big time if there would at least be some explanation for what you are doing. Are you planning to add exponential increase of all production in the next chapters (and you are having fun for the next half a year watching players struggling and leaving because you've increased requirements before the production), or you don't care for the players who spent years investing time and money in your game and  you are focusing on the new players from now on, or you simply forgot to test your formula on edge cases and now ignoring the consequences? Any confirmation of the problem or explanation why the devs don't think that it's a problem would help, because for the past two months it feels like most of the feedback is simply ignored."}, {"118": "Gargon667 said:\t\t\tWell there is the fact that 19 chests were never intended to be (as per official announcement) finished at all right away, much less every week. So if you could do it without loosing resources, the new tourney would be broken and would have to be made much more difficult.[BR][BR]btw Kudos to you guys for pulling it off!\t\tClick to expand...[BR]Thank you @Gargon667, we are very proud of what we have achieved so far, but several of us sacrifice a lot each week for the sake of testing... Me especially, my AW lvls count is 491... so you imagine that it becomes real fast a real massacre for me..."}, {"15": "Errandil said:\t\t\tAre you planning to add exponential increase of all production in the next chapters\t\tClick to expand...Going by the event buildings upgrades for chapter 17 that were accidentally released on Beta, I don't think so. The seeds production in the savoury food market went from 4100 to 4200. It's the same tendency we we've had since chapter 15."}, {"84": "herodite said:\t\t\t@Timneh I think what @anonglitch was trying to say here, is that it is our hope to collate enough valuable feedback via you guys, and that feedback would/will speak for the majority, including those that are not currently involved with this testing.\t\tClick to expand...[BR]Do you really think that ? No matter how i look at it i can not see how he could mean that from the way he worded it. It sounded to me like he was saying all other servers will have to like it or lump it when they get this new mess of a tournament. Perhaps he needs to work on his English skills."}, {"8": "Timneh said:\t\t\t\"The other servers will get a final product whether they like it or not\" What a disgusting attitude from a moderator, you should be ashamed of yourself.\t\tClick to expand...[BR]I think @anonglitch is correct in what he said. Once we've finished being guinea pigs here, the other servers are going to get the final version of the tournament whether they like it or not, but I seriously doubt he meant to come across as having a bad attitude towards anyone.[BR][BR]At the end of the day, we're all going to have to like it or lump it (we used to have that for dinner....lol), once they've decided on the final version."}, {"65": "randblade said:\t\t\tNo there are two major issues that need addressing and please can you reply.[BR][BR]#1 Upgrading AWs makes the Tournament harder which means if it's an unproductive Wonder (eg BTG) there is no point upgrading it. Which means we have nothing to do. Something needs to be done about this. An ability to Teleport Wonders would help with this so they don't count, even if it meant the Wonder perhaps had a cooldown before it was placed back again to prevent exploits.\t\tClick to expand...it seems to me, the biggest problem is with harmful AW levels, it's just not honest behaviour punish top-level players for all that work with them.  that was done for better performance, but now many wonders are just sneaky traps"}, {"30": "RainbowElvira said:\t\t\tPersonally, I do not mind testing the new tournament, but I can understand those that do. I'm losing approximately half of the tournament rewards during that test phase compared to someone on a different server. It's worth it for me if I can \"help mould the new Tournaments\" (wishful thinking).[BR][BR]In my opinion, there are too many changes to the tournament at once to provide an optimal result. Reduction of the encounters, more randomness in enemy troop types, new calculation of province difficulty, new calculation of the tournament squad size and simultaneous training of multiple troops all at the same time will make game balancing a very challenging endeavor. It makes giving feedback challenging too since it is nearly impossible to comment on all changes.[BR][BR]So just the worst change to me: the new Squad size calculation. It is perfectly ok to increase the squad size with research. Taking AW levels into account is overkill, but they even accounted for expansions. This devalues the Ancient Wonders, the expansions and the tournaments all at once. Please remove any influence of AW levels and expansions from the calculation.[BR][BR]Revising this formula will also have an impact on the Spire fighting/bribing, so maybe less hatred towards the Spire too.\t\tClick to expand...I agree with @RainbowElvira that creating a direct relationship between Encounter Squad size and AW & Expansions is a bad design idea. Space is the biggest asset in this game and it is already a challenging decision to figure out what AW to make us of and what is the best use of an expansion which a player has earned.[BR][BR]I am fine with the idea of making the tournament provinces more difficult as a player move down the provinces. I like the idea of making it easy for players in early chapters to get to 1000 points enabling them to enjoy the tournament and making them contribute well for the tournament achievements of a fellowship. But for that, why do you want to make this Encounter Squad Size calculation an overwhelming formula? You could have easily achieved this by using a simple formula associate with the research level (which is a clear indication of a player level) and some percentage of the squad size (which is a clear indication of the number of troops a player can produce) so that players will still consider researching the optional squad sizes depending on their playing style."}, {"63": "Sure, I can read statistics other players are collating, yet it becomes so repetitive. Things I have been reading looks like some will give you whatever it takes to be up in the top 100 weekly tournament charts. I doubt that even my gameplay would count for the majority yet there are still problems. In my Arendyll game, I will not give you the catering costs that are being asked for when I get defeated 3 times on a single battle. This week in means I capped out around province 20. I still put in a score that was quite high for me, by coming back and doing more rounds of the tournament than I normally would. Yet there were some battles in round 5 where I had no choice than to leave the 6KP unclaimed, again to the catering cost is too high for me. My game on Felyndral was also able to do the first 20 or 21 provinces in round 1, so I now have to pause the progress of that game until we get the completed product. Like I might as well turn it into a diamond mine with the wishing wells in my inventory as it is looking like there are no longer incentives to progress. I have to wonder why your computer simulations didn't detect these sort of issues. New players more than having some early success need to see things (players) that they can aspire too."}, {"99": "Interestingly; Scrolls was the easiest tournament, so far, from a resource and troops loss point-of-view.[BR][BR]What still has not been addressed is the effect that AWs have on the formula. [BR][BR]Eveyone understands that  chapter progression should have an effect.[BR][BR]No one understands why AWs have such a crippling effect.[BR][BR]If you must include AWs at all in the formula include just the military ones. Remove all AWs that don't directly impact tournaments. If this isn't done it devalues all AWs to the point where they may as well not be placed. By \"direct impact\" I mean those that provide an attack or health buff. Those that simply provide extra troops should also have an effect but that effect should be smaller.[BR][BR]Here's a novel idea: if one of the goals was to make the top 10 or top 100 more diverse why not create a formula that uses the average of a player's last 9 tournament scores to determine the difficulty of the new tournament for that player? Then you can remove AWs and chapter progression from the formula altogether. What better way to determine tournament strength than historic tournament scores? That would be a fairer indicator and would stop runaway scores every single week. Thoughts?"}, {"65": "Silent Tempest said:\t\t\tHere's a novel idea: if one of the goals was to make the top 10 or top 100 more diverse why not create a formula that uses the average of a player's last 9 tournament scores to determine the difficulty of the new tournament for that player? Then you can remove AWs and chapter progression from the formula altogether. What better way to determine tournament strength than historic tournament scores? That would be a fairer indicator and would stop runaway scores every single week. Thoughts?\t\tClick to expand...I don't get it. then we just punish the best players and give the advantages to the lazy ones? not a good idea at all, rather crazy in my mind.[BR][BR]then why not remove the winner of the tournament every time from the game [smilie--sprite8]"}, {"22": "This is all about Inno's capitalism. Nothing is by accident or without forethought. Whether or not they are right in the assumptions they are making remains to be seen, but it all comes down to a single goal of increasing revenue. They believe they are taking the best possible route to achieving this.[BR][BR]Step 1 - Put mechanisms in place to greatly inflate the rewards people can receive from tournaments (i.e. Fire Phoenix, Brown Bear, freely available combat buildings). Let this run for a year or more. This is the seed planted.[BR][BR]Step 2 - Take the extra rewards in step 1 away again, only from the people that received them in the first place. This can't be done, of course, in such a crude way as by removing all the bears and phoenixes. So we have a new tournament calculation that has the same effect. As someone who has played the last three tournament weeks steadfastly only playing within the confines of what is sustainable I can tell you that my tournament average is frighteningly similar to how it was before those buildings existed. This isn't an accident.[BR][BR]The idea with the above is that you have a big group of established players who are all used to getting a certain reward. The plan here is to make these people do all they can to achieve what they have done for the past year, first by burning through accrued resources and then by spending money.[BR][BR]Step 3 - Put another mechanism in place to greatly inflate the rewards given to newer players and those who otherwise did not see the bonuses from step one. This is wrapped up in the same process as above by designing the new tournament calculation to make it now incredibly easy for these people to score comparatively vastly more than they did previously. This is a new seed planted to bring the next base of players into a situation where they're earning much bigger rewards than they did before.[BR][BR]Step 4 - Take the extra rewards from step 3 away from the new group of players. This happens when they eventually hit the progression wall and the hope is that these people now start spending all the diamonds in order to keep up with the progression curve they have been used to.[BR][BR]So the last two steps are exactly the same as the first two. To make it simpler they could have just taken all the bears, phoenixes and combat buildings away from group A and just given them to group B, ready to repeat that process again in another year's time, but of course they don't want to be that transparent.[BR][BR]Inno will be 100% led by what increases their revenue the most. Asking for our feedback has very little consequence other than, perhaps, for a little fine tuning and getting the information back on how it is working. The only way that any of this will ever change is if their plan doesn't work and they don't make more money, or if the money they are making reduces. [BR][BR]As a small group of forum users we probably can't have much, or any, impact on this. If people start to spend less money than before then they may want to change their plan, wholesale. If there is no tangible effect on revenue then they may start to be more receptive to players' thoughts and ideas. What we don't know, however, is how the 99% of players who never visit these forums are reacting. It's quite likely that they're all burning through their resources and then starting to throw more in-game purchases in, here and there, in order to maintain their previous levels, unaware of the futility of that. Perhaps they believe that the increased difficulty is a short term anomaly. I, for one, will just continue to play within the confines of what they are offering. If I choose to spend any money it won't be because of tournament rewards reducing.[BR][BR]As a final thought, I would be interested to know whether the group of players who are affected by steps 3 and 4 above have now been given an increased likelihood of receiving combat buildings to craft. I wouldn't be surprised at all, but we will probably never figure it out for sure."}, {"24": "Silent Tempest said:\t\t\tHere's a novel idea: if one of the goals was to make the top 10 or top 100 more diverse why not create a formula that uses the average of a player's last 9 tournament scores to determine the difficulty of the new tournament for that player? Then you can remove AWs and chapter progression from the formula altogether. What better way to determine tournament strength than historic tournament scores? That would be a fairer indicator and would stop runaway scores every single week. Thoughts?\t\tClick to expand...[BR]Very interesting idea![BR][BR]kurgkurg said:\t\t\tI don't get it. then we just punish the best players and give the advantages to the lazy ones? not a good idea at all, rather crazy in my mind.[BR][BR]then why not remove the winner of the tournament every time from the game [smilie--sprite8]Click to expand...[BR]And I think this might be the main concern with above idea...[BR][BR]To be honest i agree with both [smilie--sprite8] I would say it is an interesting idea, but having it be the only determining factor would probably lead to a lot of unwanted consequences, like people playing every 4th or 5th tourney for example, which is not a good thing for FS trying to maintain a good tourney average.[BR]But I could see it work in concert with other factors... Maybe it could reduce rewards but not increase difficulty? certainly an idea worth thinking about, but not an easy one to balance."}, {"45": "Guys all of our feedback is being listened to, the attached Announcement that this discussion links to shows the original version, the changes made before we had it here and this weeks update (1.112) has further changes for lowering difficulty levels in Provinces 10-21. As well as display changes to improve the speed of play.[BR]Please remember that it is not just the flip of a switch to make changes; each one has to have programme/s created. Then the whole game balance has to be taken into consideration, as you can see the Tournament changes are affecting other aspects of the game from our announcements and release notes. From then extensive testing, before even thinking whether it will get to the actual game.[BR]Hence the team is taking its time, seeing how our players are reacting, listening to the detailled feedback we are getting and working from there.[BR]Please do not forget we are all players here, passionate about the game....."}, {"24": "@Pauly7 very interesting summary![BR][BR]The only thing I see speaking against it is the so often blatantly obvious LACK of long term planning in Inno. I agree that facts match your outline quite nicely, but honestly I would put it down to random decisions and reactions to previous errors, rather than a planned approach from start to end."}, {"53": "The introductory video to the new tournament (as linked to from the EN forum announcement) describes improving the difficulty formula as one of its four goals, and explicitly states that the benefits of city progression should always exceed any related difficulty increase (something which wasn't always true of the old squad size formula). I think that this  aim is fully consistent with the overwhelming view expressed in posts in this forum - it is just that we feel that the new formula doesn't reflect it (and indeed that the reverse is frequently true).[BR][BR]Another natural aim of the difficulty formula (although one which isn't explicitly expressed) is to provide a fair challenge to all players, from those just starting through to hardcore veterans. A generic formula of this kind would have applications not just in the Tournament and Spire, but potentially in other places too (e.g. customising the difficulty of event quests). It seems to me however that it is (at best) extremely difficult to fully reconcile this aim with the one above though.[BR][BR]One compromise might be the following:[BR][BR](1) Use the new difficulty formula (or an improved version of it) for challenges which are expected to be widely achievable by the player-base (e.g. for the first 10 tournament provinces)[BR][BR](2) Use a different and simpler difficulty formula (and one which explicitly favours progression) for the harder challenges, and those which involve more direct competition between players (e.g. tournament provinces from 20 onwards). [BR][BR](3) Use a tapered version of the two formulae for intervening challenges (e.g. provinces 10 to 20) so that less advanced players don't abruptly hit a brick wall."}, {"24": "CrazyWizard said:\t\t\tThis might have been the worst random number picking ever [smilie--sprite2][BR]Reach the T1000, T500, T100, T50 or T10 are very viable goalposts for many players.[BR]In your example that player just reacht the T100, a milestone many would like to achieve if they could.[BR]If you sayd from 144 to 107 or so that would have made more sense [smilie--sprite2]Click to expand...Sure if you prefer... As I said i don´t have the ranking gene, it´s all the same to me... I could see how the Top 10 could be exciting or maybe the Top 50 in the App (since they are always shown first). But other than that all ranking shows is how much useless junk you have in your city lol... At least I always feel worse the higher I get... And with the new tourney it nearly becomes a predictor of who is going down in tourney scores..."}, {"99": "kurgkurg said:\t\t\tI don't get it. then we just punish the best players and give the advantages to the lazy ones? not a good idea at all, rather crazy in my mind.[BR][BR]then why not remove the winner of the tournament every time from the game [smilie--sprite8]Click to expand...[BR]Well, yes and no. Lazy people will generally continue to be lazy. They'll do their minimum requirements every week, so over a 9-week period will have similar scores, thus will more-or-less be up against the same kinda difficulty every week. A lazy person isn't gonna think, \"Ooh, my 5 provinces this last couple of weeks have been really easily. LET'S DO 70 PROVINCES!\" Never gonna happen.[BR][BR]The people who want to go far in the tournament one week will likely be the same people that want to go far the following week. Some maintain a general scores, whilst other people's scores bounce all over the place to accommodate for resource/troop losses or whatever. If you link tournament difficulty to tournament scores it would increase competitiveness in the top 10 or top 20 or whatever, as people would have to adjust their number-of-provinces strategy. It'll also prevent people from doing insane things like 60/70 provinces every week, as those that do would be heavily penalised long-term, which applies a self-imposed ceiling to reward/KP farming.[BR][BR]The other thing to consider is that the people that should get penalised in tourneys are tourney players. It sounds a bit backwards but allow me to explain. Penalising someone heavily in tournaments for having loads of expansions, either bought or scouted or researched; or loads of AW levels, most of which have little effect on doing well in tournaments; or advanced chapter progress, as beyond a certain point research stops being useful in tournaments, is completely non-sensical. The current changes penalise irrespective of tournament love.[BR][BR]A lot of players aren't gonna be tournament enthusiasts, so they're gonna commit what they have to and then stop. That doesn't necessarily make them lazy. With the current changes those people are now gonna become even less enthused to complete their tournament requirements. However, if you link tournament scores to tournament difficulty those non-enthused people will reach a nice plateau and will continue being nonchalant about tournaments. Again, just because it may become slightly easier for them they aren't suddenly gonna do 70 provinces just cuz.[BR][BR]This resolves the issue of annoying everyone; which is an interesting, albeit baffling, business strategy. It stops people from having to delete AWs or limiting AW levelling, stops them from not purchasing that next expansion and stops them from stagnating in the research tree. At the same time tourney players are faced with an actual challenge based on strategy and trade offs. And it turns off or at least slows the flow of \"unreasonable\" reward farming. Everyone wins."}, {"63": "Silent Tempest said:\t\t\tWell, yes and no. Lazy people will generally continue to be lazy.\t\tClick to expand...[BR]Sometimes the people we accuse of being lazy are just short of time. I really think they just need to create the formula that the brief stipulated. When you see people that have always been short of playing time coming in and instead of 20 battles for 5 provinces that are now able to take down 13 or 14 provinces in the same time they had previously been spending. Clearly they have given us the 9 extra bonus chests it would be foolish to create a system where players that have spent the time playing to have 60+ provinces available each week and yet cause them to stop at 20 provinces due to the unsustainable amount of troops and or goods. I may have done 59 provinces with 49 to round two and the first 10 to wherever they landed. Still to have any chance of opening all 19 chests for the 160,000 or so points we need all fellows doing the maximum of there games limits. Earlier I said nothing of the 50 odd 5 hour timers replenishing troop losses."}]