[{"25": "Silmaril said:@Verde Changes from the Beta feedback were made prior to reaching our server.[BR]All changes since are down to the feedback we are gathering from this thread.\t\tClick to expand...I'm in Beta and quite honestly I don't understand this.  At this moment there are 77 pages in the Beta thread, 1538 replies and 95,834 views.  These have included mathematical formulas, graphs, examples, and all forms of intelligent arguments. A miniscule adjustment, which was barely noticeable, along with the capability to train in all three buildings at once were gained from this.  I have finished Chapter 16 and get slammed into a wall in the tournament.  I am training troops in three buildings to send on suicide missions.[BR][BR]What is the reason for bringing this mayhem here?[BR]a)  The Beta testers, many of whom I've seen for the first time ever in the forums, don't know what they're talking about?[BR]b)  Over 1500 replies, suggestions, and examples are not quite enough to draw a conclusion?[BR]c)  The Beta testers can't seem to provide \"valuable feedback\" that would speak for the majority?[BR][BR]None of this makes a lot of sense to me.  The bottom line is that there was a need to curtail the rewards that top players could receive, and to cut down on the repetitive clicking, both understandable.  I don't believe anyone asked for this, and I'm not sure it's going to have a different outcome in the Forum here.  I'm pretty much seeing the same thing.  [BR][BR]The thought of advancing into Chapter 17 is just downright frightening if this continues.  I can't imagine going into a big new chapter with no goods from trying to cater. and no troops, no new expansions, less AW's ..."}, {"33": "Maillie said:\t\t\tI have finished Chapter 16 and get slammed into a wall in the tournament. I am training troops in three buildings to send on suicide missions.\t\tClick to expand...[BR]You seems to do it the wrong way. If opposition is to heavy then cater, don't fight. If you got some experience you will be able to get a feeling when to expect high losses. Next province might be easy as the troop selection is more random than earlier. So this wall doesn't exist. You might have an unwinnable fight in province 20, but in province 30 you might have a fight thats winnable with light losses."}, {"54": "valle said:\t\t\tYou seems to do it the wrong way. If opposition is to heavy then cater, don't fight. If you got some experience you will be able to get a feeling when to expect high losses. Next province might be easy as the troop selection is more random than earlier. So this wall doesn't exist. You might have an unwinnable fight in province 20, but in province 30 you might have a fight thats winnable with light losses.\t\tClick to expand...As Dony pointed out on beta forum recently, there are no unwinnable fights (you just need more boost buildings to win them), there are however uncaterable fights. Those are fights where the costs of catering requires more coins/hammer then your maximum capacity in your storage. While ofcourse very rare now, these can happen, and will happen more often for every chapter they add to the game. That's why we say the base of the formula is wrong."}, {"45": "@Maillie The reasoning was that we needed a larger body of players, spread across the whole game to give feedback rather than on just the test server. Allowing this to be here is has opened the discussion far wider and was explained as part of our announcement that this thread links to."}, {"2": "Silmaril said:@Maillie The reasoning was that we needed a larger body of players, spread across the whole game to give feedback rather than on just the test server. Allowing this to be here is has opened the discussion far wider and was explained as part of our announcement that this thread links to.\t\tClick to expand...I understand your point of view Silmaril but We Did Not Signed Up To Be Testers, try to understand this. We just lose KPs and other goodies from tournament while we also slaughter lots of troops/ use lots of goods for LESS REWARDS.[BR]Normally would have been either to be asked before (not holding my breath that such thing would ever happen),either to be rewarded in some way or to compensate the huge losses while we are used as guinea piglets without our consent."}, {"45": "We are not really testing this @Alcaro as this is not about to go away, only improve as feedback keeps rolling in.[BR]The programming changes for this are vast, Beta is quite small, so rolling out to a larger server like ours was the logical move to make to check stability etc:"}, {"2": "@Silmaril , no matter how you call it or how you want to be seen, the fact is that we are testing it (even if just for feedback, as you say) and all other servers are not. Other indubitable fact is that the other servers are pushing hard now and get KPs while we can't.[BR][BR]You put me to work, now I want my cookies! [smilie--sprite8]"}, {"118": "Maillie said:\t\t\tI'm in Beta and quite honestly I don't understand this.  At this moment there are 77 pages in the Beta thread, 1538 replies and 95,834 views.  These have included mathematical formulas, graphs, examples, and all forms of intelligent arguments. A miniscule adjustment, which was barely noticeable, along with the capability to train in all three buildings at once were gained from this.  I have finished Chapter 16 and get slammed into a wall in the tournament.  I am training troops in three buildings to send on suicide missions.\t\tClick to expand...[BR]I completely agree with you...[BR][BR]As I already stated before I have 491+ AW levels, however I can't risk to drop any level right now before everything is final... Too much time. resources and effort have been put into this to just push a button and erase...[BR][BR]I have been playing this game for 4 years now, I know all the tournament mechanics, I have reached the top of the server even before all the chickens, bears and troop buildings were introduced... so I know how to win a fight... With my actual city setup though I do get slammed into a wall way harder and sooner than others and I do find it unfair... Any experienced and knowledgeable player should do better than a beginner or an average player which is not really the case right now.[BR][BR]Your formula is a big fail right now...[BR]The main issue here? Linking the difficulty of the tournaments to AWs progress without any exception.. this is just nonsensical.[BR]Obviously it is not convenient for you and your formula to differentiate military AWs to non-military... Well if you want to successfully keep your longtime loyal players into the game, you should go back and revise the formula itself instead of giving us some crumbs here in there thinking that it will appease us."}, {"45": "Lol I need cookies too.....what a fabulous idea, cookies all round!!!"}, {"118": "Silmaril said:\t\t\tLol I need cookies too.....what a fabulous idea, cookies all round!!!\t\tClick to expand...[BR]I don't think you'll make more friends with your cookies  [smilie--sprite2]"}, {"45": "lol as long as they like cookies thats the main thing [smilie--sprite8]"}, {"2": "Kaliartis said:\t\t\tI don't think you'll make more friends with your cookies  [smilie--sprite2]Click to expand...please, do not snap at Silmaril. After all she is a \"liaison officer\", like all other moderators. The culprit isn't in this forum or any forum. The culprit is \"there\" ... far far away and baking other kind of surprises than cookies. [smilie--sprite8]"}, {"99": "@Silmaril Long term, the people that will be most disadvantaged by these changes are the people that don’t have a (fully upgraded) Fire Phoenix and Brown Bear. Yes, I know that you can craft them in the MA during the applicable events but the artifact conversion rate is too expensive.[BR][BR]On a similar note we need more Pet Food and Booster Buildings (UUU, ELR, MMM) in the MA. My MA rate for pet food is extremely precarious. I’m considering building the Moon Bear, which has a much better special effect in the live event compared to the original BETA version (going off ElvenGems), but it’s going to need daily feeding to fully maximise its potential. My MA cannot support that demand currently. The MA rate for booster buildings is even worse and they are one of the only ways to offset the (dreadful) multiplicative nature of the tournament formula.[BR][BR]Being extremely active I’m online for every reset of the recipes and have even used diamonds to reset the recipes. FYI, using diamonds to reset the recipes and still getting garbage is extremely disheartening. Surely there should be a “learning” capability programmed into the MA so that it understand which recipes that player wants. Sure, chuck in an element of randomness but don’t make the stuff I need purposefully scarce.[BR][BR]This isn’t a suggestion, this is feedback on what we need, seeing as “this (change) is not about to go away.” Please and thank you."}, {"2": "@Silent Tempest - I would like to add that beside being scarce (the UUU, MMM, ELR and Pet food), at the level we need them to have a playable tournament, we need lots of CC spells and for them we need relics and for relics we need to do well in tournaments and extremely well in those giving the relics for certain spell and ... and ... and[BR]This was like a circle (not perfect but almost there), the interaction and links between things was nice. Now, that circle is like a square in disguise, has corners, edges and some of them are quite insurmountable."}, {"118": "Alcaro said:\t\t\tplease, do not snap at Silmaril. After all she is a \"liaison officer\", like all other moderators. The culprit isn't in this forum or any forum. The culprit is \"there\" ... far far away and baking other kind of surprises than cookies. [smilie--sprite8]Click to expand...[BR]I didn't snap, I was just joking exactly as she was [smilie--sprite1] The funniest part was that I was talking about crumbs right before! LOL"}, {"2": "Kaliartis said:\t\t\tI didn't snap, I was just joking exactly as she was [smilie--sprite1] The funniest part was that I was talking about crumbs right before! LOL\t\tClick to expand...[BR]\"there's no better place like internet for misjudgment and misunderstandings\" [BR][BR] I apologise for misunderstanding you [smilie--sprite1]"}, {"84": "Silmaril said:\t\t\tWe are not really testing this @Alcaro as this is not about to go away, only improve as feedback keeps rolling in.\t\tClick to expand...[BR]If we are not testing the tournaments why did it say this in the announcement..........  \"We are currently aiming to release the new Tournaments to Elvenar International (EN) on the 18th of August. This will allow us to extend the amount of people playing the new Tournaments greatly, as well as provide technical testing on a larger scale\"."}, {"26": "Silmaril said:\t\t\t@Maillie The reasoning was that we needed a larger body of players, spread across the whole game to give feedback rather than on just the test server. Allowing this to be here is has opened the discussion far wider and was explained as part of our announcement that this thread links to.\t\tClick to expand...So is there any estimation how many more weeks of the feedback that is exactly the same as it was on beta you need to address the core issues with the new formula instead of making cosmetic changes?"}, {"45": "Unfortunately this is something that has yet to be confirmed @Errandil, so we are still just going with the flow and collecting the feedback."}, {"116": "Alcaro said:@Silent Tempest - I would like to add that beside being scarce (the UUU, MMM, ELR and Pet food), at the level we need them to have a playable tournament, we need lots of CC spells and for them we need relics and for relics we need to do well in tournaments and extremely well in those giving the relics for certain spell and ... and ... and[BR]This was like a circle (not perfect but almost there), the interaction and links between things was nice. Now, that circle is like a square in disguise, has corners, edges and some of them are quite insurmountable.\t\tClick to expand...@Alcaro I have more CC spells than I know what to do with.  I've got four moonstone library sets from the Spire, and am going to be taking one or two down because I'm overrun with CC spells.  Complete the Spire every week and that problem will be solved."}]