[{"20": "I think I am going to comment my way.  Ideally this thread should have been 2 threads, one for those who do well in tournaments and knows exactly the mechanisms of everything and another for the rest of us who clearly operate at a separate level.  I am also not of the opinion that a nerfing was needed as I don't play in those ranges where excess of everything is obtained.[BR][BR]I am not interested in the ratio of the delta difference increase between my squad size (SS) and the enemy squad size (ESS).  The important thing for me is that my SS increases linearly and that at tent (my word for province) 8, I start crossing the line of the ESS.  Thereafter it goes sky high. Subsequent rounds are structured such that this crossing comes one tent sooner every time.[BR][BR]I have done a graph with data captured for round 1 in my best city during the scrolls tournament.  I mostly battled (app) and I intentionally catered further to get more data for the graph.  I don't usually cater or overproduce troops as I like to play a sustainable game.[BR][BR][IMG]https://i.ibb.co/DwsFxSx/https-en-forum-elvenar-com-index-php-attachments-1599526544509-png-4770.png[/IMG][BR][BR]Under the old system, to get to 10 chests, the players in a full house fs, would have needed to do 8 tents for 5 rounds.  Most players only get 5 rounds in and some only 4.[BR][BR]Roundtentspoints per tenttotalcumulative total183024024028362885283842336864484838412485854432168068604802160[BR]Fighting wise, it becomes in many cases impossible to win once you cross the line in the new system. (Not everybody has all the boosters that the top players use).  Assuming that you stop at the equilibrium point, this is the result you will get.[BR][BR]Roundtentspoints per tenttotalcumulative total18302402402736252492364225274445482409845454216120063601801380[BR]A player playing 5 rounds will only be able to do 1200.  I don't know if the intention of the new system is to help fellowships achieve the 10th chest, because if so, then the equilibrium point is too soon.  The crossing point at tent 8 should only be in round 4 and not round 1.[BR][BR]In general, this new system impacts my cities negatively, like in struggling to score a 1000 where previously 1600 was not too difficult. Some I will have to forget about fighting, as 3 star enemies can just not be beaten.[BR][BR][IMG]https://i.ibb.co/THR5BQt/https-en-forum-elvenar-com-index-php-attachments-scrolls-jpg-4771.jpg[/IMG][BR][BR]My way of looking at the enemy troops and a summary of what I got.  The colour code is the same as what is used on the badges.  Some of those combinations are just mean and not easy to win on app.  Less variaty please."}, {"53": "Silmaril said:\t\t\tUnfortunately this is something that has yet to be confirmed @Errandil, so we are still just goinig with the flow and collecting the feedback.\t\tClick to expand...[BR]Thanks for this. [BR][BR]If you are able to get anything more specific from the devs (who I appreciate must be under some pressure right now) then this would help ensure that future player feedback and suggestions are targeted in the right areas. Alternatively, if they have enough feedback for now, and have identified issues which they are starting to address, then that would be good to know too."}, {"1": "Thank you all indeed. And yes, the devs are both working hard, and they appreciate the feedback. All the time you all are investing in making those graphics, numbers, and calculations [smilie--sprite1] In the end, problems or no problems, complains, or no complaints, bonuses, or no bonuses, our Elvenar International community is to be an example. [BR][BR]As always, we will keep you guys updated through both some posts here, plus our official announcements [smilie--sprite1]"}, {"15": "Has anything been changed for this week's tournament? I think we have the same thing since it started on this server so I'm not quite sure what we are testing if nothing is being improved. I have stopped upgrading my AWs, I'm not placing expansions and I'm not unlocking techs because I want to able to better compare the tournament and the possible changes but it's getting kind of boring and also useless if nothing is actually being changed."}, {"22": "I assumed that the three training queues would be implemented today, but no word about that. It did make things a bit buggy for a bit on beta, but seems to be cleared up now.[BR][BR]I think if anything is likely to change in the tournaments it will change on beta first... so it's still getting a first round of testing before making its way over here.[BR][BR]I don't mind the process being drawn out, but it would be nice @anonglitch @herodite @Silmaril if we were getting some updates on what the devs are considering or working on. I know it must be something or we'd be done already. At the very beginning of testing, on beta, there seemed to be fairly regular messages coming back saying \"we're looking at reducing the impact of expansions\" or \"we're looking at the number of orcs in catering\", but for several weeks it's been very quiet now, on both servers."}, {"15": "Pauly7 said:\t\t\tI think if anything is likely to change in the tournaments it will change on beta first... so it's still getting a first round of testing before making its way over here.\t\tClick to expand...Possibly but there is no announcement there either. People have been arguing about the word \"exponential\" for the last 10 pages because there's nothing else going on on that subject."}, {"45": "@Pauly7 Sorry for the delay, just got in! The plan would be for these to be added as a part of an version update. Which will be next week hopefully as I can't wait for this!"}, {"74": "Silmaril said:@Pauly7 Sorry for the delay, just got in! The plan would be for these to be added as a part of an version update. Which will be next week hopefully as I can't wait for this!\t\tClick to expand...Thanks. Are you able to confirm that it will be next week or is that just a guess?"}, {"4": "I would like to see the bias for tournament type increased. After 4 tournaments the randomness is too random and I see no bias towards a particular type at all with fighting, but some bias in catering. Some round 1 fights cause a defeat where there are only 2 enemy troop types and I use 4 of one and 1 of another to match. The defeats show the enemy as 3+ untouched squads. This cannot be right. The same set up and fight in round 3 gets a win. Both matches were around province 13-14.[BR][BR]Also why should I be penalised so much for investing huge effort and years into building and upgrading 26 of 30 AW's?[BR]And getting all research expansions placed and premium ones up to the cost of 5000 diamonds. This just does not seem fair at all. [smilie--sprite3][BR][BR]Also I do admire all you guys providing the stats, that is dedication and must take hours to compile. [smilie--sprite1]"}, {"122": "I sure hope we get the  three training queues  very soon  as we just cant keep up this testing without troops and being able to train in all 3  would help [BR]I have cut the amount of Prov down to 10 as this new tournament system is costing far to much in troops  and training from just 1 queue you just cant recover the lose of troops if you start going deep ...[BR]I must admit just doing 10 prov is soooo boring as am used to doing alot more"}, {"63": "I etched out 42 provinces in round one this week, many were manual so I feel for anyone trying to work with an App device. Still, province 42 cost me 12 hours training time for the number of Blossom Princess lost in that one battle. Using one each of Dwarven Armorer, UUU, MM, and ELR. In round two manual battles only from province 17 for me. Independent training facilities are unlikely to be a solution for the problem as the specialist units are of greater need for my level. Even the small city cannot achieve a full round on every available province, maybe this was your intimate plan and this board is just a gripe board for us rather than something to help. I have no illusions that the changes are getting positive reviews for players with under 12months experience. The question exists in my mind at least of how long? Will it be before we see people pausing the big cities to focus on low-level games and instead of new players getting into the high scores table it will be experienced players optimising small cities to again dominate the weekly tournament. Another point not that long ago the skill to do battle to the top of the Spire was challenging, now the Spire is a walk in the park, by comparison, again maybe this was your plan. Figure this will be my last contribution to this thread."}, {"45": "randblade said:\t\t\tThanks. Are you able to confirm that it will be next week or is that just a guess?\t\tClick to expand...An educated guess atm."}, {"84": "Almost 4 full weeks into this new system and there is no way i can keep up with the demand for troops to do the same amount as i used to do in tourneys. If nothing is changed i will have to start picking which weeks to do tourney."}, {"20": "I am not so sure three training queues are going to solve the problem of most players. Sure, it will increase numbers, but those numbers may not be on the troops you actually want to use.  Then, there is also the question of the ability of your troops.  It will not make your troops stronger, nor upgrade them a star level. Unless you are already at the research level of having 3 star troops in all categories, I don’t see the win win situation for all.  Definitely not in most of my cities. It will be same old and just some value during events where number of troops collected plays a role."}, {"1": "Thanks for sharing @BlueBlou all your numbers, and other posts from you and everybody else. Please remember that the changes are not yet final, so while it has been four weeks, different changes arrived. Maybe they are not the ideal yet, hence the reason for extending the testing time. As many of you said, the tournament is a big foundation of the game, this is why we are taking more time and dedication until changes are final."}, {"35": "I think things may have gone the wrong way, just a little bit![BR][BR]I don't mind a challenge, but my 3,123 squad size vs. the enemy's 104,622 squad size seems like it'd be rather hard to win!  [smilie--sprite9][BR][BR][IMG]https://i.ibb.co/Np981GM/https-i-ibb-co-XVZTL4-Q-tourney-11-SEP-2020-WTF-png.png[/IMG]"}, {"28": "Paladestar said:\t\t\tI think things may have gone the wrong way, just a little bit![BR][BR]I don't mind a challenge, but my 3,123 squad size vs. the enemy's 104,622 squad size seems like it'd be rather hard to win! [smilie--sprite9]Click to expand...You just need a few expiring boosters, that's all. /s"}, {"35": "It's done it on two more provinces so far, first above was on 45, then 57 and now 66!  Annoying!"}, {"25": "BlueBlou said:\t\t\tI am not so sure three training queues are going to solve the problem of most players.\t\tClick to expand...I can't expound on any smaller chapter cities.  My only city in Beta is in Chapter 16 and is neither my biggest nor my most developed city, but the main thing I'm experiencing is that it is certainly not fun to have to reload three buildings with troops to send to slaughter every time I log in.  They are not free. [BR][BR]Two of us in my fellowship ran completely out of Orcs, which we both found astonishing considering the plethora of them that we started with when this came out several weeks ago in Beta.  Having three buildings going at once was actually fun ... at first.  It might be quite helpful ... at first. [BR][BR]What might be most beneficial would be a lowering of cost for the troops.  I am actually digging into the vault of Supply Instants to keep this going, and without diamond expansions there is a limit to the number of massive Chapter 16 buildings that can be added, when each requires so much space, pop, culture, etc., to build.[BR][BR]Perhaps we shouldn't have to pay full price for troops that can't get nearly as far."}, {"54": "what bugs me most, is that everyone who isn't end tech now, and is still growing, well they can be almost unbeatable later on when they reach end tech, if they just stop placing expansions now. Ofcourse it might slow you down a bit on getting end tech (although does it really with all the PP?) but it's a benefit that others cant undo. Basically its the optional squadsize problem all over again, only worse now."}]