[{"4": "Heymrdiedier said:\t\t\twhat bugs me most, is that everyone who isn't end tech now, and is still growing, well they can be almost unbeatable later on when they reach end tech, if they just stop placing expansions now. Ofcourse it might slow you down a bit on getting end tech (although does it really with all the PP?) but it's a benefit that others cant undo. Basically its the optional squadsize problem all over again, only worse now.\t\tClick to expand...[BR]Take expansions out of the equation, it is just unfair. Also anyone who reads this will no longer buy premium expansions.[BR][BR]Also AW levels, including them all is wrong in my opinion also. I have worked hard on my city and have 26/30 AW's leveled between 6 and 18 so far.[BR]Maybe include AW's that produce free troops but not all of them.[BR]Surely there is a fairer way to ascertain the difficulty.[BR][BR]I used to really love the weekly tournaments, the preparation, the fighting, the rewards. [BR]2 of those 3 have gone now from my game leaving a huge hole, every week is the same randomness, and it has become a chore, not a joyful online experience any more. [smilie--sprite3]"}, {"15": "m4rt1n said:\t\t\tevery week is the same randomness,\t\tClick to expand...I do see that there is a primary type of unite every week but that accounts for maybe 50% of the fights, the rest is too random. Impossible to determine a secondary type of unite. Sometimes after doing a round I think I've pinpointed the secondary troops and I train more of those for the next round but nope, it asks me for completely different troops. It's very annoying and no fun for me. And also not sustainable. I can't train all the troops all the time. Even in the old system I could train just enough primary and secondary troops for each tournament.[BR][BR]I have noticed another thing. I always auto-fight and I try to avoid mixing unites as much as possible. However in the old system when I did use 2 types of troops I was rather good at it and had very successful fights. Now if I try to use more than 1 type of unites I get obliterated every time! I usually do win but with something like 80-90% losses. It's terrible. With the randomness of troops it's often hard to use just 1 type of units. It's just another thing that takes away the fun form the tournaments for me: it's either 1 type of unites or cater, no in between. [BR][BR]@anonglitch @Silmaril Is there any chance the devs are looking into this too, reducing the randomness, preferably bringing back the old unite distribution by tournament type. It's already hard enough with the huge SS and the difficulty that goes up with provinces and rounds very fast, we could use without this extra layer of pain."}, {"25": "Heymrdiedier said:\t\t\twhat bugs me most, is that everyone who isn't end tech now, and is still growing, well they can be almost unbeatable later on when they reach end tech, if they just stop placing expansions now.\t\tClick to expand...I have to disagree with this.  My Winyandor city has 138 expansions, the Beta city has 121, and they have both finished chapter 16. In your analogy  that would make my Beta city tournament easy. This is definitely not true."}, {"27": "Maillie said:\t\t\tI have to disagree with this.  My Winyandor city has 138 expansions, the Beta city has 121, and they have both finished chapter 16. In your analogy  that would make my Beta city tournament easy. This is definitely not true.\t\tClick to expand...Isn’t the difference in number of expansions more than compensated by a difference in wonder levels? Just guessing."}, {"1": "@Hekata thanks a lot for bringing it up. As per past updates, the developers are working more on giving each tournament \"their personality back\". This does not mean it will be like before. There will be still a mixture of units every week, however, they will bend a little bit towards the typical units from that specific tournament type (marble, dust, etc).[BR][BR]So, as per a former announcement, we are indeed taking this into consideration, and the devs are already working on this (another reason for the extension of the tournament.)"}, {"15": "Thanks for the answer @anonglitch. I hope for the next tournament we will get both the 3 separate queues and some further \"bending\" towards 2 types of troops. It doesn't have to be the exact same troops we had for each tournament before but I'd really like to know witch  2 troops I need to train more of every tournament. The way it now for me is both unsustainable and, as others have pointed out, we loose the fun of the preparation for the next tourney. [BR]And another thing related to this is that it's hard to know when to use the MMM and ELR builings. The only useful ones are UUUs now but they are so rare. Can we get more of those? Maybe the devs can adjust the chances of us getting them in crafting."}, {"89": "m4rt1n said:\t\t\tTake expansions out of the equation, it is just unfair. Also anyone who reads this will no longer buy premium expansions.[BR][BR]Also AW levels, including them all is wrong in my opinion also. [...]\t\tClick to expand...[BR]Still THIS is the biggest issue of all in my eyes.[BR][BR]I stopped exchanging KP with my FS as tourneys are hard enough right now. I'm HARDLY discouraged by buying even a single premium expansion - even if they would gift it to me. Progressing is no fun anymore, as progressing in terms of expansions and AWs is connected to some malus. I don't mind the research-progress one, as you have to define the lvl and amount of enemies you're facing somehow, incl. the needed base-squad size. Anything else should help me to get better along, not make things harder. And they can repeat \"iTs StIlL UsEfUlL tO ImPrOvE yOr StUfF\" (*include spongebob meme here*) as often as they like, still the formula provides the evidence that there is one point this isn't true anymore.[BR][BR]At this time, i'm only waiting for the final outcome of all of this. If they don't change how those things work at its base (only changing 0,0001% factor here and there and \"fixing\" problems that wouldn't exist without that insane formula) i'll quit that game, as it's hardly discouraging a casual approach at the game, as you have to limit yourself in terms of building AWs and expansions to have a half way fun experience at tourneys.[BR][BR]I like to optimize the hell out of everything, but i did buy some expansions for \"fun\" - to at least place down some nice looking buildings or to add some other \"not that useful\" buildings (incl. AWs like bell-towers or lighthouse) . Plus i want to have some spare-space for FAs to help out my FS there. Now i'm punished for my \"fun\" part that i even paid €€€ for.[BR][BR]This whole game develops to a sink for everything you produce, while also punishing you for advancement in ANY way. It's simply no (casual) fun (for me) anymore."}, {"65": "for me, the expansions in this formula have been the only understandable and sensible component - in this game, after all, it has been important to manage effectively on less space, and who can, that is the best. Whether it is reasonable for the developer, that is not my concern, although, indeed, you need now think twice about whether to buy premium expansions. there must be a very important added value to be placed there. Anyway, you can always make better use of your space.[BR][BR]But AW levels in the formula are pure deception, they're not wonders anymore, but traps and they can't be undone or better used. I hope, they understand and change it. if not I'm very disappointed[BR][BR]the Tech tree in formula only shows bad game planning from developers - with one hand you give development and with the other hand, you take some of it down."}, {"32": "kurgkurg said:\t\t\tfor me, the expansions in this formula have been the only understandable and sensible component - in this game, after all, it has been important to manage effectively on less space, and who can, that is the best. Whether it is reasonable for the developer, that is not my concern, although, indeed, you need now think twice about whether to buy premium expansions. there must be a very important added value to be placed there. Anyway, you can always make better use of your space.[BR][BR]But AW levels in the formula are pure deception, they're not wonders anymore, but traps and they can't be undone or better used. I hope, they understand and change it. if not I'm very disappointed[BR][BR]the Tech tree in formula only shows bad game planning from developers - with one hand you give development and with the other hand, you take some of it down.\t\tClick to expand...[BR]Or worse take more of it down.[BR]With the lackluster chapter 16, where some people already decided under current old rules that still runs on most live worlds, \"it wasn't worth it\" to advance from a tournament perspective and they stuck at chapter 15.[BR]For reference of this phenonemon you can read the embassies feedback threads on the diverse forums.[BR][BR]The next chapter seems to be similar lackluster.[BR][BR]That will be 2 full chapters of tournament detrimental performance on your \"advancement\"[BR]And under \"current new rules\" those effects will be way way worse than under the \"old rules\"[BR][BR]Go figure, what an absolutely amazing move this is."}, {"17": "Ok I raised this elsewhere but I am going to add it here.[BR]We asked, years ago, to stop giving KPs directly to our bar during events, and now we are back to this deplorable practice.  So I hardly want to spend my Widgets in the event either, because I am tech locked, of course.  My Wonders are already good because I have been tourneying for 4 years plus loitering a chapter behind my lead city all this while."}, {"84": "How would you like to get your KP ? I certainly would not want more AW KP instants, we have enough of those and now they hurt your tournament performance if you use them. I think the only other way would be universal KP instants and i can't see that happening to be honest.[BR]I don't have a problem with the KP being added to the bar but i know other people don't like it."}, {"22": "Considering some of the other event prizes that we're offered, I think getting about 14 KP is pretty good. The only downside is the chance of losing part of 1 KP if you're bar doesn't have the space for them. Put on an IM before you're about to open a bunch of chests and it will be fine. It's not like the old AW rewards which could turn up when you weren't there.[BR][BR]I wish people wouldn't ask for things like this to be taken away. They will probably bring out a 1% PP and put that in their place."}, {"15": "Pauly7 said:\t\t\tI wish people wouldn't ask for things like this to be taken away. They will probably bring out a 1% PP and put that in their place.\t\tClick to expand...Or they will convert it all to Aw instants which is ok for those tech locked or not moving forward but would hinder even more those still going through chapters. I think the way it is now is the only possible balance between the different needs of different players. Unless they do bring universal Kp instants but I don't see that happening."}, {"45": "Guys, please keep this thread on the new tournament changes and not deviate to other topics, especially when threads are already ongoing elsewhere."}, {"122": "any word of being able to train in all 3  yet ??[BR]We are testing one part but not the other and to be honest they are both linked to the new tournament changes [BR]If we can train in all 3  then that would at least let the DEV know if we can train enough troops to recover the amount we lose [BR]I know its been covered in beta  but so has this new tournament but they gave it to us to test but in my opinion you cant really test it when you dont have all the parts ..."}, {"45": "We are hoping this will be in next weeks update @malph as there are a lot of us itching for this new change to get here."}, {"46": "@Silmaril : @herodite : @anonglitch : I am still preparing feedback on several other features of the new Tournaments, but since the enabling of three simultaneous training queues is, it seems, regarded as a significant improvement which will help to counteract the very heavy Troop losses which many of us are encountering, I would like to put forward separately this explanation of why this change will not, in fact, be of any help to players at comparable (broadly average) advancement levels and with similar (non-specialist) playstyles and Cities to my own.[BR][BR]For reference: I am a semi-casual daily player with a reasonably well-developed Arendyll Server Elven* City in mid-Chapter VII, and the ability to generate more Troops via simultaneous building queues will, unfortunately, not benefit me either now or even in the mid-term future (meaning a period of at least six months). My City progress and playstyle probably represents a useful benchmark for an 'average' player in the early Guest Races who takes part in a committed but non-extreme/'hardcore' fashion in all of the game's core features.[BR][BR]* The lack of two of the best standard-production Units, Priests and Paladins, is a significant disadvantage to players with Elven Cities; and while Elven Golems are often preferable to Human Mortars, I find that Orc Strategists, which both Races can access via GotOS buildings, are often superior to both.[BR][BR]As an 'average' Combat-preferring player with only reasonable (never high) achievement levels and steady (even somewhat slow) progression, who previously (and sustainably) maintained a 1,600-2,000-Point Tournament average, I had not expected to be much affected by the new Tournament system, and certainly not to be noticeably adversely affected - so I was, and still am, very surprised to find that even my formerly modest level of Tournament achievement has now become impossible to sustain.[BR][BR]Furthermore, and because the only relevant way in which my City may differ noticeably from what is 'typical' is in my allocation of an above-average amount of space to Troop-producing buildings (8 x GotOS and 4 x V.Valor), with correspondingly less space devoted to Guest Races, I personally should, if anything, find Combat under the new Tournament system easier than most at a comparable stage. Therefore, if I am now finding Combat significantly more difficult, a player without these extra Troop-producing buildings will probably be in an even worse position in this respect.[BR][BR]BlueBlou said:\t\t\tI am not so sure three training queues are going to solve the problem of most players. Sure, it will increase numbers, but those numbers may not be on the troops you actually want to use.  Then, there is also the question of the ability of your troops.  It will not make your troops stronger, nor upgrade them a star level. Unless you are already at the research level of having 3 star troops in all categories, I don’t see the win win situation for all.  Definitely not in most of my cities.\t\tClick to expand...Very well stated. The new Tournaments' randomised Enemy Unit selections and very large Squadsizes (leading to early loss of entire player Squads - even those comprising the recommended 'counter-Units'), have so dramatically altered the usefulness of the Units available to me that I now have almost no use for most Troop types outside of three specific Barracks Units. If the intention of randomising Enemy Squad types was to bring more variety/challenge to Tournament Combat, in my case the reverse effect has been achieved; my choice in over 95% of Tournament Encounters is now (a) to use one or more of the same three types of Troop Units, or (b) to Cater the Encounter if Combat will result in very high or total Troop loss.[BR][BR]Specifically, across all four Tournaments so far, I have found almost no use at all for any type of Troops apart from Light Ranged (~75% overall; up to 100% in many Encounters), Heavy Ranged (~20% overall), and, much more rarely, Mages (~5% overall, although these are often entirely destroyed at the very start of Encounters with more than two standard Light Ranged Enemy Squads and/or more than one (preferably no) MistWalker Squad/s). NB: as an Elven City, I have only 2* Sorcerers at present, which are well known to be weaker than most Mage Units (and many other Troop types).[BR][BR]It is apparent from the above that, at my stage, only Ranged Troops, and especially Light Ranged (Archer) Units, which have very high Initiative, are now generally useful in Tournaments (and usually also the Spire), meaning that not only are Units formerly useful to me now largely redundant, but also that, in my case, there is no perceptible Tournament (or Spire) advantage at all in operating three training queues at once. The only non-Barracks Unit I can produce at my level which is - very rarely - of any use against the overly large and - far too often - all-3* Enemy Squads which Tournaments now feature are 2* Cerberus Units from the Training Grounds, although I have used these in perhaps only four or five Encounters during all four of the new Tournaments yet seen (and once during the four concurrent Spires) - and even then only as 'side units', not as a full 5-Squad choice.[BR][BR]This effect is so pronounced that I am now very unlikely even to place the Mercenary Camp - as I had planned to do during my current Chapter - until several Chapters later (if at all), when its initially weak 1* Units will at least be strong enough to have some chance of survival against the very large (and 2* and 3*) Enemy Squads; and I am also strongly considering deleting my Training Grounds as well, because it now has virtually no use and removing it will create space - a far more important consideration than previously because placed Expansions now increase Tournament difficulty.[BR][BR]Some have suggested that non- or less-useful Troop types produced using the 'three queues' system can at least be used as 'free cannon fodder', but I certainly do not have any such individually powerful Unit types that I could afford to sacrifice the damage output/survivability of even one genuinely useful Squad per battle in return for a far less efficient (or even useless) Squad which would either fail to survive and/or fail to contribute meaningful damage to the overall total; without a full five efficient Squads per battle, I would simply lose many more useful Troops and/or entire battles overall. It may be the case that one could win with fewer than five useful Squads if using Units which are sometimes considered 'overpowered', especially at their 3* level (e.g. Frog Princes or Forest Rangers), and one might therefore be able to use, say, one or two Squads of 'sacrificial' Troops which are often prioritised as AI targets (e.g. LR/Mages) to 'kite' the Enemy Squads away from valuable Units and/or into favourable battlefield positions, but at my stage such powerful Troop types lie several Chapters into the future - by which I mean at least a year, or more, at my non-'hardcore' pace.[BR][BR]It occurs to me that the 'three queues' idea (which, I believe, has quite probably long been planned, whether alone or as an intended part of the new Tournament system, since it will certainly have broad repercussions upon many aspects of the wider game beyond the Tournaments) may well be one of the most significant 'concessions' we are likely to be offered. As such, its lack of usefulness (certainly in its present form) in my own case comes not only as a surprise, but also as a disappointment - although perhaps this may change in future, especially considering that  I have yet to gain most of the mid-to-late-game Units, as well as lacking 3* [i.e. debuff-capable] versions of anything at all but Barracks-sourced Light Ranged and Heavy Ranged Troops, which may well be a significant factor now that the Tournaments involve both very large and primarily all-3* Enemy Squads, with the still overly random composition of each group of 5 Enemy Squads being a further and very significant factor contributing to the weakness of non-Ranged Units. Even 2* Treants (formerly one of my most versatile and long-surviving Units) are often destroyed before they can cause much or any damage, and when I have used - once or twice - a few Heavy Melee Squads in the new Tournament, I have relied instead on the 1* Vallorian Guards which I can, at present, obtain only from space-intensive Vallorian Valor buildings, since their 2+2 move/strike range is now such a great advantage (far more so than before) that they can at least survive long enough to do some damage, even though their HP is much lower than 2* Treants.[BR][BR]While I do believe, unhappily, that the underlying Tournament Formula, involving Expansions, Research, and AW Levels, is probably largely 'working as intended', and thus is not realistically likely fundamentally to change even in the face of the strong opposition we have seen here and on the Beta Forum (as well as in-game, from players who do not choose to comment on the Forums), I also do not believe that the reduction of useful Troops for players such as myself to no more than three types of Ranged Units - with ALL other early-mid game Units relegated to occasional use in World Map Provinces - can also be equally intentional. In fact, I would surmise that this is an unforeseen result which may well disproportionately affect most players who do not yet have access to the superior 2*/3* Training Grounds and Mercenary Camp Units; and if this is the case, I very much hope that steps will be taken to restore the full range of player-side Troop Units - for both Elven and Human Cities - to their formerly useful status."}, {"84": "I don't have training grounds or mercenary camp so forgive me if this is a stupid question. When players train troops in all 3 buildings will it not triple the amount of supplies needed ?"}, {"28": "Timneh said:\t\t\tI don't have training grounds or mercenary camp so forgive me if this is a stupid question. When players train troops in all 3 buildings will it not triple the amount of supplies needed ?\t\tClick to expand...Yes it will."}, {"25": "It's not a stupid question.  It will definitely cost a lot more supplies.  You have to pay for any troops that you create.  In the Training Grounds the Heavy Melee and Heavy Ranged also cost Orcs to set up."}]