[{"68": "Its somewhat of an Inno special - on the one hand we can produce troops in all three buildings, although how much use one might get from a Training Grounds where the only easy to build useful troop type is the Cerberus unless of course there is an unlimited supply of Orcs for production of HM and HR.[BR][BR]However more troops means more supplies, and once the stock of PoP spells have been used then another workshop might be needed along with the accompanying pop, culture and space.[BR][BR]If you don't have anything other than the barracks and decide to build the others, then again pop, culture and space are needed.[BR][BR]So, what seems to be a benefit can turn out to be nothing like one![BR][BR]I find that when Inno gives us something there's always a catch, my cynical thoughts are that this is to take our minds off the tournament changes.[BR][BR]\"Look at this wonderful thing we've given you!\""}, {"17": "I was considering prioritizing one of my Supply producing Wonders.  I'm going to toss this out there, level 20 or 25 on a Prosperity Towers, which do we think?  I'm sure that one of them will work admirably, however at what point does the increase in Wonder level lead to diminishing returns?  [BR][BR]We would normally resolve this in house but our strategists are increasingly falling foul of health issues."}, {"54": "Lelanya said:\t\t\tI was considering prioritizing one of my Supply producing Wonders.  I'm going to toss this out there, level 20 or 25 on a Prosperity Towers, which do we think?  I'm sure that one of them will work admirably, however at what point does the increase in Wonder level lead to diminishing returns? [BR][BR]We would normally resolve this in house but our strategists are increasingly falling foul of health issues.\t\tClick to expand...not sure what you are asking, but with 3 training queues, hammers come and go very fast, so the prosperity tower is a very good wonder, if you are able to get enough Power of Provisions spells to keep your workshops buffed all the time. ( might be hard to get enough PoP in the new setup)"}, {"32": "Yup, prosperity towers might be a good one as it does not only empower the PoP's strength it also lengthens it's duration[BR][BR]If I would have to make a choice which wonders to \"keep\" if I could redo my entire tech tree/expansions/wonders to optimise for the current rules with 3 production queue it would be;[BR][BR]Unit Empower wonders: [BR]Dragon abbey, [BR]Tempel of toads, [BR]Needles[BR][BR]Unit production wonders: [BR]Flying academy, [BR]Victory Springs, [BR]Needles,[BR]Shrooms.[BR][BR]Other:[BR]Prosperity Tower[BR]Martial monestary / Sanctuarry[BR]Tower of neighbourly Help[BR][BR]These I think under current rules are the only wonders that are \"worth it\" to be build and leveled for a pure tournament optimised town.[BR]Note that needles and Monestary/sactuary are the only wonders that has 2 powers that are both \"worth it\"[BR][BR]For the other wonders the secondary power is \"usefull\" at best."}, {"123": "The tournament is getting easy. I got a daily with only 800 keys.  AND I got 14 left.  It was so much fun.  I will for sure try something again...maybe"}, {"4": "rock stream said:\t\t\tThe tournament is getting easy. I got a daily with only 800 keys.  AND I got 14 left.  It was so much fun.  I will for sure try something again...maybe\t\tClick to expand...[BR]Tournament? you are talking the event not the weekly tournament.[BR][BR]See and reply here: https://en.forum.elvenar.com/index.php?threads/autumn-zodiac.13030/"}, {"15": "I keep refreshing the home page hoping to see the announcement for 3 separate queues show up today  [smilie--sprite1]"}, {"46": "CrazyWizard said:\t\t\tIf I would have to make a choice which wonders to \"keep\" if I could redo my entire tech tree/expansions/wonders to optimise for the current rules with 3 production queue it would be [...]\t\tClick to expand...[BR]@CrazyWizard : Thank you very much for this list - and indeed for all of your invaluable advice about many of the game's mechanics, over the years. When I started playing Elvenar, some 2½ years ago, your homepage was one of my most frequent reference sources, and your pre-new-Tournament list of AWs (here on the Forum) analysing their comparative/absolute values has also been very useful to me. Interestingly enough, the revised list you've given here is almost identical to my own assumptions as to which AWs will continue to be required/useful if the new Tournament Formula is not significantly changed - although it goes without saying that my own levels of knowledge and experience are no match for yours![BR][BR]It's also interesting how much building space most new/mid-game players (who read the Forums) are likely to be able to save, now that so many of the AWs are in the 'questionable benefit' category... although I wonder whether this outcome is something which InnoGames were/are hoping to achieve...?"}, {"24": "CrazyWizard said:\t\t\tYup, prosperity towers might be a good one as it does not only empower the PoP's strength it also lengthens it's duration[BR][BR]If I would have to make a choice which wonders to \"keep\" if I could redo my entire tech tree/expansions/wonders to optimise for the current rules with 3 production queue it would be;[BR][BR]Unit Empower wonders: [BR]Dragon abbey,[BR]Tempel of toads,[BR]Needles[BR][BR]Unit production wonders: [BR]Flying academy,[BR]Victory Springs,[BR]Needles,[BR]Shrooms.[BR][BR]Other:[BR]Prosperity Tower[BR]Martial monestary / Sanctuarry[BR]Tower of neighbourly Help[BR][BR]These I think under current rules are the only wonders that are \"worth it\" to be build and leveled for a pure tournament optimised town.[BR]Note that needles and Monestary/sactuary are the only wonders that has 2 powers that are both \"worth it\"[BR][BR]For the other wonders the secondary power is \"usefull\" at best.\t\tClick to expand...[BR]Good list! (but I am guessing you forgot 2) here is mine:[BR][BR]Unit Empower wonders: [BR]Time Warp (double use of 5 day buildings is the biggest damage/hitpoint boost of all),[BR]Martial Monastery,[BR]Dragon Abbey,[BR]Temple of Toads,[BR]Needles[BR]maybe Heroes Forge: still up for debate and depends what the upcoming tourneys will bring in terms of main enemy units, currently I agree, it is not going to be worth having, but if we get more tourneys with LM and HR troops and especially one with both (however unlikely that is), this might change.[BR][BR]Unit production wonders: [BR]Flying academy,[BR]Needles,[BR]Simia Sapiens[BR]Victory Springs: debatable, I think I will skip them, but for people with a dog fetish the combined number+damage effect might be worth it. Same as heroes Forge, will decide after I know all the new tourneys enemy combinations.[BR][BR]Other:[BR]Prosperity Tower[BR]Shrooms (one can do without it by building silly amounts of armories, so I put it in other rather than military)[BR]GA and MH for population (with the added bonus for catering)[BR]I find these 4 to increase the convenience of playing enough to make the increased tourney difficulty acceptable, but for a purely tourney oriented city without other interests none of these would be essential."}, {"24": "Hekata said:\t\t\tI keep refreshing the home page hoping to see the announcement for 3 separate queues show up today  [smilie--sprite1]Click to expand...[BR]I may be wrong, but I think updates come on Tuesdays?"}, {"20": "I don’t think we have answered Lelanya‘s question and that is an interesting question to me too. How do you decide when a benefit is going to become a mortar block?"}, {"15": "Gargon667 said:\t\t\tI may be wrong, but I think updates come on Tuesdays?\t\tClick to expand...Yes, but release notes announcing it usually come out on Mondays, I think  [smilie--sprite1][BR][BR]I agree with your list of useful Wonders. I would maybe add ETC for the boost to the MM spells often needed for sentient goods. Even a lv 11 one gives enough boost and makes the spell last long enough for the whole day. Also you have left out Victory Springs while it's on Wizard's list. I haven't built it yet so I'm curious whether it's useful or not."}, {"32": "Gargon667 said:\t\t\tGood list! (but I am guessing you forgot 2) here is mine:[BR][BR]Unit Empower wonders: [BR]Time Warp (double use of 5 day buildings is the biggest damage/hitpoint boost of all),[BR]Martial Monastery,[BR]Dragon Abbey,[BR]Temple of Toads,[BR]Needles[BR]maybe Heroes Forge: still up for debate and depends what the upcoming tourneys will bring in terms of main enemy units, currently I agree, it is not going to be worth having, but if we get more tourneys with LM and HR troops and especially one with both (however unlikely that is), this might change.[BR][BR]Unit production wonders: [BR]Flying academy,[BR]Needles,[BR]Simia Sapiens[BR]Victory Springs: debatable, I think I will skip them, but for people with a dog fetish the combined number+damage effect might be worth it. Same as heroes Forge, will decide after I know all the new tourneys enemy combinations.[BR][BR]Other:[BR]Prosperity Tower[BR]Shrooms (one can do without it by building silly amounts of armories, so I put it in other rather than military)[BR]GA and MH for population (with the added bonus for catering)[BR]I find these 4 to increase the convenience of playing enough to make the increased tourney difficulty acceptable, but for a purely tourney oriented city without other interests none of these would be essential.\t\tClick to expand...[BR]I in deeded forgot sapiens and timewarp tho that one might not need all levels if you can manage a polar bear somewhere.[BR]You want schrooms because the value a single expansion adds is bugger than the wonderlevels add.[BR]If you \"could redo\" everything. you want not only to reduce wonderlevels, but also reduce expansions as much as possible.[BR]So a high level shrooms with a decent amount of armories but a smaller city footprint is better than many extra expansions and a \"silly amount\" of armories."}, {"15": "BlueBlou said:\t\t\tI don’t think we have answered Lelanya‘s question and that is an interesting question to me too. How do you decide when a benefit is going to become a mortar block?\t\tClick to expand...That's the million dollars question now I think, especially since we can't revert a wonder to a previous level or remove an expansion if we see it's hurting us.[BR]Personally I'd say the best way is to set your goal (=the number of provinces you want to be able to do) and then slowly upgrade some wonders until you get a sustainable system. And then stop. Then if at some point your want to try to do more provinces repeat the process.[BR]Ofc this only works if you are using the tournament as a way to get resources for your city. If you are hunting after scores then Idk.[BR]Also this also works best if you have reached a point of your game where you want to stand put because opening more techs or adding expansions might offset that balance.[BR]Another way to do it is to use MinMax's formula and spreadsheet calculator to see how every change will affect your tournament SS and how sustainable it all is for you. So I guess it's possible to exactly pinpoint the tipping point but it requires a lot of maths and that's one of the things that makes me not like the new system. I didn't start this game to do maths and I don't want to spend my time doing calculations around my city. I like the previous system because it was simple: you upgrade an Aw and you know you're progressing and getting nothing but benefits. Same goes for an expansion."}, {"24": "Hekata said:\t\t\tYes, but release notes announcing it usually come out on Mondays, I think  [smilie--sprite1][BR][BR]I agree with your list of useful Wonders. I would maybe add ETC for the boost to the MM spells often needed for sentient goods. Even a lv 11 one gives enough boost and makes the spell last long enough for the whole day. Also you have left out Victory Springs while it's on Wizard's list. I haven't built it yet so I'm curious whether it's useful or not.\t\tClick to expand...[BR]Yes I did delete it, and now edited it back in as a debatable one [smilie--sprite1]"}, {"24": "CrazyWizard said:\t\t\tI in deeded forgot sapiens and timewarp tho that one might not need all levels if you can manage a polar bear somewhere.[BR]You want schrooms because the value a single expansion adds is bugger than the wonderlevels add.[BR]If you \"could redo\" everything. you want not only to reduce wonderlevels, but also reduce expansions as much as possible.[BR]So a high level shrooms with a decent amount of armories but a smaller city footprint is better than many extra expansions and a \"silly amount\" of armories.\t\tClick to expand...[BR]Indeed I have the Time Warp at 26 with 2 Polar Bears to do the rest and will not upgrade it any further (the plan originally was to reduce the use of Pet Food by upgrading the TWarp to 30)[BR]I also agree on the Shrooms, it is an insane space saver for me [smilie--sprite1] For a purely tourney oriented town it would probably make sense to do the math and see if Shrooms or expansions cause more trouble..."}, {"22": "Gargon667 said:Unit Empower wonders: [BR]Time Warp (double use of 5 day buildings is the biggest damage/hitpoint boost of all),[BR]Martial Monastery,[BR]Dragon Abbey,[BR]Temple of Toads,[BR]Needles[BR]maybe Heroes Forge: still up for debate and depends what the upcoming tourneys will bring in terms of main enemy units, currently I agree, it is not going to be worth having, but if we get more tourneys with LM and HR troops and especially one with both (however unlikely that is), this might change.[BR][BR]Unit production wonders: [BR]Flying academy,[BR]Needles,[BR]Simia Sapiens[BR]Victory Springs: debatable, I think I will skip them, but for people with a dog fetish the combined number+damage effect might be worth it. Same as heroes Forge, will decide after I know all the new tourneys enemy combinations.[BR][BR]Other:[BR]Prosperity Tower[BR]Shrooms (one can do without it by building silly amounts of armories, so I put it in other rather than military)[BR]GA and MH for population (with the added bonus for catering)[BR]I find these 4 to increase the convenience of playing enough to make the increased tourney difficulty acceptable, but for a purely tourney oriented city without other interests none of these would be essential.\t\tClick to expand...This list is more similar to my list of what I would find essential. The only difference here being Dwarven Bulwark. I'm not really sure why this is always overlooked. Perhaps someone could enlighten me. It gives me a considerably greater increase to training size than Shrooms does.[BR][BR]I'm a bit more definite on Heroes' Forge and Victory Springs than you, but I am debating the viability of Pyramid of Purification - these extra sentient goods is one of the factors allowing me to keep to one each of T4-6.[BR][BR]CrazyWizard said:\t\t\tTower of neighbourly Help\t\tClick to expand...What's this? Am I missing something?"}, {"20": "I think the Tower of neighbourly Help is the Lighthouse of Good Neighborhood.  Not sure why that is a good one."}, {"32": "Pauly7 said:\t\t\tThis list is more similar to my list of what I would find essential. The only difference here being Dwarven Bulwark. I'm not really sure why this is always overlooked. Perhaps someone could enlighten me. It gives me a considerably greater increase to training size than Shrooms does.[BR][BR]I'm a bit more definite on Heroes' Forge and Victory Springs than you, but I am debating the viability of Pyramid of Purification - these extra sentient goods is one of the factors allowing me to keep to one each of T4-6.[BR][BR][BR]What's this? Am I missing something?\t\tClick to expand...[BR]Bullwark at peak performance is as stong as a a shrooms with 4 armouries,[BR]This is why I picked shrooms above bullwark, also while \"free units\" are still free units, the archer is better.[BR]That said with 3 production queue the influence of these wonders becomes near insignificant especially if you also own some brown bears[BR]For this pyramid of purification has to little to offer (from a tournament standpoint)[BR][BR]With 3 production queue you need a lot of supplies, it will require some magical workshops and PoP spells.[BR]To keep your expansion footprint low you cannot place dozens of workshops and with limited tournment abilities you will not always get enough PoP spells.[BR][BR]Tournament rewards 2 spells frequently, PoP and Ensorcelled.[BR]With the neighbourly help wonder you can extrand It's duration to 4 days and +12% culture bonus.[BR]This is then muliplied with pop spells.[BR]So to maximise this resource and limit space consumption the combination of these 2 wonders means you might be able to get away with only 2-3 workshops. a number you can maintain boosted by pop 24/7 with your tournament rewarded PoP spells.[BR][BR]more than 1 million goods from a 3 hour production from 1 workshop should be doable 24/7 with this combo.[BR]This reduces space, and therefore expansions."}, {"24": "Lelanya said:\t\t\tI was considering prioritizing one of my Supply producing Wonders.  I'm going to toss this out there, level 20 or 25 on a Prosperity Towers, which do we think?  I'm sure that one of them will work admirably, however at what point does the increase in Wonder level lead to diminishing returns? [BR][BR]We would normally resolve this in house but our strategists are increasingly falling foul of health issues.\t\tClick to expand...[BR]Sorry I missed this one earlier. Thanks @Pauly7![BR][BR]Why 20 or 25? I mean the best bang for your buck is always the rune circle upgrade (double bonus compared to other levels) so the question should be 21 or 26![BR][BR]Then again I think that would be a tiny difference in overall performance  (both the effect of 5 levels on PoP and on AWs), so I am rather safe to say: it doesn´t matter. In my eyes if an AW is worth upgrading , then it is worth upgrading more. That is true for all AWs up to and including Constructs. Later AW have actually inbuilt diminishing returns! And upgrades actually get worse and worse. None of them are interesting anyways, so no big loss not building any of them for me. The Thermal Springs are good for ranking towns (those with tons of residences to populate their armories and factories). I personally was looking into lvl 11 Thermal Springs, but in my town I still get more pop per square out of placing a new Magic house than I would get from the springs, since benefits after lvl 11 are getting very small no point for my town. While I think a lvl 30 Thermal Spring would indeed be better than a Magic house per square, the horrendous upgrade costs alone make it rather uniteresting, with the new tourney on top it would be insanity to build them in a town like mine... The other 3 AWs after Constructs are meaningless junk (with the exception of ranking towns (both chapter 16) and people that want to overdose on sentients (with the vortex, that nobody with a lvl 30 Timewarp needs)[BR][BR]I think what matters is the big picture, do you want an AW at all, yes or no? So the desicion is 30 levels or 0 levels? That will make a difference (obviously on the AW, but probably also on the tourney). [BR]The only exception to this rule I would say are lvl 1 AWs. They follow somewhat different rules: For one because they are replaceable, you can sell them and rebuild them (not as often as you want, but often enough to delete them before a big push week for example or an FA)I use some of those  AWs, like the ToS i must have built 10 times already [smilie--sprite1], also the Bulwark and the Pyramid of Purification, I might add the Victory Springs to this list. And secondly, Level 1 is the most powerful of all levels (it will take you 5 upgrades to add the same amount of bang as you get for lvl 1!). So a questionable AW might be good for 1 level (which gives some effect without the repercussions of a lot of AW levels), while doubling the effect would need 6 times the AW levels! After that the relation stays the same though (always 5 levels to add another lvl 1 effect).[BR][BR]I hope that at least helps somewhat with that question [smilie--sprite1] Although I know there is no straight up answer for 20 or 25..."}]