[{"24": "BlueBlou said:\t\t\tI think the Tower of neighbourly Help is the Lighthouse of Good Neighborhood.  Not sure why that is a good one.\t\tClick to expand...[BR]He means the Watchtower, which gives him the culture for his chapter 16 culture guzzlers lol. But I have never had one before and am sure not going to place one now [smilie--sprite2]"}, {"24": "Pauly7 said:\t\t\tThis list is more similar to my list of what I would find essential. The only difference here being Dwarven Bulwark. I'm not really sure why this is always overlooked. Perhaps someone could enlighten me. It gives me a considerably greater increase to training size than Shrooms does.\t\tClick to expand...[BR]Bulwark is only better if you have very few armories. What chapter are you in? From chapter 15 onwards you need a serious increase in Orcs production, so you need more armories (unless you plan on placing 30+ Orc nests, no I am not exaggerating). If you build more armories for Orcs, then Shrooms will be many times better than the bulwark."}, {"24": "CrazyWizard said:\t\t\tSo to maximise this resource and limit space consumption the combination of these 2 wonders means you might be able to get away with only 2-3 workshops. a number you can maintain boosted by pop 24/7 with your tournament rewarded PoP spells.[BR][BR]more than 1 million goods from a 3 hour production from 1 workshop should be doable 24/7 with this combo.[BR]This reduces space, and therefore expansions.\t\tClick to expand...[BR]Ah I see the good neighbour AW! Intersting idea, but not for me I only have 2 MWS in my town and still have to run to the wholesaler with my supplies. The 3 queues mean I will place my 3rd MWS, I doubt more than that is necessary? But I may underestimate the costs... however since crafting KP instants will stop I can move to crafting supplies more to make up the rest. A MWS costs about 2 expansions worth of space (1 for itself and 1 for pop+Cult), I am doubtful 30 AW levels have less effect than 2 expansions. And of course this is purely theoretical until they allow us to teleport expansions. The space I already have, while the AW would go on top of what I now have..."}, {"22": "Gargon667 said:\t\t\tBulwark is only better if you have very few armories. What chapter are you in? From chapter 15 onwards you need a serious increase in Orcs production, so you need more armories (unless you plan on placing 30+ Orc nests, no I am not exaggerating). If you build more armories for Orcs, then Shrooms will be many times better than the bulwark.\t\tClick to expand...I am settled in my spot in chapter 15 (i.e. got the troop upgrades then dismantled the settlement). I have 3 armouries, a Bulwark and a Shrooms, plus making up the orc difference with nests and Heroes'. I realise that having both wonders isn't efficient, but if I was making the change then I would put enough extra levels on my Bulwark to cope, then get rid of Shrooms. Bulwark is a lot more powerful with all the optional squad size upgrades done, which I now have.[BR][BR]I'm now not certain if you meant Watchtower or Lighthouse @CrazyWizard. I can see the case for both. I deleted my Lighthouse in the end, but I do miss it. I didn't have many levels on it, but I'm missing about 50% from the total of my culture bonus now. My reasoning, in the end, was that my EE spell usage had become unsustainable so I was never going to get the maximum out of that AW anymore... so I deleted it and replaced it with a workshop.[BR][BR]2 AWs deleted so far and my Bell Tower will go if the Spire ever gives me a second Magic Residence. (By the way, since winning a MR became a 10% possibility I've now opened 39 end of level 1 Spire chests and I've still just won 1 MR.)"}, {"22": "Well, technically I have 4 armouries, but one is my nostalgic chapter 6 armoury (I'm not all about the efficiency.)"}, {"32": "The original list was if I could redo my city all over from scratch (as in you get the ability to return researches, expansions and wonders.[BR][BR]Off course it might not fit a current town.[BR][BR]Gargon667 said:\t\t\tAh I see the good neighbour AW! Intersting idea, but not for me I only have 2 MWS in my town and still have to run to the wholesaler with my supplies. The 3 queues mean I will place my 3rd MWS, I doubt more than that is necessary? But I may underestimate the costs... however since crafting KP instants will stop I can move to crafting supplies more to make up the rest. A MWS costs about 2 expansions worth of space (1 for itself and 1 for pop+Cult), I am doubtful 30 AW levels have less effect than 2 expansions. And of course this is purely theoretical until they allow us to teleport expansions. The space I already have, while the AW would go on top of what I now have...\t\tClick to expand...I am assuming top level wonders, maybe you do not have very high level unit production boosting wonders.[BR]Maxed out, a barracks, training grounds or mercenary camp can swallow up to nearly 2m supplies a day[BR]If we triple the output this would mean just the unit production alone might require up to lets say 5.5m supplies a day.[BR][BR]Thats a lot to handle with 2 workshops and a handfull of PoP spells."}, {"24": "Pauly7 said:\t\t\tI am settled in my spot in chapter 15 (i.e. got the troop upgrades then dismantled the settlement). I have 3 armouries, a Bulwark and a Shrooms, plus making up the orc difference with nests and Heroes'. I realise that having both wonders isn't efficient, but if I was making the change then I would put enough extra levels on my Bulwark to cope, then get rid of Shrooms. Bulwark is a lot more powerful with all the optional squad size upgrades done, which I now have.\t\tClick to expand...[BR]Well if you are actually OK for Orcs with your armories, then I would say the Shrooms can go but instead you could add an armory rather than levels on the bulwark (more Orcs as a extra plus). Not sure how much you upgrade the Timewarp/Simia (those rune circles cost orcs) and how much you plan on catering (Also super high Orc costs) even if you don´t progress any further in chapters. I find it very hard to estimate how many Orcs I´ll need in the future, once I am done with the big Orc upgrades (every lvl 31 upgrade costs 265k Orcs), last one (of 3) is coming up for me now. Haven´t started catering with Orcs for that reason, so I can´t say what would be a good production... Currently I make about 50k per day. [BR]So I would wait and see how many Orcs you need in the long run, then decide whether to get rid of Shrooms or Bulwark or neither..."}, {"32": "Gargon667 said:\t\t\tHe means the Watchtower, which gives him the culture for his chapter 16 culture guzzlers lol. But I have never had one before and am sure not going to place one now [smilie--sprite2]Click to expand...[BR]I indeed ment the good neighbourhood one.[BR]The one that boosts ensorcelled spells."}, {"24": "CrazyWizard said:\t\t\tThe original list was if I could redo my city all over from scratch (as in you get the ability to return researches, expansions and wonders.[BR][BR]Off course it might not fit a current town.[BR][BR][BR]I am assuming top level wonders, maybe you do not have very high level unit production boosting wonders.[BR]Maxed out, a barracks, training grounds or mercenary camp can swallow up to nearly 2m supplies a day[BR]If we triple the output this would mean just the unit production alone might require up to lets say 5.5m supplies a day.[BR][BR]Thats a lot to handle with 2 workshops and a handfull of PoP spells.\t\tClick to expand...[BR]My FA is 31[BR]My Needles will be 31 as soon as they give us the 3 queues.[BR]I never bothered with training grounds/Vic Springs, so I have had neither, just building the TG now for a few extra dogs, but not planning on building Vic Springs, can´t see 30 levels on it being weighed up by making double the amount of junk units...[BR][BR]And of course my Merc Camp (max level) is running 24/7 [BR]I never understand what people do with all those supplies... yes my MWS are chapter 16 and I have the standard 170% culture boost. and PoP with a lvl 16 PT, nothing fancy...just standard. Each MWS produces I would say between 2 and 3 mio supplies per day. So there you go, got the 5.5 mio per day covered with 2 or 3 MWS."}, {"45": "@malph Release notes are just up!"}, {"122": "@Silmaril   thanks   now we will get to test it properly [BR]am not saying it will help that much  but at least we get the chance to test it and see how it goes"}, {"45": "I personally am looking forward to not scratching around so much for units as I never seem to have enough for the Spire and the Tournament"}, {"122": "@Silmaril  Just like to give an update  (this is my personal test) as i have been changing my city to manage the new tournaments[BR]I have scored 11k in this weeks tournament and i lost alot of troops  but with having the  3 queues for training and as  am in a fellowship that  gets gold in spire thats alot of time boosts i get from that and using time boosts with a lvl 10 brown bear should help me recover alot of the troops I lost [BR]Can it be done every week  ????[BR]I feel it will be alot harder for players that are not in such a strong fellowship as they wont get so much time boosts to restock up on troops[BR]being able to train in all 3  will help me alot"}, {"22": "I don't think anyone will be able to easily sustain 11k points and Inno doesn't intend for scores to be consistently that high anymore. To be able to sustain all productions I have dropped my tournament scores down to somewhere between 6 and 7k. That's the most I can easily achieve keeping my troops, supplies, instants (time + supplies) and pet food stable. I am sure that some will be able to do more than I can, but I'm quite relaxed about the new level. I'm just still not relaxed about how the new formula punishes progression and extra AW levels, and never will be.[BR][BR]Having three training queues is nice, in my opinion, but it won't necessarily increase the sustainable tournament score I'm able to get as I'm not sure that troop production will be the limiting factor for me. Right now it's actually supplies production, but I'm sure I can improve this slightly."}, {"122": "@Pauly7  I agree  with you  around 6 to 7k   would be around what i feel  i could do most weeks  [BR]Doing 11k   this week was  just a test I felt like to test it  i had to push that little extra  to see where i feel is a comfortable score for my city  and i believe  it would be around the 6 to 7k  and  every now and then   maybe push a little harder if troops permitted"}, {"22": "malph said:@Pauly7  I agree  with you  around 6 to 7k   would be around what i feel  i could do most weeks [BR]Doing 11k   this week was  just a test I felt like to test it  i had to push that little extra  to see where i feel is a comfortable score for my city  and i believe  it would be around the 6 to 7k  and  every now and then   maybe push a little harder if troops permitted\t\tClick to expand...Absolutely. I still feel I will be able to have certain push weeks where I can go for more. My own personal test is to go through the first 9 weeks of these new tournaments on the same level playing field. I am feeding the Firebird and placing just 1 x DA each week. Only when I've gone through all 9 weeks will I have a bit of a clearer idea of what worked best, which ones were harder, etc. However during this time I am building up a really healthy stock of ELRs and MMMs and I am working with a troop buffer of almost 2,000 extra squads, so yeah... I expect to splash out and have an occasional bigger one, every once in a while."}, {"24": "I just finished this weeks Elixir tourney. BTW a very interesting new thing: We have for the first time 3! main enemy types: LM, LR, HM, which basically means exactly the old Elixir tourney, of course given the new tourney style with the occasional HR and Mage thrown in. Not a bad idea![BR][BR]This was the first time since the new tourneys that I have actually pushed it to the end of my provinces. I had 61 provinces so I got to a bit over 16k points.[BR][BR]Costs: [BR]I think it cost me between 2500-3000 squads (which is the new maxed squads) where it would have previously cost me maybe 1000-1500 (minimum squads), so let´s say troops usage went up by a factor of 4 or 5?[BR]In addition to that I also used more booster buildings: 100% hitpoint boost would have been the same before, but I added 2 ELR and 2 MMM that I would not have used in the old tourneys.[BR]Goods usage: I catered a few encounters, that I didn´t feel like fighting, which I have never done  in the old tourney, so usage went up from nothing to a little bit.[BR][BR]Do I find this reasonable? Yes pretty much I would say. It is supposedly a challenge now to do a lot of points and this was a big effort for a big score, sounds fair to me. I would not do it every week, but I can do it occasionally. I am happy with that.[BR][BR]My city is in the beginning of chapter 16, I have placed 129 expansions and I have ~330 AW levels.[BR][BR]Out of the 61*6=366 encounters I did 1 manual fight, 5-7 caterings and ca. 360 auto-fights.[BR][BR]The positive: Playing the tourney now was far more enjoyable than the old one would have been. The fights were more difficult (because of the difference in SS), but mainly because I was forced to think about using different units in every fight. I used Golems and Frogs (the only 2 I would have used in the old tourney) but I also used Rangers and Blossom Mages nearly as much, even Vallorians sometimes. So I had much more fun! Also it was much faster and less tedious. In the old tourneys I would still be sitting there clicking my fingers wound, while we had a fun start yesterday (we finished 10 chests in 42 minutes cutting our old time record in less than half, YAY!) but the more important part is: I didn´t have to spend the entire evening and next day clicking. I simply did 45 minutes yesterday and an hour today and here we go: tourney finished. So this new system gives me hours of my life back every week [smilie--sprite1] I am happy to pay a couple thousand squads for that![BR][BR]What is sustainable? That is a much more complicated question, unfortunately it is not possible to keep all the involved resources at a constant level through time. Some will always go down, some will go up, but one cannot simply calculate them against each other... what I can say is that I have always scored above 10k since the new tourney started. That is now 5 weeks in a row I think? I intend to keep going with it until I cannot do it anymore, right now I don´t think this point is going to come anytime soon. Some of my resources are still increasing, others decreasing, so shifting them around might do the trick... So my tourney average went down from 15k+ to 10k+ However the 15k+ average was not limited by resources, while the 10k+ now is (most likely)[BR][BR]So do I like the new tourneys better than the old ones? YES[BR][BR]Do I like the new tourneys? NO[BR]here is why: Because they completely kill progress in the game at the place where I am at: I will never again activate a research, I will never again place an expansion and in the future I will delete more AWs than I upgrade. If more people than just myself think the same way and choose tourneys over progress, I cannot see that as a sustainable future for the game.[BR]- Any future chapter will be ignored, so basically they turn into a waste of money for Inno.[BR]- Premium Expansion sales will not go very well [BR]- A city building game that forces players to sell their most treasured (and hardest worked for) buildings? [BR][BR]There are 3 bad ideas rolled into one.[BR][BR]What can be done about it? I do not mind the idea of having progress factors increase the difficulty of tourneys/spires. That is a good and even necessary idea! The multiplication is what turns a fair system into a STOP to progress at a certain point in the game, when the costs increase becomes bigger than the benefits by progress factors. An addition instead of a multiplication can increase difficulty slowly and keep the benefits of progress above the costs of progress forever. Yes that is a major overhaul of the formula and needs rebalancing after. If anyone has a better idea I would support that, but the only idea Inno has had so far was a few cosmetic changes that don´t even touch the solution of the problem. They are meant to buy goodwill for a fundamentally flawed system, not to fix it."}, {"32": "Gargon667 said:\t\t\tDo I like the new tourneys? NO[BR]here is why: Because they completely kill progress in the game at the place where I am at: I will never again activate a research, I will never again place an expansion and in the future I will delete more AWs than I upgrade. If more people than just myself think the same way and choose tourneys over progress, I cannot see that as a sustainable future for the game.[BR]- Any future chapter will be ignored, so basically they turn into a waste of money for Inno.[BR]- Premium Expansion sales will not go very well[BR]- A city building game that forces players to sell their most treasured (and hardest worked for) buildings?\t\tClick to expand...It does not only turn new chapters into waste, it will also lead to some loss of revenue.[BR][BR]\t\t\tWhat can be done about it? I do not mind the idea of having progress factors increase the difficulty of tourneys/spires. That is a good and even necessary idea! The multiplication is what turns a fair system into a STOP to progress at a certain point in the game, when the costs increase becomes bigger than the benefits by progress factors. An addition instead of a multiplication can increase difficulty slowly and keep the benefits of progress above the costs of progress forever. Yes that is a major overhaul of the formula and needs rebalancing after. If anyone has a better idea I would support that, but the only idea Inno has had so far was a few cosmetic changes that don´t even touch the solution of the problem. They are meant to buy goodwill for a fundamentally flawed system, not to fix it.\t\tClick to expand...[BR]This was already the case to some regard in the last chapter and old system due a lack of unit improvements (everything got 3* in chapter 15)[BR]And there was indeed already a group that decided to ignore the new chapter.[BR]With this formula it's way worse.[BR][BR]I heared comments like \"we cannot just cater to the end game players even if this will cost us some revenue\" and to that I wholehearlty agree.[BR]But there is such a difference between \"catering to the end game players\" and throwing them under a bus. and \"some revenue\" and the carnage they might experience.[BR][BR]The last 6+weeks on beta and here we have seen so many questen \"can I really do my SS researches?\", \"is it really ok?\" ect.[BR]As someone noted, the fact that \"expansions\" count, and the bonus of premium expansions is already on the chopping block might lead to an irreparable feeling under players once the \"rumour\" these hurt your gameplay gain traction. even after another modification this alone will be enough to affect sales."}, {"32": "Just as an added comment, Wonders are the biggest spacehogs in this game, less wonders, means less need for space.[BR]There will simply be natural reason to even consider not added / buying expansions."}, {"24": "CrazyWizard said:\t\t\tThis was already the case to some regard in the last chapter and old system due a lack of unit improvements (everything got 3* in chapter 15)[BR]And there was indeed already a group that decided to ignore the new chapter.[BR]With this formula it's way worse.\t\tClick to expand...[BR]I am one of the group [smilie--sprite1] I never intended to play chapter 16, because it is an entirely useless chapter and was not even worth the increase of costs in the spire before the new tourney started. I did get the expansion simply because we attempted to break a record in the last FA, so I traded tourney performance for FA performance. [BR]I do use the techs I got and very slowly produce the guest race productions on a lvl 1 settlement for the entertainment value and the off chance that progress will one day make sense again. By then I´ll have all guest race goods ready and only need to fill in KP [smilie--sprite1][BR][BR]And i fully agree, if I was playing a new town, I would stop research half way through chapter 15 after activating the Frogs (plus the optional SS). Not a single tech more ever after that point."}]