[{"89": "Gargon667 said:\t\t\tSo do I like the new tourneys better than the old ones? YES[BR][BR]Do I like the new tourneys? NO[BR]here is why: Because they completely kill progress in the game at the place where I am at: I will never again activate a research, I will never again place an expansion and in the future I will delete more AWs than I upgrade. [...][BR][BR]There are 3 bad ideas rolled into one.\t\tClick to expand...[BR]*SIGN*[BR][BR]I'm even close to get my next diamond expansion for free (11k diamonds - did buy 90% of the other expansions with real money and now i even feel betrayed, as i did buy them in the belief that there is no downside for those), but i won't do it. Not even talking about buying diamonds ever again. I also wouldn't advise anyone to do that anymore - while before i even advertised that and even sponsered some of my fellows a few ones. Now i'm feeling bad for that.[BR][BR]Currently i have to use 31% more troops/goods/mana/etc. as another fellow within the same chapter (!), only because i decided to build and to invest into different AWs + investing real money into expansions.[BR][BR]Regarding CH16, not even the AWs are worth it... even less with the new system implemented.[BR][BR]I really have a hard time to understand how someone with a clear mind could think that this formula is good in any way. Especially after all that feedback, they're keeping that thing and try to \"improve\" anything else, but not the real core of the problem."}, {"32": "I think they do understand they did screw up, but are unwilling to throw months of work in the garbage bin and start over again.[BR]Thats a lot of invenstement that someone needs to be held accountable for.[BR]They rather trow a substantial part of there paying player base under a bus, as these \"results\" are delayed and therefore not directly tied to the tournament change (on the papertrail)[BR]This way someone can save his/her job \"for now\".[BR][BR]And the problem is that the live update on all worlds of tomorrow only digs a deeper hole they can no longer get out from.[BR]Releasing all 3 production queue's ahead of this update is just another deep dig."}, {"22": "But they don't need to feel unduly bad about it. I'm not sure what we be so wrong about saying - OK we tested it. It isn't viable, so we need to change it. They don't need to bin the whole thing, just make some fundamental changes to the formula. It seems quite apparent to me, though, that even though they may say \"end game players and forum users aren't representative of the player base\", in actual fact there is so much of this that wasn't considered properly. They wouldn't have said the things they said about Ancient Wonders if they had a clear understanding of the ramifications of their changes."}, {"17": "Ok let's talk about the elephant in the room.  If Ancient Wonders are taken out if the system, then the system favors players who have a great many Ancient Wonder levels.  And while some players got to that point on their own, by playing a long time, by tourneying consistently, as some of us have done and can attest, others have taken shortcuts. [BR][BR]I do not want to turn this debate into the kind of one that gets locked, or moderated, but the fact is, I can see where the developers might want to make things more difficult for players who've enlisted a lot of help.  And let me say, we know what happens on our server - but especially here, on the International server, we hear rumors of how extreme the situation has gotten, on other servers.  Some rules may not be aimed at us."}, {"22": "It's quite a bad precedent to make if you're saying that people should have their progress hindered if they've spent money on the game. If you're talking about those involved in more nefarious activities that's a whole other matter, but the solution isn't to cripple all the people in the first category you mentioned just to get at those who operate outside the rules. The solution is to actively target and ban those players, which they should be perfectly capable of doing themselves just by taking a look at some of the high scoring cities."}, {"28": "Lelanya said:\t\t\tI do not want to turn this debate into the kind of one that gets locked, or moderated, but the fact is, I can see where the developers might want to make things more difficult for players who've enlisted a lot of help. And let me say, we know what happens on our server - but especially here, on the International server, we hear rumors of how extreme the situation has gotten, on other servers. Some rules may not be aimed at us.\t\tClick to expand...It's like dealing with mice infestation by burning the house down. I mean, it does solve the problem..."}, {"15": "CrazyWizard said:\t\t\tAnd the problem is that the live update on all worlds of tomorrow only digs a deeper hole they can no longer get out from.[BR]Releasing all 3 production queue's ahead of this update is just another deep dig.\t\tClick to expand...They are realising the 3 queues on other worlds too? So not only they are still enjoying the old system but they get more troops on top of that? Excellent! I just might go and start an account on another server. With the speed they are testing and implementing changes I'll have time to get at least to the orc chapter before the new tourney starts [smilie--sprite8]"}, {"14": "Lelanya said:\t\t\tOk let's talk about the elephant in the room.  If Ancient Wonders are taken out if the system, then the system favors players who have a great many Ancient Wonder levels.\t\tClick to expand...[BR]This is exactly why many people have suggested changing the formula into additive instead of multiplicative. This way you will still adjust the difficulty upwards for those with a great many AW levels, but do not punish them exponentially for every level they get.[BR][BR]It's fine to count them, it's just not fine to use them as a multiplier.[BR][BR][BR]Lelanya said:\t\t\tI do not want to turn this debate into the kind of one that gets locked, or moderated, but the fact is, I can see where the developers might want to make things more difficult for players who've enlisted a lot of help.  And let me say, we know what happens on our server - but especially here, on the International server, we hear rumors of how extreme the situation has gotten, on other servers.  Some rules may not be aimed at us.\t\tClick to expand...[BR]If one does not properly moderate a game, and enforce the rules with a firm hand, then Inno can only blame themselves. Unfortunately, they make it our problem, instead of getting their own house in order."}, {"32": "Pauly7 said:\t\t\tBut they don't need to feel unduly bad about it. I'm not sure what we be so wrong about saying - OK we tested it. It isn't viable, so we need to change it. They don't need to bin the whole thing, just make some fundamental changes to the formula. It seems quite apparent to me, though, that even though they may say \"end game players and forum users aren't representative of the player base\", in actual fact there is so much of this that wasn't considered properly. They wouldn't have said the things they said about Ancient Wonders if they had a clear understanding of the ramifications of their changes.\t\tClick to expand...[BR]With fundamental changes to the formula, they also need to reconsider \"balance\", if they even know that that word means, but at least \"balance\" in there eyes.[BR][BR]A proper formula change would mean going back to square 1.[BR]You have to make all considerations you had in the development phase again, you then need to implement those, en then test is again.[BR][BR]This is the issue if there is a fundamental problem with your foundation"}, {"32": "Lelanya said:\t\t\tOk let's talk about the elephant in the room.  If Ancient Wonders are taken out if the system, then the system favors players who have a great many Ancient Wonder levels.  And while some players got to that point on their own, by playing a long time, by tourneying consistently, as some of us have done and can attest, others have taken shortcuts.[BR][BR]I do not want to turn this debate into the kind of one that gets locked, or moderated, but the fact is, I can see where the developers might want to make things more difficult for players who've enlisted a lot of help.  And let me say, we know what happens on our server - but especially here, on the International server, we hear rumors of how extreme the situation has gotten, on other servers.  Some rules may not be aimed at us.\t\tClick to expand...[BR]just because some use \"illegal tactics\" doesnt mean everyone does, there are also methods  \"legal\" to aquire hundreds of kp per day assuming you are willing to spend the hours to make it work.[BR][BR]You could also crackdown on pushing, bet lest be fair. they never did really crackdown on it because it involved \"to many whales\" it was openly stated on a forum by a CM that the main issue was that a good crackdown would lead to too much lost revenue so they had to find a way to mitiligate that.[BR]Thats why they do act, but in a way that does not eliminate the issue.[BR][BR]As MinMax properly stated, burning down a house to deal with a mice infestation ain't the right course of action."}, {"14": "CrazyWizard said:\t\t\tWith fundamental changes to the formula, they also need to reconsider \"balance\", if they even know that that word means, but at least \"balance\" in there eyes.[BR][BR]A proper formula change would mean going back to square 1.[BR]You have to make all considerations you had in the development phase again, you then need to implement those, en then test is again.[BR][BR]This is the issue if there is a fundamental problem with your foundation\t\tClick to expand...[BR]Indeed, back to the start.[BR][BR]However, I think Inno management functions \"top-down\", in a fierce way. They set a project, allocate some time and budget, and there are goals to be attained. X% harder tournament, X% lower scores, and X% lower rewards (for example, don't pin me down okay.). [BR]You made these goals? And the community uproar doesn't cost too much revenue? -> Implement, don't look back.[BR][BR]I've been around too many projects that went down this way, so I would not be surprised."}, {"122": "This is the outcome i am seeing  with this new system if there is no change  [BR][BR]People saying that it is pointless doing any more in the tec tree and there now at a point that there not going to move on (I am one of those people)[BR]using the Kp from tournament In AW  is going to hurt  you  so it comes down to Do you upgrade AW  or not ?? [BR]then if your not doing the tec tree  and not upgrading AW  then how long will it be before you get bored of the game all together and either leave or just log in now and then [BR]If you are still going to upgrade AW  like i am   then it will come to the point where your punishment is not worth playing anymore as you will find the tournaments alot harder due to upgrading AW ..[BR][BR]Now this saddens me but all i can see is alot of players are going to be leaving this game over the next few months  and it all comes down to Inno  not listening to its players enough"}, {"17": "CrazyWizard said:\t\t\tjust because some use \"illegal tactics\" doesnt mean everyone does, there are also methods  \"legal\" to aquire hundreds of kp per day assuming you are willing to spend the hours to make it work.\t\tClick to expand...That is what I said.  I said, many of us got here by dint of playing a long time, and tourneying consistently, or tourneying a lot once the Fire Phoenix was put into play."}, {"4": "So the addition of training from all camps simultaneously is a welcome from me, still I am getting wipe out losses with the correct troops. I say correct troops as I have been fighting in this game for years. The tourney still does round 1 total losses unexplained and even a manual fight I get wiped out. [BR]A conclusion that comes to mind now is that Inno games wants all the long term players to quit because they no longer spend so new players come in, buy and leave. I am completely upset with the current situation now.[BR][BR]My fun is gone, what they are thinking I now have no idea, buying an expansion, upgrading an AW, even training more troops makes it harder. I am close to giving up all together, this has become a farce."}, {"17": "@m4rt1n, give us a bit more detail please.  What province was this, what round?  Did you take MinMax Gamer's formula and apply it to your city so you knew when to start catering if you wanted the score?[BR][BR]Some of the players have given recommendations on Wonders that are helpful, THANK YOU to those who did.  With a bit more data we can work up a strategy together.  I think we are all watching, all testing, and also waiting to see what compromises the developers are willing to allow.[BR][BR]Take heart, hon, you are not alone in being frustrated."}, {"54": "Lelanya said:@m4rt1n, give us a bit more detail please.  What province was this, what round?  Did you take MinMax Gamer's formula and apply it to your city so you knew when to start catering if you wanted the score?[BR][BR]Some of the players have given recommendations on Wonders that are helpful, THANK YOU to those who did.  With a bit more data we can work up a strategy together.  I think we are all watching, all testing, and also waiting to see what compromises the developers are willing to allow.[BR][BR]Take heart, hon, you are not alone in being frustrated.\t\tClick to expand...I only see 1 good strategy at the moment. Have a human account with as few expansions as possible (no barracks whatsoever), get to the orc chapter, and only have a flying academy wonder maxed. The amount of priests from the flying should get you far, and you can use many + mage boost buildings on them. That way i think you can keep your SS really low so even with high losses on the later provinces, its still manageble. And if not the good cost is probably also cheap."}, {"17": "Heymrdiedier said:\t\t\tI only see 1 good strategy at the moment. Have a human account with as few expansions as possible (no barracks whatsoever), get to the orc chapter, and only have a flying academy wonder maxed. The amount of priests from the flying should get you far, and you can use many + mage boost buildings on them. That way i think you can keep your SS really low so even with high losses on the later provinces, its still manageble. And if not the good cost is probably also cheap.\t\tClick to expand...Ummm[BR]I want a barracks I like fighting,  especially in a human city (see the warrior lady in my signature?), but perhaps you meant armories.[BR][BR]Get to orc chapter with a fully leveled Flying Academy, which is from Woodelves, that sounds challenging. [BR][BR]I think if we build a balanced city  with the right Wonders at the right times  that all manner of things will go well.  After all, that's what the devs tell us to do in the videos and Q&As."}, {"122": "I have been reading that doing the tec tree makes tournaments harder  [BR]What am not sure is  does that mean  doing a chapter or just doing  a research in the tree"}, {"22": "malph said:\t\t\tI have been reading that doing the tec tree makes tournaments harder[BR]What am not sure is does that mean doing a chapter or just doing a research in the tree\t\tClick to expand...It's completing each (mandatory) research within the tech tree."}, {"30": "I was worried about the 3 production queues since that required 3 times the supply requirement for troops to make real use of it. So far it looks ok for me since I don't have to add anything to boost my supply production. However, it will take a few weeks for me to build up the troops required to try beyond the 25th province. Still, Orcs production is a challenge since I have to find space for another armoury to really boost it.[BR][BR]Restarting my view on the use of AWs and expansions in the troop size calculation, bad design idea."}]