[{"24": "alsael said:\t\t\twell,thanks for your answer @Pauly7.Those upgrades can boost some military AW,also bigger training sizes with brown bear=bigger bonus troops.IF the impact in tourney is managable of cource [smilie--sprite1]Click to expand...[BR]No effect whatsoever on the brown bear. Squad size has nothing to do with training size. It is only an unfortunate similarity in name because of the word \"size\"."}, {"22": "Gargon667 said:\t\t\tNo effect whatsoever on the brown bear. Squad size has nothing to do with training size. It is only an unfortunate similarity in name because of the word \"size\".\t\tClick to expand...Indirectly it will, because more SS researches boosts the bulwark, which increases the training size."}, {"24": "only if you have a Bulwark, which I don´t [smilie--sprite7] [BR][BR]btw definitely a candidate for deleting with the new tourneys if you have one now.[BR][BR]Anyway indirectly everything is always connected to everything else."}, {"32": "FieryArien said:\t\t\tJust small remark: to the Bulwark yes (it increases training size based on researched squad size); to the Shrooms no (it increases training size based on sum of levels of all built Armories).\t\tClick to expand...Pauly7 said:\t\t\tWhoops I never even noticed that. I just assumed it was the same as Bulwark.\t\tClick to expand...[BR]Iy is based on SS,[BR]@FieryArien is talking about the Training size[BR]@Pauly7 was clearly talking about the free units, free units from all wonders are indeed based on SS is x% of your SS."}, {"75": "Perhaps we should start a discussion thread next week prior to start of new tourney ... \"What I deleted (today/this week) for the new tourney\" ...[BR][BR]Would be very interesting to see what people decide to delete over the next weeks ... which AWs, the game itself ..."}, {"22": "Verde said:\t\t\tWould be very interesting to see what people decide to delete over the next weeks ... which AWs, the game itself ...\t\tClick to expand...It's such a depressing thought. We should never be in a position where we're considering deleting Ancient Wonders.[BR][BR]I don't know if this is coincidence, but I'm running into a lot more people these last few weeks who are saying \"I'm taking a break from the game\" or \"I'm not able to be properly active in the game right now.\" I think with these changes, even if people aren't quitting their games in a blaze of glory, we're already seeing people just start to drift away."}, {"75": "Pauly7 said:\t\t\tIt's such a depressing thought. We should never be in a position where we're considering deleting Ancient Wonders.\t\tClick to expand...Agreed, just think it would be good to know what people decide to do ... may just give a more concrete/specific idea of impact.[BR]May also be useful information for anyone still trying to decide ..."}, {"2": "Hekata said:\t\t\tReally not excited to be a guinea pig. If I wanted that I'd have an account on Beta. Also not entirely fair that other servers get to enjoy the old tournaments for at least 3 weeks longer than the EN one.\t\tClick to expand...What is the benefit for us for testing stuff? We are not Beta, we didn't apply for this job. [smilie--sprite8]  All other servers will have 3 more weeks to get as many KPs as they can, we don't. So, I ask again: What do we get from becoming Beta2?"}, {"70": "Yeah, I like to collect them all. I have the ones I like the least at level 6, others level 7, others near 10, the MM to 15, and Needles to 31.[BR][BR]I also have premium expansions, a bunch, and I am only in S&D (43.5K AW pts), so its going to be interesting.[BR][BR]Hence, the reason I shared of other aspects. I am the only one that said \"relics\"... yeah, those relics... you have scores of those, they are worse than garbage, right? If you add you food crafting, and your CCs crafting, plus leveling up (now much slower) your AWs... you will be short of relics in 2-3 months. Maybe 6 months or a year if you played since the game loaded for the first time haha, but you will run out.[BR][BR]So this means fewer CCs... something you need (also for pet food), for most crafts, except that sweet KP craft that costs 8 broken shards and a few spell fragments. And broken shards... the amount will be reduced, and also, your actual runes will reduce too. We will run shorter on both WS and \"heating the sun\" spells, but apparently we will need more troops.[BR][BR]The economy changed when the tiers changed. The foundation of the economy, or half of it, started to shift when AW KPs decreased from 45, to 25 diamonds each. With tournament changes, the economy will transform, and that's never easy, but we will manage... our way to play and grow will change, but the Spire is becoming even easier, which is a relief, as the Spire provides important stuff... and those Spire sets will increase exponentially in value.[BR][BR]I enjoyed my last (for now I guess) max 5th round. 46 provinces [smilie--sprite1], and will six-star them, as a memento haha. But a few months into the new tournament, we all will be fine [smilie--sprite1][BR][BR]Alcaro said:\t\t\tWhat is the benefit for us for testing stuff? We are not Beta, we didn't apply for this job. [smilie--sprite8]  All other servers will have 3 more weeks to get as many KPs as they can, we don't. So, I ask again: What do we get from becoming Beta2?\t\tClick to expand...[BR]Yep... that aspect is a little bit odd, but I lived in the US many years, and also, I was born there until five. I spent the other have of my life in a few places here in Europe, and well... the American mind is different than hours. If you lived there, (Chicago, New York, San Diego, Boston, I know no more) we must understand. [BR][BR] I agree 100% with you, but I think for INNO is best to do it for us, English speakers, but with a mentality more ready for this changes.[BR][BR]Also, if we are the international server, that's also the reason. But yeah, the other servers will have a few thousand extra KP per decently developed player haha. But hey, we will gain our tricks, and tips before them too."}, {"68": "Alcaro said:\t\t\tWhat is the benefit for us for testing stuff? We are not Beta, we didn't apply for this job. [smilie--sprite8]  All other servers will have 3 more weeks to get as many KPs as they can, we don't. So, I ask again: What do we get from becoming Beta2?\t\tClick to expand...I'm looking on this as a soft launch, the new tournament is now in its 4th week in Beta, there are many many posts on the Beta Forum, not many people are brimming with enthusiasm about it.  So they bring it to the EN servers and tell us that they will release to the rest of the live servers in 3 week's time.  There have been a few minor or cosmetic changes since it was released on Beta and I'm expecting something similar here.[BR][BR]People will complain, of course they will, but on the basis that the bulk of the complaints from Beta have fallen on totally deaf ears I don't see any major changes happening to this new tournament before it hits the rest of the live servers."}, {"2": "@Piglets For All - I am a Beta player and one city for testing it's enough. Beside not being rewarded in any way for testing things, we don't get discounts or promotions like we get here either.[BR]I don't care about soft launch, if you (not you Piglet [smilie--sprite8] ) mess with my city and evolution of it, at least sugar coating it with something. Otherwise, keep the testing in Beta."}, {"79": "Verde said:\t\t\tWould be very interesting to see what people decide to delete over the next weeks ... which AWs, the game itself ...\t\tClick to expand...They should change the name.Ancient Wonders-->Today Burdens...."}, {"22": "Verde said:\t\t\tAgreed, just think it would be good to know what people decide to do ... may just give a more concrete/specific idea of impact.[BR]May also be useful information for anyone still trying to decide ...\t\tClick to expand...For me, the two that are in the cross-hairs are the Lighthouse of Good Neighbourhood and Sunset Towers. With these two it's partly because I haven't upgraded either past level 3. The Lighthouse was an experimental idea to boost my coin production through increased culture bonus, but the effect is so far minimal. Right now I can do without ST because I am always awash with seeds, except for the times I am trying to work through a chapter (which, frankly, might never happen again). I'm just not sure how much impact it will have if my seed decay goes back to 10%.[BR][BR]I am loathed to sell my Thrones of the High Men or Watchtower Ruins, despite them being obvious choices. I don't care at all about the ranking points Thrones gives, but I built it in the first place because I love the building so much - that hasn't changed, so I should stick to my guns. Also, both these Wonders are giving me over 20k culture each so in terms of coin production they might be more important to me than the Lighthouse. It's hard to really say, when all those two Wonders have to do is ensure my culture bonus stays on full sun, whereas Lighthouse gives extra.[BR][BR]The last candidate is the Great Bell Spire. I've kept this around since the great nerf. The biggest reason is its effect on Neighbourly Help duration. The same goes, again, for Watchtower Ruins. The two of those kind of work together.[BR][BR]All these Wonders don't hurt me at all right now, save for the space they are sitting on, so with the slightly loose arguments above I have no temptation to get rid of any, but once all their respective levels start hurting my tournaments then it becomes increasingly difficult to not consider axing them."}, {"22": "Interestingly though, to add - in my Beta city, which is now nearing the guest races, I wouldn't consider building any of the above now (along with, of course, the Maze, Enar's Embassy and Blooming Trader Guild.)"}, {"2": "I am thinking at the players who will hit ch.15 and 16 with these new changes ... how many months will they need to complete those two chapters? Alltogether over a year?"}, {"81": "\" Enemy unit types for each Tournament Province are selected at random, with different weighting based on Tournament type. This means that, while it is possible for each enemy unit type to appear during any Tournament, there are higher probabilities for specific units to appear than for others, allowing for some preparations, but still bringing a challenge by throwing further unit types into the mix. \"[BR]Any chance of Inno advising us what the bias for the Planks tournament will be before Tuesday ? Just in case they are thinking of allowing for some preparations ?"}, {"22": "As far as I can tell the bias is supposed to lean towards the units we're used to finding in each tournament. It's very hit and miss though."}, {"82": "With an upcoming FA on the horizon, has there been any information on changes to badge requirements, FS ability to harvest required resources for certain badge type will be somewhat diminished by the reduced attainable  provinces levels."}, {"22": "The badge requirements are very similar to the last one."}, {"78": "It would make it easier if AWs could be teleported."}]