[{"27": "malph said:\t\t\tI have been reading that doing the tec tree makes tournaments harder [BR]What am not sure is  does that mean  doing a chapter or just doing  a research in the tree\t\tClick to expand...- Every mandatory research increases tournament difficulty. (“Mandatory” == an arrow/line leads from it to another later research)[BR]- Every placed expansion increases tournament difficulty.[BR]- Every built wonder level increases tournament difficulty.[BR]- Every boosted relic of your most boosted good (T1, T2, or T3) increases tournament difficulty. That’s until you reach 500 boosted relics, then more relics won’t make it harder anymore.[BR][BR]InnoGames claim that the bonus you get from progressing is more beneficial than the cost of increased difficulty. A lot of players disagree."}, {"122": "Pauly7 said:\t\t\tIt's completing each (mandatory) research within the tech tree.\t\tClick to expand...[BR]well then that means i will be staying where i am in research   ...[BR]I believe what m4rt1n said could be true  Inno games wants all the long term players to quit because they no longer spend so new players come in, buy and leave [BR]All you need to do is look at the 30 highest ranked  fellowships  12 of them are recruiting  and there is 19 spaces free in those 30 fellowships [BR]It was never like that before this new system came out ..And i know there is others on the verge of leaving[BR]I really think Inno have killed this game"}, {"65": "yes, the game is broken [smilie--sprite3] before it was a joy to do tournaments and you could always say, it´s good, it gives you a lot of kp. but now we don't need kp anymore, we can't do tech, we can´t upgrade AW-s, its just memories what leads us to do tournament now, but it's not needed anymore for nothing"}, {"1": "People [smilie--sprite1], we do not want to break the game, and neither we want to please only a specific group of players.[BR][BR]Comments such as \"the game is broken\", or \"Inno killed the game\" only will promote more negativity. Since the first week arrived, a lot changed, and the developers still did not decide that the tournament is final as we know it, hence weekly updates on the tournament.[BR][BR]All comments are welcome but please, fellows, comments such as the abovementioned will not help to fix a thing, but the contrary. The developers are working to keep the game best for everybody, and that takes some time."}, {"86": "Well sorry @anonglitch but kurgkurg was only expressing his thoughts. He is not the first, and certainly won’t be the last to feel that way. And to be honest stopping only the negative comments is neither freedom of speech nor encouraging other players to comment in this thread."}, {"54": "anonglitch said:\t\t\tPeople [smilie--sprite1], we do not want to break the game, and neither we want to please only a specific group of players.[BR][BR]Comments such as \"the game is broken\", or \"Inno killed the game\" only will promote more negativity. Since the first week arrived, a lot changed, and the developers still did not decide that the tournament is final as we know it, hence weekly updates on the tournament.[BR][BR]All comments are welcome but please, fellows, comments such as the abovementioned will not help to fix a thing, but the contrary. The developers are working to keep the game best for everybody, and that takes some time.\t\tClick to expand...Sorry we all in agreement that the current changes are breaking the game, many people only hang on, because they hope it will still be altered. But once they realise it won't, they are gone. Since the first week on beta (2 months ago?) nothing changed except that they made the impact of expansions slightly less. Thats only a minor impact and only gives us the impression that it is final.[BR][BR]Maybe if someone told us what is still about to change, we might think otherwise, but we have not been given a single reason to get the feeling the developers are even listening.[BR]Giving us a heads up on alterations might also be a good thing for inno, since it allows us to give feedback on them before they cost much develop time (because likely the suggested change will only make it worse).[BR][BR]I can give a whole list of explanations of why this breaks the game, but I don't feel like its needed since so many others already said it (so I'm definately not the only one who sees the big picture)"}, {"15": "Heymrdiedier said:\t\t\tMaybe if someone told us what is still about to change, we might think otherwise, but we have not been given a single reason to even get the feeling the developers are even listening.[BR]Giving us a heads up on alterations might also be a good thing for inno, since it allows us to give feedback on them before they cost much develop time with the result in only making it worse.\t\tClick to expand...This! [BR]It would be very helpful if we could know what other changes are being considered because as it is now it really feels like they are just collecting the tournament results to be sure they are constant and then they will roll it our on all servers."}, {"122": "I would like to ask how much longer are we going to be testing this ??[BR] it got extended for testing  but  when is it going to all servers .[BR]Please dont say its going to be extented again  There has been enough feed back to let the Devs know what the problems are  and as been said by others  not much has changed  so the question is  when is it going live  [BR]an answer would be very nice please"}, {"22": "anonglitch said:\t\t\tComments such as \"the game is broken\", or \"Inno killed the game\" only will promote more negativity. Since the first week arrived, a lot changed, and the developers still did not decide that the tournament is final as we know it, hence weekly updates on the tournament.\t\tClick to expand...And the problem with promoting negativity is what? It makes the developers feel worse about having made really bad decisions with this tournament? If people feel strongly like this then being negative is absolutely the best course of action. To echo what others have said, this is indeed breaking the game. People have been saying it since the day it was announced, because they could see what the pitfalls are. The more people that are made aware the better, in my opinion."}, {"14": "@anonglitch Can you stop provoking people, and stop telling them what they are allowed to say?[BR][BR]Please let @herodite and @Silmaril handle this thread. Much better for everybody their blood pressure."}, {"32": "Pauly7 said:\t\t\tAnd the problem with promoting negativity is what? It makes the developers feel worse about having made really bad decisions with this tournament? If people feel strongly like this then being negative is absolutely the best course of action. To echo what others have said, this is indeed breaking the game. People have been saying it since the day it was announced, because they could see what the pitfalls are. The more people that are made aware the better, in my opinion.\t\tClick to expand...[BR]Even better we did not just said it.[BR]We have even shown it with clear examples and reasoning,[BR][BR]It wasn't just ranting about change, but constructive feedback which has been ignored since day 1."}, {"84": "Killiak said:\t\t\t@anonglitch Can you stop provoking people, and stop telling them what they are allowed to say?[BR][BR]Please let @herodite and @Silmaril handle this thread. Much better for everybody their blood pressure.\t\tClick to expand...[BR]+1 This is a forum where people are allowed to express their opinions and views. It is not the job of mods to tell people what they should or should not say unless those people are breaking the rules."}, {"100": "@anonglitch Stop being negative? Man, InnoGames has been absolutely negative to all players claims and arguments about their absurd and foolish tournament changes, people have used all their well based arguments so you can get a real clear picture of what´s going on and how to solve this, and instead of F.....G make some good changes to the problem root in the tourney, InnoGames just have ignored all this and keep going in this madness.[BR][BR]@Muf-Muf  The People here in Elvenar, fellows of all FS are starting to leave the game, this is something real, we can´t find new recruits, and it will only get worse because of your greed to the money."}, {"122": "Timneh said:+1 This is a forum where people are allowed to express their opinions and views. It is not the job of mods to tell people what they should or should not say unless those people are breaking the rules.Click to expand...[BR]I Agree  with this"}, {"26": "anonglitch said:\t\t\tPeople [smilie--sprite1], we do not want to break the game, and neither we want to please only a specific group of players.[BR][BR]Comments such as \"the game is broken\", or \"Inno killed the game\" only will promote more negativity. Since the first week arrived, a lot changed, and the developers still did not decide that the tournament is final as we know it, hence weekly updates on the tournament.\t\tClick to expand...I'm sorry, but since the day one the new tournament system arrived on beta nothing has been changed to fix the core issues, all the tweaks we've got so far are purely cosmetic. So no, you can't say that a lot has been changed. It's nearly two months that players are giving constructive feedback with zero response from Inno. The devs neither acknowledge the issue with the torunament formula nor explaining why it isn't the issue in their opinion. Is there any surprise that the comments are getting more and more negative? I don't know if you want to break the game or not, but you clearly don't want to fix it."}, {"104": "people should be allowed to say their opinion, and mine is the same as the many negative comments about the game, the changes have not been in the interest of the players and will ultimately not be in the interest of inno."}, {"53": "I seem to have read anonglitch's comment differently to others - not as criticism or censorship, but merely as an appeal for constructiveness and also for some understanding for the developers.[BR][BR]Along with just about everyone else posting here, I would like to see changes made to the new tournament, and am also frustrated by the lack of information about this. On the other hand, I can't see that flaming the moderators will help in any way."}, {"22": "Far Reach said:\t\t\tI seem to have read anonglitch's comment differently to others - not as criticism or censorship, but merely as an appeal for constructiveness and also for some understanding for the developers.[BR][BR]Along with just about everyone else posting here, I would like to see changes made to the new tournament, and am also frustrated by the lack of information about this. On the other hand, I can't see that flaming the moderators will help in any way.\t\tClick to expand...We didn't read it differently, but the problem is that many people feel that they have been constructive and a response asking people to not be negative about a situation people feel strongly negative about, does not go down well.[BR][BR]Imagine if your employer told you that they are going cut the wages of everyone in your team by 50% and then told you it has to happen because there's no other way to save money. If you then explained that you weren't happy about being asked to lose half your money and there are several different good ways of getting the same savings, how would you feel if they turned around and said \"Don't be negative. That will achieve nothing and will make other people negative.\"?"}, {"33": "Heymrdiedier said:\t\t\tSorry we all in agreement that the current changes are breaking the game\t\tClick to expand...[BR]Don't try to speak for everybody. I think the changes to tournament are great. It's much better than before. Earlier it was a pain to do, ask my poor fingers tired from pressing the mousebutton forever. Also I prefer the tournament to be a challenge. A game is not supposed to be easy, easy games are boring.[BR][BR]But it's no surprise that people mostly complain here. The people who like the change have no urgent reason going to the forum and express their view. It's mostly those complaining that enters the forum to write their opinion. Nothing strange with that, it's human nature."}, {"17": "I agree with Far Reach and Valle; there is no reason to dump on Anonglitch. There is already two message threads for folks who want to express their disappointment,  while here is where we need to be adding to our impressions (new players expressing their opinions), and helping each other and so forth.  Perhaps that is what was intended when the Moderator quite rightly tried to redirect the comments."}]