[{"122": "I have given positive feedback and also negative feedback [BR]but being told not to give negative feedback  is out of order [BR]The forum is for freedom of speech as long as no rules are broken [BR]We get told nothing from the Devs [BR]We have no idea how long this test is going to last [BR]The amount of FS looking for players should be a warning sign of [BR]what is happening but still  we hear nothing .If they dont talk to there customers (thats us)[BR]then more and more are gonna leave and that means even more FS will be looking for players [BR]And to me that is a major problem ..[BR][BR]@ valle  the balance has been proven by people that are alot better than me at maths that the formula [BR]is not working Esp for bigger cities"}, {"15": "valle said:\t\t\tEarlier it was a pain to do, ask my poor fingers tired from pressing the mousebutton forever. Also I prefer the tournament to be a challenge. A game is not supposed to be easy, easy games are boring.\t\tClick to expand...While I agree on the less kicking being much better I completely disagree on the challenge part. I auto-fight only and with the old system I could try out some different troops combination and was usually successful at it. It was fun and interesting. I also liked that sometimes we could get just 1 type of enemy unite and some times we were facing more than 5. Now it's a) monotonous because we know it's always 5 enemies and b) 0 strategy: either I find 1 type of troop that can kill at least 4/5 enemy unites or I have to cater. Mixing troops is impossible I get whipped out every single time. Well that's not exactly true, you can mix them in provinces 1-6,  because those provinces where made so easy that you can send HM against Mages and LR and still win with barely any loses, so any kind of combination goes. Past province it's 12 impossible."}, {"33": "Hekata said:\t\t\tWhile I agree on the less kicking being much better I completely disagree on the challenge part. I auto-fight only and with the old system I could try out some different troops combination and was usually successful at it. It was fun and interesting. I also liked that sometimes we could get just 1 type of enemy unite and some times we were facing more than 5. Now it's a) monotonous because we know it's always 5 enemies and b) 0 strategy: either I find 1 type of troop that can kill at least 4/5 enemy unites or I have to cater. Mixing troops is impossible I get whipped out every single time. Well that's not exactly true, you can mix them in provinces 1-6,  because those provinces where made so easy that you can send HM against Mages and LR and still win with barely any loses, so any kind of combination goes. Past province it's 12 impossible.\t\tClick to expand...[BR]Do we play the same game?  Earlier you could often use the same 5 units for every fight. Thats not much of a challenge. Now there is much greater variation in the opposition. In this round I've used all sort of units. Also saying that you can't mix troops after province 12 is just wrong. In this round I've done a lot of 3-4 HM + 1 - 2 HR (or M). I used 2DA + 2 ELR and won mixed fights above province 40. I'm sure I could have done that past province 12 with no boost buildings."}, {"84": "valle said:\t\t\tI think the changes to tournament are great. It's much better than before. Earlier it was a pain to do, ask my poor fingers tired from pressing the mousebutton forever. Also I prefer the tournament to be a challenge. A game is not supposed to be easy, easy games are boring.\t\tClick to expand...[BR]I think most people will agree that the reduction in clicking is a good change, it has been asked for several times but your claim that games are not meant to be easy is how you prefer them to be and many people might think differently. Some people play games to relax and therefore might prefer a game that is without stress."}, {"15": "valle said:\t\t\tDo we play the same game?  Earlier you could often use the same 5 units for every fight. Thats not much of a challenge. Now there is much greater variation in the opposition. In this round I've used all sort of units. Also saying that you can't mix troops after province 12 is just wrong. In this round I've done a lot of 3-4 HM + 1 - 2 HR (or M). I used 2DA + 2 ELR and won mixed fights above province 40. I'm sure I could have done that past province 12 with no boost buildings.\t\tClick to expand...Yes, in the previous system you could use the same 5 unites in a lot of rounds but you could mix them. Now in theory I should mix them more because the enemies are more random but every single time I do that I have either 1 soldier left standing or I loose.  I can't put down 2 DA because I don't get them despite going to the top of the spire every week. I've put down my last one for this tournament, I have 0 left in inventory. So I guess we are not paying the same game  [smilie--sprite1]"}, {"20": "valle said:\t\t\tDo we play the same game? ....... I'm sure I could have done that past province 12 with no boost buildings.\t\tClick to expand...I never really thought about it, but put like that, I am beginning to wonder too.  Always thought the top guys were very good, but what if we do have different games..."}, {"54": "valle said:\t\t\tDon't try to speak for everybody. I think the changes to tournament are great. It's much better than before. Earlier it was a pain to do, ask my poor fingers tired from pressing the mousebutton forever. Also I prefer the tournament to be a challenge. A game is not supposed to be easy, easy games are boring.[BR][BR]But it's no surprise that people mostly complain here. The people who like the change have no urgent reason going to the forum and express their view. It's mostly those complaining that enters the forum to write their opinion. Nothing strange with that, it's human nature.\t\tClick to expand...[BR]Sorry you are right, I can't speak for everyone. And Im sorry your reply to my post give you some criticism as well now, I don't think you deserve that.[BR]I also like a challenge, very much even, I gives me a great feeling if i can beat something that 90% of the players can't beat. But at the other hand, if 90% of the other players can't beat it and get frustrated, they give up. I don't want a multiplayer game to only caters my needs, because that eventually would lead to a single player game, which ends in an end-game since no more income.[BR][BR]for many players its not fun if they have to work a whole week to train 50 troops, only to see 40 of those being lost on a single fight. A fight they tought they could win. It can be fun to win against an enemy with only 1 unit left standing on your side. But the amount of work it takes te replenish those lost troop is too long to have this enjoyable feeling last. And the frustration just gets bigger when you hear that your fellow who's in the same chapter as you, can replenish those troops in half the time of you, only because he started playing 2 years later then you and therefor has less expansions and wonderlevels.[BR][BR]Thats only a few things that are wrong with the new tournament setup, but that doesn't mean I don't like the new challenge. In my opinion tournaments were overdue for some changes, it was getting dull, it should have been changed when spire came out, instead of the overexpensive spire itself.[BR]But getting a new challenge doesn't mean we can't critisize other parts of the change that we can clearly see derailing already.[BR][BR]Have you heard of the phrase: fool me once, shame on you, fool me twice, shame on me? When spire came out many of us complained it was overexpensive, we couldn't put hard numbers on it, so it was ignored mostly and just passed to live servers without listening to that feedback. Only later we found out the exact formula and we could pinpoint the exact point where it goes wrong. So when they try to use (nearly) the same formula on another beloved part of the game, of course we won't be fooled again and will act up, this time much more then last time when we were ignored."}, {"33": "malph said:\t\t\t@ valle the balance has been proven by people that are alot better than me at maths that the formula[BR]is not working Esp for bigger cities\t\tClick to expand...[BR]My 2 cities (W and F world) are ranked about 40, so I guess they should qualify as bigger cities. I'm not saying that the formula is perfect, but it's good enough for me. It's the same for everybody. If an AW isn't worth the place it uses then I'll sell it, I've done it before. Can't really see the big problem. The same with old event buildings, it comes a day when they are not worth keeping too. This is a city building game, sometimes old buildings have to go. It's about beeing able to adapt."}, {"22": "valle said:\t\t\tIf an AW isn't worth the place it uses then I'll sell it, I've done it before. Can't really see the big problem. The same with old event buildings, it comes a day when they are not worth keeping too.\t\tClick to expand...There's a big difference between an old event building and an AW that someone has invested 5,000KP into and maybe also put real money into."}, {"14": "valle said:\t\t\tIt's about beeing able to adapt.\t\tClick to expand...[BR]How lovely that you think it is about that, but plenty of people have so far explained why they don't agree with that.[BR]And as you said before: \"Don't try to speak for everybody\""}, {"45": "This is incorrect @Lelanya this is the only thread for players to discuss and air their opinions regarding the Tournament changes. This is where information is being collected from. Please do not encourage players to dilute this across other threads."}, {"1": "Killiak said:@anonglitch Can you stop provoking people, and stop telling them what they are allowed to say?[BR][BR]Please let @herodite and @Silmaril handle this thread. Much better for everybody their blood pressure.\t\tClick to expand...[BR]We are all trying to help here as a team [smilie--sprite1] We are one collective team! Each of us bring something, I am just trying to calm the waters down, that's all [smilie--sprite1]"}, {"22": "anonglitch said:\t\t\tI am just trying to calm the waters down, that's all\t\tClick to expand...I appreciate that you are... It just didn't go well that time!"}, {"20": "Something has struck me while reading one of the other threads. This is the international server. Not all of us are English mother-tongue speakers. A different word choice, a word put in the wrong order in a sentence, so many things that can change the meaning of a sentence.  I guess one has to keep that in mind whenever reading what others wrote, or even go over what one has written oneself.  [BR][BR]Peace to all!"}, {"15": "I just had an interesting fight in my Hleflings city: I had a combo of HR and HM unites against me and I happily went with 5 Sorceresses since that should be a no-brainer and I lost! (province 18, round 3). Then I tried with blossom mages and I won with barely any losses. My sorceresses are 3* and the Blossoms are 2*. I read that the Elven mages are weak but I had no idea they were that much weaker."}, {"22": "Hekata said:\t\t\tI just had an interesting fight in my Hleflings city: I had a combo of HR and HM unites against me and I happily went with 5 Sorceresses since that should be a no-brainer and I lost! (province 18, round 3). Then I tried with blossom mages and I won with barely any losses. My sorceresses are 3* and the Blossoms are 2*. I read that the Elven mages are weak but I had no idea they were that much weaker.\t\tClick to expand...Blossom Mages are strong against HM, whereas the Sorceress will be more of an all rounder. I like taking out the Blossom Mages if I see lots of heavy melee coming my way."}, {"15": "Pauly7 said:\t\t\tBlossom Mages are strong against HM, whereas the Sorceress will be more of an all rounder. I like taking out the Blossom Mages if I see lots of heavy melee coming my way.\t\tClick to expand...Alright, thanks, I'll try to keep that in mind for next time but still.... One would expect that if the Sorceresses lost the Blossoms could win but with half of the troops lost or something like that. This is full annihilation vs an almost 100% win. And as I said they are nor even at the same level yet."}, {"22": "Someone may say something about special abilities, which I'm still not an expert on. Those frogs, for example, can knock down troops quickly, even when they have a lower star rating than a different kind of HR. The difference may have been that your Blossom Mages were able to one-shot the enemies, so took no losses. If the Sorceresses didn't dispatch them on first hit or by the time the HM caught up with them, then they may have gotten brutalized."}, {"15": "Pauly7 said:\t\t\tSomeone may say something about special abilities, which I'm still not an expert on. Those frogs, for example, can knock down troops quickly, even when they have a lower star rating than a different kind of HR. The difference may have been that your Blossom Mages were able to one-shot the enemies, so took no losses. If the Sorceresses didn't dispatch them on first hit or by the time the HM caught up with them, then they may have gotten brutalized.\t\tClick to expand...I see.  As you know I didn't have the Merc Camp or the Training ground until now so I guess I have to learn a bit about the new troops. In any case one thing is sure, I'm only training Blossoms from now on  [smilie--sprite8]"}, {"22": "Hekata said:\t\t\tI see. As you know I didn't have the Merc Camp or the Training ground until now so I guess I have to learn a bit about the new troops. In any case one thing is sure, I'm only training Blossoms from now on [smilie--sprite8]Click to expand...I've never used the Sorceresses of course, but your problem doing that may be when you come up against a more even split of HM and HR."}]