[{"33": "Pauly7 said:\t\t\tThere's a big difference between an old event building and an AW that someone has invested 5,000KP into and maybe also put real money into.\t\tClick to expand...[BR]Some people spend real money in events to get certain buildings."}, {"33": "Killiak said:\t\t\tHow lovely that you think it is about that, but plenty of people have so far explained why they don't agree with that.[BR]And as you said before: \"Don't try to speak for everybody\"\t\tClick to expand...[BR]I've never claimed to be speaking for everybody. I state my own opinion. And about beeing able to adapt I think thats important to be able to do that in a game like this. If you don't, well good for you [smilie--sprite2]"}, {"32": "Hekata said:\t\t\tAlright, thanks, I'll try to keep that in mind for next time but still.... One would expect that if the Sorceresses lost the Blossoms could win but with half of the troops lost or something like that. This is full annihilation vs an almost 100% win. And as I said they are nor even at the same level yet.\t\tClick to expand...Pauly7 said:\t\t\tBlossom Mages are strong against HM, whereas the Sorceress will be more of an all rounder. I like taking out the Blossom Mages if I see lots of heavy melee coming my way.\t\tClick to expand...[BR]It has nothing to do with what are there strengths.[BR]and everything to do with range.[BR][BR]The sorceres/banshee can't attack without exposing themselfs to the enemies counter attack.[BR]The blossom mage / priest can attack the enemy and stay out of there range giving them another \"free\" round of attacks.[BR][BR]Also the longer the range, the less suseptable units are to map layout issues.[BR][BR]This is the reason banshees and sorceres suck and blossom/priest rule.[BR][BR]Range can be a very powerfull ally, and every \"booster\" that increases there attack strength only make them more awesome."}, {"54": "CrazyWizard said:\t\t\tRange can be a very powerfull ally, and every \"booster\" that increases there attack strength only make them more awesome.\t\tClick to expand...[BR]shhh don't make mage boosters the new 'unbalanced' buildings in the game that need removal, we've had too many of those already recently (wishing wells, brown bears, fire phoenix)"}, {"33": "Killiak said:\t\t\tYet here you are, speaking for the people who 'like the change' but are not on the boards, because only 'complainers' write here.[BR]You don't have to claim it, to factually be doing it. Then you quickly turn around to say that it is only your opinion? Pfft. Hypocrit.\t\tClick to expand...[BR]I've not claimed to speak for anybody. About people not coming to forum I wrote that people not complaining are less likely to express their opinion compered to people that are unhappy. It's human nature. When everything is good you don't feel the need to express your view. But when you are unhappy about something you are more likely to express your view. Nothing strange about that.[BR][BR]A bit sad that you can't stand different opinions, but if you feel better only reading things you agree with I understand if you put me on ignore."}, {"57": "I am regularly achieving higher scores now than I did previously (just entering Amuni, so fairly big). Problem for me is that I'm simply not enjoying the new tournaments. The tournaments were the highlight of the week in the game and my FS chatted about them when they were active. Now zip, nada, nothing! Interestingly we have achieved gold for the last 3 weeks on the spire which is new for the FS. [BR]I just raise these points as a statement on how players seem to be reacting within our FS. We still achieve 10+ chests on the tournament but the fun has gone."}, {"65": "i don't want to be negative, but I'm at the point where I need to delete some my AW-s, as otherwise I cant upgrade others or I just need quit a game as I cant do here nothing more with my city  to be better[BR]I've been patiently waiting for devs to rethink something with this formula, and I don't have to do it, but seems it´s hopeless"}, {"8": "The only actual change that is clear for me to see is the 3 training queues, which wasn't what was needed to 'fix' the tournament but a suggestion posted by a player or two as a possible way of dealing with the huge losses incurred when the tournament went live here on the planks tournament.[BR][BR]@Silmaril - @herodite  - @anonglitch  All other suggestions seem to have been totally ignored, why is that?[BR][BR]I know you say they are looking/working on it, but if that's the case, why aren't we seeing it? This is the 5th week of 'testing'....just how long do they need?"}, {"45": "Developers are still looking at the Tournaments @OldHag as each different type has different challenges when it comes to units and of course player and fellowship scores. Information is still being collated daily and weekly.[BR]Why we are still asking for all Tournament feedback to be placed in this thread only until this is concluded.[BR]Sadly no date is mentioned yet, which to me is a good thing as it means more stats and feedback are being taken into consideration for the final version."}, {"122": "After 5 weeks of testing i will try to give an honest opinion [BR][BR]I agree that the tournaments were to easy to get a masive amount of KP[BR]and something had to be done ..But the new system is hurting to many players [BR][BR]The 1 click per prov round was a massive improvement [BR]Getting to train in all 3 buildings was another great improvement[BR][BR]I fear if the new system or formula for the tournaments is not changed or sorted out soon [BR]There is going to be a massive exodus..players have already left and now others are posting that there thinking about it [BR][BR]I feel  that  the Devs need to give us some kind of information on what there plans are [BR]before we lose  even more players ..[BR]So i ask the Devs  please listen and save the game we have played for so long"}, {"27": "Now this is plain evil.[BR]11354 vs. my 8811[BR]All five classes of enemies.[BR]Only autofight in the app.[BR]Negotiation asks for orcs AND mana.[BR]It’s just 9th province last round. (Equivalent of 15th province first star.)[BR][BR]I know it’s just RNG and these cases must happen occasionally to some players. Doesn’t help with my irritation. Also I’ve seen 5-classes fights too many times during this tournament. Both here and on my little beta city."}, {"24": "valle said:\t\t\tMy 2 cities (W and F world) are ranked about 40, so I guess they should qualify as bigger cities. I'm not saying that the formula is perfect, but it's good enough for me. It's the same for everybody. If an AW isn't worth the place it uses then I'll sell it, I've done it before. Can't really see the big problem. The same with old event buildings, it comes a day when they are not worth keeping too. This is a city building game, sometimes old buildings have to go. It's about beeing able to adapt.\t\tClick to expand...[BR]The formula is the same for everybody, but the result is not, since most end game towns are very similar in research and expansions, the main deciding factor is the AW levels. If you have lots (and I mean LOTS) the game is broken. I do not consider myself in this group I have around 330 AW levels and I will make sure never to get into that group. So yes the affected group is very small, but it is simply not acceptable to exclude a group of players entirely, because of sloppy programming. There is absolutely no need to exclude them, it can be fixed and should be fixed.[BR][BR]The other solution would be to clearly state by Inno that the game is intentionally broken for extreme high AW levels. If the game is meant to be played using a MAX of 33% of the available AWs, then they can blame people using more for making the mistake of not playing as intended..."}, {"24": "Heymrdiedier said:\t\t\tI only see 1 good strategy at the moment. Have a human account with as few expansions as possible (no barracks whatsoever), get to the orc chapter, and only have a flying academy wonder maxed. The amount of priests from the flying should get you far, and you can use many + mage boost buildings on them. That way i think you can keep your SS really low so even with high losses on the later provinces, its still manageble. And if not the good cost is probably also cheap.\t\tClick to expand...[BR]Not really a strategy this: [BR]Barracks are what makes humans good, if you play without them, you can just as well play elves.[BR]You can´t stay in chapter 8 and have an FA (chapter 9)[BR]There are no Priests in the Merc camp, they are in the barracks.[BR]a low SS has absolutely no use for the tourneys, quite the opposite, high SS has slightly positive benefits for tourneys.[BR]There are not enough MMM buildings available to play every tourney heavily relying on them.[BR][BR]So to sum it up: It is not the new tourney format that is causing your losses. As you improve your knowledge of how fighting works, your scores will improve."}, {"32": "Gargon667 said:\t\t\tThe formula is the same for everybody, but the result is not, since most end game towns are very similar in research and expansions, the main deciding factor is the AW levels. If you have lots (and I mean LOTS) the game is broken. I do not consider myself in this group I have around 330 AW levels and I will make sure never to get into that group. So yes the affected group is very small, but it is simply not acceptable to exclude a group of players entirely, because of sloppy programming. There is absolutely no need to exclude them, it can be fixed and should be fixed.[BR][BR]The other solution would be to clearly state by Inno that the game is intentionally broken for extreme high AW levels. If the game is meant to be played using a MAX of 33% of the available AWs, then they can blame people using more for making the mistake of not playing as intended...\t\tClick to expand...Muf-Muf sortly did that to say it was to \"avoid\" promotion of pushing.[BR]But as MinMax alsready pointed out, you do not burd dow the house to get rid of a mice infestation.[BR][BR]Gargon667 said:\t\t\tNot really a strategy this:[BR]Barracks are what makes humans good, if you play without them, you can just as well play elves.[BR]You can´t stay in chapter 8 and have an FA (chapter 9)[BR]There are no Priests in the Merc camp, they are in the barracks.[BR]a low SS has absolutely no use for the tourneys, quite the opposite, high SS has slightly positive benefits for tourneys.[BR]There are not enough MMM buildings available to play every tourney heavily relying on them.[BR][BR]So to sum it up: It is not the new tourney format that is causing your losses. As you improve your knowledge of how fighting works, your scores will improve.\t\tClick to expand...[BR]Manual and Knowledge of fighting is surely a mayor factor in this format.[BR]A secondary factor is ratio between SS and unit production, the more \"out of balance\" this factor is the easier it is, if you are really out of balance you can even auto and take those losses untill you really can';t win anymore.[BR][BR]Since a 7500%-15000% disparity between players is realistically possible it's just a matter of time before such accounts will be build,[BR]The new format also promoted goods pushing for the same reason. get a \"large account\" to feed the required goods to a small account. and you can get really far into the tournaments without much effort.[BR][BR]And we have seen this strategy before many times over in the past, so it's not unthinkable this will happen.[BR]Since orcs and mana are the main limiting factors you should not go past the orks as they are triggered in chapter 9, but you can unlock unlimited provincies (especially with tower boosters) and therefore create a quick and dirty tournament experience that will be unmatched. without the whole \"manual fighting hassle\"[BR][BR]And as the disparity between cycling quests and supplies and coins is farly low since you are still near the dwarven chapter. you could easily setup a mouse marcro or something similar to replenish your supplies and coins, the only limiing factor here is how much the costs are and how much coins fit in your main hall.[BR][BR]According to dony this limit is reached for him around province 95, where for him there was a negotiating hard cap.[BR][BR]How long do you think it will take for someone to kill every tournament this way as we have seem people willing to take this route before in the chapter 4 reigns with 7020 poins accounts in the pre-phoenix period?"}, {"124": "Something of an own goal on tournaments here Inno.[BR]You have made tournament provinces escalate in difficulty so fast that the vast majority of my FS now just play in the first 10 and go to higher levels in them. Whatever arrangements and adjustments and prizes you have changed in tournament provinces above 10 are more or less pointless, we are not going there.[BR]Additionally, given the switch away from biasing specific troops to each tournament and making opposition troops more random has meant the three helper artifacts for fighting (MMM, ELR & UUU) have lost much of their usefulness."}, {"4": "foolfighter said:\t\t\tSomething of an own goal on tournaments here Inno.[BR]You have made tournament provinces escalate in difficulty so fast that the vast majority of my FS now just play in the first 10 and go to higher levels in them. Whatever arrangements and adjustments and prizes you have changed in tournament provinces above 10 are more or less pointless, we are not going there.[BR]Additionally, given the switch away from biasing specific troops to each tournament and making opposition troops more random has meant the three helper artifacts for fighting (MMM, ELR & UUU) have lost much of their usefulness.\t\tClick to expand...[BR]The UUU is still very helpful as it is not troop type specific, 2 placed are the same as placing 1 Dwarven Armorer in effect but with a bigger footprint."}, {"1": "Trust us, folks, the developers are trying their best. For us, it is our beloved Elvenar, but for the developers, it's their bread and butter. The testing period extended precisely because of all your feedbacks. Sometimes, things are more complicated than they seem. Doing a small change in a specific in-game configuration may trigger disbalances elsewhere, providing with more negative in-game experience. As you all know, everything is very interconnected in the game. [BR][BR]I humbly believe it is excellent to keep testing. After all, you provided a lot of useful feedback about the tournament, and we apologize it becomes frustrating. They collect a lot more data than just checking out if the point-gain is stable to make it final. Let's hang in there, you provided some impressive feedback with numbers and all, and this helps enormously!"}, {"32": "anonglitch said:\t\t\tTrust us, folks, the developers are trying their best. For us, it is our beloved Elvenar, but for the developers, it's their bread and butter. The testing period extended precisely because of all your feedbacks. Sometimes, things are more complicated than they seem. Doing a small change in a specific in-game configuration may trigger disbalances elsewhere, providing with more negative in-game experience. As you all know, everything is very interconnected in the game.[BR][BR]I humbly believe it is excellent to keep testing. After all, you provided a lot of useful feedback about the tournament, and we apologize it becomes frustrating. They collect a lot more data than just checking out if the point-gain is stable to make it final. Let's hang in there, you provided some impressive feedback with numbers and all, and this helps enormously!\t\tClick to expand...[BR]There is only 1 thing we want to hear, acknowledgement they screwed up. and a promise they will start again from scratch with this update.[BR]This is the only correct action and one they should have taken 8 weeks ago when multiple players pointed out the fundamental problem and staved it with numbers and facts[BR]You say it's there bread and butter, but elvenar is not the only game inno-games survive on. there are always other projects.[BR]This whole fiasco sounds more like someone in power not willing to acknowledge there mistake at all cost.[BR]Those who are not in power don't dare enought to oppose and just think they better shut up and by the time it's gone, they transfer to a new department.[BR][BR]With every week the costs for this update rise and rise as more money is poured into this sinkhole of an update.[BR]3 barracks queue are now unlocked an update that should never been hit live servers in the old format.[BR][BR]The hole is getting deeper and deeper. at this rate by the time they are finally willing to acknowledge there screwup the game is either dead or more difficult to repair."}, {"125": "Anonglitch it's good to see that the data is being used. And that the reason the developers are still making adjustments is due to player input. Thanks"}, {"126": "Well, I did it.  After playing this game for well over 4 years and reading the Forums for nearly as long, I just had to break down and log on to the Forums so I could say my piece.  I know it won't do any good, that is painfully obvious, but it will do me some good I think.  So before I start, to those of you that are going to read this, I will apologize now for being so long winded.  I never expected that I would write something here and I doubt I will again, so that is the good news.  And ananglitch, you may want to put me on ignore because this is going to be very negative, and I do believe the game has been broken, a few times over the last year or so, but now it is dying.  A very slow, agonizing painful death.[BR][BR]I have 3 cities at varying stages of development.  When I first started the game I did purchase diamonds to purchase expansions and get my Builders hut up to level 4 and many times after that I purchased the little outpost buildings for the Events to get more prizes.  But when all the prizes were, as they say here, \"nerfed\", I quit buying them because there was little value in the prizes that were being offered.  But that's another story, but just to let Inno know, they lost a paying customer there.[BR][BR]I can't say that I have worked hard to get my cities where they are.  There is nothing hard about tapping keys or clicking a mouse, but I have invested a lot of my time.  I didn't mind that because I could actually see the benefits of investing that time as my cities grew and I was able to accomplish more and more things and I was able to go further and further in the Tournaments.  At least back then there was a goal to strive for and I could always see myself getting closer and closer to those goals.  Now all that is gone, done, finished, broken.[BR][BR]The Events used to be my favorite part of the game.  There was a challenge that I gave myself.  I always wanted to see how far I could go and how fast I could get there.  I never complained or thought anything of it when the quests were done because I specifically made the conscious decision to do that.  Over the past year or so, although I do complete the Events, it is more because it is just something to do, certainly not for the prizes, and I certainly don't rush through them.  I can't afford to use the time boosters, I need them to train troops.  Now they have pretty much become a necessity because the Tournaments are so screwed up I have no choice because I need those troop boosters just to compete.  For me, it has turned the most fun part of the game into a job.  Broken.[BR][BR]Then there is the Spire.  It is what it is.  Crazy expensive in troops and goods.  The thing about the Spire is that it gives you some good stuff sometimes.  There is really nothing there that you need to grow your city, but it can sure make it easier.  In one of my cities I always get to the top and I always get all of the FS rewards as well.  My other 2 cities, as far as FS rewards go, I almost always just get the 50 Diamonds.  I usually go a bit higher but it really doesn't make sense to use up the Troops and goods when you don't get the FS rewards.  I know a lot of you are thinking I should change FS.  But for me the game is supposed to be fun, and I do have fun there and I have some of the greatest people ever with me there.  Unfortunately, as far as the game goes, they have to deal with real life issues and don't have the time to put into the game that I do.  It would take an awful lot to make me change from either of the 3 FS's I am in now.  So, I'm not going to say much more about the Spire.  It is just a money grab for Inno, a place where people can spend diamonds to try and get some of that good stuff.  But like I said there is nothing there that you need , You can play or not play.[BR][BR]And now comes this Tournament fiasco.  The thing about the Tournament is that almost everything that you do need to grow you city, comes from there.   You can't do much of anything without them.  You can't grow your city, without KP's to complete the tech tree.  You can't level up AW's without runes, you can't craft anything without relics, there is pretty much nothing that you can do, or if you can then it is at a snails pace.  There have been many many people here that are a lot smarter than I am that have made it very clear what the problems are and what needs to be done, and in a hurry, to fix this mess.  So I won't bother repeating what has been said over, and over, and over, and over, and over again.  I don't think there is much more that can be said.     This tournament format is taking away the opportunity to get the things you need to grow your city, and, \"Hello,\" it is a city building game.  That is why the game is dying, in my opinion.[BR][BR]So now about these great things that Inno has done for us.  We have gone from 4 encounters to 1.  I personally liked the idea of the one encounter when I first heard about it, but it hasn't taken me very long to determine that this is a bad thing.  With each Province divided into 4 parts you would have the opportunity to cater or fight different parts of the Province as opposed to just being able to do one or the other for the entire Province.  This would save both troops and resources as you could cater the fights you can't win and fight the ones you can.  This would especially help those that are on an app, and to a certain extent help out those that are unfortunate enough to have Elven cities.[BR][BR]Then there is the great thing about being able to train troops in all 3 training facilities.  Well first off, Inno had no choice but to do that or no one would have any troops to fight.  I think this is a genius tactic.  Most of us have enough workshops leveled up to sustain our cities.  It really would not make sense to have more than you need because you would just be giving away supplies to the wholesaler.  If your city is well established you probably don't have a whole lot of extra space.  By making the tournaments next to impossible without loosing huge amounts of troops, (funny how they also decided to mix up the enemy troops so you are forced to make many different kinds of troops) thus, making this \"gift,\" of being able to use all 3 facilities at a time an absolute God send.  If Inno didn't make the tournaments so much more difficult then there would be no reason to use these all at the same time now would there?  And Inno wants you to use them.  Because when you use them you are tripling the amount of supplies that you are using to build troops to lead to slaughter.  So what do you do?  Build more workshops?  Maybe, if you have the room.  Or buy magic workshops?  That is what Inno wants I think.  Now I know for many of you that is an option, but for those less fortunate and not having a brown bear or Fire Bird, maybe not.  And if you buy Magic workshops you need population to go along with it.  Do you have room for more residences?  Probably not, so the easiest way to increase population in a significant amount is to buy Magic residences.  Do you see a theme growing here?  I don't know about you folks but in about the last 4 weeks Inno has offered I think 4 Diamond purchase \"specials.\"  That could be a coincidence, I don't know.  Timing sure seems right though. [BR][BR]There are those that like the new tournament format, or so I have read.  For those that do I say, great!!  Tell me how you feel in a couple years when you are in chapter 16 or beyond.  And of course there will probably be many who are thinking well you can craft the troop booster buildings, and I say yes as long as you have the relics.  And then there are those that sy you can get the DA etc from the Spire, but there are many that can't do that yet because their city is not developed enough to do that.  And for those of us that have a brown bear, we can always use time boosters to increase our training of troops as long as we have the time boosters.  But I can see the writing on the wall, those time boosters will likely get, \"nerfed,\" from the Spire soon enough.  They \"nerfed\" them from the Events.  And with all these evolving buildings it is going to get harder and harder to keep enough feed in stock. [BR][BR]Yes, Inno is a business and they are there to make money.  I think the reason why this testing is going on so long is to find out just how much we can tolerate.  It would be interesting to know how many people took advantage of these diamond specials. If few did there may be a chance that the tournament format may get better than it is now. I think the only balance Inno is concerned with is how hard they can push to increase diamond sales before there is an all out refusal to purchase them.  That reason, and that reason alone, is why this testing has gone to the live world.  This is where the people are that buy the diamonds, not in beta.  They need to find the right limit.  If they push to hard then it is done, finished, over, broken, the game is dead.[BR][BR]Thanks for the opportunity to let an old lady have her rant.[BR]God bless you all, and happy gaming if that is still possible."}]