[{"84": "@Silmaril @herodite @anonglitch My question is this, how much more feedback do the devs think they are going to get ? I think everyone has already expressed how they find the new tournament system. If they have not got all the feedback they need from Beta and international servers by now then they probably never will.[BR]I think the devs are just saying they want to keep the testing going because they want to collect the data and not get more feedback from players. The numbers are all the devs are interested in."}, {"22": "Diane 6213 said:\t\t\tI think the reason why this testing is going on so long is to find out just how much we can tolerate. It would be interesting to know how many people took advantage of these diamond specials. If few did there may be a chance that the tournament format may get better than it is now. If people bought the diamonds, we're screwed. I think the only balance Inno is concerned with is how hard they can push to increase diamond sales before there is an all out refusal to purchase them. That reason, and that reason alone, is why this testing has gone to the live world. This is where the people are that buy the diamonds, not in beta. They need to find the right limit. If they push to hard then it is done, finished, over, broken, the game is dead.\t\tClick to expand...This may actually be a very good point. People do buy diamonds in Beta, but I imagine it is always less than on Live because most don't treat their Beta cities as their main ones. There aren't any specials or promotions or freebies on Beta, although they do quietly make little differences. For example, when the current event was over there the 'keys' were dropping around the city at double the rate, even though there was no outpost for sale. So yeah, they do try to push the sales less hard in Beta."}, {"33": "Diane 6213 said:\t\t\tThere are those that like the new tournament format, or so I have read. For those that do I say, great!! Tell me how you feel in a couple years when you are in chapter 16 or beyond.\t\tClick to expand...[BR]I'm at the end of the tech tree and I like the new tournament. I actually get more kp from tournament now than before. I know that isn't what Inno meant by this change, but the reason is that I earlier couldn't motivate me to do all the clicking required. Now I'm stopped when I think it costs more to advance then I get from it. Thats a much better situation as earlier I was stopped when my fingers said no or my brain said no because of boredoom.[BR][BR]Also remember that this game was playable long before tournament came out. Sure it was slower, but it was as it always was and there were no great complaining about that. Even then people got to the end of the tech tree and had to wait long for new chapters. Now a lot of people have got used to get high amounts of easely available kp every week. I think that amount was far to high, so a reduction was necessary."}, {"65": "valle said:\t\t\tI actually get more kp from tournament now than before.\t\tClick to expand...my question: if you have in chapter 16, for what you use that kp? You cant do more tech and if you do more AW levels, your tournament goes harder. maybe you don't have many levels if you want it to be harder?[BR]You dont need kp anymore. Thats why game is broken."}, {"15": "valle said:\t\t\tAlso remember that this game was playable long before tournament came out. Sure it was slower, but it was as it always was and there were no great complaining about that.\t\tClick to expand...True but there also the fact that back there weren't as many chapters as now and that they didn't require 120-200 kps per tech. So those who where in chapter 15-16 with the old system could do them at a decent speed, those who will get there with the new system will take much much longer to complete them. Although I'm not sure why anyone would want to do chapter 16 at this point, but still if someone wishes to do so it will take them ages."}, {"5": "Timneh said:@Silmaril @herodite @anonglitch My question is this, how much more feedback do the devs think they are going to get ? I think everyone has already expressed how they find the new tournament system. If they have not got all the feedback they need from Beta and international servers by now then they probably never will.[BR]I think the devs are just saying they want to keep the testing going because they want to collect the data and not get more feedback from players. The numbers are all the devs are interested in.\t\tClick to expand...[BR]@Timneh I honestly wish we had an update for you concerning the feedback people have kindly placed on here however, we've nothing as yet. What we do know is that that the Devs are continuing to work hard on the recent changes, and we have been advised to continue feeding back any and all information you provide on here. That being said though, we do understand your frustration and appreciate you're looking for answers. If you could please bear with us a little longer, hopefully we'll be able to give you some answers to your questions in due course  [smilie--sprite1] [BR][BR]Kind Regards[BR][BR]Herodite."}, {"33": "kurgkurg said:\t\t\tmy question: if you have in chapter 16, for what you use that kp? You cant do more tech and if you do more AW levels, your tournament goes harder. maybe you don't have many levels if you want it to be harder?[BR]You dont need kp anymore. Thats why game is broken.\t\tClick to expand...[BR]I've got a lot of AW levels to do, I currently have 360 AW levels (on W world). I don't know if thats considered high or low, but I won't stop levelling AWs. Currently I'm working on FA and Victory springs to speed up troop production. It will take some time to get them to 31 (or maybe 35). Then there are a few others in line. I think I'll gain from it even if tournament gets a bit harder.  So I still need a lot of kp. And with game progressing I assume max levels for AWs will rise too, so kp will always be in demand."}, {"122": "There is now 43 pages of feedback here  and alot also on beta  [BR]I really cant see  what more can be said or what more feedback can be written that has not already been said [BR]All i see  now is we are going round in circles   ..what has been said before is being said over and over again [BR]There has been very little changes since it first got rolled out for us to test   and in my opinion everything has been said that can be said about it ..[BR][BR]now its time for feedback from the Devs .."}, {"127": "Malph is right, how many more pages of the same comments will be considered enough??   How much longer are we going to be \"testing\" something that seems to be working exactly as intended. Is anyone actually working on resolving any of the core issues or at least reducing the impact of them I wonder, hard to tell with so little info coming our way from the game devs."}, {"24": "CrazyWizard said:\t\t\tAnd we have seen this strategy before many times over in the past, so it's not unthinkable this will happen.[BR]Since orcs and mana are the main limiting factors you should not go past the orks as they are triggered in chapter 9, but you can unlock unlimited provincies (especially with tower boosters) and therefore create a quick and dirty tournament experience that will be unmatched. without the whole \"manual fighting hassle\"[BR][BR]And as the disparity between cycling quests and supplies and coins is farly low since you are still near the dwarven chapter. you could easily setup a mouse marcro or something similar to replenish your supplies and coins, the only limiing factor here is how much the costs are and how much coins fit in your main hall.[BR][BR]According to dony this limit is reached for him around province 95, where for him there was a negotiating hard cap.[BR][BR]How long do you think it will take for someone to kill every tournament this way as we have seem people willing to take this route before in the chapter 4 reigns with 7020 poins accounts in the pre-phoenix period?\t\tClick to expand...[BR]Well I have to admit that I am too lazy to do the Math on how many provinces you can explore with the max Gold from an Orc MH. because there is of course a hard cap to exploring in any place, depending on MH max gold capacity and exploration costs (thanks for pointing that out @BlueBlou). But I think even before this hard cap people will hit a soft cap by excessivley long scouting times. If you want to be a top contender every week you will need at least 400 provinces, if you mean by killing winning every tourney, you need far more than 500, in the long run I doubt anyone will win tourneys with less than 15k points (we have 4 towns above 15k on EN3 this week, only 3 of them because of our push week). If you of course only want a town with a 7k average (25 of them for weekly 19 chests) that is easier, but still not easy...[BR][BR]Either way it will take a LONG time before such a town is ready to go and take lots of commitment. I do not suspect it will happen too often, by the time the these towns are ready even Inno will have realized their error and change the tourneys (maybe in a year or so?) and who knows what they will change it to, probably nothing good, since the last 2 tries were both complete fails...[BR][BR]I don´t understand the hard cap on province 95? Can you explain that one?"}, {"27": "Why did I lose this so badly?[BR][BR]I know I’m outnumbered, but there are three “weak” units (mage and light ranged) one “same” unit (dog) and one “strong” unit (heavy melee). I sent the dogs, they have such a movement range that they are effectively a pseudo-ranged unit.[BR]I could understand a loss of such a fight, but this wasn’t a loss, this was a massacre, which I’d expect if I sent mages instead of dogs. I mean I only managed to kill the “strong” unit. Eh ... Whaat?[BR]As far as I know there isn’t a terrain that would be fully blocked with just one opening (where the heavy melee would smartly stand). But I could be wrong, being an app player my knowledge about terrain is extremely limited."}, {"22": "I would blame the terrain. Was it auto? They had Mages and LR and yours were all melee. If your dogs were all blocked behind a big hedge then there may not have been much they could do. They may have only been able to escape around the outside one at a time."}, {"20": "FieryArien said:\t\t\tWhy did I lose this so badly?[BR]View attachment 4813View attachment 4814[BR]I know I’m outnumbered, but there are three “weak” units (mage and light ranged) one “same” unit (dog) and one “strong” unit (heavy melee). I sent the dogs, they have such a movement range that they are effectively a pseudo-ranged unit.[BR]I could understand a loss of such a fight, but this wasn’t a loss, this was a massacre, which I’d expect if I sent mages instead of dogs. I mean I only managed to kill the “strong” unit. Eh ... Whaat?[BR]As far as I know there isn’t a terrain that would be fully blocked with just one opening (where the heavy melee would smartly stand). But I could be wrong, being an app player my knowledge about terrain is extremely limited.\t\tClick to expand...I see you have green, green, purple, blue, red.  I would have gone green, green (for the purple and red) and training ground yellow for the rest. No idea if it would have worked as I am not a very good battler.  Will leave it to the experts to interpret what happened there."}, {"22": "Also, if they all auto-attacked the HM, they would've spent a long time trying to kill him, whilst the mages and LR picked you off from distance."}, {"27": "BlueBlou said:\t\t\tI would have gone green, green (for the purple and red) and training ground yellow for the rest.\t\tClick to expand...Oh, I love heavy ranged orcs. They would be considered, if I actually had them. They are freakishly expensive in terms of orcs. (Alternatively in terms of space for the Orcs strategist buildings.) The small supply from brown bear always runs out way too quickly.[BR]Pauly7 said:\t\t\tWas it auto?\t\tClick to expand...Yes. Sorry, I only wrote that I’m an app player, but I should have written explicitly that it was an auto-fight."}, {"22": "FieryArien said:\t\t\tSorry, I only wrote that I’m an app player\t\tClick to expand...Sorry, I missed that part.[BR][BR]What I realised when I started doing some manual fighting is that I don't like taking melee troops out at all. They can be really effective if the way is clear, but I've now had so many times that my guys get trapped behind some bushes and then all killed. If I can help it I'm inclined to pick mages and ranged troops, then often the tables are turned because the 'bad' terrain will work in my favour often."}, {"28": "FieryArien said:\t\t\tWhy did I lose this so badly?[BR]View attachment 4813View attachment 4814[BR]I know I’m outnumbered, but there are three “weak” units (mage and light ranged) one “same” unit (dog) and one “strong” unit (heavy melee). I sent the dogs, they have such a movement range that they are effectively a pseudo-ranged unit.[BR]I could understand a loss of such a fight, but this wasn’t a loss, this was a massacre, which I’d expect if I sent mages instead of dogs. I mean I only managed to kill the “strong” unit. Eh ... Whaat?[BR]As far as I know there isn’t a terrain that would be fully blocked with just one opening (where the heavy melee would smartly stand). But I could be wrong, being an app player my knowledge about terrain is extremely limited.\t\tClick to expand...It's terrain, I am not even particularly surprised by the outcome. Any time you field melee (especially vs range) your results would vary quite a bit based on the terrain. There are some very clogged maps out there, and it is likely what you see here. High mobility <> ranged for several reasons. High mobility only works if there are no chokes, so 5 of your high-mobility units would do squat with 1-2 chokes. At the same time 3 of your opponents have higher initiative, so both LR and a mage will go first. Also, ranged units can inflict damage and take nothing back. High mobility units will have to take the damage back.[BR][BR]Add to that that you're outnumbered almost 1.5:1, and it's easy to see how it can go pear-shaped. I wouldn't send 5x dogs again this setup, auto or not. 5x heavy range is likely a ticket here. Probably any would do, but if it is really clogged then Frogs would do really well here with their range. Strategists or Golems for elves could also do alright, but nowhere as good if it's really clogged. Without knowing terrain I'd go SOS or Frogs or Golems - in that order. If I see a loss like the above, I'd go straight Frogs next."}, {"27": "Thanks guys (and gals?) for the insight. I learned something today.[BR][BR]And as feedback for mods:[BR]These fighting lessons are very expensive in the new tournament. The early fights are just plain stupid, I win no matter what I send, so there is nothing to learn. Then the difficulty (ratio me vs. enemy) goes quickly and steeply up AND at the same time the amount of troops goes sky high fast. There is not enough of the middle area for training."}, {"22": "FieryArien said:\t\t\tThe early fights are just plain stupid, I win no matter what I send, so there is nothing to learn. Then the difficulty (ratio me vs. enemy) goes quickly and steeply up AND at the same time the amount of troops goes sky high fast. There is not enough of the middle area for training.\t\tClick to expand...Agreed. Whilst I find the new tournaments a bit more fun to play, the result is never so much of an interest now. It's really tough to lose any fight in the first 6 provinces, so now any fellowship can open 10 chests, so long as they have 25 people just willing to turn up and play their rounds. As it's so hard to get a big score people don't bother with that because it isn't needed. So all the buzz from tournaments is completely gone.[BR][BR]They create 9 extra chests to appeal to the teams wanting to push themselves, but for most people these aren't goals that need to be pushed for, so really everyone is just going through the motions, it occurs to me. I now have no reason to ask anyone to go for more points than they can do with their eyes closed.[BR][BR]This week on Arendyll, 542 players scored over 3,000. Only 71 of these people topped 6,000. That suggests to me that 95% of the good tournament players just sit somewhere in this range. Does it matter, finishing 542nd instead of 71st? Not really.[BR][BR]So this is more of a philosophical post than anything, rather than me complaining. I think that Inno, in their eagerness to try to appeal to a large number of casual players, have rather sucked the life out of the competition. Then I'm left wondering what it's for. Occasionally I'll probably push over 10k, just for the what-the-hey, but it doesn't really matter."}, {"30": "anonglitch said:\t\t\tTrust us, folks, the developers are trying their best. For us, it is our beloved Elvenar, but for the developers, it's their bread and butter. The testing period extended precisely because of all your feedbacks. Sometimes, things are more complicated than they seem. Doing a small change in a specific in-game configuration may trigger disbalances elsewhere, providing with more negative in-game experience. As you all know, everything is very interconnected in the game.[BR][BR]I humbly believe it is excellent to keep testing. After all, you provided a lot of useful feedback about the tournament, and we apologize it becomes frustrating. They collect a lot more data than just checking out if the point-gain is stable to make it final. Let's hang in there, you provided some impressive feedback with numbers and all, and this helps enormously!\t\tClick to expand...I understand you are trying your level best to do your job and I appreciate it. However, it is very clear the two things with which players are really unhappy, AWs and Expansions contributing to squad size. If this is testing; why can't devs reduce the percentage contribution of these two attributes by 90% or some significant value and continue with testing. This is just a configuration change or change a value of a constant in the code assuming the software is well designed.[BR][BR]Yes, I understand players in this server will have an advantage in the Spire. As per your earlier argument with regard to someone complaining that players in this server are at a disadvantage in the tournament, So what? It is testing.[BR][BR]I would like you all to see the fundamental issue here with this approach of sticking to your guns. The entire forum thread is crowded with views resulted from these two attributes and you are getting very little feedback on other aspects which may help the devs significantly.[BR][BR]BTW, single fight per province and 3 production queues certainly help. Also it is a good idea to increase the level of challenge both ways; number of the province and each additional round in a province.[BR][BR]Hope devs will see this view point."}]