[{"30": "FieryArien said:\t\t\tWhy did I lose this so badly?[BR]View attachment 4813View attachment 4814[BR]I know I’m outnumbered, but there are three “weak” units (mage and light ranged) one “same” unit (dog) and one “strong” unit (heavy melee). I sent the dogs, they have such a movement range that they are effectively a pseudo-ranged unit.[BR]I could understand a loss of such a fight, but this wasn’t a loss, this was a massacre, which I’d expect if I sent mages instead of dogs. I mean I only managed to kill the “strong” unit. Eh ... Whaat?[BR]As far as I know there isn’t a terrain that would be fully blocked with just one opening (where the heavy melee would smartly stand). But I could be wrong, being an app player my knowledge about terrain is extremely limited.\t\tClick to expand...I hope devs will see this and there is enough evidence that Mobile App is becoming not usable for tournaments unless a player is at an early stage since there is no manual fight option. I have stopped using the Mobile App for fighting. You really need manual fighting to reach 20+ provinces without heavly losses. I, of course, like it; I mean having to manual fight more [smilie--sprite8]. To find the time needed I gave up one of my cities and now playing with a single city."}, {"33": "skelve said:\t\t\tYou really need manual fighting to reach 20+ provinces without heavly losses.\t\tClick to expand...[BR]That's not true. I'm only autofighting and I've fought successfully (with acceptable losses) in the range 40 - 55. Using 2DA + 2 ELR (or 2 MMM).  Sure the boosters help, but I'm sure I could do fights 20+ without them."}, {"33": "Pauly7 said:\t\t\tAs it's so hard to get a big score people don't bother with that because it isn't needed. So all the buzz from tournaments is completely gone.\t\tClick to expand...[BR]I've never done tournament to get a high score.  'The question is what motivates people to do tournament.. Sure some only do it for a score to show, but I suspect a lot do it for the same reason as me. To get resources (mainly kp) that help in developing the city, in that case score is of no greater interest.  Of course there also are a lot of unfortunate that only do it because they are forced to do it by their fellows. Do X points or you get kicked from the FS.  I see Elvenar as a city building game. Fighting in tournamnet is only a way to develop the city, a few others writing here seems to see it as a 'tournament game' where the sity developing is less important than tournament.[BR][BR][BR]Pauly7 said:\t\t\tThis week on Arendyll, 542 players scored over 3,000. Only 71 of these people topped 6,000. That suggests to me that 95% of the good tournament players just sit somewhere in this range. Does it matter, finishing 542nd instead of 71st? Not really.\t\tClick to expand...[BR]Beeing 'good' at tournament earlier was rather 'easy'. All you needed was stamina to click 1000s of times. You could often just send the 5 same troops time after time and win with minimal losses. No skill needed at all. Now you actually have to know what troops to use, and when to cater to avoid catastrophic losses.[BR]About score people have different views on it. But I'm sure some are happy to be in top 100. But if you are realy competetive I assume only #1 counts, 2nd best is first looser [smilie--sprite2]"}, {"17": "valle said:\t\t\tI've never done tournament to get a high score.  [BR]About score people have different views on it. But I'm sure some are happy to be in top 100. But if you are realy competetive I assume only #1 counts, 2nd best is first looser [smilie--sprite2]Click to expand...Awww Valle, I always used to write, didn't I? [BR]I tourney for the sheer joy of battle,  and I would compete sometimes just for fun.  I find it refreshing to be able to go further than I did a couple of months ago.  I love the time that has been saved, with less battles,  it's not so draining to push forward. [BR]As the mods have been hinting,  some types of tournament are still easier than others, some are harder.  It has always been this way.  On the whole, I like it. [BR][BR]I do worry about the future of the game, though, if there is a perception that the higher chapters are impossible to play.  So many of the developers admit to being slow at advancing, and have not finished the tech tree.  I have not either, but my lead city is in the last chapter when the next is released, for a couple of years now.  I am content with this progress. There was uncertainty when orc chapter was released, and again during S&D, also with the Sentient goods; but never so much as now."}, {"84": "valle said:\t\t\tFighting in tournamnet is only a way to develop the city, a few others writing here seems to see it as a 'tournament game' where the sity developing is less important than tournament.\t\tClick to expand...[BR]It has been said in the past by some players that the tournaments are the game for some of the players that are at the end of the game waiting for a new chapter. Everyone can play this game the way they want to so if they want to concentrate on tournaments so what ? maybe they find that more interesting than building their city."}, {"22": "valle said:\t\t\tBeeing 'good' at tournament earlier was rather 'easy'. All you needed was stamina to click 1000s of times. You could often just send the 5 same troops time after time and win with minimal losses. No skill needed at all. Now you actually have to know what troops to use, and when to cater to avoid catastrophic losses.\t\tClick to expand...My point was that it is exactly the opposite. I would describe 3k as a good tournament score. In the old system 3k would get you into the to 100. Now, that early stage is so easy that the same score may only get you into the top 1,000. What they have done, though, is make it bolt hard to get a great tournament score, meaning everyone just sits in the same score range. [BR][BR]I'm not saying that I play for ranking points. Not at all. Of course winning the KP is the best reason for playing a tournament, but the fact remains that they have taken the buzz away. Everyone just goes and gets their 3-6k tournament score because it's no drama. Not that many people go further because they know it is a huge drain on resources (and no, you won't be able to use 2 x DA and 2 x ELR every week). Everyone gets some KP. Everyone gets a blueprint, but there's nothing else to aim for. It's too costly to score a small amount more and the reward has already been won. Job done."}, {"33": "Lelanya said:\t\t\tI do worry about the future of the game, though, if there is a perception that the higher chapters are impossible to play.\t\tClick to expand...[BR]That perception comes from some super negative writers on this forum. I'm at the end of the tech tree and people saying it is impossible to play there don't know what they are talking about. They are only very negative."}, {"33": "Timneh said:\t\t\tIt has been said in the past by some players that the tournaments are the game for some of the players that are at the end of the game waiting for a new chapter. Everyone can play this game the way they want to so if they want to concentrate on tournaments so what ? maybe they find that more interesting than building their city.\t\tClick to expand...[BR]Sure everyone can play the game how they wish to do. That's one of the good things about this game. But I see a lot saying that you should stay in the tech tree at soime point. And end developing AWs. Avoid expansins and so on.  Sure if anyone wants to play that way, it's ofcourse good for them. But I don't think it's  a good advise to give others giving the expression that it's pointless to advance atfer some point in the game."}, {"33": "Pauly7 said:\t\t\tEveryone just goes and gets their 3-6k tournament score because it's no drama. Not that many people go further because they know it is a huge drain on resources (and no, you won't be able to use 2 x DA and 2 x ELR every week). Everyone gets some KP. Everyone gets a blueprint, but there's nothing else to aim for. It's too costly to score a small amount more and the reward has already been won. Job done.\t\tClick to expand...[BR][BR]I'm happy to sacrifice some troops/resources to gain more fp. What else should I do with those troops/resources? About DA's I don't expect to be able to use 2 every week. But as long as I've got some in stock I'll do it. Then maybe 1 DA + 1 UUU will have to do for some time. It will probably mean a few provinces less, but I don't se any problem with that."}, {"22": "valle said:\t\t\tI'm happy to sacrifice some troops/resources to gain more fp. What else should I do with those troops/resources? About DA's I don't expect to be able to use 2 every week. But as long as I've got some in stock I'll do it. Then maybe 1 DA + 1 UUU will have to do for some time. It will probably mean a few provinces less, but I don't se any problem with that.\t\tClick to expand...You're quoting me, but you aren't responding to the point of what I'm saying, so I can't really carry on with this."}, {"30": "valle said:\t\t\tThat's not true. I'm only autofighting and I've fought successfully (with acceptable losses) in the range 40 - 55. Using 2DA + 2 ELR (or 2 MMM).  Sure the boosters help, but I'm sure I could do fights 20+ without them.\t\tClick to expand...Using 2DA + 2 ELR (or 2 MMM) meaning +100% health and +50% attack for light range and mages. With that even in the 20th province you are lot powerful than the enemy [smilie--sprite8]."}, {"122": "valle said:\t\t\tThat's not true. I'm only autofighting and I've fought successfully (with acceptable losses) in the range 40 - 55. Using 2DA + 2 ELR (or 2 MMM).  Sure the boosters help, but I'm sure I could do fights 20+ without them.\t\tClick to expand...[BR]Using all those boosts means you are going to go further than most players[BR]But to test this properly is do it without any DA or crafted boosts  then see how far you go without losing most of your troops[BR]The reason i say this is because there will be weeks you wont be lucky to win any DA in the spire and the MA has not been very kind to you either[BR]that means you wont have those boosts to use week in week out ..[BR]just using say the fire phoenix as your only boost then you will be able to give an honest and fair opinion  as there will come a week where  you wont have the good boosts to place"}, {"33": "skelve said:\t\t\tUsing 2DA + 2 ELR (or 2 MMM) meaning +100% health and +50% attack for light range and mages. With that even in the 20th province you are lot powerful than the enemy\t\tClick to expand...[BR]But 'i'm doing like province 50 with those boost. So my point was that I think I could do province 20 without them."}, {"33": "malph said:\t\t\tBut to test this properly is do it without any DA or crafted boosts then see how far you go without losing most of your troops[BR]The reason i say this is because there will be weeks you wont be lucky to win any DA in the spire and the MA has not been very kind to you either[BR]that means you wont have those boosts to use week in week out ..\t\tClick to expand...[BR]The spire gives at least 1 DA every week in average. So thats a minimum I think. Also MMMs and ELRs you will get a few every week. So using 2 every week should be sustainable. Then you will probably get an UUU occasionaly. So atleast 1 DA + 1 UUU + 2 ELR (or 2 MMM) should be possible to use. Then the RNG is as it is so you can't be sure. But some boosts should always be available if you do spire + crafting regulary."}, {"33": "Pauly7 said:\t\t\tYou're quoting me, but you aren't responding to the point of what I'm saying, so I can't really carry on with this.\t\tClick to expand...[BR]I responded to what you said on boosters."}, {"68": "valle said:\t\t\tThe spire gives at least 1 DA every week in average. So thats a minimum I think. Also MMMs and ELRs you will get a few every week. So using 2 every week should be sustainable. Then you will probably get an UUU occasionaly. So atleast 1 DA + 1 UUU + 2 ELR (or 2 MMM) should be possible to use. Then the RNG is as it is so you can't be sure. But some boosts should always be available if you do spire + crafting regulary.\t\tClick to expand...You've been very lucky with your DA from the spire, I definitely don't get \"at least 1 DA every week in average\", and I go up to the top every week.  Same with MMMs and ELRs where I might get 1 of each a week - and of course I do crafting regularly, the only time I'm not crafting is because something has finished while I'm asleep.[BR]The other thing which will help with tournaments is the levels of AWs primarily aimed at fighting, such as Needles of the Tempest or the Sanctuary.  The higher the levels, the greater the benefit (allegedly).[BR]So what you can do, compared with somebody else, isn't a true comparison because we aren't on a level playing field."}, {"65": "valle said:\t\t\tI'm at the end of the tech tree and people saying it is impossible to play there don't know what they are talking about. They are only very negative.\t\tClick to expand...maybe you haven't properly understood the criticisms. [BR]Of course, for example, it's possible to keep developing your city just to see how long you can. [BR]But if you want to make a 10 k score in a tournament at the same time, it's still going to get very difficult because with every next AW levee you feel the wall is ahead. And you know, actually, you could get that 10 k a lot easier if you just deleted some of your Aw's. It seems so logic-free. [BR][BR]But of course, you can set yourself all sorts of different goals and still play even when you're standing on your head."}, {"117": "What has been true under the old system, is still true under the new system. No two cities are exactly alike.  My personal experience, for a low chapter city, having a level 27 Needles ain’t helping me much.  Not enough opponents that can be taken down with archers.  I even want to doubt the 3000 to 6000 average that Pauly thinks many will be doing now.  Whereas I could get 4k on a good week under the old system, that has changed. Too heavily mortar blocked with the formula and just getting a 1000 without boost buildings is a major achievement. I should change, but who then is going to reflect on what is happening at the bottom of the scale and how totally out of whack it is?"}, {"14": "It would be better if we stopped focussing on one person bouncing about happily with their one city, which is not representative for this whole change in any way, shape or form. Let's focus back on the actual topic; the change itself and feedback on that change.[BR][BR]The conclusion is that the tournament HAD to be changed. This is a fact to Inno, and clear enough for everybody who has had the patience to read this entire thread. So a change has to be made, like it or not.[BR][BR]The problem within this change lies with the formula, the discrepancy it can create between players, and the punishment it delivers to anyone who simply grows their city without a very specific understanding of the way the tournament formula works within the game. Aside from the punishment it already gives to those who have grown their city according to the old system.[BR]The problem has been math'd out already as well, both on Beta and shown again here in this thread. So what would be the best solution that would not punish players who play their city builder, want to just play like they want to and want all the expansions and all the AW's?[BR][BR]Really, the only thing that comes to mind is capping the difficulty of the curve at some point. People who play the tournament religiously will still be able to optimize and score as much as they can/want, whereas more casual players will still enjoy the benefits of the change in the much easier early provinces.[BR]It's definitely not a perfect solution, but it fixes some of the problems we have with this change. I don't think we can fix the entire issue as it stands with this formula anyway."}, {"122": "Killiak said:\t\t\tIt would be better if we stopped focussing on one person bouncing about happily with their one city, which is not representative for this whole change in any way, shape or form. Let's focus back on the actual topic; the change itself and feedback on that change.\t\tClick to expand...[BR]What we need also is feedback from the Devs  as i said in another post   everything that can be said  has been said  but still nothing from them"}]