[{"53": "Killiak said:\t\t\tIt would be better if we stopped focussing on one person bouncing about happily with their one city, which is not representative for this whole change in any way, shape or form. Let's focus back on the actual topic; the change itself and feedback on that change.[BR][BR]The problem within this change lies with the formula, the discrepancy it can create between players, and the punishment it delivers to anyone who simply grows their city without a very specific understanding of the way the tournament formula works within the game. Aside from the punishment it already gives to those who have grown their city according to the old system.[BR]The problem has been math'd out already as well, both on Beta and shown again here in this thread. So what would be the best solution that would not punish players who play their city builder, want to just play like they want to and want all the expansions and all the AW's?\t\tClick to expand...[BR]I agree with malph that it is difficult to advance the discussion here without some more feedback from the game designers. I see three possibilities:[BR](1) The Devs recognise that there is a problem with the formula and are actively exploring possible remedies.[BR](2) The Devs are aware of issues with the formula, but are reluctant to make any related changes due to higher priorities, complexity, or some other reason.[BR](3) The Devs are content with the formula as it stands. [BR][BR]It would be helpful to be explicit about which situation we are in. If more feedback and analysis about the merits or otherwise of the current situation are needed, then I'm sure that there are plenty of players willing to provide it. The first case may instead call for a different type of feedback - such as Killiak's constructive suggestions above. [BR][BR]Another reason for clarity is that I suspect that a proportion of the player-base are delaying significant city building decisions until these issues are resolved. This would make testing less effective, and also explains some of the frustration on this thread."}, {"84": "Past experience would suggest that it is number 3 but with a possibility of some very very small tweaks that will make no difference. I would not hold my breath waiting for any response from the devs, they don't seem to believe in 2 way communication."}, {"30": "valle said:\t\t\tBut 'i'm doing like province 50 with those boost. So my point was that I think I could do province 20 without them.\t\tClick to expand...Certainly, you can subject to the enemy troop combination. But my point was the amount of loses overall. Due to the huge squad size, a heavy loss will reduce the ability to proceed significantly, unless you have stockpile a huge amry. Maximum I have reached is the 26th province with few negotiations. Of course I am not going to throw in everything I have built over months during a single week and therefore not even try it if I see a significant risk in a battle. What is the troop ration between yours and the enemy in the 50th province?"}, {"4": "I have 4 UUU, 2 DA and 4 ELR so trained nothing but Light ranged on all 3 camps, whether I place everything and go for it or wait and see if the devs make changes is something I am still debating with myself."}, {"33": "skelve said:\t\t\tCertainly, you can subject to the enemy troop combination. But my point was the amount of loses overall. Due to the huge squad size, a heavy loss will reduce the ability to proceed significantly, unless you have stockpile a huge amry. Maximum I have reached is the 26th province with few negotiations. Of course I am not going to throw in everything I have built over months during a single week and therefore not even try it if I see a significant risk in a battle. What is the troop ration between yours and the enemy in the 50th province?\t\tClick to expand...[BR]I don't remember troop ratio, but it's of course very bad against me. The trick is to use time instants. My troops regulary die on the battlefield and I never have troops that were produced months ago. But with time instants I'm able to rebuild losses instantly. I also cater if I expect heavy losses. If a lot of orcs are required I might prefer the losses as orcs are my greatest resource problem. So make sure to do spire all the way every week to maximize your time instants. If you got no brown bear I hope you use the current event to get as many bear artifacts as possible. The events also gives extra troops."}, {"30": "valle said:\t\t\tI don't remember troop ratio, but it's of course very bad against me. The trick is to use time instants. My troops regulary die on the battlefield and I never have troops that were produced months ago. But with time instants I'm able to rebuild losses instantly. I also cater if I expect heavy losses. If a lot of orcs are required I might prefer the losses as orcs are my greatest resource problem. So make sure to do spire all the way every week to maximize your time instants. If you got no brown bear I hope you use the current event to get as many bear artifacts as possible. The events also gives extra troops.\t\tClick to expand...So you are confirming there are heavy loses even with such boosters and you have to use time instances to replenish. Furthermore, you use catering if there is a high risk. As with most of us Orc is a precious resource."}, {"33": "skelve said:\t\t\tSo you are confirming there are heavy loses even with such boosters and you have to use time instances to replenish. Furthermore, you use catering if there is a high risk. As with most of us Orc is a precious resource.\t\tClick to expand...[BR]Of course some anemy combinations gives high losses (or impossible fights). And whats the problem with using time boosters to replace troops? Thats the best use of them. What do you use your for? Speed up scouting or building? Using them for other things than troop building  is a waste. Only exception I see is for crafting and getting CC-spells where I use some, but the big mojority goes to troop building."}, {"32": "skelve said:\t\t\tSo you are confirming there are heavy loses even with such boosters and you have to use time instances to replenish. Furthermore, you use catering if there is a high risk. As with most of us Orc is a precious resource.\t\tClick to expand...He also has a (accedentely) near ideal city for the new format. Which is another key factor.[BR]And he mentions heavy use of unit boosters that most can't muster."}, {"30": "valle said:\t\t\tOf course some anemy combinations gives high losses (or impossible fights). And whats the problem with using time boosters to replace troops? Thats the best use of them. What do you use your for? Speed up scouting or building? Using them for other things than troop building  is a waste. Only exception I see is for crafting and getting CC-spells where I use some, but the big mojority goes to troop building.\t\tClick to expand...[smilie--sprite8] I am not trying to state that your playing style is not correct. I was trying to understand the technique you have used to avoid heavy loses with auto fighting since to my initial post on this regard which is \"You really need manual fighting to reach 20+ provinces without heavy losses.\" you stated, \"That is not true\". For a moment I thought auto fight AI is smarter than me [smilie--sprite8]. Now it is clear."}, {"25": "malph said:\t\t\tWhat we need also is feedback from the Devs as i said in another post everything that can be said has been said but still nothing from them\t\tClick to expand...I have a sneaky suspicion that when Chapter 17 comes out, and people are hesitant to wander in for even more punishment, we just might hear from them.  I also suspect that there will be an alleviating Ancient Wonder placed at the very end of Chapter 17, aka the carrot on the stick."}, {"24": "FieryArien said:\t\t\tWhy did I lose this so badly?[BR]View attachment 4813View attachment 4814[BR]I know I’m outnumbered, but there are three “weak” units (mage and light ranged) one “same” unit (dog) and one “strong” unit (heavy melee). I sent the dogs, they have such a movement range that they are effectively a pseudo-ranged unit.[BR]I could understand a loss of such a fight, but this wasn’t a loss, this was a massacre, which I’d expect if I sent mages instead of dogs. I mean I only managed to kill the “strong” unit. Eh ... Whaat?[BR]As far as I know there isn’t a terrain that would be fully blocked with just one opening (where the heavy melee would smartly stand). But I could be wrong, being an app player my knowledge about terrain is extremely limited.\t\tClick to expand...[BR]3 reasons:[BR]1. you figured out by yourself: SS difference, however this is the smallest contributing factor[BR]2. Your biggest mistake: You used LM troops, never do that! No matter what! (OK there is a 0.000001 % chance LM is better than other units, but skip that until you are more than 100% sure you know what you are doing)[BR]3. Terrain. Nothing you can do about that, it´s just luck or the lack of it. Can be solved by logging on to a browser for a second try,if your pride is hurt [smilie--sprite1] Otherwise just try again (preferably with differnt units) or cater.[BR][BR]Next time you encounter something similar use 5 Rangers (or barrack LR units if you don´t have 3 star Rangers), should be a walk in the park [smilie--sprite1]"}, {"24": "skelve said:[smilie--sprite8] I am not trying to state that your playing style is not correct. I was trying to understand the technique you have used to avoid heavy loses with auto fighting since to my initial post on this regard which is \"You really need manual fighting to reach 20+ provinces without heavy losses.\" you stated, \"That is not true\". For a moment I thought auto fight AI is smarter than me [smilie--sprite8]. Now it is clear.\t\tClick to expand...[BR]Eh who said you cannot autofight more than 20 provinces? I just did 61 (in 6 rounds). it depends what you call heavy losses of course... would it be less losses on manual? For sure always! Is it worth it? Depends if you have anything else to do besides...[BR][BR]I definitely never consider anything but autofight for the first 30 or 40 provinces. After that I decide based on my time and mood if I want to do some manual fights and try to 0 loss some encounters for the fun of it or accept loosing a bunch."}, {"22": "Maillie said:\t\t\tI also suspect that there will be an alleviating Ancient Wonder placed at the very end of Chapter 17, aka the carrot on the stick.\t\tClick to expand...Sadly you will be disappointed. They're as bad as chapter 16 AWs."}, {"24": "valle said:\t\t\tThe spire gives at least 1 DA every week in average. So thats a minimum I think. Also MMMs and ELRs you will get a few every week. So using 2 every week should be sustainable. Then you will probably get an UUU occasionaly. So atleast 1 DA + 1 UUU + 2 ELR (or 2 MMM) should be possible to use. Then the RNG is as it is so you can't be sure. But some boosts should always be available if you do spire + crafting regulary.\t\tClick to expand...[BR]No, I am pretty sure it doesn´t. If you get 1 every week you are already above average. I have had long periods when I did get 1 every week, extremely rarely I have gotten more than 1 (maybe 2 times altogether) however it is rather common to not get 1 at all. Right now I have not gotten a DA in 4 weeks.[BR]So I consider myself lucky if I get 1 DA in a spire (and I relly don´t need anything else in terms of personal rewards). The team rewards are of course a guaranteed bonus to make up for it in weeks when I don´t get a DA."}, {"24": "malph said:\t\t\tUsing all those boosts means you are going to go further than most players[BR]But to test this properly is do it without any DA or crafted boosts  then see how far you go without losing most of your troops[BR]The reason i say this is because there will be weeks you wont be lucky to win any DA in the spire and the MA has not been very kind to you either[BR]that means you wont have those boosts to use week in week out ..[BR]just using say the fire phoenix as your only boost then you will be able to give an honest and fair opinion  as there will come a week where  you wont have the good boosts to place\t\tClick to expand...[BR]I disagagree, if you want to know what you can do every week is to use the buildings you get every week. Sometimes you may not get a DA, but you can still gett UUU/ELR/MMM other weeks you may not have those, but a DA. Playing a week without any buildings is certainly not the average week."}, {"24": "Pauly7 said:\t\t\tSadly you will be disappointed. They're as bad as chapter 16 AWs.\t\tClick to expand...[BR]Well both chapter 15 and chapter 16 AWs are for ranking towns. no use for anyone else. Maybe someone with a population fetish for the Thermal Springs? But those tend to be the ranking towns... so back to that.[BR][BR]Are the chapter 17 AWs already out? I have missed that completely..."}, {"22": "Gargon667 said:\t\t\tI disagagree, if you want to know what you can do every week is to use the buildings you get every week. Sometimes you may not get a DA, but you can still gett UUU/ELR/MMM other weeks you may not have those, but a DA. Playing a week without any buildings is certainly not the average week.\t\tClick to expand...Yep. That's why I'm going through the first 9 weeks using 1 x DA in each week and nothing else. Technically I should be able to add at least 1 x MMM or ELR in as well, but I'm not muddying the waters with that right now.[BR][BR]Yeah it seems to me that the average DAs won might be in the region of 0.75 a week. I'm relying on the fact that an occasional UUU will let me keep up the 50% health boost per week."}, {"22": "Gargon667 said:\t\t\tAre the chapter 17 AWs already out? I have missed that completely...\t\tClick to expand...Yeah, well, the info has been found. We're looking at pretty much a copy of Enar's Embassy."}, {"122": "I know what i can do everyweek    i finished 3rd on our server and i had boosts   [BR]I also have finished the spire for this week (to the top) and never got lucky to get a DA  so if i dont get many  UUU/ELR/MMM  then i will be effected in the tournament [BR]I stand by what i said ..Alot of players dont go to top of spire and that means there less chance to get a DA   and that means there left to crafting so if the MA is not kind to them then they struggle  and have to do it with the  fire phoenix ..and thats when we get a bigger picture of how this tournament formula is ..not just by people saying i did  bla bla amount with  2 of this and 2 of that and so on ..the big picture is when you dont have all that  to place"}, {"24": "m4rt1n said:\t\t\tI have 4 UUU, 2 DA and 4 ELR so trained nothing but Light ranged on all 3 camps, whether I place everything and go for it or wait and see if the devs make changes is something I am still debating with myself.\t\tClick to expand...[BR]The new tourney doesn´t work that way anymore. training 1 single unit is not going to cut it! Yes your buildings would boost LR units, but you cannot rely on getting only HM/Mage as enemies. last week was one of the better ones for LR, maybe together with Planks... But even in these week other enemies are often present. So better make sure you have LR, Mage and HR troops available at all times to be able to deal with most enemy combinations, rather rely on LR only, just to face encounters with HR troops and Ancient Orcs..."}]