[{"24": "Pauly7 said:\t\t\tYeah, well, the info has been found. We're looking at pretty much a copy of Enar's Embassy.\t\tClick to expand...[BR]Lol that is awesome! They thought the worst AW in the game was worth copying? I always thought chapter 15 was a bad \"year\" for AWs until they made chapter 16, by that time I figured AWs are not going to be part of the game anymore. And now they make something worse than those 2? That is hilarious! The devs do have a sense of humor after all! I have to draw my hat in respect [smilie--sprite8][BR]I have to admit my favorite quest in the entire game is the one in amuni, when you have to pay 20000 seeds (or how much was it?) to get 1 gold coin [smilie--sprite8] The only quest that ever made me laugh! priceless![BR]But as expected chapter 17 is not going to inspire me to play chapter 16 [smilie--sprite2]"}, {"22": "The second one is at least different, but not good. It will give out sentient goods for each storyline quest completed.[BR][BR]But hey, at least we have an exciting looking evolving building on the way."}, {"24": "malph said:\t\t\tI know what i can do everyweek    i finished 3rd on our server and i had boosts  [BR]I also have finished the spire for this week (to the top) and never got lucky to get a DA  so if i dont get many  UUU/ELR/MMM  then i will be effected in the tournament[BR]I stand by what i said ..Alot of players dont go to top of spire and that means there less chance to get a DA   and that means there left to crafting so if the MA is not kind to them then they struggle  and have to do it with the  fire phoenix ..and thats when we get a bigger picture of how this tournament formula is ..not just by people saying i did  bla bla amount with  2 of this and 2 of that and so on ..the big picture is when you dont have all that  to place\t\tClick to expand...[BR]That is a rather obvious fact: People that play less spire will score less in tournaments. [BR][BR]The two events are linked. they always have been. Only before the tourneys were so simple that it didn´t show as clearly. You could do well even by not playing an optimized style. Now the game forces you to put in an effort if you want to score high. Can´t say I find anything wrong with that part of the new tourney (although as always, just to not have any misunderstandings: there are many things gravely wrong with the new tourney, just not this aspect)"}, {"24": "Pauly7 said:\t\t\tThe second one is at least different, but not good. It will give out sentient goods for each storyline quest completed.[BR][BR]But hey, at least we have an exciting looking evolving building on the way.\t\tClick to expand...[BR]Sounds fun indeed! and just as useless as it sounds fun [smilie--sprite8] Storyline quests??? Awesome! [BR]btw how many storyline quests do they expect to be there in the next half year after you build that tech? or did they place the AW as the first tech in the new chapter?"}, {"22": "Gargon667 said:\t\t\tSounds fun indeed! and just as useless as it sounds fun [smilie--sprite8] Storyline quests??? Awesome![BR]btw how many storyline quests do they expect to be there in the next half year after you build that tech? or did they place the AW as the first tech in the new chapter?\t\tClick to expand...Yeah I'm confused. It seems so limited. Maybe it gives out a humungous amount for each one, but sentient goods decay so I can't ever seeing it being useful. I'm not sure what the second power of that wonder is though.[BR][BR](We should probably stop talking about this in this thread... sorry mods)."}, {"33": "CrazyWizard said:\t\t\tHe also has a (accedentely) near ideal city for the new format. Which is another key factor.[BR]And he mentions heavy use of unit boosters that most can't muster.\t\tClick to expand...[BR]That was new to me. From reading here I got the impression that the ideal tournament city should have stopped researching after getting certain *** troops. Should have no premium expansions and only the best fighting AWs up.[BR]I can't see my city matching that.[BR]I'm at the end of tech tree. 360 AW levels (W world), a lot of non fighting AWs, and a fair number of premium expansions. Not sure of how many, but that is what I spend diamonds on.[BR]But I should perhaps be happy for any positive remarks on my cities, the only things said here previous is that they are chaotic and very inefficient [smilie--sprite2]"}, {"30": "Gargon667 said:\t\t\tEh who said you cannot autofight more than 20 provinces? I just did 61 (in 6 rounds). it depends what you call heavy losses of course... would it be less losses on manual? For sure always! Is it worth it? Depends if you have anything else to do besides...[BR][BR]I definitely never consider anything but autofight for the first 30 or 40 provinces. After that I decide based on my time and mood if I want to do some manual fights and try to 0 loss some encounters for the fun of it or accept loosing a bunch.\t\tClick to expand...If half of my troops are gone after a fight that is a heavy loss for me considering the capacity I have, to replenish during the tournament with the average player abilities. Which I believe is the case for 90% of the players. I can see that you are running a city with 10 armories and 2 brown bears. I guess you must be having an army which can take on the entire world  [smilie--sprite8]."}, {"33": "skelve said:\t\t\tIf half of my troops are gone after a fight that is a heavy loss for me ...\t\tClick to expand...[BR]Thats a heavy loss for me too. If I expect that sort of losses I cater. The trick is to know when to fight and when to cater."}, {"24": "skelve said:\t\t\tIf half of my troops are gone after a fight that is a heavy loss for me considering the capacity I have, to replenish during the tournament with the average player abilities. Which I believe is the case for 90% of the players. I can see that you are running a city with 10 armories and 2 brown bears. I guess you must be having an army which can take on the entire world  [smilie--sprite8].\t\tClick to expand...[BR]Yes I agree with you, fights where I loose half my troops are the ones that make me think if I should change my strategy [smilie--sprite1] I am not highly intelligent, so it takes quite a few of those to get the point across though... The first couple I tend to blame on bad luck [smilie--sprite2][BR][BR]Armories make Orcs, yes I got annoyed by being low on Orcs while upgrading a few AW to lvl 31. Also now it gives me the freedom to cater Orcs if I feel like doing so, everybody else complains about it costing too many Orcs, I figure I get my Orcs production up lol. Only problem is I keep forgetting to cater altogether, so now my Orcs multiply without any reason lol, but they don´t decay so I am not too grumpy about their proliferation...[BR][BR]Armories have very little to do with troops production though. Well it allows me now to use 14h time boosts for troops production. But other than that it hasn´t changed a thing.[BR][BR]2 brown bears is sure a nice thing, but nothing compared to some other folks I know lol. However yes I have a big (and strong) army (that´s the point of designing a city for fighting) and loosing 1000 squads a week is fine by me. I think this week it was more like 2 or 3k, I posted the results in more detail somewhere else if you are interested...[BR]Anyway I doubt we are doing anyone a favour if we say 1 brown bear standard, 2 brown bears unlimited army. It sure helps I would never claim otherwise, but so do 10 other things I do, i don´t think the brown bear is the most important one of them..."}, {"30": "Gargon667 said:\t\t\tYes I agree with you, fights where I loose half my troops are the ones that make me think if I should change my strategy [smilie--sprite1] I am not highly intelligent, so it takes quite a few of those to get the point across though... The first couple I tend to blame on bad luck [smilie--sprite2][BR][BR]Armories make Orcs, yes I got annoyed by being low on Orcs while upgrading a few AW to lvl 31. Also now it gives me the freedom to cater Orcs if I feel like doing so, everybody else complains about it costing too many Orcs, I figure I get my Orcs production up lol. Only problem is I keep forgetting to cater altogether, so now my Orcs multiply without any reason lol, but they don´t decay so I am not too grumpy about their proliferation...[BR][BR]Armories have very little to do with troops production though. Well it allows me now to use 14h time boosts for troops production. But other than that it hasn´t changed a thing.[BR][BR]2 brown bears is sure a nice thing, but nothing compared to some other folks I know lol. However yes I have a big (and strong) army (that´s the point of designing a city for fighting) and loosing 1000 squads a week is fine by me. I think this week it was more like 2 or 3k, I posted the results in more detail somewhere else if you are interested...[BR]Anyway I doubt we are doing anyone a favour if we say 1 brown bear standard, 2 brown bears unlimited army. It sure helps I would never claim otherwise, but so do 10 other things I do, i don´t think the brown bear is the most important one of them...\t\tClick to expand...I think you have figured a way to beat the current system even before the testing ends  [smilie--sprite8].[BR][BR]I have also heard of players with many Fire Phoenixes and Brown Bears. Of course one has to still feed them to get the benefit. However, again my point is 90% of the average players will have to settle for something way below this.[BR][BR]BTW, I am thinking of finding space for a 5th Armory [smilie--sprite1]."}, {"24": "skelve said:\t\t\tI think you have figured a way to beat the current system even before the testing ends  [smilie--sprite8].[BR][BR]I have also heard of players with many Fire Phoenixes and Brown Bears. Of course one has to still feed them to get the benefit. However, again my point is 90% of the average players will have to settle for something way below this.\t\tClick to expand...[BR]I just do what I have always done. i haven´t changed much besides the fact that I do not do every province 6 times every week. I limit myself. Well i do have to think more because of the more varied enemies (another plus of the new tourney). I literally fell asleep at various occasions doing the old tourney, not that it mattered I always had 24h to complete and I don´t sleep that long, but it amuses me to think back. this has so far not happened with the new tourney, but I assume it will happen eventually...[BR][BR]Don´t lump 2 Firebirds and 2 brown bears together, 2 completely different situations.[BR][BR]2 firebirds: Only possible by investing BIG amounts of real money during the original phoenix event. It has happened, but extremely rarely so. I only remember one town where I can see them (although I know there were of course more than 1), and as far as I know on my server none of the top tourney towns have more than 1 firebird.[BR][BR]2 brown bears: Very simple. All you needed to do was to play the last (and original) bear event at slightly above average activity level. The quests back then were an endless cycle and the rewards insanely high, so you had unlimited event currency available through an endless loop that gave out better prizes than they cost to generate. That is the reason why out events nowadays are so horrible. Inno always smashes things to pieces that are too good instead of balancing them to a reasonable level...[BR]I assume this event now will probably lead to a few more people with 2 brown bears (if they got 1 evolved last time and a second base with no or few artifacts) Just the same as people now have the chance to have 1 brown bear instead of 0. this btw is the one big reward possible from this event.[BR][BR]Feeding pets is not a problem as long as you don´t waste your pet food. I would feed 10 brown bears if I had them, but much less frequently. I would rather feed 10 bears once every 10 weeks than 1 bear every week. It would generate about 400% more troops that way all else being equal. And that is me being generous (forgetting a whole bear just for the effect that you can stack your 3 buildings before collecting and 12 h of regular troop production per week)[BR][BR]Yes I agree most people have to settle for less. Of course. Most people will always be below the top, otherwise it would not be the top anymore. this is not new though, it has always been like that even in the old tourneys, some where better than others. And people with less fighting specialisations in their cities would have lower scores. For some that were lower down the ladder they have managed to climbed, while others tumbled down... what has changed is the number of freebies you can pick up while climbing the higher parts of the ladder and fewer people reach those very high bits of the ladder..."}, {"122": "We are now going into the 6th week of testing (if i got my dates correct)[BR]It was said that it was getting extented for another 3 weeks  that time will be up  very soon and still we hear nothing from the DEVS[BR][BR]Is this to be extended even longer  ?????  If so for what reason   you have pages and pages of feedback  over 90% are against this new system [BR]but all we get is  keep feedback coming ......there is nothing new that can be said on this matter  everything is being repeated  [BR]and now players are having strong disagreements with each other in the forum ..and if we dont get this sorted soon it will only get worse ..[BR][BR]I will ask again   when are we going to get feedback from  the DEVS  ????"}, {"17": "But we received a hint from one of the staff as to why this us ongoing for us.  Above, someone said that more information was required due to the variation in the tourney types themselves.  This makes sense to me, as some types favour one race or the other, some types favour Barracks or Training Grounds or Mercenary Camp,  depending on a player's level, among other things."}, {"122": "Lelanya said:\t\t\tBut we received a hint from one of the staff\t\tClick to expand...[BR]I dont think people are wanting hints [BR]What we want and need is answers   they asked for feedback and they have gotten  a massive amount of it   but we ask for some feed back from them and we get nothing they stay silent"}, {"22": "Lelanya said:\t\t\tBut we received a hint from one of the staff as to why this us ongoing for us. Above, someone said that more information was required due to the variation in the tourney types themselves. This makes sense to me, as some types favour one race or the other, some types favour Barracks or Training Grounds or Mercenary Camp, depending on a player's level, among other things.\t\tClick to expand...Hmm, that's all very well, except that they originally said that they wanted the EN players to test for 3 weeks and not 9. Also, if that was the case they could actually make an announcement explaining the process a little bit. I don't think the comment you referred to came from the development team. It seemed like speculation."}, {"45": "To be honest @Pauly7 the release stated '' The new Tournaments will not go to further Live worlds than EN for at least another 3 weeks after the start of the first new Tournament on EN''[BR]So did not confirm how long this would continue for.....hence we are still invited to provide feedback at this point."}, {"118": "I am gonna repeat myself then, so Inno is testing on OUR stocks for maybe as long as 9 weeks...? and this without our consent....? Perfect....[BR]Wouldn't it be fair to get something in return like compensation instants, (troops or even the faster/boosted manufactories days) to help us recover faster?[BR][BR]Tourney Bandits are one of the few fellowships completing the tournament under this new format yes, and although you might think that it shows that the devs had it right, there are no or very few flows and they are going in the right direction.... Let me tell you that 1or 2 overachieving tournament oriented fellowships don't actually represent the majority here...[BR][BR]As Killiak perfectly said:[BR]Killiak said:\t\t\tThe problem within this change lies with the formula, the discrepancy it can create between players, and the punishment it delivers to anyone who simply grows their city without a very specific understanding of the way the tournament formula works within the game. Aside from the punishment it already gives to those who have grown their city according to the old system.[BR]The problem has been math'd out already as well, both on Beta and shown again here in this thread. So what would be the best solution that would not punish players who play their city builder, want to just play like they want to and want all the expansions and all the AW's?[BR][BR]Really, the only thing that comes to mind is capping the difficulty of the curve at some point. People who play the tournament religiously will still be able to optimize and score as much as they can/want, whereas more casual players will still enjoy the benefits of the change in the much easier early provinces.[BR]It's definitely not a perfect solution, but it fixes some of the problems we have with this change. I don't think we can fix the entire issue as it stands with this formula anyway.\t\tClick to expand...[BR]And to those who are perfectly happy with this guinea pig testing situation and the feedback we get from Inno's representatives, good for you, but there are a bunch of us who would like some concrete answers... Thank you."}, {"100": "@Kaliartis They won´t, they don´t care about we emptying our stocks and troops, I won´t be surprise if they \"test\" this fool tournament format only in EN until we reach 2021 or much more beyond this date.... Cause, Why would they get hurry? They don´t need solve this fast.[BR][BR]BTW mods, with my comment I´m not violating any rule, so even if my comment it is not the positive thing you and INNO are waiting and you don´t like it, it is not a justification to get me another ban, if you do so, you would only be taking out my freedom of speech."}, {"20": "A little bit of elixer tourney in colour[BR][BR][IMG]https://i.ibb.co/x3Lpjt2/https-en-forum-elvenar-com-index-php-attachments-elixer-jpg-4815.jpg[/IMG]"}, {"22": "BlueBlou said:\t\t\tA little bit of elixer tourney in colour[BR][BR]View attachment 4815Click to expand...What do all the letters / colours mean?"}]