[{"15": "Pauly7 said:\t\t\tWhat do all the letters / colours mean?\t\tClick to expand...Blue: LM[BR]Green: LR[BR]Purple: Mages[BR]Red: HM[BR]Yellow: HR"}, {"122": "Silmaril said:\t\t\tthe release stated '' The new Tournaments will not go to further Live worlds than EN for at least another 3 weeks after the start of the first new Tournament on EN''[BR]So did not confirm how long this would continue for.....hence we are still invited to provide feedback at this point.\t\tClick to expand...[BR]Your saying we are invited to provide feedback[BR]What more can be said that has not been said  already ??[BR][BR]As Pauly7 said  they could actually make an announcement explaining the process a little bit. [BR]I have also been asking for information from the Devs  but it  just  feels like am wasting my time [BR][BR]And is it  possible that you can ask if they have any idea how long this unfair testing on only our server is going to last for .."}, {"20": "Pauly7 said:\t\t\tWhat do all the letters / colours mean?\t\tClick to expand...My apologies for omitting the key. I struggle with the short codes and letters others use. I think in colour. Just the way my brain works, so thought it was obvious.  The colours are the same as on the badges of the troops and b is for blue etc. Blue will be any of the light melee troops. I did not distinguish between what was seen in the range."}, {"90": "I stopped coming here at page 37. Today, I'm at page 47. That's another 10 pages worth of communications and feedback from a community that has loudly and clearly expressed a fundamental issue with the Tourney system. I've added a comment here and there before but today I want to address a specific issue of this thread: its moderators.[BR][BR]I want to believe that you are actually nice people. Good and honest human beings. I really want to.[BR]But the way you deflect or shy away from answering questions, giving vague and veiled responses or couch your replies with positivity is driving me up the wall.[BR][BR]I doubted that any of you moderators actually play the game until that one comment from Silmaril not long ago saying that you couldn't keep up with Troop production. Now I have proof that you play this game.[BR][BR]Silmaril said:\t\t\tI personally am looking forward to not scratching around so much for units as I never seem to have enough for the Spire and the Tournament\t\tClick to expand...[BR]47 pages of feedback and not a peep from you moderators. So that's what I want to hear. What are your personal experiences playing the Tourneys @Silmaril, @herodite, @anonglitch ? What are the facts and figures of your city layout and construction that has allowed you to cope with it unlike the rest of us? Perhaps that way you can help school us in how to play this game better. What advice would you have for us so that we can continue to enjoy the game as you have?[BR][BR]Cause the alternative is that you don't actually play the game, and therefore are out of touch with the community because what we are experiencing you have no real clue about.[BR][BR]And if you are struggling as we are, how can you sit there, comfortably in your homes, facing the computer being a moderator of a forum thread exploding with feedback and still pretend that its all smiles and happy faces? And one among you even has the gall to ask us to be less negative about this whole sham. That would be extremely dishonest of you moderators then, if you are being punished like we are and yet wear that mask of neutrality. You may well ask what is the good of having forum moderators being as frustrated as we are? Well, it means that the community as a whole is rejecting this new system and would appreciate a thorough revision of its workings. It'll help me, if for nobody else, reconcile with how you dare bring in that cheery disposition insisting all is well and all will be fine when it hasn't. Because as long as you maintain that position, I cannot trust this team of moderators. There is a disconnect between the community and the community moderators when there is no transparency.[BR][BR]Bring in one of your developers in here and have him/her chat with us. I want to hear it straight from the horse's mouth."}, {"90": "For good measure, I've copied my text into a document in case someone decides what I've said was inflammatory or abusive. I don't think I am, but it won't surprise me if they decide to suppress my message."}, {"54": "Ephraim Heart said:\t\t\t47 pages of feedback and not a peep from you moderators. So that's what I want to hear. What are your personal experiences playing the Tourneys @Silmaril, @herodite, @anonglitch ? What are the facts and figures of your city layout and construction that has allowed you to cope with it unlike the rest of us? Perhaps that way you can help school us in how to play this game better. What advice would you have for us so that we can continue to enjoy the game as you have?\t\tClick to expand...I don't think you will ever see a personal experience post from a moderator on here, at least not if its giving negative feedback. the mod teams are a team and they are not allowed to say anything that only puts the other moderators into tight shoes. Imagine if a mod says: this change is trash, it would be quoted all over to prove a point and would even be quoted on other forums. Putting extra stress on the forum mods or support mods.[BR][BR]What moderators are allowed to do tho, is post with their player accounts, and maybe some have already done that here. Although its not needed for them to do it, since they can just give their feedback directly to the CM, who then passes this on along with the other feedback they collected from this thread."}, {"90": "That is my point, there are two scenarios here: one is that the forum moderators have found a way to play which allows them to progress as usual and therefore is the reason behind their faith in the new system or they aren't coping well with it much like us which means their positivity is faked.[BR][BR]Either they aren't playing the game and hence have no actual experience of the changes and its impact on gameplay, or they have found a way to work around it but won't share that strategy with us thus prolonging our uncertainty and frustration. If the former indicates that they are out-of-touch, the latter would paint them as dishonest and unkind. Which is it?"}, {"22": "Ephraim Heart said:\t\t\tI want to believe that you are actually nice people. Good and honest human beings. I really want to.[BR]But the way you deflect or shy away from answering questions, giving vague and veiled responses or couch your replies with positivity is driving me up the wall.\t\tClick to expand...You're really directing this towards the wrong people, though I realise we're not able to communicate directly with the devs.[BR][BR]The moderators do just that - they moderate - but as far as I know they do not have any involvement with the development of the game and they are volunteers. I agree that sometimes the responses can be frustrating when we keep seeing the same positive spin pasted back to us when we perhaps don't feel positive... but the mods are only acting on whatever information they can get from the devs. Understandably they aren't going to be openly critical of the game or the information they're getting."}, {"90": "But I don't understand, why won't they be openly critical of the game or the information they are getting? It is as they professed it, their beloved game! So unless there is a disconnect between us and the moderators, surely then, even they would know and be able to see that there are urgent issues to the new Tourney system. [BR][BR]If they are volunteers who agree to moderate willingly out of their passion for the development of the game, what would be so criminal if they were as critical of the new system as we are? That's the one advantage of volunteering: if you don't like it, you can walk out! What is the worst anyone can do to them? [BR][BR]In fact, if they had been critical of this new update there'd be empathy between us and them. I wouldn't feel like I'm talking to a brick wall over and over again. It is exactly that they seem to be accepting of the new system that reeks to me of something being hidden and not properly disclosed. How can there be this massive gap between us the community and the moderator team?"}, {"122": "It has come to the stage where us players should just post something on these words[BR][BR]TODAYS FEEDBACK[BR][BR]Since there has been no changes from yesterday there is nothing to give feedback on [BR]I dont wish to repeat what has already been said about the tournament system [BR][BR]Will report back tomorrow ...... no change  then it will be same message ...."}, {"22": "@Silmaril @anonglitch @herodite, this is kind of repeating what others have said, but I would be grateful if you could explain to the devs that there is growing unrest and that people are asking for some sort of update on progress. If you can get back to us and say \"We have asked and they said X\" even if X is them just saying that they are unable / unwilling to give more information, at least people can see the line of communication."}, {"86": "People are running out of patience, and it is high time that someone further up the food chain than our 3 current mods, came and spoke to the forum about what is going on and for how long this current situation is going to continue for…not vague comments, concrete timelines, so that we can go back to our Fellowships and explain what is going on."}, {"128": "I think there's one question that needs asking if the new tourney only needs tweaks roll it out to all servers, light the touch paper and the feedback would be so condensed so you could get all your answers in one fell swoop. WE cannot be the only people on the server saying don't buy diamonds even at 1000% bonus(some would ofc) because there is no benefit only punishments  , an easy comparison is going to the butchers buying meat paying for it then the butcher slaps you across the face with the meat you just bought. That how it feels, so new tourney no diamonds will be bought by me. For the regulars on the forum quote this all you want I've said my piece"}, {"84": "We are at the point now where i really believe that any further feedback is a waste of time. Everything that can be said has been said. I think that the devs are now not interested in feedback and are just looking at the numbers after each tournament because that is probably all they understand. If the data shows them what they want to see there will be no changes."}, {"86": "Well if this is the way it is going to be, I would just like to know….that way I (and possibly others) can just pack up my cities and go off to another game"}, {"122": "Joemork said:\t\t\tWell if this is the way it is going to be, I would just like to know….that way I (and possibly others) can just pack up my cities and go off to another game\t\tClick to expand...[BR]I agree 100%"}, {"84": "Joemork said:\t\t\tWell if this is the way it is going to be, I would just like to know….that way I (and possibly others) can just pack up my cities and go off to another game\t\tClick to expand...[BR]That is probably the reason why they stay quiet."}, {"122": "The Mods and Devs have been asked for information  and what do we get  ...silence from them all [BR]It feels like we are just being ignored now by the Mods and Devs[BR]Maybe the Mods have been told to stay  silent  by the Devs ..but is it not your job to respond to the Forum if a question is asked[BR]this will most likely go unanswered also"}, {"86": "Timneh said:\t\t\tThat is probably the reason why they stay quiet.\t\tClick to expand...Its going to happen, its just a question of when.....when they let us know what is happening and that nothing is changing or when this format goes to the other servers....why prolong the inevitable pain inno?....personally, I am just holding on by a thread in the hope that something will change...."}, {"15": "I really don't think it's ok to call out mods here on anything. They are doing just what they are supposed to do, moderate the forum, answer some questions and try to keep a pleasant atmosphere (obviously very though to do these days).[BR]Also if they post their usual thing \"keep giving feedback... yadada\" you say they are being vague and putting positive spins. And if they say nothing you accuse them of ignoring us. But if they are not getting anything from the devs those are the only 2 options, what else can they do? Ofc a mod is not going to express thier disatisfaction with the game even if they feel the same way as as we do. And ofc they will be trying to put positive spins. Patience and positivity is something required from mods.  [BR]Between the players being angry at the new tournament system and the devs being silent this is really a though time to be a mod around here  [smilie--sprite1]"}]