[{"15": "Joemork said:\t\t\tWell if this is the way it is going to be, I would just like to know….that way I (and possibly others) can just pack up my cities and go off to another game\t\tClick to expand...I know this is not what you meant but it would be so cool if we could actually pack up our cities and export them to some device that could then make a holographic projection of it on our desk [smilie--sprite8] [BR]Or, to keep it more realistic, if we could export of it to our PC, maybe a 3D model.[BR]I really like my city and would like to be able to keep it even if I stop playing this game someday."}, {"5": "Dearest Gamers,[BR][BR]Allow me to address your current concerns as to our conduct/role as Moderators. [BR][BR]First and Foremost let me confirm that yes, we are all players and have been for quite some time. If we were not, then we would not be able perform this role even at a basic level. Secondly our role here is to Moderate. This means we ensure that the Forum Rules are being adhered to, we are a first point of contact for any queries, and we are also the guys that feed back any issues/concerns up the ladder. In view of us being the bridge between yourselves and the Devs, we will often notify you of changes, and then request feedback concerning those (hence this thread) let me confirm however that we are not involved with these changes, we merely voice them. [BR][BR]In addition, whilst some of us may on occasion discuss our personal gameplay, we will never give our opinions on recent changes. We are here to listen to your opinions and feed those back, we are here to steer your threads and ideas to the correct places, not inflame them further. We need to be impartial in everything we do to ensure this.[BR][BR]We will never cherry pick certain comments due to their positivity or negativity for that matter. As long as it is in line with Forum Rules, it stays.[BR][BR]Now, regarding your concerns regarding the Tournament Feedback (and I apologise if you feel this is too positive in its delivery) we have forwarded your Feedback to the Devs, and we continue to do so, including the discord amongst you. There is no conspiracy to keep information from you, we have been given a task, and we are fulfilling that task. Had we any information concerning your questions we would provide you with it. Now I appreciate your stance concerning the lack of communication, but there is no further update we can provide at this time. When we know, you will know. That I can assure you of as this is part of our role to keep you informed.[BR][BR]Until that time, we will continue to take on board your frustrations, however I would also like you to keep in mind that we are doing our very best to ensure your voices are heard by the Team.[BR][BR]Kind Regards[BR][BR]Herodite."}, {"1": "There is not much more to add to @herodite 's, but please keep in mind, that even when we do not reply, we are reading every single blog post.[BR][BR]We cannot provide counter feedback or make absent promises, it would be worse. We do our best to talk to the developers, and we can deliver better or worse news, but nothing out from thin air.[BR][BR]Constructive feedback is great, and we received a lot of it. However, it does not mean that for the fact of having more feedback, the devs will bring any changes sooner. But it helps more than you can imagine.[BR][BR]We understand your frustrations, and we would love more than you imagine for everybody to be happy and excited about all these changes.[BR][BR]However, be assured, that we will be sharing here in no time as soon as we have news, as we have done in other occasions."}, {"122": "@herodite  @anonglitch[BR][BR]Thank you for your replies It sounds like you are in the dark as much as we are [BR]What is being asked is that the Devs come forward with some kind of information on these matters[BR]there silence is not helping one bit .[BR]As been stated   what can the players give feedback on ???? there has been no changes   and everything is just starting to be repeated"}, {"1": "No problem, we are very happy to help in any way possible [smilie--sprite1][BR][BR]One reason for being silent was due to not having something new to share, and no one likes to read the same over, and over.[BR][BR]The developers receive the feedback, but they still need to consider it, code it, test it, etc. Lack of silence does not mean ignoring, but more like \"working on it!\""}, {"30": "@herodite and @anonglitch I am impressed with your highly professional response to the current situation. However, devs need to understand that letting this situation continue like this and escalation of this beyond this forum will going to hurt Inno as a company really bad in front of their investor community more than the customer base. This is where the stakeholder management skills of the management will be really tested. When perception becomes the reality, facts and figures become very little use.[BR][BR]BTW, just to make sure there is no misinterpretation, I am not talking about the changes to the game. I am talking about the level of engagement from devs with what is going on here."}, {"45": "Each Tournament brings a slightly different challenge to the game with varying strategies that may or may not have worked sucessfully before.[BR]What would be useful rather than players just reiterating they dont like the changes, would be quantifiable reasons why. What has changed that week? has it changed for the better, worse or about the same than previous week/s and prior to the adjustments?[BR]I know we have had some fabulous examples, but more would not go amiss either.[BR]As I have said often before, we have a unique opportuity here as players to hear our voices heard in positive ways."}, {"123": "Hekata said:\t\t\tOr, to keep it more realistic, if we could export of it to our PC, maybe a 3D model.\t\tClick to expand...Fighting could be come fun...maybe[smilie--sprite1]"}, {"122": "@Silmaril [BR]without a DA  and alot of troop boosts  its hard every week  nothing has changed [BR]If you are not lucky to have  any DA   then you need  more troop boosts than you did before these changes [BR]problem is they dont come along enough in the MA  [BR]So in a way every tournament is the same (hard with boosts   extra hard with little boosts  and mega  hard if you dont have boosts"}, {"129": "My first post here in forum, as I feel the need to react.[BR]I consider myself an average end-game player, don't have much in the way other players here do, 133 expansions, 193 AW levels, researched Chapter 16 to the end (skipped some optional ones). I am ranked among the top players in our FS and our FS is in top 20 in the world. I usually did around 10 provinces, recently started doing more - 15 was a usual number, and if I felt the need, I went to around 20 provinces. Mostly because of the number of clicks, that was cumbersome, not because I wouldn't be able to go farther. My only boost was from the phoenix, didn't feel the need to use any other, as I had no problems doing the 15-20 provinces without any. I also did the Spire to the top, first two tiers fighting, third tier I switched to diplomatic. Shortly before the tourney change I tried using the DA and MMM to fight the third tier and it went smoothly, so I was happy I could save some resources (especially orcs) for upgrades of buildings. Also, if timed right, I could use the DA and MMM for two weeks of the Spire - so I would save them, as they're not so common to get.[BR]However, since the new tourney system, I started to get beat at around province 9-10 (second round) when I only had the Phoenix fed! By beat I mean wiped out! These used to be a breeze! Also, doing more than 15 provinces weekly even with a DA, MMM and ELR + phoenix is unsustainable for me. This means if our FS needs the top players to step up to reach 10 chests, I can do more provinces but I have to be prepared for heavy losses of either troops or resources in catering.[BR]I have not researched my limits after which I'm not able to fight or cater any more, as I am not willing to spend all my buff buildings, time instants and pet food for the brown bear, along with resources which took a long time to collect just for the testing I did not agree to.[BR]I am aware the tournament needed some changes in difficulty but this seems quite steep from a very early stage."}, {"65": "what I may not have said before and what really bothers me is that all the weeks with the new system are too similar. can be used in over 20 provinces almost only frogs and blossom mages, sometimes rarely rangers or others. All tournaments are the same now - best to use lot of armories and UUU  and lot of frogs and blossom mages"}, {"15": "rock stream said:\t\t\tFighting could be come fun...maybe[smilie--sprite1]Click to expand...You mean having giant holographic Treants or Archers running through my house? [smilie--sprite8]"}, {"22": "zmokito said:\t\t\tMy first post here in forum\t\tClick to expand...Welcome to the forum!"}, {"32": "kurgkurg said:\t\t\twhat I may not have said before and what really bothers me is that all the weeks with the new system are too similar. can be used in over 20 provinces almost only frogs and blossom mages, sometimes rarely rangers or others. All tournaments are the same now - best to use lot of armories and UUU  and lot of frogs and blossom mages\t\tClick to expand...[BR]Because there is nog longer a clearly defined set of enemies, but a somewhat random pick of 15 units(with a little favoritism in each tournamen but not like the old)[BR]Ranges units are indeed the way to go. this is because:[BR]They strike firstThey might be able to strike without exposing themselves to enemy units they are weak to.Melee units are unable to do this.[BR]One of the challenges then will be what to do with these \"sacrificial units\" you can train but not really use anymore.[BR]You have to look out for usecases no matter how big the losses are, just to \"use them\"[BR][BR]This makes the tournament indeed look on the surface identical each week, even if thats not entirely the case. they are just too similar."}, {"22": "Silmaril said:\t\t\tEach Tournament brings a slightly different challenge to the game with varying strategies that may or may not have worked sucessfully before.[BR]What would be useful rather than players just reiterating they dont like the changes, would be quantifiable reasons why. What has changed that week? has it changed for the better, worse or about the same than previous week/s and prior to the adjustments?\t\tClick to expand...I'm struggling to figure out what you are driving at here. Are you saying that adjustments have been made since last week's tournament, or the one before? The only adjustment I'm aware of being made since the testing started on EN was the very very minor tweak to the difficulty curve in the first ten provinces. That change was not significant enough for anyone to be able to discern. (I'm leaving aside the separated training queues as that doesn't have any impact on the combat.) If there have been other changes then that would be a good thing for us to be let know about.[BR][BR]Most people's main problems with the new tournaments are fundamental. We're not (or at least I'm not) complaining over whether one week is a little easier, or harder, or has variations from, the previous week. There's no point reiterating the same things over and over, as you say, but those same problems still exist and we aren't seeing any response to them. There have been very detailed descriptions of what the issues are, from a lot of people. It isn't a case of people just saying \"I don't like the changes.\" What is the best way to now proceed with feedback?[BR][BR]My comments on the last two tournaments specifically, however - I can say that I found the elixir tournament last week to be by far the easiest so far, and from what I've seen of magic dust this week - it has been by far the hardest. In the old dust tournaments I would expect them to be difficult because of the need to use the poor light melee troops, but strangely I have used almost zero light melee during my first round today.[BR][BR]My \"medium term\" feedback, is that I believe the tournaments have been made much too easy to begin with and then much too hard too quickly, meaning more people are funnelled into very similar looking scores and that removes much of the interest from it as a competition. (I said all that a day or two ago.)[BR][BR]To stress again, though, I have no complaint with one tournament feeling different to the next. I actually enjoy playing these tournaments more than the old ones. I also don't mind that my tournament average has been reduced from 11-12k to 6-7k. What I do mind, though (and yes I'm probably into triple figures the numbers of times I've said this now, on different forums) is fundamentally how the tournament formula has been put together. For as long as they insist on keeping a system where progress is punished - and punished very severely - then all the \"fine-tuning\" feedback regarding specifics, is all kind of pointless, and I will believe that these tournaments are close to broken. If the developers decide to start communicating and let us know that they are working on ways to disentangle the mess with Ancient Wonder and expansion impact - well that is the feedback that we are waiting for."}, {"30": "Silmaril said:\t\t\tEach Tournament brings a slightly different challenge to the game with varying strategies that may or may not have worked sucessfully before.[BR]What would be useful rather than players just reiterating they dont like the changes, would be quantifiable reasons why. What has changed that week? has it changed for the better, worse or about the same than previous week/s and prior to the adjustments?[BR]I know we have had some fabulous examples, but more would not go amiss either.[BR]As I have said often before, we have a unique opportuity here as players to hear our voices heard in positive ways.\t\tClick to expand...If I am not mistaken since your first post on 12th August 2020 on this regard we have seen 3 releases 1.111, 1.112 and 1.113. Are there changes outside these releases? Is there a place where all these minor changes can be read?"}, {"4": "I remember reading somewhere that the tournament changes were partly brought in because previously the trader would be dry on 1 particular good of each tier weekly.[BR][BR]What I find to be the case now is that the trader is out of T1 goods and full of trades wanting T1 from higher tier goods."}, {"8": "Pauly7 said:\t\t\tWhat I do mind, though (and yes I'm probably into triple figures the numbers of times I've said this now, on different forums) is fundamentally how the tournament formula has been put together. For as long as they insist on keeping a system where progress is punished - and punished very severely - then all the \"fine-tuning\" feedback regarding specifics, is all kind of pointless, and I will believe that these tournaments are close to broken. If the developers decide to start communicating and let us know that they are working on ways to disentangle the mess with Ancient Wonder and expansion impact - well that is the feedback that we are waiting for.\t\tClick to expand...[BR]No point in my typing out the same thing again.....but this point has been posted numerous times and on this, nothing seems to have changed, yet this is the biggest gripe."}, {"45": "@skelve All changes are mentioned in the release notes.[BR]@Pauly7 Not getting at anything as such, just asking for substance to help devs as unhappy posts we see and understand the player is unhappy, but explanations as to whats occuring is what we need, which you have just also supplied [BR]@zmokito Welcome! and thank you so much for your post here[smilie--sprite1], thats really good information.[BR][smilie--sprite1]"}, {"122": "@Silmaril  Is it possible that you could ask the Devs  how long they feel we will be testing this for [BR]It would be nice to know how much longer  our server is losing out while the other servers are reaping all the benefits of the old tournament system [BR][BR]I look forward to your reply"}]