[{"45": "@malph I ask daily and as soon as I get a definitive response, you will all be the first to know."}, {"122": "@Silmaril  So what your saying is  they have no idea how long this is going to last[BR]what a mess  they have created ( Maybe Inno  need to get other programmers in ) to fix this out"}, {"1": "Is not about being a mess, @malph, however, these things take time. Would you rather have the developers rush through everything, and then truly create a mess? I am happy it is taking its time, because it means they are working on it, and they are not happy as it is right now, based on our feedback. But still, coding takes time, alpha testing (when it still did not leave the dev's PCs), and then to arrive to our servers, usually starting by beta.[BR][BR]We live in a society of rushing, instant delivery, urgent whatever, etc... But some aspects like surgery, designing a building (real-life), coding a game, creating art, etc, can't be rushed [smilie--sprite1][BR][BR]Please, be a little patient, wait is always for a greater good."}, {"8": "anonglitch said:\t\t\tIs not about being a mess, @malph, however, these things take time. Would you rather have the developers rush through everything, and then truly create a mess? I am happy it is taking its time, because it means they are working on it, and they are not happy as it is right now, based on our feedback. But still, coding takes time, alpha testing (when it still did not leave the dev's PCs), and then to arrive to our servers, usually starting by beta.[BR][BR]We live in a society of rushing, instant delivery, urgent whatever, etc... But some aspects like surgery, designing a building (real-life), coding a game, creating art, etc, can't be rushed [smilie--sprite1][BR][BR]Please, be a little patient, wait is always for a greater good.\t\tClick to expand...[BR]Actually @anonglitch if they had taken their time on the test server, they wouldn't have created said mess on live server."}, {"1": "OldHag said:\t\t\tActually @anonglitch if they had taken their time on the test server, they wouldn't have created said mess on live server.\t\tClick to expand...[BR]We did explain this one a few times, but there is a reason:[BR][BR]The way that many players play in beta, it's not the same as we play in our main cities. That impacts testing, hence the reason for testing here also. But we happen to get the learning process, both for positive and negative, and to be able to provide feedback here versus getting an implementation without the chance of change.[BR][BR]Sometimes the mechanics are much trickier than you can imagine [smilie--sprite1] That applies to everything in life!"}, {"122": "anonglitch said:\t\t\tIs not about being a mess, @malph, however, these things take time. Would you rather have the developers rush through everything, and then truly create a mess? I am happy it is taking its time, because it means they are working on it, and they are not happy as it is right now, based on our feedback. But still, coding takes time, alpha testing (when it still did not leave the dev's PCs), and then to arrive to our servers, usually starting by beta.[BR][BR]We live in a society of rushing, instant delivery, urgent whatever, etc... But some aspects like surgery, designing a building (real-life), coding a game, creating art, etc, can't be rushed [smilie--sprite1][BR][BR]Please, be a little patient, wait is always for a greater good.\t\tClick to expand...[BR]What a terrible answer[BR]you say be  patient  I think we have all been very  patient  with them  and i now know that the Mods  are asking for answers  but  not getting any[BR]And it should never have left beta  in the current mess its in better still It should never have left the Devs PCs   ..[BR]Also i feel they rushed through it   and  now they  know it is a complete mess  a failure on there part"}, {"84": "anonglitch said:\t\t\tBut still, coding takes time, alpha testing (when it still did not leave the dev's PCs), and then to arrive to our servers, usually starting by beta.\t\tClick to expand...[BR]That has raised a question in my mind. If the devs do make any changes will the Beta server get them first or will we get them at the same time as we are testing this at the same time as Beta ? If you do not know the answer would you please ask and let us know."}, {"45": "@malph Not saying that at all, just saying as of today we cannot give a definitive answer, but we are working on this to get a conclusion date at the very least."}, {"122": "Silmaril said:@malph Not saying that at all, just saying as of today we cannot give a definitive answer, but we are working on this to get a conclusion date at the very least.\t\tClick to expand...[BR]Thank you Silmaril Hopefully we can get some idea from them soon"}, {"75": "Premium expansion sale on offer today. [smilie--sprite11][BR]No thanks, not until there's some clarity, going forward, and perhaps not even then, depending on the dreaded formula ..."}, {"22": "Verde said:\t\t\tPremium expansion sale on offer today. [smilie--sprite11]Click to expand...Yep. the diamond offers are coming thick and fast. No coincidence."}, {"122": "there must be panic  at INNO [BR]Every other day  there's offers of some kind of diamond deal  and now they want you to buy diamonds for cheaper expansions[BR]we never got offered so many deals like this before one after another [BR]It shows  that not many people are buying diamonds at the moment ..and hopefully the shareholder will notice and wonder whats going on"}, {"22": "malph said:\t\t\tthere must be panic at INNO[BR]Every other day there's offers of some kind of diamond deal and now they want you to buy diamonds for cheaper expansions[BR]we never got offered so many deals like this before one after another[BR]It shows that not many people are buying diamonds at the moment ..and hopefully the shareholder will notice and wonder whats going on\t\tClick to expand...It's not a panic. They're analysing the effect of the new tournaments on diamond sales. This is what this testing phase is really probably all about."}, {"89": "malph said:\t\t\t[...]\t\tClick to expand...[BR]I think you're a bit too optimistic about that. Even if there is a good amount of ppl here in the forums that won't buy any premium expansions / diamonds anymore (including myself), most ppl out there don't even have a clue how the formula works, so they don't see any issue with buying these.[BR][BR]Even ppl who know about that new formula will buy new expansions as they simply don't care. Most prominent example in this thread could be @valle (no offense - i'm good with the fact that you like / adapt to those changes). So the influence of the new system should be too small to make a big difference in the big picture - at least for now. [BR][BR]It could make a difference if there are some so called \"whales\" within the quitters. Maybe it could also make a difference in the long term, as soon as details about that new system are also known by casual players, but at that time the lost income wouldn't be automaticly connected to that change."}, {"118": "anonglitch said:\t\t\tWould you rather have the developers rush through everything, and then truly create a mess? I am happy it is taking its time, because it means they are working on it, and they are not happy as it is right now, based on our feedback. But still, coding takes time, alpha testing (when it still did not leave the dev's PCs), and then to arrive to our servers, usually starting by beta.\t\tClick to expand...I would rather have the developers take their time on beta, take thoroughly into consideration the feedback from BETA players which is more or less what is repeated over and over again here (revision of the formula itself).[BR]BETA, is the place where players are volunteering for testing new content and giving their feedback. We have been forced here and ONLY here on LIVE EU to test Inno's new and still flawed content FOR FREE, that testing is brutally eating all our stocks, and we should feel happy about that according to you? [BR]The last few weeks I am not having fun, I have just been trying with pain to adapt to something that might change again...[BR][BR]anonglitch said:\t\t\tWe live in a society of rushing, instant delivery, urgent whatever, etc... But some aspects like surgery, designing a building (real-life), coding a game, creating art, etc, can't be rushed [smilie--sprite1][BR][BR]Please, be a little patient, wait is always for a greater good.\t\tClick to expand...Although we live in a society of programmed brain and marketing manipulation, I wanted to believe that we could still decide for ourselves when it comes to our free time and gameplay... But maybe it is just an utopia..."}, {"4": "Pauly7 said:\t\t\tYep. the diamond offers are coming thick and fast. No coincidence.\t\tClick to expand...[BR]We usually get these same diamond offers through an event. I do every event anyway and haven't noticed any extra than the norm."}, {"126": "Ummmm, I don't remember seeing this many back to back.  These diamond offers have been coming hot and heavy since before the current Event started.  My opinion, this is the true reason why the \"testing,\" has come to this server.  And to follow up your earlier point, I too have noticed a dramatic increase in the number of cross tier trades being put up.  Perhaps a sign that although the earlier provinces may seem to be a lot less expensive to cater, those goods do add up in a hurry and it would not be hard to over extend what you are able to make on a daily basis"}, {"32": "Pauly7 said:\t\t\tIt's not a panic. They're analysing the effect of the new tournaments on diamond sales. This is what this testing phase is really probably all about.\t\tClick to expand...[BR]It's just a normal pattern of diamond sales in an event[BR]Each (long) event we have a residence/workshop sale and a premium expansion sale.[BR]The other diamond sales of event currency for free when you buy diamonds and others are also regular sales.[BR][BR]ShadowVision said:\t\t\tI think you're a bit too optimistic about that. Even if there is a good amount of ppl here in the forums that won't buy any premium expansions / diamonds anymore (including myself), most ppl out there don't even have a clue how the formula works, so they don't see any issue with buying these.[BR][BR]Even ppl who know about that new formula will buy new expansions as they simply don't care. Most prominent example in this thread could be @valle (no offense - i'm good with the fact that you like / adapt to those changes). So the influence of the new system should be too small to make a big difference in the big picture - at least for now.[BR][BR]It could make a difference if there are some so called \"whales\" within the quitters. Maybe it could also make a difference in the long term, as soon as details about that new system are also known by casual players, but at that time the lost income wouldn't be automaticly connected to that change.\t\tClick to expand...[BR]Already are people on the \"live servers\" questioning if they should buy today's sale, because they heared trough the grapevines that this is detrimental to your tournament play.[BR]We only do not know yet how big this group of people is, but since the questions do pop up without it even being on live ain't a good sign"}, {"4": "CrazyWizard said:\t\t\tIt's just a normal pattern of diamond sales in an event[BR]Each (long) event we have a residence/workshop sale and a premium expansion sale.[BR]The other diamond sales of event currency for free when you buy diamonds and others are also regular sales.[BR][BR][BR][BR]Already are people on the \"live servers\" questioning if they should buy today's sale, because they heared trough the grapevines that this is detrimental to your tournament play.[BR]We only do not know yet how big this group of people is, but since the questions do pop up without it even being on live ain't a good sign\t\tClick to expand...[BR]Unless I misunderstand, the Beta changes to the tournament have been on live since 18th August.[BR][BR]I did \"buy\" an expansion with todays offer, because I had saved up enough free diamonds."}, {"57": "Hi Moderators. Can you pass this on please,[BR]\"Wouldn't you like to have fun, fun, fun[BR]How's about a few laughs, laughs \"[BR][BR]It worries me that they (the developers) keep asking about numbers. I know that a number of my FS have stopped or reduced their purchasing of diamonds. I have postponed my plans to start purchasing diamonds. People are NOT enjoying playing. If there's no fun, why bother playing.[BR]The developers need to inject some fun into the game.[BR]Hey, everybody[BR]Have fun again[BR]I want you to have fun[BR]Have fun again[BR]I want you to have fun"}]