[{"83": "Pauly7 said:\t\t\tIt's such a depressing thought. We should never be in a position where we're considering deleting Ancient Wonders.[BR][BR]I don't know if this is coincidence, but I'm running into a lot more people these last few weeks who are saying \"I'm taking a break from the game\" or \"I'm not able to be properly active in the game right now.\" I think with these changes, even if people aren't quitting their games in a blaze of glory, we're already seeing people just start to drift away.\t\tClick to expand...[BR]I agree completely.  If these ridiculous changes are made to the tournament, which used to be the best part of the game by far, I will lose interest in this game and quit.  INNO, why are you doing this?  I would appreciate an honest reply."}, {"24": "axelbloodaxe said:\t\t\tIt would make it easier if AWs could be teleported.\t\tClick to expand...check out the thread in the suggestions section [smilie--sprite1]"}, {"24": "Susananna said:\t\t\tI agree completely.  If these ridiculous changes are made to the tournament, which used to be the best part of the game by far, I will lose interest in this game and quit.  INNO, why are you doing this?  I would appreciate an honest reply.\t\tClick to expand...You are not going to get any official statement (to be honest why should they bother doing that, no matter what they say, be it good or bad, honest or BS, it will be ripped apart anyway, so no point wasting their time) but if you read through this thread here you´ll get a lot of possible answers, some more likely than others of course [smilie--sprite1]"}, {"25": "Alcaro said:\t\t\tI am thinking at the players who will hit ch.15 and 16 with these new changes ... how many months will they need to complete those two chapters? Alltogether over a year?\t\tClick to expand...This is exactly what I'm facing now in Beta.  The remaining techs in the research tree require 250 or more kp.  The original kp rewards were changed to AW tokens, and now we're being cut off from our main source of advancing.  How long does anyone want to spend stuck in the tech tree?  No hope of advancing does NOT make for a fun game."}, {"68": "Maillie said:\t\t\tThis is exactly what I'm facing now in Beta.  The remaining techs in the research tree require 250 or more kp.  The original kp rewards were changed to AW tokens, and now we're being cut off from our main source of advancing.  How long does anyone want to spend stuck in the tech tree?  No hope of advancing does NOT make for a fun game.\t\tClick to expand...There was much talk of making it easier for early chapter players to get 1.6k points by doing 6 rounds of the first 6 provinces, then they massively changed the difficulty further on making it impossible to win or cater fights much sooner than should be possible.  It seems that the end players aren't important to Inno, after all its taking them months and months to bring out the next chapter and so they seem to have decided that it should take players the same amount of time.  I wonder how many end game players there will be in 3 or 4 months time once EN has had the pleasure of the tournament changes."}, {"84": "How many people are still going to be happy to get loads of AW KPs when each extra level of AWs is going to make the tournaments harder for them ? In my opinion they have greatly reduced the value of AW KPs."}, {"22": "Timneh said:\t\t\tHow many people are still going to be happy to get loads of AW KPs when each extra level of AWs is going to make the tournaments harder for them ? In my opinion they have greatly reduced the value of AW KPs.\t\tClick to expand...That's true. I'm confident that the majority of AWs will still benefit people to upgrade, but there are some that won't. One interesting one that came up recently is Timewarp. We have a Beta fellow who was able to place a second Polar Bear and he's worked out that even though he just filled his Timewarp with KP he's not going to upgrade it because that extra level would just make his tournaments harder. When you don't need any cool down reduction and considering sentient production doesn't affect tournaments. [BR][BR]In either case you are right. AWKPs are devalued."}, {"33": "It sounds like a lot of you are playing the game \"Tournament\".  The problem with tournament is that it has been giving away far to much kp. Forcing people to do it primarily for that reason. I can't imagine a lot of you actuallt think it's fun to send the 5 same squads to battle hundreds of times.[BR][BR]By offering much less kp tournament will be a more normal part of play. Maybe there is no need to build your city only to maximize tournament score. There are other parts of the game too [smilie--sprite2]"}, {"84": "It has been said on more than one occasion (on other threads in the past) that for players that are at the end of the game and are waiting 2 or 3 months for a new chapter to be released that tournaments are the game."}, {"2": "valle said:\t\t\tIt sounds like a lot of you are playing the game \"Tournament\".  The problem with tournament is that it has been giving away far to much kp. Forcing people to do it primarily for that reason. I can't imagine a lot of you actuallt think it's fun to send the 5 same squads to battle hundreds of times.[BR][BR]By offering much less kp tournament will be a more normal part of play. Maybe there is no need to build your city only to maximize tournament score. There are other parts of the game too [smilie--sprite2]Click to expand...When I started to play this game, about 4 years ago, first city was in En2 and after some months in En1. Once I hit guests races I started to develop them differently. En2 was the fighter, En1 was the negotiator, because, as you said, I thought are different parts of the game, all helping a player to develop his/her city. After another year, with the path set by Inno, I found myself with a crippled city in En1, was hard to get decent scores in Tournaments, cause always I was limited by Orcs. Eventually I switched that city to fighting because THIS WAS THE PATH what Inno wanted us to follow!!!! (and with this changes, I will quit playing in En1 [even tho the city is in ch.16] and in En3 too, cuz I lost the fun.)[BR]What you are saying it's like blaming the victim. We did what we supposed to do in the terms set by Inno. It took me years to adjust everything to those terms > KPs instants instead of normal KPs, Seeds depending on the total amount of Wonder levels. I developed a whole strategy to grow my city, to get the best out of this game, I spent money to buy diamonds for what???? To get a hard kick in the rear for all those things?[BR]So, show me what are the other parts worth spending time playing this game? Upgrading stuff > taking days, collecting/ restarting production > oh yeah, very entertaining indeed, the Spire > crippling your troops or depleting your stocks? What else is to do in this game???"}, {"70": "I was able to make my personal record, and give farewell to the old format with this memento:[BR][IMG]https://i.ibb.co/HFXtGr3/https-en-forum-elvenar-com-index-php-attachments-mememto-jpg-4632.jpg[/IMG][BR][BR]*** Sad violin playing with fading applauses can be heard as the image vanishes away ***"}, {"2": "Maillie said:\t\t\tThis is exactly what I'm facing now in Beta.  The remaining techs in the research tree require 250 or more kp.  The original kp rewards were changed to AW tokens, and now we're being cut off from our main source of advancing.  How long does anyone want to spend stuck in the tech tree?  No hope of advancing does NOT make for a fun game.\t\tClick to expand...Same for me, my Beta city started ch.16 for about a month. I can't even imagine how long will it take to get those gazillions KPs for tech tree without the KPs from Tournament. And not the last ... I'm sitting on sh*t loads of KP instants cuz dunno if I should upgrade a wonder and if I do, which one to pick? What a sad ending for this game."}, {"22": "Alcaro said:\t\t\tWhat you are saying it's like blaming the victim. We did what we supposed to do in the terms set by Inno. It took me years to adjust everything to those terms > KPs instants instead of normal KPs, Seeds depending on the total amount of Wonder levels. I developed a whole strategy to grow my city, to get the best out of this game, I spent money to buy diamonds for what???? To get a hard kick in the rear for all those things?\t\tClick to expand...Timneh said:\t\t\tIt has been said on more than one occasion (on other threads in the past) that for players that are at the end of the game and are waiting 2 or 3 months for a new chapter to be released that tournaments are the game.\t\tClick to expand...These are important points. Tournaments have gotten way out of hand with the amount of rewards being given out, but it is Inno who has created this monster, allowing people to reach these levels. This means for many people there are years' worth of adjustments towards having a tournament orientated city and we have all been steered strongly in that direction.[BR][BR]I am not averse to it changing, but the way they have done it isn't right. They have decided that the big tournament players only make up a tiny proportion of the player base so they can get away with upsetting these people more, but they are also the backbone of the game, the forums, and the community. Without this minority they wouldn't have a game."}, {"68": "Alcaro said:\t\t\tSame for me, my Beta city started ch.16 for about a month. I can't even imagine how long will it take to get those gazillions KPs for tech tree without the KPs from Tournament. And not the last ... I'm sitting on sh*t loads of KP instants cuz dunno if I should upgrade a wonder and if I do, which one to pick? What a sad ending for this game.\t\tClick to expand...Don't forget that its not such a long time ago that AW levels were increased again from 31 to 35 to give us 5 more levels to throw those kp instants at.[BR][BR]Inno have been taking our money, letting us enlarge our cities beyond that which they give, they've let people buy more rewards in events to give us more than just one fire phoenix or brown bear, they encourage us to do more in tournaments and provide the tools (for a price) and then they say \"you're getting too much and so now we will penalise you\".  As a business model it is totally wrong and immoral to encourage spending money and later to not only take away any benefit but to make it less than it was before you spent your money."}, {"70": "Alcaro said:\t\t\tSame for me, my Beta city started ch.16 for about a month. I can't even imagine how long will it take to get those gazillions KPs for tech tree without the KPs from Tournament.\t\tClick to expand...[BR]Maybe the cave we all have in the city will be something new, like when we had the Spire's island only... maybe INNO has something for us in there, is very suspicious [smilie--sprite8][BR][BR]However, INNO does not want to destroy their business, or in this case, their product we all love: Elvenar. I am well aware, and @Alcaro knows well, I am going to suffer it quite a bit (hence my above screenshot), very high-level AW, low chapter, but hey, it will be \"a new reality\", and they will release more stuff besides the Spire, and the now new format. Stuff like this happens in all empire-building games, even happened on one MMORPG I played (so I assume it's for all, and no, it wasn't the most popular ones...), but in a few months, more aspects we are probably aware of, will be new, and we will get used to it, even like it."}, {"75": "Strategy used to be for dealing with the game parameters ... space, best way to organise city for different approaches, scenarios, events etc. [BR]Competition was against other players/fellowships but in a constructive way.[BR]At what point did we start having strategies for dealing with the latest nerf from Inno, and competing against the latest changes to the game in a destructive way (i.e. delete AWs)?[BR]The focus seems to have shifted, and not in a good way [smilie--sprite5]"}, {"33": "Timneh said:\t\t\tIt has been said on more than one occasion (on other threads in the past) that for players that are at the end of the game and are waiting 2 or 3 months for a new chapter to be released that tournaments are the game.\t\tClick to expand...[BR]But with less kp from tournament you will need more time to do new chapters. So the time waiting for next chapter will be reduced."}, {"2": "Verde said:\t\t\tStrategy used to be for dealing with the game parameters ... space, best way to organise city for different approaches, scenarios, events etc.[BR]Competition was against other players/fellowships but in a constructive way.[BR]At what point did we start having strategies for dealing with the latest nerf from Inno, and competing against the latest changes to the game in a destructive way (i.e. delete AWs)?[BR]The focus seems to have shifted, and not in a good way [smilie--sprite5]Click to expand...Too often I had/ have the feeling that we have a \"cold war\" between developers and their own players, like the devs are \"hating\" their players and trying to prove they are better and can kick our arses whenever they want.  [smilie--sprite3]"}, {"33": "Alcaro said:\t\t\tSo, show me what are the other parts worth spending time playing this game? Upgrading stuff > taking days, collecting/ restarting production > oh yeah, very entertaining indeed, the Spire > crippling your troops or depleting your stocks? What else is to do in this game???\t\tClick to expand...[BR]Before tournament came to Elvenar people actually played the game. That game is still there. The tournament made it possible for people to rush the game, then they start complaining that there is nothing to do when waiting for new chapter. Parhaps it's better to slow the game down a bit. Then you don't need to sit and wait for new chapters."}, {"70": "Alcaro said:\t\t\tToo often I had/ have the feeling that we have a \"cold war\" between developers and their own players, like the devs are \"hating\" their players and trying to prove they are better and can kick our arses whenever they want.  [smilie--sprite3]Click to expand...[BR]Why? We are their bread and wine... we keep the game running when we buy diamonds. Why wouldn't they want us? If they wanted to close the game, they would announce it without hesitation. I've seen it in the past."}]