[{"58": "It seems to me that the devs are quite happy with the changes. Maybe some minor tweaks here and there and they're done. If they only look at the numbers they miss almost everything that this game is about.[BR][BR]My tournament score is down from 8k to 6.5k, with substantially less rewards while the fellowship does better and now achieves 10 chests every week. For me not so bad a tradeoff since the personal rewards are still sufficient.[BR][BR]These numbers do not reveal that I can now lose up to 34 squads in a single battle. Since the enemy outnumbers me considerable, losses are really high. It feels like senseless slaughtering to me - no fun at all.[BR][BR]Last week, I earned a province expansion. A few weeks ago I would have happily placed it, now no more. Got an offer for discounted premium expansions, don't need them anymore.[BR][BR]Chapter 17 is about to be released, I love that - after all this is (was?) a city building game. Since I will not place expansions any more, I probably won't be able to follow the story quest and enjoy the chapter. Too bad.[BR][BR]The Ancient Wonders do have a negative impact on the tournaments and the Spire. The mods have hinted that the idea is to counter city progress and make fighting/catering equally difficult for everyone. Very social, equal share for everyone. But what is the incentive to play this game, when nothing you do will make any difference?[BR][BR]I would love to see that the devs rethought their course. There must be some way to evolve the cities, to make them better. If every progress is countered, the players will lose interest in the game soon, because there's nothing to look forward to. [BR][BR]In my opinion the Ancient Wonder levels and the city expansions must not impact the tournament/Spire squad size. [BR][BR]The research influence should match the advantages gained, don't make it exponential unless you are prepared to increase production accordingly or tournaments will become unplayable at some point. Unless that is the plan though..."}, {"32": "m4rt1n said:\t\t\tUnless I misunderstand, the Beta changes to the tournament have been on live since 18th August.[BR][BR]I did \"buy\" an expansion with todays offer, because I had saved up enough free diamonds.\t\tClick to expand...[BR]Only on this live server, all the other servers still have the old tournament format.[BR]The only change that went trough live in this period is the triple production queue in the unit training facilities."}, {"4": "CrazyWizard said:\t\t\tOnly on this live server, all the other servers still have the old tournament format.[BR]The only change that went trough live in this period is the triple production queue in the unit training facilities.\t\tClick to expand...[BR]Thank you for clarifying. [smilie--sprite1]"}, {"32": "RainbowElvira said:\t\t\tIt seems to me that the devs are quite happy with the changes. Maybe some minor tweaks here and there and they're done. If they only look at the numbers they miss almost everything that this game is about.[BR][BR]My tournament score is down from 8k to 6.5k, with substantially less rewards while the fellowship does better and now achieves 10 chests every week. For me not so bad a tradeoff since the personal rewards are still sufficient.[BR][BR]These numbers do not reveal that I can now lose up to 34 squads in a single battle. Since the enemy outnumbers me considerable, losses are really high. It feels like senseless slaughtering to me - no fun at all.[BR][BR]Last week, I earned a province expansion. A few weeks ago I would have happily placed it, now no more. Got an offer for discounted premium expansions, don't need them anymore.[BR][BR]Chapter 17 is about to be released, I love that - after all this is (was?) a city building game. Since I will not place expansions any more, I probably won't be able to follow the story quest and enjoy the chapter. Too bad.[BR][BR]The Ancient Wonders do have a negative impact on the tournaments and the Spire. The mods have hinted that the idea is to counter city progress and make fighting/catering equally difficult for everyone. Very social, equal share for everyone. But what is the incentive to play this game, when nothing you do will make any difference?[BR][BR]I would love to see that the devs rethought their course. There must be some way to evolve the cities, to make them better. If every progress is countered, the players will lose interest in the game soon, because there's nothing to look forward to.[BR][BR]In my opinion the Ancient Wonder levels and the city expansions must not impact the tournament/Spire squad size.[BR][BR]The research influence should match the advantages gained, don't make it exponential unless you are prepared to increase production accordingly or tournaments will become unplayable at some point. Unless that is the plan though...\t\tClick to expand...[BR]I wrote and send in a system 2 months ago that works similar.[BR][BR]It's based on research and each mandatory research has a \"hidden value\"[BR]The combinations of each value determined your spire / tournament difficulty.[BR][BR]This has several advantages[BR]It allows unlimited scaling, when chapters make a big jump the \"hidden numbers\" can be large and therefore increase the difficulty accordingly, if a chapter makes small steps the values can be low to reflect the changes. this guarantees that advancing in a game never has a detrimental effect on your difficulty. this gives also more flexibility to development as a chapter does not require a fixed \"improvement\" to keep up with any formula as it's self adjusting. in theory you could build a chapter that adds nothing to the spire/tournament but something else out of the box interesting. as you could add a value of 0 to each research.New game material never breaks the game, if changes in the game make it nessesary to adjust the values you could easily change them. this means if the game develops, there are always options to change, as those changes can be gradual and over time. the schock will never be big and people naturally adjust.Never Final: If a chapter turns out to be better or worse than expected, it's easy to rectify the issue.Wonders and expansions to a degree can be compensated. statistics can tell you how much \"wonders\" or \"expansions\" the average player has. as with the former points if data tells that some point in the game gets to much of an advantage a change to a few numbers can solve this.Future proof: no fixed values means that it never runs out of \"growth\"To me this sounds like a much better system."}, {"25": "I'm one of the \"not so lucky\" ones that finished Chapter 16, bought diamond expansions, put down AW's, basically all the wrong things. I had an army that I could count on to bail my fellowship out when the 10th chest became difficult for them, and I had great fun doing it.  That army is gone now and I'm trying to regroup as fast as I can, but now I only get to watch them die.  Yes, I can press a button to cater, but somehow that excitement eludes me, and I'm going through literally millions of goods.[BR][BR]I believe that our greatest fear in not hearing anything is that this atrocity is \"working as intended\" and is here to stay.  This is the first time I haven't looked forward to the next chapter coming, since obviously it's only going to become even worse.  Much, much worse.[BR][BR]I believe that, for new and old, an actual cost of doing things would help us make a lot more intelligent decisions.  Saying an expansion is less a detriment than the space tells me nothing.  How much does it really cost me?  How many more enemies am I going to face with the next research?  The next AW level? The next expansion?  Words like insignificant tell me nothing.  A lot of insignificants have obviously added up to something quite significant.  [BR][BR]We don't have to take a wild guess at how many coins and supplies we need to build a manufactory.  We don't have to get to the Spire and discover we can't cater because we guessed how much the building cost and used an unknown \"insignificant\" amount of goods to upgrade it.  We know how much everything costs, everything except this.[BR][BR]Not everyone wants to come to the forums and search through dozens of pages for charts and graphs and tables to try to figure out if something is worth it, and just how \"insignificant\" (or not) it will become.  Right now we're pretty much in the dark as to what we can and can't afford to do.  I keep seeing people saying they're not paying for diamond expansions.  How much do they REALLY cost us?"}, {"89": "CrazyWizard said:Wonders and expansions to a degree can be compensated. statistics can tell you how much \"wonders\" or \"expansions\" the average player has. as with the former points if data tells that some point in the game gets to much of an advantage a change to a few numbers can solve this.Click to expand...[BR]I fully agree with you, but not in that point. It's not like \"average players\" couldn't build/upgrade this wonders too, they just didn't do it for different reasons, like not enough space, no active exchange etc. - all in all reasons you could change something on, if you really want to. What's the point of upgrading everything above average, if everything gets nerved back down to average then? In that case i could just simply skip all that work.[BR][BR]Same for expansions: You could either buy premium expansions or not. Especially considering the massive real-money costs of later expansions. Buying all premium expansions costs ~1700-1800€ (by only buying the biggest packages at 200€). Ofc. there are some bonus-offers, but players buying those advantages are the ones that make the \"free\" experience possible for everone else.[BR][BR]This is only some non-pvp city building game. I don't mind if someone here does better because he invested all his income into expansions and magic buildings. At the end of the day that's what he did pay for. Now saying \"we need to do something to make you more average again\" is a direct hit into that players face.[BR][BR]The thing is, if someone does better because he invested money or he even did use unfair mechanics to boost his AWs, it doesn't affect me. He can't roll into my city, destroying and stealing all of my stuff with his shiny diamond-units that are even improved by \"cheated\" AW-Stats. Don't mind the ranking.[BR][BR]I really really don't get the reason why AWs and expansions should be part of any formula regarding the tourney or even the spire. I just can't fit the idea of \"XY makes it better but worse\" in my head.[BR][BR]Am i the only one with that opinion? [smilie--sprite12]"}, {"4": "ShadowVision said:\t\t\tI fully agree with you, but not in that point. It's not like \"average players\" couldn't build/upgrade this wonders too, they just didn't do it for different reasons, like not enough space, no active exchange etc. - all in all reasons you could change something on, if you really want to. What's the point of upgrading everything above average, if everything gets nerved back down to average then? In that case i could just simply skip all that work.[BR][BR]Same for expansions: You could either buy premium expansions or not. Especially considering the massive real-money costs of later expansions. Buying all premium expansions costs ~1700-1800€ (by only buying the biggest packages at 200€). Ofc. there are some bonus-offers, but players buying those advantages are the ones that make the \"free\" experience possible for everone else.[BR][BR]This is only some non-pvp city building game. I don't mind if someone here does better because he invested all his income into expansions and magic buildings. At the end of the day that's what he did pay for. Now saying \"we need to do something to make you more average again\" is a direct hit into that players face.[BR][BR]The thing is, if someone does better because he invested money or he even did use unfair mechanics to boost his AWs, it doesn't affect me. He can't roll into my city, destroying and stealing all of my stuff with his shiny diamond-units that are even improved by \"cheated\" AW-Stats. Don't mind the ranking.[BR][BR]I really really don't get the reason why AWs and expansions should be part of any formula regarding the tourney or even the spire. I just can't fit the idea of \"XY makes it better but worse\" in my head.[BR][BR]Am i the only one with that opinion? [smilie--sprite12]Click to expand...[BR]I agree fully, and have posted in this thread several times especially regarding AW and expansion levels. I have a lot, not through spending, but through time, planning, fellowship swapping and making most use of the free diamonds available in my single city (no farms) in the game."}, {"25": "ShadowVision said:\t\t\tThe thing is, if someone does better because he invested money or he even did use unfair mechanics to boost his AWs, it doesn't affect me. He can't roll into my city, destroying and stealing all of my stuff with his shiny diamond-units that are even improved by \"cheated\" AW-Stats. Don't mind the ranking.\t\tClick to expand...I have said this before.  I applaud those that can purchase their way to the top, why shouldn't they be there?  They keep our game alive and I appreciate that.  Early in my game, about 4 years ago, one of the mages and I went to look at the top cities to get an idea of what works.  When I saw the blue cities I decided right then that point chasing would be useless, I didn't have the money for that.  I have since played for my own fun, and I've had a lot of it.  I have bought many expansions over the course of 4 years.  Almost every time I was offered a 100% discount on diamonds I bought some, partially because it's a game I enjoyed tremendously and wanted to support it. [BR][BR]If someone else wants to buy more, let them.  I can understand perfectly the idea of \"I bought more so I can do more.\"  I do not understand the entire theory of \"You played longer and bought more, you need to be punished!\""}, {"17": "There is much that Iike about the new tournament style:[BR]The push to do more rounds made easier by less encounters is one.[BR]The increase to 20 chests is another.[BR][BR]I have to agree that it is difficult to swallow being penalized for progress, especially the diamond expansions.  I started playing back in the day, when we were 'allotted' two per Main Hall level,  and the price got a reset when we upgraded it. I purchased a few then, enough that I cannot afford any more after the restructure of summer 2016.  Who would have thought then, that I might regret it now?[BR][BR]I also want to point out, that this new format makes catching up on tournament really difficult.  So if RL threw someone a serious curve ball, it's not possible to just press forward for an extra 10 provinces for a couple of rounds.  So in a sense, this restricts the core player base even further."}, {"53": "This thread now has almost 1000 posts and this obviously makes it very difficult for casual forum readers to quickly spot what has already been said, and (where appropriate) provide their own confirmatory or differing perspectives. I realise that this is the same as Beta, but if possible (at least for the next time that feedback like this is required) it would be great to have multiple (moderator initiated) threads covering the different aspects. [BR][BR]I'd suggest the following threads:[BR][BR]A sticky \"info\" thread covering what sort of feedback is requested, and describing the role of the moderator. It would also be good if this could also contain something from the Devs (e.g. a commitment to provide a short informal status report via the mods once a week during an exceptional testing period such as this one).[BR][BR]A \"status\" mod only thread for informal posts by the mods (such as any feedback from the Devs)[BR][BR]A general impressions thread (a \"catch-all\")[BR][BR]Specific mod created threads covering topics which they view as meriting a focussed discussion/more feedback (e.g. the squad size formula, personalisation of the different relic tournaments and/or the difficulty curve.)[BR][BR]I imagine that this would require very slightly more work by the mods (since they'd need to check several specific feedback threads), but otherwise I don't see any downside."}, {"5": "Far Reach said:\t\t\tThis thread now has almost 1000 posts and this obviously makes it very difficult for casual forum readers to quickly spot what has already been said, and (where appropriate) provide their own confirmatory or differing perspectives. I realise that this is the same as Beta, but if possible (at least for the next time that feedback like this is required) it would be great to have multiple (moderator initiated) threads covering the different aspects.[BR][BR]I'd suggest the following threads:[BR][BR]A sticky \"info\" thread covering what sort of feedback is requested, and describing the role of the moderator. It would also be good if this could also contain something from the Devs (e.g. a commitment to provide a short informal status report via the mods once a week during an exceptional testing period such as this one).[BR][BR]A \"status\" mod only thread for informal posts by the mods (such as any feedback from the Devs)[BR][BR]A general impressions thread (a \"catch-all\")[BR][BR]Specific mod created threads covering topics which they view as meriting a focussed discussion/more feedback (e.g. the squad size formula, personalisation of the different relic tournaments and/or the difficulty curve.)[BR][BR]I imagine that this would require very slightly more work by the mods (since they'd need to check several specific feedback threads), but otherwise I don't see any downside.\t\tClick to expand...[BR]@Far Reach We'll certainly take that on board for the future. It has become quite an epic thread hasn't it! In the meantime though, please don't worry about the possibility of repeating concerns. We won't see several people concerned about the same thing as repetitive, we will see it as a pattern. And people repeating themselves? That's just passionate  [smilie--sprite1]"}, {"57": "A simple question but I suspect a not so simple answer.[BR]I am thinking about putting down the Flying Academy to help with the tournaments. [BR]a)   Is it worth it?[BR]b)   How far can I upgrade before the 'tournament cost' outweigh the benefits?"}, {"22": "stucon said:\t\t\tA simple question but I suspect a not so simple answer.[BR]I am thinking about putting down the Flying Academy to help with the tournaments.[BR]a)   Is it worth it?[BR]b)   How far can I upgrade before the 'tournament cost' outweigh the benefits?\t\tClick to expand...a) Almost certainly yes - provided that you are fighting in the tournaments.[BR]b) It is unlikely that you will ever upgrade it too far as the Mercenary Camp units will be the most used ones. I've mentioned before that their could, technically, reach a point where further progress is hampered by extra levels of the Flying Academy, but this is largely hypothetical and would never be a consideration unless you are an extreme case going very deep into tournament provinces. Even if this happened you would be better off still upgrading the FA, but deleting other AWs to compensate."}, {"32": "stucon said:\t\t\tA simple question but I suspect a not so simple answer.[BR]I am thinking about putting down the Flying Academy to help with the tournaments.[BR]a)   Is it worth it?[BR]b)   How far can I upgrade before the 'tournament cost' outweigh the benefits?\t\tClick to expand...[BR]All the way to 35. same for needles and sapiens (and maybe victory springs as well)[BR]As these wonders increase your output of units they are always worth the costs. (assuming you can handle the massive need for supplies)"}, {"1": "stucon said:\t\t\tA simple question but I suspect a not so simple answer.[BR]I am thinking about putting down the Flying Academy to help with the tournaments.[BR]a)   Is it worth it?[BR]b)   How far can I upgrade before the 'tournament cost' outweigh the benefits?\t\tClick to expand...[BR]This comes down to your personal decision, we can't help in that aspect.[BR][BR]But AWs that speed up any army production buildings, with a healthy ability to make tools (WSs and spells mainly), generally are favored. And for your second question, that is something you want to investigate as you level it up to see how it fits for you."}, {"14": "I dropped down from an average 8k to maybe 3k?[BR][BR]Because I am not that interested in the tournament anymore, but also because I don't feel like throwing all my boosters, goods and troops into a doomgrinder.[BR][BR]Combine that with the one-click provinces (which, I admit, is great!) and this change does save me a lot of time."}, {"89": "Hahahaha... okay that's a joke! We're talking about inbalances and (partly) balancing out premium stuff, while they offer a \"Old Bear VIP Pack\" with all the old bears (incl. brownbear) at lvl 10 +9 artifacts for 100€. So ppl can boost their troops production even more and (again) care less about losses.[BR][BR]Can't wait for the next phoenix event with offers for all phoenixes (incl. the fire one) at lvl 10. After that we'll need another tourney nerf, right? ;-)[BR][BR]On the one hand they try to \"balance\" stuff because all those rewards are part of factors that somehow destroyed the old tourney balance, on the other hand they continue with that very same stuff. Or do i miss some point here?"}, {"28": "ShadowVision said:\t\t\tOn the one hand they try to \"balance\" stuff because all those rewards are part of factores that somehow destroyed the old tourney balance, on the other hand they continue with that very same stuff. Or do i miss some point here?\t\tClick to expand...Yes, you missed the part where it is only a nerf if you don't put up 100€. If you keep paying up you will stay afloat, but once you stop you start sliding down. Great setup. /s"}, {"20": "ShadowVision said:\t\t\tOr do i miss some point here?\t\tClick to expand...Money, Honey?"}, {"89": "MinMax Gamer said:\t\t\tYes, you missed the part where it is only a nerf if you don't put up 100€. If you keep paying up you will stay afloat, but once you stop you start sliding down. Great setup. /s\t\tClick to expand...[BR]I mean... i could even consider buying that package... but with all those insecurities even regarding current \"premium\" stuff i skip that. This time they penalize AWs and Expansions, next time each \"evolving building\" will be included in that formula too.[BR][BR]May sound insane... but i developed some trust issues with inno.[BR][BR]Even if they tell us they won't... i heard rumours that they also said \"We won't implement the spire system into tourneys\" - Now here we are."}]