[{"22": "ShadowVision said:\t\t\ti heard rumours that they also said \"We won't implement the spire system into tourneys\"\t\tClick to expand...Yeah they did say that."}, {"32": "ShadowVision said:\t\t\tI fully agree with you, but not in that point. It's not like \"average players\" couldn't build/upgrade this wonders too, they just didn't do it for different reasons, like not enough space, no active exchange etc. - all in all reasons you could change something on, if you really want to. What's the point of upgrading everything above average, if everything gets nerved back down to average then? In that case i could just simply skip all that work.[BR][BR]Same for expansions: You could either buy premium expansions or not. Especially considering the massive real-money costs of later expansions. Buying all premium expansions costs ~1700-1800€ (by only buying the biggest packages at 200€). Ofc. there are some bonus-offers, but players buying those advantages are the ones that make the \"free\" experience possible for everone else.[BR][BR]This is only some non-pvp city building game. I don't mind if someone here does better because he invested all his income into expansions and magic buildings. At the end of the day that's what he did pay for. Now saying \"we need to do something to make you more average again\" is a direct hit into that players face.[BR][BR]The thing is, if someone does better because he invested money or he even did use unfair mechanics to boost his AWs, it doesn't affect me. He can't roll into my city, destroying and stealing all of my stuff with his shiny diamond-units that are even improved by \"cheated\" AW-Stats. Don't mind the ranking.[BR][BR]I really really don't get the reason why AWs and expansions should be part of any formula regarding the tourney or even the spire. I just can't fit the idea of \"XY makes it better but worse\" in my head.[BR][BR]Am i the only one with that opinion? [smilie--sprite12]Click to expand...[BR]A city is more than the research, if you want to balance the game so that each chapter does a little bit better on average in the tournament, but keep it close enough so that anyone can participate meaningfully.[BR][BR]so thats why I said indirectly.[BR][BR]If for example you get all the player who do more than 200 points per chapter (capped at 1600) and look at the average (this way only \"active participators count and not players who stopped / ignore the tournaments) asl look at there averages worldwide.[BR][BR]Then look at the 10 best players of each server/world for each chapter[BR][BR]This gives a general indication of \"how strong\" a chapter is \"tournament wise. This includes everything build in that city, research, any expansions, any wonders any anything.[BR][BR]Then you look at the raw data and the outlyers, question yourself why these extremes exist, is this because they work / pay a lot, or is it because a game deficiency.[BR]if it's a defeciency is then placed on a \"solution table\" to be evaluated. or scrap that data part [BR][BR]Then use the left data to \"balance\" each chapter to create an expected increase if you are progressing trough the game.[BR][BR]So it does not directly include expansions/wonderlevels, but it does expect you to have some based on the dataset.[BR]If you have less than expected it will be a little harder than expected and if you thought it was fun and extreme example to buy 33 premium expansions and use diamonds to play free 500 provincies for max room, in chapter 1, then you will have it a lot easier.[BR][BR]The main thing why I like this approach is that it allows you to \"balance\" the tournaments, and keep the game \"free/open\"[BR]It allows the developers to make a chapter without consideration of either spire or tournaments.[BR][BR]Want to make a chapter that's just \"cool\" and has no spire/tournament functionality, then you can make it without upsetting the players.[BR]Want to create a crazy cool wonder, you can, as you can scale as needed where needed.[BR][BR]With the current formula you could scale as well, but then anything in the game MUST scale to those rules as well, something that's clearly not the case, and is very hard to do.[BR]It's much easier to scale the spire/tournament difficulty then to scale every single part of the game at the same time."}, {"32": "ShadowVision said:\t\t\tHahahaha... okay that's a joke! We're talking about inbalances and (partly) balancing out premium stuff, while they offer a \"Old Bear VIP Pack\" with all the old bears (incl. brownbear) at lvl 10 +9 artifacts for 100€. So ppl can boost their troops production even more and (again) care less about losses.[BR][BR]Can't wait for the next phoenix event with offers for all phoenixes (incl. the fire one) at lvl 10. After that we'll need another tourney nerf, right? ;-)[BR][BR]On the one hand they try to \"balance\" stuff because all those rewards are part of factors that somehow destroyed the old tourney balance, on the other hand they continue with that very same stuff. Or do i miss some point here?\t\tClick to expand...[BR]where did you see this? I cannot find it anywhere atm."}, {"57": "stucon said:\t\t\tA simple question but I suspect a not so simple answer.[BR]I am thinking about putting down the Flying Academy to help with the tournaments.[BR]a)   Is it worth it?[BR]b)   How far can I upgrade before the 'tournament cost' outweigh the benefits?\t\tClick to expand...Sorry folk but this was very much a tongue in cheek question. I am going to build it anyway. Carry on playing the way I want to until the dev.s wear me down to a nub."}, {"27": "CrazyWizard said:\t\t\twhere did you see this? I cannot find it anywhere atm.\t\tClick to expand...Supposedly you get that offer when your Moon Bear reaches stage 10. But I can't verify it with 6 artifacts. ;-)"}, {"32": "Ah I did not intend to build it anyway, It's inventory material atm"}, {"89": "CrazyWizard said:\t\t\twhere did you see this? I cannot find it anywhere atm.\t\tClick to expand...Like @FieryArien said, you'll get those special offers as soon as your moonstone bear hits lvl 10.[BR][BR]CrazyWizard said:\t\t\tA city is more than the research, [...]\t\tClick to expand...[BR]I see what you're trying to do there... Fair enough, i think that makes some sense indeed. The impact of the whole thing should be less, and more fair as the current formula."}, {"122": "If the Devs are just looking at the scores  in the tournaments  then  they will be very happy with the figures [BR]I have just been looking on elvenstats  and i was shocked to see  that the EN servers are still competing with all the other servers and the top 10 scoring Fellowships on the EN server are still higher scores than alot of the other servers that are not doing the testing .[BR]Alot of people have said it all comes down to the figures that the devs will be looking at  and not looking at the cost to do the new tournaments[BR]well  these figures  will look very good to them"}, {"1": "ShadowVision said:\t\t\tI heard rumours that they also said \"We won't implement the spire system into tourneys\" - Now here we are.\t\tClick to expand...[BR]While we welcome all comments, and everybody can speak up their will, we only ask to not proliferate inexistent rumors, as they only bring more negativity, and usually not accurate, hence this reason. The only \"rumors\" you want to consider, you can find them here: https://en.forum.elvenar.com/index.php?forums/announcements.6/[BR][BR]That way, you will know is not a rumor, but a fact! If you don't see it there, nor in the game, it does not exist. So, we have a good example of why spreading made-up rumors only confuse people.[BR][BR]And about the bear sale, the tournament changes have nothing to do with it, but the concerns of players who did not play Elvenar last fall, to have an opportunity to have their brown bear. If these bears were free, a lot of people who put effort during the 2019 event would complain. And if we did not release them at all, newer players would be unhappy without a bear. Some players will be always happier with certain events than others, but that happens with everything in life.[BR][BR]Also, we are looking at much more than the scores. We are looking at the mechanics, and everything."}, {"122": "anonglitch said:we did not release them at all, newer players would be unhappy without a bear. Some players will be always happier with certain events than others, but that happens with everything in life.[BR]Also, we are looking at much more than the scores. We are looking at the mechanics, and everything.\t\tClick to expand...[BR]You say WE alot anonglitch correct me if am wrong  but your job is Forum Moderator your not one of the DEVS so how can you speak for them[BR]Unless  your one of the programmers ???[BR]Its not right that you speak on there behalf..   The other Moderator's  dont seem to do this   they say  that the DEV'S have given them information and they pass it onto us ... but they never assume what  the DEVS are saying or doing"}, {"118": "anonglitch said:\t\t\tWhile we welcome all comments, and everybody can speak up their will, we only ask to not proliferate inexistent rumors, as they only bring more negativity, and usually not accurate, hence this reason. The only \"rumors\" you want to consider, you can find them here: https://en.forum.elvenar.com/index.php?forums/announcements.6/[BR][BR]That way, you will know is not a rumor, but a fact! If you don't see it there, nor in the game, it does not exist. So, we have a good example of why spreading made-up rumors only confuse people.[BR][BR]And about the bear sale, the tournament changes have nothing to do with it, but the concerns of players who did not play Elvenar last fall, to have an opportunity to have their brown bear. If these bears were free, a lot of people who put effort during the 2019 event would complain. And if we did not release them at all, newer players would be unhappy without a bear. Some players will be always happier with certain events than others, but that happens with everything in life.[BR][BR]Also, we are looking at much more than the scores. We are looking at the mechanics, and everything.\t\tClick to expand...[BR]Shouldn't a moderator's job be about remaining impartial? Implying negativity only brings more negativity.. [BR]I am also surprised you are aware of the company marketing objectives and targets but you know nothing concrete about the tournament format and its progression and status.. Weird..."}, {"8": "anonglitch said:\t\t\tAnd about the bear sale, the tournament changes have nothing to do with it, but the concerns of players who did not play Elvenar last fall, to have an opportunity to have their brown bear. If these bears were free, a lot of people who put effort during the 2019 event would complain. And if we did not release them at all, newer players would be unhappy without a bear. Some players will be always happier with certain events than others, but that happens with everything in life.\t\tClick to expand...[BR]May I ask, in that case....Do you think they would have had a bear sale if it were not for the new tournaments?  I mean, they haven't offered the IceHag again, and I'd like one of those. [smilie--sprite1]"}, {"14": "anonglitch said:\t\t\tWhile we welcome all comments, and everybody can speak up their will, we only ask to not proliferate inexistent rumors, as they only bring more negativity, and usually not accurate, hence this reason. The only \"rumors\" you want to consider, you can find them here: https://en.forum.elvenar.com/index.php?forums/announcements.6/[BR][BR]That way, you will know is not a rumor, but a fact! If you don't see it there, nor in the game, it does not exist. So, we have a good example of why spreading made-up rumors only confuse people.\t\tClick to expand...[BR]Here's a fact then; it actually has been said. When the Spire came in, people were worried that the formula would be applied to tournaments. They were told that there were no plans to do so.[BR][BR]Guess those plans got changed."}, {"84": "anonglitch said:\t\t\tWhile we welcome all comments, and everybody can speak up their will, we only ask to not proliferate inexistent rumors, as they only bring more negativity, and usually not accurate, hence this reason. The only \"rumors\" you want to consider, you can find them here: https://en.forum.elvenar.com/index.php?forums/announcements.6/[BR][BR]That way, you will know is not a rumor, but a fact! If you don't see it there, nor in the game, it does not exist. So, we have a good example of why spreading made-up rumors only confuse people.\t\tClick to expand...[BR]Yet another comment that you are making that is not entirely correct. Sometimes these rumours as you call them are actually snippets of information that have been given out to questions asked on the Beta forum and then mentioned on this forum."}, {"89": "anonglitch said:\t\t\t...\t\tClick to expand...I would like to argue with you about all that, but that wouldn't lead to anything, but only making me a \"troublemaker\" (if that's not already the case).[BR][BR]Kaliartis said:\t\t\tShouldn't a moderator's job be about remaining impartial? Implying negativity only brings more negativity..\t\tClick to expand...Honestly i think his implication was right and some sort of \"hint\" that i'm crossing the borders with my own implications. I'm okay with that, i was even well aware of that when writing those lines, but honestly this whole thing drives me mad.[BR][BR]On the one side they're selling the current changes as a big \"balance thing\" to violently make less differences between players of all classes/chapters, no matter of their investment (into AWs etc.), even the paying ones and after that they release offers like \"just pay a *bit* more to get closer to your old abilities\" with objects that are huge balance-breakers (like the fire-phoenix or the brown-bear). Not saying that this is their intention, but this feels like some sort of a bad joke. If you want to balance things, do it right and don't throw in more of the old (or even new) balance-breaking stuff. The argumentation makes sense (newer players couldn't gain them), but this is *IMHO* a very dumb way to do it. But hell... that's even a thing that should've been clear when Inno released those overpowered things - that was even my first thought when i saw them: \"Aren't those very unfair for players that start after those events?\".[BR][BR]OldHag said:\t\t\tDo you think they would have had a bear sale if it were not for the new tournaments?\t\tClick to expand...I know you didn't ask me, but i'm pretty sure that offer would've also existed with the old tourney system running. The rewards are just... \"more rewarding\" with those current changes, as brown-bears are now an even bigger game-changer as before. Gaining a 2nd or 3rd brown-bear will make it much easier to regain troops that cost orcs for example. But hey... let's just make Ancient Wonders - that everyone can build without throwing in 100€ - less usefull with some very well thought out formula to balance things between players.[BR][BR]I'm really just waiting for the 100€ fire-phoenix package next time. ;-) After that, one could sell all fighting AW's, make the tourney easier and just feed another firephoenix. Win-Win. Balance over 9000."}, {"22": "ShadowVision said:\t\t\tI'm really just waiting for the 100€ fire-phoenix package next time. ;-)\t\tClick to expand...They already tried selling 3 Phoenix Artefacts for £75."}, {"4": "Pauly7 said:\t\t\tThey already tried selling 3 Phoenix Artefacts for £75.\t\tClick to expand...[BR]Yes, well out of my price range, some of us have a budget to live on. I wouldn't mind spending here if the pricing was sensible and the game programmers didn't keep nerfing things that have been purchased."}, {"89": "It's not about the price-tag. If you scrumble half of the game for the sake of balance, get rid of the idea to distribute absurdly imbalanced things. Or make those accessible for everyone but limit them in some way. (like 1st brown bear has 50% bonus, 2nd 25% etc.). Otherwise the story of \"balance\" is a fairy tale.[BR][BR]Saying \"ppl of the old event could get upset\" sounds like an excuse... those ppl could use the bonuses of those buildings exclusively for a very long time."}, {"45": "Guys can we get the topic back to the actual Tournament......no problem the discussion but not on this thread please."}, {"32": "malph said:\t\t\tYou say WE alot anonglitch correct me if am wrong  but your job is Forum Moderator your not one of the DEVS so how can you speak for them[BR]Unless  your one of the programmers ???[BR]Its not right that you speak on there behalf..   The other Moderator's  dont seem to do this   they say  that the DEV'S have given them information and they pass it onto us ... but they never assume what  the DEVS are saying or doing\t\tClick to expand...[BR]Mods (any type) will always respond with \"we\" as they are all part of the \"elvenar team\"[BR]They are supposed to be the \"voice of elvenar\" and as such speak as one voice.[BR][BR]So \"we\" is approriate in this case, even he is is \"only\" a formum mod.[BR][BR]That said,[BR]I think in this case it's wise for the mods to be distant indeed.[BR][BR]To me these comments are like throwing oil on a fire.[BR]The sentiment is so negative (and inmy opinion right to be so) that his comment's provoke me as well.[BR][BR]spreken is zilver, zwijgen is goud (speech is silver, silence is golden)[BR]And in this topic I think that's surely the case, no matter how you spin it, you can't make salt taste like sugar trying to do so will only have the adverse effect as we have seen now multiple times.[BR][BR]There is another expresion I like to share[BR]Even a donkey doesn't hit the same stone twice, [BR]unfortunatly that stone has been hit to many times now if you ask me, and I can;t understand why it keeps happening, after each suggercoated comment we get a whole angry mob responding, you would say that at some point a lesson should be taken.[BR][BR]this topic is more poised and controversial then the wholesales and cycle changes, the cyle change got canceled the moment hit beta as half the game quit there, and the wholesaler I think got released and then reversed for the same reason.[BR][BR]So I do not understand why a topic thats so much more poised then the former 2, that this change is still deliberated and not cancelled even before it hit the international servers."}]