[{"4": "I have 300 AW levels and 133 expansions. This week is still a struggle with level 10 Fire Phoenix fed, and 1 DA, 1 ELR and 1 MMM in use. I even got a round 1 wipeout at province 21.[BR][BR]I have been manual fighting the higher level provinces since and still had to feed both my level 10 Brown Bears and make a load more troops which don't last long as negotiating last week wiped out mt T1 goods completely.[BR][BR]I can see small cities liking it where they stay below province 10, but anyone like me who regularly does 30 provinces or more for all the extra kp in round 2 and 5 is really struggling now. I'm slowly using boosters faster than I can win them in the spire or craft them so my target is becoming unsustainable.[BR][BR]I do like the single fight provinces, but the squad sizes even in round one rise far to rapidly.[BR][BR]I also dislike the randomness factor and think each tournament should have a better uniqueness as I can hardly tell the difference week on week any more. [BR][BR]I do hope Inno come up with a fair balance and take out expansions and AW's from the formula."}, {"84": "CrazyWizard said:\t\t\tMods (any type) will always respond with \"we\" as they are all part of the \"elvenar team\"[BR]They are supposed to be the \"voice of elvenar\" and as such speak as one voice.[BR][BR]So \"we\" is approriate in this case, even he is is \"only\" a formum mod.\t\tClick to expand...[BR]While i do understand what you are saying i have to admit that in my opinion a forum mod or any other person of \"the Elvenar team\" that has no part in the running or development of the game should not say \"we\". They have no say in how the game is made or works and therefore are not really part of the team. Just my opinion of course."}, {"25": "I don't understand this entire process.  If the amount of rewards and the ease of attaining them were excessive, which I agree they were, why then were the rewards not the object of exponential battering?  Why the players?  Were we, the veterans of 16 chapters, that naughty?[BR][BR]The first 10 provinces could be easily surpassed by almost everyone.  The next 10 might be a lot less simple.  By the 30th province, it should start to get exponentially more difficult.  Perhaps by the 70th, or whatever would fit this problem, it should be \"bring your diamonds\" difficult.  Problem solved.[BR][BR]If the rewards themselves took the brunt of the punishment, rather than the players, we could all go merrily along skipping freely into Chapter 17. (Not in the plans right now.)  I could buy an expansion or two for the ever burgeoning buildings needed.  (Nope, not planning on that now either.) We could even put down at least one of the new AWs we got in Embassies.  (No chance for that at this time.)[BR][BR]I have to admit that I'm far too old to be in any great brain trust, but even so it's not too difficult to see that whipping players for playing the game that you gave us is totally contraindicated for the growth of Elvenar."}, {"30": "I have completed chapter 16. Now wondering... should I upgrade the AWs? Is it feasible to figure this out using the formula shared by @MinMax Gamer in the beta forum? My stock levels of goods are depleting (4m -> 2m) even though I manual fight more than 90% of the tournament encounters and only clear it up to the 25th province. [smilie--sprite3]"}, {"54": "skelve said:\t\t\tI have completed chapter 16. Now wondering... should I upgrade the AWs? Is it feasible to figure this out using the formula shared by @MinMax Gamer in the beta forum? My stock levels of goods are depleting (4m -> 2m) even though I manual fight more than 90% of the tournament encounters and only clear it up to the 25th province. [smilie--sprite3]Click to expand...congrats on finishing on chapter 16. do you want the honest answer? [smilie--sprite2][BR]If you like tournaments you better not level your wonders anymore, in fact it would be best if you just stopped playing this account all together and just make a new account where you make the right choices. You can just transfer all the goods from your big accoutn to the new one then. If you do it like this you will enjoy this game for many years, if not.... well only time will tell."}, {"33": "Heymrdiedier said:\t\t\tYou can just transfer all the goods from your big accoutn to the new one then.\t\tClick to expand...[BR]Not good to advice another player to cheat."}, {"1": "To quickly address a few off-topic comments: Yes, I am just a forum mod, however, I use the \"we\" as we are one united team [smilie--sprite1], that's all. I refer to we (the team), not \"we, devs\" as I am not one of them (hence using \"the devs.\")[BR][BR]Heymrdiedier said:\t\t\tYou can just transfer all the goods from your big accoutn to the new one then. If you do it like this you will enjoy this game for many years, if not.... well only time will tell.\t\tClick to expand...[BR]@Heymrdiedier please, check out the game rules, it is always good to take a refresher [smilie--sprite1] :https://en.forum.elvenar.com/index.php?pages/game_rules/[BR][BR]Remember @skelve, and everybody else. These changes are not final as the developers are still working on our tournament. Until we do not announce here that the changes are final, they will always be suitable to change."}, {"20": "May I?  correct phrase is ...’ subject to change‘"}, {"25": "Heymrdiedier said:\t\t\tIf you like tournaments you better not level your wonders anymore, in fact it would be best if you just stopped playing this account all together and just make a new account where you make the right choices.\t\tClick to expand...The right choices until when?  We made the right choices and were able to fight our way through the provinces, until the devs decided to punish us for the previous right choices.  The new right choices are not guaranteed to become right choices for very long either [smilie--sprite3] [BR][BR]I'm not convinced that the players were the ones that made the bad choices here.  It seems that the rewards needed to be exponentially limited, not the players."}, {"58": "skelve said:\t\t\tNow wondering... should I upgrade the AWs? Is it feasible to figure this out using the formula shared by @MinMax Gamer in the beta forum?\t\tClick to expand...The formula (with very minor tweaks) is used in the Spire for more than a year. I think it is save to assume that it works as intended, and that no substantial changes will be made.[BR]So yes, I think using MinMax's spreadsheet is viable.[BR][BR]anonglitch said:\t\t\tThese changes are not final as the developers are still working on our tournament. Until we do not announce here that the changes are final, they will always be suitable to change.\t\tClick to expand...Well, of course, theoretically, the devs could always trash the formula. Would love that, but not really holding my breath."}, {"30": "anonglitch said:\t\t\tTo quickly address a few off-topic comments: Yes, I am just a forum mod, however, I use the \"we\" as we are one united team [smilie--sprite1], that's all. I refer to we (the team), not \"we, devs\" as I am not one of them (hence using \"the devs.\")[BR][BR][BR][BR]@Heymrdiedier please, check out the game rules, it is always good to take a refresher [smilie--sprite1] :https://en.forum.elvenar.com/index.php?pages/game_rules/[BR][BR]Remember @skelve, and everybody else. These changes are not final as the developers are still working on our tournament. Until we do not announce here that the changes are final, they will always be suitable to change.\t\tClick to expand...I don't want to cheat the game irrespective of the rules since I don't think I will enjoy it like that. If I get bored I would rather move on. While I enjoy the tournament still since the fellowship I am in is doing much better than before because we have a lot of players who are in the mid-game scoring 2000+ to 1000+. Earlier they only did a couple of hundreds.[BR][BR]@Heymrdiedier, thank you for the congratulation note. It took me 3 years and 6 months. I am sure you didn't really mean to advise me on cheating and you were just kidding.  [smilie--sprite1][BR][BR]Let me play with MinMax's spreadsheet and see what I can come up with."}, {"24": "So here is the feedback for the weeks tourney: No changes, same as before, a few different main units of course as every week, but that has nothing to do with what is wrong with the tourney.[BR]Even difficulty is fine, although that is what most people complain about.[BR]The problem is still the same as it has been since the first week it was released. Now we have to choose between tourney and progress. And yes many people choose progress, and then they will complain about the difficulty (duh!)[BR]Remove the ban on progress and the tourney is all good. Until then, no more expansions, no more chapters for me (and soon also no more AWs)"}, {"28": "skelve said:\t\t\tI have completed chapter 16. Now wondering... should I upgrade the AWs? Is it feasible to figure this out using the formula shared by @MinMax Gamer in the beta forum? My stock levels of goods are depleting (4m -> 2m) even though I manual fight more than 90% of the tournament encounters and only clear it up to the 25th province. [smilie--sprite3]Click to expand...The formula will tell you how upgrading your AWs will increase your troop losses / catering costs (assuming everything else is constant). So that's the cost part of the cost/benefit equation. You will need to compare it to benefits of those AW upgrades - at this will depend on specific AWs, specific levels, your city setup, your preferences etc. In many cases you will be comparing apples and oranges, so you will be the only one who can make a call as to whether or not those benefits are worth it for you. E.g. if upgrading TimeWarp saves you X hours between tournaments, is it worth increases in troops losses / catering of Y%? Different people will have different answers to that."}, {"47": "I'm not against any corrections, but in general the new tournament system suits me better than the old one. I have two cities (chapters 16 and 16+) and I was really tired of endless clicking in the old system.[BR]I've used up a lot of resources in the new tournament so far, but I realize that I'm gaining 5-6 thousand points every week, what I didn't have before. So I still have an option to slow down a bit.[BR]I can't wait to get a new system on another server where I play."}, {"8": "arnwald said:\t\t\tI'm not against any corrections, but in general the new tournament system suits me better than the old one. I have two cities (chapters 16 and 16+) and I was really tired of endless clicking in the old system.[BR]I've used up a lot of resources in the new tournament so far, but I realize that I'm gaining 5-6 thousand points every week, what I didn't have before. So I still have an option to slow down a bit.[BR]I can't wait to get a new system on another server where I play.\t\tClick to expand...Hey @arnwald - may I ask what your city set up is that you find the new system suits you. I'm coming to the end of chapter 15 and am finding the troop losses hard to keep up with. I haven't done any bear training yet, kinda waiting to see how far I can go on the number of squads I had built up over my playing time, plus keeping my training queues full. I've been able to do 20 provinces to level 2 and finding it diffiucult to take provinces 1-15 to level 5/6. Any tips would be greatly appreciated and very sorry if I'm straying off topic. [smilie--sprite1]"}, {"30": "arnwald said:\t\t\tI'm not against any corrections, but in general the new tournament system suits me better than the old one. I have two cities (chapters 16 and 16+) and I was really tired of endless clicking in the old system.[BR]I've used up a lot of resources in the new tournament so far, but I realize that I'm gaining 5-6 thousand points every week, what I didn't have before. So I still have an option to slow down a bit.[BR]I can't wait to get a new system on another server where I play.\t\tClick to expand...I don't think anyone complains about the above changes. In fact, I like the way the difficulty is set up as well when it comes to enemy squad size ratio. It has helped a lot of mid-game players to score well. It would have been better to make it more logarithmic. However, most of us here do not like having the AWs and city expansions in the squad size calculation."}, {"47": "OldHag said:\t\t\tHey @arnwald - may I ask what your city set up is that you find the new system suits you. I'm coming to the end of chapter 15 and am finding the troop losses hard to keep up with. I haven't done any bear training yet, kinda waiting to see how far I can go on the number of squads I had built up over my playing time, plus keeping my training queues full. I've been able to do 20 provinces to level 2 and finding it diffiucult to take provinces 1-15 to level 5/6. Any tips would be greatly appreciated and very sorry if I'm straying off topic. [smilie--sprite1]Click to expand...[BR]I use Fire Phoenix every week. I've used Brown Bear (+ several hundred hours of boosters) about once a week so far, I'll see how often I'll need it now, when I can train the army 3x faster. On the contrary, I haven't used parks or Dwarven Armorer every week, now I do.[BR]The main advantage for me is the much lower time required for the new system. This allows me to score more points, although I cannot open as many provinces as before. But I play part of the provinces until the 6th round, while in the old system I managed only 4 or 5 rounds.[BR]So far, it costs me more resources, but like I said, I'm getting more points. So I have an option to slow down. And since the new tournament is faster, I can also play manually if necessary, what I've almost never done before."}, {"47": "skelve said:\t\t\tI don't think anyone complains about the above changes. In fact, I like the way the difficulty is set up as well when it comes to enemy squad size ratio. It has helped a lot of mid-game players to score well. It would have been better to make it more logarithmic. However, most of us here do not like having the AWs and city expansions in the squad size calculation.\t\tClick to expand...[BR]What criterion do you suggest? A chapter? Main Hall level? Score? The population? Quantity of goods in stock?"}, {"30": "arnwald said:\t\t\tWhat criterion do you suggest? A chapter? Main Hall level? Score? The population? Quantity of goods in stock?\t\tClick to expand...The number of mandatory technologies completed is a good enough indicator for the purpose in my opinion. Currently looks like it uses, number of expansions, total AW levels, and the production boost percentage. There could be more. I feel it is double counting and makes things unnecessarily complicated.[BR][BR]As you can see testing is now going on for a lot longer period than planned. What we hear is devs are working hard to sort things out for us but they still do not have any new information to share with us since it takes a lot of time. They should have first done the simple change. Watch it and see how it goes and do another if necessary, etc. That is called Agile software development I guess."}, {"27": "I wish people who just like less encounters per province wouldn’t simply say “I like the new system”, but “I like less clicking in the new system”. Otherwise it really sends wrong message. :-( I mean the encounters reduction has nothing to do with the new system - it’s just an improvement that’s been asked for ages and it came together with the new system. The old system would work just fine with 1 encounter instead of 4. The new system would work just fine with 4 encounters instead of 1. It was only thrown in to sweeten the deal. And it worked unbelievably well."}]