[{"32": "FieryArien said:\t\t\tI wish people who just like less encounters per province wouldn’t simply say “I like the new system”, but “I like less clicking in the new system”. Otherwise it really sends wrong message. :-( I mean the encounters reduction has nothing to do with the new system - it’s just an improvement that’s been asked for ages and it came together with the new system. The old system would work just fine with 1 encounter instead of 4. The new system would work just fine with 4 encounters instead of 1. It was only thrown in to sweeten the deal. And it worked unbelievably well.\t\tClick to expand...[BR]I agree, the 4:1 advantage that's beneficial camouflages the fundamental issues."}, {"33": "FieryArien said:\t\t\tI wish people who just like less encounters per province wouldn’t simply say “I like the new system”, but “I like less clicking in the new system”. Otherwise it really sends wrong message. :-( I mean the encounters reduction has nothing to do with the new system - it’s just an improvement that’s been asked for ages and it came together with the new system. The old system would work just fine with 1 encounter instead of 4. The new system would work just fine with 4 encounters instead of 1. It was only thrown in to sweeten the deal. And it worked unbelievably well.\t\tClick to expand...[BR]That's your opinion, but for others (including me) the reduction of mouse clicks is the big improvement and the other things are just minor issues compared to that. You should respect that people have different views on this."}, {"27": "valle said:\t\t\tThat's your opinion, but for others (including me) the reduction of mouse clicks is the big improvement and the other things are just minor issues compared to that. You should respect that people have different views on this.\t\tClick to expand...Wow, where do you read disrespect of opinion of others in my message? I expressed a wish, that certain group of people (those who just like the reduction of clicks) give their feedback more clearly instead of generic “I like the new system”. I’m sorry it offended you, it wasn’t meant to cause that."}, {"33": "FieryArien said:\t\t\tWow, where do you read disrespect of opinion of others in my message? I expressed a wish, that certain group of people (those who just like the reduction of clicks) give their feedback more clearly instead of generic “I like the new system”. I’m sorry it offended you, it wasn’t meant to cause that.\t\tClick to expand...[BR]You said that anyone that likes the changes because of reduces clicks sends the wrong message.  That was a bit disrespectful in my view.[BR]I don't like the phrase 'sending the wrong message' as I can't see what is wrong with it."}, {"27": "valle said:\t\t\tYou said that anyone that likes the changes because of reduces clicks sends the wrong message.  That was a bit disrespectful in my view.[BR]I don't like the phrase 'sending the wrong message' as I can't see what is wrong with it.\t\tClick to expand...No, I didn’t.[BR]FieryArien said:\t\t\tI wish people who just like less encounters per province wouldn’t simply say “I like the new system”, but “I like less clicking in the new system”. Otherwise it really sends wrong message. :-(\t\tClick to expand...This is my last attempt to explain/show it to you. If you still don’t see a difference in what I wrote and what you claim that I wrote, than let’s just agree to disagree."}, {"121": "My thread, written in anger some weeks ago, about the changes to the game, was closed by Silmaril as it was about the tournament changes, and yes, the discussion should have taken place here. I hope the many comments posted there are still taken into account.[BR][BR]Since the original post, I have completely deleted one city and only check the other while there is an active genie. I have kept my 3rd city alive and it is only because during these times, the interactions with the members of the Fellowship are so refreshing and fun.[BR][BR]I have seen many wonderful players leave the game in the past few weeks. When I visit my neighbours there are so many who used to be top players in active fellowships and now they have messages that they are no longer playing, or they are clearly not active as they have no FS.That has really impacted my enjoyment of the game.[BR][BR]But even more depressing has been the very obvious and very constant grab for money at every opportunity, to the point where things that should be random, are clearly not. I don't have figures to back up that claim but  I do see it ALL the time, in the spire, in events, and in this ridiculous need to now do the FA to get enough artefacts ...every single time. How predictable and boring![BR][BR]Anyway, I don't want to just rant ... I just wanted to say, 'bless' you Inno, for ruining something that has brought so much fun and laughter and enjoyment to many good people!"}, {"33": "I can't see why saying that you like the new tournament is ´sending the wrong message' regardless of the reason why you like it. Wrong for who? You I suppose, but I and others might think it's the right message.[BR][BR]Edit: This is a response to FieryArien  (another message came between while writing)"}, {"32": "valle said:\t\t\tI can't see why saying that you like the new tournament is ´sending the wrong message' regardless of the reason why you like it. Wrong for who? You I suppose, but I and others might think it's the right message.[BR][BR]Edit: This is a response to FieryArien  (another message came between while writing)\t\tClick to expand...[BR]If it's only good because of less clicks and the rest is negated.[BR]Then you could argue it's the wrong message.[BR][BR]It's bigger and encompasses more than a few clicks less."}, {"5": "@valle @FieryArien There is no right or wrong message here. All opinions on this thread are valid and are read as such. Please try not to misconstrue any comments here as it detracts from the topic of the thread and is then difficult for us to pinpoint the feedback we are looking for. I said a short while ago that this thread is for both Positive and Negative Feedback.[BR][BR]As it stands we are aware that the Feedback seen is overwhelmingly critical of the recent changes, and whilst there have been comments made by players that say they are enjoying the recent changes, please don't be concerned that these positive comments will trump the overwhelmingly critical response.[BR][BR]Please also keep in mind that many players may not have the ability to collate detailed evidence to uphold their statements, but felt the need to give their opinion nonetheless. The post in question was added to in detail regarding personal gameplay a few comments down and justified their reasons for providing a positive response. Again keep in mind that this is their personal gameplay and may differ significantly from your own.[BR][BR]Mostly I just want to remind everyone to try and Keep on Topic, Keep it Calm, Keep it Constructive, Keep it Kind  [smilie--sprite1][BR][BR]Kind Regards[BR][BR]Herodite."}, {"22": "Dear @InnoGames, if you really would like to get players' feedback on these tournament changes then why, by now, have you not sent out a customer satisfaction survey to all players asking for everyone's opinion? In the world of Customer Service Excellence that we now live, I would have thought that this would be the first thing that you would want to do. We've been told at least once in this thread (and many times over in the corresponding thread on Beta) that the views of the forum posters are not representative of the player base. [BR][BR]So why not ask? A survey should be sent out to all players, though possibly limited to EN and Beta players that have played since at least about May of this year.[BR][BR]I could take a stab at it myself, if you like. Off the top of my head...[BR][BR]Dear Elvenar Player,[BR][BR]As you may be aware, we have recently implemented a new system for tournament play to players of the server on which you play. We are very interested to receive players' feedback regarding these changes.[BR][BR]Would you be willing to answer a few questions related to your experience of the new system? [Yes / No][BR]If yes:[BR][BR]Do you play in the weekly tournaments? [Every week / Most weeks / Occasionally / Not at all][BR](If 'not at all' then survey ends, thanks, etc.)[BR][BR]We have made a change that reduces the number of encounters in each tournament province from four to one, which we believe makes the tournaments easier and faster to play.[BR][BR]Have you found that the reduced number of encounters reduces the amount of time you spend playing tournaments? [Yes / No / No difference]Has the reduced number of encounters improved your enjoyment of tournaments? [Yes / No / No difference][BR]The difficulty scaling of the old tournaments was based solely on the number of squad size researches completed. We have now changed this so that the difficulty is based on a number of factors, including: every research completed, every Ancient Wonder level gained and every city expansion placed.[BR][BR]Do you feel that this is a fairer way of calculating difficulty? [Yes / No / No difference][BR]Add comments:[BR][BR]In the old system the difficulty only increased with each subsequent tournament round. We have now also added an incremental increase in difficulty as you play through one province to the next, within each round. This makes it much easier in lower provinces and much harder in higher ones.[BR][BR]Do you believe this incremental increase in difficulty improves the new tournaments? [Yes / No / No difference][BR]Add comments:[BR][BR]Overall, do you think that the new tournament system has improved your enjoyment of the game? [Yes / No / No difference][BR]Add comments:[BR][BR]On a scale of 1-10, how do you rate the improvements that have been made? Where 1 is the least improvement, and 10 the greatest. [1-10]How likely are you to recommend Elvenar to a friend? [Extremely likely / Somewhat likely / Unlikely / Not at all][BR]Ok, so I'm trying to teach Inno to suck eggs, but surely every organisation wants to take these kinds of surveys now? This could be a lot more detailed and incisive, but it took me 10 minutes to type out and probably fits with the tone that Inno may wish to use to ask for people's feelings."}, {"33": "CrazyWizard said:\t\t\tIt's bigger and encompasses more than a few clicks less.\t\tClick to expand...[BR]I don't know what a few means to you. But for me the new tournament format saves me more than 1000 clicks. If you call that a few, well then I'm rather sceptical to any numbers you write [smilie--sprite2]"}, {"25": "CrazyWizard said:\t\t\tIt's bigger and encompasses more than a few clicks less.\t\tClick to expand...valle said:\t\t\tI don't know what a few means to you. But for me the new tournament format saves me more than 1000 clicks. If you call that a few, well then I'm rather sceptical to any numbers you write [smilie--sprite2]Click to expand...The phrase \"more than a few\" is an exaggeration phrase that means a great number.  You could replace the phrase \"more than a few\" with the word lot, but more than a few conjures up an idea that it is a huge number.  So basically what he was saying was \"It's bigger and encompasses a massive number of clicks less. [BR][BR]He is correct, in my opinion.  This does not mean that I approve of the slaughter to the end game players, just because there are a lot less clicks.  The earliest players may become end game players sooner than they think."}, {"24": "CrazyWizard said:\t\t\tI agree, the 4:1 advantage that's beneficial camouflages the fundamental issues.\t\tClick to expand...[BR]Which of course was the whole point of doing it at the same time [smilie--sprite1]"}, {"82": "Rarely post here, though am avid reader of the forum - anyway here are my thoughts on tourney:[BR][BR]No issue with the overall direction of the change – balance was needed – though there are many ways to achieve this.[BR][BR]Less repetitive “clicks”, all to the good – but more time spent manual fighting – the benefit gained by manual fighting has, IMHO, created an even bigger imbalance between PC & App playing. I often only get to manual fight rounds 5 & 6 on the PC and the difference in troop resource loss is significant - I need to cater round 3 & 4 above prov 16 on the App, however I can manual fight round 6 above prov 20 on PC !![BR][BR]Even difficulty is fine, cater is more of an option than “old system” and city can be re-geared to cope with that[BR][BR]The problem remains the same as it has been since Beta release. This is a city building strategy game. With a strong “team” element the FS. FS having its core cohesion around tourney, FA & now Spire. Now we are required to choose between FS based game elements (tourney, spire, FA) and city progress. If we progress, we are disproportionately penalised for team activities[BR][BR]The effects contained within the new tourney algorithm that adversely discourages progress needs to be addressed. Until the live EN server (beta beta) testing is completed and a period of stability returns to the game, there will be for me, no more chapters, no more expansions, no radical rejiggling of city for FA and only very carefully considered AW development."}, {"47": "FieryArien said:\t\t\tI wish people who just like less encounters per province wouldn’t simply say “I like the new system”, but “I like less clicking in the new system”. Otherwise it really sends wrong message. :-( I mean the encounters reduction has nothing to do with the new system - it’s just an improvement that’s been asked for ages and it came together with the new system. The old system would work just fine with 1 encounter instead of 4. The new system would work just fine with 4 encounters instead of 1. It was only thrown in to sweeten the deal. And it worked unbelievably well.\t\tClick to expand...[BR]OK, I'll try to say it again.[BR]The new system as it is set up now, with all the parameters, suits me better than the old system as it was set up. I can't just say that I like less clicks, because this is such a fundamental change for me that I'm willing to accept everything else. Yes, the new system is very expensive for top players who want to score a lot of points. But on the other hand, it allows players who don't have that much time or patience to get more points. This change suppresses individuality and prefers team play. I am able to accept this. I agree that not everything is perfect, but at this point I would be more affected by the return of the old system. In that case, I would consider staying in the game.[BR]We need to go further and look to improve the game. And to accept when something doesn't quite suit me, but it will benefit the game as a whole. In order for the game to be balanced and not to disadvantage specific players for their activity, the developers are responsible for this."}, {"76": "Have to say this is just getting depressing to read, I have not been on the forum for just over a week and come on today to see if anything's happened and there is no change in the testing, and a lot of people repeating the same arguments. But somehow 10 pages have been made."}, {"20": "My visual dust tournament opponents.[BR][BR][IMG]https://i.ibb.co/Ns71cYq/https-en-forum-elvenar-com-index-php-attachments-dust-jpg-4823.jpg[/IMG][BR][BR]The colour code is according to the colour of the badges of the various units.  No distinction was made between the different types of any particular unit.[BR][BR]I also paid more attention to the star level of the enemies this week.  It seemed to be consistent irrespective of the chapter level of my cities or the round I played.[BR]1 star - tent 1 to 5[BR]2 star - tent 6 to 10[BR]3 star - tent 11 and above[BR][BR]I think this is very tough for low chapter cities that at best only has researched some 2 star troops with the rest being only 1 star.  The odds are stacked just too high too early."}, {"122": "Still no information coming our way from the Devs ???[BR]It is  disappointing that they keep asking for feedback  but they dont answer what people have asked for and that is just an update on how things are progressing .."}, {"122": "If the tournament got changed due to the fact that players were getting to much rewards (KP) and maybe to much of the other rewards also [BR]Why did the devs have to give  themselves  so much work when the easy solution was just to cut the rewards down ??[BR]This way  players that like to score big could still do so (with less rewards) but still get the satisfaction out of the tournaments [BR]that would be easier to change than try to change the whole structure of the tournament [BR][BR][BR]1 click  per prov round   ( great improvement)[BR]prov 1 to 10  easy for newer cities  ( great improvement for smaller cities)[BR]after prov 20   you only get 1 or 2 kp  in round 5 [BR][BR]that would get my full support"}, {"122": "FROM BETA[BR][BR]Marindor said:[BR]Hi everyone,[BR][BR]A small head's up already:[BR][BR]We will be bringing a change to the next Tournament's (tomorrow's) fighting difficulty, especially on higher provinces (16+; or 15 with more than one star completed already), but already starting with some minor adjustments at province 8 (or 7 with more than one star completed). [BR].......................................................................................................[BR][BR]are we getting this change tomorrow also  ???????????  dont forget that we are doing the same testing as Beta[BR]It will be a DISGRACE if we dont get to test this change at the same time"}]