[{"22": "malph said:\t\t\tare we getting this change tomorrow also ??????????? dont forget that we are doing the same testing as Beta[BR]It will be a DISGRACE if we dont get to test this change at the same time\t\tClick to expand...I think disgrace is a strong word. Admittedly the process is very confused now. If we are beta testing 2.0 (shall we call ourselves \"Gamma Testing\"?) then do the new features still go through a Beta phase before coming to us? Of course it may be a whole lot less confusing if we were being given any information at all, about what's going on.[BR][BR]Remember, though, Marindor hasn't actually said whether they are making it easier or harder, so it may not be in your interested to get the amended version sooner."}, {"122": "Pauly7 said:\t\t\tI think disgrace is a strong word.\t\tClick to expand...[BR]I dont really think it was to strong  [BR][BR]Disgrace  ... loss of other people's respect, (Cambridge English Dictionary)[BR][BR]And Inno  sure have lost alot of people's respect [BR]I know  that he never said it was going to be easier or harder   but surely they wont make it harder [BR]At the end of the day we are testing this also and feel any change should come to us at the same time so we can all give feed back"}, {"26": "malph said:\t\t\tbut surely they wont make it harder\t\tClick to expand...I wouldn't be so sure about it. When it comes to making things worse Inno has a long record of surprising players.[BR][BR]And yes, since we are forced to test the new tournaments I also think that we should get the changes at the same time as beta now, otherwise their testing process becomes really strange, not to say worse."}, {"33": "Testing it on Beta first will hopefully stop any severe bugs go undetected before releasing it to a wider audience. So testing on beta first sounds right to me."}, {"24": "Doesn´t sound like a technical change at all, they just change a few numbers, so I don´t see a big probability of bugs with that change. Most likely it will be another change similar to the ones we had before. It was different if they actually changed the workings of the tourney..."}, {"45": "Please remember @malph that this is not the Beta server Your comment would have been better placed in the Beta thread."}, {"122": "@Silmaril[BR]I know its not beta [BR]but just like beta we are testing this new system out also [BR]without posting what was said in beta i could not ask the question  about is it coming to our server also [BR]why would i ask beta  if its coming to our server   when i should be asking the Mods on our server the question [BR]I AM CONFUSED @ your reply"}, {"32": "Silmaril said:\t\t\tPlease remember @malph that this is not the Beta server Your comment would have been better placed in the Beta thread.\t\tClick to expand...[BR] We are updating our International worlds to version 1.114, tomorrow the 29th of September. [BR][BR]won't the same changes not also be released on this world?[BR]Or is this some A/B comparison test?"}, {"30": "As per the release note, there are no changes to the squad size calculation of the tournament."}, {"32": "skelve said:\t\t\tAs per the release note, there are no changes to the squad size calculation of the tournament.\t\tClick to expand...[BR]Thats why there is an \"undocumented changes\" topic on beta.[BR]And those release notes are written \"world wide\" aka for all servers, so it makes sense that a change like that would at least not be in the main post of the release notes."}, {"106": "High demand for supplies aside, I hate the random troops. Different tournaments should be different. I can't tell the difference any more."}, {"25": "I have to be a little leary about this \"change to the tournament\" that starts today.  It seems to me that if it was a good change, such as lessening a difficulty for the end game players, it would have said so.  This may actually be a warning to all chapters, rather than something hopeful.  The reason I am worried is that the earlier chapter players have been outscoring me by quite a bit ... perhaps too much of a good thing for them?  I certainly hope not, but the term \"minor adjustments\" can be a bit scary.  I have to assume that this will come here as well today."}, {"58": "malph said:\t\t\tFROM BETA[BR][BR]Marindor said:[BR]Hi everyone,[BR][BR]A small head's up already:[BR][BR]We will be bringing a change to the next Tournament's (tomorrow's) fighting difficulty, especially on higher provinces (16+; or 15 with more than one star completed already), but already starting with some minor adjustments at province 8 (or 7 with more than one star completed).\t\tClick to expand...[BR]If I'm not mistaken, most complaints were about the impact that AW levels and city expansions have on the tournament squad size. INNO just ignores this and goes straight to the fine tuning. [BR][BR]A few KP more or less, a few relics more or less, who cares? OK, the devs ... maybe?[BR][BR]The squad size formula counters every advantage you get in the game. Consequently whatever you do just doesn't matter. Place an expansion, build an AW, research something - the devs take care that you won't get any advantage. At least Elvenar's graphics are more beautiful than those of the farm games.[BR][BR]Sorry about the rant, but I love this game and I'm truely worried about its fate."}, {"17": "The Beta update is a balancing change under release 1.115 so we will not be seeing this for 2 weeks.[BR]Edit: we got a special addition to today's release, it appears."}, {"22": "So it seems that the adjustment is a reduction in difficulty of between 0.5% and 6%, depending on the province."}, {"89": "RainbowElvira said:\t\t\tSorry about the rant, but I love this game and I'm truely worried about its fate.\t\tClick to expand...I feel this... i'm losing the motivation to play any further, even without waiting for the final changes. That's also the reason for my emotions driven answers here.[BR][BR]The old way of freedom you had with building your city is gone (build how you like it - there was no downside in anything). I just lost the interest, as if i want to play tourneys efficiently, i have to play one specific way. Otherwise there will be some sort of penality. Looking at the (non-existing) replies of the devs and the (minor) changes until yet, it seems that there won't be any change related to the core-problem of the most here in any way."}, {"22": "I'm not going to say anything new here, but I can't quite figure it out at this point.[BR][BR]I made the assumption that the reason the formula was implemented was down to a lack of understanding of the game mechanics by the devs. The reason is that there is surely no way that you would create these Ancient Wonders and then intentionally break many of them by re-designing a system which punishes anyone's later progress, either in terms of those AWs, or in terms of any kind of story progression past chapter 15.[BR][BR]So it seemed to me that it's just a matter of them reading some of the valuable feedback and then going back and running some more alpha testing to see if it's true and what went wrong. Then they would need to pull their formula apart and create something which works better. Something which the game can sustain... but if that was likely we would have seen it happening by now.[BR][BR]I understand making it more difficult. I understand cutting back the rewards. I don't understand, though, the fact that they now knowingly have a system that entirely destroys the balance of gameplay, and they don't seem to be doing anything about it.[BR][BR]Maybe they don't want the end-game players. That's one way of looking at it. They could be releasing new chapters that they know people either won't want to play or if they do they will quickly become soul-destroyed by how it makes things more difficult. In either case it ends up with the players leaving. So perhaps that's what they want - a fresh generation of newer players who won't complain the same because they won't remember when we had things that were so much better.[BR][BR]That would be a bit weird - Like wanting to split up from a partner, so you do it by becoming more annoying until they leave you.[BR][BR]But even if this is the case, have they not been doing this long enough by now to realise that even if Elvenar survives this transition, then all that will happen is a new generation of players will appear who are all willing to push the boundaries of what is possible. Strange uninteresting tournament efficient cities will start to appear and some of that new group of players will figure out how to beat the mechanics and score massively again. Then all the information will get passed down to everyone else - These are the Ancient Wonders to never build. Never place an unnecessary expansion, etc, etc. So how do they think it will be in another year's time? They will need to do it all again because it will be much worse then than it used to be before.[BR][BR]Sorry, I'm just rambling. Like I say, nothing new."}, {"22": "There is a way to do it whilst not touching their formula, of course - They would just have to overhaul everything else about the game. Make all the Ancient Wonders that much more powerful, make expansions bigger, make buildings smaller, make troops better at fighting, etc, etc. Perhaps that could be more likely because then they would be able to do it without admitting something went wrong."}, {"45": "Please refer to additional information just added to today's Release Notes"}, {"22": "The difficulty change is in. Good to hear. Don't expect any miracles though. The adjustment of 0.5-6% is likely to allow people to complete one more province."}]