[{"97": "Not even hoping that the change would actually change anything better. They have dragged this thing out for so long without any noticeable changes."}, {"117": "I really hope the tweaks help my veteran little cities, although they already struggle before the numbers mentioned.  Will have to see."}, {"17": "This appears to be what I asked for, a couple of weeks ago.  [BR]I easily flew through 2 pages of tournament before encountering any serious difficulty."}, {"47": "Am I alone, who feels that the tournament is harder than a week ago?"}, {"4": "Lelanya said:\t\t\tThis appears to be what I asked for, a couple of weeks ago.[BR]I easily flew through 2 pages of tournament before encountering any serious difficulty.\t\tClick to expand...[BR]I got a complete wipeout in province 16 round 1 with the level 10 Fire Phoenix fed on autofight.[BR][BR]I don't see any difference in the difficulty and still the enemies are far too random for my liking."}, {"22": "Lelanya said:\t\t\tI easily flew through 2 pages of tournament before encountering any serious difficulty.\t\tClick to expand...arnwald said:\t\t\tAm I alone, who feels that the tournament is harder than a week ago?\t\tClick to expand...Is it just me or has the difficulty curve changed such as the first 15 provinces became like a walk in the park, but provinces over 20 are suddenly waaay harder than they were before? Maybe a coincidence, but I hope we'll see some data on this change soon."}, {"47": "One fairly significant change between the old and the new tournament system is that there are no \"rest provinces\" in the new system. It often happens in the old system that I go through encounters also in remote provinces with minimal losses. We do not have such encounters in the new system at all."}, {"20": "I think the top players will like the change. I noticed less ESS from round 8 onwards than I faced in previous weeks.  Don’t think it will make a big impact in the range I play as the difference is still very small there."}, {"17": "Hmm so the first report was my elven city.  In my human city I made it through 3 pages with no trouble and finally stopped at that point.   Short term, I like the improvement and I found this tournament easier than last week."}, {"65": "whether a tournament is easier or more complicated is not really a problem - although everyone always wants a simpler one, however, everyone here has to cope in at least one condition and can just get used to it when there is a change. making a tournament easier is just a distraction from the problem.[BR][BR]the main problem, after all, is the formula that prevents the city from developing in the future if you want the best results in the tournament and thereby takes any sense to play this game of building a city."}, {"130": "I'm just going to put it out there, but my fellowship's experiences of these changes has been very positive. We are a mid range fellowship, in terms of what we can achieve together, and the level of effort we put in. We're all fairly active, but not excessively so, and we have medium sized or large cities with decent resource productions and lots of unlocked provinces. We do not have any play requirements of our members, e.g. minimum tournament scores, and just let people do what they want, based on what they enjoy and have time for. We're not in the same league as the really high achieving fellowships out there, but we still do pretty well.[BR][BR]Prior to these changes we'd get 6 or 7 chests in every tournament. Now we get 9 every week, and are looking into how we can push for 10. The reason for this is that many of us are limited in the time we can put into this game. The tedious endless clicking of the old tournament style was well beyond most of us, even though we had the resources to achieve it. The more streamlined format of the new tournaments means many of us have substantially increased our scores, such that we are now only limited by our resources.[BR][BR]We really like the fact that 10 chests is within reach for a fellowship like ours, whereas previously it could only be achieved by a relatively small amount of high achieving fellowships, who had the means to put in huge amounts of time and resources, which was always going to be beyond us."}, {"30": "Pauly7 said:\t\t\tThe difficulty change is in. Good to hear. Don't expect any miracles though. The adjustment of 0.5-6% is likely to allow people to complete one more province.\t\tClick to expand...I pushed till province 28 in the first round. For me, the difficulty reduction is only in the enemy ration which is by 0.06.[BR]However, province 25 seems out of order. Difficulty in province 24 is 1.724 vs 25 is 1.700. Then in the province 26, it is 1.736. Meaning, again 0.06 less than before.[BR]Yet, our biggest concern, the base squad size remains the same. In each province, it is \"base size\" * \"province number\".[BR]Whatever the city development I did for the last two weeks has pushed it up to 793 from 766. So in the 20th province now I need 540 * 5 = 2700 units more to have the 5 squads required."}, {"47": "UlyssesBlue said:\t\t\tI'm just going to put it out there, but my fellowship's experiences of these changes has been very positive. We are a mid range fellowship, in terms of what we can achieve together, and the level of effort we put in. We're all fairly active, but not excessively so, and we have medium sized or large cities with decent resource productions and lots of unlocked provinces. We do not have any play requirements of our members, e.g. minimum tournament scores, and just let people do what they want, based on what they enjoy and have time for. We're not in the same league as the really high achieving fellowships out there, but we still do pretty well.\t\tClick to expand...[BR]I agree. Our fellowship used to have about 60,000 points in the old system, now it is about 80,000 a week. I have an average of over 6,000 points now. My \"old\" average was less than 5,000.[BR]On the other hand, this pace is not sustainable in the long run, it costs me a lot of resources. Since the new tournament system was launched, my stock of boosters has decreased by about 1000 hours."}, {"4": "For an end game player it is a big kick in the teeth, years of investment in AW's upgrading and building them, to then be severely penalised for doing so. Also getting all province and research expansions and diamond ones to a total of 133.[BR][BR]I have not noticed any easing of this weeks tournament despite the announcement saying so with v1.114[BR][BR]My main gripe is that every tournament is basically the same now, I don't see any dominant enemy type and just don't know which tournament I am playing anymore. [BR][BR]I am starting to agree for the first time that in my opinion it seems Inno Games wants all the long timers to leave the game, give up and make space for the new players.[BR][BR]If that is the case as it seems more likely in my opinion, they why? [BR]I can only think the reason is to make a quick buck off first day quitters, which is such a waste of all the effort over the years by the developers to make such a beautiful game.[BR][BR]This makes me feel so sad...."}, {"4": "All the mid game players who barely played the tournament before, I can see how they view this as an amazing change, able to score more and get more rewards than before.[BR][BR]One day like me you will all become end gamers unless you stop somewhere mid chapter 11-12 and just play, then what to do with the KP as no one will want to upgrade wonders anymore, no one will spend diamonds on a premium expansion and we will all be sat in limbo, twiddling thumbs FFS."}, {"65": "i understand the eagerness of smaller and medium fs when your tournament results improve significantly, but it's a pretty short-sighted view. It's probably coming to realize that is an honor and a celebrity, but the use of tourney-prizes will only harm your city's ability to perform well in future tournaments."}, {"28": "m4rt1n said:\t\t\tI have not noticed any easing of this weeks tournament despite the announcement saying so with v1.114\t\tClick to expand...It's the usual thing:[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/release-notes-version-1-115.15617/post-91197\t\t[BR]You won't notice a change like that."}, {"4": "MinMax Gamer said:\t\t\tIt's the usual thing:[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/release-notes-version-1-115.15617/post-91197\t\t[BR]You won't notice a change like that.\t\tClick to expand...[BR]Makes the pro's say how wonderful the change is though. [smilie--sprite3][BR][BR]Why again are AW levels included in this change after 4+ years of the game????"}, {"30": "skelve said:\t\t\tI pushed till province 28 in the first round. For me, the difficulty reduction is only in the enemy ration which is by 0.06.[BR]However, province 25 seems out of order. Difficulty in province 24 is 1.724 vs 25 is 1.700. Then in the province 26, it is 1.736. Meaning, again 0.06 less than before.[BR]Yet, our biggest concern, the base squad size remains the same. In each province, it is \"base size\" * \"province number\".[BR]Whatever the city development I did for the last two weeks has pushed it up to 793 from 766. So in the 20th province now I need 540 * 5 = 2700 units more to have the 5 squads required.\t\tClick to expand...Sorry, this is a calculation error on my part. 24th is 1.664 and therefore it is in order."}, {"4": "skelve said:\t\t\tSorry, this is a calculation error on my part. 24th is 1.664 and therefore it is in order.\t\tClick to expand...[BR]Thank you for giving your figures, that must take a lot of time and I respect your effort.[BR]What I don't get is why upgrading an AW or gaining an expansion makes things harder as I don't see it in your numbers, and others keep saying how wonderful and amazing the changes are. [BR]Am I playing the same game as players who are doing much better with these changes @Lelanya for example, you found the 0.5% - 0.6% change an amazing improvement reading your post doing the first 2 pages of the tourney while I hit total wipeouts at the same time.[BR][BR]The changes INNO are making are so slight they are undetectable.[BR][BR]AW's, or Ancient Wonder levels if abbreviations are not understood by staff have been at the heart of the game for a long time, several years, now they are detrimental to the game progress in the tournament.[BR][BR]Buying a premium expansion or gaining any expansion makes things tougher in fights, why not just make it impossible to enter the tournament on a mandatory research around the ch12 - ch13 level and let us long timers rot away into history if you pass this point in the game."}]