[{"17": "Huh [BR]The city where I did 24 provinces is human, has 183 Wonder levels, chapter 15 @13 researches in, 49 expansions remaining (24 premium).[BR]Sanctuary and Needles at 21[BR]Forge at 11[BR]Flying Academy 12[BR]Dragon Abbey 17[BR]Toads 7[BR]Victory Springs 6[BR][BR]The city that opened 17 provinces is elven, has 168 Wonder levels, chapter 16 @ 3 researches in, 46 expansions remaining (25 premium)[BR]Monastery 16[BR]Needles 15[BR]Forge 8[BR]Flying Academy 12[BR]Dragon Abbey 16[BR]Toads 7[BR]No Victory Springs [BR][BR]I hope that helps put y'all in the picture."}, {"84": "I don't see any point in people adding anything more to this thread. With all the feedback from this thread and the beta thread  if the devs were going to make any big changes they would have done so by now but all we get are very minor tweaks that are not even noticeable. The new system is obviously working the way the devs want it to. Mods please do not waste your time saying that the feedback is still being collected and the devs are still looking at things because it is clear by now that they are not really listening to what the players are saying."}, {"1": "@Timneh until they give us the green light to send an announcement that the tournament changes are final, they aren't. Therefore, this thread is still a great tool for the devs to collect feedback."}, {"8": "In my opinion (this being my 3rd Inno game), the managers at Inno don't actually give a hoot about our feedback. All they are interested in is they were given a project to do and regardless of the outcome they are determined to stick with it or they won't look so good to the manager above them.[BR]I'll play one of their games for free, but I wouldn't support them financially, by buying diamonds. They are just not worthy in my opinion. [smilie--sprite1]"}, {"30": "m4rt1n said:\t\t\tWhat I don't get is why upgrading an AW or gaining an expansion makes things harder as I don't see it in your numbers, and others keep saying how wonderful and amazing the changes are.\t\tClick to expand...@m4rt1n, these are two different aspects. Until the 10th province, the enemy ratio is 0.126 to 1.103 and the enemy troops are at level 2 till the 10th province. Therefore, with the single fight for a province, a lot of early to mid game players are now scoring well. So they like it and we all like that aspect since the fellowship is scoring well and earning blueprints.[BR][BR]As I stated earlier, in the 20th province I need 2500 more units than two weeks before due to city development which mainly a couple of AW upgrades since I have completed all research. However, since I want to check this I am using 2 UUUs, 2 MMMs, 1 ELR with the Fire Pheonix this week with a lot of manual fighting. As you can see my troops are almost 1.5 - 2 times powerful than the enemy depending on the troop selection. I am not sure whether this is sustainable. In fact, my goods stocks have come down to 2m from 4m within last few weeks. So don't worry about you are having a higher difficulty since I will have the same issue without the above boosters.[BR][BR]If I upgrade my Ancient Wonders too far (from current 207 levels) I am afraid I will not be able to have the required troops to have the required 5 squads in the 20th province let alone winning a fight."}, {"33": "skelve said:\t\t\tIf I upgrade my Ancient Wonders too far (from current 207 levels) I am afraid I will not be able to have the required troops to have the required 5 squads in the 20th province let alone winning a fight.\t\tClick to expand...[BR]I've got 362 AW levlels (W world) and can fight province #50. So I'm sure you can build a lot more on your AWs [smilie--sprite2]"}, {"84": "anonglitch said:\t\t\t@Timneh until they give us the green light to send an announcement that the tournament changes are final, they aren't. Therefore, this thread is still a great tool for the devs to collect feedback.\t\tClick to expand...[BR]I stand by what i said earlier that IF there are changes they will be very minor and practically unnoticeable, If there were going to be any significant changes they would have happened by now.[BR]I personally think that the tiny changes that have been made have had nothing to do with feedback but are based on the data that the devs have got from the tournaments that have been played so far. @anonglitch if you want to believe otherwise that is up to you but please stop repeatedly telling me things that would appear to be false (unless you can prove them)."}, {"26": "MinMax Gamer said:\t\t\tIt's the usual thing:[BR]https://beta.forum.elvenar.com/index.php?threads/release-notes-version-1-115.15617/post-91197 [BR]You won't notice a change like that\t\tClick to expand...Thanks. That explains why this tournament felt exactly the same as any other tournament we had after the changes. Which btw another issue that was barely addressed by the devs, the tournaments are almost identical now so instead of having something different each week we got nine weeks of the same stuff in a cycle. But looking at the changes we get after the extensive feedback for two months I almost don't see any reason to keep pointing out the issues."}, {"30": "valle said:\t\t\tI've got 362 AW levlels (W world) and can fight province #50. So I'm sure you can build a lot more on your AWs [smilie--sprite2]Click to expand...Wow, that's good to hear  [smilie--sprite1]"}, {"32": "skelve said:\t\t\tWow, that's good to hear  [smilie--sprite1]Click to expand...[BR]It's a meaningless quote without more context.[BR][BR]I have 1000 wonderlevels and I could do 90 provincies if I wanted to.[BR][BR]1. time spend? manual vs auto[BR]2. units spend vs production[BR]3. Combat boosters spend vs combat booster gain[BR][BR]Throw in a bucketload of boosters, unlimited units / goods and spend a lot of time in manual combat and you can get very far."}, {"24": "m4rt1n said:\t\t\tMy main gripe is that every tournament is basically the same now, I don't see any dominant enemy type and just don't know which tournament I am playing anymore.\t\tClick to expand...[BR]This is of course not the case. If you don´t see the difference between tourneys, you are no looking. It is of coursemore difficult to see now, with a small chance of all units possible. But there is always a clear setup of 1-3 main units (=common units) and less common units. Not sure, but there may even be an intermediate group.[BR][BR]Gems right now has LM, HM, HR as main (or common units) while LR and M is rare. If there is an intermediate group LR would be that, otherwise I just got a bit more LR than I would expect, but that´s how it works with probabilities....[BR][BR]Of course this setup that no units are completely excluded makes the tourneys more challenging, but that is a good thing. So while at first glance tourneys may look more similar, you have a bigger variety of encounters each week than you had before, forcing the use of more than 1 unit per week. IMO more variety is better than the endless boredom we had before."}, {"30": "CrazyWizard said:\t\t\tIt's a meaningless quote without more context.[BR][BR]I have 1000 wonderlevels and I could do 90 provincies if I wanted to.[BR][BR]1. time spend? manual vs auto[BR]2. units spend vs production[BR]3. Combat boosters spend vs combat booster gain[BR][BR]Throw in a bucketload of boosters, unlimited units / goods and spend a lot of time in manual combat and you can get very far.\t\tClick to expand...I am not sure whether you have followed the discussion on this regard. I assumed @valle has and hence the quoted comment."}, {"14": "skelve said:\t\t\tI am not sure whether you have followed the discussion on this regard. I assumed @valle has and hence the quoted comment.\t\tClick to expand...[BR]He is saying that Valle is leaving out a lot of important factors, which determine how far you can go, not to mention the sustainability of it."}, {"68": "The only thing which is good about this whole mess is having 1 province only instead of 4, although I would rather have had 2 as failing a province is a total loss which is greater than the old way.[BR][BR]This is a perfect example of Inno giving us something good with one hand but penalising us to a greater extent with something else.  I also think that this is how the devs want it to be, they will give us tiny changes with much heralding and fanfares but which have very little meaningful difference.[BR][BR]We've had weeks and weeks of this, both in Beta and now here, how many people will be surprised when its rolled out to the rest of the live servers with no change?[BR][BR]I've spent money in the past for this game, but done with that now and for me, this games days are numbered.  Its boring now, log in, check productions, do a bit in the spire, a tournament round, visits, done for the day - no pleasure, no fun, oh look another FA, another event.... boring boring boring and a money sink for those who don't know what will face them eventually."}, {"22": "Gargon667 said:\t\t\tThis is of course not the case. If you don´t see the difference between tourneys, you are no looking. It is of coursemore difficult to see now, with a small chance of all units possible. But there is always a clear setup of 1-3 main units (=common units) and less common units. Not sure, but there may even be an intermediate group.[BR][BR]Gems right now has LM, HM, HR as main (or common units) while LR and M is rare. If there is an intermediate group LR would be that, otherwise I just got a bit more LR than I would expect, but that´s how it works with probabilities....[BR][BR]Of course this setup that no units are completely excluded makes the tourneys more challenging, but that is a good thing. So while at first glance tourneys may look more similar, you have a bigger variety of encounters each week than you had before, forcing the use of more than 1 unit per week. IMO more variety is better than the endless boredom we had before.\t\tClick to expand...Yep, I agree. They aren't the same as old tournaments, because previously you wouldn't expect three dominant troop types, but nonetheless there is always a pattern. Actually the set up for gems is quite favourable because if you trained mostly Mages and HM, they can deal with most of the enemies... Throw in a bunch of frogs for the manual fights and you're away.[BR][BR]Some of the tournaments are easier to figure out. I think everyone is going to find next week's marble tournament one of the easiest because I think we will face mostly heavy melee troops. Bucketloads of Blossom Princesses should get the job done next week."}, {"22": "CrazyWizard said:\t\t\t1. time spend? manual vs auto[BR]2. units spend vs production[BR]3. Combat boosters spend vs combat booster gain\t\tClick to expand...4. Supplies instants spend vs gained."}, {"53": "skelve said:\t\t\tIf I upgrade my Ancient Wonders too far (from current 207 levels) I am afraid I will not be able to have the required troops to have the required 5 squads in the 20th province let alone winning a fight.\t\tClick to expand...[BR]valle said:\t\t\tI've got 362 AW levlels (W world) and can fight province #50. So I'm sure you can build a lot more on your AWs [smilie--sprite2]Click to expand...[BR]CrazyWizard said:\t\t\tIt's a meaningless quote without more context.[BR][BR]I have 1000 wonderlevels and I could do 90 provincies if I wanted to.\t\tClick to expand...[BR][BR]I suspect that Valle's assertion is entirely reasonable and sustainable. I have a more progressed city with over twice the average endgame squad size (700+ AW levels, 149 expansions, base squad size 1701, 1 phoenix, 1 brown bear, all military wonders at lvl 30+) and am averaging about 9k on the new tournament (about half of what I was doing previously). I've been manually fighting a lot, but otherwise everything should be sustainable. (Actually I've been rather conservative.)[BR][BR]Of course the above doesn't imply that the tournament is balanced. An endgame city could have the same fighting and catering ability as mine with half of the squad-size."}, {"76": "Pauly7 said:\t\t\tYep, I agree. They aren't the same as old tournaments, because previously you wouldn't expect three dominant troop types, but nonetheless there is always a pattern. Actually the set up for gems is quite favourable because if you trained mostly Mages and HM, they can deal with most of the enemies... Throw in a bunch of frogs for the manual fights and you're away.[BR][BR]Some of the tournaments are easier to figure out. I think everyone is going to find next week's marble tournament one of the easiest because I think we will face mostly heavy melee troops. Bucketloads of Blossom Princesses should get the job done next week.\t\tClick to expand...I have to disagree, they may be different but its such a small difference that I have come to the conclusion that I can train Priests and Frogs and be fine for every tournament so far. I guess I use a few crossbows and mortars but not more than my shrooms and toads gives me."}, {"26": "Pauly7 said:\t\t\tYep, I agree. They aren't the same as old tournaments, because previously you wouldn't expect three dominant troop types, but nonetheless there is always a pattern. Actually the set up for gems is quite favourable because if you trained mostly Mages and HM, they can deal with most of the enemies... Throw in a bunch of frogs for the manual fights and you're away.[BR][BR]Some of the tournaments are easier to figure out. I think everyone is going to find next week's marble tournament one of the easiest because I think we will face mostly heavy melee troops. Bucketloads of Blossom Princesses should get the job done next week.\t\tClick to expand...I have to disagree. I admit that I have a skewed perspective, since I have a near zero cooldown, so I'm doing two tournaments under the same set of boosters. But in this scenario I just choose based on which boosters I have more if I'm training mages or rangers in the FA, and then do around 9k score (9 provinces 6*, 10-40 5*). Probably will be doing more once the changes are final and I don't need to keep a reserve in case things will get even worse. I don't do manual fights, auto only. So yes, for me it's indistinguishable. There may be some slight differences, but unless I'll start fighting manually I won't feel them. This is very much different for me from the previous tournaments where I had a schedule for using boosters depending on the opposing troops and had a schedule for training troops depending on the tournament."}, {"22": "The tournaments are very much different for sure. There's no denying that. I now have access to some data on enemy types faced, based on hundreds (actually probably thousands) of encounters, since the tournaments were implemented on Beta. What has become obvious is definite patterns. As @Gargon667 says, this is often three enemy types, so that doesn't make it straightforward. There is, of course, still a presence of non-dominant enemy types. Much more so than there previously was. With gems you're looking at between 25-30% of the enemies being each of LM, HR and HM. The rest split between Mages and LR. That can still look fairly random until you get into it, but it's enough to know that you really don't need to use that many LM or LR... If you don't want to. There are still opportunities to bring out LR troops in manual.[BR][BR]I'm not saying I particularly like how it is now. All I'm trying to say is that tournament types do have specific patterns."}]