[{"22": "Actually something else to note - I believe they have made T1 tournaments the easiest and T3 the hardest. T1 tournaments have one dominant enemy type, T2 have two and T3 have three."}, {"26": "@Pauly7 ok, maybe I'll need a full tournament cycle or two to get what you are saying, but as of now from my point of view there are not many differences. I either bring blossom princesses with a 100% damage boost that are obliterating everything including LR and LM which should counter them (and some rangers in case there are setups like HM+rangers) or I bring rangers with the same damage boost that are obliterating everything (with some mages when I face HM+HR). Some golems from the barracks and valorians from the event buildings on top for the odd encounters and I'm getting decent results regardless of the tournament.[BR][BR]So yes, for me personally the tournaments are looking exactly the same. Just choose if you have more UUUs or MMMs, throw in some time boosters for the odd encounters (and some more for the planned ones) and you are good to go."}, {"22": "I should also say that so far I haven't used a single ELR or MMM in the new tournament system. I'm trying to get a purer idea of the enemies and what my strategy is before I start bringing those in. I do understand that for people dropping a lot of those buildings in then it will blur the edges a lot more and make the fighting more similar. For example next week you may be able to do the whole thing with Blossom Princesses if they are boosted enough."}, {"112": "Im out, I had been playing for over 4 years and was ranked in the top 50, built up a fellowship in the top 50 also but these changes have ruined it for me. The lack of consultation, and the fact that the changes all appear more to be a money grab then anything that will favour progression for players."}, {"65": "here may be some differences, but i don't feel them. all new system tournaments, most used troops for me are frogs and blossom mages. minimal others, this gems now is first where i can sometimes use HM too. as the first 10-15 provinces are so easy, so don't speak from that. Mostly I speak provinces after 20-30, to 50. Don't have done more, maybe.[BR]no need to speak first provinces, there almost no cost of troops compared to later."}, {"4": "I am now starting to wonder if there is some bug with the feeding effect of the Fire Phoenix.[BR][BR]I managed to autofight the first 20 provinces of round 5 with the a level 10 fire phoenix fed and won every encounter, yet in round 1 and 2 with the bird fed I had several total losses on autofight."}, {"28": "FYI, it seems that other live servers will be getting the new tournaments starting next week. Well, at least for US servers:[BR][BR]\t\t\thttps://us.forum.elvenar.com/index.php?threads/tournament-changes.25317/\t\t"}, {"26": "m4rt1n said:\t\t\tI am now starting to wonder if there is some bug with the feeding effect of the Fire Phoenix.[BR][BR]I managed to autofight the first 20 provinces of round 5 with the a level 10 fire phoenix fed and won every encounter, yet in round 1 and 2 with the bird fed I had several total losses on autofight.\t\tClick to expand...Most likely it's just unfavourable terrain. At least I'm encountering losses regardless of the round.[BR][BR][BR]MinMax Gamer said:\t\t\tFYI, it seems that other live servers will be getting the new tournaments starting next week. Well, at least for US servers:\t\tClick to expand...Oh well, apparently we are done with testing and months and dozens of pages of the feedback are thrown out of the window. Can't say that I'm surprised though."}, {"33": "m4rt1n said:\t\t\tI am now starting to wonder if there is some bug with the feeding effect of the Fire Phoenix.[BR][BR]I managed to autofight the first 20 provinces of round 5 with the a level 10 fire phoenix fed and won every encounter, yet in round 1 and 2 with the bird fed I had several total losses on autofight.\t\tClick to expand...[BR]I think it's nothing new with that. I'm used to get unexpected losses from autofights. Not to often, but it happends and my guess is that's an unhappy combination of AI and terrain."}, {"14": "MinMax Gamer said:\t\t\tFYI, it seems that other live servers will be getting the new tournaments starting next week. Well, at least for US servers:[BR][BR]\t\t\thttps://us.forum.elvenar.com/index.php?threads/tournament-changes.25317/\t\tClick to expand...[BR]Guess the changes are pretty much set in stone now."}, {"122": "amazing  all that feedback  and not one change related to  what was said in most of the feed back [BR]stop punishing us for advancing our cities   .Looks like alot of players wont advance there cities  and then lets see how long it takes before that gets boring . AW  punish you  ,expansions punish you,  advancing punish you   ..this was said over and over again  and not one change to sort this out   ..meaning the feedback was just a complete waste of everyone's time"}, {"122": "MinMax Gamer said:\t\t\tFYI, it seems that other live servers will be getting the new tournaments starting next week. Well, at least for US servers:[BR][BR]\t\t\thttps://us.forum.elvenar.com/index.php?threads/tournament-changes.25317/\t\tClick to expand...[BR]And now they ask the US server for feed back  ha ha ha ha[BR]our feedback and Beta's   got very little changed   and now  they want  more of the same"}, {"45": "The new Tournaments are indeed due to go out to the rest of the live servers next week (October the 6th)."}, {"131": "Thanks to the tournament changes, we just got 10 chests for the first time. Much appreciated, Inno.  [smilie--sprite1]"}, {"127": "Last week, Hawk the slayer, AM of the North and Joemork, AM of Asgard contacted the AM’s of sixty of the top tourney fellowships across Arendyl and Felyndral to get the views of their members on the new format.[BR][BR]The overwhelming consensus was that the 1 click system was liked, and that it is great that so many of the more casual fellowships can now attain the 10 chests and that all important blueprint.[BR][BR]However, many of the more established fellowships with higher ranked players dislike the new formula as it is now a huge sinkhole of goods, troops, coins and supplies (Regina8 / FORTIS / Felyndral), not to mention the high quantities of mana and orcs. Whilst many are still able to maintain a decent score 5-10k points, most of them admit that it is simply not sustainable.[BR][BR]Although the loss of KPs has been accepted by some, the new lack of competitiveness is harder to deal with. And with that, we are starting to see the departure of some great long term players, because, quite simply they gain no more enjoyment from the game.[BR][BR]A good many have already posted here several times, however there were many that were not represented, and to represent the feedback we received, without repeating many of the remarks that have already been made in this thread, we would like to quote some of them…..[BR][BR]the benefit gained by manual fighting, has, IMHO, created an even bigger imbalance between PC & App  (Silvermaiden / The Smofflers / Felyndral)The biggest drawback is troops is a big drain. Constantly using time and tool instants, as well as feeding the bear won’t be sustainable in the long run (Cadira/ The Silver Unicorn / Felyndral)Using expansions and AW levels in the SS calculation Tournament is now just the same as the Spire. Random enemy troops, so all weeks are nearly the same (Voodrix / The Temptations / Felyndral)Now there's no point to upgrade their cities anymore,  because with each level that you are adding,  you're making tourneys even harder for yourself.  The frustration comes from realisation that there's no point to progress anymore.   You are enjoying it  now, but see what's going to happen in a few months time, when your team will progress in the game and how hard they will find tournaments to be. (Regina8 / FORTIS / Felyndral)I actually find it hard to understand how the new formula can work to improve the game when AW count & levels add to the difficulty of tournaments, but which is also counter-indicative of the AWs themselves. Growth & progress are now not necessarily a good thing.The new formula does seem to punish those that have played the longest most, which is a shame, because longtimers are already leaving over it. It's simply one hassle too many on top of endless same/same events & FAs, tweaking the game, rinse & repeat. Add a touch of RL pressure & gone. (Ishfaereth / Children of the Forest / Felyndral)Mid gamers, with expansions, aw levels etc also hit the wall with tourneys. The fights become unwinnable purely because of the lack of specialist troops which aren't unlocked so we have to stop. Catering on a regular basis cannot be done - the cost of mana, seeds, and orcs is very high, sometimes more than 1 day’s production per fight. So where everybody else stops tourney naturally we don't have that luxury once the squad size goes over 2:1 against us. (TheBonker / Children of the Forest / Felyndral)This tournament change is a big change, and hurts the biggest players most.  If you think that doesn't matter, you're wrong.  The players who made it to the top and stay there, are the ones that are willing to pay with real money to gain an advantage.  Without those willing to pay, Inno wouldn't have the resources to keep this game going, so they are needed and welcomed. (WutScnNm / The Wanderers / Felyndral)I have played the game for nearly 5 years, as have a lot of my FS members. I feel we are being punished for spending money on the game for expansions, Magic Buildings and upgrading AW. Inno themselves encouraged us to upgrade and make use of the AW. Like I stated we feel punished for spending real money on the game and trying to progress. (Granof4 / Elite Warriors / Arendyl)I do think that Ancient Wonder levels and city expansions must not have an impact on tournament cost. There should be ways to improve the city without any penalty. (Rainbowelvira / The One / Arendyl)I am in total agreement that the AW upgrades and purchase of expansions should in no way negatively affect the algorithm of the tourney. (Wendyroo / Merry Band of Misfits / Aren)My smaller city fellows are finding new format okay but most of them are now scared to grow their cities. (John308 / No Drama / Arendyl)In my fellowship we are all trying to adapt, some of us have already sacrificed AWs to alleviate the difficulty which is really unfair considering all the time and effort invested on those AWs. Another unfairness is also being chosen for such a long time as the test server (\"the guinea pigs\" as I call it) without our consent. (Kaliartis / TourneyBandit$ / Arendyl)[BR]Participating Fellowships[BR][BR]Arendyl[BR]Tournie Bandits, The Archetypes, Cow Tipping Dwarves, Dragons of Pern, The Elite Warriors, Merry Band of Misfits, Wolf Pack, Colinwood, Merry Mutineers, Knights of Hammer, Awesome, No Drama, Beyond the Seas, Elvinears, Red Tribe, The Immortals, Nirvana, Travelling Bluberries, The Serene Empire, Sage Advisors, Avariel of Toril, Eagles Grace, Silver Pheonix, The Norsemen, Theone, Inspired, Trendor's Reach[BR]Tudor Dragons, The North[BR][BR]Felyndral[BR]The Silver Unicorns, All 4 1 & 1 4 ALL, The Wonderers, Urban Hereos, Age of Elves, The Secret Realm, The New Dawn, Silent Lucidity, Red River Dragons, Spirit of the Phoenix, The Hive, Hajma, The Magnitude, Pink Panthers, Swagafythee, The Temptations, The Smofflers, Fortis (and InSpire EN2), Children of the Forest, Pyramaniacs, The Musketeers, Rampant Unicorns, Awakened Mages, Beggars Banquet, Asgard"}, {"118": "Expecting to see a wave of discontent from the other servers when it's there...[BR]malph said:\t\t\tLooks like alot of players wont advance there cities  and then lets see how long it takes before that gets boring . AW  punish you  ,expansions punish you,  advancing punish you   ..this was said over and over again  and not one change to sort this out   ..meaning the feedback was just a complete waste of everyone's time\t\tClick to expand...[BR]I am already getting real bored......."}, {"5": "@hawk the slayer Thank you so much for that Feedback, and if you could please extend our gratitude to those who responded to you. We understand that some do not frequent the Forum. I'll ensure this get passed over. [BR][BR]Kind Regards[BR][BR]Herodite."}, {"127": "Thank you Herodite, its good to know that'll you will at least past it on [smilie--sprite1]"}, {"132": "I have been playing this game for almost a year and Will very soon be in the Elementals chapter. I am enjoying it because of the tournaments, the struggle to have a functional city in limited space and the competition with others. Let me put down my opinion about the tournament changes.[BR][BR]1. 1 province instead of 4: Everybody agrees that this is good. No point in discussing it further.[BR][BR]2. More random troops: This has in my opinion pros and cons:[BR][BR]a. You place MMM's and ELR's but don't really know if you are going to use mages or light range units. Maybe Inno should remove ELR's and MMM's from the game and create a universal type IUA (increased unit attack) that will be not type-specific.[BR]b. Tournaments become more difficult if more unit types are involved. That may be a nightmare for fellows who auto-fight but for me doing only manual fighting it is a challenge accepted.[BR]So in general I would say neutral to maybe positive for me.[BR][BR]3. Difficulty increasing rapidly especially after province 20: I guess this has several reasons:[BR][BR]a. Inno doesn't want us to earn tons of KP's in tournaments anymore because[BR]      i. Devs cannot keep up creating new chapters before the end-players reach the end of the game[BR]      ii. People are rushing through the chapters (I have been doing 1 chapter each month) because they reach the end to quickly and loose interest.[BR]Of course they could just reduce the KP's offered after the 10th province, as has often be said, but this has also a different impact.[BR]b. Inno wants small to middle-size players to have a chance against end-players.[BR]With the old system I had no chance of competing against end-players because I was simply limited by tournament provinces. Now that the end-players are limited by difficulty I have a chance to compete with them. Is it fair? I don't know. But it may be more interesting.[BR][BR]4. The famous formula for establishing tournament difficulty: The reason for the existence of the formula is to try and balance the fighting ability between the players, something like the golf handicap. The old system was based only on the squad size, or in other words the advance in the tech tree. That was something but it was not completely fair. My city with 100 expansions and being less than a year old has its wonders at level 6 to 11. A city at the same chapter but being maybe 3 years old can have its wonders at level 21 and have 20 more expansions and so room for more armories or workshops or whatever. So I guess they tried to take everything in consideration. [BR][BR]So what does the formula take into account? (using MinMax's formula)[BR]a. Chapter and Chapter progress: Similar to the old squad size. OK reasonable.[BR]b. Maximum Relics Boost: After a few months in the game I guess everybody has max relic boost. So this just favours the very small players. No problem.[BR]c. Number of premium expansions placed: Now this is wrong. It should be Total Expansions. A larger city has a better fighting ability, maybe because of more manufactories, or more culture and thus more supplies and coins to cater etc. Maybe they thought that having included the chapter they roughly know how many expansions you have so they are interested in the additional. Since the actual state of the city is of interest, the total expansions should be taken.[BR]d. Ancient Wonder Levels: As I said before having some wonders 10 levels higher then somebody else certainly gives you advantage in fighting, that's why you build them. If Inno wants equal chances for everybody they had to take that into account somehow. They could of course make a complicated table saying that the Monastery gives you so much advantage, the Thrones of the High Men much less etc. but it probably would be complicated and anyone could argue if that factor is correct or not. They chose to just count total levels.[BR]The problem here is that when you built the wonder the \"law\" was different. If you knew the implications you may have never built it. I understand that. It may not be fair. On the other hand if you take it as correct that they are trying to give everyone the same opportunity in the tournament, they somehow must take wonders into account. I think it is not as dramatic as it may sound. If you have a monastery at level 30 it is like you start the tournament with an additional UUU compared to somebody who does not have it. How much are you penalized for that? Maybe 6% for the 30 levels. So instead of having 30% additional life for your units it is like you have 28%. Of course if you have the Thrones of the High Men (because you want to rank higher) it gives you almost no combat advantage but you get another 6% because of it. No such system is ever perfect.[BR][BR]To sum this up, I think the intentions are good and they are trying to make the tournaments more fair to everybody. If you are someone that always was in the top 20 and now some nobody suddenly scores higher then you of course you will not like it. The nobody will definitely like it.[BR][BR]I say again. Think of it like the golf handicap. You play together with your buddy a game of golf. In the 18 holes you play perfect and score a 72. Your buddy, not as good as you scores an 82. Then he applies his handicap and he wins. Is that fair? It's not, but if he didn't have his handicap he would never have a chance to beat you and stop playing with you. And I have never heard of anybody complaining about the golf handicap.[BR]Thank you for your time."}, {"84": "So the new system is going live on all servers as it is now. I personally see 1 good thing that will come out of that and that is now a certain person can no longer keep saying that nothing is set in stone and changes could still be made."}]