[{"68": "I really really want to know why we had to give feedback in Beta, and then become the new unofficial testing server to give more feedback when the Devs have ignored it?  Why ask for feedback when, to all intents and purposes, it is totally ignored?[BR][BR]How many more people will leave the game when they realise that city building has just become worthless and any progress is punished?  Perhaps Inno think that they will stay for the never ending stream of events which they push onto us.[BR][BR]As somebody with a smaller city, currently at the end of Fairies, I did a whole 200 points more in this tournament last week than I did in the Dust tournament 9 weeks before when I was considerably smaller in size.  As far as I can work out the people who have benefitted are those whose FS didn't get the 10th chest before as its proved easier for them to get 1.6k points each.[BR][BR]I like to move fast through chapters as I have PP to use, I accept that this means that I won't have the same levels of AWs as somebody else who plays the same chapter without PP, but I don't expect to be taken back a step because of what I have done in my city.[BR][BR]This whole things leaves a very nasty taste in my mouth - I have 3 cities and now seriously considering whether its really worth continuing on when I'm just filled with despair of how a simple desire to limit how many kp some people were getting in tournaments has turned into a total whitewash for anybody who was playing tournaments regularly and getting enjoyment from them.[BR][BR]If your employer told you that all your hard work was for nothing as they'd decided to take a different approach you'd be annoyed but at least you're still getting paid.  When a game such as this allows you to spend money on things which are freely available, encourages spending on certain items by having sales (expansions) or making it possible to spend more than before (AW lvls 31-35) and then tells you that actually what you've done is going to disadvantage you in the long run it is more like robbery."}, {"15": "Timneh said:\t\t\tSo the new system is going live on all servers as it is now. I personally see 1 good thing that will come out of that and that is now a certain person can no longer keep saying that nothing is set in stone and changes could still be made.\t\tClick to expand...It was set in stone the moment it hit the EN server. Anyone who has been active in this game or forum for over a year knew that.[BR]This is the Spire scenario all over again. There were 60 pages of feedback on the spire on Beta before it was released live, players saying pretty much the exact same thing as they are saying now (they didn't know the exact formula back then but they had a pretty good idea how it worked) and not a single thing was changed in the formula. They did change some of the Spire prizes to make it more attractive. People then complained about the Spire here but nothing was changed. Finally most players embraced the Spire when the multiplayer feature was added, even those who used to hate it at first. I'm guessing that based on that experience the devs think the same will happen to the tournaments; people will complain some more and then eventually accept them.[BR]It might just be so, but personally I feel there is a big difference. People accepted the Spire because it helped with tournaments and tournaments helped to grow your city. Now what we have is a costly/difficult feature like the Spire that is supposed to help us with an even more costly/difficult feature a.k.a tournaments and tournaments will... what exactly? Helps us to grow our city and make both the Spire and the tournaments more expensive and difficult? What's the point of doing them then? If you count the amount of goods (all kinds included) required and also the space used by all the military buildings, one might just stop, sell those buildings and replace them with all the buildings that give kps we've been getting lately and advance through the chapters almost just as fast.[BR]As many other players here I will stay in chapter 15 and not go forward. Not just because of the new tournaments but also because I don't see anything good in either chapter 16 and 17; I'm beyond bored of the same old guest race mechanics. (One would think that after 11 chapters of it they would think of something new, but nope, let's change tournaments instead, the one thing that no one complained about. ) Not sure how long I can keep enjoying a game where I don't progress in any way, so eventually I'll stop like many others, but I'm sure that Inno has done their maths and calculated that they get way more new players than they'll lose this way. After all they give us the product they want to give us and it's up to us to take it or leave it."}, {"122": "now we know  that this is now set in stone   and the feed back was nothing more than a gimmick[BR]now we wait and see how the other servers are gonna take to it [BR]Also am expecting a big exodus not long after this goes live to all servers and expecting more to leave from our server now we know that there will be very little changes if any .."}, {"28": "sail0r said:\t\t\tc. Number of premium expansions placed: Now this is wrong. It should be Total Expansions. A larger city has a better fighting ability, maybe because of more manufactories, or more culture and thus more supplies and coins to cater etc. Maybe they thought that having included the chapter they roughly know how many expansions you have so they are interested in the additional. Since the actual state of the city is of interest, the total expansions should be taken.\t\tClick to expand...Both premium and non-premium (placed) expansions count. Premium ones have less of a penalty."}, {"65": "sail0r said:\t\t\tIf you are someone that always was in the top 20 and now some nobody suddenly scores higher then you of course you will not like it. The nobody will definitely like it.[BR]I say again. Think of it like the golf handicap. You play together with your buddy a game of golf. In the 18 holes you play perfect and score a 72. Your buddy, not as good as you scores an 82. Then he applies his handicap and he wins. Is that fair? It's not, but if he didn't have his handicap he would never have a chance to beat you and stop playing with you. And I have never heard of anybody complaining about the golf handicap.[BR]Thank you for your time.\t\tClick to expand...I don't agree with this, golf is a different game, it always starts from the beginning and goes to the end. In Elvenar, here is also your city. why I develop my city if no benefit from that? it's boring, it's already very boring and there is nothing to do with that I can't get the top 20 anymore. I may be first if I want, that's not a problem. but I can't do anything with my city anymore, it always starts from nothing.[BR]I like my city but now tournaments give nothing to my city. They want to give us less kp - now we don't need any kp anymore."}, {"22": "sail0r said:\t\t\tI say again. Think of it like the golf handicap. You play together with your buddy a game of golf. In the 18 holes you play perfect and score a 72. Your buddy, not as good as you scores an 82. Then he applies his handicap and he wins. Is that fair? It's not, but if he didn't have his handicap he would never have a chance to beat you and stop playing with you. And I have never heard of anybody complaining about the golf handicap.\t\tClick to expand...I'm not that big on golf, but isn't the handicap something that you just use when having a friendly round with your mates, to make it interesting? No one plays at the Masters, but says... Oh wait, I have a handicap of 10 so I win."}, {"4": "So now I have to think about deleting Ancient Wonders that I have spent hours, days, weeks, months, years working on to upgrade.[BR][BR]I have 26/30 wonders built now between level 6 and level 18, you tell me please @Silmaril why???[BR][BR]This is so disheartening after years of building my city. [smilie--sprite3]"}, {"22": "One of the things that seems the worst about this is that Inno asked for our feedback, both on the Beta server and the EN server. The response to the request has been undeniably tremendous. Some feedback was more constructive than others, sure, but a lot of people put their heart and souls into this because Inno asked. Some amazing work has been done calculating all the details, the permutations, figuring out the problems, etc.[BR][BR]I've had a count up and there have been 3,144 messages sent in the feedback threads over both servers. They should be proud to have a knowledgeable player base who is willing to invest that kind of time. So it's one thing to not take on board any of the feedback given, but what's much worse is that they haven't responded to any of it. Not once, as far as I can see. I'm not counting mods trying to tow the company line and smooth the waters. In a business sense this is unprofessional. On a personal level I'm actually quite offended that no one from the development team has even come back to thank us and at least give a brief rundown of why they think they are right and why they have not made any changes based on feedback.[BR][BR]To echo what others have said I don't believe they ever wanted feedback in the first place. All they were spending this time doing is analysing the effect on playing patterns and spending patterns. If that's the case, @InnoGames, in the future please don't have the audacity to ask your players (many of them paying players) to invest what probably amounts to over a thousand cumulative hours in providing feedback that you've asked for if it's only a charade to mask some other process entirely."}, {"2": "sail0r said:\t\t\tb. Inno wants small to middle-size players to have a chance against end-players.[BR]With the old system I had no chance of competing against end-players because I was simply limited by tournament provinces. Now that the end-players are limited by difficulty I have a chance to compete with them. Is it fair? I don't know. But it may be more interesting.\t\tClick to expand...I think it's quite normal to have no chance to compete against end-players. They've spent YEARS to develop their cities and IS NOT normal a \"young\" city to be as competitive as the really old one. It's like saying in any sport (except golf and that handicap) that is normal that a 15yo player who started to train a year ago to be as competitive as a (let's say) 25yo player who is already training for 10 or more years, but to make it fair for the younger player, the older will have to stay in one leg and have one hand tied up. Does it sound fair to you?[BR]Will be interesting to see how your opinion will change in half a year or a year, when you will become an end-player and you will get a kick in the rear from the newer players [smilie--sprite8] [BR][BR]no offence Skipper [smilie--sprite8] you know I really appreciate you [smilie--sprite2]"}, {"45": "I wish I had the answer for you @m4rt1n [smilie--sprite3] Unfortunately we only have the information that has been shared on the Forum."}, {"65": "I want to ask from managers, if they know, what Inno means with that what they say in US forum Tournament changes announcment: \"We also aim to stop some unfavorable strategies, which we are aware were caused by flaws of the old Tournaments system. Some of these were tedious for players who were using them, while others provided unfair advantages over other players that needed to be addressed.\"[BR]What was that reason to hurt us so much, what have we doing wrong?"}, {"15": "Pauly7 said:\t\t\tOne of the things that seems the worst about this is that Inno asked for our feedback, both on the Beta server and the EN server. The response to the request has been undeniably tremendous. Some feedback was more constructive than others, sure, but a lot of people put their heart and souls into this because Inno asked. Some amazing work has been done calculating all the details, the permutations, figuring out the problems, etc.[BR][BR]I've had a count up and there have been 3,144 messages sent in the feedback threads over both servers. They should be proud to have a knowledgeable player base who is willing to invest that kind of time. So it's one thing to not take on board any of the feedback given, but what's much worse is that they haven't responded to any of it. Not once, as far as I can see. I'm not counting mods trying to tow the company line and smooth the waters. In a business sense this is unprofessional. On a personal level I'm actually quite offended that no one from the development team has even come back to thank us and at least give a brief rundown of why they think they are right and why they have not made any changes based on feedback.[BR][BR]To echo what others have said I don't believe they ever wanted feedback in the first place. All they were spending this time doing is analysing the effect on playing patterns and spending patterns. If that's the case, @InnoGames, in the future please don't have the audacity to ask your players (many of them paying players) to invest what probably amounts to over a thousand cumulative hours in providing feedback that you've asked for if it's only a charade to mask some other process entirely.\t\tClick to expand...This sums up my feelings perfectly. And whether they ask it or not I will not be providing any more feedback on any aspects of the game anymore (events, release notes...) regardless if I think it's good or bad. I'm done wasting my time on that."}, {"75": "So the plan now is what? If tourney performance is a consideration then ...[BR]. place as few expansions as possible and NEVER EVER buy a Premium expansion[BR]. build the minimum number of AWs that actively help with tourney; delete/do not build all others[BR]. do not advance through chapters that will not add reasonable value. or when advancing, consider what other AWs could be deleted to compensate, or other ways to compensate?[BR]. any other hints?[BR][BR]And if Inno thinks this sort of discussion will not be communicated through the player grapevine, not only in forum, they may have another think coming.[BR][BR]Really curious as to how much fallout occurs in the next while ... and at what point it may become clear just what a hideous disincentive to progress the Squad Size calculation really is."}, {"100": "@InnoGames = Hipocresy, falsity, deceit, con....Etc.[BR][BR]- Why do you want us to give you feedback then???????????????????????????????[BR]- Why you made us spend diamonds so at the end of the day it will turn against our cities??????[BR][BR]What a devious company. [BR][BR]I was this near to buy another offer in diamonds so I could buy 2 new premium expansions, a whole pack of keys to have a complete 10 level Brown bear in the past event, but now you don´t get a centime, you get what you give, and if you want to force us buy you more, forget about it.[BR]And I highly recommend to other players: Don´t spend more in this game, cause you´ll end up tricked, and betrayed. [BR][BR]If I stay in this game it is just for my fellows only, cause they are like my family, just for them and to support them in all I can[BR][BR]PD: Moderators,  you don´t have any right to ban me or delete my comment, even if this is not the \"positive\" thing you want, if you do you´ll only be taking out my right of speech."}, {"68": "Verde said:\t\t\tSo the plan now is what? If tourney performance is a consideration then ...[BR]. place as few expansions as possible and NEVER EVER buy a Premium expansion[BR]. build the minimum number of AWs that actively help with tourney; delete/do not build all others[BR]. do not advance through chapters that will not add reasonable value. or when advancing, consider what other AWs could be deleted to compensate, or other ways to compensate?[BR]. any other hints?\t\tClick to expand...and once all that is done, realise that it is no longer a city building game and as such is pointless to carry on with it, so quit and find something better and more rewarding for both time and money!"}, {"84": "On a subject as big and important as this change is i think that the lack of any response from the devs/designers/managers of Elvenar just goes to prove the contempt they have for the players. As long as people keep spending money on the game they will not give a damn what players think or say and will just keep right on treating them like something they wipe off the bottom of their shoes.[BR]It would be nice if we got a statement from them saying why they think it is OK to refuse to comment to concerns on the forum but i know it will never happen, after all we have been complaining about lack of communication for years now."}, {"4": "Timneh said:\t\t\tOn a subject as big and important as this change is i think that the lack of any response from the devs/designers/managers of Elvenar just goes to prove the contempt they have for the players. As long as people keep spending money on the game they will not give a damn what players think or say and will just keep right on treating them like something they wipe off the bottom of their shoes.[BR]It would be nice if we got a statement from them saying why they think it is OK to refuse to comment to concerns on the forum but i know it will never happen, after all we have been complaining about lack of communication for years now.\t\tClick to expand...[BR]As long as staff wages get paid and investors get a dividend every month...."}, {"89": "Alright... so it looks like those changes are final now? If there will be any changes they will be minor ones (like all the changes since the implementation), not adressing the issue most ppl here are criticising?[BR][BR]In that case, thx for the fun years, i'll prepare my fellswship for my leaving now. Have a good time everyone!"}, {"4": "ShadowVision said:\t\t\tAlright... so it looks like those changes are final now? If there will be any changes they will be minor ones (like all the changes since the implementation), not adressing the issue most ppl here are criticising?[BR][BR]In that case, thx for the fun years, i'll prepare my fellswship for my leaving now. Have a good time everyone!\t\tClick to expand...[BR]So sad to see you go, THIS @anonglitch @Rilian @Silmaril @herodite @InnoGames is heartbreaking, Why do they not listen????"}, {"62": "m4rt1n said:\t\t\tAs long as staff wages get paid and investors get a dividend every month....\t\tClick to expand...[BR]well hopefully their income will decrease when this goes to all live servers, wonder if they will listen then?!"}]