[{"4": "Then the world servers will be going crazy next week, seems it is great for most players, an easy Blueprint, which I say now will be nerfed because too many will get it, then the dedicated players leaving in flocks, easy now for newer cities to score more but impossible for late game cities to play many rounds to get kp for AW's that are now detrimental to doing more,so no point in getting extra kp. [BR]So now the devs have created the perfect storm, new small cities can progress fast especially if they buy, medium cities are all amazed at how much better the tourney and game is, and fast ranked using the PP spells, their ranking grows daily as everyone endgame now quits, after years of dedication, this is sadly the story, companies worldwide value new before loyal. [smilie--sprite3]"}, {"62": "But you can only use blueprints on magic residences and workshops (and some crafting recipes). [BR]Excess blueprints equals more magic res/shops purchases. [BR]With the probability of getting one in the spire being so low, this is probably what they are hoping for."}, {"4": "The least @InnoGames could do now is allow teleportation of Aw's, and then maybe a few player will be here for ch17.[BR][BR]I have a total magic of 7 residence and 8 workshops won from the spire not all placed @Thagdal I do admire your optimism, but don't forget crafting, I turn blueprints into RR and have some old relic buildings in my city giving huge pop/culture boosts. The Giant Ice Hagg is my best example."}, {"62": "Dammit, maybe i should play the spire more...only magic res i have is the free one they gave out a year or two ago. [smilie--sprite9]"}, {"17": "lolol I have sooo many blueprints, it's not funny. I went and started the first 10 chest Fellowship as the model is understood today, and for a long time the only magic house was like you Thagdal, the freebie I got when they nerfed my Snowflakes Mountain.  I craft RR spells when I go up a chapter so my Venar Rocks, Cozy Farms, Arches of Triumph, and Spheric Stub all stay current.  I've won another house in Spire in most cities though, but still, I have a lot of unused blueprints.[BR]For me, it's always been about the chase, so like Valle, I will let my sense of adventure lead me onwards [smilie--sprite1]"}, {"54": "m4rt1n said:\t\t\tThe least @InnoGames could do now is allow teleportation of Aw's, and then maybe a few player will be here for ch17.[BR][BR]I have a total magic of 7 residence and 8 workshops won from the spire not all placed @Thagdal I do admire your optimism, but don't forget crafting, I turn blueprints into RR and have some old relic buildings in my city giving huge pop/culture boosts. The Giant Ice Hagg is my best example.\t\tClick to expand...Honestly i personally think i would have like teleporting wonders much more as a fix of the core issues then allowing training in all 3 buildings.[BR]But as far as I understood, its a technical thing that prevents it, so maybe they even wanna do that, but its just not possible..."}, {"33": "m4rt1n said:\t\t\tbut impossible for late game cities to play many rounds to get kp for AW's that are now detrimental to doing more,so no point in getting extra kp.\t\tClick to expand...[BR]I've got 2 late game cities. Both do around 50 provinces. The only thing that might not be sustainable is my using of 2 DAs. Might have to use the equivalence of 2 or 3 UUUs. But thats a later problem.[BR][BR]Compare this to the discussion when spire came out. Then the majority on this forum claimed that it was impossible to do. I coudn't understand that as I could do it since day 1. As people now regulary do spire with 'ease', my only conclusion is that a lot  of people on this forum are afraid to really try. My advice to you is. Try, if you fail try again, don't be afraid of losing goods and troops. If you fail try again, thats the best way to learn."}, {"118": "m4rt1n said:\t\t\tSo now I have to think about deleting Ancient Wonders that I have spent hours, days, weeks, months, years working on to upgrade.[BR][BR]I have 26/30 wonders built now between level 6 and level 18, you tell me please @Silmaril why???[BR][BR]This is so disheartening after years of building my city. [smilie--sprite3]Click to expand...[BR]I did that m4rt1n, I've deleted 3 AWs, a total of 66 lvls, hours and hours spent on levelling them, and how many kps I had to put into them, I'd rather not count... Now I should delete my lvl 32!!! Thrones (yeah yeah I know Thrones is useless it's only about rankings... well I had to prove to someone I could get to the top 10 in Rankings without paying for diamonds, and I did! and now I care for this huge & fat AW)[BR][BR]I loved being an hybrid, (High RP and an efficient military oriented city altogether), now I have a tough choice in front of me, deleting my 32 lvl Thrones as well? [BR]Tell me @Silmaril, @herodite and @anonglitch why should I do that? To play tournaments more easily? So I can get more kps and use them...for? So could you ask higher what is the plan for all those players who have played years and years and have invested in their city and their AWs to be efficient, competitive and powerful, they should what? Delete everything stay where they are and just succumb? [BR][BR]So I can do sacrifices and someone with no understanding of the tournament mechanics comes and do easily and without any effort the same score as me? This has become a pointless game to me, plus as an AM I have a lot of work around it... I only see detriment and no more joy...[BR][BR]Another player AM of a smaller FS who was happy with the changes (of course they can get 10 chests without much effort now) told me that those complaining are the 1%, like the wealthy from the French revolution, which I remind got their head cut off... well, I do feel like this atm, I feel I've been sacrificed.... it's sad that as a society we always tend to service the average and the common and we alienate the exceptional, very very sad..."}, {"65": "valle said:\t\t\tI've got 2 late game cities. Both do around 50 provinces. The only thing that might not be sustainable is my using of 2 DAs. Might have to use the equivalence of 2 or 3 UUUs. But thats a later problem.[BR][BR]Compare this to the discussion when spire came out. Then the majority on this forum claimed that it was impossible to do. I coudn't understand that as I could do it since day 1. As people now regulary do spire with 'ease', my only conclusion is that a lot  of people on this forum are afraid to really try. My advice to you is. Try, if you fail try again, don't be afraid of losing goods and troops. If you fail try again, thats the best way to learn.\t\tClick to expand...[BR]But for what you do that? What is your goal in the game now?[BR]I dont know why play this game anymore.[BR][BR]Spire was different. First, of all, I never complained about that. yes that was unaccustomedly hard, but Inno put there great rewards, and that was a little thing to do besides tourney and prizes from Spire significantly improve results in tourney + magic houses for your city.[BR]Now Spire and tourney no longer support my city. I don't bother to do that just like that."}, {"33": "kurgkurg said:\t\t\tBut for what you do that? What is your goal in the game now?[BR]I dont know why play this game anymore.\t\tClick to expand...[BR]I play it to develop my city. You have been scared of upgrading AWs by reading posts here from other scared people.[BR]I'll continue to play the game just as I did before. The big difference is now I don't have to see tournament as a chore tiring my fingers and mind by repeating tousands of mouse clicks. It's been reduced to about a quarter of what it was before.[BR]So I'll continue to avdvance in techs (waiting for next chapter), continue to add expansions when I can and continue to build up AWs."}, {"7": "m4rt1n said:\t\t\tThen the world servers will be going crazy next week, seems it is great for most players, an easy Blueprint, which I say now will be nerfed because too many will get it, then the dedicated players leaving in flocks, easy now for newer cities to score more but impossible for late game cities to play many rounds to get kp for AW's that are now detrimental to doing more,so no point in getting extra kp.[BR]So now the devs have created the perfect storm, new small cities can progress fast especially if they buy, medium cities are all amazed at how much better the tourney and game is, and fast ranked using the PP spells, their ranking grows daily as everyone endgame now quits, after years of dedication, this is sadly the story, companies worldwide value new before loyal. [smilie--sprite3]Click to expand...It has turned into the standard mobile game. Play for a couple months, maybe spend some money, then lose interest... Which creates great revenue for Inno, but is mighty frustrating for the long term players who get left in the cold. It all went downhill as soon as they introduced the mobile app tbh. They could smell the money rolling in and got greedy real fast.[BR][BR]valle said:\t\t\tYou don't know what you are talking about. (...)\t\tClick to expand...[BR]What an offensive, insulting, and belittling post. The fact that this kind of post gets liked by moderators is even more appalling. But I guess that says it all. We are not taken serious by Inno devs, mods, or any affiliate.[BR][BR]"}, {"118": "valle said:\t\t\tYou have been scared of upgrading AWs by reading posts here from other scared people.[BR]I'll continue to play the game just as I did before. The big difference is now I don't have to see tournament as a chore tiring my fingers and mind by repeating tousands of mouse clicks. It's been reduced to about a quarter of what it was before.\t\tClick to expand...[BR]Good for you but these are just subjective assumptions, you can't possibly know how our experience has been altered by the new format because we don't have the same city specifics to begin with. I am not gonna repeat myself, we are part of the only FS achieving 19 chests in Arendyll, the majority of us were doing 15-20k before it each, we are still doing pretty decent scores but how? Yes less clicks for one province but way more manual fighting than before, which is a great downgrade .. If I don't go manually I pretty much don't have enough troops for the whole 6 rounds, I had 498 AW lvls and now 429, which is still heavy..(5159 SSS as per calculation) /  I don't have time to do the tournaments manually and I run the top tournament FS of Arendyll which whole focus and strategy is based on tournaments, so I pretty much have to..[BR][BR]You are one isolated case of someone who is lucky to have found a balance in his city, and again yay good for you, but the odds this happens to others cities like mine are very thin and hard to achieve (at least a lot of sacrifice has to be put into it which is unfair and not fun ... Are we talking about a game or work???)."}, {"14": "kurgkurg said:\t\t\tBut for what you do that? What is your goal in the game now?[BR]I dont know why play this game anymore.\t\tClick to expand...[BR]There is no point in responding to him. He is responding from his own perspective only, whereas any other city might suffer a great deal more from this change, and ignoring the fact that we are now getting punished for growing a city and buying PREMIUM expansions, when the progressive benefit of expansions gets lower with each one you buy. Not to mention ignoring the fact that several AW's are now simply negative to have and should never be built if one is interested in attaining a decent score in the tournament.[BR][BR]It's tunnel vision on his part, nothing more.[BR][BR]Edit: when I wrote this, Kaliartis got in before me. So yeah, what he said [smilie--sprite1]"}, {"65": "valle said:\t\t\tI play it to develop my city.\t\tClick to expand...a little controversial, now you're talking about developing a city, but you used to brag about making a tournament. You don't need to make any more tournaments to develop a city, you can't make much profit for your city of it, especially you don't need to make 50 provinces. yes of course you can do both, but you can't combine them in the sense that if your goal is to be the best in the tournament, you can't develop a city, and if you want to develop a city, you have to accept a harder tournament that won't help you develop a city. Nothing to scare here, just bad choices."}, {"118": "C-Nymph said:\t\t\tWhat an offensive, insulting, and belittling post. The fact that this kind of post gets liked by moderators is even more appalling. But I guess that says it all. We are not taken serious by Inno devs, mods, or any affiliate.[BR][BR]View attachment 4834Click to expand...[BR]Ah!!! I missed that! How a mod (who is supposedly impartial and should promote peaceful and respectful discussion) can support and like this kind of offensive language?[BR]Also there is a difference between not knowing / having no news and staying silent and not knowing / having no news but still responding and trying to acknowledge the present issues and situation and to show compassion as players towards other players... Cause I am sorry but I haven't felt any kind of consideration from the majority of the forum representatives so far..."}, {"8": "valle said:\t\t\tmy only conclusion is that a lot  of people on this forum are afraid to really try. My advice to you is. Try, if you fail try again, don't be afraid of losing goods and troops. If you fail try again, thats the best way to learn.\t\tClick to expand...[BR]Hey @valle, I have to take exception to your post. The fact that you are good with the new tournaments is fine but because a lot of longer playing gamers who have posted here that they do not like the new tournament and many have stated very clearly that the formula being used is detrimental to not only their cities, but to the game, does not mean they are behaving like spoilt children, quite the opposite in fact, we were asked for feedback, then clearly ignored and that's incredibly ignorant of @InnoGames but you may be happy with ignorant.[BR]I would suggest had players not posted at all, there wouldn't even have been minor tweaks.[BR][BR]I'm of the opinion that any decent developer would/should be happy to explain their work/changes to those who are using thier product, much like they should be able to explain why some suggestions, as nice as they might sound, may not be possible to implement.[BR]@InnoGames clearly do not allow communication with it's users, which makes them an untrustworthy company in my opinion.[BR][BR]I personally think players have every right to be angry with @InnoGames - after paying, playing and supporting this game, some for quite a few years and get ZERO communication back from anyone other then the forum mods, who can only tell us what they are being told.[BR][BR]So @valle whilst you might like the new tournaments, resorting to insulting those that don't is very unbecoming.......and erm, childlike (spoilt or otherwise).  [smilie--sprite2][BR][BR]@anonglitch - I'm not sure liking posts that insult other players is a wise move, you aren't doing yourself any favours....and this is from someone who wishes you well in your role as mod. [smilie--sprite2]"}, {"22": "C-Nymph said:\t\t\tWhat an offensive, insulting, and belittling post. The fact that this kind of post gets liked by moderators is even more appalling. But I guess that says it all. We are not taken serious by Inno devs, mods, or any affiliate.\t\tClick to expand...Kaliartis said:\t\t\tAh!!! I missed that! How a mod (who is supposedly impartial and should promote peaceful and respectful discussion) can support and like this kind of offensive language?\t\tClick to expand...Yes, I agree with both."}, {"22": "This just in from Marindor on Beta:[BR][BR]Marindor said:\t\t\tAs you know, last week some alterations have been made to the battle difficulty of certain provinces. Since the original Beta release, several changes have been made (including bringing back flavor by making chances for certain units higher according to the type of tournament, splitting the training queues of units, changes to the battle difficulty at several times, reduction of premium expansion impact in the difficulty calculation etc).[BR]Other than that, the Tournaments are now performing as expected, so the game team feels confident to release them on Live in their current state. That doesn't mean it's impossible that changes can still be made, since markets can be different as well, but it seems that everything is now working as intended and analytics are currently showing the expected results.\t\tClick to expand..."}, {"25": "valle said:\t\t\tYou don't know what you are talking about. I've got 2 late game cities. Both do around 50 provinces. The only thing that might not be sustainable is my using of 2 DAs. Might have to use the equivalence of 2 or 3 UUUs. But thats a later problem.\t\tClick to expand...Late game cities are a matter of opinion and may have absolutely nothing in common with a city that has finished Chapter 16.  I had a player in my fellowship that was certain that he was a big player and answered every question, usually with the wrong answer.  People started prefacing their questions with \"Can someone in the later chapters tell me ... \" and he would still answer.  He was in Dwarves.  He is no longer with us."}, {"75": "Kaliartis said:\t\t\tAh!!! I missed that! How a mod (who is supposedly impartial and should promote peaceful and respectful discussion) can support and like this kind of offensive language?\t\tClick to expand...Wish we could put a mod on ignore ...."}]