[{"73": "valle said:\t\t\tBefore tournament came to Elvenar people actually played the game. That game is still there. The tournament made it possible for people to rush the game, then they start complaining that there is nothing to do when waiting for new chapter. Parhaps it's better to slow the game down a bit. Then you don't need to sit and wait for new chapters.\t\tClick to expand...It’s not that there are other ways to play the game and/or cope with it. [BR]People have spent money and time towards a goal (expansions + events) and now what they’ve worked for is whisked from under their feet. [BR]And they don’t like it. [BR][BR]Though I Appreciate you telling us that we can still do other things in the game : but we do know of it already."}, {"2": "@valle - I never complained for not having a new ch. after 3 months. I like the break between chapters, I have time to reorganize the city, do upgrades, use Wells and Genies which otherwise never have place ... and TOURNAMENTS!  I truly like the break, give me the opportunity to play more casual.[BR]The tournaments become what they (still) are because Inno decided so. We didn't make them more important, Inno did."}, {"33": "JollyElf said:\t\t\tIt’s not that there are other ways to play the game and/or cope with it.[BR]People have spent money and time towards a goal (expansions + events) and now what they’ve worked for is whisked from under their feet.[BR]And they don’t like it.\t\tClick to expand...[BR]What did those people say when tournament was introduced. Then they probably had payed for cities that were adapted for playing without tournament, then all their investments were undone by tournament. Do you here how it sounds?   Instead of complaining, see it as a chance to redesign your city to cope with the new wnvironment. Adapting and developing your city is what this game is about. Some building get obsolete and new ones are built. Nothing new with that. And that also holds true for AWs. Once I built Enar's Embassy. Some mana and extra rune shards probably sounded good at the time, but after some time I realised it wasn't worth the space so it's gone now. But should -Inno change something that made it good I wouldn't hesitate to build it again. It's not impossible taht 1 or 2 AWs will be sold now, but it also means that those AWs already before probably wasn't worth the space they took. I just need a good reason to sell them. But once sold I don't think I'll miss them.[BR][BR]JollyElf said:\t\t\tThough I Appreciate you telling us that we can still do other things in the game : but we do know of it already.\t\tClick to expand...When reading posts here it certainly sounds like some people think that only the Tournament is what matters in this game."}, {"33": "Alcaro said:\t\t\tThe tournaments become what they (still) are because Inno decided so. We didn't make them more important, Inno did.\t\tClick to expand...[BR]From the beginning the tournament wasn't this massive source of kp. I think that Inno realised that a lot of other changes in the game has made tournament giving away far to much kp. Probably by mistake or 'didn't think about consequences'.  Time instants are the main reason as by using them you can create troops on demand. Earlier you could only produce that many troops every week, so it was impossible to do that many tournament provinces as you run out of troops.[BR][BR]Now Inno tries to repair the damage. Of course it could be done in other ways like removing time instants and nerfing brown bears but then people would scream about that. Not easy to make everybody happy."}, {"84": "valle said:\t\t\tBut with less kp from tournament you will need more time to do new chapters. So the time waiting for next chapter will be reduced.\t\tClick to expand...[BR]You can't compare the way things are now to the way they will be after the changes are introduced. A lot of end game players say that for them tournaments are the game while waiting for new chapters. After the changes that might be different.[BR][BR]I think the game might become very boring for players in chapter 16 when they have to spend over a week gaining KP to complete a single research that needs over 200 KP."}, {"73": "valle said:\t\t\tWhen reading posts here it certainly sounds like some people think that only the Tournament is what matters in this game.\t\tClick to expand...They have a right to think that. As you to think about your game [smilie--sprite2]"}, {"73": "valle said:\t\t\tWhat did those people say when tournament was introduced. Then they probably had payed for cities that were adapted for playing without tournament,\t\tClick to expand...Everyone has a right to opinion. As those, so here. [BR]And good to have opinions and feedback than sheep like docility. Actually forum exists to hear out of the box opinions and feedback."}, {"33": "JollyElf said:\t\t\tEveryone has a right to opinion. As those, so here.[BR]And good to have opinions and feedback than sheep like docility. Actually forum exists to hear out of the box opinions and feedback.\t\tClick to expand...[BR]I've got no problems with different views on things. But from the sound of your reply you seems to have some problems with my view [smilie--sprite2][BR]And about that box it seems most in this thread writes mostly the same view on the subject, almost only me who have another view. So who is inside or outside the box [smilie--sprite2]"}, {"73": "valle said:\t\t\tI've got no problems with different views on things. But from the sound of your reply you seems to have some problems with my view [smilie--sprite2][BR]And about that box it seems most in this thread writes mostly the same view on the subject, almost only me who have another view. So who is inside or outside the box [smilie--sprite2]Click to expand...I like diverse views as long as you don’t ask others to view like you. [BR]I guess our job here is only to present personal feedback. Not ask others to view this way and play that way. And if most of the thread has some inside the box [smilie--sprite2] view then there is weightage and emotions invested in that direction."}, {"4": "I'm going in fairly blind to the new tourney changes, and will give more detailed feedback later.[BR][BR]As for prep, to give it a shot, I have around 80-100 squads of each type across the 3 different troop producing camps.[BR][BR]Am I right to assume that planks will be weighted still so that the most troop type needed will be LR and HR?"}, {"22": "m4rt1n said:\t\t\tAm I right to assume that planks will be weighted still so that the most troop type needed will be LR and HR?\t\tClick to expand...Yeah, the bias should be towards the enemies you used to face in each tournament type, but it's very hit and miss. Mistwalkers are everywhere."}, {"24": "Pauly7 said:\t\t\tYeah, the bias should be towards the enemies you used to face in each tournament type, but it's very hit and miss. Mistwalkers are everywhere.\t\tClick to expand...[BR]Really did they say that?[BR][BR]All i know is they said LM and HM in silk and that is not what it used to be (LM main unit and HR/Mage)"}, {"22": "Gargon667 said:\t\t\tReally did they say that?[BR][BR]All i know is they said LM and HM in silk and that is not what it used to be (LM main unit and HR/Mage)\t\tClick to expand...I can't remember the words. It usually goes over my head if they mention enemy types because I concern myself with my own troops and which are effective. It's hard to explain, but I remember what they all look like without looking at what their names are. When it first started out it was just random (always five enemies, always five different ones). Now it's a little different. In the steel tournament, for example, I could use my LR ranged troops almost half the time.[BR][BR]The only enemy type I usually remember are Mistwalkers as they're the bane of my life... and they seem to be everywhere in every tournament."}, {"4": "Pauly7 said:\t\t\tI can't remember the words. It usually goes over my head if they mention enemy types because I concern myself with my own troops and which are effective. It's hard to explain, but I remember what they all look like without looking at what their names are. When it first started out it was just random (always five enemies, always five different ones). Now it's a little different. In the steel tournament, for example, I could use my LR ranged troops almost half the time.[BR][BR]The only enemy type I usually remember are Mistwalkers as they're the bane of my life... and they seem to be everywhere in every tournament.\t\tClick to expand...[BR]Weighted even if only slightly makes it possible. As a player who does currently 30 provinces weekly and up to 70 provinces on special occasions the increase looks better than thought on the upper provinces attempted. Looking 10k will still be possible with 2xDA and 4x ELR for a special. [smilie--sprite1]"}, {"22": "It's quite tricky to figure out in my head (especially when my head doesn't want to track things with precision). In the Gems and Marble tournaments, for example, I could go through a whole round of 9, 10, 11 provinces (my city is ch. 5) and it would seem utterly random all the way through. So I would even up my troops a little and then in the next round I would need to use Mages on every encounter. I guess the problem is that it's hard to spot the variable trends when you're working with so few encounters. In those two tournaments, though, I definitely used more Mages than anything else, which is what I would've expected from the old style. Like I say, it's very hit and miss.[BR][BR]All I know is that at my level on Beta I hit a very definite wall on about the 11th or 12th province. I can usually go through 6 rounds of 10 with my eyes closed, but if I try to push to 13 I find my troops wiped out by the third round."}, {"33": "JollyElf said:\t\t\tI guess our job here is only to present personal feedback.\t\tClick to expand...It's hard to give feedback until it goes live. So until then we are just discussing/speculating/guessing."}, {"25": "valle said:\t\t\tuntil then we are just discussing/speculating/guessing\t\tClick to expand...I'm in Beta, so I'm neither speculating, nor am I guessing. It's been brutal. I'm also in Chapter 16, both here and in Beta.  I happen to love to finish a chapter well before another comes out. I get to participate in events, which can't happen with the huge settlement taking up the last corner of space.  I get to rearrange and get rid of the old and bring in the new culture items.  [BR][BR]Finishing a large chapter feels to me like summer vacation after completing another grade in school.  I hate to imagine the burn out feeling of facing another chapter without time off, but that's what I might be up against now.  It changes the game for me in a very negative way.  I need over 200 kp each for the remaining techs.  It used to be doable.[BR][BR]The thing that's very scary to me is that my city in Beta is nowhere near as large as my city here in Winyandor. The Beta city has very few AW's (or anything else) in comparison to my live city.  I don't purchase diamonds there because they are never on sale in Beta, but I have several expansions in Winyandor.  I can barely fight my way out the door in Beta, and I'm expecting to be completely chained here.  [BR][BR]I play games to have fun.  The new tournaments I've endured in Beta are not fun.  They're easier for the smaller players, but definitely not so for the end game players.  All I did was rebuild troops constantly.  I can't imagine what will happen when this monstrosity hits my big city."}, {"33": "Maillie said:\t\t\tI'm in Beta, so I'm neither speculating, nor am I guessing.\t\tClick to expand...[BR]Actually you are speculating or guessing a bit. Reason is that we don't know if the version that comes live to EN this week is exactly the same a the one running on Beta. Inno might do some last minutes changing to difficulty calculations, and we don't know if they will do that. It has happened before that live versions have changed since they run on Beta."}, {"85": "After following here for quite a bit and noticing the absence of dev's to come and comfort the stresses, I can only conclude truth in these concerns. As for a business model making money off diamonds I have invested quite a bit. many times more than what I have ever needed to pay for the competitors in the gaming industry. Do they even take note of the fact that if I should walk away I can easily afford 5 to 6 games of their competitors? But I have stuck with this game as I did make friends on it and would love to stay. BUT, the way things are going currently in this game, I see changes and with every move, see the specials pop up for buying diamonds, forming a link to it. I get the idea that a team is sitting somewhere being tasked to make profits, come hell or high water, even at the expense of losing clients(us).[BR]So I do hope at least that they are reading this if they continue to evade coming in to the rescue on the thread. If this continues, loads more will leave here, and so will I to join their competition and spend my hard earned money elsewhere."}, {"22": "Se7en69 said:\t\t\tSo I do hope at least that they are reading this if they continue to evade coming in to the rescue on the thread. If this continues, loads more will leave here, and so will I to join their competition and spend my hard earned money elsewhere.\t\tClick to expand...Sadly it's very rare that we have any involvement from anyone on the Elvenar team on any thread on the EN forum. With a thread such as this one where they have specifically asked for feedback you would hope that this stuff is at least being passed back to the development team, though I'm not certain what difference it will make.[BR][BR]On the Beta forum there is a lot more interaction, but when it reached to the point where there were many hundreds of negative comments they simply said \"well, the people on this forum aren't representative of the player base\". I often get the feeling they only really want to hear feedback if it's positive. If it isn't then they're just going to do what they wanted to do anyway."}]