[{"25": "Killiak said:\t\t\t\"Working as intended\"\t\tClick to expand...It was \"working as intended\" the day it came here.  It was pretty much set in stone the day it came here.  It was only going to receive minor tweaks the day it came here.  There is nothing surprising to me about this announcement."}, {"118": "Maillie said:Late game cities are a matter of opinion and may have absolutely nothing in common with a city that has finished Chapter 16.  I had a player in my fellowship that was certain that he was a big player and answered every question, usually with the wrong answer.  People started prefacing their questions with \"Can someone in the later chapters tell me ... \" and he would still answer.  He was in Dwarves.  He is no longer with us.\t\tClick to expand...[BR]Hehe [smilie--sprite7]"}, {"118": "Pauly7 said:\t\t\tThis just in from Marindor on Beta:\t\tClick to expand...[BR]W.O.W! M'kay...."}, {"7": "Maillie said:\t\t\tIt was \"working as intended\" the day it came here.  It was pretty much set in stone the day it came here.  It was only going to receive minor tweaks the day it came here.  There is nothing surprising to me about this announcement.\t\tClick to expand...[BR]It was already set in stone the day it was released on beta..."}, {"118": "C-Nymph said:\t\t\tIt was almost set in stone the day it was released on beta...\t\tClick to expand...[BR]The wool over the eyes from the very beginning..."}, {"33": "kurgkurg said:\t\t\ta little controversial, now you're talking about developing a city, but you used to brag about making a tournament. You don't need to make any more tournaments to develop a city, you can't make much profit for your city of it, especially you don't need to make 50 provinces. yes of course you can do both, but you can't combine them in the sense that if your goal is to be the best in the tournament, you can't develop a city, and if you want to develop a city, you have to accept a harder tournament that won't help you develop a city. Nothing to scare here, just bad choices.\t\tClick to expand...[BR]??? By doing about 50 provinces I'll get a lot of kp. That kp I use to upgrade AWs. Upgrading AWs is developing the city according to me. And if the tournament get a little bit harder from the upgraded AWs is no great concern for me as I expect to earn more benefits from upgrading them. So don't worry to much about it."}, {"33": "OldHag said:\t\t\tSo @valle whilst you might like the new tournaments, resorting to insulting those that don't is very unbecoming.......and erm, childlike (spoilt or otherwise). [smilie--sprite2]Click to expand...[BR]Insulting? I only comment to the fact that several posters write like \"If you don't do like I want, I'll quit the game\""}, {"84": "That post  from Marindor just reinforces my belief that the feedback was a waste of time and all the devs were interested in was the data."}, {"33": "Maillie said:Late game cities are a matter of opinion and may have absolutely nothing in common with a city that has finished Chapter 16.  I had a player in my fellowship that was certain that he was a big player and answered every question, usually with the wrong answer.  People started prefacing their questions with \"Can someone in the later chapters tell me ... \" and he would still answer.  He was in Dwarves.  He is no longer with us.\t\tClick to expand...[BR]I thought I was clear, but obviously not. Both my cities are at the end of the tech tree, so no dwarves or whatever you thought [smilie--sprite2]"}, {"14": "Wish the devs were as active in communicating with us, as the mods are right now with moderating this thread."}, {"45": "Guys please can we remember to be polite to each other. I appreciate that this subject is very close to a lot of hearts, but please can we all adhere to the Forum Rules - thank you"}, {"84": "Killiak said:\t\t\tWish the devs were as active in communicating with us, as the mods are right now with moderating this thread.\t\tClick to expand...[BR]It would be nice if the devs would communicate with us."}, {"7": "Timneh said:\t\t\tIt would be nice if the devs would communicate with us.\t\tClick to expand...Oh but zey do. Haven't you seen all zose lovely YouTube videos zey make? Zey even take time to do Q und A's [smilie--sprite2]"}, {"118": "Ah brilliant! by deleting my post dear mods you just proved my point.. you don't care about freedom of speech and rightful opinion, you just stay silent and just delete the threads in the background ... What did I say that was so offensive? I'd like you to elaborate because citing the forum rules without context doesn't do it sorry.[BR][BR]PS: should I take a screenshot?"}, {"45": "@Kaliartis Please read the reason for the deletion. To elaboate, unfortunately you had cited a comment here from another player who had  breached the  Forum Rules. Therefore as that had already been deleted we could not permit you to also then commit the same rule break.[BR][BR]We are more than happy for our players to discuss here in a friendly manner, but please stay within the Forum Rules."}, {"84": "Silmaril said:\t\t\tGuys please can we remember to be polite to each other. I appreciate that this subject is very close to a lot of hearts, but please can we all adhere to the Forum Rules - thank you\t\tClick to expand...[BR]To be honest @Silmaril it doesn't help keep the harmony when one of your mods gives a like to a rude and offensive post."}, {"14": "Silmaril said:\t\t\tWe are more than happy for our players to discuss here in a friendly manner, but please stay within the Forum Rules.\t\tClick to expand...[BR]A friendly manner is all we have, it seems, as any constructive feedback is consistently ignored.[BR]Might as well have discussions about knitting and sewing patterns."}, {"89": "valle said:\t\t\tInsulting? I only comment to the fact that several posters write like \"If you don't do like I want, I'll quit the game\"[BR]That sounds like spoiled children for me.\t\tClick to expand...[BR]So i'm a spoiled kid because i'm leaving now because of those changes? Leaving a game that doesn't makes fun/sense anymore, because i see a huge issue with the formula used in tourneys, is childish?[BR][BR]I'm okay with the fact that you like everything about the new changes and i'm also fine that you want to adapt to those changes. If that's still fun for you, go for it.[BR][BR]For me, those changes have a big impact on a core part of the game that was fun for me. I liked to build/expand how i like, without any negative consequences. I had \"fun\" by building things that are not that useful (like the bell towers) by buying expansions i only used for that stuff. Now that fun-part of my city has negative consequences and if i want to take part at the tourneys efficiently, i have to get rid of that fun part, dedicating it all to the tourney.[BR][BR]Ofc i could just continue like i did before, but knowing the fact that i get penalized for \"fun\" i wasn't penalized before, for reasons i don't see the need for, is just off my mind. I'm playing games for fun, if the fun part is gone (or penalized), i stop playing. I don't see the childish thing there, it's just a simple actions -> consequences thing."}, {"27": "lol, the content of this thread keeps changing every time I come here today.[BR][BR]This whole feedback thread was a big fail in my opinion. Well, as we discussed with our kids today (on an unrelated topic): “Fool me once, shame on you. Fool me twice, shame on me.“ The only feedback Inno wanted was the data they got from their game analytics tools. I’ll try to remember that next time Inno comes with radical changes and asks for feedback.[BR][BR]PS:[BR]valle said:\t\t\tI thought I was clear, but obviously not. Both my cities are at the end of the tech tree, so no dwarves or whatever you thought [smilie--sprite2]Click to expand...You might want to read again the post you quoted ...[BR]EDIT: hmm, or maybe I’m just projecting; and it can’t be interpreted how I do. After all English is not my first language."}, {"65": "ShadowVision said:\t\t\tFor me, those changes have a big impact on a core part of the game that was fun for me. I liked to build/expand how i like, without any negative consequences. I had \"fun\" by building things that are not that useful (like the bell towers) by buying expansions i only used for that stuff. Now that fun-part of my city has negative consequences and if i want to take part at the tourneys efficiently, i have to get rid of that fun part, dedicating it all to the tourney.\t\tClick to expand...maybe your wish to build a beautiful and useless city part was one of that \"unfavorable strategies, which we are aware were caused by flaws of the old Tournaments system\""}]