[{"30": "Pauly7 said:\t\t\tThis just in from Marindor on Beta:\t\tClick to expand...This means it is final. I am disappointed not because our suggestions are not considered. The way the mods and devs treated us, customers.  [smilie--sprite3]"}, {"89": "kurgkurg said:\t\t\t...\t\tClick to expand...[BR]I know where you are trying to go there, and i like that sarcastic side node... but no. But this part is something they kill in the favor of balancing stuff, that is there to \"unbalance\" things, like having more expansions than someone else or having ridiculous amounts of AW upgrades. The reason of existence of that stuff is to improve your standing, not to make it worse.[BR][BR]I don't see the reason why i should have to send in 30% more troops or 30% more goods/mana/etc. into the very same fight as a fellow within the very same chapter, only because i improved my city more as he/she did. This percentage is only a current example, but it's far from the maximum \"worsening\" possible."}, {"68": "ShadowVision said:\t\t\tI don't see the reason why i should have to send in 30% more troops or 30% more goods/mana/etc. into the very same fight as a fellow within the very same chapter, only because i improved my city more as he/she did. This percentage is only a current example, but it's far from the maximum \"worsening\" possible.\t\tClick to expand...This^^[BR][BR]Why would anybody who is in the same chapter because they skipped through the techs using PP but not having the same AW levels, city development etc as somebody who has taken their time expect to get a better tournament result?[BR][BR]Its just plain wrong!"}, {"65": "Piglets For All said:\t\t\tThis^^[BR][BR]Why would anybody who is in the same chapter because they skipped through the techs using PP but not having the same AW levels, city development etc as somebody who has taken their time expect to get a better tournament result?[BR][BR]Its just plain wrong!\t\tClick to expand...[BR]Btw I'm just that one who \"skipped through the techs using PP but not having the same AW levels\" and I am therefore in a much better position than those playing longer, but I don't like this perspective at all, this takes of my reason and interest for getting better, to do more AW levels and enjoy my city now when I have finished research. [BR]from me just suddenly cut off any chance of further development"}, {"89": "Piglets For All said:\t\t\tIts just plain wrong!\t\tClick to expand...[BR]It's especially plain wrong if you fight into higher tourney-provinces where 30% mean dozens or hundrets of additional needed squads that you won't train magically that much faster as that other player. With each additional round/provine done, those 30% will have an increasing effect in difference.[BR][BR]For example (with those 30% difference):[BR][BR]Barracks production 69.000 units / day, including the 62.5% training bonus of my lvl 17 needles.[BR][BR]Base squad size at prov. 1 = 496 vs 347,2 but you have to calculate that *5, as you'll send in 5 squads. So It's 2480 vs 1736 = 744 units difference. Fighting up to province 15 (1 star) i have to send in 89.223 units more as this other player.[BR][BR](EDIT: Ofc. you would only need those troops additionally if you would always trade in all the troops for a win. But you'll most likely lose a big amount of units in the later provinces and then this difference will have a huge impact.)[BR][BR]At day 1 with 15 first * provinces i need 130% of my daily troops production additionally compared to that player.[BR]At day 1 with 20 first * provinces i need 226% of my daily troops production additionally compared to that player.[BR]At day 1 with 25 first * provinces i need 350% of my daily troops production additionally compared to that player.[BR]At day 1 with 30 first * provinces i need 500% of my daily troops production additionally compared to that player.[BR][BR]Show me that ancient wonder, that would compensate that. And it wouldn't only cost the training-time itself, but also the tools usage will increase.[BR][BR]Same of that counts for goods/tools/etc. in terms of negotiation. Just some quick example for that, assuming we negotiate each province and each is asking for 3 things and those 3 things are always tools + T1 goods + mana.[BR][BR]I have:[BR]- 5 lvl 32 workshops producing each ~14080 tools / 3 h and 24310 tools / 9h including 170% culture bonus. (1x9h + 5x3h)*5 + 6x 90.250 tools from my lvl 12 PP + 1x 266.000 tools from my lvl 8 EE  = 1.281.050 tools / d.[BR]- 3 lvl 25 T1 factories producing ~3230 goods / 3h and 5930 goods / 9h including relics and MH bonus. (1x9h + 5x3)*3 = 66240 T1 goods each day.[BR]- I produce something around 120.000 mana each day.[BR][BR]Based on numbers of prov. 1, starting at = 13.000 vs 9.100 tools, 1.600 vs 1.120 goods, 2.600 vs 1.820 mana. (Note: My calculations are not fully precise, as there is some \"tiered\" system used, and the real numbers would be vs 8.900 tools, 1.100 goods and 1.800 mana, so the real difference would be even worse in that case.)[BR][BR]BIG EDIT: There was a huge flaw in my calculations, so all the old very high xxx% values below were wrong. Sorry for that! It's now corrected.[BR][BR]At day 1 with 15 first * provinces i need 36% tools, 18% goods and 77% mana of my daily production additionally compared to that player.[BR]At day 1 with 20 first * provinces i need 63% tools, 31% goods and 134% mana of my daily production additionally compared to that player.[BR]At day 1 with 25 first * provinces i need 97% tools, 48% goods and 208% mana of my daily production additionally compared to that player.[BR]At day 1 with 30 first * provinces i need 139% tools, 68% goods and 298% mana of my daily production additionally compared to that player.[BR][BR]Of course you can't apply that tools, t1 and mana example exactly to the \"normal situation\", as negotiation trades will be more diverse, but i think it still shows the existing issue with that whole thing.[BR][BR]And because of what? A few dozen of AW levels and ~20 additional expansions (mostly premium ones). The further you go, the more penalized you'll be as a \"more advanced\" player compared to someone within the same chapter.[BR][BR]PS: Thanks @MinMax Gamer for the tourney calculations sheet. Without that it would've been much harder to gather any numbers.[BR][BR]EDIT: Re-calculated my tools numbers, as i forgot to include my PP + EE. And added the base values to the negotiation part."}, {"32": "sail0r said:\t\t\tI say again. Think of it like the golf handicap. You play together with your buddy a game of golf. In the 18 holes you play perfect and score a 72. Your buddy, not as good as you scores an 82. Then he applies his handicap and he wins. Is that fair? It's not, but if he didn't have his handicap he would never have a chance to beat you and stop playing with you. And I have never heard of anybody complaining about the golf handicap.[BR]Thank you for your time.\t\tClick to expand...A handicap is fine as long as it's within reason, I do not think anyone would have an issue with the staggering so that every player in each chapter could have a meaningfull experience.[BR][BR]But when you give tiger woods a handicap op 1000, then it just becomes silly.[BR]And thats the issue with this implementation.[BR][BR]Give him a handicap of 20 agains me and he will still win easily from me, but I am no golfer so I have no clue how many more bonus rounds I need to have a fun match agains mr woods.[BR]But I am sure that if the handicap is 100 or 1000 it's no longer a match and I will always win no matter what."}, {"7": "ShadowVision said:\t\t\tIt's especially plain wrong if you fight into higher tourney-provinces where 30% mean dozens or hundrets of additional needed squads that you won't train magically that much faster as that other player. With each additional round/provine done, those 30% will have an increasing effect in difference. (...) [BR]Show me that ancient wonder, that would compensate that. (...) [BR]And because of what? A few dozen of AW levels and ~20 additional expansions (mostly premium ones). The further you go, the more penalized you'll be as a \"more advanced\" player compared to someone within the SAME CHAPTER.\t\tClick to expand...Exactly. The penalties for having AWs and expansions get multiplied, the so called benefits of having those AWs and expansions do not."}, {"89": "C-Nymph said:\t\t\tExactly. The penalties for having AWs and expansions get multiplied, the so called benefits of having those AWs and expansions do not.\t\tClick to expand...Yep, considering that the devs describe that as \"working as intended\" is waaaaay above my mind. [Removed some unappropriate stuff] - It's pretty hard to remain civilized..."}, {"76": "Well its as I expected, no meaningful change has been made and its going out to all servers.[BR]With chapter 16 having very little to boost my city I was already staying put and I will continue to unless something amazing happens in chapter 17. But I admit I don't know how long I will last as with nothing to build, doing tournaments and chatting with my fellowship was what kept me coming back everyday. I've already had days where I didn't come on since these changes came which wouldn't have occurred before, so I suspect my activity will go into a slow decline before one day I just never come back to elvenar.[BR]Its sad to see the way the is game going, when its been such a big part of my life for these last 3 years."}, {"22": "pompeywolf said:\t\t\tWith chapter 16 having very little to boost my city I was already staying put and I will continue to unless something amazing happens in chapter 17.\t\tClick to expand...Not to dash your hopes, but nothing exciting is happening in chapter 17."}, {"76": "I know @Pauly7 but we need to have some hope in these times to keep us playing."}, {"22": "Well, the positive slant, in that case... The KP requirements are less in chapter 17.  [smilie--sprite1]"}, {"57": "I am about place 1700 on the EN server. I have gone up 300 places in the last 2 or 3 weeks ... but I am not aggressively expanding at the moment. I have looked at the 60 pages of players ahead of me. Very few pages have a full set of players in fellowships ( I am surmising that this is an indication that players have left the game). Most pages have 2 or more 'dead' players. I have done this activity before and I cannot recall anywhere near the number of inactive players I am seeing now. [BR]Is this an indication that the tournament changes are currently killing off top end players?[BR]Anybody know if we can find out numbers that have left in EN over the last 4 weeks?"}, {"15": "Killiak said:\t\t\tMight as well have discussions about knitting and sewing patterns.\t\tClick to expand...Funny you should mention this, you reminded me of a little story that sort of relates to this  [smilie--sprite8][BR][BR]I apologise because this is going to be a bit off topic and long but I think you'll see my point.[BR][BR]There is this big worldwide online knitting and crochet community I'm part of for many years now. It's one of the biggest around, the biggest I know of anyway. The site has forums, an e-shop, a pattern/project/yarn library, many various tools to help aspiring knitters/crocheters....[BR]Anyway, every time there is a new feature added/removed/changed, there is an announcement about it and not just when it becomes available. The devs keep the community informed on all that's being developed, on when they think it's going to be released, on why they are introducing that particular change etc... And yes, I said the devs, they write that personally, the mods have nothing to do with it, they just moderate the forums, run completions and other activities and since people usually don't get into a fight over who has knitted the best blue jumper or who sold more patterns this week the mods really have it easy there, haha.[BR][BR]A few months ago the whole site got a big overhaul because the devs wanted a different, more modern look for it. Turns out half of the community liked it and the other half not at all.  In fact they complained that it was horrible because it was very hard on the eyes, especially for people with reading disabilities, poor eyesight, wearing glasses etc. And obviously some just didn't like the new aesthetics.[BR]What happened is that first the devs apologised for not foreseeing the problems their new design might cause to some people. They made several very long posts about both the reasons why they decided to change the site and about the problems they admit they have caused and how they were panning to try to solve them. Then they made a toggle button that allowed users to switch back to the old look if they wanted until they solve the situation. Then they made a feedback thread + survey that anyone who wanted could fill by just clicking on a link on the homepage.[BR]Obviously the devs didn't want to give up on their new site but they didn't want to see half of the community dissatisfied so based on the feedback they started working on an alternative option and currently there are 2 new \"skins\" to choose from and you can still use the old format if you prefer and they are still working to try to find a more modern design that would please everyone.[BR][BR]There was also an incident where one of the devs was rude to some people and another dev stepped in, apologised for his colleague, said the first dev had some personal issues that made him currently unfit to interact with the community and that they've restricted his access to the forum, e-mails and social media and that from now on he will only do what he does best - code. (honestly they used this kind of very harsh language, I felt a bit sorry for the guy - I imagine him sitting in a gloomy corner, chained to a computer with no internet access now [smilie--sprite8]- although I don't know exactly what happened so maybe he deserved it).[BR][BR]So all this just as an example of a company that works completely differently and makes the whole community experience much more satisfying  [smilie--sprite1]"}, {"47": "ShadowVision said:\t\t\tOfc i could just continue like i did before, but knowing the fact that i get penalized for \"fun\" i wasn't penalized before, for reasons i don't see the need for, is just off my mind. I'm playing games for fun, if the fun part is gone (or penalized), i stop playing. I don't see the childish thing there, it's just a simple actions -> consequences thing.\t\tClick to expand...[BR]Can you tell me what was fun about endlessly clicking the same units over and over? For me, the new tournament system means a new challenge. The old one was very tiring and I was already considering leaving the game."}, {"89": "arnwald said:\t\t\t...\t\tClick to expand...[BR]Could you tell me where i'm talking about that endless clicking was fun? That's the thing this new system does right, it made it less tedious with the 1 click solution. I'm also okay with the adjustments regarding more mixed unit types. I'm also okay with making the tourney a bit more difficult the further you get (in terms of provinces), as the old one was a bit too softcapped. That's all stuff i'm good with. That's the thing that really needed some sort of re-balancing.[BR][BR]What i'm complaining about is the formula regarding the \"balance\" between players over all chapters, the formula that takes expansions and aw's into account, to balance out a ch1 player with a ch15 player. That's utter nonsense. Every player can buy expansions, every player will get to that point that he can build/upgrade AW XYZ. That's why we make progress.[BR][BR]Look at my post #1205 - If me and another player are both in chapter 14, we both have everything the same, but i have ~20 more expansions (mostly premium) for whatever, and a few dozens aw levels, i'll need much more stuff to progress in tourneys as this player the further we get there. Up to that point that i even need more as i could ever produce/train with whatever space / aw levels accessible.[BR][BR]The conclusion of that calculation is, compared to that other player, that if you want to go far in the tourneys it's more effective to just have no AWs (or just basic / low lvl) as to build and upgrade that stuff.[BR][BR]Example: I have to use 30% more troops / goods / etc. in each province (see example in #1205). I have a needles that gives me a 62.5% training-speed bonus for barracks, but that other player could have that too, but less other wonders. Losing fights in the first few provinces doesn't have that big impact, but at later provinces there is a big difference.[BR][BR]Let's make up a little situation that could appear. We're fighting up to round 30 with some support-buildings and we'll face some total losses at the end of that. It's even most likely that there are high losses up to there but lets not overcomplicate things.[BR][BR]I have a daily barracks training rate of ~69.000 units, the \"additional losses\" below are calulated by my daily barracks training capacity and the 30% difference of my needed units vs the needed units of that fellow with less AWs / expansions. Easy example: 1000 training capacity, 130 vs 100 loss = 30 / 1000 = 3% additional losses based on my daily production.[BR][BR]A prov. 29 at 1* defeat would mean: 71.870 vs 50.309 lost = 31% additional losses based on my daily production[BR]A prov. 30 at 1* defeat would mean: 74.345 vs 52.041 lost = 32% additional losses based on my daily production[BR][BR]I already would lose 63% of my daily production rate _additionally_ in just 2 unlucky higher provinces. That's already the training bonus of my needles gone in just 2 provinces. But let's say we are even feeling competetive today and we want to do 50 provinces:[BR][BR]A prov. 50 at 1* defeat would mean: 123.910 vs 86.737 lost = 54% additional losses based on my daily production[BR][BR]That's only fighting, wich is the most favourable thing, as you can manipulate that at your favour by adding DAs etc.[BR][BR]Looking at negotiations, that's a fixed thing. Just look at the additional numbers of #1205, ending up in 382% more tools, 187% more goods and 819% more mana _additionally_ needed up to province 50 at 1*, based on my daily production, if i negotiate all the way up.[BR][BR]All the numbers up to whatever point will add to each other, resulting in incredibly high total numbers you could never achieve by any AW or expansion. At this point i'm effectively punished by building and upgrading AWs and buying additional expansions that i partly don't even use for  tourney related stuff."}, {"25": "Does anyone else find it a bit discerning that many of the top players are leaving en masse, and the devs call this \"working as intended\"?"}, {"30": "Maillie said:\t\t\tDoes anyone else find it a bit discerning that many of the top players are leaving en masse, and the devs call this \"working as intended\"?\t\tClick to expand...If they claim it is \"working as intended\", it could be their perspective."}, {"54": "Pauly7 said:\t\t\tNot to dash your hopes, but nothing exciting is happening in chapter 17.\t\tClick to expand...I think thats the only way to show that we don't agree with these changes. Next chapter is around the corner, and we should all just ignore it, since it will only hurt us more then benefit us. If their data sees enough people not starting the new chapters they just put all their money into developping, maybe they will dig in the data as to why, and finally see/hear our feedback..."}, {"8": "@Hekata, I love, love, love your story. [smilie--sprite1][BR][BR]A good example of a good dev team......and to be honest, that's kinda my expectation. The lack of communication here is what leaves many players feeling frustrated and angry.[BR][BR]I'm interested in your knitting club, it sounds quite competitive....hehe [smilie--sprite1][BR]---------------------------[BR][BR]@ShadowVision and @CrazyWizard  the more you guys post - the clearer this is becoming to me, so thanks for your posts. Maybe you should be the devs. [smilie--sprite2]"}]