[{"65": "Heymrdiedier said:\t\t\tI think thats the only way to show that we don't agree with these changes. Next chapter is around the corner, and we should all just ignore it, since it will only hurt us more then benefit us. If their data sees enough people not starting the new chapters they just put all their money into developping, maybe they will dig in the data as to why, and finally see/hear our feedback...\t\tClick to expand...maybe that is this  \"working as intended\" - they don't have a need to do more next chapters, less work and money comes.  we're superfluous here."}, {"84": "I have been thinking for some time now that they might be trying to get rid of the end game players so they don't need to create new material. They made the last two chapters really boring and now they ruined the tournaments, i wonder what is next."}, {"24": "Verde said:\t\t\tSo the plan now is what? If tourney performance is a consideration then ...[BR]. place as few expansions as possible and NEVER EVER buy a Premium expansion[BR]. build the minimum number of AWs that actively help with tourney; delete/do not build all others[BR]. do not advance through chapters that will not add reasonable value. or when advancing, consider what other AWs could be deleted to compensate, or other ways to compensate?[BR]. any other hints?\t\tClick to expand...[BR]Well if you want to build a tourney town, you are better off placing Premium expansions ONLY, while leaving all the normal ones you get to rot in your inventory. Obviously nobody would want to spend money on such an experiment, because it has nowhere to go after a certian point, but Premium expansions are definitely better than regular ones.[BR]However simply playing smaller cities makes sense now if you combine it with the stopped chapter progress in the end of the game. You can play the game with much less space now since you don´t have to bother with guest races anymore (use PP instead) until you reach chapter 15. Then once you do need a guest race for a while, but just the once, so it is still manageable...[BR][BR]About AWs: yes basically that, however it has always been like that, the difference is now you get punished for building the useless AWs while before it was simply a waste of your resources (which is a milder form of punishment) ...[BR][BR]As to chapter progress, I think there are a few sweet spots that could be used, but none of them include playing chapter 16 (or any future chapters). However if you want to progress I see no reason not to progress until you reach the Frogs tech in chapter 15."}, {"24": "Thagdal said:\t\t\twell hopefully their income will decrease when this goes to all live servers, wonder if they will listen then?!\t\tClick to expand...It will not, most people are not end game cities, so most people are happy with the changes... this is the reason they changed the tourney in the first place to cater to smaller cities."}, {"24": "kurgkurg said:\t\t\tBtw I'm just that one who \"skipped through the techs using PP but not having the same AW levels\" and I am therefore in a much better position than those playing longer, but I don't like this perspective at all, this takes of my reason and interest for getting better, to do more AW levels and enjoy my city now when I have finished research.[BR]from me just suddenly cut off any chance of further development\t\tClick to expand...[BR]you have a long time before that happens... If you are on low AW levels now you can upgrade them for a long time to come and always get more benefit than disadvantage. The only catch is you can´t choose AWs freely, but as long as you stick to the military ones, you´re fine. Of course there is no perfect answer to how many is too many, but I for myself chose 300 AW levels as the goal. I am currently 30 above that, so no big issue I will delete some of the less useful ones in the next time..."}, {"24": "Heymrdiedier said:\t\t\tI think thats the only way to show that we don't agree with these changes. Next chapter is around the corner, and we should all just ignore it, since it will only hurt us more then benefit us. If their data sees enough people not starting the new chapters they just put all their money into developping, maybe they will dig in the data as to why, and finally see/hear our feedback...\t\tClick to expand...[BR]I have started that a long time ago. Chapter 16 was completely useless for military performance and I never played the chapter for spire performance alone, now that tourneys hang on the same hook well of course I am not goig to play 16 (or 17 or any other chapter). But i imagine there are not enough people willing to stop playing chapters, because not enough people a) care about military performance or b) even know about how their performance is linked to progress factors. So my guess chances for this happening on a big scale are low, but it would be fun to watch how fast Inno could fix tourneys if they wanted to lol..."}, {"84": "Gargon667 said:\t\t\tIt will not, most people are not end game cities, so most people are happy with the changes... this is the reason they changed the tourney in the first place to cater to smaller cities.\t\tClick to expand...[BR]I think they also know that they will always get new players that have no idea of how things were so will not know any different and will spend money on the game. Maybe that is what they are relying on, oh and there seem to be some players that are happy to spend money on the game no matter what the devs do and good on those players."}, {"76": "I guess its time to go and fill the  in for the 16 optional SS researches that I have skipped in the past. I think I will wait to the event to actually research them so I can save some CC by using research instead of VV for quests."}, {"84": "pompeywolf said:\t\t\tI guess its time to go and fill the  in for the 16 optional SS researches that I have skipped in the past. I think I will wait to the event to actually research them so I can save some CC by using research instead of VV for quests.\t\tClick to expand...[BR]Thats exactly what i am doing"}, {"57": "My FS have been chatting about the changes. [BR]A quote from someone who has not been on this forum' [BR]\"The tourneys are boring now, no strategy needed, all are the same each week, no planning involved what so ever. Smaller or newbie cities with less time committed to the game, can now achieve much more than an advanced/long term player that has invested more. Nothing more to do in the game now with this format...Aw upgrades=bad, city growth/expansions=bad, completion of chapters=bad. I have seriously thought about quitting. just seems no point as everything you do now has a negative effect!\"[BR]There is a VERY small number of people who use this forum. How many others out there have a similar feeling to my fellow?"}, {"8": "Gargon667 said:\t\t\tAs to chapter progress, I think there are a few sweet spots that could be used, but none of them include playing chapter 16 (or any future chapters). However if you want to progress I see no reason not to progress until you reach the Frogs tech in chapter 15.\t\tClick to expand...[BR]Would you say that going to the end of the chapter for the chapter aws be ok? I'm getting very close to frogs and have just opened up the 2nd improved Elvenar style housing and also, what about the 2 expansions in that research (which I want to finish a row), one before frogs, one a little bit further. [smilie--sprite1][BR]I'm really in 2 minds about progressing but not to progress in a game is counterintuitive. What a bizarre situation they've created....lol"}, {"32": "OldHag said:\t\t\tWould you say that going to the end of the chapter for the chapter aws be ok? I'm getting very close to frogs and have just opened up the 2nd improved Elvenar style housing and also, what about the 2 expansions in that research (which I want to finish a row), one before frogs, one a little bit further. [smilie--sprite1][BR]I'm really in 2 minds about progressing but not to progress in a game is counterintuitive. What a bizarre situation they've created....lol\t\tClick to expand...[BR]ain't it the tourney time wondere that unlocks at the end? that wonder is amazing to fix your tourney time schedule"}, {"8": "@CrazyWizard - it's the Thermal spring of youth, which I understand to be great for pop and the vortex of storage."}, {"17": "Yes, you want the Ranger and Frog upgrade, and many players will stop there.  [BR]Timewarp is a Constructs level Wonder."}, {"65": "OldHag said:\t\t\tWould you say that going to the end of the chapter for the chapter aws be ok? I'm getting very close to frogs and have just opened up the 2nd improved Elvenar style housing and also, what about the 2 expansions in that research (which I want to finish a row), one before frogs, one a little bit further. [smilie--sprite1][BR]I'm really in 2 minds about progressing but not to progress in a game is counterintuitive. What a bizarre situation they've created....lol\t\tClick to expand...in my smaller city i also did first research \"Senate\" in Embassies - great to level up all MR and MWS, but no more."}, {"32": "OldHag said:@CrazyWizard - it's the Thermal spring of youth, which I understand to be great for pop and the vortex of storage.\t\tClick to expand...[BR]Ah ok, in that case quit at unlocking frog prince.[BR]Thermal spring ain't \"that great\"[BR][BR]and pure from a tournament perspective only monestary/sanctuary, needles, abbey, temple of toads, shrooms, flying academy. victory springs timewarp and maybe 1 I missed are worth the hassle, everything else is pointless. even great wonders like golden abyss ect.[BR]As you strive to small effcient cities with the least amount of expansions, wonderlevels and no research beytond frog prince.[BR][BR]It's the new elvenar"}, {"53": "'m4rt1n said:\t\t\tSo now I have to think about deleting Ancient Wonders that I have spent hours, days, weeks, months, years workinon to upgrade.[BR][BR]I have 26/30 wonders built now between level 6 and level 18, you tell me please @Silmaril why???[BR][BR]This is so disheartening after years of building my city. [smilie--sprite3]Click to expand...[BR]Silmaril said:\t\t\tI wish I had the answer for you @m4rt1n [smilie--sprite3] Unfortunately we only have the information that has been shared on the Forum.\t\tClick to expand...[BR]There is obviously a fair amount of unhappiness with certain changes (both on this forum and others), but I've also encountered quite a lot of puzzlement within the game (particularly from players who see the perceived anti-progression aspects of the formula as a mistake, and can't understand why Inno are using it) as well as cynicism (about the perceived disinterest in player feedback). Although any change risks producing some unhappiness, perhaps improved communication (between all parties) might alleviate the other problems.[BR][BR]A question for the mods:[BR][BR]Would it be possible for you to work with the Inno game team to explore these issues, in order to improve customer engagement and all that comes with it ? Obviously they can and should decide to make whatever changes they wish, and at least some of those changes will inevitably be driven by the requirement to make money from players. I do think though, (and particularly given the collaborative focus of Elvenar) that there is scope for us to mutually improve in areas such as those described above."}, {"22": "CrazyWizard said:\t\t\tAh ok, in that case quit at unlocking frog prince.[BR]Thermal spring ain't \"that great\"\t\tClick to expand...OldHag said:\t\t\tWould you say that going to the end of the chapter for the chapter aws be ok?\t\tClick to expand...Yeah, for a tournament optimised city the Thermal Spring and Vortex are fairly useless, so it will only be counter-productive to build them. You will also be unlocking several 'harmful' techs in getting there."}, {"22": "Thagdal said:\t\t\twell hopefully their income will decrease when this goes to all live servers, wonder if they will listen then?!\t\tClick to expand...Gargon667 said:\t\t\tIt will not, most people are not end game cities, so most people are happy with the changes... this is the reason they changed the tourney in the first place to cater to smaller cities.\t\tClick to expand...Yeah I have to agree. Not only that, but even the majority of people with end-game cities do not come to this forum. They may realise that it's gotten tougher so far, but they will be blissfully unaware that progressing further, upgrading AWs and placing expansions is going to make it all yet harder. Who knows how long they will continue on their way before they realise, one way or another, that it's getting progressively harder to keep up with what they used to score. They will probably often even be using diamonds to compensate, thinking that it may steady the ship."}, {"84": "I sent a FS message telling everyone of the things that will increase the difficulty of tournaments. Now they know they can choose if they want to keep going the way they have been or change."}]