[{"20": "My visual snapshot of the gems tourney, round 1.  Colour codes the same as the colours of the badges of the enemy troops.[BR][BR][IMG]https://i.ibb.co/L144n7D/https-en-forum-elvenar-com-index-php-attachments-gems-tourney-jpg-4837.jpg[/IMG][BR][BR]General note:[BR]I do not find that I can do the new tourney quicker than the old tourney.  It takes me longer to decide on what troop combination to use, or if I should and am able to cater.  Not getting around to doing 5 rounds on all my cities, never mind 6.  Seems like we are stuck with this model, so hats off to those of you who do find it more to your liking."}, {"68": "I won't be stopping working on my city, I know many people have decided where the optimum place is to stop but unless they're going to end up with hundreds of kp instants and/or kp then what's the point of stopping but continuing to do tournaments?[BR][BR]I play for the city building aspect, its what it was billed as being right at the beginning, back when we could choose our own route - fighting or trading, and then discovered that we had to research everything anyway![BR][BR]Once the tournaments become too much of an issue for me then I'll quit, but until then I'll just keep going - hate the whole tournament change, but its filling my many empty hours I currently have."}, {"24": "OldHag said:\t\t\tWould you say that going to the end of the chapter for the chapter aws be ok? I'm getting very close to frogs and have just opened up the 2nd improved Elvenar style housing and also, what about the 2 expansions in that research (which I want to finish a row), one before frogs, one a little bit further. [smilie--sprite1][BR]I'm really in 2 minds about progressing but not to progress in a game is counterintuitive. What a bizarre situation they've created....lol\t\tClick to expand...[BR]I think both elvenar AWs are entirely useless adding to that the increased upgrade costs compared to all previous AWs and on top of that the diminishing returns (decreasing bonus) of the AWs I see no reason to ever build them. [BR]The only use I can see is the Thermal spring for those very residence heavy ranking oriented cities. So if you are oe of those I recommend doing the math beforehand check upgrade costs and AW power, especially if you have GA and MH at 30 already... In my world both AWs are very far from worth pulling through each tourney..."}, {"8": "Thanks @Gargon667 - another question, if you don't mind. Do we know the optimum number of aw levels?"}, {"54": "OldHag said:\t\t\tThanks @Gargon667 - another question, if you don't mind. Do we know the optimum number of aw levels?\t\tClick to expand...0 [smilie--sprite8][BR][BR]kidding aside the lower the better, so only build those you really want, and make those really high level.[BR]0 isnt very handy either cause you wont be able to get much seeds."}, {"8": "Thanks @Heymrdiedier - I was just hoping someone had figured it out. [smilie--sprite1] [BR]I'm still relatively low on aw levels - only 220 thus far, I'm working on my mil buildings, but there are some non mil buildings that I think are essential for my city growth also, but may not be good for the tournaments, such as mountain halls, simia, even my golden abyss, which I remember someone posted were becoming useless, as far as tourneys are concerned, but I have no intention of dumping any of the above, but trying to figure out how far I can take my non mil buildings before I go over the optimum number of aw levels. [BR][BR]I haven't bothered laying down what I call the 'fluff' aws - I went for mil buildings from the off, I played FoE before this, so had an idea of what aws I'd need for fighting."}, {"54": "OldHag said:\t\t\tThanks @Heymrdiedier - I was just hoping someone had figured it out. [smilie--sprite1][BR]I'm still relatively low on aw levels - only 220 thus far, I'm working on my mil buildings, but there are some non mil buildings that I think are essential for my city growth also, but may not be good for the tournaments, such as mountain halls, simia, even my golden abyss, which I remember someone posted were becoming useless, as far as tourneys are concerned, but I have no intention of dumping any of the above, but trying to figure out how far I can take my non mil buildings before I go over the optimum number of aw levels.[BR][BR]I haven't bothered laying down what I call the 'fluff' aws - I went for mil buildings from the off, I played FoE before this, so had an idea of what aws I'd need for fighting.\t\tClick to expand...well I'm not sure fighting is the way to go if you want to score high in tournament.[BR]First of all, if you want to fight you need a lot more wonders to be able to compete compared to catering. More wonders making it again harder to win those fights (or at least bigger losses).[BR]Secondly if you want to do high on fighting you need to do it all manually to make sure the losses are minimal, meaning you spend a whole of a lot of time on tournament. a huge amount more then the time won bu going from 4 -> 1 encounters.[BR][BR]So in my opinion its a lot better to just ignore fighting alltogether if you want to score high in tournament. Ignore fighting means no barracks(es) no armories, no huge hammer consumption. Which is a huge space saver, that again makes it less costy if you lay down less expansions. Imo you'd have so much space leftover, you probably dont even need any wonder at all in your city, just build and extra workshop and factory etc, those make no impact on your difficulty.[BR][BR]The only thing is tho, whats the point then of tournament, what would you do with all those kp you get from it, i can only think of one thing, you spend it all in the wonders of your biggest competitors, making their tournament harder without most of them realising it [smilie--sprite2]"}, {"22": "OldHag said:\t\t\tThanks @Heymrdiedier - I was just hoping someone had figured it out. [smilie--sprite1][BR]I'm still relatively low on aw levels - only 220 thus far, I'm working on my mil buildings, but there are some non mil buildings that I think are essential for my city growth also, but may not be good for the tournaments, such as mountain halls, simia, even my golden abyss, which I remember someone posted were becoming useless, as far as tourneys are concerned, but I have no intention of dumping any of the above, but trying to figure out how far I can take my non mil buildings before I go over the optimum number of aw levels.[BR][BR]I haven't bothered laying down what I call the 'fluff' aws - I went for mil buildings from the off, I played FoE before this, so had an idea of what aws I'd need for fighting.\t\tClick to expand...I don't think there is anything to figure out. There isn't really a golden number of AW levels that you need to work towards. As @Heymrdiedier says, all the levels you now have will contribute to the tournament getting more difficult, so it's a question of making sure you are only levelling up Wonders that you know will provide you with more benefit than the increase in difficulty. If other AWs are essential to your city growth then you may decide that the benefit outweighs the penalty. After all, it isn't just about tournaments.[BR][BR]For me personally I'm not advancing in the story any further (any advancement beyond chapter 15 will always be a big penalty towards your tournament capability, so for me I've tried to steady the ship a little bit by deleting 3 AWs that I can do without. If you aren't advancing in other ways then levelling up AWs will always make the tournaments harder, unless you either delete other Wonders to compensate, or if you only level the Wonders that directly help your tournament efforts."}, {"22": "Heymrdiedier said:\t\t\tFirst of all, if you want to fight you need a lot more wonders to be able to compete compared to catering. More wonders making it again harder to win those fights (or at least bigger losses).[BR]Secondly if you want to do high on fighting you need to do it all manually to make sure the losses are minimal, meaning you spend a whole of a lot of time on tournament. a huge amount more then the time won bu going from 4 -> 1 encounters.\t\tClick to expand...It is way harder to score higher in tournaments without fighting. It has been discussed whether a pure catering city could now exist and whether it could compete with the fighting cities (i.e. having no military wonders), but I know most of the number crunchers came to the conclusion that it would be very difficult to do and would need to be planned as the city develops.[BR][BR]Heymrdiedier said:\t\t\tIgnore fighting means no barracks(es) no armories, no huge hammer consumption. Which is a huge space saver, that again makes it less costy if you lay down less expansions. Imo you'd have so much space leftover, you probably dont even need any wonder at all in your city, just build and extra workshop and factory etc, those make no impact on your difficulty.\t\tClick to expand...Do you think all the extra manufactories you will need takes no space? They would take up more space."}, {"54": "Pauly7 said:\t\t\tIt is way harder to score higher in tournaments without fighting. It has been discussed whether a pure catering city could now exist and whether it could compete with the fighting cities (i.e. having no military wonders), but I know most of the number crunchers came to the conclusion that it would be very difficult to do and would need to be planned as the city develops.\t\tClick to expand...I'm trying to level an account at the moment that will only do catering, and I'm assuming it will be able to keep the scores higher because i can keep the costs lower. Ill see how it goes, its a very long term project ofcourse, since i dont want to lay down expansions that i wont certainly need in the future, so its limited space project [smilie--sprite1][BR][BR]Pauly7 said:\t\t\tDo you think all the extra manufactories you will need takes no space? They would take up more space.\t\tClick to expand...[BR]Of course they take space. I was also confused, for some reason i tought the max bonus with wonder was 760% compared to the 700% without the wonders, but its 860 compare to 700. So yeah in that case, it wouldnt be a space saver, taking 3 factories + required population +culture alone would take up more space.[BR]So indeed the mountain halls is a must have wonder for cater only citys. unless if you have a sugerdaddy who supplies you with goods (against the rules afaik but its somewhat fluid)"}, {"32": "I went from 3-4 hours autocombat on the app ~80 provinces[BR]To 12-14hours on manual ~50 provinces.[BR][BR]So yeah, more clicks and much more time. also I must state that marble tournament seemed to be exceptionally well suited for manual combat hence the 50 provinces."}, {"22": "CrazyWizard said:\t\t\talso I must state that marble tournament seemed to be exceptionally well suited for manual combat hence the 50 provinces.\t\tClick to expand...I agree. Lots of heavy melee / mage combinations in the enemies. Blossom Princesses and Forest Wardens have been making mincemeat of the enemies, especially where there's rough terrain."}, {"22": "Should it be possible for an attack to sometimes inflict no damage at all? There have been at least two occasions this week when my Frog Prince has attacked a dog, only for the enemy to not lose a single point of health. On at least the second occasion the attack should have been buffed by the 'corroded' from the previous attack."}, {"32": "Pauly7 said:\t\t\tIt is way harder to score higher in tournaments without fighting. It has been discussed whether a pure catering city could now exist and whether it could compete with the fighting cities (i.e. having no military wonders), but I know most of the number crunchers came to the conclusion that it would be very difficult to do and would need to be planned as the city develops.[BR][BR][BR]Do you think all the extra manufactories you will need takes no space? They would take up more space.\t\tClick to expand...[BR]It might be possible if you can keep the used space extremely limited, make use of alternative goods production (like library set, mermaids paradise, trader I II and III from the MA ect.[BR]Then you could have insane scores I think in 6 tournaments with the following rules.[BR][BR]It must be in the orc chapter (to unlock more than 222 provincies and at the same time don't be bothered with orcs mana ect in the tournament which saves space)[BR]Get not more production than you need and keep space to an absolute minimum. do not build wasted space like MA or barracks, and maybe you might get away without a trader as well. (tho this might interfere with aquiring the correct buildings)[BR]Do not give neighourly help and get rid of your bonus relics by leveling, then destroy rebuild ect of wonders.[BR][BR]Goals 0 relic bonus (you do not need it for alternative production buildings)[BR]0 Wonderlevels[BR]Absolute minimum of expansions, and those you do get have to be premium (go spire?)[BR][BR]This should get your costs in the tournament to near chapter 1 levels[BR][BR]When we look at a chapter 8 town, with only 21 expansions in total (6 base +15 premium we see these costs[BR][IMG]https://i.ibb.co/yBB8yHf/https-en-forum-elvenar-com-index-php-attachments-1602242763109-png-4846.png[/IMG][BR]Provincie 500[BR]24.000 coins[BR]2400 supplies[BR]310 T1[BR]230 T2[BR]150 T3[BR][BR]These are very reasonable numbers that might actualy be possible to aquire in decent numbers.[BR]And those coins / supply needs in a pinch are also very easy to aquire with a little bit of questing in numbers much greater then required so limited questing only.[BR][BR]Off course this is looking up the edges of possibilities but yes it surely is possible.[BR]I also wonder with these numbers how much more expansions you can get away with before it no longer has a net gain.[BR]I just grabbed a value I liked, but a much larger city might be possible as long as you keep that relic bonus at 0.[BR]You would need to run some simulations to figure that out."}, {"22": "Heymrdiedier said:\t\t\tI'm trying to level an account at the moment that will only do catering, and I'm assuming it will be able to keep the scores higher because i can keep the costs lower. Ill see how it goes, its a very long term project ofcourse, since i dont want to lay down expansions that i wont certainly need in the future, so its limited space project [smilie--sprite1]Click to expand...When this conversation came up previously I said that I thought if this was ever going to work you would need a city old enough so that you've got all the old goods producing sets, like Sun & Moon, Carnival, etc, and have them levelled up."}, {"32": "Pauly7 said:\t\t\tWhen this conversation came up previously I said that I thought if this was ever going to work you would need a city old enough so that you've got all the old goods producing sets, like Sun & Moon, Carnival, etc, and have them levelled up.\t\tClick to expand...[BR]It would help if you had those, but t2 works really well with library set and even if new buildiungs arent as amazing as the rwally old ones, it doesnt mean it ain't good enough.[BR]You should look in possibilities instead of lingering about what you might have missed, there are always opportunities depending on the situation.[BR][BR]just for lolz your mana plant / gum tree would provide 178 t3 per day/21 hours which is 77% of what you need to pay off province 50 using only a single square. which is very resonable. 1 expansion would provide 178*25=4450 t3 per day so 2-3 expansions would be enough to pay for 60-80 provinces[BR][BR]Endless scrolls 690 on 2 squares, you need little of that, then cross trade for t1 as you need very little compared to big players. they could take that tiny bit easily and you can see an insane tourney killer on negotiating alone with little effort, very little effort indeed."}, {"26": "I really like how Inno managed to go from the low-chapter cities owning the tournaments to the game where progression actually makes your city better and then jump back to square one. Although it would take quite some time to scout enough provinces in the new city to be able to actually compete in the tournaments, I have little doubt that eventually we will see such builds on the top positions."}, {"32": "Errandil said:\t\t\tI really like how Inno managed to go from the low-chapter cities owning the tournaments to the game where progression actually makes your city better and then jump back to square one. Although it would take quite some time to scout enough provinces in the new city to be able to actually compete in the tournaments, I have little doubt that eventually we will see such builds on the top positions.\t\tClick to expand...All those timeboosters from the spire help a lot in overcomming this issue a lot faster."}, {"17": "Pauly7 said:\t\t\tShould it be possible for an attack to sometimes inflict no damage at all? There have been at least two occasions this week when my Frog Prince has attacked a dog, only for the enemy to not lose a single point of health. On at least the second occasion the attack should have been buffed by the 'corroded' from the previous attack.\t\tClick to expand...I put this in as a bug report a couple of years ago.  Ultimately it is a display error,  at least after some investigation.   I can tell the difference, from how it worked when these troops were released to us."}, {"22": "Lelanya said:\t\t\tI put this in as a bug report a couple of years ago.  Ultimately it is a display error,  at least after some investigation.   I can tell the difference, from how it worked when these troops were released to us.\t\tClick to expand...OK many thanks. Good to know the bug is still going strong two years later. [smilie--sprite1]"}]