[{"4": "CrazyWizard said:\t\t\tIt might be possible if you can keep the used space extremely limited, make use of alternative goods production (like library set, mermaids paradise, trader I II and III from the MA ect.[BR]Then you could have insane scores I think in 6 tournaments with the following rules.[BR][BR]It must be in the orc chapter (to unlock more than 222 provincies and at the same time don't be bothered with orcs mana ect in the tournament which saves space)[BR]Get not more production than you need and keep space to an absolute minimum. do not build wasted space like MA or barracks, and maybe you might get away without a trader as well. (tho this might interfere with aquiring the correct buildings)[BR]Do not give neighourly help and get rid of your bonus relics by leveling, then destroy rebuild ect of wonders.[BR][BR]Goals 0 relic bonus (you do not need it for alternative production buildings)[BR]0 Wonderlevels[BR]Absolute minimum of expansions, and those you do get have to be premium (go spire?)[BR][BR]This should get your costs in the tournament to near chapter 1 levels[BR][BR]When we look at a chapter 8 town, with only 21 expansions in total (6 base +15 premium we see these costs[BR]View attachment 4846[BR]Provincie 500[BR]24.000 coins[BR]2400 supplies[BR]310 T1[BR]230 T2[BR]150 T3[BR][BR]These are very reasonable numbers that might actualy be possible to aquire in decent numbers.[BR]And those coins / supply needs in a pinch are also very easy to aquire with a little bit of questing in numbers much greater then required so limited questing only.[BR][BR]Off course this is looking up the edges of possibilities but yes it surely is possible.[BR]I also wonder with these numbers how much more expansions you can get away with before it no longer has a net gain.[BR]I just grabbed a value I liked, but a much larger city might be possible as long as you keep that relic bonus at 0.[BR]You would need to run some simulations to figure that out.\t\tClick to expand...[BR]The problem I see with the relic bonus is that you earn so many relics playing the tournament that it would only be theoretically possible."}, {"32": "m4rt1n said:\t\t\tThe problem I see with the relic bonus is that you earn so many relics playing the tournament that it would only be theoretically possible.\t\tClick to expand...[BR]Play and slay 6 out of 9 tournaments, and if you can skip scouting your bonus provinces you can often scout around them, wne those few you can not, you work away those few relics with wonder upgrades.[BR][BR]It's totally possible if you know and accept the limitations."}, {"1": "Lelanya said:\t\t\tI put this in as a bug report a couple of years ago.  Ultimately it is a display error,  at least after some investigation.   I can tell the difference, from how it worked when these troops were released to us.\t\tClick to expand...[BR]That means it is something to check again. Can you or @Pauly7 replicate this bug, or maybe even screencast it? If so, please contact our support."}, {"20": "CrazyWizard said:\t\t\tPlay and slay 6 out of 9 tournaments, and if you can skip scouting your bonus provinces you can often scout around them, wne those few you can not, you work away those few relics with wonder upgrades.[BR][BR]It's totally possible if you know and accept the limitations.\t\tClick to expand...I don’t think one would be able to do that in the beginning. From which chapter onwards would you think such a play style is feasible?"}, {"22": "anonglitch said:\t\t\tCan you or @Pauly7 replicate this bug, or maybe even screencast it? If so, please contact our support.\t\tClick to expand...It's pretty hard to know exactly when it will occur if it only happened to me maybe three times last week. I'm not sure how to be constantly recording what I'm doing on the PC."}, {"1": "If you can't provide a screenshot, but you can tell in which province it happened, you can let support know. That could help to look into what is exactly going on."}, {"22": "I'll try to get a screenshot if it happens again, but that won't show what happened."}, {"65": "it happens to me all the time, and I was startled at first, but since I got it, that was only a misleading number to see, and the reality was another, I haven't cared about it, and I don't look at these numbers very much[BR]it's about the same thing as sometimes the enemy gets killed, but his number still stays on the map and doesn't disappear."}, {"1": "Don't worry about that, @Pauly7, still send in a support ticket. The developers will be able to look into it. I would suggest that you send the ticket as soon as you notice it happens. If you can stall until support replies, great. However, if that messes up your tournament cycle, remember the province # and the moment of this misleading number. If the enemy gets killed and receives the damage as @kurgkurg said, that is great news. However still, please send in a ticket when it happens so support can check it out."}, {"17": "So what happens is the frog attacks and it shows no damage to a unit.  This is typically frog 4 on round 1, and sometimes frog 5.  When the timer advances to round 2, sometimes the information updates to display honestly the damage, sometimes it does not.  About 3 times it shows, to once not, which is better than when I submitted the original report, it used to be always.  The problem with the original 'bug' was that no one on the International Server Support Team had a high enough level Mercenary Camp to actually check what was occurring, we had to go on information from Beta.  Anyhow on round 2, it is typically the second frog, and possibly more, that show irregular attacks.   This does need checking for Pauly's complaint, that the enemy is  or is not, doing modified damage while supposedly uninjured."}, {"17": "I have seen what Kurgkurg reports.  This is not the same thing, but what he mentions is part of what can occur when bringing mainly frogs to a tournament round."}, {"1": "Do you mind re-sending a new report with all that useful information, @Lelanya ? That way they can look into it right from your account. But please do once it happens, so the data is freshest. Although it seems like a display bug alone, it's still worth a new check."}, {"46": "Lelanya said:\t\t\tThe problem with the original 'bug' was that no one on the International Server Support Team had a high enough level Mercenary Camp to actually check what was occurring, we had to go on information from Beta.\t\tClick to expand...@Silmaril @herodite @anonglitch : Does this still apply to the in-game Support staff? It seems very strange to me that any Support personnel, in any game, and especially in a game which not only features many potentially different builds but also takes at least a couple of years to finish/reach end-game at an 'average' pace would not have access to specialised simulation-capable versions of the software, so that they could just set their City to precisely replicate any given user's configuration for the purpose of confirming bugs (and for many other Support-related reasons, as well)?[BR][BR]This ability to configure games to any level at will has been standard in almost all types of gaming for decades, both for developers and for Support staff (if they're different people), and it must be far easier nowadays. Do the various Support teams (in which I don't include volunteer Forum Moderators, who are usually 'standard' players with 'standard' software) really have to rely on data from other Servers' teams if they encounter bugs which they can't replicate solely because their own play-through of the game (or even the way in which they are playing) doesn't match that of the player reporting any given bug? And even if that were the case a while ago, when the game had a much smaller playerbase and also wasn't aimed at the high-speed world of mobile gaming, surely it can't still be true?[BR][BR]There will always be situations, of course, where it is not the game itself but the player's individual hardware and/or other installed software which may cause an apparent in-game bug, so this has always been a possibility which would require player-level further testing/reporting after the game scenario had been replicated by Support staff according to the user's config, but to be unable to replicate a user's config at all seems pretty unusual."}, {"17": "Yeah I thought it was a little odd."}, {"22": "Laurelin said:\t\t\t@Silmaril @herodite @anonglitch : Does this still apply to the in-game Support staff? It seems very strange to me that any Support personnel, in any game, and especially in a game which not only features many potentially different builds but also takes at least a couple of years to finish/reach end-game at an 'average' pace would not have access to specialised simulation-capable versions of the software, so that they could just set their City to precisely replicate any given user's configuration for the purpose of confirming bugs (and for many other Support-related reasons, as well)?\t\tClick to expand...Ah, if they could do this then this would imply that Innogames has any desire or capability to actually do proper alpha testing. I haven't seen any evidence of this."}, {"45": "@Laurelin Not at all, senior support staff have access to those tools. It would be impossible to work on support without them. I would assume that this would have always been the case, but I was not on the Elvenar team 2 years ago, so would not like to comment on whatever occured back then tbh."}, {"32": "BlueBlou said:\t\t\tI don’t think one would be able to do that in the beginning. From which chapter onwards would you think such a play style is feasible?\t\tClick to expand...[BR]Only chapter 8, before you cannot unlock enough provincies, and from chapter 9 onwards you need orcs for the tournaments.[BR]It's a specialised build, like the former chapter 4 accounts"}, {"17": "anonglitch said:\t\t\tDo you mind re-sending a new report with all that useful information, @Lelanya ? That way they can look into it right from your account. But please do once it happens, so the data is freshest. Although it seems like a display bug alone, it's still worth a new check.\t\tClick to expand...I will look for an opportunity to use the froggies"}, {"65": "I'm sad today. Our dear archmage Kaliartis left and stopped the game. Thanks Inno."}, {"22": "kurgkurg said:\t\t\tI'm sad today. Our dear archmage Kaliartis left and stopped the game. Thanks Inno.\t\tClick to expand...That is sad news."}]