[{"14": "kurgkurg said:\t\t\tI'm sad today. Our dear archmage Kaliartis left and stopped the game. Thanks Inno.\t\tClick to expand...[BR]@Silmaril @anonglitch @herodite [BR][BR]Be sure to forward this feedback, all right?"}, {"7": "kurgkurg said:\t\t\tI'm sad today. Our dear archmage Kaliartis left and stopped the game. Thanks Inno.\t\tClick to expand...Sorry to hear that [smilie--sprite3]"}, {"45": "I am also saddened now to read this @Killiak, I will indeed feed this back [smilie--sprite3]"}, {"22": "Killiak said:@Silmaril @anonglitch @herodite[BR][BR]Be sure to forward this feedback, all right?\t\tClick to expand...I'm beyond believing that they would have the slightest care about the highest ranking players leaving. Probably one of the reasons Kaliartis walked away."}, {"39": "I lost 2 great players this week on EN2 server and another 2 players on EN3 server due to tournament changes. This is just the beginning, the rest of us are holding on because of the social aspect of this game, but for how long that is going to keep us from quitting?"}, {"7": "Pauly7 said:\t\t\tI'm beyond believing that they would have the slightest care about the highest ranking players leaving. Probably one of the reasons Kaliartis walked away.\t\tClick to expand...Is it going too far to even suspect that this was one of the results they aimed for with all the implemented changes? Get rid of the old, profit from the new?"}, {"26": "kurgkurg said:\t\t\tI'm sad today. Our dear archmage Kaliartis left and stopped the game. Thanks Inno.\t\tClick to expand...That's extremely sad news. Hate that these changes results in those who actually know how to play the game going away."}, {"100": "C-Nymph said:\t\t\tIs it going too far to even suspect that this was one of the results they aimed for with all the implemented changes? Get rid of the old, profit from the new?\t\tClick to expand...Absolutely..."}, {"122": "@Killiartis sorry to see you leaving the game [BR]I did warn this is what would happen   [smilie--sprite3](("}, {"22": "malph said:@Killiak,   sorry to see you go [BR]I did warn this is what would happen   [smilie--sprite3]((\t\tClick to expand...Wait... this isn't Killiak. It's Kaliartis."}, {"14": "malph said:@Killiak,   sorry to see you go [BR]I did warn this is what would happen   [smilie--sprite3]((\t\tClick to expand...[BR]Oh my, how Freudian [smilie--sprite7]"}, {"122": "my mistake  but sorted  now thanks  [BR]Pauly7 said:\t\t\tWait... this isn't Killiak. It's Kaliartis.\t\tClick to expand..."}, {"110": "Verde said:\t\t\tSo the plan now is what? If tourney performance is a consideration then ...[BR]. place as few expansions as possible and NEVER EVER buy a Premium expansion[BR]. build the minimum number of AWs that actively help with tourney; delete/do not build all others[BR]. do not advance through chapters that will not add reasonable value. or when advancing, consider what other AWs could be deleted to compensate, or other ways to compensate?[BR]. any other hints?[BR][BR]And if Inno thinks this sort of discussion will not be communicated through the player grapevine, not only in forum, they may have another think coming.[BR][BR]Really curious as to how much fallout occurs in the next while ... and at what point it may become clear just what a hideous disincentive to progress the Squad Size calculation really is.\t\tClick to expand...[BR]Actually I think it will go more like this:[BR]. place as few expansions as possible and NEVER EVER buy a Premium expansions[BR]. build the minimum number of AWs that actively help with tourney; delete/do not build all others[BR]. do not advance through chapters that will not add reasonable value. or when advancing, consider what other AWs could be deleted to compensate, or other ways to compensate?[BR]. find that you no longer need KP because actually you no longer want to advance through chapters or upgrade AW's [BR]. see that there is no point in continuing with tourneys as you don't need the KP, so you stop tourneys[BR]. suss that because you no longer do tourneys, you don't need to do the spire to fund tourneys with time boosts etc, so you stop the spire[BR]. notice that now you aren't growing your city and playing tourneys and the spire, continuing to play is rather pointless."}, {"22": "It's a very realistic looking process @KermitsDad, that a lot of people are going to go through and many with the result that you assume. As with all of this stuff, I don't think the devs will be in any way bothered. All they will be looking at is whether more people are joining the game than leaving it. If they are, then they will be safe in the knowledge that the biggest majority of these players won't have any idea of what the impact progress will have on performance."}, {"7": "malph said:\t\t\tmy mistake  but sorted  now thanks\t\tClick to expand...malph said:\t\t\t@Killiartis sorry to see you leaving the game[BR]I did warn this is what would happen   [smilie--sprite3]((\t\tClick to expand...Try again [smilie--sprite2] Not Killiak, not Killiartis, ... Kaliartis!"}, {"25": "I have finished the last chapter, actually a while ago, and now have to wonder what to do with this behemoth city that I have.  All I can see me doing now is to strip it down, make it an event city, then find a fun game to play.  If I don't can't go into Chapter 17, which is obvious, my only other option is to move it out of the city where I'm AM and start a new city.  The big city is actually not reasonable for an event city since it's a human city.  I wanted the priest instead of the weak sorceress.  With the planks being double the size of the elven city, making an event city out of it is certainly counter productive."}, {"118": "Hi all! You made me giggle hehe[BR][BR]And yes, after 4 years I mainly quit because of the new tournament changes, no point in leading a tournament FS if the tournaments are not stimulating anymore. And with me, it's all or nothing.... [BR][BR]I thank you all for the camaraderie, take care everyone![BR][BR]PS: @kurgkurg, you have my endless respect and appreciation!! /bow"}, {"22": "Take care @Kaliartis. Hopefully you will be back one day if they see the error of their ways."}, {"32": "Pauly7 said:\t\t\tIt's a very realistic looking process @KermitsDad, that a lot of people are going to go through and many with the result that you assume. As with all of this stuff, I don't think the devs will be in any way bothered. All they will be looking at is whether more people are joining the game than leaving it. If they are, then they will be safe in the knowledge that the biggest majority of these players won't have any idea of what the impact progress will have on performance.\t\tClick to expand...[BR]It is very expensive to aquire new (paying) customers, keeping your customers in the first place is the most economic viable option.[BR]The responso to ch17 on beta is near icecold, and this can be almost completely be pointed to this change.[BR][BR]Normally we complain about this or that but now it's more like \"why would I play it?\"[BR]How easy can you nuke a game with a single change."}, {"74": "CrazyWizard said:\t\t\tIt is very expensive to aquire new (paying) customers, keeping your customers in the first place is the most economic viable option.[BR]The responso to ch17 on beta is near icecold, and this can be almost completely be pointed to this change.[BR][BR]Normally we complain about this or that but now it's more like \"why would I play it?\"[BR]How easy can you nuke a game with a single change.\t\tClick to expand...Its a combination of the two. Even XVI people asked that question about . . . no new troops and no Merc Camp upgrade and AWs left me scratching my head thinking just what was I going to do this chapter for? So I never bothered doing it thinking I'd start it when XVII hits Beta.[BR][BR]But now XVII has hit Beta and its just as awful. Again no new troops, again very weak AWs and to add insult to injury the Barracks upgrades seem to be too. The Tournament formula is based upon exponential growth so it should be pretty simple to calculate exponentially what the training speed should be based upon exponential growth but they don't seem to have done that.[BR][BR]I estimated a while back that a base training speed of 550 or below would leave me worse off finishing XVII than staying at XV. If training speed increased to eg 600+ then it'd be worthwhile and I'd do it. Instead it seems the first upgrade to the barracks goes from 450 to about 467, not sure what the other levels do but that is nowhere close to exponential growth.[BR][BR]You're not only worse off if you do AWs but now you're worse off if you research since they're not exponentially growing the benefits you gain from progression. It is absolute madness."}]