[{"17": "You guys need to come to global chat at least for a bit,  no one is editing out our views, just saying..."}, {"8": "Lelanya said:\t\t\tYou guys need to come to global chat at least for a bit,  no one is editing out our views, just saying...\t\tClick to expand...There's a global chat? [BR]Where is it, please?"}, {"74": "My post has been edited twice. Once with me receiving a notification that \"expletives removed\" and another saying \"profanity noted\" except I never swore! There was no profanity and no expletives so I don't know what is going on."}, {"14": "randblade said:\t\t\tMy post has been edited twice. Once with me receiving a notification that \"expletives removed\" and another saying \"profanity noted\" except I never swore! There was no profanity and no expletives so I don't know what is going on.\t\tClick to expand...[BR]Overeager moderators, obviously.[BR][BR]Just report it to @Silmaril . They are the one who can teach the mods how to do their job properly."}, {"45": "No views are edited out at all @Lelanya moderators only moderate to keep the forum within the rules.[BR][BR]@OldHag This is the International chat Forum.[BR][BR]randblade said:\t\t\tMy post has been edited twice. Once with me receiving a notification that \"expletives removed\" and another saying \"profanity noted\" except I never swore! There was no profanity and no expletives so I don't know what is going on.\t\tClick to expand...Two words were indeed edited out, both being expletives as of course against our forum rules to use them."}, {"76": "pompeywolf said:\t\t\tI guess its time to go and fill the  in for the 16 optional SS researches that I have skipped in the past. I think I will wait to the event to actually research them so I can save some CC by using research instead of VV for quests.\t\tClick to expand...Well I am just about done putting   in the researches only 17 to go into SS55 at the end of elvenar chapter. Didn't take me as long as I would have thought only 10 days."}, {"62": "So thats Inno's updated marketing strategy?!  make players lose troops in the tourney and then offer troop packs in the store. [smilie--sprite11][BR][BR]Thanks for the good morning chuckle inno [smilie--sprite7]"}, {"32": "Thagdal said:\t\t\tSo thats Inno's updated marketing strategy?!  make players lose troops in the tourney and then offer troop packs in the store. [smilie--sprite11][BR][BR]Thanks for the good morning chuckle inno [smilie--sprite7]Click to expand...[BR]actually those offers became a lot worse, you now can make up to 3x as many units, and it looks like the offer is the same as it always was. so it became up to trice as bad."}, {"2": "I am thinking more and more what to change in my main city (the others are abandoned) to let me still enjoy the game? Tournament and Spire definitely are not enjoyable, are just some tasks that had to be accomplished, but without them? Oh, events followed by FA, sorry, NO, just a lot of work for not so great (if at all) rewards. [BR]Last week I had no internet and if in the first 2 days I felt awkward, after that I was kind of relieved that I don't have to go back to the daily \"work\", cuz this is what Elvenar became - a chore, an unpaid job where instead of getting benefits, once in a while you bring money from home or even worse, you are penalized for being a \"top worker\". This certainly is not fun no matter how you look at it. The only thing that keeps me here is the social aspect. I have fellows from the very 1st FS I entered when I started to play almost 4 years ago, they are dear friends, I have newer fellows which are such great persons and also became friends, some of them even in real life!!! It's painful to just leave![BR]My divagation has a point - I will try to stay longer and change the style of playing. I will not delete a single wonder (because are mine! [smilie--sprite8] ) but I will upgrade the ones related to goods, population and culture (since ch. 17 wants pop + cult for Unurium) I will place all possible expansions and buy some Premium too when I'll have enough diamonds from Spire or Magic chest (probably 1 expansion/ year), I will reduce military buildings (dunno which ones yet) and bring back from inventory manufactories, I will craft every Orc nest I find and that will allow me to sell 1 or 2 Armories. These being done, the result is >> minimum participation in Tournament and Spire (bit of fighting, mostly catering). [BR]Maybe I will resist here longer, maybe not - I am a fighter, I spent last years to get a city tourny oriented and now, everything I did is just preventing me to be a good fighter and get really good scores. I say it - hard to swallow this pill, is really bitter [smilie--sprite3]"}, {"30": "kurgkurg said:\t\t\tI'm sad today. Our dear archmage Kaliartis left and stopped the game. Thanks Inno.\t\tClick to expand...Sad news  [smilie--sprite3] ."}, {"30": "Thagdal said:\t\t\tSo thats Inno's updated marketing strategy?!  make players lose troops in the tourney and then offer troop packs in the store. [smilie--sprite11][BR][BR]Thanks for the good morning chuckle inno [smilie--sprite7]Click to expand...I was thinking the same.... [smilie--sprite8]"}, {"22": "Alcaro said:\t\t\tThe only thing that keeps me here is the social aspect. I have fellows from the very 1st FS I entered when I started to play almost 4 years ago, they are dear friends, I have newer fellows which are such great persons and also became friends, some of them even in real life!!! It's painful to just leave!\t\tClick to expand...This is the heart-breaking thing. Elvenar has a fantastic base of loyal players that have been here a long time. Many people stick with it because of the friendships/teams/alliances that have been forged. Inno created a great thing when they made all this possible, but they now do nothing to improve the team aspects (i.e. better comms systems, improving FAs, etc). I am now seeing a lot of people leaving. I am seeing even more people saying they are \"taking a break from the game\". I imagine most of the latter category have also left, but they don't want to say it's final.[BR][BR]It's the fellowships and the friendships that make this game what it is. New people coming into the game are most likely to stay when they become part of a good team. They make friends, get guidance, feel like they are a part of something. None of this will continue if those long-standing, loyal players all leave. Not only are all our suggestions, feedback and requests ignored, but the worst part is - they feel absolutely no obligation to offer any kind of thoughts of their own or response to anything that is being said. Even if it were just an outline of where they wanted to see the game going in the future, it would be something. This thread is 66 pages long and there has not been one word from the development team at any stage along the way, since the initial announcement by @Muf-Muf. They haven't even had the decency to tell us that the testing phase is over as it has now been rolled out to all Live servers. I'm not including mods and CMs in this, as they are doing their best with very little more information than we have."}, {"84": "@Pauly7 in all of my time on this forum i can not recall a single time when the actual development team have said a single word in response to any topic. I know they say there is a first time for everything but i am not going to hold my breath waiting for the development team to actually show they do not treat the players with contempt by telling them something."}, {"46": "Timneh said:@Pauly7 in all of my time on this forum i can not recall a single time when the actual development team have said a single word in response to any topic. I know they say there is a first time for everything but i am not going to hold my breath waiting for the development team to actually show they do not treat the players with contempt by telling them something.\t\tClick to expand...I've been playing for only around 2½ years, but I have a lot of online time (and I also don't like to commit myself to any game without learning as much as I can about its history and how it works), so I've read the entirety of the Beta Forum since it began at the inception of the game, as well as all of the 'General Discussion' topics on the English-language EN and US Forums (and some of their other content) from the point at which the game went live. So far, and in all of that Forum content, I haven't seen a single post from any InnoGames personnel outside of Moderators, Community Managers, and, less often, members of Quality Control staff. There is indeed a first time for everything, but it seems as if Elvenar's communications strategy limits the input of developers (and artists, and anyone else who isn't a designated 'customer-facing' person) to appearances in pre-scripted videos and, occasionally, the kind of 'live Q&A' sessions which appear on Facebook (and perhaps other Social Media - I have access only to Facebook).[BR][BR]However, I would be surprised if the developers never read the Forums, whether in their own time or as part of their work, either out of curiosity or, perhaps, because these Forums, especially when compared with other information sources such as Social Media, often contain far more detailed and well-considered player-sourced data and opinions on useful matters, such as in-game balance and obscure/unforeseen gameplay-related issues which are difficult or impossible to predict or analyse via in-game data collection. Even so, it seems unlikely, after five years or so, that any developers who may be reading what we say will suddenly start to reply in person - which is very unfortunate at any time, but far more so at the moment, of course."}, {"7": "Laurelin said:\t\t\tHowever, I would be surprised if the developers never read the Forums, (...) it seems unlikely, after five years or so, that any developers who may be reading what we say will suddenly start to reply in person\t\tClick to expand...This only strengthens the impression that they either read-but-don't-understand, or they completely ignore all feedback because they simply don't care. Either way not positive, but I even suspect the latter is the case. Sad."}, {"22": "I don't expect devs to get personally involved either, by this point, but even if they don't you would think they would relay messages back via the CMs, addressing points that have been raised, but they don't, because they have zero regard for their players.[BR][BR]I guess I hope they silently read this stuff too, but I have no certainty of that. Yeah, it makes sense that they individually may look, out of curiosity, but that does somehow make it worse, if they still don't care enough to give us information."}, {"100": "Everybody that have a facebook account (if not, create one pls) should, when they (devs) go Q&A live, flood them with all these arguments in their faces, we must pressure there, cause here is so easily to be ignored."}, {"76": "No point with the Q&A as they pick which question they want to answer, and even if they did bother it would just be the same as what mod say I suspect."}, {"84": "@pompeywolf you beat me to it. That is what i was going to say lol."}, {"100": "pompeywolf said:\t\t\tNo point with the Q&A as they pick which question they want to answer, and even if they did bother it would just be the same as what mod say I suspect.\t\tClick to expand...Ok, so we remain here, hoping they are seeing our feedback, good, nothing gonna change and we won´t solve nothing (as all these 66 pages show).Great.[BR][BR]They just simple don´t care about our feedback in the forum, is so simple and clear to see exactly that.[BR][BR]But no, the idea is not they pick our question, obviously they wont and even if they do they will answer whatever they want, it is not what my idea is going for, the finality is PRESSURE, show them in their faces we´re not happy with their changes and post them MASSIVELY our arguments, do you get me? It is at the end of the day a product and we as customers have the right to complain about it."}]