[{"45": "@DunkelSaturn You do indeed have a right to voice your opinion, that is what this thread is for as information is collated from here. [BR]However spamming, as you are suggesting is of course against the rules across InnoGames.[BR]If you have additional information that you have not shared here so far, please add it to this thread."}, {"84": "There is very little point of adding any feedback here as the post from the CM on the Beta thread on page 59 of this thread shows that the tournaments are working as the devs want them too.[BR] It's all about the numbers people not what we say. The tiny changes that were made were probably because the numbers did not quite match what they wanted."}, {"32": "pompeywolf said:\t\t\tNo point with the Q&A as they pick which question they want to answer, and even if they did bother it would just be the same as what mod say I suspect.\t\tClick to expand...Or they say the wrong/incorrect thing."}, {"39": "I think it's time for the next step; giving honest reviews on all social media platforms, Google Play, Apple store, Facebook, etc. Another thing we could do is to have a 2 week-strike and abandon the game. A bit extreme, I know, but when one is so angry and upset, there is nothing else to lose lol."}, {"57": "Silmaril said:@DunkelSaturn You do indeed have a right to voice your opinion, that is what this thread is for as information is collated from here.[BR]However spamming, as you are suggesting is of course against the rules across InnoGames.[BR]If you have additional information that you have not shared here so far, please add it to this thread.[BR][BR]This would not be 'Spamming' \" send the same message indiscriminately to (a large number of Internet users\". It would be targeted and for a specific end user. If a significant number of people wish to ask the SAME question how would that be wrong. [BR]I usually agree with your comments @Silmaril but this time i think you have it wrong.\t\tClick to expand..."}, {"84": "Regina8 said:\t\t\tAnother thing we could do is to have a 2 week-strike and abandon the game. A bit extreme, I know, but when one is so angry and upset, there is nothing else to lose lol.\t\tClick to expand...[BR]While i think a strike would make INNO sit up and take notice i also think it would be impossible to organize. Not only would it need to be on all servers there are also too many players that just keep on playing no matter what INNO do to the game."}, {"39": "Timneh said:\t\t\tWhile i think a strike would make INNO sit up and take notice i also think it would be impossible to organize. Not only would it need to be on all servers there are also too many players that just keep on playing no matter what INNO do to the game.\t\tClick to expand...Russian servers are halfway there lol."}, {"54": "Timneh said:\t\t\tWhile i think a strike would make INNO sit up and take notice i also think it would be impossible to organize. Not only would it need to be on all servers there are also too many players that just keep on playing no matter what INNO do to the game.\t\tClick to expand...I dont know, just dont start the new chapter when it comes to live? If enough people do that, they will notice?[BR]I wouldn't recommend stopping the game for a week or 2, or you will probably never come back. By the time they noticed you found another game you enjoy [smilie--sprite1]"}, {"39": "Heymrdiedier said:\t\t\tI dont know, just dont start the new chapter when it comes to live? If enough people do that, they will notice?[BR]I wouldn't recommend stopping the game for a week or 2, or you will probably never come back. By the time they noticed you found another game you enjoy [smilie--sprite1]Click to expand...lol wouldn't it be a great outcome? Win-win in my book  [smilie--sprite1]"}, {"133": "Regina8 said:\t\t\tRussian servers are halfway there lol.\t\tClick to expand...We too, TR. server[BR]"}, {"7": "Heymrdiedier said:\t\t\tI dont know, just dont start the new chapter when it comes to live? If enough people do that, they will notice?[BR]I wouldn't recommend stopping the game for a week or 2, or you will probably never come back. By the time they noticed you found another game you enjoy [smilie--sprite1]Click to expand...Lol that would be exactly what they want though, as what they want is for us to stop progressing and instead just play the silly weekly/monthly minigames they throw in our faces (FA, events, tourney, spire).[BR]Silmaril said:\t\t\tSpamming, as you are suggesting is of course against the rules across InnoGames.\t\tClick to expand...'Spamming' as you call it, or rather multiple people saying the same thing to get a point across, on a Q&A on Facebook or YouTube is under the rules of FB/Google though, Innogames has absolutely zero to say about that."}, {"32": "C-Nymph said:\t\t\tLol that would be exactly what they want though, as what they want is for us to stop progressing and instead just play the silly weekly/monthly minigames they throw in our faces (FA, events, tourney, spire).[BR][BR]'Spamming' as you call it, or rather multiple people saying the same thing to get a point across, on a Q&A on Facebook or YouTube is under the rules of FB/Google though, Innogames has absolutely zero to say about that.\t\tClick to expand...[BR]They can still moderate the comments, the only place they cannot is on the play store and I assume the app store."}, {"17": "Back to the Q&A.  It is possible to get an answer, you simply must phrase your question with care.  Their faces reveal the truth."}, {"45": "Guys can we please get back onto topic. [BR]This thread was created for giving the opportunity to discuss from the Upcoming Tournament changes, to where we are now after the changes made in the subsequent release notes.[BR]Please can we keep to this very valuable topic and bring further pertinent information to this thread to keep this constructive."}, {"75": "Silmaril said:\t\t\tGuys can we please get back onto topic.[BR]This thread was created for giving the opportunity to discuss from the Upcoming Tournament changes, to where we are now after the changes made in the subsequent release notes.[BR]Please can we keep to this very valuable topic and bring further pertinent information to this thread to keep this constructive.\t\tClick to expand...The tournament changes are now a fait accompli, live on all servers. [BR]Just wondering what purpose is really served by keeping this thread, Upcoming Tournament Changes, open any longer?"}, {"14": "Verde said:\t\t\tThe tournament changes are now a fait accompli, live on all servers.[BR]Just wondering what purpose is really served by keeping this thread, Upcoming Tournament Changes, open any longer?\t\tClick to expand...[BR]There wasn't a point in the first place.[BR]We got the nerf-bat straight to the teeth, and they handed us a tiny bandage after the fact. So many players are quitting now, despite the propaganda efforts of the CM and Mods.[BR][BR]@Silmaril Please don't pretend like the thread even mattered. Inno pushed their change, job done, and NOTHING we say will change a darn thing anyway."}, {"76": "Well I don't think this will have any affect but I still believe that the supplies and coins either come up to often or ask for to much if you negotiate. [BR]I have a end of orc city which I am using for negotiation and I am stopped from doing provinces not by goods but supplies."}, {"54": "pompeywolf said:\t\t\tWell I don't think this will have any affect but I still believe that the supplies and coins either come up to often or ask for to much if you negotiate.[BR]I have a end of orc city which I am using for negotiation and I am stopped from doing provinces not by goods but supplies.\t\tClick to expand...Ive had this discussion in the past with someone from the elvenar team as well but about the spire. They said, according to their data everyone should be swarming in coins,.... so they saw no issue there (at that point)"}, {"8": "Silmaril said:\t\t\tGuys can we please get back onto topic.[BR]This thread was created for giving the opportunity to discuss from the Upcoming Tournament changes, to where we are now after the changes made in the subsequent release notes.[BR]Please can we keep to this very valuable topic and bring further pertinent information to this thread to keep this constructive.\t\tClick to expand...[BR]back on topic.....[smilie--sprite1][BR][BR]I'm still finding the troop cost too high, for what it is.......I only do manual fighting (in spire and tournaments) and know how to manuever around the map to keep costs as low as possible, I use mainly merc camp troops, my frogs (HR) are only level 2, so I use orc strategists or my golems when HR are required.[BR]Whilst we may have been given the ability to train in all 3 troop training buildings, it's kinda useless if the bulk of troops I/we are using only come from one mil training building........I think that 'thing' is kinda insulting, like we're a bunch of fools that are going to be so easily fooled.....it's also laughable.[BR][BR]In the old system, I looked at the cost of lost troops in diamond cost to replace them (thanks to my ex fs mates info, you know who you are [smilie--sprite1] )......in the new system, the diamond cost to replace lost troops is, in some cases, more then double. I've managed to get to province 40, round 2.....I do not have, and have not had the troops needed (since new tourney system) to take more then the first 15 provinces to round 6 and that's a struggle, but I'm a stubborn OldHag [smilie--sprite1][BR][BR]I actually can't believe that any dev, worth his/her salt can possibly think this is a good idea to carry on with this fiasco, but I can believe that there is an eejit manager at Inno who doesn't have (a clue) what it takes to apologise to it's paying customers and inform them/us on how they intend to fix it.[BR][BR]But whoever is responsible for this fiasco, needs to take it on and fix it. What the hell is up with you guys at Inno?[BR][BR]P.S I hope my use of eejit isn't too offensive. [smilie--sprite2][BR][BR]There you go, I've said my piece."}, {"57": "We are on topic. We are discussing how we get the developers to take notice of what is said on the thread."}]