[{"17": "stucon said:\t\t\tWe are on topic. We are discussing how we get the developers to take notice of what is said on the thread.\t\tClick to expand...Agreed!! we were debating what questions to ask them, and I was merely instilling hope that some questions can slip through.[BR]We should ask them, will we have to wait another 3 and a half years for the next tourney rebalance, or might they revisit this anytime soon?"}, {"54": "Since both spire and tournament squad sizes are now totally out of touch with any realistic values, i feel like the valorian valor building and the orc strategist building like dropped their usefullness to like 1% of their previous use. Am i the only one who thinks like that?[BR][BR]like in last chapter the valor building produces 17 units each hour. my barracks make 700 each hour, and its nowhere near enough to do 20 provinces in tournament. I need time boosts and brown bears to be able to have enough units.[BR][BR]So im thinking of trashing these buildings that i have in my city now, anyone has a reason i shouldnt?"}, {"32": "OldHag said:\t\t\tback on topic.....[smilie--sprite1][BR][BR]I'm still finding the troop cost too high, for what it is.......I only do manual fighting (in spire and tournaments) and know how to manuever around the map to keep costs as low as possible, I use mainly merc camp troops, my frogs (HR) are only level 2, so I use orc strategists or my golems when HR are required.[BR]Whilst we may have been given the ability to train in all 3 troop training buildings, it's kinda useless if the bulk of troops I/we are using only come from one mil training building........I think that 'thing' is kinda insulting, like we're a bunch of fools that are going to be so easily fooled.....it's also laughable.[BR][BR]In the old system, I looked at the cost of lost troops in diamond cost to replace them (thanks to my ex fs mates info, you know who you are [smilie--sprite1] )......in the new system, the diamond cost to replace lost troops is, in some cases, more then double. I've managed to get to province 40, round 2.....I do not have, and have not had the troops needed (since new tourney system) to take more then the first 15 provinces to round 6 and that's a struggle, but I'm a stubborn OldHag [smilie--sprite1][BR][BR]I actually can't believe that any dev, worth his/her salt can possibly think this is a good idea to carry on with this fiasco, but I can believe that there is an eejit manager at Inno who doesn't have (a clue) what it takes to apologise to it's paying customers and inform them/us on how they intend to fix it.[BR][BR]But whoever is responsible for this fiasco, needs to take it on and fix it. What the hell is up with you guys at Inno?[BR][BR]P.S I hope my use of eejit isn't too offensive. [smilie--sprite2][BR][BR]There you go, I've said my piece.\t\tClick to expand...[BR]There is no issue in limiting the amound of provinces we can do, it's part of the change and I can live with that change.[BR]For me there are 2 main issues[BR]The randomness of units / all 5 unit types are used in each tournaments creates a much much much bigger disparity between auto and manual playing then before.There is no longer a clear path of improvement for the entire game / disparity between similar players is insanely bigger than under the old format, which was a point that was recognised in the release noted and then made 100x worse?especially the last part, It's like you tell the police officer you admit that you were wrong when you were driving 60km/h in a 50 km/h neigborhood, and so after the fine you drive away at a speed of 250km/h?[BR]Does that even make sense?[BR][BR]But as many said, they were never interested in real feedback, part of the changes where already reversed by unlocking 3x the unit production.[BR]They listened to whe whining about being able to do less (which was the whole freaking point of this change) and not to the real issues that actually matter.[BR][BR]Which is the game breaking and unfair part of the changes.[BR][BR][BR]Heymrdiedier said:\t\t\tSince both spire and tournament squad sizes are now totally out of touch with any realistic values, i feel like the valorian valor building and the orc strategist building like dropped their usefullness to like 1% of their previous use. Am i the only one who thinks like that?[BR][BR]like in last chapter the valor building produces 17 units each hour. my barracks make 700 each hour, and its nowhere near enough to do 20 provinces in tournament. I need time boosts and brown bears to be able to have enough units.[BR][BR]So im thinking of trashing these buildings that i have in my city now, anyone has a reason i shouldnt?\t\tClick to expand...[BR]It solves part of there created mess with too much time boosters, and indeed nukes other parts, to keep them viable the should have at least doubled or better all unit producing buildings at the same time.[BR]Yet those numbers re even including the new event building in the halloween event at \"old numbers\""}, {"24": "OldHag said:\t\t\tThanks @Gargon667 - another question, if you don't mind. Do we know the optimum number of aw levels?\t\tClick to expand...[BR]Sorry for the late reply, I am not on the forum much anymore nowadays...[BR][BR]I do no know the optimum number AW levels, and I am rather sure there is no such thing. Because AW levels are not the only influencing factor here. So it depends on the other 2 factors (expansions and research techs) but of course also on which AWs we are talking about. An OK AW will help you while other numbers are low, but turn bad when the other numbers go up (without you ever upgrading the AW itself)[BR]So the general advice is too keep all numbers as low as possible and make sure increasing thenumbers serves an actual purpose rather than doing it just because you can.[BR]I personally have reached the limit on useful AWs at around 300 AW levels.[BR]I find 11 AWs to be of general benefit to my game, which means I could go as high as 330 AW levels.[BR]3 or 4 of the above 11 are not neessary for a 100% tourney focus, but are important enough for the rest of the game to make them worth it to me [smilie--sprite1] So I guess 200 AW levels would be enough stricly speaking for a chapter 15 tourney town. Lower chapter tourney towns would of course have fewer of these AWs available and therefore even lower AW levels."}, {"24": "Heymrdiedier said:\t\t\tSince both spire and tournament squad sizes are now totally out of touch with any realistic values, i feel like the valorian valor building and the orc strategist building like dropped their usefullness to like 1% of their previous use. Am i the only one who thinks like that?[BR][BR]like in last chapter the valor building produces 17 units each hour. my barracks make 700 each hour, and its nowhere near enough to do 20 provinces in tournament. I need time boosts and brown bears to be able to have enough units.[BR][BR]So im thinking of trashing these buildings that i have in my city now, anyone has a reason i shouldnt?\t\tClick to expand...[BR]I don´t know what you are talking about? What is unrealistic? I see nothing wrong with the SS in either of the two. [BR][BR]The use of the two buildings is hard to objectively calculate. [BR]If you mean the % of all the troops you need being produced by these buildings, then yes they will produce fewer now than before.[BR][BR]but that is a rather one sided view.[BR][BR]One could argue that the buildings were entirely unnecessary before (troops could be easily produced in sufficient numbers in various other ways), while now every single troop counts. [BR]I would also argue that the Orc Strategists have become much more valuable troops in the new tourneys (more Mist Walker enemies, which are best killed by using Orc Strategists), so while the numbers as a percentage of the total have dropped, their value has increased, especially since for many people producing them in Training grounds is not an option, because of the high cost.[BR][BR]I personally love them both (the Orcs especially). The numbers in my city went down for another reason: more frequent FAs, because I tend to sell and replace them. The more often I sell them the fewer I can replace."}, {"22": "Heymrdiedier said:\t\t\tSince both spire and tournament squad sizes are now totally out of touch with any realistic values, i feel like the valorian valor building and the orc strategist building like dropped their usefullness to like 1% of their previous use. Am i the only one who thinks like that?[BR][BR]like in last chapter the valor building produces 17 units each hour. my barracks make 700 each hour, and its nowhere near enough to do 20 provinces in tournament. I need time boosts and brown bears to be able to have enough units.[BR][BR]So im thinking of trashing these buildings that i have in my city now, anyone has a reason i shouldnt?\t\tClick to expand...For me Grounds of the Orc Strategist is still a really useful building because it's a good fighting unit and it costs regular orcs to produce in the Training Grounds. So in a way, having one of these buildings is a bit like having an Orc nest... I haven't done the maths on which is better."}, {"32": "Pauly7 said:\t\t\tFor me Grounds of the Orc Strategist is still a really useful building because it's a good fighting unit and it costs regular orcs to produce in the Training Grounds. So in a way, having one of these buildings is a bit like having an Orc nest... I haven't done the maths on which is better.\t\tClick to expand...[BR]So far I havent used anything else than blossom mages, rangers, frog princes, and a archer/dryad as a lighting rod for the pesky mistwalkers.[BR][BR]It's a bit boring, and lame that so many units so far turn out to be a dud / useless now."}, {"54": "Gargon667 said:\t\t\tI don´t know what you are talking about? What is unrealistic? I see nothing wrong with the SS in either of the two.[BR][BR]The use of the two buildings is hard to objectively calculate.[BR]If you mean the % of all the troops you need being produced by these buildings, then yes they will produce fewer now than before.[BR][BR]but that is a rather one sided view.[BR][BR]One could argue that the buildings were entirely unnecessary before (troops could be easily produced in sufficient numbers in various other ways), while now every single troop counts.[BR]I would also argue that the Orc Strategists have become much more valuable troops in the new tourneys (more Mist Walker enemies, which are best killed by using Orc Strategists), so while the numbers as a percentage of the total have dropped, their value has increased, especially since for many people producing them in Training grounds is not an option, because of the high cost.[BR][BR]I personally love them both (the Orcs especially). The numbers in my city went down for another reason: more frequent FAs, because I tend to sell and replace them. The more often I sell them the fewer I can replace.\t\tClick to expand...what I'm talkig about:[BR]for example my SS on province 40 is 70000 ish. which means i need 11666 valorions per squad (so thats x5 if you use only those), wich a productionrate of 17/hour, that means i need about 700hours of valorian valor production to get just 1 squad for 1 fight. thats 28 days of production. So even if i fill my city with a huge amount of those valorian valor buildings, i still would take too much time to produce enough. So for me those buildings feel useless now, and i feel you are obligated to use brown bear to get enough troops.[BR][BR]Before this rebalance my troopsize was about 7000 ish, (but you had to fight 4 times) probably even then the valor wasnt that usefull anymore but i felt like every small bit helped. [BR]Now i get the feeling the small bit is too small to be even noticable."}, {"22": "CrazyWizard said:\t\t\tSo far I havent used anything else than blossom mages, rangers, frog princes, and a archer/dryad as a lighting rod for the pesky mistwalkers.[BR][BR]It's a bit boring, and lame that so many units so far turn out to be a dud / useless now.\t\tClick to expand...So if you were facing light ranged units with no light melee in the line up... would you still prefer frogs over orc strategists?"}, {"122": "OldHag said:\t\t\tback on topic.....[smilie--sprite1][BR]I hope my use of eejit isn't too offensive. [smilie--sprite2][BR][BR]There you go, I've said my piece.\t\tClick to expand...[BR]Perfect word hope others understand its meaning   [smilie--sprite1]"}, {"32": "Pauly7 said:\t\t\tSo if you were facing light ranged units with no light melee in the line up... would you still prefer frogs over orc strategists?\t\tClick to expand...[BR]In case you are only opposed by light range I would most likely use my golems since I am an elf and there much easier to come by.[BR]Maybe next week we will see lineups like that, but it's a lot to ask for, 5x light range + line of sight.[BR][BR]And in that case you still have to make the decision do I want to use my precious orc strategist (because even a little loss when you field 150 squads is a darn shitload of loss. or do I use my easy to repleace alternatives.[BR][BR]Off course you already have the space and cannot return it, but would you suggest someone to unlock more expansions to make room for training grounds of the orc strategist?[BR]so you think ~ 1 squad a day per expansions makes a sensible investment in the current format?[BR]I expect that unless you play only a little tournament it makes no sense as in many cases you loose much more than 8 squads by placing that expansion a week.[BR][BR]And besides that if you use hundreds if not thousands of squads a week in the tournament 8 squads are like a droplet of water in the ocean. it does not make sense compared to your unit production rate in your up to 3 \"barracks\""}, {"24": "CrazyWizard said:\t\t\tSo far I havent used anything else than blossom mages, rangers, frog princes, and a archer/dryad as a lighting rod for the pesky mistwalkers.[BR][BR]It's a bit boring, and lame that so many units so far turn out to be a dud / useless now.\t\tClick to expand...[BR]Well the 3 sure are the main units, just as they were in the old tourneys, so not much has changed there.[BR][BR]When the SS gets more uneven I also use quite a lot of Golems now and the Orc Strategists I am also using more now than before. I think I use Vallorians/treants less now than I used to in the old tourneys. But overall I see no big change in what units I use...[BR][BR]I agree more useful units would be nice, but basically I think it means they would have to upgrade some of the other units, which then in the end would most likely result in those units replacing some of the ones we use now instead of using more different units. Honestly in a limited battle system like in elvenar there is only so much you can do, but giving melee troops a boost to make them usable would not be a bad idea I think."}, {"24": "Heymrdiedier said:\t\t\twell I'm not sure fighting is the way to go if you want to score high in tournament.[BR]First of all, if you want to fight you need a lot more wonders to be able to compete compared to catering. More wonders making it again harder to win those fights (or at least bigger losses).[BR]Secondly if you want to do high on fighting you need to do it all manually to make sure the losses are minimal, meaning you spend a whole of a lot of time on tournament. a huge amount more then the time won bu going from 4 -> 1 encounters.[BR][BR]So in my opinion its a lot better to just ignore fighting alltogether if you want to score high in tournament. Ignore fighting means no barracks(es) no armories, no huge hammer consumption. Which is a huge space saver, that again makes it less costy if you lay down less expansions. Imo you'd have so much space leftover, you probably dont even need any wonder at all in your city, just build and extra workshop and factory etc, those make no impact on your difficulty.[BR][BR]The only thing is tho, whats the point then of tournament, what would you do with all those kp you get from it, i can only think of one thing, you spend it all in the wonders of your biggest competitors, making their tournament harder without most of them realising it [smilie--sprite2]Click to expand...[BR]Fighting is absolutely the way to go if you want to score big, catering has no chance whatsoever. It is only a niche tool to make fighting better, but completely pointless if you want to go 100% catering. Of course catering has become better than it was in the old tourneys, but that doesn´t mean it is a viable option as a standard way of doing tourneys.[BR][BR]You can use it to get an easy and steady acceptable average yes. You can also build a specialized low chapter catering-tourney town, which will give you a rather good average, but be rather useless for anything except spire/tourney. And you will not win any tourneys with such a thing either.[BR][BR]The KP rewards of course become useless after a long time of playing big tourneys. But until you have all the good AWs at level 30 the KP do have some use. It also helps with getting through the first 15 chapters quickly rather than slogging....[BR]I am there now (or close enough) and have not much more personal use for KP, but one can always start donating the KP to others instead [smilie--sprite1]"}, {"22": "Far Reach said:\t\t\tAlthough I don't have an account, or post, on the US forums, I have just come across a related effort by the Community Manager there (Nightguest). A link is: https://us.forum.elvenar.com/index.php?threads/tournament-changes.25318/post-194465 . It may be that there is already close working between the different Community Managers, but if not then it might be helpful if @Simaril et al could compare notes with Nightguest.\t\tClick to expand...I just wanted to tie @Far Reach's post into this thread, as this link may be interesting to some. It's certainly the first piece of vague optimism I've seen in a long time."}, {"14": "Pauly7 said:\t\t\tI just wanted to tie @Far Reach's post into this thread, as this link may be interesting to some. It's certainly the first piece of vague optimism I've seen in a long time.\t\tClick to expand...[BR]Whilst I appreciate the quality of the US server's community management, I am at the point where I just can't feel optimism anymore on any Inno game change."}, {"45": "To respond to you @Pauly7 regarding the US Forum post. As Nightguest confirmed we were all involved in this again yesterday. [BR]However my approach is rather to see if there is any possibility of any changes at all before creating a post for this. Once I have anything that is confirmed I will of course let everyone know. [BR]Current state of play is showing that Fellowships are increasing their tournament points and generally doing better in the new Tournaments than the old. More provinces are being completed and more players are starting to manual battle rather than auto due to feeling they have more time to do so. [BR]This latter thing is quite huge as very few players manually battle in the game at all, preferring the one click auto-battle. [BR]As this has rolled out now to all servers, there is of course more statistics to look at than I have mentioned but the ones I have I find quite insightful and hope you will too."}, {"75": "Silmaril said:\t\t\t... more players are starting to manual battle rather than auto ...\t\tClick to expand...Which once again raises the issue of manual battle for app-only, or app-mostly, players ..."}, {"53": "Silmaril said:\t\t\tTo respond to you @Pauly7 regarding the US Forum post. As Nightguest confirmed we were all involved in this again yesterday.[BR]However my approach is rather to see if there is any possibility of any changes at all before creating a post for this. Once I have anything that is confirmed I will of course let everyone know.\t\tClick to expand...[BR]Thanks for the update, and I recognise the caution about the possibility or otherwise of changes.[BR][BR]Leaving the tournament itself aside for a moment, the discussion highlights what (in my view) has been a pretty serious breakdown in communication. Much of the feedback requested and provided on this thread, has used analysis influenced by MinMax's formula. This is of course the simplest and most concise description of the balancing mechanic which we, the player-base have. The US forum post suggests that INNO genuinely don't know whether this formula is (at least approximately) correct, and and such have presumably disregarded all feedback using it. Similarly they appear to have focussed on entirely modelling the average province behaviour, whilst much of our feedback has been on extremes (either highly progressed cities, or cities especially developed to game the formula). [BR][BR]Whether or not the tournament mechanics are changed in any way, I would ask that an effort is made to improve the communication channels. If the dev teams don't want our feedback, then please don't ask us for it, or tell us how valuable it is. If INNO does want our feedback then we need to find a better way to ensure that some  (admittedly quite technical) messages don't get lost in translation."}, {"7": "Silmaril said:\t\t\tMore provinces are being completed and more players are starting to manual battle rather than auto due to feeling they have more time to do so.[BR]This latter thing is quite huge as very few players manually battle in the game at all, preferring the one click auto-battle.\t\tClick to expand...It's not that they want to, but they have to because auto battle just gives too many losses now! So basically, this just means that the ONLY benefit the new system gave (having to spend less time on tournaments because it was becoming a chore) is not even a real benefit because you have to manually battle now in order to not be completely slaughtered.[BR]It blows my mind how you can present such a result (or rather, such an assumption) as something that is 'huge', as if it is a positive development!"}, {"14": "Silmaril said:\t\t\tCurrent state of play is showing that Fellowships are increasing their tournament points and generally doing better in the new Tournaments than the old.\t\tClick to expand...[BR]Good for them, but this was already predicted because the lower chapter players are in far greater numbers than the endgame folks. It still doesn't show that a lot of the endgame players got screwed over for the progress they had made. Some are leaving, and others are selling their level 30 AW's to keep their competitiveness up.[BR]Punished for growing your city, in a city growing game. Get your heads out of your statistics, and in with all the parts of your community. At least Nightguest gets it, or so we hope.[BR][BR][BR]Silmaril said:\t\t\tMore provinces are being completed and more players are starting to manual battle rather than auto due to feeling they have more time to do so.\t\tClick to expand...[BR]Can you actually PROVE that latter part? Or is it just speculation or random jibba-jabba?[BR]Several of the high scoring players are doing manual now because otherwise the losses are too high, not because they \"feel\" they have the time. Basically they are spending just as much time as before, with the 4-fight/province system, meaning the new one-click does nothing for them.[BR][BR]Personally I have not been going as high as I could, because I don't WANT to spend all that time on manual battle. The new system actively makes me feel opposed to doing it."}]