[{"7": "valle said:\t\t\tYou don't know what you are talking about. I know as I only autofights. Youy abviously don't know what troops to select when autofighting.\t\tClick to expand...Again with the personal attacks? I believe you were told off before when you insulted other players that they don't know what they are talking about. Please stop.[BR][BR]Also, your n=1 hardly proves your statement."}, {"22": "Silmaril said:\t\t\tMore provinces are being completed and more players are starting to manual battle rather than auto due to feeling they have more time to do so.\t\tClick to expand...C-Nymph said:\t\t\tt's not that they want to, but they have to because auto battle just gives too many losses now!\t\tClick to expand...I was going to say it, but @C-Nymph already did. For many, or most, people, this has nothing to do with having more time. I am one of the people that has turned to manual fighting now because I have to, just to maintain two thirds of the average I did in the old system. It sounds like a typical dev reaction to take something and see it as a proof of success.[BR][BR]Anyway, my intention is not to get into the difficulty. It is more difficult at higher levels and much much easier at lower levels. We established all that 9 weeks ago. I am interested to see what is being raised now, though and I do wonder why no such similar investigations took place in either testing phase on Beta or EN.[BR][BR]What I want is for them to properly investigate the the effect that AW levels have on difficulty, when being multiplied with other factors. This is where they've got it wrong, no matter how easy or difficult it now is and what scores people are getting... so I hope this is a part of it."}, {"22": "valle said:\t\t\tYou don't know what you are talking about. I know as I only autofights. Youy abviously don't know what troops to select when autofighting.\t\tClick to expand...I can only assume by this stage that you are just trolling people for fun. I think I may block you from my view as it's quite tiresome the way you speak to people."}, {"32": "Silmaril said:\t\t\tTo respond to you @Pauly7 regarding the US Forum post. As Nightguest confirmed we were all involved in this again yesterday.[BR]However my approach is rather to see if there is any possibility of any changes at all before creating a post for this. Once I have anything that is confirmed I will of course let everyone know.[BR]Current state of play is showing that Fellowships are increasing their tournament points and generally doing better in the new Tournaments than the old. More provinces are being completed and more players are starting to manual battle rather than auto due to feeling they have more time to do so.[BR]This latter thing is quite huge as very few players manually battle in the game at all, preferring the one click auto-battle.[BR]As this has rolled out now to all servers, there is of course more statistics to look at than I have mentioned but the ones I have I find quite insightful and hope you will too.\t\tClick to expand...Let me debunk this, the only reason I manually battle is NOT because I feel I have the time to do so.[BR]But it's the only way I can stay relevant in this new format.[BR][BR]I wonder who came up with this conclusion, because I have not even once seen on any forum anywhere see anyone post they do manual because they feel they have more time for it.[BR][BR]Not once![BR]So how on earth did they come to this conclusion?[BR][BR]FYI it now takes 3-5 times as much time as before to do 50-66% of the former amount of provinces,[BR][BR]Talking about time [smilie--sprite3]"}, {"54": "Pauly7 said:\t\t\tI can only assume by this stage that you are just trolling people for fun. I think I may block you from my view as it's quite tiresome the way you speak to people.\t\tClick to expand...I'm with you on this one. I've also considered blocking him multiple times in the past, but tought, ooh well all idiots shut up eventually. But I think its time to do it anyway now. The amount of likes his posts get compared to the one's he's attacking just says enough imo."}, {"8": "Silmaril said:\t\t\tCurrent state of play is showing that Fellowships are increasing their tournament points and generally doing better in the new Tournaments than the old. More provinces are being completed and more players are starting to manual battle rather than auto due to feeling they have more time to do so.[BR]This latter thing is quite huge as very few players manually battle in the game at all, preferring the one click auto-battle.[BR]As this has rolled out now to all servers, there is of course more statistics to look at than I have mentioned but the ones I have I find quite insightful and hope you will too.\t\tClick to expand...[BR]I'm one of those that manual fight in the spire and the tournaments and it's a LOT more time consuming.....the old style was 4 clicks to auto fight a  province, in the new system, each manual battle is a minimum of 5 clicks.....often a manual battle can go for multiple rounds, it's a huge increase in clicks and time over the course of a tournament.  I used to enjoy manual fighting, but it's becoming a chore."}, {"74": "I've sold half my AWs and now the Tournament is easier. So much for AWs help.[BR][BR]The problem is what do I invest the KP I win now, because any AW I get now will make my city worse not better. *Facepalm emoji*"}, {"15": "Pauly7 said:\t\t\tI just wanted to tie @Far Reach's post into this thread, as this link may be interesting to some. It's certainly the first piece of vague optimism I've seen in a long time.\t\tClick to expand...The US post mentions new evidence and individual cases being looked at. It really makes me wonder what could be different on US servers and what cases can exist there that don't exist neither here nor on Beta?  @CrazyWizard (and some other players here) has one of the most extreme cities and somehow that didn't deserve a to be looked on a \"more individual bases\"? Or are there more such cases on Us than here so they can't just swipe them under the rug?[BR][BR]Edit: I found this in a later reply by the CM \" What we found was that the US community is very much the exception to the norm when looking at how players play the game and how Fellowship leaders run their Fellowships (you lot are better, more accepting, and more helpful towards newer players - this apparently does not exist in many other servers).\"[BR][BR]Ok, Archmages, time to be nicer to new players, now that some end-gamers have left you have a few free spots for them, and then maybe they will take a closer look into our server as well [smilie--sprite2]"}, {"22": "Hekata said:Edit: I found this in a later reply by the CM \" What we found was that the US community is very much the exception to the norm when looking at how players play the game and how Fellowship leaders run their Fellowships (you lot are better, more accepting, and more helpful towards newer players - this apparently does not exist in many other servers).\"[BR][BR]Ok, Archmages, time to be nicer to new players, now that some end-gamers have left you have a few free spots for them, and then maybe they will take a closer look into our server as well [smilie--sprite2]Click to expand...Haha, what a lot of flannel. That's the CM trying to ingratiate himself with the players.[BR][BR]Translation - Players on the US server shout the loudest."}, {"15": "Pauly7 said:\t\t\tHaha, what a lot of flannel. That's the CM trying to ingratiate himself with the players.[BR][BR]Translation - Players on the US server shout the loudest.\t\tClick to expand...Yeah, it made me giggle a lot. I think the whole post you liked to is just a very very long and eloquent way to say what way summarised for us as \"keep the feedback coming we're still looking into it\". But hey, maybe we get another of those \"curve corrections\" barely perceptible to the human eye [smilie--sprite1]"}, {"22": "Hekata said:\t\t\tI think the whole post you liked to is just a very very long and eloquent way to say what way summarised for us as \"keep the feedback coming we're still looking into it\t\tClick to expand...But I really like the maverick approach of being transparent and telling the players what he knows... even though he has to put in a load of \"don't quote me on this or I will get in trouble\" caveats."}, {"15": "Pauly7 said:\t\t\tBut I really like the maverick approach of being transparent and telling the players what he knows... even though he has to put in a load of \"don't quote me on this or I will get in trouble\" caveats.\t\tClick to expand...To be quite honest, I would have very much appreciated this when we were in the testing phase, but now I don't really care anymore for \"we're looking into this\" kind of posts, even when nicely phrased like that one. I see no use in getting anyone's hopes up just to see another outburst of anger when nothing is done. If there are some official changes made to the tournament then they can post about it. I have pretty much accepted that this is the game now and it's just up to me to either play it (adapt if it's possible) or look for a new one."}, {"45": "Killiak said:\t\t\tCan you actually PROVE that latter part? Or is it just speculation or random jibba-jabba?[BR]Several of the high scoring players are doing manual now because otherwise the losses are too high, not because they \"feel\" they have the time. Basically they are spending just as much time as before, with the 4-fight/province system, meaning the new one-click does nothing for them.[BR][BR]Personally I have not been going as high as I could, because I don't WANT to spend all that time on manual battle. The new system actively makes me feel opposed to doing it.\t\tClick to expand...[BR]As I am sure you appreciate we are able to look at very fine detail within the game as part of the nature of the tools available within the company. [BR]Additionally general feedback that is coming to us makes the point of players saying they have more time with the 4 now to 1 encounter per province and are finding that because of this they are trying manual combat in many cases for the very first time. [BR]Personally I like this move as I prefer manual combat having played Forge of Empires for many years prior to finding Elvenar. But I appreciate that this is not for everyones game play."}, {"32": "Silmaril said:\t\t\tAs I am sure you appreciate we are able to look at very fine detail within the game as part of the nature of the tools available within the company.[BR]Additionally general feedback that is coming to us makes the point of players saying they have more time with the 4 now to 1 encounter per province and are finding that because of this they are trying manual combat in many cases for the very first time.[BR]Personally I like this move as I prefer manual combat having played Forge of Empires for many years prior to finding Elvenar. But I appreciate that this is not for everyones game play.\t\tClick to expand...[BR]sssst.[smilie--sprite2] you just offended all players wihout access to a computer as the app has no autocombat option, this gives these players a direct disadvantage.[BR]Are you also aware that in the past the did an A/B test . our guess was to see if they could kill of manual in the browser so that they did not need to implement it on the app.[BR][BR]As far as some CM's have stated, there is no intention to implement manual combat on the app any time soon, and I would be extremely suprised if it was even anywhere on the devs roadmap even if you use a binocular.[BR][BR]Why else would you hold an A/B test on the browser? shortly after the app was released? I would say to test the waters on what implementations you could skip on the app.[BR]holding an A/B test inside a family created some forum havoc as the husband was very unhappy he did not have the same options as his wife lol"}, {"32": "Pauly7 said:\t\t\tHaha, what a lot of flannel. That's the CM trying to ingratiate himself with the players.[BR][BR]Translation - Players on the US server shout the loudest.\t\tClick to expand...[BR]I assume all western markets are like that, but it seems to be different on the former \"east bloc\" markets.[BR]They outcry there seems to be much harsher than on the western market. at least from hearsay as I cannot read, nor want to read any fo those languages. Those markets where also the most hardcore when the tournaments where introduced, it was on those markets where the first blueprints were achievend at a time when 10 chest did cost 400.000 points (instead of 40.000) I think you could compare it to the difficulty of 19 chests now. but then without all the phoenixes, combat boosters and bears.[BR][BR]Most hardcore teams with the then current tournament points did not get far beyond the 100-150k barrier so 400K was brutal, and they actually achieved that"}, {"45": "@CrazyWizard I truly hope not as that was not my intention at all.[BR]Just popping some facts here about whats being seen and I would rather be up front about the reality here.[BR]To answer you, yes to the A/B test which made sense as so few players have used the manual battle function in the game.....but the Tournament is changing that already. [BR]So who knows what the future will bring for us in the game? but as soon as I get any information I will of course let you all know."}, {"32": "Silmaril said:@CrazyWizard I truly hope not as that was not my intention at all.[BR]Just popping some facts here about whats being seen and I would rather be up front about the reality here.[BR]To answer you, yes to the A/B test which made sense as so few players have used the manual battle function in the game.....but the Tournament is changing that already.[BR]So who knows what the future will bring for us in the game? but as soon as I get any information I will of course let you all know.\t\tClick to expand...[BR]Well I can understand manual combat being fun if you can use it sparsely. but 10-20 hours of manual combat every week is tedious and boring.[BR]Last week it was 330 battles, and some of those you needed to go back and redo/restart them.[BR][BR]10 battles a day I can understand it might be fun, similar with world map battles when you are new to the game can be fun.[BR][BR]but:[BR]330 tournament battles[BR]~93 spire battles (couniting each wave as a battle)[BR]8-16 world map battles[BR][BR]Thats more than 400 battles a week.[BR]I would challenge you to try it out and see how much fun you still have after 400+ manual battles in a week  [smilie--sprite12][BR][BR]One of the main reasons people stopped with manual battling is the sheer amount of battles, at some point you can no longer handle the burden."}, {"45": "Yep I try and do 30-50 a day, but maybe I am an unusual player here due to being Forge of Empires battle trained [smilie--sprite1]"}, {"22": "I pretty much did no manual fighting before the new tournament style came in. Now I've started doing it, but I'll stress the only reason was to try to improve my tournament scores after they had been cut by 50%.[BR][BR]For the first couple of weeks it was quite fun, but it quickly became tedious. It doesn't hold interest for long because it's always the same. You pick your troops and go through the same routine. The enemies are entirely predictable. The most unpredictable thing about it is when you feel like there's some sort of a glitch because the wrong amount of damage is being done.[BR][BR]I do about 80 or 90 manual battles a week which I'm now making myself do to prevent higher troop losses. I don't know why people would do it for an extended time just for fun. To me it's the same as if I had to play noughts and crosses / tic tac toe 80 times a week... Very dull after a bit."}, {"17": "Hmm[BR]I absolutely adore the manual fight system and truly appreciate the opportunity to go back to using it.  [smilie--sprite1]"}]