[{"84": "I agree with what pauly7 said, it is very rare that we get any official feedback from the devs/design team about feedback given on this forum. When a change is made in the game that players think is wrong and negative feedback starts to roll in the normal Inno response is to stick their heads in the sand and wait for the uproar to go away. It is quite a good ploy when you think about it because when the players have had a scream and shout and get things off their chests they settle down and just accept the change and the devs/design team set about thinking up a new way to upset the players.[BR][BR]As far as the changes to the tournaments are concerned i am going to wait to see how it affects me before i will give feedback. Reading some of the comments on here it seems as though the changes might make things a little easier for my FS to get 10 chests. It seems like the smaller cities might be able to do more while the bigger cities will be able to do less and still the FS will get 10 chests. I'll find out in the next tournament i guess."}, {"14": "valle said:\t\t\tActually you are speculating or guessing a bit. Reason is that we don't know if the version that comes live to EN this week is exactly the same a the one running on Beta. Inno might do some last minutes changing to difficulty calculations, and we don't know if they will do that. It has happened before that live versions have changed since they run on Beta.\t\tClick to expand...[BR]Please count how often Inno has done any actual last minute changes to something that ran on Beta. You'll be done quite quickly."}, {"84": "+1 to what @Killiak said. Any changes that are made to features are made in Beta first and then released to live servers."}, {"22": "This is true, although this is the first time I'm aware of that they've asked one server to further test something before rolling it out to the whole of Live. It may not make any difference, but I see this feedback as slightly more important. They believe that when this hits the broader player base of EN that it will receive a much kinder reception overall than it did on Beta."}, {"15": "Pauly7 said:\t\t\tThey believe that when this hits the broader player base of EN that it will receive a much kinder reception overall than it did on Beta.\t\tClick to expand...EN does have a broader player base but people commenting on the forum are of a similar mindset as those on Beta (and some are the same people), which is normal since it's usually the most active players that are on the forums, and it's the most active players that are about to get hit the hardest. I expect most of the feedback to be similar to Beta.[BR]But the pessimist in me thinks Inno is not as much interested in our feedback here as in the stats they will get form analysing the numbers they get when we start playing. They have set a goal and if the numbers for EN align with that goal they will release it on other servers whatever we may say here. If the numbers are still not satisfying they will tweek it a bit more."}, {"22": "Hekata said:\t\t\tBut the pessimist in me thinks Inno is not as much interested in our feedback here as in the stats they will get form analysing the numbers they get when we start playing.\t\tClick to expand...This is possible. They may just want to look at general tournament participation levels. This is troubling though, as it was on Beta. The reason is that in the first few weeks everyone goes into overdrive trying to test the limits of the new system. For Inno, that means that they see everyone is enjoying it because everyone is playing it. Not only that, but in those early stages a lot of people will be enjoying it. The reason is that even with the old system there could easily be double the number of fellowships getting 10 chests if all the fellows gave it a good go.[BR][BR]So that's what happened on Beta. In the first couple of weeks everyone was getting 10 chests so a lot of people were going \"oh, this is easier for more reward\". Truth is, it definitely is easier to open 10 chests if all fellows participate to the right degree. I expect that effect to be less marked on Live, but it will still be there. After the initial novelty wears off it's possible that participation will then settle back down. It's really hard to take much notice of what happens in the first couple of weeks... and there is a max of 3 weeks to somehow convince Inno of things people would like to see changed."}, {"33": "Killiak said:\t\t\tPlease count how often Inno has done any actual last minute changes to something that ran on Beta. You'll be done quite quickly.\t\tClick to expand...If I'm not totally mistaken they have made changes in quests in events between Beta and live version. Anyway there is no guarantee that they will not do any change. For that reason we can not be 100% sure that it will be the same version as in Beta. But the probability that it will be the same is ofcourse very high."}, {"86": "Whilst this announcement has been made in this forum, still nothing has gone out to the EN servers in the news that this change in tourney format is happening today.  Not everyone reads the forums, and I suspect that not every fellowship has at least one person who does."}, {"87": "Maybe what we´re lacking so INNO could look our demands is to reach them in other places, like Instagram or facebook. For example there's a person that tagged INNO and Elvenar main accounts in Elvenar Facebook group and asked them to not do this new changes, explaining them what this change was pernicious and hurtful for many tournament players, but  instead of many players helping this position, there was lot of negativity from Elvenar players, at least in that post happened that."}, {"33": "EginaThunderr said:\t\t\tFor example there's a person that tagged INNO and Elvenar main accounts in Elvenar Facebook group and asked them to not do this new changes, explaining them what this change was pernicious and hurtful for many tournament players, but instead of many players helping this position, there was lot of negativity from Elvenar players, at least in that post happened that.\t\tClick to expand...[BR]Maybe a lot of Elvenar players (myself included) thinks that these changes are good. Anything that removes thousands of mouseclicks is good [smilie--sprite2] Maybe it's not perfect, but it's certainly better than before."}, {"84": "Most players will not know if the changes are good or bad until they see the new system. You are defending something that most players have not even seen yet. While removing loads of clicks is indeed great news i for one can not claim that the other changes will be good or bad until i see them when the tourney starts."}, {"27": "valle said:\t\t\tMaybe a lot of Elvenar players (myself included) thinks that these changes are good. Anything that removes thousands of mouseclicks is good [smilie--sprite2] Maybe it's not perfect, but it's certainly better than before.\t\tClick to expand...There is one thing I must admit Inno did great: bundling the tournament rebalance with reducing encounters from 4 to 1 was plain genius. It leads to mixed feedback and allows people to talk about different things while supposedly “arguing with each other”.[BR][BR]And the best thing is: there is not really the strong need for the reduction anymore. If we are forced by insane difficulty to stop so much earlier, it means we are naturally doing less encounters, lol."}, {"58": "I find it interesting that we get an in-game message about a FA in a few days, but no mention about the modified tournament  later today. Seems not important enough [smilie--sprite3]"}, {"14": "valle said:\t\t\tIf I'm not totally mistaken they have made changes in quests in events between Beta and live version. Anyway there is no guarantee that they will not do any change. For that reason we can not be 100% sure that it will be the same version as in Beta. But the probability that it will be the same is ofcourse very high.\t\tClick to expand...[BR]99,99999% that it will be the same. Changing a quest number, or adding an alternative option to a single quest in an event is not even remotely comparable to a big game-change like this. The big things are NEVER changed from Beta to Live, even if the final Beta comments are mostly negative.[BR][BR]I don't mind you trying to find a positive note in all of this Valle, but the reality of the matter is that Inno is :[BR]- hard-nerfing a very popular and big part of the game[BR]- punishing people for actually spending money and growing their city and AW[BR]- ignoring their bigger (and paying) players on Beta, who used actual math to show they are getting screwed here[BR][BR]You can try to run arguments in circles around this and dodge these main points, but everything you have said so far does NOTHING to counter these facts.[BR][BR]Just because you personally are barely affected, or because a bunch of other people will hardly notice it because they barely bothered to ever get above 1K points, once again, does NOTHING to counter these facts.[BR][BR]There could be a fix in making the AW part of the formula additive, instead of cumulative, making growth a lot less punishing, but this thought was pretty much just ignored on the beta. I can only hope that Inno will suffer financially from this change, and see the error of their ways.[BR][BR][BR]@Silmaril : I have said this before, but Inno is truly poor (I would use other choice words, but forum rules) at communicating. Apparently this is something they will never ever learn.[BR]Why the heck is there not information given in-game already!!!?? The players should have been informed in-game DAYS ago. Serious failure on Inno's part."}, {"33": "Killiak said:\t\t\t99,99999% that it will be the same. Changing a quest number, or adding an alternative option to a single quest in an event is not even remotely comparable to a big game-change like this. The big things are NEVER changed from Beta to Live, even if the final Beta comments are mostly negative.\t\tClick to expand...[BR]But they might change some modifiers, like how much every expansion effects difficulty. Bottom line is that feedback in this thread shall be on the EN version and not on the Beta version. If we start to mix feedback from both versions it will be very confusing.[BR][BR]Killiak said:\t\t\tJust because you personally are barely affected .....\t\tClick to expand...[BR]And you evidently don't know what you are talking about. [BR]I guess I'm as affected the same way as most of the people writing in this thread. I will probably miss 200+ fp every week because of this. [BR]But I realize that for this game this amount of 'almost free' kp that has been given out is harmful. So decreasing it is a must to avoid super infaltion."}, {"22": "Killiak said:\t\t\tWhy the heck is there not information given in-game already!!!?? The players should have been informed in-game DAYS ago. Serious failure on Inno's part.\t\tClick to expand...Quite. There has been no communication at all in-game. Apart from anything else, no one who doesn't use the forum would even be aware of the early start time today. If it weren't for communication between ourselves then at least 20 of our fellows would be completely unaware. I am sure that there are LOADS of fellowships where not a single person frequents this forum."}, {"22": "When I think about it more... Do we think the new tournaments are actually going to kick in today? Perhaps they've delayed it and not told us. The lack of an announcement is just too weird and surely we would have seen update notes reflecting it too... because it has to be implemented in a major game update."}, {"88": "Pauly7 said:\t\t\tWhen I think about it more... Do we think the new tournaments are actually going to kick in today? Perhaps they've delayed it and not told us. The lack of an announcement is just too weird and surely we would have seen update notes reflecting it too... because it has to be implemented in a major game update.\t\tClick to expand...[BR]@Pauly7 , the mobile version and the desktop version are already at version 1.111.1 which is version from beta with all the tournament changes."}, {"33": "It's up and running.[BR]I've done 40 provinces this far. From reading here I didn't expect to get much further than 20. Catered 5 or 6. Catering is not that expensive so I can probably cater a lot of provinces if wish.[BR]I've only autofighted, mostly using 5 crossbowmen. Boosts 2 ELM, 1 DA and fire phoenix at max level.[BR][BR]So first impression is positive. Time spent is problably between 1/3 and 1/4 of what it would normally take."}, {"88": "@valle , I also did 40 provinces but from the @MinMax Gamer sheet, I would not go further. Province 40 is the first 1* province that has a your/enemy squads ratio of 2.0x stronger than your own squad size, after that it racks up 2.1, .... and so forth[BR][BR]On 2* province the 2x ratio already starts at province 35...[BR]So I will wait with my verdict on this [smilie--sprite1]"}]