[{"17": "anonglitch said:\t\t\tThat means it is something to check again. Can you or @Pauly7 replicate this bug, or maybe even screencast it? If so, please contact our support.\t\tClick to expand...I have been playing with this, it is a display error only."}, {"22": "Lelanya said:\t\t\tI have been playing with this, it is a display error only.\t\tClick to expand...Is this about the frog thing? Is it just me or are frogs always the ones that are a bit glitchy? I've also had a problem when trying to make them move one square, but instead it just skips it and moves onto the next unit. I might be doing something wrong, but it's always with a frog."}, {"17": "Lol I think that is just you.  Plenty of my US Server friends rely on frogs, and that's a new one.  Your 'stand your ground' command is the same as a pass the turn.  You must choose with more care.   That just shows, you need to do some manual fighting every week to keep up mousing skills hon."}, {"22": "Lelanya said:\t\t\tLol I think that is just you.  Plenty of my US Server friends rely on frogs, and that's a new one.  Your 'stand your ground' command is the same as a pass the turn.  You must choose with more care.   That just shows, you need to do some manual fighting every week to keep up mousing skills hon.\t\tClick to expand...Ohh OK, I think I get it. So if I click on the square that I'm already on that means \"stand your ground\" and it skips to the next unit? With Frogs I'm only trying to click one square away, so I'm probably not clicking carefully enough. I'll keep that in mind.[BR][BR]I am doing manual fighting every week, but I've really only been doing it in earnest for 9 weeks, so I guess there can still be some things to get right."}, {"17": "The really important thing is moving to a strategic location.   The  game has been moving units where the battle AI wanted them, not where the player put them, but that was during Dust tourney.   This has improved again [smilie--sprite1]"}, {"14": "Silmaril said:\t\t\tAs I am sure you appreciate we are able to look at very fine detail within the game as part of the nature of the tools available within the company.[BR]Additionally general feedback that is coming to us makes the point of players saying they have more time with the 4 now to 1 encounter per province and are finding that because of this they are trying manual combat in many cases for the very first time.[BR]Personally I like this move as I prefer manual combat having played Forge of Empires for many years prior to finding Elvenar. But I appreciate that this is not for everyones game play.\t\tClick to expand...[BR]Very fine detail you say, but the US postings by Nightguest suggest that the devs have only been looking at averages and big numbers, and only now are looking at specific cases where their formula is wreaking havoc. You speak of \"very fine detail\", when several people in this forum have actually been telling you that they are now doing manual, NOT because of the time, but because of the losses.[BR]You post also suggests that you are just looking at general feedback; averages, that do not represent the current gamestate for the minority of endgame and/or 'hardcore' players.[BR][BR]In my opinion, this \"very fine detail\" is as such not being applied very well. Your statement, without knowing the details and nature of your \"tools\", tells me exactly nothing.[BR][BR][BR]Silmaril said:\t\t\tJust popping some facts here about whats being seen and I would rather be up front about the reality here.\t\tClick to expand...[BR]Yeah. The fact being that something is being seen, not that what is being seen is actually factual.[BR]\"What's being seen\"  doesn't automatically mean it is correct. I take on assignments in government related fields, and I can assure you that Inno and their employees would not be the first ever to let themselves be led astray by statistics and reports, only to realize afterwards they've been fooled by their numbers.[BR]There's a reason the saying goes \"There's lies, damned lies, and statistics.\""}, {"24": "Pauly7 said:\t\t\tHaha, what a lot of flannel. That's the CM trying to ingratiate himself with the players.[BR][BR]Translation - Players on the US server shout the loudest.\t\tClick to expand...[BR]US shouting the loudest? never heard that one before [smilie--sprite8][BR][BR]To be honest US is far bigger than EN, just look at the number of servers. Not that that excuses anything..."}, {"122": "What i cant understand was Beta did testing followed by us and all our feedback fell on deaf ears but the US server start giving the same feed back and they get listened to  ...US shouting the loudest? what  does that mean we gave Inno a massive amount of feed back and we were shouting out that it was not working  ."}, {"39": "I think it has nothing to do with US or any other \"shouts\" in forums, but it is about the stats of how many people have abandoned the game since the introduction of new tournaments. We see spaces opening up in the top FSs every week and not filled as fast as before. As to the manual fighting, it's not for everyone, not to mention PC system requirements to be able to do so. I absolutely hate it and I will never start doing it, not ever."}, {"122": "Regina8 said:\t\t\tI think it has nothing to do with US or any other \"shouts\" in forums, but it is about the stats of how many people have abandoned the game since the introduction of new tournaments. We see spaces opening up in the top FSs every week and not filled as fast as before.\t\tClick to expand...[BR]They were well warned about players leaving and fellowships not filling up"}, {"22": "Regina8 said:\t\t\tI think it has nothing to do with US or any other \"shouts\" in forums, but it is about the stats of how many people have abandoned the game since the introduction of new tournaments.\t\tClick to expand...If they had any issue with people leaving the game then they wouldn't knowingly put out a system that penalises the most advanced players.... and it is knowingly because we've been telling them and talking about it for about 3 months now.[BR][BR]I see the same too. I've never seen so many spaces in top fellowships. Inno are driven by statistics on their screens so they may well have no idea how many people people are leaving the game unless they are looking at the fine detail of whether players are actually logging back in to play. I speak to so many people now who say they are \"taking a break\". Most of those people will not be back. They just don't necessarily want to say it's final.[BR][BR]So perhaps with whatever's happening now they are finally taking a look at some of this fine detail mentioned, but as everyone has been saying - why did it take 3 months of complaints and moving onto the US server before they take this interest? I guess because there are a bigger number of them so they are now seeing a greater impact in terms of the percentage of all players."}, {"32": "Pauly7 said:\t\t\tIf they had any issue with people leaving the game then they wouldn't knowingly put out a system that penalises the most advanced players.... and it is knowingly because we've been telling them and talking about it for about 3 months now.[BR][BR]I see the same too. I've never seen so many spaces in top fellowships. Inno are driven by statistics on their screens so they may well have no idea how many people people are leaving the game unless they are looking at the fine detail of whether players are actually logging back in to play. I speak to so many people now who say they are \"taking a break\". Most of those people will not be back. They just don't necessarily want to say it's final.[BR][BR]So perhaps with whatever's happening now they are finally taking a look at some of this fine detail mentioned, but as everyone has been saying - why did it take 3 months of complaints and moving onto the US server before they take this interest? I guess because there are a bigger number of them so they are now seeing a greater impact in terms of the percentage of all players.\t\tClick to expand...[BR]Leave statistics have a 30 day delay, it also depends on how you look at those statistics.[BR]Many new players come and leave. so the aditional x% might not be visible immediatly unless you sort the data and look on specific levels.[BR][BR]Lets say how many players leave after 6,12,18,24 and 36+ months.[BR]And then the statistic I am most interesten in, how many of the long term paying players are leaving.[BR][BR]Also how is income affected on those levels since pre beta announcement, since beta announcement, and since live release.[BR]How many \"expansions\" have been sold in the group 6+ months, and how does that develop trend develop?[BR][BR]and an interesting one how many players will pay for expansions in chapter 17 compared to 16 when it's released on live."}, {"22": "CrazyWizard said:\t\t\tHow many \"expansions\" have been sold in the group 6+ months, and how does that develop trend develop?[BR][BR]and an interesting one how many players will pay for expansions in chapter 17 compared to 16 when it's released on live.\t\tClick to expand...Sadly it's unlikely that there will be much noticeable difference here as the average player has no idea that placing those expansions is now a detriment to them. They may continue to spend - maybe even spend more - until they realise that they've run out of patience with it and quit."}, {"32": "Pauly7 said:\t\t\tSadly it's unlikely that there will be much noticeable difference here as the average player has no idea that placing those expansions is now a detriment to them. They may continue to spend - maybe even spend more - until they realise that they've run out of patience with it and quit.\t\tClick to expand...[BR]Yeah there is a pretty big delay in such cases, it takes a while for the community to get the hang of it, just like for non mandatory SS.[BR]eventually it did show up in the data.[BR][BR]Tho in this case it might show up earlier as the high level players are often better informed directly or by being in a better informed fellowship."}, {"17": "It seems to be that NightGuest checked the formula that many high end players are basing their complaints on, and found it flawed.  He hints Inno's actual system is a good deal more complex, and the mods here have tried telling us this.[BR]It also seems that the players who were able to analyze this for themselves had better developed cities on the US server than folks did here, and were better able to challenge the new tournament formula.  [BR]I welcome further tweaks, and feel hopeful about the future."}, {"22": "Lelanya said:\t\t\tIt seems to be that NightGuest checked the formula that many high end players are basing their complaints on, and found it flawed. He hints Inno's actual system is a good deal more complex, and the mods here have tried telling us this.\t\tClick to expand...Yes, it seems like @MinMax Gamer got to much the same end result (within 0.2% accuracy) with a different formula which, by the sounds of it, was much simplified to do the same job."}, {"22": "Lelanya said:\t\t\tI welcome further tweaks, and feel hopeful about the future.\t\tClick to expand...I do welcome tweaks, but I have very little interest in them doing something that makes it slightly easier again. I want them to come to terms with the flaws in the system. For me personally, it can be as hard as they like so long as you can see that progress means improvement."}, {"32": "Lelanya said:\t\t\tIt seems to be that NightGuest checked the formula that many high end players are basing their complaints on, and found it flawed.  He hints Inno's actual system is a good deal more complex, and the mods here have tried telling us this.[BR]It also seems that the players who were able to analyze this for themselves had better developed cities on the US server than folks did here, and were better able to challenge the new tournament formula. [BR]I welcome further tweaks, and feel hopeful about the future.\t\tClick to expand...[BR]If you can write down a formula in 2 ways with the same outcome. then both formula's are correct.[BR]MinMax has chosen not to polish his formula this time to 0% deviation, as there was both a time contraint to get an anwser, and a tiny deviation in the end result does not create  ahuge difference.[BR][BR]His old formula (before they started to change some of the values) was pretty much 100% accurate.[BR]His current values results are \"close enough\".[BR][BR]Just check his formula agains your own results and you will see it's almost perfectly accurate."}, {"14": "Lelanya said:\t\t\tIt seems to be that NightGuest checked the formula that many high end players are basing their complaints on, and found it flawed.  He hints Inno's actual system is a good deal more complex, and the mods here have tried telling us this.\t\tClick to expand...[BR]His exact words were :[BR]What's more, I have been looking at the various formulas that have been made by the community for the tournament system and cannot verify that they are entirely accurate. That said, I'm not saying that they are definitely wrong, what I mean is that the entire thing is rather complex and I will give you some answer only when I am certain of being correct (the last thing I want to do is look like an idj-stick getting facts wrong).[BR][BR]It would seem to me that your conclusion is very premature."}, {"73": "Killiak said:\t\t\tHis exact words were :[BR]What's more, I have been looking at the various formulas that have been made by the community for the tournament system and cannot verify that they are entirely accurate. That said, I'm not saying that they are definitely wrong, what I mean is that the entire thing is rather complex and I will give you some answer only when I am certain of being correct (the last thing I want to do is look like an idj-stick getting facts wrong).[BR][BR]It would seem to me that your conclusion is very premature.\t\tClick to expand...Agree totally. @Lelanya I know @randblade  deleted AWs and I calculated with him. His SS reduced as predicted by the minmax model. [BR]it’s easy to check leveling up 1 aw per week. Or do 1 tech per week. I welcome you to try it, and check your SS Change and the model prediction."}]