[{"73": "Let’s[BR]Pauly7 said:\t\t\tSadly it's unlikely that there will be much noticeable difference here as the average player has no idea that placing those expansions is now a detriment to them. They may continue to spend - maybe even spend more - until they realise that they've run out of patience with it and quit.\t\tClick to expand... let’s make sure we instruct new comers of the penalties. [BR]we don’t want them to fall into the same pit as us. I regret placing premium expansions."}, {"73": "Silmaril said:\t\t\tYep I try and do 30-50 a day, but maybe I am an unusual player here due to being Forge of Empires battle trained [smilie--sprite1]Click to expand...Thanks for motivating Sil. I manual battled for a couple of weeks. [BR]After that each time I clicked, there was only one thought repeating in my head, “go, get a life”."}, {"17": "Lolol I do not run the numbers at all.  *yawn*[BR]I will assist others in collecting them, but I just have at it; like many others who do not post here.  There is so much I could say about why others don't bother [smilie--sprite11][BR]It's way more fun to just jump in and match strategies against the battle AI.  (PSSSTTT!! We need an icon to express battle joy).[BR]See  when you fight manually you can always withdraw when the lines are mismatched; something that is missing during autofight."}, {"32": "Lelanya said:\t\t\tLolol I do not run the numbers at all.  *yawn*[BR]I will assist others in collecting them, but I just have at it; like many others who do not post here.  There is so much I could say about why others don't bother [smilie--sprite11][BR]It's way more fun to just jump in and match strategies against the battle AI.  (PSSSTTT!! We need an icon to express battle joy).[BR]See  when you fight manually you can always withdraw when the lines are mismatched; something that is missing during autofight.\t\tClick to expand...Only when there are no mistwalkers involved, as they always go first and most of the damage is already done at that time.[BR][BR]That makes this week exceptionally miserable."}, {"22": "New idea for a military instant:[BR][BR]Landmines - When activated a row of them are placed, before the battle, three squares in front of the enemy line... Then all the Mistwalkers walk forward and step on them. [smilie--sprite6]"}, {"24": "Pauly7 said:\t\t\tNew idea for a military instant:[BR][BR]Landmines - When activated a row of them are placed, before the battle, three squares in front of the enemy line... Then all the Mistwalkers walk forward and step on them. [smilie--sprite6]Click to expand...[BR]lol [smilie--sprite8] love it!"}, {"17": "CrazyWizard said:\t\t\tOnly when there are no mistwalkers involved, as they always go first and most of the damage is already done at that time.[BR][BR]That makes this week exceptionally miserable.\t\tClick to expand...Lol[BR]Bring some tough guys, like the Orc Strats or Vallorian Guard,  that shrug off a pesky sting."}, {"40": "As far as I determine, providing feedback here regarding the recent tournament changes appears to serve little purpose but for what it's worth two very experienced, active players in my Arendyll fellowship, each with a ranking score of over 1.4 million, have quit the game because of them. I'll not provide names but here's a small extract from conversations with them:[BR][BR]\"Thank you very much to everyone for the many years of great fun as well as all the good laughs. Truly will miss each and everyone of you! Unfortunately I just don't like the changes made to the tournaments and think it's best to move on and focus on RL. The only feature of the game that I greatly enjoyed has been butchered in my opinion and doesn't seem like anything will change.\"[BR][BR]and[BR][BR]\"I don't need to explain why the bit of the game I enjoyed the most (the tournaments) is now flat and chore-like as we all know that even if Inno don't.\"[BR][BR]So, basically, Inno can add 2 more to the post-tournament changes casualty list."}, {"22": "EdwardTrunk said:\t\t\tSo, basically, Inno can add 2 more to the post-tournament changes casualty list.\t\tClick to expand...Plus remember, for every person who publicly states that they are leaving the game and says their goodbyes, I would bet that there are at least 20 more who just stop bothering to log in, or decide to take a break, without ever calling it permanent."}, {"32": "Lelanya said:\t\t\tLol[BR]Bring some tough guys, like the Orc Strats or Vallorian Guard,  that shrug off a pesky sting.\t\tClick to expand...[BR]Problem is the attack in the first round.[BR]They will not attack the orc strats as they are near the bottom of the 1st round attack list.[BR]Which looks like:[BR]Sorceres, dryad, archer, blossom, banshee, treant, ranger, drone rider, dword dancer, cerberus and then the rest.[BR][BR]Valorian guards agains mistwalkers? [smilie--sprite9] [BR]I would not advise that[smilie--sprite6][BR][BR]The problem is \"the other\" units that are combined, it it's a bunmch of heavy melee, the last thing you want to have your strategist deal with are heavy melee.[BR]Off course you could place mages or light range agains them, but the mistwalkers attack those and create decent to heavy damage as a result as the attack order would attack those before the strategist.[BR][BR]Part of being able to go \"deep\" into a tournament is not if you can win, but by mitiligating losses.[BR]the more mistwalkers are in the battlefield the more difficult it becomes to mitiligate the losses as there is no way to preemptive strike agains them as they have the highest initiative in game."}, {"57": "I am in a happy and stable FS[BR]Second leaver since the change \"Unfortunately I just don't like all the changes made in the game and think it's best to move on and focus on RL. The only feature of the game that I greatly enjoyed has been butchered in my opinion and doesn't seem like anything will change.\"[BR]Top 100 player on 'my' server. How's that for a statistic!"}, {"17": "Lol yep [BR]Bonk on the head  dead Mistwalker"}, {"122": "Its sad news to see more leaving the game [BR]going by there rankings they have been playing for some time and its a shame that Inno never listened to the warnings about this happening [BR]I remember reading this in an older post   ..out with the old and in with the new players ..it is sad if that is there big plan"}, {"84": "I don't think it is their plan but more like they don't care because they know new players will come along that will not know things were different so will just play along unaware that the more they progress and the more money they spend the harder they are making things for themselves."}, {"75": "Timneh said:\t\t\tI don't think it is their plan but more like they don't care because they know new players will come along that will not know things were different so will just play along unaware that the more they progress and the more money they spend the harder they are making things for themselves.\t\tClick to expand...Best that the information is as widely distributed as possible then, especially to up and coming players within fellowships ..."}, {"24": "I just had an idea, there might be a new niche on the market for FS now: Gold medal spire/recreational tourney.... [BR]Then again recreational tourney still gets you 10 chests anyway.... So I suppose that is what many FS already do."}, {"22": "Gargon667 said:\t\t\tI just had an idea, there might be a new niche on the market for FS now: Gold medal spire/recreational tourney....[BR]Then again recreational tourney still gets you 10 chests anyway.... So I suppose that is what many FS already do.\t\tClick to expand...It's sort of going that way now anyway because with a small amount of organisation fellowships can now get 10 tournament chests. The ones that were doing it anyway no longer have to even think about it. So, suddenly tournaments are shelved as something that happens in the background... or probably more commonly - something people do individually depending on how much of the personal prizes they want. [BR][BR]So yeah, the Spire naturally becomes the area of focus."}, {"79": "so,guys,is it safe to research optional ss now?or wait a bit longer?"}, {"22": "alsael said:\t\t\tso,guys,is it safe to research optional ss now?or wait a bit longer?\t\tClick to expand...I think it's probably safe. The new tournament style is rolled out to all Live worlds now and they declared it working as intended. There is a slight question mark now over whether they are going to make more changes following investigations on the US server, but I wouldn't imagine that they will do anything more than a minor tweak or two. I would be very surprised if they suddenly scrapped it and said the optional SSUs are suddenly going to be relevant again, especially considering there would be fresh uproar from those who have already completed them."}, {"54": "Pauly7 said:\t\t\tI think it's probably safe. The new tournament style is rolled out to all Live worlds now and they declared it working as intended. There is a slight question mark now over whether they are going to make more changes following investigations on the US server, but I wouldn't imagine that they will do anything more than a minor tweak or two. I would be very surprised if they suddenly scrapped it and said the optional SSUs are suddenly going to be relevant again, especially considering there would be fresh uproar from those who have already completed them.\t\tClick to expand...I'm with you on this, except for the very last part. I don't have the impression an imminent uproar would stop them on any decision, why else would they have pushed this to live?"}]