[{"8": "hmmm, I'm a bit confused on this.....I haven't done the optional ss researches....but I thought number of researches done, count toward tournament difficulty, is that wrong?"}, {"17": "OldHag said:\t\t\thmmm, I'm a bit confused on this.....I haven't done the optional ss researches....but I thought number of researches done, count toward tournament difficulty, is that wrong?\t\tClick to expand...Optional researches are outside of the equation.   Part of the reason is that from Constructs onward we need to have completed the SS Upgrades for the troop production buildings and Wonders to give a good amount.  Also the game wasn't designed to be played,  with all of them skipped."}, {"8": "Ah, ok, thanks @Lelanya [smilie--sprite1]"}, {"53": "OldHag said:\t\t\thmmm, I'm a bit confused on this.....I haven't done the optional ss researches....but I thought number of researches done, count toward tournament difficulty, is that wrong?\t\tClick to expand...[BR]Mandatory researches count, but not optional ones. At this time (and very probably for ever) option ss researches will not increase tournament costs in any way.[BR][BR]A quick summary of the context [which most readers may already know][BR][BR]In the tournament, prior to the changes the cost of an encounter depended entirely on your squad size. Lots of us had learnt this or figured it out (and stopped doing optional squad sizes for that reasons), but I don't think that Inno had commented on the issue prior to their video announcing the new tournament changes (as linked to in the Announcements thread). There they state that under the then formula \"doing optional [squad-size] research can actually hurt your tournament progress\". This was perceived by Inno as unfair (and I suspect that virtually all players would agree). [BR][BR]In the new tournament Inno's entirely new formula was explained as having the main idea that \"every single factor is contributing less to your costs than it does to your own strength\" so that \"there is no way that you can build something which helps you less than it increases the costs\".[BR][BR]I think that most everyone (both Inno and the vast majority of players) agree that the optional squad size researches shouldn't be penalised. They aren't penalised at the moment, and it seems inconceivable that the devs would reintroduce a penalty.[BR][BR]The vast majority of players on the forums seem to agree with Inno's aim for the new difficulty formula, but many (including myself) believe that they have significantly failed to meet that aim. (Inevitably some players will benefit, just as others are penalised though - so it may be harder to judge the overall view of the player-base on the new formula's effects.) If any changes are made, then I imagine that they would be intended to make the formula fairer. (Of course there are also posts from those who believe that Inno had other motives, and always intended to penalise very progressed players. If that more cynical view is true then perhaps we won't see any improvements at all.)"}, {"17": "Two game developers just held a Q&A.  They refused to answer any questions related to tournament at all.[BR]For those who are disappointed with some of the changes, I guess you will have to decide:[BR]Do you love Elvenar?  Enough to help us sort out a new strategy to get more out of the game, regardless of tournament changes?[BR]Folks I asked the hard question early, and it was plain that we would not be told any answers that we have not already read."}, {"45": "That is quite correct @Lelanya as the Q&A was for the Misty Forest event its unheard of for any that do these Live's to deviate from the topic."}, {"14": "Silmaril said:\t\t\tThat is quite correct @Lelanya as the Q&A was for the Misty Forest event its unheard of for any that do these Live's to deviate from the topic.\t\tClick to expand...[BR]Regina8 said:\t\t\tWell, they did answer questions about search for FSs on the app and oversupply of scrolls (apparently they're aware of that problem lol), those are not event related questions. So why didn't they answer any tournament questions?\t\tClick to expand...[BR]Yes, unheard of!  I had to laugh a little at this.[BR][BR]Let's be honest; the tournament is a 'Hot Potato' that they don't want to touch."}, {"17": "Silmaril said:\t\t\tThat is quite correct @Lelanya as the Q&A was for the Misty Forest event its unheard of for any that do these Live's to deviate from the topic.\t\tClick to expand...Except that we were repeatedly asked if we had any questions for them, event or gameplay or...[BR]How very interesting that this is the part of my post that got the focus."}, {"45": "Given I have been asked to give more information to help players have a better understanding of what happens in development. I thought it worth mentioning that the Q&A was done about the Misty Forest by devs who work on the Events. Not on the Tournament.[BR]Please remember that we have many developers dealing with all aspects of the game."}, {"100": "Silmaril said:\t\t\tThat is quite correct @Lelanya as the Q&A was for the Misty Forest event its unheard of for any that do these Live's to deviate from the topic.\t\tClick to expand...They repeatedly took in the past all different kind of questions, being this about the event or not, they even answered me one time about the \"father three\" situation and if this building would go back in certain event or not, they even answered in this Q&A much more untopic questions as those that appeared in the past Q&A`s, for example the scrolls imbalance that was caused by the incorporation of the Moonstone Library set and many more unrelated questions of Elvenar, but surprisingly all the messages and comments about the new tourney that did flood their live streaming didn´t were answered.[BR][BR]It is just that they are scare to say: \"Yes, we ruined the tournament cause we did want more money and we don´t care if this damage a lot of players, including our more loyal ones\" As simple as that??"}, {"134": "What's happening in the currant, crystal, tournament? Many of us in my FS have had troops killed in the first or second rounds, and this has continued up to today's round. I know things have become harder but this tournament is taking the mickey! If it continues like this there won't be any point in trying to use troops at all!"}, {"22": "Twigjam said:\t\t\tWhat's happening in the currant, crystal, tournament? Many of us in my FS have had troops killed in the first or second rounds, and this has continued up to today's round. I know things have become harder but this tournament is taking the mickey! If it continues like this there won't be any point in trying to use troops at all!\t\tClick to expand...Are you auto or manual fighting? There will be heavy losses on auto in this one due to the frequent combination of Mage and Heavy Ranged enemies. There are quite a lot of Mistwalkers too, which always throw a spanner into the works."}, {"134": "Pauly7 said:\t\t\tAre you auto or manual fighting? There will be heavy losses on auto in this one due to the frequent combination of Mage and Heavy Ranged enemies. There are quite a lot of Mistwalkers too, which always throw a spanner into the works.\t\tClick to expand...[BR]Auto fighting. The thing is I've never known the crystal tournament to be this hard and I've been playing for 4 years. In fact I've never known any tournament in which the troops are killed off in the 1st and 2nd rounds for many players. Seems that something's changed."}, {"22": "Twigjam said:\t\t\tAuto fighting. The thing is I've never known the crystal tournament to be this hard and I've been playing for 4 years. In fact I've never known any tournament in which the troops are killed off in the 1st and 2nd rounds for many players. Seems that something's changed.\t\tClick to expand...Something has changed. We moved onto the new tournament system. This is now the second crystal tournament of the new style. With Mages and HR appearing in equal numbers it isn't often that there's a useful combination of enemies for auto-fighting."}, {"134": "Pauly7 said:\t\t\tSomething has changed. We moved onto the new tournament system. This is now the second crystal tournament of the new style. With Mages and HR appearing in equal numbers it isn't often that there's a useful combination of enemies for auto-fighting.\t\tClick to expand...[BR]I think I'll be focusing more on catering from now on, although I much prefer using troops. [smilie--sprite3]"}, {"27": "I posted my feedback way earlier and I used few assumptions there. Not everything turned out the way I expected, so I’m going to act fair and update my feedback. [smilie--sprite2][BR]FieryArien said:\t\t\tFor our relaxed fellowship the new tournament seems to have the following real impact:[BR]* We reach similar number of chests as before, namely 5-6. (I'm hoping for more sixes, but time will show.)\t\tClick to expand...Our fellowship performance actually improved a bit. We do not really reach more chests, but the 6th is kind of stable now, which is certainly an improvement.[BR]FieryArien said:\t\t\tPersonally, the new tournament affected me in a bad way.[BR](...)[BR]Loss of blueprint once per cycle, because there is no way our relaxed fellowship could score 10k in the new system.\t\tClick to expand...Here I must give an update. We did get the 10th chest in the steel tournament (that was the once-per-cycle occasion I spoke about). I was really really sure we wouldn’t make it in the new system and I wasn’t even planning to try. However, the tournament came and people automatically expected we go for 10 chests, so we went and we succeeded. I’m glad it still can be done similarly as before.[BR][BR]There is one thing I very much like on the new tournament (besides the 1 encounter per province obviously). It’s the fact that the difficulty doesn’t really go up with additional rounds. I mean in the old tournament the first rounds were easy and it got harder and harder with each star (no matter the number of province). It was hard to guess how far can the player go to be able to fight the remaining rounds (stars) in the chosen number of provinces. Now the difficulty scales with the province number (the same difficulty as province number -1 with star +1) and so the rounds are very similar in difficulty. It’s easier to estimate the optimal number of provinces to play during the first round.[BR][BR]That being said: I still don’t like the new tournament. It has more to do with the dishonest way it was communicated to us than with the new mechanics itself. The bitter taste lingers on and I’m reminded of it every week when playing this new tournament. Being in the middle of Embassies chapter with those huge KP requirements doesn’t help either."}, {"33": "Pauly7 said:\t\t\tWith Mages and HR appearing in equal numbers it isn't often that there's a useful combination of enemies for auto-fighting.\t\tClick to expand...[BR]5 priests works well against a combo of mages and HR on auto. This is a  good week to use some mage boosts."}, {"4": "valle said:\t\t\t5 priests works well against a combo of mages and HR on auto. This is a  good week to use some mage boosts.\t\tClick to expand...[BR]I have done well with 2 ELR boosts and 2 DA using mainly Forest Wardens and Poison Dryads with the odd Mortar or Frog."}, {"24": "Twigjam said:\t\t\tAuto fighting. The thing is I've never known the crystal tournament to be this hard and I've been playing for 4 years. In fact I've never known any tournament in which the troops are killed off in the 1st and 2nd rounds for many players. Seems that something's changed.\t\tClick to expand...[BR]Crystal was never the easiest or hardest of tourneys before and I think it still is neither, so I don´t think it changed much in comparison to other tourneys, but of course all tourneys got more difficult. So new Crystal is of course much more difficult than old Crystal.[BR][BR]Did you miss the fact that we have new tourneys now? The new ones have rather little to do with the old ones in more than 1 way. The troops you used to get are not same you get now, The easiest is to forget everything you knew about what troops to use which week, start learning from scratch. Also 1 single troop is rarely enough nowadays, you always need to use different kinds of troops every week.[BR]I would agree with others that I used most Blossom Mages, but I also used a lot of HR (mostly Golems, but also a few frogs) and LR troops (mostly Rangers, some Archers).[BR]Catering isn´t a real strategy in itself (at least not if you want to score big), it is however an increased part of fighting now compared to how it used to be. (to conserve troops in the fights where you would have heavy losses, but don´t ask me about details, I suck at remembering to do it, but I know I could do much better in that part of fighting...)"}, {"8": "world map progress.[BR][BR]Expansions. I've seen it posted that premium expansions are better to place, etc etc.......but I've just looked at the rankings and see that I'm so far behind those around me for world map progress score, but quite far ahead in aw score, I'm now asking myself 'am I at an advantage or disadvantage' as far as touraments are concerned?[BR]I think my ability to keep up with troop loss has improved, since the introduction but no idea why.....haha[BR]I'm at the end of chapter 15, decided to throw the last of my beautiful wishing wells down, to give myself thinking time before moving on or not."}]