[{"24": "OldHag said:\t\t\tworld map progress.[BR][BR]Expansions. I've seen it posted that premium expansions are better to place, etc etc.......but I've just looked at the rankings and see that I'm so far behind those around me for world map progress score, but quite far ahead in aw score, I'm now asking myself 'am I at an advantage or disadvantage' as far as touraments are concerned?[BR]I think my ability to keep up with troop loss has improved, since the introduction but no idea why.....haha[BR]I'm at the end of chapter 15, decided to throw the last of my beautiful wishing wells down, to give myself thinking time before moving on or not.\t\tClick to expand...[BR]That depends entirely on which AWs you have. If you have military AWs you are at an advantage, if you have non-military AWs you are at a disadvantage.[BR][BR]World map progress has nothing to do with anything, well I guess it means up to 525 provinces it means you have more province expansions available, but those are only a disadvantage if you place them..."}, {"56": "Does anyone know anything about these new Tournament trophies?[BR][BR]"}, {"62": "Jackluyt said:\t\t\tDoes anyone know anything about these new Tournament trophies?[BR][BR]Click to expand...[BR]Yes they are coming soon. [smilie--sprite7]"}, {"20": "If I read the above, seems like individual perhaps.  Previously thought it would be team based."}, {"15": "I've seen someone speculate those trophies might replace the 19 chests...  I hope it's not the case. I especially hope it won be like in the Spire where every fellow can only earn a max amount of points so that more active/advanced fellows can't make up for those who participate somewhat less."}, {"22": "I think we'll just see a gold / silver / bronze on fellowship summary pages, as with the Spire. I have no idea what levels they will set for them though. If they say you have to open 19 chests to get a gold medal that will please some fellowships, but displease most.[BR][BR]They could scrap the chests in their current format as they don't really mean an awful lot. Just a method of prize delivery."}, {"15": "Pauly7 said:\t\t\tThey could scrap the chests in their current format as they don't really mean an awful lot. Just a method of prize delivery.\t\tClick to expand...That depends on how they would redistribute the rewrads. Imagine if the BP was in the gold trophy and that ones is just as hard to get as the Gold medal in the Spire..."}, {"12": "Hekata said:\t\t\tI've seen someone speculate those trophies might replace the 19 chests...  I hope it's not the case. I especially hope it won be like in the Spire where every fellow can only earn a max amount of points so that more active/advanced fellows can't make up for those who participate somewhat less.\t\tClick to expand...[BR]I share your hopes @Hekata. My FS is a mix of fairly big cities and relatively small ones. As a group we are usually able to just make it to ten chests. And even some weeks it's the top players who need to recover after a monumental effort, by which time other fellows are able to step into the breach. [BR][BR]Most importantly I also hope that Inno doesn't damage the team efforts and contributions that make it possible to have 'Team Spirit' (!)[BR][BR]But by all means the game devs can offer extra trophies. It's just a fact that if they are as unattainable as Gold in the Spire then we will happily ignore them."}, {"135": "I almost don't dare saying it out loud. Don't want to give them any \"good\" ideas  [smilie--sprite2][BR][BR]But since prices on Magic Residences and WS has gone from 1400 to 2000 diamonds in chapter 16, why should it be easy to get Blueprints for upgrades then [smilie--sprite6]"}, {"24": "I guess I´ll just wait and see what happens [smilie--sprite1] [BR]I don´t think anyone needs to be afraid, I seems like they add something, not replace something else. So worst case scenario would be no change for some folks.[BR]And since elvenar over the last year or two has clearly taken steps towards low achievers more than anything else, my guess is it won´t be too hard to get some of those trophies."}, {"15": "A player form beta explained what to expect. I've put it in the News from Beta thread."}, {"15": "Bringing this thread back to life only to ask (@Herodite @Silmaril) if there is some news about removing some of the AWs from the Spire/tournament difficulty formula. The last I remember is that someone from the team said the devs were aware that not all AWs are equally useful to the tournament/Spire. So is anything being done about it?[BR]I am almost done with all the AWs that I consider directly beneficial to my tournament/spire game and I'm wondering what to do with all the kps that will keep pilling up in my kp bar once I'm done? I would really appreciate if any of the less useful AW would be left out of the tournament formula just so I have something to do with my kps."}, {"69": "You can always donate them to your fellows to strengthen your group, or neighbors/newbies as encouragement."}, {"8": "Hekata said:\t\t\tBringing this thread back to life only to ask (@Herodite @Silmaril) if there is some news about removing some of the AWs from the Spire/tournament difficulty formula. The last I remember is that someone from the team said the devs were aware that not all AWs are equally useful to the tournament/Spire. So is anything being done about it?[BR]I am almost done with all the AWs that I consider directly beneficial to my tournament/spire game and I'm wondering what to do with all the kps that will keep pilling up in my kp bar once I'm done? I would really appreciate if any of the less useful AW would be left out of the tournament formula just so I have something to do with my kps.\t\tClick to expand...Great Question @Hekata and one I'm sure many will be interested in. I look forward to dev/mod feedback on this. [smilie--sprite1]"}]