[{"60": "These tournament changes are atrocious. Last week I was in the top 100 scores for Winyandor and now im stopped at the 12th province of the first round. My squad size is 825 and the fight for the 12th province is a squadsize of 1660 vs 2075 for the opposition. These losses are horrendous and unsustainable. Catering costs over 10k resources so im not going to bother doing that.[BR][BR]You have killed a major part of the game inno.[BR][BR]@valle Lucky you having those boosters, no fire phoenix or DA here. Wasnt around for the phoenix the first time and only having a UUU gets me nowhere. Give it a month until people burn through their stockpiles, itll be a different story."}, {"68": "I have found that it really does depend where you are on the tree, my small city in dwarves has been punished by this version.  Last week I opened 15 provinces and was only stopped due to lack of open provinces.  This week I have managed to open 10 but both my archers 3* and mages 2* die like flies as I've now come against an enemy squad with 2 x mistwalkers 2*[BR][BR]While I could afford the cost of catering where my T1 requirements is 2.1k steel it isn't sustainable as I'm already having to decide between spire, tree, upgrading and world map; adding tournaments in is a non-starter![BR][BR]No fire phoenix, no brown bear, only troops which I can produce in the barracks and the only way to get more is to waste the timers but until I can unlock the armory upgrade a full barracks is done in just over 3h."}, {"14": "valle said:\t\t\tBut they might change some modifiers, like how much every expansion effects difficulty. Bottom line is that feedback in this thread shall be on the EN version and not on the Beta version. If we start to mix feedback from both versions it will be very confusing.\t\tClick to expand...[BR]They changed that expansion effect on the Beta already before going to Live, and @MinMax Gamer already showed that the effect of this is minimal at best.[BR]Again; count for me how often they actually changed something going from Beta to Live, in any meaningful manner.[BR][BR]valle said:\t\t\tAnd you evidently don't know what you are talking about.[BR]I guess I'm as affected the same way as most of the people writing in this thread. I will probably miss 200+ fp every week because of this.[BR]But I realize that for this game this amount of 'almost free' kp that has been given out is harmful. So decreasing it is a must to avoid super infaltion.\t\tClick to expand...[BR]Perhaps I should have written \"less affected\"? We may have a different view, but I know quite well what this whole nerf entails, thank you very much.[BR][BR]- Since the amount of people who are doing tournaments hardcore every week, scoring high and gaining lots of kp, is relatively low in the server, then how is it 'harmful' exactly?[BR]- How exactly does it hurt other people when these few players, this small minority, can upgrade their AW's faster than others?[BR]- How does it create any kind of inflation if a few % of the playerbase can spam a few 100kp into their AW weekly, when it would still take YEARS to get everything to level 35? (4x2000kp x 20 AW = 160.000 KP! needed -> at 800 extra kp per week (1000 total-ish) that's still a solid 3 years)[BR][BR]You state a lot of things but do not prove them, and your 'realization' once again does not counter the facts I previously mentioned.[BR]Please answer the above questions? I'll be waiting for well constructed arguments."}, {"89": "I was never stopped that fast, never had that much losses and never had to negotiate that early with the Fire Phoenix active.[BR][BR]Without the Fire Phoenix it seems you are stopped already around the 12th province. With the Fire Phoenix i could at least get to the 18th province, but with HEAVY losses. Had to negotiate once and could do 2 more, but stopped there as enemies squad size is already close to 2x of mine, while i need to use 4x of my own squad size in troops.[BR][BR]Without any other boosting building (like dwarven armory) i won't get any further.[BR][BR]I'm in a casual fellowship, mostly achieving the highest scores, doing the needed points for the higher chests, so we're able to do the 10th chest once or twice each rotation, but now that seems to be history.[BR][BR]I was considering to buy a new big package of diamonds these days, but that's also history now. I don't like these changes and it will throw back my whole fellowship in terms of tourney-progress. It even seems that my investment of diamonds would hurt my progress in some ways.[BR][BR]If there are too many KP around, just take out some KP from the 2nd and 5th 10+ round/province - i don't mind that. Making it 1 task instead of 4 for each province is also a nice thing. That limitation in terms of final scores you can archieve, so reducing the chances to get more chests (while adding more of them - lol) bothers me hard. Even to that point, if nothing changes, that i would quit playing elvenar, as i don't like the direction you're going right there.[BR][BR]At the end we have too much KP, too much players earn Blueprints, too much players gain whatever you don't like and hey... was the same with too much players had diamond-farms with wishing wells, so you just removed them to replace them with much harder to get spires and geenies. Okay, at least you don't need that much space now. What's the next thing you think \"players have to much\"? You also already nerved the Spire right after the start in the live worlds.[BR][BR]Like someone else said it already... it feels like inno tries to develop against their costumers... and that's somehow my feeling after each major update too."}, {"76": "I have just had a go with my orc chapter negotiation city and will wait until later to have a go with my end of elvenar chapter fighting city, so i can fit 3 rounds in 1 feeding of the fire.[BR]I am going to write some notes on how i find it in both and share it after the end of the tournament."}, {"74": "Positive: I like the 4 in 1 concept, definite improvement thank you.[BR][BR]Negative: The uncapped \"difficulty\" on later provinces literally makes it literally impossible to win some fights. This is unreasonable. I understand the costs going up - my Squad Size is 50% higher under this new calculation than it used to be so my battles are all 50% more expensive already - but making battles unwinnable doesn't make them expensive it makes it impossible. That's not reasonable. It shouldn't be possible to only complete provinces by catering.[BR][BR]@Silmaril please can you confirm if its intended to only be able to complete provinces by catering? Otherwise please can a cap be put on the ratio of enemy squads to your squads."}, {"90": "My worst fears have realised. They've pushed on regardless... The end is nigh. For me anyway. [BR][BR]I don't even want to talk to a Community Manager. @Silmaril is tasked to make things sound less grievous than it is. And even if that is a persona, why go through a middle-man? I want to talk to the person who put forth this idea and thought it feasible. I want to hear it from his mouth per se his justification for this insanity. Oh, so the community wanted a more hassle-free Tournament so that alone warrants a redesign so drastic that is punishes paying players... [BR][BR]Just back-track won't you Inno? Just shelve this whole idea and pursue it no further. Pretend it never happened. We'll wake up tomorrow and think of it as just a bad dream. Revoke, reverse, revert. Please."}, {"39": "Just did 30 provinces, catered most of them, as a few fights that I did on auto, had colossal losses, despite the fact that I have 1 dwarven armorer placed and fire bird fed. It looks like that catering was a really viable option for round 1, well for me personally. Normally I would go for 50+ provinces on the first round, but today had to stop, because I'm not sure how far I will be able to go on the round 2..."}, {"88": "To all it would be helpful to state in which chapter you are and what your starting squad size was at the first tournament encounter, so we can all get a better feel as to where things seem insurmountable.[BR][BR]Beginning of Chapter 16[BR]Starting squad size 583[BR]40 1* provinces[BR]Buildings DA, UUU, LR, MR[BR]Phoenix Boosted[BR][BR]Fights were harder at the end and losses were overall for 40 provinces compared to tournaments before, definitely higher.[BR]@MinMax Gamer 's sheet, when inputing the squad size of the 1st province was entered, fit the required goods amount, the amount of ones own squad size almost to the letter.[BR][BR]Based on the sheet and with the setup above it should be possible do somewhere at 6*25 and more provinces with 5*, 4*, ... and so forth[BR][BR]Without the buildings and Phoenix this might well be a totally different story and I think province 40 1* would not have been doable. When the next round starts, i'll report back[BR][BR]The odds are stacked too high![BR][BR]Cheers, Meli"}, {"74": "Done 45 provinces to 5 star. Battles are taking 12 squads per slot for me so need 60 squads to initiate the battle. The escalated difficulty makes winning battles impossible quite often.[BR][BR]In prior weeks I might do all my provinces to 5 star but pushing on seems pointless given that battles are becoming unwinnable. This isn't smart game design - making it challenging gives an incentive to overcome the challenge, making it impossible means why bother spending?[BR][BR]I think anyone without bears will struggle much more on new design."}, {"68": "randblade said:\t\t\tDone 45 provinces to 5 star. Battles are taking 12 squads per slot for me so need 60 squads to initiate the battle. The escalated difficulty makes winning battles impossible quite often.[BR][BR]In prior weeks I might do all my provinces to 5 star but pushing on seems pointless given that battles are becoming unwinnable. This isn't smart game design - making it challenging gives an incentive to overcome the challenge, making it impossible means why bother spending?[BR][BR]I think anyone without bears will struggle much more on new design.\t\tClick to expand...The problem with the brown bear is that you need both supply windfalls and time boosts, so a bad week in the spire (for whatever reason) and the number of time boosts is greatly reduced or less supply windfalls in the MA and then it doesn't matter how many time boosts you have as there will be a massive shortfall.[BR][BR]Plus, if you're one of those people who started the game after the bears then straight away you're at a disadvantage.  Although the provinces become unplayable so quickly that you may not miss them."}, {"78": "My experience with round 1 - DA, ELR, Fire P - chapter 16 - 187 AW points[BR][BR]Even with the range of enemy units, autofight did well up till province 12. After that it got just too expensive. My losses by province 22 (mostly manual) where what I would have expected around province 30 with auto in the old tourney. No matter, any serious FS Team needs to get to 10 chests with the minimum of loss so I'm going to have to be much more selective in what heights I climb ![BR][BR]I liked the mixed up array of enemies and the 1 encounter provinces - so much less mind numbing [smilie--sprite1][BR][BR]I'll get used to the reduction of KP and spells rewards and organise accordingly.[BR][BR]Strategy will evolve as I progress[BR]The game needs a shake to keep it fresh"}, {"33": "Killiak said:\t\t\tThey changed that expansion effect on the Beta already before going to Live, and @MinMax Gamer already showed that the effect of this is minimal at best.[BR]Again; count for me how often they actually changed something going from Beta to Live, in any meaningful manner.\t\tClick to expand...[BR]I've got no idea about the numbers. Totally irrelevant. My point is as we can't be sure that they have not done any even very small changes we should not give feedback on the Beta version in this thread. As it's gone live it shouldn't matter anymore.[BR][BR]Killiak said:\t\t\t- Since the amount of people who are doing tournaments hardcore every week, scoring high and gaining lots of kp, is relatively low in the server, then how is it 'harmful' exactly?[BR]- How exactly does it hurt other people when these few players, this small minority, can upgrade their AW's faster than others?[BR]- How does it create any kind of inflation if a few % of the playerbase can spam a few 100kp into their AW weekly, when it would still take YEARS to get everything to level 35? (4x2000kp x 20 AW = 160.000 KP! needed -> at 800 extra kp per week (1000 total-ish) that's still a solid 3 years)[BR][BR]You state a lot of things but do not prove them, and your 'realization' once again does not counter the facts I previously mentioned.[BR]Please answer the above questions? I'll be waiting for well constructed arguments.\t\tClick to expand...[BR]Do you prove any of the above? [BR]About infaltion it's simple. If you put out more money in circulation it will lead to inflation. In Elvenar you can see kp as the currency (or most valuable commodity). The more kp that is put out the more inflation, easy.[BR]And it's not only those hardcore players that are affected, a lot of other players will also be earning less kp. Also we might have different definition of hardcore, but for me a hardcore player would just soldier on regardless the odds and not complaining that it gets to difficult. A bit more stiff upper lip please [smilie--sprite2]"}, {"91": "Ephraim Heart said:\t\t\tMy worst fears have realised. They've pushed on regardless... The end is nigh. For me anyway.[BR][BR]I don't even want to talk to a Community Manager. @Silmaril is tasked to make things sound less grievous than it is. And even if that is a persona, why go through a middle-man? I want to talk to the person who put forth this idea and thought it feasible. I want to hear it from his mouth per se his justification for this insanity. Oh, so the community wanted a more hassle-free Tournament so that alone warrants a redesign so drastic that is punishes paying players...[BR][BR]Just back-track won't you Inno? Just shelve this whole idea and pursue it no further. Pretend it never happened. We'll wake up tomorrow and think of it as just a bad dream. Revoke, reverse, revert. Please.\t\tClick to expand...You are right.These changes are terrible.Go back Inno.[BR]Challenging things are good.We play Elvenar for those challenging things that we get only here.So don't take the main part away Inno.If it isn't challenging anymore,I don't find a reason to play.So don't make it impossible,if possible more challenging."}, {"14": "valle said:\t\t\tI've got no idea about the numbers. Totally irrelevant. My point is as we can't be sure that they have not done any even very small changes we should not give feedback on the Beta version in this thread. As it's gone live it shouldn't matter anymore.\t\tClick to expand...[BR]Since you are the one who said \"maybe they'll change it!\", it is not irrelevant, as you yourself made it a point of discussion as well. I'll help you out with the number:  Inno has never, ever, changed anything meaningful going from Beta to Live.[BR][BR]And since many in my fellowship have been going over the numbers and the tournament now, I believe I can also state that nothing WAS changed.[BR][BR][BR]valle said:\t\t\tDo you prove any of the above?[BR]About infaltion it's simple. If you put out more money in circulation it will lead to inflation. In Elvenar you can see kp as the currency (or most valuable commodity). The more kp that is put out the more inflation, easy.\t\tClick to expand...[BR]You are the one making statements about \"harmful\" and \"inflation\", therefor the burden of proof lies with you, quite simple.[BR]Also, you want proof? Open up the last tournament pages and see how many scored over 10.000 versus how many people are playing; boom, proven. Your turn.[BR][BR]Furthermore:[BR]Tournament KP is not currency, as I cannot trade it with other people for products that I would desire or need. There is no state, or similar institution that guarantees its value. There is no central bank of KP.[BR]Also, the value of a single KP does not change if there is more of it in the entire system; one point in an AW or research is one point in an AW or research. The cost of a specific single research, or a specific level of AW also does not change with more or less KP in the system. Finally, a spent KP can not be spent again. Ergo, KP does not meet the requirements to be considered currency.[BR][BR]It is indeed simple; your equation of KP to currency fails miserably, and therefor your argument on inflation does as well.[BR][BR]valle said:\t\t\tAnd it's not only those hardcore players that are affected, a lot of other players will also be earning less kp. Also we might have different definition of hardcore, but for me a hardcore player would just soldier on regardless the odds and not complaining that it gets to difficult. A bit more stiff upper lip please [smilie--sprite2]Click to expand...[BR]Depends on how many provinces those people normally clear and how many they are stuck with now. The lower provinces are easier, but the ones further up are a lot harder to down right impossible. It also means that people who used to not be able to do a lot will be able to get a little further. I dare not make any quantifiable statements on it, as I do not have the numbers. (and neither do you.)[BR][BR]Regardless of that, any winky comments on \"soldiering on\" and \"would not complain\" are irrelevant and one could even argue you are trying to close down the discussion and arguments from those people. The point is, and remains, that Inno is placing down a hard nerf that affects a specific minority of this game in an unreasonable and skewed manner.[BR][BR][BR]So I will have to ask you again; can you underpin your statements with some actual well constructed arguments?"}, {"45": "Well finally it has gone live, please keep a close look out on this as the week progresses as I am more than interested in each progression through and how this is making things better/worse/the same for all that will give feedback.[BR]We have far more players here on the International server so I hope that we also get pertinemt information to feed back. Stats, observations, evidence from your usual scores/rewards anything -  but please more than ''I don't like it'' as that does not give us anything to go back to the devs with."}, {"78": "The era of the single player tourney points championship is not over - you just have to play the back 9."}, {"2": "Silmaril said:\t\t\tWell finally it has gone live, please keep a close look out on this as the week progresses as I am more than interested in each progression through and how this is making things better/worse/the same for all that will give feedback.[BR]We have far more players here on the International server so I hope that we also get pertinemt information to feed back. Stats, observations, evidence from your usual scores/rewards anything -  but please more than ''I don't like it'' as that does not give us anything to go back to the devs with.\t\tClick to expand...The problem is that at least this week, more players than usual will test the new tourny (out of curiosity) than are doing on weekly basis. My guess is a pertinent opinion about being things better/worse/the same will be in couple weeks from now. IMHO the data of this particular tourny are irrelevant."}, {"45": "I think so too @Alcaro but I am really hoping players will tell us their story of how the changes are affecting them."}, {"14": "Silmaril said:\t\t\tWell finally it has gone live, please keep a close look out on this as the week progresses as I am more than interested in each progression through and how this is making things better/worse/the same for all that will give feedback.[BR]We have far more players here on the International server so I hope that we also get pertinemt information to feed back. Stats, observations, evidence from your usual scores/rewards anything -  but please more than ''I don't like it'' as that does not give us anything to go back to the devs with.\t\tClick to expand...[BR]The general displeasure of your 'less casual' community gives you something to go back to the managers with.[BR][BR]As for observations, I am now at 1-star province 17, and it looks like I am already hitting 150% enemy squad size, while my own squad size is already at 400%!!! of the squad size I see in the barracks.[BR]Losses are rather large in autofight, usually I lose 2-3 battle-squads; which equates 8 - 12 barrack squads of losses.[BR][BR]Extrapolating these numbers, assuming I push it: I could get about 6-7K score, but there is no way I would be able to sustain that over time. Basically, consistant 10-15K scores are a thing of the past. I assume the devs can count out how many KP/ Runes/ Spells etc. I will no longer able to get.[BR][BR]I did not build any boost-buildings, only used my Fire Phoenix, to get a more \"clean\" result. That's all I can give you for now.[BR][BR]Edit; this change really highlights how weak the autofight 'AI' is. It will cause you massive losses, because it handles different initiatives/ speeds very poorly and often makes bad tactical choices. With this change, the weakness of the autofight system shines brighter than ever. Something to consider and look into again, imo.[BR][BR]Edit2: Province 21 suffered a full defeat, using units that are the counter for the enemy.[BR]2x Wily bandit(lr), 1x feral Wild Archer, 1x Rigid Steinling (hr), 1x Brave Knight (hm).[BR][BR]Used a full set of Heavy Ranged (mortar) to attack, lost them all. Then used a combo of 2x Mortar, 1x Frog Prince, 1x Strategist, 1x Priest.[BR]Everything with me is 3-star, but still suffered about 60% losses with the second combo.[BR][BR]Final edit; stopping at province 24. Too many mistwalkers at too high an enemy size. My regular squad size in barracks is 4.191, below is what I face:[BR][IMG]https://i.ibb.co/RPBMytB/https-en-forum-elvenar-com-index-php-attachments-1597774108038-png-4639.png[/IMG]"}]