[{"73": "valle said:\t\t\tI've got no idea about the numbers. Totally irrelevant. My point is as we can't be sure that they have not done any even very small changes we should not give feedback on the Beta version in this thread. As it's gone live it shouldn't matter anymore.[BR][BR][BR][BR]Do you prove any of the above? [BR]About infaltion it's simple. If you put out more money in circulation it will lead to inflation. In Elvenar you can see kp as the currency (or most valuable commodity). The more kp that is put out the more inflation, easy.[BR]And it's not only those hardcore players that are affected, a lot of other players will also be earning less kp. Also we might have different definition of hardcore, but for me a hardcore player would just soldier on regardless the odds and not complaining that it gets to difficult. A bit more stiff upper lip please [smilie--sprite2]Click to expand...Wow"}, {"2": "Everything is interconnected - a thing I liked in the past, now will become harmful for dedicated players (not hardcore!!! to be clear!). Doing less in tournaments with more loses than before (I let the numbers for brighter players than me) means less troops for Spire, which leads to less CC, time boosters which leads to less crafting in MA, less possibilities to feed the Bear and cover the loses of a tournament. Also doing less in tourny means less relics and less spells (lets let aside for the moment the decrease of the KPs income) meaning less possibilities to produce CC spells > crafting > harder to get Military 5 days boost (not that we have sooo many recipes of them) which goes back to less completed provinces in tourny.[BR]Bottom line, this new formula is harming us in many ways, reducing the game to hours of waiting for upgrades and not much else to do."}, {"73": "Killiak said:\t\t\tRegardless of that, any winky comments on \"soldiering on\" and \"would not complain\" are irrelevant and one could even argue you are trying to close down the discussion and arguments from those people. The point is, and remains, that Inno is placing down a hard nerf that affects a specific minority of this game in an unreasonable and skewed manner\t\tClick to expand...Well said."}, {"28": "Melianora said:\t\t\t@MinMax Gamer 's sheet, when inputing the squad size of the 1st province was entered, fit the required goods amount, the amount of ones own squad size almost to the letter.\t\tClick to expand...Thanks for confirming it. This means that ramp up in terms of the provinces/stars have NOT been changed from beta. So all we need to do is figure out the base squad size calculation.[BR][BR]Have you also checked catering amounts per province, do these also line up?"}, {"28": "randblade said:\t\t\t@Silmaril please can you confirm if its intended to only be able to complete provinces by catering? Otherwise please can a cap be put on the ratio of enemy squads to your squads.\t\tClick to expand...They can always say that there are no unwinnable fights. If you put up 10x UUUs and ELRs, you can win any fight I can imagine. How often you'll be able to do that, on the other hand..."}, {"73": "Silmaril said:\t\t\tI think so too @Alcaro but I am really hoping players will tell us their story of how the changes are affecting them.\t\tClick to expand...Very hard nerf. It’s not possible to not get negative  doing those 190% + provinces at the said number of troops to fill the 5 slots. [BR]I have faced 4 defeats at 60 squads for 5 slots = 240 Squads gone ( I ventured just because I vouched to test for you) [BR]Would you reimburse, [smilie--sprite2] since kp is money and can suffer inflation"}, {"74": "Silmaril said:\t\t\tWell finally it has gone live, please keep a close look out on this as the week progresses as I am more than interested in each progression through and how this is making things better/worse/the same for all that will give feedback.[BR]We have far more players here on the International server so I hope that we also get pertinemt information to feed back. Stats, observations, evidence from your usual scores/rewards anything -  but please more than ''I don't like it'' as that does not give us anything to go back to the devs with.\t\tClick to expand...*cough*[BR]randblade said:\t\t\tPositive: I like the 4 in 1 concept, definite improvement thank you.[BR][BR]Negative: The uncapped \"difficulty\" on later provinces literally makes it literally impossible to win some fights. This is unreasonable. I understand the costs going up - my Squad Size is 50% higher under this new calculation than it used to be so my battles are all 50% more expensive already - but making battles unwinnable doesn't make them expensive it makes it impossible. That's not reasonable. It shouldn't be possible to only complete provinces by catering.[BR][BR]@Silmaril please can you confirm if its intended to only be able to complete provinces by catering? Otherwise please can a cap be put on the ratio of enemy squads to your squads.\t\tClick to expand...I would appreciate a reply when you can."}, {"60": "@Silmaril Stats/Observations/evidence[BR][BR]This is me, I know how to do tournaments.[BR][IMG]https://i.ibb.co/YdhcDzN/https-en-forum-elvenar-com-index-php-attachments-1597771540056-png-4638.png[/IMG][BR][BR]Stats: I am going to make roughly 200 kp less this tournament than normal. In an active fellowship this means well over 1000 kp wont be traded between members. This means less interaction which is something this game doesnt have a lot of already. I am going to score 2 or 3 or maybe even 4 thousand below my average. My fellowship might still make 10 chests but there is no chance I could cover for someone who cant play this week for whatever reason.[BR][BR]Observations: A major part of the game and point of interaction for players has been made drastically worse for no reason. I am penalised for having extra expansions and AW levels. I have no idea how much upgrading my next wonder will help or hurt me so im considering if i should even bother. I want to progress in the game and I had been doing that by using the kp to boost my wonders and ultimately boost my performance overall. I can not understand how a game chooses to make it a worse experience for its players. People have told inno many times that these changes are bad and have provided lots of evidence as to why. The evidence and opinions are being ignored and its happening anyway.[BR][BR]Evidence: The evidence is the numbers. I have gone from ~30 provinces in the first round to 11. The 12th costs over 10k resources so its cheaper to simply buy 5 kp with those resources than do the tournament. This isnt a matter of it being difficult it is simply not feasible to fight the 12th province in the FIRST ROUND. I dont have the boosters, besides a UUU, so I cant do it. The amount of troops used is insane, my squadsize is 825 and its using 1660 troops for the fight. It takes about an hour per squad so these losses are unsustainable. For reference province 30 was around 1200 last week. [BR][BR]A major source of enjoyment has been taken away from many players for no reason."}, {"45": "randblade said:\t\t\t*cough*[BR][BR]I would appreciate a reply when you can.\t\tClick to expand...This is nto something that has been mentioned at all in dispatches as combat has been the main topic. But interesting viewpoint. Tell me what is making you thing this is the easier option?"}, {"45": "30158729 said:@Silmaril Stats/Observations/evidence[BR][BR]This is me, I know how to do tournaments.View attachment 4638[BR]View attachment 4638[BR][BR]Stats: I am going to make roughly 200 kp less this tournament than normal. In an active fellowship this means well over 1000 kp wont be traded between members. This means less interaction which is something this game doesnt have a lot of already. I am going to score 2 or 3 or maybe even 4 thousand below my average. My fellowship might still make 10 chests but there is no chance I could cover for someone who cant play this week for whatever reason.[BR][BR]Observations: A major part of the game and point of interaction for players has been made drastically worse for no reason. I am penalised for having extra expansions and AW levels. I have no idea how much upgrading my next wonder will help or hurt me so im considering if i should even bother. I want to progress in the game and I had been doing that by using the kp to boost my wonders and ultimately boost my performance overall. I can not understand how a game chooses to make it a worse experience for its players. People have told inno many times that these changes are bad and have provided lots of evidence as to why. The evidence and opinions are being ignored and its happening anyway.[BR][BR]Evidence: The evidence is the numbers. I have gone from ~30 provinces in the first round to 11. The 12th costs over 10k resources so its cheaper to simply buy 5 kp with those resources than do the tournament. This isnt a matter of it being difficult it is simply not feasible to fight the 12th province in the FIRST ROUND. I dont have the boosters, besides a UUU, so I cant do it. The amount of troops used is insane, my squadsize is 825 and its using 1660 troops for the fight. It takes about an hour per squad so these losses are unsustainable. For reference province 30 was around 1200 last week.[BR][BR]A major source of enjoyment has been taken away from many players for no reason.\t\tClick to expand...Thank you, this is the sort of stuff I like! please of course update us again at the end of the Tournament so we can check and check again to see [smilie--sprite1]"}, {"70": "@30158729 tell me about it hehe. Look my average below:[BR][IMG]https://i.ibb.co/DYxG3bh/https-en-forum-elvenar-com-index-php-attachments-average-jpg-4640.jpg[/IMG][BR][BR]And yet, my 26th province:[BR][IMG]https://i.ibb.co/S7XtPyh/https-en-forum-elvenar-com-index-php-attachments-planks-jpg-4641.jpg[/IMG][BR][BR]I have over 2 million each resource or close to 2m, but still, I would burn that in no time, especially, if I went all the way (although maybe one week I could go crazy and try that haha.)[BR][BR]Definitely, it is based on the playstyle of how you are making your city. I have in beta a city that is smaller, chapter V, and can do easier its 10 provinces than the big city in Winyandor. I am going for 25, 25, 10, 10, 10, 10 and see how it goes, without using any booster buildings.[BR][BR]Next week I will try with DAs and one of each temporal building and see how it goes. Its a challenging change, that is for sure. Let's see how things pan out [smilie--sprite1][BR][BR]I am sure that cave over there will be something... I am thinking though, and @30158729 and @Silmaril that perhaps, using an array of military temporal buildings, balancing military AW with non-military ones, and using an array of different troops it seems to be better fighting than catering, although the squad sizes are huge. It requires (a lot more) strategy, not sure. With this heavy shift, maybe INNO has more ideas to be implemented after or to hopefully get it a bit easier. Something with that cave, new craftable buildings,etc. Sure it's a massive spike in difficulty, but they will balance it out with something else, I am positive. They made a lot of changes from the first Spire to our current, and I climbed them entirely weekly, the Spire is like my second residence. Really good views.[BR][BR]I will update at the end of the tournament, and next week I will try with one DA, one UUU, one ELR, and one MMM and try to auto-fight it out, again to push to 25, 25, 10, 10, 10, 10. See how it goes.[BR][BR]Edit: I did complete the research for a couple of SSs that I had filled up, but not researched right now. The above province requirements stayed the same [smilie--sprite1] So, these indeed are good to research now so you get more out of your AWs."}, {"84": "I used to be able to auto fight provinces up to around province 20 before i got all my troops wiped out using fed pheonix and 1 UUU (depending on what the tourney was), today i can't even win in province 13.[BR][BR]@Silmaril could you tell us what the devs were aiming for with these changes, that might help players understand why their tournaments have been ruined."}, {"92": "I’m not to bothered by the difficulty but can we please train troops simultaneously in all 3 military buildings and why not offer uuu, elr and mmm as a daily prize in events as I rarely see them in my MA and I craft a lot [smilie--sprite1]"}, {"28": "Timneh said:\t\t\t@Silmaril could you tell us what the devs were aiming for with these changes, that might help players understand why their tournaments have been ruined.\t\tClick to expand...Not Silmaril, but I believe break point above which the tournament was supposed to become more difficult was 2.5K points. You're feeling it."}, {"74": "Silmaril said:\t\t\tThis is nto something that has been mentioned at all in dispatches as combat has been the main topic. But interesting viewpoint. Tell me what is making you thing this is the easier option?\t\tClick to expand...Thank you for the quick reply.[BR][BR]In case I'm not clear, the ratio of enemy troops to our troops are far too high so that if the combination of troops is awkward then it makes the battles effectively unwinnable without manually fighting which is time consuming and can't be done on mobile devices.[BR][BR]Have a look at this photo. I have 41821 troops versus 92425 for the enemy. The enemy has more that 2.2x as many troops as I have and with there being 4 different types of squads there - HM, HRx2, LR and LM - that's a mad battle to have to face as the enemy can overpower our squads.[BR][BR]In comparison for this same battle in the old tournament style, multiplied by 4 to make it like for like, it would have been 29670 versus 29670. Even at 6th Star previously it would have been just 29670 versus 47,472[BR][BR]So the enemy squads have gone up more than 3x as much as it was before while my squads only gone up a third. This makes battles punitive. I don't mind the costs going up, even considerably up, to make it difficult but to make it this unreasonable isn't fair. If our troops went up at the same rate as the enemy troops have gone up then it would make the tournament more expensive still but to give these ratios of enemy troops to our troops is wrong.[BR][BR]Does that make sense @Silmaril ?[BR][BR]This could be fixed by capping the ratio of enemy squads to our squads - even if our squads went up faster."}, {"27": "I’m an app player. In the old tournament I was able to go through all my provinces. Today I stopped at the 15th province. Main issues:[BR]- The fights are so risky in the app! I don’t have the option to fight manually when I’m not convinced about the outcome of the current auto fight. Example: my 8653 vs. enemy 11683:[BR][BR]I realize Ranged Orcs would be better, but I’m in the last chapter and I can’t simply afford the Orcs needed to train them. That’s design issue, not my fault.[BR]- Having an encounter with all five types of troops is mean. What am I expected to do with this?[BR][BR][BR]EDIT: Pictures were unpleasantly big. Sorry. Both are now changed to thumbnails."}, {"28": "FieryArien said:\t\t\t- Having an encounter with all five types of troops is mean. What am I expected to do with this?\t\tClick to expand...Probably cater."}, {"79": "well,2 things can be done to help the players.Open all 3 military buildings so we can train at the same time,and merge the bonus damage temp buildings to one,giving +125% damage to all your units.That will also compensate for those who do not have fire phoenix"}, {"83": "I hate all of the revisions to the tournament.  I want to fight, not cater.  That is why I have military AWs and train troops. INNO has managed to take all of the fun out of the game.  I will probably just stop playing, as will many others."}, {"79": "Susananna said:\t\t\tI hate all of the revisions to the tournament.  I want to fight, not cater.  That is why I have military AWs and train troops. INNO has managed to take all of the fun out of the game.  I will probably just stop playing, as will many others.\t\tClick to expand...give it time girl.Still early to tell.We are the live testers remember? [smilie--sprite1]"}]