[{"36": "Liebe Menschen und Elfen,[BR][BR]wir freuen uns über eure Gedanken und euer Feedback zum Hexenkessel.[BR]Platz für Fragen ist im Fragenthread.[BR][BR]Viele Grüße[BR]Euer Elvenar Team"}, {"103": "Frage: Ist irgendwo hinterlegt, welches Rezept man bereits probiert hat, bzw welche Rezepte du den bereits gebrauten Tränken gehören ?"}, {"28": "littleFlex schrieb:\t\t\tFrage: Ist irgendwo hinterlegt, welches Rezept man bereits probiert hat, bzw welche Rezepte du den bereits gebrauten Tränken gehören ?\t\tZum Vergrößern anklicken....Soweit ich weiß nicht."}, {"240": "Mein bisheriges Fazit: ich persönlich mag den Kessel absolut nicht und komme damit auch bisher nicht zu recht - daher ignoriere ich ihn, ehrlich gesagt. Das Ding ist für höhere Kapitel sicherlich super geeignet, aber auf jeden Fall nicht bis 7 / 8 - das ist jedoch nur meine persönliche Meinung zu dem Kessel.... [smilie--sprite6][BR][BR]P. S. Es wäre tatsächlich keine schlechte Idee, wenn man ein oder zwei Beispielsrezepte - so eins für Anfänger - eins für die, die schon alles können - hier einstellen würde.... -"}, {"103": "Zur Erklärung des Kessels in der Ankündigung sollte darauf hingewiesen werden,[BR]dass man ein \"Kapitel-Diplom\" nur für ein vollständig geforschtes Kapitel erhält.[BR][BR]Wenn ich mich recht erinnere, werden Kapitel nicht gewertet, in denen man optionale[BR]Forschungen, zB Truppstärke, ausgelassen hat."}, {"9": "[IMG]https://i.ibb.co/mRCLkNJ/https-de-forum-elvenar-com-index-php-attachments-1673016191601-png-33171.png[/IMG] [IMG]https://i.ibb.co/5j0QRmb/https-de-forum-elvenar-com-index-php-attachments-1673016243399-png-33172.png[/IMG][BR][BR]littleFlex schrieb:\t\t\tWenn ich mich recht erinnere, werden Kapitel nicht gewertet, in denen man optionale[BR]Forschungen, zB Truppstärke, ausgelassen hat.\t\tZum Vergrößern anklicken....Ja das ist so."}, {"2": "littleFlex schrieb:\t\t\tFrage: Ist irgendwo hinterlegt, welches Rezept man bereits probiert hat, bzw welche Rezepte du den bereits gebrauten Tränken gehören ?\t\tZum Vergrößern anklicken.......was schon bekannt ist - jede Zutat wirkt sich entweder mit positiven oder negativen Anteilen auf die verschiedenen Effekte aus - du musst also das, was du haben willst nach oben drücken und das was rausfallen soll aus der Liste nach Möglichkeit in den negativen Bereich verbannen - das alles mit möglichst verschiedenen Zutaten, damit der Trank insgesamt eine höhere Erfolgsquote hat, aber gleichzeitig billiger bleibt...[BR][BR]...das hier hab ich bereits herausgefunden...[BR][IMG]https://i.ibb.co/syhLZZr/https-de-forum-elvenar-com-index-php-attachments-kesselwerte-png-33175.png[/IMG].......[IMG]https://i.ibb.co/bHy1Gkx/https-de-forum-elvenar-com-index-php-attachments-kesselwerte2-png-33176.png[/IMG].[BR]...das rechts mit 1, 2, 3, 4 ist übrigens der Preisanstieg für jede weitere Zutat in Bezug auf die bereits verwendeten Zutaten gleicher Art - also je verschiedener, desto billiger bleibt es bei höherer Wahrscheinlichkeit)....[BR][BR]...das funktioniert dann in etwa so (muss ich aber selbst erst mal testen)[BR][BR]...je mehr Zutaten man in den Kessel steckt, desto höher wird die Wahrscheinlichkeit auf den Gesamterfolg - z.B. 49 % bei 6 Zutaten...[BR][BR]...je nachdem, welche 6 Zutaten man nun verwendet, tauchen verschiedene mögliche Effekte in der Liste rechts auf...aber halt nur die, die momentan im positiven Bereich sind - ich such mal schnell ein passendes Bild - moment...[BR][BR]...hier wurde eine \"Limetten-Raupe\" verwendet...[BR][IMG]https://i.ibb.co/52qpzMv/https-de-forum-elvenar-com-index-php-attachments-kesselwerte3-png-33177.png[/IMG]...die gibt 3 Punkte auf Gut2, 2 Punkte auf Werkzeug, und jeweils einen auf Kasernenkraft und Orks - ebenso 2 auf Söldnerkraft - aber das Diplom wurde hier im Beispiel noch nicht freigegeben... - die negativen Werte tauchen hier nicht auf...[BR][BR]jetzt hat man insgesamt 7 positive Anteile bei einer Erfolgswahrscheinlichkeit von 20 % des Trankes - 20 geteilt durch 7 ergibt 2,85 - gerundet die 2,9 von oben für einen Anteil bzw. die 5,7 für 2 Anteile und 8,6 für 3 Anteile - gemäß der oben genannten Wirkung auf die verschiedenen Effekte...[BR][BR]man muss also erst einmal ermitteln, welche Zutaten welche positiven Anteile in Summe auf die verfügbaren Effekte (Anzahl der Diplome), ergeben und diese dann auf die Gesamt-Erfolgsrate beziehen... ich hoffe, das war jetzt einigermaßen verständlich...[BR][BR]also erst einmal entscheiden, was man fördern, was drücken will und dann entsprechend Zutaten auswählen...[BR][BR][BR]die Tabelle werde ich hoffentlich schnell vervollständigen können...dann wird getestet, ob ich richtig liege ^^"}, {"113": "Jesas, da gibts ja ordentlich viel Neues zu lernen ;D"}, {"155": "Gut zu wissen: die Kosten für die Effektverbesserungen steigen exponentiell um 10% pro Stufe. Die Kosten für die Hexenpunkte steigen ebenfalls exponentiell mit 3% pro Kauf, während die Menge die man erhält nur linear ansteigt (+1 pro Kauf). Des weiteren senken sich die Kosten mit jedem abgeschlossenen Diploma mit dem Faktor 0,75. Wer also shoppen geht mit wenig Diplomas, der zahlt deutlich mehr (im Extremfall aktuell das 100fache)."}, {"2": "Killy schrieb:\t\t\tGut zu wissen: die Kosten für die Effektverbesserungen steigen exponentiell um 10% pro Stufe. Die Kosten für die Hexenpunkte steigen ebenfalls exponentiell mit 3% pro Kauf, während die Menge die man erhält nur linear ansteigt (+1 pro Kauf). Des weiteren senken sich die Kosten mit jedem abgeschlossenen Diploma mit dem Faktor 0,75. Wer also shoppen geht mit wenig Diplomas, der zahlt deutlich mehr (im Extremfall aktuell das 100fache).\t\tZum Vergrößern anklicken.......jupp - mit 4 Diplomen fängt man mit 1000 pro Gut für den Kauf von Hexenpunkten an - bei 20 Diplomen sind es nur 10 als Startwert - es macht also wenig Sinn, absichtlich Diplome auszulassen (also eine Kapitelforschung nicht zu machen) - besser man drückt ungewollte Effekte einfach aus der Liste raus..."}, {"103": "Ich verstehe das Konzept hinter Romillys Aufschlüsselung der Wirkungsgrade auf die unterschiedlichen Effekte.[BR]Was mich irritiert, ist der Satz: Je nachdem, welche Zutaten du in welcher Reihenfolge auswählst, hat dein Trank unterschiedliche Wirkungen.[BR][BR]Hat da schon jemand probiert, gleiche Zutaten anders zu positionieren ?"}, {"2": "littleFlex schrieb:\t\t\tIch verstehe das Konzept hinter Romillys Aufschlüsselung der Wirkungsgrade auf die unterschiedlichen Effekte.[BR]Was mich irritiert, ist der Satz: Je nachdem, welche Zutaten du in welcher Reihenfolge auswählst, hat dein Trank unterschiedliche Wirkungen.[BR][BR]Hat da schon jemand probiert, gleiche Zutaten anders zu positionieren ?Zum Vergrößern anklicken....[BR]...ich glaub nicht, daß die Reihenfolge wirklich was ausmacht - es ist eher die Kombination bezogen auf die Anzahl bzw. die Gesamtwahrscheinlichkeit, d.h. die einzelnen %-Werte können mal steigen mal sinken oder es kann ein Effekt rausfallen, aber durch eine weitere Zutat wieder zurück kommen - aber das lässt sich bestimmt leicht testen, wenn das Ding mal da ist...[BR][BR]...im Original heißt es \"in which order\" - ich denke aber, daß das im Sinne von \"in welcher Anordnung\" (also wieviel von was) gemeint ist und nicht \"in welcher Reihenfolge\"..."}, {"115": "Also, was ich da jetzt alles zu gelesen habe, kann ich rein für mich zum Kessel sagen: Danke, verzichte. Ich spiele nicht Elvenar, um hier ein Studium zu beginnen, sondern um 1-2 Mal am Tag etwas Spaß in einem Spiel zu haben. Den Kessel werde ich links liegen lassen. Wenn so auch in Zukunft alles so weiterläuft wie bisher im Turnier und im Spiel, ist alles gut. Wenn nicht...tja,... [smilie--sprite11]"}, {"155": "Romilly schrieb:\t\t\t...jupp - mit 4 Diplomen fängt man mit 1000 pro Gut für den Kauf von Hexenpunkten an - bei 20 Diplomen sind es nur 10 als Startwert - es macht also wenig Sinn, absichtlich Diplome auszulassen (also eine Kapitelforschung nicht zu machen) - besser man drückt ungewollte Effekte einfach aus der Liste raus...\t\tZum Vergrößern anklicken....Doch, es kann trotzdem durchaus Sinn ergeben nicht alle Diploma zu erledigen. [smilie--sprite2] Da darf dann aber jeder selber rumrätseln was er/sie gerne hätte."}, {"19": "Ich freue mich schon sehr auf den Hexenkessel  [smilie--sprite6] [BR]Geiles Teil [smilie--sprite2]"}, {"260": "Ich bin sehr neugierig auf den Kessel. Auch wenn sich mir im Moment noch nicht so ganz erschließt, wie das alles funktioniert, denke ich, dass man zumindest mit der Zeit und ein wenig Erfahrung guten Nutzen ziehen kann. Beim Turm damals hab ich ja auch eine ganze Weile gebraucht, bis ich ihn kennen und lieben gelernt habe."}, {"114": "Ich werde weiterhin mitlesen.. auf Reaktionen schauen.Ist bestimmt auch spannend. Vielleicht werde ich irgendwann mal tiiieeef Luft holen und mich im Kessel breitmachen[BR]Wünsche euch viele erfolgreiche Rezepte [smilie--sprite1]"}, {"113": "Ich bin sicher, dass ich mich mit dem Kessel beschäftigen werde - irgendwann bald. Ich bin viel zu neugierig, als dass ich den so einfach links liegen lassen könnte, schließlich wird er ein Teil von Elvenar werden."}, {"177": "danke Romilly für die Erklärung. Ehrlich gesagt, hab ich auf der Beta ziemlich planlos rumgeklickt^^"}, {"128": "Ich bin wirklich beeindruckt über diese Seite Feedback für ein Feature, welches erst in 3 Tagen online geht.[BR][BR]Großartig!"}]