[{"113": "Pukka schrieb:\t\t\tgenau das meinte ich - will sagen das stört mich am meisten. in meinem verständnis ist es so: zwiebeln, suppengrün, brühe, erbsen in den pott, abschmecken, wenn ICH hunger hab essen: satt. und zwar immer, und immer nach 2 kellen suppe. nicht -mal brauch ich eine kelle, mal 3 und mal muss ich hungrig aufstehen. ich nehme die selben zutaten und bekomme einen festgelegten effekt. und zwar wenn ich den brauche. nicht samstag früh um 1 oder so.\t\tZum Vergrößern anklicken....[smilie--sprite8] köstlich[BR][BR]aber zumindest den Zeitpunkt, wann du den Trank trinkst (- den Effekt einsetzt) kannst du, fast uneingeschränkt, selbst bestimmen."}, {"133": "Romilly schrieb:\t\t\t...was willst du denn damit, wenn du nichts mehr brauen kannst?...ich würde es viel verwirrender finden, wenn der noch da wäre, man aber nichts mehr damit tun kann...\t\tZum Vergrößern anklicken.... na gucken rumprobieren, einfach schauen. Merken, überprüfen, was man so alles treibt, wenn einem was interessiert."}, {"2": "zenka schrieb:\t\t\tna gucken rumprobieren, einfach schauen. Merken, überprüfen, was man so alles treibt, wenn einem was interessiert.\t\tZum Vergrößern anklicken.......das kannst du ja am Sonntag auch machen, bevor du auf Brauen drückst...das ist jetzt eigentlich nur ein Problem der 1. Woche..."}, {"113": "zenka schrieb:\t\t\tna gucken rumprobieren, einfach schauen. Merken, überprüfen, was man so alles treibt, wenn einem was interessiert.\t\tZum Vergrößern anklicken....Mir fehlt das auch grade ein bisschen, aber das liegt eher daran, dass wir das ganze Paket am Stück bekommen haben und ich jetzt auch gleich alles auf einmal wissen will."}, {"68": "littleFlex schrieb:\t\t\tes sind und bleiben immer diese 12 Zutaten\t\tZum Vergrößern anklicken....[BR]Romilly schrieb:\t\t\t...es gibt immer die gleichen 12 Zutaten - aber davon 4 nur für Diamanten - das wird jede Woche neu ausgewürfelt...\t\tZum Vergrößern anklicken....[BR]Danke, somit ist das auch klar. [BR][BR]Also kann man festhalten, man beginnt mit 8 Zutaten die Hexenpunkte kosten und 4 Zutaten die Diamanten kosten. Wenn dann die Zauberin am Samstag auf Zutatensuche in den Wald geht und Sonntags wieder kommt, dann sind aber wieder 8 Zutaten für Hexenpunkte und 4 für Diamanten, und die Verteilung erfolgt per Zufall.[BR][BR]Romilly schrieb:\t\t\t...das bringt dir auch nichts, denn zum Brauen kannst du nur die Hexenpunkte verwenden, die du automatisch bekommen hast - diese werden anhand deiner erledigten Forschungen berechnet - Zukaufen (gegen Ressourcen) kannst du dann erst in der Studienphase und da solltest du dann auch alle Hexenpunkte in die Weiterentwicklung investieren, denn alles was übrig bleibt, verfällt in der Nacht von Freitag auf Samstag - den ganzen Samstag über ist die Zauberin dann damit beschäftigt, neue Zutaten im Wald zu suchen und ab Sonntag kann man dann wieder einen neuen Trank brauen - aber nur mit den Hexenpunkten, die man aus dem Forschungsbaum bekommen hat...\t\tZum Vergrößern anklicken....[BR]Also gibt es eine maximale Anzahl an Hexenpunkten die sich aus den kompletierten Forschungen ergeben. CHECK[BR][BR]Und die kann ich aber zum Brauen verwenden und die übrig gebliebenen um einen Effekt steigern? OFFEN[BR][BR]Wenn ich in dieser Woche aber keinen Trank brauen will, dann kann ich vorhandene Effekte aber auch nicht steigern. OFFEN[BR][BR]Wenn ich, je nachdem wieviele Kelche ich habe, 1 Effekt erhalte, den schon habe, dann kann ich wählen welchen ich behalten will. CHECK[BR][BR]Wenn ich in dieser Woche einen Trank braue und einen neuen Effekt erhalte, dann kann ich aber wählen welchen ich steigern will, oder geht das nur mit dem Effekt, den man in dieser Woche erhalten hat. OFFEN[BR][BR]Und wenn ich nicht genug Hexenpunkte habe um den Effekt zu steigern, dann kann ich mir zusätzliche Hexenpunkte mit Ressourcen zukaufen. CHECK[BR][BR]Romilly schrieb:\t\t\t...wie sich die Zutaten verteuern, wenn man weitere Zutaten in den Kessel wirft, habe ich in einem anderen Beitrag mit einer Tabelle gepostet...\t\tZum Vergrößern anklicken....[BR]Da habe ich für alle 12 Zutaten schon eine Liste mit der Steigerung von Stufe 1 bis 25 (aus 2 nicht DE Welten mit der 1 aus DE verglichen und das passt soweit auch), aber nur wenn man 1 Zutat verwendet. Eine Liste mit allen Möglichkeiten wird von mir nicht angefertigt werden, obwohl, bei der eingeschränkten Menge an Hexenpunkten könnte das ja noch gehen, mal sehen ob ich mir das antue wenn ich mir die maximalen Hexenpunkte dann mal ansehe und meine Lieferanten auch willig zum liefern sind  [smilie--sprite7] [BR][BR]Gewisse Effekte dürften ja wirklich nur erscheinen wenn man sich in gewissen Kapiteln befindet, daher wird das von meiner Seite eher nichts, kann da nur bis Kapitel XI dienen, aber nur wenn ich weiterhin die Informationen bekomme die ich benötige."}, {"103": "Du kannst alle HP zum Brauen verwenden oder auch wenige, das liegt allein bei Dir.[BR]Was davon übrig bleibt, kannst zum Steigern verwenden nach dem Brauen.[BR][BR]Ohne Brauen, kein Steigern, richtig.[BR][BR]Steigern kannst Du nach dem Brauen immer alle Effekte, die durch Diplome frei sind, unabhängig vom Brauergebnis."}, {"2": "Moonlady70 schrieb:\t\t\tUnd die kann ich aber zum Brauen verwenden und die übrig gebliebenen um einen Effekt steigern? OFFEN\t\tZum Vergrößern anklicken.......ja - du musst nicht alle Hexenpunkte zum Brauen verwenden - du kannst einfach für 50 einen reinwerfen und dann in die Studierphase übergehen...[BR][BR]Moonlady70 schrieb:\t\t\tWenn ich in dieser Woche aber keinen Trank brauen will, dann kann ich vorhandene Effekte aber auch nicht steigern. OFFEN\t\tZum Vergrößern anklicken.......wenn du die Brauphase nicht verlässt, kommst du auch nicht in die Studienphase...[BR][BR]Moonlady70 schrieb:\t\t\tWenn ich in dieser Woche einen Trank braue und einen neuen Effekt erhalte, dann kann ich aber wählen welchen ich steigern will, oder geht das nur mit dem Effekt, den man in dieser Woche erhalten hat. OFFEN\t\tZum Vergrößern anklicken.......verbessern kannst du alle Effekte, für die du die Diplome hast...die Verbesserung gilt dann aber natürlich erst für den Trank von der nächsten Woche...(den alten hast du ja schon verdaut)[BR]Moonlady70 schrieb:\t\t\tDa habe ich für alle 12 Zutaten schon eine Liste mit der Steigerung von Stufe 1 bis 25 (aus 2 nicht DE Welten mit der 1 aus DE verglichen und das passt soweit auch), aber nur wenn man 1 Zutat verwendet. Eine Liste mit allen Möglichkeiten wird von mir nicht angefertigt werden, obwohl, bei der eingeschränkten Menge an Hexenpunkten könnte das ja noch gehen, mal sehen ob ich mir das antue wenn ich mir die maximalen Hexenpunkte dann mal ansehe und meine Lieferanten auch willig zum liefern sind [smilie--sprite7]Zum Vergrößern anklicken.......meine Liste geht bis 6 x gleiche Zutat - mehr gleiche würden dann eh schnell zu teuer werden - diese Werte sind also uninteressant...[BR]Romilly schrieb:\t\t\t...da hab ich mittlerweile auch eine komplette Liste (bzw. hab ich nicht mehr als 6 gleiche notiert - mehr wären ja noch teurer...[BR]Anhang 33325 ansehen...kauft man eine Zutat mit Dias, erhöhen sich die Preise nicht...[BR][BR]...das mit dem Preisunterschied ist interessant - war mir noch nicht aufgefallen...bei der einzelnen Preisentwicklung ist die Reihenfolge egal...aber die Summe ist also dann verschieden...[BR][BR]...das ist das Problem bei dem Ganzen - eine möglichst hohe Wahrscheinlichkeit auf ein paar bestimmte Effekte, erhält man nur, wenn man auch viele gleiche Zutaten verwendet - das macht den Trank allerdings dann sehr teuer (unbezahlbar)...\t\tZum Vergrößern anklicken...."}, {"3": "[smilie--sprite8] Ach, ist mir alles zu kompliziert.  Und je mehr ich hier lese, desto komplizierter wird es.[BR]Ich habe meinen ersten Trank schon gebraut und getrunken (lecker? - na ja, hielt sich in Grenzen)[BR][BR]Aber ein Effekt für ca. 2 Stunden war da: mehr Mana, angekurbelte Güterproduktion, stärkere Truppen im Trainingsgelände. Das hab ich in der kurzen Zeit (in den 2 Stunden) genutzt, so gut ich konnte.[BR]Mit den vielen übrigen Hexenpunkten habe ich mir einiges hochgelevelt. Mana, Saaten, Truppen.[BR][BR]Also für den ersten Versuch bin ich ganz zufrieden. Den Rest wird die Zeit zeigen.[BR]Ich denke, es tut nicht weh, wenn ich erstmal ganz naiv herangehe und es einfach ausprobiere und lerne.[BR]Es müssen ja nicht gleich die Mega-Effekte sein.[BR][BR]Schön gemacht ist es jedenfalls, es sieht toll aus, und ich mag meine Zauberin Melissa (und bin froh, dass sie im Gegensatz zu Tandriel, recht hübsch aussieht)"}, {"2": "Fayence schrieb:\t\t\tIch denke, es tut nicht weh, wenn ich erstmal ganz naiv herangehe und es einfach ausprobiere und lerne.\t\tZum Vergrößern anklicken.......in Elvenar läuft eigentlich nix davon  [smilie--sprite2] ..."}, {"107": "Mein persönlicher Eindruck vom Kessel:[BR]- ich mach das Ding auf und verstehe erstmal gar nix[BR]- Nachdem ich dann \"etwas\" nachjgelesen hab hier hab ich nen paar Zutaten reingeworfen und auf den den komischen Kelch gedrückt[BR]- Das Ding sagt \"zu wenig Zutaten\" oder sowas, ich hab aber auch keine Möglichkeit gesehen noch irgend was reinzubuttern. Ein Limit fpr Zutaten war ja nirgends angegeben.[BR][BR]-> Also alle Kelche verbraten für anscheinend nix[BR][BR]Nun kann ich wohl noch irgendwelche Effekte verbessern mit Punkten und noch Punkte kaufen mit Ressis bis die Kelche nach einer Woche wiederkommen sollen...[BR]Hab ich mal gemacht, ist, so empfinde ich das, trotzdem nix passiert was mich jetzt jedenfalls irgendwie aufhorchen lassen würde[BR][BR]Daher mein Feedback:[BR]Absolut kompliziert, wer sich sowas ausdenkt für ein online-Spiel hat wirklich was für die Spieler getan die ne Menge lange Weile haben müssen.[BR][BR]Meiner Meinung nach sollten Dinge, gerade im online-Spiel, ziemlich intuitiv zu spielen sein, da ich jedenfalls nach Feierabend keine Lust habe mich in irgendwelche Dinge Ewigkeiten hineinlesen zu müssen oder seitenweise Feedback anzuschauen mit etlichen Bildern die mir irgendwas erklären sollen.[BR][BR]Vielleicht, sollte es irgendwann mal eine Anleitung dazu geben die nicht mehr als 20 Sätzen beinhaltet werde ich der Sache wohl nochmal ne Chance geben, aber so....  Ist mir viel zu umständlich und kompliziert [BR][BR]Das schöne dabei: Man muss den ja nicht spielen, ich sehe jedenfalls keinen Nachteil darin das Ding links liegen zu lassen, von daher wünsche ich allen viel Spaß dabei die sich das Ding echt antun und ihre Lebenszeit investieren wollen..."}, {"2": "Charly1566 schrieb:\t\t\tDas Ding sagt \"zu wenig Zutaten\" oder sowas, ich hab aber auch keine Möglichkeit gesehen noch irgend was reinzubuttern. Ein Limit fpr Zutaten war ja nirgends angegeben.\t\tZum Vergrößern anklicken....[IMG]https://i.ibb.co/s6PgD9q/https-de-forum-elvenar-com-index-php-attachments-a4-png-33405.png[/IMG]...deine Gesamt-Wahrscheinlichkeit auf einen Treffer bzw. die \"Erfolgsrate des Trankes\" war wohl ziemlich gering..."}, {"107": "Romilly schrieb:Anhang 33405 ansehenZum Vergrößern anklicken....Exakt, dann hab ich \"Zum Wohl\" gedrückt...  Und nix passierte soweit ich das beurteilen kann, ausser dass das gleiche Fenster wieder kam."}, {"2": "...je mehr Zutaten man verwendet desto höher wird die Erfolgsrate...[IMG]https://i.ibb.co/XLsVRtw/https-de-forum-elvenar-com-index-php-attachments-erfolgsrate-png-33406.png[/IMG]"}, {"107": "Ja, mag ja sein das zu wissen wenn man sich Ewigkeiten dazu was anliest, aber der Spieler wie ich, \"eben mal ausprobieren\", drückt zum Wohl und verbrät damit alle Kelche, denkt was soll der Quatsch, und macht das Ding zu.[BR][BR]Das ist doch so kompliziert aufgebaut, mir macht das jedenfalls keinen Spaß mich da so lange mit aufzuhalten.[BR][BR]Dazu muss ich´s jetzt einfach mal sagen: Ich bringe echt sowas Umständliches raus, kriege es aber nicht hin einen der deuten Sprache Mächtigen im Stammhaus in Hamburg mal dazu zu bringen das Ding auf deutsch zu erklären, muss also das Video in englisch rausbringen, schalte aber im Gegenzug dafür Fernsehwerbung für Elvenar, da stimmt meiner Meinung nach irgend was nicht mit dem Verhältnis..."}, {"3": "Charly1566 schrieb:\t\t\tVielleicht, sollte es irgendwann mal eine Anleitung dazu geben die nicht mehr als 20 Sätzen beinhaltet\t\tZum Vergrößern anklicken....Es gibt eine Questreihe (da wo sonst die zyklischen Quests sind), die hilft etwas beim Verstehen. Da leitet die Zauberin dich durch."}, {"107": "Fayence schrieb:\t\t\tEs gibt eine Questreihe (da wo sonst die zyklischen Quests sind), die hilft etwas beim Verstehen. Da leitet die Zauberin dich durch.\t\tZum Vergrößern anklicken....Danke Dir, werde ich mir anschauen. Nur ist meine Quest:; Schließe eine Provinz ab. [BR]Lese ich Deinen Post nicht, merke ich das gar nicht, da ich die zyklischen Quests nicht mehr abschließe, da zu wenig Nutzen. [BR][BR]Also auch schlecht umgesetzt, wenn ich das Kapitel 5 schon ein paar Tage abgeschlossen habe (vielleicht isses ja dann besser)"}, {"2": "...im Wiki wird eigentlich ziemlich viel erklärt... https://de.wiki.elvenar.com/index.php?title=Der_Hexenkessel"}, {"107": "Alles gut, wie gesagt, ich hab keine Lust Ewigkeiten zu lesen um irgendwas spielen zu könne, daher habe ich auch nur geschildert was passiert wenn man das eben nicht tut und der Kessel einem nix bringt.[BR][BR]Wer Spaß dran hat gerne, aber die Umsetzung empfinde ich eben als sehr sehr kompliziert und damit für ein online-Spiel, was man mal eben anwirft und etwas nebenbei zockt, als vollkommen misslungen. Nur mein Feedback dazu [smilie--sprite1]"}, {"103": "Charly, wenn es für Dich nur ein \"Nebenbei\" ist,[BR]dann nimm doch einmal pro Woche die kostenlosen Hexenpunkte,[BR]steck davon so viele Zutaten in den Kessel, wie bezahlbar sind und[BR]freue Dich dann über den Boost, den Du erhältst.[BR][BR]Das ist nicht kompliziert, kostet nichts und bringt Dir eine Zeit lang sogar Zugewinn im normalen Spiel...[BR][BR]... und es dauert keine Minute [smilie--sprite2]"}, {"107": "littleFlex schrieb:\t\t\tCharly, wenn es für Dich nur ein \"Nebenbei\" ist,[BR]dann nimm doch einmal pro Woche die kostenlosen Hexenpunkte,[BR]steck davon so viele Zutaten in den Kessel, wie bezahlbar sind und[BR]freue Dich dann über den Boost, den Du erhältst.[BR][BR]Das ist nicht kompliziert, kostet nichts und bringt Dir eine Zeit lang sogar Zugewinn im normalen Spiel...[BR][BR]... und es dauert keine Minute [smilie--sprite2]Zum Vergrößern anklicken....Habe ich gemacht und habe ich auch zukünftig vor, diesmal war´s ja zu wenig, nächstes Mal butter ich da alles rein was ich zu fassen kriege und schaue mal was passiert [smilie--sprite1]"}]