[{"35": "1. Anregung[BR]Dass man die Hexenpunkte jede Woche neu bekommt, steht nirgendwo im Wiki, oder? [BR]Das wäre eine Anregung, das noch aufzunehmen oder mehr zu verdeutlichen. Denn ich dachte, man darf sie nicht verplempern.[BR][BR]2. Bug/Anregung[BR]Heute gesehen:[BR][IMG]https://i.ibb.co/373d2hb/https-de-forum-elvenar-com-index-php-attachments-1673468723862-png-33408.png[/IMG][BR][BR]Settlement Ressources mit \"Rohstoffe der Siedlung\" zu übersetzen klingt mir nach deepl [smilie--sprite2][BR]Gibt es in Elvenar nicht einen festen Begriff dafür? \"Begrenzte Ressourcen des Gastvolkes\" oder so ähnlich ist mir in Erinnerung. Könnte das gemeint sein?"}, {"103": "sie heißen \"Siedlungsressourcen\"[BR][BR]man findet ja auch die Gebäude unter \"Siedlungen\"[BR][BR]und aus dem Wiki:[BR][BR][IMG]https://i.ibb.co/sP9ccKJ/https-de-forum-elvenar-com-index-php-attachments-1673469110384-png-33409.png[/IMG]"}, {"13": "hobbitrose schrieb:\t\t\t1. Anregung[BR]Dass man die Hexenpunkte jede Woche neu bekommt, steht nirgendwo im Wiki, oder? [...]\t\tZum Vergrößern anklicken....@hobbitrose > das ist der gesuchte Text aus dem Wiki >[BR][BR][IMG]https://i.ibb.co/png98dP/https-de-forum-elvenar-com-index-php-attachments-th-7283619143-jpg-33410.jpg[/IMG][BR][Nachtrag] 'tschuldige die Dopplung, da hat littleFlex fix nachgelegt [smilie--sprite6]"}, {"103": "Zweiter ^^"}, {"2": "littleFlex schrieb:\t\t\tsie heißen \"Siedlungsressourcen\"\t\tZum Vergrößern anklicken.........neee - [IMG]https://i.ibb.co/F6RCLq8/https-de-forum-elvenar-com-index-php-attachments-portal-png-33411.png[/IMG]...und somit ist das im Prinzip das Gleiche wie Bonus für \"Rohstoffe der Siedlung\"..."}, {"35": "[IMG]https://i.ibb.co/Rydj9rf/https-de-forum-elvenar-com-index-php-attachments-1673469671733-png-33412.png[/IMG][BR]das gibt es auch [smilie--sprite1][BR][BR]Also vielleicht doch einen festen Begriff einführen, damit Verwirrung reduziert wird?[BR]Ich frage mich nämlich jetzt schon, ob der Bonus wie die Wunder auf alle Güter des Gastvolkes wirkt oder wie ein Portalo nur auf die begrenzten."}, {"2": "hobbitrose schrieb:Anhang 33412 ansehen[BR]das gibt es auch [smilie--sprite1][BR][BR]Also vielleicht doch einen festen Begriff einführen, damit Verwirrung reduziert wird?\t\tZum Vergrößern anklicken.......vielleicht sind es ja nicht nur die begrenzten - ich denke eher, daß der Effekt wie die Hummel wirkt bzw. wie der Portalbonus..."}, {"35": "@Romilly da steht \"Güter des Gastvolkes\" - nicht Siedlungsrohstoffe oder Siedlungsressourcen."}, {"2": "hobbitrose schrieb:@Romilly da steht \"Güter des Gastvolkes\" - nicht Siedlungsrohstoffe oder Siedlungsressourcen.\t\tZum Vergrößern anklicken.......solange da nichts von Gastrennen steht, bin ich eigentlich schon zufrieden ^^...hab das letztens in einem ganz anderem Forum (auf deutsch übersetzt) wieder gelesen - anscheinend wird da zuerst auf englisch und dann ins Deutsche übersetzt - denn in der Nationalsprache stand da ganz klar was von \"Rassen\" (weiß nimmer, welche Sprache es genau war - es war aber erkennbar)..."}, {"273": "Ich kann mich mit dem Hexenkessel auch nicht anfreunden. Ich hab einen Trank gebraut und dann einen ork-boost erhalten, welcher für ca 4h anhielt. Leider konnte ich in dieser Zeit keine Orks einsammeln, abgesehen davon, dass ich diesen boost nicht gebraucht hätte. Wenn ich mir aussuchen könnte, welche boosts ich brauen möchte, wäre dies durchaus interessant, aber das scheint nicht so zu sein."}, {"2": "Lensloony 33 schrieb:\t\t\tIch kann mich mit dem Hexenkessel auch nicht anfreunden. Ich hab einen Trank gebraut und dann einen ork-boost erhalten, welcher für ca 4h anhielt. Leider konnte ich in dieser Zeit keine Orks einsammeln, abgesehen davon, dass ich diesen boost nicht gebraucht hätte. Wenn ich mir aussuchen könnte, welche boosts ich brauen möchte, wäre dies durchaus interessant, aber das scheint nicht so zu sein.\t\tZum Vergrößern anklicken.......du kannst es beeinflußen...ein gewisser Zufall bleibt aber..."}, {"152": "mein Feedback:[BR]Eine schlechte Idee leider auch noch richtig schlecht umgesetzt.[BR][BR]Eine Lotterie ist kein Strategiespiel.[BR][BR]Wenn die optionalen Forschungen angeblich ja keinen negativen Einfluss mehr haben und wenn eigentlich der komplette Forschungsbaum abgeschlossen sein muss bis zu dem Kapitel, dessen Trankeffekt man möchte (ja, scheinbar ist die Anzahl der Diplome für die Aktivierung der Effekte relevant, aber wenn man einen Effekt aus einem höheren Kapitel aktivieren möchte, dann läuft es doch darauf hinaus, dass man den Forschungsbaum bis zu diesem Kapitel abschließen sollte, um die Forschungskosten möglichst \"gering\" zu halten), dann empfinde ich die \"optionalen\" Punkte im Forschungsbaum als reine Farce. [BR][BR][BR]Romilly schrieb:\t\t\t...ist für mich jedenfalls keiner...das ist nur etwas, was dir missfällt, vielen Spielern aber sowas von egal ist...\t\tZum Vergrößern anklicken....Finde ich klasse, dass du scheinbar bestens darüber informiert bist, wie die Mehrheitsmeinung diesbzgl. ist und ich mit meiner Meinung alleine dastehe. Wie wäre es, wenn du nur für dich sprichst und dich nicht zur Vertretung vieler Spieler aufschwingst?"}, {"28": "hobbitrose schrieb:@Romilly da steht \"Güter des Gastvolkes\" - nicht Siedlungsrohstoffe oder Siedlungsressourcen.\t\tZum Vergrößern anklicken....Sinngemäß ist das schon irgendwie das Gleiche, oder?[BR][BR]Man kann auch aktiv Dinge falsch verstehen wollen, denke ich. ;-)"}, {"28": "Sir Gareth schrieb:\t\t\tmein Feedback:[BR]Eine schlechte Idee leider auch noch richtig schlecht umgesetzt.[BR][BR]Eine Lotterie ist kein Strategiespiel.[BR][BR]Wenn die optionalen Forschungen angeblich ja keinen negativen Einfluss mehr haben und wenn eigentlich der komplette Forschungsbaum abgeschlossen sein muss bis zu dem Kapitel, dessen Trankeffekt man möchte (ja, scheinbar ist die Anzahl der Diplome für die Aktivierung der Effekte relevant, aber wenn man einen Effekt aus einem höheren Kapitel aktivieren möchte, dann läuft es doch darauf hinaus, dass man den Forschungsbaum bis zu diesem Kapitel abschließen sollte, um die Forschungskosten möglichst \"gering\" zu halten), dann empfinde ich die \"optionalen\" Punkte im Forschungsbaum als reine Farce.[BR][BR][BR][BR]Finde ich klasse, dass du scheinbar bestens darüber informiert bist, wie die Mehrheitsmeinung diesbzgl. ist und ich mit meiner Meinung alleine dastehe. Wie wäre es, wenn du nur für dich sprichst und dich nicht zur Vertretung vieler Spieler aufschwingst?\t\tZum Vergrößern anklicken....Um ein Kapitel abzuschließen zu macht es durchaus Sinn den Forschungsbaum nach und nach abzuarbeiten. Dann sind auch leichter mal entscheidende Schritte im individuellen Erfahrungsschatz und auch auf der Rangliste möglich. Mal ganz unabhängig vom Hexenkessel gesehen.[BR][BR]Sorry fürs off-topic und den Doppelpost an dieser Stelle! ;-)"}, {"2": "Sir Gareth schrieb:\t\t\tWenn die optionalen Forschungen angeblich ja keinen negativen Einfluss mehr haben und wenn eigentlich der komplette Forschungsbaum abgeschlossen sein muss bis zu dem Kapitel, dessen Trankeffekt man möchte (ja, scheinbar ist die Anzahl der Diplome für die Aktivierung der Effekte relevant, aber wenn man einen Effekt aus einem höheren Kapitel aktivieren möchte, dann läuft es doch darauf hinaus, dass man den Forschungsbaum bis zu diesem Kapitel abschließen sollte, um die Forschungskosten möglichst \"gering\" zu halten), dann empfinde ich die \"optionalen\" Punkte im Forschungsbaum als reine Farce.\t\tZum Vergrößern anklicken.......die sind eigentlich nur aus einem Grunde optional - die Berechnung der Forschungs-Truppengröße wurde vor langer Zeit geändert und dazu wurden einige zusätzliche Truppforschungen nachträglich in den Forschungsbaum eingeschoben (genau wie jetzt der Hexenkessel) bzw. auch verschoben und eigentlich hieß es mal, daß die zur Pflicht werden sollen - da gab es aber massig Kritik und deshalb blieben die optional - es gab aber eigentlich nie einen Grund bzw. eine Rechtfertigung, warum sich Händler Forschungen einfach sparen können...."}, {"35": "Thebigunknown schrieb:\t\t\tMan kann auch aktiv Dinge falsch verstehen wollen, denke ich. ;-)\t\tZum Vergrößern anklicken....[BR]Schade, dass Du es so auffaßt.[BR][BR]Ich hatte es wirklich beim Lesen - ohne Forenhinweise - nicht verstanden. Denn ich betrachte meine Stadt als \"Siedlung\". Deswegen waren \"Siedlungsgüter\" in meiner ersten Vorstellung alles, was man so herstellen kann. 'Was für ein klasse Boost', dachte ich. Dass es nur die Ressourcen der Gastvölker sind, darauf wäre ich ohne die Tips hier nie gekommen. Und vielleicht bin ich nicht allein damit?"}, {"28": "Also ich betrachte meine Stadt als Stadt und die Siedlungen als Siedlungen."}, {"2": "...in Elvenar sollte man immer auf die Symbole achten... [IMG]https://i.ibb.co/SXM9ZKx/https-de-forum-elvenar-com-index-php-attachments-portalo-png-33425.png[/IMG]...[IMG]https://i.ibb.co/Fb63snq/https-de-forum-elvenar-com-index-php-attachments-portalo2-png-33426.png[/IMG]...(Kiste mit Deckel)...[BR][BR]...die anderen Güter sehen so aus... [IMG]https://i.ibb.co/dP3SrYB/https-de-forum-elvenar-com-index-php-attachments-g-ter-png-33427.png[/IMG][BR][BR]...(offene Kisten, wo oben die Güter raus schauen)...."}, {"155": "Ich finde es auch eher nervig Forschungen nachholen zu müssen, die ich eigentlich nicht gebrauchen kann."}, {"194": "Forschungen, die optional sind und dann aber doch gebraucht/gemacht werden sollen, finde ich wenig optimal. Dann macht doch gleich alles so, dass man es haben muss."}]