[{"12": "Sir Gareth schrieb:\t\t\tEine Lotterie ist kein Strategiespiel.\t\tZum Vergrößern anklicken....Beim Schach weißt man oft auch nicht, ob der Gegner diesen oder jenen Zug machen wird, insofern auch eine Art Glücksspiel, ob man die richtige Strategie wählt. Und sag bitte nicht, daß Schach kein Strategiespiel wäre.[BR]Insofern kann man solche wahrscheinlichkeitsabhängigen Elemente durchaus in seiner eigenen Strategie berücksichtigen.[BR]Ich werd den Hexenkessel aktiv sowieso nur für's Turnier benutzen, zumindest ein kleiner Kampf-Effekt ist sehr wahrscheinlich, wenn dabei auch ein paar zusätzliche Güter rausspringen ist's erfreulich, berührt mich aber nicht wirklich."}, {"274": "Ich habe 3 von 9 Diplomen. Somit müsste ich alle optionalen Forschungen machen um alles produzieren zu können. Das werde ich natürlich nicht tun. Somit ist der ganze Kessel für mich wertlos, brauche mich damit nicht weiter zu beschäftigen."}, {"152": "Ayla Ayla schrieb:\t\t\tBeim Schach weißt man oft auch nicht, ob der Gegner diesen oder jenen Zug machen wird, insofern auch eine Art Glücksspiel, ob man die richtige Strategie wählt. Und sag bitte nicht, daß Schach kein Strategiespiel wäre.[BR]Insofern kann man solche wahrscheinlichkeitsabhängigen Elemente durchaus in seiner eigenen Strategie berücksichtigen.[BR]Ich werd den Hexenkessel aktiv sowieso nur für's Turnier benutzen, zumindest ein kleiner Kampf-Effekt ist sehr wahrscheinlich, wenn dabei auch ein paar zusätzliche Güter rausspringen ist's erfreulich, berührt mich aber nicht wirklich.\t\tZum Vergrößern anklicken....Nein, ich würde nie behaupten, dass Schach kein Strategiespiel ist, aber ich würde gleichfalls auch nie behaupten, dass Schach \"eine Art Glücksspiel\" ist und es mit einer Lotterie vergleichen."}, {"2": "...jedes Würfelspiel hängt vom (Würfel-)Glück ab..."}, {"203": "Jedenfalls passt der Kessel super zu Elvenar. 10-12 Sekunden spielen - eine Woche warten"}, {"152": "Romilly schrieb:\t\t\t...jedes Würfelspiel hängt vom (Würfel-)Glück ab...\t\tZum Vergrößern anklicken....In der Regel werden deswegen Würfelspiele auch als Glücksspiele bezeichnet und vom Hersteller/Entwickler nicht als Strategiespiele beworben. [BR][BR]Als ich angefangen habe mit Elvenar wurde es von Inno als Strategie-Aufbauspiel bezeichnet/beworben, deswegen habe ich das Spiel angespielt. Inzwischen wird es meist nur noch als Aufbauspiel bezeichnet und die Zufallselemente bestimmen immer mehr das Spielgeschehen. Für mein Empfinden sind die Zufallselemente bereits so stark, dass es eher einer Lotterie gleicht."}, {"17": "Sir Gareth schrieb:\t\t\tIn der Regel werden deswegen Würfelspiele auch als Glücksspiele bezeichnet und vom Hersteller/Entwickler nicht als Strategiespiele beworben.\t\tZum Vergrößern anklicken....ganz dünnes Eis, wüsste jetzt kein \"offline\" Strategiespiel bei dem nicht gewürfelt wird. Bei allen \"online\" Strategiespielen ist das würfeln nur nicht so offentsichtlich."}, {"103": "das Thema gleitet hier langsam ab, bitte findet wieder den Weg zurück zum Feedback des Kessels"}, {"113": "Sir Gareth schrieb:\t\t\tIn der Regel werden deswegen Würfelspiele auch als Glücksspiele bezeichnet und vom Hersteller/Entwickler nicht als Strategiespiele beworben.[BR][BR]Als ich angefangen habe mit Elvenar wurde es von Inno als Strategie-Aufbauspiel bezeichnet/beworben, deswegen habe ich das Spiel angespielt. Inzwischen wird es meist nur noch als Aufbauspiel bezeichnet und die Zufallselemente bestimmen immer mehr das Spielgeschehen. Für mein Empfinden sind die Zufallselemente bereits so stark, dass es eher einer Lotterie gleicht.\t\tZum Vergrößern anklicken....Ich möchte dich nicht bekehren, wenn du das so siehst, ist das so aaaber[smilie--sprite2][BR][BR]wenn du genau hinschaust, ist Elvenar in seinem Kern noch immer ein Aufbauspiel. Du baust eine Stadt auf. Dafür brauchst du unterschiedliche Gebäude (Werkstätten, Manufakturen, Wohnhäuser, Schnickschnack) und Strassen. Und damit es nicht gar zu eintönig wird, kommt gelegentlich Besuch vorbei, der Ansprüche an den Aufbau deiner Stadt stellt. Es kommt alleine auf dich an, wie du deine Stadt gestaltest und Glück ist in diesem Szenario eher ein Fremdwort weil nicht nötig.[BR][BR]Das sieht bei den ganzen Modulen, die im Laufe der Jahre dazugekommen sind, anders aus, da hast du Recht, da ist manchmal eine recht große Portion Glück nötig. Aber das Schöne an diesen Modulen ist, sie liefern nur Steoride für die Stadt, die im Prinzip nicht gebraucht werden. Ist wie Jahrmarkt, wer Spaß dran hat, geht hin, wer keinen Spaß dran hat, bleibt zu Hause.[BR][BR]Elvenar war, ist und bleibt dabei ein Aufbauspiel.[BR]Mir persönlich wäre Elvenar puritanisch zu spielen zu langweilig[BR][BR]Nachtrag um wieder den Bogen zu kriegen[BR][BR]Deswegen gefällt mir der Kessel, ich gehe gerne auf den Jahrmarkt und der Kessel ist ein neues Fahrgeschäft [smilie--sprite1]"}, {"152": "lovelymonster schrieb:\t\t\tIch möchte dich nicht bekehren, wenn du das so siehst, ist das so aaaber[smilie--sprite2][BR][BR]wenn du genau hinschaust, ist Elvenar in seinem Kern noch immer ein Aufbauspiel. Du baust eine Stadt auf. Dafür brauchst du unterschiedliche Gebäude (Werkstätten, Manufakturen, Wohnhäuser, Schnickschnack) und Strassen. Und damit es nicht gar zu eintönig wird, kommt gelegentlich Besuch vorbei, der Ansprüche an den Aufbau deiner Stadt stellt. Es kommt alleine auf dich an, wie du deine Stadt gestaltest und Glück ist in diesem Szenario eher ein Fremdwort weil nicht nötig.[BR][BR]Das sieht bei den ganzen Modulen, die im Laufe der Jahre dazugekommen sind, anders aus, da hast du Recht, da ist manchmal eine recht große Portion Glück nötig. Aber das Schöne an diesen Modulen ist, sie liefern nur Steoride für die Stadt, die im Prinzip nicht gebraucht werden. Ist wie Jahrmarkt, wer Spaß dran hat, geht hin, wer keinen Spaß dran hat, bleibt zu Hause.[BR][BR]Elvenar war, ist und bleibt dabei ein Aufbauspiel.[BR]Mir persönlich wäre Elvenar puritanisch zu spielen zu langweilig[BR][BR]Nachtrag um wieder den Bogen zu kriegen[BR][BR]Deswegen gefällt mir der Kessel, ich gehe gerne auf den Jahrmarkt und der Kessel ist ein neues Fahrgeschäft [smilie--sprite1]Zum Vergrößern anklicken....Eine schöne \"ja, aber\"-Antwort bekomme ich auch hin:[BR]Ja, Elvenar beinhaltet noch immer Aufbauelemente, vllt behält Inno das auch bei, vllt aber auch nicht. Ich weiß nicht, was Inno so plant. Aber gemäß der Werbung von Inno selbst hat sich das Spiel schon von Strategie-Aufbau zu Aufbau verändert.[BR][BR]Ein Strategiespiel hat keine bis kaum Zufallselemente, ein Aufbauspiel kann ein paar mehr haben, aber wenn die Zufallselemente überwiegen, dann ist es eben ein Glücksspiel mit Aufbauelementen und kein Aufbauspiel mit Zufallselementen.[BR]Bildlich gesprochen: Wenn eine große Wassermelone genau in der Mitte eine winzige Erbse hätte, dann wäre sie im Kern eine Erbse, aber beim Verzehr würde der überwiegende Teil der Zeit für die Wassermelone aufgewendet werden. ^^[BR][BR]stone2345 schrieb:\t\t\tganz dünnes Eis, wüsste jetzt kein \"offline\" Strategiespiel bei dem nicht gewürfelt wird. Bei allen \"online\" Strategiespielen ist das würfeln nur nicht so offentsichtlich.\t\tZum Vergrößern anklicken....Ich bewege mich doch nicht auf dünnem Eis, nur weil du keine Strategiespiele ohne Würfel kennst. Wenn du sowas spielen wollen würdest, dann würdest du schnell fündig werden können. Diese Spiele stellen nämlich kein Einhorn dar. ^^[BR][BR]-> mein Feedback bleibt:[BR]Für mich persönlich gibt es inzwischen deutlich zu viele Zufallselemente im Spiel und so verliert das Spiel den Spielreiz, denn es mal hatte."}, {"272": "littleFlex schrieb:\t\t\twenn Du erklären könntest, warum es Dir so geht, könnten wir etwas damit anfangen...\t\tZum Vergrößern anklicken....Ich würde mich des Plagiates schuldig machen  dürfte in den folge Antworten  deutlich geworden sein....nein, ernsthaft. Die große Anstrengung etwas zu implementieren was graphisch toll gelungen ist und wohl auch theoretisch durchdacht ist muss gewürdigt werden. Jedoch in der Bedienung und Erklärung sowie in der Wirkung lässt der Hexenkessel seine gelungene graphische Umsetzung weit hinter sich. Ich bin hier gerne um zu spielen, akademische Forschungen (zur Funktion des Kessels) sind eventuell etwas ...nuja, hab ich beruflich genug, nach Feierabend brauch ich das nicht. Aber, und damit sei das Thema für mich auch durch, wie einige hier schon schrieben: ich muss den Kessel ja nicht spielen! Es wäre bestimmt ein Vorteil es zu tun, aber kein Nachteil es zu lassen."}, {"133": "Wie man meiner vielen Fragerei entnehmen kann, gefällt mir der Kessel richtig gut. Auf Beta war ich super genervt. ( kleines Kap) [BR]Bedeutet für mich ! je mehr Kap und vollständige Kap, ums so mehr Spaß. [BR][BR]Spielerisch mochte ich noch nie offene Forschungen. Egal ob ich die Forschungen gebrauchen konnte, ich habe schon immer alles abgeschlossen.[BR]Daher Glück gehabt. [BR][BR]Fragmente möchte ich keine einsetzen, auch keine Dias. Ausbauen alles auf max. Bin gespannt...."}, {"113": "Ein Effekt des Kessels zeichnet sich bei mir jetzt schon ab - ich werde in Zukunft selbst in meiner Solostadt deutlich mehr turnieren, um alle Kelche zu bekommen."}, {"22": "Ausgelassene Forschungen...[BR]Ja, die vernachlässigten Dinger sind ja dann schon meist history-würdig, die da evtl nachzuholen sind. Bei jedem Forschungsstau hole ich dort was nach - passt das schon irgendwann. Wie's scheint gehen da die Meinungen auseinander. Ich glaube, je länger man das Spiel spielt, desto ruhiger wird man dabei. Vielleicht ein Trost für alle, die sich jetzt über nachzuholende Forschungsbereiche ärgern.[BR][BR]Vor Wochen konnte man ja schon flüstern hören, dass völlig erforschte Kapitel mit Forschungsdiplomen belohnt werden. Wäre ja vllt 'n Gambit gewesen, rechtszeitig Vorsorge walten zu lassen. In unserer bescheidenen Gemeinschaft wurde das jedenfalls verkündet und besprochen. So konnte man schon mal vieles nachholen.[BR][BR]Jetzt gilt es, den Kessel ein bisschen strategisch zum Einsatz zu bringen. Mal sehen, wie man das wohl am oberallerbesten schaffen kann...[BR][BR]@INNO-Games-Coder & -Grafiker: Danke für all die Mühe. Schöne Story. Ich hoffe das war's wert [smilie--sprite8][BR][BR]Ich hätte es besser gefunden, die Kelche nach Bedarf süffeln zu können. Im Moment sieht es für mich so aus, als seien die Effekte nach 3-12 Stunden verflogen. Eine passende Antwort darauf liegt schon auf der Hand oder? Eigentlich ganz einfach.[BR][BR]Na denn.. Kopf hoch, Augen zu, und durch. Datt wird schon.[BR][BR]Viel Erfolg und trinkt nicht so viel.[BR][BR]lg.[BR]Leo"}, {"94": "Huhu zusammen, na wie is es, alle ganz begeistert und aus dem Häuschen ? [BR]Schon alle Ressourcen verprasst und ganz neugierig auf nächste Woche ?[BR][BR]Nächste Woche wird es noch mal interessant zu sehen wie die Leute damit umgehen, wenn sie versuchen einen gelevelten Trank zu brauen und eine Diskrepanz von bis zu 50% zu ihrem Max Wert entdecken oder ihr Trank gar nicht triggert.[BR][BR]Mein Feedback ist das selbe wie auf Beta:  Kosten astronomisch > Nutzen ist desaströs[BR]So viel Arbeit und hype für ein bissel warme Luft![BR][BR]Mal ehrlich, wie machen das die Händler um da Nutzen raus zu holen, Ihr levelt mit Münzen und Werkzeug nehme ich mal an und was dann?[BR]Dann wars das. Sicher nicht viel mit Mana, Saat und Unurium, davon hat kaum wer was da, levelt Ihr mit Gütern müsst Ihr 5 Jahre Spielen damit sich ein Trank rechnet, vorausgesetzt er triggert auch [smilie--sprite1] [BR][BR]Naja, vielleicht bin ich zu früh, Ihr werdet es selbst sehen."}, {"2": "Jammin schrieb:\t\t\tMal ehrlich, wie machen das die Händler um da Nutzen raus zu holen, Ihr levelt mit Münzen und Werkzeug nehme ich mal an und was dann?[BR]Dann wars das. Sicher nicht viel mit Mana, Saat und Unurium, davon hat kaum wer was da, levelt Ihr mit Gütern müsst Ihr 5 Jahre Spielen damit sich ein Trank rechnet, vorausgesetzt er triggert auch [smilie--sprite1]Zum Vergrößern anklicken.......wie kommst du da drauf? Man muss ja nicht immer alles verprassen, was man hat - auch als Händler kann man große Reichtümer anhäufen und es gibt ja auch jede Menge Händler, die schon über 5 Jahre auf dem Buckel haben - ist doch generell so - je länger man bereits spielt, desto mehr hat man auch - sonst hat man irgendwann mal was verkehrt gemacht - mir zerfällt z.B. jeden Tag über eine Million Mana (trotz Labyrinth) - das kann ich auch schön jeden Tag in den Kessel stopfen...[BR][BR]....übrigens gibt es eine Warnung im Spiel...[BR][BR][IMG]https://i.ibb.co/ZxK0kGK/https-de-forum-elvenar-com-index-php-attachments-warnung-png-33457.png[/IMG][IMG]https://i.ibb.co/C6wzGph/https-de-forum-elvenar-com-index-php-attachments-warnung2-png-33458.png[/IMG]"}, {"61": "Thebigunknown schrieb:\t\t\tSinngemäß ist das schon irgendwie das Gleiche, oder?[BR][BR]Man kann auch aktiv Dinge falsch verstehen wollen, denke ich. ;-)\t\tZum Vergrößern anklicken....Es können aber auch 4 Leute gleichzeitig aneinander vorbei reden [smilie--sprite1] [smilie--sprite1] [smilie--sprite1][BR][BR]@hobbitrose hat übrigens Recht! Es gibt bei den Gastrassen 2 verschiedene Sorten Güter. Eine Sorte kann man unbegrenzt viel haben, die andere nicht. Und wie bei den andern Gütern darf man wohl einen Elvenar-Fachausdruck für beide Sorten erwarten. Und darauf bezieht sich ihre erste Frage.[BR][BR]Und ich glaube, ich habe irgendwann mal den gleichen Text gelesen wie sie.[BR]hobbitrose schrieb:\t\t\tGibt es in Elvenar nicht einen festen Begriff dafür? \"Begrenzte Ressourcen des Gastvolkes\" oder so ähnlich ist mir in Erinnerung.\t\tZum Vergrößern anklicken....[BR]Aber offiziell gibt es wohl keine 2 Begriffe und wirklich wissen, ob der Kessel-Portal-Zauber nun für alle Güter gilt oder nicht, scheint es auch noch niemand. Also die Frage beantworten, konnte niemand, also wird über die Begriffe diskutiert, obwohl eigentlich gar nicht wichtig ist, wie sie heißen, sondern wie der Zauber wirkt. Hobbitrose wollte gar nicht über Begriffe diskutieren, sie wollte wissen, wie der Zauber funktioniert.[BR][BR]Ich weiß es leider auch nicht [smilie--sprite1]"}, {"113": "ZeNSiErT schrieb:\t\t\tEs können aber auch 4 Leute gleichzeitig aneinander vorbei reden [smilie--sprite1] [smilie--sprite1] [smilie--sprite1][BR][BR]@hobbitrose hat übrigens Recht! Es gibt bei den Gastrassen 2 verschiedene Sorten Güter. Eine Sorte kann man unbegrenzt viel haben, die andere nicht. Und wie bei den andern Gütern darf man wohl einen Elvenar-Fachausdruck für beide Sorten erwarten. Und darauf bezieht sich ihre erste Frage.[BR][BR]Und ich glaube, ich habe irgendwann mal den gleichen Text gelesen wie sie.[BR][BR][BR]Aber offiziell gibt es wohl keine 2 Begriffe und wirklich wissen, ob der Kessel-Portal-Zauber nun für alle Güter gilt oder nicht, scheint es auch noch niemand. Also die Frage beantworten, konnte niemand, also wird über die Begriffe diskutiert, obwohl eigentlich gar nicht wichtig ist, wie sie heißen, sondern wie der Zauber wirkt.[BR][BR]Ich weiß es leider auch nicht [smilie--sprite1]Zum Vergrößern anklicken....[BR]In der Erklärung zum Trank steht was von den \"meisten Siedlungsrohstoffen\".[BR][BR]Und, dass sie produziert sein müssen. Es ist also egal ob begrenzt oder unendlich, Hauptsache kein Zauber oder anderweitiger Bonus.[BR][BR][IMG]https://i.ibb.co/vsQR7Cs/https-de-forum-elvenar-com-index-php-attachments-hexenkessel6-png-33459.png[/IMG][BR][BR][BR]Das ist aber wohl nur eine Teilantwort ..."}, {"32": "der Timer /Zeit bis Ende ist ja mal überaus toll.[BR]sehr gut!"}, {"275": "So  ich oute mich mal als Dummkopf. und für solche ist hier der Frust fest einprogrammiert.[BR]Da hab ich so ein Gut im Überfluss und will dann mal einen Effekt verstärken. Tausend mal klicken ... ...  ok jetzt werden ein,zwei Tausend  Güter für den nächsten Schritt verlangt ... Oups,  plötzlich sind  44 Mio Güter futsch. Keine Warnung zur Halbzeit, keine Warnung bei den letzten 10%.[BR]Und den gleichen Effekt hätte ich mit einer Tagesration Goldmünzen erreichen können![BR]Wie gesagt selbst sehr blöd. Aber das die Spielmacher das so zur Schau stellen müssen, finde ich mega ungeil."}]