[{"2": "...ich würde dich jetzt nicht als Dummkopf bezeichnen, sondern das eher als \"Anfängerfehler\" sehen - es war dir nicht bewußt, nun hast du es herausgefunden - fertig - ich geh davon aus, daß du von den anderen Gütern vergleichbare Mengen hast und den Schaden somit kompensieren kannst...für mich bist du eher ein freiwilliger Tester ^^...[BR]...was mich jetzt interessieren würde, ist: wie weit bist du damit gekommen: also wie viele Hexenpunkte kannst du damit jetzt auf 1x kaufen und wie hoch konntest du einen oder mehrere Effekte aufleveln?...(vermutlich waren es nur wenige Klicks ganz am Schluß, die dich \"dein Vermögen\" gekostet haben)..."}, {"129": "kann mal bitte jemand dieses blöde englisch aus dem hexenkessel entfernen?!!!"}, {"2": "...da ist was schief gelaufen (weltweit) - es wird daran gearbeitet...[BR][BR]...aus dem spanischen Forum...[BR][IMG]https://i.ibb.co/KDjnkSG/https-de-forum-elvenar-com-index-php-attachments-bersetzung-png-33461.png[/IMG]"}, {"1": "Romilly schrieb:\t\t\t...da ist was schief gelaufen (weltweit) - es wird daran gearbeitet...[BR][BR]...aus dem spanischen Forum...[BR]Anhang 33461 ansehenZum Vergrößern anklicken....Oder eben auch aus dem deutschen Forum, aus diesem Thread:[BR]Tacheless schrieb:\t\t\tBezüglich der fehlenden Übersetzungen im Hexenkessel: Da ist irgendwem, irgendwo ein kleines Missgeschick passiert, welches hätte so nicht übersehen werden dürfen. Nun ist es passiert und wir arbeiten daran, das Problem zu beheben. Wir entschuldigen uns für die Unannehmlichkeiten und bitten um ein wenig Geduld. Leider kann ich zum jetzigen Zeitpunkt nicht sagen, wie lange es dauern wird, bis die fehlenden Übersetzungen es dann ins Spiel schaffen.\t\tZum Vergrößern anklicken...."}, {"17": "ZeNSiErT schrieb:\t\t\tEs gibt bei den Gastrassen 2 verschiedene Sorten Güter.\t\tZum Vergrößern anklicken....eigentlich müsste man sogar in 3 unterteilen, denn die letzten Völker hatten Produkte die sich immer nur in Stückzahl 1 herstellen liesen, also nicht vom Portal und/oder Hummel beeindruckt waren."}, {"2": "...hab jetzt mal in Winyandor ein wenig getestet...[BR][BR]...und einen x-beliebigen Trank mit Fragmenten versehen...[BR][IMG]https://i.ibb.co/gthnLBc/https-de-forum-elvenar-com-index-php-attachments-winy-png-33465.png[/IMG][IMG]https://i.ibb.co/kMq6gbP/https-de-forum-elvenar-com-index-php-attachments-winy2-png-33466.png[/IMG]...8 mögliche Effekte..[BR][BR]30.000 Fragmente entsprechen ungefähr dem 1,87fachen des Normal(höchst)wertes...bei 165.000 (dem Max.) hätte man ca. das 3fache...[BR][BR]...das kam dabei heraus...[IMG]https://i.ibb.co/L6WmbwZ/https-de-forum-elvenar-com-index-php-attachments-winy3-png-33467.png[/IMG][IMG]https://i.ibb.co/sKkLp6f/https-de-forum-elvenar-com-index-php-attachments-winy4-png-33468.png[/IMG][IMG]https://i.ibb.co/zZ0Ysq2/https-de-forum-elvenar-com-index-php-attachments-winy5-png-33469.png[/IMG][IMG]https://i.ibb.co/wzxBY8r/https-de-forum-elvenar-com-index-php-attachments-winy6-png-33470.png[/IMG][IMG]https://i.ibb.co/bzJHFKk/https-de-forum-elvenar-com-index-php-attachments-winy7-png-33471.png[/IMG][BR][BR]...bei den Orks wurde aus 18,7 % und 9:19 Stunden, 11,2 % und 8:22 Stunden - Normal(höchst)wert ohne Fragmente: 10 % und 5 Stunden...[BR]...bei Gut2 wurde aus 74,6 % und 9:19 Stunden, 34,1 % und 8:25 Stunden - Normal(höchst)wert ohne Fragmente: 40 % und 5 Stunden...[BR]...bei Gut3 wurde aus 74,6 % und 9:19 Stunden, 31,4 % und 8:35 Stunden - Normal(höchst)wert ohne Fragmente: 40 % und 5 Stunden...[BR][BR]...also hab ich wohl bei den Orks tatsächlich einen kritschen Effekt oder zumindest einen besseren Effekt ausgelöst, da ich hier von den % her über den Normalwerten liege - von der Dauer her hat sich alles durch die Zugabe von Fragmenten gut verbessert...[BR][BR]...meine aktiven Effekte (immerhin 3 von 5 möglichen) werden nun in der Übersicht angezeigt...[BR][IMG]https://i.ibb.co/cxbd4Qz/https-de-forum-elvenar-com-index-php-attachments-winy8-png-33472.png[/IMG][BR][BR]...in Khelonaar (ebenfalls 7 Zutaten) hab ich ohne Fragmente 3 x einen Manufakturen-Effekt getroffen und dabei nur Zeiten zwischen 3:11 und 4:14 Stunden ausgelöst...und 19,5 %, 30,6%, 28,4 % von 40 %...[BR][BR]...jetzt zur Studienphase - anscheinend ist es wirklich so, daß pro Kauf von Hexenpunkten, die Menge der HP pro Kauf um jeweils 1 HP steigt - beim 1. Testlauf hatte ich da wohl zu schnell geklickt oder bin einfach zu sehr abgeschweift - hab es diesmal bis 1300 versucht, genau zu verfolgen, bin aber mehrfach kurz dabei eingenickt ^^...werd das nochmal beobachten, wenn ich bei 5000+ HP pro Kauf bin...[BR][BR]...die benötigte Menge pro Stufe steigt natürlich immer mehr an - am Anfang macht sich das kaum bemerkbar, aber so ab Level 50 fällt es dann schon stark auf...[BR][IMG]https://i.ibb.co/d5bdfXv/https-de-forum-elvenar-com-index-php-attachments-winy10-png-33474.png[/IMG]...[IMG]https://i.ibb.co/9qfcCXw/https-de-forum-elvenar-com-index-php-attachments-winy9-png-33473.png[/IMG][BR][BR]...von 50 auf 51 braucht man 10672 Hexenpunkte zusätzlich (insgesamt über 115.000) von 60 auf 61 sind es 27680 (insgesamt über 300.000)...[BR]...wobei ich bei Level 50 eine Steigerung von 10% Grundwert auf 34,5 % hab und bei Level 60 eine Steigerung von 10 % auf 39,5 %...[BR][BR]...also ja - hinten raus wirds immer teurer - aber das muss halt langsam und gemächlich über die Jahre hinweg gedeihen...[BR][BR]...kucken wir also, was passiert, wenn ich nächste Woche den selben Trank braue und wieder 30.000 Fragmente hinzufüge...[BR][BR]...ach ja - der Ork-Effekt wirkt übrigens auch auf das Orknest...(hab die mögl. Menge der Bilder überschritten - Screenshot folgt bei Gelegenheit)"}, {"276": "Viel kann ich noch nicht sagen, aber mein Eindruck nach den ersten Gehversuchen ist schonmal recht positiv. Meine Handelsstadt konnte schon einiges an zusätzlichen Gütern rausholen [smilie--sprite1][BR][BR]Möchte auch noch ein RIESEN LOB fürs Wiki aussprechen, viel besser kann man den Kessel wohl nicht erklären [smilie--sprite1]"}, {"131": "Romilly schrieb:\t\t\t..jetzt zur Studienphase - anscheinend ist es wirklich so, daß pro Kauf von Hexenpunkten, die Menge der HP pro Kauf um jeweils 1 HP steigt - beim 1. Testlauf hatte ich da wohl zu schnell geklickt oder bin einfach zu sehr abgeschweift - hab es diesmal bis 1300 versucht, genau zu verfolgen, bin aber mehrfach kurz dabei eingenickt ^^...werd das nochmal beobachten, wenn ich bei 5000+ HP pro Kauf bin...\t\tZum Vergrößern anklicken....[BR]Ich glaube, Du solltest das andersrum betrachten und zwar bevor Du bei 5000+ HP bist...[BR][BR]Die HP steigen bei jedem Kauf um 1 HP[BR]Die benötigten Resourcen (Güter, Münzen, Vorräte, etc.) aber nicht[BR][BR]Zu Anfang ( z.B.: bei mir begann es bei einem Wert von 24 Stück Mamor). Dieser Wert erhöhte sich anfangs um 1.[BR]also 1 HP = 24 Mamor, dann 2 HP = 25 Mamor, dann 3 HP = 26 Mamor, etc.[BR][BR]Diser Spenden-Betrag an Mamor erhöhte sich eine ganze Zeit um 1, dann iwann um 2 etc... iwann liegen die Erhöhungen der Spenden bei 100er, 1.000er und 10.000er Schritten... während der HP kontinuirlich um 1 steigt.[BR]Ich hab leider nicht mitgeschrieben um zu sagen, ab welchem Spenden-Wert ein Anstig stattfindet.[BR][BR]Aber ich hatte Glück und gleich eine magische Steuererhöhung bekommen (was fürs laufende GA echt pracktisch war (30,3% mehr für ~21 Stunden)) und wollte diesen Wert dann direkt verbessern.[BR]Bis ich gemerkt hatte, dass die Verbesserung wohl erst bei einem kommenden Trank wirkt, hatte ich es schon ordendlich gepuscht und ordendliche Spenden-Beträge zusammen.[BR]Wie bei Dir, hab auch ich ordendlich Mana und somit dieses mit als erstes genutzt um mehr HP über die Spenden zu erhalten. Mein Mana-Spenden-Wert liegt nun bei über 500k und auch wenn ich alles andere ebenfalls (aber weniger) genutzt habe liegt der HP-Wert aktuell bei ~3,9k[BR][BR]Daher mein Feedback zu diesen Spenden-Summen...[BR]Mittlerweile spreche ich nicht mehr von Spende, den Beträge von 500k und mehr für wenige Hexenpunkte finde ich schon recht heftig und teuer!!![BR]Ich hoffe, es gibt jetzt oder zumindest später noch diverse weitere Möglichkeiten Hexenpunkte zu sammeln / erspielen / gewinnen / erhalten... nicht zwangsläufig nur zu Kaufen mit Tonnen von Gütern / Resourcen oder mit Echtgeld bzw. Dias."}, {"2": "@Mikara - meine große Stadt mit dem größten Reichtum folgt erst heute Abend - da fang ich überall mit dem Grundwert 10 an und da lässt sich das dann schöner überblicken (sofern ich nicht wieder einschlafe ^^....wenn ich Glück habe, löse ich den Werkzeug-Effekt aus (in Verbindung mit 800% Kulturbonus und verzauberten magischen Werkstätten) - dann kann ich im 5-Minuten-Takt Nachschub holen [smilie--sprite2] - in den Nebenwelten hab ich vorerst bei ca. 11.000 Ressourcen pro Kauf aufgehört, weil ich erst wissen will, wie das ist, wenn man ein weiteres Diplom erhalten hat - in Fely bin ich aber ja am Ende der Forschung und da muss ich auch nicht sparen..."}, {"131": "@Romilly: na dann bin ich mal auf Deine Ergebnisse gespannt.[BR][BR]Interressant finde ich allerdings, dass in Deiner Großen Stadt die Grundwerte bei 10 liegen. Bei mir (Ende Kapitel 18) fing alles bei 24 an.[BR]Vielleicht sinken die Spenden-Werte wieder etwas mit wechselndem Kapitel bzw. neuem Zauber-Diplom???[BR][BR]Mal im Auge behalten....[BR][BR]Meld mich wenn ich mehr weiß[BR]oder jemand hats vor mir rausgefunden (die letzten Forschungen werden noch einige Zeit in Anspruch nehmen)"}, {"50": "Die Grundwerte hängen von den abgeschlossenen Forschungen ab.[BR]Ich habe alle Kapitel abgeschlossen, hatte anfangs 24 als Grundwert, habe dann wegen Unurium als Effekt einige Forschungen nachgeholt und jetzt liegt der Grundwert bei 18."}, {"2": "Mikara schrieb:@Romilly: na dann bin ich mal auf Deine Ergebnisse gespannt.[BR][BR]Interressant finde ich allerdings, dass in Deiner Großen Stadt die Grundwerte bei 10 liegen. Bei mir (Ende Kapitel 18) fing alles bei 24 an.[BR]Vielleicht sinken die Spenden-Werte wieder etwas mit wechselndem Kapitel bzw. neuem Zauber-Diplom???\t\tZum Vergrößern anklicken....OMcErnie schrieb:\t\t\tDie Grundwerte hängen von den abgeschlossenen Forschungen ab.[BR]Ich habe alle Kapitel abgeschlossen, hatte anfangs 24 als Grundwert, habe dann wegen Unurium als Effekt einige Forschungen nachgeholt und jetzt liegt der Grundwert bei 18.\t\tZum Vergrößern anklicken........richtig - ich kann das mit den 10 noch nicht bestätigen, hab das aber irgendwo gelesen oder gesehen, daß man mit allen 20 Diplomen bzw. einem kompletten Forschungsbaum bei einem Wert von 10 startet...[BR][BR]@OMcErnie - hast du schon getestet, auf was sich der Unurium-Effekt auswirkt? - ist das nur der Marktplatz oder geht der auch in Kombination mit dem Geistertempel oder dem Siegelturm?[BR][BR]....wieder was gelernt - man muss nicht auf den nächsten Kessel  warten, wenn man ein neues Diplom erworben hat - nur einmal schließen und dann wieder öffnen (bzw. Seite neu laden) und schon sind die Preise gesunken...[BR][BR][IMG]https://i.ibb.co/LNvHnQW/https-de-forum-elvenar-com-index-php-attachments-diplome5-png-33477.png[/IMG][IMG]https://i.ibb.co/TmTJqTH/https-de-forum-elvenar-com-index-php-attachments-kosten2-png-33478.png[/IMG]...und zwar alle...[IMG]https://i.ibb.co/WymKpRd/https-de-forum-elvenar-com-index-php-attachments-kosten3-png-33479.png[/IMG]...(nochmal probiert)..."}, {"155": "Seite 1,9ter Beitrag. [smilie--sprite2]"}, {"4": "Ich überlege mir, ob es denn wirklich sinnvoll ist, jetzt die Forschungen nachzuholen.[BR][BR]Ich hab dann zwar mehr an Möglichkeiten, aber will ich die überhaupt? Ich habe derzeit nur 4 voll abgeschlossene Forschungen und eigentlich reicht mir das: Gold, Werkzeuge, Kaserne und Gut 1. [BR][BR]Ich muss mal sehen, ob dann die Prozentzahlen beim Trank nicht höher sind, weil die sich nicht auf sehr viele Möglichkeiten verzetteln und damit halt mehr an den von mir gewünschten Möglichkeiten bieten."}, {"103": "bei erspielten 5 Kelchen jede Woche wäre das eine vorprogrammierte Verschwendung von einem Kelch"}, {"4": "littleFlex schrieb:\t\t\tbei erspielten 5 Kelchen jede Woche wäre das eine vorprogrammierte Verschwendung von einem Kelch\t\tZum Vergrößern anklicken....Wieso?[BR][BR]Es ist doch nicht so, dass automatisch jede Möglichkeit einen Kelch füllt. [BR][BR]Wenn es so wäre, dass 5 Möglichkeiten 5 Kelche mit 5 verschiedenen Möglichkeiten füllen würden, gäbe ich dir Recht. [BR][BR]Aber so ist es doch Zufall, ob eine Möglichkeit überhaupt nicht oder eventuell 5x in unterschiedlicher Ausprägung auftritt. [BR][BR]Mir ging es darum, dass es so zu sein scheint, dass sich bei mehr Möglichkeiten die Prozentzahlen auf eben mehr Möglichkeiten aufsplittern und von z.B. 1 x 10 % hab ich halt mehr als von 2 x 3 %, 1 x 2 % , 2 x 1%. Das bedeutet, ich werde beobachten, ob es eine Prozentobergrenze gibt, die sich entsprechend den Möglichkeiten dann aufsplittert.[BR][BR]Und letztendlich ist die Frage, ob sich für mich  nicht eine Möglichkeit mit 10 % mehr rechnet und mir mehr nützt, als 2 mit dann vielleicht jeweils 3 %?  Das weiß ich noch nicht und werde es beobachten."}, {"103": "ist mir schon alles klar, aber die theoretische Möglichkeit bestünde,[BR]aus 5 Kelchen auch 5 unterschiedliche Effekte zu erhalten"}, {"2": "...Hexenpunkte kaufen ist halt wesentlich teurer, wenn man nur ganz wenig Diplome hat - mit 4 Diplomen startest du bei 1000, mit 20 Diplomen bei 10 und du kannst über 150 x einkaufen (pro Gut), bis es auf 1000 ist...[BR][BR]...um einen Effekt auf Stufe 80 zu bekommen, brauchst du 1.857.483 Hexenpunkte - der nächste Stern kostet dann alleine 186.000 - das kannst du vermutlich dann irgendwann nicht mehr bezahlen...[BR][BR]...mehrere Effekte von 1 auf Stern 40 zu bekommen, ist noch relativ billig (je ca. 40.000 Hexenpunkte) - aber das steigt eben rasant an...[BR][BR]...hier mal ein paar Bilder aus Felyndral - Startwert: 10[BR][BR]...nach 1.000 Käufen (Hexenpunkte unten steigen um jeweils 1 pro Kauf) hab ich noch sehr niedrige Preise...(500k HP gekauft)[BR][IMG]https://i.ibb.co/zS4zqNb/https-de-forum-elvenar-com-index-php-attachments-18-png-33486.png[/IMG][IMG]https://i.ibb.co/9gdpMnF/https-de-forum-elvenar-com-index-php-attachments-19-png-33487.png[/IMG][BR]...und auch bei 2.000 sieht es noch gut aus...(2 Millionen Hexenpunkte gekauft)[BR][BR][IMG]https://i.ibb.co/44gGNFh/https-de-forum-elvenar-com-index-php-attachments-20-png-33488.png[/IMG][IMG]https://i.ibb.co/BKKngr8/https-de-forum-elvenar-com-index-php-attachments-21-png-33489.png[/IMG][BR]...ab 3.000 Hexenpunkten bemerkt man (als Endgamer) die Käufe schön langsam in der Übersicht - ab 4.000 wirds teuer...[BR][BR][IMG]https://i.ibb.co/SPMq4bD/https-de-forum-elvenar-com-index-php-attachments-22-png-33490.png[/IMG]...[BR]bei weiteren 187 Käufen insgesamt (alle Güter) ist der Preis für Gold und Werkzeug rapide gestiegen (der würde genau so bei den anderen Gütern steigen - also Vorsicht - hier verschwinden im Nu Millionen...)[BR][BR]...ich hab mich jetzt nicht verausgabt...[IMG]https://i.ibb.co/z46PwSg/https-de-forum-elvenar-com-index-php-attachments-17-png-33485.png[/IMG][IMG]https://i.ibb.co/x5wvSXd/https-de-forum-elvenar-com-index-php-attachments-23-png-33491.png[/IMG]...aber irgendwann sollte man es sich überlegen, ob man da jetzt weitermacht oder eher auf das neue Kapitel bzw. Diplom wartet, wo es dann wieder billiger wird....[BR][BR]...erst einmal möchte ich testen, was es ausmacht, wenn ich einen dieser hoch aufgebesserten Effekte auslöse...[BR][IMG]https://i.ibb.co/xqbJxrL/https-de-forum-elvenar-com-index-php-attachments-25-png-33493.png[/IMG][IMG]https://i.ibb.co/9tnrYnC/https-de-forum-elvenar-com-index-php-attachments-26-png-33494.png[/IMG]...[BR][BR]...denn ich hab da gestern (im Nachhinein) noch etwas festgestellt...[BR][BR]...ich war anfangs etwas ernüchtert, daß mein mit 90.000 Fragmenten aufgepimpter Trank nur Gut1, Gut2 und Saat ausgelöst hatte....[BR][BR]...dann kam irgendwann das ABER...(muss nen Doppelpost machen, da ich keine weiteren Bilder hinzufügen kann)..."}, {"2": "...bei der Saat hatte ich einen Kritischen Effekt ausgelöst und das steht auch in der Meldung dabei (zum Vergleich ein anderer Effekt)...[BR][BR][IMG]https://i.ibb.co/gWxJ6t1/https-de-forum-elvenar-com-index-php-attachments-8-png-33497.png[/IMG]...[IMG]https://i.ibb.co/Mn9ts3L/https-de-forum-elvenar-com-index-php-attachments-9-png-33505.png[/IMG]...und hier ist vor allem die Dauer interessant...[BR]...bei der Saat hätten wir laut Rezept nämlich einen Höchstwert von 25 % und 12:30 Std. bei Gut2 100 % und ebenfalls 12:30 Stunden....[BR][IMG]https://i.ibb.co/5GZjdbH/https-de-forum-elvenar-com-index-php-attachments-1-png-33495.png[/IMG]....[IMG]https://i.ibb.co/KyYd507/https-de-forum-elvenar-com-index-php-attachments-2-png-33496.png[/IMG][BR]...ohne Fragmente würden die Höchstwerte bei Saat bei 10 % und 5 Std., bei Gut2 bei 40 % und 5 Std. liegen....(Effekte waren ja erst Stufe 1)...[BR][BR]...ich fass noch einmal das Wichtigste zusammen - unter Zugabe von 90.000 Fragmenten...[BR][BR]...wurde bei der Saat aus 25 % und 12:30 Stunden, 25 % und 18:44 Stunden - Normal(höchst)wert ohne Fragmente: 10 % und 5 Stunden...[BR]...wurde bei Gut2 aus 100 % und 12:30 Stunden, 81,6 % und 8:07 Stunden - Normal(höchst)wert ohne Fragmente: 40 % und 5 Stunden...[BR][BR]...und wenn mein Grundwert künftig bei Stufe 81 auf 50 % und 25 Stunden liegt, bin ich mal gespannt, wie sich dann so ein Kritischer Effekt bemerkbar macht...[BR][BR]....der Saat-Effekt ansich war übrigens ziemlich unbrauchbar für mich, da meine Stadt vom Sammelbonus aus dem Marktplatz lebt, der Effekt hier aber nicht wirkt...[BR][BR][IMG]https://i.ibb.co/Wv396JG/https-de-forum-elvenar-com-index-php-attachments-11-png-33498.png[/IMG]....EDIT: evtl. zählt der Effekt auf die Produktion - hab eine Unstimmigkeit zwischen hochfliegendem und ankommenden Wert festgestellt...[BR][BR]..der zählt aber im Gegensatz zum Manu-Bonus auch auf Setgebäude und auf Gebäude mit Auswahl (Triumph) - beim Waschbär zählt der Effekt nicht auf den Fütterungsbonus...[BR][BR][IMG]https://i.ibb.co/H4F42Sg/https-de-forum-elvenar-com-index-php-attachments-12-png-33499.png[/IMG][IMG]https://i.ibb.co/hmBRNVL/https-de-forum-elvenar-com-index-php-attachments-13-png-33500.png[/IMG][BR][IMG]https://i.ibb.co/vVCdqDb/https-de-forum-elvenar-com-index-php-attachments-15-png-33502.png[/IMG]...die Frage ist jetzt, wie Unurium wirkt, denn hier gibt es kaum Gebäude..."}, {"14": "wenn man jetzt auf neue Diplome wartet, wie du oben schreibst, merkt man denn dann überhaupt, dass es wirklich viel billiger wird?[BR]von 4 Diplomen (1000) auf 20 Diplome (10)[BR][BR]ich glaube, bei 12 Diplomen kostet der erste Punkt 100[BR]wenn der erste Punkt bei 21 Diplomen, angenommen bei 5 startet, heißt das dann, dass die Werte ab dann \"nur\" noch halb so hoch weitergehen?[BR][BR]da die Werte exponentiell ansteigen..merkt man das außer evtl. für 2 Käufe mehr, überhaupt?[BR]ich geb zu, ich kann das nicht berechnen, was sicher einfach möglich wäre"}]