[{"155": "Wenn du ein Diploma abschließt, sollten alle Preise auf 75% sinken."}, {"2": "Romilly schrieb:\t\t\t...wieder was gelernt - man muss nicht auf den nächsten Kessel warten, wenn man ein neues Diplom erworben hat - nur einmal schließen und dann wieder öffnen (bzw. Seite neu laden) und schon sind die Preise gesunken...[BR][BR][IMG]https://i.ibb.co/LNvHnQW/https-de-forum-elvenar-com-index-php-attachments-diplome5-png-33477.png[/IMG][IMG]https://i.ibb.co/TmTJqTH/https-de-forum-elvenar-com-index-php-attachments-kosten2-png-33478.png[/IMG] ...und zwar alle... \t\t\t\t\t\t\t\t\t\t\t\t\t[IMG]https://i.ibb.co/WymKpRd/https-de-forum-elvenar-com-index-php-attachments-kosten3-png-33479.png[/IMG] ...(nochmal probiert)...\t\tZum Vergrößern anklicken....[BR]...ich hatte hier 320 x HP gekauft...in Fely über 4.000 x...ich hab alle Werte von 10 bis 1,01 Millionen notiert - kann das mal in ne Tabelle eingeben...[BR][BR]Spoiler: Kosten Hexenpunkte je Kauf[IMG]https://i.ibb.co/k2DdmQc/https-de-forum-elvenar-com-index-php-attachments-hp-png-33507.png[/IMG][IMG]https://i.ibb.co/bNS4Bnk/https-de-forum-elvenar-com-index-php-attachments-hp2-png-33508.png[/IMG][IMG]https://i.ibb.co/2nV1rrd/https-de-forum-elvenar-com-index-php-attachments-hp3-png-33509.png[/IMG][BR][BR]ab 10.000 sieht man eventuell nicht mehr den tatsächlichen Wert, sondern evtl. nur noch einen gerundeten"}, {"155": "Excel-Tabelle > Startwert eingeben > nächste Zeile vorherige Zeile mal 1,03 > beliebig weit runterziehen > fertig"}, {"2": "Killy schrieb:\t\t\tExcel-Tabelle > Startwert eingeben > nächste Zeile vorherige Zeile mal 1,03 > beliebig weit runterziehen > fertig\t\tZum Vergrößern anklicken.......außer, es wird im Spiel mit gerundeten Werten gearbeitet....kannst ja mal vergleichen...[BR][BR]...jedenfalls hab ich bei diesen Endpreisen...[BR][BR][IMG]https://i.ibb.co/pwRYLPG/https-de-forum-elvenar-com-index-php-attachments-24-png-33510.png[/IMG]...[BR]...bei allen mit 253k ca. 8,844 Millionen, bei 500k ca. 16,653 Millionen und bei 1,01M sogar ca. 33,873 Millionen Ressourcen ausgegeben...[BR]...für ca. 9.000.000 Hexenpunkte, mit denen ich wiederum nicht einmal 5 Effekte von 1 auf 80 bringen könnte...[BR][BR]...und bei weniger Diplomen müsste man das dann mit einem Zehntel seines Startpreises multiplizieren..."}, {"131": "OMcErnie schrieb:\t\t\tDie Grundwerte hängen von den abgeschlossenen Forschungen ab.[BR]Ich habe alle Kapitel abgeschlossen, hatte anfangs 24 als Grundwert, habe dann wegen Unurium als Effekt einige Forschungen nachgeholt und jetzt liegt der Grundwert bei 18.\t\tZum Vergrößern anklicken....Danke"}, {"105": "Wenn ich mla ganz viel Zeit und Langeweile habe, so in ca 10 Jahren vllt...dann tu ich mir den Kessel vllt an. Bis dahin ignorier ich ihn und werde ihn auch NICHT erforschen, egal, wie oft in in der mobilen Form des Games im Forschungsbaum dprt hingeleitet werde.[BR]Der Kessel ist in meinen Augen reine Geldmacherei. [BR]Wie gut, daß er (Noch) kein Zwang ist, obwohl es in dem 75-Tage-Event eine Aufgabe gibt, bei dem man ein Rezept brauen MUß, um die Tagesbelohnung zu erhalten"}, {"128": "Der Hexenkessel macht mich langsam sprachlos.[BR][BR]Ich denke fürchte, dass sich das auch nicht mehr ändern wird. [smilie--sprite6]"}, {"61": "alf2021 schrieb:\t\t\tDer Hexenkessel macht mich langsam sprachlos.\t\tZum Vergrößern anklicken....Dann bitte den Hexenkessel wieder abschaffen, das ist es einfach nicht wert [smilie--sprite1] [smilie--sprite1] [smilie--sprite1]"}, {"6": "Sinnvoll erscheinen mir die Belohnungen dort nicht. Ein paar Prozent mehr (in der Größenordung wie beim Kessel) bringen einfach nichts.[BR]Ich werde den Kessel wohl in Zukunft nur nutzen um die Endlosquestreihe zu bedienen. Gibt dort immerhin inzwischen Fragmente, Kombiauslöser und ein paar Dias. [smilie--sprite1]"}, {"12": "Ich bin ja nur an Truppenverbesserung interessiert, und hab letzte Woche 3 geeignete Zutaten zum Brauen gefunden, die anderen waren mit Diamanten belegt.[BR]Ist es nun Zufall dass diese Woche genau diese 3 Zutaten mit Diamanten belegt sind ???[BR]Wie geht's da anderen?"}, {"133": "Ayla Ayla schrieb:\t\t\tIch bin ja nur an Truppenverbesserung interessiert, und hab letzte Woche 3 geeignete Zutaten zum Brauen gefunden, die anderen waren mit Diamanten belegt.[BR]Ist es nun Zufall dass diese Woche genau diese 3 Zutaten mit Diamanten belegt sind ???[BR]Wie geht's da anderen?\t\tZum Vergrößern anklicken....[BR]ist kein Zufall, es ist Teil des Spiels, jede Woche werden die Dia plätze getauscht. Macht auch Sinn, um ausgewogen zu bleiben."}, {"2": "...zumindest ist die Verteilung in all meinen 7 Welten ganz verschieden...."}, {"14": "ustoni schrieb:\t\t\tSinnvoll erscheinen mir die Belohnungen dort nicht. Ein paar Prozent mehr (in der Größenordung wie beim Kessel) bringen einfach nichts.[BR]Ich werde den Kessel wohl in Zukunft nur nutzen um die Endlosquestreihe zu bedienen. Gibt dort immerhin inzwischen Fragmente, Kombiauslöser und ein paar Dias. [smilie--sprite1]Zum Vergrößern anklicken....komisch, das lief bei mir bis zu den Dias, danach tauchte nie wieder was auf..[BR]wie startet man diese Reihe wieder?"}, {"118": "Hat es eine Anpassung in der App gegeben @Mods? [BR]Gestern war es noch so dass man auf den Reiter Handwerk geklickt hat und im Kessel raus kam. Schrecklich mühsam mehrmals am Tag dann wieder auf die MA zu wechseln. Vor allem da man im Kessel mehrere Tage nichts tut, in der MA dagegen mehrmals täglich. Sehr nervtötend, aber jetzt gings gerade dass man in der MA rauskommt."}, {"133": "zenka schrieb:ist kein Zufall, es ist Teil des Spiels, jede Woche werden die Dia plätze getauscht. Macht auch Sinn, um ausgewogen zu bleiben.\t\tZum Vergrößern anklicken....[BR]die Aussage kein Zufall,[BR][BR]ich dachte an ein vorhersehbares Schema, worauf man sich einstellen könnte,[BR][BR] ist wohl zu früh getroffen.[BR][BR]Ich kann in Wiki nichts über den Dia- Platztausch finden. Wenn es keiner bestimmten Reihenfolge unterliegen würde und es mehrfach willkürlich die gleichen Zutaten treffen würde? wäre natürlich sehr unschön."}, {"13": "@zenka - moin, vermerkt ist das in dieser Textpassage >[BR][IMG]https://i.ibb.co/hRRfMB0/https-de-forum-elvenar-com-index-php-attachments-th-7281919743-jpg-33518.jpg[/IMG]"}, {"103": "Aleanca schrieb:\t\t\tHat es eine Anpassung in der App gegeben @Mods?[BR]Gestern war es noch so dass man auf den Reiter Handwerk geklickt hat und im Kessel raus kam. Schrecklich mühsam mehrmals am Tag dann wieder auf die MA zu wechseln. Vor allem da man im Kessel mehrere Tage nichts tut, in der MA dagegen mehrmals täglich. Sehr nervtötend, aber jetzt gings gerade dass man in der MA rauskommt.\t\tZum Vergrößern anklicken....wäre mir nicht bekannt"}, {"133": "Beau de Bellancourt schrieb:@zenka - moin, vermerkt ist das in dieser Textpassage >[BR]Anhang 33518 ansehenZum Vergrößern anklicken....Danke [smilie--sprite1][BR][BR]jetzt würde meine Frage sein. Wird blockweise getauscht, also immer die gleichen 4 Dia zutaten"}, {"28": "zenka schrieb:\t\t\tjetzt würde meine Frage sein. Wird blockweise getauscht, also immer die gleichen 4 Dia zutaten\t\tZum Vergrößern anklicken....zufällig ;-)"}, {"133": "Thebigunknown schrieb:\t\t\tzufällig ;-)\t\tZum Vergrößern anklicken....[BR]also könnte es schon sein, dass eine bestimmte beliebte Zutat häufiger den Dias zum Opfer fallen würde?"}]