[{"12": "Nächste Woche werde ich sehen, wie \"zufällig\" die Diamantenbelegung ist. Ich hab dann in den 2 Wochen 7 Zutaten verwendet (2 davon je nur 1x).[BR]Wenn nächste Woche die 4 Zutaten, die noch nie diamantenbelegt waren, welche haben, wär's ja ok.[BR]Wenn aber von meinen 5 in den 2 Wochen meistbenutzten Zutaten 4 diamantenbelegt sein werden, sollte ich mir Gedanken über die Definition \"Zufall\" machen.[BR]Wirklich zufällig wär, wenn's von den 5 Zutaten 2 erwischt, das wär auch ok."}, {"2": "...Zufall ist etwas ganz anderes als Wahrscheinlichkeit..."}, {"133": "Romilly schrieb:\t\t\t...Zufall ist etwas ganz anderes als Wahrscheinlichkeit...\t\tZum Vergrößern anklicken....[BR]in einem programmierten Spiel ist die Wahrscheinlichkeit recht hoch, dass es sich um keinen Zufall handelt [smilie--sprite8]"}, {"2": "zenka schrieb:\t\t\tin einem programmierten Spiel ist die Wahrscheinlichkeit recht hoch, dass es sich um keinen Zufall handelt [smilie--sprite8]Zum Vergrößern anklicken.......kommt drauf an von was das Programmierte abhängig ist - ihr sucht oftmals den Zufall auf der verkehrten Seite...aber das ist ein Thema für sich..."}, {"28": "Genau! Ein Zufall ist nur dann gegeben wenn man bekommt was man sich wünscht, oder?[BR][BR]Edit: off topic: Wie hoch ist die Wahrscheinlichkeit, dass von 25 x-beliebigen Personen 2 am gleichen Tag Geburtstag haben?"}, {"155": "Thebigunknown schrieb:\t\t\tEdit: off topic: Wie hoch ist die Wahrscheinlichkeit, dass von 25 x-beliebigen Personen 2 am gleichen Tag Geburtstag haben?\t\tZum Vergrößern anklicken....Glaube das waren so ca. 50%?"}, {"3": "Wahrscheinlichkeitsrechnung war noch nie mein Ding. Deswegen gehe ich den Kessel mit einer gewissen Naivität an.[BR]Letzte Woche hatte ich 3 verschiedene Effekte, heute 4 mal den gleichen für 4 Sunden, den ich auch noch versemmelt habe, weil ich die Abholung der geboosteten Güter verpennt habe und erst wieder im Spiel war, als der Effekt vorbei war  [smilie--sprite8] [BR]Na ja, Pech gehabt, aber es juckt mich nicht besonders. [BR][BR]Der Kessel ist hübsch und macht nicht viel Arbeit. Wenn er ab und zu mal etwas Nutzen bringt ist das doch besser als gar nichts."}, {"147": "Fayence schrieb:\t\t\tWenn er ab und zu mal etwas Nutzen bringt ist das doch besser als gar nichts.\t\tZum Vergrößern anklicken....[BR]Jein.[BR]Wenn er bei wenig Nutzen die Datenlast noch weiter erhöht, ist er des Guten zuviel. Schon jetzt ist auch ohne Kessel für mich mit der App kaum noch ein flüssiges Spiel möglich, sobald ein Event oder ein GA läuft. [BR][BR]Was mich tierisch nervt am Kessel: zumindest in der App kann ich nirgends erkennen, welcher, ob und wie lange noch ein Effekt in welcher Stärke läuft. Ich seh's zwar, wenn es gestartet wurde, aber danach nicht mehr. Wäre aber interessant, um ohne aufwändige schriftliche Protokollierung nachvollziehen zu können, wieviel versprochene 36% von was auch immer sein sollen^^[BR][BR]Bisher kann ich nicht feststellen, dass die ausgelösten Effekte irgendeine Wirkung hätten, die über homöopathische Dosen hinausgehen. [BR][BR]Viel Wind um nichts?"}, {"114": "Feedback.. Kessel [smilie--sprite8] ja, ich habe ihn freigeschaltet.[BR]Allerdings nur um die Quests zu spielen, die sind nett [smilie--sprite1] Auch hab ich es einmal ausprobiert[BR]denn ich kann nicht sagen \"gefällt mir nicht\" wenn ich es nicht versucht hab[BR][BR]positiv[BR]Ein tolles Thema, ich mag Hexen. Passt wunderbar zu Elvenar. Die Zutaten.. ihr habt euch [BR]wirklich was einfallen lassen. [BR]Sehr schön finde ich, das der Kessel kein \"muß\" ist und das Spiel NOCH ohne Kessel spielbar ist[BR][BR]negativ[BR]Beeinflußt vom mitlesen in der Diskussion bin ich da raus. [BR]Der erste Impuls war, einen Stift und ein Blatt Papier zu nehmen um mir die Zutaten aufzuschreiben. [BR]Echt jetzt? Wenn es im Kessel ein Rezeptbuch gegeben hätte wo man, nach dem brauen? seine erfolgreichen und/[BR]oder favorisierten Rezepte speichern und nachlesen könnte, wäre es eine Option gewesen um es noch einmal zu probieren[BR]Ich kann nur ahnen welche Fehler ich gemacht habe beim einmaligen ausprobieren. [BR]Kompliziert wenn man nicht jede noch so kleine Erklärung mitließt[BR][BR]Akzeptiert aber ohne Interesse es zu nutzen"}, {"2": "monakuki schrieb:\t\t\tViel Wind um nichts?\t\tZum Vergrößern anklicken.......nein - deine Segel sind vermutlich nur noch viel zu klein..."}, {"17": "tja Fazit, man könnte sich auf einen Effekt beschränken, nur die Zutaten reinwerfen und sich dann beschweren das der Effekt 4 mal ausgelöst wird weil er über 50% hat und die anderen nur 5% oder man wirft alle kostenlosen Zutaten gleichmäßig rein freut sich über mehrere Effekte ob sie nun nützen oder nicht.[BR]In der Summe Effekt zu kurz, wahrscheinlich des Auslösen zu gering. Also nur ein Gimmik."}, {"2": "stone2345 schrieb:\t\t\tIn der Summe Effekt zu kurz, wahrscheinlich des Auslösen zu gering. Also nur ein Gimmik.\t\tZum Vergrößern anklicken.......nicht, wenn du auch mal gelegentlich was investierst...[BR][IMG]https://i.ibb.co/0CSx8YV/https-de-forum-elvenar-com-index-php-attachments-investition-png-33551.png[/IMG]...sollte ich hier am Dienstag mit einem Kritischen treffen,[BR][BR]...kann ich mit den 60,4 % bzw. 150,9 % rechnen und das über eine Laufzeit von über 30:11 Std. bzw. 75:28 Std. - das ist dann nicht mehr \"homöopathisch\"...(und bitte diesen Begriff nicht verwenden, wenn man keine Ahnung hat, wie Homöopathie funktioniert)...[BR][BR]...zum Vergleich: aufgelevelte Grundwerte (Stern 75 + 80) ohne Fragmentzugabe... [IMG]https://i.ibb.co/SDTRpHy/https-de-forum-elvenar-com-index-php-attachments-investition2-png-33552.png[/IMG]...."}, {"17": "Romilly schrieb:\t\t\t...nicht, wenn du auch mal gelegentlich was investierst...[BR]Anhang 33551 ansehen...sollte ich hier am Dienstag mit einem Kritischen treffen,[BR][BR]...kann ich mit den 60,4 % bzw. 150,9 % rechnen und das über eine Laufzeit von über 30:11 Std. bzw. 75:28 Std. - das ist dann nicht mehr homöopathisch...\t\tZum Vergrößern anklicken....naja der einsatz von 500 Dia ist ja wohl auch gerechtfertig, sorry das grad vor lachen keinen klaren Gedanken fassen kann, um das zu kontern."}, {"2": "stone2345 schrieb:\t\t\tnaja der einsatz von 500 Dia ist ja wohl auch gerechtfertig, sorry das grad vor lachen keinen klaren Gedanken fassen kann, um das zu kontern.\t\tZum Vergrößern anklicken.......ich hab in der letzten Woche 4.105 verdient - juckt mich nicht, wenn ich dadurch 133.000 Fragmente sparen kann..."}, {"14": "also, die Zugabe von 32.000 Zauberspruchfragmenten beim Brauen erhöht die Stärke sowie die Laufzeit der Boosts 3-fach?[BR][BR]aber woher hat man 32.000 Fragmente? ich kratze schon immer die 10.000 irgendwo zusammen, wenn ich mal eine Grundplatte haben will[BR]liegt das jetzt an den Biblios oder baue ich zu viel in der Aka?[BR][BR]dieser Mangel an Fragmenten bei mir ist mir schon länger aufgefallen[BR]zumindest hab ich jetzt ja mal etwas zu zerlegen, aber vormals stand die Aka ab Samstag bis zum neuen Turm still[BR]muss ich mehr Handelstationen gewinnen?[BR]die hatte ich früher öfters, aber da brachten die noch keine Portalos[BR]und jetzt habe ich nur eine einzige... [smilie--sprite11]"}, {"2": "Neris schrieb:\t\t\talso, die Zugabe von 32.000 Zauberspruchfragmenten beim Brauen erhöht die Stärke sowie die Laufzeit der Boosts 3-fach?\t\tZum Vergrößern anklicken........nein - die Zugabe von 165.000 Fragmenten oder alternativ 32.000 + 425 Diamanten...und du musst einen kritischen Effekt auslösen...(Chance 50 %)[BR][BR]...das ist etwas, wenn man schon lange im Spiel ist - das muss sich alles erst entwickeln - aber du siehst hier, zu was das mal führen kann, wenn du am Ball bleibst (nebenbei: ich hab nun mal mein Inventar geplündert und dabei 124.000 Fragmente erstellt - unnütze Artefakte geben je 2.000, wenn die Aka auf 5 ist)..."}, {"14": "wenn ich deine beiden Bildchen vergleiche:[BR]aufgelevelte Grundwerte ohne Fragmentzugabe (kleines Bildchen) mit den gewünschten auszulösenenden Effekten (großes Bild), dann sind mit 32.000 Fragmenten + 500 Dias die Zeiten UND die Effekte annähernd 3x so hoch[BR][BR]DAS ist dann der kritische Effekt, den man zu 50% auslöst?[BR]oder ist der dann noch höher?[BR](in anderen Spielen ist der dann noch höher als die vorher angezeigten Werte, wenn es \"krittet\")[BR][BR]...die anderen Werte sind übrigens um 300%: was man dann tatsächlich im Vergleich zum Reliktbonus auch merken würde, also würden Produktionsboosts durchaus nicht nur marginal sein (die sind nicht gelevelt, oder?)[BR]aber die Kosten von 32.000 Fragmenten + 500 Dias sind auch nicht ohne..bzw. 165.000 Fragmente  [smilie--sprite12]"}, {"2": "Neris schrieb:\t\t\tDAS ist dann der kritische Effekt, den man zu 50% auslöst?\t\tZum Vergrößern anklicken.......nein - das ist nur der Bonus auf den normalen Höchstwert - wenn du einen kritischen triffst, kannst du aber mit dem Höchstwert oder sogar noch mehr rechnen - ich hatte aber bisher nur 1 kritischen - da kann man jetzt noch relativ wenig dazu sagen...[BR][BR]hier nochmal die Tabelle mit der Auswirkung der Fragmente auf den Grundwert 10 (Stufe 1-Effekt) Spoiler: Wirkung Fragmente[IMG]https://i.ibb.co/b15BNn6/https-de-forum-elvenar-com-index-php-attachments-fragmente3-png-33315.png[/IMG][BR][BR]und so werden aus [IMG]https://i.ibb.co/KzDwsDd/https-de-forum-elvenar-com-index-php-attachments-trank7-png-33350.png[/IMG]..mit Fragmenten...[IMG]https://i.ibb.co/KyYd507/https-de-forum-elvenar-com-index-php-attachments-2-png-33496.png[/IMG]..bzw..[IMG]https://i.ibb.co/gWxJ6t1/https-de-forum-elvenar-com-index-php-attachments-8-png-33497.png[/IMG]"}, {"14": "ja, also so, wie ich das kenne..[BR]den kritischen Wert kennt man vorher nicht, der ist normal auch \"von bis\": also nur wenig Erhöhung bis \"so richtig viel\"..[BR]mal sehen, was hier dann für Ergebnisse rauskommen[BR][BR]aber so als Quintessenz für mich:[BR]auch wenn jetzt noch wenige Effekte überhaupt gelevelt wurden, aber die meisten haben doch schon so 50-60 Sterne auf ihre Lieblingswünsche (auch die nicht so hohen Level)[BR]so richtig was bewirkt man letztlich nur durch Zugabe von Fragmenten..[BR]und von denen kann man sich einen Teil sparen durch Dias[BR][BR]aber für mich ist das unerreichbar, außer ich gebe wirklich viele Dias aus!![BR][BR]komisch, dass in deiner Tabelle jetzt durch 9000 Fragmente der 3-fache Wert bei der Höhe rauskommt[BR]und erst bei 156.000 die 3-fache Zeit[BR][BR]also das hier meine ich:[BR](mit 165.000 Fragmenten oder 32.000Fr+500Dias)[BR][IMG]https://i.ibb.co/L8JtbnX/https-de-forum-elvenar-com-index-php-attachments-screenshot-322-png-33558.png[/IMG][BR][BR]zu (ohne alles):[BR][BR][IMG]https://i.ibb.co/SDTRpHy/https-de-forum-elvenar-com-index-php-attachments-investition2-png-33552.png[/IMG][BR][BR]oben sind die Werte (Zeit und %) 3-fach höher[BR]in der Tabelle ist es aber anders"}, {"2": "Neris schrieb:\t\t\tso richtig was bewirkt man letztlich nur durch Zugabe von Fragmenten..[BR]und von denen kann man sich einen Teil sparen durch Dias\t\tZum Vergrößern anklicken.......richtig - Fragmente/Diamanten sind die Geheimzutat...[BR][BR]Neris schrieb:\t\t\tkomisch, dass in deiner Tabelle jetzt durch 9000 Fragmente der 3-fache Wert bei der Höhe rauskommt[BR]und erst bei 156.000 die 3-fache Zeit\t\tZum Vergrößern anklicken.......woher nimmst du diese Werte? ...in der Tabelle steht nix von der Zeit - das 1. sind die Fragmente, das 2. die %-Chance auf einen Kritischen und das jeweils 3. die Wirkung auf den Grundwert 10 (also sowohl % als auch Zeit) - wenn du einen Grundwert von 40 % hast, musst du das nochmal x4 nehmen und bei den Stunden ebenso - hast du 5 Stunden als Grundwert nimmst x 0,5 (5 ist die Hälfte von 10 bzw. bei 25 aus der Tabelle x 0,5 bist du bei 12:30 anstelle von 5 Stunden)...."}]