[{"14": "achso, dann habe ich die Tabelle komplett falsch interpretiert[BR]das erste waren für mich Fragmente, das zweite die %-Erhöhung des Effektes und das dritte die Zeit, die der Effekt dauert[BR]also ist es komplett anders[BR]Chance auf kritischen und das mit dem Grundwert muss ich erst noch verdauen, wie das gemeint ist...[BR]aber..wie gesagt, das ist was, was ich nicht (noch nicht?) spielen kann..[BR][BR]da brauche ich tatsächlich erst einen Fragment-Kakadu  [smilie--sprite8]"}, {"2": "Neris schrieb:\t\t\tachso, dann habe ich die Tabelle komplett falsch interpretiert[BR]das erste waren für mich Fragmente, das zweite die %-Erhöhung des Effektes und das dritte die Zeit, die der Effekt dauert[BR]also ist es komplett anders[BR]Chance auf kritischen und das mit dem Grundwert muss ich erst noch verdauen, wie das gemeint ist...[BR]aber..wie gesagt, das ist was, was ich nicht (noch nicht?) spielen kann..[BR][BR]da brauche ich tatsächlich erst einen Fragment-Kakadu  [smilie--sprite8]Zum Vergrößern anklicken.......zum Aufhübschen der Tabellen bin ich noch nicht gekommen - das steckt momentan alles im gleichen Dokument...[BR][BR]...einfach mal selbst testen und die Werte wieder finden - dann kommt auch das Verständnis dazu...."}, {"155": "@Neris Spieler mit mehreren Biblios haben ein paar Fragmente über für den Spaß. Für alle anderen dürfte das Feature nicht interessant sein, da findet sich ein besserer Gegenwert für die Fragmente."}, {"14": "ja...ich hab immer gedacht, man würde es an den Kombis merken, aber da habe ich immer genug..[BR]Fragmente sind immer knapp bei mir, aber leider darf ich ja nur eine Biblio[BR][BR]das ist schon doof geregelt, bringt Inno jetzt noch was für Fragmente ins Spiel, haben die Multi-Bibse ja noch mehr Fragmente und werden immer viel mehr aus dem Kessel holen als ich je hinbekomme..[BR][BR]ich fühle mich schon wieder benachteiligt...und dann kommen solche Sachen wie Kirit und Karak nur für 79 Euro..[BR]pfft[BR]ich sollte besser in den Dampf wechseln [smilie--sprite2]"}, {"81": "Romilly schrieb:\t\t\t...ich hab in der letzten Woche 4.105 verdient - juckt mich nicht, wenn ich dadurch 133.000 Fragmente sparen kann...\t\tZum Vergrößern anklicken....[BR]Und wieder mal der Hero der Nation meiner Meinung nach und eine Meinung darf ich haben.[BR]Diese selbst Inszenierung hat nichts mit Feedback zu tun nur als Erinnerung den hier geht es um Feedback udn nicht wieviel Resourcen man durch ineffizientes spielen erlangen kann.[BR][BR]Quantität vor Qualität sagt leider nichts über Möglichkeiten aus[BR][BR]Die Buffs sind nett mehr aber auch nicht man muss halt viel investieren aber der Benefit rechnet sich einfach noch nicht.[BR]Das kann aber nach der nächsten oder übernächsten Überarbeitung des Features kommen und die wird kommen den das Ding ist aktuell unausgereift hat sehr unangenehme Bug's und ist nicht mal fertig übersetzt was manchen Spieler der des English nicht mächtig ist doch beunruhigen kann.[BR][BR]Rezeptlisten gibt schon länger und die sind sogar vom Beta noch gleich geblieben....... rentiert sich aber noch nicht so wirklich Zeit, Energie und Ressourcen rein zu stecken.[BR][BR]Fazit: Nettes Gimmick mehr aber leider noch nicht"}, {"6": "Kann natürlich jeder(jede machen wie er/sie will.[BR][BR]Ich werde allerdings weder Dias noch Fragmente jemals im Kessel einsetzen.[BR]Fragmente liefern im Handwerk deutlich bessere Artikel und ich denke über Dias brauchen wir hier gar nicht erst zu reden.[BR][BR]Was anderes wäre es natürlich, wenn man im Kessel wirklich sinnvolle Effekte erzeugen könnte - werde ich aber nicht erleben."}, {"2": "Sardukar schrieb:\t\t\tUnd wieder mal der Hero der Nation.[BR]Diese selbst Inszenierung hat nichts mit Feedback zu tun nur als Erinnerung.\t\tZum Vergrößern anklicken.......unterlass das mal bitte oder stell dich einfach selbst zu Tests zur Verfügung...außerdem ist es meine Angelegenheit, wie ich mein Leben gestalte...[BR][BR]Sardukar schrieb:\t\t\tund ist nicht mal fertig übersetzt\t\tZum Vergrößern anklicken.......es wurde fertig übersetzt - nur wurden die Übersetzungen nicht überall markiert bzw. die Übernahme aktiviert - mach dich erst mal kundig, bevor du Behauptungen in den Raum stellst..."}, {"155": "Ich bekomme die Kesseleffekte meiner Wahl recht fix auf Stufe 60 oder so (in den letzten Kapiteln geht bestimmt mehr, da man ein viel größeres Volumen bei Münzen, Werkzeugen etc.) hat. Soviel besser werden die Effekte dann bis Level 100 auch nicht mehr, also ich denke der Kessel lässt sich in absehbarer Zeit schon vernünftig nutzen, wenn man nicht gerade noch in den ersten Kapiteln ist."}, {"2": "Killy schrieb:\t\t\tIch bekomme die Kesseleffekte meiner Wahl recht fix auf Stufe 60 oder so (in den letzten Kapiteln geht bestimmt mehr, da man ein viel größeres Volumen bei Münzen, Werkzeugen etc.) hat. Soviel besser werden die Effekte dann bis Level 100 auch nicht mehr, also ich denke der Kessel lässt sich in absehbarer Zeit schon vernünftig nutzen, wenn man nicht gerade noch in den ersten Kapiteln ist.\t\tZum Vergrößern anklicken.......und danach wird es schnell empfindlich teuer...hier muss man auch entscheiden, ob man einen Effekt sehr hoch steigern will (vom Level her, nicht von der Auswirkung) oder dann doch lieber mehrere auf einen etwas niedrigeren Level...[BR][BR]Spoiler: Aufwertungen[IMG]https://i.ibb.co/hfjmQPR/https-de-forum-elvenar-com-index-php-attachments-aufwertungen-png-33562.png[/IMG]...leider noch nicht vollständig - weitere Ingamewerte nehm ich gerne auf......huch - da ist ein Fehler drin - moment - korrigiert - da hat ne 0 gefehlt"}, {"17": "Romilly schrieb:\t\t\t..kann ich mit den 60,4 % bzw. 150,9 % rechnen und das über eine Laufzeit von über 30:11 Std. bzw. 75:28 Std. - das ist dann nicht mehr \"homöopathisch\"...(und bitte diesen Begriff nicht verwenden, wenn man keine Ahnung hat, wie Homöopathie funktioniert)...\t\tZum Vergrößern anklicken....Doch ist es, für die kosten die du rein steckst bekommste locker das doppelte an Zeitbooster in der Aka gebaut, und auch für 500 dias kannste so oft drehen das man durch einfaches beschleunigen viel mehr rum kommt als du jemals durch diesen Booster erwirtschaften kannst.[BR][BR]Sorry aber mit deiner Spielweise darauf zu schliessen das dies ein sinnvolles und nützliches Feature ist, bleibt allein deiner Spielweise vorbehalten sollte niemals eine Allgemeingültigkeit darstellen.[BR]Also unterlasse es bitte andere belehren zu wollen was effektiv ist.[BR]da du auch nur 50% krit Chance erhalten kannst, könntest du auch einfach mehr Dias rein stecken und noch mehr Fragmente sparen, nur so als Tip da dir die Fragmente wichtiger sind als Dias."}, {"103": "Hört doch mal mit Euren persönlichen Angriffen auf ![BR]Ihr könnt verschiedene Erfahrungen auch teilen oder gegeneinander abwägen,[BR]ohne ausfallend zu werden..."}, {"2": "stone2345 schrieb:\t\t\tDoch ist es, für die kosten die du rein steckst bekommste locker das doppelte an Zeitbooster in der Aka gebaut, und auch für 500 dias kannste so oft drehen das man durch einfaches beschleunigen viel mehr rum kommt als du jemals durch diesen Booster erwirtschaften kannst.\t\tZum Vergrößern anklicken.......falsch - denn ich nehme bereits alle Zeitbooster mit, die ich in der Aka bekommen kann (und natürlich auch viel anderes Zeug) und Dias zum Drehen brauch ich auch nicht - dafür hätte ich doch 118 x den Schluck der Klarheit - es geht mir auch gar nicht um den Profit aus dem Kessel, sondern um die Möglichkeiten, die sich mir daraus in allen Bereichen eröffnen und hierfür sammle ich Erfahrungen, die ich dann in meinen weiteren Spielverlauf einfließen lassen kann...und ich bin sogar so nett und teile hier meine Erfahrungen und Erkenntnisse...[BR][BR]stone2345 schrieb:\t\t\tda du auch nur 50% krit Chance erhalten kannst, könntest du auch einfach mehr Dias rein stecken und noch mehr Fragmente sparen, nur so als Tip da dir die Fragmente wichtiger sind als Dias\t\tZum Vergrößern anklicken.......ob du es glaubst oder nicht - in diesem Falle sind mir die Fragmente wichtiger als die paar Diamanten - aber das muss jeder selbst entscheiden..."}, {"147": "Ja, also .. [BR][BR]wo wie beim Kessel der Placebo Effekt gänzlich wegfällt, ist die Wirkung eben so \"homöopathisch\" wie die nicht mehr vorhandenen Wirksubstanz Atome in der Potenzierung^^"}, {"91": "Mal zum Wogen glätten:[BR]Der Vollständigkeit halber sind Romillys Zahlen sicher informativ, um sich ein Bild von Input/Output zu machen. [BR]In der Bewertung käme ich auch zu dem Schluss, dass ich für 500 Dias (10x Drehen) und 32k Fragmente aus der MA definitiv mehr Output bekomme als vom Kesseltrank.[BR][BR]Fazit daher auch meinerseits: Potenzial erkennbar, aber aktuell noch nicht so der Brüller."}, {"277": "ich hab heute mal im hexenkessel was angeworfe.. glaub ich versteh das ganze nit wirklich. ging mir aber auch auf dem beta schon so[BR]hier mal ein screen was ich gemacht habe[BR][BR][IMG]https://i.ibb.co/7k2V59y/https-de-forum-elvenar-com-index-php-attachments-1673942616970-png-33564.png[/IMG][BR]allerdings seh ich nix bei der holzprodi das die mehr machen würde. geht die erst sammeln und wo seh ich wie lang es dauert? [BR]lieben Dank schonmal für ne Erklärung die auch ältere Menschen verstehn^^"}, {"276": "@daktylo alles was du im Studium upgradest macht sich erst in der nächsten Woche bemerkbar und natürlich nur dann wenn du im Kessel den enstprechenden Effekt \"trinkst\"."}, {"277": "hab noch was gefunden[BR][BR][IMG]https://i.ibb.co/wgj8bby/https-de-forum-elvenar-com-index-php-attachments-1673943602572-png-33565.png[/IMG][BR]bedeutet da? die Laufzeit ?  ich seh nix bei dein Holzfällern. Allerdings is da schon fabelhafte produktion drauf. Die Ausbeute is aber noch die von heute morgen."}, {"277": "danke, aber dann hilfts ja nit mehr beim ga^^[BR][BR]und wo kann ich nachlesen das ich das eine woche vorher aktivieren muß ? Wie trinke ich das ? muß ich nur was anklicken oder wie was investieren ?"}, {"2": "@daktylo - wie @Lightbringer schon gesagt hat, du musst erst einmal einen Trank brauen und den Effekt aktivieren...das geht nur 1x pro Woche...[BR][BR][IMG]https://i.ibb.co/m4qDwC9/https-de-forum-elvenar-com-index-php-attachments-7-png-33566.png[/IMG]...und dann kannst du in der Übersicht sehen, welche Effekte aktiv sind...[IMG]https://i.ibb.co/rGNvnRZ/https-de-forum-elvenar-com-index-php-attachments-10-png-33567.png[/IMG]...bzw. dann siehst du es auch in deinen Gebäuden...[IMG]https://i.ibb.co/GJ2Frkw/https-de-forum-elvenar-com-index-php-attachments-s6-png-33289.png[/IMG]...als \"Bonus für Zaubertrank-Effekte\" (hatte zuerst das falsche Bild)[BR][BR]...lies doch mal hier die Ankündigung oder das Wiki - da wird alles beschrieben... https://de.wiki.elvenar.com/index.php?title=Der_Hexenkessel"}, {"6": "Also statt 4059 Marmor in 3h sagenhafte 4172 Marmor! Wahnsinn! Was machst du nur mit dem ganzen Marmor?"}]