[{"2": "ustoni schrieb:\t\t\tAlso statt 4059 Marmor in 3h sagenhafte 4172 Marmor! Wahnsinn! Was machst du nur mit dem ganzen Marmor?\t\tZum Vergrößern anklicken....1. sind das gemixte Bilder, 2. war das Stufe 1, 3. ist ja bekannt, daß es sich nur auf die Grundproduktion auswirkt - deshalb startet bei den Manus der Wert ja bei 40 % und geht dann relativ weit rauf und 4. wirkt immerhin die Fabelhafte Fabrikation auch auf den Trankeffekt - dieser Zusatz wird dann aber dem Zauberbonus zugerechnet (gehört ja auch da hin) - das Bild oben stammt aus Sinya, wo ich noch weit von einem Handelszentrum entfernt bin - in Kombination mit eben diesem Wunder + vielleicht noch einem Sturmphönix + Zeitsegen lässt sich da für z.B. erleuchtete Güter bestimmt auch was rausholen - insgesamt interessieren mich die Manu-Effekte in Felyndral aber recht wenig, da ich ja kaum Manus hab und der Effekt, soweit ich festgestellt habe, nur auf Manus wirkt..."}, {"2": "...STRIKE...[BR][BR][IMG]https://i.ibb.co/0VmJhG3/https-de-forum-elvenar-com-index-php-attachments-k1-png-33580.png[/IMG][IMG]https://i.ibb.co/Bc2MrjM/https-de-forum-elvenar-com-index-php-attachments-k2-png-33581.png[/IMG][IMG]https://i.ibb.co/rbNsgYs/https-de-forum-elvenar-com-index-php-attachments-k3-png-33582.png[/IMG][BR][BR][IMG]https://i.ibb.co/X74x0My/https-de-forum-elvenar-com-index-php-attachments-k4-png-33583.png[/IMG][IMG]https://i.ibb.co/JvztXMr/https-de-forum-elvenar-com-index-php-attachments-k5-png-33584.png[/IMG]..[IMG]https://i.ibb.co/sKDvVHs/https-de-forum-elvenar-com-index-php-attachments-k9-png-33588.png[/IMG][BR][IMG]https://i.ibb.co/NsBMCtZ/https-de-forum-elvenar-com-index-php-attachments-k6-png-33585.png[/IMG][IMG]https://i.ibb.co/tmgqfpt/https-de-forum-elvenar-com-index-php-attachments-k7-png-33586.png[/IMG][IMG]https://i.ibb.co/M1t0n5W/https-de-forum-elvenar-com-index-php-attachments-k8-png-33587.png[/IMG][BR][BR]....3 Kritische und der Werkzeugeffekt hält über 4 Tage...bzw. 113 Stunden anstelle von 75 bzw. 24:45 Normalwert...[BR][BR]...das 2,5-Millionen-Brot...[IMG]https://i.ibb.co/qMMxLwM/https-de-forum-elvenar-com-index-php-attachments-k10-png-33589.png[/IMG]...Kulturbonus liegt momentan bei 742 %..."}, {"28": "Romilly schrieb:\t\t\t...STRIKE...\t\tZum Vergrößern anklicken....Wenn der Effekt zum Mutant wird! ;-)"}, {"112": "glückwunsch. ich hatte 5 kelche. 5x keinen effekt."}, {"28": "@Pukka: Ganz genau, einfach mal anderen etwas gönnen können. Ich begrüße das! ;-)"}, {"2": "...haha - und gerade eben hab ich im Turm ne magische Werkstatt gewonnen - gut, daß das GA bei uns mehr oder weniger schon vorbei ist  [smilie--sprite2]"}, {"28": "Romilly schrieb:\t\t\t...haha - und gerade eben hab ich im Turm ne magische Werkstatt gewonnen - gut, daß das GA bei uns mehr oder weniger schon vorbei ist  [smilie--sprite2]Zum Vergrößern anklicken....Glückwunsch dazu! ;-)"}, {"14": "die 3 Ui..ui..ui! sind wohl 3 kritische Auslöser:[BR]die Schrift für die Höhe und die Länge des Boosts ist grün[BR]allerdings wurde Mana in der Höhe so schon als max vorgegeben, allerdings nicht die Länge: die ist ca. 50% höher[BR]der Militärboost ist weniger als 10% mehr, die Zeit allerdings ungefähr 60% länger[BR]der Werkzeugeffekt kann ich nicht ganz erkennen: die Höhe ist die maximale[BR]die Zeit von 75,5 h auf 4 Tage? also so ungefähr 1/3 länger?[BR]allerdings löst man normal ja auch selten max. aus (bislang waren die Effekte immer niedriger als möglich))[BR][BR]der kritische Effekt scheint am meisten auf die Zeit zu wirken, aber könnte auch Zufall sein, da wir nur 3 betrachten[BR]bei 5 Kelchen hat er allerdings 3 x ausgelöst (Wahrscheinlichkeit war 50%)[BR][BR]ja, sieht echt toll aus, nur werde ich das niemals spielen können...[BR]ich habe gerade 13k Fragmente und möchte bis zum nächsten Turm auch noch ein bisschen basteln[BR]danke für das Teilen!"}, {"2": "Neris schrieb:\t\t\tder Militärboost ist weniger als 10% mehr, die Zeit allerdings ungefähr 60% länger\t\tZum Vergrößern anklicken.......neee - die Werte sind immer gleich hoch (wie der mit Fragmenten aufgebesserte Höchstwert) - die Dauer ist irgendwie unterschiedlich - aber viel länger als der Höchstwert..[BR][BR]...ich werde das auf alle Fälle noch ein paar mal testen [smilie--sprite2]...im Moment wart ich drauf, daß der Kulturbonus noch steigt - möcht ein 3-Mio-Brot haben...[BR][BR]Neris schrieb:\t\t\tja, sieht echt toll aus, nur werde ich das niemals spielen können...\t\tZum Vergrößern anklicken.......warum denn nicht?...klar schaffst du sowas auch mal...[BR][BR]...der Manueffekt ist übrigens gar nicht so schlecht...[BR][BR][IMG]https://i.ibb.co/THHZpx5/https-de-forum-elvenar-com-index-php-attachments-manueffekt-png-33591.png[/IMG]...sind 5595 + weitere 4965 durch die fabelhafte Fabrikation = 10.560 - mit dem Sturmphönix würden da jetzt nochmal 2800 hinzu kommen - das nehm ich gerne mit, wenn ich mal wieder Erleuchtete in hohen Mengen brauche..."}, {"4": "Ich würde es sehr begrüßen, wenn eine Möglichkeit geschaffen würde, die aktiven Boni direkt zu sehen (z.B. wie jetzt im HUD mit den grünen Kombis), ohne dafür in die Aka und dann noch in den entsprechenden Reiter springen zu müssen.[BR][BR]Finde ich sehr umständlich, vor allem kann ich mir nicht merken, was gerade wie hoch und wie lange aktiv ist."}, {"14": "stimmt, der Militärboost war in einem anderen Fenster, hab ich verwechselt in den Bildchen..[BR]also ist ein kritischer Effekt wohl immer die maximale Boostanzeige mit einer deutlich verlängerten Zeit[BR][BR]und ja, die aktiven Booster nur zu sehen, wenn man in die Aka und dann nochmal zum Kessel klickt ist umständlich![BR]würde das jetzt auch gerne anders sehen[BR][BR]was meinst du im HUD mit grünen Kombis?[BR]die Anzeige Produktion der Aka beim Moueseover?"}, {"2": "Neris schrieb:\t\t\talso ist ein kritischer Effekt wohl immer die maximale Boostanzeige mit einer deutlich verlängerten zeit\t\tZum Vergrößern anklicken.......vermutlich..."}, {"4": "Neris schrieb:\t\t\twas meinst du im HUD mit grünen Kombis?[BR]die Anzeige Produktion der Aka beim Moueseover?\t\tZum Vergrößern anklicken....HUD = Head up display[BR][BR]also die Anzeige der grünen Kombis ganz oben in der Leiste. 2. Button rechts von der Bücherleiste."}, {"14": "ja, was ein HUD ist, weiß ich, [BR]im Prinzip ist es alles an Info, was man auf dem Bildschirm sehen kann ohne irgendwo zu klicken und man bei Geradeausblick sofort im Blick hat[BR]Kombis kann ich nicht direkt ablesen, nur in der \"Bücherleiste\" die gerade vorhandenen WPs (als Beispiel)[BR][BR]Kombis kann ich ganz oben in der Leiste beim Mouseover unter Handwerksressourcen finden[BR]also so zum direkten Ablesen wie in anderen UI von anderen Spielen ist hier nicht viel, aber Mouseover fände ich auch noch o.k. für die Booster[BR]so wie es jetzt ist, ist es jedenfalls extrem umständlich"}, {"268": "Regulärer Händlerappell - 99,6% auf die NORMALE Produktion,[BR]OHNE Reliktbonus?[BR]Das ist wohl ein schlechter Scherz!  [smilie--sprite4][BR]Von mir aus kann die Hexe zuhause bleiben!"}, {"2": "...nette Ausbeute (leider nicht mehr für heute)...[BR][BR][IMG]https://i.ibb.co/74NGxH1/https-de-forum-elvenar-com-index-php-attachments-kultur907-png-33600.png[/IMG]....[IMG]https://i.ibb.co/5FczbHP/https-de-forum-elvenar-com-index-php-attachments-kultur907a-png-33601.png[/IMG]...der Trankeffekt schlägt mit 377.363 + 1.056.616 (VV 280 %) zu buche..."}, {"19": "Was sage ich da immer ..... [BR]ETWAS mehr ist besser als gar nichts  [smilie--sprite2]"}, {"2": "King Luckybaby schrieb:\t\t\tWas sage ich da immer .....[BR]ETWAS mehr ist besser als gar nichts  [smilie--sprite2]Zum Vergrößern anklicken.......ich finde, das ist schon ordentlich mehr - es bleibt ja unabhängig vom Kulturbonus bei einem Plus von 1.433.979 im Vergleich zu den 250.000 der Normalproduktion...man muss halt ein wenig kombinieren...ich bau mal meine Türme weiter aus [smilie--sprite2]"}, {"19": "Romilly schrieb:\t\t\t...ich finde, das ist schon ordentlich mehr - es bleibt ja bei unabhängig vom Kulturbonus bei einem Plus von 1.433.979 im Vergleich zu den 250.000 der Normalproduktion...man muss halt ein wenig kombinieren...ich bau mal meine Türme weiter aus [smilie--sprite2]Zum Vergrößern anklicken....Das Problem ist - diejenigen, die sich hier beschweren - ab welcher Summe sind die befriedigt ?[BR][BR]100k - 1 Mio. - 10 Mio. 100 Mio. ???[BR]Indianerhäupftling \"Gestopfter Hals\" kann nie genug bekommen [smilie--sprite1][BR][BR]Mir reicht - hier und da - auch dieses ETWAS mehr   [smilie--sprite6]"}, {"278": "@Romilly: Danke für Deine Mühe, du hast dich damit ja schon gut auseinander gesetzt. Diese Zeit wird der Großteil der Spielenden nicht investieren. Deine Ausführungen zeigen, wie kompliziert das System ist. Nette Spielidee, aber wenig praktikabel. Schon auf dem Betaserver haben wir den Hexenkessel wieder in die Ecke gestellt.[BR][BR]Hier mal ein Beispielrezept, das nur zur Rohstoffverschwendung geführt hat:[BR]5x Augensprossen +5x Bitterhaarblatt +4x Wolkenwolle-Knospe ergibt +49,5% Produktionsbonus bei BG1-3 für 3h + 15,1% Produktionsbonus bei BG1 +10,2% Stärke der Truppen aus dem Trainingscenter[BR][BR]Kosten: 3345 Hexenpunkte, Erfolgsrate 74,8%, Chance für kritischen Effekt= 0%[BR]Jeder Kelch kann einen Zaubertrank-Effekt auslösen. Es müssen also 3 Kelche bei diesem Trank geleert werden.[BR]Kelch 1+2 keine Wirkung, Kelch3= +3,1% Produktionsbonus für 1h49[BR][BR]Fazit bei einer eingestellten 3h Produktion ist der Effekt = 0[BR]Was soll der Scheiß? Ist das vorher vom Entwicklerteam nicht durchgespielt worden? Und wie sieht die Auswertung vom Betaserver aus.[BR]@Thebigunknown: Das ist schon ok. nicht jeder Kuchen wird etwas. Dank Dr. Oetker aber schon. Ich hoffe die Infotexte liegen mittlerweile alle in Deutsch vor, ich schaue mal eben nach, ja die Texte sind mittlerweile alle übersetzt, Das ist ja ein Spiel und soll keine Wissenschaft werden. Und da man da Dias und Zauberfragmente verbraten kann, kann  das sehr schnell unattraktiv werden.[BR][BR]Was macht da der alte Spielerhase: Abwarten wie bei Investitionen. Die 2. Investitionsrolle ist in der Regelerfolgreicher als die erste."}]