[{"28": "Atlantis1870 schrieb:\t\t\tWas soll der Scheiß? Ist das vorher vom Entwicklerteam nicht durchgespielt worden?\t\tZum Vergrößern anklicken....Warum sollte jede x-beliebige Kombination denn zum großen Erfolg führen? Wäre das nicht irgendwie langweilig?[BR][BR]Ich sehe den Kessel eher als \"Langzeitprojekt\", in dem man auch das Eine oder Andere noch lernen kann. ;-)"}, {"240": "[BR][BR]Für mich nicht gut, da ich das Ding absolut nicht kann - bin erst Kapitel VI"}, {"28": "Shania1 schrieb:\t\t\tbin erst Kapitel VI\t\tZum Vergrößern anklicken....Du meinst vermutlich dass Du in Kapitel IV bist (römische Zahlen), wenn dem so ist dauert es ja gar nicht mehr solange bis Du den Hexenkessel erforschen kannst. ;-)"}, {"240": "Nein, ich bin Kapitel VI - die Zwergen gerade beendet und beantworte gerade die Fragen von den Zwergen[BR][BR]Bei den Feen sammle ich gerade die WPs für die 1. Technologie"}, {"2": "...das ist halt der Unterschied - auf Beta wird seit Wochen getestet - aber so richtig was rausgekommen ist dort halt noch nicht wirklich - zumindest nicht öffentlich - ich finde den Kessel ehrlich gesagt nicht sonderlich kompliziert - man muss sich halt damit auseinandersetzen und die Kernpunkte verstehen (die ich hier versuche deutlich zu machen) - das Meiste, was ich wissen wollte, hab ich bereits nach 2 Durchläufen heraus gefunden - jetzt heißt es aber dennoch: weiter testen und Erfahrungen sammeln und dann spielt sich der Kessel irgendwann nebenbei - mMn haben die Meisten eher ein Problem mit falschen Erwartungen an den Kessel...[BR][BR]...vielleicht kann ja jemand auf Beta oder in anderen Foren mal einen Hinweis geben, daß wir hier auf DE schon eine Menge Screenshots und Daten gesammelt haben - Bilder oder Tabellen sind ja eigentlich auch gut international verständlich..."}, {"14": "@Shania, den Kessel kann man in Kapitel V erforschen, also müsstest du den mit VI können,[BR]evtl. hast du die Forschung noch nicht gemacht, weil sie mit dem Spielupdate vom Kessel erst eingeführt wurde"}, {"28": "[IMG]https://i.ibb.co/fvTD0Sg/https-de-forum-elvenar-com-index-php-attachments-1674149456955-jpeg-33615.jpg[/IMG][BR]Die Forschung \"Hexenkessel\" wurde in Kapitel V hinzugefügt."}, {"113": "Romilly schrieb:\t\t\t- mMn haben die Meisten eher ein Problem mit falschen Erwartungen an den Kessel..\t\tZum Vergrößern anklicken....[BR]Jaaha mit den Erwartungen ist das sone Sache, heute hatte ich in meiner Solostadt schon sowas wie einen epic fail. Zumindest fühlte es sich im ersten Moment so an.[BR]Ich hatte mir einen wunderhübschen Trank gebraut, um meine Gut2 Produktion zu steigern, hach, was hätte ich die Manufakturen zum Glühen gebracht.[BR]Mein Wunscheffekt lag bei 31% Erscheinungswahrscheinlichkeit, die anderen 4 Effekte lagen zwischen 7 und 9% , war mir sowas von egal, ich wollte ja nur die eine Produktion steigern. Trefferwahrscheinlichkeit bei knapp 75%.[BR][BR]Tjaja, aber wie das so ist, wenn mensch mit Wahrscheinlichkeiten spielt, es kommt nicht immer so, wie gewünscht.[BR][BR]Ich hatte 3 Treffer und zwei Nieten.[BR]Und was für Treffer - die minderbemittelten, definitiv nicht verbesserten Truppenstärkungen mit unter 10% Erscheinungswahrscheinlichkeit (oder wie immer das heißt) und einen dieser Effekte auch noch doppelt - sowas von meh.[BR][BR]Aber da war noch was mit Zitronen und Limonade ...[BR][BR]Da ich ja in meiner Solostadt auch heftiger turniere, ich will ja die Kelche, hab ich halt gekämpft, meine Truppen waren ja um 4bzw5% stärker.[BR][BR]Nächste Woche versuche ich es wieder [smilie--sprite2]"}, {"2": "...kurz gesagt: man nimmt, was man bekommt und macht das Beste draus  [smilie--sprite2] ...[BR][BR][BR]...wie ein 3-Millionen-Brot...[IMG]https://i.ibb.co/F38FGsh/https-de-forum-elvenar-com-index-php-attachments-brot-png-33618.png[/IMG]....na endlich [smilie--sprite2] ...[BR][BR]...es hat noch ne schöne Kruste bekommen...[IMG]https://i.ibb.co/mbqqp1X/https-de-forum-elvenar-com-index-php-attachments-brot2-png-33620.png[/IMG]"}, {"94": "Romilly schrieb:\t\t\t...das ist halt der Unterschied - auf Beta wird seit Wochen getestet - aber so richtig was rausgekommen ist dort halt noch nicht wirklich - zumindest nicht öffentlich - .\t\tZum Vergrößern anklicken....Wie ? da ist seit dem 29 November schon klar, dass der Kessel ein Flop ist. [BR]Was soll man denn da noch schreiben und wie oft damit das durchdringt. [BR]Die Leute sind da halt etwas realistischer, da wird niemand 40k Fragmente und 500 Dias in der Woche investieren damit sich da für paar Stunden was rührt.[BR][BR]Ich gebe dir Brief und Siegel, dass das Ding früher oder später überarbeitet wird, so wie es jetzt ist kann man es nur an die Wand schmeißen.[BR]Natürlich werden sie erstmal Daten sammeln."}, {"4": "auch der Turm wurde überarbeitet, die 2. Welle größtenteils  entschärft.[BR][BR]Insofern wird es wohl irgendwann mit dem Kessel genau so sein."}, {"2": "Jammin schrieb:\t\t\tWie ? da ist seit dem 29 November schon klar, dass der Kessel ein Flop ist.\t\tZum Vergrößern anklicken.......das sehe ich anders.."}, {"128": "Neris schrieb:\t\t\t@Shania, den Kessel kann man in Kapitel V erforschen, also müsstest du den mit VI können,[BR]evtl. hast du die Forschung noch nicht gemacht, weil sie mit dem Spielupdate vom Kessel erst eingeführt wurde\t\tZum Vergrößern anklicken....Thebigunknown schrieb:Anhang 33615 ansehen[BR]Die Forschung \"Hexenkessel\" wurde in Kapitel V hinzugefügt.\t\tZum Vergrößern anklicken....[BR]Liebe Freunde des besten Online-Game ever:[BR]Shania hat den Kessel längst erforscht und sogar schon probiert.[BR]Allerdings kann sie damit wie auch 97,86% aller übrigen Spieler noch so gut wie nichts anfangen.[BR]Fr. Romilly wünsche ich natürlich weiterhin viel Spaß mit ihrem Kessel. [smilie--sprite1]"}, {"2": "...ich versteh halt ganz einfach, wie der funktioniert und versuche den Kessel nicht zu etwas zu machen, was er nicht ist...Stichwort: falsche Erwartungen..."}, {"167": "Romilly - ich schätze deine Beiträge im Forum sehr. Sie haben mir schon oft geholfen, besser zu werden.[BR]Aber: aber ich würde mit wünschen, wenn auch du einfach mal eingestehen könntest - der Kessel hat nicht allein etwas mit verstehen zu tun[BR]Sondern auch damit:[BR]- das nicht jeder Spieler ein Endgamer mit drölfzigtausend ressies von allem im Lager ist[BR]- das nicht jeder Spieler bereit ist, xxx Fragmente und sogar noch Dias in den Kessel zu investieren[BR]um dann im schlimmsten Falle 5 Nieten zu ziehen.[BR][BR]Und aus genau diesen Umständen ziehst du deine Supa-Dupa Erfolge - die sind dir auch gegönnt, für deinen ganzen Testaufwand.[BR]Ich habe nämlich genau das gemacht, was du hier beschrieben hast - bin aber leider erst in Kapitel 11 und schwimme weder in Rohstoffen, noch in Fragmenten - ok Dias, könnte ich tatsächlich investieren. Da ich aber weder meine knappen Fragmente noch Dias investieren möchte, um kritische Effekte auszulösen - gab es faktisch 5 zonks diese Woche.[BR][BR]Der Kessel bleibt daher für mich ein Teil für Spieler in hohen Kapitel, die bereit sind sich in den Kesseln einzudenken, ne separate Exceltabelle mit den Rezepten zu führen, massig Rohstoffe zu verbrennen und am Ende noch Dias und Fragmente rauszuhauen!"}, {"2": "Falbala Di schrieb:\t\t\tDa ich aber weder meine knappen Fragmente noch Dias investieren möchte, um kritische Effekte auszulösen - gab es faktisch 5 zonks diese Woche.\t\tZum Vergrößern anklicken.......und deshalb geht es jetzt darum, nicht den Kessel zu verändern, sondern den Spielern mehr Material zu geben - in einem sinnvollen Maß, nicht in Massen...[BR][BR]...der Kessel alleine funktioniert nicht - du brauchst die anderen Features dazu - der Kessel ist eine weitere Station in diesem Kreislauf...[BR][BR]...was nun sinnvoll wäre, sind einmal mehr Fragmente im Spiel bzw. müssen Fragmentfresser wie die Grundplatten aus dem Handwerk entschärft werden (bzw. die müssen woanders hin) und dann würde ich neben den Hexenpunkten, die sich aus dem Forschungsbaum ergeben ein \"Startkapital\" von 250 Hexenpunkten zufügen (also jede Woche 250 + das, was sich aus den Forschungen ergibt), die es auch kleineren Spielern ermöglichen, auf ein Rezept mit wenigsten 50 % Erfolgsquote zu kommen - für die hohen Kapitel machen dagegen diese 250 nicht mehr viel Unterschied aus - ist also vertretbar..."}, {"10": "Der Kessel baut sich auf und das dauert seine Wochen und Monate. So wie jede Stadt.[BR]Das ist ein Aufbau-Spiel und der Kessel gehört nun fest dazu (wer ihn freischaltet) und man kann ab und dann ein paar Bonis genießen.[BR]Ist doch so wie im Turm.... man weiß nie, was man aus den Kisten gewinnt und freut sich dann über ne mag. Werkstatt o.ä.[BR]Ebenso wie mit den Effekten der Tränke.[BR][BR]Dann also hier mein Feedback zum Kessel:[BR]ich dachte anfangs, ob Inno mich veräppeln will, stocherte wild rum und hatte keine Ahnung, was ich da überhaupt mache. Dann kamen auch noch witzhafte Effekte heraus und fühlte mich ver.... Dazu auch noch die ganzen Ressourcen, die man zur Verbesserung der Effekte reinstopfen kann...[BR]Doch dann fing ich an, den Kessel zu verstehen und habe nun meine Lieblings-Effekte gepusht. Und... wie ich eingangs schrieb... ist es wie im Turm... ich freue mich, wenn ich einen fetten Portal- Mana- Unurium- oder Sonstwas-Booster trinken kann.[BR][BR]Ich mag den Kessel. Kostet nicht viel Zeit, man kann sich also auch Zeit lassen und ab und zu profitieren, mal schlechter und manchmal richtig absahnen.[BR][BR]Danke für das schöne Feature, Inno"}, {"2": "Deelfin schrieb:\t\t\tIch mag den Kessel. Kostet nicht viel Zeit, man kann sich also auch Zeit lassen und ab und zu profitieren, mal schlechter und manchmal richtig absahnen.\t\tZum Vergrößern anklicken.......genau - wenn man mal ein wenig herausgefunden hat, was von den Zutaten zu den Wünschen passt und was eher nicht, ist das eine Angelegenheit von vielleicht 5 Minuten pro Woche (oder weniger) - man bekommt aber was dafür - auch wenn es anfangs nur Kleinigkeiten sind - wichtig ist das Wissen, daß daraus etwas Großes werden kann - das muss noch besser gefördert werden..."}, {"9": "Jammin schrieb:\t\t\tDie Leute sind da halt etwas realistischer, da wird niemand 40k Fragmente und 500 Dias in der Woche investieren damit sich da für paar Stunden was rührt.\t\tZum Vergrößern anklicken....Das zum einem und klar ist dann ein gewisser Mehrwert zu erkennen, doch wie du schon schreibst, wer setzt da Dias ein und vor allem, wer hat diese enorme Zeit? Das dürften nur wenige sein, zumindest keine Autonormalo-Spieler. Ziel also erreicht, \"spiel das Spiel, mit Dias erreichst du viel\" und so wurde eine neue Quelle geschaffen. ^^ Wenn ich mich 10 und mehr Stunden davor setze und analysiere inkl. Excel-Tabellen etc., dann stimmt was nicht mit mir, denn das macht keinen Sinn, da ich ein Spiel spielen und kein Mathematiker werden möchte. Wer die Zeit hat bitte, doch dann davon zu überzeugen, \"dass ist voll Cool und Mega und man macht Gewinne Loch und Löcher.. .. ...\" total daneben. Hat weder was damit zu tun, dass es nicht toll ist, so ein neues Feature oder nicht passt etc., sondern eher was damit, dass ich keine XXX Excel Tabellen erstellen muss, um zu erkennen, dass ein Gewinn / Mehrwert nur dann möglich ist, wenn ich auch ordentlich was einsetze. Hinzu kommt, dass man das was man einsetzt, woanders im Spiel Gewinnbringender einsetzen kann. ;-)[BR][BR]PS.: [BR]Ich möchte NICHT überzeugt werden - Danke!"}, {"2": "AngelOfDead schrieb:\t\t\tWenn ich mich 10 und mehr Stunden davor setze und analysiere inkl. Excel-Tabellen etc., dann stimmt was nicht mit mir, denn das macht keinen Sinn, da ich ein Spiel spielen und kein Mathematiker werden möchte\t\tZum Vergrößern anklicken.......das ist auch gar nicht nötig - nimm einfach das, was schon da ist und sammle Erfahrungen damit - nicht immer soviel denken - besser handeln und dabei lernen - anders ausgedrückt: spielen - Lernen war schon immer ein Kinderspiel - Kinder sind Experten im Lernen - warum? Weil sie eben nicht über alles nachdenken müssen, sondern einfach handeln und beobachten, was passiert - diese Eigenschaft fehlt vielen Erwachsenen...[BR][BR]...ich bin hier in Elvenar, weil ich spielen möchte und nicht tagein tagaus mit den immer gleichen Tätigkeiten meine Zeit totschlagen will - spielen beflügelt die Kreativität - zum Spielen gehört aber eine gewisse Ungewissheit, an die man sich dann \"kreativ anpassen\" muss - immer wieder exakt das Gleiche tun und dabei wissen, daß auch immer wieder exakt (oder ziemlich) das Gleiche dabei heraus kommt, ist aber das Gegenteil von Spielen..."}]