[{"9": "Romilly schrieb:\t\t\t...das ist auch gar nicht nötig - nimm einfach das, was schon da ist und sammle Erfahrungen damit - nicht immer soviel denken - besser handeln und dabei lernen - anders ausgedrückt: spielen - Lernen war schon immer ein Kinderspiel - Kinder sind Experten im Lernen - warum? Weil sie eben nicht über alles nachdenken müssen, sondern einfach handeln und beobachten, was passiert - diese Eigenschaft fehlt vielen Erwachsenen...\t\tZum Vergrößern anklicken....AngelOfDead schrieb:\t\t\tPS.:[BR]Ich möchte NICHT überzeugt werden - Danke!\t\tZum Vergrößern anklicken..........tztztztz..... Nochmal, ich muss kein Mathematiker oder ein Wissenschaftler sein um zu erkennen, dass sich der Kessel NULL rentiert für Autonormalspieler. Zum anderen, kannst du eigentlich mal Meinungen anderer Spieler akzeptieren ohne das dann wieder kommt, \"nein, das sehe ich anders ..........\" Allein in diesem Thread erkennt nun wirklich jeder, dass du seit XXX Seiten, andere von deiner Meinung und Spielweise zu überzeugen versuchst! Achtzig Prozent, wenn nicht mehr, schreibst rein nur du hier. Lass doch einfach mal Meinungen anderer Spieler so stehen, denn auch diese dürfen diese haben und die \"MUSS\" nicht genauso wie deine sein! Wenn man XXX Dias und Fragmente einsetzt, dann hat man sicherlich einen Mehrwert, doch dies steht in keinem Verhältnis zur Mehrheit der Spieler. Obendrein, haben deinen Kulturwert etc., wie viele Spieler? Aha, das dürften nicht viel sein, dennoch lässt du andere Meinungen seit 19 Seiten nicht wirklich zu und versuchst stets zu überzeugen! Irgendwann schreibst du \"wahrscheinlich\" ganz alleine hier. Geh mal von den DURCHSCHNITTSSPIELERN aus, dann wird ein Schuh daraus. So verärgerst du, wie es ja bereits von mehreren zu lesen war, nur Spieler. Auf eine Art ein geprotze und zuquatschen, wie es schlimmer gar nicht sein kann und auf der anderen Art, dieses ewige, \"nein, das ist so und so, du musst nur so und so und das sehe ich so und so....\" Lass doch mal andere Meinungen und Feedbacks einfach so stehen und erst recht dann, wenn man dich darum bittet. Nichts gegen deine Arbeit die du hier leistest und dir machst, aber irgendwo fragt man sich da schon, denn das sind alles deine Sicht- und Spielweisen. Da kommt man sich ja vor, als wenn andere alle \"zu dumm\" wären und definitiv keine andere Meinung haben dürfen."}, {"2": "...wenn du an Informationen oder anderen Standpunkten kein Interesse hast, dann lies hier doch einfach nicht mit...[BR][BR][BR]....und ja - ich kann deine Meinung akzeptieren - sie ist mir sogar ziemlich egal - ich bin dagegen offen für andere Meinungen und setze mich damit auseinander..."}, {"10": "Ich kann @AngelOfDead zustimmen. Es ist tatsächlich sehr nervenraubend, die ständige Überzeugungsarbeit und .. ja es kommt teilweise so rüber... \"Prahlerei\" von dir zu lesen, @Romilly [BR]Dabei wertschätze ich dein Engagement und Tüfftelei, Romilly, und konnte anhand deiner Ausarbeitungen schon einiges anwenden. Danke dafür.[BR][BR]Das \"Problem\" welches nun entstanden ist (für mich oder auch Spieler, die nachlesen möchten) :[BR]man findet in diesem ganzen Chaos nichts mehr oder muss sich gefühlte tausende Antworten durchlesen, um überhaupt mal auf etwas Brauchbares zum Thema gehörig zu stoßen.[BR]Das ist nicht nur in diesem Thread der Fall, sondern leider in sehr vielen. [BR]Dazu gab es einmal eine Zeit im Forum, da wurde mehr moderiert, aber das ist irgendwie nicht mehr der Fall. Ja, mein Geschreibsel grad ist auch offtopic. Aber es nervt nur noch irgendwelche Diskussionen zu lesen, die mich nicht im Geringsten interessieren, wo ich nur mal etwas nachlesen wollte.[BR][BR]Wie wäre es, einen extra Thread zu machen, wo du, Romilliy, deine Erforschungen zum Kessel übersichtlich hinein packen kannst? Das würde ich super finden."}, {"9": "Romilly schrieb:\t\t\t...wenn du an Informationen oder anderen Standpunkten kein Interesse hast, dann lies hier doch einfach nicht mit...\t\tZum Vergrößern anklicken....Deshalb bin ich nun auch hier raus, denn das ist ein Feedbackthread und kein Informationsthread welcher mir mehr oder weniger nur eine Spielweise aufzeigt.  ;-)[BR]Romilly schrieb:\t\t\t...und ja - ich kann deine Meinung akzeptieren - sie ist mir sogar ziemlich egal - ich bin dagegen offen für andere Meinungen und setze mich damit auseinander...\t\tZum Vergrößern anklicken....Na dann ist ja alles gut, liest sich aber auf den nun ungelogen 19 Seiten etwas anders.[BR]Viel Spaß noch beim Brauen und Kelche anstoßen. ;-)[BR]Deelfin schrieb:\t\t\tIch kann @AngelOfDead zustimmen. Es ist tatsächlich sehr nervenraubend, die ständige Überzeugungsarbeit und .. ja es kommt teilweise so rüber... \"Prahlerei\" von dir zu lesen, @Romilly\t\tZum Vergrößern anklicken....Danke und das tust ganz sicher nicht nur du. ;-)[BR]Deelfin schrieb:\t\t\tWie wäre es, einen extra Thread zu machen, wo du, Romilliy, deine Erforschungen zum Kessel übersichtlich hinein packen kannst? Das würde ich super finden.\t\tZum Vergrößern anklicken....Daumen Hoch"}, {"2": "Deelfin schrieb:\t\t\tWie wäre es, einen extra Thread zu machen, wo du, Romilliy, deine Erforschungen zum Kessel übersichtlich hinein packen kannst? Das würde ich super finden.\t\tZum Vergrößern anklicken.......und wie wäre es, wenn du dir diese Arbeit selbst mal machst? - dafür wäre ich also wieder gut...."}, {"10": "Romilly schrieb:\t\t\t...und wie wäre es, wenn du dir diese Arbeit selbst mal machst? - dafür wäre ich also wieder gut....\t\tZum Vergrößern anklicken....[smilie--sprite1][BR]hab ich für unsere Gilde.[BR][BR]Nun, es kam mir so vor, als hättest du Spaß und Freude daran. Das war ein ernstgemeinter Vorschlag, da ich gesehen habe wieviel Mühe du dir gibst und es so, wie oben gesagt, einfach untergeht und das dafür ziemlich schade ist.[BR][BR]Okay, Vorschlag/Idee von dir abgelehnt. ^^ (auf komische Weise)[BR]Ich bin raus aus dem Offtopic...."}, {"147": "3 Millionen Brot[BR][BR]einem \"sowieso schon da Effekt\" von 2,800 k steht ein Zaubertrank Effekt von 111k gegenüber? [BR][BR]Wer braucht bei diesem enormen Aufriss für 111k diese zusätzlich? Wofür? [BR][BR]Ertrag / Nutzen / Investmentrelation???"}, {"104": "Handwerkliche Grundfehler vom Kessel sind vermutlich unter anderem (hab auch noch nicht komplett durchgearbeitet)[BR]- 10% Boni für 5h sind für Kapitel 20 Spieler nix, aber für Kapitel 5 Spieler genauso ein nichts, nicht akzeptabel 'weil Spieler kleiner'[BR]- große Spieler können in erster Woche auf anscheinend enorme Level erhöhen, sofort annehmbare Effekte haben, welche kleinere Spieler erst in Jahren sehen werden[BR][BR]Das war im anderen Spiel mit Einführung des Burgsystem besser gelöst. Da verdienen größere Spieler mehr Erfahrungspunkte pro Tag, aber nur begrenzt vielleicht 5fache Menge, nicht auf einen Schlag das 100.000fache. Bis zu einem gewissen guten Level X dauert es dann 2-3 Monate statt einem Jahr. Halbwegs Rennen für alle bei Einführung (immer schwierig etwas neues für kleine + große Spieler gleichzeitig).[BR]Und die Goodies sind (mit nur wenigen Klicks am Tag abzuholen) zu jedem Level brauchbar, statt halt %-Boni, niedrig unnütz.[BR][BR]Zum Vergleich auch Turm + Turnier. Direkt bei Einführung für größere Spieler mehr drin, aber auch für kleine sofort nutzbar, sofort Ertrag.[BR]Der Unterschied ist auch nicht enorm, na von Extremspielern Turnier abgesehen. Dazu ist etwa im Turnier die Grundmenge an WP pro Tag der Spieler zu bedenken. Ein kleiner Spieler macht vielleicht nur 30 normal, 5 aus Turnier netter Zusatz. Ein Top-Spieler kommt (vereinfachte Zahlen) auf 300 pro Tag, 50 aus Turnier dazu, also gar in etwa vergleichbar.[BR]Solche Faktoren sind zu bedenken.[BR][BR]Sieht so aus, als wäre Hexenkessel maximal was für weit fortgeschrittene Spieler. Freischaltung in Kapitel 1x statt 5 wäre passender.[BR]Oder anpassen dass im niedrigen Bereich auch zu was zu gebrauchen."}, {"14": "monakuki schrieb:\t\t\t3 Millionen Brot[BR][BR]einem \"sowieso schon da Effekt\" von 2,800 k steht ein Zaubertrank Effekt von 111k gegenüber?[BR][BR]Wer braucht bei diesem enormen Aufriss für 111k diese zusätzlich? Wofür?[BR][BR]Ertrag / Nutzen / Investmentrelation???\t\tZum Vergrößern anklicken....so wie ich das verstehe, wirkt der Zauberbonus auch noch auf den Verzauberungsbonus und wenn der Kulturbonus so um die 900%, wie in Bilder davor liegt, gibt das dann diese \"Brotexplosion\"[BR]es sind nicht nur die 111 k zusätzlich:[BR][BR][BR][IMG]https://i.ibb.co/F38FGsh/https-de-forum-elvenar-com-index-php-attachments-brot-png-33618.png[/IMG][BR][BR]da ich jetzt aber nicht weiß, wie hoch der Zaubertrankeffekt wirklich ist, rechne ich da jetzt auch nicht rum....[BR][BR][BR]aber da für mich so hohe Kulturwerte sowieso noch unter \"weit entfernt\" laufen, hat für mich der Kessel noch keine nennenswerte Boni[BR]bislang habe ich lediglich von \"mehr Münzen\" wirklich was gemerkt..[BR]es waren 28% für 16 h, ganz ohne Fragmente und Dias[BR][BR]das nebenbei mal so mitnehmen ist ganz o.k."}, {"2": "@Neris - kuck mal hier...[BR][BR]Romilly schrieb:\t\t\t...ich finde, das ist schon ordentlich mehr - es bleibt ja unabhängig vom Kulturbonus bei einem Plus von 1.433.979 im Vergleich zu den 250.000 der Normalproduktion...man muss halt ein wenig kombinieren...ich bau mal meine Türme weiter aus [smilie--sprite2]Zum Vergrößern anklicken.......der Effekt durch den Kessel fällt viel eher auf, wenn man keinen so hohen Kulturbonus hat - allerdings bekommt man ohne einen so hohen Kulturbonus kein 3-Millionen-Brot hin...[BR][BR]...du rechnest den Trankbonus x die Wirkung der Verzauberten Vorräte, dann hast du den Mehrwert aus der Auswirkung der Verzauberung - bei mir sind das derzeit 280 % mit Türmen auf Stufe 23... Ich hab also nicht nur die 111.700 durch den Trank sondern noch 111.700 x 2,8 = 424.460 zusätzlich, also ingesamt 536.160 aus dem Trank - die Kombination macht den Unterschied - du musst also kucken, was dir der Trank beschert und das dann mit den übrigen Möglichkeiten kombinieren - das bringt das große Plus - nicht der Kessel alleine...[BR][BR]...du kannst den Trankeffekt als weitere 150 % Kulturbonus sehen, die aber halt nur auf Werkzeug wirken...dazu musst du aber auch einen Kritschen Effekt auslösen und der Werkzeugeffekt muss wie bei mir auf Stufe 80 sein, sonst bekommst du diese Werte nicht hin - aber darauf kannst du hin arbeiten...und in der Zwischenzeit sind 10 %, die du gelegentlich mal mit einem kostenlosen Rezept triffst (also ohne Fragmente/Dias) soviel wert, wie 2 eingesetzte Mitgiften...[BR][BR]...und bei allen anderen Effekten ist es ähnlich..."}, {"14": "ok, bei Münzen gibt es aber nicht: Trankbonus x Wirkung des Kulturbonus, oder?[BR][BR]der Kessel wirkt zusätzlich zum Grundertrag auf Verzauberungen, aber nicht auf Kulturbonus, richtig?[BR]deshalb machen auch fabelhafte Fabrikationen dann was aus, besonders, wenn sie höher sind als 50% durch ein Wunder[BR][BR]für mich ist bis auf verzauberte Vorräte allerdings alles an Zaubern mangelbehaftet..leider[BR]würde mir wünschen, ich könnte davon mehr gewinnen..[BR]aber beim Turnier bin ich an meinem Limit und bei der Aka-Produktion ebenso [smilie--sprite2]"}, {"2": "Neris schrieb:\t\t\tok, bei Münzen gibt es aber nicht: Trankbonus x Wirkung des Kulturbonus, oder?[BR][BR]der Kessel wirkt zusätzlich zum Grundertrag auf Verzauberungen, aber nicht auf Kulturbonus, richtig?[BR]deshalb machen auch fabelhafte Fabrikationen dann was aus, besonders, wenn sie höher sind als 50% durch ein Wunder[BR][BR]für mich ist bis auf verzauberte Vorräte allerdings alles an Zaubern mangelbehaftet..leider[BR]würde mir wünschen, ich könnte davon mehr gewinnen..[BR]aber beim Turnier bin ich an meinem Limit und bei der Aka-Produktion ebenso [smilie--sprite2]Zum Vergrößern anklicken.......nein - Trank und Kulturbonus verstärken sich nicht gegenseitig - das geht nur mit Trank und Zauber...[BR][BR]...sagen wir es mal so - der Werkzeugeffekt kann mir entweder noch mehr einbringen als ich eh schon verdiene oder aber magische Mitgiften einsparen - alles hat seine Grenzen - man muss immer wissen, wo die Schwachstelle ist und versuchen hierfür eine Lösung zu finden bzw. eine Alternative...manchmal muss man auch erst 3 Schritte zurück, bevor es danach wieder weiter geht..."}, {"4": "was mir am Kessel so extrem missfällt, ist, dass ich die Tränke sofort trinken muss. Das liefert mich dem Hexenkessel so sehr aus auf Gedeih und Verderb. [BR][BR]Egal, welche Erfolge ich habe, irgendwelche Effekte kann ich gar nicht nutzen. Wenn ich morgens ins Spiel gehe und ZUERST braue, dann vielleicht den Turnierverstärker erhalte, kann ich den nicht nutzen. Ich stelle generell erst freitags nachmittags/abends meine Turnierbooster auf, gehe den Turm mit Zeitbooster hoch und dank Zeitschleife kann ich auch das Turnier durchspielen.[BR][BR]Gewinne ich nun morgens General Mayhen, dann ist der für mich nutzlos. [BR][BR]Braue ich abends, dann könnte ich den General nutzen, sollte ich jedoch Warenverstärker gewinnen, habe ich die ertragreiche Übernachtproduktion schon abgeholt.[BR][BR]Mit Werkzeugverstärkung verhält es sich genau so: Morgens sehr willkommen, abends so na ja, da die größte Menge an Werkzeugen ja morgens abgeholt wird.[BR][BR]Mit Goldverstärkern ebenso, Morgens sehr willkommen, abends so na ja, da die größte Menge an Gold ja morgens abgeholt wird[BR][BR]Weiterhin bedarf es großer Koordination, um alle möglichen Verstärker auch nutzen zu können.  Es muss alles abholbereit sein, in späteren Kapiteln sogar der Händler aufgrund der Saat- und Unuriumproduktion.[BR][BR]Was nützt mir Saatverstärkung, wenn der Händler gerade Unurium produziert und umgekehrt?[BR][BR]Was nützen mir Verstärkungen generell, wenn meine Manus/Gold/Werkzeuge usw., aus welchen Gründen auch immer, nicht abholbereit sind?  Und es aufgrund der teilweise noch sehr kurzen Anwendungsdauer auch nicht werden können?[BR][BR]Wäre ein nettes Gimmik, wenn ich die Tränke nach meinem Dafürhalten trinken könnte, gerne auch dann eben bis Freitag abend.[BR][BR]Diese Koordination, um möglichst viele Tränke auch nutzen zu können, ist nach meinem Dafürhalten überproportioniert für dieses Online-Spiel."}, {"100": "Neris schrieb:\t\t\thohe Kulturwerte sowieso noch unter \"weit entfernt\" laufen,\t\tZum Vergrößern anklicken....Um mal zu sehen was möglich ist , schon interessant . [BR][BR]Wenn ich in der mag. Akademie nur Kombis  produziere  ( richtung mystischem Objekt- Dias )  [BR]Kommen aus  einem guten Turnier  nur   30 - 40 mag. Mitgift . [BR]Jeden 2 tag kann ich   10    Mitgiften in meiner stadt anwenden . Dann reicht das für  1 Woche  . [BR]Das sind den nur  100 - 200 % Kultur aus der Mitgift  + 170 % Grund Kultur . [BR]350 % Kultur  schaff ich  als Turnierspieler  . [BR]Als gleichbleibenden  Kulturwert . [BR]500 % Wenn die Mag. Akademie nur mag. Mitgiften produziert . [BR]900-1000 % Kultur kommen nach meinem Spielgefühl ,  aus der Spardose  . Das macht man einmal , mehrmals   , aber nicht immer .  [BR]Ähnlich wie  30 000  Turnierpunkte beim Stahlturnier  , was man bei manchen sieht . [BR]500 kleine Manus beim GA  in der Stadt . [BR]Eine   Stadt mit 10 Erweitereungen in Kapitel 10 .[BR]Händlerstädte die  10 000 Pinkte im Turnier abreissen und mehr + Goldturm . [BR][BR]Ich finde  vieles erstaunliches bewundernswertes in Elvenar . [BR]1000 % Kultur gehört auch dazu .   350 % Kultur  sind  aber schon super . [BR]Und ich bin mit 160 % schon glücklich  . Und spiele  auch Goldturm und  5 k turnier."}, {"14": "evtl. hast du ja den Leuchtturm der guten Nachbarschaft[BR]ich habe jedenfalls nie so viele Mitgiften, dass sie für solche Kulturwerte reichen..[BR]also so 100% plus wäre schon maximal, aber meist ist es eher drunter und morgens auch oft nur +40%[BR]ich hoffe, das wird mit dem Leuchter dann besser[BR][BR]es sind eben viele Dinge, die zusammenspielen, aber auch 10.000 Punkte im Stahlturnier helfen da nicht: [BR]die magischen Mitgiften sind längst verbraucht [smilie--sprite2][BR][BR]aber das ist jetzt wieder OT (ja, ich weiß)[BR]jedenfalls kann man die Boni vom Kessel nebenbei mitnehmen, obwohl ich auch die Schwierigkeit habe, alle Boni unter einen Hut zu bekommen, aber besser man erhöht sowieso die Wahrscheinlichkeit für das, was man haben will und versucht die anderen etwas zu reduzieren[BR]um Truppeneffekte hab ich mich erst mal gar nicht so gekümmert...das kommt noch[BR]denn dann muss ich ja auch völlig andere Zutaten nutzen"}, {"2": "schwatzwurzel schrieb:\t\t\t900-1000 % Kultur kommen nach meinem Spielgefühl , aus der Spardose\t\tZum Vergrößern anklicken.......richtig - ist bei mir allerdings eine sehr große und auch alte Spardose und ich suche eben nach Möglichkeiten, diese Gold- bzw. Werkzeuggrube aufrecht zu erhalten..."}, {"100": "Neris schrieb:\t\t\taber das ist jetzt wieder OT (ja, ich weiß)\t\tZum Vergrößern anklicken....ich auch  [smilie--sprite1][BR]Die Stadt ist von ende  2019  .    Und hat langsam geforscht .    Und die Wunder  daher schon hoch .[BR]Deine Stadt ist  von  xxxxxx   jahr  , also viel jünger  .[BR]Noch bringt mir meine längere Spielzeit einen Vorteil , aber bald bist du überall besser als ich [smilie--sprite1][BR][BR]Romilly schrieb:\t\t\teine sehr große und auch alte Spardose\t\tZum Vergrößern anklicken....jep , und richtig angewendet  produziert man viele schöne Dinge. [BR][BR]Man merkt aber auch , das einige Mitspieler mit den Zähnen knirschen bei diesen Zahlen . [BR]Die nicht wissen wie man die Kultur so puschen kann , und fühlen sich einfach zu doof zum Spielen . [BR]Du hast Jahre auch mit  170-200%  Kultur gespielt und viel erreicht . Das sollte auch jeder Wissen ."}, {"2": "schwatzwurzel schrieb:\t\t\tDie nicht wissen wie man die Kultur so puschen kann , und fühlen sich einfach zu doof zum Spielen .\t\tZum Vergrößern anklicken.......dann müssen sie halt einfach fragen, wie sowas geht und dann auch mit der Antwort zurecht kommen - dazu braucht es eine lange Zeit und sehr viel Geduld..."}, {"211": "Ich folge mal Homers Motto, mit dem er erfolgreich Mülldezernet von Springfield wurde: Kann das nicht jemand anders machen?[BR][BR]Ich gehe mal davon aus, dass jede Zutat und jede Zutatenkombination über die Wochen hinweg die selbe Wirkungsweise hat, modifiziert in Stärke, Dauer und Wahrscheinlichkeit durch die Effektstärken selbstverständlich. Sonst würde ja die ganze Idee von \"Rezepten\" irgendwie keinen Sinn machen. Andererseits: Man kann nicht zweimal in denselben Mana-Fluss steigen und dann wieder schätze ich auch, dass inno die Mathematik hinter den Rezepturen ändern wird, wenn sie zu bekannt unter den Spielern ist und alle bloß noch gelangweilt darüber. So weit scheint's gerade nicht zu sein, also macht doch mal bitte ...[BR][BR]Die Formel für bloß eine Zutat war für die 10 Effekte, die ich bislang habe, ziemlich einfach zu erschließen: Effektstärke von x mal die selbe Zutat = Effektstärke von einmal diese Zutat mal Wurzel aus der Anzahl dieser Zutat = Effektstärke von einmal diese Zutat mal Wurzel aus der Anzahl dieser Zutat durch Anzahl dieser Zutat.[BR][BR]Für zwei Zutaten hatte ich mich gestern zusätzlich an so Terme rangeknobelt wie \"Wurzel aus Summe der Anzahl beider Zutaten\" und \"Wurzel aus Subtraktion der Anzahl beider Zutaten\" sowie deren Summe unter der Wurzel summiert mit \"Wurzel aus einer der Effektstärken\", außerdem braucht's eine Maximumsunterscheidung von Null und irgendeinem Wurzel-Term, weil Wurzel ja nicht negativ werden kann. Ich bin relativ dicht dran scheint mir, aber noch nicht da.[BR][BR]Mit mehr als zwei Zutaten wird's vermutlich ein relativ komplexes Wechselspiel von + und - unter den Wurzeln geben, tippe ich. Letztlich ist das ja Matrizenmultiplikation und ich tippe, sie haben da irgendsoein ganz schlichtes Ding à la[BR][BR]1 -1 1[BR]-1 1 -1[BR]1 -1 1[BR][BR]rübergeballert.[BR][BR]Ich habe mir zwar vorgenommen, mich da Sonntag erneut ranzumachen, aber, siehe oben: Kann das nicht jemand anders machen? Zumindest schneller als ich? Das mit den Wurzeltermen dürfte der entscheidende Schlüssel sein, der Rest bloß so Fingerspielerei.[BR][BR]Und wenn ihr schon dabei seid: Ein HTML-Formular irgendwo im Netz wäre nett, wo man bloß die von Null verschiedenen aktuellen Effektstärken der 12 Zutaten angibt, wenn man jeweils nur eine einzige ausgewählt hat, außerdem die verfügbare Anzahl an Hexenpunkten und die x Effekte, die man optimieren möchte, mit x = 1 bis 5, soweit ich sehe. Und dann halt 'nen Button der einem klar sagt: mathematisches Wahrscheinlichkeitsoptimum wäre a mal Zutat z, b mal Zutat y etc. pp. Das wäre nett, vielen Dank.[BR][BR]Liebe Grüße, Ranevle"}, {"117": "King Luckybaby schrieb:\t\t\tWar sogar Megageil - mit \"guter\" Zeitschleife und Eisbär !!! [smilie--sprite2]Zum Vergrößern anklicken....glaub ich gerne ..das hat aber nun wirklich nicht Jeder .. [BR]und ganz ehrlich ..bisher hat es mich nicht sooo gestört ..aber es ist für Kleinere wirklich nicht hilfreich wenn sich hier die *Großen ständig damit brüsten was sie alles erreichen können wenn kleinere Spieler noch Monate oder Jahre brauchen um da überhaupt hin zu kommen , das kann sicherlich manchmal ganz schön frustrierend sein"}]