[{"19": "Der Hexenkessel ist super ![BR]Gerade heute habe ich in der Beta 3 Effekte bekommen [BR][BR]1 Effekt für die Orkproduktion[BR]1 Effekt für die Werkzeugproduktion[BR]1 Effekt für die Truppen der Kaserne [BR][BR]Wichtig beim Hexenkessel[BR]Nicht vorher die Stadt abernten - oder Turm/Turnier spielen[BR]Erst abwarten - was für einen Effekt bringt der Hexenkessel ?[BR][BR]Gab heute ein paar Orks mehr - ein paar Werkzeuge mehr und [BR]das Turnier und den Turm habe ich heute nur mit den Truppen der[BR]Kaserne gespielt - war leider geil  [smilie--sprite6] [BR][BR]War sogar Megageil - mit \"guter\" Zeitschleife und Eisbär !!! [smilie--sprite2]"}, {"4": "ja, du vergisst nur, dass es einige Spieler gibt, die bereits Erfahrung mit dem Kessel gemacht haben auf der Beta. [BR][BR]Ich mag den Kessel nicht. Ist mir ein viel zu viel rumprobieren, zu unübersichtlich und damit unklar und nicht wirklich zu ergründen und vor allem, nicht zu merken.[BR][BR]Ich habe absichtlich Forschungen ausgelassen in den Kapiteln, zum einen, weil mir die Bücher woanders wichtiger sind und zum anderen, weil ich für Notfälle und entsprechende Quests noch die Möglichkeit haben möchte, einen Quest abzuschließen.[BR][BR]Ich guck mal auf der Beta, was ich reinwerfe, braue mit 1 Möglichkeit und werfe den Rest in die VErbesserungen rein. Keine Ahnung, ob das viel bringt, aber ich halte es jetzt mal so. Für mich besser, als meine Zeit mit vielen Möglichkeiten zu vergeuden, bei denen ich sowieso nicht durchblicke. [BR][BR]Zum anderen finde ich es nicht lustig, dass zwar in der Vorschau die max. Möglichkeiten angezeigt werden, aber dann letztlich immer weniger rauskommt bei Erfolg, als die angezeigten Möglichkeiten versprechen.[BR][BR]Ihr seht, ich halte davon so rein gar nichts."}, {"8": "Vor meinem geistigen Auge sehe ich mich schon Armeen geisterhafter Ananaskrieger ausheben![BR]+60% Angriff[BR]+40% Leben[BR]+11% Heilung (kumulativ zum Twillie)[BR]+2 Bewegungspunkte alle Einheiten *_*[BR]+500% Münzen und Vorräte[BR]+100% Hummelgüter[BR][BR]Bei KampfVerlust \"Hilfeschrei der himmlischen Heerscharen\"[BR]...ein beliebiges Teammitglied kann es nochmal versuchen und für mich gewinnen. ===> 50% meiner Gefallenen werden von Ärzten ohne Grenzen gerettet[BR][BR]...und das Alles für 5 Tage[BR][BR]Kanns kaum erwarten!!! [smilie--sprite8]"}, {"2": "gergerw schrieb:\t\t\tVor meinem geistigen Auge sehe ich mich schon Armeen geisterhafter Ananaskrieger ausheben![BR]+60% Angriff[BR]+40% Leben[BR]+11% Heilung (kumulativ zum Twillie)[BR]+2 Bewegungspunkte alle Einheiten *_*[BR]+500% Münzen und Vorräte[BR]+100% Hummelgüter[BR][BR]Bei KampfVerlust \"Hilfeschrei der himmlischen Heerscharen\"[BR]...ein beliebiges Teammitglied kann es nochmal versuchen und für mich gewinnen. ===> 50% meiner Gefallenen werden von Ärzten ohne Grenzen gerettet[BR][BR]...und das Alles für 5 Tage[BR][BR]Kanns kaum erwarten!!! [smilie--sprite8]Zum Vergrößern anklicken.......nimm mal weniger von den bunten Pillen...[BR][BR]...das sind die echten Effekte mit ihrer Steigerung...(es geht wie immer um den Grundwert - also aufpassen, was mit dem addiert oder multipliziert wird)[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/the-cauldron.18155/post-110836\t\t"}, {"94": "Also ich muss sagen, wirklich gut zusammengefast bisher auf den 2 ersten Seiten. Respekt dafür![BR]Als kleine Ergänzung noch, falls sich jemand wundert wie man 10 aktive Effekte gleichzeitig haben kann obwohl man nur 5 Kelche die Woche bekommt.[BR][BR]Wenn man viele Trank Diplome verbessert (z.B 10 oder mehr) und erst knapp zu Ende der Woche braut & trinkt werden die Trank Effekte auch weiter aktiv sein obwohl die Zauberin schon wieder im Wald ist. Wie lange sie aktiv bleiben hängt allerdings vom Level der Verbesserung und von der zufälligen Auslosung der Dauer beim brauen ab.[BR][BR]D.h. wenn man es hin bekommt 5 verschiedene Effekte vor Ende der Woche zu brauen und 5 weitere Effekte am Anfang der nächsten Woche sobald die Zauberin wieder aus dem Wald ist, hätte man 10 aktive Effekte gleichzeitig. (Dieses Scenario ist ziemlich unwahrscheinlich)[BR][BR]Ich bin mir ziemlich sicher, dass dies eher ein seltener Ausnahmefall sein wird, kein Normalzustand den man erwarten kann, wir werden froh sein, wenn wir lediglich 1-2 der gewünschten Effekte beim brauen bekommen werden.[BR][BR]Ich erwähne es nur weil es in der Ankündigung heißt, dass man bis zu 10 Effekte gleichzeitig haben kann und dies wohl falsche Erwartungen an die Leute sendet. "}, {"35": "Also - für mich liest sich die Beschreibung wahnsinnig kompliziert.[BR]Ich versuche gerade anhand der Beschreibung zu begreifen, wie das Dingens funktionieren wird. Habs erst einmal aufgegeben.[BR][BR]Es wäre wünschenswert, dass man so ein komplexes, neues Spielelement mit einem Tutorial versieht. Oder wird erwartet, dass man auf dem Beta-Server aktiv ist?[BR][BR]Was ist mit den Spielern, die nicht im Forum hoch und runter lesen, werden sie am Donnerstag damit überrascht - ohne Ankündigung und ohne Erklärung im Wiki?"}, {"28": "hobbitrose schrieb:\t\t\tAlso - für mich liest sich die Beschreibung wahnsinnig kompliziert.[BR][BR]Es wäre wünschenswert, dass man so ein komplexes, neues Spielelement mit einem Tutorial versieht. Oder wird erwartet, dass man auf dem Beta-Server aktiv ist?[BR][BR]Was ist mit den Spielern, die nicht im Forum hoch und runter lesen, werden sie am Donnerstag damit überrascht - ohne Ankündigung und ohne Erklärung im Wiki?\t\tZum Vergrößern anklicken...."}, {"35": "@Thebigunknown danke - ist aber keine Ankündigung im Spiel, oder?[BR]Und - ganz ehrlich - ich mag solcherart Videos absolut nicht. Schau ich mir deswegen auch nicht an.[BR][BR]Gibt es bei Inno niemanden, der eine verständliche Spielanleitung schreiben kann?"}, {"28": "hobbitrose schrieb:@Thebigunknown danke - ist aber keine Ankündigung im Spiel, oder?[BR]Und - ganz ehrlich - ich mag solcherart Videos absolut nicht. Schau ich mir deswegen auch nicht an.[BR][BR]Gibt es bei Inno niemanden, der eine verständliche Spielanleitung schreiben kann?\t\tZum Vergrößern anklicken....\t\t\thttps://de.forum.elvenar.com/index.php?threads/der-hexenkessel.26177/#post-417048\t\t"}, {"35": "@Thebigunknown danke, es ist sehr nett von dir, dass du die Anleitung noch einmal verlinkst.[BR]Genau diese Anleitung habe ich soeben gelesen und daher kommt mein Eindruck, dass es wahnsinnig kompliziert zu sein scheint.[BR]Nun wird ja nichts so heiß gegessen wie gekocht.[BR]Doch mein erster Eindruck ist ... noch ein Zufallselement im Spiel. Das dämpft etwas meine Erwartung."}, {"28": "hobbitrose schrieb:@Thebigunknown danke, es ist sehr nett von dir, dass du die Anleitung noch einmal verlinkst.[BR]Genau diese Anleitung habe ich soeben gelesen und daher kommt mein Eindruck, dass es wahnsinnig kompliziert zu sein scheint.[BR]Nun wird ja nichts so heiß gegessen wie gekocht.[BR]Doch mein erster Eindruck ist ... noch ein Zufallselement im Spiel. Das dämpft etwas meine Erwartung.\t\tZum Vergrößern anklicken....Für mich als Spieler war es zuerst auch etwas \"erschlagend\" aber das täuscht. Meine bisherigen Hexenkessel-Erfahrungen durch Beta beschränken sich aber auch nur auf das was man zu Anfang des Ork-Kapitels schon so brauen kann. Was ich zu Anfang komplett übersehen hatte, war lediglich der Button über den man Zauberspruch-Fragmente dem Brauvorgang hinzufügen kann. ;-)[BR][BR]Das Video stammt übrigens vom offiziellen youtube-channel von Elvenar, also ist es schon zumindest \"vom\" Spiel."}, {"1": "hobbitrose schrieb:\t\t\tAlso - für mich liest sich die Beschreibung wahnsinnig kompliziert.[BR]Ich versuche gerade anhand der Beschreibung zu begreifen, wie das Dingens funktionieren wird. Habs erst einmal aufgegeben.[BR][BR]Es wäre wünschenswert, dass man so ein komplexes, neues Spielelement mit einem Tutorial versieht. Oder wird erwartet, dass man auf dem Beta-Server aktiv ist?[BR][BR]Was ist mit den Spielern, die nicht im Forum hoch und runter lesen, werden sie am Donnerstag damit überrascht - ohne Ankündigung und ohne Erklärung im Wiki?\t\tZum Vergrößern anklicken....Im Wiki kannst du jetzt auch Infos zum Hexenkessen finden: Zum Wiki.[BR][BR]Natürlich möchten wir, dass jeder Spieler selbst seine Erfahrungen mit unseren Features macht. Somit bieten wir auch keine \"Komplettlösung\" an."}, {"135": "Ich würde eine Ingame Ankündigung befürworten..."}, {"14": "wie sieht das aus mit den Kelchen? [BR]es werden noch keine im Turnier angezeigt, [BR]heißt das, dass man auf jeden Fall von Montag bis Samstag warten muss, bevor man ausprobieren kann?"}, {"103": "davon gehe ich aus, Du kannst ja keine Spielelemente erhalten, bevor das Spiel gestartet wurde..."}, {"14": "ja, ich kam darauf, weil es auf Beta wohl anders war: [BR]da waren alle erstaunt, dass plötzlich Kelche angezeigt wurden, danach kam dann der Kessel[BR]aber: ist o.k. [smilie--sprite1]"}, {"103": "Ich korrigiere mich hier gerne und kann sagen,[BR]dass das aktuelle Turnier doch schon für den Kessel zählen wird.[BR][BR]Im Laufe des Tages sollen die \"Kelche\" des Turniers noch freigeschaltet werden."}, {"4": "Neris schrieb:\t\t\twie sieht das aus mit den Kelchen?[BR]es werden noch keine im Turnier angezeigt,[BR]heißt das, dass man auf jeden Fall von Montag bis Samstag warten muss, bevor man ausprobieren kann?\t\tZum Vergrößern anklicken....[BR]Du musst[BR]1.) die Forschung in Kapitel 5 freischalten[BR]2.) Turnier spielen, um Kelche zu erhalten (1 Kelch gibt es automatisch, bis zu 4 weitere je nach erspielten Turnierpunkten)[BR]3.) muss zuerst die Hexe in den Wald, damit überhaupt Ingridenzien zur Verfügung stehen.[BR][BR]Somit wird das mit dem Ausprobieren vor Samstag nach Turnierende nix.[BR][BR]Neris schrieb:\t\t\tja, ich kam darauf, weil es auf Beta wohl anders war:[BR]da waren alle erstaunt, dass plötzlich Kelche angezeigt wurden, danach kam dann der Kessel[BR]aber: ist o.k. [smilie--sprite1]Zum Vergrößern anklicken....Auf der Beta konnte man schon 2 Turniere lange Kelche sammeln, bevor das Feature startete. Da gab es auf einmal Kelche, mit denen niemand was anzufangen wusste."}, {"240": "Hab einen lieben Dank für Deine Erklärung, Romilly...[BR]Es hat meinen Eindruck bestätigt, daß es für die höheren Kapitel super ist - die Orks sind ab Kapitel VIII...."}, {"14": "muss man die Forschung freigeschaltet haben, bevor man zum Ende des Turniers Kelche bekommt?[BR][BR]also, wenn dies Turnier doch schon zählt..bekommt man Kelche und kann danach gemütlich die Forschung freispielen (in Kapitel 5 )?[BR][BR]edit: auch wenn man auf Beta sogar 2x vorher sammeln konnte, brauchten man dort auch noch nicht die Forschung abgeschlossen haben,[BR]dann nehme ich mal an, dass es hier auch nicht so ist, denn die Forschung wird ja auch erst am Montag freigegeben.."}]