[{"134": "so, nach einer Woche Kessel muss ich feststellen, in allen 2 Gilden wo ich bin, der ist so was von uninteressant für die Mitglieder. Selbst auf nachfragen kam nur: \"links liegen lassen\". [BR]Auch meine Einschätzung ist: nichts für Otto Normalspieler[BR]Vielleicht wird das ganze mal ein bisschen überarbeitet so das es Sinn ergibt. Zum Beisp. warum 5 Tränke auf einmal........warum nicht 5 Tage 1 Trank???"}, {"8": "Ranevle schrieb:\t\t\tUnd wenn ihr schon dabei seid: Ein HTML-Formular irgendwo im Netz wäre nett, wo man bloß die von Null verschiedenen aktuellen Effektstärken der 12 Zutaten angibt, wenn man jeweils nur eine einzige ausgewählt hat, außerdem die verfügbare Anzahl an Hexenpunkten und die x Effekte, die man optimieren möchte, mit x = 1 bis 5, soweit ich sehe. Und dann halt 'nen Button der einem klar sagt: mathematisches Wahrscheinlichkeitsoptimum wäre a mal Zutat z, b mal Zutat y etc. pp. Das wäre nett, vielen Dank.\t\tZum Vergrößern anklicken....Ich bau mir grad ne excel davon.[BR][BR]Als website von nem richtigen guru wäre natürlich genial![BR][BR]Inamoler 22 schrieb:\t\t\ter es ist für Kleinere wirklich nicht hilfreich wenn sich hier die *Großen ständig damit brüsten was sie alles erreichen können wenn kleinere Spieler noch Monate oder Jahre brauchen um da überhaupt hin zu kommen , das kann sicherlich manchmal ganz schön frustrierend sein\t\tZum Vergrößern anklicken....[BR]Unserer @Neris dabei zuzuschauen ist eine wahre Freude![BR]Sie projiziert sich schon ein Jahr in die Zukunft und baut auf dieser Basis ihre Stadt [smilie--sprite1]"}, {"81": "Jammin schrieb:\t\t\tIch gebe dir Brief und Siegel, dass das Ding früher oder später überarbeitet wird, so wie es jetzt ist kann man es nur an die Wand schmeißen.[BR]Natürlich werden sie erstmal Daten sammeln.\t\tZum Vergrößern anklicken....[BR]Des ding wird mehr als einmal Überarbeitet werden........[BR][BR]salandrine schrieb:\t\t\tauch der Turm wurde überarbeitet, die 2. Welle größtenteils  entschärft.\t\tZum Vergrößern anklicken....[BR]Nicht nur die 2. Wellen sondern auch beim Dritten mal kamen dann endlich ordentliche Gemeinschaftsbelohungen hinzu das der Turm endlich auch einen Reiz hatte gespielt zu werden, vorher war das nur sinnfrei Truppen/Güter verbrennen für Random Stuff.[BR][BR]zum Thema:[BR][BR]Ohne die Kritischen Effekte kannst den Kessel vergessen gibt einfach kaum bis gar keinen Benefit.[BR]Wer hat schon mehrere Millionen Fragmente oder Dias herumliegen? [BR]Wievielte Promille von der Spieler Schaft?[BR][BR]Das als Argument zu bringen ist mal totales Schönredens eines schlecht designten Features das noch in den Kinderschuhen steckt.  [BR][BR]Ich verstehe es echt nicht warum man da nicht mehr auf das Feedback des Betas hört...nein jedes mal der gleiche Blödsinn mit Kopf durch die Wand und am live aufspielen und sich wundern warum man 1:1 das selbe Feedback in allen Foren bekommt. [BR][BR]Wenn ich so ineffizient spielen würde wie hier so gerne die Selbstdarsteller mit \"wieviel ich liegen habe\" sich profilieren und dann das als Gott geben für die meisten Spieler annehmen.[BR][BR]Es sparen kaum Spieler über mehrere Jahre \"Stuff\" zusammen und geben dann damit an die Menge XY zu haben und dann so zu sagen \"was ihr habt das nicht?\" und das dann als Diskussionsgrundlage zu nehmen um das Feature schön zu reden...... [BR][BR]Ich sehe hier nur ungenutztes Potential und diese Spielweise dann als ich bin so toll dar zu stellen gibt neuen Spielern teilweise einen schlechten Stellenwert bzw. eine vielleicht falsche Richtung.[BR][BR]Wenn man sich selbst natürlich nur dadurch definiert wieviel man an Materialen angesammelt hat bitte, freut Euch  und belästigt damit die anderen nicht die den Stuff auch nutzen und nicht nur angucken und sich daran aufgeilen."}, {"94": "Sardukar schrieb:\t\t\tOhne die Kritischen Effekte kannst den Kessel vergessen gibt einfach kaum bis gar keinen Benefit.[BR]Wer hat schon mehrere Millionen Fragmente oder Dias herumliegen?\t\tZum Vergrößern anklicken....Bis da hin stimme ich deinem Beitrag zu, danach wirst du ziemlich zickig, ich mag das nicht so, wenn man andere so runter macht.[BR]Vor allem wenn die Leute auch in einem hoffnungslosen Fall versuchen noch etwas positives zu sehen. [BR]Romilly meint es nur gut, einige hier sollten lieber dankbar sein, für all die Mühe die sie sich macht um den Leuten den Einstieg leichter zu machen und ein besseres Verständnis von den Mechaniken zu bekommen.   [BR]Ich hätte nicht so ein Durchhaltevermögen. Sie ist offensichtlich eine positiv gestimmte Person und das ist sehr lobenswert.[BR]Ich sage im Namen aller Danke! für deine unerbittliche Mühe Romilly, auch wenn wir sehr oft unterschiedlicher Meinung sind."}, {"190": "Ich habe mir das jetzt etwas angeschaut, es ist Müll und Zeitverschwendung. Wer das entwickelt hat, sollte sofort endlassen werden für diesen Hexenkessel der Verblödung. Fruchtbar wenn etwas gemacht wird nur, um etwas neues zu machen. In der Gemeinschaft will sich auch keiner groß damit beschäftigen. Gut am Ende, wozu auch man kommt Online und möchte einfach spielen und nicht Müll studieren. Ich habe da diese Woche einfach etwas gedrückt und erledigt. Und werde es wohl einfach liegen lassen, es gibt ja keine großen Nachteile dadurch.Wenn der/die Entwickler des Kessels endlassen wurden. Können sich andere damit beschäftigen  und vielleicht noch das Kind aus dem Kessel holen. Aber vorerst wie geschrieben Müll."}, {"103": "Ich glaube nicht, dass sich hier irgendjemand anmaßen sollte,[BR]über Personalentscheidungen des Spielebetreibers zu entscheiden.[BR][BR]Abgesehen von den hochmathematischen Ausführungen einiger User, die einfach versuchen,[BR]den Kessel komplett zu entschlüsseln und höchstmöglich effektiv zu nutzen,[BR]ist die grundlegende Spielbarkeit des Kessels sehr einfach und bedarf keines Studiums.[BR][BR]-> kostenlose Zutaten in den Kessel legen bis die geschenkten HP alle sind[BR]-> Brauen und Effekte erhalten[BR]-> restliche HP in Steigerung der möglichen Effekte stecken (bei Bedarf auch HP dazukaufen mit Ressourcen)[BR][BR]Was ist daran so unmenschlich schwer, dass jemand dafür seinen Job verlieren sollte ?[BR][BR]Ich bitte Euch, bei Euren Äusserungen einfach mal auf dem Teppich zu bleiben und selbst[BR]zu hinterfragen, was Ihr, scheinbar anonym, teilweise so im Forum hinterlasst !"}, {"174": "Schade das viele den Kessel scheinbar nicht so gut finden, kann ich ehrlich gesagt nicht nachvollziehen.[BR]Aber wie schon von jemandem geschrieben wurde, dann benutzt ihn doch einfach nicht, dann ist für euch alles wie vorher.[BR][BR]Eine Entlassung zu fordern weil Dir das neue Feature nicht gefällt.....olololol!!!11111    *ich lach mich schlapp.....[BR][BR]Wenn das Spiel nicht mehr gefällt sollte der oder die jenige aufhören, und nicht die Entwickler.   *also wirklich, Leute gibts[BR][BR]Ich finde den Kessel gut.[BR][BR]Aber eine Frage hätte ich auch:  [BR]Warum gibt es keine Zutat um das Leben der Kasernen-Truppen zu erhöhen?[BR]Wurde die vergessen, wird sie nachgereicht oder ist sie unerwünscht? [smilie--sprite8]"}, {"147": "Gut, Flex ..[BR]ich gebe dir Recht, Ton und Inhalt überschreiten Grenzen.[BR][BR]Dennoch ein wertvolles Feedback, finde ich, zum Thema \"Kommunikation & Wirkung\" .. offenbar gibt es zwei Hauptkritikpunkte, die sich wie ein roter Faden durch die gesamte Debatte hier ziehen:[BR][BR]1. Wurde um dieses Feature ein Mords Bohei veranstaltet. Das natürlich entsprechende Erwartungen weckte, die nunmehr enttäuscht wurden.[BR][BR]Die Diskrepanz zwischen der Vorstellung im Ankündigungsvideo und dem  (selbstverliebten?) Enthusiasmus der Entwickler sowie der tatsächlichen Usability und Nützlichkeit für den Durchschnitts-User ist für mein Empfinden schon extrem   krass.[BR][BR]Ich würde meinen, die Markteinführung des Hexenkessels, ging gründlichst in die Hose. Er wird wohl überwiegend als Mogelpackung empfunden.[BR][BR]2. Wenn eine Funktion schon \"teuer\" ist, dann sollte sie sich vielleicht wenigstens intuitiv erfassen und in ihrem individuellen Nutzen beurteilen lassen. Ohne größere mathematische Verrenkungen oder langwieriges Studium von Diskussionssträngen?[BR][BR]Ich persönlich finde es sowieso schon schwierig genug, Wirkung abzuschätzen, weil diverse Zauber auf unterschiedliche Weise bzw. Grundwerte wirken und das eben gerade für App Spieler tw. völlig undurchschaubar bleibt, weil diese Informationen völlig fehlen."}, {"2": "Kxamin schrieb:\t\t\tWarum gibt es keine Zutat um das Leben der Kasernen-Truppen zu erhöhen?\t\tZum Vergrößern anklicken.......die würde es schon geben - aber das dazugehörige Diplom bekommst du erst, wenn du Kapitel 22 abgeschlossen hast  [smilie--sprite2] ..."}, {"174": "Danke Romilly [smilie--sprite1]"}, {"140": "das beste am hexenkessel ist die neue questreihe zu selbigen, die liefert einiges an zauberspruchfragmenten (nach wie vor absolute mangelware bei mir) und sogar dias, toll!"}, {"46": "Der Kessel ist eine tolle und interessante Zugabe zum Spiel. Da er aber Zeit, Geduld und auch ein bisschen Köpfchen benötigt, passt er eben nicht zur Spielart vieler Spieler. Doch für einige und gerade für die richtigen Strategiespieler ist er bestimmt eine tolle Zugabe. Ein Dankeschön an Inno auch wenn mir die Zeit und Geduld fehlt, macht es das Spiel für mich vielfältiger [smilie--sprite8] Einfach nach Bauchgefühl spielen und sehen was raus kommt [smilie--sprite1]))"}, {"279": "Also ich kann mit dem Kessel nicht besonders viel anfangen. Diese Vorteile die ich dort herstelle bringen vielleicht im Moment etwas, aber bleiben sie wenn der Kessel wieder weg ist?[BR]Die Questreihe zum Kessel mag zwar toll sein wenn man sie auch wirklich spielen kann. Ich muss da gerade eine Forschung abschliessen und komme nicht weiter. Die erste Questaufgabe kann ich also schon nicht machen."}, {"2": "Curiosus schrieb:[smilie--sprite8] Einfach nach Bauchgefühl spielen und sehen was raus kommt [smilie--sprite1])\t\tZum Vergrößern anklicken....[BR]...du wirst lachen - so in etwa mach ich das auch - ich füttere bloß vorher mein Bäuchlein bzw. mein Unterbewußtsein, indem ich genau hin sehe - der Rest ergibt sich dann aus der Erfahrung...das geht halt beim einen schneller und beim anderen dauert es ein wenig länger..."}, {"280": "Hi,[BR][BR]zu den Hexen:[BR]Bei den Menschen benutze ich den Kessel gern, ist ja auch eine hübsche Hexe.[BR]Bei den Elfen will ich gar nicht hinschauen, als wäre Schlumpfine auf eine Schönheitsfarm gegangen Die OP wurde total verpfuscht, Botox war ein verzweifelter Rettungsversuch und der Frisör hat alles noch schlimmer gemacht.[BR][BR]Zum Kessel:[BR]Den 1. Versuch habe ich versemmelt, wie wohl jeder, ist aber nicht schlimm,  weil es ja umsonst ist.[BR]Beim 2. Trank lief es besser.  10 x  hin und her klicken und 2 verschiedene Tränke, 3,5% mehr Güter für 5Std. Und 3,8% mehr Truppen in der Kaserne für 1Std.. Fragmente habe ich immer zu wenig und Diamanten spare ich für Erweiterungen und werde daher ohne brauen. Leider kann man in der app Version nicht nachvollziehen wieviel man zusätzlich bekommt ohne umständlich nachzurechnen, das ist sehr ärgerlich. [BR][BR]FAZIT :[BR]Der Kessel ist wie ein gefundenes Rubbellos,  man freut sich, wenn man was gewonnen hat [smilie--sprite1][BR][BR]Lg, kelkalynar"}, {"55": "Summerchind schrieb:\t\t\tAlso ich kann mit dem Kessel nicht besonders viel anfangen. Diese Vorteile die ich dort herstelle bringen vielleicht im Moment etwas, aber bleiben sie wenn der Kessel wieder weg ist?[BR]Die Questreihe zum Kessel mag zwar toll sein wenn man sie auch wirklich spielen kann. Ich muss da gerade eine Forschung abschliessen und komme nicht weiter. Die erste Questaufgabe kann ich also schon nicht machen.\t\tZum Vergrößern anklicken....Warum soll das neue Spielfeature wieder entfernt werden."}, {"203": "Die super hochgerechneten Tabellen sind wirklich perfekt. Vor allem mit Beiträgen höchster Prahlerei..... kein Wunder hören bei Elvenar so´viele Spieler, denn wer hat schon im 10. Kapitel 14 000 Diamanten und 175 000 Fragmente übrig?"}, {"19": "Inamoler 22 schrieb:\t\t\tglaub ich gerne ..das hat aber nun wirklich nicht Jeder ..[BR]und ganz ehrlich ..bisher hat es mich nicht sooo gestört ..aber es ist für Kleinere wirklich nicht hilfreich wenn sich hier die *Großen ständig damit brüsten was sie alles erreichen können wenn kleinere Spieler noch Monate oder Jahre brauchen um da überhaupt hin zu kommen , das kann sicherlich manchmal ganz schön frustrierend sein\t\tZum Vergrößern anklicken....[BR][BR]Richtig – meine Stadt in Felyndral ist im Kapitel 20[BR]Es sind - mit der Zeit - verschiedene Eventgebäude und Wunder dazu gekommen[BR]Da muss eine kleine Stadt erst einmal hinkommen[BR]Das kann man nicht vergleichen [BR][BR]Meine Stadt in Winyandor ist im Kapitel 5[BR]Auch diese kleine Stadt macht mir sehr viel Spaß[BR]Dort stehen mir noch nicht so viele Effekte zur Verfügung[BR]Aber auch dort unterstützen mich die Effekte ETWAS[BR][BR]In der Regel sind das:[BR]Effekte für mehr Münzen – mehr Werkzeuge – mehr Güter[BR]So viel mehr Effekte gibt es noch nicht[BR][BR]Mit diesem ETWAS mehr KÖNNTE man die Effekte weiter verbessern[BR]Es gibt beim nächsten Hexenkessel – möglicherweise – ETWAS mehr [BR]als vom vorherigen Hexenkessel[BR][BR]Mit der Zeit – nicht von heute auf morgen – werden die Effekte besser[BR]Aus diesem ETWAS wird dann ein VIEL[BR][BR]Mit einer großen \"Partnerstadt\", die einen mit Gütern \"beschenkt\" [BR]kann eine kleine Stadt nicht nur den Turm der Ewigkeit und das Turnier gut spielen,[BR]sondern auch die Effekte auf einen guten Level bringen  [smilie--sprite2] [BR][BR]Egal in welcher Stadt – ob groß oder klein – der Hexenkessel, der ist fein [smilie--sprite1]"}, {"113": "King Luckybaby schrieb:\t\t\tEgal in welcher Stadt – ob groß oder klein – der Hexenkessel, der ist fein [smilie--sprite1]Zum Vergrößern anklicken....Wie schön <3"}, {"113": "00onkelz77 schrieb:\t\t\tDie super hochgerechneten Tabellen sind wirklich perfekt. Vor allem mit Beiträgen höchster Prahlerei..... kein Wunder hören bei Elvenar so´viele Spieler, denn wer hat schon im 10. Kapitel 14 000 Diamanten und 175 000 Fragmente übrig?\t\tZum Vergrößern anklicken....[BR]Das ist keine Prahlerei, da kannst du nur sehen, was machbar ist. Dass das nicht für lau daher kommt, scheint allerdings vielen nicht klar zu sein.[BR][BR]Und sich dann über INNO oder MitspielerInnen in einem sehr unhöflichen Ton auszulassen, ist in meinen Augen unterirdisch."}]