[{"203": "Stimmt. Es ist keine Prahlerei - sondern Angeberei in höchster Masse. Kein Wunder denken sich neue Spieler, dass sie bei Elvenar nie weiterkommen. Oder warum hören 80% (bzw mehr, wie mir mal berichtet wurde) auf? Vor allem, wenn es schon hiess, dass es so langsam zuviel Bilder gibt (machen sich ausserhalb vom Forum genug schon lächerlich darüber) und es werden immer mehr und mehr. Dass man Diamanten durch pushen mehrerer Accounts bekommt und dementsprechend nichtmal Echtgeld ausgibt - dazu dies auch noch betont - ist dann perfekt? Durch ansparen von 40 Mio Güter jedes Kapitel super findet (und den Hexenkessel) ist auch nicht verwunderlich."}, {"4": "Sicher sind @Romilly Waren- und sonstige Vorräte nicht von der Allgemeinheit zu erreichen. Seht es einfach als das an, was es ist: Eine Möglichkeit, die dieses Spiel bietet. Natürlich nicht in ein paar Monaten, auch nicht in ein paar Jahren, sondern, soweit ich weiß, ist Romilly fast seit Anfang an dabei. Auf jeden Fall länger als ich selbst und bei mir sind es jetzt 5 Jahre.[BR][BR]Sie hat sehr viel Arbeit in die Auswertungen gesteckt und das ist einfach anzuerkennen.[BR][BR]Auch, wenn es mir in vielen Dingen noch nicht so ganz klar ist, vielleicht auch, weil dieses Feature nicht unbedingt so meines ist. [BR][BR]Und manchmal ist es auch einfach etwas viel, immer wieder zu lesen, dass sie das alles so locker aus der Portokasse zahlen kann. Nehmt es einfach zu Kenntnis, dass das Spiel genau diese Möglichkeiten hergibt, sicherlich nicht, ohne auch die entsprechende Arbeit reinzustecken. [BR][BR]In diesem Sinne: nehmt euch das Wissen, das Romilly hier so zur Verfügung stellt und überlest den Rest."}, {"1": "Ich möchte hier mal klarstellen, dass würden 80% und mehr Spieler aufhören, wie es hier verbreitet wird, es doch sehr viel leerer in den Welten wären. [BR][BR]Des weiteren bitte ich darum, dass der Ton und das Bashing gegen andere Spieler hier aufhört. Ansonsten werden wir halt doch wieder Beiträge löschen müssen und Punkte verteilen."}, {"2": "...ich spiele nun seit fast 6 einhalb Jahren und das täglich mehrmals (auf 7 Welten, die sich 1 Dia-Konto teilen) und wer denkt, meine Bestände wären hoch, der irrt sich - da kenn ich ganz andere Zahlen von anderen Spielern - ich (und auch andere Kapitel-20-Spieler) haben aber auch ganz andere Ausgaben im Spiel - man kann keinen Spieler aus einem sehr hohen Kapitel mit einem aus den unteren Kapiteln vergleichen - da liegen Welten bzw. oft Jahre dazwischen - das, was ich habe oder auch andere in meiner Größe, kann aber jeder erreichen - dazu gehört aber vor allem eines: Aktivität..."}, {"119": "Ich denke, daß ein Fazit jeglicher Form zu diesem Zeitpunkt verfrüht wäre,[BR]obwohl ich zugeben muss, dass sich bis jetzt noch kein interessanter Effekt gezeigt hat.[BR][BR]Ohne den Kessel wirklich verstanden zu haben, werfe ich jetzt mal die These in den Raum,[BR]daß die wirklichen nützlichen Rezepte ohnehin nur mit Dias zu haben sind.[BR][BR]Und diese werde ich garantiert nicht verschwenden für nicht klar definierte Ergebnisse."}, {"2": "Primus71 schrieb:\t\t\tOhne den Kessel wirklich verstanden zu haben, werfe ich jetzt mal die These in den Raum,[BR]daß die wirklichen nützlichen Rezepte ohnehin nur mit Dias zu haben sind.\t\tZum Vergrößern anklicken.......das würde ich so nicht sagen - aber du kannst halt wesentlich höhere Ergebnisse erzielen, wenn du deinem Rezept Fragmente hinzufügst - und da man nicht sehr oft 165.000 Fragmente einzahlen können wird, bleibt dann halt noch die Alternative: Diamanten...[BR][BR]...ich hab auch schon mit 5.000 Fragmenten einen kritischen Effekt ausgelöst - aber dabei sind die Höchstwerte halt nur um 35 % gestiegen und nicht um 200 % wie bei den 165.000 Fragmenten..."}, {"113": "Primus71 schrieb:\t\t\tOhne den Kessel wirklich verstanden zu haben, werfe ich jetzt mal die These in den Raum,[BR]daß die wirklichen nützlichen Rezepte ohnehin nur mit Dias zu haben sind.\t\tZum Vergrößern anklicken....[BR]Meine Erfahrung aus dieser Woche aus drei Städten:[BR][BR]1. Stadt: Weil ich noch ganz schnell ein paar Murmeln fürs Abenteuer haben wollte, habe ich einen Trank zur Truppenstärkung gebraut. Ich habe weder Dias noch Fragmente ausgegeben; ein paar Prozent mehr Schaden als Effekt bekommen. So war es gewünscht, war also nützlich[BR][BR]2. Stadt: Ich wollte mit aller Gewalt meine Gut2 Produktion boosten. Dafür habe ich mir die nötigen Zutaten zum Teil mit Diamanten gekauft weil sie nicht frisch auf Lager waren. Wie sehr das in die Hose gegangen ist, könntest du bei Interesse weiter oben nachlesen.[BR][BR]3. Stadt: Ich kämpfe gerne mit den Söldnertruppen, also habe ich einen Trank gebraut, der diese Truppen mehr Schaden machen lässt. Die Zutaten habe ich nur mit Hexenpunkten bezahlt, für eine einmalige Verbesserung der Effekte habe ich dann noch Fragmente ausgegeben. Der Trank war erfolgreich und ich habe die 3. Etage des Turmes gefühlt leichter absolviert als sonst.[BR][BR]Aus diesen Erfahrungen sollten keine Schlüsse gezogen werden, aber da hier gerne mal schnell geschossen wird ...[BR][BR]... komme ich zu dem Schluss, dass Diamanten nicht nötig sind, um nützliche Rezepte zu erzeugen"}, {"61": "Primus71 schrieb:\t\t\tOhne den Kessel wirklich verstanden zu haben, werfe ich jetzt mal die These in den Raum,[BR]daß die wirklichen nützlichen Rezepte ohnehin nur mit Dias zu haben sind.\t\tZum Vergrößern anklicken....Also ich hab den Kessel sicher auch nicht wirklich durchblickt in allen Einzelheiten. Aber ich denke, der wird in 2 bis 3 Wochen richtig krachen, wenn die ersten den richtig hoch gelevelt haben und sich die Effekte dann aufs Turnier auswirken, sind dann glaube vielen die 25 Dias egal. Hab letzte Woche auch 25 Dias bezahlt, weil eine der nicht vorhandenen Zutaten meinen Wünschen am nächsten kam. Das hat auch gereicht, die übrigen Zutaten haben dann anschließend gepasst und sind geblieben oder eben nicht und wurden wieder gelöscht. Ging ganz einfach, wenn die erste Zutat die richtige ist."}, {"281": "Primus71 schrieb:\t\t\tdaß die wirklichen nützlichen Rezepte ohnehin nur mit Dias zu haben sind\t\tZum Vergrößern anklicken....[BR]um ein optimales Rezept für einen Effekt zu brauen, dürfen nur die Zutaten mit positiven value & factor Werten verwendet werden,[BR]da es aber vier Zutaten nur mit Dias gibt, wird es in der Regel nur ein gutes Rezept werden [smilie--sprite1][BR][BR][BR]die Wahrscheinlichkeiten der Effekte kann jeder selbst berechnen (da ist nix hochmathemetisches dabei),[BR]mit den folgenden Infos ein Excel basteln :[BR][BR]- mit den DevTools value&factor der Zutaten auslesen, das Ergebnis hat u.a. @Romilly hier gepostet:[BR]\t\t\thttps://de.forum.elvenar.com/index.php?threads/fragen-zum-hexenkessel.26181/post-417830\t\t[BR]- die wesentliche Info findet sich bei Karvest:[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/the-cauldron.18155/post-111639\t\t[BR]- Anstieg der Erfolgsrate (Success Rate) berechnen:[BR]\t\t\thttps://de.forum.elvenar.com/index.php?threads/fragen-zum-hexenkessel.26181/post-418709\t\t[BR][BR]wer aber nichts berechnen will, dann den Hexenkessel einfach nur verwenden ....[BR]littleFlex schrieb:\t\t\tdie grundlegende Spielbarkeit des Kessels sehr einfach und bedarf keines Studiums\t\tZum Vergrößern anklicken...."}, {"147": "RayNiflheim schrieb:\t\t\t- mit den DevTools value&factor der Zutaten auslesen,\t\tZum Vergrößern anklicken....OMG![BR][BR]chance=Max(0,sum_of_all_values_of_every_used_ingredients*1.1^sum_of_all_factors_of_every_used_ingredients)[BR][BR]（ ͡° ͜ʖ ͡°)つ[BR]━☆・*。"}, {"2": "...die Schwierigkeit besteht allerdings darin, daß man sich das Rezept auch leisten können muss (von den Hexenpunkten her) - also mit möglichst hoher Erfolgsquote - idealer Weise 100 %..."}, {"94": "ZeNSiErT schrieb:\t\t\tAlso ich hab den Kessel sicher auch nicht wirklich durchblickt in allen Einzelheiten. Aber ich denke, der wird in 2 bis 3 Wochen richtig krachen, wenn die ersten den richtig hoch gelevelt haben und sich die Effekte dann aufs Turnier auswirken, sind dann glaube vielen die 25 Dias egal. Hab letzte Woche auch 25 Dias bezahlt, weil eine der nicht vorhandenen Zutaten meinen Wünschen am nächsten kam. Das hat auch gereicht, die übrigen Zutaten haben dann anschließend gepasst und sind geblieben oder eben nicht und wurden wieder gelöscht. Ging ganz einfach, wenn die erste Zutat die richtige ist.\t\tZum Vergrößern anklicken....Da du gerade das Turnier ansprichst, kann ich dir ein paar Fakten nennen, die dich auf den Boden der Tatsachen bringen. [BR]Hast du bereits einen Schaden Turnier Trank auf lvl 81 gebracht dann hast du +20% Schaden. [BR]Das weitere leveln dieses Tranks bis lvl 100 fühlt sich an wie in Zeitlupe, da die Kosten an Hexenpunkten extrem hoch sind. [BR]Aber nicht wirklich von Bedeutung, denn ab Level 81 kannst du nur noch 3,8% bis Level 100 raus holen... 23,8% ist der Max Wert. [BR][BR]Wenn wir davon ausgehen, dass wir komplett ohne Buffs spielen, sondern nur mit Wundern und Phönix, wird niemals der Effekt für 100 lvl eine Zugabe in Form von +23,8% zur tatsächlichen Angriffskraft unserer Einheiten sein, da dieser Effekt ab einer Basisangriffskraft von 100% zählt. [BR]In der Praxis haben wir aber 100% Basis + 50% vom Phönix + 40% vom Wunder, also bringt uns der Effekt pro lvl 100 bestenfalls 23,8% zusätzlich zum 190 % die wir schon haben. Das bedeutet eine echte Steigerung der Angriffskraft unserer Einheiten um nur 12,5% auf der maximalen Stufe des Effekts, die man auch nur bekommt oder übertrifft mit auslösen eines kritischen Effekt.[BR][BR]Mit jedem weiteren platzierten Turnier Booster verliert der Effekt des Kessels an Bedeutung, aufgrund seines niedrigen Schadenswert.[BR]Der Trank ist auf seiner Maximalen Stufe nicht einmal halb so stark wie ein Turnier Booster. [BR][BR]Ein Trank für mehr Leben gibt auf seiner Level 100 Max Stufe 12% nun kannst du dir selbst den effektiven Nutzen errechnen, den du bekommst wenn du bereits ein Level 30 Kloster und 3 Lebens Booster oder eine Waffenschmiede platziert hast.[BR][BR]Fazit: damit sich der Kessel bei den Spielern als nützlich erweist, müssten die Max Werte mindestens verdoppelt werden ohne das man angewiesen ist kritische Effekte zu erzwingen. [BR]Die Tatsache, das man nur unter einem hohen Investment eines kritischen Treffers aus dem Kessel zeitweise Nutzen ziehen kann, macht das Feature zu einem nutzlosen, Unaus balancierten Ressourcenfresser. [BR][BR]Das gilt für alle Tränke des Kessels, Güter Tränke wirken auf die Grundproduktion ohne Reliktbonus, Mana nicht auf alle Gebäude, Saat nicht auf alle Gebäude und Unurium ebenso, Orks usw."}, {"35": "Ich hatte 4 Kelche, einen Trank gebraut mit bissel Fragmenten drin, getrunken - 4x die Meldung bekommen, dass es keinen Effekt gab.[BR]Als \"Trost\" gab es 4 x 675 Fragmente zurück. Na ja."}, {"113": "Jammin schrieb:\t\t\tWenn wir davon ausgehen, dass wir komplett ohne Buffs spielen, sondern nur mit Wundern und Phönix, wird niemals der Effekt für 100 lvl eine Zugabe in Form von +23,8% zur tatsächlichen Angriffskraft unserer Einheiten sein, da dieser Effekt ab einer Basisangriffskraft von 100% zählt.[BR]In der Praxis haben wir aber 100% Basis + 50% vom Phönix + 40% vom Wunder, also bringt uns der Effekt pro lvl 100 bestenfalls 23,8% zusätzlich zum 190 % die wir schon haben. Das bedeutet eine echte Steigerung der Angriffskraft unserer Einheiten um nur 12,5% auf der maximalen Stufe des Effekts, die man auch nur bekommt oder übertrifft mit auslösen eines kritischen Effekt.\t\tZum Vergrößern anklicken....Das kommt mir ein wenig falsch gerechnet vor. Ich verstehe nicht, wie du dahin kommst, den Effektschaden fast zu halbieren.[BR]Wenn der Effekt ein Maximum von 23% mehr Schaden hat, dann gibt es im Maximum 23% mehr Schaden, ausgehend von 100% Basisschaden, genau wie ein voll ausgebauter Phönix 50% mehr Schaden von 100% Basisschaden gibt und mit den Wundern ist es das gleiche. Mit Effekt also im Maximum ein Mehrschaden von 113% statt 90% und das ist doch gut, oder nicht?[BR][BR]Mal abgesehen davon, dass nicht alle SpielerInnen einen voll ausgebauten Feuerphönix ihr eigen nennen, oder hochgezüchtete Wunder."}, {"94": "hobbitrose schrieb:\t\t\tIch hatte 4 Kelche, einen Trank gebraut mit bissel Fragmenten drin, getrunken - 4x die Meldung bekommen, dass es keinen Effekt gab.[BR]Als \"Trost\" gab es 4 x 675 Fragmente zurück. Na ja.\t\tZum Vergrößern anklicken....Meiner Ansicht nach, der Grund warum Leute beim brauen viele Nieten ziehen ist weil sie auf die falsche Erfolgsrate schauen.[BR][IMG]https://i.ibb.co/8NjxVfN/https-de-forum-elvenar-com-index-php-attachments-screenshot-50-png-33653.png[/IMG][BR]Die Erfolgsrate im Bild unten rechts mit 77,5 ist ein Fake Wert, dem man keine Beachtung schenken sollte, die tatsächliche Chance ob dein Lieblingstrank gebraut wird oder nicht steht in der Liste neben den restlichen Werten deines Tranks, dein Tank sollte in der Liste immer ganz oben sein und eine reale Chance haben zu triggern, in meinem Fall 47% ... um auch da paar Zahlen zu nennen, ein Wert von 30% ist keine Garantie das der Trank tatsächlich gebraut wird, diese Erfahrung hab ich selbst schon gemacht."}, {"94": "lovelymonster schrieb:\t\t\tDas kommt mir ein wenig falsch gerechnet vor. Ich verstehe nicht, wie du dahin kommst, den Effektschaden fast zu halbieren.[BR]Wenn der Effekt ein Maximum von 23% mehr Schaden hat, dann gibt es im Maximum 23% mehr Schaden, ausgehend von 100% Basisschaden, genau wie ein voll ausgebauter Phönix 50% mehr Schaden von 100% Basisschaden gibt und mit den Wundern ist es das gleiche. Mit Effekt also im Maximum ein Mehrschaden von 113% statt 90% und das ist doch gut, oder nicht?[BR][BR]Mal abgesehen davon, dass nicht alle SpielerInnen einen voll ausgebauten Feuerphönix ihr eigen nennen, oder hochgezüchtete Wunder.\t\tZum Vergrößern anklicken....Ja das ist richtig, du musst tiefer denken um das zu verstehen, das eine ist der Tatsächliche Wert das andere ist der effektive Nutzen.[BR]Ich versuche mal es im übertriebenen Sinne zu verdeutlichen, wenn du bereits 10 Turnier Booster stehen hast, wie effektiv ist dann der 11te in seinem Nutzen.[BR][BR]was mein Beispiel betrifft 190% - 100[BR].......................................................23,8 - x   effektiver Nutzen"}, {"2": "Jammin schrieb:\t\t\tDie Erfolgsrate im Bild unten rechts mit 77,5 ist ein Fake Wert, dem man keine Beachtung schenken sollte, die tatsächliche Chance ob dein Lieblingstrank gebraut wird oder nicht steht in der Liste neben den restlichen Werten deines Tranks, dein Tank sollte in der Liste immer ganz oben sein und eine reale Chance haben zu triggern, in meinem Fall 47% ... um auch da paar Zahlen zu nennen, ein Wert von 30% ist keine Garantie das der Trank tatsächlich gebraut wird, diese Erfahrung hab ich selbst schon gemacht.\t\tZum Vergrößern anklicken.......nein - das ist kein Fake-Wert, sondern der bezieht sich halt auf jeden Kelch einzeln und nicht auf alle insgesamt - ist wie bei den anderen Sachen - du kannst auch im Event 5x hintereinander einen Preis mit einer Wahrscheinlichkeit unter 20 % bekommen, selbst wenn da was dabei ist, was mehr hat - es ist wahrscheinlicher, die 22,5 % NICHTS zu treffen als 11 % eines Effektes aus der Liste (der 2. bei dir) - wenn du einen Effekt auf 47 % hoch schraubst, dann bekommst du diesen Effekt bei 5 Versuchen zwar relativ sicher - aber auch relativ sicher öfters und verschwendest somit Kelche - das will ich nicht - ich stell mich lieber breit auf - mit weniger % auf einzelne Effekte und nutze dann das, was ich bekomme - also nach Möglichkeit 5 Effekte (und das nicht nur im Turnier)....[BR][BR]...sicher - Fragmente und Dias hat nicht jeder rumliegen - trotzdem sind die der Schlüssel und schon ein paar Fragmente können einen kritischen Effekt auslösen und beim Maximum mit Kritischem Treffer kommt halt dann das 3fache des gelevelten Wertes raus und eine in etwa 4-5fache Dauer - ich hatte einen Kritischen Effekt auf die Kasernenstärke und das waren dann + 60,4 % über fast 2 Tage hinweg...[BR][BR][IMG]https://i.ibb.co/0VmJhG3/https-de-forum-elvenar-com-index-php-attachments-k1-png-33580.png[/IMG][IMG]https://i.ibb.co/tmgqfpt/https-de-forum-elvenar-com-index-php-attachments-k7-png-33586.png[/IMG][BR][BR]..hier die Normalwerte..[IMG]https://i.ibb.co/M7f0wzd/https-de-forum-elvenar-com-index-php-attachments-kaserne-png-33661.png[/IMG]..mit 10.000 Fragmenten..[IMG]https://i.ibb.co/7z8NK1K/https-de-forum-elvenar-com-index-php-attachments-kaserne2-png-33662.png[/IMG]..oder 5.000+50 Dias...[IMG]https://i.ibb.co/6R2nH8L/https-de-forum-elvenar-com-index-php-attachments-kaserne3-png-33663.png[/IMG]..[BR][BR]...100 % Erfolgsrate + 50 % Kritischer Effekt kann nicht mal ich mir dauerhaft leisten - aber taktisch einbauen, kann man (also nicht nur ich) die gelegentlich schon - zumindest, wenn man jede Woche den Turm bis nach oben stürmt und nebenbei hochaktiv im Turnier ist - für 1 Ebene und 5 Provinzen macht es aber auch gar keinen Sinn, die Effekte derart zu erhöhen...erst kommt der allgemeine Fortschritt und dann kann man sowas angehen - wenn man sich das alles mal leisten kann...[BR][BR]...erst einmal geht es also jetzt darum, auszuloten, was geht und unter welchen Umständen bzw. Vorbereitungen - naja - und dann bereitet man sich halt darauf vor, wenn man das nutzen will - aber so ist es doch eigentlich mit jedem Feature...[BR][BR]...für die billigste 100 % - Erfolgsrate braucht man 7383 Hexenpunkte (natürlich weniger mit Dia-Einsatz) - das können derzeit nur Endgamer erreichen...[BR][IMG]https://i.ibb.co/0CrRLYQ/https-de-forum-elvenar-com-index-php-attachments-100-prozent-png-33664.png[/IMG]...der Kessel soll zum Weiterforschen animieren - that's it....[BR][BR]...einen \"Startwert\" von 250 Hexenpunkten zu denen, die sich aus der Forschung ergeben, würde ich aber für alle Kleineren sehr begrüßen, damit die auch was erreichen können - für die Großen fällt das nicht mehr ins Gewicht...und dann brauchen wir (bzw. die Kleinen) auch mehr Fragment-Output - nicht nur aus dem Turm oder durch das Entzaubern) - wie heißt es: Was Hänschen nicht lernt, lernt Hans nimmermehr - also gebt den Kleinen was, um auf den Geschmack zu kommen, sich mehr davon zu organisieren..."}, {"4": "Mein persönlicher Eindruck, der auch von anderen Gildies bestätigt wird, ist, dass die Fragmente deutlich weniger werden. Einige hängen nur  noch auf 10.000 und weniger Fragmenten dauerhaft rum. Mag auch sein, weil effektiv die Aka deutlich mehr als früher genutzt wird. Und das bei regelmäßigem Goldturm. [BR][BR]Jetzt aber sich entscheiden müssen, ob man in der Aka was herstellt, oder Tränke braut, ist schon ziemlich Mist.[BR][BR]Kleinere und neuere Spieler haben da kaum Chancen, mal auf einen Vorrat an Fragmenten zu kommen. Die leben alle nur von der Hand in den Mund.[BR][BR]Mein Vorschlag wäre, beim Entzaubern die Fragmenteanzahl anzuheben."}, {"2": "salandrine schrieb:\t\t\tMein persönlicher Eindruck, der auch von anderen Gildies bestätigt wird, ist, dass die Fragmente deutlich weniger werden. Einige hängen nur  noch auf 10.000 und weniger Fragmenten dauerhaft rum. Mag auch sein, weil effektiv die Aka deutlich mehr als früher genutzt wird. Und das bei regelmäßigem Goldturm.[BR][BR]Jetzt aber sich entscheiden müssen, ob man in der Aka was herstellt, oder Tränke braut, ist schon ziemlich Mist.[BR][BR]Kleinere und neuere Spieler haben da kaum Chancen, mal auf einen Vorrat an Fragmenten zu kommen. Die leben alle nur von der Hand in den Mund.[BR][BR]Mein Vorschlag wäre, beim Entzaubern die Fragmenteanzahl anzuheben.\t\tZum Vergrößern anklicken.......genau - die Fragmenteanzahl fürs Entzaubern war auch anfangs (vor dem Turm) höher, wenn ich mich recht erinnere - hier muss sich dringend etwas tun...(und die Grundplatten/Artefakte müssen raus aus dem Handwerk - gebt uns endlich Folianten im Turm)..."}, {"94": "Ich verstehe nicht, warum du immer noch mit Bildern von getriggerten kritischen Effekten argumentierst um deinen Standpunkt zu vertreten.[BR]Obwohl in diesem Threat schon mehrfach darauf hingewiesen wurde, dass das nicht die übliche vorgehensweise der Mehrheit ist.[BR]Dir muss doch selbst klar sein, dass bei einer 50% kritischer Effekt Chance unter einem Invest von 32k Fragmenten und 500 Dias keine Niete dabei sein wird.[BR]Romilly schrieb:Anhang 33656 ansehenAnhang 33660 ansehen[BR][BR]..hier die Normalwerte..Anhang 33661 ansehen..mit 10.000 Fragmenten..Anhang 33662 ansehen..oder 5.000+50 Dias...Anhang 33663 ansehenZum Vergrößern anklicken....[BR]Das beim einsetzen von 25 Zutaten unter Verwendung aller Hexenpunkte die Erfogsrate auf 100% steigt ist natürlich normal aber keine Garantie auf ein triggern irgendeines Effekts.[BR]Romilly schrieb:Anhang 33664 ansehenZum Vergrößern anklicken....[BR]Ich schlage vor, du braust mal so wie ein normaler Mensch im Kessel, so wie in diesem Bild und dann kannst du nochmal kommen und deine Beweise vorlegen, wie viel und was da gebraut wurde mit einer Erfolgsraten von 100% unten rechts und mit den tatsächlichen Chancen von 5,9% bis 15,4% vielleicht kann man dich dann zurück in die Realität holen [smilie--sprite2]"}]