[{"2": "Jammin schrieb:\t\t\tIch schlage vor, du braust mal so wie ein normaler Mensch im Kessel, so wie in diesem Bild und dann kannst du nochmal kommen und deine Beweise vorlegen, wie viel und was da gebraut wurde mit einer Erfolgsraten von 100% unten rechts und mit den tatsächlichen Chancen von 5,9% bis 15,4% vielleicht kann man dich dann zurück in die Realität holen [smilie--sprite2]Zum Vergrößern anklicken......und ich hatte schon einen Kritischen Effekt mit 6 bunt gemixten Zutaten und 5.000 Fragmenten (sogar auf das Söldnerlager) - das ist halt Glückssache... und ein \"normaler Mensch\", wie du ihn kennst oder definierst, werd ich nie sein - hab ich auch gar keinen Bock drauf...ich verhalte mich vollkommen normal - ich bin nur von Natur aus anders..."}, {"6": "Mag ja sein, dass man mit Einsatz von Fragmenten und/oder Dias sinnvolle Effekte erzeugen kann.[BR]Ich werde aber weder Fragmente noch Dias hierfür verschwenden und damit ist der Kessel für mich einfach nur sinnfrei."}, {"2": "ustoni schrieb:\t\t\tMag ja sein, dass man mit Einsatz von Fragmenten und/oder Dias sinnvolle Effekte erzeugen kann.[BR]Ich werde aber weder Fragmente noch Dias hierfür verschwenden und damit ist der Kessel für mich einfach nur sinnfrei.\t\tZum Vergrößern anklicken.......deine Entscheidung und somit vollkommen ok für dich..."}, {"12": "Beim 3. Kessel sind nun 2 Zutaten mit Diamanten besetzt, die ich beim 1. verwendete, und eine vom 2. Kessel, 1 Zutat habe ich noch nie benutzt, und es sind auch nicht die restlichen verbliebenen 4 von den 12 Zutaten aus den ersten beiden Kesseln. Insofern war das bei meinem 2. Kessel wirklich ein sehr merkwürdiger Zufall.[BR]Da ich ohne Dia-Einsatz jetzt beim 3. Kessel ein wenig mehr Spielraum habe, hab ich ein Rezept gefunden, das mit 29% bzw. 22% Monster-Stärke bzw. Söldner-Moral stärkt, und mit 7% ist auch Monster-Moral im Rennen, da sollte für's Turnier doch was rausschauen."}, {"19": "Mal ein paar Fragen:[BR][BR]Sonntag - ich bin noch nicht so richtig wach[BR]Habe noch zu wenig Kaffee [smilie--sprite1][BR][BR]Die Effekte im Hexenkessel kann man in der LERNPHASE auf ÜBER 100% steigern[BR]Also - nicht die Wahrscheinlichkeits-%te sondern die %te für Stärke und Dauer [BR]In der Beta oder hir in Felyndral habe ich es schon gemacht[BR]Wie weit geht das noch ?[BR]Steht vielleicht schon irgendwo hier - möchte aber nicht suchen [smilie--sprite1][BR][BR]Nächste Frage:[BR]Als Kämpfer habe ich natürlich die Effekte für Kaserne etc. gelevelt[BR][BR]Der Effekt tritt NICHT ein - ich spiele mit Lebenspunkteverbesserer etc.[BR][BR]Der Effekt tritt ein - KÖNNTE man dann - irgendwann - auch ohne Lebenspunkteverbesserer etc.[BR]- da diese ja dann so gut wie nichts bringen sollen - den Turm und das Turnier spielen ?[BR]Dann würde man sich diese für das nächste Turnier sparen - wenn man den Effekt wieder nicht bekommt"}, {"281": "monakuki schrieb:\t\t\tOMG![BR][BR]chance=Max(0,sum_of_all_values_of_every_used_ingredients*1.1^sum_of_all_factors_of_every_used_ingredients)[BR][BR]（ ͡° ͜ʖ ͡°)つ[BR]━☆・*。Zum Vergrößern anklicken....ja, genau, das ist die Formel von Karvest, und ist für jeden Effekt zu berechnen,[BR][BR]auf Excel übersetzt schaut's dann so aus (Zutaten, values, factors sind jeweils Felder mit 12 Werten):[BR]=MAX(0;SUMMENPRODUKT(Zutaten;values)*POTENZ(1,1;SUMMENPRODUKT(Zutaten;factors)))"}, {"2": "King Luckybaby schrieb:\t\t\tDie Effekte im Hexenkessel kann man in der LERNPHASE auf ÜBER 100% steigern[BR]Also - nicht die Wahrscheinlichkeits-%te sondern die %te für Stärke und Dauer\t\tZum Vergrößern anklicken.......das hatte ich am Anfang mal verlinkt https://beta.forum.elvenar.com/index.php?threads/the-cauldron.18155/page-9#post-110836[BR]...die maximale Steigerung hast du dann bei Stern 100 - also 99 x eine Aufwertung des Grundwertes auf Stern 1 entsprechend der Angaben aus dem Link...[BR][BR]...bei den Gütern beziehen sich die 40-238 % auf den Grundwert - die Werte in Klammern (5-29,75 %) beziehen sich dagegen auf Grundwert + Reliktbonus von angenommenen 700 % - also ohne Hallen..."}, {"94": "King Luckybaby schrieb:\t\t\tDie Effekte im Hexenkessel kann man in der LERNPHASE auf ÜBER 100% steigern[BR]Also - nicht die Wahrscheinlichkeits-%te sondern die %te für Stärke und Dauer\t\tZum Vergrößern anklicken....Nein[BR]King Luckybaby schrieb:\t\t\tIn der Beta oder hir in Felyndral habe ich es schon gemacht[BR]Wie weit geht das noch ?\t\tZum Vergrößern anklicken....Du hast beim brauen Fragmente eingesetzt und einen kritischen Treffer ausgelöst[BR]King Luckybaby schrieb:\t\t\tSteht vielleicht schon irgendwo hier - möchte aber nicht suchen [smilie--sprite1]Zum Vergrößern anklicken....Ja[BR]King Luckybaby schrieb:\t\t\tAls Kämpfer habe ich natürlich die Effekte für Kaserne etc. gelevelt\t\tZum Vergrößern anklicken....das ist prima[BR]King Luckybaby schrieb:\t\t\tDer Effekt tritt NICHT ein - ich spiele mit Lebenspunkteverbesserer etc.[BR][BR]Der Effekt tritt ein - KÖNNTE man dann - irgendwann - auch ohne Lebenspunkteverbesserer etc.[BR]- da diese ja dann so gut wie nichts bringen sollen - den Turm und das Turnier spielen ?[BR]Dann würde man sich diese für das nächste Turnier sparen - wenn man den Effekt wieder nicht bekommt\t\tZum Vergrößern anklicken....Nein, das Crafting ist die Beste und effizienteste Methode Turniere zu spielen und wird es wohl auch bis in alle Ewigkeit bleiben.[BR]Ein Lebenstrank gibt dir 12% auf Stufe 100 wie um alles in der Welt willst du es hin bekommen einen Turnier Booster mit 25% Bonus der 5 Tage anhält zu übertreffen, geschweige denn 3 davon mit insgesamt 75% [BR][BR]Ich schlage vor du trinkst erstmal den Kaffee [smilie--sprite1]"}, {"2": "King Luckybaby schrieb:\t\t\tDer Effekt tritt ein - KÖNNTE man dann - irgendwann - auch ohne Lebenspunkteverbesserer etc.[BR]- da diese ja dann so gut wie nichts bringen sollen - den Turm und das Turnier spielen ?\t\tZum Vergrößern anklicken.......kommt drauf an, wie viele Booster du für gewöhnlich einsetzt bzw. wie weit du überhaupt spielen möchtest - andere Frage: warum oder, wenn auch und geht?[BR][BR]...bei den Lebenspunkteverbesserern wird es schwer, da hier der Wert auf Stern 100 nur bei 11,9 % liegt und du somit selbst mit einem max. Kritischen Treffer nur bei 35,7 % landen wirst.. - das ist eher ein weiterer Zusatz...bei der Kampfkraft kommst du max. auf Werte von 23,8 - 71,4 % - kritischer Treffer voraus gesetzt (wobei es mit den mind. 1.000 Fragmenten ja schon leicht höher startet)...[BR][BR]...nebenbei - ein Kampfkloster auf Stufe 25 bringt +25,5 % - das bräuchte man dann ja eigentlich auch nicht, wenn die Booster das A und O sind..."}, {"137": "Feedback[BR][BR]wie einige andere schon geschrieben haben finde auch ich den Hexenkessel viel zu kompliziert und unübersichtlich.[BR]Romillly gibt sich echt viel Mühe mit den Erklärungen und Screenshots, vielen Dank dafür, auch wenn sie mir gar nicht helfen, weil ich einfach nur zum Zeitvertreib spielen möchte und im Beruf genug Situationen habe in denen ich \"lesen, prüfen, verstehen, Rückschlüsse ziehen und Entscheidungen treffen\" muss. [BR][BR]Ich finde es schon total \"Freizeitspieler-unfreundlich\" das ich mich erst mal ganz in Ruhe mit dem Kessel auseinander setzten soll bevor ich die täglichen Dinge in der Stadt erledige. Ich bin teilweise froh erst mal schnell ernten und neu starten zu schaffen bevor das RL ruft. Danach beschäftige ich mich mit Turm, Turnier, NBH, Event, GA, Wunderbefüllung - was gerade ansteht, und es steht immer etwas an. Mich mit diesem Hexenkessel zu beschäftigen kommt erst danach in Frage, aber dann macht es keinen Sinn, weil man die Rezepte komplett löscht, wenn man sie nicht sofort braut. Ich wüsste aber auch nicht was es mir ohne Zeitschleife und keine Ahnung was für einen Bären oder Phönix bringen könnte 5 Std Kampfbooster zu bekommen? Wenn die Hexe Sa \"einkaufen\" geht kann ich es auch nicht für die letzte Turnierrunde brauen. [BR]Der Sinn der Kelchanzahl entzieht sich mir derzeit noch komplett - vielleicht ist das später mal interessant wenn man mehr Zutaten und Varianten braut??? Bisher hatte immer nur 1 Kelch Wirkung, die anderen waren \"Nieten\".[BR]Das studieren wäre vielleicht ein Grund jetzt schon jede Woche irgendwas zu brauen (auch wenn man es nicht nutzt), aber da bin ich über die Aussagen zu den Preissteigerungen extrem verwirrt - macht es jetzt Sinn überzählige Münzen zu versenken oder nicht? Ich beantworte mal selber - kommt drauf an! Darauf welches Kapitel, welche Forschungen man (nicht) hat und noch machen will, etc. - und da bin ich wieder bei dem Punkt das mir die Recherche zu aufwendig ist - denn der Countdown für das nächste Event läuft auch schon wieder![BR][BR]Mein Fazit: Vielleicht eine nette Sache für höhere Kapitel, wenn der Stadtausbau sich so hinzieht das man Langeweile bekommt, aber in Kapitel 5 hatte ich noch genug Beschäftigung durch Recherche die Kampfstrategie zu optimieren, bei Zwergen und Feen beschäftigt man sich mit Gastrassen-Strategien, Stadtoptimierung etc. und jetzt bei den Orks bin ich bei aufkommender Langeweile dabei mal wirklich zu prüfen welche Wunder tatsächlich Sinn machen. Ich fürchte nur das irgendwann jemand ganz schlau erklärt das ich mal besser direkt von Anfang an dies oder jenes gemacht hätte. :-("}, {"6": "Romilly schrieb:\t\t\t...nebenbei - ein Kampfkloster auf Stufe 25 bringt +25,5 % - das bräuchte man dann ja eigentlich auch nicht, wenn die Booster das A und O sind...\t\tZum Vergrößern anklicken....Naja, das ist aber jetzt ein wenig an den Haaren herbei gezogen.[BR]Erstens bringt es auf Stufe 30 immerhin 30%. Oder gibt es einen Grund, das Kloster auf Stufe 25 zu lassen?[BR]Zweitens - und viel wichtiger - bringt es mir die 30% ohne jede Zeitbegrenzung ständig.[BR][BR]Also bitte jetzt nicht anfangen, den Kessel übermäßig schön zu reden.  [smilie--sprite2]"}, {"2": "ustoni schrieb:\t\t\tNaja, das ist aber jetzt ein wenig an den Haaren herbei gezogen.[BR]Erstens bringt es auf Stufe 30 immerhin 30%. Oder gibt es einen Grund, das Kloster auf Stufe 25 zu lassen?[BR]Zweitens - und viel wichtiger - bringt es mir die 30% ohne jede Zeitbegrenzung ständig.[BR][BR]Also bitte jetzt nicht anfangen, den Kessel übermäßig schön zu reden.  [smilie--sprite2]Zum Vergrößern anklicken.......ja - aber du hast es jahrelang immer weiter ausgebaut, obwohl es nur ein paar Prozentchen mehr geworden sind mit jedem Ausbau - warum lässt du dir dann die Chance auf kostenlose weitere Prozentchen aus dem Kessel entgehen? Das begreife ich nicht - der Kessel ist ein Zusatz, kein Ersatz und da wirfst du halt Dinge (Ressourcen) rein, die du sonst nicht brauchst und mit der Zeit werden die Prozentchen dadurch mehr - wo ist denn da jetzt das Problem?[BR][BR]...sowie Kapitel 21 da ist, bin ich über jedes hinterm-Komma-Prozentchen froh, welches ich aus dem Portaleffekt holen kann...[BR][BR]...und die Kampfeffekte nutze ich nicht, weil ich mehr Turnier spielen will (das wollte ich nie und will ich auch in Zukunft nicht), sondern weil ich dadurch den ein oder anderen 5-Std.-Segen in die Zauberherstellung stecken kann und nicht in die Truppenproduktion..."}, {"6": "Romilly schrieb:\t\t\twarum lässt du dir dann die Chance auf kostenlose weitere Prozentchen aus dem Kessel entgehen?\t\tZum Vergrößern anklicken....Hab ich doch gar nicht vor. [BR]Zur Zeit und in den nächsten Wochen werden erstmal die Effekte verbessert. Später werde ich die Kelche erst kurz vor Beginn des nächsten Turniers nutzen. Wenn dann zwischendurch mal ein paar % für den Kampf rausspringen: schön. Wenn nicht: fast genauso schön, zumindest aber kein Beinbruch.[BR]Kritische Effekte werde ich aber nie haben (siehe weiter oben)."}, {"2": "...vorhin hattest du noch gesagt, daß der Kessel für dich sinnfrei ist..."}, {"6": "Ist er ja im Prinzip auch - zumindest wenn man von dem Tohuwabohu ausgeht, das um dieses Gimmick gemacht wird.[BR]Man kann - mit viel Mehrfachglück weil Mehrfachzufallsgenerator - zwischendurch mal ein klein wenig damit rausholen.[BR]Wenn man aber Pech hat und nichts für die eigene Spielweise dabei herauskommt, ist das auch nicht weiter erwähnenswert.[BR]Ist nun mal so wie mit dem Sack Reis in China.  [smilie--sprite2]"}, {"19": "Schlagt euch  [smilie--sprite1] [smilie--sprite1] [smilie--sprite1] [smilie--sprite1]"}, {"2": "...nö..."}, {"8": "Ich seh den Kessel jetzt so, dass man abhängig vom Kapitel ein paar kleine Prozentchen Effizienz für die Stadt \"geschenkt\" bekommen kann.[BR][BR]Will man aber was tolles erzielen, muss man Hartgeld oder das lang gesparte endgamer Lager investieren.[BR][BR]Der Kessel ist dann quasie der Wunschbooster des dicken Portemonaies.[BR][BR]Solange wie er schwach ist bleibt er freiwillig.[BR]Würden die Effekte stärker werden, erwarte ich, dass Kampfbooster und Zeitbooster in der Akademie entsprechend weniger wahrscheinlich würden um das Balancing nicht zu brechen."}, {"4": "Da Nu schrieb:Feedback[BR][BR]wie einige andere schon geschrieben haben finde auch ich den Hexenkessel viel zu kompliziert und unübersichtlich.[BR]...[BR][BR]Ich finde es schon total \"Freizeitspieler-unfreundlich\" das ich mich erst mal ganz in Ruhe mit dem Kessel auseinander setzten soll bevor ich die täglichen Dinge in der Stadt erledige. Ich bin teilweise froh erst mal schnell ernten und neu starten zu schaffen bevor das RL ruft. ...\t\tZum Vergrößern anklicken....[BR]Da Nu schrieb:\t\t\tWenn die Hexe Sa \"einkaufen\" geht kann ich es auch nicht für die letzte Turnierrunde brauen.[BR]Der Sinn der Kelchanzahl entzieht sich mir derzeit noch komplett - vielleicht ist das später mal interessant wenn man mehr Zutaten und Varianten braut??? Bisher hatte immer nur 1 Kelch Wirkung, die anderen waren \"Nieten\".[BR]Das studieren wäre vielleicht ein Grund jetzt schon jede Woche irgendwas zu brauen (auch wenn man es nicht nutzt), ...[BR][BR]Mein Fazit: Vielleicht eine nette Sache für höhere Kapitel, wenn der Stadtausbau sich so hinzieht das man Langeweile bekommt, aber in Kapitel 5 hatte ich noch genug Beschäftigung durch Recherche die Kampfstrategie zu optimieren, bei Zwergen und Feen beschäftigt man sich mit Gastrassen-Strategien, Stadtoptimierung etc. und jetzt bei den Orks bin ich bei aufkommender Langeweile dabei mal wirklich zu prüfen welche Wunder tatsächlich Sinn machen. Ich fürchte nur das irgendwann jemand ganz schlau erklärt das ich mal besser direkt von Anfang an dies oder jenes gemacht hätte. :-(\t\tZum Vergrößern anklicken....Ich mach es einfach so, dass ich wöchentlich kurz vor Turnier braue in der Hoffnung, vielleicht was für den Kampf zu erwischen. Und in der hoffnung, dass durch das Brauen und vor allen Dingen die Investition der restlichen Hexenpunkte und das Leveln dadurch ich auf Dauer vielleicht etwas bewirken kann. [BR][BR]Teilweise werfe ich deshalb nur eine oder max. 2 Zutaten in den Kessel, um mit den restlichen Punkten eben die Tränke leveln zu können.[BR][BR]Mehr ist mir derzeit zu kompliziert."}, {"137": "salandrine schrieb:\t\t\tIch mach es einfach so, dass ich wöchentlich kurz vor Turnier braue in der Hoffnung, vielleicht was für den Kampf zu erwischen. Und in der hoffnung, dass durch das Brauen und vor allen Dingen die Investition der restlichen Hexenpunkte und das Leveln dadurch ich auf Dauer vielleicht etwas bewirken kann.[BR][BR]Teilweise werfe ich deshalb nur eine oder max. 2 Zutaten in den Kessel, um mit den restlichen Punkten eben die Tränke leveln zu können.[BR][BR]Mehr ist mir derzeit zu kompliziert.\t\tZum Vergrößern anklicken....Ja, damit kann man zumindest nichts falsch machen [smilie--sprite1] so mache ich es wohl auch bis auf weiteres!"}]