[{"113": "ustoni schrieb:\t\t\tAlso bitte jetzt nicht anfangen, den Kessel übermäßig schön zu reden.  [smilie--sprite2]Zum Vergrößern anklicken....Achje, bei so viel Verdammnis, die schon über den Kessel gekippt wurde, fällt ein bisschen Schönrederei doch gar nicht auf.[BR][BR]Und dann sollten wir bedenken, dass ganz viele, die sich hier jetzt über den Kessel auslassen, Endgamer oder in höheren Kapiteln sind. Und alle haben sie ihren Spielstil ohne Kessel entwickelt. Dass sich da eine Integration für den einen oder die andere nicht lohnt, ist dann halt so. Ist doch nicht schlimm, oder?[BR][BR]Viel interessanter ist es, zu sehen, wie sich der Kessel einfügt, bei denen, die erst angefangen haben."}, {"211": "RayNiflheim schrieb:\t\t\t- die wesentliche Info findet sich bei Karvest:[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/the-cauldron.18155/post-111639\t\tZum Vergrößern anklicken....[BR]monakuki schrieb:\t\t\tOMG![BR][BR]chance=Max(0,sum_of_all_values_of_every_used_ingredients*1.1^sum_of_all_factors_of_every_used_ingredients)[BR][BR]（ ͡° ͜ʖ ͡°)つ[BR]━☆・*。Zum Vergrößern anklicken....[BR]RayNiflheim schrieb:\t\t\tja, genau, das ist die Formel von Karvest, und ist für jeden Effekt zu berechnen,[BR][BR]auf Excel übersetzt schaut's dann so aus (Zutaten, values, factors sind jeweils Felder mit 12 Werten):[BR]=MAX(0;SUMMENPRODUKT(Zutaten;values)*POTENZ(1,1;SUMMENPRODUKT(Zutaten;factors)))\t\tZum Vergrößern anklicken....Erstens ist mir nicht gänzlich klar, was mit \"values\" und \"factors\" gemeint ist. Values ist die Anzahl der Zutaten, factors die Wahrscheinlichkeit für einen Effekt?[BR][BR]Zweitens sagt Karvest dort auch:[BR]\t\t\tYou can't see factor part of if value part is <=0, so the only things listed on the sheet above are positive values and even them are not clear as they are showing normalized chance which is different for different number of diplomas you have and different number of ingredients used.\t\tZum Vergrößern anklicken....Die Formel taugt wegen der Normalisierung also nicht für einen Vergleich verschiedener Rezepte.[BR][BR]So interpretiere ich das jedenfalls und es passt zu den Daten, die ich erhoben habe. Und zu meiner Vermutung weiter oben, dass Wurzeln mit Additions- und Subtraktionstermen eine Rolle spielen müssen. Ich grübel daher jetzt schon den halben Tag darüber nach, wie denn eigentlich die Formel der Standardabweichung z. B. im Zweidimensionalen (eigentlich ja 12-Dimensionalen) aussieht und wie ich die umformen muss, um von den Werten für jeweils einmal eine Zutat zu einer globalen Formel zu kommen. Ich komme einfach nicht dahinter, Kopf sperrt sich, ich fühl mich dumm, es ist schwer frustrierend."}, {"19": "lovelymonster schrieb:\t\t\tAchje, bei so viel Verdammnis, die schon über den Kessel gekippt wurde, fällt ein bisschen Schönrederei doch gar nicht auf.[BR][BR]Und dann sollten wir bedenken, dass ganz viele, die sich hier jetzt über den Kessel auslassen, Endgamer oder in höheren Kapiteln sind. Und alle haben sie ihren Spielstil ohne Kessel entwickelt. Dass sich da eine Integration für den einen oder die andere nicht lohnt, ist dann halt so. Ist doch nicht schlimm, oder?[BR][BR]Viel interessanter ist es, zu sehen, wie sich der Kessel einfügt, bei denen, die erst angefangen haben.\t\tZum Vergrößern anklicken....Ich bin ein Endgamer, warte auf Kapitel 21 und finde den Hexenkessel gut [BR][BR]Im Hexenkessel habe ich auch schon den Effekt für die Gastrassenproduktion verbessert [BR]Sollte die neue Gastrasse kommen - dann hoffe ich, dass mich der Hexenkessel -[BR]jetzt kommt wieder dieses KLEINE ETWAS - unterstützt [smilie--sprite1]"}, {"8": "Ranevle schrieb:\t\t\t(eigentlich ja 12-Dimensionalen)\t\tZum Vergrößern anklicken....Ich bewundere deinen Großmut![BR]Dabei kann Mensch nicht mal richtig 3 dimensional denken, geschweigen denn 4 dimensional![BR][BR]Mensch nutzt dafür Statistik! ...und erfindet dann witzige Theorien über dunkle Felder, dunkle Wahrheiten und dunkle Materie...[BR]Bei dem Kosmos brauchts eben Humor [smilie--sprite1]"}, {"211": "gergerw schrieb:\t\t\tIch bewundere deinen Großmut![BR]Dabei kann Mensch nicht mal richtig 3 dimensional denken, geschweigen denn 4 dimensional!\t\tZum Vergrößern anklicken....naja, mit Hilfe mathematischer Abstraktion ja schon irgendwie ... wenn auch ich anscheinend nicht ... jedenfalls nicht heute.[BR][BR]Mir scheint unterdessen jedenfalls, dass ich weniger Zeit mit dem Problem vergeudet hätte, wenn ich einfach alle Kombinationen durchgetestet hätte ... mal vorausgesetzt, ich mag dafür zumindest ein paar Diamanten rausballern, kann ich mir nach 10 Kapiteln eh kaum mehr als 'nen Dutzend Zutaten leisten, eher weniger. Soooo viele Kombinationsmöglichkeiten ergibt das auch wieder nicht.[BR][BR]Meine Stichproben zeigen jedenfalls klar, dass die Zutaten heute die selbe Wirkung haben wie letzte Woche ... die werden also zumindest für eine Weile stabil bleiben. Folglich macht es vermutlich doch Sinn, innos Vorschlag einfach zu beherzigen und uns über gute, bessere, beste Rezepte auszutauschen. Trial and error, auch ein Weg zum Optimum."}, {"2": "Ranevle schrieb:\t\t\tMeine Stichproben zeigen jedenfalls klar, dass die Zutaten heute die selbe Wirkung haben wie letzte Woche ... die werden also zumindest für eine Weile stabil bleiben. Folglich macht es vermutlich doch Sinn, innos Vorschlag einfach zu beherzigen und uns über gute, bessere, beste Rezepte auszutauschen. Trial and error, auch ein Weg zum Optimum.\t\tZum Vergrößern anklicken.......die haben immer die gleichen Auswirkungen - nämlich die, die man auch fest verankert in den Files findet...[BR][BR]Spoiler: Auswirkung Zutaten...z.B. Portaleffekt...[IMG]https://i.ibb.co/jZw4RM8/https-de-forum-elvenar-com-index-php-attachments-fehler-portalo-png-33669.png[/IMG]...[IMG]https://i.ibb.co/0cCCDGz/https-de-forum-elvenar-com-index-php-attachments-zutaten6-png-33670.png[/IMG]...da sind allerdings 2 Werte fehlerhaft - hab ich gemeldet, allerdings weiß ich nicht, ob das korrigiert wird...aber wenn du einen bestimmt Effekt wahrscheinlicher machen willst, dann nimm die Zutaten mit den positiven Werten auf diesen Effekt [smilie--sprite2] - aber beachte, daß diese auch auf andere Effekte positiv wirken können[BR]...es ändert sich halt was an den % (Würfel) wenn eine Zutat durch ein weiteres Diplom auch einen weiteren Effekt auslösen kann..."}, {"61": "Jammin schrieb:\t\t\tFazit: damit sich der Kessel bei den Spielern als nützlich erweist, müssten die Max Werte mindestens verdoppelt werden ohne das man angewiesen ist kritische Effekte zu erzwingen.[BR]Die Tatsache, das man nur unter einem hohen Investment eines kritischen Treffers aus dem Kessel zeitweise Nutzen ziehen kann, macht das Feature zu einem nutzlosen, Unaus balancierten Ressourcenfresser.[BR][BR]Das gilt für alle Tränke des Kessels, Güter Tränke wirken auf die Grundproduktion ohne Reliktbonus, Mana nicht auf alle Gebäude, Saat nicht auf alle Gebäude und Unurium ebenso, Orks usw.\t\tZum Vergrößern anklicken....Danke, wird schon so sein [BR][BR]ABER [BR][BR]Wie oft ist es in den letzten bald 8 Jahren vorgekommen, dass ein neues Item eingeführt wurde und alle Spieler sich gefreut haben und das sofort alle in ihr Spiel integriert haben? Genau ... [BR]Also ich bin ganz fest davon überzeugt, vielleicht auch mit einigen Verbesserungen, der Kessel wird die großen noch viel größer machen wenn sie ihn spielen und die kleinen noch viel winziger, wenn sie ihn nicht spielen.[BR][BR]UND [BR][BR]Da ja die teuren Turnierprovinzen einfach nur teuer bleiben, aber nicht wirklich schwerer werden, könnten 10 oder 20 % stärkere Truppen am Ende vielleicht doch zu 30% mehr Turnier führen? Weiß ich nicht. [BR][BR]Also so lange man es selbst nicht ganz, ganz sicher weiß, würde ich erst man niemandem glauben, der sagt, das taugt nichts. Ich sehe da viel Potential, ob das alles jetzt schon ausgenutzt wird, oder erst später, kann nicht nicht sagen. Aber wenn sich das Wasser so weit zurück zieht, dann kommt meist eine große Welle [smilie--sprite1] [smilie--sprite1] [smilie--sprite1]"}, {"211": "Romilly schrieb:\t\t\t...die haben immer die gleichen Auswirkungen - nämlich die, die man auch fest verankert in den Files findet...[BR][BR]Spoiler: Auswirkung Zutaten...z.B. Portaleffekt...Anhang 33669 ansehen...Anhang 33670 ansehen...da sind allerdings 2 Werte fehlerhaft - hab ich gemeldet, allerdings weiß ich nicht, ob das korrigiert wird...aber wenn du einen bestimmt Effekt wahrscheinlicher machen willst, dann nimm die Zutaten mit den positiven Werten auf diesen Effekt [smilie--sprite2] - aber beachte, daß diese auch auf andere Effekte positiv wirken können[BR]...es ändert sich halt was an den % (Würfel) wenn eine Zutat durch ein weiteres Diplom auch einen weiteren Effekt auslösen kann...\t\tZum Vergrößern anklicken....Danke. Hast schon recht: Für trial and error sicher die beste Info bislang im Thread.[BR][BR]Warum sind einige Zahlen kleiner als andere?[BR][BR]Da ich's nicht so mit Code habe, ist mir da der komplette Kontext unklar: Wo kommt der her? Und lässt sich dann aus dem nicht letztlich die konkrete Formel entnehmen, mit der diese Werte zu den Werten führen, die im Spiel angezeigt werden? Falls nicht: Woher willst du wissen, dass die Formel, die diese Werte in die im Spiel transformiert, nicht wöchentlich, monatlich oder beim nächsten Update geändert wird?"}, {"131": "hier mal mein zusammenfassendes FEEDBACK zum Hexenkessel[BR](passend zum Topic...)[BR][BR][BR]1.) OPTIK & STORY:[BR]Der Hexenkessel und die Zauberin passen sehr gut in die Geschichte von Elvenar.[BR]Auch die Zutaten finde ich nicht nur optisch, sondern auch namendlich wirklich gut gelungen.[BR][BR][BR][BR]2.) HANDLING:[BR]hierzu vorab: Euer Eintrag im Wiki...[BR]Dieser ist diesmal länger und auch ausführlicher als bei manch anderen Themen. Das finde ich schonmal sehr gut!!![BR]Und dies ist auch bei einem neuen Feature wie diesem sehr hilfreich.[BR][BR]Das Handling des Hexenkessles an sich, ist zwar im groben gut nachvollziehbar und man findet die wichtigsten \"Knöpfe\".[BR]In Verbindung mit dem Wiki-Eintrag und der besagten groben Nachvollziehbarkeit der \"Knöpfe\", fehlt mir allerdings noch diverse weitere Erklärungen.[BR]Denn ohne 23 Seiten Forums-Diskussion (mit diversen Tipps und Infos - DANKE an ALLE Beteiligten) wäre es nicht bei 1-3 Versuchen geblieben, um wirklich zu verstehen, was ich da mache und wie ich was beeinflussen kann...[BR][BR]Unsere Gilde besteht aus Kapitel 5 - Kapitel 20 Spielern... also bunt gemischt. Zudem RL geht bei uns grundsätzlich vor.[BR]Ich (selber Kap. 18) hab diesmal den Info-Sammler gemacht und spiele immer noch den Erklär-Bar, damit es auch die Anderen verstehen und für sich umsetzen und nutzen können.[BR][BR]Hier komm ich nun zum Manko:[BR]Auch wenn wir uns in der Gilde grundsätzlich unterstützen (auf verschiedenste Art und Weise) gehört es eigendlich nicht zur Aufgabe eines Gamers - der nur Spaß am Spiel und seinen Funktionen haben will - den Anderen die Spiel-Funktionen grundsätzlich zu erklären. Dies ist doch - meiner Meinung nach - Aufgabe des Spiele-Entwicklers! oder irre ich mich da???[BR][BR]Deswegen... WARUM gibt es kein Tutorial für den Hexenkessel???[BR][BR]Bei Spielbeginn gabs ja auch eins, damit man erfährt wie was funktioniert und wo man was anklicken muß, damit man auch versteht was man da macht und warum... Das Ganze schön in die Story-Line eingebetet. Geht das hier nicht auch??? In meinen Augen: JA!!![BR][BR]Hier seh ich aktuell echten Nachhol-Bedarf!!![BR][BR][BR][BR]3.) Rezepte / Rezept-Buch[BR]Das hab ich hier bislang schon 2x gelesen und kann mich dem nur anschließen, denn es war nach kurzer Zeit auch mein Verlangen....[BR][BR]Elvenar ist doch ein ONLINE-GAME! Nicht wahr!?!?![BR]Warum muß ich also zu Stift und Papier oder einer externen Datei (Word, Excel, etc.) greifen und mir Notizen machen???[BR][BR][BR]\"... Phase 2 des Hexenkessels - Wir befinden wir uns im Studienzimmer der Zauberin...[BR]Das Studier-Zimmer ist angefüllt mit vielen, alten und dicken, magischen Büchern und die Zauberin studiert fleißig, was Ihre Vorgänger/innen ihr hinterlassen haben. ...\"[BR]Glaubt eigendlich Irgendwer, das da keine Rezept-Bücher bei sind????[BR][BR][BR]Warum wird das gerade (in Phase 1) gebraute Rezept nicht in ein Rezeptbuch (ein weiteres Fenster oder Reiter) übertragen???[BR]So dass, der fleißige Brau-Lehrling es nachschlagen kann und sich evtl. Notizen inGame machen kann oder es auswählen und erneut brauen kann...[BR][BR]Auch hier seh ich aktuell echten Nachhol-Bedarf!!![BR][BR][BR][BR]4.) INHALT[BR]Der Hexenkessel ist von seiner Funktionsweise und seinem möglichen Ergebnis recht umfangreich.[BR][BR]Aus dem Blickwinkel eines Kapitel 5 oder 6 Gamers:[BR]Wenn man berücksichtigt, dass man zu Beginn mit diversen \"Aufgaben\" beschäftigt ist ...[BR][BR](Kap. 1: Stadtauf- und Ausbau, Stadt-Planung - Turnier - Kap.3: Turm - Kap. 4: Antike Wunder - [BR]Kap. 5: jetzt: Hexenkessel und dann Kap. 6: dirket die 1. Gastrasse)[BR][BR]... ist der Hexenkessel ohne meinem Punkt 2 und Punkt 3 für \"normal\" Gamer, die nicht jahrelange Erfahrung aus Elvenar (oder vergleichbaren Online-Games) mitbringen oder extrem viel \"Freizeit\" haben, eine enorme Herausforderung.[BR]Auch die benötigten Resourccen für Stadtbau, Kampf oder nun dann Zauberrei (Trank brauen) zu organisieren, dürfte zu Anfang doch etwas viel sein. Vor allem auch vor dem Hintergrund, dass sich die Effekte erst nach diversen Studien-Phasen spürbar bemerkbar machen.[BR]Daher kann ich viele verstehen, dass der Hexenkessel erstmal links liegen gelassen wird.[BR][BR][BR]Aus dem Blickwinkel eines Fortgeschrittenen Gamers:[BR]Ohne meine o.g. Punkte 2+3 wird es auch für diese zumindest eine Herausforderung...[BR][BR]End-Gamer... werden zwar vielleicht auch etwas knobeln müssen, aber da bei diesen die Stadt wesendlich weiter ist und grundsätzlich mehr Zeit für Ausbau, Gastgut-Produktion, etc. benötigt, haben diese auch mehr Zeit für eine Funktion mit diesem Umfang und benötigten Ressourcen.[BR][BR]Fortgeschrittenen Gamer & End-Gamer:[BR]Vor dem Hintergrund, dass sich die Effekte erst nach einigen Studien-Phasen spürbar bemerkbar machen, wird sich jeder selber überlegen, ob und in wie fern die Effekte lohnenswert sind.[BR][BR][BR][BR]A B S C H L I E ß E N D E S   F A Z I T[BR][BR]- Kapitel 18: aktuell (also nach Freischaltung) ein nettes, aber aufwendiges Zusatz-Gimik[BR]- Kleine Kapitel: fraglich, ob sinnvoll nutzbar oder ob es erstmal \"nur mitgeschleift\" wird (also in der Studienphase gelevelt)[BR][BR]- SEHR GUT, dass man es nutzen KANN, aber nicht MUSS[BR][BR]- im Großen und Ganzen ok, aber ausbaufähig...[BR][BR]- zu einem späteren Zeitpunkt: OK ??? - ganz OK ??? - Super ??? ... Wir werden sehen, was die Zeit so bringt."}, {"137": "Romilly schrieb:\t\t\t...die haben immer die gleichen Auswirkungen - nämlich die, die man auch fest verankert in den Files findet...[BR][BR]Spoiler: Auswirkung Zutaten...z.B. Portaleffekt...Anhang 33669 ansehen...Anhang 33670 ansehen...da sind allerdings 2 Werte fehlerhaft - hab ich gemeldet, allerdings weiß ich nicht, ob das korrigiert wird...aber wenn du einen bestimmt Effekt wahrscheinlicher machen willst, dann nimm die Zutaten mit den positiven Werten auf diesen Effekt [smilie--sprite2] - aber beachte, daß diese auch auf andere Effekte positiv wirken können[BR]...es ändert sich halt was an den % (Würfel) wenn eine Zutat durch ein weiteres Diplom auch einen weiteren Effekt auslösen kann...\t\tZum Vergrößern anklicken....Auch für diese Tabelle und die damit verbundene Arbeit vielen Dank, aber leider verstehe ich sie nicht - warum gibt es da Kapitel 1-4? Da gibt es doch den Kessel noch gar nicht? Also sind das wohl nur Platzhalter weil es die anderen Effekte ja erst mit den steigenden Kapiteln gibt.[BR][BR]Dann nehme ich die Zeile Kapitel Feen - da steht das Zeichen für Kampfbooster - nehme ich jetzt ganz oft die blaue Zutat weil die eine 3 hat und bekomme gute Kampfbooster? Nöö, wenn ich nur diese Zutat nehme gibt es Werkzeug - stellt sich mir die Frage: wie sind die Zahlen zu interpretieren? Gibt es eine Legende?"}, {"131": "Da Nu schrieb:\t\t\tAuch für diese Tabelle und die damit verbundene Arbeit vielen Dank, aber leider verstehe ich sie nicht - warum gibt es da Kapitel 1-4? Da gibt es doch den Kessel noch gar nicht? Also sind das wohl nur Platzhalter weil es die anderen Effekte ja erst mit den steigenden Kapiteln gibt.[BR][BR]Dann nehme ich die Zeile Kapitel Feen - da steht das Zeichen für Kampfbooster - nehme ich jetzt ganz oft die blaue Zutat weil die eine 3 hat und bekomme gute Kampfbooster? Nöö, wenn ich nur diese Zutat nehme gibt es Werkzeug - stellt sich mir die Frage: wie sind die Zahlen zu interpretieren? Gibt es eine Legende?\t\tZum Vergrößern anklicken....@Du Na:[BR]Romilly hatte das mal recht anschaulich beschrieben, wie sie diese Werte Addiert um zu einem Grundrezept zu gelangen...[BR][BR]Details siehe hier:[BR]Dieser Thread, Seite 8, Post Nr. 143 vom 10.01.2023"}, {"266": "Da Nu schrieb:\t\t\tnehme ich jetzt ganz oft die blaue Zutat weil die eine 3 hat und bekomme gute Kampfbooster? Nöö, wenn ich nur diese Zutat nehme gibt es Werkzeug\t\tZum Vergrößern anklicken....Dann würde ich annehmen du hast noch nicht genug Forschungskapitel vollständig abgeschlossen. Der Effekt bei Feen (Stärke-Trainingslager) wird erst freigeschaltet wenn du 7 Forschungsdiplome hast."}, {"2": "Ranevle schrieb:\t\t\tWarum sind einige Zahlen kleiner als andere?\t\tZum Vergrößern anklicken.......weil das Eine die mit \"Value\" (Positiv und Negativ) sind und das Andere die mit \"Factor\"...an die tatsächliche Formel wirst du so (mit ner einfachen Chrome-Funktion -->Strg+Shift+i) nicht kommen (und anders ist es verboten) - mich interessiert diese Formel auch gar nicht - mir reicht es zu wissen, was positiv und was negativ ist - und das kann man auch ohne File-Daten herausfinden...[BR][BR]@Da Nu - für jedes voll abgeschlossene Kapitel gibt es ein weiteres Diplom - allerdings nicht genau das Diplom, welches in der Liste mit dem Bild des Kapitels angezeigt wird (auch im Wiki), sondern immer der Reihe nach - besitzt du 8 Diplome, hast du die Effekte von 1-8 (bis Orks) - auch, wenn du eigentlich schon in Kapitel 12 bist...die Darstellung ist nicht optimal (ich habs nur so übernommen und mit 1-4 ergänzt) aber du findest die erreichten Diplome halt im Forschungsbaum neben den Wappen - dort musst du also suchen, wenn die Anzahl deiner Diplome nicht zu deinem Kapitel passt...[BR][BR][IMG]https://i.ibb.co/W0Kbxq8/https-de-forum-elvenar-com-index-php-attachments-diplome-png-33294.png[/IMG][IMG]https://i.ibb.co/bNtFk1P/https-de-forum-elvenar-com-index-php-attachments-diplome2-png-33295.png[/IMG]...hier fehlt z.B. das Diplom von Kapitel 1, der Goldeffekt ist aber trotzdem vorhanden - der von Kapitel 4 dagegen nicht, obwohl das Diplom erreicht wurde - weil halt 4 Minus ein fehlendes nur 3 ergibt...[BR][BR]...erledige einfach alle Forschungen und dann ist es nicht mehr kompliziert ^^....[BR][BR]...wenn du die Wahrscheinlichkeit für den Kasernenbooster erhöhen willst, musst du die Zutat nehmen, die in dieser (3.) Zeile die große blaue 3 hat - also das Schneckenhaus (alternativ Iris, Medusa und/oder Limette - aber die wirken sich halt schwächer aus) - Werkzeug bekommst du damit nicht in der Liste, da bei Werkzeug ja ein Minuswert in der Schneckenhausspalte steht - du musst die Tabelle schon richtig rum lesen....[BR][BR]...und klar - wenn du einen Effekt noch gar nicht freigeschalten hast, dann kann der natürlich nicht im Rezept erscheinen...[BR][BR]...ein Rezeptbuch ergibt in meinen Augen wenig Sinn, da alle Spieler unterschiedliche Wünsche haben und auch jeder irgendwo anders in der Forschung steckt und somit die Erfüllung des genauen Rezeptes an der Anzahl der verfügbaren Hexenpunkte scheitern kann bzw. wenn das mehr werden, hat man ja wieder andere Möglichkeiten und könnte ein besseres Rezept hin bekommen - außerdem werden ja nicht immer die gleichen Zutaten ohne Dias angeboten - man muss hier eigentlich jedes Mal kucken, was man da in den Kessel wirft - aber mit der Zeit wird man wissen, ob da nun noch Salz in der Suppe fehlt, oder halt ein anderes Gewürz...ein Meisterkoch braucht kein Rezeptbuch...und dann ist es halt eine magische Suppe, bei der man nicht weiß, was da am Ende Puff macht und was nicht..."}, {"211": "Romilly schrieb:\t\t\t...interessant ist, daß ich wenn ich alle Zutaten erst 1 x anklicke und dann ein 2. mal, 1771 bezahlen soll, aber wenn ich jedes gleich 2x anklicke bloß... ...1693 - das spart mir also 78 Hexenpunkte...\t\tZum Vergrößern anklicken....Hatte ich beim ersten Überfliegen überlesen ... zwar andere Zahlen, aber ich habe das gerade prinzipiell bei mir reproduzieren können. Hübsch irgendwie, sehr kontraintutiv, irgendwie voll hexenkesselig. Gefällt mir. Macht alles noch komplizierter."}, {"281": "Ranevle schrieb:\t\t\tErstens ist mir nicht gänzlich klar, was mit \"values\" und \"factors\" gemeint ist. Values ist die Anzahl der Zutaten, factors die Wahrscheinlichkeit für einen Effekt?[BR][BR]Zweitens sagt Karvest dort auch:[BR][BR]Die Formel taugt wegen der Normalisierung also nicht für einen Vergleich verschiedener Rezepte.[BR][BR]So interpretiere ich das jedenfalls und es passt zu den Daten, die ich erhoben habe. Und zu meiner Vermutung weiter oben, dass Wurzeln mit Additions- und Subtraktionstermen eine Rolle spielen müssen. Ich grübel daher jetzt schon den halben Tag darüber nach, wie denn eigentlich die Formel der Standardabweichung z. B. im Zweidimensionalen (eigentlich ja 12-Dimensionalen) aussieht und wie ich die umformen muss, um von den Werten für jeweils einmal eine Zutat zu einer globalen Formel zu kommen. Ich komme einfach nicht dahinter, Kopf sperrt sich, ich fühl mich dumm, es ist schwer frustrierend.\t\tZum Vergrößern anklicken....die notwendigen Schritte für die Berechnung findest du hier:[BR]\t\t\thttps://de.forum.elvenar.com/index.php?threads/feedback-zum-hexenkessel.26178/post-419434\t\t[BR]noch als Ergänzung:[BR][BR]- die DevTools öffnest du im Browser (in Firefox und Chrome mit F12, in Edge mit Ctrl+Shift+I )[BR]  jede Zutat hat entweder einen 'value' oder einen 'factor'[BR][BR]- die Formel von Karvest ist nur der erste Teil der Berechnung, den Rest beschreibt er verbal[BR][BR] auf Excel übersetzt schaut's dann so aus[BR]  (Zutaten, values, factors sind jeweils Felder mit 12 Werten):[BR]\t\tCode:\tWertEinEffekt = MAX( 0; SUMMENPRODUKT(Zutaten;values) *POTENZ( 1,1; SUMMENPRODUKT(Zutaten;factors) ) ) [BR]die Ergebnisse (und zwar genau so viele WertEinEffekt wie du Diplome hast) müssen dann addiert werden,[BR]sowie die Erfolgsrate abhänging von der Anzahl der verwendeten Zutaten berechnen:[BR]\t\tCode:\tWertAlleEffekte = SUMME( WertEinEffekt )Erfolgsrate = 0,2 * WURZEL( AnzahlZutaten )[BR]ergibt dann normalisiert für einen Effekt:[BR]\t\tCode:\tWahrscheinlichkeit = WertEinEffekt * Erfolgsrate / WertAlleEffekte[BR]- die Wahrscheinlichkeiten der Effekte sind abhänging von der Anzahl der Diplome, d.h. Rezepte merken oder weitergeben ist nur bedingt sinnvoll"}, {"2": "...jetzt müsste man das nur noch anders rum machen können ^^...."}, {"35": "@Romilly schrieb u.a.:[BR]\"... du findest die erreichten Diplome halt im Forschungsbaum neben den Wappen - dort musst du also suchen, wenn die Anzahl deiner Diplome nicht zu deinem Kapitel passt...\"[BR][BR]DANKE."}, {"10": "Nochmals Feedback:[BR][BR]Heute erfreue ich mich am Zaubertrank-Effekt \"Geschenk der Hohen Wesen\". Satte 20% mehr Rohstoffe der Verbannten für 13 Stunden. Meine Zeitbooster minimieren sich [smilie--sprite1] [BR][BR]KRITIK:[BR]Daneben den Effekt \"Regulärer Händlerappell\" 45% auf reguläre Standartgüter für 5 Stunden[BR]sowie \"Veredeltes Händlergebet\" 36% auf veredelte Erweckte Güter für 4 Stunden.[BR][BR]Es ist wünschenswert, dass die Prozente bei allen Händler-Effekten auf \"Normale Produktion\" UND zumindest auch auf den \"Reliktbonus\" gerechnet wird. Ansonsten ist das wirklich ein Witz. Seht selbst:[BR][BR][IMG]https://i.ibb.co/x8yss7m/https-de-forum-elvenar-com-index-php-attachments-effekt-auf-holzmanu-png-33689.png[/IMG][BR][BR]Dort wünsche ich mir eine Verbesserung [smilie--sprite1]"}, {"2": "Deelfin schrieb:KRITIK:[BR]Daneben den Effekt \"Regulärer Händlerappell\" 45% auf reguläre Standartgüter für 5 Stunden[BR]sowie \"Veredeltes Händlergebet\" 36% auf veredelte Erweckte Güter für 4 Stunden.\t\tZum Vergrößern anklicken.......auf welcher Stufe waren denn diese Effekte?...es hat schon seinen Grund, warum die Gütereffekte bei 40 % starten und bis 238 % hoch gehen und sich andere Effekte nur auf 59,5 % steigern lassen (oder nur 11,90 % max.)...wenn du den Reliktbonus da mit berücksichtigen willst, dann startet der Effekt halt einfach bei 5 % und nicht 40 %...[BR][BR]...kleiner Tipp: wirf nen Zauber drauf - der wirkt auch auf den Trank-Effekt..."}, {"103": "welche Level haben Deine beiden Effekte?"}]