[{"10": "Level 1. Die habe ich nicht gefüttert mit Hexenpunkten, weil ich das am wenigsten benötige.[BR]Ich denke da eher an die Spieler, die noch in den jüngeren Kapiteln stecken.[BR][BR]Beim Effekt \"Geschenk der Hohen Wesen\" habe ich letzte Woche hochgelevelt auf 64 und tatsächlich kam noch mehr heraus, als der Level angibt im Studierzimmer.[BR][BR]Mit dem Zauber - hab ich gemacht, um zu vergleichen. Aber der Effekt wirkt immer noch NUR auf die Normale Produktion.[BR][IMG]https://i.ibb.co/ZxhBJyP/https-de-forum-elvenar-com-index-php-attachments-effekt-auf-holzmanu-zauber-png-33690.png[/IMG] immer noch 491 Holz..."}, {"103": "was erwartest Du dann von einem Level 1 Effekt?[BR]bzw wo soll das dann beim Level 100 Effekt enden ?"}, {"10": "Gut, nun wusste ich nicht, dass \"manche\" Effekte bis zu 238% wirken können.[BR]Das wäre dann beispielsweise ein 100Level bei den Händlereffekten?[BR]Wären an meinem Beispiel oben rund 2500 Güter mehr. Das klingt dann schon besser.[BR][BR]EDIT: nun hab ich auch die Steigerungsraten und -zeiten kapiert mit dem Hochleveln.[BR]Danke, fürs Anschubsen [smilie--sprite1]"}, {"266": "Deelfin schrieb:\t\t\tMit dem Zauber - hab ich gemacht, um zu vergleichen. Aber der Effekt wirkt immer noch NUR auf die Normale Produktion.\t\tZum Vergrößern anklicken....Ja, Zaubertrank wirkt nur auf die normale Produktion. Aber die Verzauberung wirkt auf alles darüber, inklusive des Zaubertrankes. Der Betrag ist dann aber auch unter \"Verzauberungsbonus\" zusammengefasst.[BR]Warte mal, bis der Trankeffekt endet. Dann müsste der Zaubertrankeffekt wegfallen und der Verzauberungsbonus auf etwa +8000 zurückgehen."}, {"203": "[IMG]https://i.ibb.co/qg6Y56D/https-de-forum-elvenar-com-index-php-attachments-kessel-warten-png-33693.png[/IMG][BR][BR]Dieses Bild fehlt auch noch beim Feedback"}, {"279": "lovelymonster schrieb:\t\t\tViel interessanter ist es, zu sehen, wie sich der Kessel einfügt, bei denen, die erst angefangen haben.\t\tZum Vergrößern anklicken....Der Kessel wird erst in Kapitel 4 im Forschungsbaum frei geschaltet."}, {"68": "Summerchind schrieb:\t\t\tDer Kessel wird erst in Kapitel 4 im Forschungsbaum frei geschaltet.\t\tZum Vergrößern anklicken....[BR]Falsch, der ist sofort vorhanden:[BR][BR][IMG]https://i.ibb.co/K7kQGCT/https-de-forum-elvenar-com-index-php-attachments-1674482687360-png-33715.png[/IMG][BR][BR][IMG]https://i.ibb.co/3YSHy92/https-de-forum-elvenar-com-index-php-attachments-1674482724772-png-33716.png[/IMG][BR][BR]aber der Forschungsbaum wird ja nochmals geändert, da der Hexenkessel zur Pflichtforschung wird (siehe Screen aus dem Beta)[BR][BR][IMG]https://i.ibb.co/h8zyqM4/https-de-forum-elvenar-com-index-php-attachments-1674482854718-png-33717.png[/IMG]"}, {"4": "[IMG]https://i.ibb.co/dBhYD62/https-de-forum-elvenar-com-index-php-attachments-1674483713278-png-33718.png[/IMG][BR][BR]Seit heute ist der Hexenkessel Pflichtforschung. Offenbar wird es tatsächlich so, dass der Hexenkessel in die Quests eingearbeitet werden. _ Mist -"}, {"240": "Der Hexenkessel ist bereits hier auch eingebaut - in den neuen Forschungsbäumen ab Kapitel V - bei den älteren weiß ich es nicht, ABER sie mussten auch extra frei geschaltet werden.[BR][BR]Wie sich das ab Kapitel V auswirkt - kann ich Euch echt nicht sagen: [BR]Das Ding habe ich weder im Beta-Forum noch hier begriffen, außer das er am Schluss andauernd zusätzliche Hexenpunkte haben wollte, da ich die freien dann benutzt hatte. Ich selbst - Kapitel Anfang VII inzwischen - werde nicht weiter dazu geben können, weil ich meine Güter und Münzen selbst benötige. Ich habe viele Variationen ausprobiert, brav die freien Hexenpunkte verarbeitet: passiert ist nichts.[BR][BR]ABER - so wie ich es sehe, ist es gerade für die höheren Kapitel nicht schlecht, da man dort jede Menge an überschüssigen Güter usw. los werden kann [smilie--sprite2] und ich werde mich dann erst damit beschäftigen, wenn ich tatsächlich alles im Überfluss habe [smilie--sprite8]"}, {"240": "Salandrine - ich kann nur hoffen und beten, dass wir die Dinger ablehnen können.[BR][BR]Ansonsten sehe ich schwarz für unsere Gemeinschaften, weil viele den Hexenkessel eh nicht verstehen und/oder zu kleine Städte haben, die gar nicht den Überschuss an Gütern und Münzen haben und auch nichts einzahlen wollen.[BR][BR]Wenn wir nicht weiter kommen dürfen, nur weil wir den Hexenkessel nicht bedienen können, dann tut es mir echt leid und werde dann auch die Konsequenzen ziehen müssen. Das habe ich inzwischen auch drüben geäußert und mit mir inzwischen einige andere auch. [BR][BR]Am meisten tut es mir dann um meine beiden lieb-gewonnenen Gemeinschaften leid."}, {"103": "Ihr müsst nur mal Eure Blockade im Kopf lösen, jeder kann den Kessel 1x wöchentlich völlig kostenlos nutzen."}, {"203": "Habe gerade meine Blockade gelöst.... einmal pro Tag wäre besser. So ists mal wieder ein Bsp. für unspielbar."}, {"112": "littleFlex schrieb:\t\t\tjeder kann den Kessel 1x wöchentlich völlig kostenlos nutzen.\t\tZum Vergrößern anklicken....1x Wöchentlich - Ja. kostenlos - Ja. Nutzen? Eher fraglich."}, {"4": "Shania1 schrieb:\t\t\t...[BR][BR]ABER - so wie ich es sehe, ist es gerade für die höheren Kapitel nicht schlecht, da man dort jede Menge an überschüssigen Güter usw. los werden kann [smilie--sprite2] und ich werde mich dann erst damit beschäftigen, wenn ich tatsächlich alles im Überfluss habe [smilie--sprite8]Zum Vergrößern anklicken....Ja, ich bin auch Endgamer und habe viele Waren auf Lager. Es ist nur so, dass in einem neuen Kapitel und auch beim Ausbau von Manufakturen und Wundern sehr sehr viel an Ressourcen gebraucht wird und man dann sehr schnell auf dem Zahnfleisch geht. [BR][BR]Außerdem versorge ich unsere Gilde mit Waren, hilft allen Spielern in der Gilde."}, {"279": "Shania1 schrieb:\t\t\tDer Hexenkessel ist bereits hier auch eingebaut - in den neuen Forschungsbäumen ab Kapitel V - bei den älteren weiß ich es nicht, ABER sie mussten auch extra frei geschaltet werden.[BR][BR]Wie sich das ab Kapitel V auswirkt - kann ich Euch echt nicht sagen:[BR]Das Ding habe ich weder im Beta-Forum noch hier begriffen, außer das er am Schluss andauernd zusätzliche Hexenpunkte haben wollte, da ich die freien dann benutzt hatte. Ich selbst - Kapitel Anfang VII inzwischen - werde nicht weiter dazu geben können, weil ich meine Güter und Münzen selbst benötige. Ich habe viele Variationen ausprobiert, brav die freien Hexenpunkte verarbeitet: passiert ist nichts.\t\tZum Vergrößern anklicken....Der Kessel ist eine \"Sackgasse\". Es passiert nichts wenn man ihn nicht frei schaltet."}, {"2": "Summerchind schrieb:\t\t\tDer Kessel ist eine \"Sackgasse\". Es passiert nichts wenn man ihn nicht frei schaltet.\t\tZum Vergrößern anklicken.......ab dem 2.2. nicht mehr..."}, {"279": "Hm, dann kann ich unter Umständen eine Art Blockade erwischen wenn ich schon weiter bin als Stufe 5? Ich bin aktuell grad bei den Orks."}, {"2": "Summerchind schrieb:\t\t\tHm, dann kann ich unter Umständen eine Art Blockade erwischen wenn ich schon weiter bin als Stufe 5? Ich bin aktuell grad bei den Orks.\t\tZum Vergrößern anklicken.......ja - genau das bedeutet das - die Kesselforschung wird ab dem 2.2. zur Pflicht, d.h. solange diese nicht erforscht ist, werden alle, die dadurch im späteren Verlauf beeinflußt werden, blockiert - im Klartext: du kannst dann in deinem eigentlichen Kapitel nicht mehr weiter forschen..."}, {"17": "Shania1 schrieb:\t\t\tSalandrine - ich kann nur hoffen und beten, dass wir die Dinger ablehnen können.[BR][BR]Ansonsten sehe ich schwarz für unsere Gemeinschaften, weil viele den Hexenkessel eh nicht verstehen und/oder zu kleine Städte haben, die gar nicht den Überschuss an Gütern und Münzen haben und auch nichts einzahlen wollen.[BR][BR]Wenn wir nicht weiter kommen dürfen, nur weil wir den Hexenkessel nicht bedienen können, dann tut es mir echt leid und werde dann auch die Konsequenzen ziehen müssen. Das habe ich inzwischen auch drüben geäußert und mit mir inzwischen einige andere auch.[BR][BR]Am meisten tut es mir dann um meine beiden lieb-gewonnenen Gemeinschaften leid.\t\tZum Vergrößern anklicken....wieso ablehnen? du bekommst jede Woche einen Kelch gratis und Hexenpunkte aufbasis deiner beendeten Forschungen geschenkt.[BR]mit 25 Hexenpunkten kannste den Kessel füllen und trinken das ist völlig kostenlos, und die restlichen Hexenpunkte dann zu Verbesserung einsetzen, du solltest dir keinen Stress machen um bestimmte Effekte zu erhalten das lohnt nicht, zusätzliche Hexenpunkte kaufen lohnt nicht wenn nur das minimum am Kessel spielst und lässt sich auch jeder Zeit nachholen du verpasst nix."}, {"266": "littleFlex schrieb:\t\t\tjeder kann den Kessel 1x wöchentlich [...] nutzen\t\tZum Vergrößern anklicken....[BR]00onkelz77 schrieb:\t\t\teinmal pro Tag wäre besser\t\tZum Vergrößern anklicken....[BR]Wenn man bedenkt, dass die Effekte nach dem Trank brauen immer sofort loslaufen, und so ein Effekt einige Stunden oder einen Tag anhält (weiß nicht wie das auf Level 100 aussieht, aber ne Woche ist die Effektdauer da bestimmt auch nicht), scheint die Begrenzung auf einen Trank pro Woche tatsächlich ziemlich einschränkend. Über die Woche gemittelt ist damit die Auswirkung eines Hexenkessel-Effekts nochmal deutlich geringer.[BR]Naja, ich kann mich nicht beklagen, wer im Kessel komplett auf Kampfstärke geht und dann nur 1x pro Woche während des Effekts kämpft, den stört das nicht - aber das sind die allerwenigsten Spieler, die Elvenar mehr als Optimierungsherausforderung statt als Spiel sehen.[BR][BR]Für den Normalspieler kann ich schon nachvollziehen, dass[BR]bei Investitionen von Materialien, Fragmenten, ggf. Dias der erhaltene Effekt hinter den Erwartungen (in Relation zu den Investitionen) zurück bleibt, oder im schlimmsten Fall gar kein Effekt zustande kommt und man seine Resourcen quasi zum Fenster rausgeworfen hat (was entsprechenden Unmut erzeugt)bei der kostenlosen Nutzung so wenig Effekt rumkommt, dass das Verstehen bzw. Zurechtfinden im Kessel nicht lohnenswert scheint."}]