[{"100": "ob ich jemals die  120 mio  münzen und  12 mip Vorräte wiederbekomm , vom Rezepz  hochrüsten  ... mal schaun . [BR][BR]Bisher reichen meine Fragmente um die mag. Akademie zu füttern .  Dort weiss ich was ich bekomm . [BR]Das Glücksspiel mit kritischen Effekten ist noch nicht meines  . Und dafür 20 k Fragmente ausgeben ....  nö"}, {"2": "schwatzwurzel schrieb:\t\t\tob ich jemals die  120 mio  münzen und  12 mip Vorräte wiederbekomm , vom Rezepz  hochrüsten  ... mal schaun .[BR][BR]Bisher reichen meine Fragmente um die mag. Akademie zu füttern .  Dort weiss ich was ich bekomm .[BR]Das Glücksspiel mit kritischen Effekten ist noch nicht meines  . Und dafür 20 k Fragmente ausgeben ....  nö\t\tZum Vergrößern anklicken.......warum - wie hoch ist denn deine Lagerkapazität?..."}, {"100": "Romilly schrieb:\t\t\t...warum - wie hoch ist denn deine Lagerkapazität?...\t\tZum Vergrößern anklicken....120 mio Münzen und  12 mio vorräte [smilie--sprite2][BR]Es war schon etwas mehr . Beim GA  gabs paar100 % Münzen . [BR][IMG]https://i.ibb.co/87HBnHH/https-de-forum-elvenar-com-index-php-attachments-1674566114035-png-33736.png[/IMG][BR]Ich hab  bisher nur  Überproduktion verbrannt .  Und mehr hab ich nicht vor . [BR]Die kritischen Effekte sind schon interessant , aber dafür fehlen mir ddie Rohstoffe .    Noch ..."}, {"2": "schwatzwurzel schrieb:\t\t\tNoch ...\t\tZum Vergrößern anklicken.......das ist der Punkt - das wird schon noch... Zum Vergleich - ich hab bisher fast 135 Mio Gold reingesteckt - mein Lager hat aber eine Kapazität von 200 Mio und ich hole alle 3 Stunden zwischen 70 und 90 Mio (oder auch mehr) aus meinem Abgrund ab - wie bereits gesagt: der Kessel soll zum Weiterforschen animieren...(dann rumpeln auch die Preise wieder runter - um 1/4 pro neuem Diplom)..."}, {"266": "Romilly schrieb:\t\t\tich hab bisher fast 135 Mio Gold reingesteckt\t\tZum Vergrößern anklicken....Zum Aufleveln in der Studienphase?[BR]Alles zusammengerechnet oder sind 135 Mio die Kosten für den nächsten Tausch gegen Hexenpunkte?"}, {"100": "Romilly schrieb:\t\t\tich hab bisher fast 135 Mio Gold reingesteckt\t\tZum Vergrößern anklicken....für deine guten guten Kesselergebnisse , ist das nicht viel .[BR][BR][IMG]https://i.ibb.co/mCw0zSD/https-de-forum-elvenar-com-index-php-attachments-1674568330035-png-33738.png[/IMG][BR]nur 4 Diplome möglich .   nebenstadt  , turmsturm[BR]Stärke der  Kaserneneinheiten .[BR]2000  Hexenpunkte in den strumpf .[BR]1044  zum brauen .[BR]gut für die schweren fernkämpfer kaserne  . Bei elfen schon gut .[BR]Bei  44,4 % sollte er verlässlich ploppen.[BR]Das ist im moment der plan für die nächsten  monate"}, {"2": "LwennA schrieb:\t\t\tZum Aufleveln in der Studienphase?[BR]Alles zusammengerechnet oder sind 135 Mio die Kosten für den nächsten Tausch gegen Hexenpunkte?\t\tZum Vergrößern anklicken.......alles zusammen - der nächste Kauf liegt bei 4,08 Mio... (ich glaub bei Gold und Werkzeug - hab noch nicht gebraut diese Woche)...[BR][BR]@schwatzwurzel - nee - nicht wegen meinen Kesselergebnissen - für mich sind generell 135 Mio nicht mal eine Lagerfüllung - und mein Lager wird ein paar mal pro Tag voll, wenn ich will..."}, {"211": "RayNiflheim schrieb:\t\t\tauf Excel übersetzt schaut's dann so aus[BR]  (Zutaten, values, factors sind jeweils Felder mit 12 Werten):[BR]\t\tCode:\tWertEinEffekt = MAX( 0; SUMMENPRODUKT(Zutaten;values) *POTENZ( 1,1; SUMMENPRODUKT(Zutaten;factors) ) )Zum Vergrößern anklicken....Vielen Dank für die Step-by-Step-Anleitung. Nur um sicher zu gehen: Mit \"Zutaten\" ist die jeweilige Anzahl der 12 Zutaten gemeint, die man in den Kessel wirft?[BR][BR]Die Stichproben, die ich jetzt gemacht habe, könnten vielleicht schon hinkommen ... falls die Rundungsdifferenz zwischen den Ergebnissen deiner Formel und den im Spiel beobachtbaren Werten eine doch recht große Spannbreite hat. Sieht für mich einigermaßen plausibel aus, hätte mir allerdings gewünscht, dass die Differenzen geringer ausfallen. Möglich vielleicht aber auch, dass ich irgendwo einen falschen Wert reingehauen habe ...[BR][BR]Was mich bei den Stichproben in jedem Fall irritiert hat: Es werden keineswegs die Effekte nach größtem \"Wahrscheinlichkeit\"-Wert gemäß deiner Herleitung ausgewählt, eher scheint es ein Mischmasch aus größtem Value-Summenprodukt und größter Wahrscheinlichkeit zu sein, die zur Auswahl in der Liste im Spiel führt. Gibt's da nähere Ideen zu?[BR][BR]Romilly schrieb:\t\t\tmich interessiert diese Formel auch gar nicht\t\tZum Vergrößern anklicken....Nein? Warum dann die folgende Bemerkung?[BR]Romilly schrieb:\t\t\t...jetzt müsste man das nur noch anders rum machen können ^^....\t\tZum Vergrößern anklicken....Euch ist aufgefallen, dass die ersten 12 Effekte immer die selbe Reihenfolge der Value-Factor-Werte in der von dir gegebenen Tabelle haben? Nur die Anfangsposition ist unterschieden, alle 12 möglichen Anordnungen dieser selben Reihenfolge werden realisiert, etwas durcheinandergemixt allerdings. Bei den folgenden Effekten ist das Muster anders im Verhältnis zu den ersten 12 Effekten, aber untereinander wieder die selbe Folge, nur wieder andere Anfangspositionen.[BR][BR]Das hieße doch, dass wir uns eigentlich bloß die Optima für ein bis fünf Effekte bei 3, 2, 1, 1, 0 im Value und 2, 1, 0, -1, -2 im Factor vergegenwärtigen müssten - und danach halt rausfischen, welche Zutaten die realisieren, oder? Wäre eine deutliche Komplexitätsreduktion der Aufgabenstellung. Oder stehe ich auch da wieder auf dem Schlauch?[BR][BR]Im Spielchat gab's übrigens zu der Differenz der Hexenpunkte-Kosten je nach Reihenfolge des Reinwerfens der Zutaten die Vermutung, dass teurere Rezepte ja aber vielleicht zu besseren Real-Ergebnissen führen könnten, es mit anderen Worten noch versteckte Variablen gibt, wenn das Ganze in den Zufallsgenerator geht. Den Verdacht hatte ich in Bezug auf den Turm schon immer, finde ich daher naheliegend ... und er führt dann zu der Frage, ob eine Formel mit den unversteckten Variablen eigentlich irgendwas taugen würde, selbst wenn man die jetzt hätte. Gibt's da irgendein klares Wissen, dass es keine weiteren versteckten Variablen gibt, die Eingang in die Zufallskomponenten des Spiels finden? Oder umgekehrt: Gibt's Wissen, dass dem definitiv so ist?"}, {"266": "schwatzwurzel schrieb:\t\t\t1044 zum brauen\t\tZum Vergrößern anklicken....Wenn du die 5x Fliegende Iris zuerst in den Topf legst und erst danach die anderen 3 einzelnen Zutaten sollte es sogar nur 977 Hexenpunkte kosten.[BR][BR]Und wenn du auf den Münzeffekt verzichten kannst, probier mal folgendes Rezept, sollte günstiger sein und bei 4 Diplomen hohe Wahrscheinlichkeit für Kasernen-Stärke (wenn ich mich nicht vertan habe):[BR]2x Fliegende Iris[BR]2x Nachtschattenblüte[BR]2x Wolkenwolle-Knospe[BR]1x Käfernuss[BR]1x Ei der Medusa[BR]1x Augensprossen[BR](in dieser Reihenfolge, damit es am billigsten wird)[BR][BR]schwatzwurzel schrieb:\t\t\tDas ist im moment der plan für die nächsten monate\t\tZum Vergrößern anklicken....Naja, das Rezept ist vermutlich nicht jede Woche anwendbar, weil ja die Zutaten wechseln für die man Dias braucht."}, {"17": "schwatzwurzel schrieb:\t\t\t120 mio Münzen und  12 mio vorräte [smilie--sprite2][BR]Es war schon etwas mehr . Beim GA  gabs paar100 % Münzen .[BR]Anhang 33736 ansehen[BR]Ich hab  bisher nur  Überproduktion verbrannt .  Und mehr hab ich nicht vor .[BR]Die kritischen Effekte sind schon interessant , aber dafür fehlen mir ddie Rohstoffe .    Noch ...\t\tZum Vergrößern anklicken....[IMG]https://i.ibb.co/nfV529K/https-de-forum-elvenar-com-index-php-attachments-1674630809618-png-33762.png[/IMG][BR]naja die ersten stufen kosten doch nix, und bis Stufe 50 kannste locker und schnell ausbauen,[BR]ob es sich je lohnt überhaupt eins auf 100 zu bringen bezweifle ich bei 90 sollte man einfach aufhören.[BR]Mehr als auf 100 wird schon echt grenzwertig teuer."}, {"2": "Ranevle schrieb:\t\t\tNein? Warum dann die folgende Bemerkung?\t\tZum Vergrößern anklicken.......nochmal - mir bringt diese Formel nichts, da ich gar nicht beabsichtige, einen einzelnen Effekt auf eine möglichst hohe Wahrscheinlichkeit zu bekommen - ich möchte mit jedem Trank 5 verschiedene Effekte am Laufen haben und dabei sollte natürlich mein Lieblingseffekt (Werkzeuge) möglichst weit oben sein - aber halt eben auch andere Effekte eine gute Chance haben - das sind dann aber eben nur %-Werte von ungefähr jeweils 15-20 % - die Effekte, mit denen ich dagegen kaum was anfangen kann (Portal bringt mir momentan gar nichts), möchte ich dafür am Besten ganz aus den Möglichkeiten draußen haben, d.h. ich brauche ein Rezept, welches meine Lieblingseffekte möglichst weit oben hat bzw. bei dem unbeliebte Effekte komplett raus fallen und dabei hilft mir diese Formel (oder auch das, was Karvest nun gebastelt hat) rein gar nichts - und die genauen % interessieren mich dabei nicht - wenn ich die wissen möchte, dann klick ich einfach die für mich \"guten\" Zutaten an und dann seh ich doch, wie die Verteilung ist (und kann das dann selbst kalibrieren, indem ich anders auswähle) - nochmal dazu, wie das alles zusammenhängt - auf jeden Effekt haben 4 Zutaten einen positiven Wert mit einer ganzen Zahl von 1-3, 3 Zutaten haben einen negativen Effekt mit einer ganzen Zahl (entweder -1 oder -2) und dazu gibt es noch weitere 5 Zutaten, die sich dann in einer Potenz auswirken (geringfügiger) - 3 positive und 2 negative - jeder Effekt erhält nun durch die verwendeten Zutaten eine gewisse Zahl an \"Anteilen\" bzw. falls das Ergebnis negativ ist, tauchen sie nicht in der Rezeptliste auf - alle positiven Anteile werden dann summiert und wenn man dann die Erfolgsrate durch diese Summe teilt, dann bekommt man den %-Wert 1 Anteils und kann das wiederum auf jeden Effekt umrechnen (hier wird ein wenig gerundet)...(das ist das, was die Formel macht)...[BR][BR]...so genau muss das aber doch gar nicht sein und manche Effekte \"beißen sich\" da auch gegenseitig und dann gibt es halt auch jede Woche andere Zutaten nur gegen Diamanten - meine genaue \"Wunschliste\" bzw. die reale Erfüllung dieser, ändert sich also jede Woche - ich muss mich entscheiden, was ich priorisiere - ich muss jede Woche anders kalibrieren - und selbst wenn es hierfür auch mal ein \"Programm\" geben würde, wäre ich wahrscheinlich trotzdem schneller, wenn ich nach meinen eigenen Erfahrungen handle, als wie wenn ich alle relevanten Gegebenheiten erst irgendwo eintippen müsste - das ist einfach nur Erfahrungssache....[BR]Ranevle schrieb:\t\t\tEuch ist aufgefallen, dass die ersten 12 Effekte immer die selbe Reihenfolge der Value-Factor-Werte in der von dir gegebenen Tabelle haben? Nur die Anfangsposition ist unterschieden, alle 12 möglichen Anordnungen dieser selben Reihenfolge werden realisiert, etwas durcheinandergemixt allerdings. Bei den folgenden Effekten ist das Muster anders im Verhältnis zu den ersten 12 Effekten, aber untereinander wieder die selbe Folge, nur wieder andere Anfangspositionen.\t\tZum Vergrößern anklicken....[BR]...ja - das war mir 2 Stunden nach Start schon bekannt - hab ja auch geschrieben, daß da ein Schema erkennbar ist (sieht man ja auch schön an meiner quietschbunten Tabelle)...[BR][IMG]https://i.ibb.co/0cCCDGz/https-de-forum-elvenar-com-index-php-attachments-zutaten6-png-33670.png[/IMG]...hier sind allerdings 2 Werte im Spiel anders - einmal bei Gut3 und dem Ohrentrüffel sind es -2 anstelle der -1 (factor) aus meiner Tabelle und bei den Orks sind es bei den Augensprossen anstelle von -1 value (ganzer Wert) -1 factor im Spiel...(das wurde mittlerweile auch auf Beta gemeldet - vielleicht wird es ja doch mal geändert)...[BR][BR]...also ja - alles, was ein + bei den gewünschten und/oder ein - bei den ungewünschten Effekten hat, ist \"gut\"[BR]....und alles, was ein - bei den gewünschten und/oder ein + bei den ungewünschten Effekten hat, ist \"schlecht\"[BR][BR]...deshalb hatte ich mir ja eine kleine Hilfe ausgedacht, um mal ein auf mich zugeschnittenes Grundrezept zu bekommen...(aber das wird nicht immer gleich bleiben und ich werde auch nicht immer die gleichen \"guten\" Zutaten verwenden können (Dias)...[BR][BR]Romilly schrieb:\t\t\t...schon wieder ich  [smilie--sprite2]  - ich hab mir mit meiner Zutatentabelle eine Rezepthilfe gebastelt und erzähl mal schnell, wie das funktioniert (da warten schon viele ingame drauf)...[BR][BR]Anhang 33335 ansehen[BR]...jede Zutat bewirkt einzeln verwendet verschiedene Effekte, die man in einer Tabelle gliedern und so den Effekten zuordnen kann...[BR][BR]...dabei ergeben sich dann für jeden Effekt 4 positive Werte -> 3, 2, 1, 1, die erst immer von 4 Zutaten in Reihenfolge ausgelöst werden und dann mit je 1 Zutat dazwischen... hab ich ganz am Anfang mal gezeigt - gemeint sind hier die großen fetten Werte 3 (blau), 2 (grün) und 1 (gelb)[BR]...zusätzlich kann man in den Files noch weitere Werte auslesen - auch negative (die aber mit einer einzelnen Zutat nicht erscheinen)...[BR][BR]...durch zahlreiche Tests hab ich festgestellt, daß es jeweils 3 negative Werte gibt, die einen positiven Wert komplett negieren können mit den Werten -1 (dunkelgelb) und -2 (orange) - zusätzlich gibt es noch weitere positive und negative Werte, die aber nicht als ganze Zahl gewertet werden, sondern nur als Bruchzahl - wie genau, hab ich aber nicht rausgefunden...[BR][BR]...um trotzdem eine Hilfe zu bekommen, wie man da was kombinieren kann, um % zu stärken oder zu schwächen hab ich mir etwas überlegt - das in der Mitte...[BR][BR]zuerst hab ich mir mal überlegt, welche Effekte ich gerne hätte (6 Stück) und welche ich lieber nicht aktiviert haben will (ebenfalls 6 Stück) - die übrigen 8 (ich hab in Fely alle 20) sind somit \"neutral\"[BR][BR]...jetzt hab ich in der Hilfe für jeden gewollten Effekt (+) bei einem positiven ganzen Wert und für jeden ungewollten Effekt (-) mit einem negativen ganzen Wert jeweils das entsprechende Bildchen der verwendeten Zutat verteilt und diese dann darunter in der 1. Zahlenreihe zusammengezählt - hier sieht man gleich, daß der \"Schnuller\" (Spottzungen) ganz gut zu meiner Auswahl passt (hat 6 Treffer)[BR][BR]...ebenso hab ich in der Hilfe für jeden ungewollten Effekt (-) mit einem positiven kompletten Wert ein X verteilt (dickes rotes X für 3, rotes X für 2, schwarzes X für 1 positiven Wert, den ich nicht haben will) und ebenfalls die Anzahl der X erfasst (2. Zahlenreihe)[BR][BR]...in den nächsten beiden Reihen hab ich das Ganze nochmal mit den tatsächlichen Werten gerechnet und dann voneinander subtrahiert...[BR][BR](die / würden sich geringfügig positiv auf meine Wünsche auswirken - hab ich mal als Zusatz eingefügt, aber nicht mit gerechnet)[BR][BR]...so hab ich 1 Zutat ermittelt, die sehr gut zu meinen Wünschen passt - der \"Schnuller\" (Spottzungen)[BR]...und 3, die ich wohl lieber nicht verwenden sollte... Ei der Medusa, \"Glubschaugen\" (Augensprossen) und den \"Blumenkohl\" (Wolkenwolle-Knospe - kann mir die Namen nicht merken ^^)[BR][BR]...grummel grummel - hab gesehen, daß beim Trainings-Herz ein X bei der Medusa fehlt - zum Glück hab ich die schon aussortiert...[BR][BR]...also hab ich mal einfach diese Zutaten jeweils 1 x in den Kessel geworfen und gekuckt, was dieses Grundrezept bringt...[BR][BR]Anhang 33345 ansehenAnhang 33346 ansehenAnhang 33347 ansehenAnhang 33348 ansehen...leider müsste ich dafür auch Dia-Zutaten verwenden, was ich nicht möchte - aber grundsätzlich haben alle 6 Wunscheffekte \"gute\" % bekommen und 2 von den nicht gewollten sind ganz raus gefallen und die anderen recht weit unten - das Grundrezept würde also ganz gut funktionieren, wenn da nicht die Dias wären (außerdem hätte ich auch gerne eine höhere Erfolgsrate --> 80 % - dazu brauche ich 16 Zutaten, nicht bloß 9...[BR][BR]...also muss ich wohl die mit den Dias weglassen und werfe gleich mal alle übrigen 2x in den Topf...[BR][BR]Anhang 33336 ansehenAnhang 33337 ansehenAnhang 33338 ansehenAnhang 33339 ansehen...sieht auch gar nicht so schlecht aus, aber die ungewollten (rot) sind mir zu hoch - die muss ich mit den 2 fehlenden Zutaten noch irgendwie drücken bzw. 2 gewünschte Effekte (grün) nach oben schieben...[BR][BR]...interessant ist, daß ich wenn ich alle Zutaten erst 1 x anklicke und dann ein 2. mal, 1771 bezahlen soll, aber wenn ich jedes gleich 2x anklicke bloß...Anhang 33340 ansehen...1693 - das spart mir also 78 Hexenpunkte...\t\tZum Vergrößern anklicken...."}, {"94": "Huhu, heute hab ich gebraut nach dem gleichen Schema wie ich hier zuvor schon gepostet hab.[BR]Das ist das gleiche Bild, hier sind aber noch nicht die 5000 Fragmente drin... ich dache ich pack die mal rein, vielleicht bringt es was.[BR][IMG]https://i.ibb.co/8NjxVfN/https-de-forum-elvenar-com-index-php-attachments-screenshot-50-png-33653.png[/IMG] [BR]... und das hab ich bekommen[BR][IMG]https://i.ibb.co/ZNwqxxq/https-de-forum-elvenar-com-index-php-attachments-screenshot-52-png-33805.png[/IMG][BR]Was soll man dazu noch sagen !?[BR]47% Chance auf Söldner Schaden und das Ergebnis 3x Rotz und 2x Nieten, wie kann überhaupt eine Niete bei 47% möglich sein?[BR]Es lebe das RNG, Hauptsache der Trank ist auf Stufe 81 [BR][BR]Also tut mir leid aber ich sehe in diesem Feature 0 Strategie nur Lotto."}, {"2": "Romilly schrieb:\t\t\t...nochmal - mir bringt diese Formel nichts, da ich gar nicht beabsichtige, einen einzelnen Effekt auf eine möglichst hohe Wahrscheinlichkeit zu bekommen - ich möchte mit jedem Trank 5 verschiedene Effekte am Laufen haben und dabei sollte natürlich mein Lieblingseffekt (Werkzeuge) möglichst weit oben sein - aber halt eben auch andere Effekte eine gute Chance haben - das sind dann aber eben nur %-Werte von ungefähr jeweils 15-20 %\t\tZum Vergrößern anklicken....[BR]Romilly schrieb:\t\t\tund dann ist es halt eine magische Suppe, bei der man nicht weiß, was da am Ende Puff macht und was nicht...\t\tZum Vergrößern anklicken...."}, {"282": "Ich habe ein kleines Problem! [BR][BR]Ich habe hier im Forum schon viel über den \"kritischen Effekt\" gelesen, konnte das alles mit meinem ausgelösten kritischen Effekt aber nicht bestätigen (z.B. längere Dauer o.ä.). Ich glaube jedenfalls, dass es ein kritischer Effekt war! [BR]Also habe ich scheinbar irgendetwas doch nicht richtig verstanden.  [smilie--sprite11] [BR][BR]Denn eines findet man nirgendwo - weder hier noch im Wiki: nämlich eine klare Definition, was ein \"kritischer Effekt\" ist. [smilie--sprite3][BR]Welchen Effekt wird es betreffen? Wie wirkt es sich auf den betreffenden Effekt aus? Wie erkennt man ihn? [BR][BR]Wenn ihr mir diese 3 Fragen schonmal beantworten könntet, wären meine GM und ich euch sehr dankbar!!! [smilie--sprite1]"}, {"2": "Chris1801 schrieb:\t\t\tIch habe ein kleines Problem![BR][BR]Ich habe hier im Forum schon viel über den \"kritischen Effekt\" gelesen, konnte das alles mit meinem ausgelösten kritischen Effekt aber nicht bestätigen (z.B. längere Dauer o.ä.). Ich glaube jedenfalls, dass es ein kritischer Effekt war![BR]Also habe ich scheinbar irgendetwas doch nicht richtig verstanden.  [smilie--sprite11][BR][BR]Denn eines findet man nirgendwo - weder hier noch im Wiki: nämlich eine klare Definition, was ein \"kritischer Effekt\" ist. [smilie--sprite3][BR]Welchen Effekt wird es betreffen? Wie wirkt es sich auf den betreffenden Effekt aus? Wie erkennt man ihn?[BR][BR]Wenn ihr mir diese 3 Fragen schonmal beantworten könntet, wären meine GM und ich euch sehr dankbar!!! [smilie--sprite1]Zum Vergrößern anklicken........wenn du tatsächlich einen kritischen Effekt ausgelöst hast, dann steht das auch dabei (im Fenster)...[BR][BR][IMG]https://i.ibb.co/JvztXMr/https-de-forum-elvenar-com-index-php-attachments-k5-png-33584.png[/IMG]<--normal / kritisch-->[IMG]https://i.ibb.co/NsBMCtZ/https-de-forum-elvenar-com-index-php-attachments-k6-png-33585.png[/IMG]"}, {"282": "Romilly schrieb:\t\t\t....wenn du tatsächlich einen kritischen Effekt ausgelöst hast, dann steht das auch dabei (im Fenster)...[BR][BR][IMG]https://i.ibb.co/JvztXMr/https-de-forum-elvenar-com-index-php-attachments-k5-png-33584.png[/IMG] <--normal / kritisch--> \t\t\t\t\t\t\t\t\t\t\t\t\t[IMG]https://i.ibb.co/NsBMCtZ/https-de-forum-elvenar-com-index-php-attachments-k6-png-33585.png[/IMG]Zum Vergrößern anklicken....Ja, hatte ich 2 Kelche in Folge! Dann habe ich ihn doch richtig erkannt! [smilie--sprite8][BR]Leider hatte ich beide kritische Effekte mit dem gleichen (bereits vorher aktiven) Bonus, aber keiner von beiden war dermaßen in Wirkung oder Dauer verstärkt.[BR]Na ja! Vielleicht habe ich auch irgendwas übersehen. Ich werde beim nächsten mal genauer darauf achten!  [smilie--sprite11] [BR][BR]Aber danke für deine Hilfe! [smilie--sprite1]"}, {"2": "Chris1801 schrieb:\t\t\tJa, hatte ich 2 Kelche in Folge! Dann habe ich ihn doch richtig erkannt! [smilie--sprite8][BR]Leider hatte ich beide kritische Effekte mit dem gleichen (bereits vorher aktiven) Bonus, aber keiner von beiden war dermaßen in Wirkung oder Dauer verstärkt.[BR]Na ja! Vielleicht habe ich auch irgendwas übersehen. Ich werde beim nächsten mal genauer darauf achten!  [smilie--sprite11][BR][BR]Aber danke für deine Hilfe! [smilie--sprite1]Zum Vergrößern anklicken.......so eine hohe Wirkung wie bei mir bekommst du auch nur, wenn du die max. Anzahl von Fragmenten/Dias beigefügt hattest...bei 5.000 Fragmenten fällt der Effekt nicht viel höher aus als der normale Höchstwert..."}, {"282": "Romilly schrieb:\t\t\t...so eine hohe Wirkung wie bei mir bekommst du auch nur, wenn du die max. Anzahl von Fragmenten/Dias beigefügt hattest...bei 5.000 Fragmenten fällt der Effekt nicht viel höher aus als der normale Höchstwert...\t\tZum Vergrößern anklicken....Bei mir waren's 15.000 Fragmente.  [smilie--sprite2] [BR]Während ich Fragmente hinzufüge, ändern sich Dauer und/oder Wirkung oben rechts in der Liste der Effekte.[BR]Ist das dann eine Vorschau auf die Auswirkung eines kritischen Effekts? [smilie--sprite8]"}, {"2": "Chris1801 schrieb:\t\t\tBei mir waren's 15.000 Fragmente.  [smilie--sprite2][BR]Während ich Fragmente hinzufüge, ändern sich Dauer und/oder Wirkung oben rechts in der Liste der Effekte.[BR]Ist das dann eine Vorschau auf die Auswirkung eines kritischen Effekts? [smilie--sprite8]Zum Vergrößern anklicken.......ja - bei einem kritischen Effekt kannst du (soweit ich das beobachtet habe) mit dem exakten Höchstwert aus dem Rezept rechnen und einer höheren Laufzeit (ca. x 1,5)...du kannst dann aber auch mit einem normalen Treffer höhere Werte als die erforschten (aufgelevelten) erzielen...[BR][BR]Spoiler: Auswirkung Fragmente[IMG]https://i.ibb.co/b15BNn6/https-de-forum-elvenar-com-index-php-attachments-fragmente3-png-33315.png[/IMG]"}, {"282": "Vielen Dank! Jetzt kriege ich langsam den Durchblick!  [smilie--sprite8] [smilie--sprite6]"}]