[{"283": "also bei aller Liebe zum Spiel, das Dinge ist für die Tonne, ich werde es weiterhin ignorieren!! 4% mehr Kampfkraft? Ja ne is Klar. Zum 2. was die kleineren da rein buttern sollen, steht für mich in keinem Verhältnis. Der Turm mit seinem übermäßigen Portalssegen geht ja schon vielen auf gewisse Körperteile, aber das Dingen schießt den Bock ab. Also wundert euch nicht wenn noch mehr aufhören, es war mal ein wirklich schönes entspanntes spielen, das vermissen einige und des gleichen vermisse ich auch einige."}, {"17": "huebi26 schrieb:also bei aller Liebe zum Spiel, das Dinge ist für die Tonne, ich werde es weiterhin ignorieren!! 4% mehr Kampfkraft? Ja ne is Klar. Zum 2. was die kleineren da rein buttern sollen, steht für mich in keinem Verhältnis. Der Turm mit seinem übermäßigen Portalssegen geht ja schon vielen auf gewisse Körperteile, aber das Dingen schießt den Bock ab. Also wundert euch nicht wenn noch mehr aufhören, es war mal ein wirklich schönes entspanntes spielen, das vermissen einige und des gleichen vermisse ich auch einige.Zum Vergrößern anklicken....1. Portalsegen kannste nie genug haben, im Kapital 19 und 20 ist es schon fast zwanghaft die zu nutzen sonnst kommste garnicht vorwärts[BR]2. \"in keinem Verhältnis\" gibt soviele Stellen im Spiel wo du das anbringen könntest, aber dann lass mal bedenken das die Preise sich sonst nur als Geschenk an fühlen und nicht erarbeitet.[BR]3. steck halt paar Punkte in Kampfkraft dann sinds ratz fast 15-20% ohne groß Kosten."}, {"99": "Men größtes Problem mit dem Kessel. Ich habe einfach keine Lust, stundenlang irgendwelche Anleitungen zu studieren, um das Teil wirklich vollkommen zu verstehen.[BR]Nach lesen des Wiki hab ich da wohl so ca. 25% verstanden. [BR][BR]Das ist jetzt auch keine Kritik. Nur wirklich offenes Feedback. Ich weiß ja, dass es genügend Leute gibt, die Spaß daran haben, das Teil zu testen, mathematische Formeln draufzulegen oder ellenlange Exceltabellen zu stricken.[BR]Denen sei es auch herzlich gegönnt.[BR][BR]Ich habe da aber leider wirklich keine Lust zu, denn ich muss beruflich schon mein Hirn in diverse Richtungen schicken.[BR]Ich bin wohl auch nicht allein. Resonanz von den Mitglieder meiner Gemeinschaft sieht ähnlich aus.[BR][BR]Aber ist vollkommen i.O. Ist ja schön, dass so vieles Unterschiedliches angeboten wird."}, {"17": "FrauRossi schrieb:\t\t\tMen größtes Problem mit dem Kessel. Ich habe einfach keine Lust, stundenlang irgendwelche Anleitungen zu studieren, um das Teil wirklich vollkommen zu verstehen.[BR]Nach lesen des Wiki hab ich da wohl so ca. 25% verstanden.[BR][BR]Das ist jetzt auch keine Kritik. Nur wirklich offenes Feedback. Ich weiß ja, dass es genügend Leute gibt, die Spaß daran haben, das Teil zu testen, mathematische Formeln draufzulegen oder ellenlange Exceltabellen zu stricken.[BR]Denen sei es auch herzlich gegönnt.[BR][BR]Ich habe da aber leider wirklich keine Lust zu, denn ich muss beruflich schon mein Hirn in diverse Richtungen schicken.[BR]Ich bin wohl auch nicht allein. Resonanz von den Mitglieder meiner Gemeinschaft sieht ähnlich aus.[BR][BR]Aber ist vollkommen i.O. Ist ja schön, dass so vieles Unterschiedliches angeboten wird.\t\tZum Vergrößern anklicken....dann gibs nur 2 Varianten, von allen Zutaten die frei sind gleichmäßig rein, vielleicht noch 1000 Fragmente (Chance für krit schein höher als es dran steht) und trinken oder nur eine Zutat rein und mit den Restpunkten Effekte verstärken."}, {"2": "...also so schlecht finde ich den Manu-Effekt nicht - ich hatte den auf Lvl 40 stehen und mit einem kritischen (50 % Chance) getroffen...[BR][BR][IMG]https://i.ibb.co/cNzDW05/https-de-forum-elvenar-com-index-php-attachments-versuch5-png-33865.png[/IMG]...das macht ca. 1/4 der Produktion aus...[IMG]https://i.ibb.co/KVJP4f2/https-de-forum-elvenar-com-index-php-attachments-g-ter2-png-33862.png[/IMG][BR]...mit gestärkter FF verzaubert wird daraus...[IMG]https://i.ibb.co/YX1LJcY/https-de-forum-elvenar-com-index-php-attachments-g-ter4-png-33864.png[/IMG][IMG]https://i.ibb.co/bNw7YxX/https-de-forum-elvenar-com-index-php-attachments-g-ter3-png-33863.png[/IMG][BR]...wobei 1.679 aus dem Verzauberungsbonus auf den Trank-Effekt entfallen - also zusammen 4334+1679=6.013...[BR][BR]...fällt jetzt bei mir nicht ins Gewicht, da ich jeden Tag über 3 Millionen Gut1 einkaufe, aber für erleuchtete Güter wäre das bei akutem Bedarf ein nettes Plus (spart Unurium) - vor allem, wenn ich dann auch noch den Sturmphönix + Zeitsegen einsetze..."}, {"14": "das ist jetzt der reguläre Händlerapell gewesen:[BR][BR][IMG]https://i.ibb.co/mFYzfzG/https-de-forum-elvenar-com-index-php-attachments-screenshot-2-png-33868.png[/IMG][BR][BR]um aber z.B. erweckte Güter zu pushen, würde man Händlergebete brauchen[BR][BR][IMG]https://i.ibb.co/PtsKmm7/https-de-forum-elvenar-com-index-php-attachments-screenshot-1-png-33867.png[/IMG][BR][BR]im Prinzip müsste man[BR] a) das Gewünschte jeweils auf hohe Sterne leveln[BR]und b) dann für genau dies eine hohe Wahrscheinlichkeit durch Zutaten einstellen und gleichzeitig noch etliches für kritische Effekte mit reintun (entweder gleich Dias oder sehr viele Fragmente)[BR][BR]ja, der Effekt ist nicht schlecht[BR]und man kann sicherlich 2-3 Booster hochleveln mit Gütern(Münzen/Werkzeug welches man im Überfluss hat[BR][BR]aber wenn man anfängt irgendetwas an Boostern zu leveln um letztlich einen Gewinn rauszuholen, muss man sich überlegen, ob es das Leeren des Lagers am Ende auch wieder so viele Güter reinbringt, die man vorher ausgibt[BR]auf lange Sicht vielleicht..[BR]aber andererseits: wer hat schon so viel, dass er wirklich alle relevanten Boosts auch so hoch bekommt, dass sie sich wirklich rentieren?[BR]was sie doch eigentlich nur mit einem kritischen Effekt tun?[BR][BR]klar, ich bin jetzt auch kein hoher Spieler, aber mir ist das irgendwie reichlich teuer für das, was man erhält unter \"normalen\" Voraussetzungen ohne da ziemlichen Zusatz für den kritischen Effekt noch reinzupacken[BR][BR]und viele Booster leveln geht irgendwie auch schlecht, wer hat so viel Überschuss?[BR][BR]dann kommt noch dazu, dass es gerade bei einem \"frühen Kessel\" auch noch reichlich viel höher startet..[BR]wohl damit man in der \"Lebzeit\" des Acc nicht nebenbei viel einsackt an Mehrweit bei Boostern?[BR][BR]also, bei mir halten sich die Effekte echt in Grenzen[BR][BR]vermutlich weil ich keine kritischen Effekte erzielen (kann): ich bin schon froh, wenn meine Zauberpunkte so viele Zutaten zulassen, dass ich knapp über 50% Wahrscheinlichkeit des gesamtes Trankes komme[BR]und leider wird es dann ja oft nicht das gewünschte, sondern irgendwas, was nur 1 Stern hat[BR][BR]für mich sind das zu viele Möglichkeiten, was rauskommen kann (auch wenn ich durch die Wahl der Zutaten wieder was rausschmeißen kann, oder deren Wahrscheinlichkeit runterdrücken kann)[BR][BR]am einfachsten geht es in meiner Kapitel V- Stadt:[BR]dort kann ich durch 2,3 Zutaten tatsächlich nur eins pushen und alles andere eliminieren, und es bleibt nur die magische Steuererhöhung übrig[BR](mit Kapitel V hat man genau 5 mögliche Effekte)..[BR][BR]später werden es einfach zu viele, zumindest empfinde ich das so[BR](nicht, dass ich die Möglichkeit mir meins aussuchen aus einem großen Pool schlecht finde, aber es tauchen defintiv viel zu viele Möglichkeiten im Kessel auf, wovon die meisten doch so gut wie nichts bringen[BR][BR]kann man das nicht irgendwie so einstellen, dass nur 5 auftauchen, die man dann auch noch teils wegstreichen könnte durch passende Zutaten?[BR](da meine ich jetzt als Kesseländerung?)[BR][BR][BR]klar, kann ich jetzt durch passende Zutaten welche pushen, andere runterdrücken..[BR]aber je mehr verschiedene Zutaten umso mehr neue Effekte  tauchen dann wiederum auf..[BR]und die teilen sich ja die Wahrscheinlichkeit des Auftretens der Booster im Trank mit den anderen[BR](oder hab ich da was falsch verstanden?)"}, {"2": "Neris schrieb:\t\t\taber wenn man anfängt irgendetwas an Boostern zu leveln um letztlich einen Gewinn rauszuholen, muss man sich überlegen, ob es das Leeren des Lagers am Ende auch wieder so viele Güter reinbringt, die man vorher ausgibt\t\tZum Vergrößern anklicken.......ich geb normale Güter (die sich bei mir vermehren wie die Karnickel) für mehr Sterne aus und bekomme dafür mehr erleuchtete, bei denen ich das (teilweise) rare Unurium einspare...[BR][BR]...und nie vergessen - Spieler in den hohen Kapiteln müssen sich generell \"mit anderen Dingen herumschlagen\" als Spieler in niedrigeren Kapiteln...du bist von meinem Stand nicht nur mehrere Kapitel sondern auch mehrere Jahre entfernt - das geht nicht von heute auf morgen...[BR][BR]...der Kessel ist ein weiterer Baustein in der Flexibilität...[BR][BR]Neris schrieb:\t\t\tam einfachsten geht es in meiner Kapitel V- Stadt:[BR]dort kann ich durch 2,3 Zutaten tatsächlich nur eins pushen und alles andere eliminieren, und es bleibt nur die magische Steuererhöhung übrig[BR](mit Kapitel V hat man genau 5 mögliche Effekte)..\t\tZum Vergrößern anklicken.......die hat nur 4 Effekte - oder bist du schon fertig mit dem 5er Diplom?[BR][BR]Neris schrieb:\t\t\tklar, kann ich jetzt durch passende Zutaten welche pushen, andere runterdrücken..[BR]aber je mehr verschiedene Zutaten umso mehr neue Effekte tauchen dann wiederum auf..[BR]und die teilen sich ja die Wahrscheinlichkeit des Auftretens der Booster im Trank mit den anderen[BR](oder hab ich da was falsch verstanden?)\t\tZum Vergrößern anklicken.......insgesamt kommst du mit allen auftauchenden Effekten zusammen immer auf die % der Erfolgsrate...[BR][BR]...ja - das Ganze ist eine gewisse Glückssache und man kann sich da jetzt schwarz ärgern, weil man immer Pech hat oder hoffen, auch mal Glück zu haben und sich dann umso mehr darüber freuen - bis dahin versuche ich einfach, aus jedem ausgelösten Effekt etwas zu machen..."}, {"14": "stimmt, sind nur 4, mit abgeschlossenem Kapitel V hätte man erst 5[BR][BR]ja, in jedem Kapitel gibt es andere \"Hürden\", andere Engpässe oder auch mal keine[BR]im Prinzip würde man sicherlich fast jedes Kapitel andere Sterneverteilung vornehmen wollen[BR](warum geht das eigentlich nicht?..in anderen Spielen gibt es auch die Neuverteiling des \"Skillbaumes\"?)[BR][BR]das einzige, was evtl. immer bleibt sind die Kampfbooster, die ich z.B. immer nutzen könnte[BR]bei Gütern wird sich das vermutlich verändern..[BR]und Münzen und Werkzeug möglicherweise auch.. ich kann nicht in die Zukunft gucken  [smilie--sprite1][BR][BR]deshalb ist man auch so unsicher, ob man nicht was Falsches mit Sternen versieht, weil man später evtl. was ganz anderes braucht[BR]und dann hat man die Kosten für die Zauberpunkte aber schon exorbitant hochgetrieben und kann nichts mehr daran ändern[BR][BR]noch so ein Punkt, der mich stört[BR][BR]zu viele Effekte, die die einzelnen Zutaten auslösen, wodurch es zu sehr vielen verschiedenen Boostern im Kessel kommt, weil man ja im Prinzip 4 Zutaten braucht, um das Gewünschte zu erhöhen und ca. mind. 3 um von den zu viel auftauchenden wieder welche abzuschwächen (wodurch aber wiederum nun schon wieder noch weitere auftauchen)[BR][BR]keine Möglichkeit die Sterne je anders zu verteilen und man sich aber durch \"Leveln\" die Kosten der Zutaten exorbitant \"für später\" zu hoch getrieben hat[BR]gerade , weil man doch später mit dem Wachstum der Stadt plötzlich ganz andere Bedürfnisse hat[BR](und jetzt sagt nicht, das soll ich mir jetzt schon überlegen..[BR]ich höre und lese immer Unurium..also lasse ich den Kessel besser bis ich bei Unurium bin? ..ist das der Sinn? oder hat das überhaupt dann Sinn den Kessel überhaupt schon anzurühren im frühen oder Mittelspiel?)"}, {"2": "Neris schrieb:\t\t\tdeshalb ist man auch so unsicher, ob man nicht was Falsches mit Sternen versieht, weil man später evtl. was ganz anderes braucht[BR]und dann hat man die Kosten für die Zauberpunkte aber schon exorbitant hochgetrieben und kann nichts mehr daran ändern\t\tZum Vergrößern anklicken....[BR]...deshalb nicht zu früh zu hoch leveln - du hast im Prinzip während jedem Kapitel Zeit, den jeweils neuesten Effekt auf Stufe 40 zu bringen - wenn danach noch was übrig ist, kannst du ausgewählte Effekte höher leveln - ist wie bei den Wundern - da müssen auch nicht alle gleich auf 25+ hochgelevelt werden...gleichmäßiges Wachstum ist gesünder als einseitiges - ich werde alle meine 20 Effekte auf Stufe 50 bringen und bei den bevorzugten ist erst einmal bei Stern 80 Schluß bis die Preise mit dem nächsten Diplom von Kapitel 21 wieder fallen..."}, {"14": "alle Effekte, die man hat auf Stufe 40?[BR]also so rein theoretisch?[BR][BR]wie soll man das denn im Mittelfeld des Spiels bezahlen?[BR]und das geht aus? [BR][BR]das hab ich mir so noch nicht überlegt, aber könnte sein, denn man kauft, trotz exponentiell steigender Kosten [BR]ja mit jedem Kauf immer gleich alte Punktanzahl + 1 ein[BR]und kommt bei einem neuen Effekt dann gleich mehrere Sterne höher"}, {"12": "Wie schon mal beschrieben interessieren mich nur die Kampf-Vorteile, ein paar Güter mehr sind mir sowas von egal.[BR]Nun spielte ich aber gern samstags das Turnier, da hab ich Zeit und muß nicht arbeiten. Da ist aber der Kessel schon weg.[BR]Gestern probierte ich's und zog abends das Turnier noch schnell durch (mit Zeitschleife 30 und Eisbär kein Problem) - bekam auch einige Kampf-Vorteile --- aber das Ergebnis war, daß ich durch Zeitmangel auf den wirklich grottigen Autokampf zurückgreifen mußte und dadurch sicherlich mehr Truppen verloren habe als normal samstags ohne Kessel, dafür aber manuellem Kampf.[BR]Solange sich an diesem grottigen Autokampf nichts ändert ist ergo auch der Kessel meistens für die Katz (allenfalls vielleicht für die 3. Turmebene), schade."}, {"2": "Neris schrieb:\t\t\talle Effekte, die man hat auf Stufe 40?[BR]also so rein theoretisch?[BR][BR]wie soll man das denn im Mittelfeld des Spiels bezahlen?[BR]und das geht aus?\t\tZum Vergrößern anklicken.......für Stufe 40 brauchst du ca. 40.000 Hexenpunkte und wenn man jetzt nicht durch die Kapitel rast, sondern eher so 10 Wochen pro Kapitel einplant (in Zukunft), dann musst du praktisch pro Woche 4.000 Hexenpunkte einsparen bzw. zukaufen - das ist realistisch...[BR][BR]...du kannst ja auch erst mal nur je Stern 30 anpeilen - macht jeweils nur 14.861 Hexenpunkte - für 1x Stufe 80 brauchst du dagegen 1.858.149 Hexenpunkte - das wird nicht so schnell erreichbar sein...[BR][BR]...hier nochmal die nette Tabelle... Spoiler: Bedarf Hexenpunkte[IMG]https://i.ibb.co/hfjmQPR/https-de-forum-elvenar-com-index-php-attachments-aufwertungen-png-33562.png[/IMG][BR][BR]...weitere Daten füge ich gerne hinzu...[BR]...und um es auch kleineren Spielern zu ermöglichen, ihre Effekt in absehbarer Zeit auf 30-40 zu bringen, bin ich nach wie vor für einen Startwert von mind. 250 Hexenpunkten + die zusätzlichen aus der Forschung - für kleine Spieler ist das sehr viel - für große Spieler, die ihre Effekte schon auf 50+ haben dagegen nur ein kleines Tröpfchen...[BR][BR]...so - Tandriel ist wieder zurück und theoretisch könnte ich nun einen weiteren Trank brauen und evtl. noch weitere 5 Effekte hinzu bekommen - dann wäre ich bei 9 gleichzeitig...[BR][BR][IMG]https://i.ibb.co/PDMDzvW/https-de-forum-elvenar-com-index-php-attachments-kelche-png-33887.png[/IMG]...praktisch werde ich aber bis Dienstag warten - aber irgendwann krieg ich das vielleicht mal hin...so spaßeshalber..."}, {"284": "Romilly schrieb:\t\t\t...was schon bekannt ist - jede Zutat wirkt sich entweder mit positiven oder negativen Anteilen auf die verschiedenen Effekte aus - du musst also das, was du haben willst nach oben drücken und das was rausfallen soll aus der Liste nach Möglichkeit in den negativen Bereich verbannen - das alles mit möglichst verschiedenen Zutaten, damit der Trank insgesamt eine höhere Erfolgsquote hat, aber gleichzeitig billiger bleibt...[BR][BR]...das hier hab ich bereits herausgefunden...[BR]Anhang 33175 ansehen.......Anhang 33176 ansehen.[BR]...das rechts mit 1, 2, 3, 4 ist übrigens der Preisanstieg für jede weitere Zutat in Bezug auf die bereits verwendeten Zutaten gleicher Art - also je verschiedener, desto billiger bleibt es bei höherer Wahrscheinlichkeit)....[BR][BR]...das funktioniert dann in etwa so (muss ich aber selbst erst mal testen)[BR][BR]...je mehr Zutaten man in den Kessel steckt, desto höher wird die Wahrscheinlichkeit auf den Gesamterfolg - z.B. 49 % bei 6 Zutaten...[BR][BR]...je nachdem, welche 6 Zutaten man nun verwendet, tauchen verschiedene mögliche Effekte in der Liste rechts auf...aber halt nur die, die momentan im positiven Bereich sind - ich such mal schnell ein passendes Bild - moment...[BR][BR]...hier wurde eine \"Limetten-Raupe\" verwendet...[BR]Anhang 33177 ansehen...die gibt 3 Punkte auf Gut2, 2 Punkte auf Werkzeug, und jeweils einen auf Kasernenkraft und Orks - ebenso 2 auf Söldnerkraft - aber das Diplom wurde hier im Beispiel noch nicht freigegeben... - die negativen Werte tauchen hier nicht auf...[BR][BR]jetzt hat man insgesamt 7 positive Anteile bei einer Erfolgswahrscheinlichkeit von 20 % des Trankes - 20 geteilt durch 7 ergibt 2,85 - gerundet die 2,9 von oben für einen Anteil bzw. die 5,7 für 2 Anteile und 8,6 für 3 Anteile - gemäß der oben genannten Wirkung auf die verschiedenen Effekte...[BR][BR]man muss also erst einmal ermitteln, welche Zutaten welche positiven Anteile in Summe auf die verfügbaren Effekte (Anzahl der Diplome), ergeben und diese dann auf die Gesamt-Erfolgsrate beziehen... ich hoffe, das war jetzt einigermaßen verständlich...[BR][BR]also erst einmal entscheiden, was man fördern, was drücken will und dann entsprechend Zutaten auswählen...[BR][BR][BR]die Tabelle werde ich hoffentlich schnell vervollständigen können...dann wird getestet, ob ich richtig liege ^^\t\tZum Vergrößern anklicken....Ich verstehe nur Bahnhof. Wie peinlich..."}, {"114": "Das ist nicht peinlich Naira und du bist nicht alleine damit. Ließ das nicht.. probiere das für dich selber[BR]und erwarte nichts. Sollte es irgendwann klick machen kannst du immer noch schaun ob das was für dich ist[BR]Bis dahin läuft es dir nicht weg ;-)"}, {"103": "einfach mit nem Kaffee oder Tee den Kessel öffnen und die Zeilen des obigen Posts Schritt für Schritt nachmachen,[BR]schauen, was passiert und was sich wo ändert.[BR][BR]vielleicht auch 2 oder 3 mal in Ruhe lesen...[BR][BR]dann macht es sicher ganz schnell Klick"}, {"285": "Ich finde den Hexenkessel überflüssig. Zu kompliziert und zu wenig Zugewinn. Hatte einen Wertvollen Händlerappell gebraut. Er hatte einen Bonus für Wertvolle Standartgüter von 37,9%. Ich habe dafür 237 Edelsteine mehr bekommen als ohne.[BR]Werde ihn ignorieren."}, {"23": "@Romilly: vielen lieben Dank für deine ausführlichen Erklärungen und Bilder[BR][BR]jetzt zum Feedback: meine große Stadt Kampfeffekte auf 76 gelevelt,[BR]einmal verzockt, durch das ewige Durchklicken habe ich nicht aufgepasst und ein Standardgut von 40 Mios auf 0 gebracht,[BR]selbst schuld ^^[BR]hab damit schon einen guten Kampfeffekt letzte Woche erzeugt, warte jetzt noch bis morgen, der nächste Plan steht [smilie--sprite2][BR][BR]die kleine Stadt, Kapitel V, wird fürs GA auf Händler getrimmt, hat ja nur 4 Effekte zum leveln [smilie--sprite6][BR][BR]ist schon klasse, diesen Vergleich von groß und klein zu haben,[BR]wir Endgamer haben in den Kessel 15 Kapitel an Ressis reinzustecken, wofür die Kleinen eben noch mind. 2 Jahre brauchen.."}, {"2": "Fenja von osten schrieb:\t\t\teinmal verzockt, durch das ewige Durchklicken habe ich nicht aufgepasst und ein Standardgut von 40 Mios auf 0 gebracht,[BR]selbst schuld ^^\t\tZum Vergrößern anklicken.......ja ich weiß, das wird hinten raus recht gefährlich - bei 350 Klicks hat man gerade mal 10 Millionen investiert - bei 400 Klicks sind es schon 50 Millionen und nicht mal 30 Klicks weiter über 100 Millionen - bei Gold bin ich mittlerweile bei über 10 Millionen pro Kauf (ca. 470 Klicks), da fasst aber ja das Lager 200 Millionen - hier erwirtschafte ich genug Überschüsse...bei den Gütern werde ich aber warten, bis ich mit Kapitel 21 fertig bin und die Preise wieder sinken...[BR][BR]...also dieses Mal war ich nicht ganz so zufrieden mit meinem Tränklein...[BR][BR][IMG]https://i.ibb.co/pf03hDB/https-de-forum-elvenar-com-index-php-attachments-neu-png-33924.png[/IMG][IMG]https://i.ibb.co/0XQhHsF/https-de-forum-elvenar-com-index-php-attachments-neu1-png-33925.png[/IMG][IMG]https://i.ibb.co/9rDWnbZ/https-de-forum-elvenar-com-index-php-attachments-neu2-png-33926.png[/IMG]...[BR]...zwar hatte ich auch mit weniger Fragmenten wieder 3 kritische Treffer...(diesmal nur 38,2% Wahrscheinlichkeit, nicht 50 %)..[BR][IMG]https://i.ibb.co/FbcPPZb/https-de-forum-elvenar-com-index-php-attachments-neu3-png-33927.png[/IMG][IMG]https://i.ibb.co/SBSYvTG/https-de-forum-elvenar-com-index-php-attachments-neu6-png-33930.png[/IMG][BR]...aber davon fielen 2 auf den gleichen Effekt, den ich auch noch ein 3. Mal hätte bekommen können...[BR][IMG]https://i.ibb.co/rmZG2vS/https-de-forum-elvenar-com-index-php-attachments-neu4-png-33928.png[/IMG][IMG]https://i.ibb.co/NTrQLPf/https-de-forum-elvenar-com-index-php-attachments-neu5-png-33929.png[/IMG][IMG]https://i.ibb.co/6m13HQr/https-de-forum-elvenar-com-index-php-attachments-neu7-png-33931.png[/IMG][BR]...das ist eben nicht das, was ich haben möchte - hier wurden 2 Kelche verschwendet...und mein Werkzeug war leider auch nicht dabei, wobei das dieses Mal nicht so viele Chancen hatte...[BR][BR]...also hier werde ich definitiv beim nächsten Mal den obersten Effekt wieder unter 20 % drücken und dafür ein paar mehr über 10 % bringen - vielleicht sind dann beim nächsten Mal auch die diafreien Zutaten wieder etwas besser verteilt...[BR][BR]...als kleinen Trost hab ich erneut eine magische Werkstatt im Turm gewonnen und kann somit trotzdem noch ein paar zusätzliche Vorräte in den Kessel stopfen, bis die Zauberin wieder verschwindet..."}, {"275": "Hey @Inno, da könnt ihr ja froh sein, daß ihr mit @Romilly so eine begeisterte Fürsprecherin habt. Aber seit der Saison der  Träume ist bei mir im Spiel der Hexenkessel ja völlig aus dem Blickfeld geraten.. Vielleicht zu viel Aktionismus? Na, ihr werdet schon wissen. Und beide Aktionen bringen mich eher nicht vom Aussteigen ab, aber die Neukunden zählen eh sicher mehr."}, {"6": "Tha Loaharge schrieb:\t\t\tMan MUSS diesen beknackten Hexenkessel nun erforschen, ob man will oder nicht, weil man sonst in der regulären Forschung nicht weiterkommt.\t\tZum Vergrößern anklicken....Du bist im Kapitel 17 und regst dich über so eine Kleinigkeit auf? [BR]Eine nachträgliche Änderung im Forschungsbaum gabs schon öfter. Da erledigt man das Forschungsfeld kurz und fertig."}]