[{"68": "Mal auch ein Feedback von mir aber vorab mal etwas, dass das Inno Elvenar Team schon lange nicht mehr gehört hat: Danke[BR][BR]Danke für die gratis Rosinen von 4 mal 10 WP und 2 mal 80 Diamanten, die anderen 2 mal 80 Diamanten hole ich mir nächste Woche.[BR][BR]Zum Glück kann man die anderen Quest ablehnen, aber es ist irgenwie störend, dass man schon wieder mal sich die Rosinen rauspicken kann, also einfach nicht konsequent dazu steht was so in den Raum geworfen wird."}, {"48": "Ich finde dieses Feature überflüssig.[BR]Das kann aber auch an der schlechten Erklärung, und an der sehr bescheidenen Umsetzung liegen.[BR]Erklärung: Im Spiel völlig unverständlich und unzureichend. [BR]Im Wiki auch nichts vernünftiges.[BR]Hier wird das ganze von Spielenerds bestimmt ganz doll erklärt. Aber warum kann das keiner der Inno- Abhängigen?[BR]Oder anders gefragt. Warum muss ein neues Feature überhaupt seitenlang erklärt werden? Das ist dann einfach für den Otto-Normal-Spieler nicht sinvoll. Die wollen meistens Entspannung und kein sinnentleertes Mathediplom[BR]Umsetzung: Ich habe 5 dieser Becher. Warum muss ich die alle auf einmal nehmen, obwohl ich doch zu der Zeit nur einen Trank haben will?[BR]Die mich interessierenden Tränke halten ein paar Stunden. Wenn ich nur alle 9 - 12 Std gucke, sind die für den Arsch."}, {"128": "Moonlady70 schrieb:\t\t\tMal auch ein Feedback von mir aber vorab mal etwas, dass das Inno Elvenar Team schon lange nicht mehr gehört hat: Danke[BR][BR]Danke für die gratis Rosinen von 4 mal 10 WP und 2 mal 80 Diamanten, die anderen 2 mal 80 Diamanten hole ich mir nächste Woche.[BR][BR]Zum Glück kann man die anderen Quest ablehnen, aber es ist irgenwie störend, dass man schon wieder mal sich die Rosinen rauspicken kann, also einfach nicht konsequent dazu steht was so in den Raum geworfen wird.\t\tZum Vergrößern anklicken....Was habe ich jetzt schon wieder verpasst?[BR]Wo finde ich die Quests im Hexenkessel?"}, {"48": "alf2021 schrieb:\t\t\tWas habe ich jetzt schon wieder verpasst?[BR]Wo finde ich die Quests im Hexenkessel?\t\tZum Vergrößern anklicken....Nicht im Hexenkessel. Die 5 oder 6 Quests zum Hexenkessel. Dabei ist eine mit 80 Dias"}, {"128": "j.fili schrieb:\t\t\tNicht im Hexenkessel. Die 5 oder 6 Quests zum Hexenkessel. Dabei ist eine mit 80 Dias\t\tZum Vergrößern anklicken....[BR]Das finde ich jetzt aber nicht nett von Moonlady/j.fili und diversen anderen....[BR]Ich wollte die Quests erst Ende des Jahres machen, nun ist die Überraschung weg.[BR][BR]Nachtrag: Natürlich auch von mir ans Inno Elvenar-Team ein dicken Dank für die ganzen Dias aus den bisherigen Gastrassenquests![BR][smilie--sprite6]"}, {"48": "alf2021 schrieb:\t\t\tDas finde ich jetzt aber nicht nett von Moonlady.[BR]Ich wollte die Quests erst Ende des Jahres machen, nun ist die Überraschung weg. [smilie--sprite6]Zum Vergrößern anklicken....Wieso beschwerst du dich über @Moonlady70? Ich habe es doch verraten"}, {"128": "j.fili schrieb:\t\t\tWieso beschwerst du dich über @Moonlady70? Ich habe es doch verraten\t\tZum Vergrößern anklicken....[BR]Augenblick..."}, {"155": "Auf allen 3 Welten nicht den Effekt meiner Wahl bekommen. Spiekspaß sieht für mich irgendwie anders aus."}, {"12": "Killy schrieb:\t\t\tAuf allen 3 Welten nicht den Effekt meiner Wahl bekommen. Spiekspaß sieht für mich irgendwie anders aus.\t\tZum Vergrößern anklicken....Kann ich bestätigen.[BR]Ich hatte 4 der 5 Kampf-Effekte bei den obersten 5 Effekten, alle zwischen 10 und 30 % Wahrscheinlichkeit (zusammengezählt zw. 70 u. 80),[BR]und natürlich etliche andere mit sehr geringer Wahrscheinlichkeit.[BR]Bei 5 Kelchen sind 5x andere gekommen und kein einziger Kampf-Effekt.[BR]Auch wenn deren Wirkung überschaubar ist, bei 5 Versuchen keinen zu bekommen ist gelinde gesagt etwas frustrierend."}, {"266": "Ayla Ayla schrieb:\t\t\tIch hatte 4 der 5 Kampf-Effekte bei den obersten 5 Effekten, alle zwischen 10 und 30 % Wahrscheinlichkeit (zusammengezählt zw. 70 u. 80),\t\tZum Vergrößern anklicken....Du weißt nicht zufällig noch, was du in den Trank reingetan hast? Ich versuche auch gern die Kampf-Effekte zu bekommen und steck da einiges an Optimierung rein, aber von in Summe 70-80% bin ich weit entfernt."}, {"12": "LwennA schrieb:\t\t\tDu weißt nicht zufällig noch, was du in den Trank reingetan hast? Ich versuche auch gern die Kampf-Effekte zu bekommen und steck da einiges an Optimierung rein, aber von in Summe 70-80% bin ich weit entfernt.\t\tZum Vergrößern anklicken....Ich weiß nicht, ob irgendjemand irgendwo ein Rezeptbuch begonnen hat.[BR]Meine Aufzeichnungen sind etwas spärlich, da ich sowieso nur Zutaten ohne Dias verwende und darum immer neu suchen muß,[BR]aber ich werde morgen mal schauen, was ich unter Ignorieren von Diaeinsatz brauen könnte - als Ziel 3 Kampfeffekte im niedrigen bis mittleren 2-stelligen Bereich (alle 5 zusammen 70+ %).[BR]Bist Du unter LwennA auf Arendyll erreichbar? - Keine Ahnung ob das posten von genauen Rezepturen hier erlaubt wäre.[BR]Übrigens, wieviele Zutaten kannst Du benutzen, 25 ?"}, {"2": "...hier vielleicht eine kleine Hilfe...[BR][IMG]https://i.ibb.co/hfQ6y0w/https-de-forum-elvenar-com-index-php-attachments-kampfeffekte-png-33989.png[/IMG]...[IMG]https://i.ibb.co/rHsKDMh/https-de-forum-elvenar-com-index-php-attachments-kampfeffekte2-png-33990.png[/IMG]...links die vollen Werte und rechts die, die sich in einer Potenz (auf den Wert 1,1) auswirken...[BR][BR]...für die meisten Spieler sind die Potenzwerte relativ unrelevant, da man oft gar nicht so viele gleiche Zutaten verwenden kann (da wird der Trank schnell teuer)...wenn man aber eine recht hohe Potenz zusammen bekommt (z.B. hoch 8 oder hoch -8), kann sich das sehr stark auswirken...[BR][BR]...also wenn ich z.B. beim Kasernen-Effekt mit Schneckenhaus, Iris, Medusa und Limette ein gutes Ergebnis erzielt habe, aber nun auch noch Käfer hinzufügen möchte, kann ich mir dieses Ergebnis schnell wieder zerschießen und muss vielleicht zum Ausgleich noch ein paar Blätter hinzufügen..."}, {"266": "Ayla Ayla schrieb:\t\t\taber ich werde morgen mal schauen, was ich unter Ignorieren von Diaeinsatz brauen könnte\t\tZum Vergrößern anklicken....Oh, ich wollte dir mit meiner Frage jetzt gar nicht zusätzliche Arbeit verursachen, sondern eher schauen, ob ich anhand deines genutzten Trankes interessante Rückschlüsse für meine Herangehensweise ziehen kann, z.B. Zutatenkombinationen an die ich bisher nicht gedacht habe, oder ob z.B. Zutaten dabei sind die in der Theorie auf den ersten Blick eher ungünstig scheinen aber im Endeffekt doch helfen.[BR][BR]Andere für sich einen Trank finden lassen, den man dann 1:1 übernehmen kann, ist denke ich ohnehin nicht praktikabel, da in den Welten die Dia-Zutaten verschieden liegen, oder sich die verfügbaren Hexenpunkte oder Forschungsdiplome unterscheiden (und deshalb werden wohl auch Rezeptbücher nur bedingt nützlich sein). Mir fehlt z.B. noch für den letzten Kampfeffekt das 17. Diplom. Prinzipiell möglich, dass ich deshalb noch nicht so hohe Gesamtwahrscheinlichkeiten erreiche, aber letzte Woche war ich, wenn ich mich nicht täusche, irgendwo bei insgesamt 50-55% für die Kampfeffekte. Dafür dass mir \"nur\" ein Kampfeffekt fehlt, stellt sich mir dann die Frage, ob ich evtl. irgendwo noch paar Prozente verschenke.[BR][BR]Ayla Ayla schrieb:\t\t\tKeine Ahnung ob das posten von genauen Rezepturen hier erlaubt wäre\t\tZum Vergrößern anklicken....hm, @Mods?"}, {"28": "Ayla Ayla schrieb:\t\t\tKeine Ahnung ob das posten von genauen Rezepturen hier erlaubt wäre.\t\tZum Vergrößern anklicken....[BR]LwennA schrieb:\t\t\thm, @Mods?\t\tZum Vergrößern anklicken....Ich antworte jetzt mal mutig darauf, obwohl ich kein Moderator bin: \"Natürlich ist das erlaubt! Warum auch nicht?\" ;-)"}, {"12": "@LwennA : Wenn ich mich recht erinnere hatte ich meistens Monsterstärke über 20 und Söldnermoral um die 30 - und das dürfte der Effekt sein, den Du noch nicht hast. Insofern dürftest Du mit Deinen 50+% ganz gut dabei sein"}, {"12": "Ich hab mich aus der Erinnerung heraus wohl um ein paar % verschätzt, waren wohl gesamt um die 65%.[BR]Spoiler: Rezeptur-SpoilerHier nun ein Rezept für gesamt 69,5%, Zutaten A-L von links oben bis rechts unten:[BR]6xH 6xJ 3xG 3xD 3xC 2xF 1xL 1xB[BR]23 Zutaten kann man mit den Hexenpunkten von Kapitel 20 ohne Dias nehmen.[BR]bringt 30% Söldnermoral, 17.9% Söldnerstärke, 10.8% Generalstärke & 10.8% Monstermoral[BR](dazwischen 10.9% Mana und am Ende 6 weitere Gütereffekte)[BR]Und ohne 1xL 1xB (nur 23 Zutaten) sind es gesamt 65%"}, {"266": "Ayla Ayla schrieb:\t\t\tHier nun ein Rezept für gesamt 69,5%, Zutaten\t\tZum Vergrößern anklicken....Dankeschön, sehr interessant: Ich habe das Rezept, nach etwas Aufsagen des Alphabets, auch mal bei mir ausprobiert. Und obwohl mir mit Söldnermoral der dickste Effekt sogar noch fehlt, schafft es der Trank trotzdem auf 58% bei den Kampfeffekten (26,1% Monsterstärke, 15,8% Monstermoral, 15,7% Generalstärke). Nur aktuell halt noch etwas zu teuer für mich."}, {"2": "...ein bisschen weniger %, dafür aber alle 5 Kampfeffekte - relativ gleichmäßig verteilt (16,6, 14,5, 12,4, 8,1, 5,8) - mit etwas Glück kann man aber eben alle 5 gleichzeitig haben - momentan allerdings noch nicht ohne Dias bezahlbar...[BR][BR][IMG]https://i.ibb.co/h7nrSyg/https-de-forum-elvenar-com-index-php-attachments-kampftrank3-png-34002.png[/IMG][IMG]https://i.ibb.co/Tm45xfB/https-de-forum-elvenar-com-index-php-attachments-kampftrank4-png-34003.png[/IMG][IMG]https://i.ibb.co/CsmxkWY/https-de-forum-elvenar-com-index-php-attachments-kampftrank5-png-34004.png[/IMG][BR][BR]...für mich aber total unbrauchbar, da die Werkzeuge viel zu schlecht abschneiden..."}, {"155": "Meistens möchte man ja eh eher den Effekt für eines der Militärgebäude garantieren."}, {"96": "hi,[BR]ich möchte auch ein Vorschlag machen: ( weis jetzt nicht ,ob das schon jemand gemacht hat)[BR]mich stört hauptsächlich, das die Zauber nach Herstellung sofort wirken, ich fände es besser wenn der Hexenkessel [BR]zum Beispiel: schöne Beschwörungs Gebäude produzieren würde statt Getränke, die Gebäude könnte man dann nach Bedarf aufbauen,[BR]also auf Vorrat produzieren+sammeln u. dann gezielt einsetzen, (mit der entsprechenden Ablaufzeit)[BR] o. die Tränke werden als \"Zaubertrank-Flasche\" produziert und im Zauber-Inventar wird ein neuer Reiter eingesetzt mit \" Zaubertränke\" ,[BR]dort könnte man dann die Tränke bei Bedarf Trinken o. nutzlose Tränke auch zerlegen .[BR]Dann könnte man auswählen, wenn ein Trank nicht gelungen ist ,ob man den trinkt o. nicht...[BR]--> falls das in die Ideenschmiede gehört , dann bitte verschieben  [smilie--sprite1]"}]