[{"2": "Pangond schrieb:\t\t\tschöne Beschwörungs Gebäude produzieren würde statt Getränke, die Gebäude könnte man dann nach Bedarf aufbauen,\t\tZum Vergrößern anklicken.......dazu ist die Zauberherstellung oder das Handwerk da - der Kessel funktioniert absichtlich anders..."}, {"56": "Romilly schrieb:\t\t\tder Kessel funktioniert absichtlich anders...[BR][BR](Veränderung: Fettschrift durch mich erzeugt.)\t\tZum Vergrößern anklicken....[BR]Woher nimmst Du diese Killerphrase... folgst Du hier nur deiner eigenen Logik oder gibt es hier eine definitive Aussage der Entwickler, die das \"for ever\" so festlegt haben?[BR]Ich erkenne hier kein \"Argumentum ad veritatem\", also nichts was diese Behauptung hinsichtlich Ihres Wahrheitsgehaltes untermauert.[BR]Man kann das Feedback eines anderen Foren-Users auch mal ohne Killerphrasen stehen lassen."}, {"2": "Athaneia schrieb:\t\t\tWoher nimmst Du diese Killerphrase... folgst Du hier nur deiner eigenen Logik oder gibt es hier eine definitive Aussage der Entwickler, die das \"for ever\" so festlegt haben?[BR]Ich erkenne hier kein \"Argumentum ad veritatem\", also nichts was diese Behauptung hinsichtlich Ihres Wahrheitsgehaltes untermauert.\t\tZum Vergrößern anklicken.......glaubst du denn, daß der nur \"zufällig\" oder \"aus Versehen\" anders funktioniert und nicht \"absichtlich\" ???...."}, {"56": "@Romilly ...es geht hier nicht darum, was Du und Ich \"glauben\". Es geht hier darum, zu erwähnen, dass man es selbst vermutet (glaubt, denkt, etc.), dass es so oder so ist. Es sich demnach also nicht als Wahrheit par excellence darstellt."}, {"103": "Trefft Euch doch bitte in einer PM, um das auszudiskutieren und hier können wir dann bitte beim konkreten Feedback bleiben"}, {"48": "Aus der ganzen hier dargestellten Hexenkesselnutzung ergibt sich für mich eigentlich nur, dass er völlig willkürlich Tränke ausspuckt, die man manchmal gebrauchen kann, die aber, wenn man sie gebrauchen kann nur dann einen vernünftigen Wert haben, wenn man diese mit unvernünftig hohen Kosten produziert hat.[BR]Und da selbst mit den hohen Kosten häufig ein falscher Trank kommt, ist der Kessel so wie er ist nutzlos. Habe ich das so richtig aus den Ausführungen der Vorredner geschlossen?"}, {"103": "nein, hast Du nicht[BR][BR]der Kessel bringt auch ohne Kosten Effekte[BR]vielleicht nicht den gewünschten und vielleicht nicht in der gewünschten Höhe, wenn man die Effekte nicht hochleveln will[BR]aber grundsätzlich bringt er irgendeinen Bonus,[BR]auch wenn man nur die kostenlosen Hexenpunkte nutzt.[BR][BR]Damit ist er nicht nutzlos."}, {"136": "hm, irgendetwas stimmt da doch nicht, oder? Senat auf stufe3, Hummel auf stufe 11 und nach Trankbrauerei mit \"Geschenk d. Hohen Wesen\" (GastvölkerresourcenEffekt) 6,5% zusammen sage und schreibe -35% Produktionsbonus... ich dacht das wird mit der Hexerei mehr, nicht weniger (!!!)... ich hoffe, das ist nur ein Anzeigefehler...[BR]...[BR]Nachtrag: jetzt, nach 6h sind es wieder \"normale\" 58% Produktionsbonus. Waren vorher wohl trotzdem ein paar Gesetztesvorschläge (etc.) mehr. Schön ist diese unfreiwillige Adrenalinspritze trotzdem nicht."}, {"135": "j.fili schrieb:\t\t\tAus der ganzen hier dargestellten Hexenkesselnutzung ergibt sich für mich eigentlich nur, dass er völlig willkürlich Tränke ausspuckt, die man manchmal gebrauchen kann, die aber, wenn man sie gebrauchen kann nur dann einen vernünftigen Wert haben, wenn man diese mit unvernünftig hohen Kosten produziert hat.[BR]Und da selbst mit den hohen Kosten häufig ein falscher Trank kommt, ist der Kessel so wie er ist nutzlos. Habe ich das so richtig aus den Ausführungen der Vorredner geschlossen?\t\tZum Vergrößern anklicken....[BR]Nicht nutzlos. Homöopathisch scheint mir das richtige Wort."}, {"155": "Xebifed schrieb:\t\t\tNicht nutzlos. Homöopathisch scheint mir das richtige Wort.\t\tZum Vergrößern anklicken....Nene, im Gegensatz zur Homöopathie bringt der Kessel ja was, wenn auch wenig."}, {"112": "diese zufälligkeit und bonusverteilung beim kessel erinnert mich ziemlich fatal an eine wahre begebenheit in meiner länger zurückliegenden jugend.[BR]wir 3 freund*innen gingen zur eisdiele - schon abends, aber nicht ganz kurz vor ladenschluss. 2 von uns bekamen was sie haben wollten. die dritte hatte spezielle wünsche: \"3 kugeln stracciatella.\" \"ist alle\" \"na gut dann schokolade\" \"ist alle\" \"ok dann malaga\"  \"ist alle\" \"oh man, dann zitrone\". bekam sie. wir gingen ein paar schritte, da pfefferte die dritte ihr eis gegen eine plakatwand \"ich HASSE zitroneneis!\"[BR]so erlebe ich den kessel. ich möchte die kampfbooster haben. ich braue, nach längerem probieren und mit meiner meinung nach ganz ordentlicher chance - trinke - und bekomme 2x nix, je 1x vorräte standardgüter und münzen...und davon hab ich wirklich reichlich.[BR]also- für mich diesmal NUTZLOS, nicht homöopatisch, ohne effekt, der mir was bringt."}, {"48": "Killy schrieb:\t\t\tNene, im Gegensatz zur Homöopathie bringt der Kessel ja was, wenn auch wenig.\t\tZum Vergrößern anklicken....NEE, NEE, Homöopathie bringt wie der Kessel und Placebo etwas. Also sind alle 3 gleichwertig.[BR]Obwohl, wenn der Kessel nahezu nie das bringt, was gewünscht ist, ist Homöopatie vielleicht doch überlegen."}, {"114": "... und ich mag noch einen draufsetzen. Wird der Kessel die Kampfbooster aus der Aka verdrängen? [BR]Seit ner Weile keinen einzigen mehr und ich verpasse keinen Wechsel. Sag mir bitte wer das das nicht so ist... [BR]Kessel? Für mich absolut keine Option. Keine Kampfbooster mehr aus def Aka - >kein Turnier und Turm->keine[BR]Lust mehr [smilie--sprite3]"}, {"266": "Inye schrieb:\t\t\tWird der Kessel die Kampfbooster aus der Aka verdrängen?\t\tZum Vergrößern anklicken....Was die Zukunft bringt, weiß ich nicht, aber ich hatte heute nen leichten Fernkampfbooster in der MA. Zufall eben..."}, {"6": "Inye schrieb:\t\t\tSag mir bitte wer das das nicht so ist...\t\tZum Vergrößern anklicken....Das ist nicht so. [smilie--sprite2][BR]Gelegentlich gibt es in der Aka mal eine längere Flaute, das gibt sich aber wieder.[BR]Deshalb halte ich immer eine Reserve an Boostern im Inventar."}, {"147": "Inye schrieb:\t\t\tSeit ner Weile keinen einzigen mehr und ich verpasse keinen Wechsel. Sag mir bitte wer das das nicht so ist...\t\tZum Vergrößern anklicken....[BR]Seit einigen Wochen schon tröpfeln auch bei mir die Kampfbooster mehr als dürftig. Habe jetzt, nach 6 Wochen, gerade einmal die beisammen, die ich für Stahl benötige! [BR][BR]Hatte das schon einmal, dauert rund 2 Monate und dann kommen sie wieder regelmäßig(er).[BR][BR]Wenn‘s net nen blöder Lauf ist, isses definitiv der Kessel^^"}, {"155": "j.fili schrieb:\t\t\tNEE, NEE, Homöopathie bringt wie der Kessel und Placebo etwas. Also sind alle 3 gleichwertig.[BR]Obwohl, wenn der Kessel nahezu nie das bringt, was gewünscht ist, ist Homöopatie vielleicht doch überlegen.\t\tZum Vergrößern anklicken....Kannste aber auch Tic Tacs für den Placeboeffekt essen, ist nicht wirklich ein Verdienst von der Scharlatanerie.^^[BR][BR]Habe in meiner Händlerstadt jetzt zum dritten Mal in Folge nicht meinen gewünschten Händlereffekt bekommen, finde den Zufall noch weniger spaßig als in den Events."}, {"8": "Inye schrieb:\t\t\tWird der Kessel die Kampfbooster aus der Aka verdrängen?\t\tZum Vergrößern anklicken....Genau das war auch meine Befürchtung [smilie--sprite2][BR]Hab deshalb auch schön brav alle Kampfeffekt des Kessels gelevelt... Doch ohne Fraggies nutzen auch die hohen Level nicht viel![BR][BR]Ich spekulier mal auf ein paar schöne zukünftige evos, die Effektstärken verdoppeln, Kritisch um einen Basisfaktor erhöhen... Evtl. sogar zusätzliche Turbozutaten bringen?[BR][BR]Allerdings: Zumindest bisher kommen die Kampfbooster immer noch schön regelmäßig rein... *Klopf auf Holz* dass es so bleibt [smilie--sprite2]"}, {"135": "Ich hab noch 185 Kampfbooster eingelagert, sind diese Woche erst 2 dazugekommen."}, {"114": "Das beruhigt mich dann doch etwas.. dachte schon das wars dann [smilie--sprite1]"}]