[{"119": "Xebifed schrieb:\t\t\tNicht nutzlos. Homöopathisch scheint mir das richtige Wort.\t\tZum Vergrößern anklicken....bei uns sagt man höflich : \"mit eingeschränktem Nutzwert\"   [smilie--sprite2]"}, {"165": "eigentlich will ich den hexenkessel nicht und auch nicht freischalten. jetzt treibt mich die forschung aber jedesmal zum hexenkessel und meine forschungen im aktuellen kapitel kann ich nicht freischalten [smilie--sprite3]. bin ich gezwungen, dieses blöde ding haben zu müssen und stand das irgendwo, habe ich das überlesen? wenn ja, warum um gottes willen?"}, {"112": "Forschungsbaum Änderung[BR][BR]und ja - wenn du in der Forschung deines aktuellen Kapitels weiter kommen willst musst du das machen."}, {"165": "danke"}, {"2": "Caravelle schrieb:\t\t\teigentlich will ich den hexenkessel nicht und auch nicht freischalten. jetzt treibt mich die forschung aber jedesmal zum hexenkessel und meine forschungen im aktuellen kapitel kann ich nicht freischalten [smilie--sprite3]. bin ich gezwungen, dieses blöde ding haben zu müssen und stand das irgendwo, habe ich das überlesen? wenn ja, warum um gottes willen?\t\tZum Vergrößern anklicken.......ja - es gab eine ingame-Benachrichtigung, daß der Kessel ab dem 2.2. integriert wird (die war allerdings nicht so genau verständlich)...und es ist auch nicht das 1. Mal, daß nachträglich eine neue Forschung in den Forschungsbaum integriert wurde und diese nach einer kurzen Übergangszeit von einer optionalen zur Pflichtforschung wurde..."}, {"165": "mir geht es darum, dass ich MUSS.[BR][BR]also mein feedback:[BR][BR]ich finde es nicht in ordnung, das ich gezwungen werde, wenn ich weiter kommen will. beim turnier ist kein zwang, bei der akademie nicht und auch nicht beim turm, wieso also beim hexenkessel, das begreife ich nicht, der sinn erschließt sich mir einfach nicht."}, {"165": "oder soll ich ihn einfach nur freischalten und dann kann ich ihn links liegenlassen?"}, {"2": "Caravelle schrieb:\t\t\toder soll ich ihn einfach nur freischalten und dann kann ich ihn links liegenlassen?\t\tZum Vergrößern anklicken.......ja - du sollst ihn einfach nur freischalten - und wenn du dann die paar Quests noch erledigst, bekommst du 80 Diamanten..."}, {"103": "übrigens ist auch der Turm Pflicht[BR][BR][IMG]https://i.ibb.co/Hd5n7kv/https-de-forum-elvenar-com-index-php-attachments-1675797627872-png-34018.png[/IMG][BR][BR]auch das Turnier[BR][BR][IMG]https://i.ibb.co/zfD9MzD/https-de-forum-elvenar-com-index-php-attachments-1675797669933-png-34019.png[/IMG][BR][BR]auch das GA[BR][BR][IMG]https://i.ibb.co/PF3QnXT/https-de-forum-elvenar-com-index-php-attachments-1675797727902-png-34020.png[/IMG][BR][BR]und auch die Akademie[BR][BR][IMG]https://i.ibb.co/61KK0dC/https-de-forum-elvenar-com-index-php-attachments-1675797779826-png-34021.png[/IMG][BR][BR]es ist halt eben ein Bestandteil des Spiels, wie alle anderen Elemente auch,[BR]ob man sie später nutzt oder nicht aber[BR]forschen muss man sie eben..."}, {"2": "littleFlex schrieb:\t\t\tübrigens ist auch der ... Pflicht\t\tZum Vergrößern anklicken.......aber nur, wenn man den neuen Forschungsbaum hat - allerdings musste ich in meiner Anfangszeit auch das Turnier erst erforschen (diese Forschung wurde dann gestrichen) - manchmal ändert sich halt was...z.B. war der Zerberus mal eine Kasernen-Einheit der Menschen...ich glaub, die mussten den dann auch erforschen, als der ins Trainingslager wechselte...[BR][BR]...Update auf Version 1.18... [BR]Einige neue Technologien im Ork- und Goblin-Kapitel wurden hinzugefügt: Es ist nun möglich das Trainingsgelände auf die Stufen 9-12 auszubauen, der Ork-Krieger - eine schwere Nahkampfeinheit, die im Trainingslager ausgebildet werden kann und der Unheimlicher Zerberus (letzterer ist bereits länger für Menschen erhältlich). Alle 3 Technologien sind für Menschen sowie für Elfen verfügbar und werden bis zum nächsten Update optional bleiben."}, {"12": "Hab heute mit Monster- & Söldnerstärke die 3.Turmebene beendet, einen kleinen Unterschied hab ich schon bemerkt als wenn ich nur die Wunder allein habe (Turmkämpfe sind bei mir fast immer manuell).[BR]Dann kann ich mich samstags schön gemütlich dem Turnier widmen (mit Feuerphönix,...)"}, {"3": "Also jetzt fängt der Kessel an Spaß zu machen. Die einstudierten Effekte machen sich bemerkbar. [BR]Heute zwei kritische Effekte ausgelöst. Um 30% erhöhte Manaproduktion für 22 Stunden und 18,6% mehr Siedlungsresourcen für fast 21 Stunden. Letztere wirkt auf alle 3 verschiedenen Siedlungsproduktionen, die ich gerade habe.[BR]Dazu noch ein kleiner Kampfeffekt, nicht viel, kann aber auch nicht schaden.[BR]Wenn das kein Wort ist  [smilie--sprite1] [smilie--sprite1] [smilie--sprite1] [smilie--sprite1]"}, {"128": "Fayence schrieb:\t\t\tAlso jetzt fängt der Kessel an Spaß zu machen. Die einstudierten Effekte machen sich bemerkbar.[BR]Heute zwei kritische Effekte ausgelöst. Um 30% erhöhte Manaproduktion für 22 Stunden und 18,6% mehr Siedlungsresourcen für fast 21 Stunden. Letztere wirkt auf alle 3 verschiedenen Siedlungsproduktionen, die ich gerade habe.[BR]Dazu noch ein kleiner Kampfeffekt, nicht viel, kann aber auch nicht schaden.[BR]Wenn das kein Wort ist  [smilie--sprite1] [smilie--sprite1] [smilie--sprite1]Auf  [smilie--sprite1]Zum Vergrößern anklicken....Hast du Fragmente oder Dias eingesetzt?[BR][BR]Auf Mana hab ich auch gebraut, erhalten habe ich gute 2 Stunden Kampfbooster.[BR]Die werde ich gut nutzen können, wenn ich in 67 Stunden eine neue Provinz freigeschaltet habe...  [smilie--sprite6]"}, {"112": "da ich auf kampfverstärkung setze braue ich immer erst am donnerstag abend. FALLS ich tatsächlich irgendwann mal den erwünschten trank serviert bekomme, hat der dann wenigstens noch nutzen. sonntags vormittags dann eher nicht."}, {"3": "@alf2021 Fragmente ja, Dias nein.[BR]Ich habe auch etwas Glück gehabt. Kein Trank wurde versemmelt.[BR]Die Effekte für Siedlungsresourcen und Mana habe ich auch schon recht weit hochgelevelt, auf Stufe 42 und 22.[BR][BR]@Pukka genau deswegen mache ich die Mana- und Rohstofftränke am Sonntag, wo ich Zeit habe.[BR]Letzten Dienstag fürs Turnier habe ich es auch mit einem Kampfverstärkertrank probiert, war nicht weltbewegend, hat aber auch was gebracht."}, {"113": "Weia, mir scheint, ich habe ein recht kindliches Gemüt.[BR][BR]Zur Zeit muss ich das Handy für Elvenar nutzen, etwas, was ich nicht soo gerne mache. Eigentlich, denn anstatt dass ich so nützliche und anödende Dinge wie Aufräumen mache, schaue ich den Zutaten zu, wie sie aus einem Loch in der Wand in den Kessel plumpsen.[BR]Am PC sieht das nicht so hübsch aus."}, {"178": "Feedback meinerseits zum Gesöff...[BR][BR]immer noch nahezu überflüssig![BR]gute Grundidee aber in der Umsetzung...[BR]reine Zeitverschwendung und damit leider eher lästig.[BR][BR]warum kümmert man sich bei INNO nicht erstmal um den defekten Zufallsalgorithmus bevor man immer mehr Zufallsbasierende Pannen ins Spiel bringt?[BR][BR]Frage auch ist das auf Dauer eigentlich gesund solche Mixturen wöchentlich zu sich zu nehmen.[BR]Habt ihrs schon länger getestet???"}, {"178": "Inye schrieb:\t\t\tund ich mag noch einen draufsetzen. Wird der Kessel die Kampfbooster aus der Aka verdrängen?[BR]Seit ner Weile keinen einzigen mehr und ich verpasse keinen Wechsel. Sag mir bitte wer das das nicht so ist...[BR]Kessel? Für mich absolut keine Option. Keine Kampfbooster mehr aus def Aka - >kein Turnier und Turm->keine[BR]Lust mehr [smilie--sprite3]Zum Vergrößern anklicken....das befürchte ich auch. und hätte seine Konsequenz.[BR][BR]Würde aber nach sowas niemals fragen... man sollte INNO nicht mit solchen Ideen impfen"}, {"114": "Wie auch immer... die Durststrecke war seeehr lang aber die Kampfbooster tauchen in der Aka  wieder auf [smilie--sprite1] [BR]Ohne den Kessel hat es meine Turnier Aktivität ziemlich gedrosselt. Ich werds überleben.. glaub ich ;-)"}, {"156": "Ich weiss noch,dass ich ganz gespannt auf den Hexenkessel gewartet habe[BR]und dann kam er nicht...lach[BR]Ich hatte nämlich nicht kapiert,dass ich den erst im Forschungsbaum in einem schon[BR]längst abgeschlossenen Kapitel erforschen musste.[BR]Als ich ihn dann schließlich in meiner Akademie hatte war mein erster Versuch einen Trank[BR]zu brauen eher kläglich.Ich glaube der1. Effekt,den ich erzeugte war nur wenige Minuten lang...hihi[BR]Da begriff ich,dass das wohl ein Langzeitprojekt werden würde.Seither habe ich mal Erfolg mit[BR]länger andauernden Effekten und ein anderes Mal wieder weniger aber das macht nichts.[BR]Irgendein Effekt entsteht immer und sei er auch noch so klein.[BR]Alle,die Lust darauf haben,sollten es einfach weiter probieren.Irgendwann klappt es mit[BR]dem Erzeugen nennenswerter gewünschter Effekte.Da bin ich ganz sicher.[smilie--sprite1]"}]