[{"103": "so ist es angedacht..."}, {"91": "Verständnisfrage:[BR]Kann ich zugefügte Zutaten auch wieder hersusnehmen, um herum zu probieren oder gilt' wie im Skat - was liegt, das liegt? [smilie--sprite8][BR]Welcher Wert entspricht denn nun -2 ...+3, wie ermittelst du das @Romilly ?"}, {"103": "kannst Du, entweder jeweils die letzte Zutat (9) oder komplett alle (10)[BR][BR][IMG]https://i.ibb.co/Mpfg2hV/https-de-forum-elvenar-com-index-php-attachments-1673093065793-png-33200.png[/IMG]"}, {"2": "littleFlex schrieb:\t\t\tkannst Du, entweder jeweils die letzte Zutat (9) oder komplett alle (10)[BR][BR]Anhang 33200 ansehenZum Vergrößern anklicken........richtig - und bezahlt werden die verwendeten Zutaten generell erst, wenn du auf \"brauen\" drückst...[BR][BR]Shania1 schrieb:\t\t\tHab einen lieben Dank für Deine Erklärung, Romilly...[BR]Es hat meinen Eindruck bestätigt, daß es für die höheren Kapitel super ist - die Orks sind ab Kapitel VIII....\t\tZum Vergrößern anklicken.......gerade für Händler können die ersten Effekte - also Gold und Werkzeug-Steigerung - sehr interessant werden - es rentiert sich also, diese schon von Anfang an zu fördern - wobei man in den niedrigeren Kapiteln, also wenn man erst wenige Diplome besitzt, vielleicht noch nicht so viele Hexenpunkte zukaufen sollte - weil das im Verhältnis zu den Mengen, die man später von den Ressourcen besitzt, mehrfach teurer ist (je mehr Diplome man hat, desto niedriger werden die Grundpreise) - dieses neue Feature soll einen ja von nun an über die gesamte Spielzeit begleiten, d.h. das System ist auf Jahre ausgelegt - Spieler des letzten Kapitels haben nun nur scheinbar viel bessere Möglichkeiten, ihre Effekte zu steigern - man darf aber ja nicht vergessen, daß die ja auch jahrelang nichts verbessern konnten und nun alles nachholen müssen, was ein Anfänger in den nächsten Jahren bzw. Kapiteln automatisch ansammeln kann - man sollte die Effekte auch nicht überbewerten - die sollen kein Gamechanger sein, sondern ein weiterer Baustein oder besser gesagt eine weitere Kombinationsmöglichkeit, um verschiedene Ziele zu erreichen bzw. Leistungen aller Art zu steigern - nach dem Motto: Kleinvieh kann auch ordentlich viel Mist machen, wenn es gut gefüttert wird ^^....man weiß ja auch nicht, was hier evtl. in Zukunft noch ergänzt wird oder welche Zusatzbausteine noch ins Spiel kommen (vielleicht schon geplant sind)....ich möchte bloß mal dran erinnern, wie lange es gedauert hat, bis man auch ohne magische Gebäude einen Nutzen von der Blaupause hatte...(als die Restaurationen eingeführt wurden, hatte ich in Winyandor über 70 Blaupausen im Inventar)..."}, {"112": "irgendwie bekomme ich beim lesen der anleitung im WIKI jedesmal bauchweh, bevor ich zum ende komme. für mich ist diese lotterie mit verlaub wohl nichts."}, {"152": "Romilly schrieb:\t\t\t....richtig - und bezahlt werden die verwendeten Zutaten generell erst, wenn du auf \"brauen\" drückst...[BR][BR][BR]...gerade für Händler können die ersten Effekte - also Gold und Werkzeug-Steigerung - sehr interessant werden - es rentiert sich also, diese schon von Anfang an zu fördern - wobei man in den niedrigeren Kapiteln, also wenn man erst wenige Diplome besitzt, vielleicht noch nicht so viele Hexenpunkte zukaufen sollte - weil das im Verhältnis zu den Mengen, die man später von den Ressourcen besitzt, mehrfach teurer ist (je mehr Diplome man hat, desto niedriger werden die Grundpreise) - dieses neue Feature soll einen ja von nun an über die gesamte Spielzeit begleiten, d.h. das System ist auf Jahre ausgelegt - Spieler des letzten Kapitels haben nun nur scheinbar viel bessere Möglichkeiten, ihre Effekte zu steigern - man darf aber ja nicht vergessen, daß die ja auch jahrelang nichts verbessern konnten und nun alles nachholen müssen, was ein Anfänger in den nächsten Jahren bzw. Kapiteln automatisch ansammeln kann - man sollte die Effekte auch nicht überbewerten - die sollen kein Gamechanger sein, sondern ein weiterer Baustein oder besser gesagt eine weitere Kombinationsmöglichkeit, um verschiedene Ziele zu erreichen bzw. Leistungen aller Art zu steigern - nach dem Motto: Kleinvieh kann auch ordentlich viel Mist machen, wenn es gut gefüttert wird ^^....man weiß ja auch nicht, was hier evtl. in Zukunft noch ergänzt wird oder welche Zusatzbausteine noch ins Spiel kommen (vielleicht schon geplant sind)....ich möchte bloß mal dran erinnern, wie lange es gedauert hat, bis man auch ohne magische Gebäude einen Nutzen von der Blaupause hatte...(als die Restaurationen eingeführt wurden, hatte ich in Winyandor über 70 Blaupausen im Inventar)...\t\tZum Vergrößern anklicken....@Romilly: Wo genau kann ich bei Inno nachlesen, dass diese Lotterie kein Gamechanger sein soll?[BR][BR]Bisher habe ich noch von keinem einzigen Kapitel alle Forschungen erforscht. Für mich ist das ein deutlicher Gamechanger."}, {"2": "Sir Gareth schrieb:@Romilly: Wo genau kann ich bei Inno nachlesen, dass diese Lotterie kein Gamechanger sein soll?\t\tZum Vergrößern anklicken.......dazu brauchst du keine Aussage von INNO - dazu musst du nur das Feedback zur Höhe der Effekte lesen... ^^[BR][BR]...der Feuerphönix war z.B. ein Gamechanger - in einer Art und Weise, wie es vermutlich nicht beabsichtigt war (so wie einiges anderes aus dem Jahre 2019) - ab 2020 wehte dann ein anderer Wind - kannst dir jetzt selbst aussuchen, warum das wohl so war - offiziell wirst du keine Antwort erhalten - also brauchst auch gar nicht fragen...[BR][BR]...was verstehst du eigentlich unter einem \"Gamechanger\", wenn ich mal fragen darf?[BR][BR]...das...[BR]Sir Gareth schrieb:\t\t\tBisher habe ich noch von keinem einzigen Kapitel alle Forschungen erforscht. Für mich ist das ein deutlicher Gamechanger.\t\tZum Vergrößern anklicken....[BR]...ist für mich jedenfalls keiner...das ist nur etwas, was dir missfällt, vielen Spielern aber sowas von egal ist..."}, {"91": "Ok, danke.[BR]Finde ich die -2 bis +3 Auswirlung der Zutaten auf einzelne Effekte nur in gamefiles oder gibt's hierfür offiziellere, offensichtlichere Anhaltspunkte?"}, {"2": "BlackLabelSociety schrieb:\t\t\tOk, danke.[BR]Finde ich die -2 bis +3 Auswirlung der Zutaten auf einzelne Effekte nur in gamefiles oder gibt's hierfür offiziellere, offensichtlichere Anhaltspunkte?\t\tZum Vergrößern anklicken.......nein - eine offizielle Auskunft gibt es hierzu nicht und sowas wirst du auch nicht bekommen - die eine komplette Zeile hab ich aus dem Beta-Forum \"geklaut\", da die dort jemand ausgelesen hat (ja, das ist möglich - ich hoffe, ich finde die entsprechende Stelle dann auch ^^) oder man findet es einfach selbst durchs Ausprobieren raus - die übrigen Angaben hab ich anhand von Screenshots, dem Video oder Berichten ermittelt (halt ohne negative Effekte) - wenn ich mir meine Tabelle so ankucke, dann könnte es auch durchaus sein, daß die Zahlen immer in der gleichen Reihenfolge auftreten - aber halt verschieden versetzt - zumindest hab ich immer die gleiche kurze Zahlenfolge festgestellt - 3-2-1-1"}, {"154": "BoeseTante schrieb:\t\t\tUnd nicht vergessen, falsche Zutaten können auch böse Auswirkungen haben... 2 mal hats geknallt, da waren 2 Häuser weg [smilie--sprite3]Zum Vergrößern anklicken....Das ist einfach eine in den Raum gestellte Aussage ohne jeglichen Beweis.[BR][BR]Solche Behauptungen sollten unterbleiben da sie sehr große Verwirrung und Verunsicherung stiften und nur mehr Schaden anrichten indem sie andere Spieler verschrecken."}, {"27": "Also mir ist es egal und ich kann noch nicht sagen ob ich den Kessel je mache, bin noch nie ein Freund von den Turnieren gewesen, wegen mir aus könnte man die Tuniere abschaffen. [smilie--sprite1]"}, {"261": "Da ich nicht auf der Beta spiele, kann ich bisher nur meinen Vorab-Eindruck aus der Forum-Diskussion und aus den neuen Erläuterungen im Wiki schildern:[BR]Für mich persönlich klingt der Hexenkessel sehr kompliziert.Trotz des Textes im Wiki sind mit viele Aspekte eher unklar.Anscheinend eine extrem hohe Glücksabhängigkeit (wegen der unterschiedlichen Erfolgswahrscheinlichkeiten).Sehr undurchsichtig, weil es keine eindeutig festgelegten Rezepte gibt.Ohne intensive Recherche im Forum und auf externen Webseiten wohl nicht sinnvoll spielbar.Sehr zeitaufwändig.Ich bin mir ganz und gar nicht sicher, ob dieses neue Spielelement schon ausgereift ist und für den Massenbetrieb bei normalen Durchschnittsspielern - außerhalb der Endgamer und der ganz eingefleischten Powergamer - geeignet ist.Da ich Elvenar zu meinem Vergnügen spiele und nicht 24/7 online sein kann und will, fehlt mir schlicht die Zeit und der Nerv für ein solch kompliziertes und umständliches neues Spielelement. Daher werde ich es erst einmal ignorieren. Vielleicht schaue ich in ein paar Wochen mal, was es hier so an Reaktionen gibt und ob das Ganze dann durchschaubarer für mich wird.[BR][BR]Bis dahin hoffe ich inständig darauf, dass[BR]ein Spiel ohne Hexenkessel weiterhin möglich ist, d.h. dass das restliche Spiel nicht erschwert wird, wenn man das neue Feature nicht nutzen kann/will.der Hexenkessel nicht zu penetrant im Spiel auftaucht.Ach ja - es ist auch ein Armutszeugnis, dass der Hexenkessel zwar hier im Forum (viel zu kurzfristig) angekündigt wird, aber es nicht einmal eine Vorankündigung inGame gibt - geschweige denn sogar einen Link zu ausführlichen Erläuterungen und Demo-Videos. Das verstärkt meinen Eindruck, dass es sich nur um ein Feature handelt, das sich an Powergamer richtet und nicht an die Masse der Normalspieler."}, {"28": "Bardinor schrieb:\t\t\tBis dahin hoffe ich inständig darauf, dass[BR]ein Spiel ohne Hexenkessel weiterhin möglich ist, d.h. dass das restliche Spiel nicht erschwert wird, wenn man das neue Feature nicht nutzen kann/will.Zum Vergrößern anklicken....Das wird selbstverständlich möglich sein! ;-)"}, {"68": "Thebigunknown schrieb:\t\t\tDas wird selbstverständlich möglich sein! ;-)\t\tZum Vergrößern anklicken....[BR]Aber mit Sicherheit \"eingeschränkt\", denn durch den Kessel bieten sich natürlich wieder INNOvative Möglichkeiten, dieses neue \"Glückspiel\" \"Feature\" auch in die wenigen jährlichen Events zu integrieren und endlich ein paar neue Quests und von daher neue \"Blockaden\" hervorzubringen.[BR][BR]Aber wenn man die Magische Akademie nicht baut und die Events weiterhin so gut wie mögich ignoriert, dann steht dem \"normalen Spiel\" selbstverständlich nur die \"normalen Probleme\" im Wege."}, {"94": "Also obwohl ich eigentlich von der Gesamtleistung des Kessels nicht begeistert bin, freue ich mich doch endlich los legen zu können... ich weiß von dem Ding schließlich schon seit April. In der Beta könnte ich nicht viel reißen, da brauche ich eh nix, die Stadt läuft von alleine.[BR][BR]Aber hier hab ich einen Lieblingstrank, auch wenn der ziemlich scheiße ist will ich ihn trotzdem... ich weiß klingt eigenartig [smilie--sprite1][BR][BR]Ich schwöre Euch ich hab alles versucht, damit das Ding effizienter wird, so viel hab ich schon lange nicht geschimpft aber INNO ist ziemlich erfahren in der Meditation... wie ein Stein.[BR]Also machen wir das Beste daraus, es gibt hier viele kreative Köpfe, man wird da schon was raus holen können ob für GA, Turm, Turnier oder einfach nur für das normale Kapitel spielen.[BR][BR]Tatsächlich wissen wir noch gar nicht wo das Ende beim Leveln eines Trank liegt, ich vermute zwar bei Lvl 100 aber bestätigen könnte das bisher niemand... ich habe gehofft das Karvest die Info bringt aber der hielt es für eine gute Idee 3 Tränke zu leveln und dann konnte er seinen Lieblingstrank nicht mehr bezahlen, nun dümpelt er irgendwo bei Lvl 86 wenn ich das noch richtig im Kopf hab... also wenn jemand von euch die 101 Lvl bei einem Trank knackt, macht doch mal ein Bild.[BR][BR]Wenn es mehr als 100 Lvl gibt z.B. unendlich, dann könnte der Kessel wirklich mal sehr interessant werden.[BR][BR]Oki dann viel Spaß und Erfolg morgen [smilie--sprite1]"}, {"2": "Jammin schrieb:\t\t\tich vermute zwar bei Lvl 100\t\tZum Vergrößern anklicken.......so steht es im Wiki...[BR][BR][IMG]https://i.ibb.co/6R9LKR2/https-de-forum-elvenar-com-index-php-attachments-kessel-png-33218.png[/IMG]"}, {"94": "Aha na dann hoffen wir mal das dort irgendwann mal was anderes steht [smilie--sprite1]"}, {"12": "Ich frage mich, können wir ab Montag 6 Tage nur die Daumen drehen, da die Zauberin nur samstags Zutaten sammelt, und ohne Zutaten wird wohl nichts gehen?[BR]Zudem stellt sich die Frage, wonach es sich richtet, was die Zauberin an Zutaten findet - kann es sein, daß sie gar nichts findet wenn man Pech hat?"}, {"103": "Sie findet immer was, es wechselt nur wöchentlich, was man \"frei\" verwenden kann, also mit Bezahlung durch Hexenpunkte und welche Zutaten mit Dias bezahlt werden müssten."}, {"81": "Das Feature ist wie der Turm damals[BR][BR]Es kommt live, niemand juckst wirklich weil es so schlecht designt ist das es erstmal 3 Umbauten (wie der Turm) braucht um Ansatzweise gut, flüssig und gescheit in den Spielfluss eingebettet zu werden.[BR][BR]Das Feedback war am Beta genau so aber Juckt halt nicht.[BR]Die meisten werden das ding erstmal rigoros ignorieren jedenfalls in der Bubble in der ich mich befinde.[BR][BR]Hier wird nur wieder versucht etwas zu \"erfinden\" um mehr Geld zu scheffeln also ob die Liga da nicht reichen würde....... für das was hier pro Woche verlangt wird kommt einfach mMn zu wenig von Inno zurück.[BR][BR]Gebe dann mein Feedback in 6 Monaten wieder nach dem xten Patch und Umbauten des Features."}]