[{"14": "ich finde am Kessel die Zeit so richtig doof:[BR]er startet, wenn noch kein Turnier ist[BR]und er endet, wenn noch Turnier ist[BR][BR]auch wenn ich nicht explizit auf die Turnierbooster gehe, so hatte ich durchaus den Fall, dass ich sie trotz geringer Wahrscheinlichkeit ausschließlich bekam (und sogar 3 austauschen durfte) und der mit Wahrscheinlichkeit von 60% nicht erschien..[BR]also: ich würde es echt vorziehen, wenn der Kessel am letzten Tag des Turniers startet oder am ersten Tag[BR][BR]in der Zwischenzeit vergesse ich ihn laufend, liegt vermutlich an mir[BR]aber die nette Meldung der Zauberin ist dann, wenn ich ihn nutzen sollte (wegen Turnier) schon nicht mehr aktuell"}, {"28": "Neris schrieb:\t\t\tch finde am Kessel die Zeit so richtig doof:[BR]er startet, wenn noch kein Turnier ist\t\tZum Vergrößern anklicken....Moin @Neris Du musst ja nicht sofort brauen wenn die Zauberin aus den Wäldern zurück ist.[BR]Du kannst die Zauberin auch einfach in der magischen Akademie auf dich warten lassen und zum Beispiel erst Dienstagabend zum Turnierstart brauen."}, {"14": "ja, ich weiß[BR]aber abends ist blöd, weil ich gerne die Nachtproduktion fertig haben möchte, falls es dort einen Effekt gibt. auch die Münzen sind morgens in höherer Zahl da[BR]morgens gibt es immer mehr zu ernten...[BR][BR]aber gerade dann werde ich nie daran erinnert, wenn das Turnier läuft, dass ich ja auch brauen könnte...[BR]das winzige Ausrufezeichen in der Aka sehe ich meist zu spät..[BR][BR]..also Dientagabend Turnier ist doof, da es abends startet und die langen Sachen alle eingesammelt sind,[BR]2. Tag Turnier ist doof, da so ohne Zeitschleife das Turnier morgens noch nicht bereit ist[BR]am 3. Tag Turnier habe ich längst vergessen, dass es einen Kessel gibt..lol[BR][BR]ich sollte mir ein Post-It an den Bildschirm kleben [smilie--sprite2][BR][BR]wie gesagt, am allerliebsten käme die Meldung, dass die Zauberin aus dem Wald wieder da ist am letzten Tag Turnier morgens, bevor ich alles einsammel...[BR]jaja, man kann nicht alles haben[BR][BR]aber die Zeiten des Kessels gefallen mir einfach nicht..so als Feedback [BR][BR]meist braue ich dann erst, wenn wiederum eine Meldung kommt, dass ich ja nur noch 1 Tag Zeit habe...die sehe ich dann ja auch[BR]aber dann ist sowieso alles unpassend..irgendwie..keine langen Produktionen, Turnier gerade nicht bereit oder sonstwas..[BR]aber ich versuche dann noch die bestmögliche Zeit zu finden[BR][smilie--sprite2]"}, {"2": "Neris schrieb:\t\t\taber abends ist blöd, weil ich gerne die Nachtproduktion fertig haben möchte, falls es dort einen Effekt gibt. auch die Münzen sind morgens in höherer Zahl da[BR]morgens gibt es immer mehr zu ernten...\t\tZum Vergrößern anklicken.......diese Effekte bekommst du aber recht schnell auf +12 Stunden und kannst somit die nächste Nachtproduktion auch mitnehmen..."}, {"286": "gibt es denn inzwischen eine Seite, wo man erfolgreiche Rezepte finden kann?"}, {"155": "Im US-Forum arbeiten sie dran, aber da das ganze jeweils anders aussieht, je nachdem wieviele Diplomas man hat, ist das leider alles nicht so einfach."}, {"28": "Matze1066 schrieb:\t\t\tgibt es denn inzwischen eine Seite, wo man erfolgreiche Rezepte finden kann?\t\tZum Vergrößern anklicken....Nein, in deutscher Sprache bislang nicht.[BR][BR]Es steht aber auch allen deutschen Spielern und Spielerinnen frei, einen Thread zu dem Thema ins Leben zu rufen.[BR][BR]Das Forum soll ja schließlich auch dem allgemeinen Austausch von Wissen und Erfahrungen innerhalb der Community dienen. ;-)"}, {"113": "Matze1066 schrieb:\t\t\tgibt es denn inzwischen eine Seite, wo man erfolgreiche Rezepte finden kann?\t\tZum Vergrößern anklicken....Ich stelle mir das echt schwer vor, sowas zu erstellen, da die Voraussetzungen für ein erfolgreiches Rezept, das der Eine kreiert hat, bei der Anderen wahrscheinlich nicht existieren.[BR]Und was mir erfolgreich scheint, muss dir noch lange nicht genügen.[BR][BR]Nach dem Bisschen Erfahrung, das ich bisher gesammelt habe, gilt, je mehr Zutaten ich in den Kessel gebe - dabei ist es egal, ob gleiche oder verschiedene - umso größer sind die Chancen auf einen Erfolg."}, {"14": "ich denke, das wird jedes Kapitel bzw. mit der Anzahl der Diplome anders[BR]ich habe 3 Städte[BR]ich kann nicht einfach Rezepte übernehmen[BR]da kommt jeweils etwas völlig anderes bei raus[BR]mittlerweile hilft mir auch die Aufstellung von Romilly nicht mehr wirklich[BR]weil nun schon die zweite Stadt genau die Dinge bekommt (und das 4x zum Tauschen) mit einem geringen Prozentsatz und der höchste Prozentsatz von über 40% unter den Tisch fällt (und das nun schon in der zweiten Woche), obwohl es nur 2 Positionen für den Trankeffekt gab, einer über 40%, einer um die 15%..[BR]kann man so ein Pech haben? [BR][BR]und ja, ich habe dann heute gebraut, da die Warnung beim Einloggen kam, dass die Zauberin in 24 h verschwindet[BR][BR]für mich persönlich:[BR]dass ich irgendwo im Spielfeld augenscheinlicher am Zustand der Zauberin erinnert würde als quasi nur am letzten Tag [BR](am ersten Tag ist sie mir weniger nützlich, aber da bemerke ich auch das sie wieder da ist durch Icon und Info)"}, {"2": "Neris schrieb:\t\t\tmittlerweile hilft mir auch die Aufstellung von Romilly nicht mehr wirklich[BR]weil nun schon die zweite Stadt genau die Dinge bekommt (und das 4x zum Tauschen) mit einem geringen Prozentsatz und der höchste Prozentsatz von über 40% unter den Tisch fällt (und das nun schon in der zweiten Woche), obwohl es nur 2 Positionen für den Trankeffekt gab, einer über 40%, einer um die 15%..\t\tZum Vergrößern anklicken.......deshalb versuch ich auch nicht, einen Effekt auf möglichst hohe % zu bringen, sondern total ungewünschte Effekte komplett aus der Liste zu schmeißen...beim Rest entscheidet sowieso der Zufall - ich versteif mich da nicht...wenn du die % gleichmäßiger verteilst, hast du wenigstens eine höhere Chance, unterschiedliche Effekte zu treffen...[BR][BR]...ob dann sowas dabei raus kommt, ist reine Glückssache...[BR][BR][IMG]https://i.ibb.co/M28zjb1/https-de-forum-elvenar-com-index-php-attachments-1-png-34119.png[/IMG][IMG]https://i.ibb.co/t4HMfGD/https-de-forum-elvenar-com-index-php-attachments-2-png-34120.png[/IMG][IMG]https://i.ibb.co/9gQVt6Z/https-de-forum-elvenar-com-index-php-attachments-3-png-34121.png[/IMG][BR][IMG]https://i.ibb.co/p2dKVzf/https-de-forum-elvenar-com-index-php-attachments-4-png-34122.png[/IMG][IMG]https://i.ibb.co/8Ksx5Ty/https-de-forum-elvenar-com-index-php-attachments-5-png-34123.png[/IMG][IMG]https://i.ibb.co/bvthJsz/https-de-forum-elvenar-com-index-php-attachments-6-png-34124.png[/IMG][IMG]https://i.ibb.co/PFDGRSk/https-de-forum-elvenar-com-index-php-attachments-7-png-34125.png[/IMG][IMG]https://i.ibb.co/bR2v2SR/https-de-forum-elvenar-com-index-php-attachments-8-png-34126.png[/IMG]...3 Kampfeffekte (alle kritisch) + mein Werkzeug....[BR][BR]Matze1066 schrieb:\t\t\tgibt es denn inzwischen eine Seite, wo man erfolgreiche Rezepte finden kann?\t\tZum Vergrößern anklicken.......was genau verstehst du unter einem \"erfolgreichen\" Rezept?...[BR][BR]...anhand dieser Tabelle Spoiler: Tabelle[IMG]https://i.ibb.co/6ZhxDW0/https-de-forum-elvenar-com-index-php-attachments-effekte3-png-34127.png[/IMG]...links die \"value\", rechts die \"factor\"-Werte[BR]...die beiden Fehler in den Effekten Orks und Gut3 hab ich rot markiert......kann man sein Rezept variieren - wer dennoch nach hohen % strebt, kann sich auch mal die Hilfsprogramme von Karvest ansehen... [IMG]https://i.ibb.co/sHqhN4k/https-de-forum-elvenar-com-index-php-attachments-potenzen-png-34128.png[/IMG][BR][BR]....ich such mal den Link...  https://beta.forum.elvenar.com/index.php?threads/the-cauldron.18155/post-112433[BR][BR]...für eine möglichst hohe Wahrscheinlichkeit muss man sowohl die \"value\" als auch die \"factor\"-Werte möglichst hoch schrauben...[BR][BR]...bei \"factor\" wird mit einer Hochzahl gerechnet - bei einer negativen Hochzahl - also hoch -4 z.B. - wird der Kehrbruch verwendet - man rechnet also nicht mehr 1,1 x 1,1 x 1,1 usw, sondern den Kehrbruch davon (1:1,1) - also 0,0909... x 0,0909.... x 0.0909... usw.[BR][BR]...was zur Folge hat, daß sich die Anteile aus den value-Werten bei +7 \"factor\" in etwa verdoppeln und bei +12 verdreifachen, bei -7 \"factor\" dann allerdings halbieren und bei -12 dritteln - womit man dann eben die \"value\"-Werte noch einmal stark beeinflussen kann (geht aber nur, wenn \"value\" auf mindestens +1 ist und natürlich auch nur bei Verwendung von entsprechend vielen Zutaten mit \"factor\"...)[BR][BR]...(siehe hierzu z.B. TG_St - da werden aus 26 \"value\" durch hoch +11 74,18 Anteile, die auf 100 % bezogen 66,32 % ausmachen und auf die Erfolgsrate dieses Rezeptes von 87,15 % sind das dann 57,8 % in der Rezeptliste)..."}, {"113": "Neris schrieb:\t\t\tkann man so ein Pech haben?\t\tZum Vergrößern anklicken....Ach, da halte ich locker mit, ich hab auch schon Diamanten eingesetzt und dann gar nichts bekommen. Diese Woche habe ich in einer Stadt das große Glück, dass alle Zutaten, die mir die gewünschten Effekte bringen würden, nur mit Diamanten zu bekommen sind. Da werde ich noch ordentlich rumprobieren müssen.[BR]Ich betrachte das als Lehrgeld. [BR][BR]In der Kürze der Zeit, die wir den Kessel jetzt haben, haben wir ja noch kaum Erfahrungen sammeln können. Deshalb versuche ich mich inzwischen an dem, was Romilly unter anderem vorgeschlagen hat: Nicht nur auf einen Effekt konzentrieren, sondern einen Trank brauen, der 1. mehrere Effekte enthält, die mir gefallen und 2. so wenig, wie möglich bis gar keine, die mir nicht gefallen. Dann ist das Gefühl von Erfolg größer [smilie--sprite2][BR]Und, ich schrieb es schon, die Anzahl der Zutaten ist wichtig, je mehr du reinpackst, umso größer sind die Erfolgsaussichten.[BR][BR]Aber weil wir es hier mit einer irren Menge an Wahrscheinlichkeiten zu tun haben, gibt es keine Garantie auf nichts, das sollte allen klar sein.[BR]Deswegen ist der Wunsch nach erfolgreichen Rezepten zwar verständlich, meiner Meinung nach aber eher nicht erfüllbar."}, {"14": "den besten Effekt hatte ich bisher, als ich in meiner kleinsten Stadt nur einen einzigen Effekt hatte, auch so um 40%: der kam dann auch und ich durfte \"sogar\" aussuchen..[BR]aber bei 2 Effekten einer über 40%, der andere um 15% klappte das schon nicht mehr[BR][BR]und die Tipps, doch lieber ganz viele Effekte zu nehmen (und unerwünschte rauszuschmeissen) und sich dann daran erfreuen, was so kommt ist bei kleinen Städten bei denen die Effekte alle nur 1 Stern haben und nur 2 ein bisschen hochlevelt sind, nicht so einfach..je nachdem wo die Dias sitzen und man die nicht nutzen möchte[BR][BR]wenn man alles so ein wenig hochgelevelt hat, sieht das vermutlich mal anders aus...man wird da auf Zeit setzen müssen[BR][BR]nur hat man echt wenig Lust überhaupt was zu leveln, wenn man etwas bekommt, was man gar nicht wollte, weil man es nicht ausmerzen konnte, sondern nur reduzieren..[BR][BR]achja..und bei mir im Bündnis vergessen viele, dass es den Kessel überhaupt gibt, da bin ich nicht alleine..[BR]ohne die heutige Erinnerung, hätte ich ihn wieder vergessen.."}, {"2": "Neris schrieb:\t\t\tachja..und bei mir im Bündnis vergessen viele, dass es den Kessel überhaupt gibt, da bin ich nicht alleine..\t\tZum Vergrößern anklicken.......und deshalb sollte INNO ein paar Fragmente und automatische Hexenpunkte mehr ins Spiel bringen, damit mal ein paar Spieler auf den Geschmack kommen - bei mir macht es sich schon sehr bemerkbar, ob da noch ein Effekt läuft oder nicht - ich freu mich immer darauf, am Freitag und darauf am Dienstag wieder brauen zu können - meine Effekte sind auch schon hübsch hoch (5x 80, 2x 75, 1x 60, 6x 50, 6x 45)..."}, {"113": "Neris schrieb:\t\t\tund die Tipps, doch lieber ganz viele Effekte zu nehmen (und unerwünschte rauszuschmeissen) und sich dann daran erfreuen, was so kommt ist bei kleinen Städten bei denen die Effekte alle nur 1 Stern haben und nur 2 ein bisschen hochlevelt sind, nicht so einfach..je nachdem wo die Dias sitzen und man die nicht nutzen möchte\t\tZum Vergrößern anklicken....Okay, was kleine Städte betrifft, kann ich nicht mitreden.[BR]Aber ich gehe davon aus, dass wir die ganze Kesselgeschichte, auch mit kleinen Städten, ganz anders wahrnehmen als NeuanfängerInnen, die gar nichts anderes kennen.[BR][BR]Vermutlich wird INNO da noch nachbessern müssen."}, {"50": "Ich habe bis dato \"0\" Zauberspruchfragmente verwendet, entsprechend auch keine Dias.[BR]Das spare ich mir, da mich das pimpen der Effekte vor dem Trinken des Zaubertranks nicht interessiert. Das erledige ich nach dem ich den Trank genommen habe und pimpe dann erst durch Nutzung der freizugängigen Ressourcen (Güter, Münzen, Werkzeuge usw.) die Effekt für die Folgewoche.[BR]Weiterhin habe ich mich auf 4 Effekte konzentriert, die ich Woche für Woche immer weiter ausbaue -> [BR][BR][IMG]https://i.ibb.co/qy4FsMK/https-de-forum-elvenar-com-index-php-attachments-1676642789056-png-34130.png[/IMG] [IMG]https://i.ibb.co/dmHz77c/https-de-forum-elvenar-com-index-php-attachments-1676642808688-png-34131.png[/IMG][BR][BR][IMG]https://i.ibb.co/wps4zHC/https-de-forum-elvenar-com-index-php-attachments-1676642830438-png-34132.png[/IMG] [IMG]https://i.ibb.co/PGn0LFY/https-de-forum-elvenar-com-index-php-attachments-1676642855839-png-34133.png[/IMG][BR]--------------------------------------------------------------------------------------------------------------------------------------------------------[BR]Vorrangig liegt mein Fokus in Anbetracht des näher kommenden Kapitel XXI auf Saat und Unurium.[BR]--------------------------------------------------------------------------------------------------------------------------------------------------------[BR]Hier sieht man, sofern ich Glück habe beim schlürfen der Tränke, so wie heute, wie sich das dann als Effekt in Zahlen auswirkt -> [BR][IMG]https://i.ibb.co/PTGZhVR/https-de-forum-elvenar-com-index-php-attachments-1676643009184-png-34134.png[/IMG][BR]Das sind die Wirkungsdauern, die ich letzte Woche durch das Aufpimpen eingestellt hatte. Es sei auch angemerkt, dass sich das bei meinen eingesetzten Ressourcen (diverse Güter, Münzen und Werkzeuge) nicht grossartig bemerkbar gemacht hat.[BR]--------------------------------------------------------------------------------------------------------------------------------------------------------[BR]Hier ein paar Beispiele, wie sich die Effekt auf diverse Gebäude auswirken -> [BR][BR][IMG]https://i.ibb.co/bmDZ22K/https-de-forum-elvenar-com-index-php-attachments-1676643357917-png-34135.png[/IMG][BR][BR]Wie eingangs betont, haben mich die aktuellen Effekt bisher keine Zauberspruchfragmente oder Dias gekostet, da das nur für Ungeduldige zutrifft, die jetzt und sofort eine Verbesserung vor dem Trinken des/der Zaubertranks/Zaubertränke erzielen wollen.[BR][BR]Für mich gilt beim dem Feature \"Zaubertrank\" -> \"In der Ruhe liegt die Kraft\" und \"Gut Ding braucht Weile\""}, {"2": "...naja - mit max. Fragment/Dia-Einsatz + Kritischem Treffer kann man halt dann auch aus dem da ...[BR][IMG]https://i.ibb.co/1q6hbx1/https-de-forum-elvenar-com-index-php-attachments-fragmente3-png-34136.png[/IMG]...das da...[IMG]https://i.ibb.co/NsBMCtZ/https-de-forum-elvenar-com-index-php-attachments-k6-png-33585.png[/IMG]....machen - das macht dann schon einen großen Unterschied...[BR][BR][BR]....ich hoffe, daß das in Kapitel 21 dann auch öfters mal mit dem Portaleffekt klappt...(der ist jetzt auf Stufe 60)..."}, {"9": "Romilly schrieb:\t\t\t...naja - mit max. Fragment/Dia-Einsatz\t\tZum Vergrößern anklicken....Wie lange muss ich mir hier mit anderen noch deine Ratschläge inkl. XXX Bilder, welche nur durch PREMIUMWÄHRUNG oder mit PREMIUMWÄHRUNG erreicht werden, ansehen und zureden lassen?[BR][BR]Gewinne welche durch PREMIUMWÄHRUNG erzielt werden - sind weder Ratschläge für die Allgemeinheit noch stehen sie zum Verhältnis oder möchtest du hier alle zum Kauf von PREMIUMWÄHRUNG raten?[BR][BR]Schön wenn welche 2427 Welten spielen um hier und da 250.000 Diamanten abzuholen oder jede Woche 20 Euro investieren oder generell einfach zu viel davon haben - was auch immer, aber das sind die mit abstand unbrauchbarsten Ratschläge die man geben kann! Denn viele Spieler schwimmen nicht in PREMIUMWÄHRUNG oder haben diese generell zur Verfügung![BR][BR]Es ist nicht schön, wie du hier auf XXX Seiten deine Erfolge via Bilder postest, wo du jedoch stets Diamanten, demnach PREMIUMWÄHRUNG einsetzt! [BR]Wenn du so etwas präsentierst und dann so in etwa schreibst ..... .. .. .. \"Es ist alles so Easy\", dann betrifft das nämlich in erster Linie rein dich und hilft definitiv hier niemand! Es sei denn INNO bezahlt dich hier dafür, dass du uns allen zeigst, \"mit Diamanten geht das\" und sollst uns oder einen gewissen Teil zum kaufen animieren und das wiederum glaube ich nicht![BR][BR]Könnte man das dann nicht einfach mal lassen und es auf normalen Wege (den alle nutzen können) versuchen.[BR]Ach ja ... .. .. und mit Feedback hat das ganze dann auch nichts mehr zu tun, sondern eher mit Protzen/Angeben, besonders wenn man dann noch dazu schreibt, \"die paar Dias tun mir nicht weh\"! Ja, aber diese paar Dias, hat eben nicht jeder und schon gar nicht wie in deinem Fall jede Woche an die 500 Dias (siehe deine Bilder).[BR][BR]Was hat das hier noch mit Feedback zu tun - was?[BR][BR]Möchte man hier Schleich-Werbung machen und zum kauf von Premiumwährung raten/anregen?[BR][BR]Sorry für das OT und ich entschuldige mich vorweg bei der CM @Tacheless, denn es kann nicht angehen, dass es bereits mehrere erwähnten hier im Thread und man macht weiter und weiter und weiter ..... ... ...[BR]Sachen, welche ich rein nur mit Premiumwährung erziele und erreiche sind und bleiben keine Hilfe für die Allgemeinheit (Mehrheit der Spieler) Punkt und Fakt! Ein Feedback ist das eben auch nicht!"}, {"2": "AngelOfDead schrieb:\t\t\tWie lange muss ich mir hier mit anderen noch deine Ratschläge inkl. XXX Bilder, welche nur durch PREMIUMWÄHRUNG oder mit PREMIUMWÄHRUNG erreicht werden, ansehen und zureden lassen?\t\tZum Vergrößern anklicken.......gar nicht - du kannst mich auch gerne einfach auf \"Ignore\" setzen..."}, {"178": "Ich schließe mich da AngelOfDead an.[BR][BR]Etwas an hilfreichen Infos ist ja dabei...[BR][BR][IMG]https://i.ibb.co/M28zjb1/https-de-forum-elvenar-com-index-php-attachments-1-png-34119.png[/IMG][BR][BR]aber 500 Dias in einem Hexenkesselrezept als allgemein sinnvoller Tipp[smilie--sprite9][BR]Bitte lass es sowas als hilfreich für alle zu sehen @Romilly[BR][BR]Gibt nicht viele die in deiner Welt leben möchten!"}, {"9": "Hanlar schrieb:\t\t\taber 500 Dias in einem Hexenkesselrezept als allgemein sinnvoller Tipp[smilie--sprite9]Zum Vergrößern anklicken....Es ist kein Tipp Punkt aus fertig, denn du hast selber erkannt, dass nicht jeder in Diamanten schwimmt und ganz obendrein bemerkt ist das auch nicht wirklich Schlau oder? Denn wo ich Premium einsetze - kann man folglich nicht mehr von Gewinn sprechen.[BR]Klar habe ich maximale Chancen, wenn ich Premium nutze, doch wie viele Spieler haben Premium in Hülle und Fülle und das jede Woche mal eben 500 Dias?[BR][BR]Feedback wäre das hier .. .. .. .. ..[BR][BR]Ich finde die Überlegung zum Hexenkessel gut und sicherlich macht das den ein oder anderen Spaß, aber der Gewinn, welchen ich damit derzeit erziele, ist für mich kein Gewinn, denn ich muss erst einmal zig Ressourcen reinstecken um ansehnliche Zeiten, Mengen und Erfolge zu haben.[BR][BR]Um dies also zu Bewerten, muss ich und viele andere noch etliche Monate warten. Denn weder habe ich zig Millionen Ressourcen zur Verfügung, noch kann ich es mir leisten Premiumwährung (Diamanten) einzusetzen.[BR]Von dem her, ist dies mein Vorab-Feedback und das ist demzufolge nicht so toll, da es mich so nicht reizt oder anspricht. Natürlich muss man nicht gleich immer alles und sofort haben, aber hier fehlt mir dann auch schon mal der Anreiz.[BR][BR]So gingen 40 Millionen Güter drauf, damit ich z.B. die Stufe 80 Kasernen-Einheiten erhalte. Ok, gut und schön, denn ich wollte ansehnliche Zeiten, Mengen etc. Doch wie viele Spieler haben mal eben 40 Mille Güter?[BR][BR]Nun habe ich einiges aufgestuft und bewege mich zwischen den stufen 55 - 85 und erhoffte mir so ansehnliche Werte, Zeiten und Mengen.[BR]Doch was ist das .. .. .. .. ja was ist denn das .... ... ??? Selbst die Millionen Ressourcen die ich in das aufstufen investierte bringen mir nicht unbedingt den besagten Erfolg .. ... ???[BR]Warum .... ??? Na weil da immer noch dieser Zufalls- und Glücksfaktor eine Rolle spielt.[BR][BR]So habe ich für \"mich\" erkannt, dass der Hexenkessel ein nettes Feature sein könnte, aber bei dem Kostenpunkt denke ich mir ... .. [BR]\"ne, das muss nicht sein und schon gar nicht, wenn es dann nicht einmal garantiert ist, denn dieser Zufall und Glücksmodus, geht mir auf den Zeiger\".[BR][BR]Außerdem hinterfragte ich mich mehrmals, wie viele Spieler haben A.) diese Mengen an Ressourcen um das ganze ansehnlich nach oben zu Stufen und B.) wie lange dauert es wohl, bis ich das wieder drin hab, sodass ich dann von einem Gewinn/Mehrwert sprechen kann?[BR][BR]Für mich definitiv noch viel zu früh um das zu Bewerten und sollte es so bleiben, dann mach ich den Hexenkessel solala nebenbei, aber erfreuen kann ich mich daran nicht, denn ein Mehrwert ist für mich weder erkennbar noch abgreifbar.[BR][BR]Es mag durchaus sein, dass man durch den Einsatz von Premiumwährung höhere Chancen hat und bessere Erfolge feiert, aber wieso etwas so kostbares für ein paar Stunden einsetzen? Zumal ich dann definitiv nicht von einem Gewinn sprechen kann, denn Premiumwährung ist eben das was es ist und bleibt - Premium / Echtgeld in einem Spiel wie diesen.[BR]Selbst wenn ich Premiumwährung gewinne, was definitiv ein Erfolg ist, dann setze ich diese nicht für einen eventuellen weiteren Erfolg ein, welcher aber vom Zufall und Glück abhängt. Hierfür muss ich weder Mathemeister oder Professor sein, sondern hierfür langt Grundschulwissen. [smilie--sprite7][BR][BR]Soweit mein Feedback nach nun gut 3 Wochen Hexenkessel."}]