[{"1": "Nicht jeder Tipp ist für jeden sinnvoll/machbar. Auch hier gilt, dass jeder eine eigene Meinung haben darf und diese auch vertreten darf - egal ob es irgendwen nervt. Das verhält sich nun mal genauso wie auch mit Feedback: Jeder darf seine eigene Meinung haben und diese auch äußern. [BR][BR]Und damit möchte ich jetzt nichts mehr davon hören und hier nur noch Feedback lesen!"}, {"203": "Mich nervt der Hexenkessel nicht... schön zu sehen, wenn man 7 Mio Münzen inzwischen braucht für 645 Hexenpunkte... Somit ist selbst bei etwas, wo man ausnahmsweise genug bekommt, der Ertrag vom Kessel mehr wie zweifelhaft (vor allem das Zufallsprinzip - wenn es wenigstens Garantie wäre). Das schönste Bild fehlt aber in diesem Thread... Samstags - da kann man garnichts machen im Kessel. Es ist Ruhetag"}, {"9": "Tacheless schrieb:\t\t\tNicht jeder Tipp ist für jeden sinnvoll/machbar. Auch hier gilt, dass jeder eine eigene Meinung haben darf und diese auch vertreten darf - egal ob es irgendwen nervt. Das verhält sich nun mal genauso wie auch mit Feedback: Jeder darf seine eigene Meinung haben und diese auch äußern.\t\tZum Vergrößern anklicken....Ah ok, dann darf aber auch niemand für seine Meinung angegriffen werden oder?[BR].. .. .. und nein ich griff damit niemand an, sondern gab ebenfalls nur meine Meinung ab![BR]Was das Thema Sichtweisen und Meinungen betrifft, da scheinen einige Sonderrechte zu haben und da du selbst dazu gehörst, welche mir und anderen stets in all den Jahren erklärt hat, \"dass jeder eine andere Sichtweise und Meinung hat\", dann sollte man das dann auch akzeptieren oder? Doch was ich absolut nicht akzeptieren kann ist, wenn man sich permanent auf etwas versteift und gar im Kreis fährt, indem man es immer und immer wieder tut und das selbst nach mehrmaligen bitten anderer. Aber gut lassen wir das .. .. .. Es waren auch deine Worte, die hier im Forum hießen, \"wenn ihr da Dias reinknallt wie doof (so ähnlich), dann seid ihr doch selber Schuld (Feedback-Thread Kapitel 20).[BR]Hier wird permanent sichtlich gezeigt, was man mit dem Einsatz von Premiumwährung erreicht und das ist KEIN FEEDBACK und obendrein meine Meinung und mit der stehe ich ganz sicher nicht alleine da![BR][BR]Tacheless schrieb:\t\t\tUnd damit möchte ich jetzt nichts mehr davon hören und hier nur noch Feedback lesen!\t\tZum Vergrößern anklicken....Gut ..... Feedback gab ich ab und fertig. Ich akzeptiere deinen Dialog aber es wäre dann auch schön, wenn ihr Mods ebenso alle akzeptiert![BR]PS.: Denn zu einem Dialog oder nennen wir es gar Streit (wie es manchmal ausgelegt wird), gehören immer mindestens zwei und hierbei ist es dann erstmal egal, wer anfing und was von sich gegeben hat, denn das weiterführen, mitmachen etc. macht es definitiv nicht besser."}, {"1": "Ich habe dir nicht deine Meinung verboten. Ich habe nur erklärt, dass ihr zum eigentlichen Feedback zurück kommen könnt - dies gilt übrigens für beide Parteien, nicht nur für dich, @AngelOfDead . Und ich glaube nicht, dass ich jemanden für doof erklärt habe, der Dias im Spiel einsetzt/eingesetzt hat. [BR][BR]Das alles hat aber nichts mit dem Feedback zum Hexenkessel zu tun. Demnach: Letzte Ansage: Bitte zum Feedback zum Hexenkessel zurück kommen. Danke."}, {"113": "Meine Güte, dann schaut die Bilder halt nicht an, sie tun doch niemandem weh. Ich tus auch nicht, mir sind Maximalwerte aktuell noch sowas von egal. Außerdem spiele ich erst halb so lange und bin erst in Kapitel 15, konnte also noch gar nicht so viel ansammeln. Aber es ist nett, zu wissen, dass sie da sind, falls ich doch mal was wissen möchte. [BR]Und Romilly schreibt auch nicht, hey Leute, schaut mal wie geil ich bin und was ich alles mache und genauso müsst ihr das auch machen. [BR]Sie zeigt nur auf, was sie macht und überlässt die Interpretation den LeserInnen. Wenn die dann daraus ein Angeben machen, ist das allein deren Problem.[BR][BR]So, zum Feedback:[BR]Sind es erst drei Wochen?[BR]Ich meine, ich hätte schon vier Mal was gebraut, egal.[BR]Ich habe mich in zwei von drei Städten eher auf die Stärkeeffekte der Truppen eingeschossen und diese auf was zwischen 30 und 40 aufgelevelt. Zusätzlich habe ich den meisten Gütereffekten auch noch ein paar Spenden zukommen lassen.[BR]Ich habe mich dabei nicht verbiegen müssen, denn meine Lager sind so voll, ich kann das gar nicht alles ausgeben. (Ist das auch schon Angeberei?)[BR]Eine der Städte schwimmt außerdem in Fragmenten (da gehe ich jede Woche den Turm nach ganz oben). Die andere hat akuten Fragmentemangel, ich bin zu geizig, um mein Inventar mal zu entschreddern. Das macht sich dann auch bei den Tränken bemerkbar.[BR]Wenn sich ein Erfolg beim Trinken ergibt, dann macht sich das bei mir durchaus im Kampf zufriedenstellend (das ist ja der Punkt) bemerkbar.[BR]Ich kann für mich sagen, dass, wenn sich ein Erfolg einstellt, ich durchaus einen Mehrwert empfinde.[BR]Habe ich keinen Erfolg, nunja, dann ist das so, ich ärgere mich jedenfalls nicht.[BR]Da ich grundsätzlich kein Geld ausgebe, ist mein einziger Einsatz Zeit; von der habe ich, genau wie von den Gütern, reichlich. Für mich ist der Kessel also ein weiteres, nett zu spielendes Element."}, {"28": "lovelymonster schrieb:\t\t\tAch, da halte ich locker mit, ich hab auch schon Diamanten eingesetzt und dann gar nichts bekommen.\t\tZum Vergrößern anklicken....[BR]AngelOfDead schrieb:\t\t\tSchön wenn welche 2427 Welten spielen um hier und da 250.000 Diamanten abzuholen oder jede Woche 20 Euro investieren oder generell einfach zu viel davon haben - was auch immer, aber das sind die mit abstand unbrauchbarsten Ratschläge die man geben kann! Denn viele Spieler schwimmen nicht in PREMIUMWÄHRUNG oder haben diese generell zur Verfügung!\t\tZum Vergrößern anklicken....[BR]Ich denke lovelymonster's Beispiel zeigt, dass die Verwendung von Diamanten nicht immer ein Garant für Erfolg sein muss.[BR][BR]Die Verwendung von Großbuchstaben hingegen ist laut Forenregeln besser eher zu vermeiden.[BR][BR]Zitat Forenregel 4: \"Schreibe nicht alles in GROSSBUCHSTABEN, da dies als „Schreien“ aufgefasst wird\".[BR][BR]Zum Feedback:[BR][BR]Es ist immer noch erwünscht und allen Spielern freigestellt eigene Threads zum Thema Hexenkessel-Rezepte ins Leben zu rufen.[BR][BR]Man könnte ja zum Beispiel einen Hexenkessel-Rezepte-Thread anlegen in dem nur Rezepte ohne Chance auf kritische Effekte gepostet werden und einen weiteren für Rezepte mit Chance auf kritischen Effekt.[BR][BR]Ich denke es hilft in erster Linie weiter wenn man versteht welche Kombinationen von \"regulären\" (kostenlosen) Zutaten sich wie auf welchen Effekt auswirken."}, {"81": "lovelymonster schrieb:\t\t\tMeine Güte, dann schaut die Bilder halt nicht an, sie tun doch niemandem weh. Ich tus auch nicht, mir sind Maximalwerte aktuell noch sowas von egal. Außerdem spiele ich erst halb so lange und bin erst in Kapitel 15, konnte also noch gar nicht so viel ansammeln. Aber es ist nett, zu wissen, dass sie da sind, falls ich doch mal was wissen möchte. [BR]Und Romilly schreibt auch nicht, hey Leute, schaut mal wie geil ich bin und was ich alles mache und genauso müsst ihr das auch machen. [BR]Sie zeigt nur auf, was sie macht und überlässt die Interpretation den LeserInnen. Wenn die dann daraus ein Angeben machen, ist das allein deren Problem.\t\tZum Vergrößern anklicken....[BR]Das kann ich so unterstreichen einfach auf Blackliste packen und man wird nicht mehr genervt.[BR][BR]Doch die meisten Posts beziehen sich drauf wie toll der/die/das ist und ist nicht mal effizient sondern nur Quantitäten und hat nichts mit Qualitäten zu tun sondern ist halt nur eine Meinung und man sollte zwischen Meinungen und Fakten unterscheiden was oft nicht gemacht wird.[BR][BR]Aber das Problem das manche im Forum gleicher sind ist schon seit Jahren bekannt und ist hier mal wieder ein Paradebeispiel wie es nicht laufen sollte.[BR][BR]So zum Feedback da der Kessel ja schon jetzt paar Wochen im Spiel ist:[BR][BR]1) nettes Gimmick[BR]2) UI sehr unpraktikabel[BR]3) soll Fragmente und Dias aus dem Spiel ziehen[BR]4) nur eine weiterer Versuch von Inno Echtgeld zu lukrieren[BR]5) Bedarf noch weitere Überarbeitungen[BR][BR]Thebigunknown schrieb:\t\t\tMan könnte ja zum Beispiel einen Hexenkessel-Rezepte-Thread anlegen in dem nur Rezepte ohne Chance auf kritische Effekte gepostet werden und einen weiteren für Rezepte mit Chance auf kritischen Effekt.\t\tZum Vergrößern anklicken....[BR]Da das noch mehr als verbugt ist würd ich mit solchen Versuchen eher warten^^"}, {"2": "Thebigunknown schrieb:\t\t\tMan könnte ja zum Beispiel einen Hexenkessel-Rezepte-Thread anlegen in dem nur Rezepte ohne Chance auf kritische Effekte gepostet werden und einen weiteren für Rezepte mit Chance auf kritischen Effekt.[BR][BR]Ich denke es hilft in erster Linie weiter wenn man versteht welche Kombinationen von \"regulären\" (kostenlosen) Zutaten sich wie auf welchen Effekt auswirken.\t\tZum Vergrößern anklicken....[BR]...an den % der Wahrscheinlichkeit, einen bestimmten Effekt zu treffen, ändert sich ja durch Zugabe von Fragmenten nichts - Fragmente/Diamanten haben hier nur einen Einfluß auf die Stärke und Dauer des Effektes - die Stärke kann sich gegenüber des erforschten Wertes mit einem kritischen Treffer verdreifachen - die Dauer kann sogar um 4,5 mal verlängert werden...ohne Fragmente kann man dagegen auch nur die Hälfte der erforschten Werte bekommen (wenn man Pech hat sogar noch weniger - die Spannweiten sind hier nicht bekannt)..."}, {"61": "AngelOfDead schrieb:\t\t\tWie lange muss ich mir hier mit anderen noch deine Ratschläge inkl. XXX Bilder, welche nur durch PREMIUMWÄHRUNG oder mit PREMIUMWÄHRUNG erreicht werden, ansehen und zureden lassen?\t\tZum Vergrößern anklicken....[BR]Bis andere Spieler andere Ratschläge posten. Aber die verraten ja nichts.[BR][BR]@Neris ich komme mit der Tabelle von @Romilly auch mit den kleineren Städten sehr gut zurecht. Einfach das abdecken, was noch nicht in der Forschung freigeschaltet ist, also nur so viele Zeilen, wie man Diplome hat, anschauen, dann kommt man nicht durch einander."}, {"9": "Thebigunknown schrieb:\t\t\tZitat Forenregel 4: \"Schreibe nicht alles in GROSSBUCHSTABEN, da dies als „Schreien“ aufgefasst wird\".\t\tZum Vergrößern anklicken....Vielleicht bei dir. Ich wollte es damit lediglich hervorheben um besser zum Ausdruck zu bringen.[BR]Laut den Forenregeln sind auch noch nie Doppelposts erlaubt gewesen und nun schau mal hier in den Thread und in allen anderen. [BR]Auch gibt es laut den Forenregeln eine vorgegebene Bildgröße u.s.w. [BR][BR]Zum Feedback: [BR][BR]Es gibt immer zwei Seiten, ich bin die eine und andere eben die andere [smilie--sprite2]"}, {"103": "AngelOfDead schrieb:\t\t\tVielleicht bei dir. Ich wollte es damit lediglich hervorheben um besser zum Ausdruck zu bringen.[BR]Laut den Forenregeln sind auch noch nie Doppelposts erlaubt gewesen und nun schau mal hier in den Thread und in allen anderen.[BR]Auch gibt es laut den Forenregeln eine vorgegebene Bildgröße u.s.w.[BR][BR]Zum Feedback:[BR][BR]Es gibt immer zwei Seiten, ich bin die eine und andere eben die andere [smilie--sprite2]Zum Vergrößern anklicken....... und nur weil Andere mit großen Bildern von doppelten Häusern springen,[BR]musst Du es ja nicht tun ![BR][BR]Halte Du Dich doch an die Regeln und sei ein Vorbild für die Anderen."}, {"14": "ja, war wohl Pech, dass ich 2x in den Wochen die ganzen Kelche in den Sand gesetzt habe[BR]aber man kann eben auch nicht jedesmal die \"Lieblingszutaten\" nehmen, vor allem, wenn man manche 2 oder sogar 3x nutzen möchte, wenn sie dann Dias kosten..[BR]durch das Ausweichen klappt das dann auch mit der Tabelle bei mir nicht so, wie ich gerne hätte[BR][BR]wieso habe ich nur in einer Stadt dies hier?[BR][BR][IMG]https://i.ibb.co/yW4dyvY/https-de-forum-elvenar-com-index-php-attachments-screenshot-422-png-34157.png[/IMG][BR]in den beiden anderen sieht es so aus:[BR][BR][IMG]https://i.ibb.co/Vp5rTCp/https-de-forum-elvenar-com-index-php-attachments-screenshot-423-png-34158.png[/IMG][BR][BR]ich glaube, da war auch kein Ausrufezeichen"}, {"9": "littleFlex schrieb:\t\t\t... und nur weil Andere mit großen Bildern von doppelten Häusern springen,[BR]musst Du es ja nicht tun !\t\tZum Vergrößern anklicken....Nein, es geht darum, wenn man schon mit Forumregeln kommt, dann doch bitte für alle die gleichen Rechte.  [smilie--sprite2] [BR]littleFlex schrieb:\t\t\tHalte Du Dich doch an die Regeln und sei ein Vorbild für die Anderen.\t\tZum Vergrößern anklicken....Vorbild ganz sicher nicht, weil ich mir meine Meinung nicht nehmen lasse, aber an die Regeln in dem Sinn gerne [smilie--sprite2]"}, {"103": "Sorry, wie kann man nur so verbohrt sein und bei dem Hinweis auf Schreibweisen, die regelkonform sein mögen,[BR]seine Meinung weggenommen sehen ?[BR][BR]Das ist doch schon mehr als paranoid, mehr fällt mir dazu nicht mehr ein."}, {"9": "littleFlex schrieb:\t\t\tSorry, wie kann man nur so verbohrt sein und bei dem Hinweis auf Schreibweisen, der regelkonform sein mögen,[BR]seine Meinung weggenommen sehen ?\t\tZum Vergrößern anklicken....Keine Ahnung was du liest, aber lassen wir das jetzt .. .. .. denn sorry wie kann man nur so sein, dass ein Mod. nicht langt und ein weiterer ebenfalls OT sein Senf dazugeben muss. [smilie--sprite2] Wird aber nun zu viel OT, doch lass bitte deine Unterstellungen - Danke! [smilie--sprite2]"}, {"103": "Du weißt nicht, was ich da lese?[BR]Vielleicht weißt Du nicht mehr, was Du so schreibst...[BR][BR][IMG]https://i.ibb.co/Gxt0JGD/https-de-forum-elvenar-com-index-php-attachments-1676668666143-png-34159.png[/IMG][BR][BR]Ja und manche Extreme benötigen eben hier und da auch mehrere Mods,[BR]was auch regelkonform ist.[BR][BR]Auch sind Moderatorenhinweise auf Regeln alles andere als \"Senf\", das ist eine sehr unangebrachte Aussage."}, {"4": "Ich habe bisher nur 4 Tränke zur Auswahl, da ich -  zwar Kapitel 20 fertig - aber nur wenige Kapitel auch vollständig erkundet habe. Find ich persönlich nicht schlecht so, weil dann die jeweils verteilten Prozente wesentlich höher sind und ich nicht in allen Gassen \"dampfe\", sondern eben, wenn erfolgreich, auch wirklich was von habe."}, {"113": "Neris schrieb:\t\t\twieso habe ich nur in einer Stadt dies hier?[BR][BR][IMG]https://i.ibb.co/yW4dyvY/https-de-forum-elvenar-com-index-php-attachments-screenshot-422-png-34157.png[/IMG]Zum Vergrößern anklicken....Hast du da noch nicht gebraut gehabt?[BR][BR]Ich glaube, das kommt dann"}, {"14": "doch, hatte ich..und auch verbessert"}, {"2": "lovelymonster schrieb:\t\t\tSind es erst drei Wochen?[BR]Ich meine, ich hätte schon vier Mal was gebraut, egal.\t\tZum Vergrößern anklicken.......hab gerade festgestellt, daß ich schon 6 Tränke in Felyndral gebraut habe...den 1. am 13. Januar (Freitag)..."}]