[{"113": "Ah, doch schon länger.[BR]Ich führe nicht Buch, aber an mindestens 4 Mal kann ich mich definitiv erinnern."}, {"96": "Meine Meinung :[BR]-->  der Hexenkessel sollte Getränke in Flaschen herstellen , die man dann bei Bedarf trinken kann ![BR]um Missbrauch zu vermeiden ( Überdosis [smilie--sprite1] ) , könnte die Flasche ein Ablaufdatum haben, also bis Samstag.[BR]Dann kann man bereits am Wochenbeginn seinen Trank brauen u. im Laufe der Woche bei Bedarf trinken.[BR]Je nach Erfolg beim Brauen, dann zum Goldabholen o. fürs Turnier o. Turm, usw. [BR]Grund: ich vergesse ebefalls meist vor wichtigen Turnierschlachten(meist am Abend) ,den H-Kessel zu nutzen, oft gibts dann statt Kampfbooster ,ein Gold,o. anderen Booster den ich dann garnicht nutzen kann, sondern lieber früh getrunken hätte."}, {"203": "Ich bleibe bei meiner Meinung, dass der Hexenkessel paranoid ist... inzwischen ist dieses Wort ja für den Forumsgebrauch (vor allem gegenüber Menschen anzuwenden)... wenn man Mio von Gütern usw reinstecken muss um irgendwas zu bekommen, wo Zufall ist, dann ist das mehr als paranoid - ich beleidige da wenigstens niemand (komischerweise dürfen andere gegen Forenregeln verstossen und werden nicht gesperrt)"}, {"104": "00onkelz77 schrieb:\t\t\twenn man Mio von Gütern usw reinstecken muss um irgendwas zu bekommen\t\tZum Vergrößern anklicken....Wobei der Faktor 'etwas zu bekommen' nicht ganz unerheblich ist bei oft Quests die nach 'bekommen' gehen, oder auch manche Güter zerfallen.[BR]Paar Millionen Güter damit fest 100k Mana mehr am Tag oder was auch immer, kann man machen.[BR]Andersrum ne Million Mana gerade rumliegend ausgeben, damit Güterproduktion etwas steigend, kann man machen, soviel kostet Ausbau der hohen Manufakturen eh..[BR][BR]Ob Hexenkessel mit den temporären Zufallstränken da ein Weg, das freilich die Frage.[BR]Wie wäre es auch wenn Tränke die ganze Rest-Woche halten, oder evtl. genau 7 Tage, von Spezis Überlagerung über 2 Wochen zum besten Einsatz zu planen?[BR]Dafür, dass es in Akademie locker Bonusgebäude wie 25% mehr Leben für 5 Tage für überschaubare Kosten gibt, nicht zu mächtig.[BR]Wenn dann wäre natürlich vieles zu überarbeiten."}, {"133": "Pangond schrieb:\t\t\tJe nach Erfolg beim Brauen, dann zum Goldabholen o. fürs Turnier o. Turm, usw.[BR]Grund: ich vergesse ebefalls meist vor wichtigen Turnierschlachten(meist am Abend) ,den H-Kessel zu nutzen, oft gibts dann statt Kampfbooster ,ein Gold,o. anderen Booster den ich dann garnicht nutzen kann, sondern lieber früh getrunken hätte.\t\tZum Vergrößern anklicken....[BR]genau das ist meine Erfahrung und besser ich schreibe es dazu, bin pro Kessel eingestellt. [BR][BR]braue auf Kampf zusammen, kommt aus dem Nichts am Abend ein Gold oder ähnliches , welches man Tagsüber hätte gebrauchen  können,[BR]braut man für den Tag kommt ein oder zwei Kampf, immer das Gegenteil, ist das so programmiert.?[BR][BR]Anscheinend sind die Rezepte nur niedliche Fassade, brauen und mischen sind Nebensache....  es steht schon vorher fest, was man bekommt."}, {"213": "Die Zaubertränke in Flaschen, und Nutzung bei Bedarf. Tolle Idee [smilie--sprite1][BR]Ja, dann hätte das ganze wenigstens irgend einen Sinn."}, {"100": "[IMG]https://i.ibb.co/G0nZHDn/https-de-forum-elvenar-com-index-php-attachments-1676729153979-png-34225.png[/IMG][BR]Gibt es  die Hoffnung auf Winterpause oder Sommertrockenheit ? [BR]Das die Hexe  mal keine Kräuter findet ?[BR][BR]Alle meine  Städte  brauen mit dem minimum  von enem Kraut  oder Pilz . [BR]Der Rest kommt in die Verbesserung der  Tränke ."}, {"1": "schwatzwurzel schrieb:Anhang 34225 ansehen[BR]Gibt es  die Hoffnung auf Winterpause oder Sommertrockenheit ?[BR]Das die Hexe  mal keine Kräuter findet ?\t\tZum Vergrößern anklicken....Nein, der Hexenkessel soll ganzjährig laufen, als festes Feature. Die Hexe wird sich also immer zu helfen wissen, wo sie Kräuter finden wird, egal zu welcher Jahreszeit. [smilie--sprite1]"}, {"56": "Wenn ich diesen Thread lese, dann bestärkt mich das in meiner Meinung.[BR]Mir ist der Hexenkessel zu zeitaufwendig und die Ergebnisse zu glücksabhängig:[BR][BR]Glücksabhängig…[BR]Die Erfahrungen anderer Spieler interessieren mich nicht, denn durch die Glücksabhängigkeit sind deren Ergebnisse nicht auf andere Personen 1:1 übertragbar und damit immer nur relativ. Jeder spielt anders und viele befinden sich auf einem unterschiedlichen Level. Das beste „Rezept“ nützt sehr wenig, wenn man dann am Ende auch noch von dem \"Faktor Glück“ abhängig ist (das ist wie beim Roulette da haben auch manche ein „todsicheres System“). Solch ein Trugschluss bringt mir persönlich absolut nichts, denn das ist (für mich) jenseits jeglicher Logik, weil Glück immer relativ ist.[BR]Der Hexenkessel ist und bleibt (für mich) insgesamt ein Vabanquespiel.[BR][BR]Zeitaufwendig…[BR]Ich kann meine Zeit sehr lukrativ einsetzen (davon hat auch INNO bis dato profitiert), ich muss also meine Zeit nicht mit zusätzlichen glücksabhängigen Spielchen vergeuden, die viele (an anderen Stellen des Spiels sehr nützliche) Ressourcen und eventuell auch Dias kosten (die ich zu 99,99% käuflich erwerbe)).[BR][BR]Fazit: Der Hexenkessel ist (für mich) ein absolut uninteressantes Feature, welches ich nicht spiele!"}, {"134": "ich werd in meiner Stadt Wölfe ansiedeln, vielleicht klappts dann mit der Zauberin.......ach ihr noch ein rotes Käppchen aufsetzen [smilie--sprite1]"}, {"100": "Tacheless schrieb:\t\t\tNein, der Hexenkessel soll ganzjährig laufen, als festes Feature. Die Hexe wird sich also immer zu helfen wissen, wo sie Kräuter finden wird, egal zu welcher Jahreszeit. [smilie--sprite1]Zum Vergrößern anklicken....Hexen  hexen ,    die  finden auch in der Wüste  Pilze  , oder sie gehen einfach Samstags auf den Markt ."}, {"287": "Ich werfe immer nur eine Zutat in den Kessel und steck die restlichen Hexenpunkte ins Studium. Allerdings tausche ich keine Güter/Münzen/Vorräte gegen Hexenpunkte. Mir ist der Kessel völlig egal und ich mache das nur falls er evtl. in ein paar Monaten mal effektiv werden sollte. Ich habe keine Lust mich da intensiv mit zu beschäftigen und Prozente zu berechnen, Zutaten rein oder raus um Änderungen zu sehen, ne sorry, das nervt mich eher, zumal am Ende doch wieder alles glücksabhängig ist. [BR][BR]Zusammenfassend: ich finde den Kessel unnötig und es hätte mich nicht gestört, wenn er nicht live gegangen wäre."}, {"213": "Wie wäre es denn mit einem fetten Wolf im Wald, erforschbar im Level 6, der frißt dann die Hexe und Ruhe ist [smilie--sprite1]"}, {"28": "BoeseTante schrieb:\t\t\tWie wäre es denn mit einem fetten Wolf\t\tZum Vergrößern anklicken....offtopic: Also ich als Spieler wünsche mir ja schon länger einen Wolf als Evolutions-Gebäude. [BR][BR]Das wäre eventuell was für die Ideenschmiede. ;-)"}, {"213": "Thebigunknown schrieb:\t\t\tofftopic: Also ich als Spieler wünsche mir ja schon länger einen Wolf als Evolutions-Gebäude.[BR][BR]Das wäre eventuell was für die Ideenschmiede. ;-)\t\tZum Vergrößern anklicken....Im Rotkäppchen Gewand ? Zu Halloween ? Schön mit roten Augen [smilie--sprite1]"}, {"28": "BoeseTante schrieb:\t\t\tIm Rotkäppchen Gewand ? Zu Halloween ?\t\tZum Vergrößern anklicken....Warum denn nicht! Ab in die Ideenschmiede damit und mal schauen was die Community so dazu meint. ;-)"}, {"213": "@Thebigunknown Deine Idee, mach was draus![BR]Keine weiteren Ideen mehr von mir !!!!!"}, {"203": "So langsam macht der Hexenkessel wirklich Spass. Bei der Abholung eben bekam ich 158 Marmor mehr. Bei 2 Gebäuden muss ich aufpassen, dass mein Bestand nicht platzt. Schade ist nur, dass das kein offtopic ist, sonst könnte mans wieder löschen (dass von anderen offtopc bleibt, verstehe ich natürlich - könnten ja zuviele Einträge sein)"}, {"203": "Jetzt muss ich auch mal wieder einen Doppelpost machen (ist ja inzwischen erlaubt - vor allem in diesem Thread)... hatte auch die Gastrassenverbesserung bekommen. Das hat auf Stufe 60 wirklich gerockt. Waren 10 mehr (brauch halt nur 20 000). Da werd ich glatt zum Pupsibär. Nur schade, dass mein Marmor 2 Stunden und 56 min gewirkt hat... die nächste Produktion waren ja 3 Stunden (aber leider per Zufall so berechnet)"}, {"103": "Deine Ironie hilft aber im Feedback-Thread auch niemandem weiter.[BR]Es ist schön, wenn Du ein Feedback geben willst, dann nutze doch aber besser klare Beschreibungen und verzichte[BR]auf die untergemischten offtopic-Anfeindungen, dann wird auch nichts gelöscht...[BR][BR]Ist es wirklich so schwer, zu einem Thema einfach mal nur Fakten aus der eigenen Sicht zu nennen,[BR]ohne Ironie, ohne Sarkasmus und ohne Stichelei im Beifang ?"}]