[{"203": "Ist nur eine Feststellung, dass bei mir offtopic gelöscht wird (selbst, wenns zum Thread passt) und bei anderen nicht. Weiss nicht, ob das Gleichberechtigung ist... und die Zahlen sprechen für sich. Nun kann man sehen, ob der Hexenkessel super ist oder Schrott. Beim Marmor sieht man, dass der Kessel lächerlich ist. Bei der Gastrasse kann man nur denken - wollen die bei dem ganzen eingesetzten Münzen und Vorräten einen verarschen"}, {"126": "Ich nutze den Hexenkessel nebenbei, allerdings vergesse ich ihn manchmal fast, weil er mich scheinbar nicht sonderlich vom Hocker haut. [BR][BR]Wer viel hat und lange dabei ist, kann sicher mehr raus holen als andere. [BR]Ich setze keine Fragmente ein, weil ich die einfach nicht im Überfluss habe. Wäre sicher anders, wenn ich mehrere Mondsteinbibliotheken hätte und schon Jahre dabei wäre (Spiele aktuell 1 1/2 Jahre in meiner größten Stadt). Diamanten werde ich auch nicht einsetzen, weil der Erfolg glücksabhängig ist. Ich braue einfach und freue mich, wenn ich nen sinnigen Effekt erhalte, bin aber auch nicht traurig, wenn nicht."}, {"14": "ich denke, der Kessel KANN richtig nützliche Effekte für die Stadt bringen:[BR]da dürfte man aber auch nur so um die 3 Effekte hochstufen[BR]die Diamanten müssten günstig nicht da liegen, wovon ich mehrere Teile nehmen wollen würde[BR]ich brauchte etwas in der Stadt, was mir Fragmente bringt, die habe ich nämlich immer zu wenig und schon alles zerschreddert, was zu schreddern geht, auch Portalos (oder gebt mir mehr Handelsstationen im Turm^^)[BR]ich denke, DANN bringt der Kessel ganz gut was[BR][BR]aber, davon bin ich weit entfernt:[BR]noch darf ich nicht so sehr viele Zutaten nehmen, da ich noch unter 3000 Hexenpunkte liege[BR]und die Effekte, mit \"Anheben\" und \"Ausmerzen\" auch nur gehen, wenn man mehrere Zutaten einer Sorte verwendet, was dann auch gleich viel mehr Hexenpunkte kostet je weiterer Zutat[BR]..es funktioniert einfach nicht so, wie ich es gerne hätte:[BR]ich hätte zumindest gerne häufiger mal Effekte, die mir was bringen, als ausgerechnet die mit weniger Wahrscheinlichkeit, die dann auch nur kurz laufen: die hab ich nämlich nicht sternetechnisch angehoben und konnte sie mangels Hexenpunkte auch nicht völlig ausmerzen..[BR]evtl. auch nur, weil die Dias blöd verteilt waren[BR][BR]und es ist häufig dumm gelaufen mit dem was kommt und mit der Laufdauer, bei mir hält nämlich nichts solange an, dass ich abends brauen könnte und ich morgens noch was davon hätte (wie vorgeschlagen wurde)[BR]ich baue zur Zeit darauf, dass das besser wird, wenn meine Hexenpunkte für die Zutaten höher liegen[BR][BR]also momentan ist es nur manchmal ein tropfen auf einem heißen Stein, was da rauskommt[BR]und man muss evtl. dann auch noch Segen nutzen um z.B. überhaupt einen nennenswerten Effekt z.B. bei Warenproduktionen zu erkennen (den ich gar nicht haben wollte), sonst sind das teils nur ca. unter 200 mehr (aber es erhöht auch noch die fabelhafte Fabrikation):[BR]denn was bewirken 200 mehr Waren bei Kapitel 14?[BR]in Kapitel III wäre es evtl. was [smilie--sprite2]"}, {"113": "Neris schrieb:\t\t\tdenn was bewirken 200 mehr Waren bei Kapitel 14?[BR]in Kapitel III wäre es evtl. was\t\tZum Vergrößern anklicken....Da sind es dann aber keine 200 sondern nur vielleicht 20 oder so.[BR][BR]Das mit den Gütermengen scheint mir etwas unglücklich gelöst zu sein.[BR][BR]Bei den Kampfeffekten habe ich das Gefühl, dass der Nutzen deutlich höher ist."}, {"2": "lovelymonster schrieb:\t\t\tDa sind es dann aber keine 200 sondern nur vielleicht 20 oder so.[BR][BR]Das mit den Gütermengen scheint mir etwas unglücklich gelöst zu sein.[BR][BR]Bei den Kampfeffekten habe ich das Gefühl, dass der Nutzen deutlich höher ist.\t\tZum Vergrößern anklicken.......das muss sich eben auch erst einmal entwickeln - es wurde ja schon im Promo-Video kommuniziert, daß die Effekte anfangs recht schwach sind und dann erst im Laufe der Zeit - also besser gesagt: für Spieler in den letzten Kapiteln - richtig rentabel werden (wenn die Effekte hoch gelevelt wurden)...[BR][BR]...bei den Güter-Effekten kann man um Einiges mehr rausholen, wenn man die Manus verzaubert und ein hohes Handelszentrum besitzt (allerdings braucht man das für die normalen Manus dann eigentlich nicht mehr - es ist aber interessant für erweckte und erleuchtete Güter) - vielleicht wäre es eine Lösung, die ersten Gütereffekte (also Gut 1-3) allgemein in allen Stufen in der Stärke anzuheben..."}, {"113": "Romilly schrieb:\t\t\t...das muss sich eben auch erst einmal entwickeln - es wurde ja schon im Promo-Video kommuniziert, daß die Effekte anfangs recht schwach sind und dann erst im Laufe der Zeit - also besser gesagt: für Spieler in den letzten Kapiteln - richtig rentabel werden (wenn die Effekte hoch gelevelt wurden)...[BR][BR]...bei den Güter-Effekten kann man um Einiges mehr rausholen, wenn man die Manus verzaubert und ein hohes Handelszentrum besitzt (allerdings braucht man das für die normalen Manus dann eigentlich nicht mehr - es ist aber interessant für erweckte und erleuchtete Güter) - vielleicht wäre es eine Lösung, die ersten Gütereffekte (also Gut 1-3) allgemein in allen Stufen in der Stärke anzuheben...\t\tZum Vergrößern anklicken....Das ist es halt, das sind alles Maximalgeschichten, es sollte aber auf dem Weg dahin auch schon ein paar Erfolge geben."}, {"2": "...richtig - ...[BR]Romilly schrieb:\t\t\t...und deshalb sollte INNO ein paar Fragmente und automatische Hexenpunkte mehr ins Spiel bringen, damit mal ein paar Spieler auf den Geschmack kommen\t\tZum Vergrößern anklicken...."}, {"83": "Irgendwie kann ich mit dem Hexenkessel im Moment noch  nicht so recht was anfangen. Ist mir einfach zu zufallsabhängig.[BR]Es kommt eigentlich nie das, was ich wirklich will (Kampfverstärker), auch wenn das bei den Wahrscheinlichkeiten ganz oben steht.[BR]Stattdessen kommen idR Verbesserer für die Standardgüterausbeute (reguläre Manus hab ich - außer Marmor-  gar keine mehr stehen, weil sich das Zeugs im Inventar eh schon stapelt).[BR]Auch Einsatz von Frags bringt dann nichts[BR]Ich bin jetzt dazu übergangen, gar nicht groß rumzuprobieren, sondern werf einfach am Donnerstag oder Freitag (je nachdem wann ich Zeit für mehr Kämpfe hab) 2 oder 3 mal auf das Wolkenwollezeugs oder Schneckenzeugs (je nachdem, was grad frei verfügbar ist), füg 1x Frags dazu und verwende den Rest dazu, um meine Kampfverstärker weiter auszubauen.[BR]Aber vielleicht freund ich mich ja irgendwann mit dem Kessel noch an[smilie--sprite6]. Verloren ist ja nichts, solang ich keine Dias einsetz."}, {"213": "Die Gütersteigerungen kann man nur noch als lächerlich beschreiben, wenn es überhaupt mal was gibt.[BR]Schade um die Programmierzeit die in dieses sinnlose Event verschwendet wurden!"}, {"14": "ja, das ist doch blöd..[BR]ich soll also von (hier mal als Beispiel) von einer Stadt Kapitel 8, erst mal bis Kapitel 20 warten, bis es wirklich was bringt?[BR][BR]ich meine ich hätte den Händlerapell schon etwas hochgelevelt (was ich aber nicht mehr genau weiß wie viel, da ich es in der Aka vor dem Brauen NICHT sehen kann (auch so eine blöde Sache!!))[BR][BR][IMG]https://i.ibb.co/BZ3Hj3K/https-de-forum-elvenar-com-index-php-attachments-screenshot-419-png-34238.png[/IMG][BR][BR]und ja, ich hab die fabelhafte Fab genutzt, aber eine Händlergilde hat man ja da noch gar nicht[BR]der Effekt ist mit dem Zusatzbonus vom Segen trotzdem unter 200..[BR]ja, es ist sogar nur 117 Stk in 3h von insgesamt 1531 (wenn man nicht verzaubern würde)[BR]ich würde sagen, normal hat man zu dem Zeitpunkt 5 oder 6 Manufakturen, der Effekt ist marginal..[BR]und ganz blöd, wenn man später mal in höheren leveln die Anzahl noch reduziert..[BR][BR]in der Stadt habe ich sogar 9 Stahl-Manus, da sie reiner Händler ist und den Braueffekt hab ich als Bild auch noch gefunden:[BR][IMG]https://i.ibb.co/ZWyLVQm/https-de-forum-elvenar-com-index-php-attachments-screenshot-418-png-34239.png[/IMG][BR]die Werte sehen auf den ersten Blick eigentlich toll aus..aber...[BR][BR]aber dafür hat man ja auch schon was in die Erhöhung des Händlerapells reingesteckt..[BR]ich finde den Nutzen trotzdem wirklich sehr spärlich[BR]in der Stadt habe ich Münzen, den Händlerapell und ich glaube Werkzeug etwas angehoben...[BR]so viele Überschüsse habe ich da nicht..[BR]nutzen kann ich da Werkzeug und Münzen für die Sterne..[BR]da gibt es noch kein Mana etc. was sowieso zerfallen würde..[BR]und Fragmente um irgendwas zu erhöhen sowieso nicht (alles an Gebäuden zerlegt im Inventar, gewonnene Portalos zum Großteil ebenso): die werden für die sonstige Produktion der Aka gebraucht..[BR]meine Städte haben alle nur eine Biblio, da sie alle erst im letzten Jahr angefangen sind[BR][BR]also für mich ist das eher enttäuschend"}, {"133": "Romilly schrieb:\t\t\t...und deshalb sollte INNO ein paar Fragmente und automatische Hexenpunkte mehr ins Spiel bringen, damit mal ein paar Spieler auf den Geschmack kommen -\t\tZum Vergrößern anklicken....[BR]Fragmente waren über die Bibliothek vorhanden. Wer 5 bis 20 Bibliotheken stehen hat, ist fein raus. [BR][BR]Wer keine 5 bis 20 Bibliotheken erspielen durfte, Pech gehabt. [BR]Fragmente sind zu kostbar für den Kessel. [BR]So bleibt nur 1 Kräutlein in der Woche einwerfen, 3 Nieten und zweimal was sinnloses gewinnen. Den Rest ins leveln stecken und hoffen, dass irgendwann eine Überarbeitung im Kessel erfolgt."}, {"2": "Neris schrieb:\t\t\tja, das ist doch blöd..[BR]ich soll also von (hier mal als Beispiel) von einer Stadt Kapitel 8, erst mal bis Kapitel 20 warten, bis es wirklich was bringt?\t\tZum Vergrößern anklicken....Vorschläge: (für INNO zur Überarbeitung)[BR]a) mehr Hexenpunkte zum Brauen (250 als Startkapital + das, was durch die Forschung hinzu kommt)[BR]b) mehr Fragmente um den Trank zu stärken (weitere Gebäude, die Fragmente abgeben und/oder mehr Fragmente beim Entzaubern)[BR]c) höhere Werte für die Standardgüter[BR][BR]...bringt den großen Spielern relativ wenig, hilft aber allen anderen...[BR][BR]...desweiteren für Fortgeschrittene:[BR]d) Kauf von Hexenpunkten auch durch erweckte und erleuchtete Güter ermöglichen..."}, {"83": "Romilly schrieb:\t\t\tVorschläge: (für INNO zur Überarbeitung)[BR][BR]c) höhere Werte für die Standardgüter\t\tZum Vergrößern anklicken....lieber höhere Werte für Stärke des Generals, des Söldners und des Monsters- Güter nein danke"}, {"2": "giuni schrieb:\t\t\tlieber höhere Werte für Stärke des Generals, des Söldners und des Monsters- Güter nein danke\t\tZum Vergrößern anklicken.......das bringt aber den kleineren Kapiteln nicht viel, da die weder einen Eisbären, noch eine Zeitschleife noch viele Turnierprovinzen haben...[BR][BR]...mit \"klein\" mein ich die Kapitel 5-11..."}, {"6": "Meine Meinung zum Kessel nachdem ich jetzt mehrfach ein wenig rumgeklickt habe (selbstverständlich ohne Fragmente oder Dias einzusetzen):[BR]Selbst der Aufwand, das Kessel-Fenster aufzurufen, lohnt den Aufwand nicht. Also werde ich den Kessel einfach ignorieren.[BR][BR]Ist natürlich nur mein ganz persönliches Fazit. Wer damit herumspielen möchte: bitte sehr, have fun!"}, {"83": "Romilly schrieb:\t\t\t...das bringt aber den kleineren Kapiteln nicht viel, da die weder einen Eisbären, noch eine Zeitschleife noch viele Turnierprovinzen haben.\t\tZum Vergrößern anklicken....Kaserne hast ab kap. 1, Trainingsgelände ab 2 und Söldner ab 7[BR]Stärke des Generals dürfte ab Freischaltung des Kessels verfügbar sein (soweit 4 kap. komplett abgeschlossen wurden), Stärke der Monster ab kap.[BR] 8[BR]Turnierprovinzen hast bis dahin auch schon einige und Eisbär hat damit eigentlich nichts zu tun. Außerdem gibts ja noch den Turm und die regulären Provinzen"}, {"2": "giuni schrieb:\t\t\tKaserne hast ab kap. 1, Trainingsgelände ab 2 und Söldner ab 7[BR]Stärke des Generals dürfte ab Freischaltung des Kessels verfügbar sein (soweit 4 kap. komplett abgeschlossen wurden), Stärke der Monster ab kap.[BR] 8[BR]Turnierprovinzen hast bis dahin auch schon einige und Eisbär hat damit eigentlich nichts zu tun. Außerdem gibts ja noch den Turm und die regulären Provinzen\t\tZum Vergrößern anklicken.......ja - das ist schon richtig - aber der Effekt hält ja meist nur für 1 Turnierrunde - also quasi für vielleicht 10 Kämpfe (mehr machen die meisten doch gar nicht) - für was willst du da denn groß was stärken?...auch den Turm spielen die meisten bis dahin noch nicht komplett in einem Zug im Kampf durch...[BR][BR]...wenn du einen größeren Effekt bei den Truppen haben willst, wirst du was investieren müssen - dann ergeben sich auch solche Werte...[BR][BR][IMG]https://i.ibb.co/p2dKVzf/https-de-forum-elvenar-com-index-php-attachments-4-png-34122.png[/IMG]...das wird sich INNO nicht so einfach nehmen lassen...[BR][BR]....mal angenommen, die normale Stärke wäre hier in allen Stufen höher, dann könnte ich auch entsprechend noch (3x) mal mehr dabei rausholen (bei 50 % kritischer Effekt-Chance erhält man die 3fache erforschte Stärke, bei der Dauer das 4,5fache, wenn man den Kritischen auch trifft)..."}, {"14": "bei kleinen Städten bringen die Kampfeffekte nichts..[BR]man hat wenig Provinzen, die Zeit läuft zu schnell ab und den Turm verhandelt man zu der Zeit noch...[BR]ich wüsste nicht, was ich in Kapitel 5 WIRKLICH mit Stärke des Generals anfangen sollte und auch in Kapitel VII ist Stärke der Monster mehr als fraglich für mich:[BR][BR][IMG]https://i.ibb.co/MNRzwtP/https-de-forum-elvenar-com-index-php-attachments-screenshot-424-png-34241.png[/IMG][BR][BR]also legt man dort auf etwas anderes mehr Wert..[BR][BR]und da haben wir das nächste Problem:[BR]fangen diese Städte also an in die Sterne für Münzen und Werkzeug zu investieren ist der Preis für Hexenpunkte in höheren Kapiteln (meinetwegen 15) schon heftig gestiegen..[BR]wie soll man dann umschwenken auf die Militärbooster?[BR][BR]ich finde, da fehlt eine Rücksetzoption! [BR](egal, ob man dann die vorher eingesetzten Mittel in den Sand setzt und die Effekte verliert, aber man kann zumindest mit viel geringeren Ressourcenmengen andere Effekte hochziehen)[BR]so wie es die Spieler tun, die in dem Kapitel den Kessel bekommen haben..[BR]wer das nicht will, muss ja nichts zurücksetzen...[BR][BR]in Kapitel 20 hat man sich sicherlich eher festgelegt, wie man spielt, als in Kapitel 8, wo alles noch \"im Fluss\" ist und sich mit der Spielzeit ändert[BR][BR]und ja, die Punkte, was einem fehlt in den unteren Kapiteln sind Hexenpunkte und Fragmente um mal ein bisschen was Vernünftiges zu bekommen"}, {"2": "Neris schrieb:\t\t\tfangen diese Städte also an in die Sterne für Münzen und Werkzeug zu investieren ist der Preis für Hexenpunkt in höheren Kapiteln (meinetwegen 15) schon heftig gestiegen..\t\tZum Vergrößern anklicken.......die Stufenerhöhung steigt so ab Level 40 so stark an, daß du recht schnell ausgebremst werden wirst (relativ hoher Preis für relativ wenig Hexenpunkte) - in Kapitel 20 fasst mein Münzlager dagegen 200 Millionen - mit einem Lager kann ich da also trotz hoher Kosten recht oft einkaufen - momentan stehe ich bei 26,2 Millionen Gold für einen Kauf (ca. 5100 Hexenpunkte pro Kauf) - insgesamt hab ich bereits fast 900 Millionen Gold ausgegeben (500 Käufe) - allerdings waren das bei mir dann nicht einmal 5 Lagerfüllungen - ich glaub, das gleicht sich relativ gut wieder aus, wenn man es nicht übertreibt...[BR][BR]...die ca. 40.000 Hexenpunkte, die in den ersten 40 Stufen drin stecken, hab ich mit 8 Käufen wieder drin - eine Umverteilung ist da nicht nötig...[BR]...in Stufe 80 stecken 1,858 Millionen Hexenpunkte - die kann man sich erst mal nicht leisten...."}, {"155": "Wozu sollte man in den ersten Kapiteln mehr Gütern brauchen, kriegt man dort doch einfach mehr als genug, also nicht wirklich ein Grund die Hexenpunkte zu verschenken."}]