[{"61": "Neris schrieb:\t\t\tbei kleinen Städten bringen die Kampfeffekte nichts..[BR]man hat wenig Provinzen, die Zeit läuft zu schnell ab und den Turm verhandelt man zu der Zeit noch...[BR]ich wüsste nicht, was ich in Kapitel 5 WIRKLICH mit Stärke des Generals anfangen sollte und auch in Kapitel VII ist Stärke der Monster mehr als fraglich für mich:\t\tZum Vergrößern anklicken....Neris schrieb:\t\t\talso legt man dort auf etwas anderes mehr Wert..[BR][BR]und da haben wir das nächste Problem:[BR]fangen diese Städte also an in die Sterne für Münzen und Werkzeug zu investieren ist der Preis für Hexenpunkte in höheren Kapiteln (meinetwegen 15) schon heftig gestiegen..[BR]wie soll man dann umschwenken auf die Militärbooster?\t\tZum Vergrößern anklicken....[BR]Ich finde das schwer nachvollziehbar. Du hast Dir doch eigentlich selbst schon geantwortet. Lass mal einen Schritt zurück machen und ein Bierchen trinken [smilie--sprite1][BR][BR]Jetzt ist das neu eingefügt ins Spiel und manche müssen das erst noch integrieren, was man ja aber ab jetzt alles dann bekommt, wenn man es erforscht und hat ja dann auch immer genug Zeit, um alles, was neu dazu kommt, auch entsprechend zu leveln. Dann erforschst du das Trainingsgelände, das kannst du eigentlich auch noch nicht wirklich gebrauchen. Aber du stellst es auf und levelst es, erkundest weiter Provinzen, übst Dich weiter in Turm und Turnier und irgendwann ist es dann nützlich und nebenbei hast du auch die Effekte im Kessel mit gelevelt und irgendwann hast du dann einen Effekt, der auch spürbar ist. Das ist doch jetzt auch schon so. Und wenn die Effekte dann gelevelt sind und man jetzt schon Erfahrungen beim Brauen sammeln kann, kann man später auch das Glück besser heraus fordern. Ist doch alles gut so.[BR]Wäre doch blöd, wenn der General erst im Kapitel 15 kommt, wo man ihn wirklich gut nutzen kann, aber der General dann noch gar nicht gelevelt ist und man keine Erfahrung mit Rezepten hat, die gut funktionieren. Wenn zukünftig Spieler in Kapitel 15 ankommen, haben die alle Effekte maximal gelevelt und bekommen nur eine neue Zutat, die sie wieder neu leveln müssen. Die haben doch gar keine Probleme. Ist doch nur, weil wir jetzt alles nachholen müssen, was die Spieler später dann alles der Reihe nach machen können.[BR][BR]Und wenn es jetzt Spieler mit vollen Lagern gibt, die sich sofort den Kessel hoch leveln können, dann haben die vorher schon gut gespielt. Und wer die Lager leer hat und nicht die Effekte verbessern kann, der hatte eben auch vorher schon leere Lager. Das liegt nicht am Kessel, dass manche ihn gleich nutzen können und andere nicht.[BR][BR]Also ich würde mir da jetzt noch keine Panik machen lassen, ich würde mir nichts schlecht reden lassen, ich würde einfach machen, so gut es eben geht. Ob die Güter im Kessel versenkt werden oder im Turnier macht nicht wirklich einen Unterschied. Dann hat man eben paar Wochen bissel weniger Turnier, aber dann für immer einen guten Kessel.[BR][BR]Ich würde jetzt auch sparsam mit Fragmenten sein. Wirklich Erfahrung beim Brauen hat noch niemand. Die müssen wir alle sammeln. Und wenn dann irgendwann alles Routine ist, die Effekte gelevelt, dann noch paar Fragmente und die richtigen Rezepte, das wird schon richtig Spaß machen. Aber jetzt erwarten, dass der Kessel gleich mit 50% besseren Turnieren losgeht, kann man ja wohl nicht, oder? Was soll er denn dann machen, wenn er fertig gelevelt ist?"}, {"14": "alle Effekte voll gelevelt?[BR]ich glaube, davon werde ich nur träumen können[BR]für kleine Stufen ist es auch noch extrem teuer irgendwas zu leveln[BR][BR]ist man weiter, sieht das besser aus...[BR][IMG]https://i.ibb.co/yqgW05X/https-de-forum-elvenar-com-index-php-attachments-screenshot-420-png-34247.png[/IMG][BR][BR]jedesmal -25% ist jedenfalls was[BR]aber alles maximal gelevelt?[BR]ich denke nicht..[BR]es ist nur das gelevelt auf was man anfangs Wert legt[BR]schwenkt man dann zum Kampf über (so bei den Waldelfen), dann ist es zwar billiger geworden, aber durch den Vorverbrauch für das Leveln der Sterne (für andere Effekte) ist es doch noch extrem hoch..[BR][BR]naja, ich werde es sehen...[BR]vielleicht hast du ja Recht..[BR]aber ich kann es nicht recht glauben"}, {"2": "@Neris - deine Überschüsse an Gold und Werkzeugen solltest du schon regelmäßig in ein paar Käufe investieren, damit die Anzahl der Hexenpunkte pro Kauf ebenfalls langsam ansteigen kann - aber halt alles in Maßen - vielleicht anfangs so 10 Käufe pro Woche und wenn du gut damit zurecht kommst, kannst du das natürlich dann auch nach und nach steigern - aber so steigen halt die Effekte, die du schon hast, ein wenig an (Richtwert Stufe 40) und geben dir ein paar Extras, wenn du sie auslöst und mit der Zeit wirst du wissen, was du davon bevorzugst - und das kannst du dann ja höher bringen...Effekte auf Stufe 60, 70, 80+ solltest du erst anpeilen, wenn die Preise durch mehr Diplome deutlich gesunken sind bzw. wenn deine allgemeinen Einnahmen deutlich gestiegen sind...[BR][BR]...Anfangspreise Diplome...[BR][IMG]https://i.ibb.co/CPQ8bVt/https-de-forum-elvenar-com-index-php-attachments-diplome6-png-34253.png[/IMG]....[IMG]https://i.ibb.co/9q8ttvw/https-de-forum-elvenar-com-index-php-attachments-diplome7-png-34254.png[/IMG]"}, {"113": "Neris schrieb:\t\t\tist nur das gelevelt auf was man anfangs Wert legt[BR]schwenkt man dann zum Kampf über (so bei den Waldelfen), dann ist es zwar billiger geworden, aber durch den Vorverbrauch für das Leveln der Sterne (für andere Effekte) ist es doch noch extrem hoch..\t\tZum Vergrößern anklicken....Ich kann das zwar nicht ganz beurteilen (ich hab halt gerade jetzt volle Lager), aber ich vermute, letztlich wird das so ausgehen, wie mit dem Kauf von Wissenspunkte. Am Anfang hat mensch das Gefühl, die Kosten würden immer höher werden und könnten irgendwann nicht mehr erfüllt werden und irgendwann wird der Kram aus der Portokasse oder mit überschüssigen Gütern bezahlt.[BR](Zur Zeit ist das wohl Gut 3)"}, {"167": "Neris meint aber etwas ganz anderes und dem stimme ich komplett zu. Das ist eine echte Benachteiligung von Spielern, die später ins Spiel einsteigen. [BR]Am Anfang wirst du zB Werkzeuge im Kessel boostern - mit all deinem zB überzähligen Gold. Irgendwann biste bei 800k Gold für 675 Hexenpunkte.[BR]Nun willst umschwenken auf Stärke des Generals und steigst dann dort mit den hohen Werten Gold für Hexenpunkte ein. [BR]Gold hast du nun im Überfluss und benötigst das geboostere Ding gar nicht mehr - ergo verschwendet aufgrund deiner Bedürfnisse aus der Anfangszeit. Ein Spieler, der zu einem späteren Spielstand einsteigt oder gar Max-Level war bei Kesseleinführung, kann direkt seine Wunschbooster mit den billigen Hexenpunkten leveln.[BR][BR]Das ist eine noch größere Hürde für Spät-Einsteiger. Ich habe sowieso das Gefühl, das man als Späteinsteiger benachteiligt ist - egal, was Inno am Forschungsbaum alles rumschraubt. Aber das einen anderen Diskussion [smilie--sprite1]"}, {"17": "Falbala Di schrieb:\t\t\tNeris meint aber etwas ganz anderes und dem stimme ich komplett zu. Das ist eine echte Benachteiligung von Spielern, die später ins Spiel einsteigen.[BR]Am Anfang wirst du zB Werkzeuge im Kessel boostern - mit all deinem zB überzähligen Gold. Irgendwann biste bei 800k Gold für 675 Hexenpunkte.[BR]Nun willst umschwenken auf Stärke des Generals und steigst dann dort mit den hohen Werten Gold für Hexenpunkte ein.[BR]Gold hast du nun im Überfluss und benötigst das geboostere Ding gar nicht mehr - ergo verschwendet aufgrund deiner Bedürfnisse aus der Anfangszeit. Ein Spieler, der zu einem späteren Spielstand einsteigt oder gar Max-Level war bei Kesseleinführung, kann direkt seine Wunschbooster mit den billigen Hexenpunkten leveln.[BR][BR]Das ist eine noch größere Hürde für Spät-Einsteiger. Ich habe sowieso das Gefühl, das man als Späteinsteiger benachteiligt ist - egal, was Inno am Forschungsbaum alles rumschraubt. Aber das einen anderen Diskussion [smilie--sprite1]Zum Vergrößern anklicken....du verkennst leider die Steigerung die am an Ende drin ist.[BR]egal wieviel du früher hast und da rein steckst ab Level 90 ist das so teuer das es sich nicht lohnt, anders herum sind später Level 60-70 für Highendspieler so billig das es egal war ob du vorher schon 5 andere aufgefüllt hast."}, {"2": "stone2345 schrieb:\t\t\tdu verkennst leider die Steigerung die am an Ende drin ist.[BR]egal wieviel du früher hast und da rein steckst ab Level 90 ist das so teuer das es sich nicht lohnt, anders herum sind später Level 60-70 für Highendspieler so billig das es egal war ob du vorher schon 5 andere aufgefüllt hast.\t\tZum Vergrößern anklicken.......richtig - Neueinsteiger werden sich mMn keinen Effekt auf Level 50+ leisten können, da die Produktion sämtlicher Güter am Anfang noch recht niedrig, die Kosten mit wenig Diplomen aber dagegen noch recht hoch sind - deshalb ist es sinnvoller, sich anfangs nur immer dem jeweils nächsten freien Effekt zu widmen und diesen auf ca. Level 40 zu bringen - nicht höher - dazu benötigt man jeweils ca. 40.000 Hexenpunkte...[BR][BR][IMG]https://i.ibb.co/hfjmQPR/https-de-forum-elvenar-com-index-php-attachments-aufwertungen-png-33562.png[/IMG][BR]...und die sind anfangs noch schwer zu erreichen...man hat aber ja immer ein ganzes Kapitel lang dafür Zeit...[BR][BR]...später aber, wenn man mehr Diplome und auch weitere Ressourcen (Orks, Mana, etc.) hat, kann man dann anfangen, alles auf höhere Stufen zu befördern - bis dahin weiß man idR auch schon ganz gut, was man hier bevorzugt - die je 40 Stufen der Anfangs-Effekte sind aber nicht \"vergeudet\", da inzwischen die Hexenpunkte pro Kauf schon gut angestiegen sind und man für diese 40.000 Hexenpunkte nur ein paar Klicks/Käufe bräuchte...hier nochmal der Vergleich, wie viele Hexenpunkte in welchen Stufen eines einzelnen Effektes stecken...[BR][BR]Lvl 40 --> ca. 40.000[BR]Lvl 50 --> ca. 105.000[BR]Lvl 60 --> ca. 275.000[BR]Lvl 70 --> ca. 720.000[BR]Lvl 80 --> ca. 1.860.000[BR]Lvl 90 --> ca. 4.830.000[BR]Lvl 100 --> ca. 12.515.000[BR][BR]...da sich die Effekte in ihrer Stärke gleichmäßig verbessern, ist es mMn sinnvoller, mehrere (alle) Effekte \"ins Mittelfeld\" zu bringen, anstatt nur einen Effekt auf Stufe 90-100...so hat man dann auch weniger \"Nieten\"...[BR][BR]...am Ende des Forschungsbaums hab ich mittlerweile 4 Effekte auf Stufe 80 und alle übrigen auf 45-75 - meine Lager sind immer noch sehr gut gefüllt (steigen sogar kontinuierlich an) - momentan verwende ich auch nur meine Überschüsse an Gold, Werkzeugen, Mana, Saat und Unurium - die Orks hab ich bisher noch nicht angerührt (da warte ich erstmal auf den Bedarf von Kapitel 21) - sämtliche Güter bunkere ich zur Zeit nur ein, damit ich dann, wenn die Preise mit dem Diplom von 21 wieder gesunken sind (irgendwann im Mai oder Juni schätzungsweise), wieder eine große Menge Hexenpunkte auf einen Schlag kaufen kann (ich rechne mit mind. weiteren 7 Millionen), um das Werkzeug auf Stufe 90 und die 3 Kampfstärken auf je 85 zu erhöhen - da werden dann vermutlich über eine Milliarde Güter im Kessel versenkt, was mich aber nicht arm macht) - für das Turnier brauch ich diese Güter nicht - ich hab nicht vor, meinen Turnierschnitt zu erhöhen - weder mit dem Kessel noch mit anderen neuen Features - mir ist es wichtiger, meine Flexibilität weiter ausbauen zu können - dabei kommt mir der Kessel sehr entgegen...[BR][BR]..ich weiß, für \"jüngere\" Spieler hören sich diese Zahlen total überdimensioniert an - wenn man aber selbst einmal in diese hohen Kapitel kommt, wird man feststellen, daß das gar nicht so absurd ist (wenn man nicht im Schweinsgalopp durch die Kapitel gerast ist und ein paar wichtige Weichen richtig gestellt hat)...[BR][BR]...Späteinsteiger werden mMn nicht benachteiligt - im Gegenteil - auf die Spielzeit gemessen werden die nach 2, 3, 4, 5, 6, 7 Jahren viel weiter und auch reicher sein, als die Altspieler im selben Zeitraum - sofern sie durchhalten..."}, {"203": "Falbala Di schrieb:\t\t\tNeris meint aber etwas ganz anderes und dem stimme ich komplett zu. Das ist eine echte Benachteiligung von Spielern, die später ins Spiel einsteigen.[BR]Am Anfang wirst du zB Werkzeuge im Kessel boostern - mit all deinem zB überzähligen Gold. Irgendwann biste bei 800k Gold für 675 Hexenpunkte.[BR]Nun willst umschwenken auf Stärke des Generals und steigst dann dort mit den hohen Werten Gold für Hexenpunkte ein.[BR]Gold hast du nun im Überfluss und benötigst das geboostere Ding gar nicht mehr - ergo verschwendet aufgrund deiner Bedürfnisse aus der Anfangszeit. Ein Spieler, der zu einem späteren Spielstand einsteigt oder gar Max-Level war bei Kesseleinführung, kann direkt seine Wunschbooster mit den billigen Hexenpunkten leveln.[BR][BR]Das ist eine noch größere Hürde für Spät-Einsteiger. Ich habe sowieso das Gefühl, das man als Späteinsteiger benachteiligt ist - egal, was Inno am Forschungsbaum alles rumschraubt. Aber das einen anderen Diskussion [smilie--sprite1]Zum Vergrößern anklicken....genau deswegen kam Inno selbst und erklärte, dass der Hexenkessel nur für ältere Spieler... später bekommt man überall Probleme, weil an neue Spieler nicht gedacht wird"}, {"14": "ja, es mag sein, dass es einem so ähnlich geht wie mit dem: \"kaufe WP\"[BR]auch ich bin anfangs davon ausgegangen, dass ich das irgendwann nicht mehr zahlen kann, wenn ich dazu laufend durch Events und Quests aufgefordert werde[BR]aber die Menge an Münzen steigt ja auch kuntinuierlich im Laufe des Spiels...[BR][BR]aber eine ganz große Bitte hätte ich:[BR]wenn ich mir jetzt momentan, weil gerade Zeit ist, mir Gedanken über meine Sterne, Kosten, Forschung machen wollen würde, dann ginge das gar nicht..[BR]denn ich sehe nichts![BR][BR][BR][IMG]https://i.ibb.co/9nvs0qn/https-de-forum-elvenar-com-index-php-attachments-screenshot-427-png-34266.png[/IMG][BR][BR][IMG]https://i.ibb.co/6gcWRCG/https-de-forum-elvenar-com-index-php-attachments-screenshot-428-png-34267.png[/IMG][BR][BR]irgendwo in diesen beiden Bildern hätte ich doch gerne die Info auf wie vielen Sternen meine Effekte stehen![BR]ich mag es nicht in Spielen mir etwas aufschreiben zu müssen, was ein Spiel zwar \"weiß\", mich aber nicht an diesem Wissen teilhaben lässt, nur in ausgewählten Situationen, wie nach dem Brauen[BR][BR]aber VOR dem Brauen, wäre es für mich auch wichtig zu wissen!"}, {"155": "Da ich an den Effekten für meine Truppen interessiert bin und den Kessel kurz vor dem Turnier nutze, sind alle anderen Effekte eh egal. Ob die Stufe 1 oder Stufe 40 sind, zu dem Zeitpunkt kann ich die eh nicht vernünftig nutzen."}, {"17": "@Neris du siehst doch beim Hinzufügen von Zutaten wieviel rumkommen kann, was ändert das Wissen um Sterne daran?"}, {"157": "Ich mag an Elvenar u.a., dass ich nicht so viel Zeit hineinstecken muss, und dass einem hier nichts von anderen Spielern kaputt gemacht werden kann. Trotz der wenigen Zeit kann man Fortschritte erzielen.[BR][BR]Der Hexenkessel steht dem entgegen. Theoretisch müsste ich mir die verwendeten Zutaten aufschreiben, um die erzielten Effekte zu protokollieren, damit ich in der Woche danach zielgerichteter vorgehen kann.[BR]Ich habe bisher zwei, dreimal gebraut. Jedes Mal kamen Effekte heraus, die zu kurz waren, um eine nachhaltige Wirkung zu erzielen. Mit anderen Worten muss man sehr genau aufpassen, wann man braut.[BR][BR]Ich denke, man kann mit dem Hexenkessel tolle Steigerungen erzielen, habe aber weder die Motivation noch die Zeit, mich damit im Detail zu beschäftigen"}, {"113": "Neris schrieb:\t\t\tirgendwo in diesen beiden Bildern hätte ich doch gerne die Info auf wie vielen Sternen meine Effekte stehen\t\tZum Vergrößern anklicken....Das ist etwas, was auch ich gerne hätte.[BR][BR]Aktuell kannst du im Braufenster die Sterne nämlich nur sehr umständlich erahnen. [BR][BR]Wenn du eine Zutat in den Kessel wirfst, erscheint ja rechts im Bild der ganze Effektekram und anhand dessen kannst du dann sehen, welcher Effekt gelevelt ist. Vorrausgesetzt, du weißt den Grundwert.[BR]Bei den Kampfeffekten liegt er, glaube ich, bei 5%, die Gütereffekte fangen bei 40% an."}, {"2": "...man kann es relativ einfach an der Dauer erkennen - es gibt nämlich nur 3 Varianten in der Zeit...[BR][BR]...sämtliche Kampfeffekte starten mit 2 Stunden bei Stufe 1 und erhöhen sich jeweils um 6 Minuten (also alle 10 Level eine Stunde mehr)[BR]...der Portaleffekt hat eine Sonderlänge mit 3 Stunden bei Stufe 1 und einer Erhöhung um je 9 Minuten (also alle 10 Level eineinhalb Stunden mehr)[BR]...alles andere startet mit 5 Stunden bei Stufe 1 und erhöht sich um jeweils 15 Minuten (also alle 4 Level eine Stunde mehr)..."}, {"113": "Auch ne Möglichkeit, aber auch die ist umständlich und benötigt Vorwissen.[BR][BR]Für SpielerInnen, die dafür aber nicht die nötige Zeit aufbringen können, wäre es halt nett.[BR][BR]Ich komm auch klar damit, wie es jetzt ist, mir würde es aber gefallen, wenn es im Braufenster eine Übersicht über die zB 5 höchstgelevelten Effekte gäbe."}, {"103": "Die Diskussion um Bevorteilung von \"älteren\" Spielern beim Kessel ist absolut sinnfrei,[BR]denn es gibt regulär keine \"älteren\" Spieler.[BR]Es wurde schon sehr oft darauf hingewiesen aber irgendwie geht es immer wieder unter.[BR][BR]Dass jetzt grad Spieler mit hohem Level einen Vorteil haben, weil die Kosten der Level sehr billig sind,[BR]weil man schon viele Diplome hat, ist ein Sonderfall, der nur durch die nachträgliche Einführung dieses Moduls[BR]zustande kommt.[BR][BR]Man kann rückwirkend eben keine Kosten erhöhen, nur damit es fair und gleich für alle ist.[BR][BR]Der Kessel im regulären Spiel wird in Kapitel V geforscht und beginnt mit hohen Kosten,[BR]weil eben niemand gleich in den ersten Wochen seine Effekte vollleveln soll.[BR]Der Kessel soll dann mit dem Account mitwachsen."}, {"213": "@littelflex Keine Bevorteilung der Ü60 ?[BR]Zitat: es gibt regulär keine älteren Spieler ???? Altersbegrenzung, Elvenar nur bis 40 Jahre????"}, {"103": "Bevorteilung Ü60 ergibt sich von allein durch Lebenserfahrung^^"}, {"128": "littleFlex schrieb:\t\t\tBevorteilung Ü60 ergibt sich von allein durch Lebenserfahrung^^\t\tZum Vergrößern anklicken.... Vielen Dank für die Erklärung, Little Flex![BR][BR]Endlich ist mir klar, warum ich den Hexenkessel sofort verstanden und sehr gewinnbringend einsetzen konnte. [smilie--sprite6]"}, {"104": "Bei einem Spielelement mir prozentuallen Boni und Zeitdauer ist es etwas unglücklich, kleine Spieler auszuschließen.[BR]In Akademie gibt es Bonusgebäude mit 25% auf 5 Tage für alle gleich.[BR]Und so ja auch richtig, niedrige Prozent-Boni/ Laufzeiten sind nicht für kleine Spieler akzeptabel, sondern einfach nur unnütz.[BR][BR]Ob zu leisten gewiss eine Frage, dann klareres Kostensystem für einzelne Tränke, ob von Turnier-Ergebnis oder anderem abhängig. Kleine Spieler vielleicht nur 1x pro Monat, größere können es sich jede Woche leisten.[BR][BR]Edit: Viele Wunder beginnen auch niedrig in Prozenten, aber zumindest sobald verfügbar klares System für Ausbau, auch wenn für kleine Spieler langsamer. Eigene Auswahl, Entscheidung ob sinnvoll, Konzentration auf eine Sache, klarer berechenbarer Ertrag zum Einsatz.[BR][BR]----[BR][BR]Mehrfach dieselbe Art Verzauberung mit Entscheidungs-Klick ist anstrengend, warum nicht verschiedene Effekte oder wenn nicht genug zur Auswahl dann die Rest-Kelche verfallend?[BR]Bisher wenn dann zumindest immer mit unterschiedlichen Werten gesehen, so dass Entscheidung noch ein wenig Sinn macht.[BR][BR]Wenn aber eine der beiden Optionen sowohl in Prozent als auch Laufzeit höher liegt, kann da nicht einfach der bessere vom System gewählt werden?.. [smilie--sprite2][BR][BR][IMG]https://i.ibb.co/DKKWMmt/https-de-forum-elvenar-com-index-php-attachments-1677234197482-png-34331.png[/IMG]"}]