[{"190": "Ich klicke da immer noch einfach mir egal was erledigt. Das ist nicht die Zeit wert und einfach Müll. [smilie--sprite7]"}, {"48": "ForgeS44 schrieb:\t\t\tMehrfach dieselbe Art Verzauberung mit Entscheidungs-Klick....[BR]Wenn aber eine der beiden Optionen sowohl in Prozent als auch Laufzeit höher liegt, kann da nicht einfach der bessere vom System gewählt werden?.. [smilie--sprite2][BR][BR]Anhang 34331 ansehenZum Vergrößern anklicken....Warum überhaupt entscheiden?[BR]Warum nicht stacken? [BR]Nur noch zu überlegen ob man die Prozente oder die Zeit stapelt."}, {"2": "Jammin schrieb:\t\t\tAls kleine Ergänzung noch, falls sich jemand wundert wie man 10 aktive Effekte gleichzeitig haben kann obwohl man nur 5 Kelche die Woche bekommt.[BR][BR]Wenn man viele Trank Diplome verbessert (z.B 10 oder mehr) und erst knapp zu Ende der Woche braut & trinkt werden die Trank Effekte auch weiter aktiv sein obwohl die Zauberin schon wieder im Wald ist. Wie lange sie aktiv bleiben hängt allerdings vom Level der Verbesserung und von der zufälligen Auslosung der Dauer beim brauen ab.[BR][BR]D.h. wenn man es hin bekommt 5 verschiedene Effekte vor Ende der Woche zu brauen und 5 weitere Effekte am Anfang der nächsten Woche sobald die Zauberin wieder aus dem Wald ist, hätte man 10 aktive Effekte gleichzeitig. (Dieses Scenario ist ziemlich unwahrscheinlich)[BR][BR]Ich bin mir ziemlich sicher, dass dies eher ein seltener Ausnahmefall sein wird, kein Normalzustand den man erwarten kann, wir werden froh sein, wenn wir lediglich 1-2 der gewünschten Effekte beim brauen bekommen werden.\t\tZum Vergrößern anklicken.......was nicht bedeutet, daß es unmöglich ist - (auch wenn's sehr lange gedauert hat - also mit dem \"eher seltenen Ausnahmefall\" hast du schon recht)...[BR][BR][IMG]https://i.ibb.co/qMQp9zd/https-de-forum-elvenar-com-index-php-attachments-n6-png-34676.png[/IMG]....das sind immerhin 7 gleichzeitig..."}, {"28": "Romilly schrieb:\t\t\tdas sind immerhin 7 gleichzeitig\t\tZum Vergrößern anklicken....[smilie--sprite1]"}, {"24": "Um ehrlich zu sein, ich nutze den Kessel sehr lustlos, bzw. sogut wie gar nicht. Die Prozentchancen sind nur schwer nachzuvollziehen, die Dauer ist kurz, die Dia-kostenden Zutaten willkürlich gesetzt. Wenn ich dran denke ist das Maximal gut in dem Moment bevor man den zweiwöchentlichen Turm/Turnierrun startet, idealerweise früh morgens, vor dem ersten einsammeln, damit man ein paar Miniboni abstaubt.[BR][BR]Und offen gesagt fällt das für mich dann in die selbe Kategorie wie der Aschephönix... Ich vergesse es immer und wenn ich dran denke isses für die ersten zwei Aufgaben zu spät -> Was beim Hexenkessel heisst: Nächste Woche wieder... Bzw... Zwei Wochen...[BR][BR]Ich hab mich auf das Feature gefreut. Ich bin vom Feature sehr underwhelmed. Es ist mir sogar eher lästig.[BR][BR]Schade."}, {"54": "ich mach das entspannt wie der Rat einiger hier war, nutze den Kessel erstmal nur zum Verbessern und Verlängern der erspielten Booster.[BR]Beim GA werd ich dann zB den Münzbooster nutzen zu Beginn, einige, die vornehmlich auf Armreifen spielen, werden den G1-Booster ausbauen und nutzen, das langt mal für's erste ...[BR][BR]HdW"}, {"288": "Ich finde es blöd, dass die Erhöhung der Effekte von Gütern immer noch nicht im Hauptgebäude in der App richtig angezeigt werden, am PC hingegen schon. Wenn da immer 0% steht, kann man es auch gleich weglassen."}, {"2": "MondherzDML schrieb:\t\t\tIch finde es blöd, dass die Erhöhung der Effekte von Gütern immer noch nicht im Hauptgebäude in der App richtig angezeigt werden, am PC hingegen schon. Wenn da immer 0% steht, kann man es auch gleich weglassen.\t\tZum Vergrößern anklicken.......mal interessehalber (hab gerade keine Effekte) - was vom Kessel wird denn überhaupt im HG angezeigt und wo? (hast du nen Screenshot?) Oder meinst du die magische Akademie?...[BR][BR]...meinst du das?[BR][IMG]https://i.ibb.co/mRgrVQ4/https-de-forum-elvenar-com-index-php-attachments-produktion-png-34921.png[/IMG]...ich hab da nicht mal ein Popup-Fenster, wenn ich auf die grüne Zahl gehe...[BR][BR]...habs gefunden - man muss auf den Balken deuten...[IMG]https://i.ibb.co/1KGwyLy/https-de-forum-elvenar-com-index-php-attachments-produktion2-png-34922.png[/IMG][BR][BR]...hab mal getestet und einen Gütereffekt ausgelöst - so sieht das dann im Browser aus...[IMG]https://i.ibb.co/NSRn0W1/https-de-forum-elvenar-com-index-php-attachments-produktion3-png-34923.png[/IMG][BR][BR]...wieder was gelernt  [smilie--sprite2] ..."}, {"288": "Genauso wird es im Browser angezeigt und in der App ist immer 0%. Meine Screenshots haben eine zu hohe Auflösung, da krieg ich immer ne Fehlermeldung."}, {"2": "MondherzDML schrieb:\t\t\tGenauso wird es im Browser angezeigt und in der App ist immer 0%. Meine Screenshots haben eine zu hohe Auflösung, da krieg ich immer ne Fehlermeldung.\t\tZum Vergrößern anklicken.......ich denk, man kann sich jetzt was drunter vorstellen [smilie--sprite1] ...(ich wußte bisher nicht, daß das da angezeigt wird [smilie--sprite1] )"}, {"61": "Mein persönliches Feedback: [BR][BR]Wir haben uns über den Flaschenhals \"Flaschengeister\" beschwert beim Abenteuer. Jetzt fehlt genau zum Abenteuer die Zutat für den \"General\" und die \"Söldner\" und ein vernünftiges Kampf-Rezept hab ich nicht finden können für den 2. Turm und das 2. Turnier im GA, das keine Diamanten kosten würde.  [BR][BR]So wie die Saison nicht zum Abenteuer passt, passt auch der Kessel nicht."}, {"177": "Ich habs hier leider nicht gefunden, ob die Frage schon mal kam. Ist es richtig, dass bei den Rezepten die die Manus boosten, nur die Grundproduktion, also ohne den Relikt-Bonus , gewertet wird? Ich war ganz happy, als ich während des GA + 60 % Marmor , Holz und Eisen bekommen habe, aber als ich mir das dann in der Marmor-Manu angeschaut habe, stand da bei einer Manu stufe 25 Normale Produktion 370 , Relikt-Bonus 2590, Antike Wunder-Bonus 282 und als Bonus für den Hexenkessel 174. Das ist für die Kosten eigentlich lächerlich^^"}, {"134": "3. Woche in Folge: 0 Effekte in 2 Welten. ich finds Klasse"}, {"2": "Katzenmarylou schrieb:\t\t\tIch habs hier leider nicht gefunden, ob die Frage schon mal kam. Ist es richtig, dass bei den Rezepten die die Manus boosten, nur die Grundproduktion, also ohne den Relikt-Bonus , gewertet wird? Ich war ganz happy, als ich während des GA + 60 % Marmor , Holz und Eisen bekommen habe, aber als ich mir das dann in der Marmor-Manu angeschaut habe, stand da bei einer Manu stufe 25 Normale Produktion 370 , Relikt-Bonus 2590, Antike Wunder-Bonus 282 und als Bonus für den Hexenkessel 174. Das ist für die Kosten eigentlich lächerlich^^\t\tZum Vergrößern anklicken.......ja, das ist richtig - allerdings wirkt die Fabelhafte Fabrikation (Güterzauber) auch auf den Kesseleffekt...(dein Effekt ist noch sehr niedrig mit 60 %)....[BR][BR]Romilly schrieb:\t\t\t...also so schlecht finde ich den Manu-Effekt nicht - ich hatte den auf Lvl 40 stehen und mit einem kritischen (50 % Chance) getroffen...[BR][BR]Anhang 33865 ansehen...das macht ca. 1/4 der Produktion aus...Anhang 33862 ansehen[BR]...mit gestärkter FF verzaubert wird daraus...Anhang 33864 ansehenAnhang 33863 ansehen[BR]...wobei 1.679 aus dem Verzauberungsbonus auf den Trank-Effekt entfallen - also zusammen 4334+1679=6.013...[BR][BR]...fällt jetzt bei mir nicht ins Gewicht, da ich jeden Tag über 3 Millionen Gut1 einkaufe, aber für erleuchtete Güter wäre das bei akutem Bedarf ein nettes Plus (spart Unurium) - vor allem, wenn ich dann auch noch den Sturmphönix + Zeitsegen einsetze...\t\tZum Vergrößern anklicken...."}, {"177": "danke Romilly, mir gings vor allem um die lästigen Armreifen im GA, da wäre ein bißchen mehr Produktion sehr willkommen gewesen ^^"}, {"2": "Katzenmarylou schrieb:\t\t\tdanke Romilly, mir gings vor allem um die lästigen Armreifen im GA, da wäre ein bißchen mehr Produktion sehr willkommen gewesen ^^\t\tZum Vergrößern anklicken.......vielleicht hast du für das nächste GA ein paar Fragmente für dein Rezept übrig - damit kannst du die % erhöhen...(müssen ja nicht so viele sein, wie bei mir, aber die % steigen mit jeder Beigabe)...[BR][BR][IMG]https://i.ibb.co/51M0RHF/https-de-forum-elvenar-com-index-php-attachments-g1-png-35180.png[/IMG][IMG]https://i.ibb.co/MG9jQkZ/https-de-forum-elvenar-com-index-php-attachments-g3-png-35182.png[/IMG][IMG]https://i.ibb.co/n7Tdtjm/https-de-forum-elvenar-com-index-php-attachments-g8-png-35179.png[/IMG]...ohne Fragmente/kritischer Effekt...[IMG]https://i.ibb.co/WvrMWBF/https-de-forum-elvenar-com-index-php-attachments-h-ndlerappell-png-35185.png[/IMG][BR][BR]...wirkt natürlich auch auf die anderen Effekte, wie z.B. Gold (auch interessant fürs GA)....[IMG]https://i.ibb.co/5cBkwzD/https-de-forum-elvenar-com-index-php-attachments-g6-png-35184.png[/IMG]"}, {"161": "Wow, ich habe gerade Diamantsegen II bekommen! *freu*"}, {"213": "Bestes Event ever, gut daß man selten was bekommt, die Effekte ein Witz sind, und das aller wichtigste man kann es links liegen lassen  ..............[BR]Und wertvolle Schnipsel dafür verbraten, kommt gar nicht in die Tüte!"}, {"128": "hannessabine schrieb:\t\t\tWow, ich habe gerade Diamantsegen II bekommen! *freu*\t\tZum Vergrößern anklicken....Das ist ja noch nicht so der Hit.[BR]Ich hatte vorgestern den Diamantsegen 39,[BR]gleich 5 Stadterweiterungen gekauft.[BR]Da kann man sogar locker auf Rabatt verzichten. [smilie--sprite6]"}, {"35": "@hannessabine @alf2021 gut, dass gestern der erste Tag des April war [smilie--sprite2]"}]