[{"289": "RayNiflheim schrieb:\t\t\tdie notwendigen Schritte für die Berechnung findest du hier:[BR]\t\t\thttps://de.forum.elvenar.com/index.php?threads/feedback-zum-hexenkessel.26178/post-419434\t\t[BR]noch als Ergänzung:[BR][BR]- die DevTools öffnest du im Browser (in Firefox und Chrome mit F12, in Edge mit Ctrl+Shift+I )[BR]  jede Zutat hat entweder einen 'value' oder einen 'factor'[BR][BR]- die Formel von Karvest ist nur der erste Teil der Berechnung, den Rest beschreibt er verbal[BR][BR] auf Excel übersetzt schaut's dann so aus[BR]  (Zutaten, values, factors sind jeweils Felder mit 12 Werten):[BR]\t\tCode:\tWertEinEffekt = MAX( 0; SUMMENPRODUKT(Zutaten;values) *POTENZ( 1,1; SUMMENPRODUKT(Zutaten;factors) ) ) [BR]die Ergebnisse (und zwar genau so viele WertEinEffekt wie du Diplome hast) müssen dann addiert werden,[BR]sowie die Erfolgsrate abhänging von der Anzahl der verwendeten Zutaten berechnen:[BR]\t\tCode:\tWertAlleEffekte = SUMME( WertEinEffekt )Erfolgsrate = 0,2 * WURZEL( AnzahlZutaten )[BR]ergibt dann normalisiert für einen Effekt:[BR]\t\tCode:\tWahrscheinlichkeit = WertEinEffekt * Erfolgsrate / WertAlleEffekte[BR]- die Wahrscheinlichkeiten der Effekte sind abhänging von der Anzahl der Diplome, d.h. Rezepte merken oder weitergeben ist nur bedingt sinnvoll\t\tZum Vergrößern anklicken....Wenn eine Zutat entweder einen Value oder einen Factor hat, wie kann ich die in Romilly's Tabelle unterscheiden?  Farbe? Größe?   ??"}, {"2": "thors10 schrieb:\t\t\tWenn eine Zutat entweder einen Value oder einen Factor hat, wie kann ich die in Romilly's Tabelle unterscheiden?  Farbe? Größe?   ??\t\tZum Vergrößern anklicken.......hier auch nochmal...[BR][IMG]https://i.ibb.co/6ZhxDW0/https-de-forum-elvenar-com-index-php-attachments-effekte3-png-34127.png[/IMG]...links (kräftige Farben) die \"values\", rechts die \"factors\"..."}, {"289": "Romilly schrieb:\t\t\t...hier auch nochmal...[BR]Anhang 35518 ansehen...links (kräftige Farben) die \"values\", rechts die \"factors\"...\t\tZum Vergrößern anklicken....Und als kleines Dankeschön der US-Rezept-Mixer auf deutsch (Excel-Tabelle).  Viel Spaß"}, {"113": "grade festgestellt, dass die Reisenden Händler als Manufakturen gelten.[BR][BR]gefällt mir[BR]"}, {"289": "Hat Jemand schon rausgefunden wovon der kritische Effekt abhängt?  Nachdem ich jetzt gute Rezepte brauen kann soll ich im Anschluss aber mehrere Tausend Fragmente und/oder hunderte Diamanten zahlen um die Wahrscheinlichtkeit (kritischer Effekt) auf wenige Prozent hochzuschrauben um dann einen evtl. Effekt der weniger als einen Tag hält auszulösen? [BR][BR]Bei aller Liebe, aber wenn es keine andere Möglichkeit gibt die Wahrscheinlichkeit/kritische Chance auf wenigsten 20-30% zu schrauben, dann stimmt das Preis-Leistungsverhältnis einfach nicht. [BR][BR]Beim aktuellen Rezept müsste ich 5000 Fragmente und 100 Dias für 10,5% zahlen.   Bisher konnte ich auch noch nicht rausfinden, ob man die kritische Chance auch noch durch was Anderes als Fragmente und Dias beeinflußen kann. Nur mit Fragmenten wären es 10000 Fragmente."}, {"289": "hannessabine schrieb:\t\t\tWow, ich habe gerade Diamantsegen II bekommen! *freu*\t\tZum Vergrößern anklicken....Im Hexenkessel?  Was ist das und wo gibt es den? Ist mir bisher noch nicht aufgefallen.  Und wie funzt der?"}, {"147": "Bei aller Liebe..[BR]ein Feature, das sich für das Gros der Spieler nur mit aufwändigem Tabellenwerk sinnvoll nutzen lässt? Wenn überhaupt?[BR].[BR]Gehört geschrottet? [BR][BR]Gibt's schon Zahlen zur praktischen Akzeptanz des Kesselfeatures in der Spielerschaft? So etwas wird doch gewiss ausgewertet?"}, {"6": "monakuki schrieb:\t\t\tGibt's schon Zahlen zur praktischen Akzeptanz des Kesselfeatures in der Spielerschaft?\t\tZum Vergrößern anklicken....Nutzt in unserer GM niemand."}, {"134": "bei uns auch so gut wie nie genutzt, das Ding ist sinnfrei"}, {"251": "Ich nutze den Kessel jede Woche in jeder Stadt.[BR]Kostenfrei unterstützt er entweder die Truppen oder die Werkstätten.[BR]Und das nicht zu knapp, es wirkt  [smilie--sprite1] [BR][BR]Der Kessel ist nicht kompliziert![BR]Er wird kompliziert gemacht...[BR]Ihn zu nutzen, dauert nur wenige Minuten.[BR][BR]Vergesst alles, was ihr gelesen und gehört habt.[BR]Macht es euch leicht, und versucht es einfach (noch) mal.[BR]Und lest nichts mehr darüber, er erklärt sich selbst [smilie--sprite1][BR][BR]Ich mag das Feature. Es lebe der Kessel![BR][BR]LG, D"}, {"83": "ich kann mit dem Kessel  wenig anfangen und nutz ihn meistens eher ziemlich lieblos, ohne groß rumzuprobieren.[BR]Paar mal Nachtschatten, Wolkenwolle und oder Schnecken reinwerfen (je nachdem was keine Dias kostet), trinken und Rest in Forschung stecken.[BR][BR]Liegt aber vermutlich nicht zuletzt daran, dass ich eigentlich außer Kampfverbesserer nichts brauchen kann. [BR][BR]Letzte Woche wollt ich mal wieder probieren, ob es nicht doch mit einem Kampfverstärker klappt. Dazu extra den Kesselrechner benutzt.[BR]Stärke des Generals und des Monsters waren auf 31,5 % bzw 21,2 % , Rest irgendwas zwischen 0,5 % und 9,9 %...Frags dazugemischt [BR]und was kam raus:[BR]Steuererhöhung (hatte eine Wahrscheinlichkeit von 2 %) und wertvoller Händlerappell (Wahrscheinlichkeit von 9,9 %).[BR]Beides war für mich völlig sinnlos:[BR]mehr MÜnzen sind eher lästig, weil man dann noch öfter beim Händler gegen Standardgüter tauschen gehen muss für Standardgüter, die zwischen 14 mio und 25 mio im Inventar vergammeln[BR]und ein Plus auf Gut 3 war auch sinnlos, weil der Boost nur auf Manus wirkt und ich keine Gut 3 Manus stehen hab [BR][BR]Die Woche spar ich mir den Frust. Ich kipp wieder 2 oder 3 Zutaten bei den Kampfzutaten rein und der Rest kommt in die Verbesserung (wenn ich die Hexe nicht wieder mal komplett vergess, was auch schon passiert ist)"}, {"113": "Ich nutze den Kessel jede Woche, mal mit mehr und mal mit weniger zufrieden stellenden Ergebnissen. [BR]So, wie ich den Turm nutze und das Turnier und die Wunder und die Events und die Abenteuer.[BR]Ich spiele Elvenar."}, {"213": "Wenn man ein Studium machen muss, oder eine monströse Tabelle nutzen müsste, ist das Event für das gro der Spielerschaft sinnfrei.[BR]INNO suchte eine neue Geldquelle, mehr ist es nicht. Spaß null."}, {"4": "Ich werf die ersten beiden und die letzten beiden Zutaten rein, sofern diese keine Dias kosten. Danach braue ich und stecke den Rest in die Verbesserung. Alles andere ist mir einfach zu anstrengend.[BR][BR]Anfangs dachte ich, schön, ein bisschen Verbesserung im Turm und in den Turnieren, aber das klappt einfach zeitlich nicht, da ich direkt gezwungen bin, zu trinken.[BR][BR]Allerdings vergesse ich meist morgens die Hexe und muss die dann irgendwann doch freitags noch schnell machen, ohne wirklich was zu merken davon."}, {"102": "Sicher kann man sich da intensiv damit beschäftigen und Einiges dabei herausholen - nur für mich ist das nichts. [BR]Mache das ähnlich wie von Einigen schon geschrieben - verteile die Punkte auf die diamantfreien Zutaten und brauche drauf los. Was klappt das klappt und so ist es ein kleiner Zugewinn. Muss aber auch immer dran denken, dass ich den Kessel nicht vergesse. [BR][BR]Vielleicht würde ich mir mehr Mühe geben, wenn ich den Trank brauen könnte und später, in einem für mich passenden Moment, trinken könnte. Aber so, wie es jetzt ist, spricht mich der Kessel nicht an."}, {"213": "Anoli2 schrieb:\t\t\tVielleicht würde ich mir mehr Mühe geben, wenn ich den Trank brauen könnte und später, in einem für mich passenden Moment, trinken könnte.\t\tZum Vergrößern anklicken....Ja, das wäre mal eine sinnvolle Änderung. Abfrage : Trinken, ja / später."}, {"161": "thors10 schrieb:\t\t\tIm Hexenkessel?  Was ist das und wo gibt es den? Ist mir bisher noch nicht aufgefallen.  Und wie funzt der?\t\tZum Vergrößern anklicken....War 'n Aprilscherz... (-;"}, {"103": "Wer den Kessel zu einer hochmathematischen Studie macht und ihn ablehnt,[BR]weil er angeblich zu kompliziert ist, naja der hat in meinen Augen selbst schuld.[BR][BR]Man kann den Kessel vielleicht mit extrem hohem Einsatz von Dingen und mit Tabellen gegen 100% optimieren[BR]aber das verlangt doch niemand.[BR][BR]Man muss sich doch einfach nur einprägen, welche Zutaten zu welchem Effekt passen oder eine relativ einfache Tabelle dafür nutzen.[BR][BR]Ich verstehe ehrlich gesagt immer noch nicht, was die ganze Aufregung soll.[BR][BR]Ich, für mich, nutze den Kessel sehr gerne und unkompliziert jeden Montag Abend, wenn ich den Turm spiele.[BR]Es dauert vielleicht 3 min, wenn ich langsam bin, dann sind die Zutaten gewählt und in den meisten Fällen am Ende auch ein oder mehrere[BR]Militärbooster dabei, je nach Lage der Diamanten-Zutaten.[BR]Ich verwende weder Dias, noch Fragmente und ich bin trotzdem erfreut über jede Hilfe beim Kampf,[BR]die kostenlos vom Kessel angeboten wird.[BR][BR]Manche Sachen kann man auch einfach totreden oder man nutzt sie so, wie sie angeboten werden."}, {"35": "thors10 schrieb:\t\t\tIm Hexenkessel?  Was ist das und wo gibt es den? Ist mir bisher noch nicht aufgefallen.  Und wie funzt der?\t\tZum Vergrößern anklicken....das war - denke ich - ein Aprilscherz [smilie--sprite2]"}, {"120": "littleFlex schrieb:\t\t\tManche Sachen kann man auch einfach totreden oder man nutzt sie so, wie sie angeboten werden.\t\tZum Vergrößern anklicken....oder man ignoriert sie und schweigt besser darüber?"}]