[{"153": "Der Hexenkessel tut doch niemandem weh. Wer den Nutzen nicht sieht, ignoriert ihn einfach und die anderen freuen sich einmal pro Woche über ein paar Booster. Alle zufrieden?"}, {"290": "littleFlex schrieb:\t\t\tManche Sachen kann man auch einfach totreden oder man nutzt sie so, wie sie angeboten werden.\t\tZum Vergrößern anklicken....Man kann aber auch kritisieren was man für benutzerunfreundlich hält.[BR]Wenn wir alles einfach kommentarlos hingenommen hätten, [BR]müssten wir vermutlich heute noch jeden einzelnen Questgeber beim Abenteuer durchblättern, [BR]um den richtigen zum einsammeln zu finden.[BR]Inno kann doch nur etwas verbessern wenn wir mitteilen, was unpraktisch, mühsam oder völlig uninteressant ist."}, {"147": "Da hier jede! - oder zumindest nahezu jede - Idee ausgerechnet von Kesselliebhabern mit dem Argument abgelehnt wird, sie sei für die Mehrzahl der User nicht zu gebrauchen und die Entwickler sollten doch ihre Ressourcen für „wirklich“ Sinnvolleres aufwenden …[BR][BR].. werde ich zu gegebenem Anlass daran erinnern ;- )[BR][BR](Was hätten die Devs wohl mit dieser Kessel-Zeit alles Tolles anfangen können? ^^)"}, {"290": "Cole6666 schrieb:\t\t\tDiese Anti-Stimmung zieht sich bereits seit Kessel-Beginn an durch das Forum und mittlerweile nervt es nur noch.\t\tZum Vergrößern anklicken....Das sehe ich etwas anders. [BR]Mich z.B nervt das nicht.[BR]Dieser Feedbackthread über den Kessel liest sich sehr angenehm. [BR]Beide Seiten teilen mit, erklären wenn und aber und ich bekomme alle Infos die ich brauche um ihn auszuprobieren.[BR]Dann kommt das toll oder nicht toll der Tester.[BR]Also eine angenehme Diskussion und die geht so lange gut, [BR]bis der erste schreibt: \"Jetzt ist aber mal genug mit Diskussion und negativem Feedback weil mich das nervt.\""}, {"81": "Ich mag den Kessel auch nicht wirklich, das ist aber meine persönliche Meinung.[BR]Kann diese auch mit mehreren Argumente begründen warum das Modul für mich nichts ist und was es brauchen würde für mich interessanter zu werden.[BR][BR]Aber nur weil es mir nicht gefällt heißt das nicht das andere es nicht toll finden dürfen [smilie--sprite2] (gilt umgekehrt aber auch so)[BR][BR]Jeder spielt anders und kann das Modul in den Spielstil integrieren. Manchen gelingt das gut anderen weniger gut."}, {"2": "...dieser Satz...[BR]littleFlex schrieb:\t\t\tManche Sachen kann man auch einfach totreden\t\tZum Vergrößern anklicken.......hat sich mMn vor allem auf das hier bezogen...[BR]littleFlex schrieb:\t\t\tWer den Kessel zu einer hochmathematischen Studie macht und ihn ablehnt,[BR]weil er angeblich zu kompliziert ist, naja der hat in meinen Augen selbst schuld.\t\tZum Vergrößern anklicken.......denn das ist nicht notwendig...[BR]...und daher..[BR]littleFlex schrieb:\t\t\toder man nutzt sie so, wie sie angeboten werden.\t\tZum Vergrößern anklicken....littleFlex schrieb:\t\t\tMan muss sich doch einfach nur einprägen, welche Zutaten zu welchem Effekt passen oder eine relativ einfache Tabelle dafür nutzen\t\tZum Vergrößern anklicken.......eine Sache von wenigen Sekunden/Minuten - bekommt man was Brauchbares, kann man sich darüber freuen und ansonsten hat der Kessel doch eigentlich nichts gekostet..."}, {"153": "Spannend fände ich die schon öfters genannte Möglichkeit, die Kessel-Effekte als Segen ins Inventar zu bekommen. So könnte man die Effekte zeitlich flexibler einsetzen, z.B. auch sparen für Events und GA."}, {"2": "felidaey schrieb:\t\t\tSpannend fände ich die schon öfters genannte Möglichkeit, die Kessel-Effekte als Segen ins Inventar zu bekommen. So könnte man die Effekte zeitlich flexibler einsetzen, z.B. auch sparen für Events und GA.\t\tZum Vergrößern anklicken.......dann hast du irgendwann ein Inventar mit tausend verschiedenen Fläschchen (20 Sorten), die sich in Dauer und Stärke unterscheiden - das wäre sehr sehr unübersichtlich...vergiss nicht: das Spiel ist auf Jahre ausgelegt...[BR][BR]...und dann hast du vermutlich nen Anzeigefehler und schluckst das verkehrte Zeug (so ähnlich sind mir schon ein paar Zeitbooster drauf gegangen)..."}, {"4": "Romilly schrieb:\t\t\t...dann hast du irgendwann ein Inventar mit tausend verschiedenen Fläschchen (20 Sorten), die sich in Dauer und Stärke unterscheiden - das wäre sehr sehr unübersichtlich...vergiss nicht: das Spiel ist auf Jahre ausgelegt...[BR][BR]...und dann hast du vermutlich nen Anzeigefehler und schluckst das verkehrte Zeug (so ähnlich sind mir schon ein paar Zeitbooster drauf gegangen)...\t\tZum Vergrößern anklicken....Es gäbe ja die Möglichkeit, dass diese Booster in der Nacht zum Samstag zerfallen. Man also ins Inventar stecken kann, aber entweder bis Freitag 24 Uhr nutzt oder dann am Samstag vor leerem Regal steht. Damit wäre dieses Problem gelöst.[BR][BR]Aber mein Interesse wäre deutlich, sehr deutlich, größer, mich mit dem Kessel zu beschäftigen, denn jetzt stimmen die Termine für bestes Abholen von Gütern und Nutzung von Truppenverbesserungen überhaupt nicht überein. Entweder ich kann das eine oder das andere nutzen, da ich morgens so gut wie nie kämpfe"}, {"14": "ich bin bei dem Kessel ja ziemlich zwiegespalten[BR]er KANN mächtig sein, dafür muss man dann aber auch zusätzlich Fragmente/Dias einsetzen[BR]will man das nicht ist die Wirkung überschaubar[BR](Fragmente wären ja o.k., wenn man davon genug hätte: die reichen bei mir so gerade für die Aka, trotz zerlegen und Turm bis oben)[BR]ich bin jetzt in Kapitel 15 und hab auch meine ganzen Effekte hochgelevelt[BR]eigentlich wollte ich nur 3 oder 4, aber dazu gibt es ziemlich viele Ausreißer bei den Tränken, also fand ich persönlich es besser, dann davon zumindest was zu haben, wenn was anderes kommt als ich mir wünsche[BR]verwendet habe ich dazu hautsächlich Mana, weil es ja sowieso zerfällt und ich davon genug habe..[BR]bis zum nächsten Kessel hat es sich auch immer regeneriert, nur werden jetzt die Mengen doch schon ziemlich hoch ud ich denke für die Forschung bin ich jetzt schon so ca. am Ende, meine Lager sind halt nicht so übervoll, wie bei hohen Leveln[BR][BR]so, das sind jetzt die Voraussetzungen und eigentlich sollte mich also alles freuen, was ich bekomme[BR]ich bin heute auf Orks und Kaserne gegangen und die Stärke des Generals kam auch![BR]aber keine Orks, dafür dann Werkzeug, was ich prinzipiell auch nicht schlecht finde![BR][BR]so sehen meine Sterne aus:[BR][BR][IMG]https://i.ibb.co/kcMCxpJ/https-de-forum-elvenar-com-index-php-attachments-screenshot-657-png-35776.png[/IMG][BR][BR]das kam jetzt als Erfolg:[BR][BR][BR][IMG]https://i.ibb.co/dt2vR6m/https-de-forum-elvenar-com-index-php-attachments-screenshot-655-png-35777.png[/IMG][BR][BR]trotzdem bin ich irgendwie unzufrieden mit dem Werkzeug (15 min):[BR][IMG]https://i.ibb.co/VvymP6r/https-de-forum-elvenar-com-index-php-attachments-screenshot-656-png-35778.png[/IMG][BR][BR]bei 35 Sternen hätte ich schon ein bisschen mehr vom Zaubertrank erwartet[BR][BR]und das zieht sich so: ich empfinde den Benefit als zu gering[BR]mag es ja in höheren Kapiteln mit mehr Sternen dann besser werden...hmm[BR][BR][BR][BR]und am allerschlimmsten:[BR]wenn der ganze Kessel nicht deutlich über 50% Wahrscheinlichkeit liegt, dann schlägt er bei mir in der Regel fehl[BR]und meistens kommen die Dinge, die eigentlich nur eine geringe %-Wahrscheinlichkeit haben und die zufällig nur unter \"fernen liefen\" im Trankrezept auftauchen (ich bekomme diese Nebeneffekte aber nie auf Null, das ist nur in kleinen Städten mit wenigen Diplomen möglich)[BR][BR]diese große Streunung stört mich und die vielen Fehlschläge und die geringe Wirkung auch[BR][BR]dabei sollte ich mit dem heutigen Brauen eigentlich voll zufrieden sein[BR][BR]nur zur Übersicht, die Wirkung meiner Tränke:[BR][BR]Stärke des Generals:[BR][IMG]https://i.ibb.co/9Txvd2Z/https-de-forum-elvenar-com-index-php-attachments-screenshot-658-png-35779.png[/IMG]   hierbei die 30% aus den Nadeln[BR][BR]wertvoller HändlerappelI (3h Produktion):[BR][IMG]https://i.ibb.co/rGcf7fx/https-de-forum-elvenar-com-index-php-attachments-screenshot-660-png-35780.png[/IMG][BR][BR]regulärer Händlerapell (3h):[BR][IMG]https://i.ibb.co/1mtvwv1/https-de-forum-elvenar-com-index-php-attachments-screenshot-661-png-35781.png[/IMG][BR][BR][BR]liegt das jetzt an mir, dass ich das für wenig ansehe?[BR]den Truppeffekt kann ich trotz Schleife (im Aufbau) nur 1 Runde nutzen[BR]beim Werkzeug bringen mir andere Effekte ein Vielfaches vom Zaubertrank[BR]bei den Gütern komme ich auch nur auf maximal 2x Absammeln und der Effekt wird durch anderes auch getoppt[BR][BR]läuft es wirklich darauf hinaus, dass man dort Tausende Zauberfagmente versenken muss und am besten noch eine ordentliche Portion Dias?[BR]um dann wirklich glücklich mit dem Ergebnis zu werden[BR][BR]klar, ich kann mich jetzt freuen, der Kessel war diesmal nicht ohne Ergebnis oder mit etwas, was ich nicht habe (wie Siedlungsgüter momentan)[BR]trotzdem freue ich mich nicht genug[BR]denn ich meine ich hätte alles richtig gemacht, weil ich gemerkt habe, dass es keinen Sinn macht, nur einen Effekt hochzuleveln, denn dann hat man zu häufig gar nichts davon"}, {"2": "Neris schrieb:\t\t\tbei 35 Sternen hätte ich schon ein bisschen mehr vom Zaubertrank erwartet\t\tZum Vergrößern anklicken.......die 22,8 % wirken zwar nur auf die normale Produktion - der Kulturbonus wirkt dann ebenso auf die normale Produktion - der Vorrätezauber wirkt aber sowohl auf diese Summe als auch den Zaubertrank-Effekt...das Gleiche gilt für die fabelhafte Fabrikation (Güterzauber)...[BR][BR]...bei mir läuft einer mit 150 %[IMG]https://i.ibb.co/NssHzJX/https-de-forum-elvenar-com-index-php-attachments-zz4-png-35788.png[/IMG]...und anscheinend noch ein paar gerundete Zerquetschte...[BR][BR][IMG]https://i.ibb.co/jhGPtCT/https-de-forum-elvenar-com-index-php-attachments-zz2-png-35786.png[/IMG] Kulturbonus auf die 14200 bedeutet > 142.00 x 6,64 (die normalen 100 % abziehen) > 942.880[BR][IMG]https://i.ibb.co/QC2GCxX/https-de-forum-elvenar-com-index-php-attachments-zz-png-35785.png[/IMG]... der Zaubertrank-Effekt (142.000 x 1,5 = 213.050 - sind 50 Zerquetschte) wirkt aber wie weitere 150 % Kulturbonus...also muss ich hier addieren..[BR]142.000 + 942.880 + 213.050 = 1.297.930 und darauf wirkt dann der Zauber...[BR][IMG]https://i.ibb.co/28JLTK1/https-de-forum-elvenar-com-index-php-attachments-zz3-png-35787.png[/IMG] 1.297.930 x 2.85= 3.699.101[BR][BR]...Güterzauber:[BR][IMG]https://i.ibb.co/vLV0BC1/https-de-forum-elvenar-com-index-php-attachments-zz5-png-35797.png[/IMG]...der Effekt[IMG]https://i.ibb.co/C7Zvtx5/https-de-forum-elvenar-com-index-php-attachments-zz6-png-35798.png[/IMG]...wirkt ebenfalls nur auf die normale Produktion...[BR][BR]...also 1350 x 348,2 = 4701..[BR][BR]...der Güterzauber [IMG]https://i.ibb.co/0jnxdT8/https-de-forum-elvenar-com-index-php-attachments-zz7-png-35799.png[/IMG]...wirkt aber mit seinen 90 % auf alles zusammen...[BR][BR]...also 1350 + 9450 + 2403 + 4701 (Effekt) = 17.904 x 0,9 = 16.114[BR][BR]...ohne den Effekt hätten wir nur 1350 + 9450 + 2403 = 13.203 x 0,9 = 11.883...[BR][BR]der Effekt von 348,2 % bewirkt also direkt eine Mehrproduktion von 4.701 + indirekt weitere  4.231 durch die Verzauberung - ergibt: 8932, was ca. 26 % vom Gesamtwert sind oder andersrum eine Steigerung um 35,6 %...(bei mir mit verbesserten Werten)"}, {"167": "Danke @Neris , du hast mit deiner Beschreibung auch mein ambivalentes Gefühl zum Kessel sehr gut beschrieben."}, {"83": "littleFlex schrieb:\t\t\tManche Sachen kann man auch einfach totreden oder man nutzt sie so, wie sie angeboten werden.\t\tZum Vergrößern anklicken....Wozu dann einen feed-back thread, wenn negative Kritik als \"totreden\" gebrandmarkt wird.[BR][BR]Der Kessel ist - anders als einzelne events- ein wöchentlich wiederkehrendes feature.[BR]Entsprechend können sich theoretisch auch die Erfahrungen damit verändern (oder eben ein positiver oder negativer Eindruck noch mehr verstärken)[BR][BR]Grundsätzlich habe ich überhaupt kein Problem damit, mich mit irgendetwas näher zu befassen, rumzutüfteln, Strategien (Rezepte) auszuprobieren, wie etwas am effektivsten funktionieren könnte. Macht mir normalerweise sogar viel Spaß. [BR]Nur ist der Kessel in der derzeitigen Form eher ungeeignet und führt zu Frust und dazu, dass man ihn immer mal wieder ganz vergisst.[BR][BR]Und irgendwie stirbt die Hoffnung zuletzt, dass inno vielleicht auf den einen oder anderen Kritikpunkt eingeht und Veränderungen vornimmt [smilie--sprite2] [BR][BR]Was mich persönlich am Kessel  stört (Spieler mit komplett anderer Spielweise betrifft das vielleicht nicht- andererseits: wenn mich mir die Beiträge so durchlese, deckt sich das durchaus mit den Erfahrungen nicht weniger anderer Spieler )[BR][BR]- die Laufzeit des Kessels: der Kessel ist von Sonntag bis Freitag Abend aktiv, am Samstag (der Tag, an dem ich normalerweise am ehesten Zeit für ein längeres Spielen/Kämpfen am Stück Zeit hätte und an dem Kampfbooster- soweit sie denn einmal kämen- am effektivsten wären), ist die Hexe leider unterwegs, um Zutaten zu suchen.  [BR]Vielleicht könnte die Hexe ihren Dienstplan überdenken[BR][BR]- der Trank muss nach dem Brauen sofort konsumiert werden und die Laufzeit der Effekte beginnt sofort. [BR]   Was nützen Effekte, wenn man sie nicht wirklich auskosten kann, weil RL wenig Zeit am Stück lässt. [BR]   Vor allem: wozu soll man dann Fragmente (oder sogar dias) einsetzen bzw. forschen, wenn man dann die längere Zeitdauer eh nicht nutzen       kann[BR][BR]- stärkster Punkt, der mir den Spaß am Kessel bisher (immerhin läuft er jetzt schon eine ganze Weile und es wird nicht besser) vermiest hat, ist[BR]   der nervige Zufallsfaktor, der immer dann, wenn ich mal etwas mehr Zeit hatte und mich mit dem Kessel befasst habe, grundsätzlich nie die Effekte gebraut hat, die ich wollte und brauchen konnte und für die ich die entsprechenden Zutaten ausgewählt habe, sondern - wie wenn er es ahnen würde, was ich nicht will- mir die Effekte gegeben hat, die ich definitv nicht wollte.[BR]Klar, es mag bei einer anderen Spielweise oder in anderen Kapiteln ganz anders aussehen, aber für mich und meine Spielweise sind booster auf Standardgüter oder Münzen, Orks und- wenn nicht grad der Bär gefüttert ist -auch Vorräte, völlig überflüssig, zumal sie nur auf reguläre Gebäude wirken und nicht auf Eventgebäude.[BR][BR]Es heißt ja immer, dass der Kessel ein Feature ist, das mehr oder weniger gratis (von inno sicher anders gewollt) ein kleines Plus auf irgendwas gibt, über das man sich doch freuen sollte.[BR][BR]Ich hab nur leider irgendwie den Eindruck, dass inno die Kesseleffekte  schon bei Turm und Turnier und bei der Aka mit eingerechnet hätte. [BR]Auch wenn ich es nicht mit konkreten Zahlen belegen kann, da ich schon länger nicht mehr notiere, welche Rezepte in der Aka angeboten werden, habe ich das Gefühl, dass Kampfbooster seit Erscheinen des Kessels noch seltener erscheinen als vorher.[BR][BR]Und ich hab auch das Gefühl, dass die Kämpfe - vor allem im Turnier- seit Einführung des Kessels schwerer geworden sind (vor allem in den höheren Provinzen mehr Gegner aus unterschiedlichsten Kampfklassen, unangenehmere Geländekarten und eine verbesserte KI der Gegner).[BR]Dass  Kämpfe bei einem Kapitelwechsel erst mal schwerer werden, weiß ich. Aber daran kanns nicht liegen. Mein letzter Kapitelwechsel war am 6. 12.2022 (erster Tag des Winterzauberevents). Kann auch nicht daran liegen, dass ich seitdem viele Forschungen freigeschaltet hätte, Erweiterungen gesetzt hätte oder viele neue Wunderstufen dazugekommen wären (Erweiterung wurde die letzte vor Freischaltung des Kessels gesetzt, Anzahl der Forschungen auch übersichtlich und die letzten Wunder, die ich schnell ausgebaut hab, waren Simia und Zeitschleife und die waren bis Ende des Jahres auch jeweils auf 30. Seitdem wandern halt nur noch die überflüssigen Punkte aus der Leiste in Wunder, die alle schon Ü30 sind, wo der Bau einer Stufe dann schon mal einen Monat oder mehr dauert).[BR][BR]Ich würde mir wünschen, dass es im Kessel mehr Möglichkeiten gäbe, unerwünschte Effekte ganz auszuschalten oder die Menge der Effekte auf 2 oder 3 zu beschränken (gern auch durch Gütereinsatz, Einsatz von Fragmenten).[BR]Am liebsten wäre mir natürlich, wenn der Zufallsfaktor beim Brauergebnis ganz wegfallen würde und bestimmte Zutaten einen fixen Effekt auslösen würden. Meinetwegen weiter mit einem Zufallsfaktor was die Höhe und Dauer der Wirkung angeht und was die Auslösung des Effekts als solchen betrifft (beides jedoch zu beeinflussen durch die Menge der Zutaten und der beigefügten Fragmente/Dias etc)."}, {"14": "ich kann @giuni in fast allem zustimmen:[BR][BR]die Zeit, wann die Hexe da ist bzw. ihren Arbeitsplatz einnimmt ist schlecht gewählt[BR]an dem Tag werde ich 2-fach auf sie aufmerksam gemacht: als Icon über der Aka und als Text in der Glocke[BR]die Tage danach, wenn es besser passt, macht mich niemand mehr auf sie aufmerksam und ich vergesse sie und muss dann meist am Freitag, wegen der Ankündigung, dass sie bald geht, ganz schnell was mischen (diesmal hab ich mal dran gedacht!)[BR][BR]und das Gefühl, dass etwas, was ich nicht will in dem Moment und mit wenig % \"einmischen\" muss, dann garantiert kommt[BR]schon deshalb habe ich die Sterne überall verteilt, denn sonst nervt das ja noch mehr![BR][BR]die Bilder von @Romilly sind alle ganz toll, aber das ist eben das, dass der Kessel schon dadurch den Eindruck vermittelt, dass er erst in den höchsten Kapiteln etwas bewirkt..[BR]aber evtl. waren es ja auch die ui.ui.ui -Egebnisse mit kritischem Effekt: die sind dann natürlich ganz anders hoch[BR]ebenso wie der Kulturbonus, den ich mit Kapitel 15 eben noch nicht auf 764% schaffe, sondern lediglich läuft gerade 350%[BR]ich hab die fabelhafte Fabrikation auch nicht auf 90%, sondern nur auf 75%[BR][BR]ich bin eben auch erst Stufe 15 und es ist abzusehen, dass ich meine Manus demnächst reduziere[BR]dann sind solche Gewinne sowieso für mich unnötig[BR]aber gut, das ist die Spielweise auf die ein Kessel nicht Rücksicht nehmen kann[BR][BR]aber die Werte im Vergleich zwischen Kapitel 20 und 15 sagen ja schon genug: weil man a noch nicht schafft, wird man nachfolgend mit b \"bestraft\":[BR]der Kessel bringt eben auch keine fast 50% mehr-Produktion zu sonst (siehe Elfenharz bei Romilly), sondern nur 10% und weniger zusätzlich (siehe Stahl und Staub in meinen Bildern)[BR](ja, ich weiß, der Trank erhöht auch noch den Bonus der fab.Fab, aber eben bei hohen Leveln deutlich mehr)[BR][BR]man erwirtschaftet ja mit 15 eh weniger, aber warum man von dem kleineren Wert auch nur 10% Mehrwert erhält und im hohen Level viel mehr anteilig, erschließt sich mir nicht[BR][BR]ich fühle mich nach den Bildern von Romilly noch unzufriedener mit meinem Ergebnis..[BR]zum Glück habe ich wenigstens den Kasernen-Boost bekommen, den ich wollte..[BR]das andere war eh nur \"Beiwerk\", aber eben trotz hoher Levelkosten für die Sterne eben enttäuschend!"}, {"2": "Neris schrieb:\t\t\tdie Bilder von @Romilly sind alle ganz toll, aber das ist eben das, dass der Kessel schon dadurch den Eindruck vermittelt, dass er erst in den höchsten Kapiteln etwas bewirkt..\t\tZum Vergrößern anklicken.......nicht in den höchsten Kapiteln, sondern wenn sie gut gestärkt wurden und außerdem mit anderen Dingen kombiniert - daß man dabei in höheren Kapiteln mehr Möglichkeiten hat, ist logisch - dafür entwickelt man sich ja weiter...das dauert aber nun mal seine Zeit...[BR][BR]...nebenbei - wenn der Kulturbonus geringer ist, fällt der Zaubereffekt ja stärker ins Gewicht...[BR][BR]...ich hab auf den Bildern einen Kulturbonus von 764 % und der Effekt wirkt wie weitere 150 % - zusammen also 914 % (ca. 19,6 % mehr)[BR][BR]...hätte ich nur einen Kulturbonus von 150 % wären es trotzdem 150 % mehr durch den Effekt also zusammen 300 % - (100 % - das Doppelte mehr)..."}, {"14": "gut gestärkt? heißt?[BR]20.000 Fragmente und 500 Dias?[BR][BR]ich habe keine Fragmente übrig, die gibt mir das Spiel nicht, trotz Zerlegen von Gewinnen und Portalos[BR]500 Dias? ich brauche die für die Stadtentwicklung, denn ich stehe eben nicht ewig lange in einem Kapitel und ich hab noch 5 vor mir[BR][BR]über Fragmente ließe ich ja gerne mit mir reden, aber dann muss ich auch eine Möglichkeit bekommen, sie zu erhalten[BR]die Aka dafür leer stehen zu lassen ist es eben dann doch nicht wert: die Gewinne dort sind deutlich besser als der Kessel"}, {"2": "Neris schrieb:\t\t\tüber Fragmente ließe ich ja gerne mit mir reden, aber dann muss ich auch eine Möglichkeit bekommen, sie zu erhalten\t\tZum Vergrößern anklicken.......da stimm ich dir auch vollkommen zu...[BR][BR]...insgesamt funktioniert der Kessel gut und da muss man natürlich aufpassen, daß der bei Spielern mit vielen Möglichkeiten bzw. im Laufe der Zeit nicht \"zu gut\" wird...[BR][BR]...momentan funktioniert er aber auch mMn für die niedrigeren Kapitel \"zu schlecht\"... daher wären ein paar Anpassungen sicher sinnvoll..[BR][BR]1) mehr Hexenpunkte für den Brauvorgang - also ein Startkapital und dazu dann wie gehabt je absolvierte Forschung weitere Punkte[BR]2) viel mehr Fragmente über die anderen Spielelemente (Turm/Entzaubern) und Gebäude, die Fragmente abgeben[BR]3) ebenso mehr erspielbare Diamanten oder eine höhere Auswirkung im Rezept - man muss ja erst einmal auf den Geschmack kommen, um überhaupt welche einsetzen zu wollen...[BR][BR]...man darf hier nicht vergessen, daß die Mehrheit der Sprachversionen nur in einer oder zwei Welten Dias sammeln kann - die können sich noch so anstrengen und werden nicht auf die Beträge kommen, die man sich in DE oder US ersammeln kann - Dias werden aber nur im Kessel landen, wenn man es sich gut leisten kann (sonst sind andere Dinge wichtiger) um trotzdem auch die Mehrweltenspieler zum Dia-Ausgeben bzw. zum Kauf zu bringen, braucht es öfters mal weitere \"tolle\" Angebote gegen Dias - wie die Phönix-Angebote an Ostern, dann klingelt auch wieder die Kasse...ist ganz einfach - wenn man lange spart bzw. nur selten im Jahr was ausgibt, passt man gut auf seine Schätze auf - macht man dagegen das Diasäckchen häufiger auf, kann es schon passieren, daß da plötzlich \"zu wenig\" drin ist und da man aber gerne was ausgeben möchte (ist man ja so gewohnt), braucht man dann halt Nachschub und zwar schnell [smilie--sprite1][BR][BR]4) die Werte die im Studiervorgang verbessert wurden, sollte man bei Auslösen eines Effektes auch bekommen und nicht nur einen Bruchteil, somit sind erhaltene Effekte auch gleichzeitig mehr wert[BR]5) im Gegenzug dazu würde ich die Aufbesserung durch Zugabe von Fragmenten/Dias vom max. 3fachen auf das 2fache reduzieren und dann bei einem Kritischen Treffer noch einmal erhöhen, sodaß wir dann wieder beim 3fachen Wert sind - bei der Dauer das Gleiche - doppelte Menge durch maximale Zugabe und dann 3fache Dauer des erforschten Wertes bei einem Kritischen Treffer - da das dann nur 3fach ist und nicht 4,5fach wie im Moment bei einem Kritischen Treffer, sollte die Wirkungsdauer generell etwas erhöht werden (ein 10-Minuten-Effekt ist lächerlich)[BR]6) in der Studierphase könnten noch weitere Ressourcen zum Kauf von Hexenpunkten verwendet werden (erweckte/erleuchtete Güter, Truppen, Relikte)[BR]7) warum muss die Zauberin einen gesamten Tag im Wald verbringen? Kann das kein Lehrling machen, der dann einfach Sonntag Früh die Lager auffrischt?[BR][BR]...hier ein Vergleich von kritischem zu normalem Treffer vom selben Trank(Rezept)[BR][IMG]https://i.ibb.co/Mc3wPf4/https-de-forum-elvenar-com-index-php-attachments-k5-png-35831.png[/IMG][IMG]https://i.ibb.co/Jnh9h46/https-de-forum-elvenar-com-index-php-attachments-k1-png-35833.png[/IMG][BR][IMG]https://i.ibb.co/XZztZpN/https-de-forum-elvenar-com-index-php-attachments-werkzeugeffekt-png-35835.png[/IMG]...das wären die erforschten Werte..."}, {"4": "Neris schrieb:\t\t\tich bin bei dem Kessel ja ziemlich zwiegespalten[BR]er KANN mächtig sein, dafür muss man dann aber auch zusätzlich Fragmente/Dias einsetzen[BR]will man das nicht ist die Wirkung überschaubar[BR](Fragmente wären ja o.k., wenn man davon genug hätte: die reichen bei mir so gerade für die Aka, trotz zerlegen und Turm bis oben)[BR]ich bin jetzt in Kapitel 15 und hab auch meine ganzen Effekte hochgelevelt[BR]eigentlich wollte ich nur 3 oder 4, aber dazu gibt es ziemlich viele Ausreißer bei den Tränken, also fand ich persönlich es besser, dann davon zumindest was zu haben, wenn was anderes kommt als ich mir wünsche[BR]verwendet habe ich dazu hautsächlich Mana, weil es ja sowieso zerfällt und ich davon genug habe..[BR]bis zum nächsten Kessel hat es sich auch immer regeneriert, nur werden jetzt die Mengen doch schon ziemlich hoch ud ich denke für die Forschung bin ich jetzt schon so ca. am Ende, meine Lager sind halt nicht so übervoll, wie bei hohen Leveln[BR][BR]so, das sind jetzt die Voraussetzungen und eigentlich sollte mich also alles freuen, was ich bekomme[BR]ich bin heute auf Orks und Kaserne gegangen und die Stärke des Generals kam auch![BR]aber keine Orks, dafür dann Werkzeug, was ich prinzipiell auch nicht schlecht finde![BR][BR]so sehen meine Sterne aus:[BR][BR]Anhang 35776 ansehen[BR][BR]das kam jetzt als Erfolg:[BR][BR][BR]Anhang 35777 ansehen[BR][BR]trotzdem bin ich irgendwie unzufrieden mit dem Werkzeug (15 min):[BR]Anhang 35778 ansehen[BR][BR]bei 35 Sternen hätte ich schon ein bisschen mehr vom Zaubertrank erwartet[BR][BR]und das zieht sich so: ich empfinde den Benefit als zu gering[BR]mag es ja in höheren Kapiteln mit mehr Sternen dann besser werden...hmm[BR][BR][BR][BR]und am allerschlimmsten:[BR]wenn der ganze Kessel nicht deutlich über 50% Wahrscheinlichkeit liegt, dann schlägt er bei mir in der Regel fehl[BR]und meistens kommen die Dinge, die eigentlich nur eine geringe %-Wahrscheinlichkeit haben und die zufällig nur unter \"fernen liefen\" im Trankrezept auftauchen (ich bekomme diese Nebeneffekte aber nie auf Null, das ist nur in kleinen Städten mit wenigen Diplomen möglich)[BR][BR]diese große Streunung stört mich und die vielen Fehlschläge und die geringe Wirkung auch[BR][BR]dabei sollte ich mit dem heutigen Brauen eigentlich voll zufrieden sein[BR][BR]nur zur Übersicht, die Wirkung meiner Tränke:[BR][BR]Stärke des Generals:[BR]Anhang 35779 ansehen   hierbei die 30% aus den Nadeln[BR][BR]wertvoller HändlerappelI (3h Produktion):[BR]Anhang 35780 ansehen[BR][BR]regulärer Händlerapell (3h):[BR]Anhang 35781 ansehen[BR][BR][BR]liegt das jetzt an mir, dass ich das für wenig ansehe?[BR]den Truppeffekt kann ich trotz Schleife (im Aufbau) nur 1 Runde nutzen[BR]beim Werkzeug bringen mir andere Effekte ein Vielfaches vom Zaubertrank[BR]bei den Gütern komme ich auch nur auf maximal 2x Absammeln und der Effekt wird durch anderes auch getoppt[BR][BR]läuft es wirklich darauf hinaus, dass man dort Tausende Zauberfagmente versenken muss und am besten noch eine ordentliche Portion Dias?[BR]um dann wirklich glücklich mit dem Ergebnis zu werden[BR][BR]klar, ich kann mich jetzt freuen, der Kessel war diesmal nicht ohne Ergebnis oder mit etwas, was ich nicht habe (wie Siedlungsgüter momentan)[BR]trotzdem freue ich mich nicht genug[BR]denn ich meine ich hätte alles richtig gemacht, weil ich gemerkt habe, dass es keinen Sinn macht, nur einen Effekt hochzuleveln, denn dann hat man zu häufig gar nichts davonZum Vergrößern anklicken....Du sprichst mir aus der Seele.[BR][BR]Ich hab auch immer das Gefühl, dass es trotz irgendwelcher 30 % auf irgendwas kaum spürbar ist, was dieser Effekt dann auch erwirtschaftet.[BR][BR]Auch mir sind die Brauzeiten derart gegen meine Spielweise, dass ich meist einfach etwas einwerfe und dann halt damit zufrieden bin, was dabei rauskommt. Aber glücklich bin ich damit einfach nicht. [BR][BR]Und es gibt mir keinen Grund, mich mehr für den Kessel zu interessieren.[BR][BR]Dias sind mir viel zu kostbar, um sie sinnlos im Kessel zu verschleudern. Fragmente hätte ich persönlich zwar ausreichend, da ich aber Innos Politik nicht kenne, habe ich keine Ahnung, ob ich auch morgen noch Fragmente in ausreichender Zahl haben werde."}, {"119": "Ich bin mit dem derzeitigen Ablauf des Kessels hocheinverstanden, da er mir die Möglichkeit bietet, ihn vollständig zu ignorieren,                    ohne was zu verlieren.[BR][BR]Mit schwant allerdings Böses, wenn er, wie andere Sachen(Turm und Turnier),  in Events und Saisons integriert wird.[BR][BR]Das wird bestimmt ne spannende Quest \"Braue 15 Rezepte im Kessel\"    [smilie--sprite9]"}, {"155": "Primus71 schrieb:\t\t\tIch bin mit dem derzeitigen Ablauf des Kessels hocheinverstanden, da er mir die Möglichkeit bietet, ihn vollständig zu ignorieren, ohne was zu verlieren.\t\tZum Vergrößern anklicken....Quasi wie GA. [smilie--sprite7]"}]