[{"113": "Ich nutze den Kessel gerne, beschäftige mich mal mehr mal weniger mit ihm, und stelle immer klarer fest, dass mir da zu viele Wahrscheinlichkeiten rumtanzen.[BR]Ich finde Zufall, Glück und Lotterie völlig okay, doch hätte ich gerne zumindest eine feste, zuverlässige Größe.[BR]Die Konstante [alles ist möglich, auf nichts ist Verlass] ist mir zu wenig."}, {"240": "Hallo zusammen[BR][BR]Nee - ich mag das Ding immer noch nicht... [smilie--sprite2],[BR][BR]aber ich mache jede Woche meine 2 Klicks, bestätige alles, gebe ihm brav die Hexenpunkte und \"dit wars\" - [BR]wenn wat kommt, freue ich mich - wenn nicht, dann \"is es och jut\"....[BR][BR]Alles andere ist zu teuer, wenn ich ihm noch mehr von meinen Münzen oder Gütern usw geben soll...."}, {"35": "Der Produktionsbonus wirkt anscheinend auch auf Set-Gebaude. Siehe meine Screenshots.[BR]Das würde ihn für mich etwas interessanter machen.[BR][BR][IMG]https://i.ibb.co/VVB3tPg/https-de-forum-elvenar-com-index-php-attachments-1684337836213-png-36287.png[/IMG][BR][BR][IMG]https://i.ibb.co/c3p3zNx/https-de-forum-elvenar-com-index-php-attachments-1684337644689-png-36286.png[/IMG]"}, {"2": "Romilly schrieb:\t\t\t...danke - aber daraus lässt sich leider noch nicht erkennen, wie es wirkt - bitte nochmal einen Shot, wenn der Trank vorbei ist - der Kulturbonus sollte dann natürlich noch gleich hoch sein - dann sieht man schnell und einfach, ob der Verzauberungsbonus gleich bleibt oder eben nicht (oder du rechnest nach - ich kenn deine relevanten Zahlen nicht)[BR][BR]...hab mal Sinya geopfert, aber leider keinen Werkzeugeffekt aktiviert...[BR][BR]Anhang 33286 ansehen[BR]Anhang 33287 ansehen[BR]Anhang 33285 ansehenAnhang 33289 ansehen[BR][BR]...hier sieht man, daß der Verzauberungsbonus links ohne Trank niedriger, als der rechts mit Trank ist - demnach wirkt die Verzauberung auch auf den Trank - sind aber halt nur 1391-1334=57 Marmor extra + die 113 vom Trank selbst)...mit Handelszentrum und Sturmphönix sollte man da aber noch was draus machen können, wenn der Trankeffekt mal wesentlich höher ist)....[BR][BR]...der Manueffekt wirkt übrigens nicht auf Setgebäude...[BR]Anhang 33303 ansehen...\t\tZum Vergrößern anklicken....[BR]...das war im Januar noch nicht so...[BR][BR]...darf ich fragen, auf welcher Stufe der Effekt war? Gelten die 78 % (ist das Level 20?) in der Manu auf die Grundproduktion oder auf die gesamte (mit Reliktbonus)?...[BR][BR]EDIT: Hab's selbst getestet und einen Effekt auf Stufe 40 ausgelöst...[IMG]https://i.ibb.co/bLTR7dg/https-de-forum-elvenar-com-index-php-attachments-marmor5-png-36293.png[/IMG][BR][BR][IMG]https://i.ibb.co/d05WPBb/https-de-forum-elvenar-com-index-php-attachments-marmor4-png-36292.png[/IMG]...in der Marmor-Manufaktur wirkt der Effekt nur auf die Grundproduktion...[BR][IMG]https://i.ibb.co/tzdJtKD/https-de-forum-elvenar-com-index-php-attachments-marmor2-png-36290.png[/IMG][IMG]https://i.ibb.co/BLKc9ZN/https-de-forum-elvenar-com-index-php-attachments-marmor3-png-36291.png[/IMG]...im Pilgerset auf die 1. Produktion (nicht auf die Boni)[BR][BR][IMG]https://i.ibb.co/VwBmKnm/https-de-forum-elvenar-com-index-php-attachments-marmor-png-36289.png[/IMG]...leider hält mein Effekt nicht lange genug an - aber für meine Hauptwelt ist das sehr interessant...[BR][BR]...in einer Stunde kann ich meinen Schlitten abernten - hier wird der Trank aber vermutlich nicht wirken, da Marmor nicht die 1. Produktion ist...[BR][BR][IMG]https://i.ibb.co/K21VJqL/https-de-forum-elvenar-com-index-php-attachments-marmor6-png-36294.png[/IMG]...ok - es wirkt nicht.. [IMG]https://i.ibb.co/j3Wjg4Y/https-de-forum-elvenar-com-index-php-attachments-marmor7-png-36298.png[/IMG]..."}, {"35": "@Romilly Der Effekt müßte auf 20 gewesen sein.[BR]Anscheinend wirkt es nur auf die Grundproduktion (Elixier), bei den Links (Magiestaub, Edelstein) wird keine Erhöhung angezeigt.[BR][BR]In den Manufakturen wirkt es leider nur auf die Grundproduktion, ist also nicht so beeindruckend wie bei der Narrentaverne."}, {"2": "hobbitrose schrieb:@Romilly Der Effekt müßte auf 20 gewesen sein.[BR]Anscheinend wirkt es nur auf die Grundproduktion (Elixier), bei den Links (Magiestaub, Edelstein) wird keine Erhöhung angezeigt.[BR][BR]In den Manufakturen wirkt es leider nur auf die Grundproduktion, ist also nicht so beeindruckend wie bei der Narrentaverne.\t\tZum Vergrößern anklicken.......ja - so hab ich das auch beobachtet..."}, {"61": "Ich kann mich nicht entscheiden: [BR][BR][IMG]https://i.ibb.co/0Gpt8tD/https-de-forum-elvenar-com-index-php-attachments-1685898446377-png-36727.png[/IMG][BR][BR][smilie--sprite1]"}, {"1": "Da wurde auch gar nichts geändert. Links stand schon immer das alte Angebot und rechts das neue Angebot."}, {"35": "@ZeNSiErT mir würde da die Wahl auch schwer fallen [smilie--sprite2][BR]Zwei gleiche Angebote, na so was aber auch [smilie--sprite8]"}, {"190": "Habe mir den am ersten Tag angeschaut und hier kurz rumgemeckert und Zeit dem Latte. Ich klicke da irgendwas, die restlichen Punkte verballer ich und wieder eine Woche rum. Für mich nicht die Zeit wert sich mitzubeschäftigen Müll halt ne."}, {"118": "Ich kann mit dem Kessel ebenfalls nichts anfangen. Hab direkt zu Beginn euphorisch losgelegt und das Item, das mir am meisten fehlt auf Stufe 42 gelevelt. [BR]Aber egal wie ich Rezepte zusammen stelle, 70% Wahrscheinlichkeit auf mein am meisten fehlendes und geleveltes Item= es kommt immer[BR]Müll raus. [BR]Selbst bei 4 Schlucken und bei mehr als 70% Wahrscheinlichkeit kommt totaler Schrott, nichtmal Gelistetes vom Brau Prozess und 1-2x „kein Effekt“.[BR]Ja danke für nix. Seither klicke ich nur 1x irgendwas an und spende den Rest. Das ist genauso sinnbefreit."}, {"279": "Ich habe den Hexenkessel am Anfang ein paar mal gemacht. Weil es bei mir nie etwas wirklich brauchbares gegeben hat mach ich ihn nicht mehr."}, {"28": "Den Kessel muss man lange anfüttern pflegen und die Effekte aufleveln, eines Tages macht er sich dann hin und wieder in Kombination mit etwas Glück durchaus positiv bemerkbar! [BR]Die Beta-Gefährtinnen die sich ab Sekunde 1 aufs neue Feature gestürzt hatten haben mittlerweile geschrieben dass sich dieses Langzeitinvestment inzwischen immer wieder mal ganz nett auszahlt. [smilie--sprite2]"}, {"4": "Mein Problem ist eher, dass ich mit den ERgebnissen wenig anfangen kann. Anfangs hatte ich mich darauf gefreut, dass ich eine Verbesserung der Armee erfahre. Aber ich spiele Turnier/Turm abends, die ertragreichen Manus hole ich morgens ab, vor allem dann das Gold, Orks und Mana.[BR][BR]Da ich nicht selbst bestimmen kann, wann ich trinke, ist mir derzeit die Hexe recht schnuppe. Ich fülle auf und hoffe, irgendwann dann mal wirklich eine fühlbare Verbesserung zu erhalten. So lange mach ich einfach was."}, {"28": "salandrine schrieb:\t\t\tMein Problem ist eher, dass ich mit den ERgebnissen wenig anfangen kann. Anfangs hatte ich mich darauf gefreut, dass ich eine Verbesserung der Armee erfahre.\t\tZum Vergrößern anklicken....Je höher ein Effekt aufgelevelt wird desto geringer wird die Wahrscheinlichkeit dass der betreffende Trank auch gebraut wird. [smilie--sprite2][BR][BR]Um die Wahrscheinlichkeit eines bereits hoch aufgelevelten Effektes zu erhöhen, kann man eigentlich nur bei allen anderen Effekten die Stufen nach und nach möglichst gleichmäßig auf das gleiche Niveau bringen."}, {"2": "Aleanca schrieb:\t\t\tAber egal wie ich Rezepte zusammen stelle, 70% Wahrscheinlichkeit auf mein am meisten fehlendes und geleveltes Item= es kommt immer[BR]Müll raus\t\tZum Vergrößern anklicken....???? Wie bekommst du 70 % Wahrscheinlichkeit auf einen einzelnen Effekt hin? Bitte die Erfolgsrate nicht mit der Wahrscheinlichkeit für bestimmte Effekte verwechseln...(du bist in Kapitel 17 - dir dürften die Hexenpunkte fehlen, um einzelne Effekte derart hoch zu bekommen oder setzt du Diamanten ein?)"}, {"8": "Nee sie meint die Wahrscheinlichkeit, dass überhaupt ein Effekt kommt...[BR]welcher, das hat sie nicht näher spezifiziert.[BR][BR]Später...mit vielen Diplomen...hat man soviele mögliche Effekte, dass es sowieso unmöglich ist, immer genau den zu aktivieren, den man will.[BR][BR]Bisher hatte ich Glück:[BR]Erst bei 2 Kesseln kam wirklich nur Murks raus und überhaupt nicht was ich wollte... Meist aber hat der beabsichtigte Effekt gestimmt nur die Stärke war bissl schwach... aber gut, ich kann nicht wirklich mit Dias und Fraggies um mich werfen... ich nehm halt das Normale.[BR]Dennoch sind die möglichen Effekte beachtlich![BR][BR]Wer den Kessel clever nutzt, kann schon mal ordentlich absahnen... Garantie garantiert ausgeschlossen! [smilie--sprite8]"}, {"118": "gergerw schrieb:\t\t\tNee sie meint die Wahrscheinlichkeit, dass überhaupt ein Effekt kommt...[BR]welcher, das hat sie nicht näher spezifiziert.[BR][BR]Später...mit vielen Diplomen...hat man soviele mögliche Effekte, dass es sowieso unmöglich ist, immer genau den zu aktivieren, den man will.[BR][BR]Bisher hatte ich Glück:[BR]Erst bei 2 Kesseln kam wirklich nur Murks raus und überhaupt nicht was ich wollte... Meist aber hat der beabsichtigte Effekt gestimmt nur die Stärke war bissl schwach... aber gut, ich kann nicht wirklich mit Dias und Fraggies um mich werfen... ich nehm halt das Normale.[BR]Dennoch sind die möglichen Effekte beachtlich![BR][BR]Wer den Kessel clever nutzt, kann schon mal ordentlich absahnen... Garantie garantiert ausgeschlossen! [smilie--sprite8]Zum Vergrößern anklicken....Genau so.[BR]70% Wahrscheinlich dass ein Effekt ausgelöst wird, natürlich das gewünschte am höchsten %,  auf 42 gelevelt, 4 Schluck, Ergebnis: 2 Nieten, Gold und Vorräte (nichtmal in der %Auflistung dabei).[BR]Passiert: dauernd so[BR]Fazit: abgenervt"}, {"14": "je höher der Level der Stadt umso eher kommt dann doch etwas, was einem unwichtig ist:[BR]bei niedrigen Leveln ist es einfacher gezielt etwas zu bekommen[BR][BR]ich habe jetzt in meiner höchsten Stadt quasi alles, was ich überhaupt habe, gelevelt, damit ich mich nicht ärgere, wenn etwas anderes kommt[BR][BR]großteils kommt der Effekt, den ich will, aber manchmal eben auch nicht..aber egal...[BR]Hauptsache, der bringt zumindest etwas und ist nicht völlig nutzlos, weil er nur ein Stern hätte[BR][BR]edit:[BR]echt?[BR]70% auf Effekt A..sowas hatte ich noch nie[BR]ich bekomme nur 70% auf die Wahrscheinlichkeit, dass überhaupt was rauskommt, bei den einzelnen Effekten ist es dann aber deutlich niedriger (was auch angezeigt wird mit der %-Zahl vor den speziellen Effekten)[BR][BR]Gold und Vorräte MUSS in der Auflistung dabei sein, sonst hättest du es gar nicht bekommen, hast du mal vor dem Trinken runtergescrollt?[BR]aber ich bekomme auch manchmal was, was niedrige %-Wahrscheinlichkeit hat..."}, {"118": "Neris schrieb:\t\t\tje höher der Level der Stadt umso eher kommt dann doch etwas, was einem unwichtig ist:[BR]bei niedrigen Leveln ist es einfacher gezielt etwas zu bekommen[BR][BR]ich habe jetzt in meiner höchsten Stadt quasi alles, was ich überhaupt habe, gelevelt, damit ich mich nicht ärgere, wenn etwas anderes kommt[BR][BR]großteils kommt der Effekt, den ich will, aber manchmal eben auch nicht..aber egal...[BR]Hauptsache, der bringt zumindest etwas und ist nicht völlig nutzlos, weil er nur ein Stern hätte[BR][BR]edit:[BR]echt?[BR]70% auf Effekt A..sowas hatte ich noch nie[BR]ich bekomme nur 70% auf die Wahrscheinlichkeit, dass überhaupt was rauskommt, bei den einzelnen Effekten ist es dann aber deutlich niedriger (was auch angezeigt wird mit der %-Zahl vor den speziellen Effekten)[BR][BR]Gold und Vorräte MUSS in der Auflistung dabei sein, sonst hättest du es gar nicht bekommen, hast du mal vor dem Trinken runtergescrollt?[BR]aber ich bekomme auch manchmal was, was niedrige %-Wahrscheinlichkeit hat...\t\tZum Vergrößern anklicken....Habs korrigiert…"}]