[{"206": "BoeseTante schrieb:\t\t\tWenn man ein Studium machen muss, oder eine monströse Tabelle nutzen müsste, ist das Event für das gro der Spielerschaft sinnfrei.[BR]INNO suchte eine neue Geldquelle, mehr ist es nicht. Spaß null.\t\tZum Vergrößern anklicken....Aleanca schrieb:\t\t\tJa danke für nix. Seither klicke ich nur 1x irgendwas an und spende den Rest. Das ist genauso sinnbefreit.\t\tZum Vergrößern anklicken....salandrine schrieb:\t\t\tUnd es gibt mir keinen Grund, mich mehr für den Kessel zu interessieren.[BR][BR]Dias sind mir viel zu kostbar, um sie sinnlos im Kessel zu verschleudern. Fragmente hätte ich persönlich zwar ausreichend, da ich aber Innos Politik nicht kenne, habe ich keine Ahnung, ob ich auch morgen noch Fragmente in ausreichender Zahl haben werde.\t\tZum Vergrößern anklicken....Summerchind schrieb:\t\t\tIch habe den Hexenkessel am Anfang ein paar mal gemacht. Weil es bei mir nie etwas wirklich brauchbares gegeben hat mach ich ihn nicht mehr.\t\tZum Vergrößern anklicken....Dito !!! Weg mit diesem Schwachsinn und zurück zu den Wurzeln ... SO macht Elvenar keinen Spaß. [smilie--sprite4][BR][BR][BR]littleFlex schrieb:\t\t\tManche Sachen kann man auch einfach totreden oder man nutzt sie so, wie sie angeboten werden.\t\tZum Vergrößern anklicken....Nö ... Besser: Ganz sein lassen! ... man muß (zum Glück) ja nicht jeden Quatsch mitmachen. Doch jetzt tauchen Kessel-Aufgaben (wie bereits befürchtet wurde) auch in Event-Quests auf ... das wird deswegen von mir auch komplett ignoriert. Nicht mehr lange und ich ignoriere das Spiel ganz ... [smilie--sprite10]"}, {"181": "Mein Wunsch für den Hexenkessel: Dass auch Gastrassengüter gepimpt werden können. Ab irgendwann produziert man sich einen Wolf und kommt kaum noch von der Stelle. Alles Mögliche kann gefördert werden, aber das, was sowieso nicht ertauscht werden kann, bleibt auf der Strecke. Das gleiche wünsche ich mir auch für den Hobbyraum oder Werbung per se: Gastrassengüter. [smilie--sprite1]"}, {"150": "@Alidona: Gastrassengüter können vom Kessel gepimpt werden (ist die 8. Stelle die Freigeschalten wird)[BR]Hab dies mit Freude im Kapitel 17 genutzt[BR][BR]Für mich ist der Kessel immer wieder mal nützlich, denn auch Kleinvieh macht Mist und wenn man lange genug sammelt kann man damit Tonnen füllen.[smilie--sprite2]"}, {"14": "ich bin in Kapitel 15 und bei mir ist das schon lange freigeschaltet:[BR]ist die 8. Stelle, wie Collektor auch schreibt:[BR][BR][IMG]https://i.ibb.co/L5x5gjK/https-de-forum-elvenar-com-index-php-attachments-screenshot-922-png-37781.png[/IMG]"}, {"2": "Collektor87 schrieb:\t\t\tHab dies mit Freude im Kapitel 17 genutzt\t\tZum Vergrößern anklicken.......ich freu mich auch schon auf den Einsatz im nächsten Kapitel - mein Portaleffekt ist nun fast auf 75 und derzeit würde es mir bei einem mit Fragmenten/Dias gepimpten kritischen Treffer schon [IMG]https://i.ibb.co/tQphTGX/https-de-forum-elvenar-com-index-php-attachments-portaleffekt-png-37782.png[/IMG] für 63 Stunden auf die Grundproduktion geben (bei der Zeit erhält man bei einem kritischen Treffer die 1,5fache Dauer)..."}, {"181": "Collektor87 schrieb:\t\t\t@Alidona: Gastrassengüter können vom Kessel gepimpt werden (ist die 8. Stelle die Freigeschalten wird)[BR]Hab dies mit Freude im Kapitel 17 genutzt[BR][BR]Für mich ist der Kessel immer wieder mal nützlich, denn auch Kleinvieh macht Mist und wenn man lange genug sammelt kann man damit Tonnen füllen.[smilie--sprite2]Zum Vergrößern anklicken....[BR]Dann muss ich mir das mal genauer angucken. Habe ich glatt übersehen. [smilie--sprite2][BR]Danke für die Info."}, {"28": "Freude in der magischen Akademie - Es ist mir gelungen meinen favorisierten Trank zu brauen! Auf geht's in den Turm. [smilie--sprite2][BR][BR][IMG]https://i.ibb.co/sbS5SLB/https-de-forum-elvenar-com-index-php-attachments-1690735476814-png-37890.png[/IMG]"}, {"118": "Mittlerweile muss man ja schon froh sein überhaupt irgendwas zu brauen.[BR]~5000 Zutaten[BR]74,1% Wahrscheinlichkeit auf einen Effekt[BR]2 Schluck[BR]Ergebis:  nix[BR][BR]Super danke "}, {"104": "Thebigunknown schrieb:\t\t\tDen Kessel muss man lange anfüttern pflegen und die Effekte aufleveln, eines Tages macht er sich dann hin und wieder in Kombination mit etwas Glück durchaus positiv bemerkbar![BR]Die Beta-Gefährtinnen die sich ab Sekunde 1 aufs neue Feature gestürzt hatten haben mittlerweile geschrieben dass sich dieses Langzeitinvestment inzwischen immer wieder mal ganz nett auszahlt. [smilie--sprite2]Zum Vergrößern anklicken....Welche Langzeit, gibt es doch noch gar nicht so lange? [smilie--sprite2][BR]Für Spieler in hohen Kapiteln geht durchaus was sofort. Wenn auch ewig Geklicke + Zufall + überschaubare Effekte für kurze Zeit.[BR]Gegenüber einen Kampfbooster 50% Schaden in Akademie gekauft und simpel zielgenau für ganze 5 Tage aufgestellt ist Hexenkessel ziemlich schwach bei irren Aufwand.[BR][BR]Für kleine Spieler nochmal viel viel schlechter. Und die sollen da über Jahre Zeit und Ressourcen reinstecken, nur um am Ende ein kaum brauchbares Feature zu bekommen? Können hohe Spieler mit sofort Hexenkessel einigermaßen einsatzfähig gar nicht einschätzen, kann niemand einschätzen weil niemand das bisher über Jahre entwickelt gesehen hat, wieviel Mühe und Kosten dafür von klein an. Oder halt 2 Jahre ignorieren und dann erst beginnen..[BR][BR]Ignorieren leider wie Seasons schwer, weil einfach nicht auszuschalten, ständige unerwünschte Meldungen."}, {"160": "Einfacher zu ignorieren als die Meldungen mit den Filmrollen oder der Typ, der einen in den Hobbyraum locken will. Ich mag Kessel, aber nicht den hier. Da lobe ich mir doch die \"Atelier-Reihe\""}, {"178": "Ellert III schrieb:\t\t\tEinfacher zu ignorieren als die Meldungen mit den Filmrollen oder der Typ, der einen in den Hobbyraum locken will. Ich mag Kessel, aber nicht den hier. Da lobe ich mir doch die \"Atelier-Reihe\"\t\tZum Vergrößern anklicken....Bitte beschwer dich nicht das etwas einfach ist.... man beschwerte sich auch das alte Relikte und inzwischen zuviele Kombieauslöser einen Nutzen bräuchten.... jetzt haben wir neue Rezepte in der mag AKA auf Beta.... ich meinerseits hätte das Zeug dann lieber weiter gesammelt!"}, {"178": "hab heut mal nen unkonventionellen Test durchgeführt.... ist echt interessant was man dennoch bekommt wenn man einfach nur eine einzige Zutat reinlegt... sonst kommt alles nur nicht das was man möchte oder trotz angeblichen 70% bleiben 2 von 5 dennoch ohne Wirkung. [BR][BR]jetzt mit nur einer Zutat ... eigentliche Wirkung hab ich 0 erwartet. gab dennoch 2 Wirkungen(also 2 von 5)... eigentlich unmöglich... lustigerweise aber diesmal auch genau diese welche eigentlich angstrebt waren.[BR][BR]Hab nun glaub ich ein neues Hobby ..."}, {"14": "hm, dann hast du dich bisher aber noch gar nicht mit dem Kessel beschäftigt?[BR]jede Zutat hat mannigfaltig Effekte:[BR]nämlich auf jede mögliche Wirkung -2 bis +3[BR][BR]ich weiß jetzt nicht, wo genau Romilly ihre Tabelle im Thread verlinkt hat[BR][BR]aber so sieht das aus:[BR][BR][IMG]https://i.ibb.co/0cCCDGz/https-de-forum-elvenar-com-index-php-attachments-zutaten6-png-33670.png[/IMG][BR]@Romilly[BR][BR]da sieht man z.B., dass jede Zutat oftmals 2 3er Wirkungen hat (nicht alle)[BR][BR]also z.B. die Feuerspore wirkt mit +3 auf Münzen und  +3 auf das reguläre Händlergebet (hieß das nicht mal Händler-Apell?)[BR]demnach ist die Wahrscheinlichkeit groß, dass 1 Feuerspore genau diese beiden bewirken kann[BR]nächst wahrscheinlich ist Saat und Unurium (? falls das Bildchen das bedeuten soll, ich bin noch nicht so weit um nachsehen zu können), falls man schon in XX ist[BR][BR]die mit der Minuswirkung werden in ihrer Wahrscheinlichkeit reduziert, wenn die aber schon 0 ist, dann geht es nicht niedriger"}, {"2": "Neris schrieb:\t\t\tnächst wahrscheinlich ist Saat und Unurium\t\tZum Vergrößern anklicken.......das bei Unurium ist die Potenz - also x1,1 hoch 2 - dazu braucht man erst einmal einen normalen +Wert bei Unurium (Käfer, Iris, Limette, Zungen) und kann den Wert dann aufpimpen...die \"normale 2\" ist bei Gut8...[BR][BR]...man nimmt also die Summe aus den normalen Werten und multipliziert die dann mit 1,1 hoch ??? (die Summe aus den anderen Werten)...[BR][BR]...damit erhält man den Anteil, den dieser Effekt am Rezept hat (die angegebene Wahrscheinlichkeit hängt dann noch von der Erfolgsrate ab)...[BR][BR]Romilly schrieb:\t\t\t...für eine möglichst hohe Wahrscheinlichkeit muss man sowohl die \"value\" als auch die \"factor\"-Werte möglichst hoch schrauben...[BR][BR]...bei \"factor\" wird mit einer Hochzahl gerechnet - bei einer negativen Hochzahl - also hoch -4 z.B. - wird der Kehrbruch verwendet - man rechnet also nicht mehr 1,1 x 1,1 x 1,1 usw, sondern den Kehrbruch davon (1:1,1) - also 0,0909... x 0,0909.... x 0.0909... usw.[BR][BR]...was zur Folge hat, daß sich die Anteile aus den value-Werten bei +7 \"factor\" in etwa verdoppeln und bei +12 verdreifachen, bei -7 \"factor\" dann allerdings halbieren und bei -12 dritteln - womit man dann eben die \"value\"-Werte noch einmal stark beeinflussen kann (geht aber nur, wenn \"value\" auf mindestens +1 ist und natürlich auch nur bei Verwendung von entsprechend vielen Zutaten mit \"factor\"...)\t\tZum Vergrößern anklicken....[IMG]https://i.ibb.co/6ZhxDW0/https-de-forum-elvenar-com-index-php-attachments-effekte3-png-34127.png[/IMG]...das ist die \"bessere\" Tabelle mit den beiden fehlerhaften Werten (die vermutlich noch immer nicht korrigiert wurden)..."}, {"14": "ach, das ist Gut 8, stimmt, die golddurchbrochene Münze für Unurium ist 2 höher[BR]normal muss ich in meinem Kessel nachgucken, was das genau ist, aber so weit war ich noch nicht, aber die Kiste für ein Gut x hätte man schon erkennen sollen [smilie--sprite2]"}, {"178": "Naja... bekommt man aber alles andere als das was man eigentlich anstrebt... was will ich mit dieser tabelle... bei ca 10 möglichen Komponenten bekomm ich gern auch bis zu drei mal eher das was in Warscheinlichkeit eher auf Rang 7-10 liegt.... in dem Sinne lässt gern weiter Kesseln... muss ne ernste Änderung her. sonst wirds definitiv nicht meins.... und kleiner Hinweis... mehr Zwang des Ganzen lößt bei mir eher ne Allergie aus!!!"}, {"178": "Top gerade wieder auf Beta... Option 3 mit nur etwas über 5% kommt 2x. ein 3. nur von Seite 2 der Optioenen mit vermutlich kaum 1-2%... die ersten Beiden mit 10 und 15% eben garnicht.... solchen Murks kann man behalten... mit was für Hieroglyphen man da auch immer versucht noch Spielspaß dahinter schreiben zu wollen... das wird nix! übrigens... auf Beta gab es am Anfang ne Option die es jetzt nicht mehr gibt im Couldron... Betreffender hat Werte ......... auch das eigentlich ungewollte hatte seinen Nutzen dort.... hätte gern etwas Unterstützung für den Turm und das turnier gewollt... aber die Kampfbonies aus dem Hexenkessel scheinen eher nur Blendwerk zu sein.[BR][BR]Interessant wär es eigentlich ob diese wenn man doch mal in den Genuss käme, dann überhaupt auch wirken?"}, {"4": "Hanlar schrieb:\t\t\t...[BR][BR]Interessant wär es eigentlich ob diese wenn man doch mal in den Genuss käme, dann überhaupt auch wirken?\t\tZum Vergrößern anklicken....Die Frage ist doch, wie du die Wirkung einschätzen kannst, Wie willst du erfahren, dass bestimmte Soldatengruppen plötzlich 8 % mehr an Wirkung haben oder so?"}, {"2": "...bei 10 % kommt zu 90 % was anderes [smilie--sprite2]..."}, {"178": "salandrine schrieb:\t\t\tDie Frage ist doch, wie du die Wirkung einschätzen kannst, Wie willst du erfahren, dass bestimmte Soldatengruppen plötzlich 8 % mehr an Wirkung haben oder so?\t\tZum Vergrößern anklicken....was auch immer... den Versuch wegen 8% hät ich mir gesparrt. es wär sehr viel mehr... das würde man dann auch bemerken."}]