[{"103": "Grundsätzlich wird erst mal nichts verlangt,[BR]auch wenn die Möglichkeiten bestehen, Ressourcen, Fragmente oder Dias einzusetzen[BR][BR]Der Kessel kann mit den wöchentlich geschenkten Hexenpunkten bespielt werden und den einen notwendigen Kelch gibts auch gratis.[BR][BR]Es kann passieren, dass der Brauvorgang erfolglos ist, dann hat man nichts verloren.[BR]Braut man aber einen Effekt, erhält man etwas für umsonst.[BR][BR]Jeder weitere persönliche Einsatz zur Steigerung, Verbesserung oder zur Beschleunigung ist optional !"}, {"28": "BoeseTante schrieb:\t\t\tGemäß Bild werden für das Brauen ja wohl Schnipsel verbrannt, auch eine rares Gut, nix umsonst\t\tZum Vergrößern anklicken....Man kann sie verbrennen wenn man möchte aber es ist nicht notwendig sie einzusetzen um einen Trank zu erhalten."}, {"3": "Na, dann bin ich mal gespannt. Klingt alles reichlich kompliziert und die Kommentare sind ja recht widersprüchlich.[BR]Aber ich freue mich trotzdem drauf. Allein aus Neugierde werde ich den Kessel ausprobieren und mir ein Bild davon machen. Ob ich ihn effizient nutzen kann oder nicht, ist mir erstmal egal.[BR]Mit dem Turm konnte ich anfangs auch nichts anfangen und mochte ihn nicht, aber inzwischen macht er mir Spaß und ich schaffe ihn locker bis oben.[BR]Vielleicht ist es beim Kessel ja ähnlich.... erstmal kennenlernen."}, {"128": "Da wir nun schon weit über 2 Stunden den 9. Januar haben, [BR]hier definitiv das erste wirkliche Feedback zum neuen Live-Feature:[BR][BR]Es gibt keins. [smilie--sprite6]"}, {"262": "Falls das neue Feature dann doch noch kommt ? Finde ich dann in Kapitel V ein neues Forschungsdingsbums, was erst noch freigeschaltet werden muss oder ist das bei Spielenden, die schon weit über Kapitel V hinaus sind, von Haus aus freigeschaltet ? Fragen über Fragen. [smilie--sprite12]"}, {"263": "es muss bei allen erst freigeschaltet werden [smilie--sprite2] und ja, es wird heute im Laufe des Tages noch kommen [smilie--sprite1]"}, {"14": "du musst es in Kapitel V dann noch freischalten, es ist dann dort ganz neu als Forschung"}, {"50": "Um den Kessel im Kapitel V freizuschalten, benötigt man 30 WP ->[BR][IMG]https://i.ibb.co/N2tPTgQ/https-de-forum-elvenar-com-index-php-attachments-1673256978095-png-33229.png[/IMG][BR][BR]Man sollte sich auch nicht wegen dem Kessel verrückt machen, auch wenn er anfänglich kompliziert wirken sollte.[BR]Am Anfang sind die Boni, die man durch den Kessel erhält noch relativ gering.[BR]Es ist wie bei AWs, erst mit der Zeit offenbaren sich die wirklichen Vorteile für die Kessel-Attribute, so dass es sich immer lohnt wöchentlich den Kessel zu bedienen."}, {"34": "Hat jedes der Ingredients einen festen Wert an Bonuseffekten oder hat auch die Mischung der Ingredients im Kessel eine Wirkung?[BR]Also Ingredients 1 bringt als Beispiel immer +10% Leben, +10% Vorräte und -10% Münzen oder kann Ingredients 1 eine ganz andere Wirkung haben wenn bereits Ingredients 2 im Kessel ist?"}, {"103": "bitte versucht, für Fragen zum Event den Fragen-Thread zu nutzen, [BR]damit hier das Feedback zu erfassen ist...[BR][BR]-> wir gehen davon aus, dass die Zutaten immer gleiche Wirkungen haben werden"}, {"264": "Wäre schön gewesen, wenn man die Beschreibung der Zauber auch übersetzt hätte.[BR][BR][BR][IMG]https://i.ibb.co/F3B4D3x/https-de-forum-elvenar-com-index-php-attachments-1673261612319-png-33233.png[/IMG]"}, {"103": "haben wir bereits erfasst, Danke (auch für die App-Version, wo bisher alles noch Englisch erscheint)"}, {"74": "Finde es sehr schlecht das man gezwungen ist alle 5 Kelche direkt nach dem brauen zu nutzen.[BR]Wäre doch viel besser ich könnte die nutzen wann ich will bis Samstag 0 Uhr. Also zb. Heute einen für 1h kampfboost, morgen vieleicht 2 für 1h kampfboost+leben (natürlich mit Glück das man das bekommt).[BR]So hat man alle 5 Kelche weg, 2h irgendwelche Buffs und den Rest der Woche nix mehr.[BR]Da wäre es doch wesentlich besser die Kelche strategisch über die Woche nutzen zu können wenn ich gerade nen Buff brauche"}, {"240": "\t\t\tDer Kessel kann mit den wöchentlich geschenkten Hexenpunkten bespielt werden und den einen notwendigen Kelch gibts auch gratis.\t\tZum Vergrößern anklicken....Das habe ich nie geschafft...."}, {"135": "Klasse E-Mail Ankündigung für das Feature... wäre sinnvoll, dort reinzuschreiben, dass man es erst in einer längst vergangenen Forschung freischalten muss.[BR]Wer das nicht im Forum gelesen hat, fühlt sich etwas veräppelt, denn in der MA ist beim Eintritt kein \" Brodeln und Zischen\" zu vernehmen. (Keine neue Funktion zu finden)"}, {"113": "Hach, ich bin richtig ein bisschen aufgeregt[smilie--sprite10][BR][BR]Aber jetzt muss ich erst mal lesen[BR][BR][BR][BR][BR]Nachtrag[BR]Schade, schon wieder alles vorbei. Ich hab nur in einer Stadt die nötigen Rohstoffe gehabt, hab gebraut, getrunken, gespendet, verbessert und Quests gelöst und nun muss ich warten. Aber ging gut, ich hab alles verstanden, war nur zu ungeduldig und hab zu schnell geklickt. Aber ich hab ja noch zwei weitere Städte, an denen ich üben kann. Macht Spaß. [smilie--sprite1]"}, {"103": "Xebifed schrieb:\t\t\tKlasse E-Mail Ankündigung für das Feature... wäre sinnvoll, dort reinzuschreiben, dass man es erst in einer längst vergangenen Forschung freischalten muss.[BR]Wer das nicht im Forum gelesen hat, fühlt sich etwas veräppelt, denn in der MA ist beim Eintritt kein \" Brodeln und Zischen\" zu vernehmen. (Keine neue Funktion zu finden)\t\tZum Vergrößern anklicken....haben wir erfasst"}, {"94": "Huhu zusammen, wenn Ihr eine Schleifenquest ablehnt oder erledigt, sollten paar Aufgaben auftauchen die mit dem Kessel zutun haben.[BR]Da kann man auch 80 Dias abstauben wenn dann das Turnier losgeht."}, {"213": "Super Geschichte, man bekommt ne Email, klicke sie an Elvenar startet,  UND Du findest erstmal nichts. Super gelöst![BR]Danke , daß dieses nun im alten Forschungsbaum plaziert wurde und nicht direkt in der magischen Akademie. [BR]So bleibt man von diesem Elend wenigstens verschont [smilie--sprite1]"}, {"37": "also bei mir hat er sich irgendwie aufgehängt und mit meinen 4 Pokalen 4 Mal den selben Mist gebraut und ich konnte das Fenster weder mit einem relogg noch sonst wie entfernen oder stoppen. D.h. ich bin für diese Woche mit dem Hexenkessel fertig. Der Effekt wird sofort aktiv was auch doof ist, da ich ihn gerade nicht brauche. Gut gedacht ist halt nicht immer gut gemacht"}]