[{"103": "jup, man kann und soll auch nur ein mal wöchentlich brauen.[BR]es hat sich also nichts aufgehängt.[BR]hat man sich für das Brauen nach Zutatenwahl entschieden, muss auch ausgetrunken werden^^[BR][BR]den Zeitpunkt des Brauens muss man sich nach seiner Spielstrategie gut überlegen,[BR]weil eben alle Effekte sofort aktiv werden[BR][BR]auch das ist so korrekt"}, {"213": "Sind wir hier bei Elvenar forscht ? [BR]Mit ein bisschen Eigenleistung (Nachforschung im Forum),[BR][BR]Das bekommt man, wichtig für Alle die nicht im Forum unterwegs sind und nicht die Lust haben alles im Forum zu lesen !!![BR]Geschweige denn englische Videos an zu schauen [smilie--sprite3][BR]Heute möchten wir dir ein neues, aufregendes Feature vorstellen, das wir dem Spiel hinzugefügt haben: den Hexenkessel.[BR]Einmal pro Woche wird die Hexe in der Magischen Akademie einen Trank für dich brauen, der mächtige Boni verleiht. Durch die sorgfältige Auswahl der Zutaten kannst du den Effekt an deine Bedürfnisse anpassen."}, {"104": "littleFlex schrieb:\t\t\thaben wir erfasst\t\tZum Vergrößern anklicken....Braucht es das immer erst zu erfassen? Dinge wie 'Übersetzung auf deutsch nötig' oder 'Forschung Kapitel 5 nötig unklar' (Ich habe mich gerade auch erst gewundert, im (englischen..) Video kam es dann aber auch vor), das ist doch alles sonnenklar. Und was ist mit Beta? Ok, keine deutsche Beta, aber Übersetzung ist so grundlegend.[BR]Es müsste nur eine Person sich mal 5 Min. alles anschauen und Gedanken machen, die noch nötigen Dinge vorab durchführen, stattdessen wird es in dieser Form auf abertausende Spieler losgelassen mit allen Unklarheiten, Folgearbeit, die negativen Effekte vertausendfacht..[BR][BR]Was ist das für ein totales Fiasko? Tut mir leid dass wenn immer ich im Forum schreibe nur Kritik, aber das ist es eben immer, was mir auffällt. [smilie--sprite2] Wie kann man nur so an solche Sachen überhaupt rangehen? Wie kann man da freiwillig Mitarbeiter sein, welche höheren Ansprechpartner gibt es, was sagen die dazu? Einziges Feedback kann nur 'komplett in die Tonne' sein.[BR][BR]---[BR][BR]Davon noch abgesehen ist das Feature für sich sowieso Schrott, leider auch. So dermaßen kompliziert, wer ist dafür verantwortlich, wer kommt auf solche Ideen? Wenn man in Beta oder sonstwo fragt, hat irgendein Spieler je was in der Richtung vorab gewünscht oder gab es bisher grundpositives Feedback zurück?[BR]Wenn man nichts neues im Spiel macht, ok, das ist ja eine Sache, alles kostet Geld, nochmal 50x Turnier und Turm füllt auch ein Jahr.. Aber wenn man schon auf die Idee kommt was neues einzubauen, die ganze Mühe an Konzept, Implementierung, Aufwand korrekt einzuführen mit Spielerfragen, Balancing und und und, dann sowas? Wo nichmal die Moderatoren wissen was läuft bzw. der Grundfehler darin liegt, dass nichts zu verstehen ist? Immer wieder erstaunlich..[BR][BR]Wobei die neuen Kapitel jedes Jahr anscheinend ja ganz ordentlich, geht doch auch. [smilie--sprite2]"}, {"103": "ganz einfache Erklärung zu Deinem langen Text:[BR]auch alle Mitglieder des Elvenar-Teams haben erst Zugriff auf den Kessel und seine Elemente, nachdem er live gegangen ist.[BR]Wir haben keine Möglichkeit vorher irgendetwas zu prüfen, zu übersetzen oder zu berichtigen."}, {"104": "littleFlex schrieb:\t\t\tWir haben keine Möglichkeit vorher\t\tZum Vergrößern anklicken....Feedback: hier liegt das Problem.."}, {"155": "War echt spaßig mehrere tausend Klicks zu machen um Gold, Werkzeuge etc in mehreren Welten auszugeben. -.-"}, {"54": "nu isser also live ...[BR][BR]das was ich mir wirklich gemerkt hatte: Effekte treten sofort in Kraft...[BR]Also mal schaun, ob der zum GA etwas bewirken kann.[BR][BR]Hab dann mal ein paar Fragen:[BR][BR]Es sind ja reichlich Prozentangaben angeführt. Auf was genau beziehen die sich ?[BR]zB bei den Münzen.[BR]Kann man das irgendwie einfach nachprüfen ?[BR][BR]Es wird von Wirkungen geschrieben, die sich negativ auswirken, wie erkennt man die und kann man sich davor \"schützen\" ?[BR]Oder ist das der \"kritische Effekt\", was bedeutet das genau ?[BR][BR]Beim Drüberfahren mit der Maus über einzelne Symbole werden englische Texte benutzt, werden die noch durch deutsche ersetzt ?[BR][BR]Meinen Account auf dem beta-Server hab ich auch damals wegen der Fremdsprache aufgegeben.[BR]Übersetzungsprogramme nutzen ist nervig und dauert zu lange.[BR][BR]Die Anzeige hat hinten stehen 5 Stu ...[BR]Das heisst wohl 5 Stunden.[BR][BR]Ist das die Zeit, wie lange der Effekt wirkt ?[BR][BR]5 Stunden sind ja nicht sooo lange ...[BR][BR][BR]HdW"}, {"54": "Killy schrieb:\t\t\tWar echt spaßig mehrere tausend Klicks zu machen um Gold, Werkzeuge etc in mehreren Welten auszugeben. -.-\t\tZum Vergrößern anklicken....auszugeben ?"}, {"104": "Ist hier nur Feedback an Entwickler oder auch Unterhaltung untereinander? Passt im Frage-Thread ja auch nicht unbedingt, wobei Fragen dabei.[BR][BR]Studierenphase erst nach Trank etwas kompliziert zu erreichen, ob wohl auch nach erfolglosen Trank..[BR]Erst dort Hexenpunkte zu kaufen, aber die Preise so billig, mit 75 Münzen beginnend zumindest für hohe Kapitel ein Nichts, gleich mal Klicken für 30k Hexenpunkte, mehrere Effekte schon auf Level 20 zu steigern, bereits 10h stattt 5h Wirkungsdauer, das sieht dann ja langsam brauchbarer aus.[BR]Ob das so gedacht ist schon in erster Woche? Frage ob nächste Woche wieder bei 75 beginnend oder es nur noch teurer wird wie WP-Kauf für Münzen..[BR][BR]@HerrderWelten[BR]Das vielleicht das 'Ausgeben'."}, {"2": "...bin gerade am tüfteln und habe schon einige Daten erfasst - leider ist es noch unklar, wie sich die positiven und negativen Werte der einzelnen Zutaten auswirken - man kann die Werte zwar auslesen - aber erst, wenn man schon in der Studienphase ist und anscheinend werden in den Files zwar ganze positive und negative Zahlen von -2 bis 3 angezeigt - manche davon bedeuten dann aber wohl eher 1/2 oder so, denn wenn man da ein wenig mixt, kommt man beim Zurückrechnen mal auf einen vollen Anteilswert von z.B. 4 und dann bei einem anderen Effekt auf ca. 3,75 (?) - mal kucken, ob ich da noch mehr rausfinde... hab aber schon heraus gefunden, daß bei jedem Effekt jeweils 4 Zutaten einzeln verwendet einen positiven Wert auslösen - das sind bei den ersten 12 Diplomen/Effekten immer 4 hintereinander mit der Reihenfolge 3 2 1 1 und danach ist da immer ein anderer Wert dazwischen - ich teste jetzt noch weiter und versuche dann, die Tabelle ein wenig zu ergänzen - irgendwie werden wir der Sache schon auf den Grund kommen...[BR]...mir macht es jedenfalls Spaß bis jetzt - auch wenn ich außer nem Test in Arendyll noch nichts gebraut habe...[BR]...was ich schon rausgefunden hab, der Goldverbesserer wirkt sowohl auf die Häuser als auch auf Evos oder Set-Teile auf die auch der Kulturbonus wirkt - beim Abgrund weiß ich es noch nicht - dort wird nichts angezeigt - allerdings funktioniert hier ja seit kurzem auch der Kulturbonus und es wird nicht angezeigt (aber gezählt) - den kann ich aber erst wieder in 2 Stunden absammeln)...[BR][BR]EDIT: leider hab ich den Screenshot beim Abgrund verkackt  [smilie--sprite3]  - muss ich in ner anderen Welt testen, wenn ich nochmal den Goldbonus bekomm..[BR][BR][IMG]https://i.ibb.co/y6mYMHZ/https-de-forum-elvenar-com-index-php-attachments-a7-png-33247.png[/IMG][IMG]https://i.ibb.co/f06TW0s/https-de-forum-elvenar-com-index-php-attachments-a8-png-33248.png[/IMG][BR][BR]...leider gibt es bei einem aktivierten Effekt nicht das volle Ausmaß, sondern nur einen zufälligen Bruchteil...[BR][IMG]https://i.ibb.co/SryDqYG/https-de-forum-elvenar-com-index-php-attachments-a9-png-33249.png[/IMG][IMG]https://i.ibb.co/9cGWjhW/https-de-forum-elvenar-com-index-php-attachments-a10-png-33250.png[/IMG][BR][BR][BR]...den Höchstwert kann man aber durch Fragmente steigern (bzw. den Kritischen Effekt) - wie sich das genau auswirkt (wie hoch), weiß ich noch nicht...[BR][BR][IMG]https://i.ibb.co/JjVbtS2/https-de-forum-elvenar-com-index-php-attachments-f1-png-33252.png[/IMG][BR][BR]...hier wurden 2x 1000 Fragmente zugefügt und rechts in der Liste steigt der (Höchst)Wert beim Gut von 40 % auf 48,9 %..."}, {"50": "Da bei mir die Untertitel bei dem Youtube-Player auf deutsch eingestellt ist (hatte ich vor geraumer Zeit mal auf deutsch geändert), habe ich auch von Hause aus deutsche Untertitel und im Video wird der Kessel auch recht ordentlich erklärt, um das Prinzip und die ersten Schritte zu verstehen.[BR][BR][IMG]https://i.ibb.co/4VTFyzT/https-de-forum-elvenar-com-index-php-attachments-1673271219885-png-33251.png[/IMG][BR]Im Player unten rechts auf das Zahnrad (rot eingekreist) klicken und im Kontext-Menu \"Untertitel\" auf deutsch stellen.[BR][BR]Für ein Feedback zum Hexenkessel ist es aus meiner Sicht für die Live-Welten auch noch zu früh, da man sich erst mit dem Feature \"Hexenkessel\" beschäftigen muss, und das ist nicht gleich am ersten Tag nach wenigen Minuten zu erwarten."}, {"155": "HerrderWelten schrieb:\t\t\tauszugeben ?\t\tZum Vergrößern anklicken....Jupp, für Hexenpunkte, braucht etliche Klicks"}, {"103": "Edit: die Posthorn-Ankündigung wurde geändert und sie weist jetzt auf die nötige Forschung im Kapitel V hin"}, {"136": "Theasam schrieb:\t\t\tes muss bei allen erst freigeschaltet werden [smilie--sprite2] und ja, es wird heute im Laufe des Tages noch kommen [smilie--sprite1]Zum Vergrößern anklicken....warum 'MUSS' ich das Ding überhaupt freischalten? So wie es im Baum hängt ist es doch optional, folglich ein 'KANN'... Trotzdem springt der Forschungsbaum immer wieder zu Kapitel 5, solch ein penetrantes Guiden finde ich nicht ok, erinnert mich irgendwie an 'Nötigung' oder 'Augenwischerei'. Es passt zwar zu der Entscheidung nur vollständig (incl. 'optional') erforschte Kapitel zu zählen, aber glücklich macht mich solch ein scheinbarer Zwang nicht."}, {"114": "Ich schmeiss mich wech vor lachen *gg*Neugierig auf das Video hab ich das angeklickt. [BR]Der Teil meines Hirns, der eigendlich noch recht gut Englisch versteht, hat automatisch zugehört... [BR]Ein anderer Teil hat zwanghaft versucht die deutschen Untertitel mitzulesen.So schwer[BR]Hirnbeschäftigt konnte ich mich nicht auf die gezeigten Erklärungen konzentrieren. Ergebnis... [BR]Was ist da los? Worum geht's? Kann es für mich einkaufen fahren? [BR]Ich bleib mal hier zum mitlesen [smilie--sprite2]"}, {"1": "Bezüglich der fehlenden Übersetzungen im Hexenkessel: Da ist irgendwem, irgendwo ein kleines Missgeschick passiert, welches hätte so nicht übersehen werden dürfen. Nun ist es passiert und wir arbeiten daran, das Problem zu beheben. Wir entschuldigen uns für die Unannehmlichkeiten und bitten um ein wenig Geduld. Leider kann ich zum jetzigen Zeitpunkt nicht sagen, wie lange es dauern wird, bis die fehlenden Übersetzungen es dann ins Spiel schaffen."}, {"133": "[IMG]https://i.ibb.co/qjprr7g/https-de-forum-elvenar-com-index-php-attachments-kessel-jpg-33257.jpg[/IMG][BR][BR]noch 49 min Zeit und Montag, nix zum kämpfen da [smilie--sprite8][BR][BR]wo sieht man, dass die Einheiten stärker sind, in der Kaserne und Co kann ich keine Angaben finden[BR][BR][IMG]https://i.ibb.co/D7t6PTJ/https-de-forum-elvenar-com-index-php-attachments-kessel-2-jpg-33258.jpg[/IMG]"}, {"19": "Es gibt 2 Phasen[BR][BR]Phase 1 = die Brauphase[BR]Phase 2 = Lernphase[BR][BR]Ganz wichtig !!![BR]Man macht - bevor man den Hexenkessel benutzt - gar nichts in der Stadt[BR]Warum ?[BR]Weil man nicht weiß, was für einen Effekt man bekommt ![BR][BR]Phase 1[BR]Die Brauphase[BR][BR]Jede Zutat kostet Hexenpunkte[BR]Jetzt klickt man eine Zutat an – die Menge der Hexenpunkte, die diese Zutat kostet[BR]steht bei der Zutat dabei[BR]Diese Zutat geht in den Hexenkessel[BR]Unter dem Hexenkessel wird angezeigt, wie viele Hexenpunkte verwendet wurden[BR]Mehr als oben links angezeigt werden können nicht verwendet werden[BR][BR]Jetzt schaut man auf der rechten Seite den Effekt an, welchen diese Zutat auslöst[BR]Es werden dabei immer mehrere Effekte angezeigt[BR]Der gewünschte Effekt sollte immer ganz oben stehen[BR]Die Effekte sind am Anfang noch schwach und die Dauer ist auch nicht sehr lange[BR]Das kann man mit Phase 2 ändern !!![BR][BR]Passt die Zutat – nimmt man die gleiche Zutat wieder[BR]Es kann aber auch sein, dass diese Zutat auf einmal den Effekt verschlechtert[BR]Dann nimmt man diese eine Zutat wieder raus[BR]Da ist ein Symbol beim Hexenkessel mit dem man die letzte Zutat oder aber auch alle[BR]entfernen kann[BR][BR]Jetzt probiert man eine andere Zutat aus[BR]Schaut ob man mit dieser den gewünschten Effekt rechts verbessern kann[BR]Am Ende hat man die Hexenpunkte, die einem Woche für Woche zur Verfügung stehen, verbraucht[BR]Man kann nun noch Diamanten oder Fragmente verwenden um die Stärke und Dauer des Effektes zu verbessern[BR][BR]Jetzt klickt man – unter dem Hexenkessel – auf BRAUEN[BR]Die Kelche werden verwendet[BR]Der oder die Effekte werden angezeigt[BR][BR]AUFPASSEN – es kann sein, dass man einen Effekt bekommen hat – und diesen[BR]Effekt noch einmal bekommt[BR]Man wird gefragt, was man tun möchte[BR][BR]Ist der neue Effekt besser – tauscht man diesen mit dem vorherigen aus[BR]Ist der neue Effekt schlechter – dann behält man den besseren Effekt und lehnt ab[BR][BR]Jetzt bekommt man mit etwas Glück den einen oder anderen Effekt[BR]UND – erst jetzt, wenn man den oder die Effekte kennt – erst jetzt erntet man seine Manufakturen,[BR]die Managebäude, die Werkstätten, die Gastrassengebäude etc. oder erst dann spielt man das Turnier, den Turm[BR][BR]Jetzt kommen wir zur Phase 2 - die Lernphase[BR][BR]Sobald die Effekte abgelaufen sind erscheint ein neues Fenster[BR]Dort sieht man auf der linken Seite die Effekte[BR]Man klickt den gewünschten Effekt an – die Daten werden im rechten Fenster angezeigt[BR]Jetzt kann man durch Güter etc. – kann man ganz unten auswählen, was man verwenden möchte –[BR]Hexenpunkte eintauschen und für den oder die Effekte verwenden[BR]Dadurch wird der gewünschte Effekt verbessert[BR]Die Stärke – die Dauer[BR]Ein verbesserter Effekt bleibt für die Zukunft immer bestehen[BR][BR]Jetzt bekommt man – ab Sonntag – wieder die Möglichkeit den Hexenkessel zu benutzen[BR][BR]Jemand der kämpft verwendet ihn aber erst, wenn man Turnier und Turm zusammen –[BR]mit einem \"Kampf-Effekt\" spielen kann[BR][BR]Dann fängt die Phase 1 wieder an[BR]Woche für Woche kann man durch Phase 2 die Effekte etwas verbessern[BR][BR]Bekommt man diesen Effekt – ist es aber nicht gesagt, dass auch der maximale Wert erzielt wird[BR]Aber – ein erzielter Effekt ist immer hilfreicher als gar nichts  [smilie--sprite2][BR][BR]Ich kenne den Hexenkessel aus der Beta - einfach nur genial das Teil [smilie--sprite1]"}, {"149": "Naja @OMcErnie. Die Untertittel bei Youtoub habe ich schon lange auf deutsch gestellt.[BR]Aber da sich die Texte durch die durschlaufende Erklärung ständig ändern, hat man genug damit zu tun diese zu lesen. [BR]Von den bildlichen Anzeigen der Erklärungen hat man also gar nichts wenn man kein englisch spricht.[BR]Und da es ja doch schon eine relativ umfassende Erklärung ist, bringe es auch nichts wenn man es sich 2 x anschaut (1 x den Text liest und dann die bildliche Anzeige). Allerdings könnte man das Video ständig zurück spulen um die jeweilige bildliche Anzeige direkt nach dem man den eingeblendeten Text gelesen hat zu sehen. Ist aber auch sehr müsam.[BR]Das jedes neue Kapitell auf gleiche weise vorgestellt wird ist diese englische Erklärung zum Bild ja eigentlich normal bei INNO.[BR]Aber die grundlegenden Dinge bei neuen Kapitelln sind ja bekannt. Den Rest kann man im Wiki nachlesen. Große Fragezeichen bleiben da nicht mehr. Und wenn kann man diese im Spiel leicht und schnell klären. [BR][BR]Bei so einer doch sehr komplzierten Neuerung wäre eine deutsche Erklärungssprache schon dringend erforderlich gewesen.[BR]Da ich kein englich Spreche kann ich mit vielen Begriffen die in der Erklärung genannt werden nichts anfangen. [BR]Und den vielen älteren Spielern (wie ich) hier im Spiel wird es zum großen Teil ähnlich gehen. Wir hatten eben nicht jahrelang englich in der Schule.[BR]Für mich bleibt der Kessel ein einziges großes Fragezeichen.[BR]Und ob ich bei der scheinbar doch sehr großen Komplexibilität überhaupt in der Lage sein werde den Kessel komplet zu erlernen wage ich zu bezweifeln. [BR]So etwas führt nur zur sehr großer Frustation."}, {"28": "zenka schrieb:\t\t\two sieht man, dass die Einheiten stärker sind, in der Kaserne und Co kann ich keine Angaben finden\t\tZum Vergrößern anklicken...."}]