[{"133": "Thebigunknown schrieb:Anhang 33259 ansehenZum Vergrößern anklicken.... super , danke gefunden. [BR][BR]Jetzt brauch ich nur noch was zum drauf hauen ^^"}, {"186": "Mein erstes Feedback zum Hexenkessel:[BR][BR]Ich habe jetzt 1 Effekt auf Stufe 90 und vier andere auf Stufe 65 entwickelt. Ganz ehrlich, diese Klickorgie ist scheußlich, kann man da nicht einfach beim Spenden gegen Hexenpunkte ein Textfeld eingeben, wo ich den Betrag eingebe, den ich spenden will?"}, {"208": "Was ist denn der Unterschied zwischen Händlergebet und Händlerappell? Ist nicht dem Text zu entnehmen. [smilie--sprite12]"}, {"2": "Thuncal schrieb:\t\t\tWas ist denn der Unterschied zwischen Händlergebet und Händlerappell? Ist nicht dem Text zu entnehmen. [smilie--sprite12]Zum Vergrößern anklicken....Appell = Standardgüter[BR]Gebet = erweckte Güter[BR]Segen = erleuchtete Güter"}, {"103": "Melios schrieb:\t\t\tMein erstes Feedback zum Hexenkessel:[BR][BR]Ich habe jetzt 1 Effekt auf Stufe 70 und vier andere auf Stufe 65 entwickelt. Ganz ehrlich, diese Klickorgie ist scheußlich, kann man da nicht einfach beim Spenden gegen Hexenpunkte ein Textfeld eingeben, wo ich den Betrag eingebe, den ich spenden will?\t\tZum Vergrößern anklicken....Dein (unser) Geklicke aus vollen Lagern ist ja nicht der Normalfall.[BR]Im regulären Spielverlauf bist Du ein Level V - Spieler, der den Kessel freischaltet..."}, {"186": "littleFlex schrieb:\t\t\tDein (unser) Geklicke aus vollen Lagern ist ja nicht der Normalfall.[BR]Im regulären Spielverlauf bist Du ein Level V - Spieler, der den Kessel freischaltet...\t\tZum Vergrößern anklicken....Das stimmt natürlich, aber unterm Strich bleibt die Anzahl der Klicks dieselbe - verteilt sich dann nur auf eine viel längere Zeit.[BR][BR]Bin jetzt auf Effektstufe 90 und habe rund 4000 Klicks gemacht."}, {"14": "ich bin hier ein Level 8 Spieler (gerade nach 9 gewechselt) und es ist eine reine Händlerstadt, also dachte ich, ich erhöhe doch mal den Output der Gut1 Manus als erstes:[BR][BR][IMG]https://i.ibb.co/VjJD8Ly/https-de-forum-elvenar-com-index-php-attachments-screenshot-302-png-33269.png[/IMG][BR]ich fand, das sah gut aus und hab dann in der Manu nachgeguckt:[BR][BR][IMG]https://i.ibb.co/92cNKX3/https-de-forum-elvenar-com-index-php-attachments-screenshot-300-png-33270.png[/IMG][BR][BR]ja, man sollte sich genau überlegen, was man erhöht und was da evtl. schon wirkt, denn die Hexenkessel-Wirkung erhöht nur den Grundertrag, wirkt also nicht wie die Verzauberung \"fabelhafte Fabrikation\"[BR][BR]und somit sind hier die 31,9% Boost genauso gut wie der Dauerboost von einer 3 Level-Gebirgshalle, die dauernd wirkt[BR][BR]ich hab allerdings keine Ahnung, wie hoch man die % schrauben kann, aber auf alles auf was schon 700% Reliktbonus wirken, merkt man den Effekt kaum..[BR]also: da evtl. doch lieber Werkzeug und Münzen boostern und dann Gut 1 eintauschen: auf 57 Stahl kommt man da ganz sicher mehrfach :d[BR][BR]mir gefällt der Kessel, auch dass es ein langer Prozess wird, stört mich jetzt nicht"}, {"186": "Weiterer Feedbackpunkt von mir:[BR][BR][IMG]https://i.ibb.co/2Whh2w0/https-de-forum-elvenar-com-index-php-attachments-1673293787088-png-33271.png[/IMG][BR][BR]Im grünen Spendenfeld sollte auch nur der Betrag angezeigt werden, den man wirklich spendet. Hier im Beispiel werden tatsächlich nur die knapp 31k Hexenpunkte eingezahlt, und nicht die 276K.[BR][BR]Die nächste Stufe wird also nicht angefüttert:[BR][IMG]https://i.ibb.co/7J7Ld1S/https-de-forum-elvenar-com-index-php-attachments-1673293880109-png-33272.png[/IMG][BR][BR]PS:[BR]Mein Beileid an das Team. Schon über 100 Posts - da das wirkliche Feedback vom Rest zu trennen ist echt ne ziemlich anstrengende Arbeit."}, {"128": "Möchte jemand meine Hexenpunkte und Kelche haben?"}, {"155": "alf2021 schrieb:\t\t\tMöchte jemand meine Hexenpunkte und Kelche haben?\t\tZum Vergrößern anklicken....Klar doch, wenn du einen Weg findest sie zu mir zu bringen, dann zahle ich dich in Wps oder irgendetwas anderem aus, was ich nicht brauche. [smilie--sprite2]"}, {"265": "Also Leute, mal ehrlich! Die GA' s sind für kleinere Gilden eh schon schwer genug zu schaffen gewesen, bis eigentlich fast unmöglich! Und jetzt habt ihr auch noch die Anzahl der zu produzierenden Abzeichen und Güter erhöht, echt SUPER! Das heißt unterm Strich also, das die kleineren Gilden das GA gar nicht mehr schaffen werden! \"ECHT KLASSE GEMACHT VON EUCH\" herzlichen Glückwunsch dazu!!!!"}, {"128": "Love-Town schrieb:\t\t\tAlso Leute, mal ehrlich! Die GA' s sind für kleinere Gilden eh schon schwer genug zu schaffen gewesen, bis eigentlich fast unmöglich! Und jetzt habt ihr auch noch die Anzahl der zu produzierenden Abzeichen und Güter erhöht, echt SUPER! Das heißt unterm Strich also, das die kleineren Gilden das GA gar nicht mehr schaffen werden! \"ECHT KLASSE GEMACHT VON EUCH\" herzlichen Glückwunsch dazu!!Zum Vergrößern anklicken....[BR]Welcher Hexentrank wirkt denn hier? [BR][BR][BR]Killy schrieb:\t\t\tKlar doch, wenn du einen Weg findest sie zu mir zu bringen, dann zahle ich dich in Wps oder irgendetwas anderem aus, was ich nicht brauche. [smilie--sprite2]Zum Vergrößern anklicken....[BR]Zu spät, hab sie verbraten, sorry [smilie--sprite3][BR]Und was soll ich sagen: Sagenhafte 32,2% auf meine Seidenmanus.[BR]Eigentlich wollte ich was anderes brauen, aber egal, man nimmt ja was kommt.[BR]Meine Seidenmanus liegen seit gestern save in den Beschwörungen,[BR]sie mußten für ein paar Holzmanus für das Ga weichen...[BR][BR]Aber ich werde nicht aufgeben, irgendwann werde ich in Seide schwimmen! [smilie--sprite6]"}, {"35": "[IMG]https://i.ibb.co/QKScgNN/https-de-forum-elvenar-com-index-php-attachments-2023-01-09-settlementressoures-jpg-33276.jpg[/IMG][BR][BR]Was sind \"Settlement Ressources\"? Ich tippe mal auf Güter im allgemeinen?[BR]Und ist es so vage gemeint, wie ich es verstehe: \"most settlement ressources\" = \"die meisten der Güter\" (also nix genaues, welche verbessert werden?)"}, {"19": "hobbitrose schrieb:Anhang 33276 ansehen[BR][BR]Was sind \"Settlement Ressources\"? Ich tippe mal auf Güter im allgemeinen?[BR]Und ist es so vage gemeint, wie ich es verstehe: \"most settlement ressources\" = \"die meisten der Güter\" (also nix genaues, welche verbessert werden?)\t\tZum Vergrößern anklicken....Erweckte Güter !"}, {"2": "hobbitrose schrieb:Anhang 33276 ansehen[BR][BR]Was sind \"Settlement Ressources\"? Ich tippe mal auf Güter im allgemeinen?[BR]Und ist es so vage gemeint, wie ich es verstehe: \"most settlement ressources\" = \"die meisten der Güter\" (also nix genaues, welche verbessert werden?)\t\tZum Vergrößern anklicken.......na - das sind Gastrassen-Ressourcen - also ein Portalo sozusagen....(bzw. eher wie die Hummel)..."}, {"81": "Love-Town schrieb:\t\t\tAlso Leute, mal ehrlich! Die GA' s sind für kleinere Gilden eh schon schwer genug zu schaffen gewesen, bis eigentlich fast unmöglich! Und jetzt habt ihr auch noch die Anzahl der zu produzierenden Abzeichen und Güter erhöht, echt SUPER! Das heißt unterm Strich also, das die kleineren Gilden das GA gar nicht mehr schaffen werden! \"ECHT KLASSE GEMACHT VON EUCH\" herzlichen Glückwunsch dazu!!!!Zum Vergrößern anklicken....[BR]Dir ist schon  bewusst das \"kleine Städte\" Kapitel 3/4/5 bei Armreifen einfach nur bevorzugt werden wo man in Kapitel 20 einfach nur abstinkt?[BR][BR]Das eine Kapitel 3 Stadt mit 60 Manus alle Armreifen produzieren kann für das Ganze GA einer Gemeeinschaft die mal einfach 200.000 Punkt emacht.[BR][BR]Wo soll das eine Benachteiligung sein wenn ich als Kapitel 20 Spieler durch einen Buff der den Grundbonus erhöht der im Promille Bereich im GA statt findet?[BR][BR]Zum Topic ist es witzig das praktisch das selbe Feedback am Beta gegeben wurde wie hier bisher............"}, {"144": "Xxx"}, {"130": "Dafür, dass der Kessel in Kapitel V eingeführt wird, ist er so ziemlich das nutzloseste Feature für Spieler in diesem Bereich.[BR][BR]Wenn ihr das Feature schon für Veteranen einführt bzw. diese bevorzugen wollt (wie es ja in den Videos vorher erwähnt wurde), dann lasst es doch bitte auch erst später freischalten. Es wäre sicher kein Kapitel V Spieler böse drum gewesen..[BR][BR]Zum Trankbrauen:[BR]In Kapitel V hab ich etwas über 600 von diesen Hexenpunkten erhalten für das Trankbrauen, die Chance auf einen Effekt beim Trank war dementsprechend gering. Ich hatte zwar 5 Pokale, aber kein einziger hat einen Effekt ausgelöst.[BR]Aber man könnte die Effektchance ja noch durch überflüssige Zauberfragmente erhöhen! Tja, nur zu blöd, dass man in Kapitel V nie genug Zauberfragmente hat, da man noch so viel Nützliches in der MA herstellen kann (ich mache jedes Mal mindestens Tor 2 im Turm, hab die MA auf Stufe 5 und nie genug Zauberfragmente, zumal ich noch 12k für die Mondsteinbib sparen muss [smilie--sprite7]).[BR][BR]Zum Aufwerten:[BR]Da hab ich erstmal gestaunt, als ich gesehen hab, wieviel man für die Hexenpunkte „spenden“ muss:[BR]Mit 4 Diplomen fängt alles bei 1k an. Ja, macht Sinn: 1k Güter mit 1k Münzen oder Vorräte gleichzusetzen.[BR]In Kapitel 5 ist 1k Gut noch was wert, das geb ich sicher nicht für ein paar Hexenpunkte aus.[BR]Also bleibt der Trank so schlecht, wie er anfangs ist.[BR]=> Nutzlos.[BR][BR]Abschließend wollte ich noch erwähnen, dass ich ein Feature, das einmalig in der Woche anwendbar ist, ziemlich langweilig finde.[BR][BR]Nachtrag:[BR][BR]Beim Studieren kommt immer ein vorgeschaltetes Fenster, welches man erst wegklicken muss. Finde ich auch etwas unglücklich / nervig."}, {"34": "Ich finde es schade wie der Bonus bei z.B. Vorräte wirkt. Anstatt dass der Grundwert erhöht wird und auf diesen erhöhten Wert dann der Kulturbonus und die Verzauberung wirken, wird es einfach nur Addiert ohne Auswirkung auf diese Boni. So ist selbt auf Stufe 100 und mit Einsatz von Zauberspruchfragmenten der Bonus für mich irrelevant."}, {"2": "SidKane schrieb:\t\t\tIch finde es schade wie der Bonus bei z.B. Vorräte wirkt. Anstatt dass der Grundwert erhöht wird und auf diesen erhöhten Wert dann der Kulturbonus und die Verzauberung wirken, wird es einfach nur Addiert ohne Auswirkung auf diese Boni. So ist selbt auf Stufe 100 und mit Einsatz von Zauberspruchfragmenten der Bonus für mich irrelevant.\t\tZum Vergrößern anklicken.......hast du zufällig Screenshots? ja, der Kulturbonus wirkt sich leider NICHT auf den Trankeffekt aus - aber bei den verzauberten Vorräten bin ich mir da nicht sicher, denn bei der Fabelhaften Fabrikation wirkt der denk ich schon auf den Trank auch (da ist aber die Wirkung des Trankes recht gering ohne Reliktbonus)....[BR][BR]Mein Bergtroll mit und ohne Trank...[BR][IMG]https://i.ibb.co/SryDqYG/https-de-forum-elvenar-com-index-php-attachments-a9-png-33249.png[/IMG][IMG]https://i.ibb.co/tHkDDv4/https-de-forum-elvenar-com-index-php-attachments-a11-png-33282.png[/IMG][BR][BR]...generell finde ich es schon recht schwer, eine \"sinnvolle\" Auswahl an passenden Zutaten zu treffen, wenn man[BR]1. in einem hohen Kapitel ist und dementsprechend viele Effekte zur Auswahl hat,[BR]2. eine hohe Gesamtwahrscheinlichkeit (16 Zutaten ->80 %) erreichen will,[BR]3. möchte, daß möglichst alle Schlucke einen eigenen Effekt auslösen und keiner doppelt und somit zur Entscheidung steht,[BR]4. der Trank dann doch auch möglichst günstig bleiben soll (vor allem ohne Dias)[BR][BR]...auf jeden Effekt wirken sich immer 4 Zutaten stark positiv aus (3,2,1,1), 3 Zutaten können diese wieder negieren (-1,-1,-2) und die übrigen 5 wirken sich geringfügig positiv oder negativ aus - wie genau, weiß ich nicht - komm da mal auf 1/4, dann 1/3, dann 3/4)...[BR][BR]...ich werd mal versuchen, mir ein Grundrezept zu erstellen und dann werd ich das von Woche zu Woche anpassen, je nachdem welche Zutaten Dias kosten oder was vielleicht Besonderes in dieser Woche ansteht (Gold für GA z.B.) - da wird aber niemand drum rum kommen - Pauschalrezepte halte ich für ziemlich unrealistisch, außer man verwendet halt einfach immer die gleichen 1-3 Zutaten, um gezielt 1-2 Effekte zu fördern, was aber vermutlich recht teuer wird und zur Folge haben kann, daß man mehrfach das Gleiche aktiviert und somit Kelche verschwendet werden...[BR][BR]...Fragmente werde ich nur verwenden, wenn ich mit meinem Rezept wirklich zufrieden bin, die Effekte schon hübsch aufgelevelt sind und sich somit auch eine wirklich tolle Wirkung erzielen lässt - meist werd ich mich eher dem anpassen, was mir der Zufall so an kleinen Geschenken beschert und lieber meine übrigen Hexenpunkte in die Forschung stecken, damit die Geschenke mit der Zeit ein wenig größer werden...[BR][BR]...kleineren Kapiteln würde ich vorerst raten, einfach 4-6 verschiedene Zutaten in den Kessel zu werfen (Gesamtkosten, 233, 306, 387, Wahrscheinlichkeit 40%, 44,7%, 49%) und den Rest ebenfalls in die Forschung zu stecken und vorerst dort nichts zuzukaufen - erst einmal ne Weile testen und Erfahrungen sammeln, bevor man viel investiert und wenig bekommt...."}]