[{"34": "Romilly schrieb:\t\t\t...hast du zufällig Screenshots?\t\tZum Vergrößern anklicken....[IMG]https://i.ibb.co/QN6Lcvj/https-de-forum-elvenar-com-index-php-attachments-2023-01-10-10-35-16-elvenar-fantasy-aufbauspiel-moz.png[/IMG]"}, {"2": "SidKane schrieb:Anhang 33283 ansehenZum Vergrößern anklicken.......danke - aber daraus lässt sich leider noch nicht erkennen, wie es wirkt - bitte nochmal einen Shot, wenn der Trank vorbei ist - der Kulturbonus sollte dann natürlich noch gleich hoch sein - dann sieht man schnell und einfach, ob der Verzauberungsbonus gleich bleibt oder eben nicht (oder du rechnest nach - ich kenn deine relevanten Zahlen nicht)[BR][BR]...hab mal Sinya geopfert, aber leider keinen Werkzeugeffekt aktiviert...[BR][BR][IMG]https://i.ibb.co/RD1nScD/https-de-forum-elvenar-com-index-php-attachments-s3-png-33286.png[/IMG][BR][IMG]https://i.ibb.co/CB22JfW/https-de-forum-elvenar-com-index-php-attachments-s4-png-33287.png[/IMG][BR][IMG]https://i.ibb.co/m6CndP1/https-de-forum-elvenar-com-index-php-attachments-s2-png-33285.png[/IMG][IMG]https://i.ibb.co/GJ2Frkw/https-de-forum-elvenar-com-index-php-attachments-s6-png-33289.png[/IMG][BR][BR]...hier sieht man, daß der Verzauberungsbonus links ohne Trank niedriger, als der rechts mit Trank ist - demnach wirkt die Verzauberung auch auf den Trank - sind aber halt nur 1391-1334=57 Marmor extra + die 113 vom Trank selbst)...mit Handelszentrum und Sturmphönix sollte man da aber noch was draus machen können, wenn der Trankeffekt mal wesentlich höher ist)....[BR][BR]...der Manueffekt wirkt übrigens nicht auf Setgebäude...[BR][IMG]https://i.ibb.co/FDf0g50/https-de-forum-elvenar-com-index-php-attachments-manuboost-png-33303.png[/IMG]..."}, {"2": "...ich mach mal nen Doppelpost, weil es wieder um was anderes geht...[BR][BR]...anscheinend ist es nicht möglich, bestimmte Diplome wegzulassen...[BR][BR]....hab hier ne kleine Kapitel6-Teststadt, der das Diplom aus Kapitel 1 fehlt, 2-4 besitzt und Kapitel 5 wieder nicht...sind also 3 Diplome...[BR][BR][IMG]https://i.ibb.co/W0Kbxq8/https-de-forum-elvenar-com-index-php-attachments-diplome-png-33294.png[/IMG][IMG]https://i.ibb.co/bNtFk1P/https-de-forum-elvenar-com-index-php-attachments-diplome2-png-33295.png[/IMG][BR][BR]...eigentlich würde hier Gold fehlen, Werkzeug, Söldnerlager und Gut1 vorhanden sein und Gut2 dann wieder fehlen...[BR][BR][IMG]https://i.ibb.co/v1tNVHJ/https-de-forum-elvenar-com-index-php-attachments-effekte-png-33298.png[/IMG]...bzw. [IMG]https://i.ibb.co/JHY2yPF/https-de-forum-elvenar-com-index-php-attachments-effekte2-png-33299.png[/IMG][BR][BR]...im Hexenkessel erscheint aber der Goldeffekt mit der richtigen (1.) Zutat, der Gut1-Effekt wird aber nicht durch die eigentlich passende Zutat (10.) ausgelöst...[BR][IMG]https://i.ibb.co/9NcBSkH/https-de-forum-elvenar-com-index-php-attachments-diplome3-png-33296.png[/IMG][IMG]https://i.ibb.co/xJWbyTw/https-de-forum-elvenar-com-index-php-attachments-diplome4-png-33297.png[/IMG]....[BR][BR]...also um z.B. eine Auswirkung auf das Söldnerlager zu bekommen, muss man nicht nur Kapitel 11 komplett abgeschlossen haben, sondern alle Kapitel einschließlich Kapitel 11...."}, {"14": "ja, jedes Diplom zählt quasi immer von vorne an, [BR]wer z.B. Diplome von Kapitel 16-20 hat und die davor alle nicht, hat also die ersten 5 Effekte freigeschaltet, egal, ob er in Kapitel 20 ist"}, {"135": "Es hiess doch, der Kulturbonus auf Wunder bleibt? Leider ist dem nicht so."}, {"240": "Ich durfte jetzt x-Seitenquest-Aufgaben wg des blöden Hexenkessels - es bezog sich alles darauf - eliminieren.[BR]Das ist kontraproduktiv, wenn viele von uns den Hexenkessel noch nicht ein Mal im Ansatz verstehen.[BR]Mehr will und mag ich jetzt auch nicht mehr dazu schreiben"}, {"2": "Xebifed schrieb:\t\t\tEs hiess doch, der Kulturbonus auf Wunder bleibt? Leider ist dem nicht so.\t\tZum Vergrößern anklicken.......ist doch auch noch so...[BR][BR][IMG]https://i.ibb.co/VgW0nzV/https-de-forum-elvenar-com-index-php-attachments-abgrund3-png-33302.png[/IMG]...unten fliegen 100 % weg (ohne Bonus) - es kommen oben aber 160 % an....[BR][BR]...der Kulturbonus hat nur keine Extra-Wirkung auf den Trankeffekt...(falls es diesen überhaupt im Abgrund gibt - hab ich noch nicht testen können)..."}, {"135": "Romilly schrieb:\t\t\t...ist doch auch noch so...[BR][BR]Anhang 33302 ansehen...unten fliegen 100 % weg (ohne Bonus) - es kommen oben aber 160 % an....[BR][BR]...der Kulturbonus hat nur keine Extra-Wirkung auf den Trankeffekt...(falls es diesen überhaupt im Abgrund gibt - hab ich noch nicht testen können)...\t\tZum Vergrößern anklicken....[BR]habe ich vorhin anders beobachtet. [BR]dass die anzeige bisher nicht korrekt war, wusste ich bereits, jetzt wurde aber auch nichts extra gutgeschrieben."}, {"2": "LOL - meine Zauberin ist mittlerweile wohl auch überfordert....[BR][IMG]https://i.ibb.co/n3C6M3p/https-de-forum-elvenar-com-index-php-attachments-lol-png-33304.png[/IMG]"}, {"34": "Romilly schrieb:\t\t\tbitte nochmal einen Shot, wenn der Trank vorbei ist - der Kulturbonus sollte dann natürlich noch gleich hoch sein\t\tZum Vergrößern anklicken....[IMG]https://i.ibb.co/NV1wrMM/https-de-forum-elvenar-com-index-php-attachments-2023-01-10-16-50-16-elvenar-fantasy-aufbauspiel-moz.png[/IMG][BR]Abgelaufen und gleicher Kulturbonus."}, {"2": "...ich vergleiche mal...[BR][BR][IMG]https://i.ibb.co/61L28sb/https-de-forum-elvenar-com-index-php-attachments-vorr-te-png-33308.png[/IMG].......[IMG]https://i.ibb.co/rQzx8FX/https-de-forum-elvenar-com-index-php-attachments-vorr-te2-png-33309.png[/IMG][BR][BR]...der Kulturbonus ist der gleiche - aber der Verzauberungsbonus ist mit Trank höher - dankeschön - das wollte ich wissen  [smilie--sprite8]"}, {"2": "...nochwas Allgemeines...[BR][BR]...wie viele ja bestimmt schon festgestellt haben, bekommt man leider nicht die vollen % aus der Rezeptliste, sondern nur einen Bruchteil davon (und der kann auch noch unterschiedlich sein)...das betrifft auch die Dauer des Effektes...[BR][BR][IMG]https://i.ibb.co/RD1nScD/https-de-forum-elvenar-com-index-php-attachments-s3-png-33286.png[/IMG]...aus 40 %, 5 Std. und 10 %, 5 Std. wurden leider nur...[BR][IMG]https://i.ibb.co/CB22JfW/https-de-forum-elvenar-com-index-php-attachments-s4-png-33287.png[/IMG]....38,9 %, 4:25 Std. und...[IMG]https://i.ibb.co/gMznVcb/https-de-forum-elvenar-com-index-php-attachments-s5-png-33312.png[/IMG]...6 %, 3:30 Std..[BR][BR][BR]...durch Zugabe von Fragmenten oder alternativ Diamanten kann man den Höchstwert der aktivierten Effekte allerdings erhöhen - das ist wohl dann der \"kritische Effekt\"...[BR][IMG]https://i.ibb.co/zPNLCbt/https-de-forum-elvenar-com-index-php-attachments-fragmente-png-33313.png[/IMG]...hab hier mal was zugefügt - alle Werte steigen....[IMG]https://i.ibb.co/71n6hL4/https-de-forum-elvenar-com-index-php-attachments-fragmente2-png-33314.png[/IMG]...[IMG]https://i.ibb.co/t8BNhwV/https-de-forum-elvenar-com-index-php-attachments-fragmente4-png-33317.png[/IMG][BR][BR]...und um zu testen, was da möglich ist - hab ich einfach mal ein paar Mal  [smilie--sprite2] geklickt und die Auswirkung notiert...[BR][BR][IMG]https://i.ibb.co/b15BNn6/https-de-forum-elvenar-com-index-php-attachments-fragmente3-png-33315.png[/IMG][BR][BR]...bei 50 % im Wert von 165.000 Fragmenten ist dann allerdings Schluß (und man muss nicht so oft klicken - man kann auch in dem Feld manuell eingeben, wieviele Fragmente man zufügen will - und wie immer wird erst abgebucht, wenn man auf \"Brauen\" drückt..."}, {"28": "Romilly schrieb:\t\t\tdurch Zugabe von Fragmenten oder alternativ Diamanten kann man den Höchstwert der aktivierten Effekte allerdings erhöhen - das ist wohl dann der \"kritische Effekt\"\t\tZum Vergrößern anklicken....Genau! ;-)"}, {"133": "wenn man einmal Fragmente eingesetzt wurden, bleibt dann der Zeit Effekt für immer bestehen?[BR] und hat man eine Chance auch ohne Fragmente auf Dauer zu erhöhen. Oder ist das ausgeschlossen.[BR]Fragmente sind voll kostbar, möchte eigentlich keine einsetzen."}, {"2": "zenka schrieb:\t\t\twenn man einmal Fragmente eingesetzt wurden, bleibt dann der Zeit Effekt für immer bestehen?[BR] und hat man eine Chance auch ohne Fragmente auf Dauer zu erhöhen. Oder ist das ausgeschlossen.[BR]Fragmente sind voll kostbar, möchte eigentlich keine einsetzen.\t\tZum Vergrößern anklicken.......nein - Fragmente benutzt man zum Brauen - d.h. sie gelten nur bei diesem einen Rezept/Trank...[BR][BR]...Werte dauerhaft verbessern geht nicht mit Fragmenten - nur mit Hexenpunkten..."}, {"266": "Was 'nen Hexenwerk. Komplex und spannend. Was mir aber schon jetzt nicht gefällt, wie sich die Kosten für die (nicht-dia) Zutaten entwickeln.[BR]Dass diese von der Reihenfolge abhängen ist irgendwie unintuitiv.[BR]Hier zweimal genau der gleiche Trank (jede nicht-dia Zutat dreimal), und am Ende nen Preisunterschied von knapp 1000 Hexenpunkten, nur weil die Reihenfolge des Hinzufügens eine andere war.[BR][IMG]https://i.ibb.co/xC71Ymb/https-de-forum-elvenar-com-index-php-attachments-billig-png-33323.png[/IMG][IMG]https://i.ibb.co/GsnFnXV/https-de-forum-elvenar-com-index-php-attachments-teuer-png-33324.png[/IMG]"}, {"2": "LwennA schrieb:\t\t\tWas mir aber schon jetzt nicht gefällt, wie sich die Kosten für die (nicht-dia) Zutaten entwickeln.[BR]Dass diese von der Reihenfolge abhängen ist irgendwie unintuitiv.\t\tZum Vergrößern anklicken.......da hab ich mittlerweile auch eine komplette Liste (bzw. hab ich nicht mehr als 6 gleiche notiert - mehr wären ja noch teurer...[BR][IMG]https://i.ibb.co/xf2Rsnz/https-de-forum-elvenar-com-index-php-attachments-zutaten3-png-33325.png[/IMG]...kauft man eine Zutat mit Dias, erhöhen sich die Preise nicht...[BR][BR]...das mit dem Preisunterschied ist interessant - war mir noch nicht aufgefallen...bei der einzelnen Preisentwicklung ist die Reihenfolge egal...aber die Summe ist also dann verschieden...[BR][BR]...das ist das Problem bei dem Ganzen - eine möglichst hohe Wahrscheinlichkeit auf ein paar bestimmte Effekte, erhält man nur, wenn man auch viele gleiche Zutaten verwendet - das macht den Trank allerdings dann sehr teuer (unbezahlbar)..."}, {"2": "....da es bisher nur in Fragen zum Hexenkessel steht (find das immer verwirrend mit 2 Threads)...[BR][BR]...es gibt eine Liste für die Hexenpunkte, die man zum Brauen bekommt - anscheinend bekommt man für jede erfüllte Forschung was dazu (abhängig vom Kapitel)...[BR][BR][IMG]https://i.ibb.co/5L1zBdQ/https-de-forum-elvenar-com-index-php-attachments-hexenpunkte-png-33326.png[/IMG]...hab ich aus dem US-Forum geklaut - da stand \"Liste für Elfen\" - allerdings haben die nur 7431 Punkte also weniger als Menschen, denn die haben einen anderen Forschungsbaum und deshalb 1 Hexenpunkt mehr, wenn sie alle Forschungen gemacht haben...[BR][BR]in Arendyll hab ich allerdings nicht 4350 Hexenpunkte bekommen, sondern 4384, was wohl daran liegt, daß ich schon 2 Forschungen von Kapitel 17 abgeschlossen habe - 4350 + 2x 17 ergibt 4384..."}, {"2": "...schon wieder ich  [smilie--sprite2]  - ich hab mir mit meiner Zutatentabelle eine Rezepthilfe gebastelt und erzähl mal schnell, wie das funktioniert (da warten schon viele ingame drauf)...[BR][BR][IMG]https://i.ibb.co/txKp18D/https-de-forum-elvenar-com-index-php-attachments-hilfe-png-33335.png[/IMG][BR]...jede Zutat bewirkt einzeln verwendet verschiedene Effekte, die man in einer Tabelle gliedern und so den Effekten zuordnen kann...[BR][BR]...dabei ergeben sich dann für jeden Effekt 4 positive Werte -> 3, 2, 1, 1, die erst immer von 4 Zutaten in Reihenfolge ausgelöst werden und dann mit je 1 Zutat dazwischen... hab ich ganz am Anfang mal gezeigt - gemeint sind hier die großen fetten Werte 3 (blau), 2 (grün) und 1 (gelb)[BR]...zusätzlich kann man in den Files noch weitere Werte auslesen - auch negative (die aber mit einer einzelnen Zutat nicht erscheinen)...[BR][BR]...durch zahlreiche Tests hab ich festgestellt, daß es jeweils 3 negative Werte gibt, die einen positiven Wert komplett negieren können mit den Werten -1 (dunkelgelb) und -2 (orange) - zusätzlich gibt es noch weitere positive und negative Werte, die aber nicht als ganze Zahl gewertet werden, sondern nur als Bruchzahl - wie genau, hab ich aber nicht rausgefunden...[BR][BR]...um trotzdem eine Hilfe zu bekommen, wie man da was kombinieren kann, um % zu stärken oder zu schwächen hab ich mir etwas überlegt - das in der Mitte...[BR][BR]zuerst hab ich mir mal überlegt, welche Effekte ich gerne hätte (6 Stück) und welche ich lieber nicht aktiviert haben will (ebenfalls 6 Stück) - die übrigen 8 (ich hab in Fely alle 20) sind somit \"neutral\"[BR][BR]...jetzt hab ich in der Hilfe für jeden gewollten Effekt (+) bei einem positiven ganzen Wert und für jeden ungewollten Effekt (-) mit einem negativen ganzen Wert jeweils das entsprechende Bildchen der verwendeten Zutat verteilt und diese dann darunter in der 1. Zahlenreihe zusammengezählt - hier sieht man gleich, daß der \"Schnuller\" (Spottzungen) ganz gut zu meiner Auswahl passt (hat 6 Treffer)[BR][BR]...ebenso hab ich in der Hilfe für jeden ungewollten Effekt (-) mit einem positiven kompletten Wert ein X verteilt (dickes rotes X für 3, rotes X für 2, schwarzes X für 1 positiven Wert, den ich nicht haben will) und ebenfalls die Anzahl der X erfasst (2. Zahlenreihe)[BR][BR]...in den nächsten beiden Reihen hab ich das Ganze nochmal mit den tatsächlichen Werten gerechnet und dann voneinander subtrahiert...[BR][BR](die / würden sich geringfügig positiv auf meine Wünsche auswirken - hab ich mal als Zusatz eingefügt, aber nicht mit gerechnet)[BR][BR]...so hab ich 1 Zutat ermittelt, die sehr gut zu meinen Wünschen passt - der \"Schnuller\" (Spottzungen)[BR]...und 3, die ich wohl lieber nicht verwenden sollte... Ei der Medusa, \"Glubschaugen\" (Augensprossen) und den \"Blumenkohl\" (Wolkenwolle-Knospe - kann mir die Namen nicht merken ^^)[BR][BR]...grummel grummel - hab gesehen, daß beim Trainings-Herz ein X bei der Medusa fehlt - zum Glück hab ich die schon aussortiert...[BR][BR]...also hab ich mal einfach diese Zutaten jeweils 1 x in den Kessel geworfen und gekuckt, was dieses Grundrezept bringt...[BR][BR][IMG]https://i.ibb.co/qgsSp80/https-de-forum-elvenar-com-index-php-attachments-grundrezept-png-33345.png[/IMG][IMG]https://i.ibb.co/8Dkhrvx/https-de-forum-elvenar-com-index-php-attachments-grundrezept2-png-33346.png[/IMG][IMG]https://i.ibb.co/6F9Ynmn/https-de-forum-elvenar-com-index-php-attachments-grundrezept3-png-33347.png[/IMG][IMG]https://i.ibb.co/ZV7HHd7/https-de-forum-elvenar-com-index-php-attachments-grundrezept4-png-33348.png[/IMG]...leider müsste ich dafür auch Dia-Zutaten verwenden, was ich nicht möchte - aber grundsätzlich haben alle 6 Wunscheffekte \"gute\" % bekommen und 2 von den nicht gewollten sind ganz raus gefallen und die anderen recht weit unten - das Grundrezept würde also ganz gut funktionieren, wenn da nicht die Dias wären (außerdem hätte ich auch gerne eine höhere Erfolgsrate --> 80 % - dazu brauche ich 16 Zutaten, nicht bloß 9...[BR][BR]...also muss ich wohl die mit den Dias weglassen und werfe gleich mal alle übrigen 2x in den Topf...[BR][BR][IMG]https://i.ibb.co/F31nrs0/https-de-forum-elvenar-com-index-php-attachments-trank-png-33336.png[/IMG][IMG]https://i.ibb.co/236Tx33/https-de-forum-elvenar-com-index-php-attachments-trank2-png-33337.png[/IMG][IMG]https://i.ibb.co/cc7nkzL/https-de-forum-elvenar-com-index-php-attachments-trank3-png-33338.png[/IMG][IMG]https://i.ibb.co/HpwHDrV/https-de-forum-elvenar-com-index-php-attachments-trank4-png-33339.png[/IMG]...sieht auch gar nicht so schlecht aus, aber die ungewollten (rot) sind mir zu hoch - die muss ich mit den 2 fehlenden Zutaten noch irgendwie drücken bzw. 2 gewünschte Effekte (grün) nach oben schieben...[BR][BR]...interessant ist, daß ich wenn ich alle Zutaten erst 1 x anklicke und dann ein 2. mal, 1771 bezahlen soll, aber wenn ich jedes gleich 2x anklicke bloß...[IMG]https://i.ibb.co/5sTvZ1p/https-de-forum-elvenar-com-index-php-attachments-trank5-png-33340.png[/IMG]...1693 - das spart mir also 78 Hexenpunkte..."}, {"2": "...weiter gehts...[BR][BR]...ich studiere also meine Tabelle und entscheide mich für einen weiteren \"Käfer\"(nuss) und eine Limetten-Made...[BR][IMG]https://i.ibb.co/2hCm08D/https-de-forum-elvenar-com-index-php-attachments-trank6-png-33349.png[/IMG][IMG]https://i.ibb.co/KzDwsDd/https-de-forum-elvenar-com-index-php-attachments-trank7-png-33350.png[/IMG][IMG]https://i.ibb.co/ZSKH4gz/https-de-forum-elvenar-com-index-php-attachments-trank8-png-33351.png[/IMG][IMG]https://i.ibb.co/xGhVXjb/https-de-forum-elvenar-com-index-php-attachments-trank9-png-33352.png[/IMG]...und es lässt sich einiges verbessern - bin zufrieden damit - so könnte ich das brauen...[BR][BR]...hab dann versucht 2-3-0-2  0-3-2-0  0-2-0-2 anzuklicken und nicht erst alle 2x und dann noch 2 zusätzlich und der Gesamtpreis ist auf [IMG]https://i.ibb.co/x2CSRZn/https-de-forum-elvenar-com-index-php-attachments-trank10-png-33353.png[/IMG]gesunken - wenn ich stattdessen die beiden mit der Anzahl 3 zuerst rein gebe und dann die übrigen doppelt, sinkt der Preis sogar auf...[IMG]https://i.ibb.co/KKL47gW/https-de-forum-elvenar-com-index-php-attachments-trank11-png-33354.png[/IMG]...mit genau den gleichen Zutaten...[BR][BR]...an den Werten rechts in der Liste hat sich aber nichts geändert - so konnte ich aber nun 2474-2281=193 Hexenpunkte einsparen...[BR][BR][BR]...vielleicht findet sich ja jemand, der so eine Hilfstabelle programieren kann, die dann selbständig ein Grundrezept nach Wunsch ausspuckt...[BR][BR]..wer weniger Diplome hat, \"schneidet\" die Hilfstabelle einfach entsprechend \"kürzer ab\"...[BR][BR]...und falls jemand heraus findet, wie das mit den übrigen Bruchwerten angerechnet wird, würde mich das natürlich auch sehr interessieren - allerdings ist es dann ja doch wieder vom Zufall abhängig, welcher Effekt aktiviert wird - das kann auch einer mit nur 1 % sein - so genau muss es also gar nicht sein..."}]