[{"35": "FEEDBACK (mal dick markieren, dass es nicht untergeht)[BR][BR]Nachdem ich nun meinen ersten Trank gebraut und getrunken habe, kommen die Quests zur Einführung des Kessels.[BR]Dass es Quests gibt, finde ich wirklich gut. Aber warum erst heute?"}, {"61": "hobbitrose schrieb:\t\t\tAber warum erst heute?\t\tZum Vergrößern anklicken....Das war auch gestern schon da, man musste nur direkt nach dem Erforschen des Kessels eine Quest abschließen, damit die Quests vom Kessel starten. Bei mir gehts auch erst nächste Woche weiter [smilie--sprite1]"}, {"14": "@hobbitrose[BR]die Quests werden dann freigegeben, wenn man eine Schleifenquest löscht oder abschließt[BR]das hast du wohl erst heute gemacht [smilie--sprite1][BR][BR]@Romilly[BR]im Prinzip kann ich alles gut nachvollziehen (zum Glück habe ich nicht so viel Auswahl an möglichen Effekten [smilie--sprite8] )[BR]ich frage mich aber wieso:[BR][BR]aber die ungewollten (rot) sind mir zu hoch - die muss ich mit den 2 fehlenden Zutaten noch irgendwie drücken bzw. 2 gewünschte Effekte (grün) nach oben schieben...Zum Vergrößern anklicken....[BR]dass man irgendwelche Effekte nicht braucht, ist klar, aber dass sie einem zu hoch sind?[BR]was ist daran negativ?[BR]nehmen die % aus den Effekten weg, die man gerne möchte?[BR]nehmen Effekte, die auftauchen, obwohl man sie nicht braucht auch % aus den \"guten\" weg?[BR]bislang habe ich gedacht, dass jeder Effekt für sich berechnet wird und sich gar nicht auf die anderen bezieht[BR]1 Zutat hat (in Kapitel 20) quasi Wirkung auf 20 Effekte (Booster)[BR]davon auf ZWEI Effekte einen besonders positiven[BR]hat man nicht so viele Diplome, dann laufen etliche Effekte ins Leere[BR]und etliche Effekte werden anscheinend verringert, wenn sie da sind von einer Zutat[BR][BR]aber ist es denn entscheidend, die Effekte niedrig zu halten, die einem unwichtig sind?[BR]wenn man sie in der Lernphase nicht erhöht, bleiben sie immer auf 1 Stern und haben so sowieso immer nur wenig Auswirkung[BR][BR]ich verstehe noch nicht, wieso ich auf diese überhaupt Rücksicht nehmen soll?[BR]natürlich können die zufällig beim Brauen rauskommen, aber man würde dann doch sowieso später den Trank nehmen, der am höchsten das bringt, was man favorisiert[BR](das gelingt einem beim allerersten Brauen nicht so unbedingt, da kann der favorisierte Effekte fehlschlagen)"}, {"61": "Neris schrieb:\t\t\twas ist daran negativ?\t\tZum Vergrößern anklicken....Weil das die Chance ist, einen Effekt zu bekommen und wenn die zu hoch ist, ist die Wahrscheinlichkeit auch hoch, dass man einen Effekt bekommt, den man nicht möchte. Wenn man alle Chancen zusammenrechnet, wird man ja wahrscheinlich nicht auf 100% kommen. Da wird anderen Effekten nichts weggenommen. Das ist wieder Elvenar-Mathematik. Jeder Effekt hat für sich 100% und davon hast du dann 5 oder 10% im Rezept drin. Geht bestimmt auch 120% oder sowas insgesammt [smilie--sprite1] [smilie--sprite1] [smilie--sprite1]"}, {"2": "Neris schrieb:\t\t\tdass man irgendwelche Effekte nicht braucht, ist klar, aber dass sie einem zu hoch sind?[BR]was ist daran negativ?\t\tZum Vergrößern anklicken.......\"zu hoch\" bzw. \"zu weit oben\" in der Auswahlliste ^^....d.h. die Wahrscheinlichkeit (Würfel), daß ein nicht gewollter aktiviert wird, ist mir zu hoch...[BR][BR]ZeNSiErT schrieb:\t\t\tWenn man alle Chancen zusammenrechnet, wird man ja wahrscheinlich nicht auf 100% kommen.\t\tZum Vergrößern anklicken.......nein - da kommt man auf die 80 % der Erfolgsrate (16 Zutaten) - bei den übrigen 20 % tritt gar kein Effekt auf..."}, {"267": "Kann man eigentlich keine erweckten Güter für Hexenpunkte spenden, oder muss man das erst frei schalten?"}, {"2": "Trinculo schrieb:\t\t\tKann man eigentlich keine erweckten Güter für Hexenpunkte spenden, oder muss man das erst frei schalten?\t\tZum Vergrößern anklicken........leider nein - weder erweckte noch erleuchtete..."}, {"267": "Schade, ich dachte bevor die nur zerfallen, kann ich sie noch einem sinnvollen Zweck zuführen..."}, {"68": "@Romilly [BR][BR]Nach den mir zugesandten Screens (so ca. 80) und ein paar Nachfragen für spezielle Rezepte bin ich froh das ich den teilweise nicht habe und wo ich eine Akademie stehen habe diese nicht nutze, den Kessel schon gr nicht freischalte.[BR][BR]Ich weiß auch nicht ob da nicht ein paar Fehler drinnen sind oder ob alles wirklich so gewollt ist. Minuseffekte habe ich bei meinen Screens nicht wirklich feststellen können, aber die Effekte dürften ja auch Kapitelabhängig sein, wer noch nicht in Kapitel 12 ist hat ja auch weniger Auswahlmöglichkeiten. Ich habe bisher 9 Effekte genannt bekommen bis glaube ich Kapitel X, wieviele hast du denn da?[BR][BR]Weißt du eigentlich schon wieviel Hexenpunkte man maximal in 1 Woche zusätzlich erspielen kann, denn wenn man den Erfolg auf 100% mit nur 1 Zutat erreichen will dann benötigt man nur schlappe 4,51 M.  Bei den Zutaten mit Diamanten aber nur 625, also eigentich sehr billig.[BR][BR]Man kann ja auch Zauberspruchfragmente und Diamanten hinzufügen, bei den Zauberspruchfragmenten braucht man ja nur 165.000 für den maximalen Kritischen Effekt von 50%, aber Diamanten alleine funktionieren nicht, da müssen ja mindestens 1000 Zauberspruchfragmente hinzugenommen werden. Kannst du das so bestätigen?[BR][BR]Danke schön"}, {"2": "Moonlady70 schrieb:\t\t\tbei den Zauberspruchfragmenten braucht man ja nur 165.000 für den maximalen Kritischen Effekt von 50%, aber Diamanten alleine funktionieren nicht, da müssen ja mindestens 1000 Zauberspruchfragmente hinzugenommen werden. Kannst du das so bestätigen?\t\tZum Vergrößern anklicken.......ja - das + bei den Dias ist so lange grau, bis man 1x Fragmente eingezahlt hat...[BR]Moonlady70 schrieb:\t\t\tWeißt du eigentlich schon wieviel Hexenpunkte man maximal in 1 Woche zusätzlich erspielen kann, denn wenn man den Erfolg auf 100% mit nur 1 Zutat erreichen will dann benötigt man nur schlappe 4,51 M. Bei den Zutaten mit Diamanten aber nur 625, also eigentich sehr billig.\t\tZum Vergrößern anklicken.......die steigen am Anfang um jeweils 1 pro Kauf - das wird dann aber mehr pro Kauf - ob es da einen Maximalwert gibt, weiß ich nicht - denke eher nicht - irgendwann kann man sich halt keine weiteren mehr leisten, denke ich...[BR][BR]...hab ne Liste angelegt, wie viel man für jede Verbesserung zahlen muss - bin aber erst bei Stern 40 - ist noch zu früh...aber für einen Effekt von 1 auf 40 muss man wohl 39475 Hexenpunkte investieren - dann geht es rasant weiter...deshalb hab ich die Werte in meiner Liste bloß bis 6 angegeben - da sieht es noch \"human\" aus...[BR][BR]...oh - ich glaub, du hast was anderes gemeint - damit ein Trank 100% Erfolg hat, braucht man 25 Zutaten - das sind dann 625 Dias - korrekt - ob das, mit den 4,51 Mio stimmt, weiß ich nicht - muss ich testen...puh - es stimmt ^^...das steigt ab der 20. extrem an...[BR][BR]...zu deiner Frage - als Endgamer bekommt man 7431 bwz. 7432 - und für Kapitel 21 gibt es dann wohl für jede erledigte Forschung weitere 21... zukaufen kann man die Hexenpunkte erst in der Studienphase - derzeit ist somit bei 10 gleichen Zutaten Schluß - die kosten dann zusammen 6855 - 11 würden über 10.600 kosten (den genauen Wert sieht man nicht mehr)....[BR][BR]Moonlady70 schrieb:\t\t\tMinuseffekte habe ich bei meinen Screens nicht wirklich feststellen können, aber die Effekte dürften ja auch Kapitelabhängig sein, wer noch nicht in Kapitel 12 ist hat ja auch weniger Auswahlmöglichkeiten. Ich habe bisher 9 Effekte genannt bekommen bis glaube ich Kapitel X, wieviele hast du denn da?\t\tZum Vergrößern anklicken......nimm mal zuerst nen Käfer - dann hast du einen Goldeffekt und wenn du nun eine Qualle hinzu fügst, ist der Goldeffekt weg...[BR][BR]...für jedes vollständig abgeschlossene Kapitel im Forschungsbaum bekommst du 1 Diplom und somit einen weiteren Effekt...das hat aber mit der Liste wenig zu tun, denn + und - wirken sich ja auf den jeweiligen Effekt aus und wenn der noch nicht vorhanden ist, dann kommt da halt auch nix davon in die Liste - mit wenig Diplomen kann es passieren, daß mit einer Zutat überhaupt kein Effekt in die Liste kommt...[BR][IMG]https://i.ibb.co/7yKw6N9/https-de-forum-elvenar-com-index-php-attachments-zutaten4-png-33355.png[/IMG]...gerade erst gesehen - der bleibt dann auf 0 % Erfolgsrate...^^"}, {"113": "hobbitrose schrieb:FEEDBACK (mal dick markieren, dass es nicht untergeht)[BR][BR]Nachdem ich nun meinen ersten Trank gebraut und getrunken habe, kommen die Quests zur Einführung des Kessels.[BR]Dass es Quests gibt, finde ich wirklich gut. Aber warum erst heute?\t\tZum Vergrößern anklicken....Der sinnvollste Ablauf wäre gewesen Kessel freischalten, dann die Schleifenquest erfüllen oder ablehnen, dann die Kesselquests machen und dadurch die Mechanik des Kessels kennenlernen.[BR]Das hatte ich mir nach der ersten Stadt so zurechtgedacht, leider aber bei den beiden anderen Städten nicht dran gedacht [smilie--sprite3], jetzt muss ich bis nächste Woche warten, um dann mit der Quest \"verwende Trophäenkelche\" weitermachen zu können. Hab schon alles vorher ausgetrunken [smilie--sprite10]"}, {"136": "versteh ich das richtig, dass die Rangliste im Turnier nun Einfluss darauf hat, wieviele Kelche man dort extra gewinnt? ...[BR]Edit: ....ok, nein, 'nur' wieder abhängig von der erspielten Punktezahl. Gefällt mir, dass dadurch für manche ein zusätzlicher Anreiz geschaffen wurde nun mehr im Turnier zu leisten...  [smilie--sprite1]"}, {"268": "leider gibt es max. vier Kelche"}, {"113": "Wolfesy schrieb:\t\t\tversteh ich das richtig, dass die Rangliste im Turnier nun Einfluss darauf hat, wieviele Kelche man dort extra gewinnt? Oder ist das nur wieder abhängig von der erspielten Punktezahl? (Ersters würde mir evtl. besser gefallen, 'motiviert' es ggf. mancheinen, nun mehr im Turnier zu leisten...). [smilie--sprite1]Zum Vergrößern anklicken....Es gibt grundsätzlich einen Kelch für lau.[BR]Vier weitere Kelche können im Turnier erspielt werden, je einen für (moment ich schau  noch mal nach, damit ich nix falsches schreibe) 200, 600, 1200 und 2000 Turnierpunkte."}, {"269": "Ich hätte eine Frage, verfallen die Hexenpunkte nach einer Woche oder kann man diese sammeln. Über eine kurze Rückmeldung würde ich mich sehr freuen. LG Theo"}, {"2": "...nein - was du nicht benutzt hast, verfällt (auch die Kelche)..."}, {"113": "TravelerTheodor schrieb:\t\t\tIch hätte eine Frage, verfallen die Hexenpunkte nach einer Woche oder kann man diese sammeln. Über eine kurze Rückmeldung würde ich mich sehr freuen. LG Theo\t\tZum Vergrößern anklicken....Die Punkte können nicht angespart werden sondern müssen innerhalb der aktuellen Woche ausgegeben werden"}, {"270": "Shania1 schrieb:\t\t\tMein bisheriges Fazit: ich persönlich mag den Kessel absolut nicht und komme damit auch bisher nicht zu recht - daher ignoriere ich ihn, ehrlich gesagt. Das Ding ist für höhere Kapitel sicherlich super geeignet, aber auf jeden Fall nicht bis 7 / 8 - das ist jedoch nur meine persönliche Meinung zu dem Kessel.... [smilie--sprite6][BR][BR]P. S. Es wäre tatsächlich keine schlechte Idee, wenn man ein oder zwei Beispielsrezepte - so eins für Anfänger - eins für die, die schon alles können - hier einstellen würde.... -\t\tZum Vergrößern anklicken....[BR]Ich werde den Kessel auch links liegen lassen. Habe keine Zeit ein Diplom zu machen um das Wirrwarr zu entschlüsseln.[BR]Aber, es kann ja sein, dass andere das ganz anders sehen und sich die Zeit nehmen und es nutzen.[BR]Ohne echte Beispiele ist das jedenfalls für mich ein no-go!"}, {"68": "@Romilly [BR][BR]Erstmals danke für deine Antworten, damit wird mir eines noch klarer.[BR][BR]Deine Screens sind aber nicht alle aus einer Welt, oder verändern sich da die Kosten zwischen den Zutaten.[BR][BR]Ich hab aus einer DE Welt folgenden Screen bekommen, glaube ist Kapitel X[BR][BR][IMG]https://i.ibb.co/7CyM6Fd/https-de-forum-elvenar-com-index-php-attachments-1673446164162-png-33376.png[/IMG][BR][BR]Von dir hab ich folgende gesehen:[BR][BR][IMG]https://i.ibb.co/0qhCJ7B/https-de-forum-elvenar-com-index-php-attachments-1673446229280-png-33377.png[/IMG][BR][IMG]https://i.ibb.co/nkrch9b/https-de-forum-elvenar-com-index-php-attachments-1673446462464-png-33379.png[/IMG][BR][BR]von @LwennA gibts es diesen[BR][BR][IMG]https://i.ibb.co/djmGR3J/https-de-forum-elvenar-com-index-php-attachments-1673446360324-png-33378.png[/IMG][BR][BR]Wen ich mir diese 4 ansehe, dann ist der von dir aus Sinya und der von LWennA ident, zumindest was die Zutaten betrifft die Diamanten kosten, bei den anderen 2 Screens ist die Diamanten-Verteilung aber eine andere.[BR][BR]Bedeutet dies, das es da Unterschiede gibt [BR][BR]- zwischen Elfen/Menschen[BR]- eventuell unterschiedliche Kapitel[BR]- beides[BR][BR]ODER[BR][BR]ist das schon wieder so ein INNO-Glücksspiel mit Zufallsgenerator  [smilie--sprite9] [BR][BR]Kosten von 4,51 M Hexenpunkte[BR][BR][IMG]https://i.ibb.co/x6B9LBd/https-de-forum-elvenar-com-index-php-attachments-1673446930164-png-33380.png[/IMG][BR][BR]sowie 165.000 Zauberspruchfragmente[BR][BR][IMG]https://i.ibb.co/NmFkZjr/https-de-forum-elvenar-com-index-php-attachments-1673446987682-png-33381.png[/IMG][BR][BR]bzw. 1000 Zauberspruchfragmente und 16.400 Diamanten[BR][BR][IMG]https://i.ibb.co/NrgW8L7/https-de-forum-elvenar-com-index-php-attachments-1673447015007-png-33382.png[/IMG][BR][BR]für 50% Chance auf den kritischen Effekt stehen theoretisch ja auch fest.[BR][BR]Man kann ja auch Spenden um Hexenpunkte zu erhalten[BR][BR][IMG]https://i.ibb.co/jLWB7g1/https-de-forum-elvenar-com-index-php-attachments-1673447170363-png-33383.png[/IMG][BR][BR]Ob man so viel Rohstoffe auf Lager hat um sich 4,51 M Hexenpunkte zu erwirtschaften ist für mich sehr fraglich, kann aber funktionieren [smilie--sprite7][BR][BR]Als mein persönliches Fazit bleibt mir nur über, das INNO sich das Glücksspiel-Monopol mit aller Gewalt sichern will. Der Hexenkessel ist ja irgendwie schon ein Spiel im Spiel und meiner Meinung nach, auf Grund der vielen Zufallsgeschichten, ein nicht unbedingt notwendiges neues \"Feature\" das Elvenar in dieser Form gebrauchen kann, ist mit Sicherheit bei FoE besser aufgehoben.[BR][BR]Lady"}, {"271": "Hm..... ich habe jetzt so ziemlich alles durchgelesen, verstehe das mit dem Brauen, Effekten etc...... aber: Es erschließt sich mir einfach nicht wie und wann es etwas bringt. Ich braue, muss alle hintereinander brauen(?), dann ist das  fertig und am Ende erscheinen dann 3 Objekte mit Zeitangabe zb 3 oder 4h. Jetzt habe ich zb bei den 1erManus eine Steigerung von 20 % und beginne mit dem Einsammeln........ was soll ich sagen, da kam nicht mehr raus als sonst..... was mache ich bitte falsch und wie bitte funktioniert das dann bei Turm und Turnier mit Truppen bei einer zeitlichen Begrenzung. Vielen Dank.[BR][BR]PS Ich werde auch aus den ganzen Videos und der Beschreibung nicht schlau, da geht es immer wieder darum was das Ding kann, man tun muss, aber im Endeffekt wie es sich umsetzt steht da nicht [smilie--sprite2]"}]