[{"28": "Moonlady70 schrieb:\t\t\tWen ich mir diese 4 ansehe, dann ist der von dir aus Sinya und der von LWennA ident, zumindest was die Zutaten betrifft die Diamanten kosten, bei den anderen 2 Screens ist die Diamanten-Verteilung aber eine andere.\t\tZum Vergrößern anklicken....Welche Zutaten Diamanten kosten und welche nicht ändert sich wöchentlich. Die Zauberin bringt auch jede Woche andere Zutaten (zufällige Auswahl) aus den Wäldern mit."}, {"113": "Moonlady70 schrieb:\t\t\tAls mein persönliches Fazit bleibt mir nur über, das INNO sich das Glücksspiel-Monopol mit aller Gewalt sichern will. Der Hexenkessel ist ja irgendwie schon ein Spiel im Spiel und meiner Meinung nach, auf Grund der vielen Zufallsgeschichten, ein nicht unbedingt notwendiges neues \"Feature\" das Elvenar in dieser Form gebrauchen kann, ist mit Sicherheit bei FoE besser aufgehoben.\t\tZum Vergrößern anklicken....Ich seh das so, dass der Kessel ein Bonbon ist, das du nehmen oder auch liegen lassen kannst. [BR]Gerade jetzt und für alle, die Kapitel 5 schon lange hinter sich gelassen haben, ist er definitiv nicht spielentscheidend. [BR]Wie das für Frischlinge aussieht, kann ich nicht beurteilen. [BR]Sich seine Booster selber zusammenbasteln zu können, hat was, das finde ich spaßig. Und mit dem Glücksfaktor, nuja, da wird es wenigstens nicht langweilig. [BR]Ich bin dann doch froh, dass der Hexenkessel hier in Elvenar gelandet ist, FoE mag ich nämlich nicht [smilie--sprite2]"}, {"134": "mir sind die nicht erforschten Truppenerweiterungen lieber als ein eventuell vielleicht Trank für ein paar Stunden. Anhand meiner niedrigen Truppengröße spare ich mehr Kosten pro Woche als so ein Trank für paar Stunden, da ich nicht 24/7 Elvenar spiele.[BR]Die Idee ist gut aber wahrscheinlich für Normalospieler nicht so prickelnd umgesetzt."}, {"68": "Thebigunknown schrieb:\t\t\tWelche Zutaten Diamanten kosten und welche nicht ändert sich wöchentlich. Die Zauberin bringt auch jede Woche andere Zutaten (zufällige Auswahl) aus den Wäldern mit.\t\tZum Vergrößern anklicken....[BR]OK, das hab ich mit Sicherheit irgendwo überlesen, Danke.[BR][BR]Steht irgendwo geschrieben wieviele verschiedene Zutaten es gibt, derzeit sind es ja 12 für die erste Woche?[BR][BR]Und wo ich gerade dabei bin, hier mal ein paar Screens auf Deutsch, Wiki freut sich[BR][BR][IMG]https://i.ibb.co/j6C6M9z/https-de-forum-elvenar-com-index-php-attachments-1673452351100-png-33384.png[/IMG][BR][BR][IMG]https://i.ibb.co/hHNQ0JG/https-de-forum-elvenar-com-index-php-attachments-1673452436187-png-33385.png[/IMG][BR][BR][IMG]https://i.ibb.co/JkT1xqc/https-de-forum-elvenar-com-index-php-attachments-1673452474791-png-33386.png[/IMG][BR][BR][IMG]https://i.ibb.co/vBCr1fc/https-de-forum-elvenar-com-index-php-attachments-1673452491491-png-33387.png[/IMG][BR][BR][IMG]https://i.ibb.co/rwyvf6L/https-de-forum-elvenar-com-index-php-attachments-1673452503522-png-33388.png[/IMG][BR][BR][IMG]https://i.ibb.co/Wn6ZdTz/https-de-forum-elvenar-com-index-php-attachments-1673452539849-png-33389.png[/IMG][BR][BR][IMG]https://i.ibb.co/HF6LNBR/https-de-forum-elvenar-com-index-php-attachments-1673452588992-png-33390.png[/IMG]"}, {"103": "es sind und bleiben immer diese 12 Zutaten"}, {"113": "Moonlady70 schrieb:\t\t\tSteht irgendwo geschrieben wieviele verschiedene Zutaten es gibt, derzeit sind es ja 12 für die erste Woche?\t\tZum Vergrößern anklicken....Ich könnte jetzt nicht beschwören, dass ich das genau so gelesen hätte, das ist nur meine Interpretation des Gelesenen:[BR][BR]Wir sehen im Braufenster alle Zutaten, die uns zum Brauen zur Verfügung stehen. Aus diesem Pool sammelt die Zauberin wöchentlich eine bestimmte Anzahl, das sind die Zutaten, für die wir Hexenpunkte ausgeben müssen. Was sie nicht gesammelt hat, kostet uns Diamanten, wollen wir es trotzdem verwenden. So, wie es aussieht, sammelt sie 8 Zutaten. welche das sind, ändert sich wöchentlich."}, {"2": "Moonlady70 schrieb:\t\t\tOb man so viel Rohstoffe auf Lager hat um sich 4,51 M Hexenpunkte zu erwirtschaften ist für mich sehr fraglich, kann aber funktionieren [smilie--sprite7]Zum Vergrößern anklicken.......das bringt dir auch nichts, denn zum Brauen kannst du nur die Hexenpunkte verwenden, die du automatisch bekommen hast - diese werden anhand deiner erledigten Forschungen berechnet - Zukaufen (gegen Ressourcen) kannst du dann erst in der Studienphase und da solltest du dann auch alle Hexenpunkte in die Weiterentwicklung investieren, denn alles was übrig bleibt, verfällt in der Nacht von Freitag auf Samstag - den ganzen Samstag über ist die Zauberin dann damit beschäftigt, neue Zutaten im Wald zu suchen und ab Sonntag kann man dann wieder einen neuen Trank brauen - aber nur mit den Hexenpunkten, die man aus dem Forschungsbaum bekommen hat...[BR][BR]...wie sich die Zutaten verteuern, wenn man weitere Zutaten in den Kessel wirft, habe ich in einem anderen Beitrag mit einer Tabelle gepostet...[BR][BR]...es gibt immer die gleichen 12 Zutaten - aber davon 4 nur für Diamanten - das wird jede Woche neu ausgewürfelt...[BR]vaas85 schrieb:\t\t\tmir sind die nicht erforschten Truppenerweiterungen lieber als ein eventuell vielleicht Trank für ein paar Stunden. Anhand meiner niedrigen Truppengröße spare ich mehr Kosten pro Woche als so ein Trank für paar Stunden, da ich nicht 24/7 Elvenar spiele.[BR]Die Idee ist gut aber wahrscheinlich für Normalospieler nicht so prickelnd umgesetzt.\t\tZum Vergrößern anklicken.......wieso? Was sparst du denn da? Die Kasernentruppgröße (also die erforschte) wirkt sich jetzt schon seit über 2 Jahren nicht mehr auf die Truppenberechnung bzw. die Verhandlungskosten in Turnier und Turm aus - dort wird die Truppgröße ganz anders berechnet - wichtig sind die ganzen einzelnen Einheiten deiner Armee - die werden dann einfach in Trupps mit anderer Größe verteilt - an der Gesamtzahl der Einheiten (nicht Trupps) ändert sich aber nichts - da geht nix verloren und da kannst du auch nichts sparen - im Gegenteil - eine höhere Kasernentruppgröße hat eine positive Wirkung auf truppenproduzierende Wunder und vor allem auch auf die Truppensegen, denn diese beziehen sich auf deine erforschte Truppgröße - also je höher die ist, desto mehr einzelne Einheiten geben Wunder und Segen ab..."}, {"32": "freundliche Errinerung ---[BR][IMG]https://i.ibb.co/FmDpDJc/https-de-forum-elvenar-com-index-php-attachments-1673454589109-png-33391.png[/IMG]"}, {"12": "Ich seh's als kleine Unterstützung für's Turnier, sowas wie der Dämmerungsphönix.[BR]Hab auch gleich mal einiges an Rohstoffen für Hexenpunkte ausgegeben und die 5 Kampf-Effekte auf Stufe 60 bzw. 71 gelevelt (die anderen Effekte interessieren mich nicht).[BR]Diese Woche war's zu spät (wer rechnet schon damit, daß man alle Kelche auf einmel leeren muß), mal schauen ob ich nächste Woche beim Turnier was davon merke. Monster-Moral wurde mir diesmal immerhin 2x angeboten."}, {"103": "Moonlady70 schrieb:\t\t\tOK, das hab ich mit Sicherheit irgendwo überlesen, Danke.[BR][BR]Steht irgendwo geschrieben wieviele verschiedene Zutaten es gibt, derzeit sind es ja 12 für die erste Woche?[BR][BR]Und wo ich gerade dabei bin, hier mal ein paar Screens auf Deutsch, Wiki freut sich[BR][BR]Anhang 33384 ansehen[BR][BR]Anhang 33385 ansehen[BR][BR]Anhang 33386 ansehen[BR][BR]Anhang 33387 ansehen[BR][BR]Anhang 33388 ansehen[BR][BR]Anhang 33389 ansehen[BR][BR]Anhang 33390 ansehenZum Vergrößern anklicken.... Danke Dir"}, {"272": "Ähm...sonst bin ich mit Kritik ja sparsam, aber der Kessel wirkt ersteinmal wie ein gigantischer...[BR]...Blödsinn. Tschuldigung, aber der Eindruck entsteht nun mal bei mir."}, {"103": "wenn Du erklären könntest, warum es Dir so geht, könnten wir etwas damit anfangen..."}, {"112": "nunja - mich springt auch so ein gefühl an wie @Redbeard1. man versucht zu einem festgelegten zeitpunkt tränke herzustellen, zu denen es kein rezept gibt, weil alles was das bewirken könnte zufall ist, muss dann sofort den trank mehrmals trinken, wobei wiederum zufall ist, ob die angestrebte zufällige wirkung überhaupt eintritt und hat dann die nächsten 6 tage gar nix mehr zu tun. wenn ein trank wirklich mal eine wirkung hat, verfällt die nach 2-5 stunden wieder. das ist ne lotterie, und zwar nicht gerade \"El Gordo\".[BR][BR]originalzuschrift innerhalb meiner GM: Ich hab das Forum u.das Wiki durchstöbert, aber 100% schlau  bin ich auch noch nicht. Das Spiel ist schon so umfangreicht, (hat auch einige tolle Features in der vergangenheit gegeben) aber noch was kompliziertes hätte es für mich nicht gebraucht. Denke den Hexenkessel werde ich erstmal links liegen lassen. Aber trotzdem Danke Pukka für die Erklärung.[BR][BR]davon hab ich noch mehrere bekommen. generelle meinung dazu: Da bin ich raus! Ist mir zuviel Aufwand zum Nutzen![BR]Aber Danke für die auisführliche Info."}, {"2": "Pukka schrieb:\t\t\tzu denen es kein rezept gibt, weil alles was das bewirken könnte zufall ist\t\tZum Vergrößern anklicken.......jein - die Auswirkung der verschiedenen Zutaten auf mögliche Effekte sind kein Zufall - es gibt durchaus Rezepte, die auch immer gleich bleiben, aber hier muss halt jeder für seine individuellen Wünsche ein eigenes passendes Rezept herausfinden - beim Mischen der Zutaten kannst du die Chancen erhöhen, einen gewünschten Effekt zu erhalten und dadurch, daß du dann bis zu 5x aus dem gleichen Trank trinken kannst, hast du eben wiederum mehr Chancen, den Wunscheffekt auch zu treffen (und zusätzlich noch bis zu 4 weitere Effekte)..."}, {"19": "Der Hexenkessel - ich finde den immer noch gut [BR][BR]Morgen startet das GA[BR][BR]Wie verwendet man den Hexenkessel ?[BR]Gerade bei einem GA ?[BR][BR]Man wartet natürlich bis das GA gestartet ist[BR]Man kann nun div. Zutaten – speziell für das GA – brauen[BR][BR]Den Münz-Effekt erhöhen[BR]Den Standard-Güter-Effekt erhöhen[BR]Den Truppen-Effekt erhöhen[BR][BR]Mehr Münzen - gut für den \"Sack voll Münzen“[BR]Mehr Güter – gut für den \"Armreif“[BR][BR]Stärkere Truppen – gut für das Turnier, Turm – man kann mehr machen[BR]Hier gibt es dann mehrere Abzeichen (Elementarmurmeln, Hexenhut, Druidenstab,Flaschengeist)[BR][BR]Egal welchen dieser Effekte man bekommt – jeder Effekt hat einen - erst mal kleinen - Vorteil[BR]Jetzt summieren wir das mal auf die komplette Gilde[BR][BR]Wieder eine Verbesserung im Spiel [smilie--sprite1]"}, {"103": "Moonlady70 schrieb:@Romilly[BR][BR]Erstmals danke für deine Antworten, damit wird mir eines noch klarer.[BR][BR]Deine Screens sind aber nicht alle aus einer Welt, oder verändern sich da die Kosten zwischen den Zutaten.[BR][BR]Ich hab aus einer DE Welt folgenden Screen bekommen, glaube ist Kapitel X[BR][BR]Anhang 33376 ansehen[BR][BR]Von dir hab ich folgende gesehen:[BR][BR]Anhang 33377 ansehen[BR]Anhang 33379 ansehen[BR][BR]von @LwennA gibts es diesen[BR][BR]Anhang 33378 ansehen[BR][BR]Wen ich mir diese 4 ansehe, dann ist der von dir aus Sinya und der von LWennA ident, zumindest was die Zutaten betrifft die Diamanten kosten, bei den anderen 2 Screens ist die Diamanten-Verteilung aber eine andere.[BR][BR]Bedeutet dies, das es da Unterschiede gibt[BR][BR]- zwischen Elfen/Menschen[BR]- eventuell unterschiedliche Kapitel[BR]- beides[BR][BR]ODER[BR][BR]ist das schon wieder so ein INNO-Glücksspiel mit Zufallsgenerator  [smilie--sprite9][BR][BR]Kosten von 4,51 M Hexenpunkte[BR][BR]Anhang 33380 ansehen[BR][BR]sowie 165.000 Zauberspruchfragmente[BR][BR]Anhang 33381 ansehen[BR][BR]bzw. 1000 Zauberspruchfragmente und 16.400 Diamanten[BR][BR]Anhang 33382 ansehen[BR][BR]für 50% Chance auf den kritischen Effekt stehen theoretisch ja auch fest.[BR][BR]Man kann ja auch Spenden um Hexenpunkte zu erhalten[BR][BR]Anhang 33383 ansehen[BR][BR]Ob man so viel Rohstoffe auf Lager hat um sich 4,51 M Hexenpunkte zu erwirtschaften ist für mich sehr fraglich, kann aber funktionieren [smilie--sprite7][BR][BR]Als mein persönliches Fazit bleibt mir nur über, das INNO sich das Glücksspiel-Monopol mit aller Gewalt sichern will. Der Hexenkessel ist ja irgendwie schon ein Spiel im Spiel und meiner Meinung nach, auf Grund der vielen Zufallsgeschichten, ein nicht unbedingt notwendiges neues \"Feature\" das Elvenar in dieser Form gebrauchen kann, ist mit Sicherheit bei FoE besser aufgehoben.[BR][BR]Lady\t\tZum Vergrößern anklicken.... zum letzten Absatz: man kann genau gar keine Hexenpunkte mit Ressourcen erkaufen, um sie beim Brauen zu verwenden..."}, {"2": "...vielleicht ein kleiner Tipp für alle, die momentan etwas überfordert sind - sucht euch einen Lieblingseffekt aus (ihr müsst natürlich auch genug Diplome haben) und werft dann nur was von diesen 4 Zutaten rein...[BR][IMG]https://i.ibb.co/wcy2L8y/https-de-forum-elvenar-com-index-php-attachments-zutaten5-png-33397.png[/IMG]....bei der Söldnerkraft (Kapitel XI) auch nur die üblichen Zahlen 3, 2, 1, 1 verwenden...[BR][BR]...und hofft dann darauf, daß einer der Kelche diesen Effekt dann auch auslöst - den Rest der Hexenpunkte könnt ihr dann in die Forschung geben und alles Weitere könnt ihr dann nach und nach, Woche für Woche in Ruhe ausprobieren..."}, {"112": "Romilly schrieb:\t\t\t...wie viele ja bestimmt schon festgestellt haben, bekommt man leider nicht die vollen % aus der Rezeptliste, sondern nur einen Bruchteil davon (und der kann auch noch unterschiedlich sein)...das betrifft auch die Dauer des Effektes...\t\tZum Vergrößern anklicken....genau das meinte ich - will sagen das stört mich am meisten. in meinem verständnis ist es so: zwiebeln, suppengrün, brühe, erbsen in den pott, abschmecken, wenn ICH hunger hab essen: satt. und zwar immer, und immer nach 2 kellen suppe. nicht -mal brauch ich eine kelle, mal 3 und mal muss ich hungrig aufstehen. ich nehme die selben zutaten und bekomme einen festgelegten effekt. und zwar wenn ich den brauche. nicht samstag früh um 1 oder so.[BR]Edit: noch ne frage: was bedeuten denn die verschiedenen zahlen überhaupt? muss ich da dann 3 reinwerfen wenn ne blaue 3 da steht? oder nehme ich vorzugsweise was mit 1 und die 3 zum schluss?"}, {"133": "Gibt es ein Grund, warum dieser Zugriff , nach dem trinken dem Nutzer nicht mehr angezeigt wird.[BR]Wenn die Kelche alle sind sind sie alle, man wartet auf die neue Runde, aber den Kessel nach dem brauen nicht mehr zu sehen und nur noch die Verbesserungen finde ich nicht gut umgesetzt. [BR][BR][IMG]https://i.ibb.co/h1wbdD7/https-de-forum-elvenar-com-index-php-attachments-kessel-4-jpg-33398.jpg[/IMG]"}, {"2": "zenka schrieb:\t\t\tGibt es ein Grund, warum dieser Zugriff , nach dem trinken dem Nutzer nicht mehr angezeigt wird.[BR]Wenn die Kelche alle sind sind sie alle, man wartet auf die neue Runde, aber den Kessel nach dem brauen nicht mehr zu sehen und nur noch die Verbesserungen finde ich nicht gut umgesetzt.[BR][BR]Anhang 33398 ansehenZum Vergrößern anklicken.......was willst du denn damit, wenn du nichts mehr brauen kannst?...ich würde es viel verwirrender finden, wenn der noch da wäre, man aber nichts mehr damit tun kann..."}]