[{"1": "Dear Humans and Elves,[BR][BR]Please use this thread to discuss the upcoming Autumn Zodiac 2022 Event.[BR][BR]We're looking forward to your feedback![BR][BR]Kind regards,[BR]Your Elvenar Team"}, {"56": "Thanks for posting well in advance.[BR][BR]Typo in the Announcement: You can check everything out in our Wiki for the Autumn Zodiak 2022 Event."}, {"56": "'Autumn Zodiac 2022' starts September 6th![BR]Read all about it here: https://tinyurl.com/p9cjc5kp[BR]This file can be opened on any PC without special programs; you are welcome to share the link with friends.[BR]Note that this version recorded in Beta server may be slightly different to the version that comes to the live worlds.[BR][BR]"}, {"1": "Jackluyt said:\t\t\tThanks for posting well in advance.[BR][BR]Typo in the Announcement: You can check everything out in our Wiki for the Autumn Zodiak 2022 Event.Click to expand...[BR]It's a radiKal Event,  [smilie--sprite6] , although that typo is addressed. Thanks for pointing it out, Jack!"}, {"15": "anonglitch said:\t\t\tIt's a radiKal Event,  [smilie--sprite6] , although that typo is addressed. Thanks for pointing it out, Jack!\t\tClick to expand...You seem to be  bit short on \"c\" in the announcement:  Raccoon should have a couple of them  [smilie--sprite1] [BR][BR].... including Evolution Artifacts for this year's new bear, the Witty Racoon:[BR]The Witty Racoon will provide you with population...[BR][BR]Otherwise looking forward to this event, love the Raccoon and love to see the 3 orbs system back [smilie--sprite8]"}, {"5": "@Hekata I do believe it's down to where you're from as to the spelling! From what i've read Raccoon is the American Spelling, and Racoon is the British Spelling! But even then there's confusion!! There is of course a compromise....[BR][BR]Witty Raccoon = Amusing Trash Panda[BR][BR][smilie--sprite8]"}, {"15": "Herodite said:@Hekata I do believe it's down to where you're from as to the spelling! From what i've read Raccoon is the American Spelling, and Racoon is the British Spelling! But even then there's confusion!! There is of course a compromise....[BR][BR]Witty Raccoon = Amusing Trash Panda[BR][BR][smilie--sprite8]Click to expand...Oh, ok, I din't know that, it's hard enough for us non-English speaking folks to remember one spelling let alone two and I was going by the event video where it has 2 cc. Not that it's important I was just teasing for fun [smilie--sprite8]"}, {"16": "Hekata said:\t\t\tOh, ok, I din't know that, it's hard enough for us non-English speaking folks to remember one spelling let alone two and I was going by the event video where it has 2 cc. Not that it's important I was just teasing for fun [smilie--sprite8]Click to expand...It's challenging for English speakers, I can only imagine what it must be like for non-English.[BR]I speak/write British English but my phone's auto correct is convinced I'm American and have no need for the letter \"u\" in words like armour [smilie--sprite8]"}, {"46": "Herodite said:\t\t\ti've read Raccoon is the American Spelling, and Racoon is the British Spelling! But even then there's confusion!!\t\tClick to expand...Speaking as a Brit who is near-obsessed with British English - not least as it relates to US English - 'racoon' (while some dictionaries do list it as an alternative spelling of 'raccoon'), is almost always considered [and certainly in UK educational settings] to be incorrect. I think the idiosyncratic spelling of the Witty Racoon Event Building may be a simple typo, not least because its name was changed early during the Event's Beta progress.[BR][BR]What seems agreed by all etymological dictionaries is that the word comes from the 17th Century Virginia Algonquian term ärähkun, from ärähkuněm - meaning 'he scratches with his hands' - so my choice on its spelling, academically, would be the variant more common in the US...?[BR][BR]Herodite said:\t\t\tThere is of course a compromise....  Witty Raccoon = Amusing Trash Panda\t\tClick to expand...Well, perhaps for US English exponents, since raccoons are native only to the Americas... [smilie--sprite2][BR][BR]In the UK we never see raccoons in the wild, so we have no concept of seeing them hanging around domestic buildings, and in addition, few of us would by preference use the noun 'trash', either - although we do use the adjective 'trashy', meaning 'low-quality, cheap, and/or overly showy'.[BR][BR]The most common UK experience of the noun-form 'trash' is in software, where the term 'Trash Can' still sometimes describes what is now more often called the 'Recycle Bin'. In Britain, 'trash' is called 'rubbish', and a 'trash can' is either a 'rubbish/recycling bin'* or, more usually, just a 'bin'. That said, the use of 'can' for the receptacle itself was once much more common, and while I grew up using only the term 'dustbin', my Gran would more commonly say 'ash can/bin'. Of course, this was many years before recycling became popular, and in a time when real fires were a common way to heat homes (so disposing of ash was familiar), with bins still being made of metal, like the home of Sesame Street's Oscar the Grouch.[BR][BR]To be even more pedantic - most Brits would never even associate a raccoon with a panda at all (I myself wondered how the term arose, so I looked it up and discovered that it's apparently because they both have at least somewhat similar black fur patterns around their eyes?) - so unfortunately, and all things considered, 'Trash Panda' might not be the best - or at least the most cosmopolitan/international - alternative term![BR][BR]* Linguistic Footnote : If anyone cares, the reason why many words and/or terms which have now become associated primarily with the US, such as trash [and garbage], sidewalk [UK = pavement], drapes [UK = curtains], pants [UK = trousers], Fall [UK = Autumn] and so on are so prevalent in the US but near-unused in the UK [these days] is in many cases not because the US terms are newly derived, but actually the reverse.[BR][BR]Those terms listed, and many more of course, were also in commonplace, even standard, usage in the UK - during [and/or before] Georgian times (mid-late 1700s). However, when the US seceded from the UK, with the consequent lack of much social interaction between the two nations for quite some time, many commonplace terms ceased to naturally evolve in the US, while in some cases they continued to evolve in the UK - so they ended up being preserved in the US while in the UK they were gradually replaced, over time, by the other terms we Brits now normally use instead.[BR][BR]There's also the strong patriotic influence of Noah Webster (of Webster's Dictionary fame) to consider, since he deliberately altered many British English spellings (and invented alternative words as well) - precisely in order to make them noticeably different from their British counterparts.[BR][BR]... and yes, droning on about linguistic niceties which nobody else cares about is one way in which I often pass my own [over-plentiful] time... [smilie--sprite8]"}, {"46": "Jake65 said:\t\t\tI speak/write British English but my phone's auto correct is convinced I'm American and have no need for the letter \"u\" in words like armour\t\tClick to expand...@Jake65 : The first thing I do before even starting to use any device which has Auto-Correct (or any software with spell-checking) is to download and/or enable the British English dictionary and disable the US English version, where that can be done... and where it can't, I just turn it all off instead... especially when it comes to my phone's often near-ludicrous suggestions, no matter which flavour of English one is attempting to speak![BR][BR]Oh, and that horrid thing called 'Grammarly' is evidently the work of an evil mastermind who's trying to turn us all into jargon-spouting clones [smilie--sprite8]"}, {"16": "@Laurelin in South Africa our spelling is British but our terms seem to be a bit mixed.[BR]We walk on UK pavements while wearing US pants [smilie--sprite1]"}, {"48": "I'm a big supporter of linguistic creativity. Maybe it's time for English to start being logical and make it easier for the majority of internet users that aren't from English speaking background! [smilie--sprite8]"}, {"16": "Kudos to the artists, I think the new loading screen is brilliant [smilie--sprite8]"}, {"50": "Jake65 said:\t\t\tKudos to the artists, I think the new loading screen is brilliant [smilie--sprite8]Click to expand...Yep. As usual [smilie--sprite1]"}, {"72": "@Jackluyt, [BR]Quest #53 is a bit different for me. Instead of Collect 8 relics:[BR][BR][IMG]https://i.ibb.co/Q8BPTHc/https-en-forum-elvenar-com-index-php-attachments-screenshot-from-2022-09-06-19-32-14-png-6573.png[/IMG]"}, {"56": "AutumnWolf said:@Jackluyt,[BR]Quest #53 is a bit different for me. Instead of Collect 8 relics:[BR][BR]View attachment 6573Click to expand...Which chapter is this?[BR]The earlier chapters sometimes get different quests.  Or they may have changed this one, after player feedback in Beta."}, {"50": "Jackluyt said:\t\t\tWhich chapter is this?[BR]The earlier chapters sometimes get different quests.  Or they may have changed this one, after player feedback in Beta.\t\tClick to expand...iDavis described this quest correctly. See https://idavis-elvenar.com/events.html#quests[BR]So I guess you recorded it incorrectly.[BR][BR]Important ? IMO not. We still have to do some provinces in the tournament. [BR]The information you give with your links is still valuable for me. Thanks for that [smilie--sprite1]"}, {"6": "So, just updated my Evolving Buildings thread for the Witty Raccoon.[BR][BR]Chapter 17, Level 10, he can provide 5,772 Seeds / 24 hours, and at 3x3, that's 26.72 Seeds/sq/h, or already better than twice the efficiency of the Ch 17 Tender Tag Team.[BR][BR]Am I correct in understanding that if you feed him, he provides 200% production for 55 hours?  So, if you feed him just before collecting, you can get the benefit for a total of 3 collections, 80.16 Seeds/sq/h (6.5x the efficiency of Ch17 Tender Tag Team), or a total of 51,948 Seeds over the three collections?"}, {"72": "Jackluyt said:\t\t\tWhich chapter is this?[BR]The earlier chapters sometimes get different quests.  Or they may have changed this one, after player feedback in Beta.\t\tClick to expand...End of Chapter IX. [BR][BR]I understand that things can be different between beta and live worlds. Just wanted to help by updating some info."}, {"20": "I have been wondering why they would choose a racoon where we previously had bear themes.  Would it not have been fitting to have another kind of bear?[BR][BR]Well, had to do a double take when I translated racoon to my language, in which it is “wasbeer”.  “Beer” means bear, so we have a bear, although perhaps not so obvious."}]