[{"12": "BlueBlou said:\t\t\tWell, had to do a double take when I translated racoon to my language, in which it is “wasbeer”. “Beer” means bear, so we have a bear, although perhaps not so obvious.\t\tClick to expand...So if your bear drinks beer, does that make your raccoon an alcoholic?  [smilie--sprite1][BR][BR]BTW, the quest tasks initially appear to be very reasonable and achievable. And the daily prizes seem to be suitable to a wide range of CALs and chapters."}, {"16": "BlueBlou said:\t\t\t“wasbeer”\t\tClick to expand...Translating back to English would be a \"wash bear\" [BR]So if your bear smells nice and clean it's probably a raccoon [smilie--sprite8]"}, {"6": "From Wikipedia:[BR][BR]One aspect of raccoon behavior is so well known that it gives the animal part of its scientific name, Procyon lotor; \"lotor\" is Latin for \"washer\". In the wild, raccoons often dabble for underwater food near the shore-line. They then often pick up the food item with their front paws to examine it and rub the item, sometimes to remove unwanted parts. This gives the appearance of the raccoon \"washing\" the food. The tactile sensitivity of raccoons' paws is increased if this rubbing action is performed underwater, since the water softens the hard layer covering the paws.[105][158] However, the behavior observed in captive raccoons in which they carry their food to water to \"wash\" or douse it before eating has not been observed in the wild.[159][160] Naturalist Georges-Louis Leclerc, Comte de Buffon, believed that raccoons do not have adequate saliva production to moisten food thereby necessitating dousing, but this hypothesis is now considered to be incorrect.[158][159][161][162] Captive raccoons douse their food more frequently when a watering hole with a layout similar to a stream is not farther away than 3 m (10 ft).[162] The widely accepted theory is that dousing in captive raccoons is a fixed action pattern from the dabbling behavior performed when foraging at shores for aquatic foods.[158][162][163][164] This is supported by the observation that aquatic foods are doused more frequently. Cleaning dirty food does not seem to be a reason for \"washing\".[162]"}, {"8": "What does feeding effect : 'Self Production Boost' 200% mean?"}, {"16": "OldHag said:\t\t\tWhat does feeding effect : 'Self Production Boost' 200% mean?\t\tClick to expand...It boosts it's own production when fed. [BR]I think 200% is the level 10 boost."}, {"8": "Jake65 said:\t\t\tIt boosts it's own production when fed.[BR]I think 200% is the level 10 boost.\t\tClick to expand...Thanks @Jake65 - I should have asked at the time, but how long does the feeding effect last for,"}, {"5": "It lasts for 55hrs @OldHag [smilie--sprite1]"}, {"4": "I have played and completed every event for the past 5 years \"Blind\" without using spoilers and always get there, the unknown is one of the things I love about the game, that may be just me but without knowing I still reach the locked quests recently about half way through events just by playing daily."}, {"16": "I've managed to (just) get my raccoon up to stage 10 with a day to spare.[BR]If anybody is unsure about it, it's worth evolving for the animation alone.[BR]My new favourite building to look at [smilie--sprite8]"}, {"48": "I didn't get very excited about this event. All I wanted was to get Day 1 prize that was only offered overnight in my time zone so that gives me only couple of hours to complete some quests to get a chance at it. I didn't want to put my hopes up to get it again with reroll. So I just completed quests as they came from normal play and reached daily quests around day 18 or so. I tried for my daily prize on the last day using reroll, the first five tries were swapping between two prizes I didn't want so I wasn't very happy. But at the end I did manage to get 10 daily prizes that I wanted and also 8 artifacts, just short of 9. Overall I got some dailies I wanted, so great. [smilie--sprite1]"}, {"16": "Silly Bubbles said:\t\t\tI didn't get very excited about this event. All I wanted was to get Day 1 prize that was only offered overnight in my time zone so that gives me only couple of hours to complete some quests to get a chance at it. I didn't want to put my hopes up to get it again with reroll. So I just completed quests as they came from normal play and reached daily quests around day 18 or so. I tried for my daily prize on the last day using reroll, the first five tries were swapping between two prizes I didn't want so I wasn't very happy. But at the end I did manage to get 10 daily prizes that I wanted and also 8 artifacts, just short of 9. Overall I got some dailies I wanted, so great. [smilie--sprite1]Click to expand...Hopefully the FA has raccoon artefacts as a reward then you can get your 9th."}, {"4": "I got artifact 9 with only hours to spare and thanks to the late daily reward, placed in my city at ch 20 fully evolved and fed it also, a little dissapointed at how long the feeding effect lasts, just time for 3 productions if fed just before collecting, it gives me 24k seeds, which is far less than one 3 hour trader production."}, {"6": "Not really a fair comparison, even after considering the 4:1 footprint differential.  Level 9 Trader is required;  Witty Raccoon is optional.  The better question is \"How does it compare on a /sq/h basis to other optional, um, options?\"  [BR][BR]Ch20S10 Witty Raccoon = 8,008 Seeds/24h/9sq = 37.07 seed/sq/h unfed, *3 = 111.22 seed/sq/h fed[BR][BR]Ch20 Tender Tag Team = 2,400 Seeds/24 hours/6 squares = 16.67 seed/sq/h[BR][BR]For you, unfed Witty Raccoon is 222% the efficiency of Tender Tag Team, fed 666%."}, {"4": "Ok, maths thank you, but still less than expected, as a feed lasts 54 hours, allowing a little wiggle room for 3 productions, but still pet food is not an easy resource to acquire.[BR][BR]Also you don't allow for the fact that the level 9 trader also has to switch regularly, to unurium production, or the bonus production collection. For Unurium my bonus is based on 1% of required culture, which currently for me is 971k so 9710, dont currently have the seeds bonus as that works differently, AW levels and scouted provinces if I remember correctly.[BR][BR]Another point unrelated: Also deep into ch 20 and requiring large amounts of Unurium my required culture has dropped by at least 20% due to teleporting out so I get less Unurium as a result."}, {"6": "I understand that.[BR][BR]But again, the Witty Raccoon is a supplement to the Trader, not a replacement.  You can't place the 'Coon instead of the Trader, the decision faced by the player is whether or not to place the 'Coon (or other buildings) in addition to the Trader.  If you don't wish to operate with additional Seed buildings, you don't have to.  But, if you do wish to operate with additional Seed buildings, unless I have missed another common or currently available special building, the Witty Raccoon, even unfed, is more than double the Seed production efficiency of the next best supplemental building, and thus should be a priority for.  I would love for this, or any building, to have even better specs.  I agree, it can't substitute for the Trader when that building is tasked otherwse; currently no building that I know of can.  But it is still the best second-best building there is.[BR][BR]I currently have the luxury to be operating with multiple Tender Tag Teams, Autumn Ponds and Festival Merchants, and will happily put the 'Coon in instead of some of that after the FA."}, {"4": "Just to add and thank you for your reply I know that, when you get to the huge demands of ch 20, my Trader production for seeds on the bonus is 32965 every 3 hours as a bonus + regular production, so 3x and a bit more the bonus every 3 hours for Unurium, Seeds bonus on Trader is not as clearly displayed, just stated Main Hall Level and AW levels in total, no math, then a figure, in my example MH 44 AW levels 694, seeds bonus available every 3 hours as said, 30536 so now you see my misunderstanding and the big discrepancies with the trader bonus productions when you have to switch between seeds and unurium."}, {"48": "The racoon is my 4th best seed producer per square (without pet food) after Trader, Triumph and Sunset Towers. Also can be switched to KPs when seeds and other production isn't needed so I'm happy. I don't think it's worth pet food though."}, {"6": "Thank you for mentioning the AWs, they had slipped my mind."}, {"4": "Just bumping this thread up the pecking order as someone replied earlier to the 2 year old one about the annual event of the same name [smilie--sprite12]"}]