[{"1": "Dear Humans and Elves,[BR][BR]Please use this thread to discuss the update to Chapter 20 - The Power of Music.[BR][BR]We're looking forward to your feedback![BR][BR]Kind regards,[BR]Your Elvenar Team"}, {"6": "Probably too late for you to add if you hadn't already, but...[BR][BR]With a Guest Race that is Music related, is there a new background music for the game?  Do the various buildings have interesting musical cues when production is collected or restarted?"}, {"5": "....and could it please be Rammstein  [smilie--sprite8]"}, {"16": "Herodite said:\t\t\t....and could it please be Rammstein  [smilie--sprite8]Click to expand...Now the profile pic makes sense [smilie--sprite8]"}, {"5": "Yeeeaaaahhh... little spoiler for my fiends here... I'm a bit of a Fangirl for German Metal  [smilie--sprite6][BR][BR]But i've a feeling that's a bit too heavy for our Beautiful Luania!!  [smilie--sprite8]"}, {"16": "Herodite said:\t\t\tYeeeaaaahhh... little spoiler for my fiends here... I'm a bit of a Fangirl for German Metal  [smilie--sprite6][BR][BR]But i've a feeling that's a bit too heavy for our Beautiful Luania!!  [smilie--sprite8]Click to expand...I have no doubt the Orcs would approve of it [smilie--sprite1]"}, {"1": "Jake65 said:\t\t\tI have no doubt the Orcs would approve of it [smilie--sprite1]Click to expand...For sure!!"}, {"17": "The Announcement is confusing.  It says launch is Tuesday August 31st.  So[BR]It is on Tuesday,  or on August 31st? @anonglitch"}, {"45": "It will be released as part of our update tomorrow @Lelanya, Tuesday 30th of August. The announcement has been amended to reflect the date correctly."}, {"6": "Oooh, ooh, ooh!!![BR][BR]Sound Effects for the Spire game!  Each resource has a different tone![BR][BR]Bonus-y Bonus chest when the pattern randomly matches the Close Encounters theme!"}, {"17": "Next question:[BR]We the EN server get this update on Tuesday.[BR]The INT server gets this update on Wednesday.[BR]The US server (and likely all the others) gets this update on Thursday.[BR]Who or what is the INT server?  Asking for a friend."}, {"6": "Ummmm......  we are, aren't we?  Plus, I think there is some confusion on the identification of servers, not having seen the source for your separate server release dates.[BR][BR]There is the us.elvenar server, the United States server, which operates in English.[BR]We, en.elvenar, are the UK/Europe server, which operates in English, also known as the English International server.[BR][BR](BTW, I just tried int.elvenar.com, and it redirected to one of the en.elvenar servers and recognized my one and only Elvenar account)"}, {"17": "Oh lol[BR]So we are getting Chapter 20 on Tuesday and on Wednesday.[BR]Nope,  huh uh, we are going with  INT representing  Invisible  Nation of  Tonga, that's it, that's all.[BR]By the way thanks for the reminder that screenshots are oh so necessary on this Forum."}, {"46": "Herodite said:\t\t\tBut i've a feeling that's a bit too heavy for our Beautiful Luania!!\t\tClick to expand...@Herodite : So I have to ask - who is Luania? A character from the new Chapter, or your current Avatar, or...?[BR][ETA : I've just noticed that my Signature is 3 x longer than this post! It says a lot about my usual Forum output that even my Sig. is overly wordy... [smilie--sprite8] ]"}, {"5": "@Laurelin Luania is the Sister of the Naughty Peregrim! And a bit of a Songstress!  [smilie--sprite8][BR][BR]Im not entirely sure if my little guy has an \"official\" name? Kinda looks like a Derek to me though!"}, {"4": "Looks challenging so far, I see lots of building rotation and size changes, I wonder how long this one will take."}, {"47": "Again a brilliantly set beginning of the chapter. Just like in Chapter 19, now everyone needs a commodity that is not available on the server: ingots. It would be OK if production was evenly distributed across the server and if hundreds of players didn't start the chapter at the same time. But this way, long weeks of frustration await us again."}, {"48": "Arnwald said:\t\t\tAgain a brilliantly set beginning of the chapter. Just like in Chapter 19, now everyone needs a commodity that is not available on the server: ingots. It would be OK if production was evenly distributed across the server and if hundreds of players didn't start the chapter at the same time. But this way, long weeks of frustration await us again.\t\tClick to expand...[BR]Maybe they want to give ingot players more incentive to progress faster so more of them enter the chapter and balance out the production shortage. And yes, the first research does not make it easy for scroll players like me at all."}, {"48": "@Lelanya I thought you're in Ch16 as per elvenstat or do you have another user name that is in Ch19 or even Ch20? I'm just curious as you seem to support a complaint about Ch20 goods distribution because the research distribution of ascended goods is spot on equal."}, {"2": "guys, how you manage that quest asking to have only 150% culture?[BR]I can't make it. I'm either at 100% or 185%. I don't even have displayed 150% as a possibility [smilie--sprite8] [smilie--sprite8][BR][BR][IMG]https://i.ibb.co/thCx3Q2/https-en-forum-elvenar-com-index-php-attachments-culture-percentage-en2-jpg-6568.jpg[/IMG][BR][BR]Edit: why such quest even exist and if must exist, why on earth isn't declinable???"}]