[{"6": "Or why isn't it \">= 150%\""}, {"16": "Alcaro said:\t\t\tguys, how you manage that quest asking to have only 150% culture?[BR]I can't make it. I'm either at 100% or 185%. I don't even have displayed 150% as a possibility [smilie--sprite8] [smilie--sprite8][BR][BR]View attachment 6568[BR][BR]Edit: why such quest even exist and if must exist, why on earth isn't declinable???\t\tClick to expand...Coming soon: Craft half a pet food [smilie--sprite8]"}, {"9": "Alcaro said:\t\t\tguys, how you manage that quest asking to have only 150% culture?[BR]I can't make it. I'm either at 100% or 185%. I don't even have displayed 150% as a possibility [smilie--sprite8] [smilie--sprite8][BR][BR]View attachment 6568[BR][BR]Edit: why such quest even exist and if must exist, why on earth isn't declinable???\t\tClick to expand...once your spell effects wear off then the 150% will show but yes, I agree, silly request.....I'm still trying to get through the 2 million mana lol"}, {"49": "For everyone complaining about the 150% culture thing... you do know that casting an EE spell on a building that's been NH'd adds 5%... right? At 100% 10 NH'd culture buildings with EE on gives you the required 150%"}, {"4": "How early is the 150% culture quest as I saw one mentioning 150% culture and passed it instantly with a culture of 225%, is there another where you need to lower culture to exactly 150%? That would concern me as the sun always shines in my city, so much more coins and supplies daily."}, {"46": "There is some discussion on the US Forum about a Ch.20 Quest asking the player to 'reach' 150% Culture Bonus - I'm assuming it's the same Quest, since I doubt there are two of them? - with some players stating that this can't be done even by reducing Culture below 150% and then increasing it again. There's some speculation that this Quest may be an accidental repeat of a very similar one which appears early in the game.[BR][BR]So far, the answer from the US Community Manager is : this appears to be [at least] some kind of technical error - don't delete/Teleport/add any buildings to alter Culture - contact Support asking for Quest auto-finish, if necessary (with screenshot/s demonstrating the problem)."}, {"5": "Lovely @Laurelin beat me to it!! The Team are aware of this one and they are currently working to get this fixed but in the meantime, if you do come across this particular Quest then please yes, reach out to the Support Team!  [smilie--sprite1] [BR][BR]Kind Regards[BR][BR]Herodite."}, {"1": "Let's play a small game:[BR][BR]Spot the differences, between these two different images [smilie--sprite1][BR][BR][IMG]https://i.ibb.co/DfjZCxw/https-en-forum-elvenar-com-index-php-attachments-spot-the-differences-png-6569.png[/IMG][BR][BR]This quest asks you to have a base culture of 150%, the same way as in the earlier chapters, and the image here also indicates that it is the third tier, therefore, asking you to get to this \"mostly sunny,\" versus the culture int his situation being \"mostly cloudy\"[BR][BR]So, this quest requires 150% WITHOUT Endowment![BR][BR]I hope it clarifies!  [smilie--sprite6][BR][BR]We will address the wording, which can lead to confusion though!"}, {"48": "anonglitch said:\t\t\tLet's play a small game:[BR][BR]Spot the differences, between these two different images [smilie--sprite1][BR][BR]This quest asks you to have a base culture of 150%, the same way as in the earlier chapters, and the image here also indicates that it is the third tier, therefore, asking you to get to this \"mostly sunny,\" versus the culture int his situation being \"mostly cloudy\"[BR][BR]So, this quest requires 150% WITHOUT Endowment![BR][BR]I hope it clarifies!  [smilie--sprite6][BR][BR]We will address the wording, which can lead to confusion though!\t\tClick to expand...[BR]Thank you for the explanation, it does make sense to me. The only problem is my current situation:[BR][BR][IMG]https://i.ibb.co/FbRwjRw/https-en-forum-elvenar-com-index-php-attachments-culture-png-6572.png[/IMG][BR][BR]So I need to add at least 230k culture (allowing for 100% boost when it's get polished). This means that I need minimum four available expansions to complete the quest.[BR]So did they mean for it to be that difficult? Do we still have the option to contact support to complete the quest for us when we reach 150% with endowment?"}, {"50": "Silly Bubbles said:\t\t\tThank you for the explanation, it does make sense to me. The only problem is my current situation:[BR][BR]View attachment 6572[BR][BR]So I need to add at least 230k culture (allowing for 100% boost when it's get polished). This means that I need minimum four available expansions to complete the quest.[BR]So did they mean for it to be that difficult? Do we still have the option to contact support to complete the quest for us when we reach 150% with endowment?\t\tClick to expand...First I'm not in chapter 20 yet (and will not be soon). Second I can't answer your questions, because they are directed at the mods.[BR]But I'm wondering why you think that adding culture is the only available option for you.[BR]Why not reducing the \"Required for current level\". Just put some big manu's temporary in your inventory and because that reduces pop requirements you can also store some residences there. That will reduce the required cultural level and make it easier to fulfill this quest.[BR]Of course you can combine it by filling the open space with additional cultural buildings.[BR][BR]Seems to me that will work faster than waiting for 4 expansions.[BR][BR]Of course I agree, that if support will help you that will even be faster. I only wonder if that's necessary."}, {"48": "AsterObelix said:\t\t\tFirst I'm not in chapter 20 yet (and will not be soon). Second I can't answer your questions, because they are directed at the mods.[BR]But I'm wondering why you think that adding culture is the only available option for you.[BR]Why not reducing the \"Required for current level\". Just put some big manu's temporary in your inventory and because that reduces pop requirements you can also store some residences there. That will reduce the required cultural level and make it easier to fulfill this quest.[BR]Of course you can combine it by filling the open space with additional cultural buildings.[BR][BR]Seems to me that will work faster than waiting for 4 expansions.[BR][BR]Of course I agree, that if support will help you that will even be faster. I only wonder if that's necessary.\t\tClick to expand...[BR]Thank you, all valid suggestions. Personally, I treasure my teleports so if I can avoid using them that'd be great and I'd use around 10 of them to do that. Also, I have a lot of \"useless\" culture buildings that I don't care about placing and selling. And yes, I will very likely do a combination of both.[BR]I should've reached the quest earlier to have an easy way out as some of the other players. [smilie--sprite8]"}, {"51": "I reached 150% and the quest did not complete.  I opened a ticket and basically got told I had to delete all old culture buildings and build new ones, but all my culture buildings are either chapter 19 or 20.  I also tried teleporting out buildings and replacing with new ones to reach 150% but still did not complete the quest.  No idea how I can complete it [smilie--sprite5][BR][BR][IMG]https://i.ibb.co/JxRYQwr/https-en-forum-elvenar-com-index-php-attachments-1662693708547-png-6574.png[/IMG]"}, {"4": "Seraphinia said:\t\t\tI reached 150% and the quest did not complete.  I opened a ticket and basically got told I had to delete all old culture buildings and build new ones, but all my culture buildings are either chapter 19 or 20.  I also tried teleporting out buildings and replacing with new ones to reach 150% but still did not complete the quest.  No idea how I can complete it [smilie--sprite5][BR][BR]View attachment 6574Click to expand...You need to get 150% culture bonus without the spell effect so in your case above that would be 175% so the sun shows \"mostly sunny\"."}, {"6": "That quest should really be reworded.  Ideally, it should dynamically reflect the current numeric value, 175% in the most recent above.[BR][BR]Unfortunately, the better choice is also slightly problematic, as the Wiki identifies this as \"Culture Bonus Level 2\" out of 4 Bonus levels, because the 100% base level out of 5 total levels is not counted, so many people will see the 2 and count to 2 of 5, not 2 of 4 skipping the first.[BR][BR]I realize that the Partly Cloudy icon identifies the level, but the disconnect between the words and the icon really doesn't help."}, {"52": "How to upgrade Harmony Grove to lvl 3? I build two of each music buildings, but it still shows that only one iš available - total accompaniment 2, available 1. How to make 2 available?"}, {"48": "oreav said:\t\t\tHow to upgrade Harmony Grove to lvl 3? I build two of each music buildings, but it still shows that only one iš available - total accompaniment 2, available 1. How to make 2 available?\t\tClick to expand...[BR]It works the same way as culture and population. You need to have 2 of each Ensembles available so three in total. One of each got used on Level 2 upgrade, so you need to still build 2 more of each Ensemble. Total 3 Ensembles of each to be able to upgrade to Level 3, total of 6 each to upgrade to Level 4.[BR][BR]And wow, you're fast! Congrats! [smilie--sprite1]"}, {"51": "m4rt1n said:\t\t\tYou need to get 150% culture bonus without the spell effect so in your case above that would be 175% so the sun shows \"mostly sunny\".\t\tClick to expand...I was actually on 175% and the quest didn't complete, so I used teleports to remove culture to get it down to 150% and still the quest did not complete, so I added culture buildings back in again to get to 175% and still the quest did not complete. I used 10 x teleports trying to get this to work but couldn't."}, {"9": "Seraphinia said:\t\t\tI was actually on 175% and the quest didn't complete, so I used teleports to remove culture to get it down to 150% and still the quest did not complete, so I added culture buildings back in again to get to 175% and still the quest did not complete. I used 10 x teleports trying to get this to work but couldn't.\t\tClick to expand...I would ask for my teleports back"}, {"48": "It looks like that even Support struggles to understand this quest. The way I understand it, we either ADD culture to reach 150% less Spell Effect if we're bellow 150% less Spell Effect or REMOVE culture if we're above 150% less Spell Effect and then add culture to \"reach\" 150% less Spell Effect.[BR]Or another way is to adjust culture needed by removing or adding buildings that require culture to \"reach\" 150% culture without Spell Effect.[BR]I'm not sure why would Support suggest to remove culture buildings when someone is bellow 150% less Spell Effect especially when they need 382k additional culture to reach 150% less Spell Effect. Replacing old culture building with new ones would not add that much culture, based on my calculations, it needs minimum additional 200k of culture and still hope that they get all polished to double it up enough to reach next level.[BR]That was hard work! [smilie--sprite8][BR]I suppose I'll see when I reach the quest, I won't be very happy when I'll waste my resources on something that doesn't work."}, {"4": "All I know is I passed the quest with a sun shining, the small one and a culture of 225% so cannot help more."}]