[{"48": "m4rt1n said:\t\t\tAll I know is I passed the quest with a sun shining, the small one and a culture of 225% so cannot help more.\t\tClick to expand...[BR]Very very interesting. This surely proves all the theories wrong."}, {"48": "I found some new information, it looks like that it's the AWs and NHs that confuse the calculation. So it's nearly impossible to know where our individual \"150%\" (that is meant by the quest) is.[BR][BR]So in this case, I would ask for my teleports back! [smilie--sprite8]"}, {"45": "To avoid any confusion please scroll back on this thread to September the 5th. Anonglitch posted a perfect visual of what the quest is asking you to achieve."}, {"4": "Silmaril said:\t\t\tTo avoid any confusion please scroll back on this thread to September the 5th. Anonglitch posted a perfect visual of what the quest is asking you to achieve.\t\tClick to expand...@Silmaril For info I passed the quest with a sun, not the full sun but the one between mostly sunny as shown by @anonglitch and bright sunshine, something obviously is not right with said quest."}, {"48": "@m4rt1n Maybe if our culture is anything above \"150%\" base culture it will work. That is, the culture icon has to be one of the highlighted ones:[BR][BR][IMG]https://i.ibb.co/MPLJMfq/https-en-forum-elvenar-com-index-php-attachments-culture-png-6579.png[/IMG][BR][BR]Anyways, I'll give it a go and see. In case it doesn't work, I'll ask for help."}, {"45": "Yes @m4rt1n that is exactly the sun visual we are aiming for [IMG]https://i.ibb.co/GM77qGv/https-en-forum-elvenar-com-index-php-attachments-1663113751678-png-6580.png[/IMG]"}, {"2": "sorry to contradict you @Silly Bubbles  and @Silmaril , but when I had that quest, my culture was almost at max (4th sun) and I teleported many big culture buildings to go down to the 1st sun - 100%, then I brought back tiny culture one by one, but no matter what I did, I was either at 100%, either at 185% and eventually I had to ask help from Support."}, {"53": "For me the quest worked exactly as expected (and completed when I got to the third of the five culture levels). The quest I received asked for the third culture tier (or words to that effect) and didn't mention 150%. Curiously since getting from the second to the third culture level is helped a-lot by Neighbourly Help, it is (I assume) possible for new NH given when a player if offline to complete the quest for them, and then the expiry of older NH to drop them back to the second culture tier (but with the quest completed) before they log in again.[BR][BR]I have mixed feelings about this quest. Depending on one's city build strategy, it can require a substantial rebuild. On the other hand, new chapters often require that anyway, and the quest does make culture relevant again (albeit briefly). I think that it is OK as a (very rare) chapter story quest. It isn't suitable to be an event quest though.[BR][BR]My situation regarding this quest was about as bad as it could be. I needed to add approximately 1.2 million culture to complete it."}, {"4": "Silmaril said:\t\t\tYes @m4rt1n that is exactly the sun visual we are aiming for View attachment 6580Click to expand...[BR]I had the one to the right of that one and passed the quest just as @Silly Bubbles displays, maybe it passes with that one or higher."}, {"48": "Far Reach said:\t\t\tFor me the quest worked exactly as expected (and completed when I got to the third of the five culture levels). The quest I received asked for the third culture tier (or words to that effect) and didn't mention 150%. Curiously since getting from the second to the third culture level is helped a-lot by Neighbourly Help, it is (I assume) possible for new NH given when a player if offline to complete the quest for them, and then the expiry of older NH to drop them back to the second culture tier (but with the quest completed) before they log in again.[BR][BR]I have mixed feelings about this quest. Depending on one's city build strategy, it can require a substantial rebuild. On the other hand, new chapters often require that anyway, and the quest does make culture relevant again (albeit briefly). I think that it is OK as a (very rare) chapter story quest. It isn't suitable to be an event quest though.[BR][BR]My situation regarding this quest was about as bad as it could be. I needed to add approximately 1.2 million culture to complete it.\t\tClick to expand...[BR]It seems that they might've recently fixed it. That would be great as there was a lot of resources wasted on this quest while it didn't get completed."}, {"37": "I teleported Armories until I had the required amount[BR]Good thing I had over 100 teleport spells[BR]also if anyone needs the questline for chapter XX[BR]\t\t\thttps://idavis-elvenar.com/\t\t"}, {"48": "Booff said:\t\t\tI teleported Armories until I had the required amount[BR]Good thing I had over 100 teleport spells[BR]also if anyone needs the questline for chapter XX[BR]\t\t\thttps://idavis-elvenar.com/\t\tClick to expand...[BR]I finally reached mine. It cost me one teleport and around 15 additional culture buildings that I sold. I had to sell my old population buildings that I would've sold anyway to make space for guest race buildings. It got completed as expected so that's great.[BR]Here's the updated quest:[BR][BR][IMG]https://i.ibb.co/0f91WSh/https-en-forum-elvenar-com-index-php-attachments-culture-quest-png-6585.png[/IMG]"}, {"6": "@Silmaril or other Admins, there is (still) a problem with wording of this quest.[BR][BR]I pointed out the confusing phrasing Elvenar has for Culture Bonus levels, and this posting shows that INNO has fallen into their own trap.[BR][BR][BR]From the Elvenar Wiki:[BR][BR]There are 4 basic levels of Culture Bonuses:[BR][BR][BR][BR]Level 1 will increase your production rate from the standard 100 % to 125 %. You should definitely try to get this.[BR][BR]Level 2 will increase it from 125 % to 150 % and it will worth your while to reach this Bonus level on your own.[BR][BR]Level 3 will increase it from 150 % to 160 %, this Bonus level is intended to be reachable through Neighborly Help.[BR][BR]Level 4 will increase it from 160 % to 170 %, only a steady flow of Neighborly Help will ensure you can get this Bonus without having to occupy too much space with Cultural Buildings.[BR][BR][BR][BR]There are five levels of Culture, but the first is Base Level, not a Culture Bonus Level.  Culture Bonus Level 3 is the third enhanced Culture Level, the 4th out of the 5 levels.  Culture Bonus Level 3 is noted with the smaller sun icon, not the mostly sunny icon."}, {"4": "@Sir Derf I would in this case suggest a wiki edit to rename the base level 1 and the full sun level 5[BR][BR]So is the requirement a small full sun of culture bonus level 3 as in the wiki as that is what I had when I passed the quest."}, {"4": "Following the storyline quests on this one, down to the final few tech, portal fully upgraded, and on to the first storyline quest now giving 100 diamonds, am I right to assume I can now get rid of the 18 Ensamble buildings or will the storyline quest trip me up. Passed the one to have 15 and the portal fully upgraded."}, {"48": "m4rt1n said:\t\t\tFollowing the storyline quests on this one, down to the final few tech, portal fully upgraded, and on to the first storyline quest now giving 100 diamonds, am I right to assume I can now get rid of the 18 Ensamble buildings or will the storyline quest trip me up. Passed the one to have 15 and the portal fully upgraded.\t\tClick to expand...[BR]You should be fine, here's the questline: https://idavis-elvenar.com/guestRaces/powerofmusic.html#quests"}, {"14": "[IMG]https://i.ibb.co/4ggd3Nf/https-en-forum-elvenar-com-index-php-attachments-1664968428006-png-6648.png[/IMG][BR]@Herodite @Silmaril @anonglitch[BR][BR]Uhm.... is it just me, or does this art look a little off to you as well? I mean.... is some artist angry at Inno and managed to sneak this one in?"}, {"7": "Killiak said:View attachment 6648[BR]@Herodite @Silmaril @anonglitch[BR][BR]Uhm.... is it just me, or does this art look a little off to you as well? I mean.... is some artist angry at Inno and managed to sneak this one in?\t\tClick to expand...How ballsy of them [smilie--sprite7]"}, {"1": "Killiak said:View attachment 6648[BR]@Herodite @Silmaril @anonglitch[BR][BR]Uhm.... is it just me, or does this art look a little off to you as well? I mean.... is some artist angry at Inno and managed to sneak this one in?\t\tClick to expand...[BR]It's an over-inflated brain!! (Have you been watching Little Nicky, @Killiak ? [smilie--sprite6]"}, {"48": "Killiak said:View attachment 6648[BR]@Herodite @Silmaril @anonglitch[BR][BR]Uhm.... is it just me, or does this art look a little off to you as well? I mean.... is some artist angry at Inno and managed to sneak this one in?\t\tClick to expand...C-Nymph said:\t\t\tHow ballsy of them [smilie--sprite7]Click to expand...[BR]It's an enlightened brain! [smilie--sprite8][smilie--sprite9][smilie--sprite10][smilie--sprite11][smilie--sprite12]"}]