[{"4": "My brain is now corrupted lol, all I can think of is the ball cock in my toilet cistern[BR][BR]Now back on the topic of ch20, challenging but a lot more fun and a lot less of a boring drudge than ch 19, especially the last 3rd and the ability to use time and pp boosters, yes the balance of seeds v unurium is tight in the latter stages of building all 18 required ensambles for the final portal upgrade, but then it is fairly straight forward, I see the end, just the 2 AW tech to complete and if you wish time boosters and pp spells can do that as if you have plenty of pp spells the ensambles are no longer needed."}, {"5": "Killiak said:View attachment 6648[BR]@Herodite @Silmaril @anonglitch[BR][BR]Uhm.... is it just me, or does this art look a little off to you as well? I mean.... is some artist angry at Inno and managed to sneak this one in?\t\tClick to expand...[BR]He looks rather pleased with himself i'll give him that! [smilie--sprite10]"}, {"2": "I don't understand why some quests are non-declinable.[BR]For example, there is one asking to have 12 Ensembles. If I have to build 18 anyway if I want to upgrade the Grove (and I have to, not much about wanting or not) why such a quest is non-declinable????[BR]For me this stupid quest came too late, I already had 18 Ensembles and upgraded the Grove to level 4 and of course, I sold them all. Now I find myself stuck in the story line quests because no way in hell I'm going to build all Ensembles again. I actually like to complete those quests and now I have to wait for ch.21 to decline the rest of them???? .... like 2023????"}, {"48": "Alcaro said:\t\t\tI don't understand why some quests are non-declinable.[BR]For example, there is one asking to have 12 Ensembles. If I have to build 18 anyway if I want to upgrade the Grove (and I have to, not much about wanting or not) why such a quest is non-declinable????[BR]For me this stupid quest came too late, I already had 18 Ensembles and upgraded the Grove to level 4 and of course, I sold them all. Now I find myself stuck in the story line quests because no way in hell I'm going to build all Ensembles again. I actually like to complete those quests and now I have to wait for ch.21 to decline the rest of them???? .... like 2023????\t\tClick to expand...[BR]I suppose they want to create a challenge wherever they can to make it more entertaining rather than too easy and boring. At least now, they become declinable when we enter next chapter. In the past, that wasn't the case."}, {"2": "A challenge was to get 18 Ensembles and even more challenging, to place them all around the portal. Giving a quest late in the story, it's not a challenge, it's simply annoying."}, {"48": "Alcaro said:\t\t\tGiving a quest late in the story, it's not a challenge, it's simply annoying.\t\tClick to expand...[BR]It's surely not first chapter they have done this. This is why I check the quests before I sell anything."}, {"4": "I completed the entire chapter today including the storyline quests, put it this way ch19 took me 9 months, this chapter around 9 weeks, also the highest quest asking for ensembles asks for 15, not the 18 as that quest is the portal upgrade, the highest quest for having makers is to have 3 of each, I had 4 of each as soon as I could build them. You need 18 ensembles to complete the chapter, storyline or not as that number is required for the final portal upgrade to be able to hold enough bars for the final 2 AW researches."}, {"2": "thinking more at that stupid quest, it could be replaced with \"have the Harmony Grove at level 3\""}, {"25": "I'm late to the party, but for next time, if you need to adjust culture amounts it's not necessary to teleport things or delete things.  Simply pull up a piece of road in front of something and it will act the same as removing it.  Then you can simply put the road back when you have the correct amount of culture.  It's what I did in an early chapter when we had basically the same silly quest.  I think that one was for 125% culture."}, {"2": "Maillie said:\t\t\tI'm late to the party, but for next time, if you need to adjust culture amounts it's not necessary to teleport things or delete things.  Simply pull up a piece of road in front of something and it will act the same as removing it.  Then you can simply put the road back when you have the correct amount of culture.  It's what I did in an early chapter when we had basically the same silly quest.  I think that one was for 125% culture.\t\tClick to expand...but cult. buildings do not require roads"}, {"6": "Everyone makes mistakes...[BR][BR]Culture Buildings don't require roads, and if they did, disconnecting (or teleporting or deleting) culture buildings wouldn't increase culture.[BR]But, if you disconnect (instead of teleporting or deleting) buildings that require culture, then the available culture would increase.[BR][BR]Voila."}, {"48": "Sir Derf said:\t\t\tEveryone makes mistakes...\t\tClick to expand...[BR]Yep, the earlier we back out and laugh it off, the less people notice. [smilie--sprite8]"}, {"48": "I like the challenge of this chapter, it needs a different strategy again so that's quite inventive. I don't have many PPs and I use time instants on other things so it will keep me entertained for quite a bit. [smilie--sprite1]"}, {"2": "Silly Bubbles said:\t\t\tI like the challenge of this chapter, it needs a different strategy again so that's quite inventive. I don't have many PPs and I use time instants on other things so it will keep me entertained for quite a bit. [smilie--sprite1]Click to expand...After two really hard chapters, I expected a chapter which will take over 6 months to be completed. Just today I chatted with a fellow and realized that it took me only 1.5 month to finish it. The announcement was made in August 29th and until October 29th are 2 more weeks. Also, from what I noticed, other players, who pushed the production, they've finished weeks ago."}, {"54": "Alcaro said:\t\t\tAfter two really hard chapters, I expected a chapter which will take over 6 months to be completed. Just today I chatted with a fellow and realized that it took me only 1.5 month to finish it. The announcement was made in August 29th and until October 29th are 2 more weeks. Also, from what I noticed, other players, who pushed the production, they've finished weeks ago.\t\tClick to expand...yes indeed, its a very fast chapter, the only problem is, its a very long wait now till new chapter, even longer for those who pushed production. I fear many of those won't even make it to the new chapter and will have quit by then because of nothing meaningfull to do."}, {"48": "I suppose it all depends on how we rush through the chapter. There was a talk that this might be the last chapter (hopefully not) so I'm taking my time and not investing resources that are better used somewhere else."}, {"2": "Heymrdiedier said:\t\t\tyes indeed, its a very fast chapter, the only problem is, its a very long wait now till new chapter, even longer for those who pushed production. I fear many of those won't even make it to the new chapter and will have quit by then because of nothing meaningfull to do.\t\tClick to expand...I like the chapter breaks, it gives me time to place genies and goddesses, to upgrade whatever it's possible, to enjoy the events (which otherwise I find them disruptive), to rearrange the buildings. I was never bored, I am never bored in a holiday, cause this way I see these periods between chapters.[BR][BR]Silly Bubbles said:\t\t\tI suppose it all depends on how we rush through the chapter. There was a talk that this might be the last chapter (hopefully not) so I'm taking my time and not investing resources that are better used somewhere else.\t\tClick to expand...I didn't rush at all, didn't waste resources of any kind, I just played the way I always do - very methodical.[BR][BR]About being the last chapter, well we don't know that. IMO if something will come after ch.20, for sure will have a different pattern, probably no new guest races, no new goods (we used all 9 types of manufactories). We can only wait and hope that the game doesn't end here."}, {"6": "Looking at my various lists of Ancient Wonders, we currently have Wonders that :[BR]improve PP, EE and MM Duration and Effectsimprove Standard, Sentient (x2) and Ascended Goods Boostdecrease Sentient and Ascended Goods, Mana, Seeds and Unurium DecaysIncrease Training Speed in 3/3 Military Buildingsincrease damage from 5/5 Military typesproduce5/5 types of Barracks Troops2/5 Training Ground Troops2/5 Mercenary Camp TroopsThe completionist in me sees an opening for 6 more Ancient Wonders, 3 more Chapters."}, {"12": "Heymrdiedier said:\t\t\tnothing meaningfull to do.\t\tClick to expand...Depends on POV IMO.   [smilie--sprite1] [BR][BR]Perhaps it could also depend on the nature of one's Fellowship, and what interactions and adventures one can create and discover."}, {"12": "Sir Derf said:\t\t\tThe completionist in me sees an opening for 6 more Ancient Wonders, 3 more Chapters.\t\tClick to expand...The Furian in me hopes you will succeed.  [smilie--sprite1]"}]