[{"48": "Alcaro said:\t\t\tI didn't rush at all, didn't waste resources of any kind, I just played the way I always do - very methodical.\t\tClick to expand...[BR]I'd love to have your resources then. [smilie--sprite1][BR][BR]Just a question, shouldn't it be then easy to complete the quest asking for 15 ensembles?"}, {"2": "rebuilding ensembles - now that would be a huge waste of orcs, seeds and unurium/ ascended goods. Building them for the first time was a requirement, now it's just a waste. I remember that I used almost a million orcs and over two millions seeds. I'm not going to do that again. Once was enough."}, {"48": "Alcaro said:\t\t\tI remember that I used almost a million orcs and over two millions seeds. I'm not going to do that again. Once was enough.\t\tClick to expand...[BR]Yes, that's what I thought, a lot of resources. So back to taking my time with it. [smilie--sprite1]"}, {"45": "We are happy to confirm that Chapter 21 is already being developed. So I am not sure where the idea that Chapter 20 was the last for Elvenar has arrived from? We usually are planning several years ahead for any changes in the game as a fyi, so plenty more wonderfulness yet to unfold [smilie--sprite1]"}, {"48": "Silmaril said:\t\t\tSo I am not sure where the idea that Chapter 20 was the last for Elvenar has arrived from?\t\tClick to expand...[BR]Just some people's theories and some people's wishful wishing. And someone's worries too. Anyways, great news! [smilie--sprite1]"}, {"4": "Again only building \"or not building\" 15 ensambles for the quest, you need 18 ensambles built at some point all together to do the final portal upgrade, without which you cannot complete the last two tech of the chapter. I see it every chapter, the trick is to be brutal, teleport out a lot to fit it in then just put it back. [smilie--sprite1]"}, {"55": "My portal stayed at level 2 for a long time and I kept making ensembles and storing them in inventory until I had a total of 18. [BR]I used up a lot of portal profits.[BR]Then I stored some factories for room to maneuver, brought out the ensembles and things moved fairly quickly after that.[BR]One thing I noticed, ensembles don't have to be connected to the same types of ensembles, so anyway you fit them together is fine.[BR]I didn't sell off anything until I had the 'sell portal' quest completed, and then instrument factories and ensembles were all sold off."}, {"11": "Does anybody know if there’s a list of chapter 20 quests anywhere pls?  I’ve completed the research but I’m stuck on the quest for 4 workshops (which I’ll never achieve) and i presume the quests will only be declinable when/if a new chapter appears.  Obviously don’t want to delete anything and regret it later!"}, {"9": "@Susie49 you can find the complete list here on i davis https://idavis-elvenar.com/guestRaces/powerofmusic.html#quests"}, {"11": "kimkimkim said:@Susie49 you can find the complete list here on i davis https://idavis-elvenar.com/guestRaces/powerofmusic.html#questsClick to expand...Thanks [smilie--sprite1]"}]