[{"1": "Zapraszam do dyskusji."}, {"17": "zobaczymy co to jest , zapowiada się ciekawie"}, {"39": "Filmik nakręcony z taką szybkością, że co kilka sekund wyrywa się \"ale, że co?\", \"ale jak\", \"zaraz, zaraz, jak to się stało?\".[BR]Jak ktoś widział jakiś poradnik z bety, taki dla wolno-myślących, krok-po-kroku, to byłbym wdzięczny za link.[BR][BR]A może ktoś już widział przepisy na konkretne eliksiry, np. ulepszenie produkcji many, albo większy porost włosów, żeby choć trochę odzyskać, te wypadły, żeby zrozumieć te nowe zależności..."}, {"28": "\t\t\thttps://cavalieridellozombiaco.blogspot.com/p/the-cauldron-il-calderone.html\t\twloska strona ale mozna wlaczyc tlumacza calkiem sensownie opisane"}, {"17": "dzięki Rajstlin[smilie--sprite1] , własnie sobie poczytałam i już wrzuciłam ją do ulubionych Elvenar , podałam ją tez w Bractwie"}, {"2": "Kociołek jest już dostępny, trzeba tylko zrobić badanie w 5 rozdziale [smilie--sprite1][BR][BR]"}, {"42": "Skoro  wchodzi z nowa  funkcja  to dobrze by było ja cała przetłumaczyć na język polski [smilie--sprite1]"}, {"31": "U mnie na apce opis zaklęć jest po angielsku tylko nazwy raczono przetłumaczyć,dodatkowo po wrzuceniu kilku składników i wyjściu z zakładki i ponownym wejściu wszystko się zeruje,czy tak ma być?"}, {"6": "Efekty mikstur nieprzetłumaczone [smilie--sprite2]"}, {"17": "Koval92 napisał:\t\t\tEfekty mikstur nieprzetłumaczone [smilie--sprite2]Kliknij aby rozwinąć...no własnie i ja nic nie rozumiem , ni znam angielskiego i co teraz no !!!!"}, {"3": "No dobrze, porozgryzajmy.[BR]Na razie udało się ustalić mniej więcej tyle (na bazie XX rozdziału, potem porównam czy podobnie wygląda to w poprzednich):[BR]Każdy efekt występuje maksymalnie (a bardziej precyzyjnie - dokładnie) 4 xSiła efektu (przynajmniej na początku) jest stała, czyli np. wzrost produkcji dla manufaktur wynosi 40% (przynajmniej u mnie) niezależnie od składnika czy manufaktury.Czasy trwania też są chyba stałe dla określonych typów efektów, ale tego jeszcze nie sprawdziłem dokładnie.W XX rozdziale nie ma jeszcze wzmocnienia manufaktur wzniesionych 3 typu, nie ma też wzmocnienia życia dla koszar.Prawdopodobieństwa sumują sie do 20% (+/- 0,1) dla każdego składnika, przy czym różne składniki mają różna ilość efektów (u mnie od 5 do 8). Im więcej efektów daje dany składnik, tym mniejsze jednostkowe prawdopodobieństwo każdego z nich.Przy dodawaniu większej ilości tego samego składnika prawdopodobieństwo wystąpienia danego efektu wzrasta, ale nie liniowo. Roboczą hipotezę mam taką, że zwiększenie ilości składnika podbija prawdopodobieństwo sumaryczne, a poszczególne prawdopodobieństwa efektów są dystrybuowane proporcjonalnie - do potwierdzenia, czy tak rzeczywiście jest.W przypadku mieszania składników, jest jeszcze ciekawiej, bo np. dodanie drugiego składnika potrafi zwiększyć lub zmniejszyć prawdopodobieństwo efektów, które w tym składniku nie występują (czyli jeśli do składnika dającego np. wzrost produkcji portalowej dodamy inny, który nie ma takiego efektu, to prawdopodobieństwo dla produkcji portalowej też wzrośnie). Jeśli teza z poprzedniego punktu się potwierdzi, to może okazać się, że tutaj działa to podobnie (rośnie sumaryczne prawdopodobieństwo i jest rozkładane proporcjonalnie na wszystkie efekty w zależności od ich udziału w mocy \"ogólnej\")Jeśli tezy z dwóch ostatnich punktów się potwierdzą, to dość proste powinno być zrobienie kalkulatora, który będzie pozwalał obliczyć, jaki dobór składników będzie najbardziej optymalny dla jakiego efektu.[BR]Trzeba tylko pamiętać, że taki kalkulator dla każdego gracza będzie trochę inny, bo w zależności od rozwoju miasta każdy ma dostęp do nieco innego zestawu efektów oraz ich bazowego prawdopodobieństwa"}, {"43": "Ja dodam:[BR]wszystkie pucharki są wypite duszkiem i każdy może dać efekt (różne) lub nieTo mnie trochę zdziwiło bo sądziłem ze będzie okazja na zmianę przepisu lub podrasowanie go miedzy kielonkami"}, {"11": "BlossomValvi napisał:\t\t\tJa dodam:[BR]wszystkie pucharki są wypite duszkiem i każdy może dać efekt (różne) lub nieTo mnie trochę zdziwiło bo sądziłem ze będzie okazja na zmianę przepisu lub podrasowanie go miedzy kielonkami\t\tKliknij aby rozwinąć...Mnie też to zdziwiło i straciłam kielonki:/"}, {"3": "Czyli jak klikniesz wypij, to zużywa wszystkie kieliszki na raz, niezależnie czy się uwarzyło do nich receptury czy nie? [BR]Albo inaczej - jeśli uwarzę jedną recepturę i będę chciał ją wypić, to zużyję wszystkie kieliszki?[BR][BR]To teraz z moich badań:[BR]Wygląda na to, że teza o tym, że w przypadku dodania składnika kilka razy działa to tak, że podnosi się prawdopodobieństwo ogólne, a potem rozkłada proporcjonalnie zgodnie z \"bazowymi\" proporcjami, jest prawdziwa - jak dodamy składnik 2x to suma prawdopodobieństw wzrasta z 20 do 28,3% a poszczególne prawdopodobieństwa rozkładają sie z tymi samymi proporcjami jak było przy 20%. Przy 12 składnikach prawdopodobieństwo ogólne wzrasta do 69,3% i znowu rozkład składników jest zgodny z proporcjami jakie były dla podstawowych 20% - drobne różnice (chyba) wynikają z zaokrągleń (wynoszą w granicach 0,04 między tym co widzę w kociołku a co wynika mi z przeliczeń).[BR][BR]Natomiast przy mieszaniu składników jest niestety nieco więcej zabawy: Przede wszystkim, jak zmieszamy np. dwa składniki, to ilość efektów nie będzie ich sumą, ale zostanie \"obcięta\" do maksymalnie 8. (czyli jak dwa składniki teoretycznie po połączeniu dały by 10 efektów, to w rzeczywistości dadzą tylko 8) Na początku myślałem, że odrzucane będą te o najniższym prawdopodobieństwie, ale tak nie jest - musi być jakaś hierarhia ważności, np. wydaje się, że unuryt jest wycinany w jednej z pierwszych kolejności.[BR]Im więcej składników tym lista całkowita efektów się bardziej rozszerza - przy 12 składnikach mam już u siebie w palecie mikstury 20 efektów, czyli wszystkie jakie są u mnie dostępne. Nie odgrywa natomiast roli ilość danego składnika - jeśli zmieszam dwa, to mogę ich dać dowolną ilość, a nadal będę miał tylko 8 efektów do dyspozycji.[BR]Natomiast jest pewna zmyłka jeśli chodzi o prawdopodobieństwo po zmieszaniu wszystkich składników - nijak się to ma do wartości teoretycznych. Z szacunku z logiką tą samą jak dla zwiększania ilości jednego składnika, z prawdopodobieństw wynikałoby około 3-3,8%, na składnik, z największym prawdopodobieństwem na ziarna (4%). [BR]Tymczasem w kociołku mam wszystkie prawdopodobieństwa na poziomie 3,4%, plus Orki z prawdopodobieństwem 4,20%.[BR]Przypuszczam, że jakąś rolę odgrywa tu miejsce na liście w ramach określonego składnika, ale nie jestem pewien."}, {"2": "Miksturę warzy się raz w danym tygodniu. Po kliknięciu \"Uwarz\" wypija się po kolei ze wszystkich dostępnych pucharków. Efekty aktywują się od razu, dlatego warzymy wtedy, gdy będziemy mogli najlepiej wykorzystać ewentualne efekty.[BR]Warzenie dziś nie ma za wiele sensu, bo nasze efekty są na razie na 1 poziomie, więc po uwarzeniu i tak będą to homeopatyczne ilości [smilie--sprite2][BR]Lepiej sobie pooglądać, uwarzyć cokolwiek po taniości, a punkty wiedźmy przeznaczyć na podniesienie efektów w kolejnym etapie.[BR][BR]Taki przykład z warzenia u mnie na becie:[BR][BR]SpoilerMój efekt Siły z Terenów był już podniesiony na 55 poziom. A więc w warzeniu szłam w ten efekt.[BR]Widać ile jakich składników użyłam i ile dodałam Fragmentów Zaklęć.[BR]Miałam tylko 7 dyplomów, więc nie za wiele efektów w składnikach, co akurat działało na plus.[BR][BR][BR][BR]Pierwszy pucharek - trafiłam oczekiwany efekt [smilie--sprite1][BR][BR][BR]W drugim pucharku nie było nic[BR][BR]Trzeci pucharek - efekt krytyczny [smilie--sprite1] młotki[BR][BR][BR]Czwarty pucharek - znów efekt krytyczny i mój oczekiwany efekt drugi raz! Niestety takie same efekty się nie sumują. Mogłam zdecydować, czy zostawię poprzedni, czy wezmę nowy. Oczywiście wzięłam nowy [smilie--sprite8][BR][BR][BR]Piąty pucharek - coś tam na surkę[BR][BR][BR]Ostatecznie miałam aktywne 3 efekty, ten na młotki, na surkę i oczywiście ten militarny [smilie--sprite1] [BR]Jak się już wypije wszystkie pucharki, mamy dostęp do kolejnej fazy, gdzie możemy ulepszyć nasze ulubione efekty [smilie--sprite1][BR][BR][BR][BR]Punkty wiedźmowe, które nam zostały po warzeniu możemy teraz wykorzystać do ulepszenia efektów. Możemy też dokupić punkty wiedźmy za surkę i inne dobra.[BR][BR]"}, {"39": "Nusion, jak zwykle konkret, dzięki.[BR]Dodam, że zaskoczyło mnie picie eliksirów. Myślałem, że jak mam 5 kufelków, to mi się coś połączy; wszak wypicie 5 browców, to lepszy efekt, niż wypicie jednego. Ale, nie. Parafrazując, mogłem sobie wybrać, czy chcę być tak samo nawalony, czy tylko odrobinę bardziej. Pytanie tak zaskakujące, że zanim się zorientowałem o co kaman, to już mi się klikło, na to 'stary ale jary'. Niby wszystko napisane...[BR]Druga rzecz, to wydaje mi się, że nie można wypić sobie potem, robisz, zbierasz i pijesz. Ale jest poniedziałek, a Ty wzmocnienia stawiasz w piątek rano, więc ta militarna pomoc do tego czasu przeminie.[BR]//[BR]Ovocko napisał:\t\t\tjeśli uwarzę jedną recepturę i będę chciał ją wypić, to zużyję wszystkie kieliszki?\t\tKliknij aby rozwinąć...Dokładnie tak.[BR][BR]połączono//Urdur"}, {"2": "stapa11 napisał:\t\t\tDruga rzecz, to wydaje mi się, że nie można wypić sobie potem, robisz, zbierasz i pijesz. Ale jest poniedziałek, a Ty wzmocnienia stawiasz w piątek rano, więc ta militarna pomoc do tego czasu przeminie.\t\tKliknij aby rozwinąć...Tak jest jak mówisz, nie można wypić potem. Warzysz, wypijasz i efekt od razu jest aktywny. Dlatego warzymy wtedy, gdy chcemy aktywować efekt. Mamy na to czas do piątku do północy, wtedy wiedźma idzie po nowe składniki i wraca w sobotę o północy [smilie--sprite1] I znów możemy warzyć[BR]A screeny są nie z dziś, tylko sprzed jakoś 2 tygodni i warzyłam gdy były potrzebne [smilie--sprite1]"}, {"11": "Straciłam kielonki, ale przynajmniej podniosłam już Koszarowy do 15%, bo jak działa mikstura, to dopiero wtedy można podnosić efekty na lepsze poziomy. Skupiam się tylko na 1 miksturze, bo jak dam składników na 3, to może wyjdzie a może nie, więc jak zrobię poziomy na wszystkie 3 budynki wojskowe, to się okaże, że zadziała tylko 1 albo góra 2 :/ losowość…"}, {"2": "Charlene napisał:\t\t\tjak działa mikstura, to dopiero wtedy można podnosić efekty na lepsze poziomy\t\tKliknij aby rozwinąć...Do etapu ulepszania przechodzimy po wypiciu mikstury, ale efekt nie musi działać/być aktywny. Etap ulepszania jest dostępny aż do piątku do 24:00, nawet jak mikstura/efekt już nie działa."}, {"43": "Takie pytanie czy efekty danego składnika są losowe co tydzień czy zostaja na stałe?[BR][BR]Jeśli są stałe to mam zamiar zainwestować w poziomy danych efektów z jednego składnika [smilie--sprite2]"}]