[{"2": "BlossomValvi napisał:\t\t\tTakie pytanie czy efekty danego składnika są losowe co tydzień czy zostaja na stałe?\t\tKliknij aby rozwinąć...Efekty danego składnika są zawsze takie same. Tzn. wartości zależą oczywiście od poziomu, na jakim mamy ulepszone nasze efekty (w 2 etapie).[BR]Natomiast przy dokładnie tych samych składnikach może nam się z pucharka trafić efekt o różnych wartościach, albo nie trafić wcale, bo przy warzeniu wchodzi losowość."}, {"11": "Nusion napisał:\t\t\tDo etapu ulepszania przechodzimy po wypiciu mikstury, ale efekt nie musi działać/być aktywny. Etap ulepszania jest dostępny aż do piątku do 24:00, nawet jak mikstura/efekt już nie działa.\t\tKliknij aby rozwinąć...Nie zrozumiałaś mnie. Etap ulepszania jest po wykorzystaniu kielonków i jakaś mikstura zadziała i dopiero wtedy można badać te ulepszenia."}, {"27": "Nusion napisał:\t\t\tPunkty wiedźmowe, które nam zostały po warzeniu możemy teraz wykorzystać do ulepszenia efektów. Możemy też dokupić punkty wiedźmy za surkę i inne dobra.\t\tKliknij aby rozwinąć...Wraz z kupowaniem punktów wiedźmowych zmieniają się proporcje ich nabywania. Czy po jakimś czasie (a jak tak to jakim) możliwość kupowania jest resetowana (czyli za 10 czegoś otrzymujemy 1 pkt), czy działa to już stale (jak np. kupowanie PW za monety/ towary)?"}, {"2": "djmags14 napisał:\t\t\tWraz z kupowaniem punktów wiedźmowych zmieniają się proporcje ich nabywania. Czy po jakimś czasie (a jak tak to jakim) możliwość kupowania jest resetowana (czyli za 10 czegoś otrzymujemy 1 pkt), czy działa to już stale (jak np. kupowanie PW za monety/ towary)?\t\tKliknij aby rozwinąć...Nie, koszty nie są resetowane niestety, działa to tak jak przy kupowaniu PW za monety."}, {"44": "Dorzuce swoje 3 gosze na temat Kociolka.[BR]Zazwyczaj pisze jak najbardziej merytorycznie i pomagam innym graczom zrozumiec zawilosci jakichs mechanizmow gry, ale tym razem sobie daruje [smilie--sprite1] Nawet nie dlatego, ze mi sie nie chce, po prostu uwazam, ze akurat Kociolek w obecnej formie jest czyms, o czym nie warto sie za dlugo rozwodzic i rozpisywac, wiec dokladne rozkminki i opis roznych mozliwych strategii pozostawie innym.[BR]Razem z @Nusion przygladalismy sie Kociolkowi na becie i testowalismy go przez kilka tygodni. Tu pierwsze kilka slow krytyki - pod kreska Kociolek nie jest wprawdzie niczym skomplikowanym, ale na pierwszy rzut oka taki sie wlasnie wydaje. Przynajmniej na poczatku obsluga Kociolka jest mocno nieintuicyjna i uwazam to za duzy minus.[BR]Przejde moze od razu do wnioskow koncowych, zeby sie za dlugo nie rozwodzic. Moim zdaniem Kociolek w obecnej formie nie jest zadnym game changerem. Tzn. obojetnie jaka przyjmiemy strategie, obojetnie jakie efekty ulepszymy i w jakim stopniu, obojetnie jak bedziemy postepowac przy skladaniu mikstur, efekt koncowy bedzie natury raczej kosmetycznej. Nie chce byc zle zrozumiany, bo na przyklad pewnie, ze jesli dzieki odpowiedniej strategii uda sie odpowiednio przygotowac, a potem trafic dany efekt, to fajnie jest miec chocby na kilka godzin na przyklad kilkanascie czy nawet kilkadziesiat % bonusu do podstawy ataku jednostek z danego budynku szkoleniowego. Tyle, ze pod kreska w skali gry nie bedzie to mialo prawie zadnego znaczenia. Jako przyklad podalem efekt wojskowy, ale moim zdaniem w jeszcze wiekszym stopniu dotyczy to efektow ekonomicznych. Dodatkowe kilkanascie czy kilkadziesiat % raz na tydzien do produkcji surowcow, mlotkow, monet czy innych dobr, nie bedzie pod kreska grac zadnej roli. W moim przypadku ulepszylem sobie efekty wojskowe i czasem ich nawet uzywalem w trakcie  robienia turnieju czy Iglicy, ale jesli akurat zdarzylo mi sie zapomniec o Kociolku, to ani razu nie mialem poczucia, ze naprawde cos mnie ominelo... Nie wiem, mozliwe, ze jesli juz sie przyzwyczaje do regularnego uzywania Kociolka, to uznam go za wazny element gry, na zasadzie \"ziarnko do ziarnka\", ale jak na razie dominuje u mnie poczucie lekkiego rozczarowania.[BR][BR]Tragedii oczywiscie nie ma, bo jednak jest to cos nowego, nawet w miare ciekawego i jesli ktos bedzie uzywal Kociolka z glowa, tzn. najpierw wszystko przemysli i ulepszy tylko wybrane receptury, zamiast ulepszac wszystko na hurra, to Kociolek ma szanse stac sie pomocny w codziennej grze, ale nawet wtedy raczej nie spodziewalbym sie, ze kiedykolwiek stanie sie chocby w czesci tak przydatny, jak np. Tworzenie. Moim zdaniem jest tylko jeden sensowny sposob uzywania Kociolka, tzn. wybieramy gora kilka efektow (w moim przypadku byly to 3 efekty militarne) i tylko je ulepszamy, ale wtedy na wysoki poziom. Jesli ktos sprobuje uzywac Kociolka z nieulepszonymi efektami lub jesli bedzie ulepszal wiele efektow, ale na niskie poziomy, to zyski z takich efektow beda wrecz sladowe, wiec to nie ma sensu. Przed tym ulepszaniem wszystkiego na hurra (o co latwo w fazie zapoznawania sie z Kociolkiem) stanowczo przestrzegam, bo koszt zakupu dodatkowych Punktow Czarownicy, potrzebnych an ulepszanie efektow, sie nie resetuje, wiec jesli ulepszymy jakis niepotrzeny efekt, to tych punktow zabraknie nam pozniej na porzadne ulepszenie tych wybranych, najbardziej przydatnych efektow."}, {"2": "Ja jeszcze dorzucę tu moją tabelkę z dyplomami. Dyplomów warto mieć dokładnie tyle, ile nam potrzeba, nie mniej i nie więcej.[BR]Jeśli interesują nas efekty militarne, to warto mieć dokładnie 17 dyplomów i póki co nie starać się o kolejne. 17 dlatego, że przy 17 dyplomie odblokowujemy póki co ostatni efekt militarny, kolejny będzie dopiero w 22 rozdziale. A dlaczego nie więcej niż 17? Bo każdy kolejny dyplom daje nam dostęp do kolejnych \"niechcianych\" efektów. Czyli w naszych składnikach do warzenia pojawią się kolejne możliwości. A tego nie chcemy! Czym mniej \"niechcianych\" efektów będzie w naszych składnikach, tym mniej nam te efekty \"zaśmiecą\" nasze mikstury i tym większa szansa na nasz \"chciany\" efekt.[BR]To się też tyczy graczy w niższych rozdziałach. Jeśli ktoś jeszcze nie dotarł do 17 rozdziału, to warto mieć tylko 11 dyplomów, dla tych poniżej 11 rozdziału - tylko 7 dyplomów.[BR]To wszystko powyższe dotyczy graczy wybierających wyłącznie efekty militarne w kociołku.[BR]Co do efektów innych niż militarne to już każdy musi sobie sam rozkminić ile dyplomów mu potrzeba.[BR][BR][BR]Nusion napisał:\t\t\tTrochę spolszczyłam tabelkę z miksturami od Karvesta.[BR]Dyplomy dostajemy za ukończenie wszystkich badań w rozdziale.[BR]Konkretna mikstura nie jest przypisana do konkretnego rozdziału, a zależy od ilości dyplomów.[BR]Ja mam na becie odblokowanych 6 pierwszych mikstur, chociaż moje dyplomy nie pochodzą z 6 pierwszych rozdziałów.[BR][BR]DyplomyNazwaEfekt1Magical Tax Increasemonety2Supply Surplus Spellmłotki3General's Mayhemsiła jednostek z koszar4Trader's Basic PleaT15Trader's Refined PleaT26Trader's Precious PleaT37Monsters' Mayhemsiła jednostek z terenów treningowych8Gift of the High Menprodukcja portalowa9Horde Uprisingorki10Enar's Boonmana11Mercenaries' Mayhemsiła jednostek z obozu najemników12Harvest Moonziarna13Trader's Basic PrayerT414Trader's Refined PrayerT515Trader's Precious PrayerT616Monsters' Morale Boostżycie jednostek z terenów treningowych17Mercenaries' Morale Boostżycie jednostek z obozu najemników18Unur's Resurgenceunuryt19Trader's Basic BlessingT720Trader's Refined BlessingT821Trader's Precious BlessingT922General's Morale Boostżycie jednostek z koszar[BR]źródłoKliknij aby rozwinąć..."}, {"15": "Nusion napisał:\t\t\tDlatego warzymy wtedy, gdy chcemy aktywować efekt. Mamy na to czas do piątku do północy, wtedy wiedźma idzie po nowe składniki i wraca w sobotę o północy [smilie--sprite1] I znów możemy warzyć[BR]A screeny są nie z dziś, tylko sprzed jakoś 2 tygodni i warzyłam gdy były potrzebne [smilie--sprite1]Kliknij aby rozwinąć...A czy ta wiedźma nie mogłaby sobie zbierać składników w niedzielę? W sobotę ludzie grający 2 turki na 1 wzmocnieniach klepią turniej i akurat wtedy kociołka nie można sobie odpalić? Znowu inno miesza pod siebie żeby nam strategię rozwalić? Brawo helmuty....."}, {"4": "Czyli stworzyli kichę żeby tylko czymś nas zająć ?"}, {"11": "Dla mnie Kocioł jest nie warty zachodu i twierdziłam tak od początku, jak już był na becie. Jedynie uszczupliłam swoje zapasy wojska o średnio 200-300 oddziałów, bo dorobiłam powiększenia i na jednostkach z terenów kończę imprezę. Kiepski biznes- jestem zła, bo muszę to dorobić na przyśpieszaczach a liczyłam na jakieś wow z tego Kociołka, więc uzupełniłam. Trzeba ładować kosmiczne ilości surowców, żeby coś to dało a na dodatek jest losowość. Jak dzisiaj użyłam tych kielonków, to 2 razy trafiłam na wzmocnienie wojska, przy czym nie mogły się zsumować, tylko dostałam zapytanie który zostawiam- jeden z nich miał mniejszy% a drugi większy, wybrałam większy i tylko on został. Weź tu człowieku jeszcze szukaj odpowiedniej receptury... a jak znajdziesz to jest haczyk, bo wg ogłoszenia jest rotacja ,,ceny\" składników, czyli to co jest teraz za diamenty, to może być za tydzień za wiedźmowe punkty i odwrotnie, więc jak ktoś ma konkretną recepturę, to się może okazać, że będzie musiał sypnąć diamentami. Jak dodawałam składniki, to nie były to pojedyncze ilości, tylko szło tego dużo więcej, nie mówiąc o fragmentach, których akurat nie mam jakoś dużo, bo idą na receptury w Tworzeniu. Efekty ekonomiczne też są mizerne, bo wraz z kolejnymi rozdziałami/cudami następuje stopniowy przyrost i nagle przestajemy mieć z czymś problem ( gracze mocno ogarnięci w podstawach gry).[BR]Ja się nie bawię w ten Kociołek."}, {"27": "Czyli tak bardziej ogólnie ujmując cała istota kociołka sprowadza się do efektu kolejnego cudu. Może nawet wybitnego, ale bardziej nieobliczalnego (przez kolejny element losowości). Jak do tego dodamy możliwość (czytaj dostępność, a bardziej konieczność) użycia diamentów to robi się już brzydko.[BR][BR]Osobiście mnie najbardziej irytuje wykorzystywanie czegoś (czyli kupowanie punktów wróżek) w stałym efekcie. Nawet jak ten koszt wynosi 10 monet za 1 punkt to jest czymś stałym i ma wpływ (nawet jeśli tylko śladowy) na dalszą grę. W eventach najbardziej irytują mnie zadania: 1) kup PW, 2) przeprowadź zwiad prowincji, 3) wygraj lub negocjuj w ? walkach na mapie, 4) ukończ prowincje. Czy są one trudniejsze od innych zadań? Zazwyczaj nie, ale jak są jedyne dostępne (bez innych możliwości) to mają wpływ na dalszą grę. I właśnie kociołek to następne pole do popisu w tej materii.[BR][BR]Tylko z tego powodu kociołek jest czymś, co nie kręci. Jak do tego dodamy brak czasu na przetłumaczenie tekstu i nieprofesjonalny opis ( pseudofilmik) to robi się tak jak zawsze w reformach IG. Kijowo. Nic nie urywa."}, {"3": "djmags14 napisał:\t\t\tJak do tego dodamy możliwość (czytaj dostępność, a bardziej konieczność) użycia diamentów to robi się już brzydko.\t\tKliknij aby rozwinąć...[BR]Nie jestem pewien, czy rzeczywiście jest taka konieczność. Każdy efekt jest obecny dokładnie 4 razy (czytaj: w czterech różnych składnikach), więc nawet jeśli któregoś zabraknie, będzie go można osiągnąć (a raczej próbować osiągnąć, bo mamy losowość przecież) innym zestawem składników. Po prostu nie będzie jednego \"jedynie słusznego\" zestawu warzenia, który można by sobie co tydzień warzyć, choć myślę, że da się stworzyć pakiet \"receptur standardowych\" dających porównywalne efekty dzięki różnym zestawom składników.[BR][BR]Strategicznie będzie też pewnie lepiej ulepszać kilka składników dających pożądany efekt/y niż tylko jeden, wtedy nawet jak któregoś zabraknie, będzie można sięgnąć po alternatywę.[BR][BR]Poniżej tabelka z procentowymi prawdopodobieństwami jakie miałem \"na starcie\", XX rozdział, odblokowane wszystkie dyplomy.[BR][BR]SkładnikKoszary (Ż)Koszary (S)Obóz (ż)Obóz (S)Tereny (Ż)Tereny (S)T1 (P)T2 (P)T3 (P)S1 (P)S2 (P)S3 (P)A1 (P)A2 (P)A3 (P)Monety (P)Zasoby (P)Mana (P)Ziarna (P)Un (P)Orki (P)Portal (P)Ognisty zarodnik1,4%​1,4%​4,3%​1,4%​1,4%​2,9%​4,3%​2,9%​Żukorzech1,8%​1,8%​5,5%​3,6%​1,8%​5,5%​Muszla Many5,5%​3,6%​3,6%​1,8%​1,8%​1,8%​1,8%​Latający Irys3,3%​5,0%​1,7%​1,7%​3,3%​5,0%​Jajo Meduzy1,7%​1,7%​1,7%​5,0%​1,7%​5,0%​3,3%​Lima Gąsiennicowa2,0%​4,0%​6,0%​4,0%​2,0%​2,0%​Kwiat Psianki4,6%​3,1%​1,5%​3,1%​4,6%​1,5%​1,5%​Szydercze Jęzory5,0%​1,7%​3,3%​1,7%​1,7%​5,0%​1,7%​Okopędy1,5%​1,5%​1,5%​4,6%​3,1%​3,1%​4,6%​Liść gorzkowłosa4,0%​2,0%​2,0%​6,0%​2,0%​4,0%​Pączek bawełniaka4,3%​2,9%​1,4%​2,9%​1,4%​4,3%​1,4%​1,4%​Trufla uszata2,5%​5,0%​2,5%​7,5%​2,5%​Total count0​4​4​4​4​4​4​4​4​4​4​4​4​4​0​4​4​4​4​4​4​4​[BR]Legenda:[BR](S) - Siła (atak)[BR](Ż) - Życie[BR](P) - produkcja"}, {"8": "Czy te zwiększenia efektów są czasowe? Po kilka godzin?"}, {"11": "blazius1 napisał:\t\t\tCzy te zwiększenia efektów są czasowe? Po kilka godzin?\t\tKliknij aby rozwinąć...Oczywiście że czasowe, jak je rozwijasz to masz wydłużony czas. Ja dla 56 poziomu zwiększenia sił Koszarowych mam 07:36h- co poziom zwiększa się o 6 minut. Te od manufaktur zaczynają się od 05:00h i każdy poziom wydłuża o 15 minut."}, {"4": "Kilkoro ludzi już pisało o braku tłumaczeń w recepturach w kociołku - coś się w tej sprawie ruszy , czy to my mamy się uczyć nowych języków , bo nie widzę nawet reakcji na wskazany problem"}, {"25": "chyba trzeba ang. solidnie podszlifowac na potrzeby gry [smilie--sprite8]"}, {"17": "Seviper napisał:\t\t\tchyba trzeba ang. solidnie podszlifowac na potrzeby gry [smilie--sprite8]Kliknij aby rozwinąć...hahaha , Jarg działaj ,niech jak najszybciej przetłumaczą ,ja już za wiekowa jestem ,żeby kolejny język studiować no !!!!"}, {"4": "@miriella  masz rację - jest nas jednak spora grupa , co chyba zbyt stary pesel ma a dodatkowo to chyba jest polska wersja językowa a nie anglojęzyczna[BR]@jarq  , albo @Urdur  możecie popchnąć sprawę niedopatrzenia w tłumaczeniu receptur ?[BR]Bo podobno podczas podnoszenia poziomów receptur wszystko jest przetłumaczone"}, {"1": "Działamy działamy, zostało to już zgłoszone i pracują nad tym."}, {"9": "@jarq  Czy mamy wpływ które z efektów beda Aktywne w danym tygodniu Kociołka? ( bo mam 20 dyplomow(Rozdział20) a max aktywnych Efektów to 10. Wolał bym sobie wybrac potrzebne mi Efekty a nie First in First out"}, {"9": "@Ovocko Dzieki za Tabelkę z +. Z bety jednak wynika że jak sa \"+\" to i sa \"-\". Tzn 4 składniki ISTOTNIE wzmacniają ci dany EFEKT. 4 inne Istotnie go Osłabiają! Pozostałe 8 minimalnie wpływaja + lub - na dany Efekt.[BR]Aby mieć sensowna szanse na wylosowanie czegokolwiek! należy użyć 16 lvl składników ( czyli najlepiej i najtaniej 4skladniki x4lvl - to moja opinia) to daje 80% szans na wylosowanie któregoś z Efektów.[BR]Najlepiej tak dobierać składniki aby 3-4 efekty miały równe (>10%) szans na wylosowanie, bo duplikaty nie sa potrzebne a mamy 10 aktywnych slotów Efektów ( czyli dopiero gdzieś za 4tyg będziemy mieli sensowne wzmocnienia)[BR][BR]Pierwsze warzenie jak najtaniej przeklikajcie bo 1lvl do niczego sie nie przyda. Ja osobiście w fazie nauki podniosłem wszystkie 20 efektów do 50lvl a wybrane( u mnie 5 Wojskowych ) do 70lvl i 2 do 89lvl. Pozostałe istotne to dla mnie Orki( zbrojownie z Piramida), Ziarna, Unurit(Wieza pieczeci + rezydki) i młotki. ( sprawdze czy działą na Mane z Opactwa)[BR][BR]Co do kosztów nauki to na 20 dyplomach ( to ma znaczenie w kosztach towarów - ja zaczynałem od np 10 marmurków za punkt Wiedzmy, teraz mam np 1M marmuru za 5161 pkt wiedzmy jeśli chodzi o zakup)[BR][BR]Koszty podnoszenia leveli ( przyrost miedzy lvl o chyba 10% wiecej)[BR]50lvl->51lvl to 10,7K pkt wiedzmy[BR]55lvl->56lvl to 17,2 pkt wiedzmy[BR]70lvl->71lvl to 71,8K pkt wiedzmy[BR]89lvl->90lvl to 440K pkt wiedzmy[BR][BR]UWAZAJCIE z KLIKANIEM towarów za pkty wiedzmy, mi np poleciało 10M orków przy klikaniu do kosztu 500k orków, 1M kosztu towarów  to ubytek chyba 30M Towarów![BR][BR]Efekty ulepszeń - wynika ze opłaca sie kosztów proporcjonalnie wszystko równo zwiększać[BR]Towary 50lvl 138% 17:30h[BR]Towary 55lvl  148% 18:30h[BR]Wojsko 70lvl 17,8% (atak) 8,9%(zycie) 8:54h[BR]Wojsko 89lvl 21,6% (atak) 10,8%(zycie) 10:48h"}]