[{"1": "skuter napisał:@jarq  Czy mamy wpływ które z efektów beda Aktywne w danym tygodniu Kociołka? ( bo mam 20 dyplomow(Rozdział20) a max aktywnych Efektów to 10. Wolał bym sobie wybrac potrzebne mi Efekty a nie First in First out\t\tKliknij aby rozwinąć...\t\t\thttps://pl.wiki.elvenar.com/index.php?title=Kocio%C5%82#Kocio.C5.82\t\tTo jakie będą efekty zależy od składników które wybierzesz i ich ilości."}, {"9": "@jarq Ale ja pytam o to[BR]\"W momencie wypicia mikstury ustalane jest, który efekt zostaje aktywowany. Jednocześnie można mieć 10 aktywnych efektów.\"[BR]Z jednego wazenia mam obecnie max 5 efektów na tydzien, te max 10 to rozumiem te ktore zostały z poprzednich tygodni?[BR]I pytam o ich kolejnosc ( jesli jest ponad 10 a bedzi obecnia max 20 - bede je mogl wybrac? czy sa ukladane po czasie czy w jakis inny sposob?)"}, {"4": "@jarq  dzięki za reakcję jak i za zgłoszenie [smilie--sprite1][BR]A tak poza tym , to całkiem ładna ta czarodziejka zawitała , przynajmniej do mnie  [smilie--sprite1]"}, {"6": "Jaki jest maksymalny poziom ulepszenia efektów? 100?"}, {"45": "@skuter, te efekty są czasowe, na stronie kociołka odlicza czas za ile zgasną. Mając możliwość dodania max 5 efektów na tydzień nie przekroczysz tych 10 możliwych... (chyba że jakiś efekt by miał trwać 7+ dni, no ale chyba nie ma takiego ;D)"}, {"46": "czy dyplomy dostaje się tylko za zrobienie na full danego rozdziału drzewka wiedzy  ? Mam pozostawione badania powiększenia oddziału, a teraz kocioł zmusza mnie do ich robienia. Jest gdzieś spis wszystkich umiejętności jakie są podłączone do kotła ?? Ja widzę tylko 7 przez moje \"braki w wykształceniu\"."}, {"2": "Acca napisał:\t\t\tczy dyplomy dostaje się tylko za zrobienie na full danego rozdziału drzewka wiedzy  ? Mam pozostawione badania powiększenia oddziału, a teraz kocioł zmusza mnie do ich robienia. Jest gdzieś spis wszystkich umiejętności jakie są podłączone do kotła ?? Ja widzę tylko 7 przez moje \"braki w wykształceniu\".\t\tKliknij aby rozwinąć...Dyplom dostajesz za zrobienie wszystkich badań w drzewku w danym rozdziale, również tych nieobowiązkowych.[BR]Badania powiększenia oddziału nie mają już od dawna żadnego negatywnego wpływu na turnieje czy Iglicę, więc można je bez obaw zrobić.[BR][BR]Tu masz rozpiskę, co odblokujesz za kolejne dyplomy[BR]\t\t\thttps://pl.forum.elvenar.com/index.php?posts/77760/\t\t"}, {"47": "Efekty Mikstur​[BR]Rozdział​Ikonka​Nazwa​Opis Efektu​BONUS​Przyrost[BR]% Bonusu​Czas trwania efektu​Przyrost[BR]czasu​Max. BONUS​Max. czas trwania efektu​1 poziom[BR] [%]​[%/poziom]​1 poziom[BR] [h]​[h/poziom]​100 poziom [%]​100 poziom [BR] [h]​V​Magiczny wzrost podatkówZwiększa wszystkie produkcje Monet10.0%+0.5%5:00h+0:15h59.5%29:45hV​Zaklęcie nadwyżki zasobówZwiększa wszystkie produkcje Zasobów10.0%+0.5%5:00h+0:15h59.5%29:45hV​Chaos generałaZwiększa siłę wszystkich jednostek z Koszar4.0%+0.2%2:00h+0:06h23.8%11:54hV​Podstawowa prośba kupcaZwiększa wszystkie produkcje zwykłych Towarów podstawowych40.0%[BR]bonusowych[BR](5.0%)[BR]niebonusowych+2.0%[BR](+0.25%)5:00h+0:15h238.0%[BR](29.75%)29:45hV​Wyrafinowana prośba kupcaZwiększa wszystkie produkcje zwykłych Towarów wyrafinowanych40.0%[BR](5.0%)+2.0%[BR](+0.25%)5:00h+0:15h238.0%[BR](29.75%)29:45hVI​Drogocenna prośba kupcaZwiększa wszystkie produkcje zwykłych Towarów drogocennych40.0%[BR](5.0%)+2.0%[BR](+0.25%)5:00h+0:15h238.0%[BR](29.75%)29:45hVII​Chaos potworówZwiększa siłę wszystkich jednostek z Terenów treningowych4.0%+0.2%2:00h+0:06h23.8%11:54hVIII​Dar Wysokich LudziZwiększa wszystkie produkcje surowców Osady Rasy gościnnej4.0%+0.2%3:00h+0:09h23.8%17:51hIX​Powstanie hordyZwiększa wszystkie produkcje Orków10.0%+0.5%5:00h+0:15h59.5%29:45hX​Łaska EnaraZwiększa wszystkie produkcje Many10.0%+0.5%5:00h+0:15h59.5%29:45hXI​Chaos najemnikówZwiększa siłę wszystkich jednostek z Obozu najemników4.0%+0.2%2:00h+0:06h23.8%11:54hXII​Księżyc żniwiarzyZwiększa wszystkie produkcje Boskich ziaren10.0%+0.5%5:00h+0:15h59.5%29:45hXIII​Podstawowa modlitwa kupcaZwiększa wszystkie produkcje żywych Towarów podstawowych40.0%[BR](5.0%)+2.0%[BR](+0.25%)5:00h+0:15h238.0%[BR](29.75%)29:45hXIV​Wyrafinowana modlitwa kupcaZwiększa wszystkie produkcje żywych Towarów wyrafinowanych40.0%[BR](5.0%)+2.0%[BR](+0.25%)5:00h+0:15h238.0%[BR](29.75%)29:45hXV​Drogocenna modlitwa kupcaZwiększa wszystkie produkcje żywych Towarów drogocennych40.0%[BR](5.0%)+2.0%[BR](+0.25%)5:00h+0:15h238.0%[BR](29.75%)29:45hXVI​Premia do morale potworówZwiększa zdrowie wszystkich jednostek z Terenów treningowych2.0%+0.1%2:00h+0:06h11.9%11:54hXVII​Premia do morale najemnikówZwiększa zdrowie wszystkich jednostek z Obozu najemników2.0%+0.1%2:00h+0:06h11.9%11:54hXVIII​Odrodzenie UnuruZwiększa wszystkie produkcje Unurytu10.0%+0.5%5:00h+0:15h59.5%29:45hXIX​Podstawowe błogosławieństwo kupcaZwiększa wszystkie produkcje wzniosłych Towarów podstawowych40.0%[BR](5.0%)+2.0%[BR](+0.25%)5:00h+0:15h238.0%[BR](29.75%)29:45hXX​Wyrafinowane błogosławieństwo kupcaZwiększa wszystkie produkcje wzniosłych Towarów wyrafinowanych40.0%[BR](5.0%)+2.0%[BR](+0.25%)5:00h+0:15h238.0%[BR](29.75%)29:45h"}, {"11": "@Malpa22 BRAWO!!! Genialna robota z tą tabelką [smilie--sprite1])) to teraz wiem, że Kocioł jest dla mnie totalną beznadzieją, bo liczyłam, że może da się wyciągnąć z efektów wojskowych z 40% a tu raptem 23,8% ataku i 11.9% życia .... Ekonomiczne to już totalnie bzdura, skoro mogą być aktywowane tylko raz w tygodniu."}, {"23": "Pisanie, że to jest beznadzieja nie ma totalnie sensu... doskonale wiemy, że każdy dodatkowy procent się przyda, a że nie dostajemy tych bonusów za diaxy (1000,2000k) tylko za coś co możemy kupić za surowce, mlotki, monety itd to tylko dobrze dla Nas, bo większość graczy ma tego OGROMNA ILOSC i nie było gdzie tego wykorzystać [smilie--sprite1][BR]I doskonale wszyscy wiemy, że teraz jest to dziwne, bo to coś nowego, niezbadanego i nikt nie lubi wychodzić że swojej strefy komfortu, a za miesiąc lub dwa każdy będzie to robil żeby zrobić lepszy wynik czy w turnieju czy w iglicy [smilie--sprite1] a jak już ktoś ogarnie lepiej receptury, co z czym łączyć itd to już w ogóle każdy będzie cisnął do 100 lvl [smilie--sprite1][BR]Także prosba o pisanie sensownych komentarzy, pomagających zrozumieć ten kociolek, a nie ze to bez sensu, bo i tak będziecie to robić w swoim mieście [smilie--sprite1][BR]//[BR]Poza tym pamiętajmy proszę, że to jest głównie dla nowych graczy lub poprostu słabszych którzy nie mają tyle dodatkowych bonusów (miski, feniksy itd) co starzy wyjadacze [smilie--sprite1] dla graczy którzy rozpoczęli grę rok temu lub nie dawno to każdy % będzie się liczył [smilie--sprite1] dla starych wyjadaczy wszystko co ma mały % będzie słabe, bo dla nich i tak wiele to nie zmieni [smilie--sprite1] także nienarzekajmy, cieszmy się tym, że jest coś nowego, fajnego, trochę losowości co wprowadzi trochę dodatkowej frajdy [smilie--sprite1][BR][BR]połączono//Urdur"}, {"11": "MDS Krakow napisał:\t\t\tPoza tym pamiętajmy proszę, że to jest głównie dla nowych graczy lub poprostu słabszych którzy nie mają tyle dodatkowych bonusów (miski, feniksy itd) co starzy wyjadacze [smilie--sprite1] dla graczy którzy rozpoczęli grę rok temu lub nie dawno to każdy % będzie się liczył [smilie--sprite1] dla starych wyjadaczy wszystko co ma mały % będzie słabe, bo dla nich i tak wiele to nie zmieni [smilie--sprite1] także nienarzekajmy, cieszmy się tym, że jest coś nowego, fajnego, trochę losowości co wprowadzi trochę dodatkowej frajdy [smilie--sprite1]Kliknij aby rozwinąć...Wolę rozwiać komuś nadzieje- ktoś właduje masę zasobów, będzie cisnąć a potem się okaże, że nie było warto. Lepszy wynik w Iglicy i turnieju?! serio?! Efekt działa tylko raz w tygodniu, więc nowy gracz turnieju nie pociśnie, a co do Iglicy to te ledwo 24% ataku i to na ostatnim poziomie ( nowego gracza na to nie stać) dużo nie zmieni. Biorąc pod uwagę, że trzeba trochę tych badań zrobić, żeby mieć efekty chociażby ataku 3 budynków wojskowych (wzrasta też poziom trudności wraz z badaniami) to razem daje kiepski biznes i jest ,,coś brzydkiego\" owinięte w ładne opakowanie."}, {"23": "Charlene napisał:\t\t\tWolę rozwiać komuś nadzieje- ktoś właduje masę zasobów, będzie cisnąć a potem się okaże, że nie było warto. Lepszy wynik w Iglicy i turnieju?! serio?! Efekt działa tylko raz w tygodniu, więc nowy gracz turnieju nie pociśnie, a co do Iglicy to te ledwo 24% ataku i to na ostatnim poziomie ( nowego gracza na to nie stać) dużo nie zmieni. Biorąc pod uwagę, że trzeba trochę tych badań zrobić, żeby mieć efekty chociażby ataku 3 budynków wojskowych (wzrasta też poziom trudności wraz z badaniami) to razem daje kiepski biznes i jest ,,coś brzydkiego\" owinięte w ładne opakowanie.\t\tKliknij aby rozwinąć...Nie chce zaśmiecać tego tematu i to jest ostatni post aby Cie uspokoić [smilie--sprite1] irytujesz swoimi wypowiedziami... co wchodzę na forum, to widzę tylko Twoje narzekanie... gdybym był nowym graczem i czytał Twoje wypowiedzi to bym z tej gry zrezygnowal... zacznij się cieszyć tym, że jest coś nowego, a nie ciągle eventy, turniej, iglica itd itp [smilie--sprite1] odpuść sobie narzekanie na forum, wyciągnij jakiś plus z czegoś, widzisz same minusy... prędzej kogoś zniechęcisz do gry niż rozwiejesz nadzieję [smilie--sprite1] mnie zniechesz do czytania tego forum właśnie przez ciągle narzekanie... gra nie jest idealna i nigdy nie będzie, maja swoją filozofię i Ty się chyba nigdy z tym niepogodzisz, zmień grę, bo dużo narzekania z Twojej strony, pozdrawiam serdecznie [smilie--sprite1]"}, {"48": "Ja tylko proszę Was: bez osobistych przytyków. Każdy ma prawo do swojego zdania [smilie--sprite1]"}, {"44": "Coz, pogodzic was nie pogodze, wiec napisze tylko, ze pomimo tego, ze pod wzgledem merytorycznym blizej mi w temacie Kociolka do stanowiska @Charlene, to jednak bardzo podoba mi sie pozytywne podejscie @MDS Krakow [smilie--sprite1] Tak naprawde oboje macie troche racji.[BR][BR]MDS Krakow napisał:\t\t\tI doskonale wszyscy wiemy, że teraz jest to dziwne, bo to coś nowego, niezbadanego i nikt nie lubi wychodzić że swojej strefy komfortu, a za miesiąc lub dwa każdy będzie to robil żeby zrobić lepszy wynik czy w turnieju czy w iglicy [smilie--sprite1] a jak już ktoś ogarnie lepiej receptury, co z czym łączyć itd to już w ogóle każdy będzie cisnął do 100 lvl [smilie--sprite1]Kliknij aby rozwinąć...Sam mam bardzo czesto znacznie bardziej pozytywne stanowisko wobec wchodzacych nowosci, niz wiekszosc graczy i staram sie dostrzegac raczej pozytywy, stad podoba mi sie powyzsza wypowiedz [smilie--sprite1] Nie zmienia to jednak faktu, ze gracze, ktrorzy po Kociolku spodziewaja sie elementu gry kalibru np. Tworzenia, moga byc rozczarowani, bo w obecnej formie Kociolek pod wzgledem potencjalu i przydatnosci jest cale lata swietlne za Tworzeniem i paroma innymi mechanizmami i pomimo pozytywnego nastawienia do nowosci, nalezy to uczciwie przedstawic. Tez wprawdzie uwazam, ze wiekszosc graczy bedzie regularnie uzywac Kociolka i choc niewielkie, to jednak jakies tam korzysci z tego beda, jednak tu @Charlene ma troche racji, ze lepiej z gory troche przyhamowac entuzjazm graczy i nawolywac do ostroznosci, bo szczegolnie w poczatkowej fazie mozna sie niezle zapedzic z kosztami ulepszania efektow i mocno sobie zaszkodzic, a zyski z tego beda, powiedzmy sobie szczerze, srednie.[BR]Co do wychodzenia ze swojej strefy komfortu, to nie do konca sie zgadzam [smilie--sprite1] Jesli wchodzi jakis nowy elemement, ktory rzeczywiscie ma potencjal, zeby byc bardzo znaczacym wzmocnieniem miasta, to gracze raczej nie maja wielkiego problemu z tym, zeby lekko przestawic swoj styl gry. Jako przyklad mozna by tu podac tryb multi w Iglicy czy Tworzenie - w obu tych przypadkach z gory dalo sie ocenic, ze to beda elementy z najwyzszej kategorii przydatnosci. Jesli czyims zdaniem Kociolek takim elementem nie jest i jasno wyraza swoje zdanie na ten temat, to niekoniecznie jest to slepe narzekanie.[BR][BR]MDS Krakow napisał:\t\t\ttakże nienarzekajmy, cieszmy się tym, że jest coś nowego, fajnego, trochę losowości co wprowadzi trochę dodatkowej frajdy [smilie--sprite1]Kliknij aby rozwinąć...A z tym sie akurat calkowicie zgadzam, bo mam o Kociolku zdanie jakie mam, ale wielkich powodow do narzekan tez nie widze [smilie--sprite1] Po prostu nie bedzie to tak silny element gry jak kilka innych, ale bedzie sie czym pobawic. Kto wie, moze kiedys tworcy zdecyduja sie przerobic troche efekty w Kociolku i stanie sie on wrecz niezbednym elementem \"codziennej\" gry ? A nawet jesli nie, to nie ma przeciez przymusu uzywania Kociolka. Jedni uznaja go za warty uwagi, inni nie i w porzadku, bo nikt nam przeciez nie obiecywal, ze Kociolek bedzie jakims mega mocnym elementem, wiec nie ma tez powodu do wielkich narzekan [smilie--sprite1][BR][BR]P.S.[BR]@Malpa22 , dzieki za trud zrobenia tej tabelkie, swietna robota [smilie--sprite1] Na pewno przyda sie wielu graczom."}, {"46": "Nusion - dzięki za link; Malpa22  - super tabela. [smilie--sprite1][BR]Pozwolę sobie na moje 3 grosze do dyskusji. Kwestii czy się to opłaca, czy nie ? Jest więc zastanowię się jak to wykorzystać. Jak znajdę plusy i minusy podzielę się tym w bractwie. Co z tym każdy z osobna zrobi?"}, {"3": "Pozwolę sobie wtrącić swoje trzy grosze:[BR][BR]Nie będę nikogo tutaj przekonywał że kociołek jest super, bo to jest kwestia bardzo indywidualna. W zależności od stylu gry (od dawna powtarzam, że w tej grze nie ma jakiejś jednej, jedynie słusznej, \"optymalnej\" strategii) może się komuś przydać albo nie. Ja w nim widzę potencjał, ale zanim napiszę dlaczego, może warto wyjaśnić parę kwestii, bo pojawiło się tu parę mitów:[BR][BR]\"Poziom trudności wzrasta wraz z badaniami\":[BR]co do zasady to prawda, ale akurat w przypadku kociołka ma zastosowanie jedynie dla tych graczy, którzy celowo tkwią w niskich epokach i mieliby ruszyć z postępem wyłącznie z powodu kociołka. Jeśli natomiast ktoś normalnie rozwija miasto i przechodzi kolejne rozdziały, to badania obowiązkowe (a tylko te mają jakiś wpływ na poziom trudności) będzie miał odblokowane niezależnie od tego, czy będzie korzystać z kociołka czy nie. Kociołek wymusza odblokowanie badań opcjonalnych, o ile ktoś chce mieć więcej dyplomów, natomiast poza tym, że trzeba poświęcić trochę PW i zasobów na odblokowanie tych technologii, żadnych innych kosztów (a już tym bardziej wzrostu trudności) nie widzę. Przeciwnie, pewne badania mogą wręcz pomóc (np. powiększenia oddziału). Teoretycznie ekspansje mają wpływ na trudność, ale z tego co pamiętam liczy się nie to, ile mamy odblokowanych, ale ile wykorzystaliśmy w mieście. Czyli samo odblokowanie opcjonalnej ekspansji trudności nam w żadnym stopniu nie zwiększy.\"te 24% ataku różnicy nie zrobi\":[BR]Rozbijam komentarz na dwie sekcje, bo tu są dwa aspekty:[BR]A) przede wszystkim posługiwanie się wyłącznie procentowymi wskaźnikami często wiedzie na manowce. Mógłbym wskazać przykłady takich manowców z dyskusji prowadzonych swego czasu na tym forum jako ilustrację, ale sobie odpuszczę, podam za to inny przykład: Patrząc na wskaźniki nie opłaca się np. stosować większej ilości wzmocnień, bo o ile np. pierwsze swobodne ulepszenie daje nam wzrost o 50% [korekta: nie 50% a 25% przecież) życia, to 10 swobodne ulepszenie dodaje nam już tylko 9% [8% - korekta j.w.]przyrostu do tego co już posiadamy. Co nie zmienia tego, że nadal jest to 50% [25%] wartości bazowej i są gracze, którzy tych ulepszeń stawiają po kilkanaście co turniej, bo widać widzą w tym pewien potencjał.[BR]Podobnie z cudami - gdyby patrzeć wyłącznie na procenty, to w zasadzie żadnego z cudów (z grzybami, iglicami, akademią źródłami czy simią włącznie) nie opłaca się rozbudowywać poza pierwszy poziom, bo im wyższy level tym przyrost procentowy bardziej mikry w stosunku do tego, co już uzyskaliśmy. Nie będę Was tutaj zanudzał teorią dotyczącą użyteczności krańcowej i całkowitej, dość powiedzieć, że póki nie mamy zalewu wzmocnień w AM, te 24% dla sporej ilości ludzi nadal będzie stanowiło całkiem niezłą wartość.[BR]B) Niestety dyskusja (jak zwykle, chciałoby się powiedzieć) skręciła w kierunku wojska i turniejów, a przecież kociołek oferuje znacznie więcej. W zależności od poziomu rozwoju gracza atrakcyjne może być np. zwiększenie produkcji many, ziaren czy unurytu, w niektórych przypadkach (typu przygody) zwiększenie produkcji towarów też może mieć pewien walor, nawet jeśli tylko na pewnym etapie a sam efekt trwa kilka godzin w tygodniu. Jeśli niektórzy widzą sens karmienia budynków typu feniks burzy (czas efektu: 3h), to pewnie będą też widzieć benefit w efektach z kociołka.\"Nowy gracz nie pociśnie\":[BR]Tutaj przede wszystkim odsyłam do komentarza 2B (nie samym turniejem czy iglicą Elvenar żyje); nawet jeśli patrzeć na walor czysto wojskowy, uruchomienie efektu w piątek pozwoli np. zrobić iglicę (na przyśpieszaczach) oraz ostatnią lub (częściej) przedostatnią rundę turnieju, czyli jedną z tych, w której będziemy mieli najwięcej strat (owszem, dysproporcja między naszym wojskiem a przeciwnika wraz z ilością gwiazdek nie rośnie aż tak jak z numerem prowincji, ale w dalszym ciągu w danej prowincji ostatnia gwiazdka jest bardziej wymagająca od pierwszej)\"trzeba wpakować kupę zasobów\" - niekoniecznie, ale o tym za chwilęPodsumowując powyższe, mógłbym się tutaj powyzłośliwać na temat \"ignorantów bez podstawowej wiedzy\", tudzież jakości ich argumentów, ale sobie odpuszczę.[BR][BR]Zamiast tego podzielę się wrażeniami z pierwszej rundy używania kociołka, a zwłaszcza jego ulepszania.[BR]Otóż dość łatwo wyciągnąłem 5 interesujących mnie efektów (tak się składa, że mnie również interesowało wojsko) na 50 poziom. Owszem, popłynąłem trochę z orkami (miałem ich ponad 30 mln, więc wziąłem je na pierwszy ogień), ale sumarycznie te 5 x 50lvl udało się osiągnąć kosztem jednego (niecałego nawet) magazynu ratusza (monety + zasoby), oraz wspomnianych 30+ mln orków właśnie.[BR]Potem postanowiłem sprawdzić, na ile mi się uda rozwinąć jeden z wybranych efektów - uszczuplając nieco magazyn zasobów (ale nadal zabezpieczając strategiczną ich ilość) oraz unurytu (którego i tak nie potrzebuję co najmniej do wejścia w życie następnego rozdziału) udało mi się dojść do 94lvl.[BR]Czyli ostatecznie po jednej rundzie mam 4 efekty na poziomie 50-51 i jeden na 94lvl, jednocześnie w zasadzie nie odczułem tego jakoś istotnie jeśli idzie o posiadane zasoby (zużywałem te, których mi zbywa, albo tylko tyle, żeby nie odczuć ich ubytku) - ogółem uważam że całkiem nieźle.[BR][BR]Trzeba tutaj pamiętać o dwóch rzeczach:[BR]Po pierwsze kociołek premiuje graczy na wyższych poziomach rozwoju (wraz z ilością odblokowanych dyplomów spadają koszty warzenia, wydaje mi się, że kupowania też, ale szczerze mówiąc nie sprawdziłem).[BR]Po drugie, mechanizm kupowania punktów wiedźmy ma parę myków i odpowiednio żonglując kolejnością w jakiej zużywamy do kupowania nasze zasoby, można osiągnąć całkiem niezłe efekty.[BR]Trzecia rzecz, którą zauważyłem, to to, że czasem można osiągnąć efekt większy od teoretycznie maksymalnego. Na pierwszym poziomie można np. dostać niby maksymalnie 4% wzrostu siły wojska, tymczasem z jednego kielicha wypadło mi 4,5%.[BR][BR]Ogółem widzę w kociołku spory potencjał. Dla mnie to coś, co otrzymuję niejako \"za darmo\" - na końcu XX rozdziału i tak mam odblokowane wszystkie badania (opcjonalne to, jak już wyjaśniłem wyżej, nie problem), natomiast do rozwijania efektów będę pewnie wykorzystywał przede wszystkim zasoby i monety (których, przy mojej premii kultury mam tyle, że średnio kilka razy dziennie muszę je przepuszczać u hurtownika - wydawanie ich w kociołku ma moim zdaniem większy sens).[BR]Już teraz efekty wojskowe (pozostałych póki co po prostu nie potrzebuję) mam na poziomie 7h+, co wystarczy na spokojnie zrobić na nich cały turniej oraz - w razie potrzeby - iglicę, a z każdym kolejnym cyklem będzie jedynie lepiej.[BR][BR]Oczywiście to perspektywa dużego, bogatego w zasoby gracza na końcu rozwoju, ale nawet w miastach które mam na innych światach (u progu amunów) podciągnąłem sobie niektóre efekty do 50lvl, również nie zauważając jakoś istotnie wpływu na stan zasobów."}, {"4": "Zgadzam się w 100% z @Ovocko  - te ulepszenia wcale nie są aż tak słabe - swobodne ulepszenie jednostek z AM to tylko 25%  zdrowia jednostek więc nie widzę pastwienia się nad 20% więcej zdrowia z kociołka , jak robi się to ze składników , których mamy i tak więcej niż potrzebujemy[BR]Jest feniks zmierzchu , co oddaje 5% strat w wojsku , ale dopiero po nakarmieniu a sama karma nie jest przecież za darmo i wyskakuje coraz rzadziej - w czasie tamtego eventu wielu twierdziło , że dla walczących te 5% to dużo , a nikt z tym nie polemizował , a teraz czterokrotność tej wartości , to mało [BR]Każdy gra swoim stylem i każdy może mieć swoje danie - jedni uważają , że 5% to dużo a inni będą twierdzić , że 25% to mało i to jest właśnie dobre w tej grze , że szykują dla każdego coś ciekawego"}, {"3": "Andrzej M napisał:\t\t\tw czasie tamtego eventu wielu twierdziło , że dla walczących te 5% to dużo , a nikt z tym nie polemizował ,\t\tKliknij aby rozwinąć...[BR]Ja polemizowałem [smilie--sprite1][BR]I nadal uważam, że poza \"ekstremistami\", dla których liczą się ułamki procent, te 5% jest w zasadzie pomijalne. Ale to temat na inną dyskusję.[BR][BR]Wracając do kociołka, trzeba też pamiętać, że w przypadku efektów wojskowych, kociołek działa na wszystkie jednostki z danego budynku.[BR]O ile w przypadku wzmocnień życia jest to raczej minus (swobodne ulepszenie i zbrojmistrz działają na jednostki ze wszystkich budynków), o tyle w przypadku ataku wzmocnienie dostają również jednostki ciężkie, ciężkie strzelające i lekkie, do których budynki ze wzmocnieniami są ekstremalnie rzadkie i dostępne w zasadzie wyłącznie za diamenty.[BR]Co oznacza, że albo będziemy dla nich mieli te 20parę procent z kociołka, albo nic, lub jakieś wzmocnienie raz na przysłowiowy \"ruski rok\".[BR][BR]Jak dla mnie kolejny argument \"za\", acz - jak wspomniałem już wyżej - nie zamierzam nikogo przekonywać na siłę."}, {"4": "Możliwe , że pisałeś niekorzystnie o tym feniksie , ale takich głosów było bardzo mało , a ja wtedy nie byłem pewien ile to jest warte , a teraz rzadko karmię tego ptaka , bo szkoda mi karmy , ale to tylko moje zdanie na duże konto , bo na pl3 mam konto , co zrobiłem  1 powitalne badanie w 7 rozdziale i karmię go przy każdej walce wojskiem[BR]A w przypadku tego kociołka i ostatniej Twojej wypowiedzi , to znowu się całkowicie zgadzam[BR]Widzisz , ja jestem taki , że z jedną opinią się zgodzę a z inną nie i piszę o tym wprost , ale nie jest to czepianie się , tylko wyrażanie swego zdania [smilie--sprite1]"}, {"49": "Steefann napisał:\t\t\tA czy ta wiedźma nie mogłaby sobie zbierać składników w niedzielę? W sobotę ludzie grający 2 turki na 1 wzmocnieniach klepią turniej i akurat wtedy kociołka nie można sobie odpalić? Znowu inno miesza pod siebie żeby nam strategię rozwalić? Brawo helmuty.....\t\tKliknij aby rozwinąć...Rób w piątek to zrobisz razem z iglica [smilie--sprite2]"}]