[{"44": "Proqrator napisał:\t\t\tRób w piątek to zrobisz razem z iglica [smilie--sprite2]Kliknij aby rozwinąć...[BR]Co drugi tydzien klikanie turnieju wypada na koniec tygodnia i z ciezkich do pojecia wzgledow coraz wiecej graczy, szczegolnie maniakow turniejowych, woli klikac turnieje w sobote, a nie w piatek [smilie--sprite1] Pisze \"z ciezkich do pojecia\", bo sam do konca nie wiem, dlaczego tak jest, choc sam tak wlasnie robie juz od dluzszego czasu. Jakies tam logiczne powody oczywiscie sa, ale mniejsza z tym. Powody sa niewazne, w kazdym razie skoro spora grupa graczy klika turniej wlasnie w sobote, to Kociolek rzeczywiscie nie za dobrze sie w to wpasowuje i niektorych zmusi do zmiany strategii/przyzwyczajen."}, {"3": "Proqrator napisał:\t\t\tRób w piątek to zrobisz razem z iglica [smilie--sprite2]Kliknij aby rozwinąć...[BR]teoretycznie przy odpowiednim poziomie można uwarzyć miksturę w piątek późnym wieczorem i wtedy efekt będzie trwał jeszcze w sobotę rano.[BR]Choć osobiście zastanawiam się, czy przez jakiś czas nie robić turnieju bardziej piątek-środa (a nawet czwartek wieczór - wtorek wieczór), żeby mieć więcej czasu na wydawanie monet i zasobów na rozwój efektów.[BR]Warzenie w piątek daje bardzo mało czasu na etap rozwoju.[BR][BR]Andrzej M napisał:\t\t\tWidzisz , ja jestem taki , że z jedną opinią się zgodzę a z inną nie i piszę o tym wprost , ale nie jest to czepianie się , tylko wyrażanie swego zdania [smilie--sprite1]Kliknij aby rozwinąć...[BR]Serio, nie mam najmniejszego problemu z tym że ktoś ma inne zdanie niż ja. Powiem więcej, lubię się pospierać, bo - jeśli rozmowa jest na poziomie - często coś ciekawego z niej wynika, nawet jeśli nie dojdzie się do porozumienia. Problem jest wtedy, gdy ktoś nie potrafi utrzymać poziomu, a siłę argumentu zaczyna mylić z siłą chamstwa i arogancji.[BR][BR]Nawiązując do naszych wcześniejszych dyskusji - bez urazy, ale Tobie zdarza się komentować coś, czego (jak mniemam) nie doczytujesz do końca i w efekcie wypaczasz tego sens, a to bywa, że mnie irytuje (gdy dotyczy moich wypowiedzi).[BR][BR]Kończąc temat feniksa zmierzchu - to właśnie bardzo dobry przykład na to, że samo posługiwanie się samymi tylko wskaźnikami może mylić. Na forum padały deklaracje ile to procent strat można dzięki niemu zaoszczędzić - tymczasem jedyne co mówi taki parametr, to ile ponosimy strat w stosunku do wystawionego wojska. Jeśli feniks pozwala na zaoszczędzenie np. 20% strat, to oznacza jedynie tyle, że średnie straty mamy na poziomie 25% ogółu wystawionego wojska.[BR]Jeśli nasze straty będą wynosić 50%, to tak liczona \"wydajność\" feniksa zmierzchu spadnie do 10%.[BR]Wystarczy, że nasze straty w walkach spadną do 5%, i licząc w ten sposób wydajność naszego feniksa jest w stanie \"magicznie\" podskoczyć do około 100% (łał!) Przynajmniej teoretycznie, bo w praktyce będzie to zależało m.in. od rozkładu tych strat po oddziałach.[BR][BR]Co nie zmienia tego, że we wszystkich trzech opisywanych przypadkach nasz feniks pozwoli nam odzyskać dokładnie tyle samo jednostek, bo przecież jego efekt jest liczony od wielkości oddziału wystawionego do walki, a nie od wielkości strat.[BR][BR]Tymczasem jak przeliczysz ile jednostek (w sztukach) jesteś dzięki niemu w stanie realnie oszczędzić, oraz porównasz to z budynkami, które pozwalają na wzrost produkcji, to już nie wypada to jakoś super-hiper.[BR]To nie jest zły budynek, sam używam od czasu do czasu (głównie do turniejów z trzeciej grupy), ale też nie jest to jakiś game-changer. W każdym razie w kociołku widzę większy potencjał, tym bardziej, że nie potrzeba na niego zużywać karmy."}, {"4": "@Ovocko  w moim feniksie pisze , że zwraca procent poległych jednostek a mając go rozbudowanego na max ta ilość jest podana w wysokości 5% a według Ciebie zwraca odsetek wystawionych jednostek i zdaje się , że te dwie wartości różnią się[BR]Właśnie to sprawdziłem , bo mogłem źle pamiętać [BR]Może wyjaśnisz tą różnicę ?"}, {"27": "Ovocko napisał:\t\t\tSerio, nie mam najmniejszego problemu z tym że ktoś ma inne zdanie niż ja.\t\tKliknij aby rozwinąć...Czytam różne argumenty i wyrobiłem sobie mniej więcej takie zdanie: kociołek to tylko dodatek i to dość słaby. Z jednej strony wpada coś za darmo, ale z drugiej zabiera czas. Czy to rajcuje gracza i przyciąga do gry? Może tak, a może nie. Moim zdaniem czym bardziej świadomy gracz to szybciej skuma, że to tylko błyskotka.[BR][BR]Większość wątku przewija się w nawiązaniu do efektu wojskowego, więc może kilka (jestem kapryśny i nie podaję wszystkich) oczywistych plusów:[BR]1. Za darmo (lub bez strat dla rozwoju, pozbywając się tego co samo się kasuje) można rozwinąć 5 efektów wojskowych[BR]2. Za punkty wróżek, które same wpadają można dobrać miksturę, gdzie suma % pozwala oczekiwać +55% szans na otrzymanie efektu wojskowego, a skuteczność jest na poziomie +90%, co pozwala oczekiwać (bez pewności) otrzymanie 2 efektów wojskowych/tydzień.[BR][BR]I co to daje? Pojedynczy efekt: 1/3 wojska otrzyma +20% do ataku lub 10% życia. Czas trwania: 10 godzin. Czy 2 takie efekty są lepsze od pospolitego budynku wzmacniającego? Ile można wyciągnąć przez 10 godzin, a ile przez 5 dni? 10% życia dla 1/3 wojska to też nie 25% dla całości. Co prawda siła ataku dotyczy 1/3 wojska (a nie 1/5 jak przy lekkim strzelcu lub magu), ale jest kilkukrotnie mniejsza.[BR][BR]To moje zdanie, ale moc 2 efektów wojskowych to max 25% tego co daje pojedyncze wzmocnienie. Czyli cały kociołek sprowadza się do otrzymania za darmo jednego wzmocnienia/miesiąc.[BR][BR]A teraz dochodzą jeszcze minusy (selektywne, wg mojej oceny):[BR]1) prawie do niczego nie pasujący czas wykorzystania efektu[BR]2) kilka minut w tygodniu poświęcone na głupie klikanie (chyba że kogoś rajcuje tekst: teraz otrzymasz (czytaj wylosujesz) potężne zaklęcie - haha. Coś jest potężne, bo IG tak napisało?).[BR]3) odkrywanie zbędnych technologii w celu lepszego efektu w kociołku, co samo w sobie ma kilka plusów, ale są też minusy i najważniejsze: znika możliwość elastyczności przy nowych pseudoprojektach/zmianach po stronie IG (patrz działanie iglicy, turniejów, nagród w eventach, itd.).[BR][BR]Podsumowując - jest coś za darmo, ale bardzo słabe. Do tego zabiera czas. Jeszcze gracz z niskich rozdziałów (np 5-tego) może się pogrążyć jak przeinwestuje. Szkoda czasu nawet na przetłumaczenie opisów z angielskiego na polski. Być może była to świadoma zagrywka polskiej ekipy - haha. Czego w korpo nie można powiedzieć, tak przypadkowo można pokazać.[BR][BR]Może jeszcze inaczej - zamiast kociołka chciałbym przy ewentach z mapy zbierać max 7 (a nie 6) rzeczy, które pojawiają się wokół miasta. Dlaczego? Bo finalnie dałyby o tyle % waluty więcej (w okolicach 1,2% ogółu), że efekt końcowy w postaci nagród byłby efektywniejszy niż to co jest z kociołka. Z zamkniętymi oczyma poprosiłbym zamiast kociołka o 50-60 waluty więcej przy evencie - hahaha"}, {"4": "@djmags14  mylisz pojęcia[BR]1 -W kociołku nie jest nic za darmo , bo trzeba zainwestować , chociażby zbędne przedmioty , czy towary albo inne produkty[BR]2 - Kociołek nie ma zastępować innych produktów , czy budynków , ale ma być dodatkiem do nich[BR]3 - IG wszystko określa jako potężne z samej zasady , bo to stworzyli , a każdy potem sam określa na ile jemu to jest potrzebne[BR]4 - Od kilku już lat IG rozdaje nagrody na zasadzie losowości i duża część graczy już się z tym pogodziła[BR]5 - Nie ma w tej grze niczego idealnego i każdy gracz sam wybiera , czy coś mu się przyda , czy nie przyda , jak i to , czy warto poświęcić swój              czas na zdobycie nawet użytecznej nagrody (użytecznej w opinii gracza decydującego)"}, {"3": "Jak już napisałem wyżej, nie zamierzam nikogo przekonywać, tymbardziej że sam jeszcze się zapoznaję z kociołkiem i trudno mi jeszcze o jednoznaczną ocenę. Niemniej parę słów komentarza:[BR][BR]djmags14 napisał:\t\t\tMoim zdaniem czym bardziej świadomy gracz to szybciej skuma, że to tylko błyskotka.\t\tKliknij aby rozwinąć...[BR]Powiem szczerze, że odbieram powyższe jako dosyć manipulacyjne, bo wniosek z tego jest taki, że jeśli komuś się kociołek podoba, to \"nie jest świadomym graczem\". Nie wiem czy świadomie/celowo użyłeś tego zabiegu (zakładam, że nie), niemniej takie postawienie sprawy wywiera presję na innych, by ocenili kociołek negatywnie aby wykazać się swoją \"świadomością\"  [smilie--sprite2][BR]Ja się na takie numery nie łapię, niemniej nie pomagają one w rzetelnej ocenie i rozmowie.[BR][BR][BR]djmags14 napisał:\t\t\tI co to daje? Pojedynczy efekt: 1/3 wojska otrzyma +20% do ataku lub 10% życia. Czas trwania: 10 godzin.\t\tKliknij aby rozwinąć...[BR]+24%/+12% i nie 10 ale 12h. Niby nieduża różnica, ale trzymajmy się faktów, bo osobiście już teraz mam jeden efekt mocniejszy od tego co piszesz (22,6% przez 11:18h), a nie dojechałem jeszcze do 100 lvl.[BR][BR]djmags14 napisał:\t\t\tCzy 2 takie efekty są lepsze od pospolitego budynku wzmacniającego? Ile można wyciągnąć przez 10 godzin, a ile przez 5 dni?\t\tKliknij aby rozwinąć...[BR]To znowu zależy od stylu gry. Jeśli ktoś robi turniej w cyklu 2x na jednym komplecie wzmocnień, to i tak efektywnie korzysta z tych wzmocnień raz na tydzień przez kilka godzin, więc kociołek idealnie wpisuje się w ten schemat.[BR]Sczerze mówiąc, dla mnie na przykład konieczność trzymania aktywnych wzmocnień pomiędzy turniejami (czyli w czasie, gdy już skończyłem pierwszy, ale jeszcze nie zacząłem drugiego) bywa uciążliwością - ich przydatność w tym okresie wynosi dokładnie ZERO, stanowią natomiast zawadę przy rozbudowach i reorganizacji miasta.[BR][BR][BR]djmags14 napisał:\t\t\t10% życia dla 1/3 wojska to też nie 25% dla całości. Co prawda siła ataku dotyczy 1/3 wojska (a nie 1/5 jak przy lekkim strzelcu lub magu), ale jest kilkukrotnie mniejsza.\t\tKliknij aby rozwinąć...[BR]Zgoda co do tego, że efekt kociołka jest słabszy niż efekt wzmocnienia, niemniej zakładając, że wzmocnień używa się głównie w turnieju, zazwyczaj masz dwie jednostki wiodące na wojsko przeciwnika (z dwóch różnych budynków), więc realnie jest to bardziej 1/2 niż 1/3.[BR]Druga kwestia to to, że zazwyczaj (z wyjątkiem bodaj jednego turnieju), przynajmniej jedna z tych jednostek NIE podpada pod wzmocnienie ataku z dostępnych budynków (oświecony strzelec/powielacz magów), zatem nie porównujemy w jej przypadku efektu kociołka i efektu budynku, tylko efekt kociołka z brakiem efektu w ogóle. OK, mamy efekt odpowiedniego cudu oraz feniksa, ale te dotyczą wszystkich jednostek po równo.[BR]Rozumiem, że część graczy opiera swoje walki wyłącznie o jednostki dla których istnieją budynki wzmacniające atak, niemniej nawet oni mogą w pewnym stopniu skorzystać na większej dywersyfikacji używanego wojska.[BR][BR][BR]djmags14 napisał:\t\t\tTo moje zdanie, ale moc 2 efektów wojskowych to max 25% tego co daje pojedyncze wzmocnienie. Czyli cały kociołek sprowadza się do otrzymania za darmo jednego wzmocnienia/miesiąc.\t\tKliknij aby rozwinąć...[BR]Zgoda, z komentarzem jak wyżej - w przypadku jednostek ciężkich/ciężkich strzelających/lekkich, nawet jeśli jest to jedno wzmocnienie na miesiąc, to i tak sporo częściej niż 1 wzmocnienie raz na kilka miesięcy (lub w ogóle, jeśli nie sypniemy diamentami przy losowo pojawiających się ofertach albo na królewskie nagrody w evencie - gdzie również wzmocnienia pojawiają się niezbyt często).[BR][BR][BR]djmags14 napisał:\t\t\tA teraz dochodzą jeszcze minusy (selektywne, wg mojej oceny):[BR]1) prawie do niczego nie pasujący czas wykorzystania efektu\t\tKliknij aby rozwinąć...[BR]Tu się nie zgodzę. Na pierwszym poziomie - owszem. Ale już na 50lvl (który jest dość łatwo uzyskać dla kilku wybranych efektów) jest to 7h, a to jest wystarczająco dużo, by zdążyć zrobić iglicę lub turniej (jeśli mamy zakrzywienie+polarnego).[BR][BR]djmags14 napisał:\t\t\t2) kilka minut w tygodniu poświęcone na głupie klikanie (chyba że kogoś rajcuje tekst: teraz otrzymasz (czytaj wylosujesz) potężne zaklęcie - haha. Coś jest potężne, bo IG tak napisało?).\t\tKliknij aby rozwinąć...[BR]Jest znacznie więcej elementów gry, zabierających czas na głupie klikanie. Już samo łapkowanie potrafi zająć kilkanaście-kilkadziesiąt minut dziennie, o durnieju (czytaj: durnym turnieju) nie mówiąc. Tu mały offtopic: kiedy wchodziły zmiany w turniejach bardzo mocno liczyłem na to, że w końcu przestanie to być durna i monotonna klikanina. Niestety tak się nie stało. Póki potrzebowałem zasobów z turnieju oraz rozgryzałem ich mechanikę, to jeszcze można było przymknąć na to oko, natomiast teraz, gdy w zasadzie nie potrzebuję już fantów z turnieju aż tak bardzo, klepię te turnieje już bardziej z przyzwyczajenia niż potrzeby.[BR]Durnieje to najbardziej monstrualna strata czasu w grze (w iglicy można sobie przynajmniej pogłówkować przy negocjachach), przy której te kikla minut klikania w kociołku to \"pikuś\".[BR][BR]djmags14 napisał:\t\t\tMoże jeszcze inaczej - zamiast kociołka chciałbym przy ewentach z mapy zbierać max 7 (a nie 6) rzeczy, które pojawiają się wokół miasta. Dlaczego? Bo finalnie dałyby o tyle % waluty więcej (w okolicach 1,2% ogółu), że efekt końcowy w postaci nagród byłby efektywniejszy niż to co jest z kociołka. Z zamkniętymi oczyma poprosiłbym zamiast kociołka o 50-60 waluty więcej przy evencie - hahaha\t\tKliknij aby rozwinąć...[BR]Wystarczy że masz popielatego (a najlepiej dwa) i masz nawet więcej niż 50-60 waluty.[BR][BR]P.S.[BR]I znowu skupiliśmy się wyłącznie na aspekcie wojskowym, choć np. rozmawiałem z osobami, które w kociołku zainteresowane są np. zwiększeniem produkcji many, czy nawet po prostu zasobów. W obu przypadkach maksymalny efekt trwa powyżej doby, jest więc porównywalny np. z efektem zaklęć (a w przypadku zaklęcia na młotki trwa dłużej niż nawet przy maksymalnie rozbudowanych wieżach dobrobytu)"}, {"15": "Proqrator napisał:\t\t\tRób w piątek to zrobisz razem z iglica [smilie--sprite2]Kliknij aby rozwinąć...[BR]Ovocko napisał:\t\t\tteoretycznie przy odpowiednim poziomie można uwarzyć miksturę w piątek późnym wieczorem i wtedy efekt będzie trwał jeszcze w sobotę rano.[BR]Choć osobiście zastanawiam się, czy przez jakiś czas nie robić turnieju bardziej piątek-środa (a nawet czwartek wieczór - wtorek wieczór), żeby mieć więcej czasu na wydawanie monet i zasobów na rozwój efektów.[BR]Warzenie w piątek daje bardzo mało czasu na etap rozwoju.[BR]//\t\tKliknij aby rozwinąć...Co mi z soboty rano jak pracuję do 13-15 a czasem i do 18 i dopiero wieczorem mam czas (a czasem mam całą sobotę wolną). Dlatego każdy robi wtedy kiedy mu pasuje, to Ty dostosowujesz grę pod siebie a nie gra Ci narzuca kiedy Ty masz czegoś użyć, już takie gierki przerabiałem, szybko kończyliśmy współpracę [smilie--sprite1] Czasami klepię turek tylko w piątek, czasem tylko w sobotę, czasami w oba dni wieczorami po pracy, zależy po prostu jak w danym tyg pracuję i kiedy mam czas. Dodatkowo robiąc turniej w piątek na kolejny mam krótsze okienko, a na tygodniu jak nie mam wolnego to pracuję 7-18 także wtedy potrzebuję dwóch wieczorów żeby cały turniej przeklepać.[BR][BR]Ovocko napisał:\t\t\tJest znacznie więcej elementów gry, zabierających czas na głupie klikanie. Już samo łapkowanie potrafi zająć kilkanaście-kilkadziesiąt minut dziennie, o durnieju (czytaj: durnym turnieju) nie mówiąc. Tu mały offtopic: kiedy wchodziły zmiany w turniejach bardzo mocno liczyłem na to, że w końcu przestanie to być durna i monotonna klikanina. Niestety tak się nie stało. Póki potrzebowałem zasobów z turnieju oraz rozgryzałem ich mechanikę, to jeszcze można było przymknąć na to oko, natomiast teraz, gdy w zasadzie nie potrzebuję już fantów z turnieju aż tak bardzo, klepię te turnieje już bardziej z przyzwyczajenia niż potrzeby.[BR]Durnieje to najbardziej monstrualna strata czasu w grze (w iglicy można sobie przynajmniej pogłówkować przy negocjachach), przy której te kikla minut klikania w kociołku to \"pikuś\".\t\tKliknij aby rozwinąć...Klepię turki prawie tydzień w tydzień na max prowek (tylko kryształy i zwoje olewam, bo tam są najdurniejsze kombinacje przeciwnik i mapa, a nie chce mi się 5 na 6 walk klikać ręcznie). Mam 5 magicznych warsztatów, 3 z nich zaczarowane na rok do przodu, pozostałe 2 czaruję na bieżąco (kilka dni do przodu) a i tak mam ponad 3tys zaklęć do czarowania warsztatów w plecaku. Budynki kulturowe, wszystkie co się da mam poczarowane na 5-8 dni do przodu, zaklęć mam non stop około 2200, 4 manu eliksirów non stop są zaczarowane a i tak magicznej produkcji mam około 1700 jeszcze w plecaku. Wszystkie te zaklęcia (lub zdecydowaną większość, bo czasem coś wpadnie z eventów) wyciągam z turków. Dzięki temu premię do kultury mam 600-1000% (zależnie ilu sąsiadów kliknie w danym czasie) i non stop dzięki cudakom w takim przedziale się utrzymuje się. Nie mam dzięki temu ani problemu ze złotem ani młotkami, które kilkanaście razy dziennie przerabiam u hurtownika na zasoby, wychodzę na tym lepiej niż dostawiając manu i produkując surowce tradycyjnie. Wyszło mi tak, że niebonusowych towarów już w każdej grupie mam 2x więcej niż bonusowego i ta różnica wciąż rośnie. O tysiącach pw wyciąganych co tydzień nie wspomnę. Także nie uważam wcale, że turniej to durniej no sorry [smilie--sprite1][BR][BR]połączono//Urdur"}, {"3": "Steefann napisał:\t\t\tCo mi z soboty rano jak pracuję do 13-15 a czasem i do 18 i dopiero wieczorem mam czas (a czasem mam całą sobotę wolną). Dlatego każdy robi wtedy kiedy mu pasuje, to Ty dostosowujesz grę pod siebie a nie gra Ci narzuca kiedy Ty masz czegoś użyć, już takie gierki przerabiałem, szybko kończyliśmy współpracę [smilie--sprite1]Kliknij aby rozwinąć...[BR]Ja to rozumiem, tylko że z drugiej strony oczekiwanie, że autorzy gry dostosują się akurat pod Twoje indywidualne oczekiwania, uważam za mało realistyczne.[BR]Mnie też wiele rzeczy w tej grze nie do końca pasuje - np. w miastach, w których nie dotarłem jeszcze do zakrzywienia, robienie turnieju na 6* wymaga utrzymania pewnego rygoru czasowego (łącznie z tym, że w jedn dzień trzeba zrobić dwie rundy, jedną wcześnie rano, drugą późno wieczorem). Iglicę też bym wolał zacząć np. w poniedziałek i skończyć w sobotę, lub ewentualnie zacząć równo z turniejem i zakończyć w niedzielę.[BR][BR]Albo akceptujemy takie rzeczy (jak mniemam przynajmniej część z nich została tak a nie inaczej ustawiona celowo, by nieco utrudnić grę), albo szukamy sobie szczęścia gdzie indziej.[BR][BR]Steefann napisał:\t\t\tKlepię turki prawie tydzień w tydzień na max prowek (...) Także nie uważam wcale, że turniej to durniej no sorry [smilie--sprite1]Kliknij aby rozwinąć...[BR]Wiesz, o korzyściach płynących z robienia turnieju nie musisz mi mówić, to co piszesz sam powtarzam niejednokrotnie u siebie w bractwie.[BR]Gdybym ich nie widział, to nie utrzymywałbym poziomu, który obecnie utrzymuję, wyrabiając te 12-14k turniej w turniej.[BR][BR]Co nie zmienia tego, zdobywanie tychże korzyści odbywa się za pomocą (przynajmniej w mojej ocenie) durnej i monotonnej klikaniny, która coraz bardziej mnie zwyczajnie nuży i którą uważam za stratę czasu. Gdyby nie profity o których pisałeś, to bym jej po prostu nie robił, bo zabawy/przyjemności z gry mam przy tym tyle co nic.[BR][BR]Tyle że te profity w coraz mniejszym stopniu mnie kręcą:[BR]Moja premia kultury jest podobna do Twojej, przy czym aby ją utrzymać w coraz mniejszym stopniu potrzebuję zaklęć z turnieju - miasto zoptymalizowałem tak, że w AM w ogóle nie produkuję już katalizatorów; a choć zużywam je wtempie takim, że średnio co 1-2 dni zbieram 100 mgieł, nadal mi ich sukcesywnie przybywa. Mogę się więc w 100% przerzucić na produkcję podarunków.[BR]Liczbę warsztatów ograniczyłem do 1 (jak ostatnio sprawdzałem, to okazało się, że jest zaczarowany na 4 lata do przodu), a i tak codziennie przepuszczam zasoby u hurtownika, choć sporo wydaję na orki w zbrojowniach (mam ich 50+) oraz produkcję wojska (koszt slotu powyżej 2mln).[BR]Nawet się zastanawiałem jakiś czas temu czy się go nie pozbyć albo nie zrobić mu downsizingu (wymienić na mniejszy, sprzed kilku epok), ale się w końcu ostatecznie nie zdecydowałem.[BR]Manufaktur nie mam już wcale (wszystkie zasoby mam z budynków eventowych/zestawów lub od hurtownika), zatem jedynymi zaklęciami, które mnie by interesowały są podarunki - ale te, jak już wspomniałem, zdobywam już od jakiegoś czasu po prostu w AM.[BR]Rezydencji też nie mam już ani jednej, nie potrzebuję więc również schematów (podnieść ten jeden ostatni warsztat raz na kilka miesięcy przy przejściu do kolejnego rozdziału mogę od biedy za diamenty).[BR]Zostają PW, runy i odłamki run, tylko że cuda już też mam w zasadzie rozbudowane i coraz bardziej muszę sobie wymyślać trochę na siłę, co by tu dalej rozbudować.[BR]Jedyne co w turnieju ma dla mnie jakiś naprawdę realny walor, to królewskie renowacje.[BR][BR]W tym świetle kociołek jest jakimś urozmaiceniem, przynajmniej na jakiś czas."}, {"27": "Andrzej M napisał:\t\t\t@djmags14 mylisz pojęcia[BR]1 -W kociołku nie jest nic za darmo , bo trzeba zainwestować , chociażby zbędne przedmioty , czy towary albo inne produkty\t\tKliknij aby rozwinąć...Nic nie mylę, napisałem że to moje zdanie. Oczywiście, że trzeba coś zainwestować. Tylko jak dajesz coś co i tak przepada (np zbędna mama) lub druga wymiana monet/młotków u hurtownika to ta inwestycja jest za darmo (lub dosłownie: bardzo małym kosztem). Jeszcze inaczej - jak na rozwój (w okolice 80 poziomu na 5 efektów wojskowych) zużyłem mniej niż 0,3% posiadanych towarów to mnie zabolało? Nawet tego nie zauważyłem, a reszta nadal będzie gniła w pasku.[BR]Andrzej M napisał:\t\t\t2 - Kociołek nie ma zastępować innych produktów , czy budynków , ale ma być dodatkiem do nich\t\tKliknij aby rozwinąć...Tylko ja chciałem porównać kociołek z czymś innym z gry, aby uzmysłowić jak jest \"potężny\". Znów precyzyjniej: ma być to potężny ... dodatek - haha[BR]Andrzej M napisał:\t\t\t3 - IG wszystko określa jako potężne z samej zasady , bo to stworzyli , a każdy potem sam określa na ile jemu to jest potrzebne\t\tKliknij aby rozwinąć...Ale akurat ten tekst przetłumaczyli. Tak przypadkowo.[BR]Andrzej M napisał:\t\t\t4 - Od kilku już lat IG rozdaje nagrody na zasadzie losowości i duża część graczy już się z tym pogodziła\t\tKliknij aby rozwinąć...Nigdy z tym się nie zgodzę, bo losowości w całej grze jest bardzo zdecydowanie za dużo. Tylko jak porównujesz losowego kociołka z innymi losowymi rzeczami z gry to ten aspekt nie jest kluczowy. Chociaż faktycznie już z samego założenia losowość jest na pierwszym miejscu.[BR]Ovocko napisał:\t\t\tPowiem szczerze, że odbieram powyższe jako dosyć manipulacyjne, bo wniosek z tego jest taki, że jeśli komuś się kociołek podoba, to \"nie jest świadomym graczem\". Nie wiem czy świadomie/celowo użyłeś tego zabiegu\t\tKliknij aby rozwinąć...Ovocko, zrobiłem to półświadomie. Jak czytam teksty, że najpierw trzeba dokładnie poznać jak działa, gracz zaczyna zmieniać przyzwyczajenia (sam pisałeś o innych terminach wykorzystania kociołka - np. z domyślnego piątku na potencjalny wtorek). Jeszcze innych rajcuje sam fakt jego pojawienia się - jako nowość. Lepiej, aby ktoś kto tak łatwo nim się zachwycił świadomie przemyślał jego moc, bo to go może uchronić przed mało rozważnymi decyzjami (np. przed przeinwestowaniem przy rozwoju efektów). Natomiast tacy gracze jak Ty (liczący) i tak ustalą jaką ma moc i podejmą świadomy wybór. Ogólnie nie dotykanie kociołka to działanie na przekór sobie (bo coś otrzymujemy za darmo, a tak to zlewamy). Tylko zmiana stylu gry (pod kociołek) to już coś znacznie więcej niż odbieranie korzyści.[BR]Ovocko napisał:\t\t\twięc realnie jest to bardziej 1/2 niż 1/3\t\tKliknij aby rozwinąć...Niech nawet będzie 3/4. Nadal nie urywa. Jak chodzi o sam czas to budynki zazwyczaj obsługują zestaw, w którym jest coś więcej niż jedno wydarzenie. Przy kociołku można połączyć jeden turniej z jedną iglicą, tylko akurat w ... (tak dla przekory: wtoreczek). [BR]Ovocko napisał:\t\t\tWystarczy że masz popielatego (a najlepiej dwa) i masz nawet więcej niż 50-60 waluty\t\tKliknij aby rozwinąć...Czyli moc kociołka można porównać z jedną karmą na miesiąc - drastyczne porównanie, ale to już tylko moja prywatna ocena.[BR]Ovocko napisał:\t\t\tI znowu skupiliśmy się wyłącznie na aspekcie wojskowym\t\tKliknij aby rozwinąć...Bo to najczęściej używane efekty (z założenia)  - przynajmniej na etapie przed losowaniem [smilie--sprite1]"}, {"46": "Mam wrażenie, że to spór o detale. Na razie to wszyscy w mniejszym lub większym stopniu ten twór poznajemy. Fakt - było by fantastycznie gdyby działał cały tydzień, gdyby składniki nie były za diamenty ect. Niestety, ja osobiście takiego ideału jakoś nie znalazłem. Zatem nie mając idealnego rozwiązania skorzystam (lub może nie) z tego co jest. Nie znaczy, że nie warto oczekiwać zmian w kociołku. [BR]Co istotne, mimo, że zaczynacie schodzić na poziom  subatomowy, który dla normalnego zjadacza tej gierki jest \"super ważny\" cieszę się, że dyskutujecie. Jak z większości dyskusji, słuchający zawsze ma szansę coś z tego mieć. Z  co wam dziękuję. [smilie--sprite1]"}, {"23": "Zgadzam się z Acca, fajnie jest poczytać ocenę tego kociołka od ludzi którzy w ostatnim zdaniu nie piszą \"to jest beznadzieja itd\" [smilie--sprite1][BR]Super się to czyta i przy okazji można sporo się dowiedzieć [smilie--sprite1] super Panowie ! :*"}, {"3": "djmags14 napisał:\t\t\tNic nie mylę, napisałem że to moje zdanie. Oczywiście, że trzeba coś zainwestować. Tylko jak dajesz coś co i tak przepada (np zbędna mama) lub druga wymiana monet/młotków u hurtownika to ta inwestycja jest za darmo (lub dosłownie: bardzo małym kosztem). Jeszcze inaczej - jak na rozwój (w okolice 80 poziomu na 5 efektów wojskowych) zużyłem mniej niż 0,3% posiadanych towarów to mnie zabolało? Nawet tego nie zauważyłem, a reszta nadal będzie gniła w pasku.\t\tKliknij aby rozwinąć...[BR]Dokładnie. Dla tego ja również napisałem gdzieś wyżej, że kociołek dostaję \"za darmo\".[BR]Pomijając nawet główne miasto, na pozostałych światach też mam sporo zasobów do przepuszczenia przez kociołek, które inaczej tkwiłyby w magazynie, rozpadały się, albo były przepuszczane u hurtownika. Tak to przynajmniej się nie marnują.[BR][BR]djmags14 napisał:\t\t\tTylko ja chciałem porównać kociołek z czymś innym z gry, aby uzmysłowić jak jest \"potężny\". Znów precyzyjniej: ma być to potężny ... dodatek - haha\t\tKliknij aby rozwinąć...[BR]Ej, a nie przyzwyczaiłeś się już do różnego rodzaju \"potężnych\" ofert, które po bliższym poznaniu wcale nie są takie potężne?[BR]Ja tam za każdym razem gdy trafiam na jakąś \"rzadką paczkę\", zastanawiam się, czy aby na pewno przymiotnik dotyczy częstotliwości jej występowania, a nie stężenia mocy nagród w niej zawartych [smilie--sprite2][BR]Prawda jest taka, że większość nagród w tej grze daje efekty umiarkowane. Owszem, było parę budynków, które całkowicie zmieniły dynamikę gry, ale szczerze mówiąc wątpię, by się to kiedykolwiek powtórzyło.[BR][BR]djmags14 napisał:\t\t\tOvocko, zrobiłem to półświadomie. Jak czytam teksty, że najpierw trzeba dokładnie poznać jak działa, gracz zaczyna zmieniać przyzwyczajenia (sam pisałeś o innych terminach wykorzystania kociołka - np. z domyślnego piątku na potencjalny wtorek). Jeszcze innych rajcuje sam fakt jego pojawienia się - jako nowość. Lepiej, aby ktoś kto tak łatwo nim się zachwycił świadomie przemyślał jego moc, bo to go może uchronić przed mało rozważnymi decyzjami (np. przed przeinwestowaniem przy rozwoju efektów).\t\tKliknij aby rozwinąć...[BR]Wiesz, parafrazując zasłyszane niegdyś od jednego z wykładowców stwierdzenie o studentach: \"nieludzką rzeczą jest zmuszanie gracza do myślenia, ale czasami niestety trzeba\".[BR]Nigdy nie byłem zwolennikiem dawania ludziom \"wędki\" i zachęcania ich do funkcjonowania na \"autopilocie\", bo zawsze są jakieś niuanse i sytuacje, kiedy ten \"autopilot\" bardziej przeszkadza niż pomaga. Czasem trzeba trochę posiedzieć i pogłówkować, co lepiej zrobić.[BR]Zarazem mam większą wiarę w umiejętności ludzi, zakładam więc, że każdy będzie sobie sam w stanie ocenić, czy mu się coś przydaje lub nie.[BR]W przypadku kociołka, poza ewentualnym utopieniem pewnej ilości zasobów, w zasadzie nie ma za bardzo kosztów - odblokowanie pobocznych technologii ma zerowy wpływ na CAL, akademię masz tak i tak (nie zajmujesz więc powierzchni miasta), itd.[BR][BR]Jak pisałem wyżej - założyłem, że odwołując się do \"świadomych\" graczy nie chciałeś manipulować, niemniej wydźwięk zrobił się właśnie taki (kuszące jest poutyskiwać na kociołek, żeby się wykazać jakim to \"świadomym graczem\" się jest, tudzież odrzucić argumenty \"za\" poprzez proste zaszufladkowanie kogoś jako \"nieświadomego\" [smilie--sprite2] )[BR][BR]djmags14 napisał:\t\t\tNatomiast tacy gracze jak Ty (liczący) i tak ustalą jaką ma moc i podejmą świadomy wybór. Ogólnie nie dotykanie kociołka to działanie na przekór sobie (bo coś otrzymujemy za darmo, a tak to zlewamy). Tylko zmiana stylu gry (pod kociołek) to już coś znacznie więcej niż odbieranie korzyści.\t\tKliknij aby rozwinąć...[BR]Dokładnie tak to widzę. Te efekty szału nie robią (ale to już pisałem wyżej - rzadko które takie są), niemniej odpuszczanie czegoś, co się dostaje za friko \"bo tak\" odbieram trochę jak logikę typu \"na złość mamie odmrożę sobie uszy\".[BR]W tej grze jest całkiem sporo elementów które działają bardzo dobrze lub bardzo słabo w zależności od tego, jak sobie skonfigurujemy miasto, oraz z jakimi innymi elementami je połączymy.[BR]Sam swego czasu wywaliłem kryształową latarnię jako \"bezużyteczną\", po czym stawiałem ją od nowa, gdy okazało się że jest krytycznym cudem jeśli chce się osiągnąć premię kultury na poziomie kilkuset procent (Swoją drogą, dzięki @BlossomValvi i @blazius1, bo to dzieś w rozmowach z Wami ten temat wypływał).[BR][BR]Trzymam budynki, które w znacznie większym stopniu \"obciążają\" moje miasto niż kociołek, a z których profit jest niższy, np. centrum handlowe, które mam w mieście wyłącznie do przygód, kiedy to chowam część zbrojowni i wyciągam z piwnicy manufaktury pod produkcję bransolet. Już nawet nie chodzi o wpływ tego centrum na CAL, ale ile ta kobyła zabiera miejsca w mieście.[BR][BR]Z kociołkiem  może (nie musi) być bardzo podobnie. Nadal stoję na stanowisku, że lepiej mieć te 24% wzmocnienia niż nie mieć (jak to mówi mój pewien znajomy: \"mieć 50zł a nie mieć, to 100zł różnicy\")[BR][BR]djmags14 napisał:\t\t\tNiech nawet będzie 3/4. Nadal nie urywa. Jak chodzi o sam czas to budynki zazwyczaj obsługują zestaw, w którym jest coś więcej niż jedno wydarzenie. Przy kociołku można połączyć jeden turniej z jedną iglicą, tylko akurat w ... (tak dla przekory: wtoreczek).\t\tKliknij aby rozwinąć...[BR]No nie urywa, ale... odsyłam do tego co pisałem wyżej.[BR]Co do \"wtoreczku\" - mnie ten termin wyskoczył o tyle, że nadwyżki zasobów czy monet nie mogę magazynować, więc im szybciej uwarzę miksturę, tym wcześniej mogę je wpychać w rozwój efektów zamiast przepuszczać u hurtownika. Natomiast kiedy już rozwinę efekty, które mnie interesują, będę tymi terminami operował znacznie elastyczniej, z zastrzeżeniem, że trzeba miksturę uwarzyć do piątku do północy (wtedy efekty wojskowe trwać będą do soboty około południa).[BR]Tak się składa, że teraz turniej robię najczęściej w soboty (mam wtedy więcej czasu, poza tym wtedy jest większy luz którego dnia zrobić turniej na końcu cyklu (okienko zamyka się we czwartek). Z drugiej strony, produkcję wojska mam dobraną tak, by turniej robić akurat wtedy, gdy mam nakarmione brunatne (jestem wtedy w stanie coś doprodukować sobie na szybko w razie potrzeby), więc i tak ten cykl mi się dość dobrze zgrywa z kociołkiem (do tej pory robiłem sobota-środa, mogę się o ten jeden dzień przesunąć)[BR][BR][BR]djmags14 napisał:\t\t\tCzyli moc kociołka można porównać z jedną karmą na miesiąc - drastyczne porównanie, ale to już tylko moja prywatna ocena.\t\tKliknij aby rozwinąć...[BR]Ja bym jednak nie porównywał kociołka z popielatym.[BR]Pamiętaj też, że jest sporo innych efektów o krótkim czasie działania - z wojskowych np. feniks zmierzchu czy niedźwiedź brunatny, z niewojskowych feniksy burzy i złoty, niektóre niedźwiedzie.[BR]Nawet feniks ognia ma czas relatywnie krótki (24h), i myślę że tego typu parametry w znacznie większym stopniu wpływają na zmianę przyzwyczajeń niż kociołek (ja np.  wolałbym sobie poklikać turniej na luzie przez cały tydzień (może wtedy bym się przestawił na walkę ręczną i miał wreszcie z niego jakiś fun), a nie być przymuszany (pardon: \"zachęcany\") do robienia go jednym ciągiem w ściśle określone dni (pod rygorem zmarnotrawienia wzmocnień i/lub karmy).[BR][BR]djmags14 napisał:\t\t\tBo to najczęściej używane efekty (z założenia)  - przynajmniej na etapie przed losowaniem [smilie--sprite1]Kliknij aby rozwinąć...[BR]Zgoda, też już pisałem wyżej, że mnie osobiście też one najbardziej interesują (pozostałych zwyczajnie nie potrzebuję na moim etapie rozwoju, nawet unuryt zalega mi w milionach).[BR]Niemniej pamiętajmy choć trochę o graczach, dla których owe efekty (zwłaszcza na manę/ziarna/żywe czy inne zasoby rozpadające się) mogą być całkiem sporą pomocą (zwłaszcza że trwają znacznie dłużej niż wojskowe)."}, {"44": "Wyrazilem juz swoja ostrozna opinie na temat Kociolka i mialem sie juz nie mieszac, no ale nie zdzierze... Jak zwykle sprowokowaly mnie do tego wpisy naszego pozal sie boze miszcza i wielkiego znaffcy kwestii militarnych...[BR][BR]Ovocko napisał:\t\t\tKończąc temat feniksa zmierzchu - to właśnie bardzo dobry przykład na to, że samo posługiwanie się samymi tylko wskaźnikami może mylić. Na forum padały deklaracje ile to procent strat można dzięki niemu zaoszczędzić - tymczasem jedyne co mówi taki parametr, to ile ponosimy strat w stosunku do wystawionego wojska. Jeśli feniks pozwala na zaoszczędzenie np. 20% strat, to oznacza jedynie tyle, że średnie straty mamy na poziomie 25% ogółu wystawionego wojska.[BR]Jeśli nasze straty będą wynosić 50%, to tak liczona \"wydajność\" feniksa zmierzchu spadnie do 10%.\t\tKliknij aby rozwinąć...[BR]Ovocko napisał:\t\t\tTo nie jest zły budynek, sam używam od czasu do czasu (głównie do turniejów z trzeciej grupy), ale też nie jest to jakiś game-changer. W każdym razie w kociołku widzę większy potencjał, tym bardziej, że nie potrzeba na niego zużywać karmy\t\tKliknij aby rozwinąć...[BR]Nie umiem pogodzic ze soba tych dwoch rzeczy, czyli jak mozna byc sceptykiem odnosnie Feniksa Zmierzchu, a jednoczesnie byc zwolennikiem Kociolka i widziec w nim wiekszy potencjal... Przeciez to sie zupelnie kupy nie trzyma i nie napisalby tego nikt, doslownie ani jeden gracz, dysponujacy chocby odrobina czegos, co na potrzeby tej dyskusji mozna nazwac glebszym zrozumieniem gry.[BR][BR]Co do efektow militarnych Kociolka, to nawet zakladajac, ze gramy zupelnie bez wzmocnien, a tylko z cudami i z odpalonycm Feniksem, to nawet efekt na 100 lvl nigdy nie bedzie stanowil dodatku w postaci +23.8% do realnej sily ataku naszych jednostek, poniewaz ten efekt liczy sie od podstawowej sily ataku 100%. W praktyce mamy jednak 100% podstawy + 50% z Feniksa + 40% z cudu (to oczywiscie zalezy od jego poziomu), wiec efekt na 100 lvl da nam w najlepszym razie dodatkowe 23.8 % do juz posiadanych 190%. A to oznacza realny przyrost sily ataku naszych jednostek o zaledwie 12.5 % i to na maksymalnym poziomie efektu. Tu az chcialoby sie zacytowac klasyka:[BR]Ovocko napisał:\t\t\tto właśnie bardzo dobry przykład na to, że samo posługiwanie się samymi tylko wskaźnikami może mylić\t\tKliknij aby rozwinąć...[BR][BR]Te +12.5 % ataku dla tylko jednego rodzaju jednostek (a nawet dla wszystkich trzech) nigdy, w zadnej sytuacji nie pozwoli nam zaoszczedzic tyle wojska, ile wskrzeszanie nominalnie 5 % jednostek, ktore zapewnia Feniks Zmierzchu. W praktyce turniejowej jeden Feniks Zmierzchu redukuje realne straty srednio o ok. 20%, choc to zalezy tez od rodzaju turnieju. Ta wartosc waha sie najczesciej od mniej wiecej 17 do 23%. To nie tylko moje wlasne zdanie, to opinia oparta na wypowiedziach i zapiskach przynajmniej kilkunastu innych \"rasowych\" graczy turniejowych z 2 bractw. Tym danym mozna wierzyc, bo sa to dane empiryczne, a nie zadne gdybanie.[BR][BR]Podsumowujac, efekty militarne Kociolka i Feniksa Zmierzchu to nie ta sama liga, tu naprawde nie ma czego ze soba porownywac, a juz dojscie do wniosku, ze Kociolek ma wiekszy potencjal, to jakies kuriozum, swiadczace o kompletnym braku zrozumienia mechanizmow i zasad dzialania roznych efektow gry. Albo po prostu o braku doswiadczenia, przy jednoczesnym udawaniu, ze takowe sie posiada.[BR][BR]Juz na zakonczenie napisze tylko, ze przeszkadza mi tez zupelnie swiadome i celowe manipulowanie liczbami. Przyklad:[BR]Ovocko napisał:\t\t\tJeśli nasze straty będą wynosić 50%, to tak liczona \"wydajność\" feniksa zmierzchu spadnie do 10%.\t\tKliknij aby rozwinąć...Nie znam nikogo, kto klikalby turnieje ze srednimi stratami rzedu 50% wystawianego wojska, bo chyba doslownie nikt w tej grze nie moglby sobie na cos takiego pozwolic. Swiadomie podajesz przyklady liczbowe kompletnie oderwane od rzeczywistosci, zeby podane przez ciebie liczby lepiej pasowaly pod dana teze. A to juz po prostu zwykla manipulacja."}, {"9": "A maszynka do losownia jest niezle kopnieta.[BR]Mialem 26 i 16 % szans na wojsko a wylosowalo mi 4 Puchary z rzeczmai poniez 8% :-([BR]Moze ma zanczenie ze wybralem 3 skladniki 6lvl, nastepnym razem sprobuje conajmniej 4"}, {"3": "skuter napisał:\t\t\tMoze ma zanczenie ze wybralem 3 skladniki 6lvl, nastepnym razem sprobuje conajmniej 4\t\tKliknij aby rozwinąć...[BR]Moim zdaniem nie ma co przesadzać z ilością składników, bo im więcej składników tym więcej efektów w palecie, a co za tym idzie tym większe szanse, że trafi się coś niechcianego. Najlepiej jest chyba celować w 1-2 efekty, i dobierać z jak najmniejszej liczby składników się da.[BR][BR]Andrzej M napisał:@Ovocko  w moim feniksie pisze , że zwraca procent poległych jednostek a mając go rozbudowanego na max ta ilość jest podana w wysokości 5% a według Ciebie zwraca odsetek wystawionych jednostek i zdaje się , że te dwie wartości różnią się[BR]Właśnie to sprawdziłem , bo mogłem źle pamiętać[BR]Może wyjaśnisz tą różnicę ?\t\tKliknij aby rozwinąć...[BR]Wybacz, dopiero dziś zauważyłem to pytanie.[BR]Feniks zwraca jednostki poległe, ale bazą jest ilość jednostek jakie wystawiłeś w danym oddziale (a nie ilość strat). Mówiąc obrazowo, jeśli wystawisz do walki oddział o rozmiarze 1000 jednostek, to maksymalnie odzyskasz 50 jednostek (5% z 1000), niezależnie od tego czy Twoje straty będą wynosić 50, 100, 500, czy cały 1000. Jeśli straty będą wynosić mniej niż 5% (czyli w naszym przykładzie, np. 30 jednostek) to wtedy odzyskasz tylko tyle.[BR]Każdy oddział jest liczony z osobna, więc jeśli wystawicz 5 oddziałów po 1000 sztuk, ale straty będziesz miał tylko w jednym, odzyskasz maksymalnie 50 sztuk wojska (5% jednostek wystawionych w oddziale, który miał straty).[BR]Dlatego właśnie określanie skuteczności feniksa jako procenta strat jest o tyle niemiarodajne, że odnosisz się do bazy (strat), która jest zupełnie inna niż faktyczna (wielkość oddziału).[BR]Tym samym jest to trochę tak, jakbyś kolejno zważył 10 jabłek, by potem na tej podstawie ustalać przeciętną wagę... gruszek. Możesz sobie robić te pomiary na setkach jabłek i z dokładnością do miligrama, ale nadal nie dowiesz się z nich niczego sensownego na temat wagi gruszek.[BR]W przypadku feniksa, odnoszenie się do wielkości strat nie odpowiada np. na pytanie, czy bardziej opłaca się nakarmić feniksa, czy brunatnego. Zarazem (jak już wskazałem powyżej) wystarczy obniżyć wielkość strat (np. dosypując wzmocnień), by sobie natychmiast w ten sposób liczoną \"wydajność\" feniksa poprawić, mimo, że realnie nie uzyskamy dzięki temu ani jednej sztuki wojska więcej (a w pewnych przypadkach nawet mniej, bo więcej oddziałów będzie miało straty mniejsze niż 5% próg) [smilie--sprite8][BR][BR]--------------------[BR]Wracając do tematu kociołka:[BR]Zrobiłem sobie dziś warzenie i losowanie, uzyskałem dosyć ciekawe efekty. Co prawda trafiłem tylko na jeden interesujący mnie efekt (liczyłem na co najmniej dwa), za to otrzymałem go w mocy i czasie znacznie przekraczającym parametry nominalne.[BR]Efekt miałem podniesiony na 50 lvl (13,8% wzmocnienia siły ataku, przez 6:54h), tymczasem uzyskałem go w mocy 22,3% z czasem ponad 16h.[BR]Jeśli to tak działa niezależnie od mocy, to oznacza, że przy 100lvl można trafić na efekt o mocy rzędu 40%+ i mieć go przez ponad 24h, a to już, powiedziałbym, jest całkiem przyzwoity wynik.[BR]Tym bardziej, że jest również spora szansa na wylosowanie więcej niż jednego interesującego efektu (np. dwóch lub trzech), co sprawia, że porównanie typu \"efekt kociołka to X% wzmocnienia) nie jest już takie jednoznaczne.[BR]Pytanie tylko jak często będzie się zdarzać, że wylosujemy więcej niż jeden interesuący nas efekt (u mnie na 2 próby mam 50% takich przypadków [smilie--sprite2] )[BR][BR]Dopisek: drugi wylosowany efekt też jest mocniejszy od nominalnego. Na drugim świecie nie uzyskałem nic (więc taka sytuacja też się zdarza), natomiast na trzecim znowu uzyskane efekty (trzy) są mocniejsze od nominalnych wartości."}, {"4": "Czyli info w feniksie jest sfałszowane [BR]Nie powinni pisać , że zwraca % poległych , bo to mylące"}, {"3": "Andrzej M napisał:\t\t\tCzyli info w feniksie jest sfałszowane[BR]Nie powinni pisać , że zwraca % poległych , bo to mylące\t\tKliknij aby rozwinąć...[BR]Aż tak bym nie powiedział, bo zwraca poległe jednostki (jeśli nie masz poległych, nie dostaniesz nic), tylko baza od której liczy się wielkość zwrotu jest inna (de facto korzystniejsza). Ale zerknąłem na opis, rzeczywiście jest mylący, bo tam jest wprost o \"odsetku poległych jednostek\"."}, {"11": "Ovocko napisał:\t\t\tEfekt miałem podniesiony na 50 lvl (13,8% wzmocnienia siły ataku, przez 6:54h), tymczasem uzyskałem go w mocy 22,3% z czasem ponad 16h.\t\tKliknij aby rozwinąć...Poproszę o screena. Efekt o którym mówisz powinien być jeszcze aktywny, więc chętnie zobaczę na własne oczy czy to prawda."}, {"3": "Charlene napisał:\t\t\tPoproszę o screena. Efekt o którym mówisz powinien być jeszcze aktywny, więc chętnie zobaczę na własne oczy czy to prawda.\t\tKliknij aby rozwinąć...Ech, niedowiarki...[BR][BR]W zasadzie, biorąc pod uwagę sposób w jaki odnosisz się do ludzi na forum, oraz pogardę jaką wobec nich prezentujesz, powinienem cię wysłać na drzewo i napisać żebyś se sama sprawdziła (to w końcu parę kliknięć by coś sobie uwarzyć i zobaczyć co wyszło).[BR][BR]Niemniej przyda się to też innym, więc proszę bardzo:[BR][BR][BR][BR][BR]Na screenie efekt widoczny jest jakby miał 55 lvl, bo w międzyczasie zdążyłem go już podciągnąć o 5 poziomów, a tutaj pokazuje numer zgodny ze stanem aktualnym a nie tym, jaki był w momencie losowania. Niestety mocy efektów nie dociąga do tego poziomu, zostają takie same jak w czasie picia mikstury [smilie--sprite1][BR] (@jarq , może by to zgłosić jako błąd, bo choć jest to mało istotny szczegół, to cokolwiek mylący)[BR][BR]Niemniej widać wyraźnie, że zarówno czas trwania (dłuższy nawet od teoretycznie maksymalnych 12h dla 100lvl) jak i moc efektu mają się nijak do tego, co powinienem uzyskać zarówno na 50lvl jak i nawet na 55lvl."}, {"50": "Witajcie [smilie--sprite1] Ja też miałam mocniejszy Efekt do Ziaren. Na 83 lvl. dał mi 30% do zbioru przez 48h."}]