[{"46": "hey,[BR]możliwe, że to efekt działania drugiego czynników kotła. o ile pamiętam (już użyłem więc nie ma dostępu) jest tam coś o szansie na sukces i \"efekt krytyczny\" - i tego nie rozumiem jak to działa. Ktoś wie co to daje ?"}, {"3": "Acca napisał:\t\t\they,[BR]możliwe, że to efekt działania drugiego czynników kotła. o ile pamiętam (już użyłem więc nie ma dostępu) jest tam coś o szansie na sukces i \"efekt krytyczny\" - i tego nie rozumiem jak to działa. Ktoś wie co to daje ?\t\tKliknij aby rozwinąć...[BR]Jeśli dobrze rozumiem, to szanse na sukces określają prawdopodobieństwo że w ogóle Ci coś wypadnie z kociołka (bywają przecież kielichy puste), a efekt krytyczny to sytuacja, gdy dostaniesz maksymalną możliwą moc danego efektu, ewentualnie trafisz w punkt z tym, co się powinno trafić.[BR][BR]Wczoraj zrobiłem sobie zrzuty z kranu przed warzeniem (już przy poprzedniej rundzie wydawało mi się, że niektóre efekty są mocniejsze od zakładanych) i później to sobie sprawdziłem. Okazało się, że moc większą od nominalnej można uzyskać już na etapie mieszania, na przykład te 22,3% wzmocnienia dla obozu najemników, które uzyskałem, pokrywa się z tabelką pokazującą się przed warzeniem:[BR][BR][BR][BR]Wcześniej na to nie zwracałem uwagi, bo bawiąc się w mieszanie składników ograniczałem się raczej do 1-2 każdego typu (wydaje mi się, że wtedy siła efektu jest taka sama jak to wynika z jego poziomu), a kiedy na serio zabrałem się za ustalanie rodzaju oraz ilości skupiałem się na prawdopodobieństwie i nie zwracałem po prostu uwagi na to jak zmienia się siła i czas.[BR]Widać tu, że te 40%+ wzmocnienia jest całkiem realne do osiągnięcia, bo już teraz jeden z efektów miał potencjalnie 36,4%, a żadnego nie mam jeszcze na 100 lvl.[BR]Natomiast patrząc na pierwszy efekt z listy (czyli ten, który uzyskałem), wg tabelki powinien trwać 11:07h, a u mnie wypadł z okresem powyżej 16h. Czyli wahnięcia w stosunku do teoretycznych wartości mogą być zarówno in minus, jak i in plus.[BR][BR]Uwarzyłem już mikstury na wszystkich światach, więc teraz z dalszym kombinowaniem z mieszaniem składników muszę poczekać do weekendu. Nie wiem od czego zależy to, że siła efektu podbija się w stosunku do teoretycznej - od tego ile różnych składników wrzucimy do kotła, ile sztuk ich wrzucimy, albo ile sztuk wrzucimy poszczególnego z nich?[BR]Trzeba się tym pobawić, bo temat jak widać jest rozwojowy [smilie--sprite6]"}, {"50": "Taka informacja jest w opisie Kotła -[BR] \"- Fragmenty Zaklęć: Dodanie ich do mikstury zwiększa „szansę na efekt krytyczny”, czyli szansę na uzyskanie szczególnie dobrego i potężnego efektu. Można je zdobyć, odczarowując przedmioty lub budynki zdobyte podczas wydarzeń lub grając aktywnie w Iglicy co tydzień\".[BR]Wygląda na to, że fragmenty zaklęć nie tylko pomagają w wylosowaniu Efektu tzn. żeby Puchary nie były puste, ale też wzmacniają ten Efekt. Trzeba czekać do Niedzieli [smilie--sprite1]"}, {"3": "Może być, że siła efektu podbija się po dodaniu fragmentów zaklęć.[BR]W zeszłym tygodniu zaklęć nie dodawałem w ogóle, bo stwierdziłem, że na pierwszym poziomie efektów nie ma to sensu.[BR]To by też tłumaczyło, dlaczego nie zauważyłem zmian podczas mieszania składników - fragmenty zaklęć dorzuciłem na samym końcu i wtedy już zupełnie nie patrzyłem na to, co jest w tabelce (zakładałem, że nic się nie zmieni, a tylko szanse na efekt krytyczny będą rosnąć)"}, {"4": "Ovocko napisał:\t\t\tAż tak bym nie powiedział, bo zwraca poległe jednostki (jeśli nie masz poległych, nie dostaniesz nic), tylko baza od której liczy się wielkość zwrotu jest inna (de facto korzystniejsza). Ale zerknąłem na opis, rzeczywiście jest mylący, bo tam jest wprost o \"odsetku poległych jednostek\".\t\tKliknij aby rozwinąć...No właśnie - poległych , czyli błąd w opisie [BR]Znam ten opis , bo ciągle go czytam (co najmniej 2-3 razy w tygodniu na pl2 i często na pl1 i pl3 , jak karmię tego ptaka) i ciągle uważałem , że to tylko kilka % z tego , co zginęło , ale w takim przypadku ma on większą wartość , niż wynika z opisu"}, {"44": "Ovocko napisał:\t\t\tDlatego właśnie określanie skuteczności feniksa jako procenta strat jest o tyle niemiarodajne, że odnosisz się do bazy (strat), która jest zupełnie inna niż faktyczna (wielkość oddziału).\t\tKliknij aby rozwinąć...Okreslanie skutecznosci Feniksa Zmierzchu jako procenta realnych strat i to w przekroju calego turnieju to wlasnie jedyny sensowny sposob oceniania faktycznej, a nie tylko nominalnej mocy Feniksa.[BR][BR]Ovocko napisał:\t\t\tTakie przeliczenie nie odpowiada np. na pytanie, czy bardziej opłaca się nakarmić feniksa, czy brunatnego\t\tKliknij aby rozwinąć...Jak wyzej, takie przeliczanie, oparte na danych empirycznych, to jedyny sposob, by na takie pytanie konkretnie odpowiedziec. Jesli wiemy, ile % strat Feniks realnie zwraca, dopiero wtedy mozemy to porownac do wydajnosci brunnera. To relatywnie proste - znajac calosc naszych strat w turnieju z danego tygodnia i wiedzac, ile % z tych strat realnie zwraca nam Feniks, mozemy to bezposrednio porownac do wysokosci dodatkowej produkcji z brunnera w tej samej jednostce czasu. Jesli z brunnera uzyskamy mniej jednostek, to wniosek jest oczywisty - w danym turnieju to Feniks przyniosl nam wiecej korzysci i odwrotnie - jesli dzieki brunnerowi uzyskalismy wiecej jednostek, to wieksze korzysci przyniosl nam brunner. W kazdym razie w praktyce, jesli gracz robi wiekszosc turniejow na 10 do 20k, brunner i Feniks Zmierzchu to budynki mniej wiecej tego samego kalibru. Z takimi wartosciami, jakie mamy obecnie, pod katem praktycznej przydatnosci efekty militarne Kociolka sa od tego kalibru dosc mocno oddalone, delikatnie rzecz ujmujac.[BR]Jeszcze raz powtorze, ze wszystko to, co tu napisalem, to nie zadne gdybanie i teoretyzowanie, tylko moja wypowiedz oparta jest na doswiadczeniach i danych empirycznych zbieranych przez dlugie miesiece w 2 bractwach turniejowych."}, {"3": "Patrząc na wyniki ulepszania zaklęć, dość łatwo jest podnieść 3 do 5 efektów do 50-70 poziomu. Później robi się trudniej, bo cały czas rosną koszty zarówno kupowania jak i ulepszania.[BR][BR]Warto się zastanowić nad zbalansowaniem ilości dyplomów za ukończenie rozdziałów.[BR]Z jednej strony, im mniej dyplomów, tym mniej efektów w poszczególnych składnikach, więc prawdopodobieństwa są wyższe (suma prawdopodobieństw efektów danego składnika jest zawsze ta sama, niezależnie czy mamy np. 1 czy 8 efektów).[BR]Z drugiej, odblokowanie kolejnych dyplomów zwiększa ilość punktów wiedźmy, obniża koszty warzenia oraz obniża koszty ulepszania składników.[BR]Czyli odblokowując kolejne dyplomy sprawiamy, że musimy więcej składników wrzucić do kotła, by osiągnąć sensowne prawdopodobieństwo efektu, ale z drugiej strony składniki są tańsze (więc mamy możliwość użycia ich większej ilości), zarazem taniej jest podbić siłę i czas trwania efektu.[BR]//[BR]OK, wychodzi na to, że maksymalna moc jaką można wycisnąć z danego efektu jest około 3x większa od tej, która wynika z aktualnego poziomu ulepszenia. Dla 96 lvl wygląda to tak:[BR][BR][BR][BR]Ale koszt takiego zwiększenia mocy jest monstrualny, więc raczej się nie opłaca  [smilie--sprite6][BR][BR]połączono//Urdur"}, {"8": "Ovocko napisał:\t\t\tW tej grze jest całkiem sporo elementów które działają bardzo dobrze lub bardzo słabo w zależności od tego, jak sobie skonfigurujemy miasto, oraz z jakimi innymi elementami je połączymy.[BR]Sam swego czasu wywaliłem kryształową latarnię jako \"bezużyteczną\", po czym stawiałem ją od nowa, gdy okazało się że jest krytycznym cudem jeśli chce się osiągnąć premię kultury na poziomie kilkuset procent (Swoją drogą, dzięki @BlossomValvi i @blazius1, bo to dzieś w rozmowach z Wami ten temat wypływał).\t\tKliknij aby rozwinąć...Ano właśnie. Kryształowa Latarnia jest bodaj najważniejszym cudem budującym Premię do Kultury. Pierwsze skasowanie tego cudu i stawianie go od nowa pokazało ten fenomen dobitnie.[BR]I nawiązując - podobnie jest  u mnie z Feniksem Zmierzchu. Może być lepszy niż się wydaje.[BR]Ptak ten jest niby wojskowy, ale jest tym lepszy, im mniej wojskowe masz miasto. Im mniej bazujesz na karmionym Brunatnym, tym większa rola karmionego Zmierzchu.[BR]Nawet jeśli w strategii bazujesz na negocjowaniu i ucztowaniu, to używasz też wojska. Więc jeśli Ptasior Zmierzchu zmniejszy realne straty twoich nielicznych wojsk, to może być nawet kluczowym Feniksem w mieście ekonomicznym. Zaraz po Burzowym i Ognistym. U mnie jest.[BR][BR]Zmierzchu karmię częściej niż Brunatne. Zwłaszcza że Brunatne są dość kosztowne w obsłudze jeśli chodzi o przyspieszenia czasowe.[BR][BR]Zrezygnowałem ze Złotego. Karmię Ognistego, Zmierzchu, oczywiście Burzy(!) oraz okazyjnie Niedźwiadki Brunatne.[BR][BR]I wielka tylko szkoda że mechanika Kociołka jest tak pomyślana, żeby żaden gracz nie miał szansy na, powiedzmy, korektę strategii swojej gry.[BR]Żeby cokolwiek w niej zmienić. A Ptasior Zmierzchu już taki potencjał posiada.[BR][BR]Przydatność Zmierzchu spada wraz z ilością Brunatnych. Taki żarcik, zapewne mało śmieszny, dla graczy zmierzających do postawienia pierwszego (i jedynego) Brunatnego."}, {"3": "blazius1 napisał:\t\t\tAno właśnie. Kryształowa Latarnia jest bodaj najważniejszym cudem budującym Premię do Kultury. Pierwsze skasowanie tego cudu i stawianie go od nowa pokazało ten fenomen dobitnie.\t\tKliknij aby rozwinąć...[BR]Tak, choć trzeba pamiętać, że tu wchodzi jeszcze kwestia tego, że niektóre cuda \"rosną\" wraz z rozwojem miasta (czytaj: ich efekt ma coraz istotniejszy wpływ na miasto), niektóre zaś się \"kurczą\" (siła efektu słabnie wraz z rozwojem miasta).[BR]Latarnia należy do pierwszej z tych kategorii - w niskich rozdziałach jej efekt nie jest aż tak krytyczny, nawet jeśli rozbudujesz ją do relatywnie wysokiego poziomu. Robi się natomiast bardzo istotna wraz z odkryciem latarni sąsiedztwa.[BR][BR][BR]blazius1 napisał:\t\t\tI nawiązując - podobnie jest  u mnie z Feniksem Zmierzchu. Może być lepszy niż się wydaje.[BR]Ptak ten jest niby wojskowy, ale jest tym lepszy, im mniej wojskowe masz miasto. Im mniej bazujesz na karmionym Brunatnym, tym większa rola karmionego Zmierzchu.[BR]Nawet jeśli w strategii bazujesz na negocjowaniu i ucztowaniu, to używasz też wojska. Więc jeśli Ptasior Zmierzchu zmniejszy realne straty twoich nielicznych wojsk, to może być nawet kluczowym Feniksem w mieście ekonomicznym. Zaraz po Burzowym i Ognistym. U mnie jest.\t\tKliknij aby rozwinąć...(...)[BR]blazius1 napisał:\t\t\tPrzydatność Zmierzchu spada wraz z ilością Brunatnych. Taki żarcik, zapewne mało śmieszny, dla graczy zmierzających do postawienia pierwszego (i jedynego) Brunatnego.\t\tKliknij aby rozwinąć...[BR][BR]Ja to widzę jednak trochę inaczej.[BR]Porównując opłacalność brunatnego vs. feniksa trzeba mieć na uwadze to, że oba te budynki mają zupełnie inne zasady produkcji oraz co z tych różnic wynika.[BR][BR]W przypadku brunatnego wygląda to bardzo prosto - ilość dodatkowego wojska w przeliczeniu na 1 karmienie zależy od tego, jak mocno uda Ci się wydłużyć kolejkę wojska, bo to w oczywisty sposób przekłada się na to, jak często musisz po tę karmę sięgać. Karmienie brunatnego ma ten walor, że przy kolejce wojska wynoszącej X, karmiąc go zawsze uzyskasz Y jednostek, niezależnie od tego kiedy i czy w ogóle te jednostki wykorzystasz.[BR][BR]Tymczasem opłacalność feniksa zmierzchu zależy mocno od tego, jak dużą liczbę wojska rzucisz do walki, czyli na jakim poziomie robisz turniej. Ponieważ ilość wojska, które potrzeba wystawić do walki rośnie wraz z każdą kolejną prowincją, tak samo rośnie też ilość (nie procent) wojska odzyskanego przez ten budynek.[BR]Im mniej prowincji robisz, tym mniej wojska odzyskasz na jednym karmieniu, przy czym jeśli dobrze pamiętam, to stosunek wypadał circa 1:3 (czyli ilość wojska do odzyskania w prowincji np. 20 wynosi mniej więcej tyle, co suma ilości wojska do odzyskania w prowincjach 17-19, przy założeniu tej samej struktury strat).[BR]W konsekwencji opłacalność karmienia zależy mocno od tego, czy robisz w turnieju 10, 20, czy 70 prowincji.[BR][BR]Drugim (a w sensie ważności - nawet pierwszym) parametrem, który określa opłacalność karmienia jest CAL, bo ten przekłada się na bazową wielkość oddziału w turnieju. Tutaj paradoksalnie fenis w pewnym sensie premiuje graczy, którzy nie mają miast zoptymalizowanych pod turniej, bo działa to podobnie jak z robieniem prowincji - im niższy CAL tym mniejszy oddział a co za tym idzie tym mniej sztuk wojska odzyskasz; im wyższy CAL, tym oddział większy i tym więcej odzyskasz dzięki feniksowi*.[BR][BR]* - to oczywiście uproszczenie, bo im większy oddział tym większe masz straty jako takie, natomiast wyliczając \"ile jednostek wojska odzyskam z turnieju gdy nakarmię feniksa\", tak to akurat wychodzi.[BR][BR]Ogółem feniks najbardziej opłaca się tym, którzy robią turniej na bardzo wysokim poziomie, zwłaszcza takim, którzy np. zbierają przez dłuższy czas wojsko na jeden wybrany turniej (znowu działa zasada, że wielkość zwrotu jest wprost proporcjonalna do ilości zaangażowanych jednostek ogółem).[BR][BR]Kiedyś to sobie liczyłem dla mojego miasta i - jeśli dobrze pamiętam - wyszło mi, że aby feniks przebił pod względem opłacalności brunatnego, musiałbym robić co najmniej 60 prowincji w turnieju, i to przy założeniu, że struktura strat jest zrównoważona (czytaj: w każdej walce mam straty i są one rozłożone proporcjonalnie tak, że z każdego oddziału odzyskałbym te 5%).[BR]Problem w tym, że taka sytuacja rzadko ma miejsce, najczęściej masz straty w jednym/dwóch oddziałach na 5, poza tym w początkowych prowincjach strat nie masz w ogóle albo poniżej 5%.[BR]W efekcie realna \"wydajność\" feniksa będzie mocno niższa od tej teoretycznej (o ile, to już się trzeba odwołać do empirii), podczas gdy przychód z brunatnego, dla miasta o określonych parametrach, jesteś w stanie wyliczyć co do sztuki.[BR][BR]Trzeba tu pamiętać, że raczej nie optymalizuję swojego miasta pod CAL (co, jak pisałem wyżej \"premiuje\" feniksa), natomiast bardzo mocno optymalizuję produkcję wojska pod brunatnego (dość powiedzieć, że kolejka produkcji wojska wynosi u mnie powyżej 4 dni), co z kolei premiuje brunatnego.[BR]Im bardziej miałbym miasto zopymalizowane pod niski CAL, tym feniks by wypadał gorzej na tle brunatnego; z kolei, im krótszą miałbym kolejkę produkcji, tym brunatny traciłby swoją przewagę nad feniksem.[BR][BR]W praktyce więc brunatne karmię regularnie, natomiast feniksa zmierzchu jak czasem. Zazwyczaj dopiero w tych turniejach, gdzie mamy trzy jednostki dominujące u przeciwnika (eliksir-klejnoty), czasem tam gdzie są dwie (kryształ-jedwab), i (chyba) nigdy tam gdzie jest jedna (marmur-drewno).[BR]Problemu z przyśpieszaczami nie mam, bo przy systemie 1 kompletu wzmocnień/2 turnieje jeden cykl produkcji (dłuższy) robię bez przyśpieszaczy w ogóle, w drugim zaś (krótszym) dodaję ich tylko tyle, by czas produkcji wojska zrównał się z dłuższym cyklem. A ponieważ nie zużywam przyśpieszaczy np. w iglicy, ostatecznie zwykle zużywam ich mniej, niż mi w okresie tych dwóch tygodni wpada do inwentarza.[BR][BR]Natomiast w miastach, gdzie robię między 15 a 25 prowincji per turniej, nie karmię ani feniksa, ani brunatnego.[BR][BR][BR]blazius1 napisał:\t\t\tI wielka tylko szkoda że mechanika Kociołka jest tak pomyślana, żeby żaden gracz nie miał szansy na, powiedzmy, korektę strategii swojej gry.[BR]Żeby cokolwiek w niej zmienić. A Ptasior Zmierzchu już taki potencjał posiada.\t\tKliknij aby rozwinąć...[BR]Ale tylko w jednym kierunku  [smilie--sprite2][BR]Kogoś, kto idzie ścieżką \"wojskową\" feniks zmierzchu raczej nie skłoni do pójścia drogą handlową."}, {"8": "Myślę że jakimś poważnym argumentem za zmianą zejścia ze ścieżki mocno wojskowej na handlową byłyby nagły brak czasu na klikanie turniejów.[BR]Czynnikiem ważnym jest czas poświęcany grze i powiedziałbyn tutaj, że im niej go chcesz spędzić na klikaniu, tym więcej ważnych budynków ewolucyjnych powinieneś stosować. Warto poświęcić czas na ich zdobycie.[BR][BR]Ja stosuję Feniksa Zmierzchu często, ale spędzam w grze stosunkowo mniej czasu niż gracze turniejowi.[BR]Stąd taka gospodarka karmą, a nie inna.[BR]Podejrzewam, że gracze częściej odwiedzający Akademię magii mają troszkę więcej karmy. Wtedy nawet z takiego powodu inne będą decyzje którego Feniksa karmić i w której kolejności.[BR]A priorytetem u mnie nadal i tak jest karmienie Feniksa Burzowego. A Zmierzchu i tak może mieć zastosowanie w mieście ekonomicznym."}, {"51": "Kocioł to jednak najjj bardziej kosztowny sposób rozwoju nie adekwatny do zysku, aby uzupełnić kocioł w krótkim czasie przekraczają zyski z miasta. Kupowałem wiedźmowe punkty za monety z każdym punktem czy surowcem wysokość rośnie, z czasem przekroczy dochody miasta [smilie--sprite3]("}, {"8": "Znaczy : przekroczy pojemność Skarbca?"}, {"3": "Tylko że punkty można kupować nie tylko za monety i młotki.[BR]Już wyżej pisałem, kociołek premiuje graczy znajdujących się dalej w rozwoju, i ci mogą dość szybko dorobić się całkiem niezłych korzyści.[BR]Po pierwsze dlatego, że odblokowywanie kolejnych dyplomów obniża koszty (działa to tak, jak w przypadku badań na obniżenie kosztu zwiadu), po drugie zaś, przy odpowiednim zestawieniu cudów mają spore pole manewru by uzyskać dodatkowe zasoby do wymiany nawet gdy osiągną limit na młotki/monety (typu: wymienić młotki/monety na towary korzystając z rozbudowanej gildii, uzyskać manę dzięki opactwu itd., itp.)[BR][BR]W mieście, gdzie mam 20 dyplomów dość szybko uzyskałem pułap rzędu 80lvl dla 5 wybranych efektów, przy czym jeden z nich podciągnąłem do 97 lvl. Uważam, że jak na 3 rundy kotła od momentu jego uruchomienia, to całkiem nieźle. Jakby porównać to z cudami (dla mnie kociołek to taki dodatkowy cud, tyle że nie zajmujący miejsca), to raczej nie zdarzyło mi się, by jakiś cud udało się rozbudować w podobnym tempie.[BR][BR]W miastach na niższych poziomach idzie to wolniej, ale tam również po 3 tygodniach wybrane efekty (zazwyczaj 3) mają poziomy rzędu 70lvl.[BR][BR]Innymi słowy, dość szybko można uzyskać w kotle pułap, który pozwoli osiągnąć zauważalne efekty (podkreślam:  zauważalne, czyli niekoniecznie istotne, ale takie, które nie są zupełnie pomijalne). Potem to już rzeczywiście raczej powolny rozwój wybranych efektów."}, {"51": "Na razie czekam na odblokowanie 14 dyplomu. Jak do tej pory zysków jakich takich nie notowałem. Produkcja trwa zbyt krótko"}, {"3": "Trudno to komentować nie wiedząc ile masz podniesionych efektów i na jaki poziom.[BR][BR]Ja celowałem w efekty wojskowe, jak na razie dość często udaje mi się uzyskać dwa interesujące mnie efekty z jednego warzenia, twające po kilkanaście godzin - czyli akurat by wystarczyły na turniej.[BR]Przy efektach na towary nie wypowiem się, nie liczyłem na ile są opłacalne."}, {"51": "Oto kilka z rzutek obrazu kotła może teraz coś wymyślisz "}, {"3": "Z tego co widzę, masz dużo efektów podniesionych na niezbyt wysoki poziom. [BR]Przy 13 dyplomach skupiłbym się na maksymalnie 3 efektach, ale podniósłbym je na co najmniej 50 lvl. [BR]Dopiero póżniej zastanowiłbym się czy podnosić kolejne, czy dalej inwestować w te trzy wybrane.[BR][BR]monety na 20 lvl dają 19,5% wzrostu przez 9:45h, natomiast na 50 lvl dają już 35% wzrostu przez 17:15h; podobnie z towarami.[BR]Jak będziesz miał trochę szczęścia, możesz trafić w efekt trwający 24h lub więcej (maks co można uzyskać to mniej więcej 3x długość/moc nominalną)[BR][BR]U mnie wygląda to tak, przy czym pamięaj, że efekty wojskowe mają krótszy czas trwania od tych dla towarów i monet. [BR][BR][BR][BR]Przy 20 dyplomach mam podniesione 5 efektów, natomiast przy warzeniu staram się wycelować w dwa, maksymalnie trzy, wtedy jest w miarę pewność, że trafię w te dwa o które mi chodzi. Przy zbyt dużej palecie prawdopodobieństwa są na tyle wyrównane, że trafia się nie w to o co chodziło."}, {"51": "Dzięki za info spróbuje podnieść monety i surowce."}, {"6": "Zauważyłem, że kocioł mocno zwiększa produkcję ziaren/unurytu wszystkich budynków w tym ewolucyjnych i zestawów.[BR]Nakarmiony szop mi 50k ziaren dał...[BR][BR]Od razu przypomina mi się akcja z tym, że relikty działały na produkcję żywych towarów przez Sowy... [BR]Ciekawe ile ten efekt kociołka się utrzyma w obecnej formie"}, {"3": "W przypadku unurytu i ziaren właściwie nie ma \"zwykłych\" budynków produkcyjnych (poza kupcem), więc jeśli ten efekt w ogóle ma mieć jakiś sens, to musi działać również na zestawy i ewolucyjne. Inaczej to by zwyczajnie nie miało sensu, robić efekt dla kupca i kilku \"zwykłych\" budynków kulturowych na krzyż?"}]