[{"143": "Dear Humans and Elves,[BR][BR]Our new Chapter: Team Spirit has just arrived! Please see the full announcement here and let us know what you think about it![BR][BR]Kind regards,[BR]Your Elvenar Team"}, {"37": "All the buildings in my database portal have been regenerated to contain the chapter 18 values data. Taking a closer look at new values, it seems like this chapter brings a very interesting increase in mana productions (thanks recent Lava eggs), as well as the sentient goods productions in evolving buildings (new phoenix was given more than 3x increase).."}, {"16": "iDavis said:\t\t\tas well as the sentient goods productions in evolving buildings (new phoenix was given more than 3x increase)\t\tClick to expand...If this is not a bug, as spire set got ~ same increase for the whole 6 upcoming chapters (ch23 numbers)."}, {"59": "I already see that i won't be putting this huge 2nd ancient wonder with tragic effect in my city, it should be unurium decay lowered and scout time decreased.[BR][BR]First one is lovely and small, i think 2nd smallest wonder after golden abyss[BR][BR][IMG]https://i.ibb.co/wwVxph5/https-beta-forum-elvenar-com-index-php-attachments-1617907442572-png-8856.png[/IMG][BR][BR]Oh wow"}, {"164": "Arthus said:\t\t\tI already see that i won't be putting this huge 2nd ancient wonder with tragic effect in my city, it should be unurium decay lowered and scout time decreased.\t\tClick to expand...what are the new wonders?"}, {"72": "[IMG]https://i.ibb.co/gP4zMT8/https-beta-forum-elvenar-com-index-php-attachments-1617908761826-png-8857.png[/IMG][BR][IMG]https://i.ibb.co/tYBXTWY/https-beta-forum-elvenar-com-index-php-attachments-1617908786691-png-8858.png[/IMG]"}, {"164": "The Fairy said:\t\t\tpics\t\tClick to expand...Thanks, I can see those too, but the size and formula isn't listed[smilie--sprite5]"}, {"72": "There are more details on mobile:[BR][IMG]https://i.ibb.co/g6wHpbk/https-beta-forum-elvenar-com-index-php-attachments-screenshot-20210408-211011-png-8859.png[/IMG][IMG]https://i.ibb.co/8zLjt7t/https-beta-forum-elvenar-com-index-php-attachments-screenshot-20210408-211019-png-8860.png[/IMG][IMG]https://i.ibb.co/S6K1tfB/https-beta-forum-elvenar-com-index-php-attachments-screenshot-20210408-211035-png-8861.png[/IMG][IMG]https://i.ibb.co/KjWMnfp/https-beta-forum-elvenar-com-index-php-attachments-screenshot-20210408-211045-png-8862.png[/IMG]"}, {"12": "Huhu! After how many provinces is the new limit in Chapter 18?"}, {"14": "SoggyShorts said:\t\t\tThanks, I can see those too, but the size and formula isn't listed[smilie--sprite5]Click to expand...Shrine of the Champions 3x4[BR]Temple of Spirits 7x4"}, {"65": "Jammin said:\t\t\tHuhu! After how many provinces is the new limit in Chapter 18?\t\tClick to expand...[BR][IMG]https://i.ibb.co/JrcQJFT/https-beta-forum-elvenar-com-index-php-attachments-1617910314212-png-8866.png[/IMG]"}, {"43": "Does anyone have “ascended goods“ boost in marble (the new boost)[BR]I would like to see the production picture, where you start 3 and 9 hours"}, {"34": "eltina said:\t\t\tDoes anyone have “ascended goods“ boost in marble (the new boost)[BR]I would like to see the production picture, where you start 3 and 9 hours\t\tClick to expand...[BR]Here's a screen grab of the production panel for the marble manufactory :[BR][BR][IMG]https://i.ibb.co/Mh5qFfw/https-beta-forum-elvenar-com-index-php-attachments-1617919128420-png-8873.png[/IMG]"}, {"165": "Has anyone figured out how exactly the merchant works?  Can it be used to fix trade imbalances, e.g. for scrolls?"}, {"14": "No, it works only for ascended goods."}, {"166": "little bee said:\t\t\tHas anyone figured out how exactly the merchant works?  Can it be used to fix trade imbalances, e.g. for scrolls?\t\tClick to expand...I am not so optimistic as announement, i think it will be even worse then sentient goods tardes here on beta[BR]you can hire 5 merchants with main hall level 39 costs are:[BR]1. 8 mil coins[BR]2. 40 mil coins[BR]3. 72 mil coins[BR]4. 100 diamonds[BR]5. 200 diamonds[BR]now you can choose to trade between different T7 in ratio only 1:1 and for level 39 main hall it is limited to 1800 ascended goods per merchant[BR]then if you send out merchant, you get instantly desired goods back, but your merchant is on 6 hour cooldown (you can use diamonds or time booster to overcome this) or until some other guy take your offer on trader, in that moment it should return instantly[BR]so basicly it forces all players to use trader pretty much all day long if they dont want to wait for 6 hours, in theory if players are trading all day long you need only 1 merchant, but i highly doubt it will be this easy[BR][BR]if you take look at settlement builds, they are insanely unbalanced, all 4 level 1 hubs ask exactly the same T7+ exactly the same T4, so if you happen on your server that you will be missing for example one kind of T7 you are completly screwed with 1 merchant and not even 5 will save you, you will be forced to use diamonds/timebooster to trade for this small amount[BR][BR]portal asks for 68k of T7 for level 2 and you can trade only 1,8k at a time, 38xtimes used merchant to get to that amount[BR]of course ascended goods decay, so it will be more trades till you are there if you dont make all 38 trades per 1 day[BR]duration of merchants is 20 days, then you need to pay hiring fee again[BR][BR]@Marindor there is a typo in announcement, it says that hiring time depends on MH level, while it should be hiring fee which depends on MH level, time is same for all MH levels."}, {"16": "As far as I understand announcement, you should still be able to trade ascended goods in old way without merchants?.."}, {"166": "only those 1800 trades somebody else has sent with their merchant[BR]so unless some power users dont spend many diamonds/time booster to flood market there will be max 3 trades per player per 6 hours per 1800 asc goods[BR]and since there is still 1 good missing in the trader and if you happen to be that lucky person to need exactly those then its worse then it was with sentient goods[BR][BR]and now imagine spire with ascended goods in rotation for negotiator only gameplay"}, {"5": "Karvest said:\t\t\tAs far as I understand announcement, you should still be able to trade ascended goods in old way without merchants?..\t\tClick to expand...[BR]Yes, that is how I read the announcement. You can place all the trades you want in the Trader, up to the normal max, and you can have these 5 merchant trades. The merchant trades give you the goods right away, but also show in the Trader for other people to take."}, {"9": "Karvest said:\t\t\tAs far as I understand announcement, you should still be able to trade ascended goods in old way without merchants?..\t\tClick to expand...I certainly hope so, otherwise ch18 players would mass quit.[BR]If dony's numbers are right, merchants are useless.[BR]1800 per 1 trade? That's nothing.[BR]In my main city T1-T6 trades i do are at least in 50k, often in 100K+, recently i did post some 11-T3 goods by 1M amount.[BR]And soon after i start producint T7, i expect trades starting amounts in 10K,20K+."}]