[{"169": "well, I can't say the trade issue is that annoying right now[BR]I suppose the \"no wholetrader for ascended goods\" didn't bother anyone but me?"}, {"75": "Well, \"no wholetrader for ascended goods\" does bother me too... But except for the obvious, I have no special ideas to add."}, {"176": "I was just having a look at the orc AW on EA and could someone explain to me what the numbers mean?[BR][BR]\t\t\thttps://www.elvenarchitect.com/buildings/details/b_ch18_aw1/\t\t[BR]The numbers on the chart for orcs per tournament point means even with a 10k tournament, you wouldn't even get one orc, even with a fully leveled AW."}, {"37": "@edeba the number is multiplied by the required culture in your city (the same with aw2)."}, {"176": "iDavis said:@edeba the number is multiplied by the required culture in your city (the same with aw2).\t\tClick to expand...Thanks, how does the production work?"}, {"152": "Lovec Krys said:\t\t\tThat might be because they probably think that the more obstackles they give us the more we enjoy the chapter. Or they just want to slow us down at all costs.\t\tClick to expand...[BR]A lot of people do want challenges, and I personally would not play this game without those challenges.[BR][BR](I had a longer rant, but really, that one sentence sums it up rather well.)"}, {"9": "@ekarat There is a difference between chalenge and slow them at all costs.[BR]And if you think that limiting trading is reasonable chalenge, it is similar to the FA getting back to the clickfest with rotating quests or NH getting to the old hand style.[BR]All are doable, but annoying."}, {"152": "Lovec Krys said:@ekarat There is a difference between chalenge and slow them at all costs.[BR]And if you think that limiting trading is reasonable chalenge, it is similar to the FA getting back to the clickfest with rotating quests or NH getting to the old hand style.[BR]All are doable, but annoying.\t\tClick to expand...[BR]I am reserving judgement until I see it in practice.  It performs a function as a release-valve for an oversupply.  The idea is that once things settle down, merchants shouldn't expire very often and that the trade bandwidth will not be the limiting factor.  But I want to see whether or not that is true in practice.[BR][BR]Anyway, my comment had nothing to do with trading, just the attitude."}, {"74": "Lovec Krys said:@ekarat ... or NH getting to the old hand style.[BR]All are doable, but annoying.\t\tClick to expand...NH?"}, {"9": "@spennyit NH = Neighbourhood help[BR][BR]@ekarat My negative attitude comes mainly from 2 years experience of devs' nerfing everything they can, making each new chapter more annoying and damaging to player's tourney/spire performance."}, {"152": "Lovec Krys said:@spennyit NH = Neighbourhood help[BR][BR]@ekarat My negative attitude comes mainly from 2 years experience of devs' nerfing everything they can, making each new chapter more annoying and damaging to player's tourney/spire performance.\t\tClick to expand...[BR]Which is what they should be doing.[BR][BR]On the other hand, I think they need to adjust their city level formula to punish tech less and other things more. As you develop your city, your capacity increases, so it is appropriate that they make tournaments more expensive for you. However, the penalty for tech is higher than you actually get, so that provides a disincentive to progress. By contrast, a good build of AWs will get more out of them than the 0.3% extra it costs you per AW level. So, there's a penalty, but one that's less than what you get in return.[BR][BR]Side note:  In game development, there is a saying that if you try to limit something by making it annoying to do, the players will do it anyway and hate you for it."}, {"176": "ekarat said:\t\t\tWhich is what they should be doing.[BR][BR]On the other hand, I think they need to adjust their city level formula to punish tech less and other things more. As you develop your city, your capacity increases, so it is appropriate that they make tournaments more expensive for you. However, the penalty for tech is higher than you actually get, so that provides a disincentive to progress. By contrast, a good build of AWs will get more out of them than the 0.3% extra it costs you per AW level. So, there's a penalty, but one that's less than what you get in return.[BR][BR]Side note:  In game development, there is a saying that if you try to limit something by making it annoying to do, the players will do it anyway and hate you for it.\t\tClick to expand...I still think that only the higher of the AWs for any chapter should count, premium expansions should not count, or count for much less, and the tournament difficulty is too steep, or maybe just count the first 10-20 premium expansions as they are and then no more count.  Seriously, they are enormously expensive and they hurt your squad size a lot in combination with everything."}, {"43": "When I look on the chapter 18 buildings[BR]I can se the price 13900 for the new acending goods.[BR]An other person in my FS must pay an other of the acending goods.[BR]The acending goods I shall pay, is it the acending I produce or must I get it from other person?[BR][IMG]https://i.ibb.co/hXhMwPt/https-beta-forum-elvenar-com-index-php-attachments-1619647949816-png-8974.png[/IMG][BR]This is my boost[BR][IMG]https://i.ibb.co/nMSt0Kd/https-beta-forum-elvenar-com-index-php-attachments-1619647907607-png-8972.png[/IMG][BR]On live I'm ready for chaper 18. Off this reason I like to be prepared.  Thanks"}, {"16": "You need T7+2 goods to build most of production buildings, so trading is required."}, {"43": "Karvest said:\t\t\tYou need T7+2 goods to build most of production buildings, so trading is required.\t\tClick to expand...[BR]thank[BR]I have look in research and I have count all goods that I need.[BR]and in research we all must use the same goods.[BR][BR]but the price for Building is different, it most depent off my boost.[BR][BR]Today I Can see that wiki is Update with chapter 18.[BR]When i look in wiki I can only see the picture off the new steel = ingots.[BR]I Think I need the Minerals from marble To get the 4 hub Building.[BR][BR]\t\t\thttps://en.wiki.elvenar.com/index.php?title=Team_Spirit\t\t[BR]sorry if I not write correct, english is not my language. ;-)"}, {"56": "Can someone run down the hall and show the live cities how to turn on Chapter 18 in the tech tree?  We had the quests show up yesterday, along with the new ability to earn an expansion with provinces, but no tech tree.  Today we had the announcement, along with a video, and still no Chapter 18.  We've had two or three updates while I've been online, and still nothing.  We have Chapter 18 with no tech tree in the live cities for the second day. [smilie--sprite11]"}, {"169": "Turbina said:\t\t\tWell, \"no wholetrader for ascended goods\" does bother me too... But except for the obvious, I have no special ideas to add.\t\tClick to expand...maybe I should explain why it bothers me.[BR]I feel this is one more nerf. To the blooming trader's guild this time.[BR]With the medal systems, you get 0 bonus for medal production because 1x1xx% = 1 rounded down. So strictly no gain in the portal production.[BR]Now without wholesaler, you also have no gain from  the \"better offers from the wholesaler effect\"; And since it's a world market, there is also no gain for the \"less commission effect\". I think the boomin,g trader guild should have some effect on the merchant's fee or the time between merchant offers.[BR]something! Anything!"}, {"122": "I've done a brief scan of the posts here and didn't see anyone commenting on this -  the quests are not self evident, at least to me they aren't . So for example \"Do 10 Trials\"  - what does that mean? what is considered a trial?  I've had the same issue with the an earlier (meaning 2 quests ago)...no idea what is being asked for.[BR][BR]I will say I've stumbled on what is wanted....but I still don't know what quest 2 times before this wanted - just that I some point I got enough of what ever was wanted. [BR][BR]So far I like the buildings and yes there are limitations, but isn't that sort of the point."}, {"169": "trial is one of type of medals"}, {"22": "[IMG]https://i.ibb.co/SmNMt80/https-beta-forum-elvenar-com-index-php-attachments-1619865765272-png-8978.png[/IMG]"}]