[{"176": "The the military upgrades making much of a difference?"}, {"9": "Ok, new stop quest (i have decided to waste the minerals after all):[BR][IMG]https://i.ibb.co/DKLGSW5/https-beta-forum-elvenar-com-index-php-attachments-1620111271005-png-8987.png[/IMG][BR]Since this building is costy and useless, this will probably be my final quest stop in this chapter.[BR]This quest should at least be declinable since the only use of PPs in this chapter is to replace this building with them.[BR]And I realy don't like to build 3 costy buildings just to do the quest (and destroy them right after building them)."}, {"5": "Lovec Krys said:\t\t\tAnd I realy don't like to build 3 costy buildings just to do the quest (and destroy them right after building them).\t\tClick to expand...[BR]Like in chapter 15, where you build the three middle buildings and the Vault of Wisdom, just to sell them right after, if you have enough portal profits to complete the rest of the chapter."}, {"9": "@Enevhar Aldarion I didn't build them."}, {"169": "i placed them in my inventory, I guess there will be another quest later with more of the same"}, {"38": "maxiqbert said:\t\t\ti placed them in my inventory, I guess there will be another quest later with more of the same\t\tClick to expand...Quest 33 will ask for 6 of them."}, {"5": "Lovec Krys said:\t\t\tI didn't build them.\t\tClick to expand...[BR]That was your choice. My choice is that on my first time through a chapter, I complete all of the quests because that is part of the story and the game. It is when my other cities go through the same content that I will ignore the tough quests and just get through the chapter without doing them. Besides, if someone has a Beta city in a newly released chapter, aren't they supposed to be doing all the quests, or the whole looking for bugs things is pointless, if they are not testing everything."}, {"169": "Enevhar Aldarion said:\t\t\tThat was your choice. My choice is that on my first time through a chapter, I complete all of the quests because that is part of the story and the game. It is when my other cities go through the same content that I will ignore the tough quests and just get through the chapter without doing them. Besides, if someone has a Beta city in a newly released chapter, aren't they supposed to be doing all the quests, or the whole looking for bugs things is pointless, if they are not testing everything.\t\tClick to expand...well, testing for bugs would require some help, like free diamonds or some kind of help to do over and over some things that are pretty rare (like reaching a boss in the spire). It's rather obvious that this beta isn't a real testing server."}, {"152": "Enevhar Aldarion said:\t\t\tLike in chapter 15, where you build the three middle buildings and the Vault of Wisdom, just to sell them right after, if you have enough portal profits to complete the rest of the chapter.\t\tClick to expand...[BR]I didn't have enough portal profits for that.  If you've been at endgame for a while, then you have 6 months to accumulate enough portal profits for the chapter.  And any leftovers accumulate.  Otherwise, you have ~2 months of portal profits to spend.  That makes a huge difference.  I'm always watching my level to make sure I have enough.  If I'm over 1000% PP, then I'm not worried, but I can go as low as 300%-500% PP left."}, {"177": "slide said:\t\t\tQuest 33 will ask for 6 of them.\t\tClick to expand...[BR]And did you build them @slide  ?[BR][BR]"}, {"176": "It is very strange that you can not see ascended goods from the trader.  There is lots room to add it to the merchant tab, and that is where you want to know that information.[BR][BR][IMG]https://i.ibb.co/fGr1q4w/https-beta-forum-elvenar-com-index-php-attachments-1620572237268-png-9012.png[/IMG]"}, {"59": "all quests should be declinable."}, {"98": "Hi, I can't understand one thing, if in itself the trade with the merchant in this chapter (and the next two to come, 19 and 20) is a nuisance because what happened with sensitive products happens, there is always one that It takes and there is less production, on top of that it occurs to you to eliminate the function of a wonder, the guild, which although, could exchange a specific amount of a product for that of the other two equally equally (with the guild at level 30) now it can not?? Can someone explain it to me? You have removed a function from a marvel, is it a bug? because if it isn't, it doesn't make much sense to do something like that ... even more so knowing what wonders and their levels penalize ...[BR]Could you report this and analyze it? because the normal thing is that the wholesaler can do his job with a good union ... I think!"}, {"101": "Quite strange. I have gotten to the quest that requires 3 of each hub. By my count this is #40. Have never seen the 6 welcome squares quest. [BR]Does anyone intend to post a list of the quests for this chapter?[BR][BR]Painfully slow progress.  I cannot believe how many team badges they are requiring for the later research. It has been bad just getting the first 50. [BR][BR]At this rate I will be doing the research for the upgrades to T2 and T3 factories only at the very end when they are finally required. And I will have to decline the quests that relate to them. Just too many badges needed for too few rewards."}, {"16": "https://cavalieridellozombiaco.blogspot.com/p/team-spirit.html#paragrafo6 if google translate is good for you[BR]6 squares is next quest for you, according to that list"}, {"101": "Thank you so much. I had searched for that list but could not find it.[BR]The list only contains the mandatory quests. Hence the fact I am on 40 and still waiting for that quest. On Beta I try to do the optional ones if I can. Unlocking the crystal upgrade, though, did NOT make sense.[BR]I can see that this will be very tedious. Glad I have lots of PP spells and time boosts.[BR]Thanks again."}, {"178": "When you use a merchant the other players see your offer. This offer appears with a hat. If someone takes that offer with a hat, your merchant is immediately recovered and you can send it again. But what makes an offer lose the hat? I see a lot of hatless offers, but I don't know what causes it.[BR][BR]In my opinion, offers without a hat should not exist, because if someone takes an offer without a hat, they are not helping the one who placed the offer."}, {"107": "I'm despising the merchant mechanic at the moment.  On my live server, we've got 43 pages on the trader with people trying to get rid of ingots.  342 offers of ingots.  At least with sentient goods, you could use a level 30 bee or offer 3-star trades, so the lack of options here is incredibly frustrating. [BR][BR]Why create a chapter with an immediate use for minerals (hub-building), an immediate use for sprouts (upgrade gate), but nothing you can do with ingots (unless I'm missing something)?  Or will the equity come later, and we'll see 43 pages of minerals and 43 pages of sprouts later?[BR][BR]EDIT:  To be clear, I'm not saying I want minerals and sprouts players to suffer with 43 pages of unfilled traders later in the game too.  It's just that if it doesn't happen, that seems a clear balancing issue to me.  And I'm not sure why the game designers would want to create that structure anyway."}, {"5": "Trooper said:\t\t\tWhen you use a merchant the other players see your offer. This offer appears with a hat. If someone takes that offer with a hat, your merchant is immediately recovered and you can send it again. But what makes an offer lose the hat? I see a lot of hatless offers, but I don't know what causes it.[BR][BR]In my opinion, offers without a hat should not exist, because if someone takes an offer without a hat, they are not helping the one who placed the offer.\t\tClick to expand...[BR]Any offer you place that does not get taken in 6 hours will give you your merchant back and also leave the trade in the Trader until it expires after the normal 7 days. That is the difference between hat and no hat. So people should always try and take the hats first, so someone gets their merchant back."}, {"16": "Offer loose its hat when merchant is back to it's owner after 6 hours timeout (can be shortened by time instants). Offer itself is persistent for a week. You can treat offer without hat as a help from the one who placed it to everyone who need it.[BR][BR]Good ascended trading strategy preference should be:[BR]1) place own offers (which is beneficial both for those who place them and for community)[BR]2) take offers with hats (and they should be placed on the top if the list, not sure if that sorting is already implemented)[BR]3) take offers without hats[BR][BR]Those who skip first two steps are increasing disbalance on the market."}]