[{"5": "Steelhail said:\t\t\tI'm despising the merchant mechanic at the moment.  On my live server, we've got 43 pages on the trader with people trying to get rid of ingots.  342 offers of ingots.  At least with sentient goods, you could use a level 30 bee or offer 3-star trades, so the lack of options here is incredibly frustrating. [BR][BR]Why create a chapter with an immediate use for minerals (hub-building), an immediate use for sprouts (upgrade gate), but nothing you can do with ingots (unless I'm missing something)?  Or will the equity come later, and we'll see 43 pages of minerals and 43 pages of sprouts later?\t\tClick to expand...[BR]All four Element Hubs require ingots and none of the other two goods, so to build multiples of each hub, you will needs tons of ingots."}, {"16": "element hubs requirement is linked to ascended boost, everyone need trader to build them."}, {"107": "Thanks @Karvest.  I hadn't realized the hub requirements were based on your boost.  @Enevhar Aldarion my hubs require just minerals.  So theoretically then there should be players out there who need ingots early on.  Just in abysmally small quantities on my live server.  [BR][BR]Apologies for my grumpiness too.  It just seems to me that if you've got 43 pages of a single good unclaimed, there are problems with their mechanic."}, {"5": "Steelhail said:\t\t\tApologies for my grumpiness too.  It just seems to me that if you've got 43 pages of a single good unclaimed, there are problems with their mechanic.\t\tClick to expand...[BR]My Live server only has about 4 pages of ascended offers total."}, {"152": "Karvest said:\t\t\tOffer loose its hat when merchant is back to it's owner after 6 hours timeout (can be shortened by time instants). Offer itself is persistent for a week. You can treat offer without hat as a help from the one who placed it to everyone who need it.[BR][BR]Good ascended trading strategy preference should be:[BR]1) place own offers (which is beneficial both for those who place them and for community)[BR]2) take offers with hats (and they should be placed on the top if the list, not sure if that sorting is already implemented)[BR]3) take offers without hats[BR][BR]Those who skip first two steps are increasing disbalance on the market.\t\tClick to expand...[BR]I think placing your own offer is not as beneficial as taking someone else offer with a hat.[BR][BR]My rationale is that helping someone else's merchant return home is better than having both your merchants out.[BR][BR]What is your reasoning for your point of view?"}, {"16": "If you don't post your own offers - you are limiting amount of goods on the market. That's much faster to click on \"accept trade\", but if you (and other players with rare goods) would only accept trades - other players would be forced to just sit and wait for their trades to be accepted. Posting own offer whenever you can is much more beneficial for community than picking up an offer even with the hat, not talking about the one without.[BR]I'm not talking that you should not take offers, just post your own in before."}, {"166": "ekarat said:\t\t\tMy rationale is that helping someone else's merchant return home is better than having both your merchants out.\t\tClick to expand...Sending out your merchants is by far the best option, because markets get double amount of desired ascended goods (you get yours by posting trade and somebody else who accept it in next 7 days gets his/her)[BR]Only accepting trades and not posting yours benefits only you and nobody else and generates only half amount of desired ascended goods for the market"}, {"88": "Unfortunately, those of us stuck with sprouts as their boost are at a disaventage...  I feel the new merchant mechanics is unfair to us in such an inbalanced market.   My live game is the opposite where I happen to produce one of the high demand goods.  My progress overthere is about 3 time faster then my game on beta.  When you have a popular goods as a boost, you are not limited by the merchants because you have tons of offers to pick from.  Why posting new offers when you have pages of demands available to you at any time?  Of course people won't send their merchants and go the easiest way for them![BR]I would really like the merchants to be improved by removing/increasing the quantity per trade limit.  It is way too low even with an upgraded main hall."}, {"16": "This is a vicious circle of ascended trader. People with \"rare\" goods come, accept what they need and too lazy to post their own trades => \"rare\" goods become even more rare... Even if there are already enough of \"rare\" goods producers and that goods are actually in balance with \"popular\" goods, they would still be missing on trader until the swing goes far to the other side and make other type of goods \"rare\" for a long time. Merchant system doesn't strive for balance, it tends to fall into edge cases due to selfishness of players and/or misunderstanding of that mechanic (as it goes in a counter to what was good in previous chapters)."}, {"152": "Karvest said:\t\t\tThis is a vicious circle of ascended trader. People with \"rare\" goods come, accept what they need and too lazy to post their own trades => \"rare\" goods become even more rare... Even if there are already enough of \"rare\" goods producers and that goods are actually in balance with \"popular\" goods, they would still be missing on trader until the swing goes far to the other side and make other type of goods \"rare\" for a long time. Merchant system doesn't strive for balance, it tends to fall into edge cases due to selfishness of players and/or misunderstanding of that mechanic (as it goes in a counter to what was good in previous chapters).\t\tClick to expand...[BR]Nope.  I'm pretty sure you've got it backwards.  It's better to take more trades off the market because then they get their merchants back.[BR][BR]Every time you post your own trade when someone has a trade up, you are screwing over the person whose trade you did not accept.[BR][BR]In fact, I sometimes see trades A->B and B->A and take both, not for my benefit (since it cancels), but to clear goods out of the market."}, {"9": "Trooper said:\t\t\tIn my opinion, offers without a hat should not exist, because if someone takes an offer without a hat, they are not helping the one who placed the offer.\t\tClick to expand...They help other players who might take that offer instead of having to place their own.[BR][BR]Angeduciel said:\t\t\tUnfortunately, those of us stuck with sprouts as their boost are at a disaventage\t\tClick to expand...On my server, situation is currently the opposite: 58 pages of sprouts demand, 0 demand for ingots.[BR][BR]The whole problem is that stupid limitation (crazy low compared to what you can produce). That limitation should be either removed, or those goods should by tradable in a standard way.[BR][BR]And it won't get better after the first wave finishes the chapter, since after all upgrades we will simply turn our trader's production back to seeds and forget about unurium and Ascended goods production until next chapter comes close."}, {"16": "ekarat said:\t\t\tNope. I'm pretty sure you've got it backwards. It's better to take more trades off the market because then they get their merchants back.[BR][BR]Every time you post your own trade when someone has a trade up, you are screwing over the person whose trade you did not accept.[BR][BR]In fact, I sometimes see trades A->B and B->A and take both, not for my benefit (since it cancels), but to clear goods out of the market.\t\tClick to expand...Every time you post a trade, you increase amount of goods on the market immediately, while taking someone's hat trades has a delayed effect, as player need to be online and looking at notifications to notice that merchants are back, and to have more goods in need to post another trade.[BR]Shortcutting someone's crosstrades is not really a good move (like it is for non-ascended goods), as if they take each other's trades (or someone else who really need these goods take them) - they would need to post less trades overall. And if such situation happened (you see the trades in both directions) - those who posted last one don't need more goods and even with returned merchant there would be no new trades => someone who really need the goods you've cleared out of the market would not get them."}, {"165": "You also have to consider that there are players, who do not log in more than every 6h. For these players returning their merchant is completely worthless while having trades to accept is extremely important.[BR][BR]Essentially chapter 18 increases imbalances in 2 ways:[BR]First, if there are many players with the same boosted good then less of this good will be needed.[BR]Secondly, the players with the rarest goods will need less merchants and thus post less trades.[BR][BR]Assuming that most players prefer accepting trades to posting them (because they are lazy or to save the hireing cost for the merchant) then there will always be trades in only one direction. That means players who have the common boost and only log in twice per day (with two 9h productions) will never be able to trade enough. Not even if they have 5 merchants and all their trades get taken after 10 min (as they will not be online to resend their merchant)."}, {"152": "Karvest said:\t\t\tEvery time you post a trade, you increase amount of goods on the market immediately, while taking someone's hat trades has a delayed effect, as player need to be online and looking at notifications to notice that merchants are back, and to have more goods in need to post another trade.[BR]Shortcutting someone's crosstrades is not really a good move (like it is for non-ascended goods), as if they take each other's trades (or someone else who really need these goods take them) - they would need to post less trades overall. And if such situation happened (you see the trades in both directions) - those who posted last one don't need more goods and even with returned merchant there would be no new trades => someone who really need the goods you've cleared out of the market would not get them.\t\tClick to expand...[BR]That's a good argument not to take trades without a hat, but I still think it's better to take trades with a hat than post your own.[BR][BR]If I have a trade out there, I certainly want someone to take it rather than post their own. If they post their own, they are screwing me over because I do want my merchant back. And I certainly don't want to scan the market every few minutes to see if someone has posted a trade that I want rather than take mine and give me my merchant back.[BR][BR]Thus, I have demonstrated at least one playstyle in which your method actively hurts people with that playstyle."}, {"165": "ekarat said:\t\t\tThat's a good argument not to take trades without a hat, but I still think it's better to take trades with a hat than post your own.[BR][BR]If I have a trade out there, I certainly want someone to take it rather than post their own. If they post their own, they are screwing me over because I do want my merchant back. And I certainly don't want to scan the market every few minutes to see if someone has posted a trade that I want rather than take mine and give me my merchant back.[BR][BR]Thus, I have demonstrated at least one playstyle in which your method actively hurts people with that playstyle.\t\tClick to expand...If everyone always posted their own trades before accepting others, there could always be trades in both directions. That way no one would have to scan the market every few minutes. On the other hand, giving someone their merchant back is only usefull if that person is constantly checking the game to see, if their trade was taken. If the merchant times out, before they checked again, then it comes out the same as if you had taken a trade without a hat.[BR]Or from another point of view, posting your trade saves someone the full 6h of the merchant. Accepting a trade only saves them 6h minus however long the trade has already been postet."}, {"152": "little bee said:\t\t\tIf everyone always posted their own trades before accepting others, there could always be trades in both directions.\t\tClick to expand...[BR]And this incorrect assumption is the flaw in the argument.[BR][BR]If I have an unwanted T7 and need a desired one, I will use all my merchants and scan for deals.  Deals will still be rare, and I still have to  check constantly, and that takes more time than checking my notifications."}, {"152": "Let's back up this argument a bit.  What happens depends a lot on whether or not there is an imbalance and how big that is.[BR][BR](I am boosted in ingots and while I'm still catching up, I'm also concerned.)[BR][BR]If things are balanced, you can, in fact, have listings both ways, and that can benefit someone who doesn't log in often, but needs a large supply (ie many trades), so it helps get many trades at once.[BR][BR]If things are sufficiently imbalanced, having listing both ways is a pipe dream -- not going to happen.  People with the desired good(s) are happy no matter what.  For the people with the undesired good (eg ingots), they will always be starved for trades, which entails putting all your merchants on the market and scanning for trades constantly.[BR][BR]If the people with the desired goods post their trades, then there are more trades to jump on, but people will jump on them and they won't last long.  But to get them, you need to compete with others for who gets to them first.[BR][BR]On the other hand, if people with desired goods accept my trades, then I don't need to check the market constantly. I'll be notified, which is easier for me than checking the market, since it tells me when I get a new notification, and I'm already checking those anyway.[BR][BR]In general, it defuses the need to scan for trades and jump on them, which I think is good for everyone."}, {"16": "Amount of players who are always online and can see their notifications as soon as they appear is much lower than amount of players who logs in each 3h/9h/etc to reset their production and will anyway scan trader if they need goods.[BR]Posting own trade + taking hat ones allow players who get their merchants back to get double amount of goods they need (they can both post their new trades and take what you've posted)."}, {"152": "Karvest said:\t\t\tAmount of players who are always online and can see their notifications as soon as they appear is much lower than amount of players who logs in each 3h/9h/etc to reset their production and will anyway scan trader if they need goods.[BR]Posting own trade + taking hat ones allow players who get their merchants back to get double amount of goods they need (they can both post their new trades and take what you've posted).\t\tClick to expand...[BR]I think you're missing the point. It doesn't matter what I do, since I'm boosted in ingots. There are plenty of ingot trades, and I have to both post and scan anyway. (Truthfully, not there yet, but soon.)[BR][BR]I care what people who are not boosted in ingots do, and I want them to accept my trades, rather than be lazy and selfish and post their own rather than helping out as many people as possible by accepting their trades. Having to fight for short-lived trades is not a better environment.[BR][BR]All in all, any analysis worth its salt must acknowledge that some goods are more desirable and analyze the desirable and undesirable boosts separately.[BR][BR]If you do, I think you will see that you are helping people who have desirable boosts at the expense of people with undesirable boosts."}, {"16": "Posting \"rare\" goods trade is more beneficial for the whole community than taking someone's hat trade and leaving own merchants idle, as it lowers amount of \"rare\" goods on the market even more. Half of those returned merchants would anyway return before their owner logs in and be able to send them back, doesn't matter if their trades were taken or not."}]