[{"152": "Karvest said:\t\t\tPosting \"rare\" goods trade is more beneficial for the whole community than taking someone's hat trade and leaving own merchants idle, as it lowers amount of \"rare\" goods on the market even more. Half of those returned merchants would anyway return before their owner logs in and be able to send them back, doesn't matter if their trades were taken or not.\t\tClick to expand...[BR]It matters to me that my merchant is returned or not.  It doesn't matter to me if people post trades or not.  More posted trades for rare goods does not help.[BR][BR]You seem to think that more posted trades for a rare good is a good thing.  It isn't.  Those trade goods go to the small group of hoarders who obsessively scan the listings looking for those trades.  Accepting trades allows for a fair distribution.  Maybe for half the people it doesn't matter, but for the other half (like me), it does matter a lot."}, {"179": "ekarat said:\t\t\tThose trade goods go to the small group of hoarders who obsessively scan the listings looking for those trades.\t\tClick to expand...That’s an interesting thought. I realize there are sentient goods hoarders, who “get fat” by trading and hoarding with profit. But there is no profit in the merchants mechanics - all trades are 1:1, or do I understand it wrong? (Still collecting unurium to unlock the third type of T7 manufactory, so I don’t actually have these merchants yet.)[BR][BR]- -[BR]As for the posting vs. taking trades:[BR]I do believe that the more trades are posted the better for the market. The person who posted the trade already has the goods. If I keep my merchants busy (and only take trades above the amount my merchants get me), I give a chance to someone else to get what they wanted too (preferably as part of that amount above the goods gotten from their merchants). It simply increases the amount of goods in circulation which is beneficial for the market.[BR]The only scenario when taking trade instead of sending my own merchant is beneficial, is when someone is sitting in front of their computer waiting for the merchant to come back. But even in that case I have to be lucky to choose that player’s trade and not any absent player’s trade. Personally I think this type of player isn’t actually the typical (or in majority) Elvenar player."}, {"176": "Steelhail said:\t\t\tThanks @Karvest.  I hadn't realized the hub requirements were based on your boost.  @Enevhar Aldarion my hubs require just minerals.  So theoretically then there should be players out there who need ingots early on.  Just in abysmally small quantities on my live server. [BR][BR]Apologies for my grumpiness too.  It just seems to me that if you've got 43 pages of a single good unclaimed, there are problems with their mechanic.\t\tClick to expand...The mechanic is brilliant.  As soon as you use the merchant, you get your goods.  None of the trades in the trader without a hat ever need to be picked up.  It will always correct for excess and shortages, maybe not immediately and there is always access to the goods you need.  It might take more than 1 six hour cycle if no one grabs your hat trades."}, {"152": "FieryArien said:\t\t\tThat’s an interesting thought. I realize there are sentient goods hoarders, who “get fat” by trading and hoarding with profit. But there is no profit in the merchants mechanics - all trades are 1:1, or do I understand it wrong? (Still collecting unurium to unlock the third type of T7 manufactory, so I don’t actually have these merchants yet.)[BR][BR]- -[BR]As for the posting vs. taking trades:[BR]I do believe that the more trades are posted the better for the market. The person who posted the trade already has the goods. If I keep my merchants busy (and only take trades above the amount my merchants get me), I give a chance to someone else to get what they wanted too (preferably as part of that amount above the goods gotten from their merchants). It simply increases the amount of goods in circulation which is beneficial for the market.[BR]The only scenario when taking trade instead of sending my own merchant is beneficial, is when someone is sitting in front of their computer waiting for the merchant to come back. But even in that case I have to be lucky to choose that player’s trade and not any absent player’s trade. Personally I think this type of player isn’t actually the typical (or in majority) Elvenar player.\t\tClick to expand...[BR]Once again, that assumes there are some supply of rare trades always listed on the market.  Are we seeing that?  If not, then this argument is questionable.[BR][BR]Putting more rare trades on the market just makes sure the hoarders get bigger hoards.  The trades won't actually stay on.[BR][BR]This argument only makes sense when you can get enough trade goods for there always to be some on the market.[BR][BR]Now, we can see what happens when people get their portals built and start needing ingots later on and what happens once excess ingot are taken out of world by merchants expiring. Maybe there won't be rare trades anymore once things hit equilibrium. Or maybe things will remain lopsided.[BR][BR]Ultimately, my point is that the right thing to do depends on how lopsided things are.  If they are lopsided enough, trying to get more rare trades into the market isn't actually going to get any traction."}, {"16": "You are messing the cause and effect. There are no \"rare\" trades on the market because nobody post them (because it's way easier to just pick up what you need and go away).[BR]There are no hoarders of ascended goods, all trades are taken by those who really need them (or those who are shortcutting crosstrades thinking that they are doing a good thing)."}, {"165": "ekarat said:\t\t\tOnce again, that assumes there are some supply of rare trades always listed on the market.  Are we seeing that?  If not, then this argument is questionable.[BR][BR]Putting more rare trades on the market just makes sure the hoarders get bigger hoards.  The trades won't actually stay on.\t\tClick to expand...You are still missing the point. Yes, if the imbalance is large enough, there will not always trades in both directions. But in that case you will not exactly have a good chance of having your trades picked up either.  The point is that only picking up other players trades will waste a lot of the rare goods as the merchants return without having been resend. So the extremely rare goods become even rarer. That can never be good for the community. And it is not better for you personally either.[BR][BR]The problem is that even when the imbalance is so small that there could always be trades in every direction, there won't be. It's just human nature to be lazy and to save the cost of additional merchants when possible. Add to that the obvious and inevitable confusion on whether accepting crosstrades is good or bad, and we have pretty much garanteed that there will never any cross trades available. This is a clear design flaw in merchant mechanic. All we can do now is damadge controll, e.g. by crating awareness for the problem."}, {"152": "Karvest said:\t\t\tYou are messing the cause and effect. There are no \"rare\" trades on the market because nobody post them (because it's way easier to just pick up what you need and go away).[BR]There are no hoarders of ascended goods, all trades are taken by those who really need them (or those who are shortcutting crosstrades thinking that they are doing a good thing).\t\tClick to expand...[BR]These are not facts -- they are your suppositions of what happens.  I have a different model that contradicts yours.[BR][BR]I am making a very unintuitive claim -- that posting more rare trades will not cause them to be less rare. It just doesn't work that way.[BR][BR]Of course, I could be wrong. But I'm completely confident that the only way for there not to be hoarders is for everybody to be too poor to hoard (something that may be more applicable now than later). And if you think there will not be hoarders, then you don't understand the hoarder mentality. In that mentality, all capacity will go towards hoarding, whether needed or not. The only way to prevent it is to not let them.[BR][BR]But ultimately, I hear you telling people not to take my trades, and I object. I want people to take my trades. And if ingots were in demand, then I'd be fine anyway because people will want my trades.[BR][BR][BR]little bee said:\t\t\tAnd it is not better for you personally either.\t\tClick to expand...[BR]Don't pretend that screwing me over by not taking my trades is good for me, since I'd rather get my merchant back than have to hunt for a trade."}, {"16": "ekarat said:\t\t\tBut I'm completely confident that the only way for there not to be hoarders is for everybody to be too poor to hoard (something that may be more applicable now than later).\t\tClick to expand...There is no way to get more ascended goods than you can produce via trader (unlike the situation with sentient goods, where some players just parasitize on the market without producing anything). And due to decaying nature of ascended goods it is really poor to hoard - the more you have - the more decays. And if we are talking about ascended goods types balance - yes, you can hunt for rare goods even if you don't need them, but the only profit you can get of it is less time exchanging these goods back for popular ones, but wasting your real time on refreshing the trader just to have an opportunity to get your own goods back faster later (or the ones that are ~same popular as yours) is nonsense.[BR][BR]ekarat said:\t\t\tBut ultimately, I hear you telling people not to take my trades, and I object. I want people to take my trades.\t\tClick to expand...I'm not telling to not take trades, I just tell to post own trades before doing that. And that can be more beneficial even for you, as you get both notification of your merchant is back + a fresh new trades with the goods you need on the market that you can accept while you are on trader anyway."}, {"152": "Karvest said:\t\t\tThere is no way to get more ascended goods than you can produce via trader (unlike the situation with sentient goods, where some players just parasitize on the market without producing anything). And due to decaying nature of ascended goods it is really poor to hoard - the more you have - the more decays. And if we are talking about ascended goods types balance - yes, you can hunt for rare goods even if you don't need them, but the only profit you can get of it is less time exchanging these goods back for popular ones, but wasting your real time on refreshing the trader just to have an opportunity to get your own goods back faster later (or the ones that are ~same popular as yours) is nonsense.[BR][BR][BR]I'm not telling to not take trades, I just tell to post own trades before doing that. And that can be more beneficial even for you, as you get both notification of your merchant is back + a fresh new trades with the goods you need on the market that you can accept while you are on trader anyway.\t\tClick to expand...[BR]You might think it is nonsense, but I don't -- I do think that way, and I can't be the only one. It's very similar to how I treat sentient goods. I even strategically trade sentient goods planning on the decay products to produce crystal and silk because I'm boosted in scrolls. So, I do hoard obsidian and velvet just for the decay products.[BR][BR]I don't have the opportunity to do it now, but at T8, I might, especially if ascended crystal is in demand.[BR][BR]And of course I'm going to use my merchants and pick up trades both, because I have an undesirable boost. I just don't want people with desirable boosts not picking up my trades because they already got enough from posting their own. (Or, equivalently, not getting mine because they need to pick up fewer trades.)[BR][BR]To be clear, I don't want people thinking that picking up a hat trade isn't helpful because picking up my hat trade is helpful to me.[BR][BR]And we can see whether or not posting rare trades helps.  I think whether or not it will depends on how imbalanced things are and how effective expiring trades are for getting undesirable goods out of the world.  If it's close, then what you're proposing can help.  If it isn't, then the excess will just get sucked up by opportunists and you won't see a difference."}, {"165": "ekarat said:\t\t\tDon't pretend that screwing me over by not taking my trades is good for me, since I'd rather get my merchant back than have to hunt for a trade.\t\tClick to expand...Okay. If I understand correctly, your strategy is to be constantly online and constantly check your notifications or merchants but never the trader. Because you oppose checking the trader on principle?  And you only care about what is best for your own play style with absolutely no concern for any one else?[BR]Posting trades will benefit aktive players more than casual ones, as they have more time to check the trader (unless they refuse to do so on principle). So Picking up (random) trades before posting your own will hurt aktive players as they are no longer favored. But it also hurts the less active players as they still get some benefit from you posting trades, but none at all from their own trades being picked up (because they're not online to resent their merchant anyways). So yes, you and you alone may actually benefit from the system you are suggesting, but not as much as everyone else is being hurt by it.[BR][BR]Even for you and you alone, it would be better if you simply changed your strategy. For example, you could find a player that has the needed goods, find a time when you are both online and then trade large amounts of goods. Because in that case accepting trades is actually better than posting your own.[BR][BR]For the community as a whole the goal must always be to let as many of the common trades expire as possible."}, {"152": "little bee said:\t\t\tFor the community as a whole the goal must always be to let as many of the common trades expire as possible.\t\tClick to expand...[BR]This argument is valid. The rest of your post was just angry baiting, so I'm going to ignore it.[BR][BR]I've been asking why people think posting more rare trades is helpful, and this is a good reason why.[BR][BR]I'm a little skeptical that this will make a big difference in the number of expiring trades, but I can't outright dismiss it.[BR][BR]I'll have to think about it."}, {"16": "ekarat said:\t\t\tYou might think it is nonsense, but I don't -- I do think that way, and I can't be the only one.\t\tClick to expand...Even if you do that, you can't hoard more \"rare\" ascended goods than \"popular\" goods you can produce. There is no trading amplification - you can't hurt ascended trading community very hard. But if there are a lot of players with the same point of view - the whole community suffers without \"rare\" goods which might be not that rare if everyone would just post their own trades as often as they can, and take only trades with hats and only for goods they really need.[BR][BR]There is another huge fault of the system which prevents players from posting their trades when possible - they crowds NH out of the notifications."}, {"180": "What creates rare goods for the community overall is trades requesting rare goods (let's say, offering B and requesting A) that are not taken. Good A will be given to the trade poster and no one gas to give them, so Good A is created. On the other hand, an equal amount of Good B is destroyed as no one took it.[BR][BR]This being said, the maximum of such trades that can be placed is one per merchant per 6h. For this to be achieved, all trades should be either instantly taken or not taken at all. A taken trade doesn't create rare goods, so if a merchant comes back after 2h, that's 2h during which the merchant is not creating rare goods.[BR][BR]Thus, as much merchants as possible should be busy asking A and getting their trade not taken (if A is the rare good). Thus, to help the community what A-boosted players should do is not placing trades giving A and asking B, but the opposite : asking A and giving B. (Highly counterintuitive). And then giving the A good they get (both from production and merchants) to just placed merchants (ideally with another player online), basically giving their merchant capacity to the player they're trading with."}, {"32": "in my live server Minerals are in high demand - at least 7-8 pages but yesterday were 17 - and I am lucky to produce them. IMO there will be no difference if I post 3 trades when are dozens and dozens asking for my goods. On the other side, why would I post trades when I can pick the ones I want? Why would I want my notification tray to be filled because of trades and then I can't see who visited my city?[BR]Oh, on the other hand now is time for revenge. Call me cheap or petty, but I really enjoy not taking the trades of some guys who killed the trader with 0* sentient trades for months and months. Payback time, you &$%)(s !!!!! [smilie--sprite8] [smilie--sprite8] [smilie--sprite8]"}, {"178": "Karvest said:\t\t\tOffer loose its hat when merchant is back to it's owner after 6 hours timeout (can be shortened by time instants). Offer itself is persistent for a week.\t\tClick to expand...[BR]In my live server there are dozen of pages offering ingots. Some of these offers have 7 days (you can see the decay) and some of these seven-days-old offers keep the hat. How it is possible?[BR][BR]I think that taking offers with hat or placing offers when you have the “rare” good are both good options, but taking offers without hat when you are boosted with the rare good is a very very bad idea because you are increasing the gap.[BR][BR]I think that there are not ascended goods in shortfall in any server. I was one of the firsts offering ingots and asking for sprouts in my server, and by this time there were two more people offering the same. If someone with sprout appears, he only had to take offers (there were many) with or without hat. In an instant, he had all the ingots he needed but these poor guys with ingots only see their 3-5 merchants back... and bye bye, the one with sprouts will come back when he has to upgrade his townhall to level 3, repeating the mechanic.[BR][BR]For this reason, I think that there should be no offers without a hat, they should disappear. In this way, the market would become much more dynamic."}, {"180": "Alcaro said:\t\t\tin my live server Minerals are in high demand\t\tClick to expand...Interestingly, Minerals are in high demand in my live server too. I wonder if it's just a coincidence or Spire set hitting once again.[BR][BR]Spire set produces Gum, which creates an imbalance in the sentient trades. This could have resulted in more Gum-boosted players leaving before reaching chapter 18, resulting to an underproduction of Minerals (as these are produced by Gum-boosted players)."}, {"32": "@PaNonymeB - not necessarily, I have the unfortunate Scrolls and I managed to get away from the surplus all the time. Yes, there's a major imbalance with those but one can find a way to balance his/ her stocks. I preferred to give a discount of up to 50% (same tier) or to post trades at 1:1 ratio, scrolls for T1.[BR]With this new trader/ merchants, from one side it's nice that nobody can take advantage and manipulate the market, from other side, it prevents people giving a discount  to have their goods taken faster.[BR]What it's awful it's the max. 3 trades at a time and also that are so small!"}, {"38": "markymarc said:\t\t\tAnd did you build them @slide  ?[BR][BR]Click to expand...sorry, didn't see this - no, not built but nowhere near that quest, however by the time I get there they will be built"}, {"32": "@slide - I had that quest and I've built them all 6. Teleported 3 Hubs, built all 6 Squares, send them back to inventory in case they have some weird ideas, brought back the Hubs and I am working only with 2 Squares (not that are necessary at all, PPs are doing a great job)."}, {"159": "Alcaro said:@slide - I had that quest and I've built them all 6. Teleported 3 Hubs, built all 6 Squares, send them back to inventory in case they have some weird ideas, brought back the Hubs and I am working only with 2 Squares (not that are necessary at all, PPs are doing a great job).\t\tClick to expand...I built the 6. squares as soon as I could, and they don't have to be connected to the race street to count so I didn't need to teleport any hub for lack of team street connection. Now they are sitting in my inventory until I am sure they won't be needed again."}]