[{"152": "PaNonymeB said:\t\t\tWhat creates rare goods for the community overall is trades requesting rare goods (let's say, offering B and requesting A) that are not taken. Good A will be given to the trade poster and no one gas to give them, so Good A is created. On the other hand, an equal amount of Good B is destroyed as no one took it.[BR][BR]This being said, the maximum of such trades that can be placed is one per merchant per 6h. For this to be achieved, all trades should be either instantly taken or not taken at all. A taken trade doesn't create rare goods, so if a merchant comes back after 2h, that's 2h during which the merchant is not creating rare goods.[BR][BR]Thus, as much merchants as possible should be busy asking A and getting their trade not taken (if A is the rare good). Thus, to help the community what A-boosted players should do is not placing trades giving A and asking B, but the opposite : asking A and giving B. (Highly counterintuitive). And then giving the A good they get (both from production and merchants) to just placed merchants (ideally with another player online), basically giving their merchant capacity to the player they're trading with.\t\tClick to expand...[BR]I can get behind a \"take newest offers first\" strategy, and that is consistent with what I have been saying."}, {"101": "This isn't news to anyone but on Beta the trader Ascended goods situation as of 2 minutes ago was:[BR]Trades up for Minerals - 72[BR]Trades up for Ingots - 32[BR]Trades up for Sprouts - 0[BR][BR]Sort of makes me wonder if things are working as expected. [BR]Glad I have lots of 5 hour time boosts so I can get my merchants back when I need them. And yes, I am boosted for Sprouts."}, {"9": "Things are working as usuals (as with the other goods), but this time we have to use the stupid small amount trades, which makes it very annoying."}, {"74": "In IT-Arendyll: 39 pages of offers, none offering ingots!!!!! and none asking for minerals!!!! If you produce minerals and need ingots how long are you going to take?"}, {"5": "spennyit said:\t\t\tIn IT-Arendyll: 39 pages of offers, none offering ingots!!!!! and none asking for minerals!!!! If you produce minerals and need ingots how long are you going to take?\t\tClick to expand...[BR]I have one of each hub built on US Arendyll and am now slowly working on the badges for research. I don't like ignoring the quests, but I need ingots to build the hubs, so I am not doing more than I have right now. I sent out my three merchants over and over, using time boosters, to get the ingots to build all four, so I probably left many pages of hatless trades behind me.   lol"}, {"9": "The wonders require settlement production. But are not mandatory.[BR]Will the next chapter be the same as previous two? = Wonders remain optional.[BR]Otherwise many players (myself included) might find themself stuck in the chapter unable to go to new one with wonders unresearched and no settlement to research them (so building settlement from scratch).[BR]This is a very important question."}, {"176": "Same on live, but I think it is working fine.  It will be a few days before I need ingots.  I'm finding if you keep your merchants working, they do get picked up to the point that I've been able to trade off most of my sprouts.[BR][BR]I think this system is a reasonably quick good correcting system.  If players never need the posted trades, they will just disappear in a week, but everyone who posted has received their end of the trade.[BR][BR]Jaxom said:\t\t\tThis isn't news to anyone but on Beta the trader Ascended goods situation as of 2 minutes ago was:[BR]Trades up for Minerals - 72[BR]Trades up for Ingots - 32[BR]Trades up for Sprouts - 0[BR][BR]Sort of makes me wonder if things are working as expected.[BR]Glad I have lots of 5 hour time boosts so I can get my merchants back when I need them. And yes, I am boosted for Sprouts.\t\tClick to expand..."}, {"176": "Lovec Krys said:\t\t\tThe wonders require settlement production. But are not mandatory.[BR]Will the next chapter be the same as previous two? = Wonders remain optional.[BR]Otherwise many players (myself included) might find themself stuck in the chapter unable to go to new one with wonders unresearched and no settlement to research them (so building settlement from scratch).[BR]This is a very important question.\t\tClick to expand...Super important question, and I think a design flaw.  Chapter 17 required unurium, not guest race.  This does leave it open that you do advance into the next chapter and can find yourself needing to rebuild the guest race.  I'd would just make the badges, as there is no limit on those as in other guest races that had optional tech and also a limit on how much you could make before deleting your guest race."}, {"179": "Lovec Krys said:\t\t\tThe wonders require settlement production.\t\tClick to expand...If I’m not mistaken, only the people are limited settlement production and they are not required for the wonders technologies - only the 600 yellow heart banners (whatever they are called, it doesn’t say in the app). We can stockpile that before tearing down the settlement.[BR](Similarly as many of us did store various settlement production in the past for possible activation of optional squad size upgrades.)"}, {"9": "@FieryArien Yes, we can stock them. But the point is to save the 600 badges production.[BR]Many of us didn't have saved settlement production for unresearched optional squad size upgrades and this is going to end the same way."}, {"169": "well, if the wonders aren't optional you'll find out when you can't move up to the next chapter"}, {"179": "Lovec Krys said:@FieryArien Yes, we can stock them. But the point is to save the 600 badges production.[BR]Many of us didn't have saved settlement production for unresearched optional squad size upgrades and this is going to end the same way.\t\tClick to expand...True. It was a successful gamble that paid off. I wouldn’t bet my resources on the Team Spirit wonders being optional, though. Inno likes to sabotage end-game players ...[BR][BR]Anyway, I’m a huge fan of late wonders being optional. ;-) For one they are useless for me (subjective opinion), for two they don’t dilute the pool of runes I get from the tournament (not really an issue anymore, but still) and for three the researches don’t add to tournament/Spire cost (when the technologies don’t have any successors or when I simply don’t research them)."}, {"162": "I have a city in the living world and I'm stuck on a race question. The question is create 100 elemental babies?  Where do I create these elemental babies???"}, {"5": "RCR2018 said:\t\t\tI have a city in the living world and I'm stuck on a race question. The question is create 100 elemental babies?  Where do I create these elemental babies???\t\tClick to expand...[BR]In the element hubs. There are four production options in there, three are for badges and one is for the elementals of that type."}, {"162": "Enevhar Aldarion said:\t\t\tIn the element hubs. There are four production options in there, three are for badges and one is for the elementals of that type.\t\tClick to expand...[BR]Thanks !"}, {"152": "I'm not the first person to point this out, but I can't find the original post that did point this out (might be on another forum?), but it does look like the required researches for the authentic mercenary camp and the shrine of champions were reversed.  This leaves a lot of the second half of the chapter's researches as completely unnecessary if the wonder technologies are not needed to start chapter 19.[BR][BR]Is that an error? Is that going to be switched? Or are the wonder techs going to be mandatory to start chapter 19?"}, {"59": "Some live versions have total lack of offers other than \"we want sprouts\".[BR]Why you didn't test it more on beta before releasing?[BR]It's all about sprouts/minerals/sentient silk in this chapter[BR]Different levels should need different materials, not only minerals and sentient silk and sprouts for portal"}, {"181": "Even if you don't see the trades you want, you can still get the goods you need from the Merchant. So, Merchant system appears to be better then previous approach. The next question is whether we can you get enough resources from the Merchant? At least in this chapter, 5 Merchants provide more then enough goods as long as you don't try to upgrade everything at the same time. If the next chapter requires multiple Ascended goods, we might develop a shortage of Merchants, but we'll find this our once we get there."}, {"9": "Provided you have someone to trade with, merchants are just a horrible clickfest, so you click for 10-15 minutes to exchange 100k goods instead of posting one single trade.[BR]I hate this stupid restriction of such an extreme small trades."}, {"59": "alexgreat said:\t\t\tEven if you don't see the trades you want, you can still get the goods you need from the Merchant. So, Merchant system appears to be better then previous approach. The next question is whether we can you get enough resources from the Merchant? At least in this chapter, 5 Merchants provide more then enough goods as long as you don't try to upgrade everything at the same time. If the next chapter requires multiple Ascended goods, we might develop a shortage of Merchants, but we'll find this our once we get there.\t\tClick to expand...[BR]This way you spam all your 10 sites of notifications with \"player X took your offer\".[BR]People are trying to only pick up other players offers, not put any to not spam notifications."}]