[{"180": "Arthus said:\t\t\tSome live versions have total lack of offers other than \"we want sprouts\".[BR]Why you didn't test it more on beta before releasing?[BR]It's all about sprouts/minerals/sentient silk in this chapter[BR]Different levels should need different materials, not only minerals and sentient silk and sprouts for portal\t\tClick to expand...Goods needed for settlement buildings and upgrades depend on your boosted good (ascended boost +1 for portal and +2 for other buildings)."}, {"59": "PaNonymeB said:\t\t\tGoods needed for settlement buildings and upgrades depend on your boosted good (ascended boost +1 for portal and +2 for other buildings).\t\tClick to expand...[BR]Which is why there is disbalance as game engine favorized one good over another when placing starting player on the map. [BR]Problems with platinum on our live version are since forever as there's lack of platinum producers, while gum tree and moonstone flooded trader, they didn't allow switching boosted good so it's constant problem, and now same players that produce platinum produce sprouts and there's lack of it everywhere."}, {"179": "Arthus said:\t\t\tWhich is why there is disbalance as game engine favorized one good over another when placing starting player on the map.[BR]Problems with platinum on our live version are since forever as there's lack of platinum producers, while gum tree and moonstone flooded trader, they didn't allow switching boosted good so it's constant problem, and now same players that produce platinum produce sprouts and there's lack of it everywhere.\t\tClick to expand...That’s interesting. On my live server we also have problem with platinum, but with T7 it’s exactly the opposite than on your server: no one wants Sprouts."}, {"5": "Arthus said:\t\t\tWhich is why there is disbalance as game engine favorized one good over another when placing starting player on the map.\t\tClick to expand...[BR]It has nothing to do with the automated placement of new cities and everything to do with how players have quit in a very uneven boost pattern and it seems there is great variation between all the servers. The auto-placement system cannot tell which cities are active and which are not when determining a place for new cities, or for older cities to be moved to. I am sure it only counts the number of total cities with each boost combo and keeps placing new cities in spots for the lowest boost combination. So if a ton of scroll-boosted players quit, the three boost combos that include scrolls will also make certain other goods become short too, but the programming does not see that. So until Inno gets back to archiving the later chapter cities that they refuse to delete, we are stuck with all those dead cities in prime boost locations."}, {"152": "Enevhar Aldarion said:\t\t\tIt has nothing to do with the automated placement of new cities and everything to do with how players have quit in a very uneven boost pattern and it seems there is great variation between all the servers. The auto-placement system cannot tell which cities are active and which are not when determining a place for new cities, or for older cities to be moved to. I am sure it only counts the number of total cities with each boost combo and keeps placing new cities in spots for the lowest boost combination. So if a ton of scroll-boosted players quit, the three boost combos that include scrolls will also make certain other goods become short too, but the programming does not see that. So until Inno gets back to archiving the later chapter cities that they refuse to delete, we are stuck with all those dead cities in prime boost locations.\t\tClick to expand...[BR]1) This is your hypothesis, and I think that uneven quitting is not the dominant factor.[BR]2) Goods are not perfectly symmetric, especially when we get scrolls from library sets.  Surplus scrolls are the same in all servers.  Similarly with gum and bismuth.[BR]3) I had a late chapter city and came back after being inactive for 1.5 years.  I'm glad they didn't delete me, though I would have been fine if they moved me."}, {"169": "I don't understand why the offers are so low[BR]Not even worth 1 production of your manufactory[BR][BR]i think it should be doubled, 3600 for the low level main hall wouldn't be that much"}, {"9": "@maxiqbert Probably to motivate players to purchae the 4th & 5th merchant.[BR]And / Or they don't play their own game - I mean realy play - not having low chapter city or city x chapters behind the current one, so they would know first hand all the info we give them and is ignored.[BR]If they had a city in the latest chapter, they would know how much annoying the merchants are."}, {"22": "if you must exchange 104k 2k per time, not even 4th and 5th merchant help..[BR]Lovec Krys said:\t\t\tAnd / Or they don't play their own game - I mean realy play - not having low chapter city or city x chapters behind the current one, so they would know first hand all the info we give them and is ignored.[BR]If they had a city in the latest chapter, they would know how much annoying the merchants are.\t\tClick to expand...I totally agree"}, {"152": "Ainor said:\t\t\tif you must exchange 104k 2k per time, not even 4th and 5th merchant help..[BR][BR]I totally agree\t\tClick to expand...[BR]Why must you exchange 104k?  What is costing you that much?"}, {"16": "lvl4 portal upgrade"}, {"169": "not to mention the numerous 20k you need for hub upgrades"}, {"101": "I guess I must just be getting more content to do the new chapters at a reasonable speed and get them done in about 4 months. That seems to be possible without consuming all my portal profits and time boosts. There really isn't any reason to go much faster. [BR]The next chapter will likely be 6 months out. There aren't any great, must get buildings that come from completing the research.  Events do not offer great rewards that I must have a lot of open space in my city in order to do event quests. There just isn't the pressure anymore to get chapters done. [BR][BR]That said, I do wonder a bit about how I will manage two sets of Ascended goods in chapter 19. How is the Merchant system going to allow good production of T7 and T8? How much T7 will I need along with T8? I know I will always need T1-3 if I am going to do events and FAs. Where is the space going to come from to handle so many high level factories?"}, {"32": "most of the time the artwork was/ is beautiful. This chapter seemed to follow the pattern until I saw the new armories, Training Grounds and Merc. Camp! From those gorgeous futuristic shapes they transformed them into something really ugly, like we are going back to Orcs chapter.[BR]Looking at all upgrades is like there are 2 teams of graphic designers, one for houses, WSs, Scrolls, Dust and another one for the ugly armories, Training Grounds and Merc. Camp, nothing special Planks and Steel ... Oh, the ugly Barracks seem to belong to the first team, now are ugly and after upgrade will be nice.[BR]I will need a lot of work to convince myself to upgrade those buildings, especially the military ones."}, {"9": "@Alcaro You don't have to upgrade them[smilie--sprite1][BR]I will upgrade them for their stats not for their look.[BR][BR]Btw, my english name for this chapter is Team trade torture. I hate merchants and will hate them in the future."}, {"32": "yeah, actually we don't have to do anything in this game but the artwork was the one who brought me to Elvenar. If became common then definitely Elvenar is losing more and more from its appealing."}, {"9": "Two things i dislike about this chapter most:[BR]1) Insane 2h portal cap production (should i sleep at night?)[BR]2) Merchants and their ridiculously low capacity (please developers, try to exchange 100k of goods through merchants with someone without being in the same room or communicating with each other directly, especialy from the accepter perspective = you don't know if the other player posts new trades with 5s or 5 min delay...so very \"funny\" checking the market over and over. And now try it several times, and you'll hate merchants as much as we do)."}, {"176": "Lovec Krys said:\t\t\tTwo things i dislike about this chapter most:[BR]1) Insane 2h portal cap production (should i sleep at night?)[BR]2) Merchants and their ridiculously low capacity (please developers, try to exchange 100k of goods through merchants with someone without being in the same room or communicating with each other directly, especialy from the accepter perspective = you don't know if the other player posts new trades with 5s or 5 min delay...so very \"funny\" checking the market over and over. And now try it several times, and you'll hate merchants as much as we do).\t\tClick to expand...Totally agree on the 2h portal cap, dumb, dumb, dumb.  [BR]I didn't have a problem with the merchants.  There was only one or two days were I had to wait a bit, like less then a day to get what I needed, but I also planned ahead and was collecting what I needed days in advance.  I think the degree of support in one's FS makes a difference.  I could see it being very difficult without players helping by taking your trades and perhaps without an understanding that trades without hats that have an over supply should just be left because it helps to balance the goods."}, {"9": "@edeba Posting the trades is not so bad, you can see real time when someone picks them up.[BR]Accepting is problematic, since if you help someone, you need to click several times to refresh and see if the posted new trades or not."}, {"152": "In practice, I'm not really having trouble with merchants either.  They are slow and steady, which makes it harder for people who only log in once a day, but the short portal caps hurt them more."}, {"56": "The merchants were successful in my case.  I only recall a few times when the products I needed weren't traded, which was a lot better than being in a situation where they were not available at all, or at scalping prices from the hoarders.  It worked for me.[BR][BR]I'm not sure what the logic was in having the portal finish in 2 hours.  I'm retired and still can't get things collected every two hours.  This really made no sense to me, when the hubs took 4 hours to collect, but the elves, humans, and Elvenars came up in 3 hours.  I guess we were supposed to be available every hour on the hour.[BR][BR]All in all I've enjoyed this chapter so far."}]