[{"101": "The end of the research in this  chapter is ridiculous.[BR]After getting my gate to level 4 and 12 hubs up to level 3 I can produce trials fairly fast. [BR]But the numbers of trials that I must produce for the research is mind numbing.[BR]If I collect 5 trials every 2 hours I get at most 50 per day. And this means being on a LOT of time.[BR]Just to complete the last 6 techs (assuming I only do one of the wonders) it requires 1720 trials.[BR]That requires  34 days![BR]Absurd, simply absurd. This is beyond boring. I have no intention to do this chapter on live worlds."}, {"56": "Jaxom said:\t\t\tThe end of the research in this chapter is ridiculous.\t\tClick to expand...This is a complaint that I have to agree with.  The portal should make more goods, not get them finished sooner.  I don't know anyone that would want their settlement goods to be completed every 2 hours day and night.  The amounts required are ludicrous, which cause the player to have several completed techs that can't be activated.  This is the antithesis of fun.[BR][BR]In my main city I have all 12 hubs at level 3 and the portal is level 4.  I am on the next to last row of the chapter.  Everything was going along rather smoothly until the impossible task of needing 280 badges for each tech.  Are we supposed to never sleep?  I still have a tech in the previous row that isn't activated yet.  This really needs to be changed.  [BR][BR]There is not enough of a benefit to upgrading the portal if you have to return every 2 hours to collect what little it makes.  I can complete a tech in days, but the portal doesn't make enough to activate the tech in weeks.[BR][BR]The Merchant works.[BR]The hubs work.[BR]The portal doesn't pay nearly enough to activate the tech in any reasonable amount of time."}, {"4": "The only way I've found to do this is build up lots of medals, then use instants to do the 2h badges using portal profits to make the people as needed.  And yes, it is pretty ridiculous, but it's the only way I've found through it. This is in my live city where I have 4 of each hub type, so the medals build up a little faster.  Just need to have a lot of 2h time instants hanging around."}, {"5": "Yes, the final 10-12 researches are very tedious to complete, but Inno had to find some system that would make the faster players still need about 6 months to finish the chapter, without using time boosters and other resources, that is. I have used some boosters, but not as much as the previous two chapters, so in my Live city, I think I may finish the final research just as chapter 19 is added to the game there. I have also been ignoring the quests and I know I will have to wait until chapter 19 is added before I can start declining them, and that bugs me."}, {"4": "With this chapter being so slow, it will be very tough for players to catch up to the end of chapters group. Since I was at the end of chapters, I had time to get everything upgraded and recover from the upgrades before the ch 18 started. And it looks like I'll have time to do that before ch 19 begins.  Unless it's a fast one (lol), it looks like the end of people joining us at the end of chapter."}, {"56": "Yogi Dave said:\t\t\tThe only way I've found to do this is build up lots of medals, then use instants to do the 2h badges\t\tClick to expand...[BR]This could be a good plan, but only if the 2 hour time boosts weren't strictly a matter of RNG luck in the Spire.  When we could get them in the events it was extremely helpful, but someone bragged about the amazing amount of time boosts that had been accumulated and Inno misread that as a complaint and removed them.  Now we are lucky to pull one single 2 hour time boost from a Spire chest or two on the way to the Lab.  A couple of weeks ago I didn't get a single time boost, 1, 2, or 5 hour, from the Spire chests."}, {"5": "@Maillie there is a crafting recipe to make four 2-hour time boosters and a recipe to make seven 1-hour time boosters. I intentionally make those when I see them, so I can speed up things where a 5-hour booster would be a waste of time."}, {"180": "Enevhar Aldarion said:\t\t\tthere is a crafting recipe\t\tClick to expand...That's still luck though, just not at the same place"}, {"169": "PaNonymeB said:\t\t\tThat's still luck though, just not at the same place\t\tClick to expand...more chances to have some, still a good thing"}, {"9": "Ok, I'm officialy announcing that i won't be researching wonders in this chapter (saving two weeks of research).[BR]In the worst case scenario I'll have to build the settlement again (mainly portal and streets, i can teleport the hubs) and start new chapter with delay if dev team makes wonders mandatory and won't remove guest race goods from them."}, {"56": "Enevhar Aldarion said:\t\t\t@Maillie there is a crafting recipe to make four 2-hour time boosters and a recipe to make seven 1-hour time boosters. I intentionally make those when I see them, so I can speed up things where a 5-hour booster would be a waste of time.\t\tClick to expand...[BR]I don't believe you see the seriousness of this.  I have 2 techs that are finished but need activating, they each need 210 badges.  I have 2 more that need activating that each require 280 badges.  210 x 2 = 420; 280 x 2 = 560.  420 + 560 = 980 badges.  I can make 5 badges in 2 hours.  That is ridiculous.  [BR][BR]I would ONLY need 196 of the 2 hour time boosters to activate them.  The time boosters are all RNG.  Doesn't matter if they come from the Spire or if they come from the Magic Academy.  Now you may have 196 of the 2 hour time boosters, or 392 of the 1 hour time boosters, but I don't seem to have those, nor would the vast majority of players.[BR][BR]The last row of techs has 3 in it.  They each need 300 badges.  That's 900.  Why would anyone believe that 5 badges every 2 hours would be anything but crazy?  Time boosts, really?[BR][BR]This definitely needs to be changed.  Players won't want to spend the rest of their lives sitting in the last couple of rows of Chapter 18, and the diamond costs to activate them are much too steep.[BR][BR]"}, {"5": "Maillie said:\t\t\tI don't believe you see the seriousness of this.  I have 2 techs that are finished but need activating, they each need 210 badges.  I have 2 more that need activating that each require 280 badges.  210 x 2 = 420; 280 x 2 = 560.  420 + 560 = 980 badges.  I can make 5 badges in 2 hours.  That is ridiculous.[BR][BR]I would ONLY need 196 of the 2 hour time boosters to activate them.  The time boosters are all RNG.  Doesn't matter if they come from the Spire or if they come from the Magic Academy.  Now you may have 196 of the 2 hour time boosters, or 392 of the 1 hour time boosters, but I don't seem to have those, nor would the vast majority of players.[BR][BR]The last row of techs has 3 in it.  They each need 300 badges.  That's 900.  Why would anyone believe that 5 badges every 2 hours would be anything but crazy?  Time boosts, really?[BR][BR]This definitely needs to be changed.  Players won't want to spend the rest of their lives sitting in the last couple of rows of Chapter 18, and the diamond costs to activate them are much too steep.[BR][BR]View attachment 9216View attachment 9217View attachment 9215Click to expand...[BR]I am further than you in my US city, as I have already done the magic dust research, and the Live servers got chapter 18 two weeks after Beta did. And I have already completed the Squad Research and City Expansion you skipped.[BR][BR]I also ignored the quests and pushed my research as quickly as I could to get all levels of the portal and hubs unlocked and maxed their levels as quickly as I could. I actually spent more time boosters on the hubs than on the portal just so I had enough of those badges to keep the portal going non-stop when I am not asleep."}, {"176": "Maillie said:\t\t\tI don't believe you see the seriousness of this.  I have 2 techs that are finished but need activating, they each need 210 badges.  I have 2 more that need activating that each require 280 badges.  210 x 2 = 420; 280 x 2 = 560.  420 + 560 = 980 badges.  I can make 5 badges in 2 hours.  That is ridiculous. [BR][BR]I would ONLY need 196 of the 2 hour time boosters to activate them.  The time boosters are all RNG.  Doesn't matter if they come from the Spire or if they come from the Magic Academy.  Now you may have 196 of the 2 hour time boosters, or 392 of the 1 hour time boosters, but I don't seem to have those, nor would the vast majority of players.[BR][BR]The last row of techs has 3 in it.  They each need 300 badges.  That's 900.  Why would anyone believe that 5 badges every 2 hours would be anything but crazy?  Time boosts, really?[BR][BR]This definitely needs to be changed.  Players won't want to spend the rest of their lives sitting in the last couple of rows of Chapter 18, and the diamond costs to activate them are much too steep.[BR][BR]View attachment 9216View attachment 9217View attachment 9215Click to expand...Yup, seriously boring...  The waiting to get through the badges is analogous to:[BR]watching paint dryrush hour where you catch every red lightwaiting on hold for customer serviceusing a dial up modem for internetwatching water evaporateetc...There already isn't much exciting about going through the tech tree, but someone with development power is set on making sure they bore us practically to death by making it long and drawn out.[BR][BR]My beta city is done with the chapters."}, {"9": "edeba said:\t\t\tMy beta city is done with the chapters.\t\tClick to expand...Now i envy you. My beta city still needs almost 2k badges to finish the chapter (without wonders)."}, {"5": "Lovec Krys said:\t\t\tNow i envy you. My beta city still needs almost 2k badges to finish the chapter (without wonders).\t\tClick to expand...[BR]In my Live city I am halfway to enough badges for the final 210-cost research. That leaves the 280's and 300's to finish. I might get them all done, including the two AW researches, just in time for chapter 19 to reach the Live servers. I would be further along in the mandatory researches, but I went ahead and completed all the optional ones as I got to them.[BR][BR]@edeba they have to try and find some way to make even the fastest of the non-money/diamond spenders to need the full 6 months to finish a chapter. Unfortunately for us, this current way is very boring and tedious."}, {"32": "[BR][BR]so it looks my tech tree. For those last 4 techs I need 1180 badges (jfC!!!) and atm I have 110 badges done for WS tech. I can make maximum 50 badges/ day, if I set up an alarm and collect all in time and not going out at all (I play 99% of the time on PC).[BR]I just think the term \"challenge\" has different meaning for me and developers."}, {"169": "Alcaro said:View attachment 9220[BR][BR]so it looks my tech tree. For those last 4 techs I need 1180 badges (jfC!!!) and atm I have 110 badges done for WS tech. I can make maximum 50 badges/ day, if I set up an alarm and collect all in time and not going out at all (I play 99% of the time on PC).[BR]I just thing the the term \"challenge\" has different meaning for me and developers.\t\tClick to expand...think of it as a marathon"}, {"32": "maxiqbert said:\t\t\tthink of it as a marathon\t\tClick to expand...marathon type stuff isn't my cup of tea  [smilie--sprite8] [smilie--sprite8] [smilie--sprite8] [BR]I know that I must have patience but everything has a limit and producing those badges at a pace of 40-50/ day just crossed over that limit. I am truly bored. I am always in for a real challenge but this ... mmmwell ... it's just not challenging at all."}, {"169": "Alcaro said:\t\t\tmarathon type stuff isn't my cup of tea  [smilie--sprite8] [smilie--sprite8] [smilie--sprite8][BR]I know that I must have patience but everything has a limit and producing those badges at a pace of 40-50/ day just crossed over that limit. I am truly bored. I am always in for a real challenge but this ... mmmwell ... it's just not challenging at all.\t\tClick to expand...well, it's challenging your patience [smilie--sprite2]"}, {"9": "Yes, that's even worse than setting up 70 small ships. At least now we can mass run those ships instead of clicking them one by one (and by crazy clicking you could have shorten the chapter from months to weeks which is now not possible).[BR][BR]The worst part of the tedious production is the combination of extremely low production with extremely high demand with requirement being online all the time to prevent more gaps between logging (the 2h production queue).[BR][BR]The 2h queue is also guilty of my beta city being behind my live city despite beta city started the chapter earlier - i don't bother to log into my beta city more often than every 3 hours (and often even 9) leaving gaps between 1 and 7 hours.[BR][BR]And now imagine someone who sleeps 8 hours per day and works 8 hours per day + 2 hours for lunch and commuting without access to the game in the mentioned hours - that's a total of 6 hours lost during night + 8 hours lost during every working day - total 14 out of 24 hours lost on working days due to the stupid 2h portal production.[BR]This scenario lowers the badge production to max. 25 / day on working days."}]