[{"176": "Lovec Krys said:\t\t\tNow i envy you. My beta city still needs almost 2k badges to finish the chapter (without wonders).\t\tClick to expand...I haven't done the chapters, I refuse to do them."}, {"5": "edeba said:\t\t\tI haven't done the chapters, I refuse to do them.\t\tClick to expand...[BR]I am sure it comes over differently to different people, and probably differently when not in English, but your sentence \"My Beta city is done with the chapters\" to a lot of English speakers/readers is understood as you have finished all the chapters with your Beta city, not that you quit doing them."}, {"176": "Enevhar Aldarion said:\t\t\tI am sure it comes over differently to different people, and probably differently when not in English, but your sentence \"My Beta city is done with the chapters\" to a lot of English speakers/readers is understood as you have finished all the chapters with your Beta city, not that you quit doing them.\t\tClick to expand...Which is why I clarified.  I am finished chapter 18 in my live game.  But because of the tournament changes, my beta game is better than my live game.  The further you go, the worse your game gets, well, I think there are improvements to chapter 15, then it gets worse."}, {"5": "Speaking of the researches, I was just looking at the final three again and I realized only one of them requires all four researches from the previous column to be completed, and that is the Shrine of the Champions AW research. So unless it has already been found in the data files, I am going to expect that research to be the one we have to complete to enter chapter 19, and not the Mercenary Camp research."}, {"9": "@edeba Ok, i thought that you have finished the chapter already. The main purpose of my beta city is to try new things (chapters included), so don't even think about not to do the chapter. Otherwise, there would be no point of actively playing my beta city and events can be watched by logging once per day.[BR][BR]Btw, i'm also not native speaker, which can be guessed from my non english nickname (in english Lovec Krys means Rat Hunter)."}, {"152": "I think the point of the two hour queue is to discourage building more than 3 of each element hub."}, {"56": "ekarat said:\t\t\tI think the point of the two hour queue is to discourage building more than 3 of each element hub.\t\tClick to expand...The hubs are 7x4, 4x7, 5x6, and 6x5.  They also need a path to connect them each to the portal, which is another 49 squares.  I don't plan on seeing a lot of cities that have much more than 3 of each of these monsters.  If they wanted to discourage players from putting in several of each of these buildings they have accomplished it."}, {"5": "@Maillie A player in my US fellowship said she finished this chapter a few days ago and she said she put out 6 of each hub, just to get it all done with more quickly. And of course, burned through a ton of 1 and 2-hour time boosters in the portal."}, {"152": "Maillie said:\t\t\tThe hubs are 7x4, 4x7, 5x6, and 6x5.  They also need a path to connect them each to the portal, which is another 49 squares.  I don't plan on seeing a lot of cities that have much more than 3 of each of these monsters.  If they wanted to discourage players from putting in several of each of these buildings they have accomplished it.\t\tClick to expand...[BR]I will point out that my current 12 hub settlement is still smaller than the one I built for traders of unur.  I had a ton of small ships at the end.  And those last couple of columns of researches make it very tempting to build more than 12.[BR][BR]Enevhar Aldarion said:@Maillie A player in my US fellowship said she finished this chapter a few days ago and she said she put out 6 of each hub, just to get it all done with more quickly. And of course, burned through a ton of 1 and 2-hour time boosters in the portal.\t\tClick to expand...[BR]Case in point.  Though I am impressed at the mana generation and dedication to the 2 hour queue that would require."}, {"5": "ekarat said:\t\t\tI will point out that my current 12 hub settlement is still smaller than the one I built for traders of unur.  I had a ton of small ships at the end.  And those last couple of columns of researches make it very tempting to build more than 12.\t\tClick to expand...[BR]Have you bothered building any of the Welcome buildings, though? I have not built a single one of those and I have done the entire chapter with 4 fire, 4 air, and 2 earth hubs. I should have built a 3rd earth, so that I could have avoided using as many time boosters to make earth elementals. I also had 2 water to start, but realized I could do the entire chapter without them and, the three badges they make, and stored them."}, {"176": "Lovec Krys said:@edeba[BR]Btw, i'm also not native speaker, which can be guessed from my non english nickname (in english Lovec Krys means Rat Hunter).\t\tClick to expand...Rat hunter? lol.  That was unexpected.  Lovec looks a lot more like love than rat or hunter."}, {"16": "For me it sounds more like rat catcher."}, {"152": "Enevhar Aldarion said:\t\t\tHave you bothered building any of the Welcome buildings, though? I have not built a single one of those and I have done the entire chapter with 4 fire, 4 air, and 2 earth hubs. I should have built a 3rd earth, so that I could have avoided using as many time boosters to make earth elementals. I also had 2 water to start, but realized I could do the entire chapter without them and, the three badges they make, and stored them.\t\tClick to expand...[BR]12 Hubs and 6 Welcome Squares, since I had the space for them.  The settlement isn't small, but it's smaller than I had for the previous chapter.[BR][BR](Yes, I am low on portal profits, since I've been rushing through chapters and not accumulating them between chapters.  I recognize that many of you have way more of those than you can use.)"}, {"9": "@ekarat Yeah, like my main city with 4840% PPs[smilie--sprite1] And i'm sure, mine PPs are not biggest in the world.[BR]About the settlement, last chapter, mine settlement was a little bit extreme, but it has allowed me to go through the chapter quick. This is not possible in the current chapter (i'm not going to waste my time instants on that)."}, {"5": "ekarat said:\t\t\t12 Hubs and 6 Welcome Squares, since I had the space for them.  The settlement isn't small, but it's smaller than I had for the previous chapter.[BR][BR](Yes, I am low on portal profits, since I've been rushing through chapters and not accumulating them between chapters.  I recognize that many of you have way more of those than you can use.)\t\tClick to expand...[BR]Since I made that comment about 10 days ago, I decided the final 10 researches were taking too long and I did not feel like being stalled on the quests until chapter 19 shows up on Live, so I ended up building the 6 Welcome Squares for the quest, and put my two Water Hubs back out and built a 3rd Earth Hub. I really should check the quest list, wherever it is, and see it there is one that will require me to have a 3rd Water Hub built too."}, {"32": "@Enevhar Aldarion - there is a quest asking to have 3 Hubs of each type."}, {"5": "With the addition of 4-star troops in this chapter to research and use, it was expected enemy 4-star troops would start showing up too. It may have been mentioned by someone on a forum somewhere already, but I can confirm with my Live US city that world map fights starting with Ring 18 include enemy 4-star squads. The fights are a mix of 3-star and 4-star in Ring 18, so Ring 19, or maybe Ring 20, is where it will completely switch over to all 4-star enemies."}, {"101": "I have at long last completed the chapter. One day less than 5 months.[BR]I did all of the mandatory quests plus many of the optional. Chose the Temple of Spirits as my 'required research' wonder. Not sure I will put it up but at least it gives a chance at more Unurium. I couldn't see doing the other wonder. Although the orc/tournament benefit would be nice it is so large that I could justify it only by dropping an Armory. That would impact troop production. I guess I will just have to time boost orc/armory production if I run short.[BR][BR]As I stated earlier on the thread the requirements for badges is far too high. It just extends the chapter out for far too much extra time. It took me two full months to go from researching the new streets to finishing. Most of the time was spent on the tech to upgrade the goods buildings. I saved that to the end as it provided no benefit for the chapter.[BR][BR]So the developers indeed slowed things down as I am sure they intended. Anyone who got it done much faster had to use diamonds or a lot more time boosts and portal profits. I used enough as it was.[BR][BR]Am I looking for to the next chapter, likely in about a month? No. It will likely upgrade 3 troops. It will certainly force me to rotate my residences and / or other buildings as I upgrade them. It will force me to spend more coins on the merchants, who will now be working on two ascended goods.[BR][BR]I have pretty much decided that if Ascended goods show up in catering on the Spire I will stop at the point where I would have catered rather than fight. I will not mess with getting Ascended for the Spire. I have not spent a single good in a tournament since the format changed. And I never will. I go only as far as my troops allow me. No interest in going further.[BR][BR]Hope others are a bit more optimistic about things but this chapter was soooooo long and tedious that I can't be very positive. Still playing though!"}, {"9": "I didn't research the wonders.[BR]But just to be sure i still have the portal and i have teleported all the productions instead of just selling them.[BR]My beta city is still needs over 700 badges (not counting wonders into that).[BR][BR]@Jaxom I don't negotiate in the Spire anymore. The third floor is already unnegotiable (or too costy, seeds leading) for me even without ascended. Including ascended would make Spire totaly unnegotiable for end game players.[BR]I agree that the chapter is very tedious. We can only hope (you know, hope dies last) that the next chapter will be more reasonable. And for players who don't play 24/7 it's endless - easily double the time if you can't play half the day (work + commute without internet access).[BR]I have hated merchant since the day one. Still hating them (fortunately i don't have to use them in my main city anymore after finishing the research)."}, {"5": "@Jaxom @Lovec Krys  just pay attention to the connecting green lines for the final three researches and be prepared to need the top AW research to open chapter 19, because that is the only one of those three that requires all four in the previous column to be done first."}]