[{"56": "I'm still in the last row with nearly the last tech finished, but none activated.  That's in my main city where I used to like to pay the devs for their hard work by buying diamonds for expansions.  The city was large enough to set up the entire settlement and get it going right away.  It made a huge difference and went past my Beta city in no time.[BR][BR]My Beta city is much smaller and has no chance of finishing 18 before the next chapter comes out, it is still in the 210 row.  Sadly, my little city is the farthest along of anyone in my fellowship.  This is definitely not fun for us.  5 badges that stop producing in two hours, and we need thousands, doesn't even sound like something that anyone would want to sign up for. [BR][BR]This really does need to be rethought out, in my opinion.  We all love to finish what we start in a reasonable amount of time.  Forever doesn't sound that reasonable. [smilie--sprite2]"}, {"5": "Maillie said:\t\t\tI'm still in the last row with nearly the last tech finished, but none activated.  That's in my main city where I used to like to pay the devs for their hard work by buying diamonds for expansions.  The city was large enough to set up the entire settlement and get it going right away.  It made a huge difference and went past my Beta city in no time.[BR][BR]My Beta city is much smaller and has no chance of finishing 18 before the next chapter comes out, it is still in the 210 row.  Sadly, my little city is the farthest along of anyone in my fellowship.  This is definitely not fun for us.  5 badges that stop producing in two hours, and we need thousands, doesn't even sound like something that anyone would want to sign up for.[BR][BR]This really does need to be rethought out, in my opinion.  We all love to finish what we start in a reasonable amount of time.  Forever doesn't sound that reasonable. [smilie--sprite2]Click to expand...[BR]The trick is to just build up a lot of medals and a lot of 1- and 2-hour boosters, and then go and make 30 or 40 or 50 or 100 badges all at one time. I thought in my Live city it would take me 7 or 8 months to complete this chapter, but instead I will be done in 5 months because of this."}, {"9": "@Enevhar Aldarion And that is exactly what is wrong with that chapter setup. You shouldn't be forced to be 24/7 online or to use large amount of time instants to finish the chapter in a reasonable time!"}, {"101": "Enevhar Aldarion said:@Jaxom @Lovec Krys  just pay attention to the connecting green lines for the final three researches and be prepared to need the top AW research to open chapter 19, because that is the only one of those three that requires all four in the previous column to be done first.\t\tClick to expand...Excuse me but why do you think that Shrine of the Champions MUST be researched in order to move forward to Chapter 19? One chapter quests say that you must research either wonder. And after that you are told to sell the Gate. It would be rather stupid have the chapter quests lead you to a dead end.[BR]Can a moderator confirm that this will NOT happen?"}, {"9": "@Jaxom Chapter quests tends to want you to do things you don't want to do (from player's perspective stupid things).[BR]That's why majority of players do not bother to do chapter quests.[BR]For example, both my main city and my beta city are stuck on have 3 Welcome squares quest[smilie--sprite1][BR]So i bet there will be a lot of players not researching the wonders."}, {"5": "Lovec Krys said:\t\t\tSo i bet there will be a lot of players not researching the wonders.\t\tClick to expand...[BR]For some people, this will also be because the Merc Camp is the center research of the final three, and in the last few chapters, the center one is usually the one needed to open the next chapter."}]