[{"16": "It would be scaled up along with Main Hall upgrades (up to 9k at the end of ch20).[BR]If merchant trading is an addition to regular ascended goods trading - it can really help to balance missing goods, but if it is a replacement - it can be very annoying even if you are in active endgame FS which take your trades instantly on request."}, {"9": "\t\t\tThe Merchant is a new kind of trader, visiting the Elvenar world. The Merchant gives you access to instant trading. As soon as you finalize a trade with him, you will receive your order immediately, while the Trader offers your goods to other players until he returns. While the Merchant is out, you cannot ask him to do more trades, and you will have to wait until he is back in your settlement.\t\tClick to expand...Ok, reread it again, and if i understand it right, then the merchant should work kind of like the trading with a wholesaler, but instead of rising the costs with each trade, it is limited by amount and time.[BR][BR]So it should be an addition, not replacement and players can trade with an NPC small amount of goods.[BR]So not as useless as i thought, in some cases it should allow players to overcome any lack of goods on the market."}, {"74": "So, it seems that Inno want us to stop playing this game :-("}, {"167": "Does anyone know if the T7 goods decay every day? The announcement doesn't mention it."}, {"143": "Dony said:@Marindor there is a typo in announcement, it says that hiring time depends on MH level, while it should be hiring fee which depends on MH level, time is same for all MH levels.\t\tClick to expand...[BR]Thank you, corrected now!"}, {"59": "DeepTerminal said:\t\t\tDoes anyone know if the T7 goods decay every day? The announcement doesn't mention it.\t\tClick to expand...[BR]10% i guess like everything, the problem is until now after every new good we had wonder that reduced decay and now unurium doesn't have one since 2 chapters, seeds had one right away and so had mana, they introduced new goods now (ascended) but didn't give wonder reducing decay of previous one (unurium)[BR][BR]Also look how long we plead them to reduce scouting time, some players scout like a week now or longer and they again ignored it"}, {"56": "I'm not trying to be petty here, but could someone please give a call to the event coordinator?  We had Sentient Goods for ages before we got anything decent in events to help.  If I remember correctly, we went through Elementals, Amuni, Constructs, and The Elvenar before we found anything but standard goods in events.  There was certainly no sign of any rewards regarding Unurium during the last chapter.  We had one single building to get it from."}, {"152": "So, do T7 goods come from T1+2 manufactories?"}, {"56": "ekarat said:\t\t\tSo, do T7 goods come from T1+2 manufactories?\t\tClick to expand...Yes, it will be the only one of the first tier that is not already boosted."}, {"34": "DeepTerminal said:\t\t\tDoes anyone know if the T7 goods decay every day? The announcement doesn't mention it.\t\tClick to expand...[BR]Arthus said:\t\t\t10% i guess like everything...\t\tClick to expand...[BR]indeed[BR][IMG]https://i.ibb.co/tq5chmR/https-beta-forum-elvenar-com-index-php-attachments-1617983040070-png-8876.png[/IMG]"}, {"5": "ekarat said:\t\t\tSo, do T7 goods come from T1+2 manufactories?\t\tClick to expand...T7 from T1. T8 from T2 in chapter 19. T9 from T3 in chapter 20.[BR][BR]So in chapter 20, we might need to have all 9 types of factories out at the same time."}, {"168": "please does anyone have a reference to the tasks-collective spirit - thank you"}, {"169": "does anyone already have the new merchant?"}, {"16": "Yes, as you can see in bug reports )"}, {"169": "ok, so there are trades[BR]I'd like to hear what happens after the offer expires."}, {"16": "Offer stays there for a week, merchant returns and you can post another trade.[BR]You can see both \"expired\" and \"active merchant\" trades right now in your trader (thanks to the bug)."}, {"169": "the question is :[BR]after a week, if no one accepts the offer, what happens? the goods just disappear?"}, {"5": "maxiqbert said:\t\t\tthe question is :[BR]after a week, if no one accepts the offer, what happens? the goods just disappear?\t\tClick to expand...[BR]I would think that is how it works because you get the goods you request as soon as you give the Merchant the goods for your offer. So if no one takes the trade, the goods just go away."}, {"110": "OMG what a horrible mechanic.[BR][BR]Guess all those \"whiners\" agains 1 star trades finally got what they wished for. this is what you get if you keep whining about it.[BR]We are talking about a decaying good that you cannot trade properly.[BR][BR]Unbelievable. not that I was intending on playing this chapter, but the incentive just got only worse.[BR]So this chapter, is little fun that demands you to beg other players to help them out, it destroys spire, it annihalates tournament. and you now need to essentially become a frenzy trader opening it every 5 seconds to see if there is a trade you might need you can get.[BR][BR]The worst of all worlds.[BR]Way to go![BR][BR]If anyone still has the illusion that you are no longer welkcome here as an advanced player, then it just got shattered I think lol"}, {"59": "CrazyWizard said:\t\t\tOMG what a horrible mechanic.[BR][BR]Guess all those \"whiners\" agains 1 star trades finally got what they wished for. this is what you get if you keep whining about it.[BR]We are talking about a decaying good that you cannot trade properly.[BR][BR]Unbelievable. not that I was intending on playing this chapter, but the incentive just got only worse.[BR]So this chapter, is little fun that demands you to beg other players to help them out, it destroys spire, it annihalates tournament. and you now need to essentially become a frenzy trader opening it every 5 seconds to see if there is a trade you might need you can get.[BR][BR]The worst of all worlds.[BR]Way to go![BR][BR]If anyone still has the illusion that you are no longer welkcome here as an advanced player, then it just got shattered I think lol\t\tClick to expand...[BR]you can place trades normally it's just a new addition..."}]