[{"165": "CrazyWizard said:\t\t\tOMG what a horrible mechanic.\t\tClick to expand...So the merchant is definitively a replacement and not an addition to the trader?[BR][BR]Personally, I think it sounds like a really cool mechanic to balance out the trader. I fact, I would have loved to see it for normal and sentient goods as well. But if it really replaces the trader, than it sounds far too complicated. At the very least, there should be the option to trade larger amounts with longer waiting times.[BR][BR]Also, if you unlock an additional merchant, will he remain unlocked permanently? The anouncement seemd to imply otherwise."}, {"16": "You don't unlock merchants, you hire them for 20 days.[BR]Offer remains in trader for a week. You can post new trade only when your merchant is idle (either after 6 hours timeout/instants or by the fact his offer was taken by other player)."}, {"166": "Arthus said:\t\t\tyou can place trades normally it's just a new addition...\t\tClick to expand...no, its replacement of normal trades, confirmed by many CM around the world by now[BR]little bee said:\t\t\tAt the very least, there should be the option to trade larger amounts with longer waiting times.\t\tClick to expand...leveling your MH increase amount of the trade"}, {"59": "Dony said:\t\t\tno, its replacement of normal trades, confirmed by many CM around the world by now[BR][BR]leveling your MH increase amount of the trade\t\tClick to expand...[BR][IMG]https://i.ibb.co/ZWmPDv1/https-beta-forum-elvenar-com-index-php-attachments-1618059799348-png-8884.png[/IMG][BR][BR]So you only can trade ascended in \"Merchant\" option?[BR][BR]WTF"}, {"16": "In \"accept offers\" as well"}, {"74": "Excuse me @Dony, if I need to exchange 200k of one sentient I produce with 200k of another sentient, having MH at lv 39, how many trades should I do? Or for normal goods and sentient goods the trades remain the same as before?[BR]From the picture above it seems that normal/sentient trades remain the same and the merchant is only for ascended goods [smilie--sprite1]"}, {"16": "new system is only for ascended goods."}, {"110": "Karvest said:\t\t\tIn \"accept offers\" as well\t\tClick to expand...The issue for years has been to few people offer trades. this does not help as everyone will be looking / battling for those trades that come on the market unless the required amount is very little and ascended goods are just for show.[BR][BR]Because if I need 50K decaying goods and I can only trade 1800 x 3(5) at a time I'll be scouring for the market all day long.[BR]Essentially this turns all those trader haters into traders themselves."}, {"32": "ok, enough about the trades [smilie--sprite8] [BR]Any spoilers for the settlement? How big it should be ... actually minimum, cause maximum can be as big as your city minus some buildings [smilie--sprite8]"}, {"16": "This chapter is called \"Team spirit\" for a reason, if you find a friend who need your goods and offer goods you need online, you can exchange any amount at the cost of loads of clicks and flooded notifications. [BR]+If you are lucky to have rare ascended boost - you will always see trades on the market."}, {"170": "Does BTG affects merchant anyhow? Or is IT here useless?"}, {"16": "No, useless here."}, {"9": "I can't wait to see T7 in Spire negotiations in the next chapter if the merchant is the only way to trade T7+.[BR]And if Merchant is the only way to trade T7, then i'm afraid that I don't know enough rude words to express what i think about developers right now![BR]I read that long time ago, dev team changed something about repeating quests and as a consequence half of beta players quit. Is there anyone left in the dev team who remembers that time and do they want to repeat it?[BR]Because if the merchant thing is the only way of trading T7+ then mass quit of end game players will follow. (I'm 160K unurium away from testing it myself)."}, {"107": "Arthus said:\t\t\tSo you only can trade ascended in \"Merchant\" option?[BR][BR]WTF\t\tClick to expand...[BR][BR]I only have a baby account on Beta so can't confirm this myself:  if I'm understanding the discussion correctly, you're saying it's impossible to trade ascended goods through the wholesaler itself?  Or are you just saying that you can only use the merchant for trading ascended goods, not for trading standard and sentient goods?[BR][BR]On live I just spent the past few months concentrating on my BTG to level 30 so I'd be able to trade ascended goods at 1:1 through the wholesaler once the new chapter came out."}, {"14": "@Steelhail standard and sentient goods have no adjustment. Merchants are needed if you want to place your own ascended offers, otherwise you can only accept other players ascended offers."}, {"59": "This is idiocy far surpassing their Artifact Lottery in Spire/Academy and that is an achievement in itself.[BR][BR]BRAVO. Just 2 more chapters and you will kill this game, I'm out, cya!"}, {"107": "PrimroseSylvia said:@Steelhail standard and sentient goods have no adjustment. Merchants are needed if you want to place your own ascended offers, otherwise you can only accept other players\t\tClick to expand...Thanks for your help.  I'm still not quite understanding whether both merchant and wholesaler allow you to trade ascended goods, or just the merchant does that.  Since the merchant charges an additional trading fee (if I understand right), the wholesaler would be a  big deal if you've got level 30 BTG."}, {"56": "I recall when Chapter 15 came out in beta, with its ludicrous amounts of sentient goods required for EVERYTHING, people had a nearly impossible task of trading goods.  We had a player that had boosted goods that everyone seemed to have.  She had 3 pages of trades up for over 3 days with no trades taken.  Everything she needed to move ahead in the tech tree required things she didn't have and couldn't trade for.  She left the game.  I'm sure she wasn't the only one.  Perhaps the devs are trying to come up with a way that people can get the things they need without paying the scalpers ... and ... here come the whiners.  If you can still accept the scalper's offers, OR use the merchant, I'm not seeing the huge problem here.[BR]Steelhail said:\t\t\tThanks for your help.  I'm still not quite understanding whether both merchant and wholesaler allow you to trade ascended goods, or just the merchant does that.  Since the merchant charges an additional trading fee (if I understand right), the wholesaler would be a  big deal if you've got level 30 BTG.\t\tClick to expand...I would venture to say that not everyone has a level 30 BTG.  Wholesaler is a last ditch effort for the vast majority of players with its ever increasing cost."}, {"166": "wholesaler doesnt offer ascended goods trades, ascended trades comes only throu merchants, either yours or others.[BR]spennyit said:\t\t\tExcuse me @Dony, if I need to exchange 200k of one sentient I produce with 200k of another sentient, having MH at lv 39, how many trades should I do? Or for normal goods and sentient goods the trades remain the same as before?\t\tClick to expand...sorry if it wasnt too clear, but im replying in a thread about chapter 18, ascended goods and merchant feature which was announced in a linked thread in first post"}, {"165": "Maillie said:\t\t\tI recall when Chapter 15 came out in beta, with its ludicrous amounts of sentient goods required for EVERYTHING, people had a nearly impossible task of trading goods.  We had a player that had boosted goods that everyone seemed to have.  She had 3 pages of trades up for over 3 days with no trades taken.  Everything she needed to move ahead in the tech tree required things she didn't have and couldn't trade for.  She left the game.  I'm sure she wasn't the only one.  Perhaps the devs are trying to come up with a way that people can get the things they need without paying the scalpers ... and ... here come the whiners.  If you can still accept the scalper's offers, OR use the merchant, I'm not seeing the huge problem here.Click to expand...The problem is exactly that you can no longer trade normally. Like many of us said, the merchant would make a good addition to the trader. But it is a problematic replacement."}]