[{"171": "\"esprit de corps\" would work better than team spirit"}, {"110": "little bee said:\t\t\tThe problem is exactly that you can no longer trade normally. Like many of us said, the merchant would make a good addition to the trader. But it is a problematic replacement.\t\tClick to expand...[BR]The merchants would have been great to combat imbalances, I would not mind if it was released to all goods as all those little amounts combined can have huge results.[BR]but they used it to vreate a trade limit, I think is a reaction to the overwhelming complainst about traders who are blamed for these imbalances.[BR]as sentient and now ascended have a world wide trade vieuw, imbalance issues that always existed are shown exaggerated, so even the smallest imbalance can lead to huge numbers on the market. this can make it appear much more severe than it actually is.[BR][BR]If there is a 2% imbalance on your local 200-250 players around you market it may lead to lets say numbers like x goods. but when you have a 2% imbalance on a world scale on a server with 40.000 players you talke about 160x that you see on the market which makes it look absolutely huge.[BR][BR]When people use this imabalance to make a profit it's then the ideal canditate to point fingers at something they did not create, they are not the disease but at best you can call them a symptom.[BR][BR]But there is a catch, these are decaying goods putting a soft cap on how much you can earn from it. you can never reach the scale you need for a rockefellar scale world domination. they can influence the market a but and for example have an imbalance stick longer than needed but they can never control it.[BR]As soon as the underlying issue is solved there effectiveness also drops.[BR][BR]The merchant could have been the correct step to resolve the fundamental issue, but is (ab)used in a really bad way that will bit back ferociously later in the game.[BR][BR]this is the point where you give away your freedom for no apparent good reason."}, {"5": "Well, if this whole Merchant/Trader system is so bad, then all you chapter 18 players need to playtest the hell out of it and do nothing but point out how bad it is. Honestly, if even one player comes here and says it is alright, I am going to accuse them of being a mole for Inno.   lol"}, {"152": "Enevhar Aldarion said:\t\t\tWell, if this whole Merchant/Trader system is so bad, then all you chapter 18 players need to playtest the hell out of it and do nothing but point out how bad it is. Honestly, if even one player comes here and says it is alright, I am going to accuse them of being a mole for Inno.   lol\t\tClick to expand...[BR]I wish I had a chapter 18 beta city so that I could say that it's alright.[BR][BR]I'm trying to understand the complaints.  The main issue is that you're worried that the trading volume will be too low and/or not scale correctly?  That is potentially a problem, yes, but we don't know yet if it is too low."}, {"5": "ekarat said:\t\t\tI wish I had a chapter 18 beta city so that I could say that it's alright.[BR][BR]I'm trying to understand the complaints.  The main issue is that you're worried that the trading volume will be too low and/or not scale correctly?  That is potentially a problem, yes, but we don't know yet if it is too low.\t\tClick to expand...[BR]No, from what I see other people saying is that the new Ascended goods can only be traded in small amounts through this new Merchant and you can't post trades for the goods in the Trader at all, though the Merchant trades will show in the Trader for other people to take. If sounds like it will force you to constantly keep those 5 Merchant trades active as much as possible. Plus, to unlock all 5 Merchants, you have to spend diamonds."}, {"9": "@ekarat Try to imagine that you negotiate Spire, now ch19 comes and ascended goods (T7) appears in the Spire. With the expected prices there and the low ability in trade, you will simply not be able to trade enough for Spire negotiations regardless how much you'll produce.[BR]Even if we don't talk about next chapter, with such a system there is no point having more than one T7, since you can't trade enough anyway.[BR]Limiting players how much they can trade is simply horrible system right from the start. I can even imagine players who won't quit building a non-boosted T7 to overcome the limited trades and that is simply ..........[BR][BR][BR]Dony said:\t\t\tand for level 39 main hall it is limited to 1800 ascended goods per merchant[BR]then if you send out merchant, you get instantly desired goods back, but your merchant is on 6 hour cooldown\t\tClick to expand...I think I have a solution for this (at least for portal lv 2):[BR][IMG]https://i.ibb.co/JCWHLDP/https-beta-forum-elvenar-com-index-php-attachments-1618115486650-png-8887.png[/IMG][BR]With 6 T1 I can make 5280 T7/3h, with the 6h cooldown of the Merchants, I can produce 10560 non-boosted T7 at the same time.[BR][BR]The fact that I can produce non-boosted T7 faster than I can trade them for my boosted simply shows how horrible T7 trading system is![BR][BR][BR]ps:[BR]Started to build more T4, just to upgrade them to 32 and produce non-boosted T7 (faster than trading).[BR][BR]ps2: If one has enough MM spells, the Merchant's trading capacity compared to the non-boosted production is even worse.[BR]The trading limit will not force players to trade like crazy, it will instead force them to produce non-boosted T7!"}, {"164": "CrazyWizard said:\t\t\tBut there is a catch, these are decaying goods putting a soft cap on how much you can earn from it. you can never reach the scale you need for a rockefellar scale world domination. they can influence the market a but and for example have an imbalance stick longer than needed but they can never control it.\t\tClick to expand...The whole reason why they can do it so easily is because of decay. Since they were first and quickly cornered the market no one else can amass a large enough stockpile to fight them.[BR][BR]The one good thing about the merchant system is that the parasites can't take trades for a profit and therefore can't control the market."}, {"5": "Lovec Krys said:\t\t\t....with the 6h cooldown of the Merchants....\t\tClick to expand...[BR]The cooldown only matters if no one takes the trade you made through the Merchant. If someone takes it before the 6 hours ends, then you get that Merchant back at that moment.[BR][BR]So I see maybe some fellowship switching by chapter 18 players when this hits Live? If you have a fellowship with at least one player boosted in each of the T7 Ascended goods, then those three, or more, can just sit in-game together for a little while and trade around the goods through the Merchant until they each have what they need, or they run out their spare goods. This might also get people to talk to their chapter 18 map neighbors and coordinate a time to be online to do this. This may be why they really called this chapter Team Spirit, because of the teamwork it will take to complete the chapter in a reasonable amount of time. Now I need to go and check the boosts in my Live fellowship, where there are 5 or 6 of us either done with chapter 17 or in chapter 17, to see if this will work."}, {"164": "Enevhar Aldarion said:\t\t\tSo I see maybe some fellowship switching by chapter 18 players when this hits Live? If you have a fellowship with at least one player boosted in each of the T7 Ascended goods, then those three, or more, can just sit in-game together for a little while and trade around the goods through the Merchant until they each have what they need, or they run out their spare goods\t\tClick to expand...It depends on what ascended goods are for. I don't see any in the techs, so as long as everyone doesn't have the same expenses in settlement buildings then having a player with each boost should work."}, {"166": "Lovec Krys said:\t\t\tWith 6 T1 I can make 5280 T7/3h,\t\tClick to expand...only if you can produce 37200 unurium per 3h, which nobody in the world can, i can barely keep up with 1 single boosted manufactory at this point (unurium is also needed for techs)[BR]my negotiating only free to play city cant even keep 3h production of 1 manu, it just producing less then 6200 unurium per 3h[BR]let alone T8 and T9 in next chapters, i cant imagine our unurium production will be triple, unless they start massively introduce them to event buildings and on top of that i will also need unurium and ascended goods for spire negotiating, not even in wild dream i can keep up with that with current state of the game[BR][BR]SoggyShorts said:\t\t\tIt depends on what ascended goods are for. I don't see any in the techs, so as long as everyone doesn't have the same expenses in settlement buildings then having a player with each boost should work.\t\tClick to expand...every settlement hub on level 1 need 270 +270 ascended goods per 8 hours[BR]building them and upgrading them requires another"}, {"5": "Dony said:\t\t\tonly if you can produce 37200 unurium per 3h, which nobody in the world can, i can barely keep up with 1 single boosted manufactory at this point (unurium is also needed for techs)[BR]my negotiating only free to play city cant even keep 3h production of 1 manu, it just producing less then 6200 unurium per 3h[BR]let alone T8 and T9 in next chapters, i cant imagine our unurium production will be triple, unless they start massively introduce them to event buildings and on top of that i will also need unurium and ascended goods for spire negotiating, not even in wild dream i can keep up with that with current state of the game.\t\tClick to expand...[BR]The current setup in my Live city gives me 10,500 unurium every 3 hours. When chapter 18 started here, I switched from seeds to unurium production, to hopefully have 200-300k saved up for when the chapter releases on Live."}, {"166": "quests also asks you to have 12 hubs at level 3 = 12720 combined ascended goods  and 504k mana needed per 8 hours, but production of those 8h is not enough to keep producing other things in next 16 h, so you will need to do atleast 2x/3x8h per 2 days (if you can produce 1 million mana per day tho, else your productions will be idle)[BR][BR]atleast there are 10 mandatory techs skipable for me to get to the end[BR]Enevhar Aldarion said:\t\t\tto hopefully have 200-300k\t\tClick to expand...300k is not even enough for 1st 3 techs [smilie--sprite1]"}, {"9": "@Dony Yes, you're right. Unurium is the limit for that.[BR]If it was only for upgrading buildings, then it would be possible to overcome with the unboosted manus, but i have checked minmax's spoilers about settlement production, and since they are needed in large quantities we are screwed...... not sure how they expect us to finish this chapter with such a horrible trade system...[BR][BR]The only good thing is that there is no point in building more than one of each settlement building since we won't have enough goods to feed them anyway.[BR]And quests? Who does them anyway. I haven't finished a single questline since Wood Elves."}, {"165": "Enevhar Aldarion said:\t\t\tThe cooldown only matters if no one takes the trade you made through the Merchant. If someone takes it before the 6 hours ends, then you get that Merchant back at that moment.[BR][BR]So I see maybe some fellowship switching by chapter 18 players when this hits Live? If you have a fellowship with at least one player boosted in each of the T7 Ascended goods, then those three, or more, can just sit in-game together for a little while and trade around the goods through the Merchant until they each have what they need, or they run out their spare goods. This might also get people to talk to their chapter 18 map neighbors and coordinate a time to be online to do this. This may be why they really called this chapter Team Spirit, because of the teamwork it will take to complete the chapter in a reasonable amount of time. Now I need to go and check the boosts in my Live fellowship, where there are 5 or 6 of us either done with chapter 17 or in chapter 17, to see if this will work.\t\tClick to expand...Sure, if the goods are perfectly balanced and if everyone can coordinate to be online at the same time, than trading will be possible (but annoying). But those are some pretty big ifs. [BR]In particular, if you need your trades to be accepted and/or accept trades yourself, than the system will no longer be able to combat an imbalance. Nor will it be easier than the trader. So it fails at the two reasons for which it was designed."}, {"169": "trading 1800 per trade is certainly annoying when you need 68k to up the portal"}, {"59": "It was made to prolong chapter 18 even more than previous one, obviously[BR]Question is will some evolving buildings give ascended goods/unurium in the future?[BR]And what will be use of ascended/unurium for city's profit outside the chapter?"}, {"152": "I want to wait and see if the volume will be too low in practice.[BR][BR]I will agree with the prediction that it will limit people to 1 T7, but I wasn't planning on building more than 1 T7 (when I get there -- still on chapter 17)."}, {"101": "I am working as hard as I can on Chapter 18. Really want to see this trading mess for myself.[BR]But sadly the early research all requires unurium and there is only one source for that. And I can't push it any faster.[BR]There need to be more ways to produce unurium - and I'm not talking wonders or premium buildings."}, {"5": "Yeah, looks like the need for Unurium, and by extension working culture and pop, is going to really punish the players who try to run their cities with event buildings and minimal Magic buildings."}, {"168": "Do you please have someone some reference to the assignments and an overview of the buildings in (collective spirit) Thank you."}]