[{"98": "Good! Anyone have any idea what the settled settlement might look like? to know what space we will need approximately for this new race and its settlement? Portal, buildings around it ... Thank you!"}, {"34": "Not sure yet if it's enough but for the time being I settled for a 4x5 extensions area[BR]it allows me to put 3 of each element hub in addition to the portal (lvl 2 at this point, will grow at lvl 3 & 4)[BR]I'm skipping the welcome square buildings and will use PPs instead[BR][BR][IMG]https://i.ibb.co/b5jvnYs/https-beta-forum-elvenar-com-index-php-attachments-settlement-ch18-jpg-8890.jpg[/IMG][BR][BR]on a map, it looks like this below :[BR]certainly not optimized, but i tried to minimize the amount of team park streets (the items connecting the settlement buildings to the portal)  since each of them costs 10k of unurium...[BR][BR][IMG]https://i.ibb.co/4FRvKSY/https-beta-forum-elvenar-com-index-php-attachments-1618214590504-png-8891.png[/IMG]"}, {"101": "Of course those of who do the chapter quests can be pushed in directions other than what we really like. Might need to put up one or more of the welcome squares just to satisfy the requirements.[BR]At times I wonder if it is worth following the quests. There can be some decent rewards but it is hard to judge."}, {"5": "Jaxom said:\t\t\tOf course those of who do the chapter quests can be pushed in directions other than what we really like. Might need to put up one or more of the welcome squares just to satisfy the requirements.[BR]At times I wonder if it is worth following the quests. There can be some decent rewards but it is hard to judge.\t\tClick to expand...[BR]I do all the quests the first time I do a chapter, and then start ignoring them when other cities get that far. Even with completing the quests for chapters 15-17, I was still able to push through them in about 4 months for each. Sure, that used up a lot more resources than I got back in rewards, but why hoard stuff and never use it?"}, {"74": "I always did the chapter quests till chapter 17. The \"have 3 of each big ships\" was too ... to be done and, for the first time, I didn't continue the chapter quests and stopped there. I was really frustrated, but that mission was really too \"much\" (and also other afterwards). This will probably happen again if they continue to propose ... chapter quests. (... means ... I cannot be polite ;-))[BR]@pilousd: do you think 3 per type at lv 3 will be enough to have a reasonable pace (4 months) for the chapter?"}, {"9": "Enevhar Aldarion said:\t\t\tbut why hoard stuff and never use it?\t\tClick to expand...You never know when you'll need them for something actualy usefull, so by my opinion it's better to hoard them then use them on stupid quests.[BR][BR]@spennyit There were worse quests. My main city got stuck with the stupid sell small ships of one kind/build small ships of another kind.[BR]And about ch18: By my opinion the chapter will be limited by our ability to trade T7 (and in that case it won't matter how many settlement buildings you have - we shall see)."}, {"5": "Lovec Krys said:\t\t\tThere were worse quests. My main city got stuck with the stupid sell small ships of one kind/build small ships of another kind.\t\tClick to expand...[BR]I just teleported the ships to inventory and then put them back out for those quests."}, {"152": "Lovec Krys said:\t\t\tYou never know when you'll need them for something actualy usefull, so by my opinion it's better to hoard them then use them on stupid quests.[BR][BR]@spennyit There were worse quests. My main city got stuck with the stupid sell small ships of one kind/build small ships of another kind.[BR]And about ch18: By my opinion the chapter will be limited by our ability to trade T7 (and in that case it won't matter how many settlement buildings you have - we shall see).\t\tClick to expand...[BR]There are some pretty strong requirements for mana and unurium as well, so I wouldn't bet on the merchant being the limiting factor when all is said and done.  But even if things are limited by mana, then you might not have enough to keep all your buildings supplied anyway."}, {"34": "spennyit said:\t\t\t@pilousd: do you think 3 per type at lv 3 will be enough to have a reasonable pace (4 months) for the chapter?\t\tClick to expand...[BR] Hard to answer at this point... usually that's what it takes when you stick to the quest line, we'll see...[BR][BR]For sure 3 of each hub (at level 1) is not sufficient to keep my portal (lvl 2) active all day and night.  It allows to produce over night (8h prod) the elementals needed to produce medals during the day (4h prod) which are then consumed by the portal to create around 20 badges/day at best. (4025 badges are required to complete research)[BR][BR]At levels 2 and 3, my element hubs will produce with a factor x1.5 then x2  but the portal lvl3-4 will just run faster, not create more badges, [BR]I need to see how it adjusts (and what is practically possible, especially at night)"}, {"9": "@Enevhar Aldarion Didn't know that it would work, but anyway, there are still quests behind like produce xxxxx settlement goods when you no longer need them.[BR][BR]@ekarat Yes, trading option is not the only obstacle, but i wonder which of them will be worst and how much the limiting of trading will be limiting my beta city, since i'm the only one in ch18 in my FS (other 4 members are in the middle of ch17, the rest are in lower chapters), so i'm completely dependant on T7 non-fs market. And beta market is bad enough even without amount limitations."}, {"59": "Unurium and seeds should be picked up at once, period.[BR]Most idiotic thing they ever introduced is switching in between."}, {"23": "They established a new material with low production and reduced the production of other one.[BR]Very effective."}, {"159": "I have been producing unurium non stop since this dispirited race started and I was only able to research 3 techs including the portal. ANd I crammed everything I could in the city to increase a bit the production. It will take ages to do anything, the t7 mercs have a shockingly low ratio mercs/unurium it will be very complicated to have seeds and unurium to feed the factories, one of every merc, no more. It. seems Inno nailed the formula to be sure nobody will finish in a decent time without loads of diamonds to buy unurium [smilie--sprite3]"}, {"74": "palmira said:\t\t\tI have been producing unurium non stop since this dispirited race started and I was only able to research 3 techs including the portal. ANd I crammed everything I could in the city to increase a bit the production. It will take ages to do anything, the t7 mercs have a shockingly low ratio mercs/unurium it will be very complicated to have seeds and unurium to feed the factories, one of every merc, no more. It. seems Inno nailed the formula to be sure nobody will finish in a decent time without loads of diamonds to buy unurium [smilie--sprite3]Click to expand...How long do you take to do 1,5 Million mana? To me it seems mana the main problem :-( While you gather mana, you can get a lot of unurium."}, {"22": "with dragon abbey, the time to cast a hundred of enchantement [smilie--sprite8]"}, {"9": "@Ainor And how many more chapters before you run out of enchantements this way?"}, {"74": "Ainor said:\t\t\twith dragon abbey, the time to cast a hundred of enchantement [smilie--sprite8]Click to expand...Probably you will need 2500 enchantments for the chapter ;-)"}, {"22": "at this moment, my mana and my enchantements:[BR][IMG]https://i.ibb.co/k4g4kBh/https-beta-forum-elvenar-com-index-php-attachments-1618330598630-png-8896.png[/IMG][BR]my mana daily production (from elvenstats, then without maze, evolving building and set bonus):[BR][IMG]https://i.ibb.co/ssbCzPt/https-beta-forum-elvenar-com-index-php-attachments-1618330959221-png-8897.png[/IMG][BR]tournament reward every week:[BR][IMG]https://i.ibb.co/Dz7LZtJ/https-beta-forum-elvenar-com-index-php-attachments-1618331007924-png-8898.png[/IMG][BR]thus no, is not mana that worried me.."}, {"164": "Ainor said:\t\t\tat this moment\t\tClick to expand...hehehe \"Orchi\""}, {"9": "@Ainor Ok, that should take some time before you burn them all."}]