[{"22": "no decay for orcs [smilie--sprite7]"}, {"43": "For all point in Technology [BR]970.000 uranium[BR]785.000 seeds[BR]it Can be defficult to get from trader."}, {"74": "@Ainor, have you lv 31 3rd era manufactories?"}, {"22": "spennyit said:@Ainor, have you lv 31 3rd era manufactories?\t\tClick to expand...no, and I don't need them for the moment (but I must spend 4,330 millions mana for MH research and upgrade in a few days time).[BR]The point is: mana production can be adjusted simply, unurium production and ascended goods trading not much."}, {"98": "we need 2 or 3 new manufactury?? what do you think?"}, {"5": "LOKINHO said:\t\t\twe need 2 or 3 new manufactury?? what do you think?\t\tClick to expand...[BR]I have two ready in my Live city. From the sound of the requirements, two may be all we can keep producing.[BR][BR]This chapter and the new goods make MM enchantments and the ETC Wonder even more valuable. And a max level Storm Phoenix too."}, {"172": "Hi guys,[BR][BR]could you tell us if magic residences/workshops upgrades’ are available right away, or we have to wait until appropriate tech has been researched ?"}, {"9": "@Dl. Goe Yes, you just need to research first tech in the chapter."}, {"37": "Sentient goods values in event buildings for ch18 seem to be fixed, so no crazy productions as it looked like.."}, {"16": "Armory training size increased for ch18+"}, {"9": "Yes, whenever anything seems better then garbage is's always a bug."}, {"16": "training speed for ch18+ increased a bit. (still not enough to consider moving forward from ch15, IMHO).[BR]btw, not crazy increase for spire set was nerfed too"}, {"59": "They nerf all that would make buildings worth placing"}, {"110": "Karvest said:\t\t\ttraining speed for ch18+ increased a bit. (still not enough to consider moving forward from ch15, IMHO).[BR]btw, not crazy increase for spire set was nerfed too\t\tClick to expand...[BR]Got numbers?[BR][BR]Yeah to incentive players to advance they need to increase training speed with like 20-25% per chapter.[BR]But sure what the values are now but it was like 11% in chapter 16,  5.2% in chapter 17 and 5% in chapter 18 so even if they increase it a little there is already a huge deficit.[BR][BR]And if they would increase it each chapter with 20-25% then I wonder how long it takes for people to run out of supplies[BR][BR]Did I see it correct did they raise it to 11%? [BR]Thats still a huge deficit even looking at the chapter alone ignoring the massive deficit of the previous chapters."}, {"16": "550 instead of 525 for ch18"}, {"110": "Karvest said:\t\t\t550 instead of 525 for ch18\t\tClick to expand...[BR]So 10% instead of 5% while we loose 23% or so in this chapter.[BR]So they recognise it a little bit, but ignore it mostly anyway.[BR][BR]thats even worse than ignoring it. thats like a huge middlefinger."}, {"110": "So in the past 3 chapters (16-17-18) we gained 30% more unit production (22% barracks 22% mercenary camp 48% training grounds).[BR][BR]At the same time the losses have been raised by ~80%[BR]And I doubt negotiation cost will look much better"}, {"9": "@CrazyWizard Worse, since tourney negotiating includes now also mana, coins and supplies (especialy mana) and orcs costs has risen significaly compared to the previous system.[BR]And in Spire on top of that you also has expired goods and especialy seeds (and possibly unurium, but i haven't seen it there yet).[BR]For my main city, negotiating in Spire had become so expensive that I had to switch to fighting."}, {"110": "Lovec Krys said:@CrazyWizard Worse, since tourney negotiating includes now also mana, coins and supplies (especialy mana) and orcs costs has risen significaly compared to the previous system.[BR]And in Spire on top of that you also has expired goods and especialy seeds (and possibly unurium, but i haven't seen it there yet).[BR]For my main city, negotiating in Spire had become so expensive that I had to switch to fighting.\t\tClick to expand...[BR]I am not comparing old vs new format, but new level 15 vs new level 18, how much does production of negotiation material improve vs costs.[BR][BR]as long as there is a massive deficit each chapter the fun to move ahead and do new chapter and handicap yourself ain't much fun.[BR]It doesn't matter if it does not improve, as long as it does not get worse it's fine.[BR][BR]Currently it's get horribly worse.[BR][BR]If they match the rise in required units with a rise in unit and supply and goods production it's just peachy."}, {"74": "Can somebody post the production times of the settlement buildings? 15min in chapter 17 was really awful :-([BR]Thanks in advance [smilie--sprite1]"}]