[{"16": "portal: starting form 1h x5 slots on lvl1 down to 24min x5 slots on lvl4[BR]square: 24h auto with 3h early pickup[BR]other: 8h elemental / 4h medal"}, {"4": "In tourney battles are the enemy bringing any 4 star troops?   It had been 1-star for provs 1-5, 2-star for provs 6-10 and 3-star for all others. Given that, I'd presume 4-star would start showing up in prov 16.[BR][BR]If they are showing up, I'd also only expect them to be their version on the archer, orc strat, and drone rider. Is that also the case?"}, {"5": "Yogi Dave said:\t\t\tIn tourney battles are the enemy bringing any 4 star troops?   It had been 1-star for provs 1-5, 2-star for provs 6-10 and 3-star for all others. Given that, I'd presume 4-star would start showing up in prov 16.[BR][BR]If they are showing up, I'd also only expect them to be their version on the archer, orc strat, and drone rider. Is that also the case?\t\tClick to expand...[BR]None that I have seen in the first 20 provinces this week or last week, but that is as far as I go with my Beta city."}, {"9": "And i'm done with quests (again).[BR]With the limited trading i'm deffinitely not going to donate any T7:[BR][IMG]https://i.ibb.co/f4T3Zxp/https-beta-forum-elvenar-com-index-php-attachments-1618554781325-png-8916.png[/IMG]"}, {"159": "Lovec Krys said:\t\t\tAnd i'm done with quests (again).[BR]With the limited trading i'm deffinitely not going to donate any T7:[BR]View attachment 8916Click to expand...You should, unless you produce steel for the portal upgrade. The trading system sucks big time. With 10% decay and 1800x3 every 6h it will take an eternity to gather the needed materials. You better use some t7 to complete the task otherwise it will just decay"}, {"9": "@palmira So far I'm lucky to have bonus on ingots (almost all offers asks them currently), so for now I'm limited mainly by unurium production."}, {"5": "Can someone here confirm that the numbers on elven architect for the Lava Egg are correct and it jumps from 68k mana in chapter 17 to 83k in chapter 18? If correct, that is a huge increase after the tiny 4k increase from chapter 16 to 17. And also if correct, my chapter 17 Lava Eggs just moved to the top of my upgrade list once Chapter 18 reaches Live."}, {"16": "Almost any mana producing building has 20-22% increase in this chapter"}, {"169": "unless they nerf it..."}, {"173": "maxiqbert said:\t\t\tunless they nerf it...\t\tClick to expand...More like until they nerf it. Stuff like that seems more like it's inevitable rather than simply possible these days."}, {"88": "Here is some preliminary feedback after first week and a half of playing chap 18...[BR][BR]POSITIVES​Some of the buidings designs are stunning!  The portal, magic residences and magic workshops are absolutely beautiful. Congrats to the designers!I am happy to only see fair trades on the market.  Love to see that nobody can \"abuse\" the system especially that we are all looking after the same goods (at the beginning of the chapter).Happy to see that the settlement size will have a reasonable size overall, unless I miscalculate my needs [smilie--sprite2]Happy to see new province expansion limit (don't know if this was related to chap 18 or not but I am happy to have it)[BR]      NEGATIVES[BR]The new mechanic of the superior trader with the merchants seems to be an extreme limiting factor since we have reach a critical base of players producing ascended goods.  We'll see how thi evolve but I am not thrilled at all.  It would help to have visibility on our merchants availability (something like we have for the builders), showing us how many are available for trades.  I can't see myself sorting notifications to look for that, nor to go back frequently on the merchants's view of the trader to find out.  This is not very well designed.It would be usefull to see our own ascended goods trades too as we do for all other goods.  Maybe this is a bug?Unurium production is too much of a limiting factor.  I can't progress in the research, do upgrade and produce ascended goods with only one part time unurium source... I am also stuck on seeps production being too low to run my sensitive manufatories, even if I have over a dozen of buildings producing seeds in addtion of the part time seeds production at the trader.  My suggestion would be to modify the trader so we can produce both, seeds and unurium, at the same time.  that's it for now [smilie--sprite1][BR]Ange"}, {"152": "Are the merchant unlocks with diamonds permanent or temporary?"}, {"16": "all merchants are hired for 20 days"}, {"9": "Merchant's capacity increased from 1800 to 2000 after upgrading Main Hall from lv39 to 40.[BR]Just anybody knows what to expect from this marvelous chapter..."}, {"16": "That was known and expected from announcement and in-game help. [BR]Spoiler: Numbers from current game files for those who interested:38:1600[BR]39:1800[BR]40:2000[BR]41:2200[BR]42:4600[BR]43:5000[BR]44:8000[BR]45:9000[BR]46:10000[BR]47:11000[BR]48:12000[BR]49:13000[BR]50:15000"}, {"9": "@Karvest Not exact numbers. We knew that it depends on Main Hall level, but not the amounts/formula.[BR]And going from 1800 to 2000 is horribly low. I wonder how many players give up and quit just for this Merchant feature itself."}, {"16": "Well, up to the last version before release it was starting from 3k at MH lv38 and going up to 4.4k at MH lvl 41, but seems they've decided that it's too high."}, {"9": "And now situation on market has changed.[BR]No one trades Primordial Minerals (previously was ingots).[BR][BR]Well, i still need 150k unurium to research hubs.[BR]So unless the market changes again,  with the stupid limit i think that it will be faster just use MM spell over my Marble manufactory (non-boosted) and waste a lot of unurium to build the hubs instead of waiting if anyone accepts my Ingot>PM trade (so i can trade more than 2k/6h).[BR][BR]Oh, how i hate this stupid Merchant feature.[BR]Seems that the best Merchant strategy is to play multiple cities and have all bonuses and trade it immadiately by yourself."}, {"75": "Currently I see an imbalance on all 4 servers I play on, soap being in high demand and bismuth dropping in value.[BR][BR]Today the soap guys will readily find fair trades (or even better) to pick whenever they need them, while producers of bismuth hardly get fair deals und usually have to accept a loss of 5% to 10%[BR][BR]If I understand the Merchant mechanic correctly, and if we had it today for sentient goods, soap producers would readily find fair trades (nothing better) started by other players whenever they need them, while producers of bismuth find no trades waiting, and instead have to pay for Merchants and wait until their next login for their return to trade more, thus being limited by the tradable amount. Note that only the bismuth players would be limited (and exact amount depending on login frequency) while the soap players would not be.[BR][BR]I'd REALLY REALLY rather take the 5% losses than a trade limit for only a part of player base.[BR][BR](This would not be a problem if produced and needed resources were perfectly balanced, but honestly I do not believe this will happen. Even without things like the current dust manufactory upgrade costs for levels 28 to 31 being off balance, there are things like the spire set with unbalanced production)"}, {"5": "If it is true that the five merchants are only bought for a limited time, rather than being a permanent purchase, then that is offensive. Spending diamonds for the 4th and 5th merchants should not be something that has to be repeated every 20 days. That needs to be changed before this goes to the Live worlds. I have always said that I would never quit playing until there were no more chapters, but this forced repeat diamond spending, in order to get through the chapter a little faster, is wrong, and might be the thing that sours me on this game. @Marindor I hope Inno is paying attention to this."}]