[{"143": "@Enevhar Aldarion We are forwarding the feedback and concerns, but that's all the info I have for now."}, {"16": "Any usecase of diamonds is there to get through the chapter/fa/tourney/etc a little faster.[BR]+There are enough of ways to get such tiny amount of diamonds in game."}, {"5": "@Marindor That is all I am making sure of. And since we have not had this chapter on Beta for 20 days quite yet, I am hopeful that by the 20-day mark, the devs may extend the time or make it permanent, so that the players who may spend diamonds a 2nd time when the merchants have to be renewed, will not be wasting them."}, {"5": "Karvest said:\t\t\tAny usecase of diamonds is there to get through the chapter/fa/tourney/etc a little faster.[BR]+There is enough of ways to get such tiny amount of diamonds in game.\t\tClick to expand...[BR]A one-time spending is what is expected, same as upgrading the Builders Hut or the Magic Academy. There has been nothing in this game before chapter 18 that has required repeat spending of diamonds just to complete things a little faster or more efficiently. Six months to complete the chapter is 26 weeks, or 13 repeat purchases of those two merchants. So that is 300 diamonds for the two or 3900 diamonds over the chapter. Or more for all the players who cannot complete it even as quickly as six months."}, {"16": "You can complete the chapter using only one merchant if you have a balanced and active endgame FS...[BR]I'm not defending the merchants mechanic, I find it very annoying. But I'm fine with hiring costs in diamonds."}, {"166": "buying 4th and 5th slot is your least problem and from a big picture its even irrelevant[BR]almost all those trades on the market were made with time boosters or diamonds, where players will spend 100x more then buying 4th slot, there is a reason why trades are so small, so you need to use it many many times if you actually want to progress in this game, and by using time boosters/diamonds you only need 1 merchant, others will be waste of diamonds/coins[BR][BR]and what happens once you are done with this chapter? you wont buy any merchant, you wont use any timebooster/diamonds to post new trades and you will let all other players struggle the same way as you did in this chapter, just because ascended goods are useless outside of progressing in this chapter yet"}, {"9": "Dony said:\t\t\tand what happens once you are done with this chapter? you wont buy any merchant, you wont use any timebooster/diamonds to post new trades and you will let all other players struggle the same way as you did in this chapter, just because ascended goods are useless outside of progressing in this chapter yet\t\tClick to expand...That's actualy a good thing considering the horrible merchant mechanics. Now try to imagine having those goods in Spire negotiations, that would make Spire even more unnegotiable than it already is.[BR][BR]@Karvest Depends what you call a balanced FS. Is my FS imbalanced just becaues i did everything i could to hit the end game as fast as possible to be able to test new chapters once they come to beta, so i'm the only one in ch 18? (there are 4 others in ch17, but no one has finished it yet (if they did, we would have all 9 bonuses))."}, {"159": "Actually, maybe because I produce minerals that are in high demand right now, the merchants work just fine, I barely used mine in the last days and I got all the mercs I needed, the problem in the beginning was to be expected with only a few players on the market and everybody wanting to upgrade the portal. I upgraded mine later, built the race buildings first and had no problems with my 3 merchants. My bottleneck is the unurium/seeds production that even with all my seeds buildings out is just not enough. All in all, I am really liking the merchants, at least I am getting what I need at a fair exchange and I don't need to feed greedy producers of the less available merc as in previous chapters."}, {"30": "You are lucky, I have Sprouts and nobody needs. [BR]And many thanks for picking up my trades Palmira"}, {"9": "@palmira Yes, i know, been there. Now I'm enjoying the other side.[BR][BR]Anyway I decided to rename this chapter to \"Team trade torture\"."}, {"152": "Enevhar Aldarion said:\t\t\tA one-time spending is what is expected, same as upgrading the Builders Hut or the Magic Academy. There has been nothing in this game before chapter 18 that has required repeat spending of diamonds just to complete things a little faster or more efficiently. Six months to complete the chapter is 26 weeks, or 13 repeat purchases of those two merchants. So that is 300 diamonds for the two or 3900 diamonds over the chapter. Or more for all the players who cannot complete it even as quickly as six months.\t\tClick to expand...[BR]I have similar feelings -- I have a strong preference for my diamond purchases to be permanent, and I expect many others feel the same way."}, {"16": "permanent merchants would cost much higher."}, {"5": "Karvest said:\t\t\tpermanent merchants would cost much higher.\t\tClick to expand...[BR]That is fine. Make them the same cost as the MA levels. It will still be a lot cheaper."}, {"16": "MA levels are very cheap..."}, {"152": "Karvest said:\t\t\tpermanent merchants would cost much higher.\t\tClick to expand...[BR]I'm also fine with that.  I'd save up for a permanent merchant.  Make it cost 10x as much, and I'd be fine with that."}, {"165": "I don't see a problem with a diamond cost for a temporary erchant either. 300 diamonds every 20 days are quite easy to maintain, even for a F2P player. And once you reach chapter 18 there are not a lot of permanent things left to buy with diamonds.[BR][BR]The main problem is still that the merchants fails to even out trade imbalances, even though that is exactly what it was designed for. Before players with overabundant goods only had to offer discounts. Now they become limited in how much they can trade and in the time they wait, some of their goods decay. So now, they loose both time and goods, where they only lost goods before. [BR]If it were possible to have merchant+trader at the same time, that problem would be solved."}, {"27": "Chapter 18 has been around for a while - will the wiki be updated or do we have to wait until the chapter goes live? [smilie--sprite2]"}, {"26": "Indianaking said:\t\t\tChapter 18 has been around for a while - will the wiki be updated or do we have to wait until the chapter goes live? [smilie--sprite2]Click to expand...You will have to wait [smilie--sprite1][BR][BR]Our team also needs time to make the wiki page, gather the screenshots where necessary and to translate all the info to all different languages.[BR]If you want the wiki as soon as it hits beta, then you will have to wait longer before the chapter arrives on beta. Because that would mean the wiki team would get an exclusive preview for a long time, while the playerbase has to wait and new bugs are not found by you guys... So we choose to work on wiki together with the release on beta to not waste time.[BR][BR]PS: please remember that our mods are only volunteers and this isn't their payed daytime job."}, {"173": "It sucks when active discussions are seemingly ignored but relatively mundane questions get responded to immediately. Just an observation!"}, {"9": "Btw, minimum of Team streets is 2 - if you build 1 of each Hub only."}]