[{"26": "qaccy said:\t\t\tIt sucks when active discussions are seemingly ignored but relatively mundane questions get responded to immediately. Just an observation!\t\tClick to expand...Absolutely nothing is ignored, but the active discussions is not in the control of the volunteer team. It is not our place to agree or disagree with what is said in them. So we can only forward everything we see, and give info back if we get it back.[BR][BR]The 'mundane questions' aren't answered immediately by us either, usually the playerbase answers the questions faster then we can. But if we need to clarify further or counter disinformation, we will ofcourse reply.[BR][BR]You could also interpreter me responding to that question as an extra acknowledgement that all the feedback is always read, and by more then one person of the team. So keep those active discussions going, so that we can forward it all."}, {"88": "OK after another week of playing chap 18... I am slowly making progress on my settlement, extremelly slowly I should say.  [BR][BR]POSITIVES[BR]More buidings designs are stunning! [smilie--sprite1] The Elven Main Hall is stunning. Congrats again to the designers!I was able to launch my first element production run yesterday [smilie--sprite2]My portal was upgraded to level 2 before I started any hubs production, so at least I can have a little portal boost right awayNEGATIVES[BR]I was happy to only see fair trades last week but in reality, I am not able to take any trade because I am a sprouts producer! We are penalised as most of the time, we have to wait the full 6 hours for our merchant to become free.  I would rather pay a little extra on the trades instead of consuming a bunch of time boosters that other players can use elsewhere. I very much dislike the fact that I need to check if my merchant is back sooner then the 6 hours waiting time, while most of the time my offers are not taken!  Still think UNURIUM is too much of a limiting factor.  It seems that you did not take into account that we have to upgrade buildings plus produce ascended goods and so far, I can't see how my full size settlement (12 hubs in total) will be able to run smoothly.  Future will tell.Mana requirements are way too high.  I am struggling to finish upgrading my T3, plus now the T1&T4 going to level 32, and Main Hall (if I want to place larger trades!) plus the mana reuqired to produce elements, plus the mana requirements to unlock research... big chunck above 1000k are way too frequent [smilie--sprite9]The production run duration in the hubs are 4h and 8 hours...  another unnecessary thing that will slow our entire city.  Do you seriously think we will log every 3 hours for our regular productions and then every 4 hours for this chapter settlement??  I am use to log at 6h-9h-12h-15h-18h-21h and I would need to log at 6h-9h-10h-12h-14h-15h-18h-21h-22h to make my city running all the time?!  I am afraid my new logging schedule will be every 4 hours... this sucks[smilie--sprite4]Hopefully, we can start seeing some chapter changes/rebalancing shortly...[smilie--sprite1][BR][BR]Ange"}, {"152": "I wouldn't count on rebalancing, since players have 6 months to get through it.  It's supposed to be slow.[BR][BR]If it will take most players more than 6 months to get through it, then it's too slow.  Less slow than that, I wouldn't expect changes to speed it up.[BR][BR]On the other hand, I'm not fond of these short durations in chapters 17 and 18, and I hope this does not continue in 19."}, {"9": "@ekarat Don't forget that average time for chapters should be lesser than time between releasing new chapters, so newer players can catch up.[BR][BR]I wouldn't expect any changes anytime soon, for example first ch15 researches required 10k settlement goods and it has been lowered to 5k later for newer players. So if any changes are made, they would be probably made after we go through the chapter."}, {"59": "qaccy said:\t\t\tIt sucks when active discussions are seemingly ignored but relatively mundane questions get responded to immediately. Just an observation!\t\tClick to expand...[BR]They are focused on ruining more buildings to get rid of long-term players who play 3+ years like me."}, {"174": "Please remember to respect all posters, including team members who are only trying to help the best we can, also negativity helps no one so please try to be constructive in your posts. Thank you in advance"}, {"88": "I don't know if I am the only one confused when I need to launch production on my manufactories since we have now level 32+, the pop up windows for 3h and 9h production have changed.  Basic goods are now on the left column instead of the first row, sensitive goods in the middle column instead of the second row, and the new ascended goods are in the third column.  I have never done so many mistakes as I have manufactories at various level.  It would really help to get the 3h & 9h boosted production options highlighted the same way you have highlighted the boosts in the mainhall views.  Light green background for ascended boosts, light blue for sensitive boosts and yellow background for standard goods boost.   I think this would help to eliminate the confusion at production launch.[BR][BR][IMG]https://i.ibb.co/Bskr8hP/https-zupimages-net-up-21-16-v72x-jpg.jpg[/IMG][IMG]https://i.ibb.co/KFMBSdb/https-zupimages-net-up-21-16-qay0-jpg.jpg[/IMG][BR][IMG]https://i.ibb.co/VSDcppF/https-zupimages-net-up-21-16-42vt-jpg.jpg[/IMG][BR][BR]the boost production options (circled in yellow and green above)  would have the same background color as in the main hall:[BR][IMG]https://i.ibb.co/GT4k58q/https-zupimages-net-up-21-16-d0zm-jpg.jpg[/IMG][BR][BR]Making sense?"}, {"62": "Angeduciel said:\t\t\tI don't know if I am the only one confused when I need to launch production on my manufactories since we have now level 32+, the pop up windows for 3h and 9h production have changed.  Basic goods are now on the left column instead of the first row, sensitive goods in the middle column instead of the second row, and the new ascended goods are in the third column.  I have never done so many mistakes as I have manufactories at various level.  It would really help to get the 3h & 9h boosted production options highlighted the same way you have highlighted the boosts in the mainhall views.  Light green background for ascended boosts, light blue for sensitive boosts and yellow background for standard goods boost.   I think this would help to eliminate the confusion at production launch.[BR][BR][IMG]https://i.ibb.co/Bskr8hP/https-zupimages-net-up-21-16-v72x-jpg.jpg[/IMG][IMG]https://i.ibb.co/KFMBSdb/https-zupimages-net-up-21-16-qay0-jpg.jpg[/IMG][BR][IMG]https://i.ibb.co/VSDcppF/https-zupimages-net-up-21-16-42vt-jpg.jpg[/IMG][BR][BR]the boost production options (circled in yellow and green above)  would have the same background color as in the main hall:[BR][IMG]https://i.ibb.co/GT4k58q/https-zupimages-net-up-21-16-d0zm-jpg.jpg[/IMG][BR][BR]Making sense?\t\tClick to expand...it makes alot of sence since factory at lvl 32 now has 3 different tiers of good to make and u must put it somewhere , putting  3x2 size makes no sense because it will stretch out to much so now u have 2x3 ,   just need to get used to it [smilie--sprite2]"}, {"175": "CrazyWizard said:\t\t\tSo in the past 3 chapters (16-17-18) we gained 30% more unit production (22% barracks 22% mercenary camp 48% training grounds).[BR][BR]At the same time the losses have been raised by ~80%[BR]And I doubt negotiation cost will look much better\t\tClick to expand...Marindor, why this disbalance in the game?!"}, {"169": "Skillpowers said:\t\t\tit makes alot of sence since factory at lvl 32 now has 3 different tiers of good to make and u must put it somewhere , putting  3x2 size makes no sense because it will stretch out to much so now u have 2x3 ,   just need to get used to it [smilie--sprite2]Click to expand...sure it does, but it's not very ergonomic, when you have factories of size 31- and others 32+[BR]what @Angeduciel suggests is to have a different background color for boosted productions. Not great, but still better than the current situation IMHO[BR][BR]edit : I'm looking for an explantation on the hub/portal productions.[BR]Did anyone do something in this regard?"}, {"22": "Angeduciel said:\t\t\tIt would help to have visibility on our merchants availability (something like we have for the builders), showing us how many are available for trades.\t\tClick to expand...and also the possibility to delete offers in case of mistake"}, {"165": "Ainor said:\t\t\tand also the possibility to delete offers in case of mistake\t\tClick to expand...I do not think that will be possible. The merchant is an instant trader. Cancelling would mean you could get goods from the merchant, spend them and then cancell the trade. How would subtracting the goods work then?[BR][BR]The best you can do, is asking a friend to accept the offer and trade back. That should work, as long as it is perfectly timed.[BR]Otherwise the inability to fix missclicks is just another downside of the new merchant system."}, {"22": "ehm.. you're right, I haven't think about this case  ^^' [BR]maybe it is possible by checking if there are enough goods to reverse the trade"}, {"75": "My beta city is quite small and neglected, so I cannot actually playtest chapter 18. But based on the information given so far, I see a small but extremely long-lasting annoyance heading my way (and probably heading for other players too).[BR][BR]Problem:[BR][BR]I produce by clicking on a manufactory and pressing the shortcut key. 1 for standard and 3 for sentient by day; 2 for standard and 4 for sentient for the night.[BR][BR]With level 32, production options will change, and judging by the screenshots, T1 manus will change to: 1 for standard, 2 for sentient, 3 for ascended by day; 4 for standard, 5 for sentient and 6 for ascended for the night. Except for 3h standard, all keybinds will change and I will have to retrain my muscle memory for T1, and surely I will do some wrong productions on the way, mumbling a little curse each time.[BR][BR]In chapter 19, production options of T2 manus will change, and I will have to retrain again, involving more mumbling.[BR][BR]In chapter 20, production options of T3 manus will change, and I will have to retrain again, involving more cursing.[BR][BR]That is three chapters of annoying muscle memory retraining, even though it is really only one change.[BR][BR]Possible solutions:[BR][BR]A) Leave standard productions on top left and middle, sentient 3h in the top right, sentient 9h bottom left of the 6-production-layout. It would look less pretty than 3h=top and 9h=bottom, but keybinds stay the same, no need to retrain.[BR][BR]B) Rearrange the position of production options, but leave the keybinds as they are, so no need to retrain. This has the clear disadvantage that keybinds no longer correspond to the position on screen.[BR][BR]C) Do the rearranging of T2 and T3 with level 32 as well, and fill the ascended production options with a grey \"Unlock technology\" square. Will require a retraining, but retraining for all manufactories will be at the same time, it's over after chapter 18 and does not annoy for another year to come.[BR][BR]Please note that muscle memory retraining will be necessary for pure mouse users anyway due to the layout change to 6 options. While solutions A and B are great for keyboard users only, solution C would bring a relief for every player.[BR][BR]You may argue that we did have a transition of production options with the introduction of sentients and nobody complained about it being dragged out across three chapters. But - the layout did not change, and the keybinds did not change for any of those production options that survived through the change."}, {"152": "Turbina said:\t\t\tMy beta city is quite small and neglected, so I cannot actually playtest chapter 18. But based on the information given so far, I see a small but extremely long-lasting annoyance heading my way (and probably heading for other players too).[BR][BR]Problem:[BR][BR]I produce by clicking on a manufactory and pressing the shortcut key. 1 for standard and 3 for sentient by day; 2 for standard and 4 for sentient for the night.[BR][BR]With level 32, production options will change, and judging by the screenshots, T1 manus will change to: 1 for standard, 2 for sentient, 3 for ascended by day; 4 for standard, 5 for sentient and 6 for ascended for the night. Except for 3h standard, all keybinds will change and I will have to retrain my muscle memory for T1, and surely I will do some wrong productions on the way, mumbling a little curse each time.[BR][BR]In chapter 19, production options of T2 manus will change, and I will have to retrain again, involving more mumbling.[BR][BR]In chapter 20, production options of T3 manus will change, and I will have to retrain again, involving more cursing.[BR][BR]That is three chapters of annoying muscle memory retraining, even though it is really only one change.[BR][BR]Possible solutions:[BR][BR]A) Leave standard productions on top left and middle, sentient 3h in the top right, sentient 9h bottom left of the 6-production-layout. It would look less pretty than 3h=top and 9h=bottom, but keybinds stay the same, no need to retrain.[BR][BR]B) Rearrange the position of production options, but leave the keybinds as they are, so no need to retrain. This has the clear disadvantage that keybinds no longer correspond to the position on screen.[BR][BR]C) Do the rearranging of T2 and T3 with level 32 as well, and fill the ascended production options with a grey \"Unlock technology\" square. Will require a retraining, but retraining for all manufactories will be at the same time, it's over after chapter 18 and does not annoy for another year to come.[BR][BR]Please note that muscle memory retraining will be necessary for pure mouse users anyway due to the layout change to 6 options. While solutions A and B are great for keyboard users only, solution C would bring a relief for every player.[BR][BR]You may argue that we did have a transition of production options with the introduction of sentients and nobody complained about it being dragged out across three chapters. But - the layout did not change, and the keybinds did not change for any of those production options that survived through the change.\t\tClick to expand...[BR]That was my worry -- that I will end up having a mix of different keys on different manufactories.[BR]What I expected was 5 and 6 for 3 and 9 hour ascended, respectively, and that would have been consistent."}, {"59": "Was there any info about Chapter 18 possible start on live?[BR]This trading system looks really terrible, wonder if Ch18 will be delayed because of that to fix that, otherwise without good fellowship with all players in chapter 18,  you are almost not able to play this..."}, {"159": "Arthus said:\t\t\tWas there any info about Chapter 18 possible start on live?[BR]This trading system looks really terrible, wonder if Ch18 will be delayed because of that to fix that, otherwise without good fellowship with all players in chapter 18,  you are almost not able to play this...\t\tClick to expand...Actually, is quite playable, as soon as there are more people on the market it is quite nice, no unfair trades no clicking by mistake in an outrageous trade, once I got used to this system  it just goes smoothly [smilie--sprite1]"}, {"9": "@palmira Just the waiting for 6 hrs cooldown and no possibility to trade 50k or 100k at once, instead you need to stupidly trade 3x2k every 3/6hrs or stay online and constantly check if anyone has taken your offers, or have someone you can trade the large amount with and do the stupid click-fest to trade 50k/100k goods with the limitation of 2k(lv40MH) for one trade.[BR]So yeah, realy nice feature to trade 50k goods with 25 trades instead of one.[BR]Can't wait to trade milions by 10k trades...."}, {"59": "To decide how much and when you trade is another thing that makes it not \"strategy game\" as it was advertised.[BR]I'm very surprised that our team is clearly not reacting to that, instead it brings either lottery aspects or decides for us how we will play"}, {"9": "That might be because they probably think that the more obstackles they give us the more we enjoy the chapter. Or they just want to slow us down at all costs."}]