[{"1": "Dear Humans and Elves,[BR][BR]Please see the announcement for Mama Juul's Fusion Feast here and let us know what you think about it![BR][BR]Kind regards,[BR]Your Elvenar Team"}, {"45": "Thank you for the info!!"}, {"29": "I don't like merge event so, i don't do this event. And 1% for the petfood [smilie--sprite4][smilie--sprite4][smilie--sprite4][smilie--sprite4][smilie--sprite4]"}, {"22": "merde merge event...[BR][IMG]https://i.ibb.co/YXRV9kq/https-beta-forum-elvenar-com-index-php-attachments-1681747377997-png-11262.png[/IMG]"}, {"28": "in the gameboard screen, under the ”i” button there is a ”-” (minus) button. what does that do ? step back ?"}, {"16": "[IMG]https://i.ibb.co/4MTGKkw/https-beta-forum-elvenar-com-index-php-attachments-1681813591365-png-11266.png[/IMG]"}, {"28": "Karvest said:View attachment 11266Click to expand...ok, thx. using ipad so no hovering over an icon."}, {"64": "Icons of different typs are very  difficult to distinguish[BR][BR]so i.e. Chocholate on type 2 and 3 do only have spoon on opposite site."}, {"29": "Only 20 by day [smilie--sprite9][smilie--sprite9][smilie--sprite9][smilie--sprite9][smilie--sprite9][smilie--sprite9][BR][BR][IMG]https://i.ibb.co/Ydh5ynd/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-04-18-133504-png-11267.png[/IMG]"}, {"119": "yes, only 20 hats per day, I was also surprised not  in a good way...[BR]My dishes lvl 6 (had 2 of them) disappeared from the table once I reached next level of prizes. Anyone having similar experience?"}, {"11": "Is it me or is this one extremly expensive for what you get:[BR][BR][IMG]https://i.ibb.co/ftkRJWC/https-beta-forum-elvenar-com-index-php-attachments-elvenar-beta-mamajuul-lightbite-jpg-11268.jpg[/IMG][BR][BR]3x level 5 items needed"}, {"2": "Droopy said:\t\t\tIs it me or is this one extremly expensive for what you get:[BR][BR]View attachment 11268[BR][BR]3x level 5 items needed\t\tClick to expand...And that's the one that the game prompts us to take in the tutorial."}, {"30": "Click on the \"Trash bin\" -> problem solved [smilie--sprite1]"}, {"5": "I found that there is a way to win extra chef hats. It comes from the Flavor Loot that you can win. I got the Flavor Loot prize twice so far and out of the four total, two of them gave me 100 chef hats each."}, {"5": "Droopy said:\t\t\tIs it me or is this one extremly expensive for what you get:[BR][BR]View attachment 11268[BR][BR]3x level 5 items needed\t\tClick to expand...[BR]I trashed that one before I even started making the dishes."}, {"120": "As not all of us have young eyes, the Hot cocoa cups are too similar, to my point of view.[BR]Being 50+ I confuse these all the time, and that is on browser.[BR]In apps, with even smaller screens, it is nearly impossible to distinguise these cups on the board.[BR][BR]Please, make them more diverse. Maybe all with a different colour, like the first.[BR][BR][IMG]https://i.ibb.co/HNX27RM/https-beta-forum-elvenar-com-index-php-attachments-elvenar-hot-cocoa-2023-04-19-090818-png-11270.png[/IMG][BR][BR](Edit: some typo's)"}, {"59": "Biloutte91 said:\t\t\tOnly 20 by day [smilie--sprite9][smilie--sprite9][smilie--sprite9][smilie--sprite9][smilie--sprite9][smilie--sprite9][BR][BR]View attachment 11267Click to expand...To force people to pay, every next event is more and more lackluster[BR]I've played in times where people got multiple evolving buildings up to level 10,  per 1 event. Such players won't ever be catched in progress by new ones. Endless questline was not perfect but it gave content and challenge. Now events are for 5 seconds each day. Boring, no challenge and terrible rewards."}, {"101": "I may be just about done with this event.[BR]No interest in the evolving building. It just doesn't generate anything that I need at end of Chapter 20.[BR]Random rewards:[BR]troops, I produce more in 2 hours than I get from the building. Orcs? I have millions.1% chance for pet food. that means never. Coins - I collect far more than I can use on anything except KPs.Spell Fragments - I have so much that i can disenchant (boblin's upgrades?!)The game mechanic is a pain, hard to see on tablet. Just not fun for me personally.[BR][BR]Oh sure, there might be a daily prize somewhere in the list that would be nice but the odds of getting it, maybe 20%. Not sure it is worth the effort to do the quests to maybe find something that I would want if i got lucky enough to win it. If there is something I can go after it on live worlds.[BR][BR]But for Beta it will be nice to have no extra tasks to do for the next 20 days. Quite relaxing."}, {"9": "I've been done with the event since it's begining (at least on beta), so the only question is, how this will develope during the next weeks:[BR][IMG]https://i.ibb.co/rsWNDTV/https-beta-forum-elvenar-com-index-php-attachments-1681906458209-png-11272.png[/IMG]"}, {"3": "My least favourite format, this one. Far too time consuming and fiddly. [smilie--sprite3][BR]Not a particularly impressive main prize building either.[BR]Although I'm currently going through the initial quests on autopilot, may ignore it soon.[BR]Only thought would be whether there may be an option to use the Mama Juul's artifacts to craft a useful Tome or similar. Anyone seen anything about this?"}]