[{"118": "Earwen1 said:\t\t\tAs not all of us have young eyes, the Hot cocoa cups are too similar, to my point of view.[BR]Being 50+ I consude these all the time, and that is on browser.[BR]In apps, with even smaller screens, it is nearly impossible to distinguise these cups on the board.[BR][BR]Please, make them more divers. Maybe all with a different colour, like the first.[BR][BR]View attachment 11270Click to expand...You may want to edit your post, I think you meant to write diverse and not divers."}, {"121": "Has anyone tried using crystal caps yet?  Supposed to increase sentient good production but i placed one and it didnt do anything"}, {"122": "Same. I placed a couple of them and zip"}, {"54": "My least favorite event game... takes too much time and effort to merge all the pieces to get what you need.  And when you're locked out of event tasks, not much left to earn for daily play.  I've the same sentiments as an earlier post... not much this event building gives that I really need except pet food, but it's not worth it to get a random 1% chance to win pet food at level 10 only, sheesh. We need pet food, why not make it a straight up production choice rather than an almost zero chance of getting? Come on Inno, you can do better than this!"}, {"122": "So these crystal caps don't work. I checked production before using the caps.  I put two down and there is no change in production - production should have gone up..so why bother to put any of the others down or why bother giving them if they don't do anything.  Is there a trick to how they work? They expire in 30 days (well now 27) and since they don't work what's expiring?[BR][BR]I am also agreeing with the rest - pet food at 1% drop..really. We must have 20 things that we could feed with pet food but it's scarcer than hens teeth."}, {"119": "By far one of my least favorite event - actually I was wondering if digging into sand was worse than combining ingredients, still not decided but I tend to ''vote'' for current one. Reasons below:[BR][BR]The main prize itself: 1% pet food it's a bad joke. And seeing you can have the second base it's the next bad joke. At this % of pet food it does not worth even to evolve 1 to level 10. The pet food is the only important trigger to have it fully evolved and they decided to make it 1%. [BR]Make it 50% and then, INNO, you will have a successful event and yes, players will try to get 2 fully evolved buildings. The pet food is the only important trigger to have it. Everything else we can obtain or already have from AW, MA, etc.[BR]If nothing changes, on my live server will not attend this event. Does not worth.[BR]The event mechanics: awful. Confusing icons, ridiculous requests for 1 or 2 points, really awful.[BR]The daily hats: again, a bad joke given the prizes, chefs requests and the main building rewards."}, {"8": "Seems impossible to me to get all artifacts. 2 Cities actually with 195 and 198 points. [BR][BR]Any good strategies to do it better on live servers or is it just bad luck?"}, {"16": "Feed Phoenix, do all quests, collect ~80% of dropped hats, fulfill only cheapest 3* and 4* offers, those which costs 38 (lvl6+lvl3+lvl2) and 50 (lvl6+lvl5+lvl2) lvl1 dishes in worst case scenario.[BR]With that strategy and a bit of luck (got 7x2 Loots, ~ 10% chance, as advertised) I'm at 263 now. Hope to climb up to 280 for portrait."}, {"5": "Souliena said:\t\t\tSeems impossible to me to get all artifacts. 2 Cities actually with 195 and 198 points.[BR][BR]Any good strategies to do it better on live servers or is it just bad luck?\t\tClick to expand...[BR]I am at about 230 with 4 quests and dailies to go. Without more luck winning Flavor Loots, I will have to wait for the next FA to get the 9th artifact. Since this system of needing 260 points to have a complete set or evolving building was started, I have not gotten that 260 maybe 3 or 4 times here, and each time it have been one of the alternate event formats, either this merge stuff or the digging/fog stuff. The normal 3 chests and the 16 box formats are the easy ones."}, {"2": "Karvest said:\t\t\tFeed Phoenix, do all quests, collect ~80% of dropped hats, fulfill only cheapest 3* and 4* offers, those which costs 38 (lvl6+lvl3+lvl2) and 50 (lvl6+lvl5+lvl2) lvl1 dishes in worst case scenario.[BR]With that strategy and a bit of luck (got 7x2 Loots, ~ 10% chance, as advertised) I'm at 263 now. Hope to climb up to 280 for portrait.\t\tClick to expand...You remind me of a dear friend of mine, he rarely slept the whole night either.[BR][BR]I do not think that I will be able to spend what I have collected in the way of event currency and am dreading this for live."}, {"87": "only 185 , all quests done  , connected  2 or 3  times / day , not much luck with flavor loot ,[BR]first time so far from 260"}, {"123": "Same experience - too far from 260 to even bother trying. Event building is uninteresting and haven't come across any daily rewards making it worthwhile to spend time on."}, {"54": "charlemagne3 said:\t\t\tSo these crystal caps don't work. I checked production before using the caps.  I put two down and there is no change in production - production should have gone up..so why bother to put any of the others down or why bother giving them if they don't do anything.  Is there a trick to how they work? They expire in 30 days (well now 27) and since they don't work what's expiring?[BR][BR]I am also agreeing with the rest - pet food at 1% drop..really. We must have 20 things that we could feed with pet food but it's scarcer than hens teeth.\t\tClick to expand...Did you report the bugged caps?  I've some I want to use, but now won't put them in my city until I know they're working!"}, {"122": "ZodiBeta said:\t\t\tDid you report the bugged caps?  I've some I want to use, but now won't put them in my city until I know they're working!\t\tClick to expand...ZodiBeta said:\t\t\tDid you report the bugged caps?  I've some I want to use, but now won't put them in my city until I know they're working!\t\tClick to expand...No - I had hoped that they (INNO) would fix the problem as I anticipated that I was not the only with the problem"}, {"57": "ZodiBeta said:\t\t\tDid you report the bugged caps? I've some I want to use, but now won't put them in my city until I know they're working!\t\tClick to expand...[BR]charlemagne3 said:\t\t\tNo - I had hoped that they (INNO) would fix the problem as I anticipated that I was not the only with the problem\t\tClick to expand...[BR]Although this was not reported in our bug report section, we have indeed forwarded the issue to our development team for fixing"}, {"17": "Personal, I have reached 260(RNG gods been good to me today).  But just noticed that in league prizes, silver contains an artifact.  So basically the top 5% will be guaranteed full upgrade.  That is at 231 as of 6am EDT."}, {"2": "Hey I have an issue that slipped through Beta test.  On browser there is no information on the Flavor Loot - hover gives nothing.   There are no odds, no idea what is contained there, and nothing is explained under the ? pages, either."}, {"45": "Lelanya said:\t\t\tHey I have an issue that slipped through Beta test.\t\tClick to expand...Maybe make a bugreport?"}, {"57": "Lelanya said:\t\t\tHey I have an issue that slipped through Beta test. On browser there is no information on the Flavor Loot - hover gives nothing. There are no odds, no idea what is contained there, and nothing is explained under the ? pages, either.\t\tClick to expand...[BR]Dorfl the Clay said:\t\t\tMaybe make a bugreport?\t\tClick to expand...Hi @Lelanya please report that on your live server where you experienced the issue. Since the Mama Juul's event is over here, we are unable to investigate such issues"}, {"30": "I can confirm, that there was NO information about the Flavor Loot on Beta.[BR]I was searching by myself and found nothing."}]