[{"1": "Liebe Menschen und Elfen,[BR][BR]wir freuen uns sehr über euer Feedback zum Event Mama Juuls Reiseküche, welches am 09. Mai starten wird. Wenn ihr Fragen zum Event habt, hilft euch sicher der entsprechende Fragethread zu diesem Event.[BR][BR]Viele Grüße[BR]Euer Elvenar Team"}, {"100": "In der Beta hab ich 80- 90 Schritte / sterne weniger als in vorigen Events  . [BR]Ich hoffe das zu den Livewelten noch nachgebessert wird  . [BR]So wird das  ein ziemlich frustrierendes event für mich"}, {"11": "Events finde Ich gut, [BR][BR]Aber bei Dauerevents fehlt mir die Vorfreude . [BR]So läuft das nur noch, was kommt das kommt"}, {"216": "Guten Tag,[BR][BR]das letzte Mal war Ich vor über 1 Jahr im Forum - nicht nur aus zeitlichen Gründen -, da Ich aber nach der Questliste für Kap 14 geschaut habe und neugierig war[BR][BR]Beim Set Ein Tor in die Vergangenheit vom Aug 22 konnte Ich auf Beta und 4 Welten alle Teile erspielen tlw ohne Aschephönix immer ohne Dias. Diesmal sieht es nicht so gut aus. Bisher  217 Sterne, da Ich noch mindestens 200 EW erhalte ist evtl der Silberrang sogar möglich, ansonsten müsste ja ein GM kommen (das Ich nicht spiele).[BR][BR]Heute Morgen habe Ich insgesamt 2500 EW ( auf Beta habe Ich keinen Aschephönix) eingelöst, dafür eine gute Stunde gebraucht - also Zeit einplanen, 10 Tagespreise (20 AW WP dabei kein reroll) erhalten, 7 mal den Flavor Loot ( dabei 1 mal 100 EW ), 3 ablaufende Extragebäude und viele sonstige AWWP. Also ganz gute Ausbeute.[BR][BR]Quests sind alle ohne Probleme machbar, auf Elvenarfan.de müsste ja noch die Liste kommen, für Anfänger durchaus hilfreich. Täglich eingeloggt und alle ca 3 Stunden EW eingesammelt. Verwendet habe Ich immer die 3 u 4 Schritte, nimmt man nur die 4 Schritte spart man EW braucht aber erheblich mehr Zeit oder eben Dias.[BR][BR]Bisher gab es für 500 Dias 100 EW jetzt nur noch 60, das ist nicht in Ordnung.[BR][BR]Etwas OffTopic[BR][BR]- Der Spielerguide von Zensiert bietet jede Menge hilfreiche Informationen, man muß ja nicht alles 1 zu 1 übernehmen.[BR][BR]- Den Hexenkessel braue Ich mit 1 Zutat, wenn was kommt ist gut wenn nicht auch. Ist Mir mit Forschungsbaum Turm Turnier Events und Die Saisons einfach zu viel.[BR][BR]- Die massive Verringerung der Tagespreise bei Die Saisons hat auch Mich schwer verärgert, trotzdem ein sehr gutes neues Spielelement mit vielen nützlichen Preisen.. Täglich morgens und abends einloggen und alle Quests sind ohne Probleme machbar. Bei der Einlösung des Tagespreise darauf achten dass Münz u Werkzeuglager ausreichend freie Lagerkapazität haben. Wenn einem die Extragebäude gut gefallen investiert man am besten die 20 Euro da die zusätzlichen Blütenblätter weitere zufällige Extragebäude ermöglichen.[BR][BR]- Auch wenn Ich nach wie vor der Meinung bin dass bei Beendigung aller Quests auch das 9. Artefakt erhältlich sein sollte, Innogames ist ein Wirtschaftsunternehmen das Geld verdienen muß, sonst gibt es kein Elvenar.[BR][BR]MfG"}, {"24": "Neee, echt jetzt ? Die DIa zu EW-Quote war eh nie sonderlich gut, aber halbwegs aktzeptabel... Und die wird jetzt fast halbiert ? Mh... Ich warte mal was da kommen mag..."}, {"126": "Ich empfinde das Event als ziemlich enttäuschend, wenn sich auf den Live-Servern nicht noch etwas verändert. [BR]Die Chance auf Flavor Loot ist viel zu gering und wenn die Season dann auch noch verlangt, davon welche zu nutzen, kommt man sich (sorry, wenn ich das so offen sage) schon ziemlich verarscht vor. [BR][BR]Insgesamt scheint es sehr schwer, alle Artefakte zu bekommen. Ich kämpfe in meiner zweiten Beta Stadt extrem um wenigstens die 220 Punkte für 8 Artefakte zu bekommen und dann aus einem hoffentlich folgenden GA das aktuelle und das letzte Evo zu vervollständigen. [BR][BR]Der Zeitaufwand zum Einlösen der Event Währung ist auch enorm. Mal davon abgesehen mag ich diese Art von Event noch weniger als das gestochere im Nebel."}, {"112": "das angebot gilt ja 10 tage. ich kann mich da etwas gedulden..."}, {"68": "Wird mal wieder ein ganz entspanntes Event für mich.[BR][BR]Kein einsammeln der Eventwährung[BR]Lediglich abholen der Tagesbelohnung vom Questgeber, da ich keine Lust auf 20+ von der Sorte habe[BR]Kein einlösen der Eventwährung da ich keine Lust auf ein \"Merge-Event\" in Elvenar habe (Merge Spiele gibt es genug kostenfreie)[BR][BR]Nervig wird das ständige erinnern an die heruntergefallenen Kochmützen, aber 1 mal am Tag ist das auszuhalten.[BR][BR]Aber der Beginn ist ja schon mal wieder typisch Inno, Event-Start im Pop-Up ankündigen, Angebot ist auch da, und das bevor das Event gestartet wurde.[BR][BR]Allen die am Event teilnehmen wünsche ich viel Glück und Geduld."}, {"4": "Ausbeute auf Beta: einmal 206 Schritte und einmal 205 Schritte. [BR][BR]Und viel Arbeit dafür.[BR][BR]Das Angebot für Eventwährung ist schon da. Das war IMMER 900 Währung für 19,99, jetzt hat Inno es auf 600 Kochmützen reduziert.[BR][BR]Ich komm mir hier vor, wie ne Melkkuh. Allerdings sollte man nicht vergessen: Schlachte ich die Kuh, gibt sie keine Milch mehr."}, {"32": "Pro:[BR]- das Konzept mit den Rezepten gefällt mir[BR][BR]- ich fand die Aufgabenliste diesmal schwer(er als üblich)[BR][BR][BR]Kontra:[BR]- die Anfangsaufgaben finde ich ja mal ganz fies (schliesse eine Provinz > handle/kämpfe in einer Provinz)[BR]> wo soll man denn 2 freie Provinzen herbekommen?! nicht nett.[BR]...na wenigstens am Anfang sodass man ne Woche Zeit hat zu erkunden[BR][BR]- die 30 minuten wartezeit für neue rezepte .. eh. nicht jeder hat diese zeit.[BR][BR]- das evo gibt erst ab stufe 10 die chance auf tierfutter (das hauptziel); für jene welche pech hatten und trotz artefakt im GA nicht hinkommen ist das event schonmal für'n hintern[BR]> wie bei früheren evos, eine kleine chance ab stufe 7"}, {"171": "TischFlasche schrieb:\t\t\tKontra:[BR]die Anfangsaufgaben finde ich ja mal ganz fies (schliesse eine Provinz > handle/kämpfe in einer Provinz)[BR]> wo soll man denn 2 freie Provinzen herbekommen?! nicht nett.[BR]...na wenigstens am Anfang sodass man ne Woche Zeit hat zu erkunden\t\tZum Vergrößern anklicken....[BR]Auf der Weltkarte? Erkunden kann man ja immer, auch wenn schon alle Erweiterungsprovinzen verarbeitet sind. Und Geld für den Scout dürfte ab höheren Kapiteln auch kein Mangel mehr sein, dauert halt nur ziemlich lang, bis er zurück kommt. Aber ich schicke ihn immer gleich wieder los, sobald er da ist und lasse die erkundeten Provinzen in Ruhe, bis ich sie brauche."}, {"55": "ich finde das Event ganz witzig"}, {"161": "Mir ist das zu kompliziert! (Die Grafiken gefallen mir aber sehr gut...)"}, {"125": "Mir gefällt das Event und die Grafik sowie die Gebäude sehr gut. Macht sehr viel Spaß"}, {"171": "hannessabine schrieb:\t\t\tMir ist das zu kompliziert! (Die Grafiken gefallen mir aber sehr gut...)\t\tZum Vergrößern anklicken....[BR]Nachdem ich herausgefunden habe, wie es geht, machts sogar Spaß. Ist eigentlich wie Memory. [smilie--sprite1]"}, {"161": "OT: Schickes Profilbild...(-;"}, {"56": "Ich weiß, dass es Ork-Liebhaber  [smilie--sprite1] unter den Spielern gibt und für die Spieler freut mich dieses orkische Event [smilie--sprite1], denn bisher gabs immer viel Feen, Zauberer und Amuni.[BR]Ich selbst habe zwar nun in meinen 3 Städten Freizeit, aber damit kann ich leben, denn es gibt immer was zu tun![smilie--sprite8][BR]Aber einen Wunsch hätte ich an INNO: Bitte auch mal ein Event bezogen auf den Gebäudetyp \"Die Elvenar\"!"}, {"157": "Zuerst habe ich mir tierisch gefreut, dass Inno auf den Tierfuttermangel reagiert hat und es in den Imbiss integriert hat. Dann habe ich die 1%-Wahrscheinlichkeit und die anderen Preise gesehen und das Event für mich beendet. Kucke mal, was an Beifang anfällt, aber das Gebäude an sich reizt mich gar nicht.[BR]Auch gut, hab ich zumindest nicht weniger Platz nach dem Event [smilie--sprite8]"}, {"50": "Was soll man zu diesem Event gross sagen?[BR][BR]Die Aufgaben sind wieder, wie gewohnt, nach altbekanntem Strickmuster! [BR]Es wird Spieler geben, die alle Aufgaben bereits am ersten Tag erledigen werden und es wird ebenso Spieler geben, die sich mit der ein oder anderen Aufgabe abmühen werden.[BR][BR]Ähnlich wie bereits beim letzten Event werden auch dieses Mal wieder sehr viele Spieler kaum eine Chance auf die 9 Artefakte reinweg durch aktives Spielen, erledigen aller Aufgaben und häufiges Einsammeln der runtergefallen EW haben.[BR][BR]Hier gilt dann eher der Fokus ggf. irgendwie in die Silber-Liga zu kommen (wer sich das Evo überhaupt aufstellen möchte), da es dafür auch 1 Artefakt gibt.[BR][BR]Als Quervergleich hier mein Resultat vom Beta-Server -> [BR][BR]Nur durch das Erledigen der Aufgaben, viele EWs einsammeln und etwas mehr Glück beim Looten habe ich die Silber-Liga regulär erreicht, aber nicht ganz die 260 Meilensteine -> [IMG]https://i.ibb.co/NWvBt73/https-de-forum-elvenar-com-index-php-attachments-1683638276799-png-36126.png[/IMG][BR][BR]Da ich Avatar-Sammler auf Beta bin -> [IMG]https://i.ibb.co/z23W0K4/https-de-forum-elvenar-com-index-php-attachments-1683638507815-png-36129.png[/IMG] und nicht weiss wohin mit den vielen Turm-Dias, habe ich 2.250 Dias für zusätzliche EWs ausgegeben und bin dadurch passgerecht auf den 280. Meilenstein gekommen -> [IMG]https://i.ibb.co/vDN4HFH/https-de-forum-elvenar-com-index-php-attachments-1683638462719-png-36128.png[/IMG][BR][BR]Ich lasse mich gern überraschen, wie sich die Erfolge auf meine 9 Live-Städte übertragen lassen werden, aber mit einer grossen Erwartung gehe ich nicht an dieses Event.[BR][BR]Unterm Strich hat sich INNO von ihrer selbst vor etlichen Monaten/Jahren postulierten Aussage durch Tacheless abgewendet, dass Spieler, die aktiv und mehrmals täglich online sind, viele runtergefallene EWs einsammeln und alle Aufgaben lösen es schaffen sollten alle benötigten 9 Artefakte zu erspielen. Es gilt leider nur noch, wer bereit ist Dias zu investieren hat eine erhöhte Chance darauf die 260 Meilensteine zu erreichen und somit die 9 Artefakte direkt während des Events zu erhalten."}, {"110": "Also ich häng hier immer noch an der allerersten Münzsammelquest (und: nein, ich werde keinen Münzsegen verwenden)."}]