[{"103": "blaue Farbe als Spielermeinung wurde von der Community abgelehnt und nicht als Spielermeinung ausserhalb des Mod-Lebens anerkannt, also kann ich auch gleich schwarz schreiben. Macht keinen Unterschied."}, {"167": "littleFlex schrieb:\t\t\toder dass das Event spielbar ist mit vollem Evo, je nach Sicht des Betrachters...\t\tZum Vergrößern anklicken....[BR]So langsam finde ich aber, das es mal reicht. Auch du kannst doch einfach mal einsehen, das es ein sehr glückslastiges Event ist. Niemand hat gesagt, dass es nicht für x-% der Spieler ein schaffbares Event ist --> nur dieser x% Satz ist eben im Vergleich zu anderen Events sehr klein.[BR]Und nur weil du zu den Glücklichen gehörst, die es schaffen, das 9te Artefakt zu erspielen, musst du es hier nicht so raushängen lassen, als wäre alle anderen einfach nur zu blöd dazu - sorry, aber genau so kommt es bei mir an.[BR][BR]Und mal zu Vergleich: meine eigenen Welten[BR]Cervayn - vielleicht schaffe ich da 260 - wenn der RNG mit holt ist[BR]Sinyia - bei gleicher Spielweise - dort schaffe ich gerade 7 Artefakte"}, {"213": "2 Stunden Rezepte zusammenschustern, Dauerpreis 1 Feld Niete, ja da kommt Freude auf.[BR]Das war das letzte Event in dieser Art für mich [smilie--sprite4][smilie--sprite4][smilie--sprite4]"}, {"103": "jeder Spieler hat die Möglichkeit, sein eigenes Ergebnis hier zu posten, ohne Diskussion des Inhaltes[BR][BR]Inno kann sich dann schon selbst ausrechnen, wie die Erfolgsrate war.[BR][BR]-> soll ich Deiner Meinungnach auf mein Feedback verzichten, weil ich ein Glücklicher war nach Deiner Ansicht?[BR]-> sollten besser alle auf ihr Feedback verzichten, die Glückliche waren ?[BR][BR]klingt ein wenig nach Wahlfälschung, sorry"}, {"112": "nunja - ich hab 208 sternchen gesammelt, sind aktuell 7 artefakte und ob ich noch auf 220 komme ist fraglich. der glücksfaktor ist mir in diesem event echt zu hoch und es macht keinen spass, obwohl ich die idee mit dem \"merge\" ganz witzig finde.[BR][BR]Update 24h vor dem Ende: Mützen sind nur noch die zu erwarten, die vom Himmel fallen weil alle Quests fertig sind, Liga Silber (229/225) also sehr knapp, vermutlich nicht zu erhalten, und der Tresen fast leer. [smilie--sprite5]"}, {"3": "Für mich lief es ganz gut. Ich habe wohl eher Glück gehabt.[BR]Das Merge-Spiel macht mir Spaß. Die Story und Madame Juule sind auch ganz lustig und nett gemacht.[BR]Die Preise sind jetzt in der Tat nicht so berauschend, aber trotzdem habe ich die Tagespreise, die ich wollte, meist auf Anhieb oder zumindest nach wenigen Versuchen bekommen.[BR]Auch Aromabeute war ab und an dabei. Nicht zu häufig, aber 10 habe ich bestimmt bekommen, manche sogar mit 100 oder 50 Kochmützen.[BR]Die Küche habe ich auf Stufe 8. Stufe 10 werde ich nicht schaffen, wäre mir jetzt aber auch egal. Wegen dem 1%Tierfutter lohnt es sich nicht, sich aufzuregen. 9 und Silber-Liga könnte noch klappen, habe noch 1000 Kochmützen und ein volles Brett für morgen aufgespart.[BR]Der Glücksfaktor ist extrem hoch bei diesem Event, aber da ich das ja vorher wusste, habe ich mich gar nicht groß angestrengt und bin vom Ergebnis eher überrascht."}, {"14": "ich spiele 3 Städte, in 2 nutze ich für Events keine Dias und für die Stadt nur äußerst selten: schon länger schließe ich alle möglichen Events mit Evos auf Stufe 9 ab und so ist es auch diesmal: die 220 Schritte habe ich fertig, aber es wird nicht für Silber reichen, also muss das letzte aus dem GA kommen[BR]in meiner Hauptstadt nutze ich die 100 Währung aus der Mail, manchmal klappt es dort recht leicht, vermutlich weil ich noch dazu viel mehr Randwährung absammel[BR][BR]ich finde dies Event weder schlechter, noch besser als die anderen, weder schwerer, noch leichter, weder zufallsabhängiger als andere für den Hauptpreis[BR]ich mache die Merge-Sachen ganz gerne, aber Tagespreise zu bekommen ist echt schwerer, genauso wie bei den Nebelevents, die ich übrigens auch gerne spiele[BR]das öde Kistendrehen ist für mich langweilig[BR]und ja die Shuffle-Boards garantieren zumindest den Tagespreis, wenn man dafür Währung anspart[BR][BR]also für mich sind jetzt 8 Artefakte \"normal\" (9 Stufen) und in meiner Hauptstadt  ein volles Evo, da würde ich aber auch nachhelfen, wenn mir der Preis absolut wichtig ist"}, {"8": "Event Kuchen, Espresso und Braten zusammen matschen ist niedlich.[BR]Sowas versuch ich auch immer auf Parties. Dort sind die Leute aber nicht so cool.[BR]Da hab ich noch keine Belohnung für gekriegt? [smilie--sprite1][BR][BR]Der Hauptpreis scheint wirklich nur für Nachzügler gedacht zu sein, die keine Mondbibowälder mehr gewinnen können?[BR]Für Diejenigen ist er auch ganz gut.[BR]Sie zahlen allerdings hohe Opportunitätskosten![BR][BR]Bisher scheint es so, dass im Falle des Münzgewinns der Kulturbonus gar nicht wirkt und im Falle des Orkgewinns gar keine EGüter von der Pyramide reinkommen.[BR]===> Das ist besonders unglücklich, da unter dieser Vorraussetzung die erhaltenen Mengen einfach viel zu gering sind![BR][BR]Mit herkömmlichen Mitteln: [BR]Plätze für Orkstrategen, Orknester, Handelsstationen käme man viel weiter... Mehr Kulturbonus bekäme man auch. [BR]Man hätte allerdings keine Chance auf zusätzliches Tierfutter.[BR][BR]Ist Wahnsinn, wie hoch die Kosten für 1 zusätzliches Futter pro Monat angesetzt sind![BR][BR]Für alle Fälle behalte ich natürlich Juules Küche. [BR]Man weiß ja nie, wann wieder eine Tierfutterkrise ausbricht..."}, {"35": "littleFlex schrieb:\t\t\tIch finde die Beschreibung aus dem Wiki durchaus ausreichend und nicht vage. Es wird genau ausgesagt,[BR]wie man die Beute bekommt und was sie geben kann.\t\tZum Vergrößern anklicken....Nun, als Deine private Meinung ist die Aussage für mich natürlich ok.[BR][BR]Allerdings sind meine Ansprüche an \"genau\" doch etwas höher. Was im Wiki steht, finde ich vage.[BR]Was bei idavis steht, ist für mich genau. Das hätte ich in einem Mouseover so erwartet. Und nicht \"nichts\"."}, {"98": "littleFlex schrieb:\t\t\tGenau, denn ich zähle das GA-Artefakt zum Event dazu.[BR]Damit wären wir nur noch bei einem \"Must have\" von 220 Punkten.[BR]Die anderen Sachen Deiner Aufzählung sind für mich nicht von Gewicht, das Portrait für Liebhaber verstehe ich noch aber die zweite Grundplatte sollte keiner problemlos ohne Dia-Kauf schaffen können.[BR][BR]Ich hoffe, Du kannst meine Meinung und mein Feedback zum Event einfach akzeptieren...\t\tZum Vergrößern anklicken....[BR]Dann hast du offensichtlich das, was ich erklärt habe, nicht verstanden.[BR]Ich sagte: \"Rechnet man alle Artefakte, die man als Ligenbelohnung und per GA noch bekommen kann, dazu, dann haben 95% aller Spieler keine Chance auf das fertige Evo.\"[BR][BR]Mit anderen Worten: auch bei mir ist das GA eingepreist.[BR][BR]Das hilft aber ca. 95% der Spieler nicht. Denn ihnen fehlen vor dem GA ZWEI Artefakte. Im GA ist nur eins erhältlich.[BR][BR]Nochmal: Die Bronzeliga auf Khelonaar steht aktuell, 35 Stunden vor Schluss, bei 181 Punkten. Bei 180 gab es das siebte Artefakt. Es fehlen also zwei. In den letzten Stunden werden es noch ein paar schaffen, die 39 Schritte bis 220, also dem achten Artefakt, zu gehen. Aber die meisten eben nicht. Wir können dafür einfach \"über 90%\" annehmen. Das GA liefert diesmal aber nur EIN Artefakt für das Evo, ich habe es auf beta gespielt, es ist wirklich so.[BR][BR]Und um eins nochmal ganz klar zu stellen: Das ist KEINE MEINUNG. Das sind Berechnungen. Fakten.[BR][BR]Meinung wäre: \"Ich finde das Event trotzdem toll\". Kannst du meinen, wie du willst.[BR]Zu sagen: \"Durch das GA bräuchte man das letzte Artefakt gar nicht unbedingt\" ist halt einfach eine unzutreffende Behauptung, weil sie für den größten Teil der Spieler nicht zutrifft. Zumal den ALLERMEISTEN Spielern (deutlich über 90%) nicht nur das GA-Artefakt, sondern noch ein weiteres fehlt.[BR][BR]Verstehst ich die Verstimmung immer noch nicht?"}, {"28": "Cailin schrieb:\t\t\tVerstehst ich die Verstimmung immer noch nicht?\t\tZum Vergrößern anklicken....Ich kann sie verstehen diese Verstimmung, wenn man es mal nicht soweit schafft, wie man gern gewollt hätte! [smilie--sprite2][BR][BR]Cailin schrieb:\t\t\tZu sagen: \"Durch das GA bräuchte man das letzte Artefakt gar nicht unbedingt\" ist halt einfach eine unzutreffende Behauptung, weil sie für den größten Teil der Spieler nicht zutrifft. Zumal den ALLERMEISTEN Spielern (deutlich über 90%) nicht nur das GA-Artefakt, sondern noch ein weiteres fehlt.\t\tZum Vergrößern anklicken....Hierzu möchte ich zu bedenken geben, dass bestimmt nicht alle Spieler einer Welt (mit Hochdruck) an den Events teilnehmen.[BR][BR]Wir wissen ja nicht ob diese über 90% von denen Du sprichst auch alle das vorletzte Artefakt nicht schaffen konnten, weil das Event eventuell schwerer geworden ist, (Was meiner subjektiven Wahrnehmung nach seit dem Event \"Die Große Grabung\" allgemein so zu sein scheint)[BR]oder weil sie es vielleicht auch gar nicht darauf angelegt haben es zu schaffen.[BR][BR]Thema Eventmüdigkeit, Zeitaufwand, Frühjahr/Sommer und vielleicht noch diese 1prozentige Chance haben eventuell den Effekt das Spielerinnen und Spieler zumindest nichts \"zusätzlich\" bzw. extra nur für das Event machen und dann eben bereitwillig mit 1 - 3 Artefakten weniger abschließen oder sogar gar keine Eventwährung einlösen.[BR]Allgemein konnte ich sehr häufig aufschnappen dass Spielerinnen und Spieler, im Gegensatz zu mir, an einer zufälligen Produktion eher wenig bis gar nicht interessiert sind. Auch das könnte zu einer eher niedrigen Eventbeteiligung geführt haben."}, {"35": "Mit Ach und Krach den Spektralstein (200 Punkte) erreicht. 7 Artefakte - eine so schlechte Ausbeute hatte ich lange nicht mehr.[BR][BR]Dabei liegt mir diese Art Event. Aber die Rezepte waren meiner Ansicht nach einfach zu teuer. Gefühlt doppelt so teuer wie beim letzten \"Zusammenschiebe\"-Event. Damals hatte ich als Richtwert 25 pro Stern für ein einlösbares Rezept. Damit brauchte ich dieses Jahr gar nicht anfangen.[BR][BR]Die Küche werde ich trotzdem wenigstens temporär aufstellen. Alles was gegen meinen aktuellen, krassen Orkmangel hilft, ist willkommen."}, {"126": "Thebigunknown schrieb:\t\t\tThema Eventmüdigkeit, Zeitaufwand, Frühjahr/Sommer und vielleicht noch diese 1prozentige Chance haben eventuell den Effekt das Spielerinnen und Spieler zumindest nichts \"zusätzlich\" bzw. extra nur für das Event machen und dann eben bereitwillig mit 1 - 3 Artefakten weniger abschließen oder sogar gar keine Eventwährung einlösen.[BR]Allgemein konnte ich sehr häufig aufschnappen dass Spielerinnen und Spieler, im Gegensatz zu mir, an einer zufälligen Produktion eher wenig bis gar nicht interessiert sind. Auch das könnte zu einer eher niedrigen Eventbeteiligung geführt haben.\t\tZum Vergrößern anklicken....Aber auch das ist ja indirekt ein Feedback, was Inno Games auswerten sollte. Entweder halt schlechte Kalkulation der Eventwährung oder geringes Interesse. Oder vielleicht auch beides. [BR]So wie im Moment aber Event auf Event folgt und auf Feedback auf dem Beta-Server und auch hier wenig eingegangen wird, hat man schon ein wenig das Gefühl, dass Feedback gar nicht so sehr von Interesse ist."}, {"40": "Ich pflege Events am Ende zu bewerten: Zwar ist noch nicht ganz Schluss, aber einen halben Tag - [ich gehe noch arbeiten und schaue erst wieder heute Abend rein, für den Moment bin ich durch] - vor Ende wage ich dann mal ein Feedback:[BR][BR]Das Event ist gruselig. Punkt.[BR]Viel-Klickerei bei wenig bis gar keinem Eventfortschritt. Die individuelle Steuerung des Events ist kurzum nicht vorhanden.[BR]Die Event-Preise sind bestenfalls okay, das ging alles schon einmal besser.[BR][BR]Aber das allerschlimmste ist der Glücksfaktor. [BR]Bei meiner kleinsten Stadt, wo ich das Hauptgebäude des Events dringend brauche, und demnach Zeit investiert habe, werde ich es krachend verfehlen, bange derzeit noch um den Bronze-Rang. (Ja, nur wenige Pünktchen trennen mich noch von Eisen.)[BR]In meiner größten Stadt, wo ich alles nur nebenbei gespielt habe, komplett ohne Belang, nur einfach Wegklicken, wenn etwas aufgeploppt ist, hier und da mal ein bisschen Eventwährung in Speisen umsetzen, mal schauen, was an Preisen geht, da stehe ich derzeit auf Silber...[BR][BR]Frage: Wie geht das?[BR][BR]Unmittelbar im Vergleich zum letzten Event ist dieses hier um Längen schlechter. [BR]Schade, InnoGames. Ziel verfehlt!"}, {"144": "Xxx"}, {"171": "Abschließendes Fazit:[BR][BR]Kochspiele machen unter Umständen Spaß. Für ein Event, das über einen längeren Zeitraum hinweg bespielt werden muss, ist der zu betreibende Aufwand zu hoch. Als Minispiel mag so was angehen.[BR]Meine übliche Taktik, auf ansprechende Tagespreise zu warten und erst dann Eventwährung einzulösen, war nur mit dem Gefühl von Langeweile bis hin zu Genervtsein über die Zusammenschieberei durchzuführen. Ich mag die Nebelevents, ich mag die Sandbuddelei, aber das hier: Nö, das mochte ich nicht. Für die mickrigen Preise musste ich beim Einlösen der Eventwährung viel zu lang ackern, um sie wegzukriegen.[BR][BR]Bitte nicht nochmal! [smilie--sprite3]"}, {"55": "danke für dieses witzige Event[BR]wahr eine schöne abwechslung im Eventalltag.[BR]habe gerade die göttin abgehohlt und aufgestellt[BR]konnte 8 Artefakte erspielen[BR]und habe jeden Tagespreis auf DE4 erhalten den ich gewollt hatte"}, {"34": "Positiv[BR]1) Graphik von Juuls Reiseküche sieht toll aus[BR]2) Ein Event ist immer besser als kein Event, da dabei zuviele Grundboni (Mehr Unurium usw) erspielbar sind[BR][BR]Negativ[BR]1) Das Spielsystem ist zu aufwendig[BR]2) Tagespreise sind schwerer sammelbar durch geringere Quote[BR]3) EVO-Gebäude ist für mich uninteressant[BR]4) 1er-Felder ebenfalls für mich nicht relevant[BR]5) Avatare waren nicht so mein Geschmack[BR]6) Kinetik-Kugeln im königlichen Preis sind ein absoluter Zonk, da diese Belohnung verfällt"}, {"11": "Ich komme leider nur bis stufe 9, aber vielleicht kommt ja ein GA und die letzte stufe wird erreicht.[BR][BR]Und dann könnte ich mal sehen ob ich platz finde."}, {"28": "Alle Quests erledigt, Göttin der Wünsche eingesammelt und keine Eventwährung mehr:[BR][BR][IMG]https://i.ibb.co/k0pCNx0/https-de-forum-elvenar-com-index-php-attachments-1685470867624-png-36635.png[/IMG][BR][BR]Sprich ich konnte es nur bis Stadium 8 schaffen. Nicht weiter schlimm für mich aber doch eher ungewohnt! In meinem Fall schiebe ich es auf meine 10tägige Eventabwesenheit (Laptop war kaputt) und die dadurch verpasste Eventwährung am Stadtrand.[BR][BR]Dominus00 schrieb:\t\t\tBei meiner kleinsten Stadt, wo ich das Hauptgebäude des Events dringend brauche, und demnach Zeit investiert habe, werde ich es krachend verfehlen, bange derzeit noch um den Bronze-Rang. (Ja, nur wenige Pünktchen trennen mich noch von Eisen.)[BR]In meiner größten Stadt, wo ich alles nur nebenbei gespielt habe, komplett ohne Belang, nur einfach Wegklicken, wenn etwas aufgeploppt ist, hier und da mal ein bisschen Eventwährung in Speisen umsetzen, mal schauen, was an Preisen geht, da stehe ich derzeit auf Silber...[BR][BR]Frage: Wie geht das?\t\tZum Vergrößern anklicken....Das werden wir alle zum Glück niemals erfahren! [smilie--sprite2][BR][BR]In meiner Zweitstadt mit gleichem Aktivitätsmuster und ebenfalls nach Erledigung aller Quests und Aufbrauchen aller Eventwährung sieht es dann aktuell so aus:[BR][BR][IMG]https://i.ibb.co/FKbZB4z/https-de-forum-elvenar-com-index-php-attachments-1685472782939-png-36639.png[/IMG][BR][BR]Ob ein Spieler oder Spielerin an dieser, ich nenne es mal \"kritischen\" Stelle im Event mit 7 oder 8 Artefakten nach Hause geht, war meiner Meinung nach ganz stark \"Armoma-Beute-abhängig\", also wie so oft in den Events Elvenars: \"Alles eine Frage des Glücks!\"[BR][BR]Beide Ergebnisse kamen komplett ohne Zukauf von Eventwährung zustande."}]