[{"147": "Wäre diese Küche nicht ohnehin unterirdisch in ihren Werten - nichts, was man mit Bordmitteln nicht auch haben könnte - ich würde mich glatt ärgern^^[BR][BR]Kaum Zusatzwährung, blöde Schieberei, die überirdisch teuer ist bei miesen Trostpreisen wie Runensplittern^^, zudem pfriemelig am Handy .. ach, neee.. muss ich nicht haben.[BR][BR]Mein Fazit: Hübsch sieht sie aus, die Küche. Das ist aber auch schon das Einzige.[BR][BR]Für die Statistik:[BR]7 Artefakte im Hauptaccount bei voll gelösten Aufgaben und Sammelei^^[BR][BR]je 6 in den 3 Nebenwelten (davon 1 ebenfalls voll gelöst und Sammelei)[BR][BR]Betrachte ich dazu die mittlerweile unterirdische Chance, im Turm Artefakte zu gewinnen, das Gebäude wird niemals fertig^^ .. in sämtlichen Accounts bis jetzt gerade einmal je 2 Artis vom Echo der Verlorenen. Das bei wöchentlichen Goldturm.! Dafür Teleporter ohne Ende.)"}, {"249": "Ich war an Tag 2 fertig mit dem ersten Teil der Quests.[BR] Dann habe ich die Tagesaufgaben gelöst und fleißig Mützen gesammelt. [BR]Gespielt habe ich mit 3 Städten. [BR]2 davon haben gerade mal 7 Artefakte errungen, die 3te gerade noch auf den letzten Drücker 8[BR]Mein Fazit: Bei vergangenen Events habe ich die Eventgebäude mit dieser Spielweise (sogar ohne das GA) fast immer auf 10 gebracht. Diesmal bin ich weit davon entfernt.[BR]Mich nervt die Dauereventbespaßung seit langem. Diesmal war es besonders zeitfressend und sinnfrei und dient nur zur Verärgerung vieler Spieler."}, {"249": "@ littleFlex[BR]Ich habe mir nicht die Mühe gemacht alle Beiträge zu lesen und habe die letzten nur überflogen. Ich denke, du merkst nicht mal, wie arrogant du argumentierst. Ich kann die Kritik an deiner Person nachvollziehen."}, {"103": "das steht Dir natürlich frei, ich interpretiere nur meine Zahlen, derzeit 268 und die Zahlen lügen nicht und sind auch nicht arrogant."}, {"3": "Ich bin mal wieder vom Glück begünstigt worden. Silber-Liga geschafft und alle 9 Artefakte bekommen. Ohne einen einzigen Diamanten eingesetzt zu haben, nur den Aschephönix.[BR]Also bei mir hat es funktioniert. Und ja, mir machte das Kochen Spaß. Großer Glücksfaktor ja, aber Glück hatte ich. Genau wie beim Zwergenschach letztes Jahr auch.[BR]Mein Trick ist das Board immer gut gefüllt zu haben, von jeder Stufe etwas. Wenn das passende Rezept kommt, zusammen schieben, fertig. Dabei möglichst sparsam vorgehen und warten können.[BR]Wenn die Küche auch von den Werten nicht so toll ist, sieht witzig aus und darf stehen bleiben bis was besseres kommt."}, {"167": "Bin leider nicht so ein krasser Hecht, wie andere hier in dem Forum, daher mein Abschluss eher bescheiden:[BR]Cervayn -248 Sterne = Silberliga, wenn nicht noch in den letzten 2 h die halbe Welt aktiv köchelt [smilie--sprite1] --> das sagt doch eigentlich alles ![BR]Sinyia - 192 Sterne = Eisenliga --> da sieht man doch, was die 100 Extramützen aus dem Newsletter so ausmachen, hätte ich die gehabt, wäre ich bestimmt voll vorne dabei gewesen, oder lag es doch eher am Glück? Ja, wer weiß das schon.[BR][BR]Event ganz nett, aber zu zeitaufwendig. Tagespreise habe ich bekommen, was ich mir ausgeguggt hatte, obwohl diesmal für mich nicht wirklich was richtig sinnvolles dabei war."}, {"6": "Nur um @littleFlex etwas zu unterstützen:[BR][IMG]https://i.ibb.co/wpjCmbP/https-de-forum-elvenar-com-index-php-attachments-gold-jpg-36645.jpg[/IMG][BR]Sowas ist auch ohne Dia- oder Geldeinsatz und ohne dieses komische überteuerte Gebäude möglich."}, {"154": "Ich hatte die ganze Zeit gedacht, Nebelwald und Wüstenevent sind die schlechtesten Events, aber das hier toppt sie nochmal.[BR][BR]Und ich habe dieses Event genauso aktiv gespielt wie alle anderen Events, genauso fleißig die Eventwährung eingesammelt und alle Quests erledigt.[BR][BR]Wenn nun das nächste GA nur ein Artefakt bringt für die Küche, so wie auf Beta berichtet wurde, dann ist das jämmerlich oder das Gegenteil von \"Großartig\" wie immer in den Belohnungsfenstern steht.[BR][BR][IMG]https://i.ibb.co/xCMV305/https-de-forum-elvenar-com-index-php-attachments-mama-juuls-fusionsk-che-jpg-36646.jpg[/IMG]"}, {"146": "Hallo Zusammen,[BR]selten, dass ich hier schreibe, normalerweise läuft es immer irgendwie, mal besser, mal schlechter.[BR]Aber dass ich nach allen Quests und aktiven Einsammeln etc tatsächlich auch bei gerade mal gut 200 bin, finde ich schon ein wenig krass.[BR]Ich hatte glaube ich 4 oder 5 Aromabeutel und die kamen so schlecht, dass ich jetzt so viel tolle Sachen noch stehen habe, die aber nach Ausgabe aller Eventwährung nicht mehr zu gebrauchen sind.[BR]Faktisch ist das irgendwas schief gelaufen - vielleicht auch nicht bei allen, aber offensichtlich bei vielen.[BR]Und tätsächlich bringt da auch kein GA mehr was.[BR]Das nur so als mein Feedback.[BR]Grüße[BR]Starlights"}, {"193": "Ich mochte dieses Event überhaupt nicht. Viel zu glücksabhängig und man erhält für die Mühe des Kochens der Rezepte viel zu wenig an Fortschritt. Den Mechanismus finde ich nervig. Das Evo ist auch nicht toll, mag weder die Optik noch die Werte besonders. Ich habe trotz täglichen Spielens und Erledigen aller Quests nur die 205 erreicht. [BR][BR]Das einzige, was mir gefallen hat, war der Tag, als es Unurium als Tagespreis gab, weil ich das gerade benötigte…"}, {"9": "Feedback .. .. .. .. [BR][BR]Ich freu mich für jene, die enormes Glück haben oder hatten, was natürlich möglich ist,[BR]doch das Glück ist nicht überall zu Hause oder vorzufinden.[BR][BR]Ich habe mir mit Dias aus dem Spiel weitere Mützen gekauft um an das letzte Artefakt zu kommen und das obwohl ich regelmäßig mehrmals täglich online war und die Mützen am Stadtrand einsammelte + alle Aufgaben löste.[BR][BR]Tja, mit der Beute die weitere Eventwährung, also Mützen regenerierte hatte ich dann nicht so ein Glück.[BR]Anscheinend hatte ich auch weniger Glück beim einsammeln der Kochmützen am Stadtrand, denn 3 auf einen Streich bekam ich nur ganz selten.[BR]Auch beim rausklicken meiner Mützen hatte ich weniger Glück, dass mal eine Limette der Stufe 5 oder 6 rauskommt und so weiter und so weiter und so weiter und so weiter .. .. ...[BR][BR]Fazit:[BR][BR]Zu viel Glück und Zufallsfaktor in dem Spiel, sei es beim einsammeln der Mützen am Stadtrand oder beim ausgeben der Mützen (was kommt in welcher Stufe heraus) und beim Gewinn von Beute (Zusätzlicher Eventwährung).[BR]Editiert .. .. .. Denn selbst wenn ich Beute aus einer Bestellung gewonnen habe, ist es Glück, dass da dann weitere Kochmützen rauskommen![BR]Hier schlägt das Lotto-Toto-System volles Rohr, an allen Ecken und Kanten zu, sodass man nie weiß, wo kommt was wo raus und wie viel etc.[BR][BR]Noch deprimierender finde ich dann diesen enormen Zeitverschleiß, bevor man sich versieht, ist eine 3/4 Std. rum.[BR][BR]Alles zusammengefasst, auch das 2 Mal konnte mich diese Art Event weder begeistern noch sonst was. Zu viel Glücksspiel und zu Zeitaufwendig.[BR][BR]Zusatz:[BR][BR]Warum setzt man nicht Artefakte, welche ich in einem Event sammeln muss, nicht in die Königlichen-Preispass Geschichte?[BR]Denn ob ich nun Zusatzwährung kaufe um ein oder das letzte Artefakt zu erhalten oder eben z.B. bei 200 Punkten in der Königlichen Preispass Geschichte ein zusätzliches Artefakt einsammle, ist doch Jacke wie Hose.[BR]Nur mit dem Unterschied, dass dann \"wahrscheinlich\" mehr Spieler bereit wären ihre Dias auszugeben. Da sie ja da nicht nur das fehlende Artefakt erhalten sondern so viel mehr und dann währen \"für den ein oder anderen\" die 1500 Dias auch gerechtfertigt. So waren sie das für mich einfach nicht Wert.[BR][BR]Positiv waren \"für mich\", rein nur die Gebäude, welche wie immer sehr liebevoll designt wurden."}, {"216": "Guten Tag,[BR][BR]Ich konnte in 3 Welten den Silberrang erreichen ( Einmal sogar mit über 260 Schritten ). [BR][BR]Also alles gut ? Leider nein.[BR][BR]Die Tatsache dass in Meiner Hauptwelt trotz gefüttertem AP und Newsletterbonus und natürlich häufiger die EW eingesammelt wie bei dem letzten Event dieser Art nur der Bronzerang erreicht wird, zeigt nur dass ohne wirklich viel Glück das 9. Artefakt nicht mehr möglich ist. Hier bekam Ich 5 mal Aromabeute, in Khelonaar 22 mal. Desweiteren dauert die Einlösung der EW einfach zu lange. [BR][BR]Spiele Ich also nur in einer Welt gehe Ich zu oft leer aus, trotz täglichem Enloggen etc. Wenn man viele andere Beiträge liest scheint das ja die Regel zu sein.[BR][BR]deshalb nur Note 5- [BR][BR]PS[BR][BR]In allen Welten kam nach Ende kein Hinweis auf die erhaltenen Ligabelohnungen. ?"}, {"120": "dannie11 schrieb:\t\t\tIn allen Welten kam nach Ende kein Hinweis auf die erhaltenen Ligabelohnungen. ?\t\tZum Vergrößern anklicken....ich hab es auch nur daran gemerkt, dass ich plötzlich ein paar wp mehr in der Leiste hatte. Aber hej, sehen wir es positiv: ich musste meinen erreichten Rang nirgendwo \"großartig\" finden[smilie--sprite6][BR]Ansonsten gibt es zu diesem Event nichts Neues an Feedback hinzuzufügen, ist alles gesagt.[BR]Außer vielleicht, dass ich natürlich genauso ein toller Hecht bin wie @littleFlex  und das zehnte(!) Artefakt problemlos erspielen konnte. Allerdings nicht überall (1x Stufe 10, 1x Stufe 9, 1x Stufe 8), also hab ich hier vielleicht doch einfach nur Glück gehabt?"}, {"4": "In 5 gespielten Accounts zwischen 210 und 234 Währung eingesammelt. Überall mehrmals täglich abgeholt, alle Quests erledigt, von Anfang an den Aschephönix gefüttert und überall nach dem gleichen Schema eingelöst.[BR][BR]In dem 6. Account habe ich oh Wunder tatsächlich 271 Schritte gemacht und bin in Silber.[BR][BR]Also 5 x Bronze und 1 x Silber. Zukauf nirgends, nirgends auch den überteuerten Außenposten gekauft.[BR][BR]Normal habe ich in meinem Hauptaccount immer den Außenposten gekauft und die erste Währung für 19,99. Dieses Mal war es mir einfach zu teuer für das, was es am Schluss an Evo gibt. Würde das Evo mit mind. 5 % Tierfutter geben, hätte das anders ausgesehen für mich. Aber so,mit 1 % Chance sind das bei 365 Tagen im Jahr 3,65 x 3 Tierfutter, also max. 12 Futter im Jahr! Das ist nicht mal erwähnenswert, sonder einfach nur Veräppeln.[BR][BR]Eigentlich mag ich dieses Zusammenschieben, fand es aber viel viel zu zeitaufwändig. Außerdem ärgert es doch sehr, wenn man in 3 Accounts bei unter 100 Restwährung dann plötzlich doch Loots bekommt, die überhaupt nicht mehr nutzbar sind. Schade drum .[BR][BR]Quest wie immer, nebenbei zu erledigen, dauert halt nur seine Zeit. Tagespreise nicht interessant, der interessante Tiermarkt im Royalen Pass plötzlich nur gegen Echtgeld. Nee, Inno, so nicht.[BR][BR][BR]Ach ja, das BelohnungsPopUp fehlte überall.[BR][BR]Wieder so ein inkompetenter Fehler von Inno."}, {"13": "[Vorteil:] Newsletter ✔ - Aschephönix x, Außenposten x, Zukauf von EW x[BR][Ergebnis:] 237 Kundenzufriedenheits ️ > 'Bronze'-Liga (Khelonaar)[BR][Ausbeute:] 8x 'Juuls Reiseküche'-Artefakte + ... (nicht nennenswert)[BR]Trotz meines Versuchs, möglichst effizent auf Fortschritt zu spielen, sofern dieser Plan nicht durch 'Saison der Freude'-Quests durchkreuzt wurde, hat mir der hohe \"Glücksfaktor\" einen Strich durch die Rechnung gemacht. Das Ergebnis hinsichtlich des erzielten Fortschritts fiel diesmal erstaunlich bescheiden aus und wird ob des hohen Zeitaufwands noch deutlich geschmälert.[BR]Die Verknüpfung mit der 'Saison der Freude' führte insbesonder durch die 'Aroma-Beute'-Quest bei einigen Gemeinschaftsmitgliedern zu Frustration, da diese Herausforderung aufgrund der 'Aroma-Beute'-'Drop'-Chance bei einigen schwer, bei anderen gar nicht zu bewältigen war.[BR]'Juuls Reiseküche' ist das dritte 'Evo' in Folge, das mich aufgrund seiner \"Bonus\"-Werte nicht begeistern konnte.[BR]Die wenigen leidlich attraktiven Tagespreise waren für mich diesmal nur schwer bis gar nicht zu erringen und die erhaltenen Pilzrabatten lösten bei mir keine Begeisterung aus.[BR]Die zusätzlichen Preise, die über den 'Königlichen Preispass' zu erlangen waren, empfand ich als besonders reizlos; in Verbindung mit einem nur schwer zu erzielenden Fortschritt entbehrte die Motivation, hier zusätzlichen zu investieren, jeglicher Grundlage.[BR]Der potenzielle Spaß am Event ist bei mir leider früh auf der Strecke geblieben.[BR][BR]Mit Rückblick auf 'Mama Juuls Fusionsküche' und dem Ausblick auf den kommenden Event lässt sich inzwischen meine \"Vorfreude\" immerhin sehr leicht zügeln. "}, {"250": "Hey,[BR][BR][BR][BR][BR]ich spiele Elvenar seit eineinhalb Jahren und es ist auch das einzige Browsergame/Handyspiel was länger als einen Monat durchgehalten hat. Warum? Ich fand das Spielprinzip einfach Klasse. Man kann alles auch ohne Einsatz von Geld erreichen. Selbst die Events konnte ich immer so abschließen, dass mein Eventgebäude Evolutionsstufe 10 hatte. Besser noch, man bekommt sogar Ingamewährung durch den Turm und andere Möglichkeiten. Da bin ich sogar bereit mal Geld auszugeben, aber was das Event angeht muss ich mich vielen der Vorredner anschließen.[BR][BR][BR][BR]Ich bin alle drei Stunden online, sammel die Eventwährung am Stadtrand und schaffe alle Quest, aber die letzten zwei Events waren mehr als frustrierend. Letzte mal gerade so die 200 erreicht und dieses mal nicht mal die 180 geschafft. Dafür das man die maximale EW ohne Geld bekommt traurig. Klar kann man mal Pech haben, aber wenn ich mir die Statistik der Liga anschaue, ist das Bild ebenso traurig. Silber Liga, also die oberen 5% 240+?![BR][BR][BR][BR]Da muss sich für die nächsten Events wieder was ändern!"}, {"98": "Thebigunknown schrieb:\t\t\tHierzu möchte ich zu bedenken geben, dass bestimmt nicht alle Spieler einer Welt (mit Hochdruck) an den Events teilnehmen.[BR][BR]Wir wissen ja nicht ob diese über 90% von denen Du sprichst auch alle das vorletzte Artefakt nicht schaffen konnten, weil das Event eventuell schwerer geworden ist, (Was meiner subjektiven Wahrnehmung nach seit dem Event \"Die Große Grabung\" allgemein so zu sein scheint)[BR]oder weil sie es vielleicht auch gar nicht darauf angelegt haben es zu schaffen.\t\tZum Vergrößern anklicken....[BR]Ich bin mir nicht sicher, ob die bewusst ist, was du hier gerade angedeutet hast, deswegen frage ich mal nach: [BR]Nimmst du tatsächlich an, dass über 90% aller Elvenar-Spieler sich für das Event so wenig interessieren, dass sie es nur so nebenbei spielen und es ihnen deshalb egal ist, ob sie das Evo fertig bekommen?[BR][BR]Und eine zweite Frage: Wenn das tatsächlich so wäre, würde das nicht bedeuten, dass Inno etwas wirklich katastrophal falsch macht?"}, {"245": "Einhellige Meinung innerhalb unserer Gemeinschaften: Schlechtestes Event ever![BR][BR]Lediglich 2 Spieler haben nach eigener Aussage zu Ende gespielt (ca. 80% dagegen faktisch gar nicht !!!) ; beide sind dabei sogar in der Silber-Liga gelandet. Aliya mit 249 Schritten (ohne Zukäufe), Martin mit 244 Schritten (der hat ganz am Schluss, wie er meinte, geschummelt und 500 Dias für 60 Mützen ausgegeben, um sich 2 Minuten vor Eventende noch von 240 auf 244 zu hieven, sonst hätte er Silber um 1 oder 2 Schritte verfehlt).[BR][BR]Beide beabsichtigen nicht, das Eventgebäude hinzustellen. Ich habe mir die Frage verkniffen, weshalb dann Martin überhaupt Dias ausgegeben hat. Ich vermute aber, dass das was mit männlichem Ego zu tun hat. [smilie--sprite9][smilie--sprite8][smilie--sprite6] Kenne ich von mir selbst... [smilie--sprite2] [BR][BR]Ich selbst: Hobby, Hobby und in Khelonaar (FR) immerhin Bronze, obwohl auch dort nicht zu Ende gespielt.[BR][BR]Damit bis zum 28. Juni...dann gibt es etwas Fröhliches zu verkünden... [smilie--sprite2] (mir wurde extra erlaubt, das zu erwähnen[smilie--sprite6])"}, {"113": "Leider konnte ich dieses Event streckenweise nicht so intensiv spielen, wie ich mir das gewünscht hatte. Musste sogar ein paar Tage ganz verzichten.[BR]Also habe ich die Zeit, die ich für das Event aufbringen konnte, extra genossen. [BR]Ich fahr ja völlig auf dieses Gepussel ab.[BR][BR]Ich habe trotz des Handicaps in zwei Städten 8 Artefakte, in der dritten 6 erspielt.[BR]Ich bin mit der Ausbeute also sehr zufrieden, da ich auch noch jede Menge Tagespreise abgestaubt habe.[BR]Für mich war dieses Event also wieder ein gelungenes."}, {"28": "Cailin schrieb:\t\t\tIch bin mir nicht sicher, ob die bewusst ist, was du hier gerade angedeutet hast, deswegen frage ich mal nach:[BR]Nimmst du tatsächlich an, dass über 90% aller Elvenar-Spieler sich für das Event so wenig interessieren, dass sie es nur so nebenbei spielen und es ihnen deshalb egal ist, ob sie das Evo fertig bekommen?\t\tZum Vergrößern anklicken....Über Prozentzahlen können wir alle hier nur mutmaßen denke ich aber ja, ich könnte mir das durchaus vorstellen.[BR][BR]Jorigen schrieb:\t\t\tLediglich 2 Spieler haben nach eigener Aussage zu Ende gespielt (ca. 80% dagegen faktisch gar nicht !!!) ; beide sind dabei sogar in der Silber-Liga gelandet. Aliya mit 249 Schritten (ohne Zukäufe), Martin mit 244 Schritten (der hat ganz am Schluss, wie er meinte, geschummelt und 500 Dias für 60 Mützen ausgegeben, um sich 2 Minuten vor Eventende noch von 240 auf 244 zu hieven, sonst hätte er Silber um 1 oder 2 Schritte verfehlt).[BR][BR]Beide beabsichtigen nicht, das Eventgebäude hinzustellen. Ich habe mir die Frage verkniffen, weshalb dann Martin überhaupt Dias ausgegeben hat. Ich vermute aber, dass das was mit männlichem Ego zu tun hat. [smilie--sprite9][smilie--sprite8][smilie--sprite6] Kenne ich von mir selbst... [smilie--sprite2][BR][BR]Ich selbst: Hobby, Hobby und in Khelonaar (FR) immerhin Bronze, obwohl auch dort nicht zu Ende gespielt.\t\tZum Vergrößern anklicken....[BR]Das wohlgemerkt \"stichprobenartige\" Beispiel von @Jorigen  deutet ja beispielhaft in eine ähnliche Richtung.[BR][BR]Es gibt nichts was es nicht gibt! Sogar Spieler die sehr erfolgreich am Event teilnehmen konnten, gedenken nicht den Hauptpreis überhaupt zu nutzen wie zum Beispiel @ustoni[BR]ustoni schrieb:\t\t\tAktuell stehe ich bei 276, aufbauen werde ich das Evo aber natürlich trotzdem nicht.\t\tZum Vergrößern anklicken....[BR]Ich denke dass es selbstverständlich auch immer schwieriger wird sich Evos einfallen zu lassen, die auch die hohen Kapitel noch interessieren und zudem dann möglichst auch noch auf den Großteil der restlichen Spielerinnen und Spieler einen gewissen Reiz ausüben.[BR]Das stellen wir als Spielerinnen und Spieler uns, glaube ich, sehr häufig sehr viel einfacher vor als es tatsächlich ist, denn[BR]gergerw schrieb:\t\t\tBisher scheint es so, dass im Falle des Münzgewinns der Kulturbonus gar nicht wirkt und im Falle des Orkgewinns gar keine EGüter von der Pyramide reinkommen.[BR]===> Das ist besonders unglücklich, da unter dieser Vorraussetzung die erhaltenen Mengen einfach viel zu gering sind![BR][BR]Mit herkömmlichen Mitteln:[BR]Plätze für Orkstrategen, Orknester, Handelsstationen käme man viel weiter... Mehr Kulturbonus bekäme man auch.[BR]Man hätte allerdings keine Chance auf zusätzliches Tierfutter.\t\tZum Vergrößern anklicken....es gibt schon etliche Spielerinnen und Spieler die sich das eine oder andere vorab mal durchrechnen und Vergleiche ziehen und danach dann bestimmt auch abwägen, wie sehr sie sich im Event reinhängen oder halt auch nicht.[BR]monakuki schrieb:\t\t\tWäre diese Küche nicht ohnehin unterirdisch in ihren Werten - nichts, was man mit Bordmitteln nicht auch haben könnte - ich würde mich glatt ärgern^^\t\tZum Vergrößern anklicken....monakuki schrieb:\t\t\tBetrachte ich dazu die mittlerweile unterirdische Chance, im Turm Artefakte zu gewinnen, das Gebäude wird niemals fertig^^ .. in sämtlichen Accounts bis jetzt gerade einmal je 2 Artis vom Echo der Verlorenen. Das bei wöchentlichen Goldturm.! Dafür Teleporter ohne Ende.)\t\tZum Vergrößern anklicken....Das habe ich zuletzt auch so wahrnehmen können. Ich persönlich vermute ja, dass es in Zukunft allgemein schwieriger wird sich schnell 9 Artefakte zu erspielen. Für mich würde das auch aber einen gewissen Reiz darstellen wenn es nicht mehr so einfach wäre so schnell an neun Artefakte zu kommen, weil wer geht den dann noch im Handwerk und/oder Turm bzw. im GA auf \"Artefaktejagd\" wenn schon alles im Inventar liegt oder bereits in der Stadt steht. [smilie--sprite2]"}]