[{"147": "Na ja-^^ [BR]Einfach war es noch nie. [BR][BR]Aber bei halbwegs sportlichem Spiel auch nicht unmöglich ;-) [BR][BR]Wie gesagt: Dank unterirdischer Preise brauch ich mich auch nicht überirdisch ärgern ;D"}, {"126": "Thebigunknown schrieb:\t\t\tDas habe ich zuletzt auch so wahrnehmen können. Ich persönlich vermute ja, dass es in Zukunft allgemein schwieriger wird sich schnell 9 Artefakte zu erspielen. Für mich würde das auch aber einen gewissen Reiz darstellen wenn es nicht mehr so einfach wäre so schnell an neun Artefakte zu kommen, weil wer geht den dann noch im Handwerk und/oder Turm bzw. im GA auf \"Artefaktejagd\" wenn schon alles im Inventar liegt oder bereits in der Stadt steht. [smilie--sprite2]Zum Vergrößern anklicken....[BR]Naja, dafür muss man dann aber ja auch gut 1 - 1 1/2 Jahre auf die Artefakte im Turm / Handwerk warten. Bis dahin ist das Evo längst vom Kapitel her veraltet und ich finde es gar nicht wieder, weil es noch immer keine Sortierfunktion für die 20+ Seiten Beschwörung gibt (und im Browser nicht einmal eine Suchfunktion!)."}, {"61": "Feedback:[BR][BR]Ergebnis: mit Einsatz von 4400 Diamanten am letzten Tag hat es in Sinya Arda gerade so für Silber-Liga und somit 9 Artefakte für 273 Punkten gereicht. Gespart waren die eigentlich, um eine 2. Grundplatte zu schaffen, aber das wären dann 10k Diamanten gewesen für eine 2% Chance auf Tierfutter, irgendwann mal, wenn man noch 9 Artefakte \"kaufen\" konnte. Nein Danke.[BR][BR]2 Aschephönix auf Stufe 10 gefüttert, aber viel mehr als 10 Münzen pro Tag am Stadtrand sind es nicht geworden. Es gibt ja nichts mehr, was man noch tun darf, wenn man 2 Jahre fürs nächste Abenteuer sparen muss, damit man 2025 auch mal wieder eine Woche lang richtig Elvenar spielen kann. Aber jetzt, bei einer Chance auf 3,5 Tierfutter pro Jahr, sieht ja alles schon viel besser aus. 7 x 3 Tierfutter bis Sommer 2025 und die werden dann alle beim Abenteuer verprasst. Totale Dekadenz, ich weiß [smilie--sprite1] [smilie--sprite1] [smilie--sprite1][BR][BR]Nur schade, dass dann niemand mehr hier ist und zusehen kann ...[BR][BR]Mein Feedback zur Preispolitik ist hoffentlich angekommen @Tacheless ? Das kann man öffentlich schon kaum noch in passende Worte fassen.[BR][BR]Fazit: hätte ein richtig geiles Event werden können, aber ihr habt es total gegen die Wand gefahren, liebe/r ... wer auch immer verantwortlich ist.[BR][BR]Edit: ach ja und der Newsletter und das Geschenk waren nur bis zum vorletzten Eventtag gültig, fand ich, hat ins Bild gepasst [smilie--sprite3]"}, {"1": "ZeNSiErT schrieb:\t\t\tMein Feedback zur Preispolitik ist hoffentlich angekommen @Tacheless ? Das kann man öffentlich schon kaum noch in passende Worte fassen.\t\tZum Vergrößern anklicken....Das wird, zusammengefasst mit dem Feedback der anderen Spieler, weitergeleitet."}, {"249": "ZeNSiErT schrieb:\t\t\tEdit: ach ja und der Newsletter und das Geschenk waren nur bis zum vorletzten Eventtag gültig, fand ich, hat ins Bild gepasst\t\tZum Vergrößern anklicken....Ach darum habe ich das Geschenk nicht bekommen....................."}, {"143": "Ist den Spielern, die Silber mit unter 260 erreicht haben eigentlich klar, dass sie trotzdem 9 Artefakte im Lager haben? In der Silberliga gab es noch eins zusätzlich.[BR][BR]Jorigen schrieb:\t\t\tEinhellige Meinung innerhalb unserer Gemeinschaften: Schlechtestes Event ever![BR][BR]Lediglich 2 Spieler haben nach eigener Aussage zu Ende gespielt (ca. 80% dagegen faktisch gar nicht !!!) ; beide sind dabei sogar in der Silber-Liga gelandet. Aliya mit 249 Schritten (ohne Zukäufe), Martin mit 244 Schritten (der hat ganz am Schluss, wie er meinte, geschummelt und 500 Dias für 60 Mützen ausgegeben, um sich 2 Minuten vor Eventende noch von 240 auf 244 zu hieven, sonst hätte er Silber um 1 oder 2 Schritte verfehlt).[BR][BR]Beide beabsichtigen nicht, das Eventgebäude hinzustellen. Ich habe mir die Frage verkniffen, weshalb dann Martin überhaupt Dias ausgegeben hat. Ich vermute aber, dass das was mit männlichem Ego zu tun hat. [smilie--sprite9][smilie--sprite8][smilie--sprite6] Kenne ich von mir selbst... [smilie--sprite2][BR][BR]Ich selbst: Hobby, Hobby und in Khelonaar (FR) immerhin Bronze, obwohl auch dort nicht zu Ende gespielt.[BR][BR]Damit bis zum 28. Juni...dann gibt es etwas Fröhliches zu verkünden... [smilie--sprite2] (mir wurde extra erlaubt, das zu erwähnen[smilie--sprite6])Zum Vergrößern anklicken....die beiden müssten also 9 Artefakte im Lager haben[BR][BR]ZeNSiErT schrieb:\t\t\tFeedback:[BR][BR]Ergebnis: mit Einsatz von 4400 Diamanten am letzten Tag hat es in Sinya Arda gerade so für Silber-Liga und somit 9 Artefakte für 273 Punkten gereicht. Gespart waren die eigentlich, um eine 2. Grundplatte zu schaffen, aber das wären dann 10k Diamanten gewesen für eine 2% Chance auf Tierfutter, irgendwann mal, wenn man noch 9 Artefakte \"kaufen\" konnte. Nein Danke.[BR][BR]…\t\tZum Vergrößern anklicken....Du müsstest eigentlich 10 Artefakte im Lager haben.[BR][BR][BR][BR]Zum Feedback:[BR]Ich kann mich nur den Vorschreibern anschließen: Es war irre zeitaufwendig und zäh…[BR]Die Idee mit der Zusammenschieberei finde ich eigentlich ganz witzig, kostet aber wirklich (zu) viel Zeit. [BR]Ich hatte gerade während des Events nicht viel Zeit zum spielen. Die Quests zu lösen war trotzdem kein Problem - war nach ein paar Tagen bei den Tagesquests.[BR]Das sinnvolle Ausgeben der EventwähruNGO hingegen war zeitlich schon ein Thema. Wenn Bestellungen weggeblickt wurden hat man nicht unbedingt direkt 30 Minuten später wieder Zeit, sich darum zu kümmern."}, {"61": "Jeanne68 schrieb:\t\t\tDu müsstest eigentlich 10 Artefakte im Lager haben.\t\tZum Vergrößern anklicken....das waren 8 Artefakte aus dem Spiel und 1 aus Silber-Liga, das 9 gab es erst bei 300 hatte aber nur 273, allerdings gibt es das 10. dann beim Abenteuer [smilie--sprite1] das müssen wir aber erst noch spielen [smilie--sprite1]"}, {"143": "ZeNSiErT schrieb:\t\t\tdas waren 8 Artefakte aus dem Spiel und 1 aus Silber-Liga, das 9 gab es erst bei 300 hatte aber nur 273, allerdings gibt es das 10. dann beim Abenteuer [smilie--sprite1] das müssen wir aber erst noch spielen [smilie--sprite1]Zum Vergrößern anklicken....Öhm… Nee![BR]Auch bei diesem Event gab es das 9. Artefakt bei 260.[BR][BR]2 Artefakte gab es beim lösen der Quests:[BR][IMG]https://i.ibb.co/dLMwKMB/https-de-forum-elvenar-com-index-php-attachments-1685572259956-png-36672.png[/IMG][BR][BR]und 7 weitere bei 20, 60, 100, 140, 180, 220 und 260 Sternen.[BR][IMG]https://i.ibb.co/S05gLPX/https-de-forum-elvenar-com-index-php-attachments-1685572407331-png-36673.png[/IMG][BR][BR]Und aus der Silberliga gab es dann noch eins obendrauf.[BR][IMG]https://i.ibb.co/k8ycskQ/https-de-forum-elvenar-com-index-php-attachments-1685572545340-png-36674.png[/IMG][BR][BR]Hat man Silber mit 240 bis 259 Sternen erreicht hat man folglich insgesamt auch 9 Artefakte bekommen. [BR]Kann ich auch aus eigener Erfahrung bestätigen, da ich in 2 Welten genau diesen Fall hatte."}, {"134": "ich habe in 2 Welten jeweils 7 Artefakte, bei allen gelösten Aufgaben [smilie--sprite3]  Wer alle Aufgaben löst sollte schon alle nötigen Artefakte zusammen bekommen. Das sollte nicht vom Glücksfaktor abhängen!So jedenfalls sinkt eher die Lust weiter zu spielen."}, {"28": "ZeNSiErT schrieb:\t\t\tdas waren 8 Artefakte aus dem Spiel und 1 aus Silber-Liga, das 9 gab es erst bei 300 hatte aber nur 273, allerdings gibt es das 10.\t\tZum Vergrößern anklicken....Jeanne68 schrieb:\t\t\tÖhm… Nee![BR]Auch bei diesem Event gab es das 9. Artefakt bei 260.\t\tZum Vergrößern anklicken....Ich möchte es an dieser Stelle mal anmerken, da es oft durcheinander gebracht wird: \"Man benötigt 9 Artefakte um ein Evo auf Stadium 10 zu bringen, denn auf Stufe 1 ist die Grundplatte ja immer schon.\" [smilie--sprite2]"}, {"157": "Hatte ja zwischendrin schon gefeedbackt. Es hat sich eigentlich nichts geändert. War bis zum vorletzten Tag in der Hobbyliga, da mich kein Tagespreis vorangebracht hätte. Am vorletzten Tag gab es dann den WP-Bonus. Da habe ich dann 2k EW eingelöst und insgesamt reichlich WP abgestaubt. Am Ende ist es das 8. Artefakt als Punktlandung geworden, was ich bei anderen Events auch immer hatte. Hatte den Kakadu nicht gefüttert geschweige denn aus dem Inventar geholt, da ich das Evo eh nicht aufstellen wollte.[BR][BR]Das Prinzip dieses Events stört mich nicht, find ich sogar irgendwie nett, aber Tagespreise und Evo waren meiner Meinung nach so schlecht, wie bei noch keinem anderen Event seitdem ich spiele. Aber das ist die logische Folge, wenn man Events inflationär in die Menge schießt. Aber offensichtlich gibt es genügend User, die dafür sorgen, dass Inno über gekaufte Gebäude oder EW Reibach macht. [BR][BR]Am Ende ist es der gewohnte und erstrebte Bronzerang geworden, da ich die Bibliothek lieber als das Riesenrad habe [smilie--sprite1][BR][BR]littleFlex schrieb:\t\t\tGenau, denn ich zähle das GA-Artefakt zum Event dazu.\t\tZum Vergrößern anklicken....Wenn man so denkt, kann ich das akzeptieren. Für mich zählt das GA nicht zum Event, da zwischendrin eine Pause ist und es ja auch separat angekündigt wird. Außerdem ist es eine Gemeinschaftssache... [BR]Ich wiederhole meine Meinung: Wenn man alle Aufgaben des Events gelöst hat, sollte man das Evo auf volle Stufe ausbauen können. Ausnahmslos... Folgende Preise, für die man extra kompetent oder spendabel sein muss, soll es gerne geben. Vielleicht würde ich auch Geld ausgeben, wenn es attraktive Preise hintenraus geben würde. Aber nur um ein Evo komplett zu haben??? Also bitte...[BR][BR]Beim GA würde ich mir dann als Alternative attraktive Preise wünschen, statt die letzten Events irgendwie zu \"reparieren\""}, {"24": "Souliena schrieb:\t\t\tNaja, dafür muss man dann aber ja auch gut 1 - 1 1/2 Jahre auf die Artefakte im Turm / Handwerk warten. Bis dahin ist das Evo längst vom Kapitel her veraltet und ich finde es gar nicht wieder, weil es noch immer keine Sortierfunktion für die 20+ Seiten Beschwörung gibt (und im Browser nicht einmal eine Suchfunktion!).\t\tZum Vergrößern anklicken....[BR]Moment, willst du mir sagen in der App gibts ne Suchfunktion ? [smilie--sprite12]"}, {"245": "Feytala1986 schrieb:\t\t\tMoment, willst du mir sagen in der App gibts ne Suchfunktion ? [smilie--sprite12]Zum Vergrößern anklicken....Auch im Browser gibt es streng genommen eine Suchfunktion: diese heißt \"gb\" = geduldig blättern... [smilie--sprite2][BR][BR]Aber ja, in der App gibt es diese Suchfunktion. Man darf nur nicht (zumindest ist es bei uns = bei meiner Frau, den Kindern und mir so) den vollen Namen des gesuchten Gebäudes eingeben, denn dann wird manchmal angezeigt, dass man es nicht im Bestand hätte. Wollen wir garantiert erfolgreich suchen, dürfen wir nur z.B. die ersten paar Buchstaben eingeben, dann klappt es sicher (aber es werden dann auch alle anderen Gebäude angezeigt, die diese Buchstabenkombi haben).[BR][BR]Beispiel: Zwergische Waffenschmiede eingeben (oder auch nur Waffenschmiede) und Resultat ist = Bestand: 0.[BR][BR]Gebe ich aber nur z.B. Waff ein, ist das Resultat: Bestand Zwergische Waffenschmiede, addiert über die verschiedenen Kapitel = 21 werden angezeigt. Natürlich werden auch alle anderen Gebäude angezeigt, die die Kombi \"Waff\" enthalten, also bei mir z.B. der Waffeleisbetrieb.[BR][BR]Gebe ich also Juul ein, wird mir sofort Juuls Reiseküche angezeigt. Und ich habe es gerade ausprobiert: Gebe ich den vollen Namen ein, erscheint es auch. Deswegen, wie oben geschrieben: \"manchmal\". [smilie--sprite2]"}, {"24": "Es gibt also einen Weg für mich mal zu wissen ob ich ein Gebäude schon im Bestand habe und daher ein älteres verhackstücken kann... Das ist ja geil. [smilie--sprite8] Danke Jorigen, du bist toll.^^"}, {"245": "Feytala1986 schrieb:\t\t\tDanke Jorigen, du bist toll.^^\t\tZum Vergrößern anklicken....Sagen meine Kinder auch immer. Meine Frau übrigens auch, aber aus irgendwelchen Gründen seeeehr viel seltener. [smilie--sprite10][smilie--sprite2][BR][BR]Ansonsten...gern geschehen. Konnte ich wenigstens 1x ein kleines bissel helfen. [smilie--sprite6]"}, {"24": "Jorigen schrieb:\t\t\tSagen meine Kinder auch immer. Meine Frau übrigens auch, aber aus irgendwelchen Gründen seeeehr viel seltener. [smilie--sprite10][smilie--sprite2][BR][BR]Ansonsten...gern geschehen. Konnte ich wenigstens 1x ein kleines bissel helfen. [smilie--sprite6]Zum Vergrößern anklicken....Definitiv! [smilie--sprite8][BR][BR]Ich überlege ja langsam ein Mini-Guide über die Unterschiede zwischen App und Browser anzulegen... 80% der Spieler spielt überwiegend bis nur auf einer der beiden Varianten und hat nicht die leiseste Ahnung dass es zusätzliche Optionen gibt, von den zusätzlichen Loginboni in der App bis hin zu der (seid einiger Zeit) erheblich leichter abzuarbeitenden NBH-Liste im Browser..."}, {"151": "mich stört an dieser Art Event der Zeitaufwand... beim Kistendrehen Klicke ich einmal für eine \"Belohnung\"... hier sitze ich eine Stunde dran und bin immer noch nicht fertig... es nervt. Über die Belohnungen kann man unterschiedlicher Meinung sein, wie immer [smilie--sprite11] ... für mich war diesmal nix dabei, oder ich hab es nicht mitbekommen... weil ich eingeschlafen bin."}, {"48": "Feytala1986 schrieb:\t\t\t.. 80% der Spieler spielt überwiegend bis nur auf einer der beiden Varianten......\t\tZum Vergrößern anklicken....Ich habe letztens Mal wieder auf den Browser geguckt.[BR]Ich kann damit nix mehr anfangen. Schlechtere Grafik, langsameres Sammeln, keine Gebäude verschwinden lassen zum Umbau. Furchtbar.[BR]Dabei habe ich mal nur am browser gespielt. Das waren noch Zeiten"}, {"134": "hmmm, viel positives finde ich hier nicht. Da hoffe ich doch sehr das sich da mal einer Gedanken macht........Es gab da mal Zeiten da hat sich jeder auf Events gefreut ( waren glaub 4-5 im Jahr) da hat man sich richtig reingehängt, es gab richtig tolle Gebäude( Wunschbrunnen, Feuerphönix, Braunbär und co) Ich vermisse diese Zeiten."}, {"4": "vaas85 schrieb:\t\t\thmmm, viel positives finde ich hier nicht. Da hoffe ich doch sehr das sich da mal einer Gedanken macht........Es gab da mal Zeiten da hat sich jeder auf Events gefreut ( waren glaub 4-5 im Jahr) da hat man sich richtig reingehängt, es gab richtig tolle Gebäude( Wunschbrunnen, Feuerphönix, Braunbär und co) Ich vermisse diese Zeiten.\t\tZum Vergrößern anklicken....Was ist denn zu erwarten, wenn bereits ca. 15 Std. nach Ende des GA auf der Beta das nächste Event startet? Da hat man noch nicht mal Zeit zum Rückbau. Und Freude aufs nächste Event kommt dann auch nicht auf."}]