[{"128": "salandrine schrieb:\t\t\tWas ist denn zu erwarten, wenn bereits ca. 15 Std. nach Ende des GA auf der Beta das nächste Event startet? Da hat man noch nicht mal Zeit zum Rückbau. Und Freude aufs nächste Event kommt dann auch nicht auf.\t\tZum Vergrößern anklicken....Was hat das jetzt mit dem Reiseküchenevent zu tun?"}, {"11": "Nohmal mein vorschlag, weniger Events und viel weniger Evolutionsgebäude.[BR][BR]Daführ: Bessere Events und vorhandene Evolutionsgebäude weiter ausbaubar machen."}, {"28": "Schnalle 04 schrieb:\t\t\tNohmal mein vorschlag, weniger Events und viel weniger Evolutionsgebäude.[BR][BR]Daführ Bessere Events und vorhandene Evolutionsgebäude weiter ausbaubar machen.\t\tZum Vergrößern anklicken....Bester Vorschlag! Big Like! Ich würde dies unterstützen! Vielleicht hätte sogar INNO was davon. [smilie--sprite2]"}, {"61": "Thebigunknown schrieb:\t\t\tBester Vorschlag!\t\tZum Vergrößern anklicken....Das nehm ich jetzt persönlich [smilie--sprite1] [smilie--sprite1] [smilie--sprite1] [BR][BR]Allerbester Vorschlag: [BR][BR]Alle Events freischalten für alle Spieler. Für xxx Dias kann man das Event starten und durchspielen. Kann man alle Events so oft und wann man will spielen. Neue Events werden der \"Eventliste\" dann einfach nur hinzu gefügt und jeder kann, wann man möchte, das neue Event beginnen. [BR][BR]Zum Ausgleich geht das gleiche auch mit Turm und Turnier. Ist Gold erreicht oder 19 Kisten, kann gleich das nächste Turnier oder der nächste Turm starten. [BR][BR]... und dann schaun wir mal, wie \"eventmüde\" einige Spieler sein werden [smilie--sprite1] [smilie--sprite1] [smilie--sprite1]"}, {"35": "Also, wenn man die Gebäude dann in dem aktuellen Kapitel bekommt, hat dieser Vorschlag von @ZeNSiErT glatt einen Reiz. (10x Feuerphoenix - ich komme - *träum*)"}, {"11": "Schnalle 04 schrieb:\t\t\tNohmal mein vorschlag, weniger Events und viel weniger Evolutionsgebäude.[BR][BR]Daführ: Bessere Events und vorhandene Evolutionsgebäude weiter ausbaubar machen.\t\tZum Vergrößern anklicken....Hurra: Es kommt wieder ein Event.[BR]Wenn ihr wieder euer ding durchzieht und nichts ändert, macht bitte ein Button: willst du dran teilnehmen ja/nein"}, {"171": "Mama Juls Reiseküche habe ich jetzt doch aufgebaut. Level neun. Hoffentlich kriege ich noch irgendwo ein Artefakt dafür her. Woher, ist mir egal. [smilie--sprite1]"}, {"156": "Ich habe \"Mama Juuls Reiseküche\"schon seit einiger Zeit in meiner Stadt und freue mich einfach nur darüber.[BR]Ich habe zwar noch kein einziges mal das Tierfutter erhalten bisher,(Bei nur 1%Wahrscheinlichkeit ist das aber [BR]auch nicht erwartbar.)doch alles,was ich bisher bekommen habe,war mir auch von großem Nutzen.Auch das[BR]Restaurant \"Stoßzähne und Tischdecken\" sowie der schnuckelige kleine Pilzwald haben Platz in meiner Stadt[BR]gefunden.Mir gefällt es ganz einfach,dass eine Orkfrau und begnadete Köchin es versteht,wirklich jeden mit[BR]ihrer Kochkunst zu verzaubern.Ich kann mich nicht beklagen über das nun schon einige Zeit vergangene Event,[BR]denn ich habe alles erreicht,was ich wollte.Es tut mir leid,dass das bei etlichen Spielern und Spielerinnen nicht[BR]so war.Ich wünsche allen viel Glück für das kommende Event,das ich wie immer ohne hohe Erwartungen auf[BR]mich zukommen lasse.[smilie--sprite1]"}, {"251": "Zack, die ersten drei Sack Futter aus der Küche. (Sinya)[BR]Nach nur ca. drei Wochen.[BR](War leider zu langsam für ein Foto.)[BR]Melde mich wieder beim nächsten Mal."}, {"102": "Glückwunsch Denni. [BR]Habe das voll ausgebaute Gebäude in 2 Städten stehen und bisher kein Futter erhalten - naja bei 1% ist das auch wie ein Sechser im Lotto.[BR]Es wird wohl darauf hinauslaufen, dass Mama Juul mit ihrer Küche ins Inventar wandern wird."}, {"3": "Bei mir steht die Küche noch, weil sie nett aussieht und ich im Moment mehr als genug Platz habe.[BR]Noch habe ich kein einziges Tierfutter von Mama Juule bekommen. [BR]Wenn das passiert, wird es ein Grund zum Feiern sein!"}, {"251": "Bei mir stehen zwei.[BR]Das Event war so schön."}, {"251": "Hoppla. Schon wieder Futter. Wieder Sinya.[BR]Diesmal aus Küche Nr. 2, und ich war wieder zu langsam für ein Foto.[BR]Kommt einfach zu überraschend. (Ich hatte auf Orks gehofft.)[BR]Aber kann so weitergehen, so alle drei bis vier Wochen.[BR]Bis zum nächsten Mal."}, {"251": "Futter. Sinya. Küche Nr. 1, (in dieser schon zum 2. Mal).[BR]Auf Sinya bisher also 3x Futter, (= 9 Säcke seit Anfang Juni)[BR]Auf Cera noch nix...[BR]Das sind dann wohl die Montagsküchen  [smilie--sprite7]"}, {"14": "ich hatte in 3 Städten noch NIE Futter von Juuls"}, {"14": "ist vermutlich das nächste, was aus Platzgründen runtergenommen wird[BR]Werkzeug hab ich da zum Glück nicht[BR]aber Münzen am häufigsten (hat auch die höchste Wahrscheinlichkeit)[BR][BR]ich habe da auch nichts gegen, nur bringt das dann nicht wirklich was, wenn in anderen Evos der momentane 520% Kulturbons berücksichtigt wird[BR]und leider wirkt auf die Orks nicht die Pyramide, was diese dann auch weniger interessant macht[BR]die Mengen sind dann einfach zu wenig[BR][BR]die 750 Fragmente fand ich übrigens nicht so schlecht, auch wenn das nicht gerade viel ist[BR][BR][IMG]https://i.ibb.co/BT3Jn40/https-de-forum-elvenar-com-index-php-attachments-screenshot-1007-png-38342.png[/IMG]"}, {"205": "Hab meins auch wieder eingelagert. Kosten/Nutzen stimmt einfach nicht.[BR][BR]Dafür haben mir 2 Dschinns 3 Tage hintereinander 200 Dias ausgeworfen [smilie--sprite6][BR]gerne weiter so[BR]"}]