[{"132": "hm, ich hab nun einiges an Kochmützen gegrillt, leider ließ die Speisekarte zu wünschen übrig, um 1 Schritt in der Schlange weiterzukommen musste ich Sachen im Schüsselchen anrühren die relativ hoch ( 5er und 6er Entwicklung ) angesetzt waren, schade, die restlichen Leutchen in der Warteschleife vor Juuls Stand werden sich wohl die Beine in den Bauch stehen und hungrig bleiben da sich die anderen Rezepte ähnlich anschmecken und mein Sonnenkollektor durch Regen die Küchenmaschine nun weiterhin nicht mehr mit Strom versorgen kann [BR]die Grafik finde ich allerdings überaus gelungen"}, {"134": "ich freu mich über extra Truppen, klasse [smilie--sprite1]"}, {"171": "Meslamatea schrieb:\t\t\thm, ich hab nun einiges an Kochmützen gegrillt, leider ließ die Speisekarte zu wünschen übrig, um 1 Schritt in der Schlange weiterzukommen musste ich Sachen im Schüsselchen anrühren die relativ hoch ( 5er und 6er Entwicklung ) angesetzt waren, schade, die restlichen Leutchen in der Warteschleife vor Juuls Stand werden sich wohl die Beine in den Bauch stehen und hungrig bleiben da sich die anderen Rezepte ähnlich anschmecken und mein Sonnenkollektor durch Regen die Küchenmaschine nun weiterhin nicht mehr mit Strom versorgen kann[BR]die Grafik finde ich allerdings überaus gelungen\t\tZum Vergrößern anklicken....[BR]Ich hab mich bis jetzt zumindest bis in die Eisenliga gekocht. Das ist mehr, als ich in anderen Events am ersten Tag von mir behaupten könnte, weil ich normal erst Eventwährung spare. Da die Preise eh nicht so locken, koche ich halt drauf los. [smilie--sprite11]"}, {"14": "ich mag diese Merge-Events (ist ja erst das zweite, oder?) genauso wie das Stochern im Nebel[BR][BR]ist man schon ETWAS länger dabei, dann ist man mit den Eventgebäuden etwas wählerischer geworden[BR]den Hauptpreis, die Küche: finde ich gut![BR]nur die 1%, die sind nun echt mickerig..also 3,65 x in einem Jahr 3 Futter??[BR]hätte man das dann nicht ganz weglassen können, so gerne ich ja Futter hätte?  [smilie--sprite11][BR]ich finde die sonstigen Preise nicht so toll, bis auf die Krosse Krabbe an Tag 1 (wie üblich...um zum Eventwährungskauf zu animieren)[BR]und das Orkschiff[BR][BR]aber, diese netten 1x1 Zeitgebäude..[BR]vor 1 Jahr heftig begehrt, aber jetzt kann ich kaum was damit anfangen, weil sie nicht den Händler, sondern die Produktion pushen?[BR]ich produziere aber relativ wenig in Manus mittlerweile und die Evos sind meist auf Erweckte umgestiegen (darauf wirkt es ja nicht, da keine Produktion? denke ich, zumindest hab ich auch noch nichts für erweckte Güter gesehen)[BR][BR][BR][BR][IMG]https://i.ibb.co/tsRn8F2/https-de-forum-elvenar-com-index-php-attachments-screenshot-688-png-36133.png[/IMG] [IMG]https://i.ibb.co/hmrNxh9/https-de-forum-elvenar-com-index-php-attachments-screenshot-689-png-36135.png[/IMG][BR][BR]also nur etwas für meine Nebenstädte...[BR][BR]Segen und Truppen kann man immer brauchen, aber die hab ich heute nicht gewonnen ..."}, {"213": "100% grausiges Event! Nur Zufall ob man vernünftige Zutaten bekommt, dann dieses 30 Minütige warten auf Rezepte.[BR]Noch nie so schlechte Tagespreise gesehen.[BR]Wenn man Zutaten gewinnt, gibt es ebenfalls nur Schrott. Ob da überhaupt 8 Evolutionen zusammen kommen, zweifelhaft. [BR]Fazit: wohl das schlimmste Event das INNO je rausgebracht hat."}, {"137": "Kann mir jemand sagen wo man eine Anleitung für diese Kocherei bekommt? Zusammenschieben habe ich verstanden, aber dann hört die Info auf!?![BR]Was soll man da tun???[BR][BR]Edit: jetzt habe ich es verstanden - vielleicht sollten die Entwickler berücksichtigen das auch ab gewissem Alter die Kunden immer noch zu Handy-Spielern gehören und nicht immer eine Lupe dabei haben!"}, {"3": "Grafisch absolut toll und wirklich witzig.[BR]Die Küche ist optisch sehr schön, deswegen wird sie auf jeden Fall aufgestellt, auch wenn die Werte nicht so toll sind. Aber ab und an mal ein Tierfutter ist besser als nichts, wo sie doch jetzt schon mal steht.[BR][BR]Das Merge-Spiel mag ich, mache mir aber keine Hoffnung die Wunsch-Tagespreise zu bekommen. Dann kann ich schon nicht enttäuscht sein. Für die krasse Krabbe hat es heute schon mal nicht gereicht. Das scheint mir echt schwer. [BR][BR]Jetzt spare ich erstmal die Mützen bis zum nächsten Wunschpreis, dann ändere ich mal die Strategie. Nicht mühsam auf eine große Bestellung mit hoher Wahrscheinlichkeit hinarbeiten, sondern lieber viele kleine und Glück haben??? Na mal schauen."}, {"128": "Da Nu schrieb:\t\t\tKann mir jemand sagen wo man eine Anleitung für diese Kocherei bekommt? Zusammenschieben habe ich verstanden, aber dann hört die Info auf!?![BR]Was soll man da tun???\t\tZum Vergrößern anklicken....\t\t\thttps://de.wiki.elvenar.com/index.php?title=Mama_Juul%C2%B4s_Reisek%C3%BCche\t\t"}, {"61": "also die Preise für Eventwährung sind wirklich frech und in der Silber-Liga gewinnt man ein halbes Set, ganz tolle Idee, naja, vielleicht gibt es ja noch ein oder zwei Spieler, die das Set damals nicht vollständig gewonnen haben und das eine Gebäude immer noch besitzen und jetzt genau die Silber-Liga treffen [smilie--sprite1] [smilie--sprite1] [smilie--sprite1]"}, {"239": "Da Nu schrieb:\t\t\tKann mir jemand sagen wo man eine Anleitung für diese Kocherei bekommt? Zusammenschieben habe ich verstanden, aber dann hört die Info auf!?![BR]Was soll man da tun???\t\tZum Vergrößern anklicken....Schau mal hier, ich hole mir immer 4 oder 5 neue \"Zutaten\" gleichzeitig, dann gehts schneller als einzelne.[BR]Dann schieb ich mir die Neuen jeweils mit der 3. Zutat (also jeweils die rechte) zusammen und platziere sie eins weiter unten. Dann sieht man immer, welche Zutat welche Stelle in der Reihenfolge hat.[BR]Gegen Event-Ende mach ich dann langsamer und schiebe die 2. oder sogar gleich die 1. Reihe zusammen.[BR]Vielleicht hilft Dir diese Taktik ;-)"}, {"35": "Abgesehen davon, dass ich unten anfange mit den kleinen Sachen, mache ich es auch so.[BR][BR]Der Preis für ein Rezept mit Zutaten Level x, y, z berechnet sich mit 2^x + 2^y + 2^z (2^x ist hier als 2 hoch x zu lesen). [BR]Also z.B. 2^3 + 2^3 +2^3 = 24 für 1 Stern.[BR]25 pro Stern ist m.E. ein guter Wert."}, {"239": "Lorinar schrieb:\t\t\tAlso ich häng hier immer noch an der allerersten Münzsammelquest (und: nein, ich werde keinen Münzsegen verwenden).\t\tZum Vergrößern anklicken....Machst Du keine Nachbarschaftshilfe? Dadurch löse ich oft die Münzquests.[BR]Und dann habe ich mir angewöhnt, das Hauptgebäude nicht mehr anzufassen und das Geld nur noch einzusammeln, wenn es nötig ist."}, {"240": "Moin,[BR]ich kenne das Event ja schon von der Beta-Seite und nach anfänglichen Schwierigkeiten habe ich es auch gespielt,[BR]aber sagen wir mal so: ich habe die Sachen mitgenommen und jut isses. Über die Eisenliga bin ich nicht gekommen[BR]und auch die ganzen Hüte habe ich nicht sammeln können, ergo bleibt das Ding im Inventar, da es eh für mich nicht [BR]ganz so viel bringen würde. Den Fragenkatalog habe ich fast abgearbeitet - bis auf 3 Fragen... - es löppt so vor sich hin [smilie--sprite2]"}, {"54": "1fachgoettlich schrieb:\t\t\tMachst Du keine Nachbarschaftshilfe? Dadurch löse ich oft die Münzquests.[BR]Und dann habe ich mir angewöhnt, das Hauptgebäude nicht mehr anzufassen und das Geld nur noch einzusammeln, wenn es nötig ist.\t\tZum Vergrößern anklicken....so, das hast du dir angewöhnt - seit wann schon ?[BR][BR]Kleiner Tip: nach 20x HG polieren ist die Lagermöglichkeit des HG für Münzen erschöpft ...[BR]Alle anderen Polierungen bringen dann leider keine Münzen mehr, d.h. wenn man 24 Polierungen einer Gem bekommt und das HG nicht abholt, verliert man Münzen.[BR](ich gehe davon aus, dass die \"Liker\" den ersten Teil des Posts geliked haben ...)[BR][BR]Wer es auch noch nicht weiß: über die magische Mitgift (MM) auf Kulturen (Zaubersprucheffekt) kann man den Münz-Output der Häuser gewaltig steigern, wesentlich mehr als mit den Münzen über das HG[BR][BR]Zum Event:[BR][BR]ich hab mal hier alles durchgelesen ...[BR][BR]Lese immer nur non dem Hauptpreis und den Artefarkten dazu..[BR][BR]Wahrscheinlich bin ich der einzige, der auf Tagespreise spielt ?[BR][BR]Das ist das erste, was ich mir immer durchlese, wenn die Infos zu einem neuen Event online sind.[BR][BR]Nun meine Kritik: seit Monaten (mind 5-9) gibt es keine Personen- oder Kulturitems mehr, die den \"Wert pro Feld pro Zeiteinheit\" des besten in dieser Kategorie übertreffen. Das ist ne Sache, die ich niemals verstehen werde, naja, Verbesserungen sind wohl nicht erwünscht ?[BR][BR]HdW[BR][BR]ps was vergessen: der Hauptpreis bringt ab und an 1% auf 3 Futter - wenn ich das richtig verstanden habe ...[BR][BR]Ist auch sehr clever:  viele Items auf den Markt werfen, die Futter benötigen, dann das Futter in der Aka rationieren und dann liebenswerterweise alle paar Wochen (Monate) 3 Extra-Futter aufploppen lassen mit Juuls Reiseküche"}, {"137": "Funktioniert bei euch die Seite von Elvenarfan? Vor dem Event war es noch nicht angezeigt, jetzt ist die komplette Seite nicht mehr erreichbar!?!"}, {"241": "Bei mir funktioniert sie."}, {"113": "Da das Event ja noch sehr jung ist, gibt es auch noch sehr wenig zu schreiben, aaaaber der Ladebildschirm gefällt mir sehr, ebenso wie die Art, die Eventwährung zu verbraten. Die hat mir schon bei den Zwergen gefallen.[BR]Ob mir was nicht gefällt, weiß ich noch nicht."}, {"54": "zenka schrieb:\t\t\tich kämpfe nur noch Turm. Turnier Güter.[BR][BR].....die vielen Rüsties schlagen voll auf die Kultur und natürlich auf die Werkzeuge. Leider hatte ich vor einigen Wochen beim Umbau mein Wunder Türme der Reichhaltigkeit aus Versehen abgerissen, wegen Urlaub erst nach zwei Tagen bemerkt. Ohne Wunder sinnlos, Einheiten viel zu teuer.[BR][BR]Nun habe ich viel Platz für Schiffe, Schiffe, Schiffe......[smilie--sprite8]Zum Vergrößern anklicken....mit den MM's komm ich täglich auf 500-600 Kultur, da sind die 40 Rüstkammern nicht hinderlich ..."}, {"171": "zenka schrieb:\t\t\tLeute wir sind sowas von offtopic und ist doch vollkommen egal wie ich spiele. [smilie--sprite1]Zum Vergrößern anklicken....[BR]Meins ist gelöscht. Hauptsache, du hast es gelesen. ;-)"}, {"61": "@Alidona, ehrlich gesagt, fand ich es nicht verkehrt, wenn sich hier im Feedback gefreut wird, dass Orkschiffe Rüstkammern ersetzen könnten, wenigstens darauf hinzuweisen, dass das keine \"Standard-Taktik\" ist und auch nicht zwingend Sinn und Zweck der Orkschiffe [smilie--sprite1] Man kann sich ja auch aus anderem Grund über die Orkschiffe freuen, ich hab mir auch ein neues geholt für alle Fälle [smilie--sprite1]"}]