[{"11": "Masthor Sten schrieb:\t\t\tZuerst habe ich mir tierisch gefreut, dass Inno auf den Tierfuttermangel reagiert hat und es in den Imbiss integriert hat. Dann habe ich die 1%-Wahrscheinlichkeit und die anderen Preise gesehen und das Event für mich beendet. Kucke mal, was an Beifang anfällt, aber das Gebäude an sich reizt mich gar nicht.[BR]Auch gut, hab ich zumindest nicht weniger Platz nach dem Event [smilie--sprite8]Zum Vergrößern anklicken....Die 1% Chance ist bestimmt ein Druckfehler, so blöd können die nicht sein. [BR]wer stellt sich denn so ein teil hin, wo der platz eh immer viel zu wenig ist."}, {"113": "AngelOfDead schrieb:\t\t\tund das schickt dich nur zu den Saison Angeboten .. .. .. \t\t\t\t\t\t\t\t\t\t\t\tZum Vergrößern anklicken....bei mir ist der Aussenposten dabei[BR][BR][BR]Heisst das, dass nicht alle das Angebot bekommen?"}, {"9": "lovelymonster schrieb:\t\t\tHeisst das, dass nicht alle das Angebot bekommen?\t\tZum Vergrößern anklicken....doch bei Neu Laden war es dann da und hat sich dann auch da versteckt[BR][IMG]https://i.ibb.co/CmDhMRZ/https-de-forum-elvenar-com-index-php-attachments-1683730680169-png-36158.png[/IMG]"}, {"161": "Wenn man mal weiß, wie das Puzzlen funktioniert, macht's richtig Spaß! Cooles Event!"}, {"242": "Was soll ich sagen, wieder ein Event zur Beschäftigung was ich nicht brauche. Der Hauptpreis kostet mich nur Platz und bringt mir nichts. Tierfuttermangel habe ich nicht, da ich mir dieses einteile.  Fragmente mache ich im Turm, Orks durch meine Rüstkammern, Kämpfer produziere ich.  Gold habe ich genug. Auch würde ich nie Rüstkammern gegen Orkschiffe ersetzen, da dadurch meine produzierbare Truppengröße in den Kasernen leidet. Auch die Tagespreise kannste vergessen, oh sorry nein, habe einen gefunden,Tag 21, 20 WP. wenigstens etwas. Aber jeder wie er mag. Für mich gut, ich habe Pause und spiele nur Saison. Viel Erfolg denen, die es mögen."}, {"243": "Schnalle 04 schrieb:\t\t\tDie 1% Chance ist bestimmt ein Druckfehler, so blöd können die nicht sein.[BR]wer stellt sich denn so ein teil hin, wo der platz eh immer viel zu wenig ist.\t\tZum Vergrößern anklicken....[BR]wie immer Optimist, Schnalle, alle Achtung!"}, {"24": "1% ist wirklich ein schlechter Scherz. 5% hätte ich mir ja noch gefallen lassen... Die Chance ist so niedrig dass es locker passieren kann dass man NIE Tierfutter zieht. Im Schnitt kriegt man 3,65 pro Jahr...  Gut, haben oder nicht habe, aber trotzdem... Leute, ehrlich..."}, {"242": "Alidona schrieb:\t\t\tSchon klar, trotzdem hat es gleich einen Rattenschwanz weiterer OTs nachgezogen. Und da ich ein verantwortungsbewusster Mensch bin, lösche ich lieber. [smilie--sprite1] Danke für deinen Rückhalt. [smilie--sprite2]Zum Vergrößern anklicken....warum lässt du es denn nicht stehen, weil andere eine andere Meinung haben???? Vielleicht hättest du ja noch welche gefunden die genau so denken wie du. Aber ne, lieber löschen, macht sich besser, stimmts. Ist für mich nicht zu seiner Meinung stehen. Schade."}, {"113": "Da gibt es ja interessante Sachen zu gewinnen - Aroma-Beute und stählerne Pilze[BR]Ich hoffe, ich bekomme die mal und bin gespannt, was das wohl ist. [smilie--sprite1][BR][BR]Nein, ich schau nicht nach, ich lasse mich lieber überraschen"}, {"4": "lovelymonster schrieb:\t\t\tDa gibt es ja interessante Sachen zu gewinnen - Aroma-Beute und stählerne Pilze[BR]Ich hoffe, ich bekomme die mal und bin gespannt, was das wohl ist. [smilie--sprite1][BR][BR]Nein, ich schau nicht nach, ich lasse mich lieber überraschen\t\tZum Vergrößern anklicken....Das ist nichts, was man haben muss, wirklich nicht. Bringt nichts."}, {"242": "lovelymonster schrieb:\t\t\tDa gibt es ja interessante Sachen zu gewinnen - Aroma-Beute und stählerne Pilze[BR]Ich hoffe, ich bekomme die mal und bin gespannt, was das wohl ist. [smilie--sprite1][BR][BR]Nein, ich schau nicht nach, ich lasse mich lieber überraschen\t\tZum Vergrößern anklicken....lass sein, schade um deine Währung. Sieh mal bei elvenarfan was es dir bringt, nichts. Spar dir deine Währung für was Sinnvolles."}, {"171": "Veerle schrieb:\t\t\twarum lässt du es denn nicht stehen, weil andere eine andere Meinung haben???? Vielleicht hättest du ja noch welche gefunden die genau so denken wie du. Aber ne, lieber löschen, macht sich besser, stimmts. Ist für mich nicht zu seiner Meinung stehen. Schade.\t\tZum Vergrößern anklicken....[BR]Es war offtopic. War aber nicht weiter schlimm, hatte nur mit der Funktionsweise von Rüstkammern zu tun."}, {"113": "salandrine schrieb:\t\t\tDas ist nichts, was man haben muss, wirklich nicht. Bringt nichts.\t\tZum Vergrößern anklicken....Das werde ich dann sehen [smilie--sprite1]"}, {"242": "Alidona schrieb:\t\t\tEs war offtopic. War aber nicht weiter schlimm, hatte nur mit der Funktionsweise von Rüstkammern zu tun.\t\tZum Vergrößern anklicken....Ahhh, ok, danke für die Antwort. Dann nehme ich das zurück."}, {"133": "Alidona schrieb:\t\t\tEs war offtopic. War aber nicht weiter schlimm, hatte nur mit der Funktionsweise von Rüstkammern zu tun.\t\tZum Vergrößern anklicken....[BR]Genau, weil Leute die Kap 17 spielen und jeden Menge Platz für ihre Gastrassen Schiffe benötigen,  keine Ahnung von der Funktionsweise der Rüstkammern haben und @Alidona entsetzt ist, über die Einlagerung meiner Rüstkammern.[BR][BR]ZeNSiErT schrieb:@Alidona, ehrlich gesagt, fand ich es nicht verkehrt, wenn sich hier im Feedback gefreut wird, dass Orkschiffe Rüstkammern ersetzen könnten, wenigstens darauf hinzuweisen, dass das keine \"Standard-Taktik\" ist und auch nicht zwingend Sinn und Zweck der Orkschiffe [smilie--sprite1] Man kann sich ja auch aus anderem Grund über die Orkschiffe freuen, ich hab mir auch ein neues geholt für alle Fälle [smilie--sprite1]Zum Vergrößern anklicken....und natürlich darf hier niemand vom Standard abweichen und für eine neue Gastrasse mit viel Platzanspruch und einem versehentlich gelöschtem Wunder, kreativ werden und andere Wege gehen, sich über Orkschiffe freuen, außer man freut sich über Orkschiffe wie @Alidona und @ZeNSiErT[BR][BR]Top Event. Macht richtig Spaß. 5 Orkschiffe [smilie--sprite7]"}, {"4": "warum ist das Angebot für Eventwährung und sonstiges verschwunden? Das war mit 7 Tagen angesetzt, und es sind erst 2 Tage um.[BR][BR]Nicht, dass ich es hätte kaufen wollen, aber es ist wieder mal ein: Inno weiß nicht, was sie selbst wollen. [smilie--sprite3][BR][BR]Und ich hätte gerne eine Verlässlichkeit im Spiel!"}, {"1": "Das Angebot was für 24 Stunden vorgesehen. Es kam mit einer falschen Laufzeit ins Spiel und der Fehler wurde behoben."}, {"171": "zenka schrieb:\t\t\tGenau, weil Leute die Kap 17 spielen und jeden Menge Platz für ihre Gastrassen Schiffe benötigen,  keine Ahnung von der Funktionsweise der Rüstkammern haben und @Alidona entsetzt ist, über die Einlagerung meiner Rüstkammern.[BR][BR][BR]und natürlich darf hier niemand vom Standard abweichen und für eine neue Gastrasse mit viel Platzanspruch und einem versehentlich gelöschtem Wunder, kreativ werden und andere Wege gehen, sich über Orkschiffe freuen, außer man freut sich über Orkschiffe wie @Alidona und @ZeNSiErT[BR][BR]Top Event. Macht richtig Spaß. 5 Orkschiffe [smilie--sprite7]Zum Vergrößern anklicken....[BR]@zenka [BR][BR]Erstens wusste ich nicht, in welchem Kapitel du spielst.[BR][BR]Zweitens lesen auch andere mit, Player in kleineren Kapiteln, die noch nicht alles wissen. Die freuen sich dann, hurra, ich brauch keine Rüstkammern, stellen sich ausschließlich Orkproduzentersatzdinger hin und denken, das wars. Und wundern sich dann.[BR][BR]Deshalb war auch der Zusatz von @ZeNSiErT nicht ganz verkehrt.[BR][BR]Aber wir sollten jetzt aufhören, hier weiter darüber zu reden, wegen Offtopic. Sorry also, wenn ab jetzt zu dem Thema keine Antwort mehr von mir kommt. [smilie--sprite1]"}, {"239": "HerrderWelten schrieb:\t\t\tKleiner Tip: nach 20x HG polieren ist die Lagermöglichkeit des HG für Münzen erschöpft ...\t\tZum Vergrößern anklicken....Ups, nein das ist mir neu. OK, dann muss ich mir das mal ausrechnen und halt immer die 20 Polierungen abwarten und dann ernten... Danke für den Tip [smilie--sprite1]"}, {"103": "diese Aussage vom HerrderWelten ist nicht korrekt[BR][BR]-> edit war falsch von mir"}]