[{"104": "Und was ist stattdessen korrekt? Wäre doch an dieser Stelle gut anzubringen, oder schon übertriebene Nörgelei? [smilie--sprite2][BR][BR]Schaut man woanders nach, liest es sich ziemlich in die genannte Richtung.[BR]\t\t\thttps://de.wiki.elvenar.com/index.php?title=Nachbarschaftshilfe#Nachbarschaftshilfe_-_.C3.9Cberblick\t\t\t\t\tEs werden die Münzen von bis zu 20 Hilfeleistungen gesammelt, danach müssen die Münzen abgeholt werden, damit wieder Münzen durch Hilfe erzeugt werden.\t\tZum Vergrößern anklicken....[BR]\t\t\thttps://de.forum.elvenar.com/index.php?threads/nbh-hauptgeb%C3%A4ude.24211/\t\tLexiTargaryen schrieb:\t\t\tEs ist immer noch so wie von Tacheless damals erläutert bzw wie es im Wiki steht. Das HG kann unbegrenzt poliert werden - der Effekt wirkt aber nur 20 mal bzw wenn die Münzen regelmäßig abgeholt werden. Wenn das HG voll ist, kann es dennoch weiterhin poliert werden (u.a. damit auch kleine Spieler mit potentiell nur kleinen Nachbarn eine Chance haben regelmäßig Hilfe geben zu können).[BR]Das HG im Ausbau verhält sich hier anders, ist aber auch über die App (und ich glaube auch über das neue Polieren über die Benachrichtigungen im Browser - hier bin ich mir jedoch nicht hundertprozentig sicher) polierbar dann.\t\tZum Vergrößern anklicken...."}, {"103": "Ich revidiere meinen Post, ich hatte den falschen Kontext im Kopf,[BR]da es hier um erhaltene NBH geht, nicht um selbst getätigte[BR][BR]Danke Forge für den Hinweis (geht aber auch netter^^)"}, {"238": "Was ich wie bei jedem Event schade finde sind die Tagesquests die ca. im letzten Drittel kommen, am liebsten würde ich einfach \"normal\" weiter spielen und schauen wie weit ich komme.. so falle ich dann wieder in der Liga zurück. Für \"Vielspieler\" wäre dies ein echter Gewinn.."}, {"61": "Saerschi schrieb:\t\t\tWas ich wie bei jedem Event schade finde sind die Tagesquests die ca. im letzten Drittel kommen, am liebsten würde ich einfach \"normal\" weiter spielen und schauen wie weit ich komme.. so falle ich dann wieder in der Liga zurück. Für \"Vielspieler\" wäre dies ein echter Gewinn..\t\tZum Vergrößern anklicken....Der Zusammenhang stimmt aber nicht wirklich, es ist für die Liga völlig unerheblich, wann du die Aufgaben machst und wann du die Eventwährung ausgibst, am Ende hast du immer das gleiche Ergebnis. [BR]Ehr das Gegenteil ist der Fall. Wenn du schon vom 1. Tag an auf Gold-Liga spielst und immer gleich alles ausgibst, nur um noch in der Gold-Liga zu bleiben, wissen die Spieler, die am Ende sich die Eventwährung für die Gold-Liga kaufen möchten, wie teuer es wird, überbieten Dich am Ende und Du hast keine Währung mehr übrig, um noch mit um die Gold-Liga zu spielen. [BR]Wer die Gold-Liga gewinnen will, der gibt so viel wie möglich in der letzten Event-Stunde aus, wenn man aus der Gold-Liga nicht mehr rausfliegen kann. Und gerade \"Vielspieler\" haben ja dann auch die Zeit dafür, zum richtigen Zeitpunkt einzuzahlen. [BR]Und wenn Du nach 2 Tagen \"normal weiter spielen\" schon bei den Tagesaufgaben bist, dann noch mal 1 Tag für die restlichen Tagesaufgaben bräuchtest, dann keine weitere Eventwährung mehr bekommen könntest, wäre die Gold-Liga für Dich nach 3 Tagen schon erledigt, weil die Spieler, die so taktieren wie Du, ja dann am 4. Tag schon Eventwährung für die Gold-Liga kaufen, Dich überbieten und ihr Pulver auch zu früh verschießen, weil die Gold-Liga trotz dem erst am letzten Tag in der letzten Stunde vergeben wird und nicht schon am Tag 2 des Events."}, {"48": "Orkschiffe?[BR]Sind die ollen Nester aus der Aka nicht effektiver oder genauso effektiv? [BR]Jeder wie er mag. [BR]Ich fand das Event auf beta gruselig und hier ist es nicht besser."}, {"2": "Saerschi schrieb:\t\t\tWas ich wie bei jedem Event schade finde sind die Tagesquests die ca. im letzten Drittel kommen, am liebsten würde ich einfach \"normal\" weiter spielen und schauen wie weit ich komme.. so falle ich dann wieder in der Liga zurück. Für \"Vielspieler\" wäre dies ein echter Gewinn..\t\tZum Vergrößern anklicken....1. haben die Quests nichts mit den Ligen zu tun und 2. bekommen die anderen Spieler diese Quests doch auch nicht früher als du (und auch nicht mehr) - es liegt also offensichtlich an was anderem (Glück, Zukauf), wenn du am Ende nicht mehr in der Goldliga bist..."}, {"137": "Das puzzeln an sich ist ja mal eine lustige Alternative aber:[BR][BR]Am Handy sind die verschiedenen Stufen kaum erkennbar und ich brauche so viele Punkte um irgend ein Rezept fertig zu stellen das es echt keinen Spaß macht. Bisher noch kein Hauptpreis, gestern gab es bei einem 4 Sterne Rezept gerade mal 5 WP, dafür habe ich fast 100 Punkte verbraucht. "}, {"171": "Romilly schrieb:\t\t\t1. haben die Quests nichts mit den Ligen zu tun und 2. bekommen die anderen Spieler diese Quests doch auch nicht früher als du (und auch nicht mehr) - es liegt also offensichtlich an was anderem (Glück, Zukauf), wenn du am Ende nicht mehr in der Goldliga bist...\t\tZum Vergrößern anklicken....[BR]Frage: Die Besetzung in der Liga hat doch was mit der Ausgabe von Eventwährung zu tun, oder?[BR][BR]Ich achte da zu wenig drauf, drum weiß ich darüber nicht so gut Bescheid. Komme meist nur bis Bronze, und da bin ich schon gut. [smilie--sprite8]"}, {"2": "Alidona schrieb:Frage: Die Besetzung in der Liga hat doch was mit der Ausgabe von Eventwährung zu tun, oder?[BR][BR]Ich achte da zu wenig drauf, drum weiß ich darüber nicht so gut Bescheid. Komme meist nur bis Bronze, und da bin ich schon gut. [smilie--sprite8]Zum Vergrößern anklicken......jein - es geht um die Punkte (diesmal sind es Sterne), die du erreicht hast, also das, was du bekommst, wenn du die Währung (die Mützen) ausgibst - das 1 % aller Spieler mit den meisten Punkten ist dann halt am Schluß in der Goldliga - der Einstiegswert wird stündlich am Punktestand des Letzten aus jeder Gruppe gemessen (und die letzte Messung findet dann 1 Stunde vor Eventende statt - da kann man sich dann noch vorbei quetschen)..."}, {"103": "Die Besetzung der Ligen gründet sich auf den Fortschritten bei den Erfolgspunkten des Events,[BR]nicht auf die Ausgabe von Eventwährung (auch wenn beides natürlich verbunden ist)[BR][BR]Ich kann aber mit weniger Währung mehr Erfolgspunkte erreichen als andere Spieler mit viel Währung,[BR]das hängt von der Ausgabestrategie und etwas Glück beim Erhalt der Zutaten ab.[BR][BR]Zählbar für die Ligen bleiben am Ende aber nur die erreichten Fortschritte."}, {"171": "littleFlex schrieb:\t\t\tDie Besetzung der Ligen gründet sich auf den Fortschritten bei den Erfolgspunkten des Events,[BR]nicht auf die Ausgabe von Eventwährung (auch wenn beides natürlich verbunden ist)[BR][BR]Ich kann aber mit weniger Währung mehr Erfolgspunkte erreichen als andere Spieler mit viel Währung,[BR]das hängt von der Ausgabestrategie und etwas Glück beim Erhalt der Zutaten ab.[BR][BR]Zählbar für die Ligen bleiben am Ende aber nur die erreichten Fortschritte.\t\tZum Vergrößern anklicken....[BR]Danke, @littleFlex und @Romilly [BR][BR]Wieder etwas gelernt. [smilie--sprite1]"}, {"29": "Die Reiseküche ist recht nützlich. Sie kann flächenmäßig zwei Plätze der Ork-Strategen ersetzen und verköstigt dabei sogar mehr Militärs. Um ein Maximum an kämpfenden Einheiten zu erhalten, braucht die Küche nur halbfertig aufgestellt werden. Dieser Umstand ist für alle gut, die das Event nicht bis zum 9.Artefakt spielen wollen. Zusätzlich begehrt noch ein Haufen Fachkräfte Einlaß (im Kapitel 20 sind es einige tausend), was natürlich für die Wirtschaft gut ist."}, {"2": "65536 schrieb:\t\t\tDie Reiseküche ist recht nützlich. Sie kann flächenmäßig zwei Plätze der Ork-Strategen ersetzen und verköstigt dabei sogar mehr Militärs. Um ein Maximum an kämpfenden Einheiten zu erhalten, braucht die Küche nur halbfertig aufgestellt werden. Dieser Umstand ist für alle gut, die das Event nicht bis zum 9.Artefakt spielen wollen. Zusätzlich begehrt noch ein Haufen Fachkräfte Einlaß (im Kapitel 20 sind es einige tausend), was natürlich für die Wirtschaft gut ist.\t\tZum Vergrößern anklicken.......du weißt hoffentlich, daß die Küche nicht alles gleichzeitig abgibt, sondern zufällig nur EINE der angebotenen Möglichkeiten?...(wie die Seepferdchen-Arena)..."}, {"29": "\"daß die Küche nicht alles gleichzeitig abgibt\"[BR][BR]Das hatte ich mir lange überlegt, und bin dann zum Schluß gekommen, die kämpfenden Einheiten zu addieren und danach mit der Wahrscheinlichkeit zu multiplizieren. Die Rechnung müßte so hinkommen."}, {"2": "65536 schrieb:\t\t\t\"daß die Küche nicht alles gleichzeitig abgibt\"[BR][BR]Das hatte ich mir lange überlegt, und bin dann zum Schluß gekommen, die kämpfenden Einheiten zu addieren und danach mit der Wahrscheinlichkeit zu multiplizieren. Die Rechnung müßte so hinkommen.\t\tZum Vergrößern anklicken.......naja - das ist nicht mal ein vollständiger Trupp bei einer Wahrscheinlichkeit von 20 % (40 % mit beiden Einheiten) - das erledige ich in Kaserne & Co. in einer Stunde und auch mein Schrein der Champions spuckt alle 3 Stunden mehr Einheiten aus...(es werden auch mehr Einheiten, wenn die Küche auf einer höheren Stufe ist - auf Stufe 10 sind es 4100, auf 5 nur 2700)...[BR][BR]...aber ich werd die Küche trotzdem aufstellen [smilie--sprite2]..."}, {"180": "Mein Fazit . schlechtestes Event ever. Ganz mieses Eventgebäude, noch kompliziertere Spielmechanik, schlecht erkennbare Gegenstände. Zufallsgenerierte Gegenstände dann noch in den Dailys, sorry, geht gar nicht."}, {"29": "Eigentlich wollte ich es nicht verraten, aber das Maximum ist auf Stufe 7. Nicht viel, aber mehr:[BR][BR](3300+3300)*0,5 > (4100+4100)*0,4"}, {"244": "Das Kochen ist super lästig. Wie gut das ich das Gebäude nicht will."}, {"159": "ich find das Event witzig  [smilie--sprite1] [BR]Es wird nie ein Event geben das allen gefällt, macht trotzdem das beste draus ."}, {"172": "Ich bin sehr unzufrieden. Ich habe bereits sehr viel Eventwährung ausgegeben, stehe bei 110 Sternen und habe noch KEIN EINZIGES Mal Aroma-Beute bekommen [smilie--sprite4]. Dabei hatte es jeder Gast mit 10% im Angebot. Diese 10% scheinen mir nicht wirklich zu stimmen!"}]