[{"245": "Ich spiele das Event nicht, ein paar Aufgaben habe ich aber nebenbei und aus Versehen mit gelöst. Die meisten Preise sind mal wieder grottig. Gut, den Beifang habe ich natürlich dennoch mitgenommen.[BR][BR]Eine bei uns in der Gemeinschaft schießt aber derzeit den Vogel an: Sie liegt noch 6 Aufgaben (WhatsApp-Nachricht von letzter Nacht) unterhalb der Hälfte der Questline, hat aber auch bereits über 100 Eventschritte gemacht, ohne EW dazugekauft zu haben. Dahingehend ... @laralala ...[BR]laralala schrieb:\t\t\tstehe bei 110 Sternen und habe noch KEIN EINZIGES Mal Aroma-Beute bekommen [smilie--sprite4].\t\tZum Vergrößern anklicken....... sie kann sich da vermutlich eher nicht beklagen. [smilie--sprite2] Gratulation @Villivaru. [smilie--sprite6][smilie--sprite8] Dabei hat sie schon verkündet, dass sie nichts aufstellen wird, was sie gewinnt, weil sie einzig am Beifang interessiert ist. [smilie--sprite11]"}, {"113": "Ich muss mich echt bremsen, damit ich nicht die ganze Eventwährung auf einmal verbrate, sondern mir für spätere Basteleien noch was aufhebe.[BR]Da ist es ganz gut, dass ich in drei Städten spiele, so kann ich insgesamt dann doch schön viele Bestellungen ausführen. Mir macht diese Bastelei höllischen Spaß."}, {"118": "ZeNSiErT schrieb:\t\t\tWer die Gold-Liga gewinnen will, der gibt so viel wie möglich in der letzten Event-Stunde aus, wenn man aus der Gold-Liga nicht mehr rausfliegen kann. Und gerade \"Vielspieler\" haben ja dann auch die Zeit dafür, zum richtigen Zeitpunkt einzuzahlen.\t\tZum Vergrößern anklicken....der Vollständigkeit halber muss an dieser Stelle erwähnt werden, dass es bei diesem Event so gut wie unmöglich ist die gesamte EW innerhalb einer Stunde einzulösen! [BR]Das funktioniert bei Kisten Events, diese Puzzlerei/Kocherei nimmt aber sehr viel Zeit in Anspruch. Wer es tatsächlich versucht könnte richtig in die Röhre schauen und es evtl nicht schaffen seine hart erarbeiteten Mützchen auch einzulösen."}, {"112": "ich versuche meine mützen immer ziemlich bald gleichmässig in die 3 sorten nahrung umzuwandeln. heute z.b. werde ich keine kunden bedienen, aber das lager füllt sich mit allen sorten mahlzeiten. morgen kann ich dann die entsprechenden kundenwünsche ratzfatz erfüllen"}, {"61": "Aleanca schrieb:\t\t\tder Vollständigkeit halber muss an dieser Stelle erwähnt werden, dass es bei diesem Event so gut wie unmöglich ist die gesamte EW innerhalb einer Stunde einzulösen!\t\tZum Vergrößern anklicken....hab ja geschrieben \"so viel wie möglich\", das schließt das ja mit ein, ich denke auch nicht, dass man alles schafft, das ist bei den Kisten schon manchmal eng und genau genommen hat man ja auch die letzten 2 h Zeit, aber das ist ja total geheim und wird nicht verraten [smilie--sprite1]"}, {"121": "Für mich ist das event vorbei. Habe heute 1300 angesammelte Eventwährung eingelöst, Resultat: die Augen tränen, Kopfschmerzen und wofür? Ein-Feldchen Dinger, die keiner braucht, Relikte, nur 1 x Tagespreis . Ne, diese Mechanik und die \"Preise\" sind zum Abgewöhnen, nie wieder."}, {"210": "65536 schrieb:\t\t\tEigentlich wollte ich es nicht verraten, aber das Maximum ist auf Stufe 7. Nicht viel, aber mehr:[BR][BR](3300+3300)*0,5 > (4100+4100)*0,4\t\tZum Vergrößern anklicken....hehe, nette Sichtweise  [smilie--sprite8]"}, {"238": "ZeNSiErT schrieb:\t\t\tDer Zusammenhang stimmt aber nicht wirklich, es ist für die Liga völlig unerheblich, wann du die Aufgaben machst und wann du die Eventwährung ausgibst, am Ende hast du immer das gleiche Ergebnis.[BR]Ehr das Gegenteil ist der Fall. Wenn du schon vom 1. Tag an auf Gold-Liga spielst und immer gleich alles ausgibst, nur um noch in der Gold-Liga zu bleiben, wissen die Spieler, die am Ende sich die Eventwährung für die Gold-Liga kaufen möchten, wie teuer es wird, überbieten Dich am Ende und Du hast keine Währung mehr übrig, um noch mit um die Gold-Liga zu spielen.[BR]Wer die Gold-Liga gewinnen will, der gibt so viel wie möglich in der letzten Event-Stunde aus, wenn man aus der Gold-Liga nicht mehr rausfliegen kann. Und gerade \"Vielspieler\" haben ja dann auch die Zeit dafür, zum richtigen Zeitpunkt einzuzahlen.[BR]Und wenn Du nach 2 Tagen \"normal weiter spielen\" schon bei den Tagesaufgaben bist, dann noch mal 1 Tag für die restlichen Tagesaufgaben bräuchtest, dann keine weitere Eventwährung mehr bekommen könntest, wäre die Gold-Liga für Dich nach 3 Tagen schon erledigt, weil die Spieler, die so taktieren wie Du, ja dann am 4. Tag schon Eventwährung für die Gold-Liga kaufen, Dich überbieten und ihr Pulver auch zu früh verschießen, weil die Gold-Liga trotz dem erst am letzten Tag in der letzten Stunde vergeben wird und nicht schon am Tag 2 des Events.\t\tZum Vergrößern anklicken....Ich hab nie das Gegenteil behauptet..[BR]Vielleicht ließt du einfach noch mal mein Kommentar und überlegst wie ich das noch meinen hätte können.."}, {"238": "Romilly schrieb:\t\t\t1. haben die Quests nichts mit den Ligen zu tun und 2. bekommen die anderen Spieler diese Quests doch auch nicht früher als du (und auch nicht mehr) - es liegt also offensichtlich an was anderem (Glück, Zukauf), wenn du am Ende nicht mehr in der Goldliga bist...\t\tZum Vergrößern anklicken....Alter Schwede, was ich hier für Antworten bekomme.. ja ich weiß das Quests nichts mit den Ligen zu tun haben, ändert aber nichts daran dass ich am liebsten weiterspielen würde und ich auf die im späteren Verlauf kommenden Tagesquests verzichten könnte. Und ja, ich denke so wäre die erspielte Liga dann auch einfacher zu halten.."}, {"213": "Tolle Tagespreise, immer wenn darauf spielst, wirst mit 1x1 Nieten belohnt  [smilie--sprite4] [smilie--sprite4] [smilie--sprite4]"}, {"61": "Saerschi schrieb:\t\t\tAlter Schwede, was ich hier für Antworten bekomme.. ja ich weiß das Quests nichts mit den Ligen zu tun haben, ändert aber nichts daran dass ich am liebsten weiterspielen würde und ich auf die im späteren Verlauf kommenden Tagesquests verzichten könnte. Und ja, ich denke so wäre die erspielte Liga dann auch einfacher zu halten..\t\tZum Vergrößern anklicken....Wir hatte ja mal unendliche Eventaufgaben, aber besonders helle Köpfe haben sich beschwert, dass man mit den unendlichen Aufgaben nicht fertig wird."}, {"238": "ZeNSiErT schrieb:\t\t\tWir hatte ja mal unendliche Eventaufgaben, aber besonders helle Köpfe haben sich beschwert, dass man mit den unendlichen Aufgaben nicht fertig wird.\t\tZum Vergrößern anklicken....Ganz toll.."}, {"126": "ustoni schrieb:\t\t\tHab jetzt mal 5 Stählerne Pilze gesetzt, also 5 x 5% = 25% auf die Produktion der Basis-Standardgüter.[BR]Die 5% beziehen sich allerdings nur auf die Standard-Produktion der Manus.[BR]Damit produzieren meine Holzmanus jetzt alle 3 Stunden statt 12552 Holz sagenhafte 13190 Holz.[BR]Wahnsinn! Wo soll ich jetzt nur mit dem ganzen Holz hin? [smilie--sprite11][BR]Was für eine Belohnung! [smilie--sprite10]Zum Vergrößern anklicken....Mehr als Lückenfüller sind die Teile halt leider nicht. Fand die letztes Jahr auch besser, wo es noch verschiedene andere Boni gab (höhere Händlerangebote, höhere Trainingskapazität etc)"}, {"246": "Kann es sein, dass beim letzten Event die tägliche \"geschenkte\" Eventwährung noch 35 war? Diesesmal \"nur\" noch 20! Das bedeutet, es wird noch schwerer, auf die 260 zu kommen. Sehr schade, mir hat es gleich etwas die Lust genommen, überhaupt mitzumachen. Auch habe ich das Gefühl, dass die Kochmützen die man einsammeln kann zu einem höheren Prozentsatz nur einer 1 entspricht. Es ist jedenfalls bei mir sehr selten, dass ich 2er oder 3er erwische. Seit ungefähr 3 Events wird gefühlt an der Schraube gedreht. [BR]Beim letzten Event habe ich noch 7,99 € für dieses +1-Gebäude bei der zu sammelnden Eventwährung ausgegeben. [BR]Im Browser dieses mal 9,99 €, in der App sogar 11,99 €. Da vergeht mir echt die Lust.[BR]Ich find es sowieso unverständlich, wieso die Preise von App und Browser unterschiedlich sind.[BR][BR]Ich wäre sehr dafür, weniger Events zu machen, dafür aber die Erreichbarkeit des vollständigen Eventgebäudes wieder etwas mehr zu erleichtern."}, {"113": "Twisty2xs schrieb:\t\t\tIch find es sowieso unverständlich, wieso die Preise von App und Browser unterschiedlich sind\t\tZum Vergrößern anklicken....Im Browser ist das der nackte von INNO gewünschte Preis, in der App wollen noch die Appzurverfügungsteller mitverdienen.[BR][BR]Dass der Login-Bonus niedriger ist, passt dazu, dass wir auch niedrigere Quest-Belohnungen bekommen, da auch das Essen wenig kostet. Das passt schon alles zusammen. Ist nur halt ungewohnt weil mal was anderes."}, {"112": "bei der app will der shop, der die app anbietet, mitverdienen.[BR]aber ich verkneife mir den außenposten auch jedes mal... den preis ist mir das ding nicht wert."}, {"4": "Ich hab auch keinen Außenposten, einfach, weil zum einen mir das Gebäude das Geld nicht wert ist, zum anderen aber auch, weil die Kochmützen, die zur Verfügung stehen, sowieso viel zu wenig sind. Habe in der Beta mit 2 Accounts gespielt, weiß also, was auf mich zukommt.[BR][BR] Außerdem streike ich sowieso bei 9.99 €"}, {"144": "Xxxx"}, {"156": "Mir macht die Spielmechanik,die ich im Zwergenevent \"Ein Tor in die Vergangenheit\" im letzten[BR]Jahr schon kennenlernen durfte,riesigen Spaß.Es bereitet mir Freude,die verschiedenen Speisen[BR]und Getränke zuzubereiten.Das neue Evo\"Mama Juuls Reiseküche\"wird auf jeden Fall einen Platz[BR]in meiner kunterbunten Stadt in Ceravyn bekommen,weil mir die Geschichte dahinter einfach[BR]sehr gefällt.Eine Orkfrau und Köchin zieht durch die Lande Elvenars,sammelt Rezepte und Zutaten in den[BR]verschiedenen Regionen und bereitet köstliche Speisen und Getränke zu,die alle glücklich[BR]machen.Das macht mich auch glücklich.[smilie--sprite1]"}, {"2": "....die Eventwährung scheint auch für die Live-Welten sehr schlecht bemessen zu sein - ich werd schätzungsweise nur bei 200-220 Punkten landen - in den größen Bestellungen treffe ich die Aroma-Beute so gut wie gar nicht - die 2er-Bestellungen sind hier etwas erfolgreicher - mit den Tagespreisen sieht es auch sehr mau aus..."}]