[{"118": "„öffne 3 Aromabeutel“ [BR]Das ist ein schlechter Scherz.[BR]Ich habe die bisherige komplette Eventwährung schon verpulvert und hatte insgesamt keine 3! Denke nichtmal dass im kompletten Event 3 Aromabeutel für mich rausspringen. Davon 3 in einer Woche zu wollen ist Utopie. Selbst ein einziger wäre extrem schwer."}, {"247": "Ich finde es überhaupt NICHT gut, dass ich dieses Event (Juuls Küche) machen muss, damit ich bei dem Event: Saison der Freude die Aufgaben erledigen kann. Das sollte nicht sein. [BR]Ich weiß auch nicht so recht, ob die Kritik hier her gehört. Aber ich musste meinen Unmut los werden. Sorry, aber das finde ich nicht richtig.[smilie--sprite4]"}, {"104": "Ich bin ja für Saison komplett abschaltbar, aber diese Verknüpfung teils derart kritisiert? Man braucht weder paar Tages- noch paar Wochenaufgaben. Saison geht auch gut ohne.[BR]Und an Saison ist doch gar nicht zu denken, wenn die normalen Events ausgelassen, ob alle oder einzelne wegen nicht benötigten Stufengebäude? Events mit Tages- und Kistenpreisen 10fach lukrativer."}, {"133": "Aleanca schrieb:\t\t\t„öffne 3 Aromabeutel“[BR]Das ist ein schlechter Scherz.[BR]Ich habe die bisherige komplette Eventwährung schon verpulvert und hatte insgesamt keine 3! Denke nichtmal dass im kompletten Event 3 Aromabeutel für mich rausspringen. Davon 3 in einer Woche zu wollen ist Utopie. Selbst ein einziger wäre extrem schwer.\t\tZum Vergrößern anklicken....[BR]hatte ich heute Morgen auch, einfach abgewählt und es kam die Aufgabe sammle Gold. Wo ist das Problem?"}, {"113": "Maela schrieb:\t\t\tIch finde es überhaupt NICHT gut, dass ich dieses Event (Juuls Küche) machen muss, damit ich bei dem Event: Saison der Freude die Aufgaben erledigen kann. Das sollte nicht sein.[BR]Ich weiß auch nicht so recht, ob die Kritik hier her gehört. Aber ich musste meinen Unmut los werden. Sorry, aber das finde ich nicht richtig.[smilie--sprite4]Zum Vergrößern anklicken....Wenn du dich ärgerst, ist das so, ich möchte dir das auch nicht weg reden.[BR]Ich möchte nur zwei Punkte anmerken, die den Ärger vielleicht etwas dämpfen.[BR][BR]1. Du bist nicht gezwungen, die Aufgabe zu erledigen, in den Saisonaufgaben steckt genug Luft, um die eine oder andere übergehen zu können.[BR]2. Sind auch andere Spiel-Module miteinander verknüpft. Wir können im Turm magische Gebäude gewinnen; die Blaupausen, um diese Gebäude zu leveln, gibt es aber im Turnier. Das nehmen wir ohne murren hin. [BR]Diese Verknüpfungen sind, meiner Meinung nach, Teil des Spielprinzipes."}, {"194": "Diese Art Event mag ich überhaupt nicht - jetzt schon das zweite Mal. Aber gut, da es mir sowieso zu viele Events sind, ist das wieder eines das ich gut auslassen kann. Was mich dann aber ärgert ist die Verknüpfung zu den Saisons. Man muss dann am Ende doch wieder was einsammeln oder nutzen oder wie auch immer - und so selten sind diese speziellen Aufgaben leider nicht."}, {"118": "zenka schrieb:\t\t\thatte ich heute Morgen auch, einfach abgewählt und es kam die Aufgabe sammle Gold. Wo ist das Problem?\t\tZum Vergrößern anklicken....Das Problem ist die Unlösbarkeit dieser Aufgabe. Weil so viel im Event einfach gar nicht ausgegeben wird. [BR]Das wäre adäquat mit einer Aufgabe wie „sammle 10 lila Truhen im Turm“. Das gibt der Turm auch nicht her, vollkommen Kapitel- und Spielerunabhängig. Deshalb habe ich mich darüber beschwert. [BR]Habe 2/3 der Eventwährung ausgegeben und keine 3 erhalten. Geschweige denn innerhalb einer Woche."}, {"133": "für mich besteht die Unlösbarkeit der Aufgabe die eindeutig als unlösbar offensichtlich war, in der Abwahl dieser. Durch die Abwahl wird die Aufgabe lösbar. Es ist ja ein Spiel und um die Ecke geht es dann doch.[BR][BR]Reiseküche Level 7 perfekt, 14 Tagespreise, für mich perfektes Event."}, {"118": "Weil die Aufgabe unlösbar ist soll man dafür den Tausch Button benutzen? Das ist auch ne Logik… [BR]Persönlich würde ich aber von vornherein lösbare Aufgaben bevorzugen.[BR]Zumal es kein spezifisches Spieler oder Kapitel abhängiges Problem ist."}, {"133": "Aleanca schrieb:\t\t\tWeil die Aufgabe unlösbar ist soll man dafür den Tausch Button benutzen? Das ist auch ne Logik…\t\tZum Vergrößern anklicken....[BR]nein Pragmatismus"}, {"14": "ja, aber was macht man, wenn man zu dieser Aufgabe \"hintauscht\"?[BR]wenn man keine 75 Getränke machen will, dann wird man sich spätestens dann ärgern: dann hätte man doch lieber 75 Getränke gemacht[BR]ja, ich weiß, man kann 2x tauschen..aber die Gefahr besteht trotzdem auf dieser Aufgabe sitzenzubleiben[BR]schon deshalb tausche ich eigentlich nie, außer ich hätte genau diese Aufgabe..[BR]diese Aufgabe gehört ganz gestrichen!"}, {"243": "Aleanca schrieb:\t\t\tWeil die Aufgabe unlösbar ist soll man dafür den Tausch Button benutzen?\t\tZum Vergrößern anklicken....entschuldige die Korrektur, aber es heißt \"Täusch\" Button - nur damit keine Verwirrung entsteht. [BR]Ich habe heute auch schon eine Wochenaufgabe getäuscht."}, {"24": "Also ich weiss nicht ob ich nur der absolute Glückspilz vor dem Herrn bin, aber... Wenn es so weiter geht dann werde ich, grob überschlagen knapp zum zweiten Mal die Küche kriegen... Ich nehme kein Tablett das nicht im Schnitt maximal 13,5 Zutaten pro Stern kostet... Was mich ziemlich auf 4er mit seltenen 3ern dazwischen beschränkt. Bisher läufts gut wie gesagt. Ich bin bei Aufgabe 54 und knapp in der Goldliga hier in Khelo. [BR][BR]Natürlich sind die Preise maximal mittelprächtig, aber ich hoffe trotzdem auf die Medallie... Das Rotbart-Set hab ich noch nicht, noch was für meinen Setzkasten^^"}, {"111": "Ich hab mit ca. 2000 Währung nur 2x den Tagespreis erhalten, den ich wollte. sehr viele Truppen und ein paar von den 1x1 Dingern. Die find ich ganz nett, allerdings nicht wegen der Effekte, sondern weil die ganz gute Kultur liefern und hübsch ausschauen."}, {"126": "Ich muss jetzt auch hier mal das Feedback geben, dass ich es absolut ungünstig finde, dass es keine Warnung gibt, wenn das Goldlager zu voll ist, um Gold als Belohnung aus dem Event zu bekommen. Ich schaue bei den einzelnen Kisten nicht, was da sonst noch so drin ist und mir ist jetzt einfach die Belohnung komplett ins Leere gegangen. [BR]Entweder eine Warnung einbauen (ebenso in den Seasons!) oder einfach für die begrenzten Güter nur Segen als Belohnung geben."}, {"98": "Mein Fazit: [BR][BR]Grundsätzlich finde ich dieses Event gut. Ich mag das Merging und auch das Evo-Gebäude kann ich gut brauchen. Orks sind immer knapp. [BR][BR]Nicht toll sie die Tagespreise, da ginge wirklich Besseres, allerdings ist das gerade bei diesem Event nicht wirklich wichtig, weil man ohnehin nicht darauf spielen kann, wenn man das Evo haben will. [BR][BR]Schlecht ist die Menge an Eventwährung. Das ist hier nicht anders als auf beta: Es reicht hinten und vorne nicht. Obwohl ich kein Glück mit den Loots hatte (ich bekam nur sehr, sehr wenige), kam ich auf beta in die Silber-Liga, weit entfernt davon, das Evo voll zu haben. Silber-Liga sind die höchsten 5%.  (Ja, klar, es gab dann noch ein Artefakt als Ligenbelohnung, aber das ändert nichts an meinem Punkt). [BR][BR]Das bedeutet, nicht mal bei den 5% mit den besten Ergebnissen gibt es genug Eventwährung für das Evo. Das heißt, 95% aller Spieler schaffen es nicht, das Evo fertigzustellen. Und das ist einfach nicht in Ordnung."}, {"4": "Ich finde es sehr ungünstig, dass es nur einen Einlogbonus von 20 gibt und auch die Eventwährung pro Quest so gering ist. Dadurch wird der Bonus des Aschephönix sehr entwertet, denn es dauert einfach zu lange bzw. beim Login gehts gar nicht, dass man dann den zusatzbonus von 2 statt 1 erhält."}, {"61": "Aleanca schrieb:\t\t\tZumal es kein spezifisches Spieler oder Kapitel abhängiges Problem ist.\t\tZum Vergrößern anklicken....stimmt, man muss nur schauen, wie groß die Chance auf Aromabeute ist und dann hat man die Aufgabe in paar Minuten erledigt, egal in welchem Kapitel man ist [smilie--sprite1] [BR][BR]abgesägt und abgesägt und ist immer noch zu kurz, was mach ich falsch?"}, {"118": "ZeNSiErT schrieb:\t\t\tstimmt, man muss nur schauen, wie groß die Chance auf Aromabeute ist und dann hat man die Aufgabe in paar Minuten erledigt, egal in welchem Kapitel man ist [smilie--sprite1][BR][BR]abgesägt und abgesägt und ist immer noch zu kurz, was mach ich falsch?\t\tZum Vergrößern anklicken....Stimmt. Kennen wir ja seit Jahren so, dass man das Item mit der größten % Chance auch wirklich immer bekommt.[BR]Hat schon immer funktioniert in Elvenar. Bin nur vollkommen zu doof das richtig Rezept auszuwählen. [BR]Du hast Recht.[BR]Schönen Tag auch."}, {"54": "Ich amusier mich gerade über die Layer, die jeden Tag aufploppen ... (siehe Anlage)[BR][BR]Hier kommt der Verdacht auf, dass es pures Kalkül ist, ohne Ende Evos auf den Markt zu bringen, die Futter benötigen[BR]und dann dafür gesorgt wird, dass möglichst wenig Futter in der Aka zu erspielen ist.[BR][BR]Dann gibt es ein super Evo zu gewinnen, dass tatsächlich 1% (wow) Wahrscheinlichkeit mit sich bringt, ab und an Futter zu \"gewinnen\" ...[BR][BR]ganz toll ...[BR][BR]Meine Lösung ist einfach und eine ganz andere: ich füttere ausser dem Feuerphönix einfach keine \"Tierchen\" mehr ...[BR][BR]HdW"}]