[{"61": "Aleanca schrieb:\t\t\tDas Problem ist die Unlösbarkeit dieser Aufgabe.\t\tZum Vergrößern anklicken....Die Aufgabe ist lösbar und viele Spieler können sie lösen. Ich hab gar nicht gezählt, wie viele Aromabeute ich hatte, aber ich schätze mal über 10 bin ich bereits locker. Vielleicht \"kochst\" du zu \"teuer\" und kriegst weniger Menus für deine Eventwährung als andere und darum weniger Aromabeute? Aber:[BR][BR]Aleanca schrieb:\t\t\tStimmt. Kennen wir ja seit Jahren so, dass man das Item mit der größten % Chance auch wirklich immer bekommt.[BR]Hat schon immer funktioniert in Elvenar. Bin nur vollkommen zu doof das richtig Rezept auszuwählen.[BR]Du hast Recht.[BR]Schönen Tag auch.\t\tZum Vergrößern anklicken....[BR]Ich kenne das ja seit Jahren, dass die, die keine Probleme haben, seltsamer Weise immer die gleichen Spieler sind. Wir haben halt einfach nur über Jahre hinweg dauerhaft unverschämt viel Glück, das liegt gar nicht an unserer Spielweise.[BR]Du wirst wohl Recht haben [smilie--sprite1][BR][BR]Wünsche Dir auch einen schönen Tag mit ganz viel Aroma"}, {"167": "@ZeNSiErT - deine Aussagen bezüglich der Erreichbarkeit der Aromabeute finde ich sehr gewagt. Ich habe 2 Städte und spiele in beiden gleich bezüglich der Eventtaktik.[BR]Die größere hat tatsächlich überhaupt keine Problem mit der Aromabeute und könnte die Aufgabe locker lösen (bisher hatte ich sie nicht und habe 3 Aromabeuten für die letzte Wochenaufgabe gebunkert).[BR]Die kleinere hat genau 1 in Worten eine Aromabeute bekommen.[BR][BR]Da ist eben doch eine Menge Glück dabei.[BR][BR]Feedback zum Event generell: ich hatte bisher nie Probleme die Evos auf 10 voll zu bekommen - ohne zusätzl. Eventwährung zu kaufen. Aber diesmal wird es wohl nur zu 210 - 220 von den goldenen Sternen reichen. Das schade, ich hätte die Küche gern auch max Level gehabt, aber Level 7 gibt tatsächlich die meisten Orks. Die lächerliche 1% Futterchance - reden wir einfach nicht drüber.[BR]Ansonsten wurde bereits alles geschrieben:[BR]- zu wenig Tagesbeute / zu geringe Questbeute --> daher wird der Aschephönix nicht richtig warm[BR]- Zusammenbasteln ist sehr zeitaufwenig[BR]- Kochzutaten sind sehr glücksabhängig[BR]- auf Tagespreise zu spielen, kann frustrierend sein[BR][BR]Fazit: Da ist eben doch eine Menge Glück dabei."}, {"104": "Falbala Di schrieb:\t\t\tDas schade, ich hätte die Küche gern auch max Level gehabt, aber Level 7 gibt tatsächlich die meisten Orks.\t\tZum Vergrößern anklicken....Wie ist das gerechnet, Ork-Einheiten dazu? Die Chance aller Ork-irgendwas zusammen sinkt auf höheren Stufen sicherlich ein wenig, von 70% auf 60%, dafür aber 20% höhere Werte wenn getroffen, und die 10% Chance gehen auf Fragmente + höher, sicherlich auch nicht schlecht wenn stattdessen dran."}, {"157": "Ich möchte das Evo nicht aufstellen, sondern kucke nur nach den Tagespreisen. Sagt wohl viel über deren Qualität, dass ich noch in der Hobbyliga bin [smilie--sprite8] Vielleicht habe ich am letzten Tag für den Granatenpreis, der dann bestimmt kommen wird, ganz viel EW. [smilie--sprite1] Man soll die Hoffnung nie aufgeben[BR]Aber egal, das nächste Event kommt bestimmt."}, {"48": "Fazit:[BR]Auf die Kritik im betalauf wurde nicht eingegangen.[BR]Wozu ist der Goldesel beta eigentlich gut, außer das Inno Geld bekommt ohne wirklich Leistung erbringen zu müssenm weil sie ja immer sagen: \"Sorry, beta,keine Garantie.\""}, {"140": "die logik dieser 1x1 produktionsbooster begreife ich beim besten willen nicht. in manchen städten wirkt der bonus beim mondsteinset, dem tapsigen waschbären oder dem pilger-set in anderen dagegen nicht. der waschbär ist eingestellt auf das erste gut, bei den beiden anderen gibt es nix einzustellen, sind auch alle auf dem aktuellen level. manche evos werden gefördert - andere dagegen nicht. völlig irreführend!"}, {"61": "Falbala Di schrieb:\t\t\tDa ist eben doch eine Menge Glück dabei.\t\tZum Vergrößern anklicken....Also mal so rein theoretisch wäre es möglich, alle Menus nach und nach abzuwählen, die keine 25% Chance auf Aromabeute haben und nur diese Menus herzustellen. In der Aromabeute verstecken sich nicht nur die guten Zutaten, sondern ab und zu sogar Eventwährung. Und wenn ich das dann mit den 5% oder zuletzt 3% auf die 200 Eventwährung in den großen Kisten in anderen Events vergleiche, ist das enorm hoch und viel, was man gewinnen kann, wenn man es möchte.[BR][BR]Sorry Leute, ich bin mit den Preisen dieses mal auch nicht einverstanden. Aber an der Stelle gibt es wirklich nichts auszusetzen. So groß waren die Gewinnchancen auf zusätzliche Eventwährung noch nie.[BR][BR]Davon sprechen, dass es unmöglich ist, 3 Aromabeute zu bekommen in einer Woche, kann man wirklich nicht. Dann hat man vielleicht irgendwelche Knöpfchen gedrückt und geguckt, was passiert. aber Taktik ist das nicht gewesen."}, {"14": "gibt es 25%?[BR]ich hab da nur 10% auf 2 und 20% auf 1 Aromabeutel, die ich erfülle[BR][BR]alle darunter, wie 10% , 8 % und 2% auf 1 oder bei 5% auch 2,  mache ich nicht[BR][BR]aber ich finde trotzdem nicht, dass die Chance auf Extra-Währung groß ist, außer man berücksichtigt, dass die höherwertigen Zutaten, die aus den Beuteln kommen, auch eine Einsparung an Eventwährung ist"}, {"100": "ZeNSiErT schrieb:\t\t\tDavon sprechen, dass es unmöglich ist, 3 Aromabeute zu bekommen in einer Woche, kann man wirklich nicht. Dann hat man vielleicht irgendwelche Knöpfchen gedrückt und geguckt, was passiert. aber Taktik ist das nicht gewesen.\t\tZum Vergrößern anklicken....Man kann davon sprechen ,  das man 0 Aroma- Beute in der Woche bekommen hat  .  [BR]Man kann auch 20 Aroma- Beute  bekommen . [BR]Beides mit einer guten  oder schlechten Taktik möglich . [BR][BR]ZeNSiErT schrieb:\t\t\t, alle Menus nach und nach abzuwählen, die keine 25% Chance auf Aromabeute haben und nur diese Menus herzustellen\t\tZum Vergrößern anklicken....Ich glaube dann reichen die  Tage des Events nicht aus .  [BR]Nur auf 25  %    Aroma - Beute zu warten   , bedeutet auf das Ende vom Event   zu warten , tatenlos ."}, {"28": "schwatzwurzel schrieb:\t\t\tIch glaube dann reichen die Tage des Events nicht aus .[BR]Nur auf 25 % Aroma - Beute zu warten , bedeutet auf das Ende vom Event zu warten , tatenlos .\t\tZum Vergrößern anklicken....Habe gerade etwa 1200 Eventwährung in Mahlzeiten investiert weil ich für @Neris die 25% \"screenshoten\" wollte leider kam einfach kein 5Sterne-Kunde an Mama Juuls Reiseküchenbestelltresen und es waren auch nur 2x Aroma-Beute drin. \"Vorzeigeeffekt\" [smilie--sprite1][BR][BR]Gestern meine ich die 5 Sterne bei einem vergleichbaren Marathon in einer anderen Welt aber durchaus mehr als einmal gesehen zu haben und konnte insgesamt 10x Aroma-Beute abgestaubt. Es ist halt doch auch einfach Glückssache denke ich."}, {"61": "Neris schrieb:\t\t\tgibt es 25%?\t\tZum Vergrößern anklicken....ja [smilie--sprite1][BR][BR]schwatzwurzel schrieb:\t\t\tBeides mit einer guten oder schlechten Taktik möglich .\t\tZum Vergrößern anklicken....Genau so ist es richtig, es ist möglich, keine zu bekommen, aber es ist nicht unmöglich, welche zu gewinnen. [BR][BR]schwatzwurzel schrieb:\t\t\tNur auf 25 % Aroma - Beute zu warten , bedeutet auf das Ende vom Event zu warten , tatenlos\t\tZum Vergrößern anklicken....ok, wenn alle 30 Minuten einloggen und abwählen \"tatenlos warten\" ist, damit man die nicht annehmen muss, um neue zu bekommen, weil man ja keine Zeit hat zum Warten: [BR][BR]Neris schrieb:\t\t\talle darunter, wie 10% , 8 % und 2% auf 1 oder bei 5% auch 2, mache ich nicht\t\tZum Vergrößern anklicken....[BR]Neris schrieb:\t\t\taußer man berücksichtigt, dass die höherwertigen Zutaten, die aus den Beuteln kommen, auch eine Einsparung an Eventwährung ist\t\tZum Vergrößern anklicken....was soll es denn sonst sein? natürlich ist es zusätzliche Eventwährung [smilie--sprite1][BR][BR]Thebigunknown schrieb:\t\t\tHabe gerade etwa 1200 Eventwährung in Mahlzeiten investiert weil ich für @Neris die 25% \"screenshoten\" wollte leider kam einfach kein 5Sterne-Kunde an Mama Juuls Reiseküchenbestelltresen und es waren auch nur 2x Aroma-Beute drin. Vorzeigeeffekt [smilie--sprite1]Zum Vergrößern anklicken....sorry für doppelpost[BR][BR]die sind in der Mitte, es gibt keine 5-Sterne-Kunden, die 25% Aromabeute befinden sich in einer 2er oder 3er, kann selbst grad auch nicht mehr nachschauen [smilie--sprite1]"}, {"28": "ZeNSiErT schrieb:\t\t\tdie sind in der Mitte, es gibt keine 5-Sterne-Kunden, die 25% Aromabeute befinden sich in einer 2er oder 3er\t\tZum Vergrößern anklicken....Danke!"}, {"61": "Neris schrieb:\t\t\tgibt es 25%?[BR]ich hab da nur 10% auf 2 und 20% auf 1 Aromabeutel, die ich erfülle\t\tZum Vergrößern anklicken....oh je, glaube du hast Recht, hab jetzt auch nur die 20% beim 2er Kunden gefunden, aber ich schau auch noch mal genauer die nächsten Tage[BR][BR]Sorry"}, {"126": "Die mit 25 % Chance hab ich tatsächlich bisher in 4 Städten (2 x Live und 2 x Beta) nicht gesehen. 20 % schon ab und zu und die nehme ich dann auch, auch wenn es die sind, die viel zu oft nutzlose Runensplitter abwerfen. Leider bin ich nie in einer Runenphase, wenn gerade auch im Event der passende Tagespreis kommt."}, {"2": "...es gibt weder ein 5-Sterne-Rezept noch eine Aroma-Beute mit 25 % - und die 20 % kommen auch nur in einem einzigen Rezept vor - und da funktioniert es relativ gut - die 10 % treffen dagegen so gut wie gar nicht...so oder so wurde die Eventwährung aber mMn falsch bemessen - man bräuchte sehr sehr viel Glück, um ohne Zukauf auf 260 Sterne zu kommen...[BR][BR]Quelle: https://idavis-elvenar.com/events.html#offers-may_xxiii_"}, {"153": "Romilly schrieb:\t\t\t..die 20 % kommen auch nur in einem einzigen Rezept vor - und da funktioniert es relativ gut - die 10 % treffen dagegen so gut wie gar nicht...\t\tZum Vergrößern anklicken....[BR]Da fehlt ein Hinweis, dass es sich um deine persönliche zufällige Erfahrung handelt. Ich habe mit den 10% ziemlich viel gewonnen. Zufall halt."}, {"100": "[IMG]https://i.ibb.co/0Q1zPFX/https-de-forum-elvenar-com-index-php-attachments-1684924827439-png-36487.png[/IMG][BR]  Das ist im Moment die Liga  in Arendyll [BR]Das zeigt schon ,  das es wenig  zu gewinnen gibt . [BR]220 schritte sind notwendig   um das Evo gebäude nach dem GA auf  10  zu evolutionieren . [BR]Und das schaffen  nur wenige  . [BR]Viele werden  mit Dias   die 220  schritte erspielen , um die  1 % Futter  wahrscheinlichkeit zu bekommen .    Ich nicht ."}, {"48": "ZeNSiErT schrieb:\t\t\tSorry Leute, ich bin mit den Preisen dieses mal auch nicht einverstanden. Aber an der Stelle gibt es wirklich nichts auszusetzen. So groß waren die Gewinnchancen auf zusätzliche Eventwährung noch nie.\t\tZum Vergrößern anklicken....Das mag sein. Theoretisch.[BR]Ich hab bis auf 100 alle Eventwährung verbraucht.[BR]Ich hatte genau 4 loops obwohl ich versucht habe, dass zu basteln, was die größten chancen auf loops bot.[BR]Also ist praktisch deine Theorie bei mir widerlegt.[BR]So wenig Eventwährung gab es noch nie zu gewinnen."}, {"28": "ZeNSiErT schrieb:\t\t\toh je, glaube du hast Recht, hab jetzt auch nur die 20% beim 2er Kunden gefunden, aber ich schau auch noch mal genauer die nächsten Tage\t\tZum Vergrößern anklicken....Romilly schrieb:\t\t\tes gibt weder ein 5-Sterne-Rezept noch eine Aroma-Beute mit 25 % - und die 20 % kommen auch nur in einem einzigen Rezept vor - und da funktioniert es relativ gut\t\tZum Vergrößern anklicken....Genau das ist auch mein Eindruck, wer also auf der Jagd nach Aroma-Beute ist sollte bei den Kunden nach der spitzohrigen Elfe Ausschau halten. [smilie--sprite2] Allerdings bekommt man in diesem Fall dann zwar 20% Wahrscheinlichkeit auf Aroma-Beute, gewinnt diese dann aber, wenn es denn klappt, auch nur 1x. [BR][BR]Spoiler[IMG]https://i.ibb.co/m5bqhSL/https-de-forum-elvenar-com-index-php-attachments-1684929611773-png-36490.png[/IMG]"}, {"61": "Romilly schrieb:\t\t\tman bräuchte sehr sehr viel Glück, um ohne Zukauf auf 260 Sterne zu kommen...\t\tZum Vergrößern anklicken....das ist auch richtig, aber eben weil ja von Anfang an viel weniger gewonnen werden kann[BR][BR]hab gestern Abend nur in den stillgelegten Städten mal geschaut, was mit dem Startkapital so geht, allein dabei hatte ich wieder mehrfach Aromabeute, ohne überhaupt zu spielen"}]