[{"171": "Thebigunknown schrieb:\t\t\tGenau das ist auch mein Eindruck, wer also auf der Jagd nach Aroma-Beute ist sollte bei den Kunden nach der spitzohrigen Elfe Ausschau halten. [smilie--sprite2] Allerdings bekommt man in diesem Fall dann zwar 20% Wahrscheinlichkeit auf Aroma-Beute, gewinnt diese dann aber, wenn es denn klappt, auch nur 1x.\t\tZum Vergrößern anklicken....[BR]Ich habe heute drei Mal Aromabeute gewonnen, wollte aber Göttliche Saat. Ist Tagespreis."}, {"4": "Alidona schrieb:\t\t\tIch habe heute drei Mal Aromabeute gewonnen, wollte aber Göttliche Saat. Ist Tagespreis.\t\tZum Vergrößern anklicken....Ich freue mich für dich. [BR][BR]Es wäre aber hilfreicher, wenn du uns auch mitteilen würdest, wie viel Währung du dafür eingesetzt hast. Denn es ist unklar, ob du 5 x einen Kunden bedient hast oder 20 x einen Kunden."}, {"171": "salandrine schrieb:\t\t\tIch freue mich für dich.[BR][BR]Es wäre aber hilfreicher, wenn du uns auch mitteilen würdest, wie viel Währung du dafür eingesetzt hast. Denn es ist unklar, ob du 5 x einen Kunden bedient hast oder 20 x einen Kunden.\t\tZum Vergrößern anklicken....[BR]Oh Gott, da habe ich nicht drauf geachtet. Es war aber nicht viel, vorher hatte ich ca 300 EW, jetzt noch 98. Es war drei oder vier Mal hintereinander, die Kunden vier und drei Sterne. Ich achte da nie so drauf, hatte aber vorher keine Aromabeute und jetzt habe ich sechs. 20 Kunden waren es jedenfalls nicht. Eigentlich wollte ich gar nicht einlösen und noch sammeln, aber dann fiel mir auf, dass es Göttliche Saat gibt. Und die brauche ich momentan, also habe ich ein bisschen gekocht. [smilie--sprite1]"}, {"4": "Alidona schrieb:\t\t\tOh Gott, da habe ich nicht drauf geachtet. Es war aber nicht viel, vorher hatte ich ca 300 EW, jetzt noch 98. Es war drei oder vier Mal hintereinander, die Kunden vier und drei Sterne. Ich achte da nie so drauf, hatte aber vorher keine Aromabeute und jetzt habe ich sechs. 20 Kunden waren es jedenfalls nicht. Eigentlich wollte ich gar nicht einlösen und noch sammeln, aber dann fiel mir auf, dass es Göttliche Saat gibt. Und die brauche ich momentan, also habe ich ein bisschen gekocht. [smilie--sprite1]Zum Vergrößern anklicken....Bestens, dann warst du wirklich sehr glücklich. Ich hab bisher fast die gesamte Währung eingelöst, natürlich bei den Tagesquests. Und so insgesamt hab ich vielleicht 6 Aromabeute erhalten. Und in meinen anderen Konten sieht es nicht besser aus."}, {"171": "salandrine schrieb:\t\t\tBestens, dann warst du wirklich sehr glücklich. Ich hab bisher fast die gesamte Währung eingelöst, natürlich bei den Tagesquests. Und so insgesamt hab ich vielleicht 6 Aromabeute erhalten. Und in meinen anderen Konten sieht es nicht besser aus.\t\tZum Vergrößern anklicken....[BR]Das Event lief bei mir auch nicht zufriedenstellend, @salandrine . Geschweige denn würde ich Mama Juuls Küche voll gelevelt bekommen, aber egal. Ich hätte sie sowieso nicht aufgestellt. Habe zu wenig Platz für unnützen Schnickschnack. Glücklich bin ich mit diesem Event ganz bestimmt nicht, aber: Es gibt ein nächstes Mal. [smilie--sprite2]"}, {"134": "so  schlecht ist noch kein Event gelaufen, naja man kann eben nicht immer gewinnen...."}, {"103": "Mir hat es Spaß gemacht und ich hab noch Hoffnung und nein,[BR]ich habe nichts gekauft...[BR][BR]Durch das GA bräuchte ich auch das letzte Artefakt gar nicht unbedingt, also verstehe ich die Verstimmung[BR]nicht wirklich...[BR][BR][BR][IMG]https://i.ibb.co/R4L6LTm/https-de-forum-elvenar-com-index-php-attachments-1685209390353-png-36572.png[/IMG]"}, {"98": "littleFlex schrieb:\t\t\tDurch das GA bräuchte ich auch das letzte Artefakt gar nicht unbedingt, also verstehe ich die Verstimmung[BR]nicht wirklich...\t\tZum Vergrößern anklicken....Das ist gar nicht so schwer zu verstehen. [BR]Guck dir einfach @schwatzwurzel|s Beitrag etwas hier drüber nochmal an. Dann siehst du, dass in dieser Welt (und in den anderen sieht es nicht besser aus) nicht mal die Spieler der Gold-Liga das Evo fertig bekommen, von dem Profilbild oder einer zweiten Grundplatte ganz zu schweigen. [BR][BR]Die Gold-Liga sind das EINE Prozent mit den meisten Schritten. Das sind natürlich auch alle drin, die Währung zugekauft haben. Und die, die wirklich viel Glück hatten. Das EINE OBERSTE Prozent. Und nicht mal da reicht es. [BR][BR]Rechnet man alle Artefakte, die man als Ligenbelohnung und per GA noch bekommen kann, dazu, dann haben 95% aller Spieler keine Chance auf das fertige Evo.[BR][BR]Und da verstehst du die Verstimmung nicht?"}, {"103": "Genau, denn ich zähle das GA-Artefakt zum Event dazu.[BR]Damit wären wir nur noch bei einem \"Must have\" von 220 Punkten.[BR]Die anderen Sachen Deiner Aufzählung sind für mich nicht von Gewicht, das Portrait für Liebhaber verstehe ich noch aber die zweite Grundplatte sollte keiner problemlos ohne Dia-Kauf schaffen können.[BR][BR]Ich hoffe, Du kannst meine Meinung und mein Feedback zum Event einfach akzeptieren..."}, {"4": "littleFlex schrieb:\t\t\tGenau, denn ich zähle das GA-Artefakt zum Event dazu.[BR]Damit wären wir nur noch bei einem \"Must have\" von 220 Punkten.[BR]Die anderen Sachen Deiner Aufzählung sind für mich nicht von Gewicht, das Portrait für Liebhaber verstehe ich noch aber die zweite Grundplatte sollte keiner problemlos ohne Dia-Kauf schaffen können.[BR][BR]Ich hoffe, Du kannst meine Meinung und mein Feedback zum Event einfach akzeptieren...\t\tZum Vergrößern anklicken....Schön für dich, aber du wirst ziemlich alleine stehen mit deinem Erfolg[BR][BR]Ich hab noch 174 Mützen Rest und erst 178 Schritte. Sieht nicht gut aus für das 8. Artefakt."}, {"103": "deswegen ist es ja auch mein alleiniges Feedback"}, {"61": "Sinya ist Gold bei 260 aktuell"}, {"6": "Dann gehöre ich wohl zu den \"Glücklichen\". Weder einen Cent noch irgendwelche Dias investiert:[BR][IMG]https://i.ibb.co/NxdV7ZL/https-de-forum-elvenar-com-index-php-attachments-event-jpg-36591.jpg[/IMG][BR]Aktuell stehe ich bei 276, aufbauen werde ich das Evo aber natürlich trotzdem nicht."}, {"35": "Aroma-Beute:[BR]Ich fände es ja gut, wenn es irgendeine Erklärung gibt, was es ist. also, wenn ein neues Spielelement eingefügt wird dann wäre es schön, wenn man in etwa ahnt, was man erwarten darf.[BR]Im Wiki ist es ja eher vage gehalten und auch das Mouseover sagt nichts dazu.[BR]Wiki:[BR][IMG]https://i.ibb.co/K0ynXhs/https-de-forum-elvenar-com-index-php-attachments-1685307395116-png-36593.png[/IMG][BR][BR]Mouseover:[BR][IMG]https://i.ibb.co/JjDN41b/https-de-forum-elvenar-com-index-php-attachments-1685307438202-png-36594.png[/IMG]"}, {"14": "ja, sehr informativ  [smilie--sprite11] [BR][BR]es kommt zu gewissen Wahrscheinlichkeiten Kochmützen wie bessere Kochzutaten dabei raus, sollte man wirklich sichtbar machen![BR][BR]hier steht auch nichts:[BR][BR][IMG]https://i.ibb.co/cXY5n06/https-de-forum-elvenar-com-index-php-attachments-screenshot-761-png-36595.png[/IMG]"}, {"126": "Das GA ist halt nicht das Event und es sollte doch für mehr als nur einen geringen Prozentsatz der Spieler möglich sein, dass Evo voll auszubauen mit regelmäßigem Spielen ohne ein GA machen zu müssen. Meine Meinung. Und das Event ist einfach glücksabhängiger als andere durch verschiedene Faktoren. [BR]Gefällt mir einfach nicht."}, {"12": "hobbitrose schrieb:\t\t\tAroma-Beute:[BR]Ich fände es ja gut, wenn es irgendeine Erklärung gibt, was es ist. also, wenn ein neues Spielelement eingefügt wird dann wäre es schön, wenn man in etwa ahnt, was man erwarten darf\t\tZum Vergrößern anklicken....Man bekommt dafür 50 Kochmützen oder eine 5.Stufe oder 6.Stufe Mahlzeit.[BR][BR]Ich hab jetzt alle Kochmützen ausgegeben und 220 Schritt gerade noch geschafft (also weit entfernt von 260), und bin trotzdem noch in der Silber Liga - das heißt ja einiges...[BR]Hab ca. 7 von den 50% Herzchen ergattert, aber das Evo werd ich wohl nicht aufstellen, oder allenfalls wenn ich Ork-Mangel hätte (was angesichts meiner 8 Mio. eher unwahrscheinlich ist)."}, {"216": "Guten Morgen,[BR][BR]- eine Erklärung der Aromabeute findet man hier ( Englisch ! ), dieses Element gab es auch schon im Aug 2022[BR][BR]https://idavis-elvenar.com/events.html#loot-may_xxiii_[BR][BR]- 220 Schritte werden für die Silberliga nicht reichen, auf Beta stand diese einen Tag vor Ende bei 221, gebraucht wurden dann 241 [BR]  Ich kam auf 234 Schritte, da Ich über wenig Dias verfüge und für ein GM-Abenteuer einfach keine Zeit habe bleibt das Evogebäude mit           [BR]  8 Artefakten im Inventar"}, {"99": "Schon beim ersten Mal kein Freund von dieser Art Event gewesen, beim zweiten Mal empfinde ich es als noch nerviger.[BR][BR]Der Glücksfaktor im Vergleich zu anderen Events noch höher und das Zusammenschieben dauert mir einfach zu lange. Das ganze ist für mich eher ein Zeitfresser.[BR]Von den kaum zu bekommenden Tagespreisen mal ganz zu schweigen.[BR][BR]Nein, immer noch nicht meins."}, {"103": "Ich finde die Beschreibung aus dem Wiki durchaus ausreichend und nicht vage. Es wird genau ausgesagt,[BR]wie man die Beute bekommt und was sie geben kann.[BR][BR]Beim Mouseover der Beute selbst gehe ich mit, beim Mouseover des leeren Platzes sehe ich keinen Bedarf.[BR]Die Beute sollte aber noch mit in die Spielerklärung \"?\" aufgenommen werden, da sie dort gar nicht zu finden ist-"}]