[{"248": "Mir gefällt diese Art von Event überhaupt nicht. Man kann nicht selbst entscheiden (z.B. welchen Weg man nimmt) - muss nehmen was an kriegt .... und das ist meiner Meinung nach nicht viel bis gar nichts. Für seine erspielten Hauben bekommt man oft nicht mal eine Bestellung zusammen. Und das ist schade. [smilie--sprite3]"}, {"9": "littleFlex schrieb:\t\t\tIch hoffe, Du kannst meine Meinung und mein Feedback zum Event einfach akzeptieren...\t\tZum Vergrößern anklicken....Ich schon, aber dann akzeptiere du auch andere und werfe ihnen nicht vor, sie sollen sich dies und das dann an den Monitor kleben.  [smilie--sprite2]"}, {"103": "Entschuldige bitte, wo habe ich in meinem Feedback eine solche Aussage getätigt?"}, {"9": "littleFlex schrieb:\t\t\tEntschuldige bitte, wo habe ich in meinem Feedback eine solche Aussage getätigt?\t\tZum Vergrößern anklicken....Schaust du mal im Dampf ablassen und noch in einem anderem Thread.  [smilie--sprite2] Ich habe nichts davon, dir \"Blödsinn\" zu erzählen."}, {"11": "Weniger Events, und daführ bessere Preise wäre mal was gutes, und vorhandene Eventgebäude weiter ausbaubar machen.[BR][BR]Wass sollen die ganzen Bären , und gummiadler und hexen im lager??"}, {"135": "Bei mir sind es sogar nur 7 Artefakte.[BR][BR]\"Wer das Event durchspielt soll auch die Möglichkeit haben, das Evo komplett zu bekommen.\" (Inno)"}, {"103": "Nachtrag zu meinem Feedback:[BR][BR]Ich habe heute das 9. Artefakt problemlos erspielt, ohne Zukauf von Währung."}, {"135": "littleFlex schrieb:\t\t\tNachtrag zu meinem Feedback:[BR][BR]Ich habe heute das 9. Artefakt problemlos erspielt, ohne Zukauf von Währung.\t\tZum Vergrößern anklicken....[BR]Womit ja bestätigt ist, dass Innos RNG zu viel Einfluss hat."}, {"103": "oder dass das Event spielbar ist mit vollem Evo, je nach Sicht des Betrachters..."}, {"135": "littleFlex schrieb:\t\t\toder dass das Event spielbar ist mit vollem Evo, je nach Sicht des Betrachters...\t\tZum Vergrößern anklicken....[BR]Wenn du dir die Ligen anschaust, könnte dir bewusst werden, für welch geringen Anteil der Spielenden das zutrifft. Setzen, mangelhaft.[BR][BR]Edit: Du hast ein Talent, entäuschten Spielern noch Salz in die Wunde zu streuen. Machst du das eigentlich absichtlich?"}, {"103": "ich gebe mein Feedback zu meinem Erfolg in meinem Event.[BR]wenn Dich das stört, tut es mir leid.[BR]ich werde mein Feedback nicht an irgendeine Gruppe anderer Spieler anpassen, nur um ihnen zu gefallen.[BR][BR]ich weiß nicht, wie andere Spieler das Event gespielt haben, deshalb werte ich das auch nicht.[BR]Die Bekanntgabe meines persönlichen Ergebnisses hat auch nichts mit \"Salz in die Wunde streuen\" zu tun,[BR]sondern ist einfach nur ehrlich und unbeinflusst vom gern gesehenen Mainstream der Forengesellschaft."}, {"135": "littleFlex schrieb:\t\t\tich weiß nicht, wie andere Spieler das Event gespielt haben, deshalb werte ich das auch nich\t\tZum Vergrößern anklicken....[BR]Und ich hab echt gedacht, dass du das Feedback hier durchliest."}, {"103": "wenn Du mich weiter persönlich angreifen willst, dann bitte per PN."}, {"4": "@littleFlex bitte nicht deinen Erfolg verallgemeinern. Denn er ist nur durch einen Zufall und eine Menge an Glück erspielbar. Glückwunsch für dich, aber keinesweg Normalfall. [BR][BR]Ich habe gerade über 2.300 Mützen ausgegeben, habe kurz vor Ende gerade mal 2 Loot bekommen, die mir dann auch noch genau die 5er Teile gaben, die ich nicht brauche, um meinen letzten Gast auch bedienen zu können.[BR][BR]Insgesamt bin ich rund 145 Schritte weiter gekommen, gerade so in der Silberliga, dass ich morgen noch rausfliegen werde.[BR][BR]Kein Zukauf, aber aufgehoben und natürlich Phönix gefüttert, der dieses Mal sein Futter fast nicht wert war."}, {"103": "Was wollt Ihr alle von mir?[BR][BR]Dies hier ist ein Feedback-Thread, in dem Spieler Ihr persönliches Empfinden zum Event niederschreiben sollen.[BR]Das habe ich getan.[BR][BR]Ich verallgemeinere nichts, ich gebe kein Feedback für eine Gruppe oder den ganzen Server ab."}, {"104": "Als Moderator sollte man besser eine besondere Sorgfalt pflegen, niemals eine eigene derartige Meldung zu einem Event, schon gar nicht im Widerspruch zu einer Menge Kritiker (die es ja meist sind die sich melden). Bei klaren Fakten vielleicht, aber nicht bei so schwankenden Erfolg in einem Event.[BR]Oder wenn dann vorsichtig formulieren 'stimmt, ist schwer, aber sieh mal an, ich hatte besonderes Glück'.[BR][BR]Kann sonst immer gelesen werden als 'Feedback der User zurückgewesen, bei mir gehts, was wollt ihr alle [in der Tat]?'.[BR]Gar noch 'problemlos' verwendet, mit Implikation 'Die Probleme die ihr habt sind gar nicht real'.[BR]Ja, wieder viel reininterpretiert, aber so geht Mensch-sein.[BR]Einfach Lage vermeiden."}, {"103": "Nein, ich lasse mir von Dir nicht mein Feedback als Spieler verbieten, Punkt !"}, {"104": "Ich beschreibe nur die Konsequenzen und Wirkung, die Wahl liegt bei dir. [smilie--sprite2] Tipp fürs Richtige freilich dabei."}, {"103": "Vielen Dank für die Mühe, für die Zukunft aber bitte merken:[BR][BR]Ich habe kein Interesse an irgendwelchen Tipps von Dir"}, {"194": "Täusche ich mich jetzt oder wäre Spieler-Mod-Meinung nicht in blauer Farbe? So ist es Mod-Meinung? Ich kenne mich da nicht mehr aus.[BR][BR]Jedenfalls habe ich das Event nicht gespielt, so entspannt ist Elvenar selten. Diese Art Event werde ich auch nicht mehr spielen. Dazu fällt für mich auch der Nebel und der Sandkasten weg, so komme ich vielleicht auf eine für mich annehmbare Anzahl von Events."}]