[{"1": "Liebe Menschen und Elfen,[BR][BR]wir sind gespannt auf euer Feedback zum Kapitel 20 - Die Macht der Musik, welches am 01.09.2022 starten wird.[BR][BR]Viele Grüße[BR]Euer Elvenar Team"}, {"8": "Endlich! [smilie--sprite1][BR]...ich fand ja das Amunikapitel war viel zu kurz... So krieg ich jetzt endlich meine Chance, das richtig auszukosten.[BR][BR]Die Rüka sind so wunderschön... wie Centerparks... Freu mich drauf!"}, {"184": "Freue mich, dass die Geschichte weitererzählt wird.[BR][BR]Zeit spielt für mich als Elf nur eine untergeordnete Rolle [smilie--sprite2]"}, {"2": "...oh schön - also brauch ich doch nicht so lange auf meine Stunden-WPs verzichten - ich bunkere nämlich seit Freitag Abend Leisten-WPs - sind schon 707 zusammen gekommen..."}, {"6": "Romilly schrieb:\t\t\tsind schon 707 zusammen gekommen...\t\tZum Vergrößern anklicken....Da hab ich 4 mehr. [smilie--sprite1][BR]Plus >1 Mio je erwecktem Gut plus >500k je erleuchtetem Gut plus ausreichend Portalsegen.[BR]Freitag Vormittag kommen nochmal >500 WP aus dem Turnier hinzu.[BR]Am WE gibts also genug zu tun. [smilie--sprite8]"}, {"2": "ustoni schrieb:\t\t\tDa hab ich 4 mehr. [smilie--sprite1][BR]Plus >1 Mio je erwecktem Gut plus >500k je erleuchtetem Gut plus ausreichend Portalsegen.[BR]Freitag Vormittag kommen nochmal >500 WP aus dem Turnier hinzu.[BR]Am WE gibts also genug zu tun. [smilie--sprite8]Zum Vergrößern anklicken.......von den Gütern her kann ich in etwa mithalten und an den Portalsegen mangelt es sicherlich auch nicht - aber jetzt muss ich wohl doch mal damit anfangen, meine Stadt umzuplanen - gibt es dazu vielleicht schon Vorschläge?..."}, {"6": "Hier wichtige Infos von @AngelOfDead.[BR]Zusatzinfos hier .[BR]Dazu die Questliste.[BR][BR]Nachtrag:[BR]Wichtig als Produktionsgebäude sind:[BR]Trommelbauer (4x4), verbunden mit Gut 1 Manufakturen[BR]Geigenbauer (5x3), verbunden mit Gut 2 Manufakturen[BR]Flötenbauer (3x5), verbunden mit Gut 3 Manufakturen[BR][BR]Vom Stadtlayout her würde es sich also anbieten, die Gut 3 Manufakturen nach deren Ausbau in einer senkrechten Reihe so zu platzieren, dass man die Flötenbauer direkt anflanschen kann.[BR]Wenn es der Platz erlaubt, Gut 2 Manufakturen in einer waagerechten Reihe für die Geigenbauer platzieren.[BR]Die Trommelbauer werden dann mit Level 1 Manufakturen Gut 1 verbunden.[BR][BR]Die Ensembles werden für den Ausbau des Portals benötigt. Produziert man anschließend die Stäbe (Notenblätter) per Portalsegen werden die Ensembles wohl nicht mehr benötigt."}, {"2": "ustoni schrieb:\t\t\tNachtrag:[BR]Wichtig als Produktionsgebäude sind:[BR]Trommelbauer (4x4), verbunden mit Gut 1 Manufakturen[BR]Geigenbauer (5x3), verbunden mit Gut 2 Manufakturen[BR]Flötenbauer (3x5), verbunden mit Gut 3 Manufakturen\t\tZum Vergrößern anklicken.......zählt da nur das eigene Grund-Bonusgut oder kann ich auch mit erweckten bzw. erleuchteten Manus verbinden? (hab nämlich jeweils nur 2 je Sorte)"}, {"6": "Romilly schrieb:\t\t\t...zählt da nur das eigene Grund-Bonusgut oder kann ich auch mit erweckten bzw. erleuchteten Manus verbinden?\t\tZum Vergrößern anklicken....Bin ich überfragt. Ich fang ja auch erst am Donnerstag an. Laut Beschreibung im Wiki müssten aber auch die anderen gehen. Es werden ja nicht die Bonusmanufakturen verlangt, sondern nur Gut 1, Gut 2 und Gut 3 allgemein."}, {"186": "Ich habe Gerüchteweise gehört, dass Stufe 1-Manufakturen nicht gehen, sondern die Manus ein gewisses Mindestlevel benötigen. Stimmt dies?[BR][BR]Falls ja:[BR]Ich würde das begrüßen, da es mit Level 1-Manus meiner Meinung nach keine so große Herausforderung darstellt und ich schon gerne etwas gefordert sein möchte.  [smilie--sprite6] [BR][BR]Falls nein:[BR]Schade, dann ist man wahrscheinlich doch wieder recht schnell mit dem Kapitel durch."}, {"6": "Laut Beschreibung im Wiki gibt es keine Levelbegrenzung.[BR]Entspricht auch den Aussagen im Beta-Forum."}, {"186": "Schade.[BR][BR]Danke für die Info."}, {"9": "Romilly schrieb:\t\t\t...zählt da nur das eigene Grund-Bonusgut oder kann ich auch mit erweckten bzw. erleuchteten Manus verbinden? (hab nämlich jeweils nur 2 je Sorte)\t\tZum Vergrößern anklicken....Geht auch mit erweckten und erleuchteten.[BR][IMG]https://i.ibb.co/Ch0x43G/https-de-forum-elvenar-com-index-php-attachments-1661804129713-png-30959.png[/IMG][BR][BR][IMG]https://i.ibb.co/NmvdJBw/https-de-forum-elvenar-com-index-php-attachments-1661806238802-png-30961.png[/IMG][BR][BR]Melios schrieb:\t\t\tIch habe Gerüchteweise gehört, dass Stufe 1-Manufakturen nicht gehen, sondern die Manus ein gewisses Mindestlevel benötigen. Stimmt dies?[BR][BR]Falls ja:[BR]Ich würde das begrüßen, da es mit Level 1-Manus meiner Meinung nach keine so große Herausforderung darstellt und ich schon gerne etwas gefordert sein möchte. [smilie--sprite6][BR][BR]Falls nein:[BR]Schade, dann ist man wahrscheinlich doch wieder recht schnell mit dem Kapitel durch.\t\tZum Vergrößern anklicken....Geht so wie im \"Neues vom Beta\" Thread beschrieben auch mit Level 1 Manus bringt aber so gut wie gar nichts @Melios, denn da du die Erweckten- sowie Erleuchteten Güter-Manus eh brauchst, nutzt man diese für den Anbau von Flöten- Trommel- oder Geigenbauer. An diese bekomme ich auch viel mehr, als an eine Level 1 Manu. [smilie--sprite2] Warum eine Level 1 Manu hinpflanzen, wenn voll ausgebaute da sind die ich eh brauche? Macht kein Sinn und wäre Platzverschwendung. [BR][BR]Edit:[BR]Baust du die Manus G1-G3 gleich aus @Romilly, kannst du jeweils 6 Flöten- Trommel- oder Geigenbauer ansetzen. Mindestens 4 empfehle ich, denn 12 werden insgesamt laut Storyline verlangt.[BR][BR]Geigen- Trommel- und Flötenensemble empfehle ich 5, dass geht ziemlich rasch und diese werden direkt mit dem Hain der Harmonie (Portal) verbunden. Die Anordnung ist hierbei egal.[BR][BR][IMG]https://i.ibb.co/56KXzYf/https-de-forum-elvenar-com-index-php-attachments-1661805642450-png-30960.png[/IMG]"}, {"128": "Ist schon jemand fertig?[BR][BR]Tolles Feedback für ein Kapitel, welches erst in 3 Tagen startet...   [smilie--sprite6]"}, {"9": "alf2021 schrieb:\t\t\tIst schon jemand fertig?\t\tZum Vergrößern anklicken....[smilie--sprite8] [smilie--sprite8] [smilie--sprite8] .. .. .. war dein Bester heute?[BR]\"Normale\" Spielzeit im Bezug auf das Minimale laut Storyline + spielen der Storyline ca. 6-8 Monate[BR]\"Extreme\" Spielzeit (Schnell) wenn man mindestens  8-10 Flöten- Trommel- und Geigenbauer baut[BR]+ 8-10 Geigen- Trommel- und Flötenensemble und ausreichend Portalsegen sowie das auslassen der Storyline ca. 3-5 Monate[BR]Nun darfst selber ein bisschen rechnen wie schnell oder langsam du sein möchtest. [smilie--sprite6][BR][BR]alf2021 schrieb:\t\t\tTolles Feedback für ein Kapitel, welches erst in 3 Tagen startet... [smilie--sprite6]Zum Vergrößern anklicken....Toll das Elvenar einen Beta-Server hat nicht wahr. [smilie--sprite12]"}, {"2": "...die Ausbildungsgeschwindigkeit macht wieder einen ordentlichen Schub bei Kaserne & Co., wie ich gesehen habe - steigt um jeweils 170 - der letzte Anstieg lag bei 140....da muss ich mal Bollwerk und Pilze noch weiter ausbauen..."}, {"119": "auf beta werden die ersten grade fertig mit Kap 20.[BR]die haben dann so 10 Tage gebraucht etwa  [smilie--sprite1]"}, {"9": "Primus71 schrieb:\t\t\tauf beta werden die ersten grade fertig mit Kap 20.[BR]die haben dann so 10 Tage gebraucht etwa [smilie--sprite1]Zum Vergrößern anklicken....Wer soll das z.B. sein? In 10 Tagen? Da hat jemand gut investiert oder die ganze Stadt voll gebaut.[BR]Also die meisten Top Spieler haben noch nicht einmal angefangen und viele haben lediglich den Hain der Harmonie auf 1 stehen. [BR]Über Stufe 1 sehe ich nur 3 Spieler."}, {"24": "AngelOfDead schrieb:\t\t\tWer soll das z.B. sein? In 10 Tagen? Da hat jemand gut investiert oder die ganze Stadt voll gebaut.[BR]Also die meisten Top Spieler haben noch nicht einmal angefangen und viele haben lediglich den Hain der Harmonie auf 1 stehen.[BR]Über Stufe 1 sehe ich nur 3 Spieler.\t\tZum Vergrößern anklicken....Na das klingt dann ja nach einer intensiven Betatestphase für dieses Kapitel..."}, {"9": "Feytala1986 schrieb:\t\t\tNa das klingt dann ja nach einer intensiven Betatestphase für dieses Kapitel...\t\tZum Vergrößern anklicken....Ist es auch und eigentl. auf \"normalen Wege\" in 10 Tagen nicht schaffbar, wenn dann müsste einer einen Goldesel in der Stadt stehen haben, inkl. einen Wunschbrunnen, der Gold zu Diamanten macht, denn allein die Forschung lässt das nicht zu (mit logischen Rechnen), dass man in 10 Tagen durch ist. So müsste man Unmengen Dias investieren. Selbst unter der Berücksichtigung, dass auch auf dem Beta erst 2 Turniere stattgefunden haben seit beginn der Gast-Rasse, ist das ohne enorme Dias nicht möglich. Es gibt sicherlich auch Schlümpfe die so eine Art Zauber- bzw. Diamantenmine haben, jedoch dürften das nicht viel sein und wenn ich auf einen Testserver investiere, dann ist das immer mit ganz großen Risiken seitens des Spieler zu begutachten. Das wäre so, als investiere ich in ein Projekt welches noch in den Sternen steht und nie erscheinen wird. ^^ Ich weiß aber das sehr viele aus dem Hause INNO direkt auf dem Beta-Server spielen/testen. Ja bei diesen Städten ist das definitiv möglich, denn die Testen das ja, wobei sie hierfür eigentl. spezielle Testserver haben, dennoch gibt es sie auch auf dem Beta. ^^ Man kann sie auch beobachten, aber diese zähle und nehme ich nicht als Maßstab, bzw. Messlatte. Mit ganz Hoher Geschwindigkeit schafft es ein Spieler ohne großartig zu investieren (vielleicht Turm- und Dschinn-Dias etc. und jede Menge Zeit-Booster) in 2 Monaten und selbst das ist schon sehr Grenzwertig.  [smilie--sprite2]"}]