[{"1": "ErestorX schrieb:\t\t\tSorry, dein \"regulärer Spieler\", der in Kapitel 20 noch immer für alle drei Arten Erweckter mindestens je eine Manu stehen hat und nutzt, scheint mir in der Praxis nur selten anzutreffen zu sein!\t\tZum Vergrößern anklicken....Woher nimmst du dieses \"Wissen\"? Ich denke eher, dass die meisten Spieler, die bereits so weit sind, eben doch noch diese Manufakturen stehen haben. Denn der Standardspieler ist nicht der, der jedes Quadrätechen Platz durch x Formeln jagt um zu schauen, was nun wie und wann besser ist. Und wenn man sich mal so die Städte der großen Spieler anschaut, dann sieht man, dass diese meist ganz regulär spielen. Ausnahmen wie du, bestätigen die Regel."}, {"2": "ErestorX schrieb:\t\t\tSorry, dein \"regulärer Spieler\", der in Kapitel 20 noch immer für alle drei Arten Erweckter mindestens je eine Manu stehen hat und nutzt, scheint mir in der Praxis nur selten anzutreffen zu sein!\t\tZum Vergrößern anklicken.......so war das ja auch nicht gemeint, aber als Kapitel 20 Spieler solltest du alle Manufakturen-Arten zumindest besitzen, um dann eben normale, erweckte und erleuchtete Güter herstellen zu können (die kann man ja zwischenzeitlich auch ins Inventar räumen, wenn man sie nicht andauernd braucht) - und dann kann man ja auch 1x eine Produktion durchführen, die KEIN Bonusgut ergibt und verliert dann halt 1x ca. 10.000-20.000 Güter (im Vergleich zum Bonusgut) - ist das jetzt wirklich soooooo schlimm, wenn man Millionen an Gütern im Lager hat?..."}, {"94": "AngelOfDead schrieb:\t\t\tHier würde ich gern noch etwas einwerfen.[BR]Nämlich es ist eine durchgehende Produktion meines Bonus-Gutes, die durch das verlangen eines nicht Bonus-Gutes herzustellen, unterbrochen wird! (Völlig egal ob Standard , erweckte oder erleuchtete Güter - jedes dieser Güterklassen beherbergt jeweils 3 mal dein BG)[BR]Des weiteren spielt es sehr wohl eine Rolle, ob sich im späteren Spielverlauf etwas ändert oder eben nicht, denn ich spiele diese Storylines in der Regel gern und verfolge/lese diese eigentlich seit es sie gibt. Ergo von beginn an und genau da gibt es Widersprüche.[BR][BR]Warum stehst dann du (Forschung) und fragst gar nach ob es Sinn macht weiter zu machen etc., wenn doch alles später so wie so keine Rolle mehr spielt?[BR]Dann akzeptiere du das doch auch einfach und gut, aus, fertig. Denn für mich und andere spielt es sehr wohl eine Rolle im Zusammenhang der Storylines und des ganzen Spiel geschehen. [smilie--sprite2][BR]Nicht heute so - Morgen so und nun bin ich raus [smilie--sprite7]Zum Vergrößern anklicken....\"In Kapitel 20 spielt das keine Rolle mehr\" bezog sich auf die Tipp Texte im Wiki oder im Spiel selbst, da man Kapitel 20 Spieler/innen nicht mehr erklären muss was ihre Bonusgüter sind.[BR][BR]Ich akzeptiere, was auch immer ich akzeptieren soll, mir ist es völlig wurscht wer wie spielt. Warum ich stehen geblieben bin, hat auf jeden Fall nix mit den Gütern oder Tipp Texten zutun, wir sind uns sicher einig, dass das produzieren eines nicht Bonus Gut für 3 oder 9 Stunden nicht das selbe ist wie sich mal eben von Kapitel 17 bis 20 durch zu forschen [smilie--sprite1]"}, {"189": "Tacheless schrieb:\t\t\tWoher nimmst du dieses \"Wissen\"?\t\tZum Vergrößern anklicken....Ich hatte kurz in ca. ein halbes Dutzend Städte der Spieler meiner GM geschaut, von denen ich weiß, dass sie in Kapitel 20 aktiv sind, um zu überprüfen, ob meine Annahme, dass kaum jemand überflüssige Manus aufstellt, zutrifft. Da war nur einer mit einer passenden Manu dabei. [BR][BR]Tacheless schrieb:\t\t\tUnd wenn man sich mal so die Städte der großen Spieler anschaut, dann sieht man, dass diese meist ganz regulär spielen.\t\tZum Vergrößern anklicken....[BR]Richtig, sonst wären sie auch nicht so groß! Allerdings bekommen diese regulären (Ranglisten-) Spieler wie bereits erläutert mehr Erweckte aus ihren Rüstis als ich. Hab in meiner Welt die Top 8 kontrolliert, diese Aussage trifft auf alle zu![BR][BR]Aber eigentlich hab ich die Quests lang abgeschrieben, das Thema ist mir nicht wichtig, ich wollte nur hilfreiches Feedback geben. Wenn du weiter darauf beharren möchtest, das für mich Offensichtliche zu leugnen - ich werde nicht weiter versuchen, dich eines Besseren zu belehren!"}, {"8": "[smilie--sprite8] Oh Mann.[BR][BR]Mir gehts ganz genauso... Immer wenn ich irgendwelche Manufakturenproduktionen abliefern soll, schaut mich meine Hummel ganz böse an und summt aggressiv![BR][BR]Allerdings versteh ich auch die Entwickler[BR]\"Ihr wollt die 200 Dias fürs Beenden der questline?\"[BR]\"Dann leidet auch dafür!\" [smilie--sprite2][BR][BR]es ist im Prinzip leicht zu lösen... Aber kann ein Zeitfresser sein... und scheint unlogisch?! Volles Verständnis![BR][BR]Auf jeden Fall bedanke ich mich bei @AngelOfDead und @ErestorX fürs Klarstellen.[BR]Nun weiß ich, dass ich wenigstens eine der Manus besser in der Stadt lassen sollte... Unter Protest!!!! [smilie--sprite7]"}, {"9": "Natürlich ist das nicht sooooooooo schlimm, doch erstens handelt es sich um erleuchtete Güter und da habe ich keine Millionen im Lager (schön wenn du die hast) und zweitens, da es sich um 9 Std. Prodis handelt und ich meist meine (weil nur eine) erleuchteten Güter verzaubert habe, nervt es eben. Denn es sind dann weit über 40k die ich verliere. Beim Kaufmann kann ich damit 5 Mal handeln (dann sind die sicher). ^^ Aber nun haben wir auch alle deine Meinung gehört und gut.[BR][BR]Jammin schrieb:\t\t\t\"In Kapitel 20 spielt das keine Rolle mehr\" bezog sich auf die Tipp Texte im Wiki oder im Spiel selbst, da man Kapitel 20 Spieler/innen nicht mehr erklären muss was ihre Bonusgüter sind.\t\tZum Vergrößern anklicken....Dachte ich auch Mal, bis ich so oft gelesen habe, \"was muss ich nun bauen\". ^^[BR][BR]Jammin schrieb:\t\t\tIch akzeptiere, was auch immer ich akzeptieren soll, mir ist es völlig wurscht wer wie spielt. Warum ich stehen geblieben bin, hat auf jeden Fall nix mit den Gütern oder Tipp Texten zutun, wir sind uns sicher einig, dass das produzieren eines nicht Bonus Gut für 3 oder 9 Stunden nicht das selbe ist wie sich mal eben von Kapitel 17 bis 20 durch zu forschen [smilie--sprite1]Zum Vergrößern anklicken....Na das denke ich doch.  [smilie--sprite2] Darum ja die Nachfrage. ^^[BR][BR]gergerw schrieb:\t\t\tAuf jeden Fall bedanke ich mich bei @AngelOfDead und @ErestorX fürs Klarstellen.[BR]Nun weiß ich, dass ich wenigstens eine der Manus besser in der Stadt lassen sollte... Unter Protest!!!! [smilie--sprite7]Zum Vergrößern anklicken....Ne ne das ist nur jammern oder als was das auch immer abgehakt wird, soll mir aber auch wurscht sein, ist nur komisch, dass man dies von mehreren Spielern in anderen Foren ebenso liest. Scheint also nicht ganz ohne zu sein und selbstverständlich wirft das Fragen auf.[BR]Aber so lange andere dann was zu schmunzeln haben ist doch alles gut, denn Lachen ist Gesund. [smilie--sprite2]"}, {"60": "Um das Thema mal von den Nicht-Boni-Produktionen weg zu lotsen, stelle ich mal eine (vielleicht dumme) Frage. Wenn die Portalos \"Takte\" liefern, dann braucht der Hain vorerst nichts produzieren, richtig? Oder sollte man dennoch Takte über den Hain produzieren, weil das irgendwas anderes besser macht? Ich habe das weiter oben nicht ganz verstanden. [BR]Ich bin auf eure Erfahrungen gespannt, wie ihr die Quest mit den zusätzlichen Trommel-Ensembles regelt, wenn man schon 18 (je 6) stehen hat. Ich für meinen Teil spiele sehr gern die Questreihe und das bis zum bitteren Ende, was ich auch bisher immer geschafft habe. [smilie--sprite2][BR]Laut der geposteten Questline braucht man ja nur je 5 Ensembles... nun muss ich neu planen, welch Überraschung doch immer wieder auftaucht. [smilie--sprite8]"}, {"2": "Kamajo schrieb:\t\t\tWenn die Portalos \"Takte\" liefern, dann braucht der Hain vorerst nichts produzieren, richtig? Oder sollte man dennoch Takte über den Hain produzieren, weil das irgendwas anderes besser macht? Ich habe das weiter oben nicht ganz verstanden.\t\tZum Vergrößern anklicken.......richtig - ich hab bisher noch nichts im Hain selbst produziert und forsche gerade am Ausbau des Hains (danach kann ich dort ja die Lieder produzieren)..."}, {"60": "Vielen Dank @Romilly [smilie--sprite1][BR]Ich war so blind, dass ich übersah, dass die Portalos mal wieder sinnhaft eingesetzt werden können. Nach den letzten Kapiteln, habe ich das gar nicht zu hoffen gewagt. [smilie--sprite8]"}, {"155": "Oh je - sinnfreie Quests in dem Kapitel - das macht dann inzwischen 20 Kapitel mit sinnfreien Quests, wenn ich richtig gezählt habe. [smilie--sprite7][BR][BR]Ich brauche zwar noch eine guuuuute Weile dorthin, aber schonmal gut zu wissen, dass ich mich mal wieder nicht um die Questreihe kümmern brauche.^^"}, {"12": "Kamajo schrieb:\t\t\tIch bin auf eure Erfahrungen gespannt, wie ihr die Quest mit den zusätzlichen Trommel-Ensembles regelt\t\tZum Vergrößern anklicken....Man weiß ja, daß manchmal Übersetzungsfehler vorkommen. Hat schon jemand Erfahrung, daß es alles Trommel-Ensembles sein müssen, oder vielleicht irgendwelche Ensembles?"}, {"2": "...zumindest kann ich bestätigen, daß man bei dieser Quest...[BR][IMG]https://i.ibb.co/drm0pHc/https-de-forum-elvenar-com-index-php-attachments-bb-png-31216.png[/IMG]....einen Mindest-Kultur-Bonus von 150 % erreichen muss - die Quest gilt somit auch bei einem höheren Bonus als erfüllt..."}, {"9": "Romilly schrieb:\t\t\t.einen Mindest-Kultur-Bonus von 150 % erreichen muss - die Quest gilt somit auch bei einem höheren Bonus als erfüllt...\t\tZum Vergrößern anklicken....Bei mir waren es 235% die benötigt wurden auf Stufe 3 ^^"}, {"57": "Quest 62: Bilde weitere Trommelensembles scheint falsch zu sein, habe nur 1 zeigt aber 3 an. Meinen die einfach Ensembles schätz ich?"}, {"2": "AngelOfDead schrieb:\t\t\tBei mir waren es 235% die benötigt wurden auf Stufe 3 ^^\t\tZum Vergrößern anklicken.......Scherzkeks - natürlich ohne den Bonus der magischen Mitgift (ich sagte doch schon, daß es um die Sonne geht)- sonst wären es bei mir auch mehr gewesen....der Punkt ist, daß man keine Wolken vor die strahlende Sonne scheuchen muß (also Kultur reduzieren), um die Quest zu erfüllen - solche Aufgaben gibt es nämlich auch in den ganz normalen Quests..."}, {"54": "Ich dachte, es wurde nun fast ein Jahr gebraucht, um das neue Kapitel zu creiren, also kommt nun was ganz besonderes ...[BR][BR]Leider wurde ich bitter enttäuscht - ist der selbe Ablauf wie immer und die neuen Items sehen leider allesamt langweilig aus - dachte ansich, dass es nach den furchtbaren Brutstätten wieder etwas \"hübscher\" wird, leider eher das Gegenteil ist der Fall und ein anderer \"Spielwitz\" ist leider auch nicht zu erkennen - schade :-([BR][BR]HdW"}, {"21": "Wer läßt sich eigentlich irgendwann mal was einfallen um die ständige Schieflage im Markt in den Griff zu bekommen ??[BR][BR] "}, {"88": "Einfach den Spielern verbieten ihre Kaufleute mit Zeitboostern zu boosten, denn nur so kann ich mir die 457 Seiten Gesuche erklären, Das verschiebt den Markt, Inno kann da nix zu.[BR][BR]Die Leute die Mineralien anzubieten haben, brauchen ihre Kaufleute damit ja nicht zu beschäftigen da sie einfach oben abschöpfen können."}, {"8": "Indianaking schrieb:\t\t\tWer läßt sich eigentlich irgendwann mal was einfallen um die ständige Schieflage im Markt in den Griff zu bekommen ??\t\tZum Vergrößern anklicken....[BR]Das könnten die Spieler selbst! [BR]Wenn bei euch die Urweltmineralien so knapp sind, dann könnte man Leute mit diesem Bonusgut becircen, doch ne Manu extra zu stellen?[BR]Zumindest in meinem Team würde ich das versuchen [smilie--sprite2][BR][BR]Auch könnte man dafür ihren Geistertempel mit Runen und WP pampern, denn das notwendige Unurium ist ja jetzt nicht so in Hülle und Fülle da...[BR](Bis zur PushingSperre ist mittlerweile echt viel Luft!)[BR][BR]...Mein Eindruck bisher:[BR]Dieser erleuchtete Gütermarkt läuft viel besser als ich dachte... Man kriegt alles so ziemlich sofort ran... Braucht auch nur geringe Mengen, sodass man den Händler gar nicht so häufig bedienen muss![BR]...ich hab oft 200k Barren aber nur 100k der Anderen... weil ich die nicht so schnell gehandelt kriegt... Aber egal! wenn man mal 10k oder 20k von dem Zeug braucht, isses viel!?[BR][BR]Und wenn man doch mal große Gütermengen bewegen muss, kann man sich für eine Zeit verabreden und dann einfach gegenseitig kurzschließen. Ich hab schon mal in kurzer Zeit 200k Alraunen bewegt... da hat jeder von den Handelnden eingestellt... angenommen...eingestellt...angenommen... jeweils 3 mal 2,2k... sehr nervig! Aber möglich![BR][BR]Als ich von diesem umständlichen Schwarzmarkthändlern erfuhr hatte ich ne viel negativere Meinung als eigtl. not tut. Mittlerweile klauen sie nicht mal mehr RückNBH...[BR]Wer da echt krasse Probleme hat???[BR]Fragt den Support, ob sie euch nach Kheelonaar umziehen lassen [smilie--sprite2][BR]Hier läufts echt gut!"}, {"2": "Indianaking schrieb:\t\t\tWer läßt sich eigentlich irgendwann mal was einfallen um die ständige Schieflage im Markt in den Griff zu bekommen ??[BR][BR]Anhang 31222 ansehen Anhang 31223 ansehenZum Vergrößern anklicken.......naja - wenn du mich nicht anschreibst, dann kriegt meine Mineralien halt wer anderes  [smilie--sprite2][BR][BR]@gergerw - für eine weitere Manu hab ich nicht genug Unurium - aber für solche Fälle gibt es den Sturmphönix..."}]