[{"57": "und wie erklärst dir das es 0 kinetische Kugeln gibt und man 6 Stunden warten darf auf eine Lieferung weil sich keiner findet der dir hilft. Das ist wohl eine Schieflage von Inno verursacht."}, {"2": "....winke winke - ich hab Mineralien, Flugpulver und kinetische Kugeln (in Felyndral) - aber auch Mitspieler, die mich fragen, ob ich mit ihnen tausche....(ich muss aber auch selbst kucken, was ich als nächstes brauche)...[BR][BR]...böse böse INNO-Leute - verbieten einfach den Spielern mit Bonus Elixier bis in Kapitel 20 vorzurücken...."}, {"8": "Romilly schrieb:\t\t\t@gergerw - für eine weitere Manu hab ich nicht genug Unurium - aber für solche Fälle gibt es den Sturmphönix...\t\tZum Vergrößern anklicken....HiHi kein Problem, ich frag erstmal @Cailin [smilie--sprite2][BR][BR]Doch Danke dir![BR][BR]P.S.: Am Olymp würde ich mir das nicht trauen... Bei Futter hört die Freundschaft auf! [smilie--sprite8]"}, {"2": "...kleiner Tipp - kuckt doch mal in den Markt, wer die Kugeln (oder Würze oder Granulat) im Kreuzhandel gegen Mineralien, Barren oder Alraunen tauscht und bittet diesen Spieler zuerst mit euch die Kuglen etc. gegen euer Gut9 zu tauschen und dann halt das \"mindere\" Gut im Kreuzhandel einzustellen (das kann da ja dann versauern)..."}, {"21": "Romilly schrieb:\t\t\t...kleiner Tipp - kuckt doch mal in den Markt, wer die Kugeln (oder Würze oder Granulat) im Kreuzhandel gegen Mineralien, Barren oder Alraunen tauscht und bittet diesen Spieler zuerst mit euch die Kuglen etc. gegen euer Gut9 zu tauschen und dann halt das \"mindere\" Gut im Kreuzhandel einzustellen (das kann da ja dann versauern)...\t\tZum Vergrößern anklicken....[BR]Oh Mann, wir sind doch nicht auf der Nudelsuppe dahergeschwommen[smilie--sprite4] das wissen wir doch alles als weltweite Top 3 Gilde mit massenhaft langjährigen und erfahrenen Spielern. Und btw- vlt sollte man sich vorher informieren welche Welt es betrifft - W3auf jeden Fall nicht...."}, {"2": "Indianaking schrieb:\t\t\tOh Mann, wir sind doch nicht auf der Nudelsuppe dahergeschwommen[smilie--sprite4] das wissen wir doch alles als weltweite Top 3 Gilde mit massenhaft langjährigen und erfahrenen Spielern. Und btw- vlt sollte man sich vorher informieren welche Welt es betrifft - W3auf jeden Fall nicht....\t\tZum Vergrößern anklicken.......und warum habt ihr dann Probleme?...ihr habt 19 Spieler im Kapitel 20..."}, {"155": "Bei den erleuchteten Gütern sollte der Markt doch eigentlich eher Schieflagen ausgleichen - die Güter die es zu wenig gibt, entstehen aus leerer Luft (halt mit Wartezeit). Wenn es also dennoch eine gewaltige Schieflage gibt, dann scheinen die Spieler sehr ungleichmäßig verteilt."}, {"9": "Questor Thews schrieb:\t\t\tEinfach den Spielern verbieten ihre Kaufleute mit Zeitboostern zu boosten, denn nur so kann ich mir die 457 Seiten Gesuche erklären, Das verschiebt den Markt, Inno kann da nix zu.[BR][BR]Die Leute die Mineralien anzubieten haben, brauchen ihre Kaufleute damit ja nicht zu beschäftigen da sie einfach oben abschöpfen können.\t\tZum Vergrößern anklicken....Interessanter Ansatz, nur hast du dann auch die Courage und verbietest dies auch in deinen eigenen oder euren 3 GMs.[BR]Nur mal so, stelle ich XXXX Angebote ein die dann aber auch genommen werden, so verschwinden sie - Richtig? So weit so gut.[BR]Doch wenn ich den Kaufmann mit Dias oder Zeitbooster beschleunige, sodass ich ihn schnell wieder habe, dann bleiben die Angebote dennoch.[BR]Wenn man dann deinen Satz hier liest, dann fragt man sich, denn genau das letztere geschah auch bei euch. Bis zu 12 Seiten ein/e Spieler/in![BR]Nun kommst du mit verbieten, zumal hier Inno auch etwas verdient?[BR][BR]Mir ist durchaus bewusst das es nervt und auch das über 450 Seiten ein Albtraum sind, doch man fegt immer zuerst vor der eigenen Haustür![BR][BR]Edit:[BR]Man müsste vieles im Spiel komplett abändern, denn einiges ist doch tatsächlich noch nicht ausgereift oder funktioniert so einfach nicht, denn es ist das 3 Kapitel indem die \"enorme\" Schieflage zu erkennen ist. Selbst ein fünfjähriges Kind sieht und erkennt das, aber ein Kind sagt sich nach dem dritten Mal dann auch ......\" pfffff..... das ist mir zu blöd und dann warte ich eben oder ich reg mich gar nicht mehr erst darüber auf\".[BR]Nun gab es eine Pause zwischen den GR, die enorm lang war, sodass viele eben \"viel\" ansammeln konnten und dann möchtest du die Zeits beim Kaufmann verbieten. Ich denke, jeder darf, kann und hat da so seine eigene Meinung und mMn ist das definitiv keine Lösung![BR][BR]gergerw schrieb:\t\t\t...Mein Eindruck bisher:[BR]Dieser erleuchtete Gütermarkt läuft viel besser als ich dachte... Man kriegt alles so ziemlich sofort ran... Braucht auch nur geringe Mengen, sodass man den Händler gar nicht so häufig bedienen muss![BR]...ich hab oft 200k Barren aber nur 100k der Anderen... weil ich die nicht so schnell gehandelt kriegt... Aber egal! wenn man mal 10k oder 20k von dem Zeug braucht, isses viel!?\t\tZum Vergrößern anklicken....Komischer Eindruck, denn zum einem reden wir von Gut T9 und zum anderen sind 200k gar nichts, wenn du mal ein paar Beiträge zurück gehst und dir die netten Bildchen ansiehst.  ;-)[BR]370k ein Gast-Rassen-Gebäude und dieses GR-Gebäude sollte man 6 Mal bauen, die Rede ist also von 2.220.000 und spielst du die Storyline, dann darfst du nochmals dasselbe draufpacken, also die handelst du nicht Mal eben so und tralala ........ und genau deshalb nutzten einige Dias oder Zeitbooster, was aber in der Tat nervt. ^^[BR][BR]Edit:[BR]Du kannst dir so oder so, keine Millionen ins Lager knallen, denn erstens, scheiterst du wahrscheinlich spätestens bei 3 Gebäuden an dem verbrauchten Unurium[BR]und zweitens, zerfällt der ganze \"Mist\" ja auch über Nacht, sodass du dich beeilen musst, denn um so mehr du hast, um so mehr zerfällt dann auch. Ein Teufelskreis, aber ja, so paar Milliönchen macht man ganz nebenbei .... ne ne is klar und ich bin der Kaiser von Schlag mich Tot."}, {"34": "Die Ensemble sind nach einem Hainausbau wirklich verbraucht und gelten nicht mehr für den nächsten Hainausbau?"}, {"9": "SidKane schrieb:\t\t\tDie Ensemble sind nach einem Hainausbau wirklich verbraucht und gelten nicht mehr für den nächsten Hainausbau?\t\tZum Vergrößern anklicken....Verbraucht nicht ganz, sie geben ja weiterhin den % Bonus für die Herstellungen im Hain aber für einen weiteren Ausbau zählen sie nicht mehr, da du  die Melodie, Musikalische Begleitung oder Rhythmus, denn dir ebenfalls die Ensemble geben für den Ausbau verbraucht hast.[BR]Ist wie mit dem Prestige bei den Amunis."}, {"2": "SidKane schrieb:\t\t\tDie Ensemble sind nach einem Hainausbau wirklich verbraucht und gelten nicht mehr für den nächsten Hainausbau?\t\tZum Vergrößern anklicken.......nein - sie sind nicht \"verbraucht\", sondern \"in Gebrauch\" - du musst sie stehen lassen, um weiter ausbauen zu können - es werden für den nächsten Ausbau jeweils 2 verlangt - es müssen aber jeweils 3 stehen..."}, {"1": "LuxuriantSilver schrieb:\t\t\tund wie erklärst dir das es 0 kinetische Kugeln gibt und man 6 Stunden warten darf auf eine Lieferung weil sich keiner findet der dir hilft. Das ist wohl eine Schieflage von Inno verursacht.\t\tZum Vergrößern anklicken....Könnte vielleicht auch daran liegen, dass das Kapitel noch nicht ganz so alt ist und viele Spieler auch erst mal da hin kommen müssen, um ihre Manufaktur(en) auszubauen und über den Händler handeln zu können. [smilie--sprite2] [BR][BR]Ich bin jetzt auch erst so weit, dass ich das produzieren und handeln kann, also seit heute Nachmittag. Rennt ja nicht jeder durch das Kapitel. [smilie--sprite2] Mit der Zeit werden es immer mehr Spieler werden und der Markt sich wieder ein wenig entspannen."}, {"141": "Romilly schrieb:\t\t\t...nein - sie sind nicht \"verbraucht\", sondern \"in Gebrauch\" - du musst sie stehen lassen, um weiter ausbauen zu können - es werden für den nächsten Ausbau jeweils 2 verlangt - es müssen aber jeweils 3 stehen...\t\tZum Vergrößern anklicken....[BR]noch einmal eine Frage zu dem Thema \"Ensembles\" (obwohl ich noch nicht so weit bin, aber da besteht bei uns generell noch Unsicherheit):[BR][BR]Im Betaforum schrieb Syre Arca, Forum-Moderatorin: [BR]https://beta.forum.elvenar.com/index.php?threads/chapter-20-the-power-of-music.17890/page-6[BR]Post#119[BR]\"Should you teleport or sell these used Ensembles, you will need to build/place them back into your town to upgrade your Harmony Grove further.\"[BR]Dann kann die gebrauchten Ensembles einfach teleportieren, und wenn man sie zu weiterem Ausbau des Hains braucht, wieder aus dem Inventar holen, und sie zählen dann trotzdem. Kann das jemand bestätigen?"}, {"2": "Fritzilein schrieb:\t\t\tnoch einmal eine Frage zu dem Thema \"Ensembles\" (obwohl ich noch nicht so weit bin, aber da besteht bei uns generell noch Unsicherheit):[BR][BR]Im Betaforum schrieb Syre Arca, Forum-Moderatorin:[BR]https://beta.forum.elvenar.com/index.php?threads/chapter-20-the-power-of-music.17890/page-6[BR]Post#119[BR]\"Should you teleport or sell these used Ensembles, you will need to build/place them back into your town to upgrade your Harmony Grove further.\"[BR]Dann kann die gebrauchten Ensembles einfach teleportieren, und wenn man sie zu weiterem Ausbau des Hains braucht, wieder aus dem Inventar holen, und sie zählen dann trotzdem. Kann das jemand bestätigen?\t\tZum Vergrößern anklicken.......ich kann mal testen, wie sich das auswirkt - hab aber erst die erste Garnitur - im Moment hab ich folgende Anzeige...[BR][IMG]https://i.ibb.co/WH83zqb/https-de-forum-elvenar-com-index-php-attachments-fl-te-png-31260.png[/IMG][BR][BR][BR]...sollte funktionieren - wenn ich das Flötenensemble teleportiere, hab ich Folgendes...[BR][BR][IMG]https://i.ibb.co/hg85fLw/https-de-forum-elvenar-com-index-php-attachments-fl-te2-png-31261.png[/IMG] ...und wenn ich es wieder aufstelle, hab ich wieder die ursprüngliche Anzeige..."}, {"141": "Romilly schrieb:\t\t\t..ich kann mal testen, wie sich das auswirkt - hab aber erst die erste Garnitur - im Moment hab ich folgende Anzeige...\t\tZum Vergrößern anklicken........[BR]Cooler Scheiß - danke für das Ausprobieren, hast was gut bei mir [smilie--sprite8]"}, {"189": "Fritzilein schrieb:\t\t\tDann kann die gebrauchten Ensembles einfach teleportieren, und wenn man sie zu weiterem Ausbau des Hains braucht, wieder aus dem Inventar holen, und sie zählen dann trotzdem. Kann das jemand bestätigen?\t\tZum Vergrößern anklicken....[BR]Die Ensembles müssen nur in dem Moment in der Stadt stehen, in dem du den Portalausbau startest."}, {"141": "Das hatte ich gehofft, aber da gab es so viele verschiedene Interpretationsweisen bei uns das es sich keiner getraut hat es zu probieren [smilie--sprite1]"}, {"6": "Hab den Hain auf Stufe 3 gebracht und die Ensembles anschließend eingelagert. Nach Abschluss von K20 bringen die nochmal je 740 Fragmente. Allein stehender Hain auf Stufe 3 zeigt dann dies an:[BR][IMG]https://i.ibb.co/qgzMCNR/https-de-forum-elvenar-com-index-php-attachments-hain-1-jpg-31263.jpg[/IMG][BR]Ein weiterer Ausbau ist durch den Wirbel der Aufbewahrung sinnlos:[BR][IMG]https://i.ibb.co/NgqQXjK/https-de-forum-elvenar-com-index-php-attachments-hain-2-jpg-31264.jpg[/IMG][BR]Die maximal erforderliche Anzahl Takte beträgt je 7500 bei den beiden letzten Forschungsfeldern. Erhöhung der Portalproduktion bringt mir nichts, da ich die Takte ohnehin über Portalsegen erzeuge.[BR]Einziger Vorteil von Stufe 4 wäre ein geringerer Verbrauch an Portalsegen. Da ich aber mit über 11000% gestartet bin, lohnt das den Mehraufwand nicht. Nach Abschluss von Kapitel 20 werde ich wohl immer noch über 6000% übrig haben.[BR]Die Questreihe interessiert mich auch nicht, einige der Aufgaben sind ohnehin völlig sinnlos - nur für die eine oder andere Quest die halbe Stadt einzulagern halte ich für ziemlichen Blödsinn."}, {"11": "wo mache ich denn die Heiße Wanne von Aelrindel??[BR][BR][BR]ps . Warum habt ihr Romilly immer noch nicht bei euch aufgenommen, die weiß doch alles??[BR][BR]Danke hat sich erledigt, meine Holzmunu macht die."}, {"2": "Schnalle 04 schrieb:\t\t\two mache ich denn die Heiße Wanne von Aelrindel??[BR][BR][BR]ps . Warum habt ihr Romilly immer noch nicht bei euch aufgenommen, die weiß doch alles??\t\tZum Vergrößern anklicken.......tja - ich weiß es - aber dir verrat ich es nicht  [smilie--sprite2]"}]