[{"2": "..also als böser Magier hat man echt einen vollen Terminplan ^^...[BR][IMG]https://i.ibb.co/GQtpz0X/https-de-forum-elvenar-com-index-php-attachments-magier-png-31287.png[/IMG][BR][BR]...als nächstes kommt die erste Quest, die \"Trommelensemble\" verlangt - wohlgemerkt hab ich bisher nur 1 (und die anderen beiden) - mal kucken, wie das gezählt wird, wenn ich ein weiteres (anderes) baue...[BR][BR][IMG]https://i.ibb.co/kKWypQK/https-de-forum-elvenar-com-index-php-attachments-cj-png-31288.png[/IMG]"}, {"61": "FEEDBACK[BR][BR]Liebe Entwickler[BR][BR]Dann möchte ich heute mal mein Vorab-Feedback zum neuen Kapitel abgeben, auch wenn ich bisher nur die Aussicht aus Kapitel 19 genießen kann [smilie--sprite1][BR][BR]Zuerst einmal GLÜCKWUNSCH zum Kapitel 20 - Jubiläum! Ich finde, Elvenar ist mit dem neuen Kapitel endlich \"fertig\" geworden. Alle Manufakturen haben endlich ihr eigenes Bonusgut bekommen und ihren Platz in den Städten. Darauf habe ich lange gewartet. Auch alle anderen Spielelemente sind indessen super abgestimmt und passen gut zusammen. Das Spiel ist sehr User-freundlich geworden, viel sinnlose Klickerei ist verschwunden und viele neue Spielinhalte wie Turm, Turnier, Abenteuer, Handwerk, Gemeinschafts-Vortschritt und unser neues Nachrichten-System runden die 20 Forschungskapitel ab, geben immer etwas zu tun, unterstützen sich gegenseitig und Gemeinschaften und Nachbarschaft, Handel, Antike Wunder und Wettbewerbe sorgen für viel Spaß mit Mitspielern und für ein echtes Gemeinschaftsgefühl. Auch wenn sich immer gerne und viel über alles und jeden beschwert wird, ist das Spiel für viele von uns zu einem wichtigen Teil der Freizeitgestaltung geworden. Dafür, und dafür, dass wir dieses tolle Spiel nach über 7 Jahren und nun 20 Forschungskapiteln immer noch kostenlos spielen dürfen, ein riesengroßes DANKE SCHÖN INNO-GAMES!!!![BR][BR]Nun ist aber auch irgendwo eine neue Ära in der Luft. Was man mit Gütern, Truppen und Events tun kann, ist doch schon recht ausgereizt. Ich bin gespannt, was man sich nun einfallen lässt, um das \"fertige\" Spiel weiter zu entwickeln. Ich freu mich drauf und würde mir wünschen, dass die Entwickler bissel mutig sind, neue Sachen auszuprobieren. Könnte mir zum Beispiel vorstellen, dass die Individualisierung unserer Städte in Zukunft eine größere Rolle spielen könnte. [smilie--sprite1] [BR][BR]Und noch eine Bitte an der Stelle, dass die neuen Spieler nicht von Anfang an Turm und Turnier spielen können oder allgemein nicht sofort am Gemeinschaftsleben so teilnehmen können, wie die Spieler in höheren Forschungskapiteln das können, finde ich nicht gut. Gerade weil die Forschung von Kapitel 1 bis zum Kapitel 20 einem \"roten Faden\" folgt und alles logisch aufeinander aufbaut, sollten Spieler am Anfang nicht erst blind in irgend eine falsche Richtung geschickt werden. Nur die allerwenigsten kommen ganz allein in Kapitel 20 an. Das ist Teamarbeit und die sollte sofort vom ersten Tag bei Elvenar eine ganz wichtige und richtungsgebende Rolle spielen.[BR][BR]Viele Grüße, Zensiert"}, {"6": "Romilly schrieb:\t\t\t...als nächstes kommt die erste Quest, die \"Trommelensemble\" verlangt -\t\tZum Vergrößern anklicken....In meinem Questgeber steht seit einigen Tagen dieser Unsinn:[BR][IMG]https://i.ibb.co/nngYrkW/https-de-forum-elvenar-com-index-php-attachments-k20-quest-jpg-31289.jpg[/IMG][BR]Diese Aufgabe wird mich jetzt bis zum Beginn von Kapitel 21 begleiten - hab nur noch den Hain stehen, und der wird Dienstag abend auch gelöscht. [smilie--sprite8][BR]6 Trommelensemble hab ich aber zu keinem Zeitpunkt in meiner Stadt gehabt. Also entweder zählen alle Ensembles und ich hab die Aufgabe einfach übersehen, oder es gibt unterschiedliche Aufgaben."}, {"103": "eine Diskussion, bzw. Fehlermeldung zu diesen Ensemble-Quests gibt es bereits"}, {"2": "ustoni schrieb:\t\t\tIn meinem Questgeber steht seit einigen Tagen dieser Unsinn:[BR]Anhang 31289 ansehen[BR]Diese Aufgabe wird mich jetzt bis zum Beginn von Kapitel 21 begleiten - hab nur noch den Hain stehen, und der wird Dienstag abend auch gelöscht. [smilie--sprite8][BR]6 Trommelensemble hab ich aber zu keinem Zeitpunkt in meiner Stadt gehabt. Also entweder zählen alle Ensembles und ich hab die Aufgabe einfach übersehen, oder es gibt unterschiedliche Aufgaben.\t\tZum Vergrößern anklicken.......hattest du welche stehen, als du die Quest bekommen hattest? Vom Text her ist es ja genau das Gleiche wie bei der anderen Aufgabe - nur der Zähler ist anders...[BR][BR]@littleFlex - nur, daß da behauptet wird, daß es keinen Fehler bei den Quests gibt - was ich nicht so ganz glauben kann...[BR][BR]...zumindest ist es ein Fehler, wenn in meiner Quest steht, ich solle 6 weitere Trommelensemble bauen, wenn bereits gebaute Ensemble ebenfalls zählen - egal welche..."}, {"103": "Wir können nur widergeben, was wir als Antwort von Inno erhalten haben..."}, {"2": "littleFlex schrieb:\t\t\tWir können nur widergeben, was wir als Antwort von Inno erhalten haben...\t\tZum Vergrößern anklicken.......du siehst aber hoffentlich selbst, daß da irgendwas so nicht stimmen kann...[BR][BR]...ich bau jetzt ein Flötenensemble - das ist in 10 Minuten fertig und wenn das zählt, dann stimmt der Text definitiv nicht..."}, {"103": "selbst wenn es so ist, hilft diese Erkenntnis nicht weiter^^"}, {"19": "Mir gefällt das Kapitel sehr gut ![BR][BR]Portal hat immer Priorität - damit die Gastrassenproduktion \"brummt\" [smilie--sprite1][BR]Deshalb habe ich im FB einige Punkte mal nicht gemacht[BR][BR]Hain der Harmonie auf Stufe 2 [BR][BR]Sobald ich die restlichen Kinetik-Kugeln habe, kann ich das fehlende Ensemble stellen [BR]um den Hain der Harmonie auf Stufe 3 zu bauen [BR][BR]Kinetik-Kugeln sind - in Felyndral - etwas schwer zu bekommen [BR]Aber - mit 3 Kaufleuten - kommen die, auch wenn die Angebote nicht angenommen werden,[BR]mit der Zeit rein [smilie--sprite1] [BR]Also heute oder spätestens morgen habe ich die zusammen gesammelt [smilie--sprite6]"}, {"6": "Romilly schrieb:\t\t\t...hattest du welche stehen, als du die Quest bekommen hattest? Vom Text her ist es ja genau das Gleiche wie bei der anderen Aufgabe - nur der Zähler ist anders...\t\tZum Vergrößern anklicken....Wie gesagt, ich hab auf die Texte nicht so genau geachtet. Einige Aufgaben haben sich von selbst erledigt, da hab ich einfach nur schnell eingesammelt.[BR]Ich hatte aber bis vor kurzem je 3 Ensembles stehen, also insgesamt 9. Wahrscheinlich war die Aufgabe damit erledigt. Trommelensembles habe ich zu keinem Zeitpunkt mehr als 3 gehabt. Hain auf Stufe 3 ist bei mir ja völlig ausreichend."}, {"2": "...das Flötenensemble hat gezählt...[BR][BR][IMG]https://i.ibb.co/fSHgVBb/https-de-forum-elvenar-com-index-php-attachments-ensemble-png-31290.png[/IMG][BR][BR]@King Luckybaby - ich kuck gleich mal..."}, {"57": "es zählen alle Arten von Ensembles"}, {"141": "littleFlex schrieb:\t\t\teine Diskussion, bzw. Fehlermeldung zu diesen Ensemble-Quests gibt es bereits\t\tZum Vergrößern anklicken....[BR]hab ich verpasst - wo finde ich die?"}, {"2": "Fritzilein schrieb:\t\t\thab ich verpasst - wo finde ich die?\t\tZum Vergrößern anklicken.......die wurde archiviert bzw. in der Fehlermeldung ging es eigentlich um was anderes... https://de.forum.elvenar.com/index.php?threads/ensembles-aus-kap-20-werden-falsch-berechnet.25561/"}, {"141": "Romilly schrieb:\t\t\t...die wurde archiviert bzw. in der Fehlermeldung ging es eigentlich um was anderes... https://de.forum.elvenar.com/index.php?threads/ensembles-aus-kap-20-werden-falsch-berechnet.25561/Zum Vergrößern anklicken....ach ja - kommt mir entfernt bekannt vor... also keine 12 Trommelensembles, richtig?"}, {"2": "Fritzilein schrieb:\t\t\tach ja - kommt mir entfernt bekannt vor... also keine 12 Trommelensembles, richtig?\t\tZum Vergrößern anklicken.......das werd ich bald sehen ^^ - brauch aber erst einmal Platz - die Riesenräder laufen noch 5 Tage - die Handelsstationen noch fast 12.."}, {"92": "Man braucht ein set (Trommel, Geigen und Flöten Ensemble) um den Hain von 1 auf 2 Updaten[BR]zwei weitere (3 insgesamt) Sets fürs Update von 2 auf 3 [BR]und 3 weitere (insgesamt 6) von Hain 3 auf Hain 4[BR]wenn man versucht die alten „verbrauchten“ Ensembles zu löschen bekommt man ein Minus 1 angezeigt, also ist das auch getestet.^^"}, {"141": "Drastor schrieb:\t\t\tMan braucht ein set (Trommel, Geigen und Flöten Ensemble) um den Hain von 1 auf 2 Updaten[BR]zwei weitere (3 insgesamt) Sets fürs Update von 2 auf 3[BR]und 3 weitere (insgesamt 6) von Hain 3 auf Hain 4[BR]wenn man versucht die alten „verbrauchten“ Ensembles zu löschen bekommt man ein Minus 1 angezeigt, also ist das auch getestet.^^\t\tZum Vergrößern anklicken....[BR]ich kann mir auch nix merken..."}, {"12": "Nur als Ergänzung:[BR]Wenn ein Ensemble irgendwo abseits steht, gibt es zwar keinen Bonus für Hain-Produktionen, aber es zählt trotzdem bezüglich Hain-Ausbau."}, {"21": "Ayla Ayla schrieb:\t\t\tNur als Ergänzung:[BR]Wenn ein Ensemble irgendwo abseits steht, gibt es zwar keinen Bonus für Hain-Produktionen, aber es zählt trotzdem bezüglich Hain-Ausbau.\t\tZum Vergrößern anklicken....Erstes Kapitel das ich mit einem Portal lv 3 beendet habe - mit Wirbel auf 14 . Keine 18 Ensembles, keine irreführenden Beschreibungen mehr, jetzt ist erstmal Pause und Ruhe."}]