[{"4": "Das klingt doch danach, dass alles nicht so heiß gegessen wird, wie es gekocht wird.[BR][BR]Schade, dass da so viele Fehler bzw. Irreführungen und Missverständnisse in den Quests sind.[BR][BR]Ich hab erst mal nur das Portal gebaut, Kristall ist ausgebaut und beschaffe mir die erleuchteten Güter für die anderen Forschungen. Da ich noch gut 2 Monate meine restlichen Wunschbrunnen und Dschinns stehen habe, wird es noch dauern, bis ich dann die Flöten, Trommeln usw. überhaupt bauen kann."}, {"8": "AngelOfDead schrieb:\t\t\t370k ein Gast-Rassen-Gebäude und dieses GR-Gebäude sollte man 6 Mal bauen ........ und genau deshalb nutzten einige Dias oder Zeitbooster, was aber in der Tat nervt. ^^\t\tZum Vergrößern anklicken....Haut mich noch nicht um [smilie--sprite2][BR][BR]Bis dahin legt meine Manu noch um 24% zu... Der Baum der Erleuchtung kommt sowieso in die Stadt! ...ich geh mal davon aus, dass ich auch ohne Handelszentrum recht zügig 530k Erl. Gut1 im Lager haben werde...[BR]Da fällt mir ein, das Seepferdchen schmeißt ja auch bald erleuchtete Güter...[BR]Sagen wir 600k im Lager ?[BR]Mit bissl tricksen und Kreuzhandel von gewachstem Kloopapier sollte ich sogar 2 Ensemble gleichzeitig bauen können [smilie--sprite1][BR]Vermutlich werde ich aber an den üblichen Verdächtigen zu knuppern haben? Siedlungsgüter! Die scheinen mir eher die Bremse zu sein.[BR][BR]Auch bau ich die 6 ja hintereinander und nicht gleichzeitig... und ich werde wohl keinen Rekord machen wie @Primus71 ...[BR]Wenn ich das Kap in 4-6 Monaten durch hab, bin ich zufrieden.[BR][BR]Und sorry: Für die Minimengen Güter wäre ich niemals und unter gar keinen Umständen bereit Diamanten oder Zeitbooster zu zahlen![BR][BR]Lieber schau ich dabei zu, wie ich Woche für Woche von den Scoutwunder-Besitzern im Turnier fertig gemacht werde [smilie--sprite6]"}, {"2": "....ein Trommelensemble kostet ja nicht NUR 380.000 Gut7 - dazu kommen noch 54.000 Orks, 127.000 Saat und 110 Trommeln... ein Trommelbauer schafft bei mir ganze 6 Trommeln mit voll ausgebauter Hummel in 3 Stunden (Portal auf 2), hat aber im Bau ebenfalls 127.000 Saat verschlungen - soooooo locker flockig geht das nicht (und die Trommeln etc. brauchst du außerdem auch für Forschungen und um Lieder zu produzieren)...."}, {"8": "Viel schwieriger gestaltet sich für mich die Frage: Wirbel ja oder nein?[BR][BR]Er scheint ja schon sehr zu helfen beim Abkürzen... Allerdings kommt so schnell kein neues Kapitel... bis dahin isser nutzlos..."}, {"2": "gergerw schrieb:\t\t\tViel schwieriger gestaltet sich für mich die Frage: Wirbel ja oder nein?[BR][BR]Er scheint ja schon sehr zu helfen beim Abkürzen... Allerdings kommt so schnell kein neues Kapitel... bis dahin isser nutzlos...\t\tZum Vergrößern anklicken.......wie viele Portalsegen hast du noch?- da gehen ne Menge weg....(mit Wirbel weniger)..."}, {"8": "so 4000%... ich hoffe ja möglichst ohne Portalos durchzukommen... [BR]Die beruhigen unheimlich als Fraggiequelle [smilie--sprite2]"}, {"2": "gergerw schrieb:\t\t\tso 4000%... ich hoffe ja möglichst ohne Portalos durchzukommen...[BR]Die beruhigen unheimlich als Fraggiequelle [smilie--sprite2]Zum Vergrößern anklicken....naja - wenn du die Takte im Portal herstellen willst, dann kannst du natürlich auch ohne spielen - mein Portal macht auf Stufe 2 in 2 Stunden mit Hummel und 4 Ensemble 184 Takte, d.h. du musst 19 Produktionen durchführen, um 1x das Lager zu füllen (Kapazität 3465) - das kostet dann jeweils 81k Mana und 1320 Unurium pro Produktion - selbstverständlich kannst du aber keine Lieder produzieren, wenn das Portal mit Takten belegt ist..."}, {"8": "Du machst mir Mut![BR][BR]Ich glaub, ich spiel wirklich komplett ohne Portalos! [BR]Hab mir damit damals das geniale Amunikapitel verhagelt... war viel zu schnell vorbei.[BR][BR]Diesmal will ichs komplett auskosten! [smilie--sprite1]"}, {"2": "gergerw schrieb:\t\t\tDu machst mir Mut![BR][BR]Ich glaub, ich spiel wirklich komplett ohne Portalos![BR]Hab mir damit damals das geniale Amunikapitel verhagelt... war viel zu schnell vorbei.[BR][BR]Diesmal will ichs komplett auskosten! [smilie--sprite1]Zum Vergrößern anklicken.......kannst ja dann berichten, wie lange du standhaft geblieben bist ^^ - ich benutze übrigens mehrmals täglich Portalsegen  [smilie--sprite7] ..."}, {"6": "Grob überschlagen wären das mindestens 80 Mio Mana - wahrscheinlich eher mehr. Da hab ich dann doch lieber so um die 4500% Portalsegen verbraucht.[BR]Und noch was: die mit Abstand beste Fragmente-Quelle sind immer noch die ganzen unsinnigen Artefakte.[BR][BR]@gergerw: wünsche dir dann für die nächsten 6 Monate Takteproduktion viel Spaß. [smilie--sprite2]"}, {"8": "[smilie--sprite8] [smilie--sprite8] [smilie--sprite8][BR]Du, ich fang ja grad erst Kap.19 an...[BR][BR]Wollte mich nur schon mal schlau machen, worauf ich demnächst achten muss...[BR][BR]HiHi mache 2.2 Mio Mana pro Tag ...Tendenz stark steigend! Dank deiner Tips [smilie--sprite2][BR][IMG]https://i.ibb.co/T1L238n/https-de-forum-elvenar-com-index-php-attachments-manastand-jpg-31300.jpg[/IMG][BR]Demnächst der Hexendoktor... Yeah! [smilie--sprite1][BR][BR]ustoni schrieb:\t\t\tUnd noch was: die mit Abstand beste Fragmente-Quelle sind immer noch die ganzen unsinnigen Artefakte.\t\tZum Vergrößern anklicken....Mag ja sein... Aber ich hab einfach noch nicht genug von denen![BR]Zuviele Evos sind einfach goldwert für meine Stadt..."}, {"2": "...bedenke, daß du die ganze Zeit über die Ensemble stehen lassen musst, um die Takte-Produktion zu erhöhen - ohne würde mein Portal nur 60 produzieren...(die Ensemble erfüllen sonst aber praktisch keinen Zweck - sind jeweils 24 oder 25 Felder groß)"}, {"8": "Romilly schrieb:\t\t\t(die Ensemble erfüllen sonst aber praktisch keinen Zweck - sind jeweils 24 oder 25 Felder groß)\t\tZum Vergrößern anklicken....Ich plane so 14 Brutstätten für meine Stadt... Auf level4 sind die 6mal6 Felder groß + Weg... das ist riesig![BR][BR]Da würde ich mal die 18 Ensembles ohne Weg miteinander vergleichen...[BR]Es kommen ja nur noch die Manus hinzu wo ich die Instrumentenbauer anschließen muss.[BR][BR]Vermutlich habe ich aber \"nur\" 9 Ensembles bis ich genug Instrumente fürs Portal4 haben werde?[BR][BR]Notfalls werde ich eben schwach und pack noch ne Erweiterung hin?[BR][BR]Frage: Die Takteproduktion... Ist das pro ensemble 0,4 Takte oder 40% mehr Takte?"}, {"2": "gergerw schrieb:\t\t\tEs kommen ja nur noch die Manus hinzu wo ich die Instrumentenbauer anschließen muss.\t\tZum Vergrößern anklicken.......nur noch ist gut - die Instrumentenbauer sind auch jeweils 15 oder 16 Felder groß - ich hab davon jetzt jeweils 4 - also insgesamt 12 - das reicht gerade mal so, daß ich neben den Liedern auch noch Instrumente für die Forschung und den Auf-/Ausbau zusammen bekomme (bei je 3 wurden die so ziemlich von den Liedern alleine aufgeschlurpt)....insgesamt hab ich je 6 eingeplant + je 5 Ensemble (für das 6. muss ich was einlagern) - vermutlich werden es aber mehr Instrumentenbauer werden...(im Austausch mit den Ensemble)..."}, {"8": "ich habs ja nicht eilig [smilie--sprite2][BR][BR]Trotzdem nochmal Frage:[BR]Wenn ich 9 ensembles habe... [BR]heißt das dann, dass ich pro zeiteinheit 360% mehr Takte produziere...also 144 zusätzliche Takte[BR]oder nur lumpige 3,6 Takte zusätzlich??? (bei Hain Stufe1)"}, {"6": "gergerw schrieb:\t\t\tich habs ja nicht eilig [smilie--sprite2]Zum Vergrößern anklicken....Selbst wenn du die Takte im Hain erzeugen willst: ich kann dir nur wärmstens den Wirbel der Aufbewahrung empfehlen - Zeit genug hast du ja noch dafür. Damit halbierst du zumindest den Platzbedarf für die Gastrassengebäude.[BR][BR]Romilly schrieb:\t\t\tdie Instrumentenbauer sind auch jeweils 15 oder 16 Felder groß - ich hab davon jetzt jeweils 4 - also insgesamt 12\t\tZum Vergrößern anklicken....Ich hatte nur jeweils 2. Die benötigten Instrumente hab ich einfach mit den 10 Monate lang angesammelten Zeitsegen produziert. [smilie--sprite1][BR]Morgen abend hole ich mir im Turnier die fehlenden WP für die letzten beiden Forschungen, dann ist der Hain auch reif für die Schrottpresse."}, {"4": "Ich hab meine Zeitsegen so ziemlich für Kapitel 18 und 19 ausgegeben. Dafür war ich auch innerhalb von 2 bzw. knapp 3 Monaten jeweils durch. Ich  muss einfach neu ansparen,da ja auch zwischendrin immer wieder zeitsegen verbraucht werden."}, {"54": "ustoni schrieb:\t\t\tSelbst wenn du die Takte im Hain erzeugen willst: ich kann dir nur wärmstens den Wirbel der Aufbewahrung empfehlen - Zeit genug hast du ja noch dafür. Damit halbierst du zumindest den Platzbedarf für die Gastrassengebäude.[BR][BR][BR]Ich hatte nur jeweils 2. Die benötigten Instrumente hab ich einfach mit den 10 Monate lang angesammelten Zeitsegen produziert. [smilie--sprite1][BR]Morgen abend hole ich mir im Turnier die fehlenden WP für die letzten beiden Forschungen, dann ist der Hain auch reif für die Schrottpresse.\t\tZum Vergrößern anklicken....Erst jammern sie monatelang, dass endlich eine neue Gastrasse erscheint, hinterher haben sie nix eiligeres zu tun, als die Gastrasse wieder loszuwerden ...[BR][BR]Versteh das einer, wer will, ich nich ...[BR][BR]HdW"}, {"4": "Mir gefällt die ausgebaute Rüstkammer so überhaupt nicht, ganz und gar nicht.[BR][BR]Es ist ein Baum, der seine Hand schützend über eine Sängerin ? hält. Was bitte hat das mit einer Rüstkammer zu tun?[BR][BR]Ich fand es immer lustig, wenn auf irgendeine Art und Weise da die Krieger erschaffen wurden, indem sie z.B. durch ein Licht \"erweckt\" wurden oder einen Trank bekamen oder oder oder ... nun muss ich bis  zum nächsten Kapitel damit leben, dass ein Baum eine Sängerin beschützt. Absolut nicht mein Ding.[BR][BR]Rüstkammern per Definition statten Krieger aus, aber beschützen doch nicht eine einzelne Person. Dann noch dieses Waldelfen-Design, ein Kapitel, das mir so fürchterlich unübersichtlich war aufgrund der vielen Bäume. War damals sehr froh, diesem Kapitel entfliehen zu können.[BR][BR]Nee, nee, setzen, 6 an die Devs."}, {"54": "salandrine schrieb:\t\t\tMir gefällt die ausgebaute Rüstkammer so überhaupt nicht, ganz und gar nicht.[BR][BR]Es ist ein Baum, der seine Hand schützend über eine Sängerin ? hält. Was bitte hat das mit einer Rüstkammer zu tun?[BR][BR]Ich fand es immer lustig, wenn auf irgendeine Art und Weise da die Krieger erschaffen wurden, indem sie z.B. durch ein Licht \"erweckt\" wurden oder einen Trank bekamen oder oder oder ... nun muss ich bis  zum nächsten Kapitel damit leben, dass ein Baum eine Sängerin beschützt. Absolut nicht mein Ding.[BR][BR]Rüstkammern per Definition statten Krieger aus, aber beschützen doch nicht eine einzelne Person. Dann noch dieses Waldelfen-Design, ein Kapitel, das mir so fürchterlich unübersichtlich war aufgrund der vielen Bäume. War damals sehr froh, diesem Kapitel entfliehen zu können.[BR][BR]Nee, nee, setzen, 6 an die Devs.\t\tZum Vergrößern anklicken....genau das hatte ich mir auch gedacht, als ich die gesehen hatte das erste Mal, wie auch die vielen anderen Bäumchen in den Items zum Kapitel.[BR][BR]War ich damals froh nach den Waldelfen, als ich die letzten Bäumchen wieder los war ...[BR][BR]Ich hatte ansich darauf gehofft, dass nach fast einem Jahr Wartezeit die neuen Items mal wirklich gut und anders aussehen würden, anstatt dessen hat man die Bäumchen wieder hervorgeholt - nix gegen Bäumchen in der Natur, aber in einem Fantaxy-Spiel, wo auch gekämpft wird, sollten doch andere Bauten her.[BR][BR]Ein wesentlicher Bestandteil der Spiel-Lust kommt für mich aus der Optik, da hat das Spiel nun einen großen Rückschritt gemacht.[BR](ich dachte, nach den mega-hässlichen Brutstätten käm mal was richtig \"sehenswertes\" - leider nein ...)[BR][BR]Ausnahme: die Edelstein-Manu find ich gut gelungen - die Magiestaubis und Elexier dagegen nix Neues, langweilig wie immer ...[BR][BR]HdW"}]