[{"6": "HerrderWelten schrieb:\t\t\tVersteh das einer, wer will, ich nich ...\t\tZum Vergrößern anklicken....Ist doch schön, dass es unterschiedliche Meinungen und Herangehensweisen gibt.  [smilie--sprite2] [BR][BR]Wenn es dir Spaß macht, die Stadt mit Gastrassengebäuden zuzupflastern und monatelang homöopathische Mengen an Takten einzusammeln: bitte schön. Jedem das seine."}, {"153": "salandrine schrieb:\t\t\tMir gefällt die ausgebaute Rüstkammer so überhaupt nicht, ganz und gar nicht.[BR][BR]Es ist ein Baum, der seine Hand schützend über eine Sängerin ? hält. Was bitte hat das mit einer Rüstkammer zu tun?\t\tZum Vergrößern anklicken....[BR]Sängerin? Ich sehe einen Ork, der beim Ofen Waffen schmiedet. Und einen Baum, der die fertige Waffe verzaubert. Thema eindeutig getroffen, der Rest ist natürlich Geschmacksache."}, {"8": "Jetzt hätte ich zu gerne 1 Mio. Likes dagelassen!!!! [smilie--sprite8][BR][BR]Für mich die bisher geilsten Rüka... will mir meine ganze Stadt damit zupflastern..."}, {"2": "felidaey schrieb:\t\t\tUnd einen Baum, der die fertige Waffe verzaubert.\t\tZum Vergrößern anklicken.......jepp - eine Hellebarde...[BR][BR][IMG]https://i.ibb.co/yPjRjGD/https-de-forum-elvenar-com-index-php-attachments-r-sti5-png-31311.png[/IMG]"}, {"19": "Hain der Harmonie ist auf Stufe 3[BR][BR]Durch den Wirbel der Aufbewahrung Stufe 13 passen da jetzt[BR]7450 Takte rein[BR][BR]Die Höchstmenge an Takten, die der Forschungsbaum benötigt sind 7500 Takte[BR][BR]Wirbel der Aufbewahrung geht diese Woche noch auf Stufe 14[BR]Dann sollte es passen[BR][BR]Hain der Harmonie produziert bei mir keine Takte[BR]Portalbonus sollte ausreichen[BR][BR]Ensembles werde nicht mehr benötigt[BR]Gibt Göttliche Saat und Orks zurück[BR][BR]Hain der Harmonie auf Stufe 4[BR]Dadurch würden die Geigenbauern etc. dann mehr produzieren[BR]Habe ich nicht vor[BR][BR]Ich werde dafür ev. weitere Flöten- Geigen- Trommelbauer aufstellen[BR]Auch ein paar Handelsstationen wären noch im Lager[BR][BR]Kapitel 20 – gefällt mir immer besser  [smilie--sprite1]"}, {"2": "King Luckybaby schrieb:\t\t\tGibt Göttliche Saat und Orks zurückZum Vergrößern anklicken.......uiiii - tatsächlich - das ist aber nett, dann werden die nicht fragmentiert [smilie--sprite1]....[BR][BR]...ich werd zwar alle 18 Ensemble bauen, da ich die Quests durchspielen möchte, aber ob ich noch weitere Instrumentenbauer brauche, wird sich noch heraus stellen - im Moment kann ich schön nebeneinander Ensembles bauen, Lieder komponieren und Forschungen abschließen ohne Zeitsegen einsetzen zu müssen (die spar ich mir lieber für andere Gelegenheiten auf)..."}, {"19": "10.000 Orks [BR]10.000 Göttliche Saat"}, {"19": "Romilly schrieb:\t\t\t...uiiii - tatsächlich - das ist aber nett, dann werden die nicht fragmentiert [smilie--sprite1]....[BR][BR]...ich werd zwar alle 18 Ensemble bauen, da ich die Quests durchspielen möchte, aber ob ich noch weitere Instrumentenbauer brauche, wird sich noch heraus stellen - im Moment kann ich schön nebeneinander Ensembles bauen, Lieder komponieren und Forschungen abschließen ohne Zeitsegen einsetzen zu müssen (die spar ich mir lieber für andere Gelegenheiten auf)...\t\tZum Vergrößern anklicken....Ich mache das nicht !!![BR][BR]Ich habe schon alle Ensembles gelöscht und die \"Neue Gastrasse\" aufgestellt[BR]8x Handelsstation stehen - habe zwar sehr viel Portalbonus im Lager -[BR]aber es wird doch wohl auch noch ein Kapitel 21 geben  [smilie--sprite1][BR][BR]Dann werde ich mir auch die Kapitel 20-Geschichte durchlesen und eine Menge an[BR]Belohnungen abholen - manche Aufgaben werden zwar nicht erfüllt werden - aber die \"jucken\"[BR]mich nicht - soooo besonders sind die entgangenen Belohnungen auch wieder nicht ![BR][BR]Ausbau des Wirbels auf Stufe 14 ist auch schon erledigt[BR]Sowohl Wp-Segen als auch Zeitsegen \"überfluten\" mein Lager - bin eben ein \"Sparschwein\" [smilie--sprite1][BR]7560 Takte passen jetzt rein - PERFEKT !!! [smilie--sprite6]"}, {"92": "Romilly schrieb:\t\t\t...jepp - eine Hellebarde...[BR][BR]Anhang 31311 ansehenZum Vergrößern anklicken....Ich halte das für eine Doppelaxt, so groß wie ein Zwerg ^^"}, {"2": "Drastor schrieb:\t\t\tIch halte das für eine Doppelaxt, so groß wie ein Zwerg ^^\t\tZum Vergrößern anklicken.......schwer zu sagen - mir kommt es ziemlich lang vor und oben scheint es eine Spitze zu haben - es ist auf jedenfall eine Doppel-Waffe - entweder Doppelaxt von den Axtkämpfern oder eben eine Hellebarde von den Vallos...(die bekommen eine Aufwertung in diesem Kapitel)...."}, {"4": "Ich hab diese \"Hellebarde\" als Sängerin gesehen, die die Arme nach oben außen streckt, analog der Sängerin im Hain Stufe 1. [BR][BR]Wenn es trotzdem eine Waffe sein sollte, dann würde es passen."}, {"2": "salandrine schrieb:\t\t\tIch hab diese \"Hellebarde\" als Sängerin gesehen, die die Arme nach oben außen streckt, analog der Sängerin im Hain Stufe 1.[BR][BR]Wenn es trotzdem eine Waffe sein sollte, dann würde es passen.\t\tZum Vergrößern anklicken....ja - ne Waffe ist es definitiv und die ist so groß wie der Ork in der Schmiede - also eigentlich ein wenig lang für eine zu schwingende Axt - wenn oben eine Spitze dran ist, wäre es eher eine Hellebarde, da das eine Hieb- und Stichwaffe ist - hab gerade festgestellt, daß der \"Axtkämpfer\" bei den Menschen mit 3 Sternen nur \"Sturmbarbar\" heißt und gar keine Axt mehr hat, sondern eher einen Hammer ^^ - also für wen diese Waffe gedacht ist, weiß ich nicht (die Vallos haben zwar ne Hellebarde, aber eine einseitige)...[BR][BR][IMG]https://i.ibb.co/JBqRbxN/https-de-forum-elvenar-com-index-php-attachments-vallo-png-31317.png[/IMG]...[IMG]https://i.ibb.co/JqkFgJP/https-de-forum-elvenar-com-index-php-attachments-axti-png-31316.png[/IMG]...einen 4-Sterne-Barbaren hab ich leider nicht..."}, {"8": "könnte ein Hinweis auf die neuen Nilpferdkrieger sein die im nächsten Kapitel kommen?[BR][BR]interessant find ich ihre Spezialfähigkeit: \"Hindernisse zertrampeln\"[BR][smilie--sprite6]"}, {"147": "Romilly schrieb:\t\t\thab gerade festgestellt, daß der \"Axtkämpfer\" bei den Menschen mit 3 Sternen nur \"Sturmbarbar\" heißt und gar keine Axt mehr hat, sondern eher einen Hammer ^^ - also für wen diese Waffe gedacht ist, weiß ich nicht (die Vallos haben zwar ne Hellebarde, aber eine einseitige)...[BR][BR]Anhang 31317 ansehen...Anhang 31316 ansehen...einen 4-Sterne-Barbaren hab ich leider nicht...\t\tZum Vergrößern anklicken....[BR]Das ist eindeutig ein Thors Hammer.[BR]Damit macht man Donner und Blitze. [BR][BR]Was doch zu einem Sturm_Barbaren gut passt^^"}, {"85": "Was bitte schön soll eine derartige Aufgabe? Soll ich jetzt eine große Menge an Gebäude ins Lager teleportieren  und/oder Unmengen an Kulturgüter aufstellen, nur um die nicht abzulehnende Aufgabe zu erfüllen?[BR][IMG]https://i.ibb.co/ZN4SNW5/https-de-forum-elvenar-com-index-php-attachments-quest-jpg-31324.jpg[/IMG]"}, {"2": "Fuenarb schrieb:\t\t\tWas bitte schön soll eine derartige Aufgabe? Soll ich jetzt eine große Menge an Gebäude ins Lager teleportieren  und/oder Unmengen an Kulturgüter aufstellen, nur um die nicht abzulehnende Aufgabe zu erfüllen?[BR]Anhang 31324 ansehenZum Vergrößern anklicken.......da sollst du mindestens diese Sonne beim Kulturbonus erreichen - also ohne Mitgiften 150 %...(falls du es nicht bemerkt hast, geht es in der Storyline um ein Konzert - also Kultur)..."}, {"85": "Romilly schrieb:\t\t\t...da sollst du mindestens diese Sonne beim Kulturbonus erreichen - also ohne Mitgiften 150 %...\t\tZum Vergrößern anklicken....Die Aufgabe verstehe ich, nur was soll das. Um die 150 % zu erreichen müsste ich meine Stadt komplett verändern, zahlreiche Kultur verbrauchende Gebäude teleportieren und (oder neue Kulturgebäude aufstellen. Nonsens.... 150 % habe ich schon lange nicht, brauche ich nicht und wieder einmal eine nutzlose Aufgabe nur um das Kapitel in die Länge zu ziehen. Ähnlich wie die Aufgaben zum Mana sammeln, um dann anschließend Mana zu spenden. Phantasieloser Humbug."}, {"2": "...na, wenn du das nicht machen willst, dann musst du halt die Quests bleiben lassen...ich wollte auch nicht alle meine Häuser und Werkstätten ausbauen - ich hab fast 70.000 Arbeitslose und die Blaupausen hätte ich auch andersweitig gut gebrauchen können..."}, {"85": "Romilly schrieb:\t\t\t...na, wenn du das nicht machen willst, dann musst du halt die Quests bleiben lassen...ich wollte auch nicht alle meine Häuser und Werkstätten ausbauen - ich hab fast 70.000 Arbeitslose und die Blaupausen hätte ich auch andersweitig gut gebrauchen können...\t\tZum Vergrößern anklicken....Das mit dem bleiben lassen ist ziemlich blöd, da dann die Quast-line bis zum nächsten Kapitel stehen bleibt. Gebäude sinnlos ausbauen kenne ich auch, nur sehe ich darin zumindest irgendeinen Sinn, wenn auch nicht für meine Stadt. Den Kulturbonus auf 150 % zu bringen erfordert jedoch ein völliges Umdenken beim Stadtaufbau. Mit so unnützen Aufgaben wie - bau e eins der neuen Kulturgebäuden - kann ich leben, auch wenn ich sie anschließend wieder entferne. 180.000 zusätzliche Kultur ließe sich doch kurzfristig nur erreichen, wenn ich zahlrieche Gebäude teleportiere. Solche Quests sollten ablehnbar sein."}, {"85": "Mir geht es auch nur um den unnützen Aufwand. Einmal alle mag Wohnhäuser teleportieren und wieder aufstellen ist einfach nur völlig sinnlos. Nun gut erledigt und auf den nächsten Unsinn warten...."}]