[{"12": "Ich schätze ich hab meine Stadt für's Kapitel ganz gut aufgestellt.[BR]Kultur 150% ist für mich normal, fällt manchmal zwar drunter, aber mit viel Nbh sogar 160%.[BR]Der Portalsegen-Verbrauch war bis jetzt enorm, schätzungsweise hab ich die Hälfte bereits verbraucht; bin jetzt aber dazu übergegangen, Zeitbooster im Hain einzusetzen. Der ist zwar noch auf Stufe 1 (hab den Ausbau noch nicht erforscht), aber mit 7 Ensembles geht das bereits ganz gut.[BR]Und als glückliche Fügung finden dann exakt alle 18 Ensembles Platz, besser kann's ja nicht laufen.[BR]Ich hoffe nur, daß mein Saat-Vorrat noch einige Zeit ausreicht, ist inzwischen von 3 auf 1 Mio gefallen.[BR]Bisher find ich das Kapitel ganz nett, nur den Erleuchtete-Güter Preis für Trommel- u. Geigenensembles find ich etwas hoch.[BR]Mal schauen, wie lang ich brauch, die Ruhestätte der Ahnen möcht ich gern über 20 haben bis zum nächsten Kapitel [smilie--sprite1]"}, {"11": "Brauche ich die Geigen,,Flöten und Trommeln nur für die Forschungen??[BR][BR]Hat sich erledigt."}, {"92": "monakuki schrieb:\t\t\tDas ist eindeutig ein Thors Hammer.[BR]Damit macht man Donner und Blitze.[BR][BR]Was doch zu einem Sturm_Barbaren gut passt^^\t\tZum Vergrößern anklicken....Das ist unser neues Maskottchen.. haben sie ganz nett designed für unsere Gilde^^"}, {"9": "littleFlex schrieb:\t\t\teine Diskussion, bzw. Fehlermeldung zu diesen Ensemble-Quests gibt es bereits\t\tZum Vergrößern anklicken....Ich finde diese Fehlermeldung leider nicht und kann hiermit bestätigen das es sich zu 100% um einen Fehler handelt bei den Quests welche Trommelensemble (laut Spiel erfordern).[BR]Die Texte bzw. in der Storyline werden stets nur die Trommelensemble gemeint, das ist falsch![BR]Denn es sind generell Ensemble gemeint! Ergo besitze XXX Ensemble wäre hier der richtig Text![BR][BR][IMG]https://i.ibb.co/j8JKTfx/https-de-forum-elvenar-com-index-php-attachments-1664089959325-png-31334.png[/IMG][BR][BR]Betrifft Aufgabe: 62 / 68 und Aufgabe 73 "}, {"9": "[IMG]https://i.ibb.co/TPfrVjc/https-de-forum-elvenar-com-index-php-attachments-1664092236856-png-31335.png[/IMG][BR][BR][IMG]https://i.ibb.co/1vKb0mK/https-de-forum-elvenar-com-index-php-attachments-1664093516955-png-31337.png[/IMG][BR][BR]In der Aufgabe 70 wurde die auch verlangt, jedoch bestätigt und abgehakt?[BR][BR][IMG]https://i.ibb.co/KG5SN8j/https-de-forum-elvenar-com-index-php-attachments-1664092310860-png-31336.png[/IMG][BR][BR]Soll ich mich diesbezüglich beim Support melden @littleFlex ?[BR][BR]Welche Manufaktur ist also in AUFGABE 72 gemeint?[BR][smilie--sprite4] (Muss ich jetzt echt jede Manu ausbauen um rauszufinden, welche Manu gemeint ist!?) [smilie--sprite4][BR][BR]Edit:[BR][BR][IMG]https://i.ibb.co/60pgfFt/https-de-forum-elvenar-com-index-php-attachments-1664188123068-png-31378.png[/IMG]"}, {"2": "AngelOfDead schrieb:\t\t\tWelche Manufaktur ist also in AUFGABE 72 gemeint?\t\tZum Vergrößern anklicken.......der Fehler wurde - glaube ich - bereits auf Beta gemeldet - laut iDavis handelt es sich bei Aufgabe 72 um eine Holzmanu - also erst Marmor bei Nr. 68, dann Stahl bei Nr. 70 und schließlich Holz bei Nr. 72 - macht auch Sinn so..."}, {"9": "Romilly schrieb:\t\t\t...der Fehler wurde - glaube ich - bereits auf Beta gemeldet - laut iDavis handelt es sich bei Aufgabe 72 um eine Holzmanu - also erst Marmor bei Nr. 68, dann Stahl bei Nr. 70 und schließlich Holz bei Nr. 72 - macht auch Sinn so...\t\tZum Vergrößern anklicken....Merci, dachte ich mir fast und ärgerlich, dass man Feedback am Beta gibt und Fehler meldet, sie aber dann auf Live immer noch vorhanden sind und ja das ist hier mein Feedback, denn das kann es doch so langsam nicht mehr sein, dass stets exakt dieselben Fehler die auf dem Beta sind auch Live auftauchen und nicht behoben wurden. Für was also der Beta-Server und Feedback, wenn sich dann eh nichts ändert? Es war doch Luft zwischen Beta- und Live-Server?  [smilie--sprite4] (Bitte unbedingt an die Entwickler weitergeben / wäre echt nett, denn das ärgert gewaltig)![BR]Wenn Spieler euch schon helfen, dann nehmt die Hilfe dann bitte auch an!"}, {"2": "...jetzt hab ich ne Holz-Mama und nen Holz-Papa...[BR][BR][IMG]https://i.ibb.co/4TfYXZG/https-de-forum-elvenar-com-index-php-attachments-holzfamilie-png-31338.png[/IMG]...Familie Wackelbaum..."}, {"9": "Romilly schrieb:\t\t\tum eine Holzmanu\t\tZum Vergrößern anklicken....Ja war sie und hab es oben für die Nachzügler eben editiert, bzw. nachgetragen."}, {"12": "Ein Kapitel das ich als ziemlich angenehm empfinde.[BR]Portalsegen-Verbrauch war anfangs ziemlich hoch, und Zeit-booster brauch ich schätzungsweise nicht mehr als bei den vorhergehenden Kapiteln.[BR]Heut hab ich das 18.Ensemble gebaut - jetzt noch 20 Lieder und ich kann den Hain auf Stufe 4 ausbauen, dafür bleib ich gern mal 2 Tage im Forschungsbaum stecken. Ich schätze, daß ich mit diesem etwas schneller fertig werde als die vorigen Kapitel. Mal schauen, ob ich noch irgendwo Saat brauche, bin fast blank, für 2x 9h Erweckte Güter reichen meine Saat-Gebäude. Und Ork-Nester brauch ich auch jede Menge nach dem Kapitel. Aber mit den andern Gütern läuft's ganz gut."}, {"9": "Feedback .. .. ..[BR][BR]Positiv:[BR]Sehr angenehm zu spielenGut durchdachte KombinationenÜberragend gute GrafikProduktionsablauf der Gast-Rassen-Gebäude gut abstimmbarNett weitererzählte GeschichtePortal-Segen sinnvoll einsetzbarForschungsbaum gut abgestimmt (keine langen Wartezeiten)Generelle Spielzeit des Kapitels (ca. 3,5 Wochen mit Zeit-Booster Nutzung bei Ausbauten der Gebäude)Negativ:[BR]Sehr viele Rechtschreibfehler in der Geschichte sowie im Aufgaben-Text zum Teil noch EnglischVöllig Sinnbefreite Storyline-Produktions-Aufgaben und obendrein zu viel/oft[BR] (Hier wird mehrmals verlangt nicht Bonus-Güter zu produzieren)Mehrere Fehler in den Aufgaben, welche trotz Beta-Forum Feedback/Meldung nicht behoben wurden[BR] (siehe Beitrag #284 und #285 sowie generell zuvor)Mit unter zu schaurige Geschichte, wenn man bedenkt,[BR] dass laut App- und Play-Store das Spiel ab FSK 6 angeboten wirdZu hoher Platz-/Flächenanspruch (die 18 Ensemble sind zu viel)Keine großartige Herausforderung, wenn auch gut durchdachtAuch wird man stets durch die Irreführenden Aufgaben (falsche Angaben) durcheinander gebrachtZusätzliches Beschwerde-Feedback:[BR]Liebes @InnoGames  TEAM,​nehmt in Gottes Namen endlich Feedback und Fehlermeldungen ernst und an![BR]Wenn euch schon Spieler helfen, dann bitte, bitte nehmt diese Hilfe auch an und reagiert darauf oder behebt die gemeldeten Fehler![BR]Wenn ihr Fehlermeldungen und Feedback zu einer neuen Gast-Rasse auf dem Beta-Server bekommt, welche dann ein paar Wochen später auf den Live-Servern erscheint mit exakt den selben Fehlern, dann frage ich mich, ob ihr wirklich Fehler und Hilfe in Form von Fehlermeldungen wollt![BR]Es ist seit Jahren jedes mal dasselbe, stets kommen exakt die selben Fehler vom Beta-Server dann auch auf die Live-Server![BR]Das kann es so langsam nicht mehr sein oder?[BR]Wie arbeitet ihr denn?[BR]Es war genug Luft zwischen Beta und Live und dennoch kommen stets die selben Fehler dann Live auch zum Vorschein?[BR]Das ist nun ungelogen seit Jahren so und es fängt an gewaltig zu ärgern![BR]So langsam aber sicher, glaube ich euch nicht mehr, dass ihr gern Feedback wollt sowie ihr stets betonnt![BR]Exakt die selben Fehler in der Storyline - Kapitel 20 wie auf dem Beta![BR]Für was habt ihr XXX Test- und den Beta-Server?[BR]Spielt ihr euer Spiel wirklich selber auch?[BR]Wenn ja, wie kann es sein, dass man die Fehler nicht sieht oder merkt?[BR]Wenn sie ein Spieler findet und meldet und diese bestätigt werden vom INNO-TEAM (Forum), dann solltet ihr sie doch auch sehen und erkennen?[BR]Ohne uns Spieler hättet ihr kein so erfolgreiches Unternehmen aufbauen können, also tut was für eure Spieler, die euch eh schon Helfen! [BR]Das kann echt nicht wahr sein![BR]Werden die letzten GA-Fehler dann auch wieder Live erscheinen?[BR]Liebe Grüße und nicht nur heimlich überall mitlesen, sondern auch reagieren und handeln, dass wäre schön, denn wir Spieler sorgen dafür, dass euer Spiel so Erfolgreich ist![BR][BR]Eine 100% ausgebesserte und Fehlerfreie Storyline findest du hier[BR](Text anklicken)​"}, {"2": "Alriel schrieb:\t\t\tHiho[BR][BR]Ich habe zwei Geigenensemble wie auch immer stehen, warum wird es noch rot angezeigt ?\t\tZum Vergrößern anklicken.......weil du jeweils 6 Ensemble stehen haben musst, um das Portal auf Stufe 4 ausbauen zu können...[BR][BR]...kuck mal ab da... https://de.forum.elvenar.com/index....itel-20-die-macht-der-musik.25485/post-403570"}, {"4": "Ausbau der Elixiermanu auf Stufe 34[BR][BR]bei allen anderen ist die minimale Steigerung 2.500 innerhalb von 3 h und höher. Hier ist die Steigerung letztlich weniger als 600 Stück in 3 h.[BR][BR]Stimmt das?[BR][BR]Im Wiki kann ich es nicht nachlesen, da hier kein Bonus mit angezeigt wird. Mein Bonus ist natürlich auf über 700 %[BR][BR][IMG]https://i.ibb.co/vVBYZjR/https-de-forum-elvenar-com-index-php-attachments-1664635832806-png-31473.png[/IMG]"}, {"103": "gemäß der Daten im Wiki stimmen Deine Zahlen haargenau,[BR]in der rechnerischen Annahme, dass Dein Bonus 9,6 beträgt[BR][BR][IMG]https://i.ibb.co/Zh0s62w/https-de-forum-elvenar-com-index-php-attachments-1664640477602-png-31475.png[/IMG][BR][BR]Stufe 33 = 1180*9,6 = 11328[BR]Stufe 34 = 1240*9,6 = 11904[BR][BR]gemäß Wiki haben auch Magiestaub und Edelstein von 33 auf 34 genau den selben Sprung."}, {"12": "salandrine schrieb:\t\t\tAusbau der Elixiermanu auf Stufe 34[BR][BR]bei allen anderen ist die minimale Steigerung 2.500 innerhalb von 3 h und höher. Hier ist die Steigerung letztlich weniger als 600 Stück in 3 h.[BR][BR]Stimmt das?[BR][BR]Im Wiki kann ich es nicht nachlesen, da hier kein Bonus mit angezeigt wird. Mein Bonus ist natürlich auf über 700 %\t\tZum Vergrößern anklicken....Ist mir bisher gar nicht aufgefallen  [smilie--sprite1][BR]Aber wenn ich mir meine anschaue, hat die Elixier bei Nicht-Bonusgütern auch 1240, während Staub und Edelstein bei den Nicht-Bonugütern 2155 anzeigen, obwohl laut Wiki dort auch 1240 sein sollten."}, {"4": "És kam mir halt komisch vor, weil bei Seide die Steigerungsmenge eben deutlich geringer ist ....[BR][BR]ah, ich seh meinen Denkfehler, ich hatte bei Seide nach der Steigerung beim Flugpulver geguckt und dachte, dann kann bei Elixier die Steigerungsmenge nicht stimmen.[BR][BR]Mein Fehler, danke für die Antwort.[BR][BR][IMG]https://i.ibb.co/6ND7hR1/https-de-forum-elvenar-com-index-php-attachments-1664658106372-png-31486.png[/IMG]"}, {"2": "....das große Konzert startet...[BR][IMG]https://i.ibb.co/M88TjzB/https-de-forum-elvenar-com-index-php-attachments-konzert3-png-31489.png[/IMG][IMG]https://i.ibb.co/gRjR8Dp/https-de-forum-elvenar-com-index-php-attachments-konzert-png-31488.png[/IMG]...und in ein paar Tagen bin ich dann fertig - 6 Forschungen noch..."}, {"103": "der arme Dschinn^^"}, {"14": "das hatte ich mir mit den Vorabbildern, die man angucken konnte, durchaus hübscher vorgestellt[BR]was für eine \"graue Band\"[BR]sehr viele Steine...[BR]ob da tatsächlich Musik rauskommt?  [smilie--sprite9]"}, {"254": "lol wtf, wie schnell rast ihr alle durch die kapitel?[BR]das macht doch gar keinen spaß mehr, wenn man dann wieder ein jahr auf die nächste gastrasse warten muss[BR]alleine die begrenzenden faktoren durch saat, mana und takte müssten eigentlich eine größere hürde darstellen[BR]kein wunder dass die kapitel immer bockschwerer werden (von den gütermengen und dem aufwand her)[BR]ansonsten schaut man ja immer relativ schnell durch, wenn man sich die forschung vorher anguckt und ein paar kommentare dazu liest oder passend dazu im wiki stöbert, weiß man schon recht genau wo die reise hingehen soll[BR]aber dieses spiel ist meiner meinung nach auch gar nicht dazu ausgelegt, wie in der formel 1 als erster ins ziel zu kommen mit 300km/h, mir persönlich bedeutet das null komma gar nix, wenn das hier die leutchens posten[BR]aber egal, jeder soll machen wie er will, nur die ersten die fertig werden sind auch die ersten die das forum wieder zutexten mit ihren langeweile-kommis, weil sie wieder zu viel zeit haben auf dumme gedanken zu kommen und die threads mit irgendwelchem dünnpfiff ins chaos zu stürzen[BR]klar muss der publisher liefern, aber die spielerschaft ist mittlerweile auch nicht mehr so einfach handzahm und ruhig zu stellen, was man da alles abliefern muss, und nie ist es irgendeinem auch mal gut genug, ich find das echt zum kotzen, jeder spieler für sich sollte mal in sich gehen und vorher forum oder wiki durchstöbern bevor er hier mit albernen kommis die lebenszeit der anderen verschwendet alles andere sehe ich als ignorant und egoistisch an und pure stumpfsinnigkeit und verpeiltheit und vor allem faulheit[BR]ich frage mich allen ernstes, ob das auch ein reallife problem ist, denn niemand will mehr selbst etwas machen und schiebt es direkt auf den verantwortlichen, der dann mit rede und antwort grade stehen muss, was sind wir nur für eine gesellschaft geworden?[BR]nochmal 2000 jahre sehe ich da echt schwarz für uns ...[BR]PS mir ist auch aufgefallen, dass das kapitel 20 echt viele fehler enthält, da frag ich mich dann auch echt schon, was man ein 3/4 jahr macht, ja wahrscheinlich die events designen und den königlichen preis pass ins leben rufen, harr harr wie witzig[BR]da hätte man sich dann von mir aus auch ruhig noch bis dezember zeit lassen können und das kapitel schön endausgereift veröffentlichen können und nicht die spieler die ganze arbeit machen lassen mit ihren mühevollen und konstruktiven versuchen, dem spiel fehler auszumerzen und leben einzuhauchen, das gibts fast in keinem anderen spiel, dass die spieler sich so für ein spiel einsetzen und so viel feedback geben"}]