[{"2": "Foggwulf schrieb:\t\t\tdas macht doch gar keinen spaß mehr, wenn man dann wieder ein jahr auf die nächste gastrasse warten muss[BR]alleine die begrenzenden faktoren durch saat, mana und takte müssten eigentlich eine größere hürde darstellen[BR]kein wunder dass die kapitel immer bockschwerer werden (von den gütermengen und dem aufwand her)\t\tZum Vergrößern anklicken.......ähm nein, das geht eigentlich recht flüssig, wenn man seine Stadt gut vorbereitet hat... meine größten \"Probleme\" waren die Orks und dann teilweise auch die Saat, Mana hab ich immer noch fast 9 Millionen - aber ich ernte halt jeden Tag auch um die 250.000 Saat in meiner Stadt und naja - die Orks springen fleißig nach dem Turnier aus dem Schrein der Champions - und für eine höhere Güterproduktion sorgt mein Sturmphönix...die Quests spiele ich übrigens alle durch..."}, {"254": "ork probleme hatte ich noch nie, verstehe da auch nicht das problem, habe noch nie schwierigkeiten damit gehabt[BR]davon habe ich mittlerweile 4mille auf halde, tendenz steigend[BR]und der schrein der champions ist mitunter auch total überflüssig für mich[BR]um standardgüter die vom sturmvogel geboostet werden gehts mir nicht, da hab ich von jedem 3er stack (T1-T3) auch an die 40-50 mille[BR]9 mille mana über? auch noch zauber oder komplett leert?[BR]das ist doch keine aussage für ein ottonormalspieler mehr und ich spiele schon regelmäßig, nur es gibt auch welche die es nicht einmal hinkriegen, nach 2 kapiteln ihre militärgebäude vernünftig auszubauen und ich werde dann gefragt wie ich 10k punkte im turnier machen kann[BR]kommt halt auch davon dass man viele überflüssige gebäude bauen kann, die keinem was helfen und es quasi eine falle ist, für unerfahrene wenn man sich nicht vorher etwas schlau macht[BR]vllt sollte man da mal ein lehrvideo auf youtube zu machen, damit erstmal die grundlagen richtig sitzen"}, {"2": "...meine Stadt ist halt anders ausgerichtet (hab nur 3 Rüstkammern - aber ich verwende wenigstens meine Orks und stapel die nicht) - und der Sturmvogel boostert nicht nur die Standardgüter - der boostert gar keine Güter, sondern verstärkt die fabelhafte Produktion - das bringt also auch mehr Erleuchtete bei weniger Unuriumbedarf...[BR][BR]...und Zauber hab ich noch genug ^^[BR][BR][IMG]https://i.ibb.co/dpcFQLR/https-de-forum-elvenar-com-index-php-attachments-zauber3-png-31493.png[/IMG][BR][BR]...hab auch nicht behauptet, ein Otto-Normal-Spieler zu sein - und ein Anfänger bin ich schon 3x nicht...."}, {"6": "Foggwulf schrieb:\t\t\talleine die begrenzenden faktoren durch saat, mana und takte müssten eigentlich eine größere hürde darstellen\t\tZum Vergrößern anklicken....Nö.[BR]Saat: ausreichend viele Wunderlevel und erkundete Provinzen sorgen für ausreichend Saat.[BR]Mana: wird bei Bedarf im Drachenkloster in beliebigen Mengen produziert.[BR]Takte: werden bei Bedarf mit Portalsegen erzeugt.[BR][BR]Also alles eine Sache der Vorbereitung. [smilie--sprite2]"}, {"254": "ja ich weiß was der sturmi bringt, habs falsch ebschrieben, danke für die korrektur[BR]ich brauch keine belehrung ich kann durchaus auf augenhöhe mitreden[BR][BR]nix eine sache der vorbereitung, habe in all meiner spielzeit nicht ansatzweise so viele zauber wie romilly und ich dachte immer ich bin ganz gut mit dabei[BR]die menge an zaubern ist geisteskrank, ich hab mit allen zusammen nicht mal so viel wie du blaue hast ...[BR]kannst ja gerne damit angeben, aber das entmutigt andere spieler enorm, mich jetzt nicht direkt weil ich klarkomme im kapitel 20 aber ich sehe ja auch ganz andere fälle, die nicht so toll sind und den durchblick haben wie ihr beiden romilly und ustoni[BR][BR]und zu ustoni, deine 10.000% portalgewinne hat auch nicht jeder[BR]650 provinzen habe ich auch[BR]in beliebigen mengen? so ein überfluiss sollte nicht möglich sein[BR]ich gehe mit den zaubern sparsam um und habe längst nicht so viel[BR]und saat weiß ich auch wie man die produziert, habe nicht mich gemeint mnit den grundlagen...[BR][BR]und ihr braucht jetzt gar nicht damit anfangen, in ironischer weise eure kommis gegenseitig zu liken xD[BR]ihr beiden seid zumindest für mich die vorreiter in ganz vielen aspekten rund um das spiel, bitte nicht falsch verstehen, denn dann habe ich da snicht so beabsichtigt, wie ich es formuliert habe, aber das gibt noch lange niemandem einen grund, sich lustig zu machen über andere die schlechter sind als man selbst, wenn ich mich schon als noob oute, dann helft mir doch wenigstens weiter und lacht mich nicht aus..[BR]euch scheint es wohl ziemlich gut zu gehen"}, {"2": "...also ich verprasse jeden Tag 5 x Vorrats- und 5x oder mehr Güterzauber (und das seit Jahren) - die magischen Mitgiften setze ich auch oft ein - gibt nen schönen Kulturbonus von über 700 % (und somit auch mehr Unurium von den Häusern) - ich spiel halt einfach schon lange und auch viel Events, Turnier, Turm etc. und hab von daher auch eine sehr gut ausgebaute (vorbereitete) Stadt - das können andere aber auch erreichen - aber nicht durch \"Meckern\", sondern durch \"Machen\"...."}, {"254": "700% K-Bonus, wait what?[BR][BR]immer nen gutes totschlagargument mit dem meckern und machen..[BR][BR]meiner meinung habe ich auch eine gute stadt, scheinbar längst nicht so gut wie andere[BR]wie gesagt hier gehts mir auch nicht um einen wettkampf, sondern um austausch[BR]und auch ich habe stunde um stunde damit verbracht die gähnenden sinntiefen dieses spiels zu studieren, aber jeder kann dazulernen[BR][BR]ich werde auch oft gefragt um rat und kann dann weiterhelfen, aber scheinbar gibt es noch etliche, die in einer ganz anderen liga mitspielen, die für mich unmöglich zu erreichen scheint, hut ab, ihr seid die besten!"}, {"14": "die vielen Segen wird man wohl im Turnier sammeln[BR]und vieles, was erst undenkbar erscheint kommen durch Wunder..[BR][BR]auch wenn ich gar nicht mitreden dürfte mit meinem Kapitel 11, aber ich denke, das ist der häufigste Unterschied zwischen Städten[BR][BR]und natürlich der Turm, den man bei elvenstats jetzt nicht sieht: auch der bringt etliches, was andere nicht in den Mengen haben"}, {"141": "Foggwulf schrieb:\t\t\tlol wtf, wie schnell rast ihr alle durch die kapitel?[BR]das macht doch gar keinen spaß mehr, wenn man dann wieder ein jahr auf die nächste gastrasse warten muss[BR]alleine die begrenzenden faktoren durch saat, mana und takte müssten eigentlich eine größere hürde darstellen[BR]kein wunder dass die kapitel immer bockschwerer werden (von den gütermengen und dem aufwand her)[BR]ansonsten schaut man ja immer relativ schnell durch, wenn man sich die forschung vorher anguckt und ein paar kommentare dazu liest oder passend dazu im wiki stöbert, weiß man schon recht genau wo die reise hingehen soll[BR]aber dieses spiel ist meiner meinung nach auch gar nicht dazu ausgelegt, wie in der formel 1 als erster ins ziel zu kommen mit 300km/h, mir persönlich bedeutet das null komma gar nix, wenn das hier die leutchens posten[BR]aber egal, jeder soll machen wie er will, nur die ersten die fertig werden sind auch die ersten die das forum wieder zutexten mit ihren langeweile-kommis, weil sie wieder zu viel zeit haben auf dumme gedanken zu kommen und die threads mit irgendwelchem dünnpfiff ins chaos zu stürzen[BR]klar muss der publisher liefern, aber die spielerschaft ist mittlerweile auch nicht mehr so einfach handzahm und ruhig zu stellen, was man da alles abliefern muss, und nie ist es irgendeinem auch mal gut genug, ich find das echt zum kotzen, jeder spieler für sich sollte mal in sich gehen und vorher forum oder wiki durchstöbern bevor er hier mit albernen kommis die lebenszeit der anderen verschwendet alles andere sehe ich als ignorant und egoistisch an und pure stumpfsinnigkeit und verpeiltheit und vor allem faulheit[BR]ich frage mich allen ernstes, ob das auch ein reallife problem ist, denn niemand will mehr selbst etwas machen und schiebt es direkt auf den verantwortlichen, der dann mit rede und antwort grade stehen muss, was sind wir nur für eine gesellschaft geworden?[BR]nochmal 2000 jahre sehe ich da echt schwarz für uns ...[BR]PS mir ist auch aufgefallen, dass das kapitel 20 echt viele fehler enthält, da frag ich mich dann auch echt schon, was man ein 3/4 jahr macht, ja wahrscheinlich die events designen und den königlichen preis pass ins leben rufen, harr harr wie witzig[BR]da hätte man sich dann von mir aus auch ruhig noch bis dezember zeit lassen können und das kapitel schön endausgereift veröffentlichen können und nicht die spieler die ganze arbeit machen lassen mit ihren mühevollen und konstruktiven versuchen, dem spiel fehler auszumerzen und leben einzuhauchen, das gibts fast in keinem anderen spiel, dass die spieler sich so für ein spiel einsetzen und so viel feedback geben\t\tZum Vergrößern anklicken....[BR]mir deucht dieser Beitrag gehört eher in's Thema \"Dampf ablassen\"... da darf man doch manche Worte benutzen, die in einem Diskussionsthread nichts zu suchen haben, oder hab ich das falsch verstanden?"}, {"103": "richtig verstanden aber ich sehe das \"gerade\" noch im toleranten Limit..."}, {"6": "@Foggwulf: keiner will dich hier kritisieren. Ich wollte nur aufzeigen, dass sich die meisten Probleme umgehen lassen.[BR]Deine Stadt sieht ganz gut aus, du hast aber z.B. bisher relativ wenige Wunderlevel. Damit produziert dein Überragender Verkäufer natürlich deutlich weniger Saat. Ich hab bei dir jetzt nicht nachgezählt, aber mit meinen 576 Wunderleveln erhalte ich aus dem Verkäufer allein schon alle 3 Stunden 25920 Saat als Sammelbonus.[BR]Hinzu kommt, dass mir die gut ausgebauten Wunder \"Vallorianischer Siegelturm\" und \"Tempel der Geister\" mehr als genug Unurium liefern. Der Verkäufer kann sich also voll und ganz auf Saatproduktion konzentrieren.[BR][BR]Die Menge an Segen kommt ganz von selbst zusammen, wenn man regelmäßig 50 bis 60 Provinzen im Turnier spielt. Ist also keine Zauberei.[BR]Auch der Turm ist da nicht ganz unbeteiligt. Den spiele ich von Beginn an vollständig durch.[BR]Dadurch konnte ich zu Beginn von Kapitel 20 so nebenbei noch 10 Dschinns aufstellen - bringt regelmäßig jede Menge Saat, Mana und WP.[BR][BR]Alle Features von Elvenar greifen ineinander. Man muss sie nur nutzen."}, {"119": "Die Bestände von @Romilly sind sicherlich schon lobenswert, ausbaufähig, you know what I mean ?  [smilie--sprite2] [BR][BR]Aber der Punkt ist, daß jeder so spielen kann so wie es Spaß machen soll.[BR][BR]Ich war jetzt etwas engagiert dabei, damit ich danach eine relativ lange Zeit meine Ruhe habe, vor mich hin spiele und mich mehr auf [BR]meine Gilde konzentrieren kann.[BR][BR]Würde mir niemals anmassen, die Art oder das Spieltempo meiner Mitspieler zu bewerten."}, {"27": "Hallo, mal nee andere frage, wieviele Trommelensemble muss man eigentlich aufstellen bzw. wieviele von allen!?[BR][BR]@Romilly, Du wirst Dich wohl nie ändern, man kann sowas auch netter schreiben, [smilie--sprite1])"}, {"254": "Hey @Robin7 ![BR]Soweit ich weiß, benötigst du für Stufe 2 ->3 Ensemble, für Stufe 3 ->6 Ensemble und für Stufe 4 ->9 Ensemble.[BR]Und das immer zu gleichen Teilen, also 1 jeweils, 2 jeweils, 3 jeweils (Flöte, Geige, Trommel).[BR]Also letzten Endes insgesamt 18 Ensemble, weil die sich quasi verbrauchen.[BR]Hoffe das passt so (ich bin nämlich noch nicht so weit^^), ansonsten korrigiert mich bitte jemand [smilie--sprite2]"}, {"2": "Robin7 schrieb:\t\t\tHallo, mal nee andere frage, wieviele Trommelensemble muss man eigentlich aufstellen bzw. wieviele von allen!?[BR][BR]@Romilly, Du wirst Dich wohl nie ändern, man kann sowas auch netter schreiben, [smilie--sprite1])\t\tZum Vergrößern anklicken.......steht alles bereits in diesem Feedback - warum sollte ich mich ändern und warum soll ich \"nett\" auf etwas ziemlich \"Unnettes\" reagieren?...[BR][BR]Foggwulf schrieb:\t\t\t700% K-Bonus, wait what?\t\tZum Vergrößern anklicken........falls du es nicht glaubst...[BR][BR][IMG]https://i.ibb.co/K0GM3BX/https-de-forum-elvenar-com-index-php-attachments-kulturbonus-png-31515.png[/IMG]....Edit: hab noch ein paar unverzauberte Pfötchen gefunden...[IMG]https://i.ibb.co/TkWMcMr/https-de-forum-elvenar-com-index-php-attachments-kulturbonus2-png-31516.png[/IMG][BR][BR]...das ergibt fast 5x soviel Unurium aus den Häusern (Siegelturm-Effekt) als wie mit einer normalen Sonne (170 %)..."}, {"255": "edit: ok, jetzt hab ich es wohl gerafft.. ich brauch je 3? OMG.. und ich dachte ich hätte genug Platz [smilie--sprite3][BR][BR]Guten Morgen zusammen,[BR]Ich verzweifle grade an den Ensembles, ich raff hier nichts mehr. Ich habe 6 Ensembles (von jedem 2) und will den Hain auf Stufe 3 ausbauen. Geht nicht... Eingelagert, wieder rausgeholt, nichts tut sich. Wo ist denn mein Denkfehler?![BR][IMG]https://i.ibb.co/nCyD3PG/https-de-forum-elvenar-com-index-php-attachments-hain-jpg-31519.jpg[/IMG][BR][BR]Ps Frage: werden die Accounts für Forum nach einer gewissen Zeit gelöscht? Musste mich neu registrieren ^^"}, {"6": "Es hätte geholfen, diesen Thread von Anfang an mitzulesen.  [smilie--sprite2] [BR]Die alten Ensembles für den vorherigen Ausbau dürfen nicht abgerissen werden.[BR]Also:[BR]Stufe 2: je 1 Ensemble.[BR]Stufe 3: je 2 zusätzliche Ensembles, in der Stadt also je 3 Ensembles aufgebaut[BR]Stufe 4: je 3 zusätzliche Ensembles, also je 6"}, {"255": "ustoni schrieb:\t\t\tEs hätte geholfen, diesen Thread von Anfang an mitzulesen.  [smilie--sprite2][BR]Die alten Ensembles für den vorherigen Ausbau dürfen nicht abgerissen werden.[BR]Also:[BR]Stufe 2: je 1 Ensemble.[BR]Stufe 3: je 2 zusätzliche Ensembles, in der Stadt also je 3 Ensembles aufgebaut[BR]Stufe 4: je 3 zusätzliche Ensembles, also je 6\t\tZum Vergrößern anklicken....Habe ich gelesen. Aber scheinbar war es zu früh, um das zu verstehen [smilie--sprite1]"}, {"4": "Ich finde es schon ziemlich schwierig, die benötigten erleuchteten Güter für die Ensembles zu erlangen. Zum Glück produziert ein Mitspieler für mich die Barren, die auf Welt 1 fast nicht über den Händler zu erhalten sind. So erhalte ich von Zeit zu Zeit ne Menge an Barren von ihm. Ohne diese Hilfe hätte ich noch nicht ein einziges Ensemble stehen. [BR][BR]Mein Hain ist auf 2, je 2 Ensembles hab ich eingelagert und spare jetzt auf die weiteren 3 x 1. [BR][BR]Ich hab jetzt je 5 x Geigenbauer und Trommelbauer stehen, und 3 x die Flöte. Möchte die Lieder mit Geigen und Trommeln produzieren und die Flöte derzeit für das nächste Ensemble und die Forschung benutzen. Und danach eben auch tauschen."}, {"17": "meine Meinung zum 20. Kapitel, sehr bescheiden [BR]So schön die Quest und Gestaltung auch ist, aber für mich ist es das aller letzte das die Produktion der Takte im Hain nichtmal ansatzweise reicht um eine Reihe \"Bauer\" zu versorgen. Sowas nervt ist einfach gewollt das die Portalsegen verbraucht werden, das die jetzt als Standardverbrauchsgut T10 gelten. Sorry dann lasst doch die Alibiproduktion im Hain ganz weg."}]