[{"12": "stone2345 schrieb:\t\t\tmeine Meinung zum 20. Kapitel, sehr bescheiden[BR]So schön die Quest und Gestaltung auch ist, aber für mich ist es das aller letzte das die Produktion der Takte im Hain nichtmal ansatzweise reicht um eine Reihe \"Bauer\" zu versorgen. Sowas nervt ist einfach gewollt das die Portalsegen verbraucht werden, das die jetzt als Standardverbrauchsgut T10 gelten. Sorry dann lasst doch die Alibiproduktion im Hain ganz weg.\t\tZum Vergrößern anklicken....Mit Hain auf Stufe 4 und 18 Ensembles läufts ganz gut; 1-2x 5h-booster per Tag und auch die Lieder gehen so nebenher mit.[BR]War ja auch bei früheren Kapiteln so, daß die Verhältnisse mit nicht voll ausgebautem Portal ziemlich unausgewogen waren; diesmal vielleicht ein bißchen extremer.[BR]Allerdings die Mana-Forderungen sind sehr hoch, da reichte mein Vorrat nicht ganz. Vielleicht kann ich alle meine Stahlwerke ausbauen, wenn ich im GA mal ordentlich Mag.Mitgift ausgebe.[BR]Mein Vorrat an Saat reichte gerade, und bei den Orks wird's wohl auch so werden."}, {"23": "meine Portalos werden wohl nicht reichen [smilie--sprite3][BR]aber ich werde den Hain nicht auf lvl 4 ausbauen (mein Wirbel reicht)[BR]hoffe, meine Strategie geht auf...[BR]habe bisher immer die storyline gespielt, diesmal sehe ich es nicht ein"}, {"19": "Ich fand das Kapitel sehr ..... gemütlich [smilie--sprite1] [BR][BR]Mir fehlen nur noch ein paar Wps für das letzte Wunder im FB[BR]Fr./Sa. starte ich das Turnier - wegen Eisbär - dann war es das mal wieder [smilie--sprite6][BR][BR]Portalbonus - hatte ich genug - ging aber sowas von weg - deshalb stehen auch [BR]8 Handelsstationen - die produzieren schon mal für die Zukunft  [smilie--sprite2]"}, {"91": "Ich war am Forschungsende angekommen und konnte auch schon sparen, aber zur Erweiterung der Perspektive:[BR]Ich habe kein Unuriumwunder, kein Handelszentrum, keine Türme des Sonnenuntergangs, Labyrinth und andere ressourcenschonende Wunder. Ohne die waren meine Bestände an Unurium, Saat, Erw./erl. Gütern schnell aufgebraucht und für alles, was ich tue, brauche ich eine Weile zur Produktion der verlangten Dinge. [BR]Diese erhöhte Wartezeit nehme ich aber in Kauf und kann sagen, dass es bisher (Hain Stufe2) nicht annähernd so ermüdend ist wie Kapitel 19. Damals braucht ich auch lange für die Brutstätten, aber das war nichts gegen das wochenlange Warten auf Kreaturen danach. Mal schauen, ob die zweite Kapitelhälfte von 20 ähnlich zäh oder geschmeidiger wird."}, {"4": "Ich habe jetzt das Portal auf 3 und die Ensembles abgerissen. Zum Einlagern fehlten mir die Portals, die sehr geschmolzen sind und zum Stehen lassen habe ich den Platz absolut nicht. Stehen ja noch Dschinns und Wunschbrunnen. Die mir recht gut geholfen haben mit Saat und Mana, wobei ich immer noch einen Manaüberschuss von knapp 7 Mio habe.[BR][BR]Die jetzt anstehenden Forschungen sind die für die Gut 1 Manus, die jeweils 7 Lieder brauchen und konkurrieren mit den Instrumenten, die für die Forschung selbst gebraucht werden. Aber da kann ich jetzt auch ein wenig warten, nicht schlimm.[BR][BR]Auf jeden FAll spielt sich das Kapitel deutlich besser als die bl... Händler und auch besser als Kapitel 18 und 19. 19 war ein absoluter Platzfresser, aber immer noch deutlich angenehmer zu spielen als die Händler. Insofern, alles gut."}, {"12": "Bin heute mit dem Kapitel fertig geworden, es war sehr angenehm zu spielen, ich denke das angenehmste seit langem.[BR]Abgesehen von einem Tag konnte ich immer generierte WPs (auch die vom Turnier) im Forschungsbaum unterbringen, was es vermutlich so angenehm machte. Dabei gut planbare Produktionszeiten.[BR]Platzbedarf ist ziemlich hoch, aber das ist man ja inzwischen bei den Gastrassen gewöhnt, insofern kein Problem.[BR]Anfangs hab ich sehr viele Portalsegen verbraucht bis der Hain auf Stufe 4 war, danach nur noch einige Zeit-booster.[BR]Bei Saat und Mana haben meine Ressourcen grade noch so gereicht (bei Mana war ich gegen Ende auf mein Drachenkloster angewiesen), die anderen Güter sind zwar geschrumpft aber ohne auf einen kritischen Bestand zu sinken.[BR]Die Storyline hab ich kaum verfolgt, aber die Quests gemacht.[BR]Die Ruhestätte der Ahnen hab ich inzwischen auf Stufe 6, ich hoffe sie bis zum nächsten Kapitel auf 30 zu bekommen. Und ich hab jetzt mal eine Menge Orknester aufgestellt um da etwas aufzustocken.[BR]Dann laß ich mich überraschen, ob das nächste Kapitel auch so gut wird."}, {"58": "Also ich finde auch, dass das Kapitel sehr angenehm zu spielen ist.[BR]Ich hab eine Frage zum Hain (und hoffe, dass ich das auf den vorherigen Seiten nicht überlesen habe):[BR]Wenn ich den Hain auf Stufe 4 hab, muss ich dann die Ensemble noch stehen lassen oder kann ich sie abreissen und den Platz für Instrumentenbauer nutzen? Also \"funktioniert\" der Hain auf Stufe 4 ohne Ensemble?[BR]Im Moment hab ich ihn auf Stufe 2 und mich noch für keine konkrete Taktik entschieden...."}, {"2": "Haseli schrieb:\t\t\tAlso ich finde auch, dass das Kapitel sehr angenehm zu spielen ist.[BR]Ich hab eine Frage zum Hain (und hoffe, dass ich das auf den vorherigen Seiten nicht überlesen habe):[BR]Wenn ich den Hain auf Stufe 4 hab, muss ich dann die Ensemble noch stehen lassen oder kann ich sie abreissen und den Platz für Instrumentenbauer nutzen? Also \"funktioniert\" der Hain auf Stufe 4 ohne Ensemble?[BR]Im Moment hab ich ihn auf Stufe 2 und mich noch für keine konkrete Taktik entschieden....\t\tZum Vergrößern anklicken.......sowie der auf 4 ist, kannst du die Ensemble verkaufen (außer dir fehlen noch die entsprechenden Quests) - mit dem Ausbau auf Stufe 4 kannst du ein weiteres \"Lied\" komponieren (mit nem Einhorn-Bild), bei dem dem du alle 3 Instrumente brauchst - kontrollier mal deine Instrumentenproduktion, mit welchen Liedern du am besten auskommst (ich hatte zum Schluß komplett auf nur Einhörner umgestellt - ging sehr schön aus)...ich hatte von den Instrumenten-Bauern jeweils 4 Stück stehen...die Ensemble brauchst du aber nur für den Ausbau des Hains und falls du die Takte produzieren willst (also keine Portalsegen verwenden)..."}, {"12": "Haseli schrieb:\t\t\tAlso ich finde auch, dass das Kapitel sehr angenehm zu spielen ist.[BR]Ich hab eine Frage zum Hain (und hoffe, dass ich das auf den vorherigen Seiten nicht überlesen habe):[BR]Wenn ich den Hain auf Stufe 4 hab, muss ich dann die Ensemble noch stehen lassen oder kann ich sie abreissen und den Platz für Instrumentenbauer nutzen? Also \"funktioniert\" der Hain auf Stufe 4 ohne Ensemble?[BR]Im Moment hab ich ihn auf Stufe 2 und mich noch für keine konkrete Taktik entschieden....\t\tZum Vergrößern anklicken....Ja, kannst Du, allerdings wirst Du dann wieder auf Portalsegen angewiesen sein.[BR]Ich hatte auch je 4 Instrumentenbauer stehen, konzipiert ist das Kapitel aber glaub ich auf je 3."}, {"4": "Ich hab noch 5 Forschungen vor mir, den Hain auf 3 und die Ensembles abgerissen. Der Hain bleibt damit auf 3, ich kann die Quests nicht durchspielen, erspare mir aber ziemliche viele Ressourcen. Ob ich damit letztlich langsamer bin, mag ich mal dahin gestellt lassen. [BR][BR]Ich hab halt noch ca. 30 Wunschbrunnen/Dschinn/Göttinnen stehen und mir fehlt daher der Platz, um alle Ensembles zu stellen. So habe ich eben meine Entscheidung getroffen, mit dem Hain auf 3 zu Ende zu spielen und ich denke, das war keine schlechte Entscheidung. [BR][BR]Ich schätze mal, max. noch 14 Tage, dann bin ich durch."}, {"58": "vielen Dank für eure Antworten. Also Portalsegen hab ich noch einige aber keine Ahnung ob ausreichend. Die Questreihe muss ich nicht durchspielen. [BR]Mir würde der Hain auch auf Stufe 3 reichen, für die letzten zwei Forschungen braucht es jedoch 7500 Takte. Bringt das der Hain auf Stufe 3?[BR]Ich hab halt überlegt zunächst den Hain auszubauen und dann Instrumentenbauer aufstellen, wobei dass mit dem \"Einhorn-Lied\" ein guter Tipp ist. Mir kommt es jetzt auch nicht unbedingt auf die Zeit an. Bin eh schon positiv überrascht, wie schnell es vorwärts geht.[BR]Aber ehrlicherweise nur mit Portalsegen.[BR]Nochmals  vielen Dank"}, {"2": "Haseli schrieb:\t\t\tfür die letzten zwei Forschungen braucht es jedoch 7500 Takte. Bringt das der Hain auf Stufe 3?\t\tZum Vergrößern anklicken.......nein - nur wenn du einen Wirbel der Aufbewahrung auf mindestens Stufe 14 hast..."}, {"58": "okay, danke, dann also  Stufe 4"}, {"30": "Wie schon so oft bei meinen seltenen Feedbacks angemerkt, ist meine Spielweise nicht zwingend üblich, daher kann meine Einschätzung nicht mit jeder Sichtweise übereinstimment.[BR]Ich bin zwar (vermutlich) lange noch nicht durch, aber nach den vielen bereits erfolgten Meldungen hier im Thread möchte auch ich bereits eine erste Rückmeldung geben.[BR][BR]Grundsätzlich finde ich das Kapitel sehr gelungen. Es ist eine spannende Herausforderung, weil bereits während der Gastrasse soviele Ausbauten, Kombinationen mit den Instrumentenbauern und die übliche Koordination der GR Güter bedacht werden muss. [BR][BR]Über den immensen Platzbedarf ist hier schon genug gesagt/geschrieben worden  - hier sollten vielleicht tatsächlich mal die Grössen der Gebäude überdacht werden. Ich finde den Hain und auch die Ensembles einfach zu überdimensional.[BR][BR]Da ich immer sehr minimalistisch spiele, keine Ressourcen anhäufe und meine Produktionen eigentlich immer gerade mal so reichen und selten gebunkert werden, waren auch die Mengen an Gütern, Saat und Unurium eine Herausforderung - aber selbst bei meinen Produktionsmengen machbar.[BR][BR]Die Dauer und Produktionsmengen der Instrumentenbauer fand ich ok. Für die Güterproduktionen benötigt man ohne „pushing“ ohnehin die entsprechende Zeit. Also ohne die Ambitionen, schnell durch die Gastrasse zu kommen, ist das Zusammenspiel der Produktionen stimmig (aus meiner persönlichen Sicht).[BR][BR]Wenn man wie ich auch die Questline durchspielen will  - auch das ist eine entsprechende Herausforderung, der ich mich stellen möchte - stellt man nicht zu Beginn gleich zig Instrumentenbauer auf (konnte ich wg mangelnder Ressourcen und dem startenden GA auch gar nicht). Ich habe entspannt mit 3 Bauern gestartet, dann reicht auch die Menge der produzierten Takte bei unausgebautem Hain und man verbrät nicht gleich zu Beginn so viele Portalsegen. Da ich die eigentlich nie in der Aka produziere, sondern nur auf Event und Gebäude Portalsegen zurückgreifen kann, ist die Menge bei mir deutlich geringer, als die hier zum Teil genannten. Dennoch hoffe ich, das die vorhandene Menge bis zum Ende der Gastrasse ausreichen wird und ich somit keine Produktionen im Hain machen muss.[BR][BR]Derzeit arbeite ich am Quest mit den 6 Ensembles, bin gleichzeitig im FB bei der Marmor/Stahl/Holz Upgrade Freischaltung. Hier zeigt sich, das ich im Zusammenspiel mit der Questline eindeutig viel zu weit bin.[BR][BR]Womit ich bei der Questline bin...[BR]Hält man sich an die dort geforderten Mengen von Bauern, Ensembles etc, kommt man mit den Ressourcen und Produktionen durchaus glatt durch. Was mir wieder einmal nicht an der QL gefällt, sind die Anforderungen, welche zum Teil (immer ohne Pushing von Zeit und Gütern) bis zu einer Woche dauern. Warum muss die Forderung nach 3 und 6 Ensembles innerhalb eines Quests erfolgen? Ich wünschte mir hier mehr Abwechslung. Die 3 gleichzeitig waren noch ok, benötigte man die ja für den Ausbau des Hains. Man hätte dann zwischendurch durchaus bereits Ensemble Nr. 4, etwas später Nr. 5 und dann 6 fordern können.[BR][BR]Wenn die bei iDavis hinterlegte QL korrekt ist, kommt bereits kurz darauf die Forderung nach 12 Ensembles. Also nicht nur 3 zusätzliche, sondern gleich 6. Ich bin da bereits auf 3 Wochen eingestellt. Was ich in der hinterlegten QL sogar nicht nachvollziehen kann, ist die Forderung nach 15 Ensembles. Ok, erhöht die Taktproduktion, aber gerade Spieler in den oberen Kapiteln sollten über Portalsegen verfügen und nicht zwingend auf die Hainproduktion der Takte angewiesen sein. Für mich ein eindeutig überflüssiger Quest.[BR][BR]Keine Ahnung, ob die Anforderungen für die Menge an Bauern und Ensembles hier schon irgendwo genannt wurde (ich meine nicht, die persönlichen Einschätzungen, wie viele man haben sollte) -für die hinterlegten QL werden 9 Instrumentenbauer und 15 Ensembles benötigt. [BR][BR]Wenn ich es korrekt verstanden habe, reichen für den Ausbau des Hains auf Stufe 4 lediglich 12 Ensembles. Aufgrund der Größe, der Existenz von Portalsegen halte ich die geforderte Menge von 15 für zu hoch. Bei 9 Instrumentenbauern sollten auch 12 durchaus ausreichen. Wer mehr hinstellen möchte/kann, der mag das tun, sollte sich dann aber nicht über die geforderten Ressourcenmengen oder den Platzbedarf beklagen. Für mich reicht alleine wegen der Ressourcenproduktion die Mindestmenge aus.[BR][BR]Auch die hinterlegten Produktionsquests für erleuchtete Güter, die gar nicht meine Bonigüter sind, finde ich unglücklich. Da es keine extremen Mengen sind, noch im Akzeptanzbereich, aber hier könnte man das evtl auf die entsprechenden Bonigüter umstellen (falls technisch machbar).[BR][BR]Mein Wunsch für die Questline wäre mehr Abwechslung und weniger Quests, die dann tagelang in der Schleife hängen. [BR][BR]Ob die auf iDavis hinterlegte QL auch weiterhin so passt, kann ich nicht beurteilen. Falls es andere Anforderungen gibt, als ich hier aufgeführt habe, bitte ich um entsprechende Korrektur meiner Angaben. [BR][BR][BR]Vielleicht hilft meine Darstellung anderen Spielern, die völlig unterschiedliche Bewertung der anderen Kommentare, besser zu beurteilen. Wenn man schnell durch die GR will, ist die QL schlicht über, man sollte ausreichend Manus für die Güter, Unurium und Saatproduzenten und Reserven an Portalos haben. Wenn man sich an die QL hält, dauert es länger, läuft aber eigentlich (Ausnahmen s.o. wg der QL Anforderungen) recht flüssig durch. Ich hänge jetzt nur, weil ich den Ensemblebau zurückgestellt hatte und die Forschungen, welche laut QL Line erst später kommen, vorgezogen hatte. Mein Fehler ... [smilie--sprite3][BR][BR][BR]Zeit ist relativ [smilie--sprite2] - also warum hetzen?[BR][BR]LG Marloy"}, {"2": "Marloy schrieb:\t\t\tWenn ich es korrekt verstanden habe, reichen für den Ausbau des Hains auf Stufe 4 lediglich 12 Ensembles.\t\tZum Vergrößern anklicken.......nein - da brauchst du 18...von jedem 6 Stück..."}, {"30": "Romilly schrieb:\t\t\t...nein - da brauchst du 18...von jedem 6 Stück.\t\tZum Vergrößern anklicken....Na toll ... [smilie--sprite11][BR]Danke für die Info.[BR]Dann ist die Anforderung in der QL mit 15 ok (bleibe aber dabei, das diese Platzverschwendung bei den Gebäudegrössen von Hain und Ensembles definitiv too much ist)"}, {"29": "Bereits gebaute und noch nicht gebrauchte Ensembles könnte man ins Inventar verschieben. Das spart für eine gewisse Zeit Platz ein. Muß ich aber erst noch testen, ob das praktikabel ist."}, {"30": "65536 schrieb:\t\t\tBereits gebaute und noch nicht gebrauchte Ensembles könnte man ins Inventar verschieben. Das spart für eine gewisse Zeit Platz ein. Muß ich aber erst noch testen, ob das praktikabel ist.\t\tZum Vergrößern anklicken....[BR]Macht lediglich während der Bauphase Sinn, es müssen ja für den Hain Ausbau in jedem Fall erst mal alle Ensembles stehen. Wer problemlos Platz für 9 Ensembles hat (Ausbau auf 3 ??) kann die solange parken, bis die nächsten 9 fertig sind (dauert ja sowieso lange) und dann nur einmal in der Stadt Platz für Stufe 4 machen. Das bedarf dann bereits 9 Teleporter für die Ensembles und später noch einige für den Platz. Bei mir wird es definitiv bereits ab 11 Ensembles eng. Das erklärt dann, warum viele nur bis Stufe 3 ausbauen wollen und auf die Quest Line pfeifen.[BR]Ich versuche jetzt für meine Eventstadt die aufgewerteten Gebäude Typen beim Halloween Event neu zu bekommen. Dann reisse ich die alten ab und stelle die neuen erst später wieder auf. Muss dann halt zusehen, das ich ein paar Wochen mit weniger Kultur und Bevölkerung klarkomme, spart aber Teleporter.[BR][BR]Zerstört voll meine sorgfältig geplante Event Stadt .... Schluchz ..."}, {"2": "65536 schrieb:\t\t\tBereits gebaute und noch nicht gebrauchte Ensembles könnte man ins Inventar verschieben. Das spart für eine gewisse Zeit Platz ein. Muß ich aber erst noch testen, ob das praktikabel ist.\t\tZum Vergrößern anklicken.......ja ist es - ich hab die alle einzeln gebaut, ins Inventar, dann gestaffelt aufgestellt (hab die erweckten Manus eingelagert, die standen zum Saatsparen sowieso still), den Ausbau gestartet und dann konnte ich alles verkaufen - Portalsegen hatte ich genug - und auch Teleporter..."}, {"54": "Wenn man im Portal auf 1 auf \"Ausbau\" zu 2 klickt, bekommt man als Voraussetzung je 1 Melodie, eine musikalische Begleitung und 1 Rhytmus angezeigt. warum muss man dazu je 2 Ensembles bauen ?[BR]Gibt nicht jedes Ensemble je eine Melodie/Begleitung/Rhytmus ab ?[BR][BR] Beim Ausbau auf 3 steht da je 2 Voraussetzung, baut man je 2 Ensembles auf, werden trotzdem je 1 fehlender angezeigt, mann müsste also je 3 aufstellen ?[BR][BR]Ist das ein Schreibfehler oder steh ich auf dem Schlauch?"}]