[{"2": "ustoni schrieb:\t\t\tEs hätte geholfen, diesen Thread von Anfang an mitzulesen.  [smilie--sprite2][BR]Die alten Ensembles für den vorherigen Ausbau dürfen nicht abgerissen werden.[BR]Also:[BR]Stufe 2: je 1 Ensemble.[BR]Stufe 3: je 2 zusätzliche Ensembles, in der Stadt also je 3 Ensembles aufgebaut[BR]Stufe 4: je 3 zusätzliche Ensembles, also je 6\t\tZum Vergrößern anklicken...."}, {"54": "wie auch immer ist es verwirrend geschrieben, man hätte ja, wie sonst auch immer, beim Klick auf den Ausbau genau das herauslesen können, was wirklich gefordert ist, wie bei allen anderen Kapiteln vorher auch."}, {"29": "Das mit dem Einlagern werde ich so machen. Zusätzlich habe ich gedacht, alle Gastrassengüter (von Bauern) bis kurz vor dem Ausbau des Hains auf Stufe 4 hergestellt zu haben. So daß die Bauern abgerissen werden können und noch mehr Platz zur Verfügung steht - für die Aufstellung der insgesamt 18 Ensembles. Für die letzten beiden verbleibenden Forschungen sind die Flöten, Geigen und Trommeln angespart."}, {"2": "65536 schrieb:\t\t\talle Gastrassengüter (von Bauern) bis kurz vor dem Ausbau des Hains auf Stufe 4 hergestellt zu haben. So daß die Bauern abgerissen werden können und noch mehr Platz zur Verfügung steht\t\tZum Vergrößern anklicken.......das würde ich nicht so machen - der Ausbau auf 4 hat bei mir zwar keine Produktionssteigerung mehr gebracht (die Portalsegen bringen aber mehr), aber du erhältst auf Stufe 4 ein weiteres Lied, welches für mich besser zu meinen Beständen/Produktionen gepasst hat...rechne dir doch mal durch, wie du mit den Produktionen hin kommst und wie das zum Platzbedarf des kommenden GAs passt (in ca. 2-3 Wochen)...sowie du was verkaufen kannst, bekommst du Saat und Orks zurück..."}, {"29": "Gut, muß ich dann sehen wenn es soweit ist. Meine Rechnung hat sogar ergeben, wenn ich keinen Fehler gemacht habe, daß das gesamte Kapitel nur mit dem Hain Stufe 2 durchgespielt werden könnte, ohne das es wesentlich länger dauern würde. Aber leider stellt die Forschung die Anforderung des Ausbaus. Und noch was - die ideale Spielzeit scheint 100 Tage zu sein, zumindest für meine Stadt."}, {"4": "Baue eines der drei neuen Kulturgebäude, siehe Anhang[BR][BR]Genau das habe ich getan, habe die Verheirateten Waldhäuser gebaut. Nur, die zählen nicht. Das \" i \" gibt als Info: Baue Glückliche Waldhäuser oder den Schrein der Trolle.[BR][BR]Insofern bitte ich doch sehr, den Text so abzuändern, dass im Text bereits ersichtlich ist, was verlangt wird. Außerdem sind es nur 2 Möglichkeiten und nicht, wie angegeben, drei.[BR][BR]Jetzt habe ich die Verheirateten Waldhäuser gebaut, um den Quest zu beenden. Nur, die nützen nichts, denn nach Abschluss des Kapitels habe ich Unurium im Überfluss, dank des Events und den Truhen im Turm. Mein Siegelturm baut gerade auf 18 aus."}, {"103": "könntest Du noch einen Screenshot vom offenen \"i\" machen bitte ?"}, {"24": "^So... nachdem ich kurz vor dem Ende des Kapitels stehe: Es hat Spaß gemacht und ich fand das Kapitel gut. Warum ?[BR][BR]1. Es spielte sich erheblich lockerer. Ich hatte das Gefühl zu sammeln und zu spielen, nicht zu rackern wie im Kapitel davor.[BR]2. Der Platz-, Mana- und Samenbedarf blieb kontinuierlich hoch - Aber das ist durchaus sinnig. Nun weiss man wozu man die Sachen produziert.^^[BR]3. In diesem Kapitel hat es sich zum ersten mal so angefühlt, das man die erleuchteten Güter WIRKLICH braucht.[BR]4. Es hat einen ziemlich herben Einschnitt in meine Portalsegenvorräte gegeben um nicht soviel Mana raushauen zu müssen... Gut so ! So fühlt sichs an als wären die Dinger mal was wert.[BR][BR]Kritikpunkt: Die letzten Ensembles inklusive der zugehörigen Mission fühlen sich wie ein künstliches Hinderniss an - Man baut produktionsfördernde Gebäude, die man eigentlich nicht braucht, die aber einen Haufen Kram kosten... Und die man einlagert oder gleich wieder abreisst, weil man sie nur zum letzten Portalausbau kurz auspackt um die Wunderforschungen freizuschalten. Das ist... Doof. Ich fänds besser es entweder bei 12 Ensembles zu belassen (ohnehin schon mehr als ich brauche), oder aber tatsächlich die Mission etwas vorzuziehen, damit die Ensembles einem auch noch was BRINGEN..."}, {"12": "Feytala1986 schrieb:\t\t\tKritikpunkt: Die letzten Ensembles inklusive der zugehörigen Mission fühlen sich wie ein künstliches Hinderniss an - Man baut produktionsfördernde Gebäude, die man eigentlich nicht braucht, die aber einen Haufen Kram kosten... Und die man einlagert oder gleich wieder abreisst, weil man sie nur zum letzten Portalausbau kurz auspackt um die Wunderforschungen freizuschalten. Das ist... Doof. Ich fänds besser es entweder bei 12 Ensembles zu belassen (ohnehin schon mehr als ich brauche), oder aber tatsächlich die Mission etwas vorzuziehen, damit die Ensembles einem auch noch was BRINGEN...\t\tZum Vergrößern anklicken....Kommt ganz auf den Spielstil an. Ich hab meinen Hain so schnell es ging auf Stufe 4 gebracht und die 18 Ensembles mehr als die Hälfte der Zeit vom Kapitel stehen gehabt. So brauchte ich nur noch einige Zeit-booster und nur in Ausnahmefällen Portalsegen. Als ich wegen dem GA 5 Ensembles einige Tage einlagerte hab ich das im Hain merklich gespürt."}, {"4": "littleFlex schrieb:\t\t\tkönntest Du noch einen Screenshot vom offenen \"i\" machen bitte ?\t\tZum Vergrößern anklicken....[IMG]https://i.ibb.co/HPMwTKT/https-de-forum-elvenar-com-index-php-attachments-bild-2022-10-26-201239574-png-31784.png[/IMG][BR][BR]Habs geschafft, hier ist der gewünscht Screenshot"}, {"103": "Danke, schau mal, ob der Questtext nun stimmt"}, {"4": "Cookies gelöscht und neu gestartet, wurde sogar upgedated. Beim Browser schließen löschen sich automatisch sowieso alleCookies. Im Augenblick hat sich  noch nix geändert.[BR][BR]Ich guck morgen früh nochmals. Vielleicht auch , weil der Quest ja bei mir sowieso offen ist?"}, {"103": "die Textänderung erfolgt mit dem nächsten Update"}, {"60": "Hallo liebe Mitstreiter, Mitstreiterinnen des Kapitel 20,[BR][BR]ich habe eine Frage bzgl. des Hains. Ich habe dazu bereits den Post [BR]#329 vom 16.10.2022 gefunden und eigentlich beantwortet dieser meine Frage. Da ich aber sehr ängstlich bin mit dem Abreißen, von egal welchen Gebäuden, frage ich noch mal nach, ob die Ensemble sämtlich (18 Stück) abgerissen werden dürfen. Ich habe nur noch 5 Forschungen vor mir, den Hain gerade auf Level 4 gebracht und mache seit Beginn die Takte mit Portalsegen. Die Questline spiele ich auch komplett durch.[BR][BR]Ich wäre den Spielern dankbar für einen Antwort, die das so gemacht haben, wie ich es auch machen möchte - also darf ich abreißen ohne irgendwas zu verlieren, vom Taktebonus abgesehen? [BR][BR]Herzliche Grüße, Kamajo"}, {"254": "Da du die StoryQuests durchspielen willst, solltest du deinen Hain vorerst stehen lassen.[BR]Diesen musst du in Quest Nr. 88 dann abschließend verkaufen.[BR]Aller Erfahrung nach, würde ich dies auch erst tun, sofern das in einem Quest gefordert wird.[BR]Wir alle wissen, was schief gehen kann.[BR]Für Quest Nr. 73 benötigst du noch mindestens 15 Ensembles, d.h. wenn du mit der Story noch nicht so weit bist, mit der Forschung aber schon weiter und denkst die Ensembles nicht mehr zu gebrauchen, dann Obacht ;P[BR][BR]Ich bin ein Spieler, der es nicht so machen würde und auch nicht machen wird wie du.[BR]Ich möchte einfach etwas genügsamer durchs Kapitel und spare dadurch auch noch ein paar Portalsegen und hetze nicht so durch die neue Gastrasse, gerade wenn man die Wartezeit zur nächsten Gastrasse im Auge behält, kann man sich schon ausrechnen, dass danach mindestens ein halbes Jahr Ruhe sein wird. Es ist halt jedem selbst überlassen, wie man dies bewertet.[BR][BR]Zur Beantwortung deiner Frage ;P[BR]In diesem, deinen Fall:[BR][BR]!JA! du kannst die Ensembles abreißen unter Berücksichtigung von Quest Nr. 73 und 88![BR]Da du erstens deinen Hain der Harmonie bereits auf Stufe 4 ausgebaut hast (ergo benötigst du die MelodienBegleitungen nicht mehr) und zweitens betont hast, dass du deine Takte ausschließlich mit Portalsegen herstellst. Was ich zwar nicht so machen würde, weil ich jeden Tag noch Mana produziere und quasi umsonst Takte nebenher produziere. Ich denke da halt schon an eine neue Gastrasse, weil Inno uns die sorgsam gebunkerten Ersparnisse nichtig machen will xD[BR][BR]Mein Tipp für die Zukunft für dich, das kannst du halten wie du willst:[BR]Reiß doch einfach mal ein Gebäude ab (dann weißt du ganz genau was passiert, im Übrigen kommt vorher noch ein Warnungstext zur Info) oder teleportiere es, diese Erfahrung haben wir alle mal gemacht und gesagt autsch, daraus lernt man aber normalerweise und hoppelt nicht mehr so verängstigt wie ein niedliches Karnickel durch diese große weite Welt ;P[BR][BR]Und die Tipps die du dir von anderen holst, die werden natürlich immer gerne weitergereicht, jedoch solltest du bei deinem Kapitelfortschritt allmählich deine eigenen Quellen haben, um dir genau diese Infos herauszufiltern.[BR]Stichwort Selbständigkeit ;P Ich meins nur gut^^[BR][BR]Komm gut durchs Kapitel!"}, {"60": "Danke für die Antwort, aber du hast vieles von meinem Text nicht richtig verstanden. Zum einen bin ich schon längst über die Quest mit den Ensemble raus und zum zweiten geht es mir ausschließlich darum, ob ich die Ensemble abreißen kann. Den Hain selbstverständlich nicht, denn ich bin ja nicht dumm. Und was passiert, wenn man was abreißt, habe ich auch schon zu genüge gespürt... Deine Fettschreiberei und deine Belehrungen hättest du dir sparen können. Ich bin selbstständig und habe auch viel nachgelesen, dennoch sei mir und jedem anderen erlaubt sich nochmals rückzuversichern. Wenn das nicht mehr gewünscht ist, dann ist ein Forum nutzlos! Und... mein Mana nutze ich für sinnvolleres, als es für eine Gastrasse auszugeben, wenn Portalsegen zu Hauf vorhanden sind und diese endlich mal wieder einen echten Nutzen haben.  [smilie--sprite2][BR][BR][BR]Vielleicht mag ja noch jemand anderes antworten, der das Kapitel bereits durchgespielt hat.[BR]Danke vielmals im Voraus."}, {"2": "Kamajo schrieb:\t\t\tVielleicht mag ja noch jemand anderes antworten, der das Kapitel bereits durchgespielt hat.[BR]Danke vielmals im Voraus.\t\tZum Vergrößern anklicken....[BR]...ja - du kannst die Ensemble abreissen bzw. verkaufen und bekommst dann Saat und Orks zurück, die du vielleicht anderweitig gut gebrauchen kannst...[BR][BR]...ich hatte die sofort nach dem Ausbau abgerissen - das war am 2.10. - fertig mit dem Kapitel war ich erst am 8.10."}, {"60": "Danke @Romilly [smilie--sprite1][BR]...genau das hätte als Antwort gereicht.  [smilie--sprite2]"}, {"254": "Kamajo schrieb:\t\t\tdenn ich bin ja nicht dumm\t\tZum Vergrößern anklicken....habs wohl etwas verkompliziert, guckt nicht jeder durch  [smilie--sprite8][BR]Kamajo schrieb:\t\t\thabe auch viel nachgelesen\t\tZum Vergrößern anklicken....wirklich wirklich?! [smilie--sprite11][BR]Kamajo schrieb:\t\t\tDeine Fettschreiberei und deine Belehrungen hättest du dir sparen können\t\tZum Vergrößern anklicken....ganz klar missverstanden, ich wollte hervorheben [smilie--sprite7][BR]Kamajo schrieb:\t\t\terlaubt sich nochmals rückzuversichern\t\tZum Vergrößern anklicken....klar kannst du jederzeit machen, angsthäschen^^[BR]Kamajo schrieb:\t\t\tnicht mehr gewünscht ist, dann ist ein Forum nutzlos\t\tZum Vergrößern anklicken....wer sagt das?! [smilie--sprite9][BR]Kamajo schrieb:\t\t\tdu hast vieles von meinem Text nicht richtig verstanden\t\tZum Vergrößern anklicken....du scheinbar auch nicht von meinem [smilie--sprite6][BR]Kamajo schrieb:\t\t\tZum einen bin ich schon längst über die Quest mit den Ensemble raus\t\tZum Vergrößern anklicken....hast du nicht geschrieben![BR]Kamajo schrieb:\t\t\tzum zweiten geht es mir ausschließlich darum, ob ich die Ensemble abreißen kann\t\tZum Vergrößern anklicken....alles klar, eigennütziger Egoismus, wie er im Buche steht [smilie--sprite4][BR]Kamajo schrieb:\t\t\tVielleicht mag ja noch jemand anderes antworten, der das Kapitel bereits durchgespielt hat.\t\tZum Vergrößern anklicken....und dafür hab ich jetzt meine Lebenszeit geopfert, na vielen Dank auch, du Undankbarer Mensch [smilie--sprite5][BR]Romilly schrieb:\t\t\tja - du kannst die Ensemble abreissen\t\tZum Vergrößern anklicken....wenn man meinen Beitrag gelesen hätte und sich nicht direkt vor den Kopf geschlagen fühlte, hätte man es verstanden! [smilie--sprite11][BR]Romilly schrieb:\t\t\tich hatte die sofort nach dem Ausbau abgerissen - das war am 2.10. - fertig mit dem Kapitel war ich erst am 8.10.\t\tZum Vergrößern anklicken....schon wieder diese Angeberei, im Übrigen sind die Kapitel mit Sicherheit nicht so ausgelegt, zum Kotzen [smilie--sprite4][BR]und es spielt nur ein kleiner Prozentsatz die Kapitel so, wie ihr es tut![BR]Romilly schrieb:\t\t\tOrks\t\tZum Vergrößern anklicken....braucht kein Mensch und kein Elf, wenn man richtig spielt [smilie--sprite6][BR]und außerdem sieht man das direkt wenn man einmal mit dem Dollarzeichen des Cursors auf da Gebäude klickt, doch nicht so schlau was?! [smilie--sprite8][BR]Kamajo schrieb:\t\t\tgenau das hätte als Antwort gereicht\t\tZum Vergrößern anklicken....Unverschämtheit!!! [smilie--sprite4][smilie--sprite4][smilie--sprite4][BR]Kamajo schrieb:\t\t\tein Mana nutze ich für sinnvolleres, als es für eine Gastrasse auszugeben\t\tZum Vergrößern anklicken....komplett Auslegungssache ... viele andere würden es anders sehen [smilie--sprite7]"}, {"103": "Bitte hier einfach mal alle tief durchatmen,[BR]bevor weitergeschrieben wird...[BR][BR]Es muss auch nicht in einer Weltmeisterschaft des Zitierens enden !"}]