[{"133": "littleFlex schrieb:\t\t\tEs muss auch nicht in einer Weltmeisterschaft des Zitierens enden !\t\tZum Vergrößern anklicken....liest sich gut, besser als Blocktexte. [smilie--sprite1]"}, {"197": "Für mich persönlich ist dieses Kapitel völlig sinnbefreit, 18 Ensembletrümmer stellen zu müssen, wo wohl bei jedem chronischer Platzmangel herrscht, was bedeutet, entweder ich verkaufe Gebäude um Platz zu schaffen, es sei denn ich habe genügend Teleporter. Da bleibt dann die normale Produktion auf der Strecke. Diese Gastrassen werden immer größer und sinnbefreiter."}, {"4": "einfach nicht machen. Ich habe das Portal auf 3, Wirbel auf 21. Geht klasse, bin viel früher fertig, da ich die Ressourcen für die restlichen Ensembles nicht auftreiben muss. [BR][BR]Portalos sind immer noch sehr viele vorhanden, ich hatte zwar anfangs über 400 5er verbraucht, aber nach Ausbau auf 2 und dann auf 3 des Portals wurde der Bedarf doch sehr eingeschränkt. [BR][BR]Insgesamt habe ich rund 450 5er und über 200 10er Portals verbraucht und nur mit Portalos die Texte gemacht. Spart Ressourcen"}, {"197": "leider ist mein wirbel noch nicht so weit und die Ressourcen die da verlangt werden sind ja schon unverschämt und insgesamt 18 ist sehr grenzwertig bei der größe"}, {"30": "HerrderWelten schrieb:\t\t\tBeim Ausbau auf 3 steht da je 2 Voraussetzung, baut man je 2 Ensembles auf, werden trotzdem je 1 fehlender angezeigt, mann müsste also je 3 aufstellen ?\t\tZum Vergrößern anklicken....Ich betrachte die Darstellung auch als extrem unglücklich, wenn sie nicht eventuell doch fehlerhaft sein sollte. Da inzwischen viele der Spieler hier in den Kommentaren mit der GR durch bzw. fast durch sind (ob nun mit Portal auf 3 oder 4), bestätigen mir die Kommentare auch, das 18 Ensembles zum Ende hin reichlich überflüssig sind. Bei den in der QL geforderten 15 Ensembles wären die Anforderungen für den letzten Portalausbau zu diesem Zeitpunkt sinniger. [BR][BR]WENN die Anforderung von 18 Ensembles korrekt so geplant gewesen sein sollte, müsste auch aus meiner Sicht die Darstellung im Ausbaufenster geändert werden - Also für Ausbau auf Stufe 2 wird je ein Ensemble  benötigt, auf Stufe 3 je 3 Ensembles (=9) benötigt und für Stufe 4 je 6 Ensembles (=18). Ansonsten ist es nicht klar ersichtlich, das die bereits stehenden Ensembles sozusagen \"verbraucht\" sind.[BR][BR]Sollte es sich eventuell doch um einen Fehler mit der gesamten Anzahl von 18  handeln, wäre die Darstellung im Ausbaufenster grundsätzlich ok, es müssten dann aber die Mengen korrigiert werden, um auf die in der QL geforderten 15 Ensembles zu kommen. Also für Stufe 3 je 4 Ensembles und für Stufe 4 je 5 Ensembles = 15. [BR][BR]Das wäre dennoch ein riesiger Platzverbrauch, aber (knapp) machbar. Es ist ja nicht nur der Bedarf für die Ensembles erforderlich, es kommen noch die 9 Instrumentenbauer und die Ausbauten der Manus hinzu, welche in der QL gefordert werden. [BR][BR]Es liegt sicher an meiner Spielweise und den Gebäuden, die ich stehen habe, aber um die erforderliche Saat für den Bau eines Ensembles zusammen zu bekommen (die Güter gehen da fixer) benötige ich 1-2 Tage je Ensemble. Dabei muss ich aber auch die Produktionen ab und zu hängen lassen. Somit benötigt man alleine für den Quest mit den 15 Ensembles bereits 10-14 Tage, für die 18 nochmals ca eine Woche.[BR]Hierbei geht es mir nicht um den Zeitaufwand - das ist in Ordnung. Aber wenn ich durch die lange Wartezeit fast zwei Wochen in der QL hänge, ist das leicht deprimierend. Hinzu kommt, das man parallel dazu im Forschungsbaum deutlich weiter ist, als eigentlich lt QL hinterlegt und im Anschluss die Folgequests bereits erledigt hat. Das ist in dieser Art einfach nicht stimmig.[BR][BR]Von diesen Unstimmigkeiten abgesehen, teile ich aber die Meinung von [BR]Feytala1986 schrieb:\t\t\t1. Es spielte sich erheblich lockerer. Ich hatte das Gefühl zu sammeln und zu spielen, nicht zu rackern wie im Kapitel davor.[BR]2. Der Platz-, Mana- und Samenbedarf blieb kontinuierlich hoch - Aber das ist durchaus sinnig. Nun weiss man wozu man die Sachen produziert.^^[BR]3. In diesem Kapitel hat es sich zum ersten mal so angefühlt, das man die erleuchteten Güter WIRKLICH braucht.[BR]4. Es hat einen ziemlich herben Einschnitt in meine Portalsegenvorräte gegeben um nicht soviel Mana raushauen zu müssen... Gut so ! So fühlt sichs an als wären die Dinger mal was wert.\t\tZum Vergrößern anklicken....[BR]Für Spieler, die diese GR noch nicht gestartet haben: die Beurteilungen hier sind je nach Spielweise sehr durchwachsen und unterschiedlich. Ich tendiere inzwischen dazu, das diese GR definitiv nicht dazu geeignet ist, durch zu jagen. Wenn man langsam und nach der QL geht, bemerkt man auch die massiven Ressourcen Einsätze beim Mana, der Saat, der Portalsegen etc nicht so sehr. Bei den Lagerbeständen, die hier zum Teil zitiert werden, ist es sicher schneller möglich, als ich das wuppe, aber es hetzt mich ja niemand. Es ist auch zu schaffen, wenn man wie ich, keine Unmengen im Bestand hortet.[BR]Als Vorbereitung sollte jeder bereits vorher ausreichend Teleporter sammeln, das vereinfacht die Angelegenheit ungemein."}, {"60": "Vielen Dank für das gut gelungene Kapitel![BR][BR]Ich habe zwei Monate gebraucht um die Questline komplett zu erledigen. Hier und da habe ich Zeitbooster eingesetzt, aber wirklich nicht viele, hauptsächlich für den Bau der Gastrassengebäude, aber da war ich immer schon ungeduldig. [smilie--sprite2] Die Takte habe ich ausschließlich mit Portalsegen hergestellt, da hatten aus meiner Sicht die Portalis mal wieder eine echte Daseinsberechtigung.[BR][BR]Ich habe das Kapitel gern gespielt und freue mich, dass es nach vielen langatmigen Kapiteln mal wieder eins war, dass, so empfand ich es zumindest, gut aufeinander abgestimmt war. Also nochmal Danke an alle, die daran beteiligt waren, Kapitel 20 auf die Beine zu stellen.  [smilie--sprite1]"}, {"50": "Kapitel XX - Die Macht der Musik hielt am 01.09.2022 Einzug in die Welt von Elvenar und ist nun für mich nach etwas mehr als 2 Monaten geschafft. [BR][BR]Zwar war es bei den erforderlichen 18 Ensemble-Sets für den Portalausbau Stufe 4 vom Platz her etwas \"tricky\", aber wozu hat man die Teleportations-Segen. So konnte ich trotz eingeschränkten Platz die Ensemble nach und nach zusammen sammeln und für den finalen Portalausbau temporär aufstellen. Danach habe ich bis auf ein komplettes Set alles sofort wieder verkauft und mich danach auf die Instrumente konzentriert. Für jede Art Instrument habe ich jeweils 3 Stück (Geigen, Trommeln und Flöten) aufgestellt und das hat für meine Spielweise völlig ausgereicht.[BR][BR]Die Takte habe ich überwiegend mit Portalsegen erzeugt und hin-und wieder auch mal im Portal hergestellt.[BR][BR]Für mich ist das Kapitel XX sehr gelungen und gut zu spielen gewesen."}, {"62": "Ist bekannt, ob man die \"normalen\" Aufgaben (demnächst) einzeln ablehnen werden kann, oder werden (teilweise) die Aufgaben im Verbund abgelehnt?"}, {"254": "ich mag das Design der neuen Gebäudeausbaustufen ..[BR]allesamt sehr gelungen und der Herbststil auch passend .."}, {"2": "Sreafin schrieb:\t\t\tIst bekannt, ob man die \"normalen\" Aufgaben (demnächst) einzeln ablehnen werden kann, oder werden (teilweise) die Aufgaben im Verbund abgelehnt?\t\tZum Vergrößern anklicken....die wirst du erst (einzeln - Aufgabe für Aufgabe) ablehnen können, wenn Kapitel 21 draußen ist bzw. du dort angekommen bist..."}, {"29": "65536 schrieb:\t\t\tdas gesamte Kapitel nur mit dem Hain Stufe 2 durchgespielt werden könnte, ohne das es wesentlich länger dauern würde.\t\tZum Vergrößern anklicken.... Da müssen dann noch 9-12 Ensembles dran sein."}, {"30": "Auch ich habe nun seit etwa einer Woche „fertig“.[BR][BR]Als abschliessendes Fazit bleibt, das mir die neue Gastrasse grundsätzlich gut gefiel.[BR][BR]Aus meiner Sicht passten die Anforderungen mit den Produktionen (es sei denn, man pusht Zeit). Im Schnitt lag ich je Forschungsfeld und den Anforderungen der Questline bei ca. 1-3 Tagen. Bei Spielern mit höheren Unurium-/Saat- und Ressourcen Produktionen könnte das sicher fixer gehen. Aber ein Zeitraum von 3-4 Monaten ist ok, insbesondere, wenn es eh wieder dauert, bevor eine neue GR kommt. Liegt natürlich im Auge des Betrachters [smilie--sprite1] .[BR][BR]Ob das mit eigener Taktproduktion auch so hinkommt, kann ich nicht beurteilen, da ich nur mit Portalsegen gearbeitet habe und auch hier locker hingekommen bin. Ich habe nie mehr Takte produziert, als ich gerade für die Produktionen benötigte und auch alle anderen GR Güter bis zum Ende so ziemlich auf „Punktlandung“ gebaut. Ich hatte nie mehr als die 9 erforderlichen Instrumentenbauer stehen - zeitweise auch weniger. So gab es auch nie Engpässe bei den Takten.[BR][BR][BR]Endstand im Inventar: 451 Takte, 0 Flöten, 0 Geigen und 6 Trommeln - besser geht fast gar nicht [smilie--sprite1][BR][BR]Negativ wie schon früher erwähnt:[BR][BR][BR]Wenn die Anforderungen in der QL so lange dauern, ist das leicht ermüdend. Es müssen doch nicht 3 Anforderungen in einem Quest kommen. Lieber mehr Quests verteilen, dann wirkt die Erfüllung nicht ganz so langatmig und ist kurzweiliger.[BR][BR]Die „untätig herum stehenden“ Ensembles, die nur für die Menge der Portalproduktion etwas bringen, aber ansonsten nur Platz wegnehmen. Ich fand Gastrassen schöner, bei denen in allen GR Gebäuden etwas produziert wurde (egal, ob automatisch oder angeworfen) - und die Texte hier zu den Ensembles sollten deutlicher klar machen, wie viele man für den Ausbau des Hains benötigt.[BR][BR]Auch hier im Feedback noch mal die Info: Es müssen für den Hainausbau die Ensambles in der geforderten Gesamtmenge lediglich in der Stadt stehen - sie müssen nicht einmal angeschlossen sein, sie zählen trotzdem.[BR]Ist der Ausbau des Hains erst einmal gestartet, können die Ensembles weg (falls man sie nicht für die Takte mangels Portalsegen benötigt) - man braucht nicht den fertigen Ausbau abwarten und kann den Platz bereits frühzeitig anderweitig nutzen.[BR](falls es sich nicht in beiden Fällen um einen Fehler handelte, welcher zu einem späteren Zeitpunkt korrigiert wird - bei mir ging das jedenfalls so)"}, {"256": "hallo zusammen  - wie komponiert man enars blues? habe den hain auf stufe 4 und alles was man an liedern produzieren kann probiert- war es nicht...kann mir jmd helfen?"}, {"114": "Ich bin nicht ganz sicher... is ne Weile her... es müßte im Hain der Harmony die 3.? Figur sein[BR]Check mal die 4 Möglichkeiten."}, {"256": "danke für die schnelle antwort - aber leider ist es das nicht  -wie bereits erwähnt habe ich alle figuren durch-auch das einhorn - hat nichts gezählt [smilie--sprite3]"}, {"114": "Laut Beta ist es definitiv im Hain der Harmony eines der Lieder die man nur prodden kann wenn[BR]der Hain auf 4 ist. Es ist die günstigste Produktion. Du mußt nochmal schaun  Notfalls[BR]solltest du mal den Support anschreiben"}, {"256": "beim 2.mal hat es jetzt geklappt - es war das einhorn - trotzdem komisch dass es beim 1.mal nicht gezählt hat..[BR]nochmals vielen dank für die hilfe ;-)"}, {"8": "Also bisher fühlt sich das Kapitel toll an.[BR]...total gemütlich.[BR]Bin jetzt beim HG angelangt und muss bald beginnen Instrumente zu bauen.[BR][BR]Bisher konnte ich die Takte so schnell produzieren, dass ich gar keine Portalos benötigte![BR]Meine Wunschstrategie geht auf [smilie--sprite1][BR][BR]So langsam treiben mich die Umstände des Halblingshändlermarktes dann aber doch dazu, meine Handels-strategie zu ändern...[BR][BR]Ich hab da mal ne Frage:[BR]Als nächstes erleuchtetes Gut werde ich Geniegranulat bekommen.[BR][BR]1.Frage: Wie siehts damit am Markt aus? (in Kheelonaar)[BR]Gibts da schon Erfahrungen von endgamern?[BR]Kriegt man das gut los? Oder muss man immer volle 6 Stunden warten?[BR][BR]Bisher schein ich mit meinen Barren einfach alles kaufen zu können. Jeder sucht die, egal in welcher Kombination![BR]Nicht mal Händler muss ich dafür losschicken.[BR]Auch Flugpulver und Aerosole krieg ich damit ohne Probleme. Klick, Klick deal fertig [smilie--sprite1][BR][BR]Beim Wachs ists ganz anders! Das ist ein Ladenhüter. Dafür müsste ich eigtl. 10% Rabatt geben, damit es jemand nimmt.[BR]Aber geht ja nicht![BR]in der Regel kann ich das nur über Nacht verkaufen...[BR][BR]2. Frage:[BR]Wäre es sinnvoll, lieber gleich 2 oder 3 Barrenmanus zu stellen um dann ganz leicht an all die anderen Güter zu kommen?[BR]Notfalls auch mit schlechtem Kurs an das erl. Gut3.[BR]Wirklich umwerfend scheinen die Güterforderungen in der Forschung ja nicht zu sein. Alles ganz human.[BR]wenn der Bedarf an Barren wirklich so hoch ist, dann würden ja Alle was davon haben, oder?[BR][BR]...Und nach dem Kap. wartet die Ruhestätte... schätze, dann reicht sowieso wieder eine Manu für den kompletten erl.Gut Bedarf in den späteren Kapiteln. Wie dank Simia bei den erweckten..."}, {"2": "...die meisten K20-Spieler sind mit Kapitel 20 schon seit Wochen durch - der Markt an erleuchteten Gütern ist sehr stark eingebrochen und jedesmal, wenn wieder jemand fertig wird, fehlen weitere Angebote - du wirst da vermutlich viel über den Kaufmann abwickeln müssen - die erleuchteten Güter sind in Kapitel 20 auch nicht groß das Problem - das sind eher die anderen Dinge wie Saat und Orks (vor allem, wenn du die letzten Wunder noch hochziehen willst) - insgesamt braucht man aber für Kapitel 20 viel weniger Zeit als für die Vorgänger-Kapitel..."}, {"4": "Es ist auch durchaus möglich, Kreuzhandel zu machen. Allerdings musst du viel Gut 1 hinlegen, um Gut 3 zu erhalten. Andererseits habe ich alles kreuz und quer  gehandelt und das war aus meiner Sicht auch gut so."}]