[{"189": "AngelOfDead schrieb:\t\t\tWer soll das z.B. sein? In 10 Tagen?\t\tZum Vergrößern anklicken....pilousd, allerdings waren es weniger Tage."}, {"9": "ErestorX schrieb:\t\t\tpilousd, allerdings waren es weniger Tage.\t\tZum Vergrößern anklicken....Ah ok, ja gut aber den sehe ich nicht als Vergleich, denn er beschleunigt ja wie \"irre\".[BR]Meine Messlatte ist so einer wie Spieler xinn, dieser ist schnell aber nicht zu schnell."}, {"119": "Das ist wirklich wahnsinnig schnell, Hölle [smilie--sprite1][BR][BR]Ich hab ja auch vor auf Winy einer der schnelleren zu sein, aber das ist out of my world.[BR]Meine Vorbereitung ist abgeschlossen, 11.000 Wp auf der Leiste, 8.000h Zeitbooster und 100k Dias stehen bereit.[BR][BR]Lasst die Spiele beginnen !!"}, {"21": "Primus71 schrieb:\t\t\tDas ist wirklich wahnsinnig schnell, Hölle [smilie--sprite1][BR][BR]Ich hab ja auch vor auf Winy einer der schnelleren zu sein, aber das ist out of my world.[BR]Meine Vorbereitung ist abgeschlossen, 11.000 Wp auf der Leiste, 8.000h Zeitbooster und 100k Dias stehen bereit.[BR][BR]Lasst die Spiele beginnen !!\t\tZum Vergrößern anklicken....Männe, echt, das kann doch keinen Spaß machen. Kein Kombinieren, keine Kopfarbeit, nur kaufen und beschleunigen.... aber gut - wer's braucht....[smilie--sprite6]"}, {"74": "100k Dias?[BR]Also 200 Euro Blechen nur um mit dem Kapitel in 1 Wochen statt 4 Monaten durch zu sein und dann 5,9 Monate nix zu tun zu haben.[BR]Wem es Spaß macht, auf diese Weise gibts zumindest das Spiel noch ne Weile."}, {"9": "Primus71 schrieb:\t\t\tDas ist wirklich wahnsinnig schnell, Hölle [smilie--sprite1][BR][BR]Ich hab ja auch vor auf Winy einer der schnelleren zu sein, aber das ist out of my world.[BR]Meine Vorbereitung ist abgeschlossen, 11.000 Wp auf der Leiste, 8.000h Zeitbooster und 100k Dias stehen bereit.[BR][BR]Lasst die Spiele beginnen !!\t\tZum Vergrößern anklicken....Ok, aber was soll das bringen? Das du im nachhinein doch wieder wartest bis zum 21. Kapitel? [BR]Mmm letztendlich muss das ja jeder selber wissen und es sei dir gegönnt und Danke an solche treuen Kunden, doch meins wäre es nicht. [BR][BR]Was pilousd betrifft, so ist er ja immer mit allen so schnell, deshalb beachte ich den schon gar nicht mehr, aber hast recht, der war diesmal verdammt schnell, so schnell, dass ich es nicht Mal mitbekam. Ich las ihn zwar wie immer im Beta-Forum im Bezug auf die neue GR aber hab das auch nicht ein Mal so registriert, weil ich immer xinn zusehe und ich ehrlich gesagt auch ein bisschen spielen mag anstatt nur klicken. [smilie--sprite2]"}, {"252": "Romilly schrieb:\t\t\t...oh schön - also brauch ich doch nicht so lange auf meine Stunden-WPs verzichten - ich bunkere nämlich seit Freitag Abend Leisten-WPs - sind schon 707 zusammen gekommen...\t\tZum Vergrößern anklicken....hi[BR]wie kann man seit freitag 707 punkte bunkern? Tunier von freitag und samstag? [BR]oder gibt es noch andere möglichkeiten?[BR][BR]LG und danke [smilie--sprite1][BR]Sanne"}, {"90": "Wenn man in seiner Stadt genügend Quellen für WP hat, so ist das sehr leicht."}, {"119": "ist das erste Mal, das ich wirklich den Turbo einlegen will, um die Gastrasse zu erledigen, also lass mir doch meinen Spaß [smilie--sprite1][BR][BR]The Games aren`t over until the big Guys showin`up [smilie--sprite2]"}, {"2": "sanne0412 schrieb:\t\t\twie kann man seit freitag 707 punkte bunkern? Tunier von freitag und samstag?[BR]oder gibt es noch andere möglichkeiten?\t\tZum Vergrößern anklicken.......kuck mal meine Stadt an [smilie--sprite2].... https://www.elvenarchitect.com/city/planner/0405e73f8a4a4cfe84e496bb822b2abc/[BR][BR]Nachtrag, 20 Uhr - jetzt sind es 1490 - bin fertig mit dem Turnier für diese Woche..."}, {"8": "Hehe @Primus71 du jagst dem Scoutwunder hinterher was? [smilie--sprite1]"}, {"119": "sonst komme ich ja nie mehr in den Bereich, ein Turnier mal wieder gewinnen zu können  [smilie--sprite2]"}, {"74": "Gibt es eigentlich schon Layouts wie man die nötigen Gebäude um das Portal herum anordnet? Und wie man am besten die produktionsgebäude baut, bzw. Wie viele man überhaupt braucht?"}, {"2": "...ganz glücklich bin ich nicht, aber so könnte ich die neue Gastrasse aufstellen, ohne viel aus meiner Stadt rausschmeissen zu müssen - vielleicht kann jemand mal kucken, ob die Gastrasse so funktionieren würde...[BR][BR]\t\t\thttps://www.elvenarchitect.com/city/planner/537d00db787c4ce0bd8f1d537bb600e2/\t\t"}, {"50": "Sobald das Portal auf Stufe 4 ausgebaut ist, brauchst Du, soweit ich das verstanden habe, die Ensemble nur noch als Booster für die Produktion im Portal selbst. Somit hättest Du auch noch etwas Spielraum und könntest diese reduzieren, um ggf. mehr Schöpfer, Trommelmacher und/oder Geigenbauer zu platzieren. Hierzu bedarf es sicherlich wieder einige Umbauarbeiten.[BR]In der Summe benötigt man bei einem Portal Stufe 3 für den Ausbau auf die finale Stufe 4 von jedem Typ der Ensemble 6 Stück, was aber auch erst im hinteren Teil der Forschung relevant wird. Nach dem Ausbau auf Stufe 4 dienen die Ensemble nur noch als Produktions-Booster und könnten individuell je nach Platzbedarf verringert werden.[BR]Für mich ist noch die grosse Unbekannte, wie viele von den Schöpfer, Trommelmacher und/oder Geigenbauer am sinnvollsten aufgestellt werden sollten."}, {"2": "OMcErnie schrieb:\t\t\tSobald das Portal auf Stufe 4 ausgebaut ist, brauchst Du, soweit ich das verstanden habe, die Ensemble nur noch als Booster für die Produktion im Portal selbst. Somit hättest Du auch noch etwas Spielraum und könntest diese reduzieren, um ggf. mehr Schöpfer, Trommelmacher und/oder Geigenbauer zu platzieren. Hierzu bedarf es sicherlich wieder einige Umbauarbeiten.[BR]In der Summe benötigt man bei einem Portal Stufe 3 für den Ausbau auf die finale Stufe 4 von jedem Typ der Ensemble 6 Stück, was aber auch erst im hinteren Teil der Forschung relevant wird. Nach dem Ausbau auf Stufe 4 dienen die Ensemble nur noch als Produktions-Booster und könnten individuell je nach Platzbedarf verringert werden.[BR]Für mich ist noch die grosse Unbekannte, wie viele von den Schöpfer, Trommelmacher und/oder Geigenbauer am sinnvollsten aufgestellt werden sollten.\t\tZum Vergrößern anklicken.......hab im Moment jeweils 6 von den Instrumentenwerkis und je 5 von den Ensembles - aber da hinten kann ich dann zeitweise auch was einlagern - außerdem hab ich ja bisher nur 1 von 5 neuen Erweiterungen eingeplant - denke, so ungefähr werd ich dann meine Stadt herrichten..."}, {"74": "Geht sich das überhaupt aus? Dachte die esembels brauchen direkt Kontakt zum Portal. Wie bringt man an das 7*7 (auf Stufe 3) großes Portal 18 Ensembles hin, die man für den Ausbau braucht?"}, {"21": "Clarissa Pramheda schrieb:\t\t\tGeht sich das überhaupt aus? Dachte die esembels brauchen direkt Kontakt zum Portal. Wie bringt man an das 7*7 (auf Stufe 3) großes Portal 18 Ensembles hin, die man für den Ausbau braucht?\t\tZum Vergrößern anklicken....Direkt oder indirekt- die können auch aneinander hängen."}, {"189": "Kurz nach dem Update hatten ich und weitere Spieler einen Browserabsturz, statt wie erhofft die Freischaltung von Kapitel 20. Gab es ein Problem mit der Freischaltung oder hat das nichts miteinander zu tun?"}, {"16": "Das hat nichts damit zu tun - die Freischaltung des Kapitels erfolgt nicht gemeinsam mit dem Update - siehe auch: [BR][BR]jens333 schrieb:\t\t\tIhr spielt schon so lange und jedesmal müssen wir sagen, erst wenn das Update bei allen Sprachen durch ist (DE ist nicht allein^^) , dann wird das neue Kapitel aktiviert. [smilie--sprite2]Zum Vergrößern anklicken....[BR]Nachtrag: Nachlesen in den letzten zwei Kapitel-Feedback Threads hat gezeigt, dass es hier jeweils so zwischen 16 und 17 Uhr der Fall war, dass das Kapitel freigeschaltet wurde. Ist natürlich jetzt nur ein Erfahrungswert der Vergangenheit - wann genau es heute soweit sein wird, wissen wir nicht exakt [smilie--sprite2]"}]