[{"48": "Kapitel 20 ist besser als die Kapitel 17 - 19. Obwohl wieder sehr teure Gebäude nur für den Abriss produziert werden müssen. Da diese Gebäude gleichzeitig die Produktion im \"Portal\" steigern aber sehr groß sind muss man, wenn man nicht genügend Portalos hat diese trotzdem stehen lassen und kann ggf. aus Platzmangel die wirklich wichtigen Gebäude nicht in ausreichender Zahl stellen. Wie immer dreht sich alles im Kreis.[BR]Ja auch ich wäre schon mit Kapitel 20 durch, wenn ich nicht eine lange Pause eingelegt hätte, aber Rohstoffe sind zur Zeit in ausreichender Menge im Handel"}, {"257": "Hallo, kann mir jemand verraten, was benötigt wird, um das Einhorn im Hain zu produzieren?[BR]Für die Takte benötigt man nur Mana und Unurium. Für die Lieder Geigen, Flöten und/oder Trommeln[BR][BR]Es geht mir darum, zu erfahren, ob ich die Hersteller für Geigen usw oder Ensemble abreißen kann, sobald der Ausbau des  Hains auf Stufe 4 gestartet wurde."}, {"8": "Du brauchst 15 Geigen, 18 Flöten und 12 Trommeln pro 3 Stunden für \"Enars Blues\"[BR]ich komm mit je 2 Instrumentebauern super klar! halben tag Takte, halben Tag Blues...[BR]Das Kapitel groovt nur so dahin![BR][BR]Noch 4 Forschungen bis zur Taverne [smilie--sprite1][BR][BR]Arne999sAlbtraum schrieb:\t\t\tob ich die Hersteller für Geigen usw oder Ensemble abreißen kann, sobald der Ausbau des Hains auf Stufe 4 gestartet wurde.\t\tZum Vergrößern anklicken....klar, wenn du genug Instrumente vorproduziert hast?[BR]Ich bau die ja nebenher.[BR][BR]Die Ensemble brauchste vor allem dann, wenn du Portalos sparen magst wie ich [smilie--sprite2][BR]Ansonsten weg damit!"}, {"257": "Danke schön für die umfangreiche Antwort.[BR]Dann muss ich noch ein paar Geigen, Flöten und Trommeln herstellen, um die Quest Komponiere oder spende Lieder.[BR]Für die Quest habe ich zwar genug Instrumente, aber da die auch für Enars Blues benötigt werden ist es nötig, da nachzulegen.[BR]Für den Blues muss ich also 4 Einhörner holen?"}, {"8": "Jedes Einhorn hilft! [smilie--sprite8]"}, {"257": "Ich verstehe nicht. Wieviel Einhörner benötige ich für Enars Blus genau?[BR]Mit dem Kapitel bin ich lange durch, habe nur neu gestartet, weil mir die Quest fehlten.[BR]Für die restlichen Quest benötige ich dann nur noch die gelagerten Instrumente für die Quest \"Komponiere...\"[BR]Alle anderen funktionieren ohne Ensemble und Bauer, oder?"}, {"8": "Ach, du hast das echt ernst gemeint?[BR][BR]Du brauchst keine Einhörner für Enars Blues! [smilie--sprite2][BR][BR]P.S.:[BR]Sein icon im Portal ist ein Einhorn"}, {"257": "\t\t\thttps://beta.forum.elvenar.com/index.php?threads/41873-compose-1-enars-blues-quest-dont-validate-if-you-compose-enars-blue-plus-another-kind-of-song.18169/\t\t[BR]Das Bild im ersten Beitrag[BR][BR]hm, ich bin wohl durch den Wind - Du hast geschrieben, was man für Enars Blues an Instrumenten benötigt. Ich muss 15/18/12 hinlegen und dann einmal das Einhorn starten. Nochmals Danke"}, {"258": "ustoni schrieb:[smilie--sprite8][BR]Ist eine absolute Ausnahme, normalerweise habe ich viel weniger, gebe mich dann aber auch mit 10k bis 15k Punkten zufrieden.[BR]Beginn des Kapitels beim Marmorturnier muss man aber ausnutzen und die WPs abschöpfen. Hab daher ein paar mehr als sonst gesetzt und 86 Provinzen (23490 Punkte) gemacht - mehr ging leider nicht.[BR]Stahlturnier nächste Woche sollte in der gleichen Größenordnung liegen.[BR]Bei den folgenden Turnieren lohnt sich die Menge an Boostern dann wieder nicht, da gehts also normal weiter.\t\tZum Vergrößern anklicken....Da machst du aber was verkehrt bei mir in Cera da gibt es mehrere spieler in meiner gm die jede woche um die 20k punkte machen aber kaum booster stehen haben weil es die nur noch selten gibt.(zb. Lexakat auf elvenstats turnierschnitt 17000 punkte)"}, {"81": "chaosninja schrieb:\t\t\tDa machst du aber was verkehrt bei mir in Cera da gibt es mehrere spieler in meiner gm die jede woche um die 20k punkte machen aber kaum booster stehen haben weil es die nur noch selten gibt.(zb. Lexakat auf elvenstats turnierschnitt 17000 punkte)\t\tZum Vergrößern anklicken....[BR]Jede  Woche 20k aber im Durchschnitt lt. Stats nur 17k. [BR][BR]Merkst was an der Aussage nicht stimmt?[BR][BR]Btw wenn du Stats ließt dann macht besagter Spieler nur EINMAL in 9 Turnieren mehr als 20k und das bei Marmor das wenn man Manuell Kämpfen kann ein leichtes ist auf Anschlag zu spielen.[BR][BR]Es ist immer schwer Äpfel mit Birnen zu Vergleiche und in einem Pay to Win Spiel überhaupt fragwürdig [smilie--sprite2]"}, {"3": "Ich habe die Quest \"komponiere Enars Blues\" bekommen, Menge 0/1.[BR]Hab ich gemacht, aber die Quest ist nicht erfüllt.... in der App, komisch. Hat das bei euch funktioniert?[BR][BR]Nachtrag: Sehe gerade da gibt's einen Bug-Report im Beta Server. Ich probiere es einfach nochmal."}, {"2": "Fayence schrieb:\t\t\tIch habe die Quest \"komponiere Enars Blues\" bekommen, Menge 0/1.[BR]Hab ich gemacht, aber die Quest ist nicht erfüllt.... in der App, komisch. Hat das bei euch funktioniert?[BR][BR]Nachtrag: Sehe gerade da gibt's einen Bug-Report im Beta Server. Ich probiere es einfach nochmal.\t\tZum Vergrößern anklicken.......wenn ich mich recht erinnere, musst du \"Enars Blues\" einzeln abholen - das darf nicht mit anderen Liedern zusammen produziert worden sein..."}, {"3": "Romilly schrieb:\t\t\t...wenn ich mich recht erinnere, musst du \"Enars Blues\" einzeln abholen - das darf nicht mit anderen Liedern zusammen produziert worden sein...\t\tZum Vergrößern anklicken....Ja danke, jetzt hat es geklappt![BR]Peregrim ist befreit! Lang lebe Enar  [smilie--sprite8][BR][BR]Nachtrag: noch eine witzige Beobachtung:[BR]Bei der nächsten Quest soll ich 10 Wohnhäuser der Stufe 45 besitzen. Habe aber nur 9, trotzdem ist die Quest erfüllt.[BR]Ein weiteres habe ich ins Inventar teleportiert, weil ich Platz brauche. Aber schon vor längerer Zeit.[BR]Zählt das mit?[BR]Kurios, aber sehr hilfreich!"}, {"14": "die magischen Wohnhäuser zählen doppelt, evtl. hast du davon welche (mind. eins?)?"}, {"3": "Neris schrieb:\t\t\tdie magischen Wohnhäuser zählen doppelt, evtl. hast du davon welche (mind. eins?)?\t\tZum Vergrößern anklicken....Ah, so ist das! Was man nicht noch alles lernt, wenn man fast am Ende des Spiels ist! [BR]Alle meine 9 Wohnhäuser sind magisch."}, {"24": "Ich gebe zu, ich hab die Taverne erst cool gefunden... Aber jetzt wo ich sie habe muss ich doch sagen... Naja. Ich hab eh seid Äonen alle Erweiterungen durch Scouten und wenn ich durchgehend laufen lasse dann sind auch genug Provinzen für Aufgaben eigentlich immer da... Auch wenn das Einzelscouten mal 4-5 Tage dauern mag... Mir erschliesst sich nicht wofür ich sie brauche. Daher dümpelt sie bei mir auf Level 1 rum für die zusätzliche Kiste, bis das nächste Kapitel kommt... Dann reisse ich sie wohl für den Platz wieder ab. Schadet ja eh bekanntlich den Gegnerzahlen im Turnier solche Komfortwunder aufzustellen..."}, {"6": "Naja, zwischen 6% Zeitverkürzung bei Stufe 1 und 60% Zeitverkürzung bei Stufe 31 ist schon ein kleiner Unterschied."}, {"8": "Feytala1986 schrieb:\t\t\tNaja. Ich hab eh seid Äonen alle Erweiterungen durch Scouten\t\tZum Vergrößern anklicken....Das ist eigtl. wumpe [smilie--sprite2][BR]im endgame hat man so derbe viel Platz, dass man deshalb eigtl. nicht schneller scouten braucht.[BR][BR]Feytala1986 schrieb:\t\t\tMir erschliesst sich nicht wofür ich sie brauche.\t\tZum Vergrößern anklicken....ustoni schrieb:\t\t\tNaja, zwischen 6% Zeitverkürzung bei Stufe 1 und 60% Zeitverkürzung bei Stufe 31 ist schon ein kleiner Unterschied.\t\tZum Vergrößern anklicken....===> Man bekommt mit der Taverne mehr Handelspartner, mehr NBH[BR]und umgeht damit spielerisch das viel geklagte Leid der toten Nachbarn, nicht rückpolierender Newcomer usw.[BR]...Denn die endgamer wachsen so stärker zusammen![BR][BR]Ich erhoffe mir vor allem, mal Jemanden zu scouten, der mir regelmäßig meinen ganzen Kristall abkauft.[BR]Das Zeug ist echt schwer loszuwerden![BR][BR]P.S.: Auch etliche Wunder werden mit mehr Provinzen deutlich effizienter!"}, {"24": "gergerw schrieb:\t\t\tDas ist eigtl. wumpe [smilie--sprite2][BR]im endgame hat man so derbe viel Platz, dass man deshalb eigtl. nicht schneller scouten braucht.[BR][BR][BR][BR]===> Man bekommt mit der Taverne mehr Handelspartner, mehr NBH[BR]und umgeht damit spielerisch das viel geklagte Leid der toten Nachbarn, nicht rückpolierender Newcomer usw.[BR]...Denn die endgamer wachsen so stärker zusammen![BR][BR]Ich erhoffe mir vor allem, mal Jemanden zu scouten, der mir regelmäßig meinen ganzen Kristall abkauft.[BR]Das Zeug ist echt schwer loszuwerden![BR][BR]P.S.: Auch etliche Wunder werden mit mehr Provinzen deutlich effizienter!\t\tZum Vergrößern anklicken....[BR]Mehr NBH gibt es leider eher nicht. Bereits jetzt sind 95% meiner Nachbarn nach dem 10. Ring (Ich dehne mich derzeit bis ca. zum 22. aus) NICHT in der Lage meine NBH zurückzuzahlen, weil sie selbst zu klein sind bzw. zu wenig Ausdehnung haben. Ausserdem stosse ich im Osten mittlerweile an die leeren Gebiete. [BR][BR]Mehr Handelspartner... Ja. Allerdings auch eher wenig... Die meisten Mitspieler die ich erreiche handeln nur minimale Mengen. Zumal ich eigentlich schon komplett ausreichend aufgestellt bin.... Kristall nähme ich allerdings gerne. [smilie--sprite8] Da ich den selber als Bonusgut habe krieg ich ihn nicht über den Händler.[BR][BR]Das Wunderargument zieht, das stimmt... Bzw. der Markt. Aber auch hier ist die Erweiterung - Selbst bei doppelt so schnellem scouten - So unmerklich, dass ich skeptisch bin ob es die investierten WP und den Platz in die Taverne rechtfertigt."}, {"8": "Gib der Sache bissl Zeit [smilie--sprite2][BR]Ich hab seit Bau immerhin schon ca. 6 neue rückpolierende Nachbarn im outer Rim.[BR]Freuen würde ich mich über Alle ab elvenar. Die suchen schon nennenswerte Gütermengen [smilie--sprite1][BR][BR]Es macht einen Riesenunterschied ob man 9 Tage oder 3 Tage für die Erkundung braucht.[BR]ich will sie zügig auf Stufe35 bringen. Ab dann haste nur noch ein Drittel scoutzeit[BR][BR]Der nächste endgamer(Musik Kap.20) liegt 4 Provinzen von meinem Reich entfernt.[BR]ohne Taverne mind. 36 Tage Scoutzeit[BR]Mit voller Taverne schlappe 12 Tage... bin nicht mehr soweit weg davon[BR][BR]Bin gespannt was Diejenige so handelt! *_*"}]