[{"29": "Jetzt sind sie da."}, {"2": "...es ist schon da - macht mal nen Neustart...[BR][BR]...WPs weg und Unurium weg - aber ich bin erst mal zufrieden ^^...[BR][BR][IMG]https://i.ibb.co/y0TC1Ks/https-de-forum-elvenar-com-index-php-attachments-forschung-png-31027.png[/IMG]"}, {"38": "Ein Lob an die Entwickler: Die Texte zu den Forschungen sind sehr amüsant! Endlich mal bisschen mehr Spaß."}, {"186": "Mein erstes Feedback:[BR][BR]Ich finde es wieder sehr unschön, dass alle Spieler dieselben Güter für die Forschungen brauchen. Dadurch entstehen wieder einmal einseitige Marktschieflagen, weil grob gesehen 2/3 der Spieler auf das andere Drittel angewiesen sind.[BR]Kann man da nicht mal die Forschungskosten an die Bonusgüter anpassen, so dass der Markt nicht bei jedem neuen Kapitel aus den Fugen gerät? Immerhin sind auf einen Schlag alle Endgamer am gleichen Punkt..."}, {"21": "Melios schrieb:\t\t\tMein erstes Feedback:[BR][BR]Ich finde es wieder sehr unschön, dass alle Spieler dieselben Güter für die Forschungen brauchen. Dadurch entstehen wieder einmal einseitige Marktschieflagen, weil grob gesehen 2/3 der Spieler auf das andere Drittel angewiesen sind.[BR]Kann man da nicht mal die Forschungskosten an die Bonusgüter anpassen, so dass der Markt nicht bei jedem neuen Kapitel aus den Fugen gerät? Immerhin sind auf einen Schlag alle Endgamer am gleichen Punkt...\t\tZum Vergrößern anklicken....[BR]Im laufe der Kapitel ist das ausgleichende Gerechtigkeit. In W2 gab es immer wildes Gerangel um die Mineralien (die ich nicht hatte). Jetzt sind die Barren dran (die ich habe). [smilie--sprite6]Hoffentlich sind es nächstes Mal die Alraunen, denn die sind hier leider immer in den Popo gekniffen. Das hat aber nichts mit der Schieflage im Markt zu tun sondern mit dem absolut unausgewogenen balancing der Güterverteilung. Dieses permanente Umsiedeln bringt überhaupt nichts wenn man die Lücken nicht mit nahezu kapitelgleichen Spielern schließt."}, {"2": "...mir gefällt das Kapitel bisher ziemlich gut und ich komm auch (noch) recht zügig voran - kann schon die ersten Trommeln und Geigen bauen - für mehr Platz bzw. Unurium muss ich nun aber 3 Tage auf das Herbstevent warten und kann dann hoffentlich bald meine Edelsteinmanu für die erleuchteten Güter umrüsten - also falls jemand in Fely Kinetik-Kugeln braucht, könnt ihr mich dann gerne ab Ende nächster Woche ingame anschreiben (lief bei Gut8 auch ganz gut)....mein Stormy ist bereit für neue Untaten (der hat heute schon fleißig Flugpulver herbei gezaubert, welches interessanterweise im Kreuzhandel weg geht wie warme Semmeln)"}, {"6": "Romilly schrieb:\t\t\tfür mehr Platz bzw. Unurium muss ich nun aber 3 Tage auf das Herbstevent warten\t\tZum Vergrößern anklicken....Wenn du Unurium über die Eventwährung erhältst, kannst du doch morgen über den Turm eine satte Menge Unurium einsammeln.[BR]Die stärkste Bremse bei diesem Kapitel sehe ich eher in der Saatproduktion. Schon fies, was da alles verlangt wird. [smilie--sprite3]"}, {"2": "ustoni schrieb:\t\t\tWenn du Unurium über die Eventwährung erhältst, kannst du doch morgen über den Turm eine satte Menge Unurium einsammeln.[BR]Die stärkste Bremse bei diesem Kapitel sehe ich eher in der Saatproduktion. Schon fies, was da alles verlangt wird. [smilie--sprite3]Zum Vergrößern anklicken.......Saat bekomm ich alle 3 Stunden 26316 (Tendenz steigend) über den Sammelbonus, wenn ich das Unurium während dem Event aus dem Marktplatz verbannen kann - im Moment fehlt mir eher der Platz, um weitere Intrumentenbauer aufstellen zu können - meine Stadt ist voll mit kleinen Mini-Werkis für die Eventquests - das werden laaaaaaaaaaaaaaange 3 Tage bis Dienstag ^^...[BR][BR]...oh - die Seepferdchen geben auf Stufe 8 in Kapitel 19 Gut7 ab - in Kapitel 20 ist es aber dann Gut 8...."}, {"21": "ustoni schrieb:\t\t\tWenn du Unurium über die Eventwährung erhältst, kannst du doch morgen über den Turm eine satte Menge Unurium einsammeln.[BR]Die stärkste Bremse bei diesem Kapitel sehe ich eher in der Saatproduktion. Schon fies, was da alles verlangt wird. [smilie--sprite3]Zum Vergrößern anklicken....[BR]Stimmt, Saat ist die größte Bremse. Aber egal- dieses Kapitel ist dermaßen - viel zu einfach - daß man auch mit normalem Spiel zügig fertig wird. Hatte mir eigentlich etwas wesentlich anspruchvolleres erhofft in einem Kapitel 20......[BR]Die ersten werden demnach auch in ein paar Tagen fertig sein [smilie--sprite6]"}, {"8": "Indianaking schrieb:\t\t\t- viel zu einfach - daß man auch mit normalem Spiel zügig fertig wird. Hatte mir eigentlich etwas wesentlich anspruchvolleres erhofft in einem Kapitel 20......[BR]Die ersten werden demnach auch in ein paar Tagen fertig sein [smilie--sprite6]Zum Vergrößern anklicken....Kraaaass!!! *_*[BR][BR]Echt jetzt??? Schneller als Kapitel 19???"}, {"6": "Naja, ein paar Wochen wirds schon dauern. Ist aber zumindest kein Kaugummikapitel. [smilie--sprite1]"}, {"9": "ustoni schrieb:\t\t\tNaja, ein paar Wochen wirds schon dauern. Ist aber zumindest kein Kaugummikapitel. [smilie--sprite1]Zum Vergrößern anklicken....Du musst aber schon dazu sagen, dass man nur zügig voran kommt wenn man durch viele Portal-Segen auch an die Takte rankommt. ^^[BR]Ansonsten bekommst anfangs nur 177 Taktung alle 6 Std. und mit denen wiederum hoppst du nicht weit, wenn du mehr als 4 Geigen- Flöten- und Trommelbauer baust. ^^[BR][BR][IMG]https://i.ibb.co/4WhwMDb/https-de-forum-elvenar-com-index-php-attachments-1662222035476-png-31049.png[/IMG][BR][BR]..... und schon gar nicht langen sie dann, wenn du Geigen- Trommel- und Flötenbaier alle 3 Std. bedienen willst.[BR][BR]Also ohne XXXX (Massen) an Portal-Segen würde das nicht so schnell gehen, denn die geben zwar Takte aber die Portal-Segen sinken unheimlich schnell. ;-)[BR]Jeder hat nicht XXX Portal-Segen im Lager. ^^[BR][BR][IMG]https://i.ibb.co/4Wgmj8X/https-de-forum-elvenar-com-index-php-attachments-1662222318582-png-31050.png[/IMG][BR][BR]Sodala .... und wenn ich regulär ohne Zeitis und Portalos nur 177 Takte pro 6 Std. bekomme, dann bedienst du laut Adam Riese nicht einmal einen Trommelbauer 3 Std. Hinzu kommt das du mit diesen 5 Trommeln dann auch nicht weit kommst in der Forschung![BR][BR]Demnach hat INNO Klasse mitgedacht, nur haben sie zu viele Spiele zu lange auf ein neues Kapitel warten lassen, sodass sich viele Zeitis und Portal-Segen ansammelten und das macht es ihnen so einfach. Einer der durchmarschiert von Kapitel zu Kapitel, also Nachzügler, dürfte kaum diese Mengen, bzw. Massen haben, wie einer der nun lange Zeit gewartet hat und nichts zu tun hatte außer alles anzusammeln![BR][BR]...... ach ja und die 5 Trommeln pro Stunde sind es auch nur durch die Händlergilde auf Stufe 35, sonst wären es nämlich nur 3 Trommel pro Trommelbauer alle 3 Std und damit kommst nicht weit.[BR]Dadurch dass man aber Unmengen an Portalsegen hat, geht es ziemlich flott, sofern man XXX Portal-Segen hat. Denn diese Bauer fressen Unmengen Portalos und Takte die wo du herstellst langen Never für XXX aller Bauer.[BR][BR]Somit ist schnell relativ und vielseitig, denn das können nur die, die volle Lager haben mit Portalos und ich übertreibe nicht, wenn ich sage, bau mal mindestens 6 Trommelbauer, doch wie bedienst du diese bei nur 177 Takte aus dem Portal alle 6 Std?  Ah ja Portal-Segen! Doch wie viele Spieler haben diese Massen an Portal-Segen? Da dürften die Lager ziemlich leer werden nach dem Kapitel im Bezug auf Portal-Segen, sodass ich mich jetzt gar freue wenn ich sie im Turm bekomme. Denn um die Takt-Kapa,. im Portal Stufe 1 komplett voll zu machen brauchst du 1500 Takte und diese wiederum langen nicht hinten und vorne für a' 6 Geigen- Trommel und Flötenbauer, wenn du sie alle 3 Std. bedienen möchtest. ^^[BR][BR]Das gibt ein 5% Portalo:[BR][BR][IMG]https://i.ibb.co/swkbjjQ/https-de-forum-elvenar-com-index-php-attachments-1662223462154-png-31051.png[/IMG][BR][BR]Also 20 Stk. (5% Portal-Segen) weg, wenn ich das Lager vollknallen möchte und diese 20 Stk. jedoch, langen nicht, wenn du mehr als 4 Geigen- Trommel- und Flötenbauer baust und sie alle 3 Std. bedienen möchtest, denn das kostet 1200 Takte laut Adam Riese. ^^[BR]Soll heißen, da butterst da mehrmals Täglich Unmengen an Portal-Segen rein um die Geigen- Trommel- und Flötenbauer zu bedienen.[BR]Denn bis du das Portal auf Stufe 2 ziehen kannst, dass dauert schon eine Weile und na ja mehr als 4 Flöten- Trommel- und Geigenbauer musst aber bauen um nicht zu verweilen. Ein Teufelskreis und gut mitgedacht INNO. ;-)"}, {"8": "AngelOfDead schrieb:\t\t\tSomit ist schnell relativ und vielseitig, denn das können nur die, die volle Lager haben mit Portalos und ich übertreibe nicht, wenn ich sage, bau mal mindestens 6 Trommelbauer, doch wie bedienst du diese bei nur 177 Takte aus dem Portal alle 6 Std?\t\tZum Vergrößern anklicken....Die Entwickler sind echt Schelme! [smilie--sprite8][BR]Geben das wohl geilste Wunder... aber ich soll meine kostbaren Fraggiequellen dafür einsetzen?![BR][BR]Ich denke, ich werde dann wieder 6 Monate brauchen... Genieße ich eben ganz lange die Centerparks [smilie--sprite1]"}, {"9": "gergerw schrieb:\t\t\tDie Entwickler sind echt Schelme! [smilie--sprite8][BR]Geben das wohl geilste Wunder... aber ich soll meine kostbaren Fraggiequellen dafür einsetzen?![BR][BR]Ich denke, ich werde dann wieder 6 Monate brauchen... Genieße ich ganz lange die Centerparks [smilie--sprite1]Zum Vergrößern anklicken....Habe den oberen Beitrag hier:[BR]https://de.forum.elvenar.com/index....itel-20-die-macht-der-musik.25485/post-402241[BR]mehrmals nachbearbeitet um es verständlich zu machen und Mal vor Augen zu führen, denn schnell geht es nur, wenn man abertausende Portal-Segen hat (siehe Beitrag inkl. Pic's und rechnen kann jeder selber ein bisschen). ;-)"}, {"2": "AngelOfDead schrieb:\t\t\tDu musst aber schon dazu sagen, dass man nur zügig voran kommt wenn man durch viele Portal-Segen auch an die Takte rankommt.\t\tZum Vergrößern anklicken.......hihi - ja, die gehen auch weg, wie warme Semmeln...(ich hab aber noch über 10.000 % an Segen)"}, {"9": "Romilly schrieb:\t\t\t...hihi - ja, die gehen auch weg, wie warme Semmeln...(ich hab aber noch über 10.000 % an Segen)\t\tZum Vergrößern anklicken....Wer hätte gedacht das ich diese Dinger Mal als so wichtig erachte, denn ich habe bereits Hunderte Portalos darein geballert. ^^[BR][BR][IMG]https://i.ibb.co/bdBwCJg/https-de-forum-elvenar-com-index-php-attachments-1662224816664-png-31053.png[/IMG] [IMG]https://i.ibb.co/RhYnBXg/https-de-forum-elvenar-com-index-php-attachments-1662224897655-png-31055.png[/IMG][BR][BR].. .. und hey, jetzt freu ich mich wie oben erwähnt sogar über die Portalos aus dem Turm. ^^[BR]Zumal ich die eh gern nehme für Fragmente. ;-)"}, {"6": "AngelOfDead schrieb:\t\t\tDu musst aber schon dazu sagen, dass man nur zügig voran kommt wenn man durch viele Portal-Segen auch an die Takte rankommt.\t\tZum Vergrößern anklicken....Dass das nur mit entsprechender Vorbereitung funktioniert muss man ja wohl nicht erwähnen.[BR]Portalsegen sind dabei Grundvoraussetzung:[BR][IMG]https://i.ibb.co/7SVQFHr/https-de-forum-elvenar-com-index-php-attachments-k20-portalos-jpg-31056.jpg[/IMG][BR]Für die Produktion hilft es, ausreichend Zeitsegen zu sammeln:[BR][IMG]https://i.ibb.co/CJHX9KD/https-de-forum-elvenar-com-index-php-attachments-k20-zeit-jpg-31057.jpg[/IMG][BR]Mit nur einem Set sieht das dann schnell so aus:[BR][IMG]https://i.ibb.co/3Sw0K37/https-de-forum-elvenar-com-index-php-attachments-k20-gast-jpg-31058.jpg[/IMG][BR]Knackpunkt bleiben Saat und WPs. Saat erhalte ich täglich zwischen 200k und 300k, je nachdem wieviel die 10 Dschinns beisteuern.[BR]WPs gibts in den Turnieren. Das nächste Turnier ist wieder ein recht leichtes, die WPs sollten dann für die Forschung für HG, Händler und die Gut 3 Manufakturen reichen. Danach dann weitgehende Forschungspause bis Freitag, 16. September mit dem nächsten Turnier. Auf die Art kommen schon einige Wochen zusammen.[BR][BR]Und sollte der Verbrauch an Portalsegen doch unerwartet hoch werden, muss ich vor Kapitel 21 eben meine 10 Handelsstationen aufbauen."}, {"9": "ustoni schrieb:\t\t\tDass das nur mit entsprechender Vorbereitung funktioniert muss man ja wohl nicht erwähnen.\t\tZum Vergrößern anklicken....Doch eigentlich schon, denn diese Lagerbestände haben Nachzügler nicht, die fortan von Kapitel zu Kapitel wechseln ohne (große) Pausen. ^^[BR][BR]Also vor diesem Kapitel sollte man definitiv eine Pause einlegen, ansonsten dauert es eben. ;-) [BR]Schnell oder sagen wir Mal zügig geht es nur mit vollem Lager!"}, {"6": "AngelOfDead schrieb:\t\t\t... denn diese Lagerbestände haben Nachzügler nicht, die fortan von Kapitel zu Kapitel wechseln ohne Pausen.\t\tZum Vergrößern anklicken....Weniger ist eben manchmal mehr. Beim Kapitelmarathon darf man den Stadtaufbau und die Vorratshaltung nicht vergessen. Die tägliche Saatmenge von um die 250k ist nur möglich, wenn man auch entsprechend viele Wunderstufen hat. Wer dieses und auch die vorherigen Kapitel mit 100 oder 200 Wunderstufen angeht braucht dann schon ein gutes Nervenkostüm. Meine 553 Wunderstufen bremsen mich im Turnier übrigens nicht im geringsten aus, egal wie oft hier im Forum das Gegenteil behauptet.[BR][BR]Ist übrigens einer der Gründe, warum ich schnellstmöglich durch das Kapitel möchte: gibt mir dann genügend Zeit, Kapitel 21 vorzubereiten."}, {"2": "ustoni schrieb:\t\t\tMeine 553 Wunderstufen bremsen mich im Turnier übrigens nicht im geringsten aus, egal wie oft hier im Forum das Gegenteil behauptet.\t\tZum Vergrößern anklicken.......ich hab mittlerweile 612 und mich bremsen die auch nicht aus - wobei mir halt 8.000 Turnierpunkte in der Regel reichen (in diesem Turnier sind es 14500 - ich brauchte WPs)..."}]