[{"9": "ustoni schrieb:\t\t\tMeine 553 Wunderstufen bremsen mich im Turnier übrigens nicht im geringsten aus\t\tZum Vergrößern anklicken....Bei um die 660 merkt man es dann, da hast noch bisschen Zeit.[BR][BR]PS.:[BR]Wenn man 29 Kampf-Booster stehen hat, wundert es auch keinen ^^[BR][BR]@Romilly, dass sind auch nur an die 50 Provinzen, die gehen sehr wohl mit deiner Erfahrung. @ustoni hat jedoch über 80 Prov. voll ausgespielt und hat gute 10k Pkt. mehr, doch mit 29 Kampf-Boostern und noch weit unter 660 AW-Stufen geht das auch. Ohne Kampf-Booster macht er das nicht so locker flockig. ^^"}, {"6": "AngelOfDead schrieb:\t\t\tWenn man 29 Kampf-Booster stehen hat, wundert es auch keinen\t\tZum Vergrößern anklicken....[smilie--sprite8][BR]Ist eine absolute Ausnahme, normalerweise habe ich viel weniger, gebe mich dann aber auch mit 10k bis 15k Punkten zufrieden.[BR]Beginn des Kapitels beim Marmorturnier muss man aber ausnutzen und die WPs abschöpfen. Hab daher ein paar mehr als sonst gesetzt und 86 Provinzen (23490 Punkte) gemacht - mehr ging leider nicht. [BR]Stahlturnier nächste Woche sollte in der gleichen Größenordnung liegen. [BR]Bei den folgenden Turnieren lohnt sich die Menge an Boostern dann wieder nicht, da gehts also normal weiter."}, {"2": "AngelOfDead schrieb:\t\t\tWenn man 29 Kampf-Booster stehen hat, wundert es auch keinen ^^\t\tZum Vergrößern anklicken.......ich hatte nur 4 (2x Magier, 1x LF, 1x Leben) + ne Waffenschmiede aufgestellt...(und ich hab nur 64 Provinzen)..."}, {"9": "ustoni schrieb:\t\t\tIst eine absolute Ausnahme,\t\tZum Vergrößern anklicken....Du, alles gut und jeder wie er mag. ;-) Doch um wieder zum Thema zurückzukommen, schlimm finde ich die absolute Schieflage (wie Melios ja schon schrieb) am Marktplatz.[BR][BR][IMG]https://i.ibb.co/GMdwCgc/https-de-forum-elvenar-com-index-php-attachments-1662228706054-png-31063.png[/IMG][BR][BR]In W1 nur Geniegranulat am Markt [smilie--sprite4][smilie--sprite4][smilie--sprite4][smilie--sprite4]"}, {"90": "es sind ja auch noch viele nicht soweit, um das zeug herzustellen."}, {"21": "AngelOfDead schrieb:\t\t\tDu musst aber schon dazu sagen, dass man nur zügig voran kommt wenn man durch viele Portal-Segen auch an die Takte rankommt. ^^[BR]Ansonsten bekommst anfangs nur 177 Taktung alle 6 Std. und mit denen wiederum hoppst du nicht weit, wenn du mehr als 4 Geigen- Flöten- und Trommelbauer baust. ^^[BR][BR]Anhang 31049 ansehen[BR][BR]..... und schon gar nicht langen sie dann, wenn du Geigen- Trommel- und Flötenbaier alle 3 Std. bedienen willst.[BR][BR]Also ohne XXXX (Massen) an Portal-Segen würde das nicht so schnell gehen, denn die geben zwar Takte aber die Portal-Segen sinken unheimlich schnell. ;-)[BR]Jeder hat nicht XXX Portal-Segen im Lager. ^^[BR][BR]Anhang 31050 ansehen[BR][BR]Sodala .... und wenn ich regulär ohne Zeitis und Portalos nur 177 Takte pro 6 Std. bekomme, dann bedienst du laut Adam Riese nicht einmal einen Trommelbauer 3 Std. Hinzu kommt das du mit diesen 5 Trommeln dann auch nicht weit kommst in der Forschung![BR][BR]Demnach hat INNO Klasse mitgedacht, nur haben sie zu viele Spiele zu lange auf ein neues Kapitel warten lassen, sodass sich viele Zeitis und Portal-Segen ansammelten und das macht es ihnen so einfach. Einer der durchmarschiert von Kapitel zu Kapitel, also Nachzügler, dürfte kaum diese Mengen, bzw. Massen haben, wie einer der nun lange Zeit gewartet hat und nichts zu tun hatte außer alles anzusammeln![BR][BR]...... ach ja und die 5 Trommeln pro Stunde sind es auch nur durch die Händlergilde auf Stufe 35, sonst wären es nämlich nur 3 Trommel pro Trommelbauer alle 3 Std und damit kommst nicht weit.[BR]Dadurch dass man aber Unmengen an Portalsegen hat, geht es ziemlich flott, sofern man XXX Portal-Segen hat. Denn diese Bauer fressen Unmengen Portalos und Takte die wo du herstellst langen Never für XXX aller Bauer.[BR][BR]Somit ist schnell relativ und vielseitig, denn das können nur die, die volle Lager haben mit Portalos und ich übertreibe nicht, wenn ich sage, bau mal mindestens 6 Trommelbauer, doch wie bedienst du diese bei nur 177 Takte aus dem Portal alle 6 Std?  Ah ja Portal-Segen! Doch wie viele Spieler haben diese Massen an Portal-Segen? Da dürften die Lager ziemlich leer werden nach dem Kapitel im Bezug auf Portal-Segen, sodass ich mich jetzt gar freue wenn ich sie im Turm bekomme. Denn um die Takt-Kapa,. im Portal Stufe 1 komplett voll zu machen brauchst du 1500 Takte und diese wiederum langen nicht hinten und vorne für a' 6 Geigen- Trommel und Flötenbauer, wenn du sie alle 3 Std. bedienen möchtest. ^^[BR][BR]Das gibt ein 5% Portalo:[BR][BR]Anhang 31051 ansehen[BR][BR]Also 20 Stk. (5% Portal-Segen) weg, wenn ich das Lager vollknallen möchte und diese 20 Stk. jedoch, langen nicht, wenn du mehr als 4 Geigen- Trommel- und Flötenbauer baust und sie alle 3 Std. bedienen möchtest, denn das kostet 1200 Takte laut Adam Riese. ^^[BR]Soll heißen, da butterst da mehrmals Täglich Unmengen an Portal-Segen rein um die Geigen- Trommel- und Flötenbauer zu bedienen.[BR]Denn bis du das Portal auf Stufe 2 ziehen kannst, dass dauert schon eine Weile und na ja mehr als 4 Flöten- Trommel- und Geigenbauer musst aber bauen um nicht zu verweilen. Ein Teufelskreis und gut mitgedacht INNO. ;-)\t\tZum Vergrößern anklicken....[BR]Also ich denke doch daß man als Spieler in Kapitel 20 wahre Unmengen an Portalboostern angehäuft haben müßte.... bei uns ist das in jedem Fall so. Jetzt haben wir endlich mal Verwendung dafür [smilie--sprite2][BR][BR]Granulat ist übrigens auch in W2 (noch) im Überfluß vorhanden.... zum Glück hab ich Würze [smilie--sprite6]"}, {"9": "Indianaking schrieb:\t\t\tAlso ich denke doch daß man als Spieler in Kapitel 20 wahre Unmengen an Portalboostern angehäuft haben müßte.... bei uns ist das in jedem Fall so. Jetzt haben wir endlich mal Verwendung dafür [smilie--sprite2]Zum Vergrößern anklicken....Wie ich schon erwähnte/schrieb, ich habe diese Mengen nicht und andere meiner GM auch nicht, ;-) Ich freue mich nun aber über den Gewinn im Turm. [BR]Indianaking schrieb:\t\t\tGranulat ist übrigens auch in W2 (noch) im Überfluß vorhanden.... zum Glück hab ich Würze [smilie--sprite6]Zum Vergrößern anklicken....Dein Glück. ^^[BR]Tobias1 schrieb:\t\t\tes sind ja auch noch viele nicht soweit, um das zeug herzustellen.\t\tZum Vergrößern anklicken....Oh ... da sind schon eine ganze Menge soweit. ;-) Es geht um die Schieflage, da alle dasselbe benötigen und nicht darum wer schon so weit ist und wer nicht ;-) (Die Forschung verlangt von allen Spielern, egal welches BG sie haben, die selben Anforderungen, dadurch kommt es zu dieser Schieflage, bzw. Unausgewogenheit)."}, {"189": "ustoni schrieb:\t\t\tKnackpunkt bleiben Saat und WPs.\t\tZum Vergrößern anklicken....[BR]Ja, Saat/Unurium ist auch bei mir der limitierende Faktor. Selbst wenn man wie ich Saat und Unurium fast ausschließlich im Händler produziert, ohne nennenswerte Vorräte ins Kapitel gestartet ist und auch die dafür hilfreichen Wunder höchstens auf niedriger Stufe zu Beginn des Kapitels aufgestellt hat, kann man problemlos genug Saat zusammenbekommen, um täglich eins der saatfressenden Gastrassengebäude zu bauen. Dazu kommen dann noch einige Tage/Wochen, weil das nebenbei produzierte Unurium (zumindest bei mir) nicht reicht. Also wirklich entspannt machbar.[BR][BR]ustoni schrieb:\t\t\tMeine 553 Wunderstufen bremsen mich im Turnier übrigens nicht im geringsten aus, egal wie oft hier im Forum das Gegenteil behauptet.\t\tZum Vergrößern anklicken....[BR]Die Anzahl der \"must have\" plus \"can have\" Wunderstufen liegt ja auch etwa in der Größenordnung. Bei meinen ca. 500 sind auch nur so wenige wirklich bremsende Stufen dabei, dass das nicht sonderlich stört. Aber vergleich mal deine Truppgröße im Turnier mit der von Spielern, die doppelt so viele Wunderstufen haben! Die zusätzlichen sind dann fast alles Wunderstufen, die im Turnier nichts bringen, du kannst aus dem prozentualen Unterschied der Truppgrößen also direkt auf deren Nachteil im Turnier schließen.[BR][BR]Damit du nicht lang suchen musst: Ein Spieler mit ca. 1000 Wunderleveln aber ähnlicher Anzahl gelegter Erweiterungen und ähnlichem Forschungsstand hat eine um ca. 60% höhere Truppgröße und damit auch 60% mehr Verluste im Turnier als ich. Natürlich ist das kein großes Problem, wenn man im Turnier sowieso unter ca. 7-10k bleibt, aber bei einem Schnitt >15K ist das ein absolutes no go!"}, {"2": "ErestorX schrieb:\t\t\tDamit du nicht lang suchen musst: Ein Spieler mit ca. 1000 Wunderleveln aber ähnlicher Anzahl gelegter Erweiterungen und ähnlichem Forschungsstand hat eine um ca. 60% höhere Truppgröße und damit auch 60% mehr Verluste im Turnier als ich. Natürlich ist das kein großes Problem, wenn man im Turnier sowieso unter ca. 7-10k bleibt, aber bei einem Schnitt >15K ist das ein absolutes no go!\t\tZum Vergrößern anklicken.......ich hab jetzt in 8 Tagen über 1700 WPs für die Forschung angesammelt - hinzu kommen dann noch die ganzen Runen und Segen - wozu brauch ich soviel Turnier (wenn ich keine Wunder mehr befüllen \"dürfte\")?"}, {"189": "Romilly schrieb:\t\t\twozu brauch ich soviel Turnier (wenn ich keine Wunder mehr befüllen \"dürfte\")?\t\tZum Vergrößern anklicken....[BR]Na, niemand \"braucht\" so viel Turnier. Man \"braucht\" auch nicht wirklich einen guten Platz in der Rangliste anzustreben oder überhaupt Elvenar zu spielen. Aber es gibt nun mal Spieler, die gern um einen vorderen Platz in der Rangliste oder um einen vorderen Platz im Turnier mitspielen. Früher ging sogar beides, mittlerweile muss man sich entscheiden: Entweder alle Wunder voll ausbauen und alle Erweiterungen legen, um auf Rangliste spielen zu können, oder nur knapp die Hälfte der Wunder ausbauen und keine Erweiterungen mehr legen, um regelmäßig um eine gute Platzierung im Turnier spielen zu können.[BR][BR]Viele Spieler interessiert natürlich weder das Eine noch das Andere, offensichtlich sind solche Erwägungen für die ziemlich irrelevant. Aber du hast Recht - Elvenar war ein viel besseres Spiel als man die WP aus dem Turnier noch gebrauchen konnte, um seine Wunder zu befüllen! Wenn ich die Runen mitrechne, habe ich genug WP, um alle meine Wunder voll auszubauen, nur dass ich mich für Turnier und gegen Rangliste entschieden habe und die daher in der Leiste und im Inventar vergammeln lassen muss.[BR][BR]Das gleiche gilt für die Erweiterungen. Schon erstaunlich, dass Inno weiterhin darauf beharrt, den Turnierspielern einer starken Anreiz zu geben, keinesfalls mehr Geld in Premiumerweiterungen zu stecken![BR][BR]Aber wir entfernen uns vom Thema, daher wäre es nett, wenn du auf weitere Fragen zu diesem Themenkomplex verzichten könntest."}, {"2": "ErestorX schrieb:\t\t\tAber wir entfernen uns vom Thema, daher wäre es nett, wenn du auf weitere Fragen zu diesem Themenkomplex verzichten könntest.\t\tZum Vergrößern anklicken.......richtig - hier ging es um Saatmangel bzw. WPs für die neue Forschung (und sogar um Platzmangel) und NICHT darum, ob man in Kapitel 20 ein Turnier gewinnen kann..."}, {"6": "Noch etwas ist mir aufgefallen:[BR]Die meisten Quests haben mit Kapitel 20 eigentlich nichts zu tun. Warum muss ich jetzt 40 Visionsschwaden sammeln? Mir fehlt da irgendwie der Zusammenhang. Quests, die sich auf Forschung bzw. Gastrasse beziehen sind bisher die Ausnahme."}, {"9": "Romilly schrieb:\t\t\t..richtig - hier ging es um Saatmangel bzw. WPs für die neue Forschung (und sogar um Platzmangel) und NICHT darum, ob man in Kapitel 20 ein Turnier gewinnen kann...\t\tZum Vergrößern anklicken...... .. ... ??[BR]Romilly schrieb:\t\t\thier ging es um Saatmangel bzw. WPs für die neue Forschung\t\tZum Vergrößern anklicken...... .. und was interessiert \"mich\" z.B dein oder anderer Spieler ihr Saat- und WP-Mangel, den hab ich nämlich nicht![BR]Aber es gehört zu diesem Kapitel dazu, da man es benötigt![BR]Also kommt dies in einem Feedback-Thread auch zur Sprache und ich muss es akzeptieren, auch wenn es mich nicht betrifft oder interessiert (dann lese ich das, kann aber so nicht mitdiskutieren, weil es mich nicht betrifft)![BR]Romilly schrieb:\t\t\tund NICHT darum, ob man in Kapitel 20 ein Turnier gewinnen kann...\t\tZum Vergrößern anklicken....Du bist doch selbst in diese Diskussion im Bezug aufs Turnier eingestiegen und natürlich gehört das Turnier und alles was sich daraus ergibt zu diesem Kapitel! Denn zum einem, gesteht, bzw. räumte doch INNO selbst die Prozentuale Erhöhung durch Forschung, Erweiterungen und Wunderstufen im Turnier + Turm ein und zum anderen, möchte ich diese zwei Elemente weiter spielen, sowohl während als auch nach dem Kapitel![BR]Den all das schließe ich in diesem Kapitel ab, bzw. wird dies alles in diesem Kapitel erfordert.[BR]Folglich erschwert es das Turnier und den Turm, bzw. bleiben diese zwei Elemente ja dennoch erhalten (auch mit diesem Kapitel).[BR][BR]Mich interessiert solch ein Beitrag dann wie der von @ErestorX schon, denn das Turnier sowie der Turm ist nach wie vor ein fester Bestandteil des Spiels und es gehört eben dazu, auch im Kapitel 20.[BR]Nur weil das dann einer nicht spielt oder nicht alle Provinzen erobern/ausspielen möchte, heißt das ja nicht, dass es dann in einem Feedback-Thread fehl am Platz ist.[BR]Da ich in diesem Kapitel gar stärkere Truppen bekomme, ist es sehr wohl auch relevant und gehört folglich doch genauso zum Feedback?[BR]Genauso erhalte ich in diesem Kapitel neue Erweiterung (Premium aber auch durch die Forschung sowie durch die eingenommen Provinzen) und ich schließe eben erneut und weitere Forschungen ab. [BR][BR]Da all das ins Turnier sowie den Turm einbezogen/einberechnet wird, ohne das INNO ein Geheimnis daraus macht, kann man sich dann als Spieler auch ruhig hinterfragen, \"wie schwer wird ein Turnier\" oder \"ist es dann noch möglich zu gewinnen\". [BR][BR]Ich mag ja deine Blinker-Blitzi-Stadt und Bauweise auch nicht, dennoch stellst du sie hier ein und zeigst sie vielen.[BR]Da es mich aber nicht interessiert wie du baust, enthalte ich mich dann dieser Diskussion.[BR]Du darfst ja nicht immer nach deinen Bedürfnissen gehen.[BR]Es gehört also genauso dazu (Turnier und seine Eigenschaften im Bezug auf das Kapitel). [BR]\"Mich\" und andere interessiert es sogar, ob man noch ein Turnier gewinnen kann oder nicht. ;-)[BR]Also Danke für deinen Beitrag @ErestorX!"}, {"2": "Romilly schrieb:\t\t\tund NICHT darum, ob man in Kapitel 20 ein Turnier gewinnen kann...\t\tZum Vergrößern anklicken....@AngelOfDead ....lies mal genau... und meine[BR]AngelOfDead schrieb:\t\t\tBlinker-Blitzi-Stadt und Bauweise\t\tZum Vergrößern anklicken......ist sehr gut auf das neue Kapitel ausgerichtet bzw. darauf, evtl. auftretenden Mängeln entgegen zu wirken...[BR][BR]...und hier eingestellt habe ich die, um meine Einteilung der neuen Gastrassengebäude zu zeigen, nicht wegen dem Blitzi-Blinki (dazu hätte ich keinen Architektenplan eingestellt)...das ist übrigens bis jetzt der einzige Aufstellungsplan hier...(obwohl schon danach gefragt wurde)..."}, {"6": "@AngelOfDead: ich kann dich beruhigen. In Kaserne und Co. erhöht sich die Ausbildungsgeschwindigkeit nach dem Ausbau um rund 25%. Es werden also in der gleichen Zeit 25% mehr Truppen ausgebildet. Forschung und Erweiterungen vergrößern die Truppgrößen in Turnier und Turm um 16 bis 18 %. Das wird also mehr als ausgeglichen.[BR]Hinzu kommen die neuen 4*-Truppen.[BR]Damit bringt das Kapitel eher eine Verbesserung für Turm- und Turnierspieler.[BR][BR]Natürlich hat auch @ErestorX vollkommen recht. Wenn jemand alles an Wundern baut was er kann - damit also auch die unsinnigen Wunder baut - und dadurch auf z.B. 1000 Wunderstufen kommt, hat er natürlich ein Problem. Dass man nur sinnvolle Wunder aufstellen sollte (und das sind nicht nur Kampfwunder), wurde aber auch schon in anderen Threads ausreichend dargestellt. Hier gilt es einfach einen vernünftigen Mittelweg zu finden - der nicht für jeden Spieler der gleiche ist. Man muss einfach ein wenig überlegen, was man macht."}, {"9": "ustoni schrieb:\t\t\t@AngelOfDead: ich kann dich beruhigen. In Kaserne und Co. erhöht sich die Ausbildungsgeschwindigkeit nach dem Ausbau um rund 25%. Es werden also in der gleichen Zeit 25% mehr Truppen ausgebildet. Forschung und Erweiterungen vergrößern die Truppgrößen in Turnier und Turm um 16 bis 18 %. Das wird also mehr als ausgeglichen.[BR]Hinzu kommen die neuen 4*-Truppen.[BR]Damit bringt das Kapitel eher eine Verbesserung für Turm- und Turnierspieler.\t\tZum Vergrößern anklicken....Ok - Danke soweit hab ich in der tat noch nicht gerechnet! [BR]ustoni schrieb:\t\t\tNatürlich hat auch @ErestorX vollkommen recht. Wenn jemand alles an Wundern baut was er kann - damit also auch die unsinnigen Wunder baut - und dadurch auf z.B. 1000 Wunderstufen kommt, hat er natürlich ein Problem. Dass man nur sinnvolle Wunder aufstellen sollte (und das sind nicht nur Kampfwunder), wurde aber auch schon in anderen Threads ausreichend dargestellt. Hier gilt es einfach einen vernünftigen Mittelweg zu finden - der nicht für jeden Spieler der gleiche ist. Man muss einfach ein wenig überlegen, was man macht.\t\tZum Vergrößern anklicken....Ja ich weiß und genau das macht es ja mitunter so schwer, denn einen Mittelweg zu finden, war noch nie einfach. [BR][BR]Romilly schrieb:\t\t\t@AngelOfDead ....lies mal genau... und meine\t\tZum Vergrößern anklicken....Hab ich schon getan und für mich liest es sich so, als hätte das nichts damit zu tun. ;-) [BR][BR]Romilly schrieb:\t\t\t..ist sehr gut auf das neue Kapitel ausgerichtet bzw. darauf, evtl. auftretenden Mängeln entgegen zu wirken...\t\tZum Vergrößern anklicken....Joar wenn du meinst, ich habe das ganze Eventgedöns schon lange nicht mehr und habe ebenso keinerlei Probleme. ;-)"}, {"2": "AngelOfDead schrieb:\t\t\tJoar wenn du meinst, ich habe das ganze Eventgedöns schon lange nicht mehr und habe ebenso keinerlei Probleme. ;-)\t\tZum Vergrößern anklicken.......ja klar, weil du Ranglistenspieler bist - mein Platz auf 350 würde dir nicht gefallen - diese \"Diskussion\" ist aber weder für das Feedback an INNO noch für evtl. Nachzügler sonderlich hilfreich...[BR][BR]...bleiben wir also beim Thema - in Kapitel 20 wird wieder viel Saat verlangt und für mehr Saat sind mehr Wunderlevel (Sammelbonus aus dem Marktplatz) äußerst hilfreich (kein Nachzügler wird so schnell an die 660 ran kommen)...außerdem empfehle ich, die blühende Händlergilde kontinuierlich auszubauen, da sie den Portalbonus erhöht..."}, {"9": "Romilly schrieb:\t\t\t...ja klar, weil du Ranglistenspieler bist\t\tZum Vergrößern anklicken....Hat damit gar nichts zu tun, denn auch wenn ich nicht Ranglistenspieler wäre, würde ich mir solche \"Massen\" wie du, niemals in die Stadt stellen, aber du spielst eben auch fürs Auge, ich rein und nur auf Strategie, Taktik und Effizient.[BR]Ich mag keine XXX Kultur-Gebäude weil sie schön sind oder dies und jenes. ;-) [BR][BR]Romilly schrieb:\t\t\t(kein Nachzügler wird so schnell an die 660 ran kommen)\t\tZum Vergrößern anklicken....Ist ebenso falsch, was ist mit jenen Spielern, die vielleicht lange nach Kapitel 17 oder 18 standen (pausierten) und nach XXX Monaten dann weitergehen. Im Prinzip sind das auch Nachzügler. ^^[BR][BR]Romilly schrieb:\t\t\t..bleiben wir also beim Thema\t\tZum Vergrößern anklicken....????"}, {"2": "AngelOfDead schrieb:\t\t\tdu spielst eben auch fürs Auge, ich rein und nur auf Strategie, Taktik und Effizient.[BR]Ich mag keine XXX Kultur-Gebäude weil sie schön sind oder dies und jenes. ;-)\t\tZum Vergrößern anklicken.......wo (außer kleinen Lückenfüllern) hab ich denn reine Kulturgebäude? - du findest nicht mal mehr viele Kultur-/Bev.-Hybriden in meiner Stadt - was da steht, sind Sets und Evos, die teilweise viel effizienter sind als entsprechende Gebäude aus dem Baumenü und auch Kulturgebäude gehören in den strategischen/taktischen Bereich...[BR][BR]AngelOfDead schrieb:\t\t\tIst ebenso falsch, was ist mit jenen Spielern, die vielleicht lange nach Kapitel 17 oder 18 standen (pausierten) und nach XXX Monaten dann weitergehen. Im Prinzip sind das auch Nachzügler.\t\tZum Vergrößern anklicken.......sind das dann die gleichen Nachzügler, die kaum Portalsegen haben? - also von denen du vorhin gesprochen hast?[BR][BR]...wer taktisch soviel auf dem Kasten hat, kann ja wohl selbst ganz gut entscheiden, wie er/sie am Besten durch dieses Kapitel kommt - allen anderen mit (ungelöstem) Saatmangel empfehle ich aber, für mehr Wunderstufen zu sorgen - und dabei bleibe ich..."}, {"9": "Romilly schrieb:\t\t\t...wo (außer kleinen Lückenfüllern) hab ich denn reine Kulturgebäude? - du findest nicht mal mehr viele Kultur-/Bev.-Hybriden in meiner Stadt - was da steht, sind Sets und Evos, die teilweise viel effizienter sind als entsprechende Gebäude aus dem Baumenü und auch Kulturgebäude gehören in den strategischen/taktischen Bereich...\t\tZum Vergrößern anklicken....Ah ok dann ist die halbe Ponyzucht taktisch und Sets und Evos. aus dem Kapitel Konstrukte und Amuni (6 Kapitel zuvor) im Kapitel 20 wahrscheinlich sehr Strategisch? ^^[BR][BR]Romilly schrieb:\t\t\t...sind das dann die gleichen Nachzügler, die kaum Portalsegen haben? - also von denen du vorhin gesprochen hast?\t\tZum Vergrößern anklicken....Was weiß ich such es dir doch aus. ;-)[BR]Sodala und nun schweifen wir definitiv vom Thema ab, so das ich mich ausklinke. ;-)"}]