[{"2": "AngelOfDead schrieb:\t\t\tAh ok dann ist die halbe Ponyzucht taktisch und Sets aus dem Kapitel Amuni im Kapitel 20 wahrscheinlich sehr Strategisch? ^^\t\tZum Vergrößern anklicken....sicher - die \"Ponyzucht\" kann man für 2 RR bei Eventquests nutzen und von den Eventgebäuden level ich natürlich nur, was aktuell taktisch sinnvoll ist - also so gut, daß ich für jedes neue Kapitel ein paar Tausend Restaurationen auf Lager hab, bin ich natürlich auch nicht..."}, {"94": "ustoni schrieb:@AngelOfDead: ich kann dich beruhigen. In Kaserne und Co. erhöht sich die Ausbildungsgeschwindigkeit nach dem Ausbau um rund 25%. Es werden also in der gleichen Zeit 25% mehr Truppen ausgebildet. Forschung und Erweiterungen vergrößern die Truppgrößen in Turnier und Turm um 16 bis 18 %. Das wird also mehr als ausgeglichen.[BR]Hinzu kommen die neuen 4*-Truppen.[BR]Damit bringt das Kapitel eher eine Verbesserung für Turm- und Turnierspieler.\t\tZum Vergrößern anklicken....Tschuldigung wenn ich mich hier rein quetsche, ich lese immer wieder die \"Ausbildungsgeschwindigkeit wird erhöht so und so\" [BR]Die Ausbildungsgeschwindigkeit ist relativ und kein signifikanter Vorteil insofern sie nicht immer effizient ausgeschöpft wird. [BR]Wenn zum Beispiel eine Truppenproduktion in den Kasernen spät in der Nacht endet und man 6+ Stunden später erst neu voll machen kann dann hat man keinen 25% Ausbildungsgeschwindigkeit Vorteil, jedenfalls nicht immer sicher.[BR]Das gilt in übrigen auch für Wunder die auf die Ausbildungsgeschwindigkeit einwirken, ob eine Fliegende Akademie auf lvl 35 besser ist als eine auf lvl 30 ist auch relativ. [BR][BR]Daher stelle ich die angeblichen Vorteile in den neuen Kapiteln auch immer in Frage, denn so viele gibt es dort gar nicht wenn man genau hinsieht um den Truppengrößen Anstieg auszugleichen."}, {"9": "Romilly schrieb:\t\t\tsicher - die \"Ponyzucht\" kann man für 2 RR bei Eventquests nutzen\t\tZum Vergrößern anklicken....und verballert 2 RRs wo ich mit einem einer Gebäude den selben effekt habe, dass man dann keine[BR]Romilly schrieb:\t\t\tRestaurationen auf Lager\t\tZum Vergrößern anklicken....hat, leuchtet ein. Zumal ich weder das einer noch zweier Kulturgebäude buffen kann. ^^ Die Strategie versteh ich nicht? Man schmeißt mehr raus als man muss und Evos. die 6 Kapitel zurück liegen sind dann mit 16 Feldern noch gewinnbringend? Ok, man lernt nie aus. ^^"}, {"6": "Jammin schrieb:\t\t\tDie Ausbildungsgeschwindigkeit ist relativ und kein signifikanter Vorteil insofern sie nicht immer effizient ausgeschöpft wird.\t\tZum Vergrößern anklicken....Gut, das ist natürlich ein Argument. [smilie--sprite2][BR]Dann ergänze ich mal: Die Trainingsgröße in den Rüstkammern vergrößert sich nach Ausbau ebenfalls um 25%."}, {"94": "ustoni schrieb:\t\t\tGut, das ist natürlich ein Argument. [smilie--sprite2][BR]Dann ergänze ich mal: Die Trainingsgröße in den Rüstkammern vergrößert sich nach Ausbau ebenfalls um 25%.\t\tZum Vergrößern anklicken....Das ist ein Argument, auch wenn ein ziemlich kleines, insofern man ordentlich RK's in der Stadt hat.[BR]Bedenke eine RK lvl 37 produziert bei mir 500 Truppen, das ist lächerlich wenig mit 25% mehr wird man auch kein/e Turnier Sieger/in.[BR]Ausschlaggebend wäre hier viel mehr die Anzahl der neu hinzu kommenden RK Stufen, die einen signifikanten Produktionsanstieg in Kombination mit lvl Max Pilzen hervorbringen.[BR][BR]Edit: Die Gesamtanzahl der Stufen einer RK kann zB irgendwann unter bestimmten Voraussetzungen ausschlaggebend sein, eine Stadterweiterung für eine RK zu platzieren. \"Das wäre der Heilige Gral\""}, {"21": "ustoni schrieb:\t\t\tNoch etwas ist mir aufgefallen:[BR]Die meisten Quests haben mit Kapitel 20 eigentlich nichts zu tun. Warum muss ich jetzt 40 Visionsschwaden sammeln? Mir fehlt da irgendwie der Zusammenhang. Quests, die sich auf Forschung bzw. Gastrasse beziehen sind bisher die Ausnahme.\t\tZum Vergrößern anklicken....[BR]Bei mir ist questtechnisch eh schon Feierabend. Ich produziere keine Nicht-Bonusgüter. Wer läßt sich bloß so etwas einfallen? [smilie--sprite11]"}, {"6": "Jammin schrieb:\t\t\tDas ist ein Argument, auch ...\t\tZum Vergrößern anklicken....[BR]Ja, ist ein ziemlich komplexes Thema.  [smilie--sprite1] [BR]Ganz ehrlich: eine korrekte Antwort habe ich im Moment auch nicht.[BR]Zur Zeit laufen voll bestückte Kasernen und Co. bei mir ziemlich genau 9 Stunden.[BR]Nach Abschluss von Kapitel 20 und Ausbau aller Gebäude werde ich ja sehen, inwiefern sich die Ausbildungszeit ändert.[BR]Gegebenenfalls muss ich dann eben nachbessern. Möglichkeiten dazu gibt es ja genug."}, {"94": "ustoni schrieb:\t\t\tJa, ist ein ziemlich komplexes Thema.  [smilie--sprite1]Zum Vergrößern anklicken....Ja das stimmt, zudem gibt es noch so ein Phänomen, das man etwas gut findet weil man es hat, bzw man versucht das Gute darin zu sehen... kennts du bestimmt. Ein Beispiel den ich bei uns im Chat gegeben hab: Wenn ich mir ohne Anprobe eine Bluse kaufe, die zu eng ist und sie nicht zurückgeben möchte weil alle sagen, dass ich hübsch drin aussehe.  [BR][BR]Falls jetzt jemand denkt, man könnte sie ja zurückgeben und eine kaufen die etwas weiter ist, sollte man sich auch fragen ob man dann noch hübsch drin aussieht oder eher dick [smilie--sprite1] [BR][BR]Das Thema ist nicht nur Komplex sondern auch schwierig relevante Informationen raus zu filtern."}, {"119": "Ich bin jetzt zu etwa 60% mit der GR fertig, Portal ist auf 4 und ich habe jeweils 14 Flöten, Trommel usw stehen., Stadt ist gelevelt[BR]meine kleinen Zeitbooster unter 14h sind alle weg, hatte aber auch nur 600 von jeden [smilie--sprite3][BR]15M saat verbraucht,10M Unurium futsch[BR]den rest mache ich jetzt im 3h Modus, ganz entspannt also [smilie--sprite1]"}, {"189": "Indianaking schrieb:\t\t\tBei mir ist questtechnisch eh schon Feierabend. Ich produziere keine Nicht-Bonusgüter.\t\tZum Vergrößern anklicken....Produzieren würde ich ja noch, egal ob nun in einer Schrifti oder Kristallmanu. Aber massenweise knappe Saat in den Ausbau einer Seidenmanu stecken, um dann ab lvl 33 einen \"Stilvollen Mantel\" produzieren zu können? Sicher nicht! Ich find ja meistens einen Grund, mit der Questline aufzuhören, aber das scheint mir eindeutig ein Kandidat für die undurchdachteste Questaufgabe überhaupt zu sein."}, {"2": "AngelOfDead schrieb:\t\t\tund verballert 2 RRs wo ich mit einem einer Gebäude den selben effekt habe, dass man dann keine\t\tZum Vergrößern anklicken.......die produzieren meistens was und um die Produktion nicht zu verwerfen, level ich halt lieber die kleinen Lückenfüller ohne Produktion, wenn ich schnell in den Eventquests weiterkommen will...außerdem sind das halt eben Lückenfüller, die nur zufällig gerade in einer Reihe stehen, weil ich ja die Gastrasse noch nicht komplett aufgebaut habe - die verschwinden dann in den Löchern...(teilweise sogar optisch)...[BR][BR]AngelOfDead schrieb:\t\t\tund Evos. die 6 Kapitel zurück liegen sind dann mit 16 Feldern noch gewinnbringend?\t\tZum Vergrößern anklicken.......ja klar, wenn die z.B. Feuerphönix heißen, dann brauch ich die nicht leveln...[BR][BR]...ich dachte, du wolltest dich aus dieser sinnlosen Diskussion zurück ziehen...[BR][BR]Primus71 schrieb:\t\t\tIch bin jetzt zu etwa 60% mit der GR fertig, Portal ist auf 4 und ich habe jeweils 14 Flöten, Trommel usw stehen., Stadt ist gelevelt[BR]meine kleinen Zeitbooster unter 14h sind alle weg, hatte aber auch nur 600 von jeden [smilie--sprite3][BR]15M saat verbraucht,10M Unurium futsch\t\tZum Vergrößern anklicken.......kannst du bestätigen, daß man die Ensembles dann nicht mehr braucht bzw. muss man da alle 6 (18) zusammen stehen haben, um ausbauen zu können oder kann man die auch nacheinander bauen? - wieviel Einfluß hat eine Reduktion auf die Produktion der Lieder im Portal? (vermutlich gar keinen)..."}, {"253": "Also für mich lautet ja die Kernfrage eigentlich:[BR]Werde ich Kapitel 20 auch mit ausgeschaltetem Computersound spielen können??"}, {"119": "um das Portal auf 4 ausbauen zu können, muss man jeweils 6 der Ensembles stehen haben.[BR]und haben keinen Einfluss"}, {"2": "Primus71 schrieb:\t\t\tum das Portal auf 4 ausbauen zu können, muss man jeweils 6 der Ensembles stehen haben.[BR]und haben keinen Einfluss\t\tZum Vergrößern anklicken.......ok - aber danach kann ich also komplett umbauen..."}, {"128": "Was freue ich mich auf Kapitel 20![BR][BR]Ich denke, 2024 werde ich angreifen..."}, {"91": "Jammin schrieb:\t\t\tDie Gesamtanzahl der Stufen einer RK kann zB irgendwann unter bestimmten Voraussetzungen ausschlaggebend sein, eine Stadterweiterung für eine RK zu platzieren. \"Das wäre der Heilige Gral\"\t\tZum Vergrößern anklicken....Habe die neuen RükS nur überflogen, aber diesen Punkt dürften sie noch nicht erreichen. Wer den Zeitpunkt bemerkt, wann sich Flächenkauf für zusätzliche Rükas lohnt, der bekommt einen ausgegeben [smilie--sprite2]"}, {"189": "BlackLabelSociety schrieb:\t\t\tHabe die neuen RükS nur überflogen, aber diesen Punkt dürften sie noch nicht erreichen. Wer den Zeitpunkt bemerkt, wann sich Flächenkauf für zusätzliche Rükas lohnt, der bekommt einen ausgegeben [smilie--sprite2]Zum Vergrößern anklicken....[BR]Vermutlich wird das nie passieren. Die meisten Level für den Flächenbedarf (inklusive dem für Bevölkerung und Kultur) gibt es noch immer für Rükas Level 31 und die sind leider weit davon entfernt, die Nachteile des Zukaufs von Fläche kompensieren zu können."}, {"23": "gibt es eigentlich noch die Verkaufsstände in der Aka hier im Kapitel, oder muss ich sie teuer leveln?"}, {"2": "Fenja von osten schrieb:\t\t\tgibt es eigentlich noch die Verkaufsstände in der Aka hier im Kapitel, oder muss ich sie teuer leveln?\t\tZum Vergrößern anklicken.......wegen einem neuen Kapitel ändert sich idR im Prinzip nichts im Handwerk (außer die Werte der Gebäude)...es kann halt dauern, bis die Verkaufsstände auftauchen..."}, {"4": "Fenja von osten schrieb:\t\t\tgibt es eigentlich noch die Verkaufsstände in der Aka hier im Kapitel, oder muss ich sie teuer leveln?\t\tZum Vergrößern anklicken....warum soll es die nicht mehr geben? Leider ist es halt so, dass manche Dinge nur selten angeboten werden, andere Spieler erhalten diese Angebote dann ständig.[BR][BR]Ich hatte mit einem Account mal über ein halbes Jahr auf ein Orknest gewartet, solche Zeiten gibts leider immer mal wieder."}]