[{"23": "danke euch für die Antworten, dann warte ich mal weiter sehnsüchtig [smilie--sprite1][BR]also dabei ist dann wohl nix geändert worden in der Aka"}, {"119": "Positiv :[BR]keine wahnwitzigen Anforderungen , schon herausfordernd aber handelbarsinnvoller und nützlicher Einsatz der Portalsegen möglichganz tolles Design mal wieder, großes Lob an die Grafikerhervorragend ausgearbeitete Spielmechanik, großes Lob an die Entwickler[BR]Negativ :[BR]Bei den Ensembles müsste klarer erkennbar sein, ob sie verbraucht sindbei der Hauptquest bin ich steckengeblieben bei \"Baue 12 Geigenensembles \"  - echt ey ? warum in aller Welt sollte man 12 von den Dingern bauen, wenn man nur 6 für den Ausbau des Portals braucht ?[BR]Fazit : Sehr angenehm und chillig zu spielende Gastrasse, man merkt immer den Fortschritt ohne verrückte 3-Schritt vor, 2-zurück-Gängeleien[BR]          wenn mal ein paar Leute das neue t9 haben und handeln, ist das auch kein großes Hindernis mehr[BR]         endlich mal wieder Portalos sinnvoll genutzt, fand ich immer schade die im großem Ausmasse fragmentieren zu müssen[BR][BR]Benötigte Zeit : 4t23h"}, {"2": "Primus71 schrieb:\t\t\tbei der Hauptquest bin ich steckengeblieben bei \"Baue 12 Geigenensembles \" - echt ey ? warum in aller Welt sollte man 12 von den Dingern bauen, wenn man nur 6 für den Ausbau des Portals braucht ?\t\tZum Vergrößern anklicken.......hast du davon einen Screenshot? - könnten das vielleicht auch beliebige 12 Stück sein? - also nicht nur von der Geige?..."}, {"119": "Romilly schrieb:\t\t\t...hast du davon einen Screenshot? - könnten das vielleicht auch beliebige 12 Stück sein? - also nicht nur von der Geige?...\t\tZum Vergrößern anklicken....war jetzt zwar Trommel, aber anyway..."}, {"2": "Primus71 schrieb:\t\t\twar jetzt zwar Trommel, aber anyway...\t\tZum Vergrößern anklicken.......huch - auch noch \"weitere\"....[BR][BR]....bei iDavis heißt es nur \"Ensembles\" - da kommt dann noch einmal eine Quest mit 15 Stück (danach keine mehr)....[BR][BR][IMG]https://i.ibb.co/28VJrd1/https-de-forum-elvenar-com-index-php-attachments-ensembles-png-31121.png[/IMG][BR][BR]...wäre gut, wenn uns da ein Beta-Spieler weiterhelfen könnte, der diese Quest schon erfüllt hat...[BR][BR](bei Nr. 72 ist vermutlich ein Fehler drin - denke, daß es da eine Holzmanu auf 34 sein sollte und nicht nochmal Stahl)..."}, {"141": "Primus71 schrieb:\t\t\twar jetzt zwar Trommel, aber anyway...\t\tZum Vergrößern anklicken....bitte lass das nicht wahr sein..."}, {"8": "Primus71 schrieb:\t\t\tBenötigte Zeit : 4t23h\t\tZum Vergrößern anklicken....[smilie--sprite12][BR]Fantastisch! Glückwunsch.[BR][BR]Bin echt neugierig:[BR]Was hat dich das an Zeitboostern und Diamanten gekostet???"}, {"114": "Feedback.. ok. Mit meiner großen Stadt bin ich auch dran. 12 und 15 Ensembles... lächerlich. Stadt wegräumen für unnötig und übertrieben viele dieser Gebäude? Mag ja sein das hier 1..2..3 tönen die das toll finden. Und nein.. das ist für mich keine Herausforderung für mich ist das einfach nur einfach bescheuert. Quests abgebrochen. Ich ärgere mich schon über die 1 Mio Mana die ich gezahlt hab. Ich brauch dringend Elvenar Urlaub denn dieser Unsinn hats mir grad echt verhagelt"}, {"119": "gergerw schrieb:[smilie--sprite12][BR]Fantastisch! Glückwunsch.[BR][BR]Bin echt neugierig:[BR]Was hat dich das an Zeitboostern und Diamanten gekostet???\t\tZum Vergrößern anklicken....etwa 7000h an Zeitboostern und 15k Dias. 20M Saat, 10M Unurium[BR]war allerdings materialmäßig onpoint vorbereitet"}, {"8": "Primus71 schrieb:\t\t\tetwa 7000h an Zeitboostern und 15k Dias. 20M Saat, 10M Unurium[BR]war allerdings materialmäßig onpoint vorbereitet\t\tZum Vergrößern anklicken....Wow! Du musst alle Saat- und Unuriumwunder haben. ich schaff nicht mal ne Mio. bei irgendeinem davon.[BR][BR]Auf jeden Fall wünsch ich euch ne schöne Zeremonie wenn @ererstorX dir dann in ein paar Wochen hoch-feierlich seine Krone als neue Turnierkönigin winyandors überreicht. [smilie--sprite1][BR][BR]Vermutlich hast du das Scoutwunder schon auf Stufe30 [smilie--sprite8]"}, {"119": "nee, erst Stufe 3 [smilie--sprite1][BR]ganz chillig hoch leveln"}, {"189": "gergerw schrieb:\t\t\tAuf jeden Fall wünsch ich euch ne schöne Zeremonie wenn @ererstorX dir dann in ein paar Wochen hoch-feierlich seine Krone als neue Turnierkönigin winyandors überreicht.\t\tZum Vergrößern anklicken....Tsts, du hast nicht mitgedacht![BR][BR]1. @Primus71 hat während der Gastrasse tatsächlich stark von einigen seiner ansonsten nutzlosen Wunder profitiert, hat dafür aber auch eine doppelt so große Truppgröße  im Turnier und damit doppelt so hohe Verluste wie ich.[BR][BR]2. Wer all seine Booster in der Gastrasse raushaut, kann die nicht zur Produktion von Truppen oder Erkundung von Provinzen nutzen.[BR][BR]Also ich bin faul und habe in vielen Turnieren zu wenig Provinzen, gibt daher gleich 2 Spieler, die in letzter Zeit mehr Turniere gewonnen haben als ich, aber Primus hat offensichtlich ein anderes Ziel!"}, {"141": "bin nu schon so lange dabei und weiß doch scheinbar nix, oder habe es vergessen, jedenfalls steh ich hier voll auf dem Schlauch...[BR]Quest 28:\t\"Erreiche einen Kulturbonus von 150 %\" [BR]Ich habe ein paar der wenigen Kulturgebäude die ich noch habe, mit der Magischen Mitgift belegt, habe dadurch 150 % Kultur, aber nicht die Sonne mit den paar Wölkchen, sondern mehr Wolken als Sonne . Für die nächste Stufe bräuchte ich >400.000 Kultur... Wo soll ich die denn her kriegen? [BR]Gibt es einen Workaround oder \"Trick\"?[BR]Würde es schon reichen, wenn ich noch mehr Kulturgebäude (400.000 schaffe ich niemals...) setze, die dann bei der Nachbarschaftshilfe poliert werden?"}, {"2": "Fritzilein schrieb:\t\t\tbin nu schon so lange dabei und weiß doch scheinbar nix, oder habe es vergessen, jedenfalls steh ich hier voll auf dem Schlauch...[BR]Quest 28:    \"Erreiche einen Kulturbonus von 150 %\" Anhang 31139 ansehen[BR]Ich habe ein paar der wenigen Kulturgebäude die ich noch habe, mit der Magischen Mitgift belegt, habe dadurch 150 % Kultur, aber nicht die Sonne mit den paar Wölkchen, sondern mehr Wolken als Sonne . Für die nächste Stufe bräuchte ich >400.000 Kultur... Wo soll ich die denn her kriegen?[BR]Gibt es einen Workaround oder \"Trick\"?[BR]Würde es schon reichen, wenn ich noch mehr Kulturgebäude (400.000 schaffe ich niemals...) setze, die dann bei der Nachbarschaftshilfe poliert werden?\t\tZum Vergrößern anklicken.......die Mitgift hilft dir dabei nicht, denn damit ist der normale Bonus gemeint, also die Sonne - aber die Hilfe deiner Gilde/Nachbarn verdoppelt den Ertrag deiner Kulturgebäude - ansonsten musst du halt so viele Kulturfresser (Rüstis) einlagern, bis dein Bonus entsprechend gestiegen ist..."}, {"141": "Romilly schrieb:\t\t\t...die Mitgift hilft dir dabei nicht, denn damit ist der normale Bonus gemeint, also die Sonne - aber die Hilfe deiner Gilde/Nachbarn verdoppelt den Ertrag deiner Kulturgebäude - ansonsten musst du halt so viele Kulturfresser (Rüstis) einlagern, bis dein Bonus entsprechend gestiegen ist...\t\tZum Vergrößern anklicken....[BR]hm - ich bin mir nicht sicher ob mir die Antwort gefällt, aber ich like sie mal trotzdem ;-)[BR]Jedenfalls ganz lieben Dank für die schnelle Reaktion!"}, {"21": "[smilie--sprite4]Punkto Ensembles: megamäßig schlecht erklärt . Lt Wiki gilt folgendes:[BR][BR]MERKE: Anforderungen sind nicht stapelbar, d.h. wenn du die Anforderungen benutzt, um den Hain der Harmonie zu verbessern, gehen sie \"verloren\" und du musst weitere Bedarfsgebäude bauen, um deinen Hain der Harmonie weiter zu verbessern![BR][BR]Deshalb: bei meinem Hain sind zum Ausbau auf Stufe 2 je 1x Flöten, 1x Geigen und 1 x Trommelensemble \"verloren\". Unter \"verloren gegangen\" verstehe ich daß sie nicht mehr benutzbar ist und verkauft werden können, weil eben verloren.[BR][BR]Zum Ausbau auf Stufe 3 benötige ich nun je 2 von den Ensembles, also habe ich je 2 Stück neu gebaut, es wird aber jeweils nur eines davon als für den Ausbau des Portals benötigt angezeigt.[BR][BR][BR][BR]Soll das jetzt heißen, daß die Ensembles - lt. Wiki als \"verloren gegangen\" ausgeschrieben- dennoch behalten werden müssen obwohl sie \"verloren gegangen\" sind ?? Was ist denn das für eine Irreführung ?[BR][BR]Nachdem das von Inno nirgendwo richtig erklärt wird sollten jetzt alle Spieler die bereits wegen fehlender bzw. total irreführender Erklärungen Ensembles verkauft haben diese pronto zurückerstattet bekommen."}, {"2": "Indianaking schrieb:\t\t\tZum Ausbau auf Stufe 3 benötige ich nun je 2 von den Ensembles, also habe ich je 2 Stück neu gebaut, es wird aber jeweils nur eines davon als für den Ausbau des Portals benötigt angezeigt.\t\tZum Vergrößern anklicken.......laut Beta-Diskussion sollen sogar Minus-Werte im Portal auftauchen, wenn du die Ensembles verkauft hattest...[BR][BR][BR]...es soll so ähnlich laufen wie mit der Prestige beim Amuni-Tempel - wenn du schon einmal ausgebaut hast, dann hast du die Sachen \"in Benutzung\" - sie sind somit dem Inventar \"verloren gegangen\", da sie eben benutzt und nicht mehr nur gelagert werden - für den Ausbau auf Stufe 4 brauchst du jeweils 6 Ensembles, die auf magische Weise dein Portal mit Melodien, Musikalischer Begleitung und Rhythmus stärken (es ist ja eine Bühne, die Luanias magischen Gesang stärken soll) - für mich ist das unnötig kompliziert, auch wenn es storymäßig Sinn ergibt...es sollte nichts beim Ausbau abgezogen, aber dafür die Werte dann addiert werden - also bei Ausbau auf Stufe 2 jeweils 1 Ensemble/Melodie,Begleitung,Rhythmus - Stufe 3 dann 3 statt 2 und Stufe 4 schließlich 6 statt 3 - und wenn ein Ensemble verkauft/eingelagert wird, dann sinkt halt entsprechend der Wert im Portal-Inventar (war doch bei der Prestige ebenso, wenn ich mich recht erinnere)...."}, {"21": "Das ist echt wieder mal eine total schwachsinnige Beschreibung. Wenn die Ensembles \"verloren gegangen\" sind werden sie trotzdem wieder gebraucht - eine Logik die niemand nachvollziehen kann, denn dann sind sie nicht verloren weil ohne sie das Portal nicht weiter gelevelt werden kann."}, {"2": "Indianaking schrieb:\t\t\tWenn die Ensembles \"verloren gegangen\" sind werden sie trotzdem wieder gebraucht\t\tZum Vergrößern anklicken.......es wurde im Beta-Forum schon der Vorschlag gemacht, die Bezeichnung \"get used\" anstelle von \"get lost\" zu benutzen - hier liegt anscheinend ein Missverständnis im Sprachgebrauch vor (das anschließend übersetzt wurde)...[BR][BR]...storytechnisch liegt der Ausbau des Portals auf Stufe 4 bei Quest Nr. 76 von 88 - also ziemlich am Schluß - im Grunde benötigt Luania also ein sehr großes Orchester, um den Fluch von ihrem Bruder zu nehmen (und somit ist es wohl - rein von der Story her - nicht wirklich notwendig, die Ensembles zu verkaufen (um mehr Platz für weitere Intrumentenbauer etc. zu bekommen) - die Story hatte auch in anderen Kapiteln nicht immer sehr viel mit \"effizientem Stadtaufbau\" zu tun...[BR][BR]...aus dem Feedback zu den Amuni...[BR]Romilly schrieb:\t\t\tDie Quests sind aber auch nicht dazu gedacht, möglichst wirtschaftlich durch das Kapitel zu kommen - sie beschreiben eine Geschichte, die halt auch mal gewisse Schikanen bereit hält - das hat überhaupt nix mit Effizienz zu tun. Wer Elvenar wegen dem Drumherum spielt, der verschwendet öfters mal eine gehörige Gütermenge - einfach so, der Story wegen. Wer dies nicht möchte, konzentriert sich eben auf ganz andere Dinge (schneller Ausbau, optimale Platznutzung) um seine Stadt möglichst effizient aufzubauen, doch das ist mir z.B. für eine Spieldauer von mehreren Monaten/Jahren viel zu öde - darum zieh ich ja auch die Quests durch - auch wenn ich dabei drauf zahle - aber Bastet will halt nun mal 15.000.000 Gold und nen tollen Tempel - also kriegt sie den halt.\t\tZum Vergrößern anklicken...."}, {"189": "Indianaking schrieb:\t\t\tDas ist echt wieder mal eine total schwachsinnige Beschreibung.\t\tZum Vergrößern anklicken....[BR]Das Traurige ist, dass das bereits auf Beta aufgefallen ist, das dann auch im Betaforum seitens der Moderation korrekt erklärt wurde, aber offenbar nicht auf das Drängen der Spieler auf eine Korrektur des Wiki zwecks Vermeidung solcher Probleme wie du sie hattest für alle nicht Betaforumsleser reagiert wurde!"}]