[{"9": "Indianaking schrieb:\t\t\tDas ist echt wieder mal eine total schwachsinnige Beschreibung. Wenn die Ensembles \"verloren gegangen\" sind werden sie trotzdem wieder gebraucht - eine Logik die niemand nachvollziehen kann, denn dann sind sie nicht verloren weil ohne sie das Portal nicht weiter gelevelt werden kann.\t\tZum Vergrößern anklicken....[IMG]https://i.ibb.co/r3Q3JK0/https-de-forum-elvenar-com-index-php-attachments-1662644037232-png-31156.png[/IMG][BR][BR]Mehr als irreführend oder? Da stimmt der Text im Wiki überhaupt nicht."}, {"9": "Primus71 schrieb:\t\t\tbei der Hauptquest bin ich steckengeblieben bei \"Baue 12 Trommelensembles \" - echt ey ? warum in aller Welt sollte man 12 von den Dingern\t\tZum Vergrößern anklicken....Bei den Kosten ist das doch fast geschenkt. Das macht definitiv kein Sinn und da fragt man sich dann zurecht. Tz tz tz tz 12 bauen, wenn nur 6 benötigt werden und die sind ja schon nicht billig.[BR][BR][IMG]https://i.ibb.co/s63WLmG/https-de-forum-elvenar-com-index-php-attachments-1662645173713-png-31157.png[/IMG][BR][BR]12 x 380.000 T7 = 4.560.000 T7 ..... gibt es ja umsonst. Von den anderen reden wir erst gar nicht.  [smilie--sprite4][BR][BR]Da sind 18 Ensemble eh schon viel, die man da bauen muss + den ganzen anderen Kram und dann soll man noch 6 mehr bauen um die Storyline zu spielen ...... pfffffffff - das ist mehr als ............! [smilie--sprite7] Darüber kann man sich aufregen, denn ich glaube nicht, dass mal eben einer 4,5 Millionen erleuchtete Güter über hat!"}, {"23": "ErestorX schrieb:\t\t\tDas Traurige ist, dass das bereits auf Beta aufgefallen ist, das dann auch im Betaforum seitens der Moderation korrekt erklärt wurde, aber offenbar nicht auf das Drängen der Spieler auf eine Korrektur des Wiki zwecks Vermeidung solcher Probleme wie du sie hattest für alle nicht Betaforumsleser reagiert wurde!\t\tZum Vergrößern anklicken....wo steht das denn bitte?[BR]ich find nix....[BR]oder meinst du das englische beta-forum?"}, {"2": "Fenja von osten schrieb:\t\t\toder meinst du das englische beta-forum?\t\tZum Vergrößern anklicken.......ja - im Feedback im beta-Forum - nicht hier im Beta-Thread (da wird kein Feedback weiter geleitet)...."}, {"23": "und da komm ich also nicht ran, weil ich auf beta nicht angemeldet bin?[BR]oder hast du vlt. mal einen link bitte  [smilie--sprite6]"}, {"9": "Fenja von osten schrieb:\t\t\two steht das denn bitte?[BR]ich find nix....[BR]oder meinst du das englische beta-forum?\t\tZum Vergrößern anklicken....Ja er meint im Beta-Forum aber auch in anderen Foren steht es schon.[BR]Das komische ist, dass ich gerade sehe, dass es ein Mod. im Beta gar richtig beschrieben hat.[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/chapter-20-the-power-of-music.17890/post-109271\t\t(Lesen kann man da alles)[BR][BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/chapter-20-the-power-of-music.17890/post-109310\t\t[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/chapter-20-the-power-of-music.17890/post-109327\t\t(Wiki Änderungs-Bitte)[BR][BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/chapter-20-the-power-of-music.17890/post-109361\t\t"}, {"23": "vielen lieben Dank :*"}, {"8": "Darf ich nochmal nachhaken?[BR][BR]Man braucht also die ensembles nur in der Stadt haben und kann dann das Portal ausbauen?[BR](für Portal Stufe 4 also jeweils 6)[BR][BR]Aber erstmal dachten Manche, dass mit jedem Ausbau ein  ensemble verbraucht würde?[BR]Ist es dann nicht gut, dass es nicht so ist?"}, {"2": "gergerw schrieb:\t\t\tAlso, dass das ensemble auch ins inventar gebeamt werden kann bis man wirklich alles für den Ausbau beisammen hat...\t\tZum Vergrößern anklicken.......aber dann musst du alle wieder aufstellen, wenn du das Portal auf 4 ausbauen willst...(und für entsprechende Quests müssen die natürlich auch in der Stadt stehen - nicht im Inventar)..."}, {"9": "gergerw schrieb:\t\t\tMan braucht also die ensembles nur in der Stadt haben und kann dann das Portal ausbauen?[BR](für Portal Stufe 4 also jeweils 6)[BR][BR]Aber erstmal dachten Manche, dass mit jedem Ausbau ein ensemble verbraucht würde?[BR]Ist es dann nicht gut, dass es nicht so ist?\t\tZum Vergrößern anklicken....Du musst schon richtig lesen. Im Endeffekt müssen 18 Ensemble in der Stadt stehen (von jedem 6).[BR]Im Lager bringen die dir nichts und stellst du sie dann wieder raus, zählt es, als wenn du es weggerissen hast, nämlich gar nicht mehr. ^^[BR][BR]Die sind auch mit jedem Ausbau verbraucht und werden nicht mehr gezählt aber du benötigst sie dennoch (siehe Bild weiter zuvor). [BR]Es verhält sich wie beim Prestige bei den Amuni. ;-) Sie müssen folglich dennoch da bleiben."}, {"6": "Mit dem Wirbel der Aufbewahrung auf Stufe 21 wird das Portal in Stufe 3 auf eine Kapazität von 8190 kommen.[BR]Wenn ich das richtig sehe (die letzten beiden Forschungen verlangen je 7500) müsste ich mir damit einen Ausbau auf Stufe 4 sparen können.[BR]Oder habe ich da irgendwas übersehen?"}, {"8": "AngelOfDead schrieb:\t\t\tund stellst du sie dann wieder raus, zählt es, als wenn du es weggerissen hast, nämlich gar nicht mehr. ^^\t\tZum Vergrößern anklicken....Krass! *_*[BR][BR]Also man sollte erst anfangen ensembles zu bauen wenn man sichs wirklich leisten kann, alle Instrumentenbauer zu entfernen... um Platz für sie zu haben???[BR][BR]ustoni schrieb:\t\t\tMit dem Wirbel der Aufbewahrung auf Stufe 21 wird das Portal in Stufe 3 auf eine Kapazität von 8190 kommen.[BR]Wenn ich das richtig sehe (die letzten beiden Forschungen verlangen je 7500) müsste ich mir damit einen Ausbau auf Stufe 4 sparen können.[BR]Oder habe ich da irgendwas übersehen?\t\tZum Vergrößern anklicken....Oho!!! [smilie--sprite1][BR][BR]Also daher weht der Wind? Hab mich schon die ganze Zeit gefragt, wozu der Wirbel überhaupt gut ist!?!?!"}, {"9": "ustoni schrieb:\t\t\tMit dem Wirbel der Aufbewahrung auf Stufe 21 wird das Portal in Stufe 3 auf eine Kapazität von 8190 kommen.[BR]Wenn ich das richtig sehe (die letzten beiden Forschungen verlangen je 7500) müsste ich mir damit einen Ausbau auf Stufe 4 sparen können.[BR]Oder habe ich da irgendwas übersehen?\t\tZum Vergrößern anklicken....Ja laut Karvest ist das korrekt.[BR]Er empfiehlt außerdem, soviel wie Möglich zuvor von den -bauern zu sammeln um diese dann einzulagern oder wegzureißen um Platz zu schaffen für alle Ensemble zum Ausbau Stufe 4 des Hain.[BR][BR].... und 18 Ensemble sind eine Hausmarke, warum man dann laut Storyline zusätzlich nochmals 6 Trommelensembles bauen soll, bei den Kosten und Platzanspruch, erschließt sich mir beim besten Willen nicht![BR][BR]Genauso wenig ist es Sinnbefreit Güter herzustellen die weder mein BG sind noch gebraucht und geboostet werden können. Auch davon gibt es mehrere Quests?"}, {"6": "AngelOfDead schrieb:\t\t\tEr empfiehlt außerdem, soviel wie Möglich zuvor von den -bauern zu sammeln um diese dann einzulagern oder wegzureißen um Platz zu schaffen für alle Ensemble zum Ausbau Stufe 4 des Hain.\t\tZum Vergrößern anklicken....Stufe 4 des Hains hat sich ja für mich damit erledigt.[BR]Von den -bauern hab ich bisher nur je 2 stehen. Die erforderlichen Güter hol ich bisher mit Zeitsegen, werde aber später noch nachrüsten müssen.[BR]Wichtig ist übrigens auch, dass der Hain (Stufe 2) möglichst ständig Lieder produziert. Durch den nicht unerheblichen Bedarf an Liedern wird der Bedarf an Geigen, Flöten und Trommeln ganz erheblich größer als es auf den ersten Blick aussieht.[BR][BR]Die Quests der Storyline beende ich schon seit einigen Gastrassen nicht mehr. Dazu sind einfach zu viele völlig unsinnige Aufgaben dabei. [BR]Einfach machen was geht, die Belohnungen mitnehmen und den Rest zu Beginn des nächsten Kapitels ablehnen oder einsammeln."}, {"9": "ustoni schrieb:\t\t\tStufe 4 des Hains hat sich ja für mich damit erledigt.[BR]Von den -bauern hab ich bisher nur je 2 stehen. Die erforderlichen Güter hol ich bisher mit Zeitsegen, werde aber später noch nachrüsten müssen.[BR]Wichtig ist übrigens auch, dass der Hain (Stufe 2) möglichst ständig Lieder produziert. Durch den nicht unerheblichen Bedarf an Liedern wird der Bedarf an Geigen, Flöten und Trommeln ganz erheblich größer als es auf den ersten Blick aussieht.\t\tZum Vergrößern anklicken....Jupp stimmt. Was auch erschwerend dazu kommt und sich bemerkbar macht ist, da alle exakt dasselbe oder dieseleben Güter brauchen musst du bei dem T9 Handel 6 Std. warten, es sei denn man hat zu viele Zeitis oder eben Dias, aber Pustekuchen, den gefallen tue ich ihnen bei dem unüberlegten Werdegang der Storyline nicht mehr. Dann wart ich eben und gut."}, {"6": "Die eigentliche Bremse beim Kapitel ist wieder die Saat und - in Grenzen - Unurium.[BR]Alles andere lässt sich umgehen oder beschleunigen, auf die Saat muss man dann eben warten."}, {"119": "Ich habe den Wirbel auf 35 und hätte mir theoretisch den Ausbau des Hains auf 4 ersparen können,[BR][BR]ABER....  [smilie--sprite1])[BR][BR]Durch den Ausbau steigt die Produktionsgeschwindigkeit der Instrumentenbauer und es kommt noch so ein Liederteil dazu,[BR]welches nur 3h Laufzeit braucht und die Instrumente genau in dem Verhältnis braucht, wie sie regulär produziert werden"}, {"2": "...bis ich die Saat für alle die Ensembles zusammen habe, hab ich vermutlich auch das übrige Zeug produziert - was solls [smilie--sprite1]...theoretisch könnte ich jetzt übrigens Kinetik-Kugeln in Fely herstellen und handeln - praktisch sammel ich aber erst noch Unurium für den HG-Ausbau....[BR][BR]...der kleine Waschbär kann dann übrigens gefüttert über 24.000 Saat produzieren - also soooooooooo schlecht find ich den jetzt nicht [smilie--sprite2]"}, {"141": "Romilly schrieb:\t\t\t...der kleine Waschbär kann dann übrigens gefüttert über 24.000 Saat produzieren\t\tZum Vergrößern anklicken....echt wahr jetzt? 24.000 Saat?![BR]Dann werde ich das Event jetzt mit voller Begeisterung spielen [smilie--sprite8]"}, {"2": "Fritzilein schrieb:\t\t\techt wahr jetzt? 24.000 Saat?![BR]Dann werde ich das Event jetzt mit voller Begeisterung spielen [smilie--sprite8]Zum Vergrößern anklicken.......ja - der produziert einfach 8.008 Saat in Kapitel 20 und mit Fütterung wird der Betrag ja dann verdreifacht (den Effekt kann man 3x pro Futter abgreifen, wenn man kurz vor der ersten Abholung füttert) - ich werd mir einen 2. Waschbär holen - Saat gibt es bereits ab Stufe 4 (4.620 x 3 = 13.860 falsch - sind nur mal 1,3 auf der Stufe - der Triumph schafft nur 12.000)..."}]