[{"141": "Romilly schrieb:\t\t\t...ja - der produziert einfach 8.008 Saat in Kapitel 20 und mit Fütterung wird der Betrag ja dann verdreifacht (den Effekt kann man 3x pro Futter abgreifen, wenn man kurz vor der ersten Abholung füttert) - ich werd mir einen 2. Waschbär holen - Saat gibt es bereits ab Stufe 4 (4.620 x 3 = 13.860 - der Triumph schafft nur 12.000)...\t\tZum Vergrößern anklicken....[BR]Schade dass ich das nur 1 x liken kann *gg*[BR]Das wäre dann zwar das erste Mal dass ich Geld für ein Event ausgebe, aber 2 von den Dingern ist in diesem Kapitel mal ne saugute Idee [smilie--sprite6]"}, {"2": "Fritzilein schrieb:\t\t\taber 2 von den Dingern ist in diesem Kapitel mal ne saugute Idee\t\tZum Vergrößern anklicken.......Saat wird auch weiterhin in großen Mengen verlangt werden - ich erwarte dann auch eine hohe Ertrags-Steigerung für das nächste Kapitel - zum Vergleich - der Triumph stieg von 10.000 in Kapitel 19 auf 12.000 in Kapitel 20...die kleinen Bärchen nehmen nicht soviel Platz weg und man kann sie ja auch zwischendurch teleportieren oder auf den 4 WPs laufen lassen..."}, {"57": "18 ist aber schon viel und riesig im Platzbedarf, da fand ich verkaufen für Abzeichen besser, wer hat sich so nen Blödsinn bitte ausgedacht"}, {"21": "ustoni schrieb:\t\t\tMit dem Wirbel der Aufbewahrung auf Stufe 21 wird das Portal in Stufe 3 auf eine Kapazität von 8190 kommen.[BR]Wenn ich das richtig sehe (die letzten beiden Forschungen verlangen je 7500) müsste ich mir damit einen Ausbau auf Stufe 4 sparen können.[BR]Oder habe ich da irgendwas übersehen?\t\tZum Vergrößern anklicken....Stufe 14 reicht  [smilie--sprite6]"}, {"69": "ustoni schrieb:\t\t\tMit dem Wirbel der Aufbewahrung auf Stufe 21 wird das Portal in Stufe 3 auf eine Kapazität von 8190 kommen.[BR]Wenn ich das richtig sehe (die letzten beiden Forschungen verlangen je 7500) müsste ich mir damit einen Ausbau auf Stufe 4 sparen können.[BR]Oder habe ich da irgendwas übersehen?\t\tZum Vergrößern anklicken....Nein, du siehst das richtig. Stufe 4, und damit 16 Ensembles, muß nicht sein, wenn derWirbelpasst"}, {"9": "Da fragt man sich echt .. .. .. .. .. ? Wer denkt sich denn so etwas aus?[BR][BR]Sämtliche (alle 3) Ensemble können mit dem Zauber Mitgift verzaubert werden, obwohl sie gar keine Kultur geben?[BR][BR]Dem noch nicht genug, nun verzaubert man diese mit dem Mitgift, doch sie können weder von GM-Mitgliedern noch von Nachbarn gebufft werden? [BR]Mmmm .. .. .. .. [BR][BR][IMG]https://i.ibb.co/v4tjwy9/https-de-forum-elvenar-com-index-php-attachments-1662875885977-png-31183.png[/IMG][BR][BR]Den \"Quatsch\" muss man jetzt echt nicht mehr verstehen oder? [BR][BR]Ach ja und die +5% im Kultur-Stufen-Bonus werden natürlich nicht gewertet oder hinzugefügt so wie im Mouseover angegeben!?! [BR]Macht eigentlich auch Sinn, denn das Gebäude gibt ja auch gar keine Kultur, doch wieso kann man es dann verzaubern?[BR][BR]Ich denke, dass ist ein Fehler, allerdings denke ich das nur. ^^[BR]Sollte es ein Fehler sein, so kannst du dir im Beta-Forum, sofern du da angemeldet bist und auf dem Beta-Server spielst, die Diamanten holen, denn eine offizielle Fehlermeldung gab es da noch nicht und wie jeder weiß, gibt es auf dem Beta-Server Diamanten, wenn man Fehler entdeckt. Ich bin jedoch nicht scharf drauf. (Gilt nur auf dem Beta-Server und dessen Forum)[BR][BR]Feedback:[BR]Obwohl in dem tollen Hinweis-Texten im Lade-Bildschirm daraufhin gewiesen wird, dass man nur sein Bonus-Gut und die entsprechenden Manufakturen bauen soll sowie nur seine Bonus-Güter produzieren sollte, soll ich laut der Storyline zum wiederholten Mal NICHT BONUS-GÜTER produzieren?![BR]Dem noch nicht genug, auch im Bau-Menü wird dem Spieler sichtlich gezeigt, was seine Bonus-Güter sind und auch bei anwählen von nicht Bonus-Manufakturen gesagt, dass dieses nicht sein Bonus-Gut ist etc. [BR][BR]Die Frage die sich mir jedoch stellt ist folgende:[BR]Wieso soll ich dann laut der Storyline, stets meine NICHT BONUS-GÜTER produzieren? [BR]Weder werden die durch den Reliktbonus etc. gefordert/geboostet, noch ist es eben mein Bonus-Gut und mir wird im Spiel obendrein mehrmals zuvor gesagt, nur meine Bonus-Güter zu produzieren und deren Manufakturen zu bauen?[BR][BR][IMG]https://i.ibb.co/SV9ChL9/https-de-forum-elvenar-com-index-php-attachments-1662877000613-png-31184.png[/IMG][BR][BR][IMG]https://i.ibb.co/CBCvXzS/https-de-forum-elvenar-com-index-php-attachments-1662877347351-png-31185.png[/IMG][BR][BR]Gefördert werden bei mir eigentlich Alraunen[BR][BR][IMG]https://i.ibb.co/tLVG9wJ/https-de-forum-elvenar-com-index-php-attachments-1662878259836-png-31186.png[/IMG][BR][BR]Gefördert wird bei mir eigentlich Flugpulver[BR][BR][IMG]https://i.ibb.co/VQdTdcs/https-de-forum-elvenar-com-index-php-attachments-1662878403306-png-31187.png[/IMG][BR][BR]Ist das ein Fehler oder soll das echt so sein? Denn es macht keinen Sinn, nicht geförderte Güter zu produzieren! [BR]Sollte das so gewollt sein, so sind Hinweis-Texte \"eigentlich\" falsch (auch im Wiki) und ich gebe es Nachzüglern schon Mal bekannt. [BR]Auch ist es von meiner Seite her, negatives Feedback. "}, {"1": "Wir haben das schon als Fehler weitergeleitet vor ein paar Tagen. [smilie--sprite2]"}, {"9": "Tacheless schrieb:\t\t\tWir haben das schon als Fehler weitergeleitet vor ein paar Tagen. [smilie--sprite2]Zum Vergrößern anklicken....Ok, im Beta fand ich nichts und hier hab ich noch nicht nachgesehen, wenn ich ehrlich bin. (Sry)"}, {"1": "Hier im Forum gibt es dazu auch keine wirkliche Fehlermeldung. Das Thema kam bei uns im Ehrengarden-Chat auf und darauf hin haben wir das weitergeleitet."}, {"9": "Tacheless schrieb:\t\t\tHier im Forum gibt es dazu auch keine wirkliche Fehlermeldung. Das Thema kam bei uns im Ehrengarden-Chat auf und darauf hin haben wir das weitergeleitet.\t\tZum Vergrößern anklicken....Alles gut und schön (eigentlich eher nicht so schön) wenn ihr auch Fehler erkennt/findet und dann weiterleitet.[BR]Ich dachte mir auch anfangs nichts dabei, da ja 5% beim Kultur-Stufen-Bonus hinzugefügt werden laut dem Mouseover. Erst als ich sah, sie werden nicht dazu addiert, erkannte ich auch, dass die Gebäude ja auch gar keine Kultur geben.[BR]Da ich mit dem Kultur-Bonus spiele und diesen auch benötigte und einkalkuliere, verzauberte ich sämtliche Ensemble, doch leider für nichts (na doch Mana gab es). Schade, nun ist das Mitgift verschossen. Ist aber nicht tragisch.[BR][BR]Was mich mehr interessieren würde ist, macht es Sinn wegen der Bonus-Gut-Geschichten im Bezug auf die Storyline einen Fehler bekanntzugeben/anzugeben oder wird da auch schon nachgehakt/nachgefragt?"}, {"1": "AngelOfDead schrieb:\t\t\tWas mich mehr interessieren würde ist, macht es Sinn wegen der Bonus-Gut-Geschichten im Bezug auf die Storyline einen Fehler bekanntzugeben/anzugeben oder wird da auch schon nachgehakt/nachgefragt?\t\tZum Vergrößern anklicken....Was genau meinst du?"}, {"2": "AngelOfDead schrieb:\t\t\tWieso soll ich dann laut der Storyline, stets meine NICHT BONUS-GÜTER produzieren?\t\tZum Vergrößern anklicken.......hast du den Text der Story denn auch gelesen?...[BR][BR][IMG]https://i.ibb.co/wMpbjcy/https-de-forum-elvenar-com-index-php-attachments-quest-png-31188.png[/IMG][IMG]https://i.ibb.co/DW49LNQ/https-de-forum-elvenar-com-index-php-attachments-quest2-png-31189.png[/IMG][BR][BR]...wie ich schon erwähnt hatte, kam es schon oft vor, daß die Storyquests nicht unbedingt recht viel mit effizientem Stadtaufbau oder Spiel zu tun haben..."}, {"9": "Tacheless schrieb:\t\t\tWas genau meinst du?\t\tZum Vergrößern anklicken....Oben im unteren Teil meines Beitrags #146[BR]Ich soll mein NICHT-BONUS-GUT produzieren obwohl mir laut Hilfe-Texten, Wiki und Mouseover im Spiel davon stets abgeraten wird."}, {"1": "Das ist kein Fehler. Es hat eben einfach was mit der Storyquest zu tun. Zu anderen Produktionen würde ja der Text gar nicht passen. Und ich denke (meine persönliche Meinung), es ist verkraftbar, wenn man für eine Quest einmalig ein Nicht-Bonus-Gut produzieren muss."}, {"189": "Tacheless schrieb:\t\t\tUnd ich denke (meine persönliche Meinung), es ist verkraftbar, wenn man für eine Quest einmalig ein Nicht-Bonus-Gut produzieren muss.\t\tZum Vergrößern anklicken....[BR]Wie schon weiter vorn erwähnt, kann man das Gut ja aber erst mit einer Manu lvl 33 produzieren. Und die auf das Level zu bringen kostet Saat, die man während der Gastrasse besser für andere Dinge nutzen sollte. Hältst du den Aufwand zur Erfüllung der Quest trotzdem für angemessen, oder war dir das nur entgangen?"}, {"69": "Ich finde keinen Link zur Quest-reihe. Kann mir jemand helfen?"}, {"2": "achilles7453 schrieb:\t\t\tIch finde keinen Link zur Quest-reihe. Kann mir jemand helfen?\t\tZum Vergrößern anklicken....\t\t\thttps://idavis-elvenar.com/guestRaces/powerofmusic.html#quests\t\t"}, {"14": "achilles7453 schrieb:\t\t\tIch finde keinen Link zur Quest-reihe. Kann mir jemand helfen?\t\tZum Vergrößern anklicken....hier z.B. (ist aber wohl noch nicht übersetzt, auch wenn man die Weltkugel oben rechts auf \"deutsch\" stellt[BR](kann man sich aber im Browser übersetzen lassen)[BR][BR]https://idavis-elvenar.com/guestRaces/powerofmusic.html#quests"}, {"9": "Tacheless schrieb:\t\t\tDas ist kein Fehler. Es hat eben einfach was mit der Storyquest zu tun. Zu anderen Produktionen würde ja der Text gar nicht passen. Und ich denke (meine persönliche Meinung), es ist verkraftbar, wenn man für eine Quest einmalig ein Nicht-Bonus-Gut produzieren muss.\t\tZum Vergrößern anklicken....Ok, war ja auch nur eine Frage. Ja zu verkraften schon, doch zum einem wird es in dieser Storyline mehrmals verlangt und zum anderem, wären dann doch, wie oben beschrieben, sämtliche Hilfe-Texte falsch. Der Punkt von @ErestorX ist auch berechtigt. Also da sprechen mehrere Sachen dagegen. Ich kann zwar auch damit Leben, jedoch erachte ich dann jegliche Hilfe-Texte im und ums Spiel als Falsch an."}, {"69": "Neris schrieb:\t\t\thier z.B. (ist aber wohl noch nicht übersetzt, auch wenn man die Weltkugel oben rechts auf \"deutsch\" stellt[BR](kann man sich aber im Browser übersetzen lassen)[BR][BR]https://idavis-elvenar.com/guestRaces/powerofmusic.html#questsZum Vergrößern anklicken....Danke Neris"}]