[{"1": "ErestorX schrieb:\t\t\tWie schon weiter vorn erwähnt, kann man das Gut ja aber erst mit einer Manu lvl 33 produzieren. Und die auf das Level zu bringen kostet Saat, die man während der Gastrasse besser für andere Dinge nutzen sollte. Hältst du den Aufwand zur Erfüllung der Quest trotzdem für angemessen, oder war dir das nur entgangen?\t\tZum Vergrößern anklicken....Aber hat man diese Manufaktur nicht eh, damit man erleuchtete Güter produzieren kann? Man hat doch im Grunde von allen Manufakturen alle 3 Sorten, eben aufgrund der Erweckten und Erleuchteten Güter. Und die Quest verlangt Produktionen von den Erleuchteten Gütern. Ich musste zumindest dafür nicht extra eine Manufaktur ausbauen."}, {"189": "Tacheless schrieb:\t\t\tAber hat man diese Manufaktur nicht eh, damit man erleuchtete Güter produzieren kann?\t\tZum Vergrößern anklicken....Wäre das so, wäre das kein Problem, sondern sogar eine durchaus sinnvolle Questaufgabe. Aber bei mir z.B. wird eine Produktion in einer Seidenmanu gefordert, Erleuchtete produziere ich aber in Kristallmanus. Erweckte kann ich in Seidenmanus produzieren, aber erstens mache ich das schon lang nicht mehr, die gibt es ja dank Pyramide der Reinigung in ausreichenden Mengen als Zugabe und zweitens kann man Erweckte schon vor Level 33 produzieren.[BR][BR]Das Problem ist also, dass ein erleuchtetes Gut in einer Manu für Erweckte produziert werden soll, die entweder gar nicht oder nicht auf Level 33 benötigt wird."}, {"1": "@ErestorX Also, ich versuche es mal zu erklären:[BR]Man hat von den Manufakturen für Standardgüter jeweils Manufakturen seines Bonusguts. Nehmen wir einfach mal Marmor, Kristall und Elixier.[BR]Dann hat man für die Erweckten Güter jeweils Manufakturen für Platin (Stahlmanu), Zaubertinte (Schriftrollenmanu) und Faulpilze (Magiestaubmanu).[BR]Für Erleuchtete Güter hat man jewels Manufakturen für Allwisende Alraunen (Holzmanu), Feinstes Flugpulver (Seidenmanu) und ab Kapitel 20 Kinetik-Kugeln (Edelstein-Manu).[BR][BR]Die verlangten Güter in den beiden erwähnten Quests erhält man aus der Marmormanufaktur (ist eh Bonusgut für Gut 1) und der Schriftrollenmanufaktur (Bonusgut für Erweckte Güter). Beide Manufakturen hat man ja bereits auf die höchste Stufe in vergangenen Kapitel gebaut. Man muss also nicht extra eine Manufaktur weiter ausbauen. [BR][BR]Oder liege ich falsch? Dann bitte einmal erklären."}, {"9": "Ich wurde zwar nicht gefragt, aber ja, man hat diese Manufakturen @Tacheless, doch in diesen Manufakturen, werden genau die Produktionen von Gütern verlangt, die eben NICHT mein BONUS GUT sind und das ist bei allen Spielern so. Was bitte macht das für Sinn und wieso wird es dann im Wiki und den Hilfe-Texten falsch erklärt, dass man nämlich nur sein BONUS-GUT produzieren sollte? Auch in den ersten Storylines (Kapitel 1-5) wird/wurde darauf eingegangen, dass man NUR sein BONUS-GUT produzieren soll. Es ist nicht so, dass es ein, zweimal stört, aber es ist definitiv \"Sinnbefreit\" und Hinweis-Texte etc. falsch."}, {"189": "Tacheless schrieb:\t\t\tOder liege ich falsch? Dann bitte einmal erklären.\t\tZum Vergrößern anklicken....[BR]Bei mir lautet die erste problematische Quest: \"Produziere einen stilvollen Mantel\", also das erleuchtete Gut Flugpulver in einer Seidenmanufaktur. Mein Bonusgut sind aber Schriftrollen und mein erleuchtetes Gut daher Aerosole, die in einer Kristallmanufaktur produziert werden. Schriftrollen- und Kristallmanufakturen habe ich daher selbstverständlich auf Level 33, eine Seidenmaufaktur benötige ich jedoch (abgesehen von dieser Questaufgabe) schon seit mehreren Kapiteln nicht mehr."}, {"94": "Ich wurde zwar auch nicht gefragt, jedoch habe ich es so verstanden, dass die Anforderung der Questaufgabe in keinem Verhältnis steht.[BR]Wenn man aber nur eine bereits vorhandene Manufaktur aus dem Inventar ziehen muss, um etwas zu produzieren was kein Bonusgut ist dann sollte sich der Aufwand lediglich auf einen Teleporter und etwas Produktionszeit beschränken."}, {"9": "Vielleicht versteht man es ja si besser:[BR][BR][IMG]https://i.ibb.co/rx9ShQD/https-de-forum-elvenar-com-index-php-attachments-1662890711040-png-31193.png[/IMG][BR][BR][IMG]https://i.ibb.co/JF5wXLw/https-de-forum-elvenar-com-index-php-attachments-1662890231338-png-31191.png[/IMG] [IMG]https://i.ibb.co/tLVG9wJ/https-de-forum-elvenar-com-index-php-attachments-1662878259836-png-31186.png[/IMG][BR][BR]Nun kommt dann noch eine weitere Aufgabe in der ich dann ein drittes Mal, mein NICHT-BONUS-GUT produzieren soll, welches aber auch Unurium etc. kostet. Alles nicht schlimm oder ein Weltuntergang, jedoch eben \"Sinnbefreit\" und jegliche Hinweise zum und ums Spiel generell falsch![BR][BR]Edit:[BR]Warum macht man sich dann die Mühe und stellt es gar Farblich überall da, erklärt einem, dass man nur sein BG produzieren soll etc. wenn man dann wiederum sein Nicht-Bonus-Gut produzieren soll?"}, {"1": "Es geht doch darum, dass gesagt wurde, dass man extra dafür eine Manu hochziehen muss. Und das ist nicht der Fall. Diese Manufaktur produziert in der Regel eines der Bonusgüter für Erweckte oder Erleuchtete Güter. [BR][BR]Das nicht das eigene Bonusgut verlangt wird, ist mir durchaus bewusst. Daraufhin habe ich auch schon geantwortet, dass eben das Gut gefordert wird, dass zum Text passt, unabhängig vom eigenen Bonusgut.[BR][BR]Und in der Regel gehen die Entwickler von der Masse der Spieler aus, die eben die Manufakturen stehen haben und nicht, weil vereinzelt andere Strategie gespielt wird, diverse Manufakturen einfach gelöscht oder ins Inventar geschoben werden.[BR][BR]Und dementsprechend denken wir, dass es kein Beinbruch ist, wenn man 1x für eine Quest eben 3 Stunden dafür aufwendet, ein Nicht-Bonusgut zu produzieren. Quests sind eben auch Herausforderungen und nicht immer Goodies, die einem auf dem Silbertablett serviert werden. Manchmal muss man halt auch was dafür tun."}, {"189": "Tacheless schrieb:\t\t\tEs geht doch darum, dass gesagt wurde, dass man extra dafür eine Manu hochziehen muss. Und das ist nicht der Fall. Diese Manufaktur produziert in der Regel eines der Bonusgüter für Erweckte oder Erleuchtete Güter.\t\tZum Vergrößern anklicken....[BR]Ich hatte doch schon erklärt, warum ich z.B. keine Manu zur Produktion Erweckter stehen (oder auf lvl 33 im Inventar) habe![BR][BR]ErestorX schrieb:\t\t\tErweckte kann ich in Seidenmanus produzieren, aber erstens mache ich das schon lang nicht mehr, die gibt es ja dank Pyramide der Reinigung in ausreichenden Mengen als Zugabe und zweitens kann man Erweckte schon vor Level 33 produzieren.\t\tZum Vergrößern anklicken...."}, {"9": "Tacheless schrieb:\t\t\tEs geht doch darum, dass gesagt wurde, dass man extra dafür eine Manu hochziehen muss. Und das ist nicht der Fall. Diese Manufaktur produziert in der Regel eines der Bonusgüter für Erweckte oder Erleuchtete Güter.[BR][BR]Das nicht das eigene Bonusgut verlangt wird, ist mir durchaus bewusst. Daraufhin habe ich auch schon geantwortet, dass eben das Gut gefordert wird, dass zum Text passt, unabhängig vom eigenen Bonusgut.[BR][BR]Und in der Regel gehen die Entwickler von der Masse der Spieler aus, die eben die Manufakturen stehen haben und nicht, weil vereinzelt andere Strategie gespielt wird, diverse Manufakturen einfach gelöscht oder ins Inventar geschoben werden.[BR][BR]Und dementsprechend denken wir, dass es kein Beinbruch ist, wenn man 1x für eine Quest eben 3 Stunden dafür aufwendet, ein Nicht-Bonusgut zu produzieren. Quests sind eben auch Herausforderungen und nicht immer Goodies, die einem auf dem Silbertablett serviert werden. Manchmal muss man halt auch was dafür tun.\t\tZum Vergrößern anklicken....Ok .... sind aber mehr als nur eine Quest und in der vorangegangenen Storyline (Kapitel 19) war es auch schon so.[BR]Sind auch 9 Std. anstatt 3 Std. Produktionen und mehr als ein oder zweimal.[BR][BR]Dann sind diese Texte eben falsch! Das ist nur einer von vielen.[BR][BR][IMG]https://i.ibb.co/r4YCCy3/https-de-forum-elvenar-com-index-php-attachments-1662892279993-png-31194.png[/IMG][BR][BR]Dann müsste der Text heißen,[BR]Konzentriere dich auf deine BG aber im späteren Verlauf wirst du auch nicht BG herstellen müssen, wenn du die Storylines verfolgst etc. oder so ähnlich."}, {"1": "ErestorX schrieb:\t\t\tIch hatte doch schon erklärt, warum ich z.B. keine Manu zur Produktion Erweckter stehen (oder im Inventar) habe!\t\tZum Vergrößern anklicken....Und ich habe geschrieben, dass man von der Mehrheit, also vom regulären Spieler ausgeht, und nicht von Spielern, die eine \"Einzel-Strategie\" spielen, so wie du in dem Fall.[BR][BR]@AngelOfDead Für dich wiederhole ich es auch gerne ein drittes mal: Es ist eine Ausnahme, diese Quest. Und wir gehen davon aus, dass es kein Beinbruch ist, einmalig etwas zu produzieren, worauf man keinen Bonus hat. Das hat rein gar nichts mit den Texten zu tun. Es sind Ausnahmefälle! Das ist hier echt Erbsenzählerei!"}, {"9": "Tacheless schrieb:\t\t\t@AngelOfDead Für dich wiederhole ich es auch gerne ein drittes mal: Es ist eine Ausnahme, diese Quest. Und wir gehen davon aus, dass es kein Beinbruch ist, einmalig etwas zu produzieren, worauf man keinen Bonus hat. Das hat rein gar nichts mit den Texten zu tun. Es sind Ausnahmefälle! Das ist hier echt Erbsenzählerei!\t\tZum Vergrößern anklicken....Vielleicht darf ich dann darauf hinweisen, dass jeder wirklich jeder anders spielt und ich nun auch mehrmals wiederholte, dass es mehr als nur ein oder zwei Quests sind, die unter anderem auch Unurium etc. kosten und den ganzen Spielverlauf behindern, da ich in dieser Zeit mein BG nicht produzieren kann, kann ich folglich auch nicht mein BG gegen nicht BG beim Kaufmann eintauschen, denn selbst da, bekomme ich mehr als wenn ich Nicht-BG selbst produziere. Sieh es als Feedback und ich bin definitiv nicht der einzigste, dem diese Quests gehörig auf den Zeiger gehen!"}, {"1": "Natürlich leite ich es als Feedback weiter, dass dieses Thema von ein paar Leuten angesprochen wurde.[BR][BR]Aber ihr solltet auch bedenken, dass das Kapitel darauf ausgelegt, ist, dass man eben nicht nach ein paar Tagen fertig ist (außer natürlich man steckt Unsummen an Dias rein) sondern eben so gestaltet ist, dass man eben etwas länger braucht."}, {"94": "AngelOfDead schrieb:\t\t\tDann sind diese Texte eben falsch! Das ist nur einer von vielen.\t\tZum Vergrößern anklicken....Diese Tipp Texte beziehen sich auf eine durchgehende Produktion und sollen Anfängern helfen. [BR]In Kapitel 20 spielt das keine Rolle mehr. [BR][BR]@ErestorX scheint zwar eine Manufaktur zu haben, die aber nicht auf das entsprechende lvl gebracht ist, um diese Aufgabe aufwandlos zu lösen."}, {"2": "...also ich hab keine Probleme mit diesen Quests - hatte ich auch in Kapitel 18 und 19 nicht..."}, {"9": "Tacheless schrieb:\t\t\tAber ihr solltet auch bedenken, dass das Kapitel darauf ausgelegt, ist, dass man eben nicht nach ein paar Tagen fertig ist\t\tZum Vergrößern anklicken....Das möchte auch gar keiner, doch es soll schon Sinn machen, aber hier gibt es eben auch verschiedene Meinungen.[BR]Tacheless schrieb:\t\t\t(außer natürlich man steckt Unsummen an Dias rein)\t\tZum Vergrößern anklicken....Das sollte doch jedem selbst überlassen sein und selbst wenn dem so ist, dann ist das doch für den Betreiber gut.[BR]Unsummen, können für einen 20 Euro sein, für ein anderen 200 oder mehr Euro[BR]Tacheless schrieb:\t\t\tsondern eben so gestaltet ist, dass man eben etwas länger braucht.\t\tZum Vergrößern anklicken....Dann ist das eben so auch wenn es nicht nur in meinen Augen völlig \"Sinnbefreit\"  ist.[BR]Jammin schrieb:\t\t\tDiese Tipp Texte beziehen sich auf eine durchgehende Produktion und sollen Anfängern helfen.[BR]In Kapitel 20 spielt das keine Rolle mehr.\t\tZum Vergrößern anklicken....Dann vielleicht von beginn an dazu schreiben, \"später spielt das keine Rolle mehr\", denn es gab schon zig Spieler die das später dann nicht verstehen. ^^[BR][BR]Feedback war das und bleibt es und nur weil ein anderer das wiederum anders sieht, weil er eine andere Meinung hat, bleibt es dennoch Feedback."}, {"189": "Tacheless schrieb:\t\t\tAber ihr solltet auch bedenken, dass das Kapitel darauf ausgelegt, ist, dass man eben nicht nach ein paar Tagen fertig ist (außer natürlich man steckt Unsummen an Dias rein) sondern eben so gestaltet ist, dass man eben etwas länger braucht.\t\tZum Vergrößern anklicken....[BR]Das ist auch gut so. Und es ist ein Kapitel, das ich gerne spiele und gern zügig (aber ohne Dias und Zeitbooster) beenden würde, da es mich weiterbringt. Gerade deswegen habe ich das Spielen der Questline an der diskutierten Aufgabe einmal mehr eingestellt, da mich die Erfüllung dieser Quest ganz unnötig ausbremsen würde!"}, {"9": "ErestorX schrieb:\t\t\tDas ist auch gut so. Und es ist ein Kapitel, das ich gerne spiele und gern zügig (aber ohne Dias und Zeitbooster) beenden würde, da es mich weiterbringt. Gerade deswegen habe ich das Spielen der Questline an der diskutierten Aufgabe einmal mehr eingestellt, da mich die Erfüllung dieser Quest ganz unnötig ausbremsen würde!\t\tZum Vergrößern anklicken....Es wird immer mindestens 2 Spieler-Typen geben, der eine spielt eben so, ein anderer so und das ist auch alles gut und schön, doch es ist nicht so schön, wenn man das dann nicht einfach so stehen lässt und akzeptiert, sondern mir eingeredet wird, dass es kein Beinbruch ist etc. (wo ich gar zustimmte).[BR]Ich hab es vorgetragen, weil es gegen jeden Hilfe-Text im und ums Spiel spricht (Hierbei spielt es keine Rolle ob das am Anfang so ist und später nicht mehr oder ob es ein Weltuntergang ist).[BR]Hier geht es darum, das es ein Widerspruch gegen die Spielmechanik ist (Was mir einst so oft mehrmals gesagt wird, widerspricht sich später in einer Storyline?).[BR]@Tacheless leitet es nun weiter und wie das dann letztendlich die Entwickler sehen, dass steht ja wiederum auf einem anderen Blatt.[BR]Nur bin ich \"der Meinung\", dass es eben keinen Sinn macht solche Quests ins Spiel einzubauen.[BR]Demzufolge wissen sie nun, Dank des Feedbacks, dass es auch Spieler gibt, die diese Quests einfach als nervend und \"Sinnbefreit\" empfinden. [BR]Ob es wie gesagt, was bringt oder nicht, dass dürfen dann letztendlich die Entwickler entscheiden. @Tacheless sagte zwar, dass es so gewollt ist, doch wer weiß, vielleicht sehen es mehrere so wie du und ich, denn was an Feedback über den Support oder generell aus allen Foren kommt, weiß man ja nicht.[BR][BR][BR]Tacheless schrieb:\t\t\tNatürlich leite ich es als Feedback weiter\t\tZum Vergrößern anklicken....Danke und gut![BR][BR]Jammin schrieb:\t\t\tDiese Tipp Texte beziehen sich auf eine durchgehende Produktion und sollen Anfängern helfen.[BR]In Kapitel 20 spielt das keine Rolle mehr.\t\tZum Vergrößern anklicken....Hier würde ich gern noch etwas einwerfen.[BR]Nämlich es ist eine durchgehende Produktion meines Bonus-Gutes, die durch das verlangen eines nicht Bonus-Gutes herzustellen, unterbrochen wird! (Völlig egal ob Standard , erweckte oder erleuchtete Güter - jedes dieser Güterklassen beherbergt jeweils 3 mal dein BG)[BR]Des weiteren spielt es sehr wohl eine Rolle, ob sich im späteren Spielverlauf etwas ändert oder eben nicht, denn ich spiele diese Storylines in der Regel gern und verfolge/lese diese eigentlich seit es sie gibt. Ergo von beginn an und genau da gibt es Widersprüche.[BR][BR]Warum stehst dann du (Forschung) und fragst gar nach ob es Sinn macht weiter zu machen etc., wenn doch alles später so wie so keine Rolle mehr spielt?[BR]Dann akzeptiere du das doch auch einfach und gut, aus, fertig. Denn für mich und andere spielt es sehr wohl eine Rolle im Zusammenhang der Storylines und des ganzen Spiel geschehen. [smilie--sprite2][BR]Nicht heute so - Morgen so und nun bin ich raus [smilie--sprite7]"}, {"189": "Tacheless schrieb:\t\t\tUnd ich habe geschrieben, dass man von der Mehrheit, also vom regulären Spieler ausgeht, und nicht von Spielern, die eine \"Einzel-Strategie\" spielen, so wie du in dem Fall.\t\tZum Vergrößern anklicken....[BR]Meine \"Einzelstrategie\" besteht darin, dass ich viele Rüstkammern auf niedrigem Level lasse, auf dem sie dank der Pilze Vorteile in Bezug auf die Trainingsgröße aber Nachteile in Bezug auf die Produktion Erweckter haben. Da es viele sind, entspricht meine Produktion Erweckter momentan trotzdem etwa der von 18 Rüstis aus dem letzten Kapitel. Es gibt Spieler, die haben mehr als doppelt so viele (vor allem Ranglistenspieler, sind die in deinen Augen keine \"regulären Spieler\"?) aber natürlich auch Spieler mit weniger Rüstis.[BR][BR]Allerdings bekommen viele dieser Spieler mit weniger Rüstis zusätzlich Erweckte aus Drachenarche und/oder Glücksorakel , auf die ich verzichte, brauchen also ebenfalls keine Manu für die Produktion Erweckter. Und dann gibt es natürlich noch Spieler, denen ein oder zwei Manus für die Produktion Erweckter reichen und die daher nicht alle drei verschiedenen Manus zur Produktion Erweckter haben, sondern ein bis zwei Arten erhandeln. Ist das für dich alles irregulär???[BR][BR]Sorry, dein \"regulärer Spieler\", der in Kapitel 20 noch immer für alle drei Arten Erweckter mindestens je eine Manu stehen hat und nutzt, scheint mir in der Praxis nur selten anzutreffen zu sein!"}, {"46": "Wenn man hier mitliest, hat man immer wieder mal was zu schmunzeln... Die Aufregung um die vielen unnötigen Gebäude für die Questreihe ist ja noch verständlich, aber die ellenlange Diskussion um die Forderungen von Nicht Bonigütern ist schon spaßig. Ich fand es gut, das mal etwas gefordert wurde, wo man einen kurzen Moment überlegen musste, wie und wo man da überhaupt dran kommt.   [smilie--sprite8]  Für den Mantel hab ich schnell Zeitbooster genommen und die Karaffe... kein Weltuntergang, wenn ich mal kein Marmor herstelle...  Kapitel 20 lässt sich locker und schön spielen bis jetzt..[smilie--sprite8]"}]