[{"1": "Dear Humans and Elves,[BR][BR]On July 20th we will launch the latest chapter in our Elvenar story, Chapter 21 - The Vallorian Legend[BR][BR]Please see the full announcement here and let us know what you think about it![BR][BR]Kind regards,[BR]Your Elvenar Team"}, {"22": "[IMG]https://i.ibb.co/9ZH0Jh5/https-beta-forum-elvenar-com-index-php-attachments-1689674312088-png-11553.png[/IMG][BR]what about Vallorian Seal Tower bonus??????"}, {"1": "Ainor said:View attachment 11553[BR]what about Vallorian Seal Tower bonus??????\t\tClick to expand...[BR]You will be getting the full Unurium bonus but when you choose the residences to be earning community work instead the Unurium you will be getting is insignificant almost as not getting anything at all. This is due to the difference in coins or community work you might get from the residence is very large, as The Vallorian Seal Tower gives a percentage of Unurium for Coins Pickup from Residences[BR][BR]This is the way it works for now but it might be changed soon."}, {"9": "Cauldron Ingredients Cost Reduction Click to expand...[BR]What exactly does this reduces? This?:[IMG]https://i.ibb.co/SfYk8rk/https-beta-forum-elvenar-com-index-php-attachments-1689681697025-png-11554.png[/IMG][BR][BR] Academy Creation Time ReductionClick to expand...Does it reduce spell time creation or time for crafting recipe rotation?"}, {"16": "yes, this.[BR]for MA - it reduce spell/CC creation time (\"Reduces the time per Relic the Magic Academy needs to create Spells and Resources\")"}, {"23": "\"Prosperity Bonus which replaces the Settlement Production Boost\"[BR][BR]It does it means that all sources in Blooming Trader Guild or Cauldron is lost because Settlement resources production bonus is gone?"}, {"22": "Deadeye Jerry said:\t\t\tit might be changed soon\t\tClick to expand...I hope, otherwise the tower would become useless for unurium when we have to produce community work and there are no sources other than residences [smilie--sprite11]"}, {"5": "Ainor said:\t\t\tI hope, otherwise the tower would become useless for unurium when we have to produce community work and there are no sources other than residences [smilie--sprite11]Click to expand...[BR]Well, it will matter how much community work is needed to complete the chapter and how many residences a player has. It you have 10 and you can use 5 for CW and 5 for coins, it would probably be alright, but if you need all 10 making CW, then it is a problem. Or if a player only has 5 residences, then there is a problem. But I would guess that players with only a few residences would not be building the Seal Tower anyway. Also, by chapter 21, there are more than enough sources for Unurium, that maybe the Seal Tower is no longer important for players at that point. I will have to look at my Live chapter 20 city to see if it is worth keeping."}, {"9": "Unurium from Seal Tower is not that great anyway for unurium production, it's main purpose is to lower unurium's decay.  Temple of Spirits is much better for producing unurium."}, {"5": "Lovec Krys said:\t\t\tUnurium from Seal Tower is not that great anyway for unurium production, it's main purpose is to lower unurium's decay.  Temple of Spirits is much better for producing unurium.\t\tClick to expand...[BR]Yeah, I get the different Wonders all mixed up for what they do when just trying to remember by name and not actually looking at them in-game. I forgot that was the one that reduces decay."}, {"22": "Lovec Krys said:\t\t\tUnurium from Seal Tower is not that great anyway for unurium production\t\tClick to expand...yes it is, if you use at the best culture bonus and other coins production bonus[BR][BR]Enevhar Aldarion said:\t\t\tbut if you need all 10 making CW\t\tClick to expand...the point is this, we don't know it[BR][BR]Enevhar Aldarion said:\t\t\tthere are more than enough sources for Unurium\t\tClick to expand...just trader that need population and culture at work, vallorian tower, temple of spirits and only two buildings (boblin and steam golem).[BR]And we don't know also how much unurium we need.[BR][BR]But the real point is the novelty about an AW bonus that becomes useless due to a new game mechanic. For me it is not normal"}, {"5": "Ainor said:\t\t\tjust trader that need population and culture at work, vallorian tower, temple of spirits and only two buildings (boblin and steam golem).[BR]And we don't know also how much unurium we need.\t\tClick to expand...[BR]Chromafrost Glacier also gives unurium, but only if you keep it at chapter 18. And in the shop, there are two unurium buildings per chapter for 18, 19, and 20, one costing diamonds and one costing normal coins and supplies. So at the end of chapter 20, even without any AWs or event buildings, there are still sources for unurium other than the Trader. Oh, and Glory of the Nimble has a 25% chance to give unurium when you collect from it."}, {"24": "Will community works be impacted by culture bonus?"}, {"25": "Mykan said:\t\t\tWill community works be impacted by culture bonus?\t\tClick to expand...That's the question for 100 Millions Dollars [smilie--sprite8]"}, {"26": "Mykan said:\t\t\tWill community works be impacted by culture bonus?\t\tClick to expand...it should be yes:[BR][BR][IMG]https://i.ibb.co/Jjpd1Rs/https-beta-forum-elvenar-com-index-php-attachments-1689802626864-png-11557.png[/IMG]"}, {"16": "hm... new chapter arrived without cleaning up new tech tree migration, now game loads 3 different building databases and 2 tech trees. Chapter itself was ready long ago - so what we were waiting for?.."}, {"27": "Does anyone know what can be generated with portal profits in chapter 21 please?"}, {"28": "is there supposed to be a new province expansion available. i have had 639 finished, but required for next is still showing 0.[BR]if there isn't a new one coming with chapter 21 why bother scouting anymore. or clearing the scouted ones."}, {"1": "The new map expansion will be available (soon) at 660 provinces on the world map but it is not yet."}, {"29": "Indianaking said:\t\t\tDoes anyone know what can be generated with portal profits in chapter 21 please?\t\tClick to expand...Only the first prod (under benefit)[BR][BR][IMG]https://i.ibb.co/hgWHNLr/https-beta-forum-elvenar-com-index-php-attachments-img-0716-jpeg-11559.jpg[/IMG]"}]