[{"30": "Hello friends,[BR]can someone help.[BR]Where can I produce/collect orish art?[BR]I have NO idea.[BR]Thanks in advance[BR][IMG]https://i.ibb.co/gz0QCGn/https-beta-forum-elvenar-com-index-php-attachments-1689949435608-png-11575.png[/IMG]"}, {"22": "Brummbaer said:\t\t\tHello friends,[BR]can someone help.[BR]Where can I produce/collect orish art?[BR]I have NO idea.[BR]Thanks in advance[BR]View attachment 11575Click to expand...[IMG]https://i.ibb.co/PZLcxLB/https-beta-forum-elvenar-com-index-php-attachments-1689950081064-png-11576.png[/IMG]"}, {"30": "Thanks, I did the wrong way of formulate my question.[BR]I'm searching the scource for the recources to produce [smilie--sprite1] [BR][IMG]https://i.ibb.co/1ngbGwc/https-beta-forum-elvenar-com-index-php-attachments-1689950481860-png-11579.png[/IMG]"}, {"22": "[smilie--sprite1][BR][IMG]https://i.ibb.co/R9CQ1P6/https-beta-forum-elvenar-com-index-php-attachments-1689950928124-png-11580.png[/IMG][BR][BR]vallorian raid from vallorian workshop --> blackyard brawl, rude riot, experimental jewellery from workshop of diabhal -->shdy art from  vallorian workshop[BR][BR]indeed very complex manifacturing, as said [smilie--sprite1]"}, {"30": "@Ainor : Thanks, I was hit by blindness [smilie--sprite1]"}, {"31": "Deadeye Jerry said:\t\t\tThe new map expansion will be available (soon) at 660 provinces on the world map but it is not yet.\t\tClick to expand...Hello Jerry, and when will that be and when will the new chapter be live? Any more detailed information to this? Thank you[smilie--sprite1]"}, {"32": "Loewenzahn said:\t\t\tHello Jerry, and when will that be and when will the new chapter be live? Any more detailed information to this? Thank you[smilie--sprite1]Click to expand...I think I got the map expansion, but don't count on my weak memory [smilie--sprite8]. Better check the Expansions tab.[BR][BR]EDIT: I placed 3 expansions - 1 from Premium, 1 from tech tree and another one must be the one that comes with the chapter (from completing provinces - I have over 700 completed). Unfortunately, once someone doubts about what I am saying, I start to doubt too about my memory [smilie--sprite8]"}, {"29": "Expansion is available[BR][BR][IMG]https://i.ibb.co/qy024Z2/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-07-23-144712-png-11590.png[/IMG][BR][BR]For the chapter XXI on the live, in 2 or 3 weeks after béta: Normally"}, {"1": "The expansion should have been available a day before the chapter on beta, I am not sure how it will be on live."}, {"31": "Biloutte91 said:\t\t\tExpansion is available[BR][BR]View attachment 11590[BR][BR]For the chapter XXI on the live, in 2 or 3 weeks after béta: NormallyClick to expand...thank you![smilie--sprite1]"}, {"33": "Any feedback from people playing the last chapter?[BR]Mainly about the introduction ot Community Work as (another) decaying Resource."}, {"29": "FYI, Community work decay every night by10%"}, {"34": "Prueba2 said:\t\t\tAny feedback from people playing the last chapter?[BR]Mainly about the introduction ot Community Work as (another) decaying Resource.\t\tClick to expand...[BR]There are actually 2 new mechanics introduced with this chapter : Prosperity and Community Work.[BR][BR]Since the question was about Community Work, I'll start with that. It comes with your residences, either magic or regular. So there is now a switch to choose whether you collect coins/unurium like you did so far or if you want to collect community work (you will also have some unurium but ridiculous compared to the other option). The switch is done manually, residence by residence. There is an early collect after 3h.[BR][BR]The quantity you will collect includes a regular production (96/day for magic residences) but also depends on  the culture bonus in your city (it actually impacts a lot, here at the time of the picture below I have a 387% culture bonus level giving me a huge boost in production).[BR]A builer bonus of +20 is added if you activate the +20% production option on community work in the hobby room of your builder's hut by watching an add every 3hours.[BR]And yes this community work decays every night by 10%, as already mentionned by @Biloutte91 [smilie--sprite1][BR][IMG]https://i.ibb.co/2sZdfwT/https-beta-forum-elvenar-com-index-php-attachments-1690304904623-png-11603.png[/IMG][IMG]https://i.ibb.co/bBgwLJt/https-beta-forum-elvenar-com-index-php-attachments-1690304952967-png-11604.png[/IMG][IMG]https://i.ibb.co/BB1Zg9C/https-beta-forum-elvenar-com-index-php-attachments-1690305490041-png-11605.png[/IMG][BR][BR]So what is it used for ? so far only for settlement buildings creation (workshops of diabhal's horde), settlement buildings upgrade (all of them), settlement production (in the vallorian workshops) and as a requirement in the research tree. Depending on how aggressive you are with your progress in the chapter, you may consume up to 5000 community work a day sometimes. I have half my residences set on community work today, the other half on regular coins & unurium.[BR][BR]I hope it answers your question. Let me know if you need more specifics.[BR]Like I said there is another novelty coming with the new chapter, the introduction of Prosperity.[BR][BR]Prosperity will work like Population and Culture, ie[BR]- some buildings will make Prosperity available : your main hall, residences, workshops, barracks[BR]- some buildings will require Prosperity : all settlement buildings, at creation and upgrade[BR][BR][IMG]https://i.ibb.co/BCdc59V/https-beta-forum-elvenar-com-index-php-attachments-1690305556130-png-11607.png[/IMG][IMG]https://i.ibb.co/6DHRzhV/https-beta-forum-elvenar-com-index-php-attachments-1690306055797-png-11608.png[/IMG][BR][BR]Prosperity is pretty much transparent and painless, there is just one subtlety about it : the quantity of required Prosperity will impact your settlement production bonus in the form of a Prosperity factor. This factor is a ratio between your currently required Prosperity and a base Settlement Prosperity (set to 600 by default). Here with the Portal and all 18 workshops at level 4, I have a Factor of 165% so it adds a 65% production bonus to all my settlement buildings (in addition to the 42% of my blooming trader guild at lvl 31)[BR][BR][IMG]https://i.ibb.co/6WG514m/https-beta-forum-elvenar-com-index-php-attachments-1690306413317-png-11610.png[/IMG][IMG]https://i.ibb.co/cYQSBpS/https-beta-forum-elvenar-com-index-php-attachments-1690306718618-png-11611.png[/IMG][BR][BR]Remember, required Prosperity increases each time you add a settlement building or upgrade one. So basically, the more buildings you have in your settlement, and the higher they are, the more each other building of the settlement will produce thanks to Prosperity.[BR][BR]Hopefully this makes sense."}, {"19": "Deadeye Jerry said:\t\t\tYou will be getting the full Unurium bonus but when you choose the residences to be earning community work instead the Unurium you will be getting is insignificant almost as not getting anything at all. This is due to the difference in coins or community work you might get from the residence is very large, as The Vallorian Seal Tower gives a percentage of Unurium for Coins Pickup from Residences[BR][BR]This is the way it works for now but it might be changed soon.\t\tClick to expand...I'm nowhere near chap 21 on beta yet, but on my main account I am. I sure as heck hope that gets changed because I've invested a crapload of KPs into maximizing this AW which suddenly stands to lose maybe half of it's value and power. Which is not something a player could foresee, so I consider that a huge breach of trust to say the least.[BR]Were this a real world thing it would be close to breach of contract.[BR]Inno already managed to completely castrate the Crystal Lighthouse at one time, very significantly reducing it's worth to a fraction of what it was. So much so I just got rid of that, losing all the invested KPs at that time because it had basically become a worthless building taking up space at the time.[BR]If you guys keep that kind of thing up you are not exactly encouraging players to invest in the game. Not a great way of (re)building trust either.[BR]I'll keep an eye on this, because this really is a serious issue for me. The Vallorian Seal Tower was introduced at the end of Chap 19. To just castrate it in Chap 21 by taking away half of it's abilities is absolutely not acceptable."}, {"19": "pilousd said:\t\t\tThere are actually 2 new mechanics introduced with this chapter : Prosperity and Community Work.[BR][BR]Since the question was about Community Work, I'll start with that. It comes with your residences, either magic or regular. So there is now a switch to choose whether you collect coins/unurium like you did so far or if you want to collect community work (you will also have some unurium but ridiculous compared to the other option). The switch is done manually, residence by residence. There is an early collect after 3h.[BR][BR]The quantity you will collect includes a regular production (96/day for magic residences) but also depends on  the culture bonus in your city (it actually impacts a lot, here at the time of the picture below I have a 387% culture bonus level giving me a huge boost in production).[BR]A builer bonus of +20 is added if you activate the +20% production option on community work in the hobby room of your builder's hut by watching an add every 3hours.[BR]And yes this community work decays every night by 10%, as already mentionned by @Biloutte91 [smilie--sprite1]Click to expand...[BR]Well, that is a bit of an issue since that hobbyroom is not available to everyone as it's still 'being tested' by only parts of the playerbase. If that is going to have such a huge impact that needs to be resolved"}, {"35": "from my personal experience so far (not that far in tech tree yet) is that you don't really need that much community work. Ofcourse the houses don't produce that much either. But if feels like, with only a few magic houses on community work, that its sufficient."}, {"36": "Training speed in military buildings in this chaper is to low. In ch19 it was 690 and in ch20 it increased to 860. That's 170 difference which is fine conisdering much difficulty increase from expansions and research. In ch21 its growing form 860 to 950 which gives us only 90 difference. In both cases we got 3 new expansions and around 40 mandatory technologies so why is it that this increse is so small? Tournaments are already very expenssive in last chapteres so theres no need to make it even worse. My proposition is to increase training speed in ch21 from 950 to 1050 which would give us increase of 190 so very close of what we got before."}, {"34": "Dhurrin said:\t\t\tWell, that is a bit of an issue since that hobbyroom is not available to everyone as it's still 'being tested' by only parts of the playerbase. If that is going to have such a huge impact that needs to be resolved\t\tClick to expand...[BR]Well I was not aware, thanks for the info.[BR]Now that my settlement is fully evolved, I only use community work for productions required by the research tree and it is really not a blocking item. Or at least far behind many others like mana, ascending goods, kps, etc... [BR]But at the time when I was aggressively rushing through the upgrades of all the settlement buildings, these 20% were useful (keep in mind it's only on the regular production so actually 20 per magic house per day) so indeed it is a bit surprising not to propose the option to the entire playerbase."}, {"37": "If you are running out of Crafting resources and you are interested in building new wonders, you may want to prepare some resources in advance as they will be required for constructing and upgrading the new Chapter 21 wonders:[BR][BR][IMG]https://i.ibb.co/djdFxPz/https-beta-forum-elvenar-com-index-php-attachments-1690931203316-png-11635.png[/IMG][BR][BR]Both of them require Spell Fragments, Combining Catalysts and Royal Restoration spells when constructing. Each following level needs 2000 more Spell Fragments and 2 more Combining Catalysts. RR spells are then only required every 5th level and every time they get increased by 10."}, {"9": "So CCs & RRs for wonder upgrades, what will come next chapter - wonder upgrades for diamonds?"}]