[{"38": "I seriously pity anybody coming to Ch21 straight from Ch20 without the gap between chapters which many of us have had and which gave us time to work on our stocks of necessary resources."}, {"39": "How many settlement buildings do you have? Any recommendations?"}, {"34": "Angedev said:\t\t\tHow many settlement buildings do you have? Any recommendations?\t\tClick to expand...[BR]"}, {"19": "iDavis said:\t\t\tIf you are running out of Crafting resources and you are interested in building new wonders, you may want to prepare some resources in advance as they will be required for constructing and upgrading the new Chapter 21 wonders:[BR][BR]View attachment 11635[BR][BR]Both of them require Spell Fragments, Combining Catalysts and Royal Restoration spells when constructing. Each following level needs 2000 more Spell Fragments and 2 more Combining Catalysts. RR spells are then only required every 5th level and every time they get increased by 10.\t\tClick to expand...CC spells and spell fragments are not really a concern for me, and I doubt they will be for most players who are that far advanced. The RR-spells are quite a bit harder to come by and will definitely be the bottleneck, especially with so many eventbuildings I have that will need to be upgraded."}, {"39": "Tank you very much @pilousd ! [smilie--sprite1]"}, {"40": "My version: [smilie--sprite1][BR][BR][IMG]https://i.ibb.co/PTgLWxD/https-i-imgur-com-ul-Hk-GQB-png.png[/IMG]"}, {"41": "My version [smilie--sprite1][BR][BR][IMG]https://i.ibb.co/FnsFrqQ/https-beta-forum-elvenar-com-index-php-attachments-1691336660255-png-11656.png[/IMG]"}, {"42": "pilousd said:\t\t\tHi @Angedev, I see nobody's replying to you so I will [smilie--sprite1][BR][BR]I don't have any specific  recommendation, I simply followed the quests so I have 19 settlement buildings :[BR]- the portal, the Vallorian Dragon Tower (7x9 at level 4)[BR]- 9 Vallorian Workshops (each is 7x4 at level 4)[BR]- 9 Workshops of Diabhal's Horde (each is 5x6 at level 4)[BR]plus of course all the Prey Trails (1x1) to connect them[BR][BR]I didn't try to optimize my settlement, so there are certainly many ways to make it smaller,  but to give you an idea of the end result after all upgrades, you have my Elvenstats map below.[BR][BR]Anything less than these 19 buildings, you won't be able to validate the quests but with enough mana, 1h/2h time boosters, ascending goods, portal profits (in this specific order) or a bunch of diamonds, you could rush this chapter with just 1 of each in theory.[BR][BR]More than 19 buildings should be rewarding, as the quantity of settlement production is indexed on a prosperity factor which will increase for each new settlement building creation or update. In other words, the more buildings you add, the more all the other buildings will produce, helping you reach the requested amount of settlement productions faster.[BR]I did not try, but intended to add 1 Vallorian Workshop + 1 Workshop of DH and see how it impacts. May be on live server, I'll let you know.[BR][BR]Hope it helps,[BR]have fun with this new chapter [smilie--sprite2][BR][BR]View attachment 11637Click to expand...[BR][BR]A question please!  How do you get the updated Elven Architect?  I've been waiting for it to become available but mine only goes up to Chapter 20!  Thank you in advance."}, {"9": "@benketa Load your live city. [BR]Save it. [BR]Change icon to beta. [BR]Load your saved city."}, {"43": "Now chapter 21 on live.[BR]but no wiki "}, {"44": "Is it only in my city, or the portal max stockpile is not affected by Vortex of Storage?"}, {"39": "@Ropucha I have the same problem on live. Maybe try to to create a bug report [smilie--sprite1]"}, {"45": "Angedev said:\t\t\tMaybe try to to create a bug report [smilie--sprite1]Click to expand...That won't help... the Architect is NOT an INNO product, but maintained by the same person that runs ElvenStats"}, {"39": "@Dorfl the Clay My post was about Vortex of Storage, not Architect [smilie--sprite2]"}, {"26": "Dorfl the Clay said:\t\t\tThat won't help... the Architect is NOT an INNO product, but maintained by the same person that runs ElvenStats\t\tClick to expand...I'm pretty sure thats not true either. Elvenstats and elvenarchitect owners are different persons as far as I know"}, {"45": "Kersepitje said:\t\t\tElvenstats and elvenarchitect owners are different persons as far as I know\t\tClick to expand...My bad, I presumed they were the same, since the site are connected.. but they are definitely NOT run by Inno!"}, {"2": "It's ElvenStats that is slow.  You can contact the owner Blake through his site, there's a link at the bottom of the page."}, {"46": "Here's another example for a possible version (wider and flatter)[BR][BR][IMG]https://i.ibb.co/t3qQH9h/https-beta-forum-elvenar-com-index-php-attachments-plattegrond-gastras-1-jpg-11687.jpg[/IMG]"}, {"25": "Angedev said:@Dorfl the Clay My post was about Vortex of Storage, not Architect [smilie--sprite2]Click to expand...bug fixed on Lives servers this morning"}, {"9": "Question for those who are more advanced in this chapter:[BR]Considering that all Prey is clicked only through PPs:[BR]Does this change the ideal balance between Vallorian workshops and Workshops of Diabhal's Hordes? [BR](=should i build more Horde's workshops than Vallorian workshops or should i keep it balanced (currently 9:9, don't care about quests)?)"}]