[{"35": "Lovec Krys said:\t\t\tQuestion for those who are more advanced in this chapter:[BR]Considering that all Prey is clicked only through PPs:[BR]Does this change the ideal balance between Vallorian workshops and Workshops of Diabhal's Hordes?[BR](=should i build more Horde's workshops than Vallorian workshops or should i keep it balanced (currently 9:9, don't care about quests)?)\t\tClick to expand...my personal approach on live server is to build more vallorian workshops then needed, just because they use more prosperity. And more prosperity means greater production boost. Most of them will be doing nothing most of the time tho, because on my server, their aint enough trades of the ascending goods to be able to keep me going (even tho i can produce lots more then needed, theres no way to transform then).[BR][BR]Having higher prosperity boosts then also helps me for needing less ascending goods. The downside, i need a lot more room, but thats ok [smilie--sprite1]"}, {"32": "I have 12 Workshops of Diabhal's Horde and 9 Vallorian Workshops, just because the production of the first it's in high demand for Vallorian Workshops, as well for Vallorian Dragon Tower (portal). I might not upgrade all, just 9 of each, but for now, they are working around the clock while the Vallorian Workshops are idle about half day (every day)."}, {"19": "My version as it will be in 9x3 expansions. Though I'm thinking on adding a 10th Horde workshop[BR][BR][IMG]https://i.ibb.co/bQ1cCm3/https-beta-forum-elvenar-com-index-php-attachments-chap-21-setup-png-11725.png[/IMG]"}, {"19": "Dhurrin said:\t\t\tMy version as it will be in 9x3 expansions. Though I'm thinking on adding a 10th Horde workshop[BR][BR]View attachment 11725Click to expand... Update;[BR]Decided that I will make some changes.[BR]Since the Vallorian Workshops aren't going to be used as much, I will teleport one, maybe 2 of them once fully upgraded, to just keep them in case of need and to be able to swap then out when needed for a quest. [BR]I will use the space to up the amount of Horde workshops to 11, maybe 12."}, {"32": "@Dhurrin[BR]Here you have the quests from @iDavis site.[BR]\t\t\thttps://idavis-elvenar.com/guestRaces/vallorianlegend.html#quests\t\t"}, {"19": "Alcaro said:@Dhurrin[BR]Here you have the quests from @iDavis site.[BR]\t\t\thttps://idavis-elvenar.com/guestRaces/vallorianlegend.html#quests\t\tClick to expand...I know that site already, but thanks"}, {"5": "Has anyone filed any complaints/bug reports about the mana cost for the Rude Oblations? I don't see how it is meant to be 930k and not 93k, which would put it more in line with the seed and unurium costs in the other oblations."}, {"19": "Enevhar Aldarion said:\t\t\tHas anyone filed any complaints/bug reports about the mana cost for the Rude Oblations? I don't see how it is meant to be 930k and not 93k, which would put it more in line with the seed and unurium costs in the other oblations.\t\tClick to expand...No, it seems excessive for sure. Even half that would be kinda ok-ish but I doubt it is a mistake, I think it's a way of slowing down the game. It sure means slow going, with all the other mana-requirements I seem to be able to do 1 or 2 each day, but it is a strain. In my case I just am casting spells to gain instant mana for other use."}, {"5": "Dhurrin said:\t\t\tNo, it seems excessive for sure. Even half that would be kinda ok-ish but I doubt it is a mistake, I think it's a way of slowing down the game. It sure means slow going, with all the other mana-requirements I seem to be able to do 1 or 2 each day, but it is a strain. In my case I just am casting spells to gain instant mana for other use.\t\tClick to expand...[BR]Yep, Dragon Abbey and the Cauldron are a good combo. In my chapter 21 Live city, I did the Cauldron last night and got a critical success for the Settlement goods bonus at 58% extra for 66 hours. Of course, that 58% is only on the base amount, but that still adds up to a lot extra from all the different chapter productions. I also looked in my Tomes in the inventory and had a couple of the ones where you can get a lump amount of mana or the little Mana Rune building, which is 70% bonus mana from all buildings for something like 60 days."}, {"4": "Enevhar Aldarion said:\t\t\tthe little Mana Rune building, which is 70% bonus mana from all buildings for something like 60 days\t\tClick to expand...It's 10d 15d and it's being a wonder in my live city. Who would have thought Inno would create such a powerful 1x2 building. I too was looking through the tomes and fell upon it and the tomes which gave mana. I'm 10 techs from the end of the chapter where the mana requirements grow insane.[BR][BR]Edit: I notice in my city it was 15d instead of the 10 I said. I saw @Enevhar Aldarion had already been here with the correct answer, but figured it was still best to correct my post."}, {"5": "Yogi Dave said:\t\t\tIt's 10d\t\tClick to expand...[BR]We are both wrong. I checked and it is 15 days. The one that is 60 days is the cryomana building, also from a Tome, that reduces mana decay by 5%."}, {"19": "Yogi Dave said:\t\t\tIt's 10d 15d and it's being a wonder in my live city. Who would have thought Inno would create such a powerful 1x2 building. I too was looking through the tomes and fell upon it and the tomes which gave mana. I'm 10 techs from the end of the chapter where the mana requirements grow insane.[BR][BR]Edit: I notice in my city it was 15d instead of the 10 I said. I saw @Enevhar Aldarion had already been here with the correct answer, but figured it was still best to correct my post.\t\tClick to expand...Yup, 15 days. I have 1 out and 1 more in my inventory to replace it when it's done.[BR]And though the 70% additional mana is powerful, it only lasts 15 days, which I think makes it pretty well balanced. Especially since it does not seem to affect ALL buildings, only those which produce mana as it's primary production.[BR][BR]So NOT the evolving buildings that happen to also produce mana, like the Polar Bear (primary production is coins, while mana, seeds and PP-instants are additional), but it does affect the Ashen Phoenix which produces mana as primary and then sentient goods and KPs as additional production.[BR][BR]And NOT the AWs either, so both the Maze and the Dragon Abbey are not affected by it. Where personally I feel the Maze should be affected, but ok,  I can see how AWs might be excepted.[BR][BR]All regular and event buildings that purely produce mana like Mana Hut, Burning Pool, Galactic Egg, Lava Egg etc are.[BR][BR]All in all this seems to be a pretty well balanced building to me. Surprisingly so in fact."}, {"19": "The mana requirements are becoming a serious strain though.[BR]I'm pretty far through the techtree, with only 8 techs left to do.[BR]However, for those 8 techs I need a total of another 1450 rude oblations, which require mana. Right now I have 209 of them ready, so I need another 1241. For me, they are produced in batches of 22 in the portal, so that means 56.4 (so 57) productions. Of 930.000 mana each, meaning I still need 53.010.000 mana. And that's just for what I have left to do in the techtree, not counting any building upgrades.[BR]Which is nowhere near the requirements of unurium or seeds.[BR][BR]At the moment of writing, this is my stock[BR][IMG]https://i.ibb.co/dm2GWLd/https-beta-forum-elvenar-com-index-php-attachments-tech-req-png-11740.png[/IMG][BR][BR]It shows the discrepancy of needed goods (my unurium is rather low as I haven't started the Spire yet, but even so nowhere near as low as mana)."}, {"47": "Dhurrin said:\t\t\tThe mana requirements are becoming a serious strain though.[BR]I'm pretty far through the techtree, with only 8 techs left to do.[BR]However, for those 8 techs I need a total of another 1450 rude oblations, which require mana. Right now I have 209 of them ready, so I need another 1241. For me, they are produced in batches of 22 in the portal, so that means 56.4 (so 57) productions. Of 930.000 mana each, meaning I still need 53.010.000 mana. And that's just for what I have left to do in the techtree, not counting any building upgrades.[BR]Which is nowhere near the requirements of unurium or seeds.[BR][BR]At the moment of writing, this is my stock[BR]View attachment 11740[BR][BR]It shows the discrepancy of needed goods (my unurium is rather low as I haven't started the Spire yet, but even so nowhere near as low as mana).\t\tClick to expand...Indeed mana is a chore now. What I did to mitigate this issue was the following. I moved almost the whole city into the inventory and built as much guest buildings as possible and maxed them. This way I could increase the output of the portal production. Try to reach as high output per production as possible. You could lower that 57 productions to 30 or so. [BR]Still a lot of mana is required, so there must be something incorrect, but at least there is a workaround in this chapter if you are ready to sacrifice you city."}, {"19": "SirSmithy said:\t\t\tIndeed mana is a chore now. What I did to mitigate this issue was the following. I moved almost the whole city into the inventory and built as much guest buildings as possible and maxed them. This way I could increase the output of the portal production. Try to reach as high output per production as possible. You could lower that 57 productions to 30 or so.[BR]Still a lot of mana is required, so there must be something incorrect, but at least there is a workaround in this chapter if you are ready to sacrifice you city.\t\tClick to expand...I have 9 Vallorians and 11 Diabhals out, all maxed, as is the portal of course, production-wise that is more than enough for my needs. [BR]I have sold off some Festival Merchants and brought some more Burning Pools out of my inventory to replace them earlier. And I could always teleport another bunch of evolving buildings and bring out some more Lava Eggs to fill their spaces. I just don't want to, though I may decide to do so anyway if it gets to a point where I'm getting really annoyed.[BR]But I'm going to wait another week. By then I hopefully will have enough of all the other guestrace stuff so I could just sell off or teleport some of those buildings. I already have all the Orcish art I need and enough noble oblations, so my production can focus on the others now.[BR]Which means that somewhere next week I can replace some Vallorians and Diabhals with more manaproducing buildings, even if that means I'll have to do some more productions, because in that case it will basically only be that 1 type I need and the extra mana-production (coupled with a new Mana Rune building) should be able to take care of that. Especially if I decide to sling another 1.000 -  2.000 spells to have my Dragon Abbey give me a boost.[BR][BR]It's just a bit of an annoyance how out of synch the demand for mana is in this chapter, compared to seeds, unurium, orcs, or even goods. Same with supplies btw, but since I guess I'm kinda like Scrooge McDuck I'm swimming in coinrains and supply windfalls, so supplies never have been an issue since before chap 8 or so."}, {"47": "Dhurrin said:\t\t\tI have 9 Vallorians and 11 Diabhals out, all maxed, as is the portal of course, production-wise that is more than enough for my needs. [BR]I have sold off some Festival Merchants and brought some more Burning Pools out of my inventory to replace them earlier. And I could always teleport another bunch of evolving buildings and bring out some more Lava Eggs to fill their spaces. I just don't want to, though I may decide to do so anyway if it gets to a point where I'm getting really annoyed.[BR]But I'm going to wait another week. By then I hopefully will have enough of all the other guestrace stuff so I could just sell off or teleport some of those buildings. I already have all the Orcish art I need and enough noble oblations, so my production can focus on the others now.[BR]Which means that somewhere next week I can replace some Vallorians and Diabhals with more manaproducing buildings, even if that means I'll have to do some more productions, because in that case it will basically only be that 1 type I need and the extra mana-production (coupled with a new Mana Rune building) should be able to take care of that. Especially if I decide to sling another 1.000 -  2.000 spells to have my Dragon Abbey give me a boost.[BR][BR]It's just a bit of an annoyance how out of synch the demand for mana is in this chapter, compared to seeds, unurium, orcs, or even goods. Same with supplies btw, but since I guess I'm kinda like Scrooge McDuck I'm swimming in coinrains and supply windfalls, so supplies never have been an issue since before chap 8 or so.\t\tClick to expand...As more prestige your guest buildings are using the higher production bonus you get. The guest buildings are required to maintain the high production bonus in the tower. In the end I had 20 maxed Diabhal workshop and 14 maxed Vallorian shop. With a lvl 32 Trader wonder I reached 26 items for 1 production. This helped to lower down my mana requirements. I could have found some more buildings to move to the inventory, but it was acceptable for me at 26 items per production.[BR][edit] I had only 10-10 buildings connected to the tower from all guest buildings. The disconnected ones were to consume prestige only."}, {"19": "SirSmithy said:\t\t\tAs more prestige your guest buildings are using the higher production bonus you get. The guest buildings are required to maintain the high production bonus in the tower. In the end I had 20 maxed Diabhal workshop and 14 maxed Vallorian shop. With a lvl 32 Trader wonder I reached 26 items for 1 production. This helped to lower down my mana requirements. I could have found some more buildings to move to the inventory, but it was acceptable for me at 26 items per production.[BR][edit] I had only 10-10 buildings connected to the tower from all guest buildings. The disconnected ones were to consume prestige only.\t\tClick to expand...True enough. My BTG is maxed, but that does NOT seem to affect the portal goods, only the stuff in the workshops which I'm not worried about as I basically will have enough of everything for the entire techtree +10% by next week anyway.[BR]I just moved some stuff and brought out 6 Lava Eggs, which will help.[BR]Next week I should have enough of the rest of the goodies, so I could just remove the preytrails and use that space to put up a few more of the Vallorian Workshops. And maybe replace the Diabhals with more Vallorians as they give more prosperity and thus a better bonus.[BR]And if I forego my Scrooge McDuck nature (and the goal for goods-in-stock I had in mind) I could just teleport some factories and put up some more.[BR]I'll see how it works out by next week."}]