[{"1": "Zapraszam do dyskusji."}, {"2": "Trudno coś powiedzieć o nowej rasie po 2 dniach, ale jak na razie jakoś idzie [smilie--sprite1][BR]Jedna rzecz mi tylko strasznie nie pasuje. Produkcje w tych rozbudowanych manu. [BR][BR][BR][BR]Kiedyś dwie górne opcje były na zwykłe 3 i 9h, dolne na żywe.[BR][BR]Teraz są poukładane nie poziomo, a pionowo w 3 kolumnach. I spoko by było, gdyby były ponumerowane (ustawianie z klawiatury) tak:[BR][BR]1 - 3 - 5[BR]2 - 4 - 6[BR][BR]Ale nie, numeracja idzie poziomymi rzędami[BR][BR]1 - 2 - 3[BR]4 - 5 - 6[BR][BR]A więc jak chcę kliknąć zwykłe 3 i 9h to teraz jest nagle 1 i 4, żywe 2 i 5, wzniesione 3 i 6!!![BR]Nosz kurde, kto na to wpadł? Nie można było zrobić w pionie? Żeby było jak kiedyś 1 i 2, 3 i 4, a teraz dodatkowo 5 i 6?[BR][BR]Dodatkowym problemem jest to, że niektóre manu są rozbudowane, a niektóre jeszcze nie i tu się robi już kompletne zamieszanie. Baaardzo mi się to nie podoba..."}, {"6": "3 kupców do wystawiania swoich nowych towarów wynajmuje się za złoto na 20 dni (trzeci w ogóle kosmiczna kwota) a 2 dodatkowych za 100 i 200 diamentów również na 20 dni[BR]Tak więc płacimy za możliwość handlowania swoimi towarami (innym graczom można ponoć zdejmować bez kupców)[BR][BR]Na 3 kupca to w ogóle trzeba Ratusz rozbudować do 40 poziomu bo na 39 poziomie maximum złota jest 80 milionów"}, {"2": "Koval92 napisał:\t\t\tNa 3 kupca to w ogóle trzeba Ratusz rozbudować do 40 poziomu bo na 39 poziomie maximum złota jest 80 milionów\t\tKliknij aby rozwinąć...[BR]No to teraz zgłupiałam...[BR]I na s2 i na s3 wynajęłam sobie wszystkich kupców.[BR]A ratusz w obu miastach mam nadal na 39 poziomie![BR][BR][BR][BR][BR][BR]Nie pamiętam, jaka tam była cena, złota mam nadmiar, więc było mi to obojętne.[BR]Ktoś jeszcze nie wynajął trzeciego i może to sprawdzić?[BR]Albo po prostu pamięta?[BR]Jedynym wytłumaczeniem jest to, że obniżyli cenę dla żywych serwerów [smilie--sprite1]"}, {"6": "A no tak, teraz rozbudowałem handlarza i jest po 72kk.[BR]Czyli koszt wynajęcia kupca zależy od poziomu ratusza, im wyższy tym więcej."}, {"6": "[BR][BR]Fajny handel[BR][BR]Czy nie można coś zrobić z tymi powiadomieniami po angielsku \"ktoś tam has traded with your merchant\" za każdym razem, jak ktoś zdejmuje nasze oferty ze wzniosłymi towarami? Tego jest tyle że cała ostatnia pomoc sąsiedzka jest \"wypychana\" z pierwszej dziesiątki stron powiadomień, bo nie pozwalacie handlować normalnie tylko 1000 ofert po 2k[BR][BR][BR][BR]W ten sposób to tylko zachęcacie do nie wystawania własnych ofert i nie używania kupców, tylko zdejmowania ofert innych graczy. [BR]Jak tak każdy do tego podejdzie to nikt nic nie wystawi."}, {"6": "22:07 Felyndral[BR][BR]Żądanie: Pierwotne minerały: 0 ofert[BR]Żądanie: Płonące sztabki: 0 ofert[BR]Żądanie: Uczone sadzonki: 151 ofert[BR][BR]Dobrze zbalansowany rynek nowych towarów to podstawa."}, {"54": "W dodatku każdorazowa wymiana zaśmieca Powiadomienia. Nie można tego rozdzielić? Chyba, że jest taka możliwość aby nie dostawać każdorazowo informacji o wymianie. 100 wymian dziennie i nie wiadomo kogo łapkować...[smilie--sprite4][BR]Porażka z tą ilością 2k za jednym razem. niby czemu ma to służyć. Jeszcze bym zrozumiał, że potrzeba 5-6k na rozbudowę ale tu idzie w dziesiątki tysięcy surowców...[BR]Rzadko się wypowiadam, jednak tu już nie wytrzymałem."}, {"2": "Osteres napisał:\t\t\tW dodatku każdorazowa wymiana zaśmieca Powiadomienia. Nie można tego rozdzielić?\t\tKliknij aby rozwinąć...Tu już jest pomysł na rozwiązanie tego problemu[BR]\t\t\thttps://pl.forum.elvenar.com/index.php?threads/okno-powiadomie%C5%84-z-dwiema-zak%C5%82adkami.5412/\t\t[BR]Natomiast jeśli chodzi o handel to ja nie widzę większego problemu, czasem się trafi taki partner handlowy, który akurat wymienia odwrotne ofki i wtedy wymiana nawet dużych ilości idzie błyskawicznie, wystawiamy sobie ofki i zbieramy sobie kapelusze [smilie--sprite1] Parę obrotów i po handlu.[BR]Czasem trzeba też chwilkę poczekać. Ale jeśli się planuje do przodu i handluje zawczasu to w ogóle nie ma problemu z zebraniem potrzebnej ilości T7. Nikt nie powiedział, że ma wszystko być podane na tacy, czasem trzeba się nieco postarać.[BR]Tak ogólnie to mi się ten rozdział BARDZO podoba. Wizualnie jest piękny (tzn. ratusz, rezydki i warsztaty u elfów - u ludzi są takie zwyczajne, jak zawsze).[BR]Nie trzeba stawiać setek małych domków, nie trzeba ich klikać co 15 min, produkcja jest jasna i logiczna, domki rasowe są ładne i ustawne.[BR]Od samego początku LUBIĘ ten rozdział [smilie--sprite1][BR]Oczywiście tu i ówdzie czegoś brakuje chwilowo, ale to chyba norma. Trzeba wcześniej zaplanować i wtedy mniej jest takich \"braków\".[BR][BR]Moja opinia o nowej rasie na tą chwilę jest taka:[BR]Rasa piękna, logiczna, ustawna, nie wymaga więcej miejsca niż poprzednia, spokojnie da się wszystko zaplanować, a chwilowe braki da się przeczekać robiąc coś innego.[BR]U mnie balans między ziarnami a unurytem nie jest problemem. Jak się planuje z wyprzedzeniem, to można spokojnie przełączać te produkcje i na wszystko starczy.[BR]Trochę dużo potrzeba żywych surowców, ale właśnie już złapałam równowagę między ziarnami a unurytem, więc to też da się zrobić [smilie--sprite1]"}, {"8": "Epoka jest bardzo fajna i zbalansowana. Dla przygotowanych na tę epokę.[BR][BR]Nie jestem jednak pewien jak przeciętny gracz, taki który dobrnie kiedyś do tej epoki,  poradzi sobie z ilościami many wymaganymi na przełomie epok i na początku najnowszej. [BR]Bo będzie chciał rozbudować po kilka manufaktur T1 (zwykłych, T1, także do żywych wypada podnieść, oraz T1 do wzniosłych trzeba podnieść koniecznie), do czego potrzeba po 1500 many od sztuki. [BR]Potem porobić pierwsze nauki - znowu mana po 1000-1200 i tak z parę razy.[BR][BR]Są dwa ekstremalne sposoby uzyskania many w krótkim czasie. Gracze dobrzy wojskowo pojadą na Opactwie oraz zużyją nadmiar zaklęć. Bateria zlimitowanych niedawno Bibliotek nie zaszkodzi. Gracze po przeciwnej stronie poradzą sobie za pomocą nowej Latarni i Fortec (plus Opactwo).[BR][BR]Ale reszta może być w kropce. A Labirynt niewiele pomoże. Mniej niż w epoce wcześniej."}, {"7": "Koval92 napisał:\t\t\tŻądanie: Pierwotne minerały: 0 ofert[BR]Żądanie: Płonące sztabki: 0 ofert[BR]Żądanie: Uczone sadzonki: 151 ofert[BR][BR]Dobrze zbalansowany rynek nowych towarów to podstawa.\t\tKliknij aby rozwinąć...Każdy z graczy ma inny bonus do wzniosłych towarów i potrzebuje różne ilości surowca w zależności od miejsca w drzewku badań.[BR]Dzisiaj nie potrzebuje i nie wymienia ale za kilka dni może zasypać rynek ofertami towarów, których dzisiaj brakuje na rynku.[BR]Można też samemu wystawiać oferty i gwarantuje, że jeśli nie byłeś obojętny na oferty innych graczy, to tym samym się Tobie odpłacą.[BR]Ja np ściągam z serwera w miarę możliwości oferty z kapeluszem nawet na towar, którego nie potrzebuję bo wiem, że jak pomogę innym to będę mógł też na takową pomoc liczyć i taki sposób polecam w bractwie. Grunt to znaleźć rozwiązanie problemu..., choć wiem, że ponarzekać jest łatwiej [smilie--sprite1]"}, {"8": "Ja nadzieję na handel towarami wzniosłymi upatruję jedynie w tym, że wzniosłe towary robione są (będą) na przesuniętym bonusie względem towarów zwykłych i żywych. Więc jak przykładowo od lat kiepski jest handel na s2 drewnem i jedwabiem i i dość średnio, ale już lepiej niż kiepsko się zawsze handlowało kamieniem i obsydianem, to ze wzniosłymi pewnie będzie zupełnie lepiej. Dlatego że bonus przesuwa się pomiędzy producentami i ktoś te wzniosłe wreszcie wyprodukuje i wypuści na rynek.[BR][BR]Natomiast rynek wzniosłych został dodatkowo uregulowany limitem ofertek. Jedna taka przecież na waciki starczy, ale to ma swój sens jak sądzę.[BR][BR]Nawet jeśli pozbieramy ofertki oznaczone kapelusikiem, to uruchomimy co najwyżej mały strumyczek małych ofertek. A każdy strumyczek z czasem będzie tylko większy*. Rozumiem, że taka regulacja metodą małych strumyków małych ofertek ma zapobiec nieuchronnej spekulacji towarami wzniosłymi. Żeby się nasi szanowni spekulanci tym razem nie upaśli kosztem pechowców w początkowej fazie powstawania rynku handlu nowymi towarami. Tak jak to było niegdyś w przypadku niektórych towarów żywych.[BR][BR]Strasznie żeśmy spekulantów gonili swego czasu, bo to straszni ludzie byli i hańba im po dzisiaj, to teraz nie narzekajmy na zapas ani na mechanikę kapelusików, ani na to że oferty mają niski limit ilości tych towarów.[BR][BR]Obecna sytuacja jest dość dziwna, ale szybko się odmieni. A nie jest dziwniejsza, niż w epoce kwitnącej i bezczelnej spekulacji żywymi[BR]towarami.[BR][BR]A te informacje na kopertce nie są z tyłka wzięte żeby zawalać kopertkę. Jak klikniesz w zielone pole ze strzałką, to zwalnia ci slot w zakładce \"Handlarze\". Czyli to jest rodzaj motywki. Motywka ta polega na informacji, że możesz ponownie uruchomić kolejny strumyczek przed upływem regulaminowych 6h.[BR]Trochę to karkołomnie wygląda, ale cel tej mechaniki jest nie taki, żeby nam było łatwiej, bo nie jest, tylko żeby zdusić spekulację w zarodku.[BR]Jeśliby spekulacja by się odrodziła, to kłopotliwe ilości many to małe miki by było w porównaniu z trudnością pozyskania niektórych T7.[BR][BR]* Błąd. Strumyczki będą takie same. Po prostu będzie ich przybywać."}, {"54": "Nusion napisał:\t\t\tNatomiast jeśli chodzi o handel to ja nie widzę większego problemu, czasem się trafi taki partner handlowy, który akurat wymienia odwrotne ofki i wtedy wymiana nawet dużych ilości idzie błyskawicznie, wystawiamy sobie ofki i zbieramy sobie kapelusze [smilie--sprite1] Parę obrotów i po handlu.[BR]Czasem trzeba też chwilkę poczekać. Ale jeśli się planuje do przodu i handluje zawczasu to w ogóle nie ma problemu z zebraniem potrzebnej ilości T7. Nikt nie powiedział, że ma wszystko być podane na tacy, czasem trzeba się nieco postarać.\t\tKliknij aby rozwinąć...[BR]Ja nie twierdzę, że jest jakiś problem z surowcami na rynku tylko wymiana po 2k jest bardzo uciążliwa przy tych ilościach, które są potrzebne do rozbudowy.[BR]Generalnie nie ma ofert na rynku. Wystawiam i dość szybko znikają. Nie dziwię się, że nie wszyscy chcą wystawiać a wolą zdejmować. [BR]Nie dostaje się wtedy powiadomienia i jest wtedy git [smilie--sprite7]"}, {"55": "blazius1 napisał:\t\t\tJa nadzieję na handel towarami wzniosłymi upatruję jedynie w tym, że wzniosłe towary robione są (będą) na przesuniętym bonusie względem towarów zwykłych i żywych. Więc jak przykładowo od lat kiepski jest handel na s2 drewnem i jedwabiem i i dość średnio, ale już lepiej niż kiepsko się zawsze handlowało kamieniem i obsydianem, to ze wzniosłymi pewnie będzie zupełnie lepiej. Dlatego że bonus przesuwa się pomiędzy producentami i ktoś te wzniosłe wreszcie wyprodukuje i wypuści na rynek.\t\tKliknij aby rozwinąć...i tu błąd logiczny, przesunięcie w lewo czy w prawo nic nie zmienia tak jak nie zmienilo w przypadku żywych, jest dokładnie taka sama ilość osób z bonusem stali więc ci będą produkowali wzniosły stal+2 czyli tego będzie dużo a mniej będzie tych którzy na s3 do tej pory spekulują platyną i to oni bedą znowu dyktowali ceny na rynku wzniosłego bo cały czas ich jest najmniej"}, {"7": "visit0r napisał:\t\t\tto oni bedą znowu dyktowali ceny na rynku wzniosłego bo cały czas ich jest najmniej\t\tKliknij aby rozwinąć...Jedynie może być problem z ilością na rynku tych towarów, bo na dyktowanie cen nie pozwoli już nowa formuła kupca i to akurat uważam za dobre rozwiązanie [smilie--sprite1]"}, {"8": "Problem z ilością jest jakaś niewiadomą, bo ilość jeszcze mocniej uzależniana będzie od aktywności graczy. Głównie od motywowania własnych Handlarzy z poziomu kopertki.[BR][BR]Na rynku wzniosłych nikt nie będzie mógł ustalać innego przelicznika niż 1:1. Ten zmyślny system w nowym Kupcu na to nie pozwala. Czyli dyktat cen odpada.[BR][BR]Rynek wszystkich towarów powinien się z czasem konsekwentnie stabilizować. W tym także żywych, co i tak się powoli już działo. Nie wiem jak tam ze zwojami? Na razie chyba bez większych zmian.[BR]Wszystkich - bo wszystkie towary obecnie objęte są bonusem do produkcji. Po raz pierwszy cała globalna produkcja towarów jest objęta trzema bonusami. Im więcej graczy dobrnie do najnowszej epoki, tym lepiej dla całego rynku.[BR]Czasem liczonym raczej kwartałami niż miesiącami.[BR][BR]Rynek uzyska wreszcie równowagę nie tylko dlatego, że wreszcie mamy uruchomione na nim wszystkie bonusy wszystkich uczestników rynku. Również dlatego, że w zarodku zduszono spekulację, która niechybnie wybuchłaby na rynku wzniosłych.[BR][BR]System małych ofertek oczywiście relatywnie spowolni grę, ale IG ma na spowalnianie gry sto rożnych sposobów.  Spowolniliby epokę nie tak, to innym sposobem. Nie musieli tego robić takim manewrem jak zakładka \"Handlarze\" w Kupcu. Więc nie chodziło o to, żeby było trudniej i wolniej. To skutki uboczne reformy w Kupcu.[BR][BR]Spora zmiana i jak bardzo rzadko: wyłączne na plus. Jakby to nie ta sama gra była, co jeszcze miesiąc temu.[BR][BR]PS. W tym układzie limit na druga Bibliotekę wydaje się niepotrzebnym ograniczeniem. Tym limitem wylano dziecko z kąpielą ponieważ sytuacja ze zwojami i tak doszłaby do ładu w dłuższej perspektywie. Nabieram przekonania, że z tymi Bibliotekami to wcale nie chodziło o zwoje."}, {"56": "ale problemem jaki moze sie pojawic jest ilosc graczy w 18 akcie. Nie wiem ilu jest ogolnie,ale moze to stanowic mala przeszkode. I pytano jak handel wznioslymi sie odbywa. Bo obecnie mozemy handlowac zwyklymi towarami z ludzi ktorych mamy odkrytych -bez prowizji, z ludzmi niedaleko nas zakrytych z prowizja, i zywe towary na jakis wiekszy zasieg. A wzniosle? na caly server? czy jak zywe? - przyznam ze nie doczytalem jakos a ciekawi mnie to."}, {"8": "O ilość graczy którzy weszli mniej więcej równocześnie w 18 epokę IG zadbała z wyprzedzeniem. Handel wzniosłymi już ruszył. Wszyscy (?) widzą, że wystawiać i zbierać oferty trzeba za wczasu. Z mozołem.[BR][BR]Rynek wzniosłych jest tak samo jak żywych ogólnoserwerowy, tylko dodatkowo uregulowany mechaniką Handlarzy. Druga różnica względem żywych jest taka, że rynek wzniosłych nie jest powiązany z Hurtownikem.[BR][BR]Czyli ten rynek nie daje przewagi ani szczęściarzom z korzystnym układem bonusów produkcyjnych, ani posiadaczom dobrych Gildii Kupieckich.[BR]Kompletne zrównanie cen w relacji popytu z podażą. Centralizm rynkowy w czystej postaci.[BR][BR]Trudno nawet o ocenę tego rynku na zasadzie podoba się - nie podoba. Rynek wzniosłych nie ma ani jednej cechy tzw. wolnego rynku, które występują na rynkach niższych towarów. Jest kompletnie regulowany a gracze zostali zaledwie w minimalnym stopniu doń dopuszczeni. Rożnica w udziale w tym rynku  konkretnych graczy będzie polegała nie tyle na tym, ile wyprodukują wzniosłych, tylko od ich aktywności w grze.[BR][BR]Stąd wniosek mój, że dwie manufaktury T7 jednocześnie to generalnie o jedną za dużo. Starczy raczej jedna.Tym bardziej z Feniksem Niebieskim, którego rola wcale nie zmaleje, a raczej nawet odwrotnie."}, {"31": "Mam pytanie do innych graczy,czy cud kwitnąca gildia  kupiecka  działa na produkcje portalowa w 18 rozdziale? bo mam ją na różnych poziomach od 18-21lvl  a produkcja z centrów żywiołów na każdym świecie jest taka sama,czyli 15/4h na 1lvl,22/4h na 2lvl,jeśli nie działa to może warto ją skasować?"}, {"6": "Wewe1 napisał:\t\t\tMam pytanie do innych graczy,czy cud kwitnąca gildia  kupiecka  działa na produkcje portalowa w 18 rozdziale? bo mam ją na różnych poziomach od 18-21lvl  a produkcja z centrów żywiołów na każdym świecie jest taka sama,czyli 15/4h na 1lvl,22/4h na 2lvl,jeśli nie działa to może warto ją skasować?\t\tKliknij aby rozwinąć...[BR]Działa bo podstawowa produkcja to jest 10 na 1 poziomie, +2 bonusu z portalu rasy, +X z gildii kupieckiej.[BR]U mnie gildia jest na 8 poziomie i daje +2 do produkcji centrów i mam ogólnie produkcję 14/4h, więc tobie daje +3.[BR][BR]"}]