[{"1": "Liebe Menschen und Elfen,[BR][BR]wir sind wirklich gespannt, wie ihr über das neue Feature \"Die Saisons\" denkt. Lasst es uns in diesem Thread wissen![BR][BR]Fragen zum Thema \"Saison der Träume\" oder generell zu den Saisons? Dann bist du im Fragethread besser aufgehoben![BR][BR]Viele Grüße[BR]Euer Elvenar Team"}, {"81": "Ich gehe von meinen Feedback aus das Inno nicht von Fehlern der Vergangenheit lernt und die Saisons genauso auf dem live aufspielt wie sie am Beta laufen. Wenn das nicht so ist bitte das Feedback ignorieren.[BR][BR]Wie am Beta schon kritisiert ist der Season Pass mit 2500 Dias es nicht Wert zu kaufen.[BR]Man bekommt bis auf das lubris nichts was man in den anderen Events nicht auch hinter her geworfen bekommt![BR][BR]Wieder nur ein Feature um den Leuten die Dias/Geld aus der Tasche zu ziehen.[BR]Meiner Meinung nach sollte es irgendwann mal genug sein, wenn ich mir die Geschäftsberichte von Innogames anschaue frage ich mich echt ob das notwendig ist bei dem Fetten plus oO.[BR][BR]Wenn wenigstens was geboten wird für das Geld aber das ist nur noch Abzocke in meinen Augen.  Selbst für kleinere Spieler........[BR][BR]Natürlich kann das Mod Team vom Forum nichts für die Geschäftspolitik der Amis aber von mir seht ihr keinen Cent für den Versuch.[BR][BR]Wir sind keine Eierlegende Wollmilchsäue die nur zum melken da sind!"}, {"103": "Niemand zwingt Dich, den Pass zu kaufen !"}, {"3": "Ich freu mich drauf.[BR]Allein schon, dass die für mich inzwischen sinnfreien rotierenden Quests durch etwas Neues ersetzt werden, ist den Spaß schon alle Mal wert. [smilie--sprite1][BR]Die Gewinne sind doch auch ohne den Pass besser als die von der alten Questreihe, zumindest das, was im Video zu sehen ist. Und den schicken Phönixbrunnen finde ich zumindest  erstrebenswert."}, {"113": "Ohje, was mach ich jetzt bloß?[BR]Die Ankündigung las sich so verheißungsvoll und dieser Brunnen sieht echt schick aus und ich weiß noch gar nicht wirklich, was da auf mich zu kommt und bin eigentlich mächtig gespannt und freu mich auch irgendwie, darf ich das denn überhaupt, wo das doch alles so schrecklich sein soll?[BR][BR]Tschuldigung, hatte meinen Pawlowschen Reflex grade nicht unter Kontrolle"}, {"4": "Lt Info auf dem Beta Forum wurde der Preis von 2.500 auf 3.000 Dias erhöht.[BR][BR]Ansonsten sind es täglich 4 Quests, die zwar leicht abzuarbeiten sind, aber teilweise mir Dinge abverlangen, die ich sonst nicht tun würde, zumindest nicht zu diesem Zeitpunkt. z.B. die VErwendung von bestimmten Zaubern.[BR][BR]Es gibt dann als tägliche Belohnung z.B. einen 10 oder 15-Min. Zeitbooster, einige Güter bestenfalls. Ich find die täglichen Belohnungen einfach unmöglich.[BR][BR]Es ist für mich notwendig, auf der Beta ständig ein paar MiniManus und MiniWErkis vorzuhalten, um die häufig benötigten 3h, 9h Produktionen bzw. die Biere, einfache Werkzeuge, Brote usw. herzustellen und dafür nicht die normalen Manufakturen herzunehmen."}, {"114": "Dieses Feature ist zwar hier, aber als solches nichts neues. Man kennt es von anderen Spielen [smilie--sprite1] [BR]Für alle die sich jetzt schon aufregen... dieses Feature spielt sich auch fantastisch einfach von alleine. [BR]Nur abholen wenn was fertig ist und gut ;-) Wer so spielt wie immer und Seasons nicht will bekommt trotzdem was *g*[BR]Es gefällt mir definitiv besser als der Kessel"}, {"81": "salandrine schrieb:\t\t\tLt Info auf dem Beta Forum wurde der Preis von 2.500 auf 3.000 Dias erhöht.\t\tZum Vergrößern anklicken....[BR]Ja aktuell wenn man einloggt sind es noch 2500 und es wurde angekündigt im Forum aber ob es wirklich kommt wissen wir noch nicht.[BR]Wie haben sie im Beta schon gewitzelt \"Saisons of Dias\" 20% Preiserhöhung ist halt witzlos.[BR][BR]Zum Feedback:[BR][BR]Wenn es wirklich mit 3000 Dias kommt war das Feedback am Beta sowieso für die Katze und man sieht wie Inno mit Feedback umgeht.[BR]Schönreden und positives Feedback wird natürlich gerne gesehen, aber negativ Feedback oder konstruktives Feedback wird sofort in einem bösen Unterton Kommentiert.[BR][BR]Ist auch lustig das sich Mod's darüber echauffieren das man jetzt schon Feedback gibt obwohl das Feature noch nicht implementiert ist.... warum gibt es dann schon 4 Tage vorher ein Feedback Topic warum gibt es ein Beta Server ?????? Wer im Glashaus sitzt und so....[BR][BR]Nicht desto trotz ist es ein Feature auf das man verzichten kann denn in der Form bietet dem Spieler selbst Kaum einen Mehrwert an.[BR]Es bietet aber die Möglichkeit an viele Dias für \"Random Stuff\" aus zu geben. Der Random Stuff ist nicht mal ansatzweise 2500 (3000) Dias Wert oder selten zu bekommen. Keine Fomo also. (Fear of missing out)[BR][BR]Ich rege mich nicht darüber auf das es einen Season pass gibt, sondern das was dafür geboten wird einfach dem Wert nicht entspricht.[BR][BR]Hier sollen nur neue Spieler die noch kein Wertigkeitsgefühl für \"Random Stuff\"  haben über den Tisch gezogen werden.[BR][BR]Eine Weisheit zum Schluss. Frage keinen Frage deren Antwort du nicht hören willst.[BR][BR]Das Feature läuft halt nebenbei bei den meisten, aber wird weder Spiel prägend oder spielentscheidet in irgendeine Richtung sein. (siehe Turm/Turnier)"}, {"1": "@Sardukar Es soll hier niemand über den Tisch gezogen werden. Solche Aussagen gehören hier nicht hin und werde ich auch nicht mehr dulden! [BR][BR]Bei den Saisons handelt es sich um ein brandneues Feature. Jeder darf dieses demnächst ausgiebig testen und muss dafür keine Diamanten bezahlen. Wer möchte, kann, es geht aber grundsätzlich auch ohne."}, {"103": "... und wer felsenfest der Meinung ist, dass Feedback sowieso nichts bringt,[BR]der kann sich ja gerne auch die Buchstaben sparen..."}, {"81": "littleFlex schrieb:\t\t\t... und wer felsenfest der meinung ist, dass Feedback sowieso nichts bringt, [BR]der kann sich ja gerne auch die Buchstaben sparen...\t\tZum Vergrößern anklicken....[BR]Hat man beim Bibiset gesehen wer sich paar Jahre zurückerinnern konnte.........[BR][BR]Tacheless schrieb:@Sardukar Es soll hier niemand über den Tisch gezogen werden. Solche Aussagen gehören hier nicht hin und werde ich auch nicht mehr dulden!\t\tZum Vergrößern anklicken....[BR]Die Aussage ist grenzwertig das ist schon richtig aber sie widerspiegelt meine Meinung und meine Einschätzung von dem Feature.[BR]Dazu ist ein Feedback Topic da![BR]Lt. den Forenregeln solltet sogar Ihr Meinungen akzeptieren und respektieren![BR][BR]Nur weil das Meine Meinung ist heißt das nicht das dies Allgemeingültigkeit hat![BR][BR]Im Beta Forum stehen ganz andere Sachen als Feedback da ist meine Meinung harmlos dagegen und dort wird das stehen gelassen.[BR][BR]Ein paar Beispiele? [BR][BR]-This company is a joke since Coldfail Phoenix release[BR]-What a joke!!!! Inno became pathetic with its hunger for money[BR][BR]ect ect ect....[BR][BR]So nun was konstruktives:[BR][BR]Bringt doch in den Pass einfach 3-4 Blaupausen + 2 Tomes für Artefakte beliebiger Auswahl und schon würde es für viele Spieler passen.[BR]Nur als Beispiel, aber im aktuellen Stand ist und bleibt es \"ein schlechtes Geschäft\" für Spieler."}, {"115": "Naja, hört sich generell erstmal nicht uninteressant an, aber ich wart mal ab, was genau es da an \"wertvollen Preisen\" gibt. Der Vogel z.B. sieht ja hübsch aus, aber gebrauchen kann ich ihn nicht, da die Produktionen, die er für mein Kapitel ausspuckt, mich nicht interessieren, weil ich in denen bereits jetzt schwimme.[BR][BR]Wenn ich erfolgreich zum Dias ausgeben verführt werden soll, müssten die Preise schon 1A-Qualität haben und/oder für mich maßgeschneiderte Mangelgutproduktionen im großen Stil liefern. Für 0815-Preise ohne besonders attraktive Werte werde ich sicher genau 0 Dias springen lassen und auch dieses Feature dann eher missachten. Denn wenn es schon mit Diasausgabe nichts Überragendes geben sollte, was soll man dann beim Spiel des Features ohne Einsatz von Dias erwarten...[BR][BR]Ganz allgemein aber gesagt: Die stetig und scheints immer schneller werdende Überflutung an nervigen Miteilungen im Spiel (nicht im Forum) über Features, Angebote, Event an Event etc.pp. sorgt bei mir für eine weiter steigende Ermüdung. Hab mich deshalb entschieden, die Forschung Ende meines jetzigen Kapitels einzustellen und mich einzig auf den Turm der Ewigkeit zu konzentrieren. Der ist das einzige Feature, welches mir aktuell noch Spaß macht."}, {"116": "Ich verstehe die Aufregung für den Seasonpass nicht. Wenn man die Belohnungen nicht mag, einfach nicht kaufen. Wenn niemand den kauft, dann wird Inno reagieren. Siehe auch den Turm in den Anfangszeiten. Hat auch niemand gespielt, bis die Belohnungen verbessert wurden.[BR][BR]Achja, wenn die Season noch irgendwelche Gemeinschafts-Quests hätten, wäre das echt super. Die könnten dann ja Vorteilspunkte geben."}, {"117": "Inye schrieb:\t\t\tDieses Feature ist zwar hier, aber als solches nichts neues. Man kennt es von anderen Spielen [smilie--sprite1][BR]Für alle die sich jetzt schon aufregen... dieses Feature spielt sich auch fantastisch einfach von alleine.[BR]Nur abholen wenn was fertig ist und gut ;-) Wer so spielt wie immer und Seasons nicht will bekommt trotzdem was *g*[BR]Es gefällt mir definitiv besser als der Kessel\t\tZum Vergrößern anklicken....dem kann ich mich nur anschließen ,das ist für mich ein nettes Nebenbei und erfordert keine großen Anstrengungen ..Diamanten würde ich allerdings auch nicht dafür investieren"}, {"4": "[IMG]https://i.ibb.co/V93fwQy/https-de-forum-elvenar-com-index-php-attachments-1674508360854-png-33729.png[/IMG][BR][BR]Das sind die täglichen Belohnungen, die es auf der Beta derzeit gibt."}, {"94": "Huhu, zusammen hier kommen wieder meine 5 Cent [smilie--sprite1][BR]Insgesamt finde ich die Season überraschender Weise ziemlich gelungen, erstmal das Layout ist wunderhübsch gestaltet mit dem Baum in Purpur.[BR]Der Premium Pass ist nicht so nach meinem Geschmack, da ist viel zu wenig dabei, was die Kosten decken würde aber das kann jeder selbst entscheiden. Ich finde die Preise, die man so für die Blätter bekommt überwiegend ganz gut und nützlich, nebenbei als Tipp wenn da zwei oder drei Preise übereinander stehen, dann müsst Ihr wählen was Ihr haben wollt, die gehören nicht alle euch.[BR]Ich habe das auf Beta am Anfangs der Season auch geglaubt, gleich zu Beginn die Güter genommen anstatt den Frosch Segen und war direkt schlecht gelaunt [smilie--sprite1][BR][BR]Bissel enttäuscht bin ich von dem Preis am Ende der Season, da hätte ich wirklich etwas spektakuläres erwartet, nach 75 Tagen Quest abarbeiten.[BR]Aber mal sehen, es gibt ja immer die nächste Season, vielleicht ist da irgendwann mal was richtig cooles. [BR][BR]Was Quest angeht, bietet es sich an den eigenen Rhythmus der Stadt etwas an die Season anzupassen, vor allem für Leute die Arbeiten und zB in den Tages Quest paar 3h und paar 9h Produktionen auf den Werkstätten abliefern müssen ohne viel Produktionsverlust zu haben. [BR]Insgesamt sind die Quest einfach, man muss nur Zeit finden sie zu machen aber da kommt man fix rein. Selbst wenn man Haufen Tagesquest sausen lässt, kommt man eh ans Ende weil genug Puffer da ist. [BR]Wer seinen Fortschritt in der Season verfolgen möchte, ob man noch in der Spur ist, iDavis Tool Season Pass calculation."}, {"8": "Ich finde die Seasons sind ein durch und durch positives feature.[BR]Wenn ich mal die Belohnungen von den Schleifenquests nehme... die ja dadurch erstetzt werden...[BR]Dann gibts eine Belohnungssteigerung um 10000% !!![BR]10 und 15 min. Booster bzw. ein paar Gold, Werkzeug WP Segen sind nicht so toll?[BR]Aber es ist zumindest etwas! und das für Aktionen, die man eh tun würde...[BR][BR]Wenn ich das mit 100k Gold in einer Schleifenquest vergleiche...[BR][smilie--sprite8] Bei 160 Mio. Gold im Lager??? Was soll das [smilie--sprite8][BR][BR]Ich finds auch gar nicht schlimm, dass man beim season pass nicht die tollsten Belohnungen bekommt...[BR]Ich stell mir grad vor:[BR][BR]Beim GA gebe es ne 2te Feuerphönix-Platte für die ersten 3 Plätze...[BR]Scheiße! Jetzt müsste ich mich da anstrengen!?!??!?! Wo krieg ich die ganzen Teleporter her???[BR][BR]Och nö! [smilie--sprite9][BR][BR]Genau so seh ich die seasons. Ein nettes geiles Gimmick nebenbei... sieht auch echt schmuck aus... Ist deutlich besser als die Schleifenquests von früher... Aber man muss sich nicht auf Teufel komm raus reinhängen... Man kann auch mal fünfe gerade sein lassen.[BR]Das Turnier bleibt die Königsdiziplin.[BR]Dias spar ich lieber für Eventbelohnungen oder magische Gebäude.[BR][BR]Auch ists ja die erste Season...Der eigtl. BetaTest...Wie kommts an?... Wie weit kann man gehen?...Worauf stehen die Spieler? Was muss verbessert werden? ...wird bestimmt noch dran gebastelt...[BR]Und wer weiß? Vllt werden wir ja in noch kommenden seasons überrascht?[BR]Dort dürften gerne mal ein paar Abenteuer passieren [smilie--sprite2][BR][BR]Bis jetzt schon mal eine deutliche Verbesserung gegenüber früher! Vielen Dank dafür [smilie--sprite1]"}, {"118": "Der Baum und die Gestaltung sind eine 1+ [smilie--sprite1] richtig schönes mystisches Design, ich liebs![BR]Und die Belohnungen zum selbst wählen sind auch mega! Da kommt jeder auf seine Kosten mit dem was er gerade braucht. Sieht toll und vielversprechend aus, freu mich [smilie--sprite2][BR][BR]Frage mich nur was gerade in eurer Entwicklungsabteilung los ist [smilie--sprite10][BR]Habt ihr ein Dutzend Leute mehr eingestellt? Es kommt eine Neuerung nach der anderen, eure Schreibtische möcht ich grad auch nicht haben [smilie--sprite8]"}, {"119": "Nachdem was ich bis jetzt gelesen und gesehen habe, freue ich mich drauf  [smilie--sprite1]"}, {"4": "Aleanca schrieb:\t\t\tDer Baum und die Gestaltung sind eine 1+ [smilie--sprite1] richtig schönes mystisches Design, ich liebs![BR]Und die Belohnungen zum selbst wählen sind auch mega! Da kommt jeder auf seine Kosten mit dem was er gerade braucht. Sieht toll und vielversprechend aus, freu mich [smilie--sprite2][BR][BR]Frage mich nur was gerade in eurer Entwicklungsabteilung los ist [smilie--sprite10][BR]Habt ihr ein Dutzend Leute mehr eingestellt? Es kommt eine Neuerung nach der anderen, eure Schreibtische möcht ich grad auch nicht haben [smilie--sprite8]Zum Vergrößern anklicken....OT[BR]haste nicht bei der Werbung von StepStone gesehen, was auf dem Handy steht? Entwickler für Inno gesucht. [smilie--sprite2][BR][BR]Ich finde es für die kleinen Kapitel schade, dass dort nicht  mehr z.B. die Werkzeuge rüberkommen durch die Quests. Ich weiß noch, dass ich z.B. in Kapitel 4 täglich die Quests durchsucht habe, um für meine Abholung der Stahlproduktion durch die Quests Werkzeuge zu erhalten. Auch in späteren Kapiteln war die Belohnung von 13.000 Werkzeugen Spitze gewesen. [BR][BR]Mit viel Freude und Lust waren die Quests \"Erforsche eine Provinz\", \"spiele 4 Provinzen frei\" \"schließe eine Provinz ab\" immer passend zu finden und gaben dann sofort eine entsprechende Belohung. Auch, wenn ich inzwischen kaum noch Quests gespielt habe, waren sie mir damals doch sehr nützlich.[BR][BR][BR]Und das alles gebe ich hin für einen 10 Min Zeitbooster?[BR][BR]Nicht ausgewogen."}]