[{"17": "schwatzwurzel schrieb:\t\t\tSie werden weiter den slot blockieren , und ich habe in der Woche nur 3 Wochenaufgaben gelöst .[BR]Statt 4 .\t\tZum Vergrößern anklicken....[BR]FCL001 schrieb:\t\t\tDiese Aufgabe ist innerhalb einer Woche nicht zu lösen, wenn man bereits bei den tgl. Aufgaben angekommen ist\t\tZum Vergrößern anklicken....noch mal wöchentliche Aufgabe heißt nicht das die in einer Woche gelöst werden müssen.[BR]es kommen nur jede Woche 4 neue hinzu, löst du inder Woche nur 3 bleibt eine in der Pipeline und wird angezeigt sobald eine weiter gelöst wird.[BR]das einzige was sich nicht ansammelt sind die Tauschversuche, man hat nur 2 pro Woche wenn man die nicht nutzt sind es in der folgenden trotzdem nur 2."}, {"28": "Cailin schrieb:\t\t\tDa klingt dann \"Vorbereitung auf das nächste Kapitel\" einfach wie Hohn.\t\tZum Vergrößern anklicken....Das ist diesem Fall \"nur\" deine persönliche Wahrnehmung! ;-)"}, {"17": "ich finde nicht alle Aufgaben sind gut skaliert aber 80mill Gold in einer Woche für Kapitel 20 ist arg wenig."}, {"147": "Für Kleine sind diese Saisonen eigentlich recht nett; bewältigbar und sinnvolle Preise."}, {"100": "stone2345 schrieb:\t\t\tnoch mal wöchentliche Aufgabe heißt nicht das die in einer Woche gelöst werden müssen.\t\tZum Vergrößern anklicken....[IMG]https://i.ibb.co/Jvwp8vS/https-de-forum-elvenar-com-index-php-attachments-1675364190628-png-33962.png[/IMG][BR]Ich bringe Tages  - und wochenaufgaben schnell durcheinander . [BR]Es wird einigen so gehen . [BR]Das Bild ist aus der Beta  , Season  . [BR]Dort laufen die season schon ein paar wochen länger . [BR]Insgesamt wurden 36  Wochen aufgaben gestellt . [BR]31    hab ich gelöst . [BR]Dann sind 5 noch offen die ich noch lösen kann . [BR]Währung geht   bei den wochenaufgaben natürlich nicht verloren . [BR][BR]Warum lass ich mich von den season stressen [smilie--sprite3] [BR]Nächste Woche ist auch noch zeit . [BR][BR]Mit etwas Tauschglück bekommt man auch so etwas  : [BR][IMG]https://i.ibb.co/mzc5h1C/https-de-forum-elvenar-com-index-php-attachments-1675364587351-png-33963.png[/IMG] Löse ich Aufgabe 2 , ist Aufgabe 1 auch erledigt [smilie--sprite2]"}, {"56": "...wer viel Zeit am PC verbringen kann und möchte ist sicherlich auch gücklich hinsichtlich der \"Saisons\"... (das soll auch so sein) [smilie--sprite1][BR][BR]Für mich sind viele Quests jenseits meiner Spielrealität. Unterhalb 3 Std. werfe ich im Normalfall keine Produktion an.[BR]Nur wenn ich ein Event von Anfang bis Ende spiele (weil ich ein bestimmtes Eventgebäude für eine meiner Städte haben möchte).[BR][BR]Alle Anforderungen (teilweise in größeren Mengen) die momentan kommen - Getränke, Einfache Werkzeuge, Brot sind (für mich) absolut indiskutabel.[BR]Die 2 Tausch-Alternativen sind auch nicht viel besser. Warum sollte ich mich manipulieren lassen und meine \"Goldsegen\" verwenden. Diese ständige \"Goldabschöpfung\" von INNO hat inzwischen irgendwie ein \"Geschmäckle\".[BR][BR]Außerdem, wenn ich spiele (außer bei wirklich interessanten Events) will ich nichts, was mit zusätzlicher Arbeit (zu meiner, für mich normalen Spielweise) verbunden ist. Wenn ich \"arbeiten\" möchte, dann habe ich bereits eine lukrative Alternative...[smilie--sprite2][smilie--sprite6]"}, {"128": "schwatzwurzel schrieb:Anhang 33963 ansehen Löse ich Aufgabe 2 , ist Aufgabe 1 auch erledigt [smilie--sprite2]Zum Vergrößern anklicken....[BR]Das ist leider falsch!"}, {"4": "Thebigunknown schrieb:\t\t\tWenn dir diese Wochenaufgabe am Herzen liegt, würde ich dir wie auch @alf2021 schon \"angedeutet\" hatte dazu raten 2x 5%-Portalgewinne im Nirvana (wie du es genannt hast) zu versenken. (Also NICHT entzaubern, sondern normal einsetzen)  Auch wenn es weh tut und in deiner Spielsituation eventuell gerade keinen \"Portalgewinn\" an sich einbringt, anschließend ist die Aufgabe erledigt! ;-)\t\tZum Vergrößern anklicken....(Hervorhebung durch mich)[BR][BR]Würde ich ja gerne tun, aber ich bin Kap. 20 und mit allen Forschungen durch. Habe natürlich auch kein Portal mehr stehen und entzaubern geht nicht, probiert. [BR][BR]Was also ist hier die Lösung?"}, {"28": "salandrine schrieb:\t\t\tWas also ist hier die Lösung?\t\tZum Vergrößern anklicken....Ein Portal deiner Wahl zu bauen um die Portalgewinne einsetzen zu können. ;-)"}, {"4": "Thebigunknown schrieb:\t\t\tEin Portal deiner Wahl zu bauen um die Portalgewinne einsetzen zu können. ;-)\t\tZum Vergrößern anklicken....Ist mir schon klar, dass das eine Lösungsmöglichkeit wäre.[BR][BR]Nur hab ich keinen Bock darauf, ab jetzt für immer ein Zwergenportal in meiner Stadt stehen zu haben, denn ich weiß ja absolut nicht, wann eine solche Aufgabe wiederkommt. [BR][BR]Das kann es irgendwie nicht sein. Hier muss eine Abfrage her, ob diese Aufgabe momentan lösbar ist oder nicht."}, {"100": "salandrine schrieb:\t\t\tNur hab ich keinen Bock darauf, ab jetzt für immer ein Zwergenportal in meiner Stadt stehen zu haben,\t\tZum Vergrößern anklicken....Ich hab die Portalos ohne  Portal eingesetzt  .   Für die Questerfüllung war das ausreichend .[BR]Es kann natürlich am ende von Kapitel 20 anders sein . [BR][BR]@alf2021        stimmt ,  das wird nicht funktionieren  .  Aber irgendwann löst die sich von selbst auf"}, {"28": "salandrine schrieb:\t\t\tDas kann es irgendwie nicht sein. Hier muss eine Abfrage her, ob diese Aufgabe momentan lösbar ist oder nicht.\t\tZum Vergrößern anklicken....Deswegen kann man die wöchentlichen Quests austauschen."}, {"81": "salandrine schrieb:\t\t\tIst mir schon klar, dass das eine Lösungsmöglichkeit wäre.[BR][BR]Nur hab ich keinen Bock darauf, ab jetzt für immer ein Zwergenportal in meiner Stadt stehen zu haben, denn ich weiß ja absolut nicht, wann eine solche Aufgabe wiederkommt.[BR][BR]Das kann es irgendwie nicht sein. Hier muss eine Abfrage her, ob diese Aufgabe momentan lösbar ist oder nicht.\t\tZum Vergrößern anklicken....[BR]Also wenn du Kapitel 20 bist wird das mit dem Zwergenportal nicht so wirklich klappen.[BR][BR]Ging damals schon nicht als man Forschungen nachholen wollte die Gastrasengüter gebraucht hatten.[BR]Kann mir nicht vorstellen das Inno das mittlerweile geändert hätte.[BR]Hilft nur ein Portal von dem aktuellen Kapitel.[BR][BR]Das die Quests halt teilweise nichts mit der täglichen Spielweise der Spieler zu tun haben aber so verkauft werden kostet mich jedes mal ein Schmunzeln.[BR][BR]Bei der täglichen Quest \"sammle erleuchtet Güter\" sollte eher erhalte stehen den die Quest kann man stupide mit dem Händler abschließen.[BR]Kein normaler Mensch hat die Manus dafür noch stehen wenn er in Kapitel 20 durch ist, genauso wenig wie ein Portal da noch stehen würde.[BR][BR]Immerhin verlangen die meisten Quest Lines der Hauptquest das abreißen des Portals......[BR][BR]Da hätte man mehr mit Hirn arbeiten können und eine einfach Abfrage einbauen können..."}, {"143": "Also ich bin mit Kapitel 20 durch und habe auch kein Portal mehr. Mit Einsatz der 5% Portalsegen war die Quest erledigt - nicht besonders sinnvoll aber erledigt…"}, {"1": "Sardukar schrieb:\t\t\tDas die Quests halt teilweise nichts mit der täglichen Spielweise der Spieler zu tun haben aber so verkauft werden kostet mich jedes mal ein Schmunzeln.\t\tZum Vergrößern anklicken....Es sind viele verschiedene Quests da es viele verschiedene Spieler gibt. Nicht jeder Spieler spielt so wie du.[BR]Sardukar schrieb:\t\t\tBei der täglichen Quest \"sammle erleuchtet Güter\" sollte eher erhalte stehen den die Quest kann man stupide mit dem Händler abschließen.[BR]Kein normaler Mensch hat die Manus dafür noch stehen wenn er in Kapitel 20 durch ist, genauso wenig wie ein Portal da noch stehen würde.\t\tZum Vergrößern anklicken....Auch hier: Nicht jeder spielt wie du. Ich reiße meine Gebäude nicht ab oder lagere sie im Inventar. Im Gegenteil, ich produziere damit weiterhin Güter um damit auf dem Markt zu handeln. Soll ja schließlich Spieler geben, die solche Güter noch brauchen. Und ich würde mich als völlig normalen Menschen bezeichnen.[BR]Sardukar schrieb:\t\t\tDa hätte man mehr mit Hirn arbeiten können und eine einfach Abfrage einbauen können...\t\tZum Vergrößern anklicken....Finde es immer schade, dass man gleich unter die Gürtellinie gehen muss. Ich bin sicher, dass du das auch so formulieren kannst, ohne jemanden anzugreifen. [smilie--sprite1]"}, {"81": "Tacheless schrieb:\t\t\tEs sind viele verschiedene Quests da es viele verschiedene Spieler gibt. Nicht jeder Spieler spielt so wie du.\t\tZum Vergrößern anklicken....[BR]Dann bitte ich dich meinen Satz nochmal zu lesen. [BR]Ich habe von den Spielern (Mehrzahl) gesprochen nicht von mir als Individuum. [BR]Bitte das auch respektieren und registrieren.[BR][BR]Dieses pseudo Totschlagargument lass ich nicht zählen da es kein Argument ist ist.[BR]Zeige mir lieber Spieler die genau so spielen wie Inno das sich vorstellt.[BR][BR]Anmerkung: Wie war das mit den Bibisets die Spieler die mehr als ein Set gestellt hatten sind an der Misere schuld?[BR]Es war von Inno nicht vorgesehen so zu spielen, sorry das war der Fail von Inno nicht von den Spielern.[BR][BR]Ich kritisiere hier nicht nur das Quest designt sondern auch das \"verkaufen\" hier im Forum....[BR]Nach den Vorstellung von Inno sollen Spieler folgendes täglich machen: (Beispiel)[BR][BR]5 Minuten Werki's[BR]15 Minuten Werki's[BR]3h Werki's[BR]9h Werkis[BR][BR]Die Produktionen werden die meisten Spieler die einen Job nachgehen sicherlich nicht machen wenn sie durch die Quests nicht dazu animiert werden würden. 9h und 3h sind hier eher der Standard 5 und 15 Minuten kommen im Standard Spielbetrieb vor den Season kaum bis gar nicht vor. Aussagen von mehr als 100 Spielern...nur nebenbei erwähnt[BR][BR]Aber es ist einfach etwas in den Raum zu werfen wenn man keine Statistiken oder Zahlen veröffentlicht um das in den Raum geworfene zu untermauern. Wie soll man also einen so intransparenten System irgendetwas glauben?[BR][BR]Ich gebe Feedback das die Behauptung \"Nonsene ist\" und das darf ich und das ist Meine Meinung respektiere sie auch wenn sie dir nicht passt.[BR]Frage keine Frage deren Antwort du nicht hören möchtest.[BR][BR]Da es aber um Feedback geht und das ist mein Feedback das die Quests nicht dem täglichen spielen der Spieler entspricht so wie es von Euch angepriesen wird. Das Feedback setzt sich jetzt aus persönlich sprich subjektiven Erfahrungen zusammen aber auch die Erfahrung von mehreren Gemeinschaften wie sie mit den Quests umgehen. Und da bin ich leider nicht alleine ich bin weder eine Gemeinschaft noch mehrere Gemeinschaften.[BR][BR]Natürlich kannst du wie schon versucht das Feedback  als nicht richtig darstellen aber es ist wie es ist.[BR]`[BR]Tacheless schrieb:\t\t\tAuch hier: Nicht jeder spielt wie du. Ich reiße meine Gebäude nicht ab oder lagere sie im Inventar. Im Gegenteil, ich produziere damit weiterhin Güter um damit auf dem Markt zu handeln. Soll ja schließlich Spieler geben, die solche Güter noch brauchen. Und ich würde mich als völlig normalen Menschen bezeichnen.\t\tZum Vergrößern anklicken....[BR]Also argumentierst du das man nicht der Hauptquestlinie die von Inno vorgegeben ist (Portal verkaufen/abreißen) folgen soll und das die meisten Spieler das nicht machen? Ich weis nicht aber hörst du schon den Widerspruch?[BR]Jeder Spieler der die Möglichkeit hat macht das weil er die Dias will schlicht und ergreifend und du willst mir was anderes erzählen?[BR][BR]Deine Unterstellung ist hier schlichtweg falsch. [BR]Ich hab auch die Manus stehen und produziere für die Gemeinschaft nicht für mich.[BR]Wer oder was \"normal\" ist steht mir nicht zu das zu beurteilen. [BR]Selbstreflexion und Selbsteinschätzung sind wohl seltene Attribute geworden.[BR][BR]Einen Spielstil kann man beurteilen und das es immer bessere oder schlechtere gibt, ist würd ich sagen der Standard.[BR]Hier ist auch wider zu bemerken das du in deiner Argumentation Spielstil = Spieler setzt. [BR]Bemängelt man einen Spielstil bemängelt man den Menschen? [BR]Was für eine Unterstellung schon fast beleidigend.[BR][BR]Tacheless schrieb:\t\t\tFinde es immer schade, dass man gleich unter die Gürtellinie gehen muss. Ich bin sicher, dass du das auch so formulieren kannst, ohne jemanden anzugreifen. [smilie--sprite1]Zum Vergrößern anklicken....Ich finde es immer schade das wenn einem Argumente ausgehen du mit der Opferrolle kommst.[BR]Hier wurde niemand angegriffen also zieht das sprichwörtlich nicht. [BR]Wenn sich wer angegriffen fühlt tut mir das leid weil das nicht meine Intention war.[BR]Wenn sich jemand so fühlt heißt das nicht das es auch so ist. Diese Unterscheidung ist wichtig![BR]Wenn Wahrheit weh tut dann ist es meist die Wahrheit [smilie--sprite2][BR][BR]In diesem Sinne mein Feedback"}, {"2": "Sardukar schrieb:\t\t\tDie Produktionen werden die meisten Spieler die einen Job nachgehen sicherlich nicht machen wenn sie durch die Quests nicht dazu animiert werden würden. 9h und 3h sind hier eher der Standard 5 und 15 Minuten kommen im Standard Spielbetrieb vor den Season kaum bis gar nicht vor. Aussagen von mehr als 100 Spielern...nur nebenbei erwähnt\t\tZum Vergrößern anklicken........es ist auch wirklich sehr viel von den \"arbeitenden Spielern\" verlangt, wenn sie dann abends - nach der Arbeit - wenigstens mal 30 Minuten im Spiel verbringen \"müssen\"...wie spielen die denn die normalen Events?..."}, {"1": "@Sardukar Du hattest geschrieben, dass kein normaler Mensch Manufakturen für erleuchtete Güter stehen hat, wenn er mit dem Kapitel fertig ist, darauf bezog ich mich, nicht auf das Portal. Und dem habe ich dir widersprochen.[BR][BR]Und nein, natürlich ist nicht jede Aufgabe mit einmal 1 Minute im Spiel einloggen, über alles drüberwischen und wieder ausloggen getan. Natürlich gibt es auch bei den täglichen Quests Aufgaben, die mal etwas mehr fordern. [BR][BR]Anstatt alles schlecht zu reden, gib doch mal konstruktiv an, was für Quests du dir so vorstellen könntest? Wobei ich dir jetzt schon sagen kann, dass es sich bei jeder Quest irgendwen finden lässt, zu dessen Spielstil diese nicht passt.[BR][BR]Ich persönlich finde, die täglichen Quests sind wirklich sehr leicht zu lösen, ohne irgendwelche anderen Dinge nutzen zu müssen. Und selbst die wöchentlichen Quests sind doch recht einfach zu lösen. Ja, auch nicht innerhalb von einer Minute immer, aber innerhalb einer Woche bestimmt!"}, {"141": "Sardukar schrieb:\t\t\tBei der täglichen Quest \"sammle erleuchtet Güter\" sollte eher erhalte stehen den die Quest kann man stupide mit dem Händler abschließen.\t\tZum Vergrößern anklicken....hm, wäre ja schön, aber bei dem Händler finde ich keine Erleuchteten Güter - oder bin ich mal wieder blind?[BR][BR]Ich habe leider nicht wie Tacheless oder Du[BR]Tacheless schrieb:\t\t\tNicht jeder spielt wie du. Ich reiße meine Gebäude nicht ab oder lagere sie im Inventar. Im Gegenteil, ich produziere damit weiterhin Güter um damit auf dem Markt zu handeln. Soll ja schließlich Spieler geben, die solche Güter noch brauchen. Und ich würde mich als völlig normalen Menschen bezeichnen.\t\tZum Vergrößern anklicken....[BR]Sardukar schrieb:\t\t\tIch hab auch die Manus stehen und produziere für die Gemeinschaft nicht für mich.\t\tZum Vergrößern anklicken....die für mich total nutzlosen Manus für Erleuchtete Güter mehr in der Stadt stehen, was ich im übrigen als normal bezeichnen würde [smilie--sprite2]"}, {"148": "An sich finde ich die Seasons ganz nett, da die Belohnungen grösstenteils besser sind als bei den Schleifenquests, aber auch mich stören viele Aufgaben in meinem Spielfluß.Bei mir laufen über Nacht die 9 Stunden-Produktionen, dann starte ich 3 Stunden,  in der Mittagspause wieder 3 Stunden, manchmal klappt es nach Feierabend nochmal eine 3er zu starten. Klar kann ich stattdessen auch 8 Brote produzieren,  hab dann aber weniger Werkzeuge, da ich trotzdem erst mittags oder abends wieder ins Spiel kann.[BR]Darum sehen meine Städte inzwischen nach Dauer-GA aus. Für alle diese Aufgaben habe ich Mini-Werkis und Manus, bei denen mir die Sinnlos-Aufgaben nicht wehtun. Allerdings wäre es mir lieber, wenn das nicht nötig wäre"}]