[{"4": "schwatzwurzel schrieb:\t\t\tIch hab die Portalos ohne  Portal eingesetzt  .   Für die Questerfüllung war das ausreichend .[BR]Es kann natürlich am ende von Kapitel 20 anders sein .[BR][BR]...\t\tZum Vergrößern anklicken....Danke @schwatzwurzel.[BR][BR]Hat funktioniert. Ich bin gar nicht auf die Idee gekommen, dass nach Portalabriss (viel zu groß, um es stehen zu lassen) ich noch nichts mehr bringende Portalos einlösen kann.[BR][BR]Denn, wenn ich in ein Kapitel starte und das Portal noch nicht steht, kann ich eben auch nicht Portalos einlösen. Deshalb hatte ich nicht um die Ecke gedacht. Für mich war = kein Portal = keine Einlösung.[BR][BR]Danke für den Hinweis."}, {"48": "alf2021 schrieb:\t\t\tSo ein 5% Portalo ist schon wahnsinnig wichtig und wertvoll.[BR]Konntest du die Aufgabe nicht tauschen? [smilie--sprite6]Zum Vergrößern anklicken....Es ist völlig unerheblich, ob die hier geforderten Portalos oder zum Beispiel 3 Futterbeutel gefordert werden. Diese Aufgaben sind bei vielen Verschwendung. Und nicht jeder hat alles im Überfluss um es zu Verschwenden.[BR]Ich habe zwar ca. 150 Futtersäcke, benötige aber nur höchstens einen pro Woche für den Feuervogel. Warum soll ich also 3 verwenden? Das ist  für mich leistbar, aber völlig arschlos. Für andere ist es nicht leistbar.[BR]Finde deinen Post daher etwas überheblich.[BR]Wenn Tauschen weg ist. Ist es weg."}, {"119": "@Tacheless : Frage zum Preispass[BR]Wenn man die 3000 Dias für den Preispass ausgibt, sind dann alle Gebäude bis zur letzten Seite sofort freigeschaltet ?[BR]Oder muss man dann trotzdem erstmal die ganzen Punkte zusammensammeln , um weiter zu kommen ?"}, {"2": "Primus71 schrieb:@Tacheless : Frage zum Preispass[BR]Wenn man die 3000 Dias für den Preispass ausgibt, sind dann alle Gebäude bis zur letzten Seite sofort freigeschaltet ?[BR]Oder muss man dann trotzdem erstmal die ganzen Punkte zusammensammeln , um weiter zu kommen ?\t\tZum Vergrößern anklicken.......nein - du musst trotzdem brav deine Blütenblätter sammeln - bekommst aber 150 hinzu..."}, {"149": "Habe bei meinen Kleinen f-jo heute die Tagesquest sammle 1 Zaubergegenstand.[BR]Unter dem Info-Zeichen Ist folgendes eingepflegt[BR]\"Verzauberungen die für deinen Vortschritt Zählen: magische Mitgift, Vertzauberte Vorräte,, fabelhafte Fabrikation, inspirierende Meditation, Tierfutter und Gebäude teleportieren.[BR]Verzauberungen können durch NBH bie Turnieren Und in der magischen AKA gewonnen werden.[BR]Turm- und Handwerksbelohnungen zählen nicht zum Fortschritt dieser Quest.\"[BR][BR]Sorry aber da stehe ich irgendwie auf dem Schlauch. Turnier findet bekanntlich Sonntags nicht statt, fällt also als Möglichkeit die Quest zu erfüllen aus. [BR]Bei der NBH gibt es genau zusätzlich 3 Kisten. Da war keine Verzauberung drin. Also Pesch gehabt.[BR]Bleibt noch die magische AKA. Hier kann ich grüne Bällchen produzieren, Verzauberungen auslösen (nicht sammeln), den Hexenkessel brauen und das Handwerk ausüben. Ob es überhaupt eine Möglichkeit gibt über den Hexenkessel eine Verzauberung zu erhalten weis ich nicht sicher. Ich glaube aber nicht.[BR]Und das einzige wo ich -wenn auch hier nur mit Glück- ein entsprechendes Rezept bekommen und \"produzieren\" kann, das Handwerk ist ausgenommen.[BR][BR]Ich bin etwas ratlos. Aber vieleicht übersehe ich ja noch eine Lösung. Da wäre ich dann für einen Hinweis dankbar.[BR]Wie gesagt es ist ein Tagesquest, kein wöchentlicher. Ein Tausch ist also nicht möglich.[BR][BR]Im Moment fühle ich wirklich etwas verar....."}, {"2": "franjo55 schrieb:\t\t\tHabe bei meinen Kleinen f-jo heute die Tagesquest sammle 1 Zaubergegenstand.[BR]Unter dem Info-Zeichen Ist folgendes eingepflegt[BR]\"Verzauberungen die für deinen Vortschritt Zählen: magische Mitgift, Vertzauberte Vorräte,, fabelhafte Fabrikation, inspirierende Meditation, Tierfutter und Gebäude teleportieren.[BR]Verzauberungen können durch NBH bie Turnieren Und in der magischen AKA gewonnen werden.[BR]Turm- und Handwerksbelohnungen zählen nicht zum Fortschritt dieser Quest.\"[BR][BR]Sorry aber da stehe ich irgendwie auf dem Schlauch. Turnier findet bekanntlich Sonntags nicht statt, fällt also als Möglichkeit die Quest zu erfüllen aus.[BR]Bei der NBH gibt es genau zusätzlich 3 Kisten. Da war keine Verzauberung drin. Also Pesch gehabt.[BR]Bleibt noch die magische AKA. Hier kann ich grüne Bällchen produzieren, Verzauberungen auslösen (nicht sammeln), den Hexenkessel brauen und das Handwerk ausüben. Ob es überhaupt eine Möglichkeit gibt über den Hexenkessel eine Verzauberung zu erhalten weis ich nicht sicher. Ich glaube aber nicht.[BR]Und das einzige wo ich -wenn auch hier nur mit Glück- ein entsprechendes Rezept bekommen und \"produzieren\" kann, das Handwerk ist ausgenommen.[BR][BR]Ich bin etwas ratlos. Aber vieleicht übersehe ich ja noch eine Lösung. Da wäre ich dann für einen Hinweis dankbar.[BR]Wie gesagt es ist ein Tagesquest, kein wöchentlicher. Ein Tausch ist also nicht möglich.[BR][BR]Im Moment fühle ich wirklich etwas verar.....\t\tZum Vergrößern anklicken....???... du kannst doch in der magischen Akademie nicht nur die Kombis herstellen, sondern auch Magische Mitgiften, Verzauberte Vorräte, Fabelhafte Fabrikationen und die Inspirierende Meditation..."}, {"149": "Stimmt @Romilly , da ich dort eigentlich immer nur Kombiauslöser herstelle, hatte ich da gar nicht mehr auf dem Schirm.[BR]Hatte aber ja auch das Gefühl das ich irgendwas übersehe.[BR]Danke dir"}, {"149": "Tja, und jetzt habe ich 2 x verzauberte Vorräte hergestellt und dafür 2 x 8 std.-Booster verbraucht.[BR]Ergebnis: beide wurden nicht gezählt. Der Quest ist immer noch offen."}, {"2": "franjo55 schrieb:\t\t\tTja, und jetzt habe ich 2 x verzauberte Vorräte hergestellt und dafür 2 x 8 std.-Booster verbraucht.[BR]Ergebnis: beide wurden nicht gezählt. Der Quest ist immer noch offen.\t\tZum Vergrößern anklicken.......mach einen Screenshot und melde dich beim Support - die können kucken, was du gerade gemacht hast und welche Quest du da hast..."}, {"149": "Aber wie oben schon steht heißt es \"gewonnen werden\".[BR]Vermutlich zählt auch diese Lösung deshalb nicht.[BR]Dann würde meines Erachtens aber auch das Handwerk (wenn es nicht ausgenommen wäre) nicht zählen, da ja auch hier produziert und nicht gewonnen wird.[BR][BR]Für einen Screenshot bin ich zu blöde."}, {"103": "blöd gefragt: hast die Vorratszauber nur gebaut oder hast sie danach auch eingesammelt?"}, {"126": "franjo55 schrieb:\t\t\t\"Verzauberungen die für deinen Vortschritt Zählen: magische Mitgift, Vertzauberte Vorräte,, fabelhafte Fabrikation, inspirierende Meditation, Tierfutter und Gebäude teleportieren.[BR]Verzauberungen können durch NBH bie Turnieren Und in der magischen AKA gewonnen werden.[BR]Turm- und Handwerksbelohnungen zählen nicht zum Fortschritt dieser Quest.\"\t\tZum Vergrößern anklicken....[BR]Wenn Turmbelohnungen nicht zählen, dann fällt \"Gebäudeteleporter\" doch komplett raus? Die würde man ja nur im Turm bekommen können."}, {"149": "@littleFlex natürlich habe ich die \"eingesammelt\". Das geht nach Abschluß der Produktionszeit automatisch. Der entsprechende zeitlich abgelaufene Slot wird dort herausgenommen und das Produzierte dem Inventar zugeführt.[BR]Ich hatte in der AKA die kompletten 5 Slots mit den Kombiauslösern abgeschlossen und dann den VV-Zauber in Auftrag gegeben. Die Produktionszeit dauert 8 std., die ich dann mit einem Booster sofort auf Null gestellt habe. Die Produktion ist dann abgeschlossen. Der Slot wird automatisch geleert und der produzierte Zauber dem Inventar zugeführt. Wo soll ich da noch was einsammeln? [BR]Um sicher zu gehen habe ich das Ganze dann noch einmal gemacht. Beide Male wurde der der Quest nicht abgeschlossen."}, {"2": "franjo55 schrieb:\t\t\tDas geht nach Abschluß der Produktionszeit automatisch. Der entsprechende zeitlich abgelaufene Slot wird dort herausgenommen und das Produzierte dem Inventar zugeführt.\t\tZum Vergrößern anklicken.......nein - du musst die Aka nochmal anklicken, um die Zauber abzuholen...also das Gebäude in deiner Stadt - nicht über das Menü/übers Handwerk reingehen..."}, {"150": "Souliena schrieb:\t\t\tWenn Turmbelohnungen nicht zählen, dann fällt \"Gebäudeteleporter\" doch komplett raus?\t\tZum Vergrößern anklicken....Nach meinem Wissensstand zählen im Turm die Begegnungsbelohnungen (falls man Glück hat)[BR]Die Turm Abschlussbelohnungen (Freitagabend in einer Gemeinschaft) zählt nicht mit"}, {"149": "Ok, jetzt hat er es genommen. Da hatte ich wohl irgendwo noch einen kleinen Aussetzer."}, {"128": "Mit solchen Totalausfällen schlage ich mich täglich rum... [smilie--sprite6]"}, {"30": "Nachdem die Seasons nun einige Zeit laufen und ich beim Lesen hier recht platt war, ob der vielen negativen Meldungen, muss ich jetzt doch ein Feedback abgeben.[BR][BR][BR]Da mein Partner und ich immer verschiedene Quests (egal, ob bei den täglichen oder wöchtentlichen Quests) haben, ist es eigentlich unsinnig, sich über einzene - für das eigene Spiel unsinnige - Quests aufzuregen.[BR]Ich fand den Einsatz von 10x Fabelhafter Produktion als Wochenquest am Ende des 20. Kapitels auch nicht toll (hab ich weggeklickt und bekam glücklich 50x NBH [smilie--sprite1] ).[BR]Die meisten meiner bisherigen Quests erledigen sich einfach von selbst - ohne grossen Aufwand. Vielleicht lande ich noch bei einem Hänger, aber nach meiner Rechnung sollte die „Belohnungslinie“ auch mit ein paar fehlenden Quests bis zum Punkt 50 während der Gesamtdauer erreichbar sein. Also braucht man sich nicht für 5 Punkte bei den täglichen Quests so massiv reinhängen. Man kann den einen oder anderen auch mal \"links\" liegen lassen.[BR][BR]Ich betrachte die Seasons nicht als Event, welches ich erfüllen muss (aber durchaus gerne möchte). Im Vergleich zu den Schleifenquests, welche bei mir schon seit ewigen Kapiteln eventuell mal durch Zufall erledigt wurden, aber ansonsten nicht mehr berücksichtigt wurden, ist diese neue Variante durchaus wieder reizvoller.[BR][BR]Und genau das sollten die Seasons ja sein: Ersatz für die Schleifenquests. [BR][BR]Und auch da gab es den Quest: 10 Biere und 2 Brote... Ja, man konnte ihn wegklicken, ebenso wie Ausbauten, wenn man alle Manus, Wohnhäuser und Werkstätten bereits auf höchstem Level hatte. Und wenn hier im Feedback Spieler darauf hinweisen, das kleinere Spieler auf die Münzen/Werkzeuge gerade zu Anfang auf die Schleifenquests zurückgreifen mussten: Habe ich anfangs auch getan. Allerdings hatte ich in meinen Anfangszeiten auch keine Münz- und Vorratssegen, Zeitbooster, Teleporter, Eventgebäude, welche auch Güter produzieren, von denen ich derzeit keine Manus in der Stadt stehen habe usw. Ich gehe davon aus, das die Quests auch den entsprechenden Kapiteln angepasst wurden - es gibt hier so wenig Rückmeldung von Spielern aus kleinen Kapiteln. [BR][BR]Die Sammelquests haben sich bisher immer im Laufe des Tages erledigt und meine Produktionen laufen auch „normal“ (9/3/3/3) bzw. bei Abwesenheit (Arbeit) 9/9/3).[BR]Ich habe zwar aus Faulheit auch noch Mini Werkstätten und Manus vom GA noch nicht entsorgt, was die Sache erleichtert, sehe aber auch ohne diese kaum Probleme. Denn dann hätte ich den Platz für mehr grosse Manus/Werkstätten. In vielen „grossen“ Städten stehen oft mehr als 10 Wohngebäude, Werkstätten (zumeist Magische) und Manus in voller Ausbaustufe. Ich habe seit Ewigkeiten keine Wohngebäude mehr und arbeite mit maximal 2 ausgebauten Werkstätten. Eigentlich müsste ich es nach den Schilderungen hier deutlich schwerer haben. [BR][BR]Für mich ist das Spiel doch gerade dann reizvoll, wenn ich nicht nur 30 Minuten zum Abräumen, NBH geben, kurz noch Turm/Turnier reinschaue. Das ist doch auf die Dauer voll langweilig.[BR][BR]Ob die „Belohnungen“ anders gestaltet werden sollten, liegt auch im Auge des jeweiligen Spielers. Persönlich finde ich auch die nicht so tollen Gewinne besser als Münzen und Werkzeuge aus den Schleifenquests. (Der Händler wird ohnehin durch mich schon viel zu reich...)[BR][BR]Negativ finde ich lediglich, das es an den Punkten für die „Dia Gewinnoption“ keine Alternative für lau gibt. So wie bei den Event Meilensteinen. Schliesslich erreicht der Spieler den Streckenpunkt ja auch - hat er dann nicht wenigstens eine kleine Belohnung verdient?[BR][BR]Spannend finde ich im Zusammenhang mit den Quests, das bei der Questline für die Events um mehr Varianten/Abwechslung gebeten wird und sich bei den Seasons so viele andere Möglichkeiten aufzeigen. Es gäbe also noch Möglichkeiten, die Eventquests abwechslungsreicher zu gestalten [smilie--sprite1]"}, {"151": "mal mein Feedback:[BR]ich hab keine Schleife mehr, aber dafür anderen Zeitvertreib... ist sehr ungewohnt, weil ich über Jahre hinweg auf die Schleife hin konditioniert wurde. An dieses elendige Geklicke habe ich mich irgendwie gewöhnt, jetzt muss ich umlernen [smilie--sprite10] [BR]es ist anders... die Belohnungen sind ähnlich sinnfrei, aber man hat wenigstens die Chance irgendwas brauchbareres als bei der Schleife rauszubekommen... und ja, ich bin auch der Meinung das der Pass sinnfrei ist, aber das ist jedem selbst überlassen, mir ist es das nicht wert.[BR][BR]kann man jetzt davon ausgehen das die Schleife nicht wieder kommt, oder erst am Ende der Forschung? Dann kann ich meine Stadt umbauen. [smilie--sprite1]"}, {"2": "Noctem schrieb:\t\t\tkann man jetzt davon ausgehen das die Schleife nicht wieder kommt, oder erst am Ende der Forschung? Dann kann ich meine Stadt umbauen. [smilie--sprite1]Zum Vergrößern anklicken.......ich hab keine Schleife mehr - aktuell nur 2 Questgeber - Saison + (gesperrte) Eventquest..."}]