[{"151": "Romilly schrieb:\t\t\t...ich hab keine Schleife mehr - aktuell nur 2 Questgeber - Saison + (gesperrte) Eventquest...\t\tZum Vergrößern anklicken....hähä... dann haben sie ihre vor Jahren gemachte Ankündigung zum Ende der Schleife war gemacht... hat nur etwas gedauert [smilie--sprite8] also typisch Inno"}, {"14": "irgendwann ist die Season ja zu Ende, kommt dann keine neue Schleife?..oder direkt eine neue Season?"}, {"113": "Ich gehe davon aus, dass es gleich weiter geht. [BR] Das Teil heißt doch \"Jahreszeiten\" und da gips ja bekanntermaßen 4 von, die auch noch nahtlos ineinander übergehen - Ist jetzt so meine Überlegung ..."}, {"48": "Habe auf beta die Wochenaufgabe:[BR]\"Nutze 3 Futtersäcke.\"[BR]erhalten. Wenn es hoch kommt, nutze ich in 3 Wochen 3 dieser Säcke, wenn ich nicht wegen Quests gezwungen werde, mehr davon zu nutzen. Ich habe also schweren Herzens 3 Säcke in meinen Feuervogel geschmissen.[BR]Nun ergab es sich, dass ich auf beta später in die Saison eingestiegen bin. Darum weiß ich dass sich nicht erfüllte Wochenaufgaben ansammeln. Dieses führte leider dadurch, dass ich diese Aufgabe erfüllt hatte dazu, dass ich die gleiche Aufgabe im Anschluss sofort wieder erhielt.[BR]Das fand ich wirklich zum Zähneknirschen und erfüllte diese Aufgabe daher nicht wieder. Ich werde diese Aufgabe bis zum Ende der Saison, oder bis ich die nächsten 3 Futtersäcke regulär verwendet habe, nicht lösen.[BR]Diese Aufgabe ist also in Warteposition.[BR]Das ist aber kein Problem für mich, weil ich trotzdem in der Woche 4 neue Aufgaben löse. Die vierte neue Wochenaufgabe erhalte ich sofort, wenn ich die Erste der drei Anderen gelöst habe.[BR]Ist vielleicht ein Weg auch für andere Spieler, die Saisonaufgaben haben, die sie nicht zu oft lösen woĺlen."}, {"100": "[IMG]https://i.ibb.co/3kFFYYy/https-de-forum-elvenar-com-index-php-attachments-1675760470600-png-34014.png[/IMG][BR]Man kann Wochenaufgaben tauschen .   [BR]Die  einem unbequeme  Wochenaufgabe wird ersetzt durch eine Aufgabe die einem  noch unbequemer querliegt . [BR]Oder besser gefällt .  [smilie--sprite1] [BR]Dann ist der Slot  Futteraufgabe schneller wieder frei , und braucht keine  3 wochen ."}, {"4": "schwatzwurzel schrieb:Anhang 34014 ansehen[BR]Man kann Wochenaufgaben tauschen .  [BR]Die  einem unbequeme  Wochenaufgabe wird ersetzt durch eine Aufgabe die einem  noch unbequemer querliegt .[BR]Oder besser gefällt .  [smilie--sprite1][BR]Dann ist der Slot  Futteraufgabe schneller wieder frei , und braucht keine  3 wochen .\t\tZum Vergrößern anklicken....... wird ersetzt durch eine Aufgabe die einem  noch unbequemer querliegt [BR][BR]Das ist zumindest bisher meine Erfahrung gewesen. Dann lieber doch die 100 Getränke prodden irgendwie, als diese Tierfutteraufgabe zu kriegen."}, {"98": "Thebigunknown schrieb:\t\t\tDas ist diesem Fall \"nur\" deine persönliche Wahrnehmung! ;-)\t\tZum Vergrößern anklicken....Das ist sooo typisch![BR]Erst macht ihr einen Feedbackthread. [BR]Dann gibt es Feedback, das euch nicht passt, aber einfach der Wahrheit entspricht.[BR]Also sprecht ihr den Spielern die Berechtigung ihres Feedbacks ab. [BR]Am Ende wundert ihr euch, dass nur noch eine Handvoll Hartgesottene überhaupt hier schreiben und die große Mehrheit der Spieler euch schlicht ignoriert."}, {"135": "Möglicherweise sollten die Seasons wohl mal an einem Montag starten, so wie es jetzt ist, ist die Info irreführend.[BR]Wenn ich erst nächste Woche wieder reinschaue, habe ich 4 Tage Zeit für die Aufgaben verloren - denn die neuen Aufgaben kommen bereits in 35 Stunden. [BR][BR][IMG]https://i.ibb.co/ZcHmZnc/https-de-forum-elvenar-com-index-php-attachments-1675774863349-png-34015.png[/IMG]"}, {"48": "schwatzwurzel schrieb:\t\t\tMan kann Wochenaufgaben tauschen .[BR]Die  einem unbequeme  Wochenaufgabe wird ersetzt durch eine Aufgabe die einem  noch unbequemer querliegt .[BR]Oder besser gefällt .  [smilie--sprite1][BR]Dann ist der Slot  Futteraufgabe schneller wieder frei , und braucht keine  3 wochen .\t\tZum Vergrößern anklicken....Das ist mir klar. Aber was nützt denn das Tauschen diese Woche, wenn ich nächste Woche die Aufgabe wieder bekomme? Oder wie du sagst:[BR]Die noch unbequemer ist."}, {"126": "Ich denke, welche Aufgaben man gut findet und welche nicht, hängt immer sehr vom Spielstil ab. Ich persönlich hasse Aufgaben, wie Getränke, Einfache Werkzeuge oder Brot produzieren, weil dann der Rhythmus mit den Manufakturen nicht passt. Wenn ich Platz habe, stelle ich 2 kleine Werkstätten für sowas. Bei den Wochenaufgaben lehne ich ab und mache alles andere lieber. [BR][BR]An sich läuft das Meiste nebenher und wenn man noch ein paar kleine Belohnungen bekommt, warum nicht mitnehmen? Besser als die Schleifenquests, die nur bis Kapitel 4 / 5 interessant waren."}, {"100": "j.fili schrieb:\t\t\tweñ ich nächste Woche die Aufgabe wieder bekomme?\t\tZum Vergrößern anklicken....[BR]Wieder tauschen    [smilie--sprite1] [BR]Was soll man  sonst machen . [BR][BR]Meine Kapitel 8  , Beta  , hatte noch keine 3 Futter Wochenaufgabe .[BR]Mangels Futtertiere  auch extrem schwierig und ich würde immer wegtauschen . [BR][BR]Wenn du 1 Futter jede Woche einsetzest , dann dauert die Aufgabe halt 3 Wochen . [BR]In einem Jahr haben sich die Seasons eingespielt , und dann stört uns das warten  nicht mehr . [BR]Besser warten und erfüllen , als   100 bier produzieren ."}, {"4": "schwatzwurzel schrieb:\t\t\tWieder tauschen    [smilie--sprite1][BR]Was soll man  sonst machen .[BR][BR]Meine Kapitel 8  , Beta  , hatte noch keine 3 Futter Wochenaufgabe .[BR]Mangels Futtertiere  auch extrem schwierig und ich würde immer wegtauschen .[BR][BR]Wenn du 1 Futter jede Woche einsetzest , dann dauert die Aufgabe halt 3 Wochen .[BR]In einem Jahr haben sich die Seasons eingespielt , und dann stört uns das warten  nicht mehr .[BR]Besser warten und erfüllen , als   100 bier produzieren .\t\tZum Vergrößern anklicken....Ich guck erst mal, wie viel ich überhaupt noch übrig habe an Aufgaben, wenn ich Stufe 50 erreicht habe. Damit weiß ich für das nächste Mal, wieviele Aufgaben ich auslassen kann, um dann doch noch den Hauptpreis zu erhalten. [BR][BR]Mal sehen, ob der Hauptpreis immer gleich bleibt oder es 4 Hauptpreise, für jede Saison einen, gibt. [BR][BR]Ich hatte die Futteraufgabe schon mehrmals, dumm, wenn man tauscht, der Tausch noch schlechter ist, man nochmals tauscht und wieder der erste unerwünschte Quest da ist. Das ist einfach Mist."}, {"48": "salandrine schrieb:\t\t\t...[BR]Ich hatte die Futteraufgabe schon mehrmals, dumm, wenn man tauscht, der Tausch noch schlechter ist, man nochmals tauscht und wieder der erste unerwünschte Quest da ist. Das ist einfach Mist.\t\tZum Vergrößern anklicken....Deshalb einfach stehen lassen. Die Wochenquests kann man aufsummieren. Als ich auf beta anfing hatte ich 16 Eochenquests zu lösen, die sich dann langsam abbauten."}, {"30": "Lach ... irgendwie sind wir alle zu sehr im \"Eventmodus\" bei den Seasons. Da MUSS man den Quest erledigen, will das auch möglichst schnell, um dann den nächsten zu bekommen. [BR]j.fili schrieb:\t\t\tDeshalb einfach stehen lassen.\t\tZum Vergrößern anklicken....Genauso!! Noch ist doch irre viel Zeit - blöd wird es möglicherweise zum Ende hin, wenn sich die Wochenquests dann nicht so fix abbauen lassen. Daher sollte man seine wöchentlichen Tauschoptionen möglichst auch nutzen. Auch wenn manche Quests \"unbequem\" sind - in den vielen Wochen sollten die sich dann irgendwann erledigt haben. Denke ich zumindest - mal abwarten....."}, {"152": "Ich empfinde das \"Season\"-Feature als plumpen Versuch, mich zu mehr Spielzeit zu bewegen, aber ich werde sicher nicht meinen Spielrhythmus ändern, nur damit ich \"zwischendurch\" bspw. einfache Werkzeuge oder Brote produzieren kann. [BR]Wenn ich mehr Zeit zum zocken habe, dann spiele ich ein richtiges PC- oder Konsolen-Spiel und kein kleines App-Spiel.[BR][BR]Die 3000 Diamanten für den Pass finde ich völlig überzogen. Wenn man mit irgendwelchen Mondpreisen für die Gebäude rechnet, dann kann man sich den Pass schön rechnen, aber mir sind diese Gebäude das überhaupt nicht wert (insbesondere in Zeiten von stark steigenden Lebensmittel- und Energiepreisen!)."}, {"22": "Das Saison-Event ist eine tolle Abwechslung. Es macht Spaß. Jedoch muss ich gestehen, dass der Diamanten-Einsatz für die Extras sich aus meiner Sicht gar nicht lohnt. Die \"Zusatz-Artikel\" haben für mich kaum was. 2x Kampfbonus wäre dabei - Wert: 500 Dias für den Außenseiter und 1x Lebensverbesserung. Ich hätte max. 1.000 Dias investiert, aber nur wenn ich schon das 3. Bier inne habe - und ich trinke keinen Alkohol [smilie--sprite2][BR][BR]Wenn 1 von 30 Spielern 3.000 Dias einsetzt, sind das 3% (90 Dias - zu teuer)[BR]Wenn 20 von 30 Spielern 600 Dias einsetzen, sind das 66% (396 Dias)[BR]Wie macht denn nun das Geschäft?! Diese Ware ist doch nur virtuell, während das Geld für Dias ziemlich echt ist [smilie--sprite2][BR](Die Diamanten-Farmer kann man außer Acht lassen. Die kaufen eher selten)[BR][BR]Den Zusatz-Spaß - \"ohne Dias\" - nehme ich sehr gerne an. Der Einheiten-Segen ist eine gute Hilfe.[BR]Danke für all die Mühe, das Programmieren und die Grafik. Lob an die Macher [smilie--sprite2][BR][BR]vlg. und weiterhin viel Spaß beim Programmieren an dem Elvenar-Projekt.[BR]Leo"}, {"141": "ich mag's auch - nicht viel zu gewinnen aber nix zum Verlieren - nettes Zusatz-Gimmick und nem geschenktem Gaul..."}, {"118": "Heute Morgen hab ich die Seasons einfach nur abgefeiert [smilie--sprite8][BR]72.000 Unurium in der Belohnungsleiste bekommen und sofort weiter forschen können —> mega [smilie--sprite1]"}, {"145": "Eine kleine Anmerkung hätte ich jedoch: ich hatte jetzt schon mehrmals bei den tagesquests drei Aufgaben, die sich auf Vorräte bezogen (Getränke, einfache und bessere Werkzeuge meistens). Heute habe ich sogar vier Vorräte-Aufgaben: Getränke, bessere Werkzeuge, Gemüsekörbe und Sammle eine große Menge. Eine bessere Durchmischung der Aufgaben wäre da schöner und awechslungsreicher."}, {"153": "Vayiana schrieb:\t\t\tEine kleine Anmerkung hätte ich jedoch: ich hatte jetzt schon mehrmals bei den tagesquests drei Aufgaben, die sich auf Vorräte bezogen (Getränke, einfache und bessere Werkzeuge meistens).\t\tZum Vergrößern anklicken....[BR]Das ist auch mein Feedback. Ich finds OK, wenn ab und zu auch Getränke oder einfache Werkzeuge gefordert werden. Aber wenn die Vorrat-Quests gleich mehrfach auftauchen wirds mühsam. Bitte begrenzen auf 1 Vorrat Quest pro Tag."}]