[{"135": "50 Getränke... na vielen Dank auch... so langsam (aber sicher) nervts."}, {"113": "Xebifed schrieb:\t\t\t50 Getränke... na vielen Dank auch... so langsam (aber sicher) nervts.\t\tZum Vergrößern anklicken....Als Tagesquest?"}, {"135": "lovelymonster schrieb:\t\t\tAls Tagesquest?\t\tZum Vergrößern anklicken....[BR]Als Wochenquest und ich habe mich versehen, es sind 100 Getränke. Richtig schlimm, als hätte man nichts anderes zu tun als dumm rumzuklicken."}, {"6": "Xebifed schrieb:\t\t\tRichtig schlimm, als hätte man nichts anderes zu tun als dumm rumzuklicken.\t\tZum Vergrößern anklicken....Wer zwingt dich dazu? Lass es einfach sein wenns dir nicht gefällt.  [smilie--sprite2]"}, {"112": "also. ich besitze 6 mini-werkstätten stufe 1. wenn ich sowieso gerade da bin und meine güter einsammele, starte ich 2x die getränke, bevor ich da wieder 9h-produktion einschalte. das mach ich 2x am tag, so ca. hab also an einem tag 24 getränke hergestellt, am 5. tag ist die quest fertig.[BR]geduld ist manchmal auch was wert."}, {"135": "ustoni schrieb:\t\t\tWer zwingt dich dazu? Lass es einfach sein wenns dir nicht gefällt.  [smilie--sprite2]Zum Vergrößern anklicken....[BR]Der \"Zwang\" ist da, da braucht man nicht drüber diskutieren. Lass das doch einfach als mein Feedback stehen. Ich mag es nicht.[BR][BR]Pukka schrieb:\t\t\talso. ich besitze 6 mini-werkstätten stufe 1. wenn ich sowieso gerade da bin und meine güter einsammele, starte ich 2x die getränke, bevor ich da wieder 9h-produktion einschalte. das mach ich 2x am tag, so ca. hab also an einem tag 24 getränke hergestellt, am 5. tag ist die quest fertig.[BR]geduld ist manchmal auch was wert.\t\tZum Vergrößern anklicken....[BR]Schön, das bringt mir genau was?[BR]Ich brauche dafür eine Stunde. Und danach muss ich nochmal 2x die Stundenproduktion starten, der Wunsch von Inno ist hier also, mich 3 Stunden an das Spiel zu fesseln - wo ich normalerweise nach 5 Min durch wäre.[BR]Verteile ich das auf die ganze Woche, habe ich jeden Tag so eine Spielbremse abzuarbeiten, da es die 3H Produktionen killt."}, {"104": "Der Wunsch von Inno ist, dass ein paar Cracks das machen, und alle anderen um mitzuziehen Geld zahlen. [smilie--sprite2]"}, {"113": "Xebifed schrieb:\t\t\tAls Wochenquest und ich habe mich versehen, es sind 100 Getränke. Richtig schlimm, als hätte man nichts anderes zu tun als dumm rumzuklicken.\t\tZum Vergrößern anklicken....Jo, die hab ich auch, mich stört sie aber nicht. [BR]Ich habe ein paar MiniWerkstätten rumstehen, die werden angeschmissen und gut is. Hab ja ne Woche Zeit für."}, {"4": "Mich stören die 15-Min. Werkstatt-Quests tierisch. Ich war so froh, diese Produktion nicht mehr im GA zu haben. 15 Min. sind zu lange, um darauf zu warten und zu kurz, um wirklich sinnvoll etwas anderes machen zu können. Und dann auch noch 75 Produktionen dieser Sorte. [BR][BR]Mit normalen Werkstätten geht das meist nicht, da ich  mir damit dann einfach meine 3h-Produktionen verschmeiße.[BR][BR]Ja, ich könnte es lassen, ich könnte aber auch das ganze Spiel lassen. [smilie--sprite3]"}, {"2": "ForgeS44 schrieb:\t\t\tDer Wunsch von Inno ist, dass ein paar Cracks das machen, und alle anderen um mitzuziehen Geld zahlen. [smilie--sprite2]Zum Vergrößern anklicken.......wer wegen 100 Getränken Geld zahlt, der braucht sich wirklich nicht beschweren - ich hatte bisher mit keiner einzigen Quest Probleme - und die 100 Getränke hatte ich auch schon...(ebenso die Aufgabe mit den 10 Eventquests - die ist jetzt bei 8/10)..."}, {"135": "Die 10 Eventquest sind sicher nächste Woche dabei...würde um 50Wp Wundereinzahlung wetten, wer geht mit?"}, {"2": "Xebifed schrieb:\t\t\tDie 10 Eventquest sind sicher nächste Woche dabei...würde um 50Wp Wundereinzahlung wetten, wer geht mit?\t\tZum Vergrößern anklicken.......die Saison der Träume läuft noch über 60 Tage - ich bin mir sicher, daß es da noch ein weiteres Event geben wird...."}, {"6": "Xebifed schrieb:\t\t\tDie 10 Eventquest sind sicher nächste Woche dabei..\t\tZum Vergrößern anklicken....Dann lehnt man die einfach ab und macht dafür die 100 Getränke. [smilie--sprite8]"}, {"4": "Auf der Beta hab ich heute den Quest mit 10 Eventquests erhalten. Restdauer des Events 10 Tage und ein paar Stunden. Mal sehen, ob es sich noch ausgeht."}, {"141": "ustoni schrieb:\t\t\tDann lehnt man die einfach ab und macht dafür die 100 Getränke. [smilie--sprite8]Zum Vergrößern anklicken....[BR]ich krieg Durst.. - müssen die am Ende alle zusammen da stehen oder darf man zwischendurch was nippen?"}, {"154": "Wenn diese Zeitvorgabe (Tagesquest/Wochenquest) nicht wäre, dann wäre es ein entspanntes Spielen.[BR]Die Belohnungsquestleiste kann beibehalten werden und das ein Gesamtzeitlimit von einem Vierteljahr vorgegeben wird ist auch in Ordnung, nur sollte kein Zeitlimit auf die einzelnen Quests bestehen, wenn eine Quest abgearbeitet ist erscheint die nächste wie ursprünglich bei den Schleifenquests auch.[BR](meinetwegen können auch 4 Quests gleichzeitig erscheinen)[BR]So könnte jeder die Quests erledigen wenn es in sein Konzept passt und fühlt sich nicht indirekt unter Druck gesetzt."}, {"135": "Fritzilein schrieb:\t\t\tich krieg Durst.. - müssen die am Ende alle zusammen da stehen oder darf man zwischendurch was nippen?\t\tZum Vergrößern anklicken....[BR]Das kannst du dir bei 99 anzeigen lassen.[BR][IMG]https://i.ibb.co/MptpYqG/https-de-forum-elvenar-com-index-php-attachments-1675954953802-png-34032.png[/IMG]"}, {"1": "Hm, gibt es denn auch konstruktive Vorschläge, was für Quests euch besser gefallen würde?"}, {"6": "Xebifed schrieb:\t\t\tDas kannst du dir bei 99 anzeigen lassen.\t\tZum Vergrößern anklicken....Man sollte Likes noch mit einem Smilie versehen können. Der war echt gut! [smilie--sprite1][BR]Tacheless schrieb:\t\t\tHm, gibt es denn auch konstruktive Vorschläge, was für Quests euch besser gefallen würde?\t\tZum Vergrößern anklicken....Ich fände es besser, wenn die Anzahl bei besagten Aufgaben an die Kapitel angepasst würden. Ich kann mir schon vorstellen, dass diese Mengen je nach Spielstand ein Problem darstellen können.[BR]Umgekehrt ist es für Kapitel 20 z.B. überhaupt kein Problem, da könnten aus 100 Getränken auch gerne 200 werden. (Nein, ist keine Ironie.)[BR]100 Getränke mache ich so nebenbei wenn erforderlich, die Aufgabe \"40 Gemüsekörbe\" ist da zeitlich schon eher angemessen."}, {"8": "10 eventquests in einer Woche... Bei nur 1 eventquest pro Tag? Ist echt haarig![BR][BR]Vllt sollte man einfach auf 7 absenken? dann wäre es machbar."}]