[{"6": "gergerw schrieb:\t\t\tVllt sollte man einfach auf 7 absenken? dann wäre es machbar.\t\tZum Vergrößern anklicken....Ist auch so machbar. Die Aufgabe geht ja anders als bei den Tagesaufgaben nicht verloren. Kritisch wäre es nur am Ende der Saison - und dann kann man die Aufgabe immer noch ablehnen."}, {"8": "ustoni schrieb:\t\t\tDie Aufgabe geht ja anders als bei den Tagesaufgaben nicht verloren\t\tZum Vergrößern anklicken....ich hab letztens eine Quest beendet aber Belohnung vergessen zu holen. Als ich es merkte, wars zu spät... neue wochenquests... 70 Punkte verloren...[BR]Meinst du echt, ich krieg die quest am Ende wieder???"}, {"8": "ustoni schrieb:\t\t\tIch fände es besser, wenn die Anzahl bei besagten Aufgaben an die Kapitel angepasst würden. Ich kann mir schon vorstellen, dass diese Mengen je nach Spielstand ein Problem darstellen können.[BR]Umgekehrt ist es für Kapitel 20 z.B. überhaupt kein Problem, da könnten aus 100 Getränken auch gerne 200 werden. (Nein, ist keine Ironie.)[BR]100 Getränke mache ich so nebenbei wenn erforderlich, die Aufgabe \"40 Gemüsekörbe\" ist da zeitlich schon eher angemessen.\t\tZum Vergrößern anklicken....Vllt die Aufgaben noch an die Wetterlage und Wochentage anpassen...[BR]An einem verregneten Samstag wo tolle Filme laufen, könnens auch 1000 Getränke werden [smilie--sprite6][BR][BR]Hab es letztens allen Ernstes geschafft, den 19ten Tausch beim Händler zu sehen! ...Ja, er kostet wirklich das gesamte Vorratslager!"}, {"141": "Tacheless schrieb:\t\t\tHm, gibt es denn auch konstruktive Vorschläge, was für Quests euch besser gefallen würde\t\tZum Vergrößern anklicken....jo, bestimmt - aber ich bin ja nicht wählerisch [smilie--sprite1]))[BR][BR]Edit: und sowieso zu faul für sowas, Gott vergib mir"}, {"6": "gergerw schrieb:\t\t\tich hab letztens eine Quest beendet aber Belohnung vergessen zu holen.\t\tZum Vergrößern anklicken....???[BR]Die Belohnung aus der Truhe für die 4 Tagesquests wird bei Nichtabholen am nächsten Tag automatisch gutgeschrieben,[BR]Die Belohnungen unter dem Reiter \"Belohnungen\" kannst du jederzeit abholen, auch Wochen später. Dazu einfach bei den 10 Seiten Belohnungen rückwärts blättern.[BR]Ist eine der 4 Wochenquests nicht rechtzeitig erledigt, werden am Donnerstag zunächst 4 neue Wochenquests gegeben. Ob die noch offene Quest dann erscheint sobald ein Slot frei wird oder erst, wenn die 4 neuen Quests abgeschlossen sind, kann ich dir nicht sagen - den Fall hatte ich noch nicht. Wochenquests gehen jedenfalls nicht verloren."}, {"8": "ustoni schrieb:\t\t\tOb die noch offene Quest dann erscheint sobald ein Slot frei wird oder erst, wenn die 4 neuen Quests abgeschlossen sind, kann ich dir nicht sagen - den Fall hatte ich noch nicht\t\tZum Vergrößern anklicken....Ich kanns dir sagen:[BR][BR]Es kam eine neue Wochenquest. 70 Punkte dahin... ich werds verkraften [smilie--sprite6][BR][BR]ustoni schrieb:\t\t\tWochenquests gehen jedenfalls nicht verloren.\t\tZum Vergrößern anklicken....Meinste echt? Dann muss die ja irgendwann nochmal kommen... Bin gespannt![BR][BR]vllt sogar mit gespeichertem Fortschritt??? HiHi, nein glaub ich nicht [smilie--sprite8]"}, {"2": "gergerw schrieb:\t\t\tich hab letztens eine Quest beendet aber Belohnung vergessen zu holen. Als ich es merkte, wars zu spät... neue wochenquests... 70 Punkte verloren...[BR]Meinst du echt, ich krieg die quest am Ende wieder???\t\tZum Vergrößern anklicken.......ist das wirklich so schwer zu verstehen?[BR][BR][IMG]https://i.ibb.co/crb2QFC/https-de-forum-elvenar-com-index-php-attachments-wochenquest-png-34034.png[/IMG][BR][BR]...ich hab die Aufgabe mit den 10 Quests schon seit letzter Woche - gestern war dann eine Quest (die mit den Handelsangeboten) in der Warteschleife - sofort, nachdem ich eine neue Wochenquest erfüllt hatte, ist die aus der Warteschleife nach oben gewandert und ich hab nun 8 von 12 erfüllt und die entsprechenden Punkte dafür bekommen und die 4 da oben werde ich mit Sicherheit auch in dieser Woche erfüllen können...[BR][BR]...außerdem kann man doch nachrechnen, ob man alle Punkte bekommen hat...[BR][BR]...iDavis hat dazu eine wunderschöne Auflistung erstellt - da ist zwar ein kleiner Fehler drin, aber nach Meilenstein Nr. 10 stimmt es wieder...[BR][BR]\t\t\thttps://idavis-elvenar.com/seasons.html#pass\t\t"}, {"141": "Romilly schrieb:\t\t\t...ich hab die Aufgabe mit den 10 Quests schon seit letzter Woche - gestern war dann eine Quest (die mit den Handelsangeboten) in der Warteschleife - sofort, nachdem ich eine neue Wochenquest erfüllt hatte, ist die aus der Warteschleife nach oben gewandert und ich hab nun 8 von 12 erfüllt und die entsprechenden Punkte dafür bekommen und die 4 da oben werde ich mit Sicherheit auch in dieser Woche erfüllen können...\t\tZum Vergrößern anklicken....supi!"}, {"35": "Tacheless schrieb:\t\t\tHm, gibt es denn auch konstruktive Vorschläge, was für Quests euch besser gefallen würde?\t\tZum Vergrößern anklicken....Ich habe hier eigentlich schon jede Menge konstruktives Feedback und Vorschläge gelesen.[BR]Ich gebe zu, unter der Vielzahl der Beiträge vielleicht schwer aufzufinden."}, {"135": "Tacheless schrieb:\t\t\tHm, gibt es denn auch konstruktive Vorschläge, was für Quests euch besser gefallen würde?\t\tZum Vergrößern anklicken....[BR]Ich vermisse den Klassiker:[BR][BR]\"Bewege ein Gebäude\"[BR][BR]bzw. als Wochenquest[BR][BR]\"Bewege 10 Gebäude\""}, {"120": "bei meiner Kleinen ist die 10 Quest Wochenaufgabe stehengeblieben, nur 3 neue bekommen.  0 in Warteposition. Und nach Abschluss von einer \"benutze 3 Vorratssegen\" kam auch keine neue. Heißt, dem Account fehlen jetzt schon 70 Punkte, die nicht nachgeholt werden können.[BR]Kann es sein, dass hier noch einiges quer läuft und mal wieder nicht alle gleich behandelt werden?"}, {"2": "Kassiopeia24 schrieb:\t\t\tbei meiner Kleinen ist die 10 Quest Wochenaufgabe stehengeblieben, nur 3 neue bekommen.  0 in Warteposition. Und nach Abschluss von einer \"benutze 3 Vorratssegen\" kam auch keine neue. Heißt, dem Account fehlen jetzt schon 70 Punkte, die nicht nachgeholt werden können.[BR]Kann es sein, dass hier noch einiges quer läuft und mal wieder nicht alle gleich behandelt werden?\t\tZum Vergrößern anklicken.......was steht da oben bei Wochen-Quest und wie viele Punkte fehlen dir bis zu welchem Meilenstein? Ein Screenshot wäre interessant..."}, {"120": "[BR]das ist der aktuelle Stand nach dem Lösen einer neuen Wochenaufgabe"}, {"135": "12/12 kommt da raus, was richtig erscheint."}, {"2": "Kassiopeia24 schrieb:Anhang 34036 ansehen[BR]das ist der aktuelle Stand nach dem Lösen einer neuen Wochenaufgabe\t\tZum Vergrößern anklicken.......du hast 20 Meilensteine erfüllt - dazu brauchst du [IMG]https://i.ibb.co/mR8vQcr/https-de-forum-elvenar-com-index-php-attachments-meilenstein-png-34037.png[/IMG]...[BR]...mit 2x 420 Punkten aus den ersten beiden Wochen + die 70  aus der Quest ganz rechts + die 20 aus den 4 Tagesquests heute, bist du bei 930 - also 5 drüber, wie in deinem Bild - es passt also alles..."}, {"120": "wenn ihr das sagt, glaub ich das einfach, dann muss ich nicht versuchen es zu verstehen [smilie--sprite2]"}, {"132": "Ich find die Seasons ganz nett, viele Quests laufen nebenher mit, ok einige sind büssi *räusper* also echt, 100 Getränke... [BR]wer bitte soll denn das ganze Erdbeerbier vernichten? und gibts eigentlich dafür einen neuen Chara? Ork mit Frack und Tablett? [smilie--sprite2][BR]und über ein paar extra Überraschungen, egal in welcher Form freu ich mich einfach,[BR]ein schönes Wochenende"}, {"2": "Meslamatea schrieb:\t\t\twer bitte soll denn das ganze Erdbeerbier vernichten?\t\tZum Vergrößern anklicken....[IMG]https://i.ibb.co/x877F9D/https-de-forum-elvenar-com-index-php-attachments-1-png-34043.png[/IMG]...sonst noch Fragen?   [smilie--sprite7] [smilie--sprite7] [smilie--sprite7]"}, {"17": "ustoni schrieb:\t\t\terscheint sobald ein Slot frei wird oder erst, wenn die 4 neuen Quests abgeschlossen sind, kann ich dir nicht sagen\t\tZum Vergrößern anklicken....schon richtig, so bald ein Slot frei wird."}, {"61": "salandrine schrieb:\t\t\tMal sehen, ob der Hauptpreis immer gleich bleibt oder es 4 Hauptpreise, für jede Saison einen, gibt.\t\tZum Vergrößern anklicken....welcher Hauptpreis?[BR][BR]Edit: Ah, grad die Werbung gefunden ... aber naja, da freu ich mich über die Geisterwölfe mehr, die gabs damals nur bei den königlichen Preisen [smilie--sprite1] auch wenn sie es wohl nur bis ins Inventar schaffen [smilie--sprite1]"}]