[{"4": "ZeNSiErT schrieb:\t\t\twelcher Hauptpreis?\t\tZum Vergrößern anklicken....Der Brunnen der Träume bei Station 50[BR][BR]/screen geht gerade nicht)"}, {"61": "salandrine schrieb:\t\t\tDer Brunnen der Träume bei Station 50\t\tZum Vergrößern anklicken....ja, das war für mich keiner, den hab ich ja vorher schon gesehen [smilie--sprite1], wollte ja eigentlich 55 Meilensteine schaffen und wissen, was danach kommt [smilie--sprite1] [BR][BR]also ja, hoffen wir mal, der ist da kein Stammgast [smilie--sprite1]"}, {"28": "Was nach dem 50. Meilenstein noch kommt oder nicht, kann man glaube ich erst sehen wenn man den 50. Meilenstein erreicht hat. ;-)"}, {"20": "Thebigunknown schrieb:\t\t\tWas nach dem 50. Meilenstein noch kommt oder nicht, kann man glaube ich erst sehen wenn man den 50. Meilenstein erreicht hat. ;-)\t\tZum Vergrößern anklicken....[BR]bis jetzt ist da auf Beta noch gar nichts zu sehen[BR][BR][IMG]https://i.ibb.co/4WB994S/https-de-forum-elvenar-com-index-php-attachments-1676297525770-png-34076.png[/IMG]"}, {"28": "ACHTUNG: SPOILER vom Beta-Server[BR][BR][IMG]https://i.ibb.co/khmqpjx/https-de-forum-elvenar-com-index-php-attachments-1676302686133-png-34077.png[/IMG][BR][BR]Die \"Blessing Chests\" a, b, d and e wird es vermutlich nur mit \"season pass\" geben. [BR][BR]Die \"Blessing Chests\" c und f soll es auch ohne \"season pass\" geben, habe ich zumindest gehört."}, {"20": "Mag sein, aber zur Zeit noch nicht. gelesen hab ich auch davon."}, {"28": "FCL001 schrieb:\t\t\tMag sein, aber zur Zeit noch nicht. gelesen hab ich auch davon.\t\tZum Vergrößern anklicken....Bei Problemen ist in diesem Fall der Beta-Support zuständig. ;-)"}, {"155": "Ich finde die Preisauswahl teilweise sehr witzig, sowas wie 15 volle Trupps oder einen Zeitbooster für ganze 45 Minuten.^^"}, {"152": "Killy schrieb:\t\t\tIch finde die Preisauswahl teilweise sehr witzig, sowas wie 15 volle Trupps oder einen Zeitbooster für ganze 45 Minuten.^^\t\tZum Vergrößern anklicken....Vielleicht ist das eine geheime Ankündigung, dass es bald weitere Möglichkeiten geben wird, um die Truppenausbildung weiter zu beschleunigen, so dass man dann mit einem 45 Minuten-Booster mehr als 15 volle Trupps ausbilden kann [smilie--sprite1]"}, {"155": "Sir Gareth schrieb:\t\t\tVielleicht ist das eine geheime Ankündigung, dass es bald weitere Möglichkeiten geben wird, um die Truppenausbildung weiter zu beschleunigen, so dass man dann mit einem 45 Minuten-Booster mehr als 15 volle Trupps ausbilden kann [smilie--sprite1]Zum Vergrößern anklicken....Das käme mir sehr gelegen, meine Truppenproduktion schwächelt zZ, hoffe wir können bald damit rechnen. ^^"}, {"94": "FCL001 schrieb:\t\t\tbis jetzt ist da auf Beta noch gar nichts zu sehen[BR][BR]Anhang 34076 ansehenZum Vergrößern anklicken....Was da noch kommen soll, ist meiner Ansicht nach, die 3000 Diamanten auch nicht wert.[BR]Das muss wirklich besser werden INNO, das werdet Ihr aber sicher auch selbst feststellen [smilie--sprite2] [BR]\"Daumen drück\" für die nächste Season, bitte auch mit dran denken den 50ger Checkpoint etwas aufzumotzen, das wäre dann schon die halbe Miete [smilie--sprite1]"}, {"133": "zenka schrieb:\t\t\tups, zu spät gesehen. und keine Wahlmöglichkeit mehr. Sehr Arbeitnehmer unfreundlich.\t\tZum Vergrößern anklicken....[BR]ich erneuere mein Feedback, bitte auch mal Tagesaufgaben zu 9 Stunden. Immer 3 Stunden ist Benachteiligung."}, {"156": "Bei mir läuft dieses neue Feature bisher ohne größere Schwierigkeiten.[BR]Außerdem gefällt mir die Gestaltung sehr und auch die kleinen Zeitsegen[BR]haben mir schon mehrmals geholfen.[BR]Ich wünschte,dass alle die Saison der Träume so entspannt spielen könnten wie ich.[BR]Das einige sich benachteiligt fühlen tut mir sehr leid.(Ich weiss,dass sich dafür auch keiner[BR]etwas kaufen kann.Es ist immer so eine Sache mit Mitleid oder besser Mitgefühl.So[BR]mancher empfindet das als Heuchelei aber es ist von mir durchaus ernst gemeint.)[BR]Bis jetzt konnte ich alle Aufgaben erfüllen,sowohl die Tages-als auch die Wochenaufgaben[BR]und musste bei den Wochenaufgaben nur einmal etwas austauschen,was sehr ungünstig[BR]für mich gewesen wäre.Natürlich kann sich das auch mal ändern und ich mache einen[BR]eher schlechten Tausch.Wer weiss das schon.Es kann ja nicht immer alles reibungslos[BR]laufen und das wäre auf Dauer doch auch langweilig..."}, {"113": "zenka schrieb:\t\t\tich erneuere mein Feedback, bitte auch mal Tagesaufgaben zu 9 Stunden. Immer 3 Stunden ist Benachteiligung.\t\tZum Vergrößern anklicken....Ich hab grad welche reinbekommen, würde sie dir auch gerne abgeben, hab bloß immer noch nicht rausbekommen, wie ich am Handy Screenshots mache [smilie--sprite3]"}, {"56": "Seasons entspricht nicht meinem normalen Spiel. Das bedeutet, ich müsste Ressourcen „außer der Reihe“ einsetzen, die bei mir (normal) nicht täglich oder wöchentlich genutzt werden.[BR](Übrigens: Ich habe trotz meiner Spielweise immer große Mengen Ressourcen, die ich aber nur nutzbringend einsetze.)[BR][BR]Stelle ich in Seasons die einzusetzenden Ressourcen den Belohnungen gegenüber, dann sehe ich da keinen Vorteil. [BR]Im Gegenteil eher einen Nachteil, weil ich damit Ressourcen unnötig verpulvere, die ich an anderer Stelle wirklich sinnvoll einsetzen kann.[BR]Selbst die Gebäude die man erhalten kann, habe ich entweder ohnehin schon oder ich wollte sie sowieso nicht haben.[BR][BR]Der Anreiz ist für mich nicht größer als bei den Schleifenquest, die ich auch nie gespielt habe![BR]Ich habe auch dort immer nur das eingesammelt, was sich von selbst irgendwann erledigte und so halte ich es auch mit den Seasons. [BR]Ich sehe (für mich), auch mit viel gutem Willen derzeit keinen Mehrwert dieses Feature intensiv zu spielen!"}, {"2": "...eine nette Mischung an Aufgaben...[BR][IMG]https://i.ibb.co/vHJbGBZ/https-de-forum-elvenar-com-index-php-attachments-g-tersaison-png-34234.png[/IMG]...und sehr einfach zu lösen..."}, {"157": "Finde das neue Feature sehr gut. Deutlich besser und sinnvoller als die vorherigen Quests.[BR]Diese Quests hatte ich seit Monaten komplett ignoriert. Wenn zufällig mal das grüne Häkchen kam, wurde die \"Belohnung\" eingesammelt. Das hier erledigt sich auch oft nebenbei und die Preise konnte ich bisher alle gebrauchen. Klasse"}, {"135": "Wenn man in den 60 Tagen nur eine Tagesaufgabe nicht erfüllt, kann man es gleich ganz lassen, weil dann der \"Hauptpreis\" nicht mehr erreichbar ist? Ist das so?"}, {"100": "Xebifed schrieb:\t\t\tWenn man in den 60 Tagen nur eine Tagesaufgabe nicht erfüllt, kann man es gleich ganz lassen, weil dann der \"Hauptpreis\" nicht mehr erreichbar ist? Ist das so?\t\tZum Vergrößern anklicken....Man benötigt nicht alle Tagesaufgaben  um bis zu  Preis  50 zu  kommen . [BR][BR]Und einen Hauptpreis hab ich noch nicht gesehen . [BR]Einige Preise find ich gut andere nicht . [BR]25 Trupps    bogis bei  42 ist ein Highlight für  mich  ."}, {"50": "Was soll denn der \"Hauptpreis\" sein?[BR]Seasons ist kein Event im herkömmlichen Sinn, sondern der Ersatz für die Schleifen-Quests.[BR]Es gibt für die definierten Meilensteine Belohnungen.[BR]Selbst wenn man mehrere Tagesaufgaben nicht macht, kommt man trotzdem problemlos bis zur Belohnung von Meilenstein 50 -> Brunnen der Träume. [BR]Danach geht es dann noch für die Restlaufzeit immer weiter und man kommt an weitere Belohnungen, je weiter man sich bei den nachfolgenden nicht mehr aufgelisteten Meilensteinen voran arbeitet."}]