[{"2": "Xebifed schrieb:\t\t\tWenn man in den 60 Tagen nur eine Tagesaufgabe nicht erfüllt, kann man es gleich ganz lassen, weil dann der \"Hauptpreis\" nicht mehr erreichbar ist? Ist das so?\t\tZum Vergrößern anklicken.......wieso 60 Tage? - es waren doch 75..."}, {"125": "OMcErnie schrieb:\t\t\tWas soll denn der \"Hauptpreis\" sein?[BR]Seasons ist kein Event im herkömmlichen Sinn, sondern der Ersatz für die Schleifen-Quests.[BR]Es gibt für die definierten Meilensteine Belohnungen.[BR]Selbst wenn man mehrere Tagesaufgaben nicht macht, kommt man trotzdem problemlos bis zur Belohnung von Meilenstein 50 -> Brunnen der Träume.[BR]Danach geht es dann noch für die Restlaufzeit immer weiter und man kommt an weitere Belohnungen, je weiter man sich bei den nachfolgenden nicht mehr aufgelisteten Meilensteinen voran arbeitet.\t\tZum Vergrößern anklicken....D. h. nach den 50 geht es wirklich weiter? Ganz sicher?"}, {"150": "Handelsbaron schrieb:\t\t\tD. h. nach den 50 geht es wirklich weiter? Ganz sicher?\t\tZum Vergrößern anklicken....Jupp ist Bestätigt >Hier< ein Bild vom BETA-Server"}, {"125": "Collektor87 schrieb:\t\t\tJupp ist Bestätigt >Hier< ein Bild vom BETA-Server\t\tZum Vergrößern anklicken....Dankeschön - na da freue ich mich sehr. [BR]Mir macht Seasons sehr viel Spaß und freue mich seit langer Zeit mal wieder aufs tägliche Spielen"}, {"100": "Collektor87 schrieb:\t\t\tJupp ist Bestätigt >Hier< ein Bild vom BETA-Server\t\tZum Vergrößern anklicken....Die entgültige Bestätigung  kommt vielleicht  noch in der Ankündigung oder im Wiki . [BR][BR]Ich hab in der Beta  2 Zusatzkisten bekommen .  Die sind Glückswürfel gestillt . [BR]Kleine Gebäude , einiges an segen .[BR][BR]7 wp segen [BR]100 % Vorratssegen . [BR]Ein kleines Zusatz  .    War schon nett  ,"}, {"135": "Romilly schrieb:\t\t\t...wieso 60 Tage? - es waren doch 75...\t\tZum Vergrößern anklicken....50, 60 oder 75...halt dann, wenn schluss ist.[BR][BR]schwatzwurzel schrieb:\t\t\tUnd einen Hauptpreis hab ich noch nicht gesehen .\t\tZum Vergrößern anklicken....[BR]\"bis zum Ende abgeschlossen und den letzten ohne Premium möglichen Preis abgeholt\""}, {"50": "Auf Beta gab es bezgl. was nach Meilenstein 50 passiert, letzte Woche Donnerstag eine offizielle Ankündigung ->[BR][BR][IMG]https://i.ibb.co/0GL4Ns6/https-de-forum-elvenar-com-index-php-attachments-1677086446932-png-34296.png[/IMG]"}, {"135": "Also eine Truhe weniger ab einer verpassten TagesAufgabe, dann hat man allerdings weiter 25 \"Joker\", bevor man die nächste Kiste \"verliert\"?"}, {"128": "Xebifed schrieb:\t\t\tAlso eine Truhe weniger ab einer verpassten TagesAufgabe, dann hat man allerdings weiter 25 \"Joker\", bevor man die nächste Kiste \"verliert\"?\t\tZum Vergrößern anklicken....Sind es nicht 24 Joker?"}, {"4": "Schaut doch mal hier[BR][BR]\t\t\thttps://idavis-elvenar.com/seasons.html\t\t[BR]Da hat iDavis genau aufgeschlüsselt, wieviele Quests man erledigen muss, um den letzten Preis zu erhalten. Danach dauert es immer wieder 130 Schritte, um den nächsten Preis zu erhalten.[BR][BR]Dabei ist darauf zu achten, dass es mit Preispass 3 Truhen zur Auswahl gibt, ohne Preispass gibts nur die mittlere Truhe.[BR][BR]Leider hatte ich das nicht gemerkt, und beim ersten Preis einfach die mittlere Truhe angeklickt, die nur einen 100 % Werkzeug-oder Geldsegen enthielt (Weiß es nicht mehr genau)."}, {"4": "was anderes, muss das wirklich so sein?[BR][BR][IMG]https://i.ibb.co/6gMVTPT/https-de-forum-elvenar-com-index-php-attachments-1677166167627-png-34313.png[/IMG]"}, {"1": "@salandrine Was daran findest du schwierig oder stört dich? Es sind ja die Wochenquests. Du hast einige Tage Zeit, um alle Aufgaben zu erfüllen."}, {"126": "Ich denke mal, es geht darum, dass es alles nur Produktionen in den Werkstätten sind. [BR]Sehe ich selbst weniger problematisch, ich würde Getränke und Einfache Werkzeuge wegtauschen und auf etwas besseres hoffen [smilie--sprite1]"}, {"4": "Tacheless schrieb:@salandrine Was daran findest du schwierig oder stört dich? Es sind ja die Wochenquests. Du hast einige Tage Zeit, um alle Aufgaben zu erfüllen.\t\tZum Vergrößern anklicken....Mich stört, dass es nur Werkzeugquests sind, die mich ständig und ständig bei der Erfüllung ans Spiel binden und mir so einen Rhythmus vorgeben, den ich nicht selbst bestimmen kann."}, {"110": "Also ich finde das eine nette Sache. Sind ein paar gute Preise dabei und man kann, muss aber nicht. Manches erledigt sich hier aber auch von selber. Ist ein bißchen wie die Herausforderungen ... Sehe nichts, was es zu meckern gäbe."}, {"8": "[IMG]https://i.ibb.co/JnSn0GM/https-de-forum-elvenar-com-index-php-attachments-5-tage-eventpause-jpg-34417.jpg[/IMG][IMG]https://i.ibb.co/mhFMxgt/https-de-forum-elvenar-com-index-php-attachments-saisonpause-jpg-34418.jpg[/IMG][BR][BR]Mist![BR]ein kleines Päuschen wäre wohl zu einfach gewesen? [smilie--sprite4]"}, {"6": "Mit der Taverne der Späher wird sich das Problem erledigen. Da hat man ruckzuck einen Vorrat an erkundeten Provinzen aufgebaut, den man sich für Events aufhebt."}, {"4": "gergerw schrieb:Anhang 34417 ansehenAnhang 34418 ansehen[BR][BR]Mist![BR]ein kleines Päuschen wäre wohl zu einfach gewesen? [smilie--sprite4]Zum Vergrößern anklicken....Ich würde mal sagen: Ziemlich dumm gelaufen.[BR][BR]Wer soweit schon ist, sollte doch um die gesetzmäßigkeiten wissen und sich einen Rest an verfügbaren Provinzen aufbauen."}, {"6": "salandrine schrieb:\t\t\tWer soweit schon ist, sollte doch um die gesetzmäßigkeiten wissen und sich einen Rest an verfügbaren Provinzen aufbauen.\t\tZum Vergrößern anklicken....Das ist bei diesen Laufzeiten aber gar nicht so einfach. Bevor ich Tavernenbesitzer war hatte ich das gleiche Problem bei Events."}, {"4": "ustoni schrieb:\t\t\tDas ist bei diesen Laufzeiten aber gar nicht so einfach. Bevor ich Tavernenbesitzer war hatte ich das gleiche Problem bei Events.\t\tZum Vergrößern anklicken....Ich hatte immer mich relativ an die Vorgaben pro Kapitel gehalten und wahrscheinlich einfach dadurch nicht diese extremen Probleme. Meine Taverne der Späher liegt bei Stufe 26 und meine Erkundungsdauer irgendwo um die 42 h rum. [BR][BR]Ich kann mir aber gut vorstellen, wer immer fleißig den Kundschafter hat laufen lassen, der kann schnell in diese Probleme reinschlittern."}]