[{"6": "salandrine schrieb:\t\t\tIch kann mir aber gut vorstellen, wer immer fleißig den Kundschafter hat laufen lassen, der kann schnell in diese Probleme reinschlittern.\t\tZum Vergrößern anklicken....Jepp. Zu Beginn von Kapitel 20 lag ich bei knapp einer Woche je Provinz. Bei der heutzutage üblichen Eventtaktung war das einfach zu lange. Jetzt ist es erstmal wieder für einige Zeit gut machbar."}, {"8": "salandrine schrieb:\t\t\tIch würde mal sagen: Ziemlich dumm gelaufen.\t\tZum Vergrößern anklicken....[smilie--sprite8] Du siehst nur die Spitze des Eisbergs! 4 Sekunden nach Turnierstart war die vorige quest beendet.... und hab vergessen die belohnung zu sammeln... dann die letzte Koksprovinz überfallen und freigeräumt für Turnier... Und dann gesehen: OH shit! Jetzt haddu keine Provinzbegegnungen mehr frei! [smilie--sprite9][BR][BR]salandrine schrieb:\t\t\tWer soweit schon ist, sollte doch um die gesetzmäßigkeiten wissen und sich einen Rest an verfügbaren Provinzen aufbauen.\t\tZum Vergrößern anklicken....Den Preis muss ich dann leider zahlen! Auf ne Turnierprovinz verzichten ist für mich weitaus teurer als im event 5 Tage zu warten und noch viel teurer als bei der Season keine Chance auf Bonustruhen zu haben...[BR][BR]richtig ärgern würde ich mich nur wenn in den season-Bonustruhen Pupsebären, Braunbären, Feuerphönixe, blaue amaryllis, rote Begonien und viele Kampfbooster drin wären! Ich hoffe, die Entwickler sind da knausrig! [smilie--sprite6][BR][BR]ustoni schrieb:\t\t\tMit der Taverne der Späher wird sich das Problem erledigen\t\tZum Vergrößern anklicken....Bin dran![BR][IMG]https://i.ibb.co/5vMZDTM/https-de-forum-elvenar-com-index-php-attachments-im-windkanal-jpg-34420.jpg[/IMG]"}, {"48": "ustoni schrieb:\t\t\tMit der Taverne der Späher wird sich das Problem erledigen. Da hat man ruckzuck einen Vorrat an erkundeten Provinzen aufgebaut, den man sich für Events aufhebt.\t\tZum Vergrößern anklicken....Ich habe 36 erkundete nicht beendete Provinzen, obwohl ich keine Taverne habe und ca. 5 Tage für eine Erkundung brauche. Ich glaube, ich werde die Taverne nicht brauchen."}, {"158": "Also, ich bin mir eben etwas vera...lbert vorgekommen. Als erstes nutze ich die Austauschfunktion, um die Aufgabe  \"77x Bessere Werkzeuge herzustellen\" auszutauschen, was auch gelingt. Dgl. versuche ich nun mit der Aufgabe \"63x Brote herzustellen\" - blöd nur, wenn man dafür dann die vorige, getauschte Aufgabe erhält, nämlich \"77x Bessere Werkzeuge herzustellen\". Shit happens[BR][BR]Und genauso find ich es unlogisch, dass für die Aufgabe \"Kaufe 10 Erkundungswerkzeuge\" jeder Kauf als 1 gilt, egal ob ich 1 Grabeschafel für 9  Proviant oder ein Paket mit 1 Schaufel, 3 Wind- und 3 Vakuumfläschchen für 140 Proviant (entspricht also 7 Erkundungswerkzeugen in Summe) erwerbe. Ich soll offenbar genötigt werden,  unvorteilhaft einzukaufen, nur um diese Aufgabe zu lösen.[BR][smilie--sprite4]"}, {"4": "@Tacheless[BR][BR]Wenn es genau so kommt wie auf der Beta, dann stimmt deine Aussage nicht ganz.[BR][BR]Mit dem Season Pass habe ich auf der Beta bei Aufgabe 55 2 x die Wahlmöglichkeit gehabt und hatte 1 x der rechten und 1 x die linken Kiste genommen.[BR][BR]Allerdings dürfte es sehr schwierig sein, bis zu Aufgabe 55 vorzudringen. Auf der Beta wurde die Season auch um ein Woche verlängt und dadurch war es für mich möglich."}, {"158": "Souliena schrieb:\t\t\tSehe ich selbst weniger problematisch, ich würde Getränke und Einfache Werkzeuge wegtauschen und auf etwas besseres hoffen [smilie--sprite1]Zum Vergrößern anklicken....Na dann hoffe, es geht dir nicht wie mir: #348 [smilie--sprite4]"}, {"129": "salandrine schrieb:\t\t\twas anderes, muss das wirklich so sein?[BR][BR]Anhang 34313 ansehenZum Vergrößern anklicken....hahahaha.... alter schwede... das is ja sogar mit 20 werkstätten echt uncool[BR]also die zeit hätte ich nicht"}, {"135": "Ist das nicht etwas viel Mana für eine Tagesaufgabe in K.12? Wer kein Drachenkloster stehen hat, könnte da etwas ins straucheln geraten?[BR][BR][IMG]https://i.ibb.co/4d2XWSb/https-de-forum-elvenar-com-index-php-attachments-1678109175154-png-34490.png[/IMG]"}, {"104": "Viel ist das nicht, Eventgebäude Weiser Golem hast du mit 12k Mana.[BR]Vom Verbotenen Ruinen-Set kämen 20-30k am Tag, nicht vorhanden.[BR]Jedes anständige Tagespreisgebäude für Mana dürfte auch so um den Dreh 10k liefern (morgen im Event Menschenschiff 4x3 genau 10k in Kapitel 12 = Elementare). Ein paar wenige wären genug.[BR][BR]20 Orknester und dutzende Manufakturen in deiner Stadt, ist ja schön und gut, aber wenn  so einseitig, nicht wundern wenn Mana etwas knapp. [smilie--sprite2][BR]Nicht für Verhandlungen mehr gebraucht? Gastvolk gerade keines, da ja auch oft Bedarf. Na, oder eben über Zauber bei dir.[BR]Sonst mit Mana-Gebäuden leicht drin."}, {"135": "ForgeS44 schrieb:\t\t\tViel ist das nicht, Eventgebäude Weiser Golem hast du mit 12k Mana.[BR]Vom Verbotenen Ruinen-Set kämen 20-30k am Tag, nicht vorhanden.[BR]Jedes anständige Tagespreisgebäude für Mana dürfte auch so um den Dreh 10k liefern (morgen im Event Menschenschiff 4x3 genau 10k in Kapitel 12 = Elementare). Ein paar wenige wären genug.[BR][BR]20 Orknester und dutzende Manufakturen in deiner Stadt, ist ja schön und gut, aber wenn  so einseitig, nicht wundern wenn Mana etwas knapp. [smilie--sprite2][BR]Nicht für Verhandlungen mehr gebraucht? Gastvolk gerade keines, da ja auch oft Bedarf. Na, oder eben über Zauber bei dir.[BR]Sonst mit Mana-Gebäuden leicht drin.\t\tZum Vergrößern anklicken....[BR]Also ich habe mit der Manamenge keine Probleme, das mache ich mit 4 verwendeten Zaubern![BR]In der Theorie (8 Abholungen sind für schlafende Menschen nicht machbar) würde auch mein Laby die Aufgabe alleine bewältigen, das macht in 3 Stunden knapp 7k Mana.[BR]Mana ist bei mir alles, nur nicht knapp [smilie--sprite1][BR][BR][IMG]https://i.ibb.co/ZHMDkn8/https-de-forum-elvenar-com-index-php-attachments-1678112033567-png-34492.png[/IMG][BR][BR]Die von dir genannten Gebäude sind ja auch nur 1x am Tag abholbar, deswegen habe ich den Eindruck, dass die Menge für einige problematisch sein könnte."}, {"104": "Es ist ja eine Tagesaufgabe, Abholung kaum zu verpassen für den entsprechenden Tag.[BR]Bei dir kommt Mana über die Zauber und deine Frage war wie ohne diese hohen Stufe 30-Wunder, die in der Tat selten sind.[BR]Aber da ist die Antwort eben simpel. Der Normalspieler hat ein paar Mana-Gebäude, 100k/ Tag sollten es wohl schon sein in dem Kapitel für normalen Bedarf, Aufgabe lockerleicht zu schaffen. [smilie--sprite2]"}, {"154": "Deine sogenannte Herausforderung ist ein Druck es an diesem Tag oder in dieser Woche machen zu müssen oder die Belohnung nicht zu bekommen, das heißt, ich kann es mir nicht mehr einteilen wie ich möchte und das fällt unter Zwang."}, {"114": "Zwang? Im Ernst? Vor kurzem gab es die Seasons noch garnicht und ohne spielte es sich auch[BR]sehr gut. Vermisst hab ich nichts. Jetzt sind sie da und man kann was erledigen oder einfach[BR]spielen lassen. Wer Herausforderungen mag und die Zeit hat, macht das doch sicher nicht wegen der Preise????? [BR]Hier und da nett aber nicht wirklich Elvenarnotwendig zum Überleben [smilie--sprite6]"}, {"135": "Feejac schrieb:\t\t\tDeine sogenannte Herausforderung ist ein Druck es an diesem Tag oder in dieser Woche machen zu müssen oder die Belohnung nicht zu bekommen, das heißt, ich kann es mir nicht mehr einteilen wie ich möchte und das fällt unter Zwang.\t\tZum Vergrößern anklicken....[BR]Das wollte ich auch schon als Feedback schreiben, dieser Zwang, wirklich jeden Tag spielen zu müssen, ist echt nervig. Bei Events kann man ja immer ein paar Tage wieder aufholen, auch Turm und Turnier sind zur Not mit Zeitboostern machbar.[BR]Das bezieht sich auf die Tagesaufgaben, die Wochenaufgaben werden dann spätestens zur Urlaubszeit nervig.[BR][BR]Das fühlen viele Spieler so, und es ist ja auch das Ziel von Inno - der \"Zwang\" den ganzen Tag bei Elvenar rumzuklicken. Am besten Vollzeit. [BR]Das geht nach hinten los."}, {"119": "Niemand ist \"gezwungen\" die Seasons zu spielen.[BR]Ich glaube, ihr habt eine völlig falsche Vorstellung davon, was ein \"Zwang\" ist, sehr beunruhigend."}, {"104": "Fair wäre aber auch Abschalten, nur ist das explizit nicht möglich. [BR]Man bekommt 24h am Tag diese Anzeige eingeblendet, mit immer mal Häckchen von alleine, die zusätzlich zwingen da reinzugehen, nebenbei zu sehen was noch fehlt.."}, {"159": "ForgeS44 schrieb:\t\t\tFair wäre aber auch Abschalten, nur ist das explizit nicht möglich.[BR]Man bekommt 24h am Tag diese Anzeige eingeblendet, mit immer mal Häckchen von alleine, die zusätzlich zwingen da reinzugehen, nebenbei zu sehen was noch fehlt..\t\tZum Vergrößern anklicken....ist doch kein Problem [smilie--sprite2] einfach daran vorbei schauen. Gibt doch viel schlimmeres auf dieser Welt als diese Anzeige"}, {"4": "Xebifed schrieb:\t\t\tDas wollte ich auch schon als Feedback schreiben, dieser Zwang, wirklich jeden Tag spielen zu müssen, ist echt nervig. Bei Events kann man ja immer ein paar Tage wieder aufholen, auch Turm und Turnier sind zur Not mit Zeitboostern machbar.[BR]Das bezieht sich auf die Tagesaufgaben, die Wochenaufgaben werden dann spätestens zur Urlaubszeit nervig.[BR][BR]Das fühlen viele Spieler so, und es ist ja auch das Ziel von Inno - der \"Zwang\" den ganzen Tag bei Elvenar rumzuklicken. Am besten Vollzeit.[BR]Das geht nach hinten los.\t\tZum Vergrößern anklicken....Ich hatte auf der Beta den Preispass gekauft, weil ich Dias rumliegen hatte. Und habe mich dann selbst sehr unter Druck gesetzt, auch die Quests zu spielen. Gibt immer welche, die ich so nicht gespielt hätte, z.B. den Einsatz von bestimmten Zaubern, die ich mir für MEINEN Zeitpunkt aufhebe.[BR][BR]Schon aus diesem Grunde werde ich den Preispass nicht mehr kaufen, der Zwang, dem ich mich ausgesetzt fühle, reicht auch so.[BR][BR]Obwohl die meisten Quests sich von alleine erledigen, das stimmt schon[BR][BR]Auf der Beta hatte ich genau 10 Tage vor Eventende die Aufgabe, 10 Eventquests fertigzustellen. Also musste ich jeden Tag wirklich einen machen. Hätte ich zwar sowieso, aber trotzdem empfand ich es als unangenehm."}, {"159": "verrückt, wenn man das Gefühl in einem Spiel hat , es sei Zwang da. Alles, aber wirklich alles in einem Spiel ist doch freiwillig! Im realen Leben haben wir Zwang."}, {"4": "Hornuss schrieb:\t\t\tverrückt, wenn man das Gefühl in einem Spiel hat , es sei Zwang da. Alles, aber wirklich alles in einem Spiel ist doch freiwillig! Im realen Leben haben wir Zwang.\t\tZum Vergrößern anklicken....Natürlich kann ich das Spiel jederzeit an den Nagel hängen. Keine Frage[BR][BR]Es gibt aber auch sowas wie einen Ehrgeiz und das Gefühl, den Anforderungen gerecht geworden zu sein. [BR][BR]Spielen ohne einen gewissen gesunden Ehrgeiz ist einfach nur ein Dahinplätschern, da ich keine Ziele habe und somit Jahre brauche für ein Erfolgserlebnis.[BR][BR]ja, natürlich brauche ich das nicht aus einem Spiel, aber, wofür spiele ich dann?"}]