[{"159": "Auch ich habe meine Ziele hier im Spiel. Und ich hab das Glück, dass ich die Quest's bis zum Ende bestimmt  erledigen kann . Aber Zwang ? Nein den mach ich mir nicht . Wir haben doch alle hier, im realen Leben Stress. Was wollen wir uns denn hier Stress an tun ? Auch viel lockerer kann man hier grössere Ziele erreichen [smilie--sprite2]"}, {"113": "salandrine schrieb:\t\t\tja, natürlich brauche ich das nicht aus einem Spiel, aber, wofür spiele ich dann\t\tZum Vergrößern anklicken....Um entspannt dahinplätschernd vorwärts zu kommen.[BR]Das ganze Spiel besteht doch nur aus Erfolgen - eine abgeschlossene Technologie, ein ausgebautes Gebäude, eine erledigte Quest."}, {"114": "Ich hoffe das alle mitbekommen haben das man den wahnsinns Preis am Ende auch bekommt wenn man nicht alle Aufgaben erledigt hat? Es gibt also nicht wirklich einen Grund sich unter Druck zu setzen. [BR]Die Gebäude, die es zu gewinnen gibt, gab's doch schon mal. Diese Gebäude, wer sie noch nicht hat, sind 2 Kapitel weiter auch schon wieder veraltet. Das muß auch so sein denn wenn es nicht so wäre gäbe es tatsächlich keinen Anreiz mehr irgendein Event zu spielen."}, {"160": "Vorbeischauen konnte man bei den Schleifenquests aber noch besser, die waren weniger nervend"}, {"135": "Nehmt einfach hin, dass sich manche Spieler unter Druck gesetzt fühlen. [BR]Wenn es sich für euch anders anfühlt, ändert das nichts an dem Eindruck, den andere Spieler haben.[BR][BR]Inye schrieb:\t\t\tIch hoffe das alle mitbekommen haben das man den wahnsinns Preis am Ende auch bekommt wenn man nicht alle Aufgaben erledigt hat? Es gibt also nicht wirklich einen Grund sich unter Druck zu setzen.[BR]Die Gebäude, die es zu gewinnen gibt, gab's doch schon mal. Diese Gebäude, wer sie noch nicht hat, sind 2 Kapitel weiter auch schon wieder veraltet. Das muß auch so sein denn wenn es nicht so wäre gäbe es tatsächlich keinen Anreiz mehr irgendein Event zu spielen.\t\tZum Vergrößern anklicken....[BR]Und ich hoffe, du hast mitbekommen, dass es am Ende noch extra Preise gibt, für jeweils eine Anzahl erledigte Aufgaben.[BR]Davon abgesehen, wieviele Tagesquests kann man denn genau auslassen, um noch \"den Preis\" zu bekommen?[BR][BR]Übrigens veralten bei mir keine guten Eventgebäude, dafür gibt es[BR][IMG]https://i.ibb.co/jRbHwkp/https-de-forum-elvenar-com-index-php-attachments-1678190068925-png-34514.png[/IMG]"}, {"114": "Wieviele man auslassen kann weiß Romilly sicher [smilie--sprite2][BR]Und was die Preise nach dem großen Preis angeht... wer den Pass kauft muß den Hintern hochkriegen[BR]und sollte sich nicht beklagen. Sind die Preise ohne Pass es wirklich wert sich deshalb zu ärgern[BR]das man da nicht hin kommt? Ich weiß das einige auf Beta soweit gekommen sind. Müßte mal schauen[BR]was in den Truhen war[BR]BTW... die Menge deiner Krz sind sicherlich kein Standart *g* ich kann unmöglich die einzige sein die diese Dinger im Spiel auch nutzt und dem entsprechend wenig davon hat [smilie--sprite8]"}, {"114": "... und selbstverständlich sollte man hinnehmen das es Spieler gibt die sich unter Druck gesetzt fühlen [BR]->Akzeptanz. Teile ich mal ganz frech die Spielerschaft in pro und contra dann sollten aber auch die pro Spieler hinnehmen das es die gibt die das nicht so sehen. [BR]Im Grunde verstehe ich ja auch denn ich war von den Massen an Events auch schon mal angenervt [smilie--sprite2]"}, {"135": "Inye schrieb:\t\t\tBTW... die Menge deiner Krz sind sicherlich kein Standart *g* ich kann unmöglich die einzige sein die diese Dinger im Spiel auch nutzt und dem entsprechend wenig davon hat [smilie--sprite8]Zum Vergrößern anklicken....[BR]Unsere GM macht immer deutlich über 10 Kisten, und ich bin schon etwas länger in Kapitel 12 - somit ist fast alles kapitelaktuell ausgebaut."}, {"6": "Und wenn man gefühlt seit einer Ewigkeit auf Kapitel 21 wartet kommt da noch mehr zusammen:[BR][IMG]https://i.ibb.co/hmhjY88/https-de-forum-elvenar-com-index-php-attachments-kr-jpg-34515.jpg[/IMG][BR]Die werden aber während Kapitel 21 auch wieder verbraucht.  [smilie--sprite2]"}, {"135": "ustoni schrieb:\t\t\tUnd wenn man gefühlt seit einer Ewigkeit auf Kapitel 21 wartet kommt da noch mehr zusammen:[BR]Anhang 34515 ansehen[BR]Die werden aber während Kapitel 21 auch wieder verbraucht.  [smilie--sprite2]Zum Vergrößern anklicken....Ich hatte zwischenzeitlich eine andere Taktik verfolgt und dabei nicht wenige Eventgebäude ausgebaut, die ich danach dann doch ersetzt habe - und dann ging der Ausbau von vorne los... aber jetzt sammel ich auch wieder fürs nächste Kapitel."}, {"126": "Die Seasons sind leider wenig an ganz kleine Kapitel angepasst (nur die Mengen der Güter / Münzen / Vorräte). Wochenquests wie 3 Vorratssegen nutzen ist in Kapitel 2 doch recht schwer, wo soll man die denn her haben? Getauscht: Nutze 3 Münzsegen. Noch mal getauscht: Nutze 3 Vorratssegen. Aber gut, ist halt wie in Events, vieles ist Anfangs nicht oder eben nur schwer machbar."}, {"8": "Ich würde ja wetten, mit einem kleinen Tweak gebe es eine gewaltige Verbesserung und mehr Zufriedenheit.[BR][BR]Bisher sind Tagesquests ziemlich unwichtig... geben wenig Punkte.[BR]Wochenquests sind sehr wichtig... geben viele Punkte[BR][BR]bisheriges Feedback:[BR]Die Tagesquests können echt doof zum Zeitplan passen..[BR]die wochenquests sind knackig aber man kann sie gut planen... kann sich freiwillig aussuchen wann man die angeht.[BR][BR]===> Ich würde deshalb das Konzept noch mehr auf die Spitze treiben[BR][BR]Statt nur 4 Wochenquests anzubieten... eben deutlich mehr![BR]8? 6? 10 quests? weiß nicht was perfekt wäre... müsste man testen[BR][BR]Jedenfalls dafür den Einfluss der Tagesquests deutlich senken! ...noch weniger Punkte pro Tagesquests![BR]===>[BR]Grundgedanke:[BR]Man soll die Tagesquests nicht für die Seasonpreise erledigen sondern für die mehr als grozügige Kistenbelohnung![BR][BR]angestrebtes Ergebnis:[BR]weniger Frust weil man mal ne Tagesquest nicht machen kann/will und deshalb Seasonpreise verliert.[BR][BR]Damit man bessere Seasonpreise bekommen kann, sollten die Wochenquest ruhig deutlich knackiger werden! [smilie--sprite2][BR]Finde manche Quest schon witzig:[BR]ernten sie 6k Orks oder 14k erweckte Güter... das wäre doch eigtl. ne Tagesquest(in Kap.20)??? [smilie--sprite8]"}, {"56": "...und wenn man das ALLES ohnehin nicht mag, dann nimmt man nur die - sich \"von selbst\" ergebenden - \"grünen Haken\" mit und gut ist es.[smilie--sprite6][smilie--sprite1][BR]Man kann ja zudem bei iDavis schon sehen, ob etwas von Interesse dabei ist."}, {"68": "gergerw schrieb:\t\t\tIch würde ja wetten, mit einem kleinen Tweak gebe es eine gewaltige Verbesserung und mehr Zufriedenheit.[BR][BR]Bisher sind Tagesquests ziemlich unwichtig... geben wenig Punkte.[BR]Wochenquests sind sehr wichtig... geben viele Punkte[BR][BR]bisheriges Feedback:[BR]Die Tagesquests können echt doof zum Zeitplan passen..[BR]die wochenquests sind knackig aber man kann sie gut planen... kann sich freiwillig aussuchen wann man die angeht.[BR][BR]===> Ich würde deshalb das Konzept noch mehr auf die Spitze treiben[BR][BR]Statt nur 4 Wochenquests anzubieten... eben deutlich mehr![BR]8? 6? 10 quests? weiß nicht was perfekt wäre... müsste man testen[BR][BR]Jedenfalls dafür den Einfluss der Tagesquests deutlich senken! ...noch weniger Punkte pro Tagesquests![BR]===>[BR]Grundgedanke:[BR]Man soll die Tagesquests nicht für die Seasonpreise erledigen sondern für die mehr als grozügige Kistenbelohnung![BR][BR]angestrebtes Ergebnis:[BR]weniger Frust weil man mal ne Tagesquest nicht machen kann/will und deshalb Seasonpreise verliert.[BR][BR]Damit man bessere Seasonpreise bekommen kann, sollten die Wochenquest ruhig deutlich knackiger werden! [smilie--sprite2][BR]Finde manche Quest schon witzig:[BR]ernten sie 6k Orks oder 14k erweckte Güter... das wäre doch eigtl. ne Tagesquest(in Kap.20)??? [smilie--sprite8]Zum Vergrößern anklicken....[BR]Na dann warte mal auf das nächste GA wenn du dann als Tagesquest bzw. Wochenquest bei den Werkstätten Einfache Werkzeuge oder Brot hast und bei den Manufakturen 3h und 9h Produktionen und du schon 2 Wochenquests in Warteschleife hast.[BR][BR]Dann kannst dich beim tollen Zufallsgenerator bedanken"}, {"151": "Zwang??? [smilie--sprite11][BR]Wenn man der Meinung ist, man will den Endpreis unbedingt haben, dann macht man sich selbst den \"Zwang\"... das ist bei jedem Event so... und früher war das bei der Schleife nicht anders, jeder entscheidet selbst... und so Aussagen das man sich täglich einloggen muss... sry, was für ein Spiel spielt ihr? Ich betrachte die Saison als täglichen LogIn-Bonus, macht deutlich mehr Spaß als die Schleife früher... auch wenn ein Großteil der Preise für mich eher nebensächlich ist. Und nebenbei, täglich einloggen kann man sich auch für die Gemeinschaft, in der man unterwegs ist... oder eben nicht, je nachdem was es einem selbst wert ist."}, {"8": "Moonlady70 schrieb:\t\t\tNa dann warte mal auf das nächste GA wenn du dann als Tagesquest bzw. Wochenquest bei den Werkstätten Einfache Werkzeuge oder Brot hast und bei den Manufakturen 3h und 9h Produktionen und du schon 2 Wochenquests in Warteschleife hast.[BR][BR]Dann kannst dich beim tollen Zufallsgenerator bedanken\t\tZum Vergrößern anklicken....[smilie--sprite8] Ich find sogar, dass das ein cooles Bsp. ist.[BR][BR]es stellt den Spieler vor die Wahl: GA oder Season?[BR][BR]Ich würde ja da ganz locker die season favorisieren! [BR]Dort gibts was für die Anstrengung![BR][BR]alternativ könnte man den RNG entschärfen und einfach die quests entfernen welche im GA stören würden...[BR]Wäre aber nicht halb so lustig! [smilie--sprite6]"}, {"83": "Ich mag die Seasons (im Gegensatz zum Hexenkessel, mit dem ich mich immer noch nicht anfreunden kann, nachdem er mir vorgestern wieder statt der gewünschten Söldner bzw. Trainingseinheitenbooster wieder mal einen - minimalen- Bonus auf meine G1-Manus gebracht hat):[BR][BR]man kann sie machen, muss aber nicht.[BR]Die Wochenquests, die ja deutlich mehr Punkte bringen als die Tagesquests, bleiben ja für die gesamte Zeit und irgendwann passts dann schon mal. Auch die Belohnungen müssen- anders als die Tagespreise beim event-  nicht an einem bestimmten Tag geholt werden.[BR][BR]Meistens laufen sie nebenher, ohne dass man sein normales Spiel irgendwie groß anpassen muss:[BR]ein paar Mini-Werkis stehen jetzt halt als Dauergast rum. Die kann man immer brauchen, egal ob für GA, die ersten quests in events oder jetzt eben halt auch für die Seasons. Die geforderten Mengen sind überschaubar: Getränke sind in den 1-er Werkis schneller fertig als ich mit ernten durch bin, 15 min oder 1 h muss man ja nicht unbedingt gleich abholen. Die Produktionen werden nicht schlecht, wenn sie mehrere Stunden rumliegen und der Verlust an Vorräten durch späters Abholen ohne weiteres zu verschmerzen). Und wenn ich mich wirklich mal entscheiden müsste, ob ich die Werkis für GA oder - kurzfristig- für die Seasons nutzen würde....ich fürchte, da müsste die GA halt mal 15 min oder 1 h warten)[BR][BR]Die Belohnungen sind auch irgendwie zu gebrauchen: die Truhenbelohnungen kann man irgendwann schon mal brauchen und die \"großen\" Belohnungen sind auch ok: stehen immer mal wieder Einheiten zur Auswahl .[BR]Die Belohnungen sind jedenfalls besser als die von den früheren Schleifenquests (da gabs nur Münzen und Vorräte).[BR]Und die Aufgaben sind besser lösbar als die der Storyline-quests, wo bei mir grundsätzlich immer Schluss ist, sobald inno irgendwelche Gastrassengebäude in nicht notwendiger Anzahl fordert (aktuell ist grad wieder Schluss bei der quest Atelier, Landbau und Werkanlage gleichzeitig stehen zu haben- aus meiner Sicht reine Platzverschwendung und die Belohnung ist nicht wirklich ein Anreiz [smilie--sprite6] )"}, {"61": "Ich habe etwas Sorge wegen der Tagesaufgaben für die nächsten 2 Tage, wenn alle Produktionen für GA still stehen. Hoffe mal auf halbwegs passende Aufgaben."}, {"113": "War das nicht so?[BR] Es ist möglich, ohne wirkliche Verluste ein paar Tagesaufgaben auszulassen.[BR]Mein ich jedenfalls."}, {"135": "lovelymonster schrieb:\t\t\tWar das nicht so?[BR] Es ist möglich, ohne wirkliche Verluste ein paar Tagesaufgaben auszulassen.[BR]Mein ich jedenfalls.\t\tZum Vergrößern anklicken....Angeblich 86 Stück sind auslassbar, da stand irgendwas im Fragen zu Seasons Thema"}]