[{"6": "salandrine schrieb:\t\t\tUnd das alles gebe ich hin für einen 10 Min Zeitbooster?\t\tZum Vergrößern anklicken....Du rechnest also damit, dass du jedesmal einen 10 min Zeitbooster bekommst?[BR]Naja, wenns dir so wichtig ist: es sei dir gegönnt.  [smilie--sprite2]"}, {"4": "ustoni schrieb:\t\t\tDu rechnest also damit, dass du jedesmal einen 10 min Zeitbooster bekommst?[BR]Naja, wenns dir so wichtig ist: es sei dir gegönnt.  [smilie--sprite2]Zum Vergrößern anklicken....ich weiß nur, was ich bisher auf der Beta erhalten habe, und ja, dort waren es halt wirklich überwiegend 10 Min Zeitbooster, auch  mal ein 15 Min. Booster. [BR][BR]Die anderen Gewinne tauchen vielleicht 1 x in der Woche auf, also einer überhaupt, nicht jeder einmal. [smilie--sprite2]"}, {"6": "Manchmal kann man hier im Forum wirklich den Eindruck gewinnen, dass manche Spieler es gerne sehen würden, wenn Elvenar auf den Stand von 2017 zurück käme. Wieviel Spieler wohl nach so einer Änderung übrig blieben?[BR][BR]Das Spiel lebt von Veränderungen. Ohne stetige Entwicklung und Neuerungen wäre ich bestimmt nicht 7 Jahre bei diesem Spiel geblieben.[BR][BR]Warum kann man das neue Feature nicht erstmal auf sich zukommen lassen und sehen, was es nach einigen Monaten wirklich bringt? Warte doch einfach erstmal 2 bis 3 Seasons ab. Man muss ja nicht alles gleich schlecht reden.[BR][BR]Ist auch nicht jedes Feature immer was für alle Spieler. Der Kessel z.B. ist nichts, auf das ich viele Gedanken verschwenden werde und wird bei mir nur nebenbei laufen. Die Seasons sehe ich eher sehr positiv."}, {"120": "ich mach mich jetzt mal unbeliebt, aber wäre es nicht sinnvoller @Tacheless das Feedback zu einer Neuerung erst mit Einführung derselben freizuschalten? Für alles andere gibt es doch schon den beta-thread. [BR]Warum muss immer wieder alles tot diskutiert werden bevor es überhaupt live gegangen ist?"}, {"1": "Kassiopeia24 schrieb:\t\t\tich mach mich jetzt mal unbeliebt, aber wäre es nicht sinnvoller @Tacheless das Feedback zu einer Neuerung erst mit Einführung derselben freizuschalten? Für alles andere gibt es doch schon den beta-thread.[BR]Warum muss immer wieder alles tot diskutiert werden bevor es überhaupt live gegangen ist?\t\tZum Vergrößern anklicken....Hm, ganz einfach: wenn die Dinge live gehen, müsste man dann ja zeitnah einen Feedback Thread eröffnen. Was ist aber wenn dann ich z.B. erst Abends oder am nächsten Tag online bin? Und es, wenn es blöd läuft , mich auch in dem Moment auch nicht vertreten kann? [BR]Der Feedbackthread kann natürlich auch schon vorher genutzt werden. Das richtige Feedback kommt dann schon mit der Zeit."}, {"81": "Tacheless schrieb:\t\t\tDas richtige Feedback kommt dann schon mit der Zeit.\t\tZum Vergrößern anklicken....[BR]Die Aussage würde implizieren das alles bis zum Start des Features falsch sei.[BR]Feedback ist weder richtig noch falsch![BR][BR]Und ja 1 Tag vorher das Topic aufmachen als 4 Tage vorher wäre schon besser... [BR]Was wäre wenn Spielchen kann man bei jedem Thema spielen und dann läufts halt unter shit happens.[BR]Bis ja nicht alleine und das Forum würde ohne dich auch nicht unter gehen."}, {"17": "salandrine schrieb:\t\t\tIch weiß noch, dass ich z.B. in Kapitel 4 täglich die Quests durchsucht habe, um für meine Abholung der Stahlproduktion durch die Quests Werkzeuge zu erhalten. Auch in späteren Kapiteln war die Belohnung von 13.000 Werkzeugen Spitze gewesen.\t\tZum Vergrößern anklicken....erstmal ist es schon gut das das nervige geklickerei mit der Schleifenquest ein Ende hat.[BR]Kapitel 4 hab ich das auch nur 2-3 Tage gemacht als man mal alles ausbauen wollte, ist doch nur für die sich wieder was sparen wollen wichtig.[BR]Und nach meiner Beta Erfahrung spielt sich das Spiel jetzt als kleiner ganz anders als vor 5 Jahren, ich sag nur ständig Event, das auf jetzt zu übertragen finde ich schwierig."}, {"4": "Cole6666 schrieb:\t\t\tWürde sagen, dann wäre es eben so. Für konstruktives Feedback benötigt man eh eine gewisse Zeit und bis zum eröffnen des Threads, hätte sich schon (fast) jeder mit dem neuen Feature befasst, um detailreiches Feedback -[BR]statt: sieht gut aus, ob es wirklich was bringt schauen wir mal -[BR]geben zu können.[BR]Wäre aber nur ein Anreiz...Zum Vergrößern anklicken....Du vergisst, dass etliche, die ein frühes Feedback geben, aus ihren eigenen Erfahrungen aus der Beta berichten. So auch ich. [BR][BR]Und ich selbst lese sehr gerne vorab die Erfahrungen anderer, einfach, um mich besser darauf einstellen zu können und nicht unbedingt Dinge nur nach Versuch und Irrtum bewältigen zu können."}, {"104": "Cajoo schrieb:\t\t\tIch verstehe die Aufregung für den Seasonpass nicht. Wenn man die Belohnungen nicht mag, einfach nicht kaufen. Wenn niemand den kauft, dann wird Inno reagieren.\t\tZum Vergrößern anklicken....Das Problem ist, dass nicht alle Spieler 100% rational entscheiden können, Abzocke der Neulinge/ Kinder.[BR]Cajoo schrieb:\t\t\tSiehe auch den Turm in den Anfangszeiten. Hat auch niemand gespielt, bis die Belohnungen verbessert wurden.\t\tZum Vergrößern anklicken....Spielen oder nicht spielen ist was anderes als Diamant-Kauf.[BR][BR]Richtig gute Belohnungen für Geld hätte nebenbei auch seine Probleme im Balancing, Pay-To-Win.[BR]Man kann da einfach nicht anfangen ohne dass was schiefgeht. Naja, Erweiterungen + mehr Event-Gebäude gibt es schon immer, also auch mehr in die Richtung möglich. Geld-Städte halt viel besser.[BR][BR]littleFlex schrieb:\t\t\t... und wer felsenfest der Meinung ist, dass Feedback sowieso nichts bringt,[BR]der kann sich ja gerne auch die Buchstaben sparen...\t\tZum Vergrößern anklicken....Wie wäre es dieses Forum einzusparen wenn man nur positive Rückmeldungen erlaubt, alle anderen zensiert?[BR]Wenn Inno, das Forum, die Moderatoren alle kaputt sind, kann man halt nur das melden, bis Leuterung stattfindet.[BR][BR]Ich erwarte meine nächste Sperre, ist ja leichter als sich damit auseinanderzusetzen.."}, {"4": "ForgeS44 schrieb:\t\t\tDas Problem ist, dass nicht alle Spieler 100% rational entscheiden können, Abzocke der Neulinge/ Kinder.[BR][BR]Spielen oder nicht spielen ist was anderes als Diamant-Kauf.\t\tZum Vergrößern anklicken....Wen willst du hiermit schützen und warum? Dann müßtest du alle mögliche Werbung verbieten, z.B. vor allem solche von Elektromärkten, denn da gibt es wenig, was lebensnotwendig ist. [BR][BR]Die Aussage ist für mich hier ziemlich sinnbefreit."}, {"104": "Das allermeiste was Elektromärkte/ sonstige verkaufen hat schon genau die Funktion die das Geld wert ist und von breiten Schichten gekauft.[BR]Rest fragwürdiges vielleicht noch in Richtung 'Ziergegenstände', ein simples T-Shirt mit Sportmannschaft drauf = 10facher Preis, eine Handyhülle mit xy drauf teurer als normale mit gleicher Funktion, alles mit 'Adidas' drauf doppelt so teuer wie ohne.[BR]Gewiss auch manches problematisch.[BR][BR]Ob es das Spiel hier/ jedes Spiel braucht ist müßige Frage. Für Bezahlfunktionen darin wäre aber schon sinnvoll, sie in drei Kategorien einzuteilen:[BR]1. Pay-To-Win, echter (virtueller Spiel-)Vorteil fürs Geld, fraglich, aber eine Möglichkeit[BR]2. Ziergegenstände, da weiß jeder dass ohne Funktion, kann man kaufen oder nicht[BR]3. Vermeinlich gutes, glitzernd angepriesen, aber eigentlich sinnloses, für Geld. Opfer dann erhöht Unbedarfte + Kinder. Genauso bei Events die Zusätze, genauso viele Diamant-Buttons im Spiel[BR][BR]Wenn es hier Kategorie 3 ist, ehrlich zu kommunizieren."}, {"113": "salandrine schrieb:\t\t\tDu vergisst, dass etliche, die ein frühes Feedback geben, aus ihren eigenen Erfahrungen aus der Beta berichten. So auch ich.\t\tZum Vergrößern anklicken....Ja, das ist leider das Problem. Ich habe eine ganze Zeit den Beta-Thread nicht gelesen weil ich eben nicht gespoilert werden wollte.[BR][BR]Ich wünsche mir gelegentlich, die Beta-SpielerInnen würden ihren Enthusiasmus, ihre Erfahrungen in Beta auf Live zu teilen, noch ein wenig zügeln, damit nackte LivespilerInnen überhaupt eine Chance bekommen, ganz unbeleckt eigene Erfahrungen zu machen.[BR]Es wäre einfach nett, den Platz erst mal den nur Livespielern zu überlassen.[BR][BR]Und da live ungleich Beta ist, kann mensch sich ja nach einer Weile über Unterschiede oder nicht austauschen.[BR][BR]ForgeS44 schrieb:\t\t\tWie wäre es dieses Forum einzusparen wenn man nur positive Rückmeldungen erlaubt, alle anderen zensiert?\t\tZum Vergrößern anklicken....Das ist so ziemlicher Blödsinn, so viel, wie hier genörgelt und kritisiert wird, sehe ich nicht, dass nur positive Rückmeldungen erlaubt sind."}, {"103": "Niemand hat etwas gegen negative Kritik, wenn sie sachdienlich ist.[BR][BR]Einfach in jedem seiner Posts, egal zu welchem Thema, hinzuzufügen,[BR]dass alle Moderatoren schlecht sind, alle Inno-Mitarbeiter unfähig und das Spiel sowieso nur ein Ärgernis,[BR]ist weder sinnvolles Feedback, noch ordentliche Kritik.[BR][BR]Wenn man ständig in solcher Art und Weise hier im Forum agiert, muss man sich auch nicht wundern,[BR]wenn man nicht wirklich ernstgenommen wird.[BR][BR]Wer einen Post schreibt, schon direkt mit dem Zusatz, dass dafür eine Sperre erwartet wird,[BR]der zeigt doch sehr deutlich seinen Horizont und sein Verständnis eines Spielerforums..."}, {"1": "Und jetzt sind wir wieder alle lieb und kehren zum Thema, dem Feedback zu den Saisons, zurück. Konstruktive Kritik ist genauso gerne gesehen, wie positives Feedback. Jedoch bei allem immer von Abzocke zu reden, ist in keinster Weise konstruktiv und werden wir auch nicht (mehr) dulden. Bitte bedenkt, dass jeder Elvenar spielen kann, ohne auch nur einen Cent für das Spiel ausgeben zu müssen. Man hat immer noch die Möglichkeit, dennoch alle Features nutzen."}, {"32": "Erster Eindruck:[BR]super-kool! *_* ist wie ne nette kleine Herausforderung und hällt mich länger im Spiel - tolle Idee![BR][BR]Finde 3,000 Diamanten für den Saisonpass überzogen.[BR]-> 1,500 Dias - wie für die Königlichen Kisten bei Event - wären mMn angebrachter.[BR][BR]Zweiter Eindruck:[BR]definitiv herausfordernd - einige tagesaufgaben schaffe ich nicht einmal da ich meine stadt auf effizienz getrimmt habe[BR]> gut für eine breitere basis an spielern welche verschiedenst spielen."}, {"121": "Oder das ?????"}, {"32": "Minerva schrieb:Anhang 33784 ansehen[BR]Kann mir jemand helfen und sagen, was diese Quest Aufgabe ist?\t\tZum Vergrößern anklicken....[IMG]https://i.ibb.co/3v45hj9/https-de-forum-elvenar-com-index-php-attachments-1674728066783-png-33787.png[/IMG]"}, {"21": "TischFlasche schrieb:Anhang 33787 ansehenZum Vergrößern anklicken....Was soll den der übertriebene Rotstift?? Sind wir in der Schule Herr Lehrer ? Den Fragenthread sucht/findet doch keiner und Fragen gehören auch zum Feedback wo sie auch gefunden werden. [BR]Abgesehen davon: hier wird wieder alles halb ausgegoren vom Beta übernommen, und noch nichtmal übersetzt."}, {"4": "[IMG]https://i.ibb.co/dLBH0NT/https-de-forum-elvenar-com-index-php-attachments-1674728406205-png-33790.png[/IMG][BR][BR]und schon beim ersten Quest ist es passiert:[BR][BR]Ich bin seit Dienstag Abend bei den Tagesquests, die Erledigung der Aufgabe: Schließe 10 Zauberer Event Quests ab ist mir deshalb gar nicht möglich.[BR][BR]Mal sehen, was der Support dazu sagt[BR][BR]Und bitte keinen Empfehlung: Du kannst doch ablehnen. Es ist nicht richtig, mir eine unerfüllbare Aufgabe zu geben. [BR][BR]Nehme es zurück  und editiere: Der Quest ist noch da."}, {"29": "Die Einnahmen aus dem Saisons werden leider nicht im Event angerechnet. Die \"Querbeziehung\" wäre nicht schlecht gewesen."}]