[{"2": "...kuckst du da... https://idavis-elvenar.com/seasons.html ...bzw. tragst du da deine Werte ein..."}, {"28": "Ich habe mich im Hinblick auf die Auswahl der frischen wöchentlichen Quests gerade sehr gefreut, da sie mir ganz gut in meine persönliche GA-Planung passen.[BR][BR]Beispiel: Spoiler: wöchentliche Saison der Träume-Quests[IMG]https://i.ibb.co/RcZ2D9j/https-de-forum-elvenar-com-index-php-attachments-1679531422729-jpeg-34991.jpg[/IMG]"}, {"128": "Thebigunknown schrieb:\t\t\tIch habe mich im Hinblick auf die Auswahl der frischen wöchentlichen Quests gerade sehr gefreut, da sie mir ganz gut in meine persönliche GA-Planung passen.[BR][BR]Beispiel: Spoiler: wöchentliche Saison der Träume-QuestsAnhang 34991 ansehenZum Vergrößern anklicken....[BR]Das wird wohl die schnellste Wochenquest-Lösung aller Zeiten. [smilie--sprite2][BR][smilie--sprite8] [smilie--sprite8] [smilie--sprite8]"}, {"19": "Die Schleifen-Quest, die waren nervig und brachten nicht viel ![BR]Saison -  NUR mal ein 10% Werkzeug-Regen oder 10% Münz-Segen - wie viele Quest-Aufgaben hätte ich[BR]da machen müssen ???[BR][BR]Jetzt gewinnt man über die Saison ab und zu einen 10% Münz-Segen[BR]Aktuell könnte sogar ein 20% Münz-Segen kommen[BR]Mit der Zeit kommen einige zusammen, die man dann gut für ein GA verwenden KÖNNTE  [smilie--sprite2][BR][BR]Die vielen Events - der Turm der Ewigkeit - die Magische Akademie[BR]Von überall kommen die Münz-Segen rein[BR]Sack voll Münzen - bei einem GA - wo liegt da das Problem ?[BR][BR]GA und Saison[BR]Passt ganz gut[BR]In den Stufe 1 Manufakturen laufen die 2 Tages-Produktionen[BR]Mit den Erweckten - Erleuchteten-Güter-Manufakturen - gehen ja keine 1 Tages- oder 2 Tagesproduktionen -[BR]kann man die 3 Std. oder 9 Std. der Saison-Aufgaben erfüllen[BR][BR]Sehe das - wie immer - ganz locker [smilie--sprite6]"}, {"161": "Bei welchem Level seid ihr eigentlich aktuell?"}, {"28": "hannessabine schrieb:\t\t\tBei welchem Level seid ihr eigentlich aktuell?\t\tZum Vergrößern anklicken....Meinst Du die Anzahl der erreichten Meilensteine?"}, {"161": "Thebigunknown schrieb:\t\t\tMeinst Du die Anzahl der erreichten Meilensteine?\t\tZum Vergrößern anklicken....ja"}, {"150": "ick steh bei Meilenstein 45 80/130 und habe noch 1 Wochenquest offen[BR]nach Wochenquest wäre ick bei 46 20/xxx"}, {"50": "Wenn alle bisherigen Aufgaben der Saison erledigt wurden sollte man diese Anzeige haben -> [IMG]https://i.ibb.co/XF47XrP/https-de-forum-elvenar-com-index-php-attachments-1679675201643-png-35020.png[/IMG]"}, {"16": "OMcErnie schrieb:\t\t\tWenn alle bisherigen Aufgaben der Saison erledigt wurden sollte man diese Anzeige haben -> Anhang 35020 ansehenZum Vergrößern anklicken....Sicher? Ich bin nämlich zwar auch zwischen 46 und 47, hab aber 65/130[BR]"}, {"150": "@LexiTargaryen: bei dir ist der Saisonpass mit dabei weswegen dir mehr Blätter zur Verfügung stehen[BR]Nur müssten diese bei allen Aufgaben 150 Blätter mehr sein [smilie--sprite2]"}, {"16": "Ah das erklärt es. Das ist schon so lang her, dass ich das freigeschalten habe, das hab ich ganz vergessen *lach*"}, {"28": "hannessabine schrieb:\t\t\tBei welchem Level seid ihr eigentlich aktuell?\t\tZum Vergrößern anklicken....[IMG]https://i.ibb.co/TMLvjRc/https-de-forum-elvenar-com-index-php-attachments-1679699340030-jpeg-35042.jpg[/IMG][BR]ohne Saisonpass"}, {"112": "auch ohne Pass ...[BR][IMG]https://i.ibb.co/NTdYZw3/https-de-forum-elvenar-com-index-php-attachments-1679700236041-png-35043.png[/IMG]"}, {"113": "[IMG]https://i.ibb.co/JFrzgX0/https-de-forum-elvenar-com-index-php-attachments-seasonohnepass-png-35045.png[/IMG][BR][BR]ohne Pass"}, {"161": "Bin erst bei 41 (20/130)...[smilie--sprite9] Schaffe ich da Level 50 noch?"}, {"13": "hannessabine schrieb:\t\t\tBin erst bei 41 (20/130)...[smilie--sprite9] Schaffe ich da Level 50 noch?\t\tZum Vergrößern anklicken....lt. iDavis wäre das möglich > [iDavis] Seasons of Dreams [smilie--sprite6]"}, {"24": "Die Seasons sind vollkommen inkompatibel mit dem GA. Bisher hat Inno es sehr schön hinbekommen dass die einzelnen Spielelemente ineinandergreifen - Turnierspielen wird durch GA nicht behindert, Ga nicht durch Turm, etc... Im Gegenteil. Durch die völlig unterschiedlichen Aufgaben kombiniert mit dem Zeitlimit muss man sich nun aber zwischen Seasons und GA entscheiden - Weswegen mir nun mehrere Seasonspunkte fehlen (Ich kann keine Brote für Seasons backen, wenn ich gleichzeitig Schmiede fürs GA produzieren soll - Die Brote geben nichtmal Abzeichen !). Hier gehört eine bessere Harmonierung noch nachgebessert."}, {"128": "Ein paar Brote lassen sich doch schnell mal zwischendurch herstellen.[BR]Außerdem sind ein paar fehlende Seasonpunkte kein Problem...[BR]Ich hatte keine Schwierigkeiten bislang mit beiden Spielelementen."}, {"4": "ein paar Brote lassen sich vielleicht mal zwischendurch machen, aber nicht 77 Brote und ähnlich viele 15 min. Werkzeuge.[BR][BR]Insofern teilweise sehr inkompatibel"}]