[{"16": "77 Brote sind aber ja die wöchentlichen Quest, nicht die tägliche. [BR][BR]Da gibt es doch die Warteschlange falls man welche noch im Wechsel offen hat. Ich hab es noch nicht probiert/benötigt weil ich die tatsächlich meist nach 2, max. 3 Tagen durch hatte, aber von der Beschreibung im Wiki her, dürften da dann einfach die Quests hinten angereiht werden bei den wöchentlichen und du verlierst nichts, sofern du vor Ende der Saison wieder aufholst."}, {"61": "LexiTargaryen schrieb:\t\t\t77 Brote sind aber ja die wöchentlichen Quest, nicht die tägliche.[BR][BR]Da gibt es doch die Warteschlange falls man welche noch im Wechsel offen hat. Ich hab es noch nicht probiert/benötigt weil ich die tatsächlich meist nach 2, max. 3 Tagen durch hatte, aber von der Beschreibung im Wiki her, dürften da dann einfach die Quests hinten angereiht werden bei den wöchentlichen und du verlierst nichts, sofern du vor Ende der Saison wieder aufholst.\t\tZum Vergrößern anklicken....MEIN FEEDBACK, was nicht zur Diskussion steht und keine Tipps benötigt:  [BR][BR]Fand die Saison auch toll, bis das Abenteuer los ging. Ich spielen ein Event nicht, um irgendwelche Aufgaben auszulassen oder nachzuholen und ein Gemeinschafts-Event, wo jeder einzelne Spieler für den Erfolg der Gemeinschaft verantwortlich ist, hat das Ein-Spieler-Event einfach hinten anzustehen, sonst hab ich in einer Gemeinschaft nichts verloren. [BR][BR]Und darum sind solche Aufgaben für mich ein Programmierungsfehler und die Saison passt nicht ins Spiel, so wie sie jetzt ist."}, {"28": "Feytala1986 schrieb:\t\t\tmuss man sich nun aber zwischen Seasons und GA entscheiden\t\tZum Vergrößern anklicken....Feytala1986 schrieb:\t\t\tDie Seasons sind vollkommen inkompatibel mit dem GA.\t\tZum Vergrößern anklicken....Ich denke dass es nicht bei allen so ist.[BR][BR]Mir ist aber durchaus auch aufgefallen, dass die \"Seasons-Quests\" entweder gut zum GA passen, oder aber auch völlig inkompatibel zum GA ausfallen können. Ich sehe es für mich dann als zusätzliche \"Herausforderung\" wenn sie \"inkompatibel\" zum GA sind."}, {"135": "alf2021 schrieb:\t\t\tEin paar Brote lassen sich doch schnell mal zwischendurch herstellen.[BR]Außerdem sind ein paar fehlende Seasonpunkte kein Problem...[BR]Ich hatte keine Schwierigkeiten bislang mit beiden Spielelementen.\t\tZum Vergrößern anklicken....[BR]Ich habe das Problem, dass die tägliche Spielzeit damit deutlich ansteigt, wenn man denn alle Aufgaben abschliessen möchte.[BR][BR]Alle bisherigen Spielinhalte haben es verziehen, wenn man z.B. an einem Tag nur mal kurz morgens und abends zeit hatte. oder gar einen ganzen Tag nicht da war.[BR][BR]Zur Not konnte das Turnier auch ohne Zeitschleife durchgeboostert werden, dafür reicht im Urlaub theoretisch einmal die Woche einloggen.[BR]Die Seasons und diese nervigen Aufgaben erfordern deutlich mehr Onlinezeit.[BR]Ich habe schon diverse TagesAufgaben verpasst, weil ich z.B. Freitags zu spät zuhause war, und morgens keine Zeit hatte.[BR][BR]Jetzt stellt sich die Frage: Wieviele Tage im Monat darf ich mal das Haus verlassen, um eine Chance zu haben, alle Spielinhalte zu nutzen.[BR]Im Sommer wird das schlimm, vermutlich werde ich da keine einzige Getränke/Einfache Werkzeuge Aufgabe lösen.[BR][BR]Und zum GA - es ist halt auch einfach massiv unfair, wenn die eine Person schön Getränke fürs GA und die Saisons produzieren kann, die andere Person aber den halben Tag einfache Werkzeuge abarbeiten darf.[BR]Das kann schon entscheiden, welche GM aufs Treppchen kommt, und welche nicht.[BR][BR]Verpasste Tagesaufgaben sollten auch in die Schleife eingereiht werden, wie bei den Wochenaufgaben, das wäre das Mindeste."}, {"24": "ZeNSiErT schrieb:\t\t\tMEIN FEEDBACK, was nicht zur Diskussion steht und keine Tipps benötigt: [BR][BR]Fand die Saison auch toll, bis das Abenteuer los ging. Ich spielen ein Event nicht, um irgendwelche Aufgaben auszulassen oder nachzuholen und ein Gemeinschafts-Event, wo jeder einzelne Spieler für den Erfolg der Gemeinschaft verantwortlich ist, hat das Ein-Spieler-Event einfach hinten anzustehen, sonst hab ich in einer Gemeinschaft nichts verloren.[BR][BR]Und darum sind solche Aufgaben für mich ein Programmierungsfehler und die Saison passt nicht ins Spiel, so wie sie jetzt ist.\t\tZum Vergrößern anklicken....Meine Rede."}, {"154": "Für mich sind die Saison der Träume kein guter Ersatz für die Schleifenquests, es nervt die zeitliche Begrenzung in der sie erledigt werden sollen. [BR]Sie mutieren zur Dauerbeschäftigung und das stößt mich noch mehr ab.[BR][BR]Konsequenz daraus, wenn es gerade passt erledige ich sie, habe ich keine Zeit oder ist mir der Aufwand zu hoch lasse ich sie einfach verfallen, so super sind die Belohnungen ja nun auch wieder nicht."}, {"24": "Feejac schrieb:\t\t\tso super sind die Belohnungen ja nun auch wieder nicht.\t\tZum Vergrößern anklicken....[BR]Die Hälfte ist doch eh hinterm Diavorhang gesperrt..."}, {"4": "Auf der Beta gibts bei den Frühjahrs Seasons die Große Auktion  den großen Tiermarkt, ein fabelhaftes Kulturgebäude. Das verzaubert, poliert wird es sowieso, und ich brauch kaum noch etwas anders an Kultur.[BR][BR]Wenn da kommt, dann werde ich es mir holen. Bringt auf 5x5 in Kapitel 20 schon 85.000 Kultur mit. Verzaubere es und habe noch Kulturboost, dann haste da schon weit über 200.000 Kultur locker, eher weit mehr"}, {"8": "Feejac schrieb:\t\t\tFür mich sind die Saison der Träume kein guter Ersatz für die Schleifenquests, es nervt die zeitliche Begrenzung in der sie erledigt werden sollen.[BR]Sie mutieren zur Dauerbeschäftigung und das stößt mich noch mehr ab.[BR][BR]Konsequenz daraus, wenn es gerade passt erledige ich sie, habe ich keine Zeit oder ist mir der Aufwand zu hoch lasse ich sie einfach verfallen, so super sind die Belohnungen ja nun auch wieder nicht.\t\tZum Vergrößern anklicken....Du scheinst da alles richtig zu machen [smilie--sprite2][BR][BR]vergiss nicht:[BR]Die Schleifenquests boten gar nichts an Belohnung. Egal wieviel du von Ihnen erledigt hast... Es war ne verdammte Frechheit, was du da gewinnen konntest... 100k Gold? 200 k Gold? Lachhaft![BR]Jetzt?[BR]Jetzt gibts nen Brunnen der Träume... Ein richtig krasses Managebäude! Klar, gegen die Ruinen stinkts ab... Es ist aber besser als alles andere Herkömmliche.[BR]Außerdem gibts:[BR]Jede Menge Güter, mit denen du doofe quests beenden kannst... gebäude, die du verpasst hast... oder einfach WP und Truppensegen, die sowieso nie schaden können...[BR]Klar, isses nicht die Welt... aber immerhin![BR][BR]Die richtig tollen Preise sollst du eh im event gewinnen oder für dias kaufen... daran hat sich nix geändert."}, {"156": "Ich habe gerade den  wunderschönen Brunnen der Träume in mein Inventar aufnehmen können[BR]und kann es nun gar nicht erwarten,dieses Schmuckstück in meiner Stadt zu platzieren.Ich[BR]glaube,dass ich sehr viel Glück hatte,denn ich musste nur 1x etwas tauschen und bin ziemlich[BR]gut durch die Saison der Träume gekommen.Mir hat das Spaß gemacht aber mir ist auch[BR]klar,dass das nicht bei jedem der Fall ist oder war.Ich wünschte aber,dass es bei allen so wäre[BR]wie bei mir(ziemlich naiv,ich weiß aber genauso gemeint).[smilie--sprite1]"}, {"125": "Lightning31 schrieb:\t\t\tIch habe gerade den  wunderschönen Brunnen der Träume in mein Inventar aufnehmen können[BR]und kann es nun gar nicht erwarten,dieses Schmuckstück in meiner Stadt zu platzieren.Ich[BR]glaube,dass ich sehr viel Glück hatte,denn ich musste nur 1x etwas tauschen und bin ziemlich[BR]gut durch die Saison der Träume gekommen.Mir hat das Spaß gemacht aber mir ist auch[BR]klar,dass das nicht bei jedem der Fall ist oder war.Ich wünschte aber,dass es bei allen so wäre[BR]wie bei mir(ziemlich naiv,ich weiß aber genauso gemeint).[smilie--sprite1]Zum Vergrößern anklicken....Freue mich für Dich - auch mir hat die Saison der Träume sehr gut gefallen und ich freue mich schon auf die nächste Saison[BR]Außerdem bin ich sehr, sehr froh, dass es die Schleifenquests nicht mehr gibt. Hoffe es bleibt so"}, {"128": "Lightning31 schrieb:\t\t\tIch habe gerade den  wunderschönen Brunnen der Träume in mein Inventar aufnehmen können[BR]und kann es nun gar nicht erwarten,dieses Schmuckstück in meiner Stadt zu platzieren.Ich[BR]glaube,dass ich sehr viel Glück hatte,denn ich musste nur 1x etwas tauschen und bin ziemlich[BR]gut durch die Saison der Träume gekommen.Mir hat das Spaß gemacht aber mir ist auch[BR]klar,dass das nicht bei jedem der Fall ist oder war.Ich wünschte aber,dass es bei allen so wäre[BR]wie bei mir(ziemlich naiv,ich weiß aber genauso gemeint).[smilie--sprite1]Zum Vergrößern anklicken....[BR]WAS?[BR][BR]Ich brauche noch 85 Punkte, fühle mich total benachteiligt und gebe auf.[BR][BR]Gibt ein Katzenavatar von Leo Extrapunkte?"}, {"3": "Huh, wieso seit ihr schon durch? Ich bin erst bei Stufe 48.[BR]Wie habt ihr das gemacht?[BR][BR]Dabei habe ich doch fast alle Tagesquests mitgenommen, außer ich habe es öfter vergessen als ich denke...[BR]Aber es kommt ja noch eine Woche, ich kann's noch schaffen.[BR][BR]@alf2021[BR]\t\t\tGibt ein Katzenavatar von Leo Extrapunkte?\t\tZum Vergrößern anklicken....Nee, glaub nicht... ich wundere mich ja auch![BR][BR]Nicht aufgeben, Alf, das klappt noch!"}, {"13": "Fayence schrieb:\t\t\tHuh, wieso seit ihr schon durch? [...] Wie habt ihr das gemacht?\t\tZum Vergrößern anklicken....... moin, der 'Saison Pass' gewährt 150 Blütenblätter 'on top'; ohne Pass landest du max. hier > [IMG]https://i.ibb.co/GpqfGPk/https-de-forum-elvenar-com-index-php-attachments-image937146877951-jpg-35167.jpg[/IMG] [smilie--sprite1]"}, {"3": "Waaaaas?[BR]Dann kann ich den Brunnen gar nicht bekommen? [smilie--sprite10]"}, {"156": "alf2021 schrieb:\t\t\tGibt ein Katzenavatar von Leo Extrapunkte?\t\tZum Vergrößern anklicken....Ich glaube nicht,dass es daran lag.Nicht aufgeben Alf,wie meine Katzenschwester Fayence schon geschrieben hat.[smilie--sprite1][BR]Handelsbaron schrieb:\t\t\tFreue mich für Dich - auch mir hat die Saison der Träume sehr gut gefallen und ich freue mich schon auf die nächste Saison\t\tZum Vergrößern anklicken....Vielen  lieben Dank,@Handelsbaron .[smilie--sprite1]"}, {"13": "Fayence schrieb:\t\t\tWaaaaas? [smilie--sprite10]Zum Vergrößern anklicken....Sollte abhängig vom Questfortschritt ggf. noch drin sein. Du kannst es via [iDavis] Saison of Dreams fix kalkulieren."}, {"3": "Ja, sollte passen.[BR]Also, ich rechne mal:[BR]Fehlen noch 260[BR]Zwei Wochenquests sind noch offen: 140[BR]Vier Wochenquests kommen noch: 280[BR]44 Tagesquests: 220[BR][BR]Sollte doch passen, oder?[BR][BR]Nachtrag: Auch iDavis räumt mir Chancen ein... selbst wenn meine Rechnung hier vielleicht nicht stimmt"}, {"156": "@Fayence ,du schaffst das.Ich drücke dir beide Daumen(Pfoten),liebe Katzenschwester.[BR]Den wunderschönen Brunnen habe ich inzwischen aufgestellt und kann ihn nun bewundern.[smilie--sprite1]"}, {"2": "ja - da ist noch genug Luft [smilie--sprite2]"}]