[{"16": "Fayence schrieb:\t\t\tHuh, wieso seit ihr schon durch? Ich bin erst bei Stufe 48.[BR]Wie habt ihr das gemacht?[BR][BR]Dabei habe ich doch fast alle Tagesquests mitgenommen, außer ich habe es öfter vergessen als ich denke...[BR]Aber es kommt ja noch eine Woche, ich kann's noch schaffen.\t\tZum Vergrößern anklicken....Alle Wöchentlichen Quests erledigt (und soweit ich mich entsinne auch alle täglichen) + Season Pass[BR]Aber es geht ja auch noch eine Woche, also denke ich solltest du das auch noch schaffen."}, {"3": "Super, danke für eure hilfreichen Antworten!!![BR][BR]Ich freue mich doch so auf den Brunnen! Der ist echt schön!"}, {"28": "Fayence schrieb:\t\t\tWaaaaas?[BR]Dann kann ich den Brunnen gar nicht bekommen?\t\tZum Vergrößern anklicken....Doch, Du schaffst das schon! Ich glaube an dich und drücke dir die Daumen dass es klappt! [smilie--sprite2][BR]Fayence schrieb:\t\t\tIch freue mich doch so auf den Brunnen! Der ist echt schön!\t\tZum Vergrößern anklicken....Der \"Brunnen der Träume\" ist echt hübsch geworden, auf beta hat er bei mir nur wenige Sekunden im Inventar verbracht und direkt eine Ehrenplatz nahe dem Haupthaus bekommen, den er auch möglichst lange behalten soll.[BR][BR]Ich bin mit den Saisons allgemein immer noch sehr zufrieden, da sie mir unabhängig von den Events mehrere schicke und nützliche beschwörbare Gebäude eingebracht haben und ich dafür keinen großen Aufwand betreiben musste."}, {"8": "alf2021 schrieb:Gibt ein Katzenavatar von Leo Extrapunkte?Zum Vergrößern anklicken....Ein Zwergenavatar mit Feueraugen gibt 200 Bonuspunkte und trotzdem fehlen mir noch 300 Punkte![BR][BR]alf2021 schrieb:\t\t\tIch brauche noch 85 Punkte, fühle mich total benachteiligt und gebe auf.\t\tZum Vergrößern anklicken....Ja, lass uns aufgeben und ein paar Mai Tai auf unser Versagen trinken.[BR][BR]Prost [smilie--sprite2]"}, {"3": "300 Punkte?[BR]Schaffst du! Die 44 Tagesquests und 4 Wochenquests sollten reichen.[BR]@gergerw, ein Zwerg mit Feueraugen gibt nicht so schnell auf![BR]Ein Mai Tai und dann weiter!"}, {"8": "JAAAAA muuuuhaaaaaaaaar!!!! [smilie--sprite8]"}, {"3": "Geschafft, der wunderschöne Brunnen steht in der Stadt  [smilie--sprite1]"}, {"162": "Ich hab es auch geschafft aber noch keinen Platz gefunden [smilie--sprite1]"}, {"135": "Schade, dass die letzten Wochenaufgaben nur 5 Tage und 10 Stunden Zeit haben."}, {"163": "Xebifed schrieb:\t\t\tSchade, dass die letzten Wochenaufgaben nur 5 Tage und 10 Stunden Zeit haben.\t\tZum Vergrößern anklicken....Geht doch schnell wenn man glück hat [smilie--sprite1]"}, {"128": "Xebifed schrieb:\t\t\tSchade, dass die letzten Wochenaufgaben nur 5 Tage und 10 Stunden Zeit haben.\t\tZum Vergrößern anklicken....Das ist unmöglich zu schaffen."}, {"135": "alf2021 schrieb:\t\t\tDas ist unmöglich zu schaffen.\t\tZum Vergrößern anklicken....[BR]Nur mit Schlafentzug [smilie--sprite1][BR]Inkonsistent war von Anfang an die Beschreibung \"Komme nächste Woche wieder, um neue Wochenaufgaben\" - am Mittwoch abend."}, {"118": "[IMG]https://i.ibb.co/QXTDSF3/https-de-forum-elvenar-com-index-php-attachments-5be96a3e-8d3d-43e5-b476-01c63205c5d4-jpeg-35295.jpg[/IMG][BR][BR]WIE wählt man denn eine Kiste aus? Ich kann die in der App nicht switchen oder anklicken, es geht nur die mittlere?…"}, {"28": "Aleanca schrieb:\t\t\tWIE wählt man denn eine Kiste aus? Ich kann die in der App nicht switchen oder anklicken, es geht nur die mittlere?\t\tZum Vergrößern anklicken....Mahlzeit @Aleanca Die lilafarbenen Truhen kann man nur mit dem Saisonpass auswählen, ohne geht immer nur die hellblaue Truhe in der Mitte. [smilie--sprite2]"}, {"88": "Klar weil du den Season Pass nicht hast, der ermöglicht erst die lila Kisten."}, {"118": "Danke für die Erleuchtung [smilie--sprite1] !"}, {"149": "toller Wochequest: \"Schließe 10 Eventquest ab\"[BR]Ich bin bei den Tagesaufgaben und die Saison läuft nur noch 4 Tage.[BR]Fühle mich irgendwie vera.....[BR][BR]Edit.: Gelöst. Gibt ja auch noch die Tauschfunktion. Die hatte ich ja gar nicht mehr auf den Schirm"}, {"164": "Also ich finde die Seasons eine echte Bereicherung. Wenn man die früheren Schleifenquests bedenkt, ist sowohl die Aufgabenstellung als auch die Belohnung die zu erwarten ist, echt nice. Tauschfunktion von Wochenaufgaben sorgt für wenig Frust, wenn mal was nicht so passt. Gerne weiter so ! Auch wenn man mal was verpasst, ist es nicht tragisch und die Seasons dennoch gut abschließbar."}, {"87": "In Arendyll habe ich 15/130 Blütenblätter, keine Kisten:[BR][IMG]https://i.ibb.co/j8DVb2H/https-de-forum-elvenar-com-index-php-attachments-1680805994584-png-35297.png[/IMG][BR]In Winyandor habe ich auch 15/130 Blütenblätter, aber dort habe ich die Kisten:[BR][IMG]https://i.ibb.co/rpSTr8X/https-de-forum-elvenar-com-index-php-attachments-1680806114829-png-35298.png[/IMG][BR]Ist das ein Fehler? Oder übersehe ich da was?[BR]Cookies habe ich gelöscht, Spiel neu gestartet."}, {"2": "@Cruller - welcher Meilenstein wird links angezeigt?..."}]