[{"87": "Romilly schrieb:\t\t\twelcher Meilenstein wird links angezeigt?...\t\tZum Vergrößern anklicken....Ahhh, der Meilenstein. [smilie--sprite11] Arendyll 50 und Winyandor 51. [BR]Danke, Romilly. [smilie--sprite1]"}, {"135": "In winy hast du 145, also die ersten 130 sind schon voll"}, {"165": "ich finde das modul toll [smilie--sprite1]"}, {"2": "...es gibt anscheinend 9 verschiedene Zusatztruhen...[BR][BR]3 sind für alle zugänglich...[BR][IMG]https://i.ibb.co/wh39XCS/https-de-forum-elvenar-com-index-php-attachments-3-png-35304.png[/IMG][IMG]https://i.ibb.co/CVhCsDh/https-de-forum-elvenar-com-index-php-attachments-4-png-35305.png[/IMG][IMG]https://i.ibb.co/sQRY1Rb/https-de-forum-elvenar-com-index-php-attachments-5-png-35306.png[/IMG][BR][BR]...und die anderen beiden Gruppen lassen sich nur auswählen, wenn man den Pass gekauft hat...[BR][BR][IMG]https://i.ibb.co/1rkVxcn/https-de-forum-elvenar-com-index-php-attachments-lila1-png-35307.png[/IMG][IMG]https://i.ibb.co/27B7hWj/https-de-forum-elvenar-com-index-php-attachments-lila3-png-35309.png[/IMG][IMG]https://i.ibb.co/f20sQv6/https-de-forum-elvenar-com-index-php-attachments-lila5-png-35311.png[/IMG][BR][BR][IMG]https://i.ibb.co/zVrjVmx/https-de-forum-elvenar-com-index-php-attachments-lila2-png-35308.png[/IMG][IMG]https://i.ibb.co/dcHWQFC/https-de-forum-elvenar-com-index-php-attachments-lila4-png-35310.png[/IMG][IMG]https://i.ibb.co/nr4Zfc9/https-de-forum-elvenar-com-index-php-attachments-lila6-png-35312.png[/IMG]"}, {"166": "Hallo zusammen,[BR][BR]ich habe dieses Spiel erst angefangen, Habe auch den neuen Forschungsbaum, was immer das bedeutet. Habe weder Turm noch Turnier freigeschaltet, da erst in kapitel 4 angekommen. Habe Aufgaben wie sammle Relikte, verwende Zauber, erwirtschafte Zauberspruchfragmente, sammle Visionsschwaden. Ich habe keine Ahnung wie ich diese Aufgaben lösen soll???[BR]Ich  bin mehr als frustriert und macht echt keinen Spass. Wenn man schon den Forschungsbaum ändert, vielleicht sollte man auch für die kleinen die Aufgaben anpassen, damit diese lösbar sind.?[BR][BR]Danke.[BR][BR]LG und schöne Ostern[BR]Joy"}, {"126": "SirJoy schrieb:\t\t\tHallo zusammen,[BR][BR]ich habe dieses Spiel erst angefangen, Habe auch den neuen Forschungsbaum, was immer das bedeutet. Habe weder Turm noch Turnier freigeschaltet, da erst in kapitel 4 angekommen. Habe Aufgaben wie sammle Relikte, verwende Zauber, erwirtschafte Zauberspruchfragmente, sammle Visionsschwaden. Ich habe keine Ahnung wie ich diese Aufgaben lösen soll???[BR]Ich  bin mehr als frustriert und macht echt keinen Spass. Wenn man schon den Forschungsbaum ändert, vielleicht sollte man auch für die kleinen die Aufgaben anpassen, damit diese lösbar sind.?[BR][BR]Danke.[BR][BR]LG und schöne Ostern[BR]Joy\t\tZum Vergrößern anklicken....Ganz ehrlich, so richtig gut und lösbar ist vieles erst, wenn man Turnier und Turm spielen kann und die Magische Akademie ausgebaut ist, damit du Zauber und Kombinationsauslöser schneller herstellen kannst. Wenn du von Questbelohnungen und später im Turm Diamanten gewinnst, nutze die als erstes für den Ausbau der Akademie.[BR][BR]Relikte bekommst du abgesehen vom Turnier schon in Provinzbegegnungen. Zauberspruchfragmente bekommst du abgesehen vom Turm schon, wenn du Items wie Gebäude im Lager entzauberst. [BR]Verzauberungen und Relikte kannst du auch aus den Bonuskisten der Nachbarschaftshilfe bekommen (maximal 3 pro Tag)[BR]Visionsschwaden kannst du bekommen, wenn du im Handwerk der Magischen Akademie Sachen herstellst.[BR][BR]Komm erst mal im Spiel an, die Seasons bleiben für länger. Nimm einfach mit, was du an Belohnungen bekommen kannst, ab Kapitel 5 wird es besser und je besser du dich im Spiel auskennst, umso einfacher wird alles.[BR][BR]Und ja, Anpassungen für kleinere Spieler wären sowohl in der Season als auch im Event sehr wünschenswert mit dem neuen Forschungsbaum, erlebe ich in meiner 2. Beta-Stadt gerade auch, die noch in Kapitel 3 steht."}, {"166": "Souliena schrieb:\t\t\tGanz ehrlich, so richtig gut und lösbar ist vieles erst, wenn man Turnier und Turm spielen kann und die Magische Akademie ausgebaut ist, damit du Zauber und Kombinationsauslöser schneller herstellen kannst. Wenn du von Questbelohnungen und später im Turm Diamanten gewinnst, nutze die als erstes für den Ausbau der Akademie.[BR][BR]Relikte bekommst du abgesehen vom Turnier schon in Provinzbegegnungen. Zauberspruchfragmente bekommst du abgesehen vom Turm schon, wenn du Items wie Gebäude im Lager entzauberst.[BR]Verzauberungen und Relikte kannst du auch aus den Bonuskisten der Nachbarschaftshilfe bekommen (maximal 3 pro Tag)[BR]Visionsschwaden kannst du bekommen, wenn du im Handwerk der Magischen Akademie Sachen herstellst.[BR][BR]Komm erst mal im Spiel an, die Seasons bleiben für länger. Nimm einfach mit, was du an Belohnungen bekommen kannst, ab Kapitel 5 wird es besser und je besser du dich im Spiel auskennst, umso einfacher wird alles.[BR][BR]Und ja, Anpassungen für kleinere Spieler wären sowohl in der Season als auch im Event sehr wünschenswert mit dem neuen Forschungsbaum, erlebe ich in meiner 2. Beta-Stadt gerade auch, die noch in Kapitel 3 steht.\t\tZum Vergrößern anklicken....Danke Souliena, ich versuche was ich kann und gebe nicht auf. Aber deprimierend ist es schon. Will ja auch vorwärts kommen  und gebe mir Mühe. Nur Schade das Inno die Leistungen kleiner Spieler nicht honoriert. sondern mann  mit Angeboten von Diakäufen bombadiert wird.  Dafür bin ich dann wieder gut genug.  Werde ich nicht machen, Aber vielleicht irgendwann......, passt Inno es an.[BR][BR]Schöne Ostern Dir gewünscht.[BR]LG"}, {"159": "SirJoy schrieb:\t\t\tDanke Souliena, ich versuche was ich kann und gebe nicht auf. Aber deprimierend ist es schon. Will ja auch vorwärts kommen  und gebe mir Mühe. Nur Schade das Inno die Leistungen kleiner Spieler nicht honoriert. sondern mann  mit Angeboten von Diakäufen bombadiert wird.  Dafür bin ich dann wieder gut genug.  Werde ich nicht machen, Aber vielleicht irgendwann......, passt Inno es an.[BR][BR]Schöne Ostern Dir gewünscht.[BR]LG\t\tZum Vergrößern anklicken....Das ist uns allen so ergangen[smilie--sprite2] Und trotzdem find ich nicht,dass uns alles gleich in den \" Schoss\" fallen muss. Vorwärts kommen wirst auch so, gerade wenn in einer guten Gemeinschaft bist, die Dir beim wachsen hilft. Und glaub mir, bei der nächsten Saison der Träume, wird es leichter fallen. Es ist auch hier ein wenig wie im realen Leben, man muss es sich erst erarbeiten[smilie--sprite1]"}, {"166": "Hornuss schrieb:\t\t\tDas ist uns allen so ergangen[smilie--sprite2] Und trotzdem find ich nicht,dass uns alles gleich in den \" Schoss\" fallen muss. Vorwärts kommen wirst auch so, gerade wenn in einer guten Gemeinschaft bist, die Dir beim wachsen hilft. Und glaub mir, bei der nächsten Saison der Träume, wird es leichter fallen. Es ist auch hier ein wenig wie im realen Leben, man muss es sich erst erarbeiten[smilie--sprite1]Zum Vergrößern anklicken....Danke Hornuss, es geht mir nicht um in den Schoss fallen, sondern um die Möglichkeit die geforderten Aufgaben zu erfüllen. Dies ist in meiner Größe nicht möglich, daher bitte ich um Anpassung, danke."}, {"159": "Vielleicht muss/kann man am Anfang auch auf was verzichten und sich auf's nächste freuen ? [smilie--sprite2]  den allermeisten von uns ist es so ergangen. Und auch ich hab dazu gehört. Mich und viele andere hier,hat es angespornt, grösser und besser zu werden um so viele Ziele zu erreichen."}, {"153": "Wo bliebe die Motivation, wenn man von Beginn weg schon komplett alles erreicht? Elvenar ist auf mehrere Jahre Spielzeit ausgelegt, das macht hier (für mich) einen grossen Teil des Reizes aus."}, {"102": "Mit Elvenar habe ich 2017 begonnen und erinnere mich noch gut an meine ersten Eventaufgaben - hatte überhaupt keine Ahnung und war glücklich, wenn ich den einen oder anderen \"Treffer\" mit einer erfüllten Aufgabe erzielt habe. Freute mich über die Gewinne - denn gerade am Anfang kann man wirklich alles gebrauchen.[BR][BR]Im Forum las ich dann Einiges zu den Events und so langsam blickte ich durch. Allerdings habe ich auch nie erwartet, dass ich als Anfänger gleich alles lösen kann. [BR]Vielleicht setzten sich die neuen Spieler mit einer zu großen Erwartungshaltung eindach selbst unter Druck. [BR][BR]Ich muss aber auch dazu sagen, dass zu meiner Anfangszeit insgesamt auch hier im Forum anders über Events geschrieben wurde. Da überwog die Freude über die zusätzlichen Gewinne und es war einfach eine positive Grundstimmung da. Freude am Spiel und man freute sich über das, was man erreicht hatte und stellte sich keine unrealistischen Ziele. [BR][BR]Leider hat sich diese Grundhaltung verändert und es geht in vielen Beiträgen nur noch darum, das Spiel schlechtzureden bzw. Forderungen zu stellen mit dem Grundtenor - möglichst alles haben zu wollen aber wenig dafür tun zu müssen. [BR][BR]Das ist mein persönliches Empfinden und ich lese immer weniger im Forum, weil mir das einfach keinen Spaß mehr macht.[BR][BR]An die neuen Spieler kann ich nur appelieren, sich Zeit zu nehmen, die Spielmechaniken zu erkennen und erst einmal eine kleine Stadt zu entwickeln. Nach und nach kommen dann auch die Erfolge in Events und je weiter man kommt, umso mehr Freude macht das Spiel. [BR]Sicher wäre es auch besser, die Aufgaben etwas anzupassen - aber da würde ich eher an die Aufgaben mit Relikten denken, denn diese Aufgaben verführen viele Anfänger leider dazu, sich zu überscouten - sprich zu schnell zu viele Provinzen freizuschalten."}, {"167": "Ich finde die Saison sehr gut gelungen und bin froh, dass die doch oft sinnfreien Schleifenquests mit dem mageren Belohnung damit ersetzt wurden. [BR]Besonders gut - man kann die Gewinne liegen lassen und die Werte werden bei Kapitelwechsel dann dem neuen angepasst. So konnte ich einige gute Gebäude im neuen Kapital direkt aufstellen."}, {"68": "Da hat der Osterhase wohl in der Nacht 4 Gemüsekörbe produziert und abgeholt und auch noch 1 Relikt gesammelt[BR][BR][IMG]https://i.ibb.co/zX95m6Z/https-de-forum-elvenar-com-index-php-attachments-1681032698803-png-35334.png[/IMG][BR][BR]aber abholen geht trotzdem nicht! Schade eigentlich."}, {"55": "Zauberwort heißt Reelogg"}, {"168": "Tacheless schrieb:\t\t\tLiebe Menschen und Elfen,[BR][BR]wir sind wirklich gespannt, wie ihr über das neue Feature \"Die Saisons\" denkt. Lasst es uns in diesem Thread wissen![BR][BR]Fragen zum Thema \"Saison der Träume\" oder generell zu den Saisons? Dann bist du im Fragethread besser aufgehoben![BR][BR]Viele Grüße[BR]Euer Elvenar Team\t\tZum Vergrößern anklicken....Hallo liebes Elvenar-Team,[BR][BR]Ich empfand \"Saison der Träume\" als ein sehr schönes Event. Leider geht es jetzt zu Ende.[BR]Ist ein neues Event dieser Art geplant? ich würde mich freuen.[BR][BR]Liebe Grüße[BR]Pitchater"}, {"2": "Pitchater schrieb:\t\t\tIst ein neues Event dieser Art geplant? ich würde mich freuen\t\tZum Vergrößern anklicken.......ja - die \"Saison der Freude\" (Season of Joy) läuft bereits auf Beta..."}, {"169": "Also auch wenn ich hier nicht soooo aktiv bin, möchte ich kurz meine Meinung kundtun.[BR]Von der Grafik, dem Aufbau und auch von den Anforderungen her eine glatte 1[BR]Die Tagespreise sind \"nettes Beiwerk\", genau wie die Wochenpreise.[BR][BR]Eine 3- vergebe ich aber was die \"Endpreise\" angeht.[BR]Wenn man alle Tagesaufgaben und Wochenaufgaben beendet, ist es ein wenig \"traurig\", wenn man dann 3 Kisten hat, aus denen man \"7x Altes Wissen\" (bin jetzt bei fast 10.000), Zeitbooster 1*5 Stunden (100x) und  1x Vorratsregen - 100% (25x) \"gewinnt\".[BR]Hier hätte ich mir schon ein spezielleres Geäude (Magische Werkstatt oder Gebäude) o.ä. als festen Preis gewünscht und nicht dieses %-anteilige Glücksspiel, bei dem die Chancen sowieso sehr gering sind.[BR][BR]Ist nur meine Meinung und ja - es ist wesentlich mehr als das was \"die Kleinen\" und Neulinge gewinnen können ;-)"}, {"170": "monster68 schrieb:\t\t\tAlso auch wenn ich hier nicht soooo aktiv bin, möchte ich kurz meine Meinung kundtun.[BR]Von der Grafik, dem Aufbau und auch von den Anforderungen her eine glatte 1[BR]Die Tagespreise sind \"nettes Beiwerk\", genau wie die Wochenpreise.[BR][BR]Eine 3- vergebe ich aber was die \"Endpreise\" angeht.[BR]Wenn man alle Tagesaufgaben und Wochenaufgaben beendet, ist es ein wenig \"traurig\", wenn man dann 3 Kisten hat, aus denen man \"7x Altes Wissen\" (bin jetzt bei fast 10.000), Zeitbooster 1*5 Stunden (100x) und  1x Vorratsregen - 100% (25x) \"gewinnt\".[BR]Hier hätte ich mir schon ein spezielleres Geäude (Magische Werkstatt oder Gebäude) o.ä. als festen Preis gewünscht und nicht dieses %-anteilige Glücksspiel, bei dem die Chancen sowieso sehr gering sind.[BR][BR]Ist nur meine Meinung und ja - es ist wesentlich mehr als das was \"die Kleinen\" und Neulinge gewinnen können ;-)\t\tZum Vergrößern anklicken....Wenn du so viel altes Wissen hast, solltest du es vielleicht auch mal verwenden um Wunder auszubauen. Auch die Zeitbooster und Werkzeugsegen bringen nur etwas, wenn sie auch verwendet werden und nicht endlos gehortet. [smilie--sprite8][BR][BR]Da es die Saisons jetzt allgemein gibt anstatt der Schleifenquests, ist doch ein Gewinn zusätzlich schon besser als nur Gold und Werkzeug."}, {"3": "Ich fand die Seasons toll und freue mich auf die nächsten![BR]Heute zum Abschluss in der Tagestruhe noch eine Portion erleuchteter Güter gewonnen - sehr willkommen.[BR]Gestern in der letzten Zusatzkiste (der einen, weil ich die zwei anderen der 3 nicht freigeschaltet hatte), oh Wunder, war ein kleines Gebäude drin. Ein Friedhof mit Geisterfuchs und Hase.[BR]Darüber habe ich mich besonders gefreut, weil ich irgendwie dachte, da wäre nur \"langweiliges\" Zeug drin."}]