[{"102": "Mir hat diese neue Spielvariante auch sehr gut gefallen.[BR][BR]Das Einzige, was ich zu bemängeln habe ist, dass auch bei den Wochenaufgaben die Machbarkeit mehr Beachtung finden sollte.[BR]Am meisten stört mich, dass es eine Aufgabe gibt, bei der 10 Eventaufgaben zu lösen sind. Diese Aufgabe ist aber innerhalb von 7 Tagen nicht lösbar, wenn man im Event bereits bei den Tagesaufgaben angekommen ist.[BR][BR]Wäre schön, diese dann auch auf 7 Eventaufgaben anzupassen - unabhängig von der Möglichkeit, diese Aufgabe zu tauschen."}, {"104": "monster68 schrieb:\t\t\tEine 3- vergebe ich aber was die \"Endpreise\" angeht.[BR]Wenn man alle Tagesaufgaben und Wochenaufgaben beendet, ist es ein wenig \"traurig\", wenn man dann 3 Kisten hat, aus denen man \"7x Altes Wissen\" (bin jetzt bei fast 10.000), Zeitbooster 1*5 Stunden (100x) und 1x Vorratsregen - 100% (25x) \"gewinnt\".[BR]Hier hätte ich mir schon ein spezielleres Geäude (Magische Werkstatt oder Gebäude) o.ä. als festen Preis gewünscht und nicht dieses %-anteilige Glücksspiel, bei dem die Chancen sowieso sehr gering sind.\t\tZum Vergrößern anklicken....Der Endpreis kam davor, ein recht gutes Mana-Gebäude.[BR]Die Kisten sind nur in Wiederholung, wenn man darüber hinaus noch fließig Punkte sammelt, statt jene ganz verfallen zu lassen."}, {"171": "Wird \"Saison der Träume\" wiederholt oder war es das schon?"}, {"135": "Marethyu schrieb:\t\t\tWenn du so viel altes Wissen hast, solltest du es vielleicht auch mal verwenden um Wunder auszubauen. Auch die Zeitbooster und Werkzeugsegen bringen nur etwas, wenn sie auch verwendet werden und nicht endlos gehortet. [smilie--sprite8][BR][BR]Da es die Saisons jetzt allgemein gibt anstatt der Schleifenquests, ist doch ein Gewinn zusätzlich schon besser als nur Gold und Werkzeug.\t\tZum Vergrößern anklicken....[BR]WP Segen und Zeitbooster werden aus verschiedensten Gründen \"gehortet\".[BR]Sei es um ein neu erforschtes Wunder schnell hochzuziehen, oder für mehr Abzeichen im GA, und und und.[BR][BR]Ich hab auch lieber einen ordentliche Vorrat und muss dann, wenn es nötig ist, nicht erst lange überlegen, ob ich von meinen 2x5h Zeitboostern einen verwenden soll. Ich klicke da einfach 7x drauf und dann ist das Wunder ausgebaut.[BR][IMG]https://i.ibb.co/pw33wc3/https-de-forum-elvenar-com-index-php-attachments-1681211601175-png-35360.png[/IMG][BR][BR]Hilft auch bei den Wochenaufgaben, wenn man aus Zeitdruck schnell ein paar 9 Stunden Produktionen braucht"}, {"170": "Xebifed schrieb:\t\t\tWP Segen und Zeitbooster werden aus verschiedensten Gründen \"gehortet\".[BR]Sei es um ein neu erforschtes Wunder schnell hochzuziehen, oder für mehr Abzeichen im GA, und und und.[BR][BR]Ich hab auch lieber einen ordentliche Vorrat und muss dann, wenn es nötig ist, nicht erst lange überlegen, ob ich von meinen 2x5h Zeitboostern einen verwenden soll. Ich klicke da einfach 7x drauf und dann ist das Wunder ausgebaut.[BR]Anhang 35360 ansehen[BR][BR]Hilft auch bei den Wochenaufgaben, wenn man aus Zeitdruck schnell ein paar 9 Stunden Produktionen braucht\t\tZum Vergrößern anklicken....Klar hilft es ein paar auf der Seite zu haben, aber dann jammert man auch nicht, wenn man welche bekommt"}, {"148": "Alidona schrieb:\t\t\tWird \"Saison der Träume\" wiederholt oder war es das schon?\t\tZum Vergrößern anklicken....Auf Beta läuft schon die Season of Joy"}, {"135": "Marethyu schrieb:\t\t\tKlar hilft es ein paar auf der Seite zu haben, aber dann jammert man auch nicht, wenn man welche bekommt\t\tZum Vergrößern anklicken....Ja, kommt natürlich auf den Aufwand an, für dem man sie bekommt. In diesem Fall waren es ja scheinbar schon die Zusatzkisten, von daher schon ok, da keine magischen Gebäude reinzupacken."}, {"13": "Die \"Saisons\" sind für mich ein durchaus willkommenes Feature. Das Lösen der Quests lief ziemlich geschmeidig und es ergaben sich glücklicher Weise bei mir keine Konflikte zwischen den Quests und dem aktuellen Spielablauf, sodass die 'Tausch-Funktion' nicht zum Einsatz kam; aus diesem Grund mag ich nicht beurteilen, wie sich ein solcher Sachverhalt auswirken würde. Der Vorschlag von Anoli2 #465, die geforderte Anzahl der ggf. zu lösenden Event-Quest zu reduzieren, scheint mir da eine sinnvolle Lösung, um diesen potenziellen \"Konflikt\" zu entschärfen.[BR][BR]Die möglichen Belohnungen für die Tages-Quest waren wahrlich kein Brüller und zählen für mich daher nur als nettes 'Beibrot'.[BR]Eine \"Warteschlagenfunktion\" für die Tages-Quests wäre sicherlich wünschenswert, da schließ' ich mich Feejac #280 an, auch wenn dies wohl nicht im Interesse von Inno läge.[BR][BR]Einen Anreiz, zusätzliche Belohnungen und weitere Saisonsegen-Optionen über den 'Saison Pass' zu erhalten, habe ich persönlich nicht empfunden, dafür waren die Gebäude-Parameter und mögliche Extras sowie die zusätzlichen Belohnungsoptionen beim 'Saison Pass' für mich nicht reizvoll genug.[BR]Meine Motivation, mir zusätzliche Vorteile durch den Erwerb des 'Saison Passes' zu verschaffen, war somit gleich zéro."}, {"171": "Martia schrieb:\t\t\tAuf Beta läuft schon die Season of Joy\t\tZum Vergrößern anklicken....[BR]Danke schön, @Martia"}, {"100": "Ich mag die Season . [BR]Und meine nicht abgeholten Preise wurden gutgeschrieben   , dafür danke"}, {"113": "Ich war heute etwas irritiert, als ich keinen Saisonsknopf gesehen habe und musste erst mal nachsehen, wie lange das Ereignis laufen sollte.[BR][smilie--sprite2][BR][BR]Will sagen, ich hatte mich schon sehr an diese Aufgaben gewöhnt. [BR]Das ganze Event hat mir gut gefallen, es hat mich ermuntert, Aufgabe zu erledigen, die ich sonst wohl nicht getan hätte. Damit hatte ich Gelegenheit, meine Spielroutine zu unterbrechen, was ich sehr willkommen heiße. Ich mag Abwechslung, gleichbleibende Abläufe finde ich schnell langweilig und dann höre ich auf, zu spielen.[BR][BR]Jetzt freue ich mich auf die nächste Saison."}, {"2": "...schön, daß die neue Saison nun endlich begonnen hat - aber warum muss man den Preispass nun gegen Echtgeld freischalten?[BR][BR][IMG]https://i.ibb.co/t4b4Crm/https-de-forum-elvenar-com-index-php-attachments-preispass-png-35868.png[/IMG]"}, {"6": "Romilly schrieb:\t\t\taber warum muss man den Preispass nun gegen Echtgeld freischalten?\t\tZum Vergrößern anklicken....Muss man nicht. Wie bei der letzten Saison gegen Dias:[BR][IMG]https://i.ibb.co/zfYZH5v/https-de-forum-elvenar-com-index-php-attachments-pass-png-35869.png[/IMG]"}, {"172": "Romilly schrieb:\t\t\t...schön, daß die neue Saison nun endlich begonnen hat - aber warum muss man den Preispass nun gegen Echtgeld freischalten?[BR][BR]Anhang 35868 ansehenZum Vergrößern anklicken....Genau das habe ich mich auch gefragt! Wenn ich bei Dias noch überlegt habe, ihn zu kaufen, bin ich bei Euronen raus!"}, {"2": "...ich hab da nur das hier...[BR][BR][IMG]https://i.ibb.co/2ZW39f0/https-de-forum-elvenar-com-index-php-attachments-pass-png-35870.png[/IMG]...und wenn ich da drauf drücke, komm ich ins Kauf-Menü.."}, {"6": "Seltsam. Ich geh mal davon aus, dass du mehr als 3000 Dias hast?"}, {"2": "...ja - viel mehr....aber 15 Euro sind mir Preise, die nur im Inventar landen nicht wert...[BR][BR]...das Einzige, was mich bei den Premium-Preisen interessiert, wäre dieser Foliant...[BR][BR][IMG]https://i.ibb.co/1vfDH6k/https-de-forum-elvenar-com-index-php-attachments-w-lzer-png-35871.png[/IMG]...weil ich das 3. Gebäude damit auslösen könnte - fürs Inventar - aufstellen würde ich es nicht, da man ablaufende Gebäude nicht wieder einlagern kann..."}, {"173": "bei mir ist es wie bei Romilly und ich hab auch mehr als 3k Dias..."}, {"6": "Da ist dann irgendwas durcheinander. Bei mir siehts so aus:[BR][IMG]https://i.ibb.co/f4DnVzx/https-de-forum-elvenar-com-index-php-attachments-pass2-png-35872.png[/IMG][BR]Eventuell mal einen Neustart versuchen?"}, {"174": "Ich hätte auch für 3000 freischalten können, habe dann Romilly's Nachricht gelesen und mal Elvenar neu gestartet.[BR]Danach konnte ich auch nur noch für Euro's freischalten.[BR]Für mich kam beides eh nicht in Frage.[BR]Den Preis in Euro finde ich einfach nur lächerlich hoch und die Belohnungen wären nicht mal die 3000 Dias wert.[BR][BR]Aber das ist ja nur meine Meinung,[BR][BR]liebe Grüße [smilie--sprite1]"}]