[{"6": "Kxamin schrieb:\t\t\tmal Elvenar neu gestartet.[BR]Danach konnte ich auch nur noch für Euro's freischalten.\t\tZum Vergrößern anklicken....Jepp, kann ich bestätigen.[BR]Hab die falsche Meldung jetzt auch.[BR]Einfach mal eine Fehlermeldung absetzen?"}, {"2": "...den letzten Preispass hab ich deshalb gekauft...[BR][BR][IMG]https://i.ibb.co/5BSdQzJ/https-de-forum-elvenar-com-index-php-attachments-monument-png-35874.png[/IMG]...weil mir das in der Sammlung gefehlt hat (bleibt ebenfalls im Inventar)...[BR][BR]...aber anstelle von 15 Euro wart ich lieber weitere 7 Jahre auf fehlende Gebäude in meiner Sammlung..."}, {"4": "Ich hatte extra kalkuliert und mir die 3.000 Dias zurückbehalten, auch Werbung in der Gilde für den Tiermarkt gemacht. Den hätte ich wirklich sehr gerne gehabt.[BR][BR]Aber 15 Euro? Ein no go.[BR][BR]Und dazu kommt, dass man für die 3.000 Dias automatisch noch kostenlose Blütenblätter erhielt. Jetzt muss man diese noch zusätzlich kaufen. Inno, Ihr habt da was total falsch verstanden. [smilie--sprite3]"}, {"28": "ustoni schrieb:\t\t\tDa ist dann irgendwas durcheinander. Bei mir siehts so aus:[BR][IMG]https://i.ibb.co/f4DnVzx/https-de-forum-elvenar-com-index-php-attachments-pass2-png-35872.png[/IMG][BR]Eventuell mal einen Neustart versuchen?\t\tZum Vergrößern anklicken....[BR]Bei mir sieht es so aus (Ich habe auch über 3000 Dias):[BR][BR][IMG]https://i.ibb.co/ykqVtw3/https-de-forum-elvenar-com-index-php-attachments-1682593273249-png-35875.png[/IMG][BR][BR]Wenn ich auf \"Freischalten\" klicke komme ich, wie auch @Romilly, in das \"Echtgeld-Kaufmenü\". [BR]Ein Kauf des Saisonpasses mit Diamanten scheint mir auch nach einem Relog nicht möglich zu sein. [smilie--sprite2]"}, {"6": "Thebigunknown schrieb:\t\t\tEin Kauf des Saisonpasses mit Diamanten scheint mir auch nach einem Relog nicht möglich zu sein.\t\tZum Vergrößern anklicken....Das ist erst nach einem Relog nicht mehr möglich. [smilie--sprite2] [BR]Ich war beim Start der Saisons bereits eingeloggt und hatte daher das 3000 Dia-Angebot. Nach einem Relog kam bei mir der gleiche Fehler."}, {"81": "Ich möchte Inno gratulieren immer mehr Wege zu finden um den Spielern die Möglichkeit zu geben Echtgeld aus zu geben.[BR][BR]Respekt bald habt ihr nur noch P2W Spieler und dann ist es für die Spieler auch langweilig das sie sich nicht von der Masse mehr abheben können da keine Masse mehr vorhanden ist [smilie--sprite2][BR][BR]Ich mochte die \"Vorversion\" schon nicht und diese Version ist noch schlechter Designt (aus Spieler Sicht), natürlich aus Inno Sicht ist die Season Top /s[BR][BR]In diesem Sinne [smilie--sprite2]"}, {"98": "Ich habe das auch so, den Season-Pass, anders als noch in beta, nur für Cash. Für Dias hätte ich ihn wahrscheinlich genommen, bei Bargeld kann ich nur lachen.[BR][BR]Das ist dann wohl das, was sich \"Profit-Preis-Spirale\" nennt. [BR][BR]@Inno: Das ist albern. Oder unverschämt, je nachdem, wie man es sieht. Und auf jeden Fall fühle ich mich als Spieler für dumm verkauft."}, {"4": "Mein Gefühl ist, dass Inno mal wieder einen Versuchsballon startet. Genau so, wie der Außenposten immer mal wieder anstelle von € 7,99 dann € 9,99 kostet. War jedes Mal beim nächsten Event dann wieder auf dem niedrigeren Preis gelandet. Hoffe sehr, dass es hier auch so ist.[BR][BR]Ich hätte auf jeden Fall gekauft, und das in mehreren Accounts. Pech gehabt, Inno."}, {"120": "Cailin schrieb:\t\t\t@Inno: Das ist albern. Oder unverschämt, je nachdem, wie man es sieht. Und auf jeden Fall fühle ich mich als Spieler für dumm verkauft.\t\tZum Vergrößern anklicken....oder ein Fehler? die Hoffnung stirbt zuletzt"}, {"125": "Also in einer Welt konnte ich den Pass mit Dias kaufen und in der anderen Welt wollen sie Geld dafür? Obwohl genug Dias vorhanden sind.[BR]Wo liegt hier die Logik?"}, {"98": "Handelsbaron schrieb:\t\t\tAlso in einer Welt konnte ich den Pass mit Dias kaufen und in der anderen Welt wollen sie Geld dafür? Obwohl genug Dias vorhanden sind.[BR]Wo liegt hier die Logik?\t\tZum Vergrößern anklicken....[BR]Es nennt sich nicht Logik. Es nennt sich Gier."}, {"125": "Dann hatte ich wohl Glück und ich konnte den Pass noch mit Dias kaufen, bevor ihnen der Fehler aufgefallen ist"}, {"135": "Was genau erfordert da denn mein OK?[BR][BR][IMG]https://i.ibb.co/92QhvnP/https-de-forum-elvenar-com-index-php-attachments-1682598027851-png-35883.png[/IMG]"}, {"54": "habe das bei den Fragen gepostet gehabt und wurde nun darauf aufmerksam gemacht, dass hier auch darüber diskutiert wird ...[BR][BR]meine Meinung, die noch von \"Wissenden\" beim Betreiber beantwortet werden sollte:[BR][BR]das Kaufangebot ist zeitlich auf 24h getimed, ich gehe davon aus, dass es danach noch eine andere Variante gibt, den Saisonpass zu bekommen,[BR]vielleicht gelten ja auch dann die Dia-Kauf-Angebote wieder, wer weiß ...   also warten wir eine offizielle Antwort ab[BR][BR]HdW"}, {"3": "Ich freue mich, dass wieder eine Saison läuft![BR][BR]Wieder so ein schönes Bild  [smilie--sprite1] [BR]Gefällt mir von den Farben her noch besser als die letzte Saison - Frühling pur!"}, {"113": "Bei mir gibt es , in der App, für die beiden Passangebote keine zeitliche Beschränkung. [BR]Die gibt es für das Blütenblattpaket und geht so lange wie die Season, zur Zeit 74 Tage 20 Stunden soundso viele Minuten und Sekunden."}, {"130": "Oh weia, die Season wurde ja ordentlich verschandelt.[BR][BR]Premium-Pass (der vorher für Dias schon überteuert war) gibts jetz nur noch für Echtgeld..[BR]..und durch die ganze Aufregung darüber kann man fast übersehen, dass die Tagespreise auch dermaßen beschnitten worden sind (nur noch feste Münz- und Vorratspreise, weniger WP und ich meine auch weniger AW), dass man sich jetz dann doch 3x überlegt, ob wirklich jede Tagesquest notwendig ist, wenn sie grad nich reinpasst.[BR][BR]Also ich verspür hier keine Freude…richtig schlecht."}, {"104": "Mit 15% Chance auf Unurium könnte man es sich in höheren Kapiteln fast überlegen mit dem Tagespreis, begrenzte Ressourcen durchaus interessant.[BR]Bei mir ist am Ende aber meist Mana am knappsten. Na, wohl je Kapitel anders. In Kapitel 19 Rache der Verbannten jedenfalls wieder Mana.[BR]Chance auf 100k täglich davon.. [smilie--sprite2]"}, {"98": "Kassiopeia24 schrieb:\t\t\toder ein Fehler? die Hoffnung stirbt zuletzt\t\tZum Vergrößern anklicken....Damit:[BR]Tacheless schrieb:\t\t\tAlso, dass der Pass nur gegen Geld erwerblich ist, ist eigentlich kein Fehler.\t\tZum Vergrößern anklicken....dürfte die Hoffnung nun endgültig tot sein."}, {"28": "Cailin schrieb:\t\t\tDamit:[BR]dürfte die Hoffnung nun endgültig tot sein.\t\tZum Vergrößern anklicken....Man darf halt nicht vergessen, dass es Sinn und Zweck von Elvenar ist Geld zu erwirtschaften.[BR][BR]Ohne Spieler/innen die Echtgeld investieren könnte Elvenar halt auch nicht existieren, bzw. es wäre dann nicht möglich es kostenlos zu spielen.[BR][BR]Ich persönlich würde es auch nicht schlimm finden wenn INNO noch viel mehr Sachen gegen Echtgeld zum Verkauf anbieten würde.[BR]Das sind halt Angebote die diejenigen wahrnehmen können die das möchten.[BR][BR]Wenn mir das jeweilige Angebot aus welchen Gründen auch immer halt nicht so zusagt oder ich kein Geld ausgeben kann oder möchte, kann ich es ja ignorieren.[BR][BR]Ich sehe da keinerlei Anlass sich darüber zu ärgern oder aufzuregen, denn im Supermarkt ist mir die Gesamtproduktpalette auch völlig egal solange ich noch bekomme was ich möchte. [smilie--sprite2]"}]