[{"98": "Homeflow schrieb:\t\t\tOh weia, die Season wurde ja ordentlich verschandelt.[BR][BR]..und durch die ganze Aufregung darüber kann man fast übersehen, dass die Tagespreise auch dermaßen beschnitten worden sind (nur noch feste Münz- und Vorratspreise, weniger WP und ich meine auch weniger AW), dass man sich jetz dann doch 3x überlegt, ob wirklich jede Tagesquest notwendig ist, wenn sie grad nich reinpasst.Zum Vergrößern anklicken....[BR]Ich hatte das neulich schon gepostet und die Preise gegenübergestellt:[BR][BR]Cailin schrieb:\t\t\tDie genauen Zahlen kann man hier nicht vergleichen, weil die Werte aus unterschiedlichen Kapiteln sind. WP und Segen etc. sollten ja aber gleich sein.[BR][IMG]https://i.ibb.co/Y7zDPfk/https-de-forum-elvenar-com-index-php-attachments-bildschirmfoto-von-2023-04-27-18-08-35-png-35893.png[/IMG]Zum Vergrößern anklicken....[BR]Da sieht man mehr als deutlich, dass die zweite Season der ersten auch bei den Tagespreisen deutlich unterlegen ist."}, {"112": "nunja - mitnehmen was \"aus versehen\" fertig wird und ansonsten - ignorieren. ok, danke, @Thebigunknown"}, {"68": "Thebigunknown schrieb:\t\t\tMan darf halt nicht vergessen, dass es Sinn und Zweck von Elvenar ist Geld zu erwirtschaften.[BR][BR]Ohne Spieler/innen die Echtgeld investieren könnte Elvenar halt auch nicht existieren, bzw. es wäre dann nicht möglich es kostenlos zu spielen.\t\tZum Vergrößern anklicken.... [BR]Geld zu erwirtschaften ist ja legitim, aber mit aller Gewalt?[BR][BR]Bei dem Angebot an verschiedenen Spielen die alle \"Gratis\" sind, wäre ein kostenpflichtiges Elvenar wahrscheinlich auch der Untergang von Elvenar.[BR][BR]Aber lustig würde ich das mit dem Kostenpflichtig schon finden, vorallem für die Multi-Accountler [smilie--sprite2]"}, {"28": "Moonlady70 schrieb:\t\t\tGeld zu erwirtschaften ist ja legitim, aber mit aller Gewalt?\t\tZum Vergrößern anklicken....Sorry aber mit Gewalt hat mich INNO noch nie dazu aufgefordert Geld bei ihnen auszugeben und ich weiß wie es ist mit Gewalt zu etwas gezwungen zu werden![BR][BR]Über den Stil an sich und die Art und Weise wie INNO denkt Geld verdienen zu können kann man mit mir gerne diskutieren, man sollte dabei aber immer auf die Wortwahl achten. [smilie--sprite2]"}, {"3": "Also ich finde die Gewinne sind doch ok. Selbst bei den kostenlosen sind doch echt gute Sachen dabei.[BR]Wenn man bedenkt, dass beim Pass auch Diamanten dabei sind, dann relativiert sich der Kaufpreis doch. Und auch hier sind doch echt gute Gebäude dabei.[BR]So schlecht ist das Angebot doch nicht?"}, {"2": "Fayence schrieb:\t\t\tSo schlecht ist das Angebot doch nicht?\t\tZum Vergrößern anklicken.......sooooo schlecht nicht - aber für mich total unbrauchbar, da ich die Gebäude bereits habe (teilweise, weil ich dafür bereits Dias für nen Pass ausgegeben habe, weil ich ein Unikat haben wollte)..."}, {"34": "Jetzt konnten einige Spieler die Season gegen 3000 Diamanten kaufen und andere müssen 15 Euro zahlen. Fair ist das Nicht."}, {"28": "SidKane schrieb:\t\t\tJetzt konnten einige Spieler die Season gegen 3000 Diamanten kaufen und andere müssen 15 Euro zahlen. Fair ist das Nicht.\t\tZum Vergrößern anklicken....Meine persönliche Vermutung: \"Es ist Glückssache!\""}, {"81": "Thebigunknown schrieb:\t\t\tSorry aber mit Gewalt hat mich INNO noch nie dazu aufgefordert Geld bei ihnen auszugeben und ich weiß wie es ist mit Gewalt zu etwas gezwungen zu werden![BR][BR]Über den Stil an sich und die Art und Weise wie INNO denkt Geld verdienen zu können kann man mit mir gerne diskutieren, man sollte dabei aber immer auf die Wortwahl achten. [smilie--sprite2]Zum Vergrößern anklicken....[BR]Doch, Inno arbeitet durchaus mit subtiler Gewalt wie die meisten anderen Games dieser Art und weise.[BR][BR]Es gibt nicht nur Körperliche Gewalt...... alleine wie Jahrelang mit FOMO gearbeitet wurde und noch wird ist eher erschreckend.[BR]Hier werden einfach nur \"Spieler\" (Kunden) ausgenutzt die psychisch nicht so stark sind wie andere und ja das ist ein legitimes Geschäftsmodell![BR][BR]Das Inno von 2018 bis 2020 Einnahmen verdoppeln konnte liegt nicht nur an dem bösen C. Wort sondern auch an dem sukzessiven abgrasen der Whales im Spiel.[BR][BR]Da jetzt sicher wieder irgendeiner von meinen vier Lieblings Klugscheisser daher kommt Quelle=>[BR][BR][BR][IMG]https://i.ibb.co/KX1BJGt/https-de-forum-elvenar-com-index-php-attachments-earnings-jpg-35899.jpg[/IMG][BR][BR]Das Inno seit Geschäftsabschluss 2021 weiter Möglichkeiten schafft die \"potenten\" Kunden besser zu befriedigen auf Kosten der nicht so potenten Kunden ist mehr als offensichtlich.[BR][BR]Die Frage die ich mir stelle ist nur wie lange sich noch die \"nicht potenten\" Kunden das gefallen lassen?[BR][BR]Irgendwann kann ein Game noch so toll gewesen sein aber wenn es sich in eine Richtung entwickelt die mir nicht gefällt ziehe ich persönlich meine Konsequenzen daraus und das kann und darf mir keiner nehmen das ist meine Entscheidung ganz alleine und steht nicht zur Diskussion.[BR][BR]Ich hab in den letzten 3 Monaten mehr Kontakte im Spiel verloren als die 3 Jahre zuvor.[BR]Natürlich ist das rein subjektiv gesehen und sagt zu der Gesamtheit nichts aus aber mir als Individuum fällt es auf.[BR][BR]Schade das sich ein so tolles Game in so eine Richtung entwickelt nur wegen der Gier der verantwortlichen nach noch mehr."}, {"28": "Sardukar schrieb:\t\t\tIch hab in den letzten 3 Monaten mehr Kontakte im Spiel verloren als die 3 Jahre zuvor.[BR]Natürlich ist das rein subjektiv gesehen und sagt zu der Gesamtheit nichts aus aber mir als Individuum fällt es auf.[BR][BR]Schade das sich ein so tolles Game in so eine Richtung entwickelt\t\tZum Vergrößern anklicken....Genauso erlebe ich es auch sowohl auf den deutschen Live-Servern, als auch auf dem Beta-Server.[BR][BR]Auch ich habe einen eher besorgten Blick auf die Zukunft Elvenars, bzw. auf meine Zukunft als Spieler dieses Spiels.[BR][BR]Denn[BR]Sardukar schrieb:\t\t\twenn es sich in eine Richtung entwickelt die mir nicht gefällt ziehe ich persönlich meine Konsequenzen daraus\t\tZum Vergrößern anklicken....das würden dann vielleicht nicht \"nur\" @Sardukar und ich tun"}, {"56": "Auch wenn es @Sardukar nicht gefällt, es ist ein Balanceakt, denn einerseits muss INNO auch mit diesem Spiel Geld verdienen, es entstehen nämlich Kosten und andererseits möchten viele Spieler kostenlos spielen.[BR][BR]Es ist aber auch nicht einzusehen, dass hier Spieler die ihre Dias bezahlen, mit den nicht zahlenden Spielern über einen Kamm geschoren werden und dafür zum Dank auch noch unfreundliche, hämische u/o höhnische Bemerkungen von den nicht zahlenden Spielern verpasst bekommen![BR][BR]Mich hat dieses Verhalten inzwischen dazu gebracht, dass ich seltener kaufe und viele Dinge inzwischen vermeide, die ich mit meinen gekauften Dias bezahlen müsste! Ich habe nämlich inzwischen keine Lust mehr, etwas mitzufinanzieren, was mir keine wirklichen Vorteile bringt![BR][BR]Wer hier mehrere Accounts besitzt ist hier ohnehin nicht das \"Glückskind\", denn dann werden nicht die Dias für jeden Account verfügbar. Wenn man dort kauft, dann kauft man nur für den jeweiligen Account und Gewinne (falls es mal welche gibt) verhalten sich analog! Soviel zu der unfreundlichen Anmerkung von @Moonlady70 hinsichtlich solcher Accounts!"}, {"175": "Sehr blöd gelaufen![BR]Habe von der neuen Saison die ersten Tagesquests vollständig gelöst und bekam als Belohnung 0 Münzen (in Worten: Null), denn mein Münzlager war voll und ich hatte vorher nicht nachgesehen, was es als Belohnungen gibt und wusste nicht, dass sie sich verändert haben ggü. der letzten Saison (da gab es ja Münzregen). Was soll dieser Blödsinn. Ich fühle mich verarscht.[BR]Von Häusern kann man keine Münzen einsammeln, wenn das Lager voll ist, bei der Nachbarschaftshilfe wird man drauf hingewiesen. Hier: nix!!!"}, {"176": "Na - die Saisons fangen ja schon mal \"gut\" an - gleich bei den täglichen Aufgaben soll ich Truppen rekrutieren - ich bin aber nur Händler und rekrutiere gar nichts - und dann kann man diese Tagesaufgaben auch nicht tauschen, wie die Wochenaufgaben. Da fehlen mir in jeder Saison doch einige Punkte. Irgendwie wird oft vergessen, dass es im Spiel doch die Option gibt, nur Händler zu sein - wenn dies auch die wenigsten machen."}, {"4": "Thebigunknown schrieb:\t\t\tMan darf halt nicht vergessen, dass es Sinn und Zweck von Elvenar ist Geld zu erwirtschaften.[BR][BR]Ohne Spieler/innen die Echtgeld investieren könnte Elvenar halt auch nicht existieren, bzw. es wäre dann nicht möglich es kostenlos zu spielen.[BR][BR]Ich persönlich würde es auch nicht schlimm finden wenn INNO noch viel mehr Sachen gegen Echtgeld zum Verkauf anbieten würde.[BR]Das sind halt Angebote die diejenigen wahrnehmen können die das möchten.[BR][BR]Wenn mir das jeweilige Angebot aus welchen Gründen auch immer halt nicht so zusagt oder ich kein Geld ausgeben kann oder möchte, kann ich es ja ignorieren.[BR][BR]Ich sehe da keinerlei Anlass sich darüber zu ärgern oder aufzuregen, denn im Supermarkt ist mir die Gesamtproduktpalette auch völlig egal solange ich noch bekomme was ich möchte. [smilie--sprite2]Zum Vergrößern anklicken....Klar ist der Hauptzweck dieses Spiels, Gewinn zu erwirtschaften. Einfach nur, um die Spieler zu belustigen, ist es ganz sicher nicht.[BR][BR]Nur muss sich hier die Freude am Spiel und der Gewinn der Firma irgendwo die Balance halten. Gerade bei dem Tiermarkt, auf den ich mich schon seit Wochen gefreut habe und auf den ich auch wirklich hingearbeitet habe und den ich nun nicht erhalten werde, hat sich doch eine sehr große Enttäuschung breitgemacht. Logischerweise überträgt sich diese Enttäuschung in die Gilde, da ich wirklich Werbung für den Tiermarkt gemacht hatte. Und ich bin sehr sicher, dass der eine oder andere Gilde auch Echtgeld für die Dias ausgegeben hätte, die Inno jetzt fehlen.[BR][BR]Die Frage drängt sich hier doch auf: Wie lange und wie häufig lassen sich Kunden das gefallen? [BR][BR]Ich weiß nur, dass ich generell noch vorsichtiger werde. [BR][BR]Immerhin darf man bei allem ja auch nicht vergessen, dass die \"geschenkten\" Dias im Spiel erarbeitet sind und mir nicht nachgeworfen werden, sondern Planung und vor allem Zeit bedingen. [BR][BR][BR]Ich persönlich denke, dass solche Aktionen eher Kunden verprellen und ein verprellter Kunde ist eben dann keiner mehr."}, {"28": "salandrine schrieb:\t\t\tNur muss sich hier die Freude am Spiel und der Gewinn der Firma irgendwo die Balance halten. Gerade bei dem Tiermarkt, auf den ich mich schon seit Wochen gefreut habe und auf den ich auch wirklich hingearbeitet habe und den ich nun nicht erhalten werde, hat sich doch eine sehr große Enttäuschung breitgemacht. Logischerweise überträgt sich diese Enttäuschung in die Gilde, da ich wirklich Werbung für den Tiermarkt gemacht hatte. Und ich bin sehr sicher, dass der eine oder andere Gilde auch Echtgeld für die Dias ausgegeben hätte, die Inno jetzt fehlen.\t\tZum Vergrößern anklicken....Das ist natürlich besonders ärgerlich! Da muss ich gar nicht nachschlagen, kann mich sogar noch die direkt an deine Vorfreude bezüglich des Tiermarktes erinnern die Du damals im Beta-Thread zum Ausdruck gebracht hattest. Tut mir leid für dich @salandrine[BR][BR]Es ist halt wichtig zu wissen dass der Beta-Server immer in jeglicher Hinsicht verschieden zu den Live-Servern sein kann.[BR]Man darf im Endeffekt wirklich rein gar nichts was man auf beta sieht oder erlebt hat als \"Ankündigung\" für die Live-Server verstehen."}, {"87": "Kleines Feedback[BR][BR]Im letzten Saison-Event gab es die Tagesquest Erleuchtete Güter einzusammeln. Für Kapitel 20 wurden unter 10.000 Erleuchteter Güter gefordert. Diese Quest gibt es in diesem Saison-Event wieder. Nur, dass sie nun ganze 64.877 Erleuchtete Güter fordert.  [BR](1 Manu auf Stufe 34 produziert in 3 Std. 9.920 - 10.800 Erleuchtete Güter.)[BR][BR]+/- 9.000 finde in für eine Tagesquest okay, aber 64.877 finde ich zu viel.[BR][IMG]https://i.ibb.co/4FmPkk7/https-de-forum-elvenar-com-index-php-attachments-1682655813235-png-35906.png[/IMG]"}, {"2": "@Cruller[BR]...die Mengen sind zwar höher geworden, aber wenn ich von allen 3 Sorten meiner erleuchteten die Nachtprod (ohne Zauber) abhole, ist die Quest erledigt - finde nicht, daß das zuviel ist...[BR][BR]...lol - muss korrigieren - mit allen 3 bekomm ich nur 63936 - fehlen also 941 [smilie--sprite2] - allerdings hab ich ja jeweils 2 von den erleuchteten..."}, {"15": "Hallo [BR]hier bei den erleuchteten Gütern zählt nicht nur die Produktion sondern auch der Handel am Markt.[BR]Bei den Mengen könnte auch von Inno geplant sein, dass der Markt etwas intensiver betrieben wird, da er für Spieler die mit Kapital 20 durch sind wahrscheinlich oft ignoriert wird."}, {"112": "stimmt - auch die güter der evos usw zählen mit"}, {"102": "Ja - es steht jetzt \"sammle\" und vorher zählten nur die produzierten Mengen - das hält sich daher für mich die Waage und diese Aufgaben sind doch auch als tägliche gut zu lösen."}]