[{"87": "Romilly schrieb:\t\t\twenn ich von allen 3 Sorten meiner erleuchteten die Nachtprod (ohne Zauber) abhole, ist die Quest erledigt\t\tZum Vergrößern anklicken....Jaaa, es gibt viele Möglichkeiten Güter zu produzieren und einzusammeln ...  und nur weil ich meine Produktionsmengen für 3 Std. angebe, heißt das nicht, dass ich nicht weiß, dass eine Manufaktur auch eine 9 Std. Produktion hat oder es den Markt gibt.. Trotzdem finde ich die Menge für eine Tagesquest zu hoch. [BR]... aber es gibt ja auch noch die Möglichkeit, eine Tagesquest nicht abzuschließen. [BR][BR]Da das hier der Feedback-Thread ist und ich meinen Post auch als Feedback gekennzeichnet habe, könnte man das auch mal so stehen lassen. Feedback in diesem Forum abzugeben, ist wirklich ermüdend. [smilie--sprite11] Was ist auch sooo falsch daran, dass ich diese Menge Erleuchtete Güter für eine Tagesquest als zu hoch empfinde und das als Feedback abgebe? -rhetorische Frage-"}, {"2": "Cruller schrieb:\t\t\tWas ist auch sooo falsch daran, dass ich diese Menge Erleuchtete Güter für eine Tagesquest als zu hoch empfinde und das als Feedback abgebe?\t\tZum Vergrößern anklicken.......und ich hab gesagt, daß ich es nicht zu hoch finde - könnte man ja genauso einfach so stehen lassen...oder zählt mein Feedback nicht?..."}, {"135": "loselfe schrieb:\t\t\tNa - die Saisons fangen ja schon mal \"gut\" an - gleich bei den täglichen Aufgaben soll ich Truppen rekrutieren - ich bin aber nur Händler und rekrutiere gar nichts - und dann kann man diese Tagesaufgaben auch nicht tauschen, wie die Wochenaufgaben. Da fehlen mir in jeder Saison doch einige Punkte. Irgendwie wird oft vergessen, dass es im Spiel doch die Option gibt, nur Händler zu sein - wenn dies auch die wenigsten machen.\t\tZum Vergrößern anklicken....Schau dir mal das Evo Hexenhaus an, das gibt zu den Orks die man immer brauchen kann auch noch Truppen Beifang."}, {"87": "Romilly schrieb:\t\t\t...und ich hab gesagt, daß ich es nicht zu hoch finde - könnte man ja genauso einfach so stehen lassen...oder zählt mein Feedback nicht?...\t\tZum Vergrößern anklicken....[smilie--sprite11] Ja, Romilly. Hast Du. Du hast einen Grund gefunden, mir Dein \"Feedback\" zu geben. Ist doch gut! [smilie--sprite1] "}, {"129": "Was soll ich sagen: die saison der freude wandelt sich mit einem schlag in die saison der enttäuschung. nicht weil ich für den spass echtgeld investieren müsste, der pass könnte auch 50 euro kosten und ich hätte ihn gekauft. der punkt ist dass ich für geld auch etwas geboten bekommen will. die gebäude die ich mit dem pass erhalten kann sind gradezu langweilig[BR]die chance sich mit den gebäude-preisen großzügig zu zeigen und treue fans zu gewinnen wurde verspielt.[BR]wer auch immer für die zuteilung der preise zuständig ist sollte den beruf wechseln. ich werde weder den pass kaufen noch diese saison spielen.[BR]sorry leute, wenn ich unteren durchschnitt spielen will, spiele ich nicht elvenar. die saison ist tot"}, {"4": "Ich persönlich finde die Mengen auch als zu hoch, genau so wie @Cruller.[BR][BR]Denn es kann ohne weiteres mal sein, dass ich erst nachmittags oder sogar abends ins Spiel kann und es deshalb  nicht schaffe, diesen Quest zu lösen."}, {"104": "Athaneia schrieb:\t\t\tAuch wenn es @Sardukar nicht gefällt, es ist ein Balanceakt, denn einerseits muss INNO auch mit diesem Spiel Geld verdienen, es entstehen nämlich Kosten und andererseits möchten viele Spieler kostenlos spielen.\t\tZum Vergrößern anklicken....Was man andersrum bedenken muss, ist, dass andere Spiele einmalig 50 Euro kosten (oder mit der Zeit immer billiger) und dann nie wieder was.[BR]Das wäre lustig, würden die Diamant-Käufe aufaddiert, und ab 50 Euro hätte man alles. Wenn schon nicht endlos Diamanten um alle Wunder usw. fertig zu bauen, dann zumindest alle Erweiterungen, automatisch Pass jede Saison/ Turnier usw. [smilie--sprite2][BR][BR]Sicher sind die Faktoren der Spiele paar andere.[BR]Manche überwiegend Singleplayer (wobei auch Multiplayer-Modus) und eher begrenzt an Zeit, dafür hochwertige Grafik/ Mechanik/ Story naja.[BR]Hier Simpel-Modus in allem, dafür jedes Jahr neu gewisse Gebäude, Story, Features (Hexenkessel..), Spiel-Balance aufrecht zu erhalten, Supporter und halt Server-Kosten, welche man ruhig mal je Spieler pro Jahr nennen könnte.[BR][BR]Muss nicht sein, nichts muss, aber solange keine genauen Informationen, ist die Grundannahme Abschöpfung Geld nicht für Kosten, sondern für Gewinn.."}, {"68": "Athaneia schrieb:\t\t\tWer hier mehrere Accounts besitzt ist hier ohnehin nicht das \"Glückskind\", denn dann werden nicht die Dias für jeden Account verfügbar. Wenn man dort kauft, dann kauft man nur für den jeweiligen Account und Gewinne (falls es mal welche gibt) verhalten sich analog! Soviel zu der unfreundlichen Anmerkung von @Moonlady70 hinsichtlich solcher Accounts!\t\tZum Vergrößern anklicken....[BR]Vielleicht solltest du genauer lesen auf was ich geantwortet habe und nicht deinen Träumen folgend antworten, denn ich habe auf[BR][BR]Thebigunknown schrieb:\t\t\tOhne Spieler/innen die Echtgeld investieren könnte Elvenar halt auch nicht existieren, bzw. es wäre dann nicht möglich es kostenlos zu spielen.\t\tZum Vergrößern anklicken....[BR]mit[BR][BR]Moonlady70 schrieb:\t\t\tAber lustig würde ich das mit dem Kostenpflichtig schon finden, vorallem für die Multi-Accountler [smilie--sprite2]Zum Vergrößern anklicken....[BR]geantwortet, und da ist absolut nichts unfreundliches dabei, lediglich die Tatsache, dass ich es lustig finden würde, wenn Elvenar kostenpflichtig werden würde, dass die Multi-Accountler dann halt für alle Accounts auch zahlen müssten, dass diese überhaupt Elvenar spielen dürfen (Anmerkung: ich nehme mal an, dass dies nie passieren wird, den dies wäre vermutlich das Todesurteil für Elvenar)[BR][BR]Das hat absolut nichts mit dem Kauf des Passes zu tun, egal ob mit Diamanten oder für Echtgeld. Der Kauf des Passes steht doch jedem frei, ist halt dann das \"Pech\" des Einzelnen wenn der Zufallsgenerator den Pass für Echtgeld anbietet, da darfst dich gerne bei Inno beschweren wenn es dir nicht passt, denn damit habe ich überhaupt nichts zu tun. [BR][BR]Da ich grundsätzlich gegen Multi-Accounts bin liegt wohl auf der Hand, da diese anderen Spielern das Spiel erschweren (z.B. Handel) und in diverse Ranglisten (z.B. Turnier/GA) eingreifen und somit anderen Spielern/Gilden bessere Preise wegnehmen. Und auch dies ist eine Tatsache, genauso wie es Tatsache ist, dass Inno das akzeptiert.  [BR][BR]Und bis jetzt konnte noch niemand offen und ehrlich erklären, warum man Multi-Accounts benötigt, aber vielleicht erleuchtest ja gerade DU @Athaneia mich und eventuell andere Spieler die das auch gerne wissen würden, was der Zweck von Multi-Accounts denn ist. Denn für etwas zum \"Testen\" gibt es genügend anderen Spielwelten. Ich freue mich schon auf deine Multi-Account-Aufklärung und sage schon mal danke dafür.[BR][BR]Und da es ja um die Saisons geht, natürlich auch noch etwas dazu.[BR][BR]Auch hier darf doch ein jeder Spieler selbst entscheiden ob er die Saisons komplett durchspielen will oder nur mitnimmt was so nebenbei dabei herumkommt. Und genauso ist es mit dem Kauf des Passes, jeder kann dass doch selbst entscheiden ob er kaufen will, egal ob mit Dias oder Echtgeld. Und auch hier spielt es keine Rolle ob der Kauf durchdacht oder einfach so getätigt worden ist. Über die Preispolitik von Inno kann man sich ja selbst Gedanken darüber machen und kaufen oder eben auch nicht, ich persönlich habe in Elvenar noch keinen einzigen Cent reingesteckt und werde dies auch niemals tun, denn für mich gibt es absolut nichts dass durch einen Kauf für das spielen von Elvenar benötigt wird, aber das soll jeder für sich selbst entscheiden. Aber noch darf sich Inno darüber freuen, dass ich ein wenig Zeit in Elvenar verbringe, 30 Minuten Spielzeit und ein wenig im Forum lesen und ab und zu was schreiben ist ausreichend für mich und dennoch komme ich in meinen 4 Welten voran, mal mehr und mal weniger schnell, aber das ist ja nicht relevant, ist doch ein Langzeitspiel.[BR][BR]Zum anderen kommt bei den Saisons ja auch der Zufallsgenerator durch das \"Innosche Glücksspielmonopol\" zu tragen, denn sowohl die Tagesaufgaben sowie die Wochenaufgaben sind ja für die meisten Spieler unterschiedlich und daher auch nicht wirklich Fair. Aber Fairness steht ja nicht sehr hoch in der Prioritätenliste von Inno, hab ich also zur Kenntnis genommen.[BR][BR]Inno wird schon wissen wie es weitergeht, was noch alles Neues kommen wird (außer Gastrassen) und wie man die vorgegebene Prioritätenliste am Besten umsetzt.[BR][BR]Lady of the Moon[BR][BR]PS: ich hoffe ich erhalte die Multi-Account Antwort in den nächsten 14 Tagen, bin ganz neugierig"}, {"98": "Sir Backblech schrieb:\t\t\tWas soll ich sagen: die saison der freude wandelt sich mit einem schlag in die saison der enttäuschung. nicht weil ich für den spass echtgeld investieren müsste, der pass könnte auch 50 euro kosten und ich hätte ihn gekauft. der punkt ist dass ich für geld auch etwas geboten bekommen will. die gebäude die ich mit dem pass erhalten kann sind gradezu langweilig[BR]die chance sich mit den gebäude-preisen großzügig zu zeigen und treue fans zu gewinnen wurde verspielt.[BR]wer auch immer für die zuteilung der preise zuständig ist sollte den beruf wechseln. ich werde weder den pass kaufen noch diese saison spielen.[BR]sorry leute, wenn ich unteren durchschnitt spielen will, spiele ich nicht elvenar. die saison ist tot\t\tZum Vergrößern anklicken....[BR]Völlig richtig. [BR][BR]Gut, ich persönlich hätte in fast gar keinem Fall Echtgeld für die Seasons bezahlt, da hätte schon ein wirklich übermenschlicher Preis kommen müssen. Nach den Enttäuschungen der letzten Monate nehme ich momentan nicht mal die 100% Bonus Angebote an - ich weiß ja nie, ob mir die Dias nicht einfach wieder weggenommen werden. Auf beta wurde mir ein Teil wieder zurückgegeben, aber längst nicht alles. Da wird man dann sehr zurückhaltend. [BR][BR]Aber die Preise für die Seasons sind in der Tat eine Katastrophe. Ein paar alte Eventgebäude, okay, aber im Ernst: ein Verkaufsstand, Mana, Splitter? Wer sich das ausgedacht hat, ist in seiner Vorstellungswelt wirklich ganz weit von den Spielern entfernt. [BR][BR]Es tut mir nur leid für die paar Naiven, die sich mit dem Spiel nicht gut auskennen, nicht in den Foren lesen und das kaufen..."}, {"56": "@Moonlady70  zur Befriedigung deiner Neugier… [smilie--sprite2][BR]Die Antwort ist ganz einfach, meine 3 Accounts in Sinya Arda bestehen aus rein finanztechnischer Sicht, so behalte ich meine „Investitionen“ pro Account ohne großen Eigenaufwand absolut im Blick, weil ich so für jeden Account einzeln bezahlen muss und nicht alles (wie üblich) in einem Topf landet. Das will ich nicht, denn ich möchte schon wissen wieviel ich für meine einzelnen Städte investiere![BR][BR]Ich spiele halt ein wenig anders, denn ich baue „Motiv-/Themenstädte“ und mich interessieren Punkte und Rang überhaupt nicht. Ich höre dort mit der Forschung auf, wo ich meinem Ziel einer (für mich) schönen Stadt am nächsten komme (z.B. „Die Elvenar“ oder „Amuni“ etc.)! Auch Gebäudewerte sind eher zweitrangig und der ganze „Wettbewerb“ interessiert uns (meine GM-Partnerin und mich) nicht![BR]Spielen kann man trotzdem: Events mit den „richtigen Themen“ zur Ergänzung, Turnier und Turm (soweit wir mit 4 Accounts kommen), wenn wir Zeit und Lust haben![BR][BR]Ich hatte anfangs noch gedacht, dass die Seasons interessant sein könnten, aber die angebotenen Gebäude im Preispass (und ohne) habe ich meistens schon im Inventar, oder ich wollte sie ohnehin nicht, damit sind die Seasons für mich momentan uninteressant und ich spiele sie nicht. Das kann sich aber ändern, je nach dem was in Zukunft noch kommen wird und ob angebotene Gebäude in eines meiner Stadt-Konzepte passt und sich die jeweilige Investition auch lohnt!"}, {"113": "Ha! Hab ich dieses Mal in der Preiseleiste doch glatt ein paar Gebäude entdeckt, die mir zusagen. Und ich muss nur Quests dafür erfüllen. Sowas gefällt mir [smilie--sprite2]"}, {"102": "Da die Saison als Ersatz der Schleifenquest eingeführt wurde, finde ich die Möglichkeiten auch Gebäude, verschiedene Segen und Ressourcen zu gewinnen, als sehr positiv.[BR]Die meisten Aufgaben lassen sich fast \"nebenher\" erledigen - sprich durch die normalen Produktionen - und das ständige durchklicken der Schleifenquests und aufpassen, dann das Richtige auch einzusammeln, ist auch weggefallen. [BR][BR]Ein paar Lv.1-Manus und Werkstätten hat man meist auch immer irgendwo zu stehen und so lassen sich die Aufgaben leicht bewältigen, ohne den normalen Produktionsablauf zu stören.[BR][BR]Ich sehe daher die Saison als schönen Ersatz und wer eben weniger an Tag im Spiel online sein kann, der hatte auch bei den Schleifenquests, bei denen es nur Münzen und Werkzeuge gab, weniger bekommen, als ein Spieler, der ggf. aller 3 Stunden am Tage online sein kann.[BR][BR]Soviel zu meinem persönlichen Feedback."}, {"14": "ich sehe die Seasons auch positiv![BR]bislang waren immer alle Aufgaben zu erledigen, obwohl ich auch Wochenaufgaben getauscht habe, wenn sie mir nicht gepasst haben[BR]für mich persönlich sind die Gewinne ansprechend, da ich viele der Gebäude gar nicht kenne[BR]klar, einige gibt es in der Aka, aber die kann man ja auch schreddern, das mildert meinen Fragmentenmangel etwas[BR]die Schleifenquests waren dagegen öde und die Gewinne eben nur Werkzeug und Münzen[BR]da ist es doch jetzt viel netter![BR][BR]die Verkaufspolitik des Passes erschließt sich mir auch nicht[BR]zumindest erklärt es jetzt, wieso man dann auch Diamanten erhält: auf Beta führte das eher zu Verwunderung, denn dann hätte man den Pass preiswerter gestalten können![BR][BR]im Preispass sind ein paar Gebäude, die ich stehen habe, die aber nicht mehr aktuell sind: die würde ich gerne gegen aktuelle tauschen und ich hatte das Glück, den Pass noch gegen Dia-Währung zu bekommen, bevor es dann wohl auf Echtgeld umsprang[BR][BR]da ich Dias nur gewinne oder bei guten %% kaufe, würde ich nie den Preis bezahlen, der jetzt für den Pass ausgelobt ist![BR]da habe ich wohl dann echt Glück gehabt![BR]der Pass ist mir 3000 Dias wert, eben weil ich mehrere Gebäude austauschen kann und nicht mal alle kenne, die da auch noch sind und ich ein paar Dias zurückbekomme"}, {"48": "Ich empfinde die Saison in Kapitel 20 als angenehmer als die Schleifen. Habe dieses nicht mehr gespielt. Aber für Spieler in kleineren Kapiteln waren die Schleifen schon sinnvoll, weil man Gold und Vorräte bei sinnvoll gebrauch schnell aufstocken konnte. Diese beiden Güter sind für mich der limitierendste Faktor in den unteren Kapiteln.[BR]Geht nun nur noch bedingt.[BR]Aber die Saison finde ich ganz nett. Spiele alles, weil das eine oder andere am Ende kommende ganz gut zu gebrauchen ist, oder spiele nicht alles weil es mich nicht interessiert.[BR]Aber Echtgeld für den Pass? Das werden einige machen. Für mich ein absolutes NIE IM LEBEN. Alles was im Pass kommt kann kein Echtgeld wert sein.[BR]Dias hatte ich wegen des \"Kuhstalls\" kurz überlegt, aber dann kam der Zu zahlende Preis und ich habe mich lachend abgewendet."}, {"24": "Ich muss zugeben, es fällt mir schwer ein sinniges Feedback abzugeben. Die Schleifenquests haben mich auf der einen Seite gelangweilt - Und ja, sieht man die Seasons als blossen Ersatz davon, sind sie um Längen besser. Das Problem ist: Ich sehe sie nicht als Ersatz. Dazu sind die Ansätze einfach zu verschieden. Könnte ich mich an den Tagesaufgaben der Seasons totspielen, wären sie vergleichbar - So sinds halt 4 Zusatzaufgaben pro Tag. Vergleichbar sind sie für mich eher mit einem langfristigen Event - Man erledigt eine lange Liste von Quests, gibt man Kohle her wird eine \"Premium\"-Liste freigeschaltet.[BR][BR]Die Preise lassen mich daher den Kopf schütteln. Ich habe den ganzen \"Spiddel\" entweder schon im Inventar oder es ist schlecht - Segen kann ich ebenfalls brauchen, Festbeträge aufgrund der Unplanbarkeit eher nicht. Was bleibt ? Gelangweiltes wegklicken. Ein paar Truppensegen. Echtgeld kann ich da beim besten Willen nicht investieren. Auf der andren Seite fände ich es unfair wenn jetzt immens gute Kaufgebäude kämen die der Normalspieler nie erreichen kann... Warum nicht mal ein Mittelweg ?[BR][BR]Ansonsten unterschreibe ich was weiter oben geschrieben wurde... Ihr solltet mal jemand in die Preisauswahl setzen der sich besser mit Spielermotivation auskennt. Und wenn ich Dias kaufen will, dann kaufe ich sie - Ich zahle nicht um sie dann noch erspielen zu müssen... Frage mich ob das irgendwann im Turm auch kommt... Um die großen Preise zu erspielen müsst ihr den Premiumturmpass kaufen.[BR][BR]Nee, ehrlich Leute, das war ein Schuss in den Ofen."}, {"177": "ich mag die Saison eigentlich, zumindest machen sie nicht so viel Aufwand und die Preise sind moderat. Für kleinere Spieler sind auch die Gebäude sicher nicht zu verachten. Heute allerdings hab ich mich doch bissel geärgert. Da gabs Münzen , wenn man alle  täglichen Aufgaben erledigt hat, was man aber vorher nicht sieht. Meine Münzen waren fast voll, da wäre eine Warnung schon recht hilfreich."}, {"139": "Ich mag die Saison nach wie vor, habe allerdings ein kleines Problem und zwar, habe ich lediglich 4 Werkstätte. Mehr brauche ich nicht. Um die Aufgaben mit den Werkstätten zu bewältigen muss ich Minis bauen. Die Minis benötigen Platz und nun bin ich auf den Punkt angekommen, wann ich entscheiden muss: entweder Minis und Saison oder den Vorschritt im Spiel und die Gebäude der Gastrassen. [BR]Die Funktion \"Tauschen\" habe ich übrigens gefunden und für gut befunden.  [smilie--sprite1]"}, {"166": "Ich freue mich über die Saison, danke dafür. Für einen kleinen Spieler ( Anfänger, Neuling) wie mich, ist der eine große Hilfe. Bitte gerne beibehalten. Diese Aufgaben kann ich leichter lösen, als manche Eventaufgaben. Und wenn es garnicht geht kann ich ja tauschen, was beim Event nicht möglich ist."}, {"110": "Also die Preise haben sich (zumindest gefühlsmäßig) doch ein wenig verschlechtert seit der letzten Season ... und wieso kriegt man Münzen und Vorräte jetzt cash auf die Kralle, wenn man die Tagesquests erfüllt haat? Es mag schon welche geben, die da knapp sind - aber ich entscheide gerne selber, wann ich so was einsetze und ich bin auch nicht knapp da (wie viele andere vielleicht auch nicht). Nicht, dass die Mengen wirklich relevant wären, aber Segen waren mir lieber."}, {"126": "Wäre halt schön, wenn man wenigstens ne Warnung bekommen würde, wenn dabei das Lager überquillt. Sodass man noch eine Chance hat, vorher etwas auszugeben."}]