[{"3": "Ich fand die Segen auch besser. Meine Münz- und Vorrätelager sind meist voll genug. Ich hatte aber bisher Glück und habe meist Unurium bekommen.[BR]Eure Posts haben mir sehr geholfen, so daß ich jetzt vorgewarnt bin und vorher auf die Speicher achte, bevor ich den Preis abhole.[BR][BR]Trotzdem waren die Segen besser!"}, {"16": "Ich muss sagen, ich persönlich fand die Segen auch besser. Gerade bei Münzsegen bin ich eher knapp bestückt und da finde ich die Kombination der Wochenquest \"3 Münzsegen einsetzen\" und dem Tausch Segen gegen Direktgewinn  sehr ungünstig gelöst."}, {"178": "LexiTargaryen schrieb:\t\t\tIch muss sagen, ich persönlich fand die Segen auch besser.\t\tZum Vergrößern anklicken....seh ich auch so....[BR]mich kümmert selten wieviel Münzen oder Vorräte ich hab. Mein Ablauf beim einsammeln ist fix. Und auch das bissle Kleinkram was jetzt über die Saisons dann als Tagespreis gegeben wird ist lächerlich.... wird meinen Ablauf nicht ändern!!![BR]Der Münzsegen für den optionalen Einsatz im GA oder in einem Event war sinnvoll.[BR]Mit dieser jetzt neuen Veränderung auf direkte Münzen hat INNO einen immensen Rückschritt gemacht... warum sollte ich jetzt noch z.B. Zauber.... oder anderes verschwenden um an ein bissle lächerliche Münzen als Tagespreis zu gelangen?[BR]Alles andere an Hauptpreisen hat auch nur geringeren Wert. [BR]Ist man mit der Forschung durch braucht man davon nix....[BR]forscht man noch hat man entweder die Geduld länger Besseres zu sammeln![BR]Oder man ist schneller und bekommt sowieso demnächst höherwertiges Besseres![BR]Nach den neusten Verbesserungen bin ich eher geneigt die Tagesaufgaben der Saisons zu ignorieren wie bei den Schleifenquests schon seit ca. 10 Kapiteln.[BR]Schon die lästige Animation jeden Tag dieses öffnen der Schlößer und der Kiste anzusehen oder mit einigen Klicks mehr rein und raus zu umgehen verursacht einfach nur stuppides Gähnen bei diesem täglichen (0)Erlebnis , SORRY, ist aber leider so. [BR]Wer hierfür  Geld ausgibt hat zuviel davon oder weiß es nicht besser.[BR]Ich zumindest würd INNO dafür nicht belohnen!"}, {"4": "Diesen Quest \"3 Münzzauber verwenden\" erfülle ich nicht. Zumindest nicht extra. Ich brauche diese Münzzauber sehr dringend fürs GA.[BR][BR]Insofern bin ich immer froh darüber, einen Münzzauber zu erhalten und zu dem von mir gewünschten Zeitpunkt einsetzen zu können."}, {"178": "3 Münz... 3 Voräte Zauber.... wer macht das denne. Das ist das was ich zuerst wechseln würde. Diese Zauber sind euer Backup wenn ihrs benötigt. alternativ wären diese allerhöchstens mal für ne Quest im Event oder für die Forschung ne Ausnahmeoption. ansonsten bei den Preisen selbst der vorherigen Seasons schon ne völlige Verschwendung. [BR][BR]Nützlich wirklich nur wenn man INNO viel an Coins spendet und der dollste hellste und besste zu sein versucht.... auch dem wünsch ich gern viel Spaß.[BR]mach INNO glücklich.... ist dein Part. Hoffe die feiern dich entsprechend. Irgendwer muss es ja löhnen... Und sorry von mir bleibts dahingehend bei kleingedruckt bis ich weiß warums das wert sein sollte."}, {"114": "Tagesquests.. was bitte bedeutet \"Hole dir Mahlzeiten aus den Lagerbestände\""}, {"150": "Inye schrieb:\t\t\tTagesquests.. was bitte bedeutet \"Hole dir Mahlzeiten aus den Lagerbestände\"\t\tZum Vergrößern anklicken....Kochmützen (Eventwährung) einsetzen"}, {"114": "Danke @Collektor87"}, {"161": "Zwar sind die Preise lahmer, aber ich mag die Saison der Freude mehr als die Saison der Träume"}, {"126": "Also, dass das Event einbezogen wird, schön und gut, aber, dass Dinge benutzt werden sollen, die man nur per Zufall !!! bekommt... Diese Glückskarten (Aroma-Beute) haben in der Season nichts zu suchen meiner Meinung nach. [BR]Auf der Beta hab ich in den letzten 10 Tagen des Events nicht 1 Mal diese Teile bekommen. [BR]Und ich brauche die 2 Rerolls, um unliebsame Kurz Produktionen der Werkstätten loszuwerden."}, {"179": "@Souliena Wochenquests werden doch nur nach hinten geschoben, nicht komplett ersetzt. Und du hast mehr als eine Woche Zeit, diese zu erledigen, indem du sie nicht \"rerollst\", sondern entspannt nach und nach erledigst. [smilie--sprite2]"}, {"126": "Rikku33 schrieb:@Souliena Wochenquests werden doch nur nach hinten geschoben, nicht komplett ersetzt. Und du hast mehr als eine Woche Zeit, diese zu erledigen, indem du sie nicht \"rerollst\", sondern entspannt nach und nach erledigst. [smilie--sprite2]Zum Vergrößern anklicken....Ja, aber ich mache prinzipiell ungern 5 und 15 Minuten Produktionen. Passt einfach nicht in den Ablauf und mir würden Massen an Werkzeugen verloren gehen, wenn ich dann trotzdem nur im 3 Stunden-Rhythmus reinschaue. (Mal für ein Event 8 Stück okay, aber 75 Stück.. Nein Danke)[BR][BR]Und primär ging es mir ja auch darum, dass einfach keine Event-Dinge einbezogen werden, die vom Glück abhängen, weil man sonst gezwungen ist, diese wegzurollen und dafür einen Reroll zu verschwenden, einfach weil man Pech hat. Es kann halt einfach passieren, dass man die Aroma-Beute das ganze Event über gar nicht erhält."}, {"4": "bei den knappen Mitteln im Event gefällt es mir absolut nicht, dass die Tagesquests mich zwingen, einen Kunden zu bedienen. Ich setze die Eventwährung dann ein und bediene Kunden, wenn ich den Tagespreis haben möchte. Und nicht irgendwann zwischendurch, wenn das ganze total sinnlos ist für mich.[BR][BR]Und @Souliena stimme ich voll und ganz zu: Die Loots sind sehr sehr selten und ich benötige diese, um mal einen oder anderen Tagespreis zu ergattern und nicht, um mehrere davon irgendwann einsetzen zu müssen, weil ein Quest das gerade mal so will[BR][BR]Rikku33 schrieb:@Souliena Wochenquests werden doch nur nach hinten geschoben, nicht komplett ersetzt. Und du hast mehr als eine Woche Zeit, diese zu erledigen, indem du sie nicht \"rerollst\", sondern entspannt nach und nach erledigst. [smilie--sprite2]Zum Vergrößern anklicken....ja, das stimmt zwar, aber was ist, wenn ich diesen Quest bis zum Eventende nicht schaffe? Dann kann ich den nicht im nächsten Event einlösen, da expliziet Bezug genommen wird auf Mama Juuls Event."}, {"169": "Souliena schrieb:\t\t\tAlso, dass das Event einbezogen wird, schön und gut, aber, dass Dinge benutzt werden sollen, die man nur per Zufall !!! bekommt... Diese Glückskarten (Aroma-Beute) haben in der Season nichts zu suchen meiner Meinung nach.[BR]Auf der Beta hab ich in den letzten 10 Tagen des Events nicht 1 Mal diese Teile bekommen.[BR]Und ich brauche die 2 Rerolls, um unliebsame Kurz Produktionen der Werkstätten loszuwerden.\t\tZum Vergrößern anklicken....Findest auch meine vollste Unterstützung !!!![BR]Habe mich darüber auch tierisch geärgert, da ich bei solchen Glücksspielen sowieso kaum mal was erhalte (ja es ist ein Glückspiel) und dann in diesem Falle, soll ich gleich 3x die Aroma Beute öffnen.[BR]Ich habe dann getauscht und siehe da ???? - Gleiche Aufgabe !!!!! [smilie--sprite9]- DAS hat dann auch nichts mit TAUSCH ! zu tun - schon sehr schade.[BR]Habe mich dann dazu verleiten lassen auch den 2. Tausch noch durchzuziehen und siehe da ???? ERNEUT die Aufgabe [smilie--sprite4][BR]Was soll man dazu noch sagen.[BR][BR]Das \"puzzeln\" ist schon witzig und OK, aber die Einbeziehung des Events mit Mini-%- Gewinnchancen ist in meinen Augen ziemlich blöd.[BR]Wenn es jetzt heißen würde - \"Erfülle 3 Bestellungen\" o.ä. könnte ich mich noch mit anfreunden, aber so leider nicht.[BR][BR]Ich mage die Saison der Träume eigentlich auch und auch wenn man mal schon ein Gebäude, Wissenspunkte, .... hat - es sind nette Beigaben. [BR]Die letzte Saison habe ich auch komplett alle Tages- und Wochenpreise mitgenommen und mich gefreut (bis auf den letzten Tag mit den Wissenspunkten [smilie--sprite2] wo man sich etwas mehr versprochen hatte, aber OK).[BR][BR]Aber es sollte auch alles irgendwie im machbaren und fairen Rahmen bleiben (auch wenn es schwerer ist ist es OK).[BR][BR](Auf die Antworten von neulich - ja ich gebe ja auch Wissenspunkte aus, sei es zum Ausbau, als Spende, .... und es sollte kein nörgeln sein, sondern nur meine Meinung [smilie--sprite1] )"}, {"103": "beim Tausch der Wochenquest genau die selbe Aufgabe zu bekommen,[BR]sollte eigentlich nicht möglich sein"}, {"2": "littleFlex schrieb:\t\t\tbeim Tausch der Wochenquest genau die selbe Aufgabe zu bekommen,[BR]sollte eigentlich nicht möglich sein\t\tZum Vergrößern anklicken.......man bekommt sie aber nach dem 2. Tausch [smilie--sprite2]..."}, {"169": "littleFlex schrieb:\t\t\tbeim Tausch der Wochenquest genau die selbe Aufgabe zu bekommen,[BR]sollte eigentlich nicht möglich sein\t\tZum Vergrößern anklicken....Ungelogen- war aber so [smilie--sprite3]"}, {"103": "Romilly schrieb:\t\t\t...man bekommt sie aber nach dem 2. Tausch [smilie--sprite2]...\t\tZum Vergrößern anklicken....davon rede ich nicht[BR][BR]@monster68  dann solltest Du Dich bitte mal beim Support melden damit"}, {"169": "littleFlex schrieb:\t\t\tdavon rede ich nicht[BR][BR]@monster68  dann solltest Du Dich bitte mal beim Support melden damit\t\tZum Vergrößern anklicken....Werde ich dann nachher mal in Angriff nehmen [smilie--sprite9]"}, {"2": "littleFlex schrieb:\t\t\tdavon rede ich nicht\t\tZum Vergrößern anklicken.......trotzdem ist das nicht toll - wenn ich eine Aufgabe in einer Woche einmal wegtausche, dann möchte ich die nicht haben und auch nicht noch einmal wieder bekommen, wenn ich zum 2. Mal tausche..."}]