[{"103": "das verstehe ich"}, {"56": "Hatte kürzlich noch geschrieben, dass ich mal abwarte, was die Zukunft so an Preisen bringt und habe mir die Quests eigentlich nie so recht angesehen und damit auch die \"Besonderheiten\" nicht richtig erkannt...[BR][BR]Aber nun…[BR]Gut zu wissen, dass man die Saison nur spielen kann, wenn man…[BR]auch jedes Event spielt, egal ob man es nun möchte oder nicht![BR](mal ein Event nicht zu spielen kann sehr unterschiedliche Gründe haben) das Event dann auch noch nach den Vorgaben aus den Saison-Quests spielen muss![BR](Warum soll ich EW etc. verpulvern, wenn man auf bestimmte Tagespreise etc. warten möchte?)[BR]Damit ist leider das Saison-Feature (für mich) komplett gestorben und ich muss nicht mehr schauen ob es dort doch noch mal interessante Preise mit „Saison Pass“ gibt, denn ohne den Pass kommen sowieso nur die Dinge, die ich schon X-Mal im Inventar habe oder aber ohnehin nicht wollte/brauche![BR][BR]Schade, INNO mag sich ja was von der Verflechtung der Spielelemente versprechen, aber leider (für mich) eher abschreckend!"}, {"104": "Saison ist für sich nervig genug, leider nicht abzuschalten, aber dass genau jede Aufgabe erfüllt werden muss, gilt ja nun auch nicht.[BR]Ich habe in der ersten Saison recht konsequent nur Aufgaben gemacht die von alleine gingen, nicht zu vermeiden waren, von den Wochenaufgaben oft 1-2 wie '50x 15 Min. Produktion' offengeblieben, Tagesaufgaben ähnlich.[BR]Und zum Ende hin war das finale Gebäude doch noch in Aussicht, Mana auch am knappsten, lohnte sich zu holen. Mit etwas Mühe die letzten 2-3 Wochen vollständig und hat dann geklappt.. Eine Kiste in Schleife glaube ich auch noch.[BR][BR]Also einzelne Aufgaben zum Event muss man da nicht ganz kritisch sehen. Falls Saison gewollt, um andere Aufgaben bemüht, klappt es auch so gewiss. Nur am Ende eine Zusatzkiste mehr oder weniger.[BR][BR]---[BR][BR]Bei der Gelegenheit: das aktuell finale Gebäude ist als 2x2 und Saat vergleichsweise lahm. Aber auf dem Weg immerhin gut manches Mana-Gebäude."}, {"3": "Ich werde trotzdem auf die Event-Tagespreise warten, die ich haben will. Bestellung oder Kochmützen verschwenden kommt nicht in Frage.[BR]Dann lasse ich lieber mal eine Tagesquest sausen (sollte ja trotzdem für den Endpreis reichen) und verwende die Tauschfunktion, auch auf die Gefahr hin, dass es mir geht wie @monster68.  [smilie--sprite5][BR][BR]Aber insgesamt denke ich nicht, dass deswegen die Seasons unspielbar und unlösbar werden.[BR]Allein die Managebäude sind für mich erstrebenswert. Und der Endpreis ist hübsch und wird gut in meine Stadt passen."}, {"100": "Athaneia schrieb:\t\t\tHatte kürzlich noch geschrieben, dass ich mal abwarte, was die Zukunft so an Preisen bringt und habe mir die Quests eigentlich nie so recht angesehen und damit auch die \"Besonderheiten\" nicht richtig erkannt...[BR][BR]Aber nun…[BR]Gut zu wissen, dass man die Saison nur spielen kann, wenn man…[BR]auch jedes Event spielt, egal ob man es nun möchte oder nicht![BR](mal ein Event nicht zu spielen kann sehr unterschiedliche Gründe haben)das Event dann auch noch nach den Vorgaben aus den Saison-Quests spielen muss![BR](Warum soll ich EW etc. verpulvern, wenn man auf bestimmte Tagespreise etc. warten möchte?)Damit ist leider das Saison-Feature (für mich) komplett gestorben und ich muss nicht mehr schauen ob es dort doch noch mal interessante Preise mit „Saison Pass“ gibt, denn ohne den Pass kommen sowieso nur die Dinge, die ich schon X-Mal im Inventar habe oder aber ohnehin nicht wollte/brauche![BR][BR]Schade, INNO mag sich ja was von der Verflechtung der Spielelemente versprechen, aber leider (für mich) eher abschreckend!\t\tZum Vergrößern anklicken....Das seh ich nicht so extrem . [BR]Die Tagesaufgaben wie [BR][IMG]https://i.ibb.co/hMCLs0B/https-de-forum-elvenar-com-index-php-attachments-1683908480790-png-36179.png[/IMG][BR]lasse ich aus  . Wird nicht erfüllt .  Weil mir der heutige Tagespreis für dieserStadt nicht gefällt .[BR] Tagestruhe für 5 erfüllte Aufgaben ist ein Witz.[BR] Und Wochenquests werden getauscht  . [BR]Ich bin aber vorsichtiger beim tauschen , und mache auch  die  unpassenden  Wochenaufgaben . [BR]1 mal hab ich diese woche getauscht . [BR]Und es ist mir zu riskant  [BR][IMG]https://i.ibb.co/Y8G2N4d/https-de-forum-elvenar-com-index-php-attachments-1683908749582-png-36180.png[/IMG][BR]diese aufgabe zu tauschen . Und werd mich dort durchbeissen müssen . [BR]Ich seh kein Problem darin , das event  auszulassen und die Saison bis zum Hauptpreis zu spielen ."}, {"180": "ist trotzdem doof wenn das vermischt wird. Ich lasse mich ungern zu etwas zwingen. Unde das hat dann auswirkungen auf Entscheidungen die ich freiwillig treffe. wird halt weniger intensiv gespielt"}, {"135": "Portalsegen entzaubern sollte dringendst für \"Verwende Portalsegen\" gelten [smilie--sprite3]"}, {"4": "Xebifed schrieb:\t\t\tPortalsegen entzaubern sollte dringendst für \"Verwende Portalsegen\" gelten [smilie--sprite3]Zum Vergrößern anklicken....ich geh halt her jetzt und \"verwende\" diese Portalsegen. Geht zum Glück auch, wenn man kein Portal stehen hat. Nur verliert man die Fragmente dafür und die sind bei Portalos eigentlich recht gut."}, {"113": "Hatte ich noch nicht, ist mal was anderes, gefällt mir [BR][BR][IMG]https://i.ibb.co/bRqMftL/https-de-forum-elvenar-com-index-php-attachments-seasonquest-png-36732.png[/IMG]"}, {"4": "lovelymonster schrieb:\t\t\tHatte ich noch nicht, ist mal was anderes, gefällt mir[BR][BR]Anhang 36732 ansehenZum Vergrößern anklicken....Ja, gibt auch: Erfülle Turmbegegnungen durch Kampf[BR][BR]Doof halt, wenn man den Turm schon durch hat oder an einer Stelle ist, wo entweder Kampf oder Verhandlung nicht oder kaum möglich ist. [BR][BR][BR]-----------[BR][BR]Übrigens verschwinden die Eventbezogenen Quests nicht, wenn das Event zu Ende ist. So auf der Beta z.B.: Erfülle XX Eventquests und/oder Hole XX Mahlzeiten aus dem Lager.[BR][BR]Die hatte ich alle noch, nachdem das Event zu Ende war. Doof"}, {"135": "salandrine schrieb:\t\t\tJa, gibt auch: Erfülle Turmbegegnungen durch Kampf[BR][BR]Doof halt, wenn man den Turm schon durch hat oder an einer Stelle ist, wo entweder Kampf oder Verhandlung nicht oder kaum möglich ist.[BR][BR][BR]-----------[BR][BR]Übrigens verschwinden die Eventbezogenen Quests nicht, wenn das Event zu Ende ist. So auf der Beta z.B.: Erfülle XX Eventquests und/oder Hole XX Mahlzeiten aus dem Lager.[BR][BR]Die hatte ich alle noch, nachdem das Event zu Ende war. Doof\t\tZum Vergrößern anklicken....[BR]Meine zuletzt weggetauschte Event Aufgabe (Aroma Beute) ist zum Glück in der folgenden Woche nicht wieder dabei gewesen.[BR][BR]Edit: Aber in einer anderen Welt, die Aufgabe wurde nicht getauscht, nicht erfüllt. Ist immer noch da und nun auch nicht mehr erfüllbar.[BR][BR][IMG]https://i.ibb.co/dkYM9W9/https-de-forum-elvenar-com-index-php-attachments-1685968640846-png-36783.png[/IMG]"}, {"28": "Herrlich, wenn man durch Erledigung einer Wochenquest noch einen unerwarteten Bonus abstauben kann![BR][BR]Spoiler[IMG]https://i.ibb.co/37vZh7z/https-de-forum-elvenar-com-index-php-attachments-1686848717343-png-37014.png[/IMG][BR]Spoiler[IMG]https://i.ibb.co/rdDgcFL/https-de-forum-elvenar-com-index-php-attachments-1686848736163-png-37015.png[/IMG]"}, {"103": "naja, hat nicht unmittelbar miteinander zu tun und 100 Pkt voll zubekommen ist schon erwartbar...[BR][BR]aber Glückwunsch zu den Dias !"}, {"135": "ist das so richtig?[BR][BR][IMG]https://i.ibb.co/PmKsBHY/https-de-forum-elvenar-com-index-php-attachments-1687203174470-png-37110.png[/IMG][BR][BR]ich denke so müsste es aussehen:[BR][BR][IMG]https://i.ibb.co/zsMgVff/https-de-forum-elvenar-com-index-php-attachments-1687203330642-png-37113.png[/IMG]"}, {"135": "Thebigunknown schrieb:\t\t\tNein! [smilie--sprite1] Einmal refreshen (am PC auf F5), dann müsste der Button zum Abholen der Belohnungen auch wieder da sein. Zum Vergrößern anklicken....[BR]auch egal, ich klick da eh nicht drauf"}, {"28": "Xebifed schrieb:\t\t\tist das so richtig?\t\tZum Vergrößern anklicken....Nein! [smilie--sprite1] Einmal refreshen (am PC auf F5), dann müsste der Button zum Abholen der Belohnungen auch wieder da sein. [BR]Xebifed schrieb:\t\t\tich denke so müsste es aussehen\t\tZum Vergrößern anklicken....Das denke ich auch![BR]Xebifed schrieb:\t\t\tauch egal, ich klick da eh nicht drauf\t\tZum Vergrößern anklicken....Warum denn nicht?"}, {"135": "bekomme da eh nix komplett, wenig aktiv in den kleinstädten."}, {"28": "Xebifed schrieb:\t\t\tbekomme da eh nix komplett, wenig aktiv in den kleinstädten.\t\tZum Vergrößern anklicken....Ok - Das kann ich grundsätzlich dann schon irgendwie verstehen.[BR][BR]Ich nehme aber trotzdem immer alles mit was eh schon fertig ist, auch dort wo mir das Endergebnis nicht so wichtig ist. [smilie--sprite2][BR][BR]Es gibt ja auf dem Weg zum Ziel auch immer noch ein paar, meiner Meinung nach, lohnenswerte Preise mitzunehmen."}, {"4": "Xebifed schrieb:\t\t\tbekomme da eh nix komplett, wenig aktiv in den kleinstädten.\t\tZum Vergrößern anklicken....Muss doch nicht komplett werden, ich hab auch Accounts, da nehm ich nur mit, was sich sowieso ergibt. Warum nicht mitnehmen?"}, {"135": "salandrine schrieb:\t\t\tMuss doch nicht komplett werden, ich hab auch Accounts, da nehm ich nur mit, was sich sowieso ergibt. Warum nicht mitnehmen?\t\tZum Vergrößern anklicken....[BR]Weil man für eine erfüllte Tagesaufgabe rein gar nichts bekommt."}]