[{"4": "lorintha schrieb:\t\t\tOder das ?????\t\tZum Vergrößern anklicken....Du sollst während des Events einen Schritt auf der Eventmap gehen. War mir auf der Beta auch total unklar, was damit gemeint sein soll."}, {"122": "salandrine schrieb:Anhang 33790 ansehen[BR][BR]und schon beim ersten Quest ist es passiert:[BR][BR]Ich bin seit Dienstag Abend bei den Tagesquests, die Erledigung der Aufgabe: Schließe 10 Zauberer Event Quests ab ist mir deshalb gar nicht möglich.[BR][BR]Mal sehen, was der Support dazu sagt[BR][BR]Und bitte keinen Empfehlung: Du kannst doch ablehnen. Es ist nicht richtig, mir eine unerfüllbare Aufgabe zu geben. Zum Vergrößern anklicken....Danke für den Hinweis. Dann muss ich auch den Support anschreiben. Ich habe meine Frage hier gelöscht und in den Fragen Thread geschrieben. Bei wir wird Tages Event Q gefordert, welches bereits erledigt ist."}, {"120": "erster Eindruck, ganz schnell, bevor er wieder weg ist [smilie--sprite2][BR]Nettes Nebenbei. Darf von mir aus gern das eine oder andere Mammutevent ersetzen.[BR]salandrine schrieb:\t\t\tSchließe 10 Zauberer Event Quests ab ist mir deshalb gar nicht möglich.\t\tZum Vergrößern anklicken....das ist aber doch eine Wochenaufgabe, oder? Und ja, ich weiß, dass eine Woche nur 7 Tage hat"}, {"122": "salandrine schrieb:Anhang 33790 ansehen[BR][BR]und schon beim ersten Quest ist es passiert:[BR][BR]Ich bin seit Dienstag Abend bei den Tagesquests, die Erledigung der Aufgabe: Schließe 10 Zauberer Event Quests ab ist mir deshalb gar nicht möglich.[BR][BR]Mal sehen, was der Support dazu sagt[BR][BR]Und bitte keinen Empfehlung: Du kannst doch ablehnen. Es ist nicht richtig, mir eine unerfüllbare Aufgabe zu geben. [BR][BR][BR]Super Reaktion des Supports: Der Quest ist als erledigt eingetragenZum Vergrößern anklicken....[BR]Ich habe das Problem beim der Tagesaufgabe. Siehe meinen Beitrag im Fragen Thread. Der Support antwortete mir, dass es es nicht als erledigt eintragen kann."}, {"11": "collect a good amount of ascentent goods of your choise[BR][BR]was sind denn Aufstiegsgüter?? ???"}, {"123": "meine meinung !! auf beta haben wir ja schon länger den season und finde ihn wirklich sehr gut -[BR]man kann ihn in der regel mit seinen täglichen aktivitäten kombinieren und auch die wöchentlichen aufgaben fand ich bisher passend[BR]Ausnahme - heute auf felyn muss ich zum 1. mal tatsächlich tauschen - da aufgabe 10 event-quests -[BR]leider bin ich schon seit gestern mittag bei den tagesaufgaben - daher nicht schaffbar [smilie--sprite3](([BR]die erhöhung von 2500 auf 3k dias finde ich allerdings auch sehr überteuert !!"}, {"112": "muss so etwas wirklich sein?   [IMG]https://i.ibb.co/kKYV9W6/https-de-forum-elvenar-com-index-php-attachments-1674729952146-png-33793.png[/IMG][BR]..........................................................................Saison-[BR]...........................................................................Pass                     [BR]sähe um Klassen besser aus.[BR]hier genauso:............................ [IMG]https://i.ibb.co/YyNdDT6/https-de-forum-elvenar-com-index-php-attachments-1674730236570-png-33794.png[/IMG]"}, {"124": "Mir gefällt es [BR][BR][smilie--sprite2]"}, {"13": "Schnalle 04 schrieb:\t\t\tcollect a good amount of ascentent goods of your choise [...}\t\tZum Vergrößern anklicken....@Schnalle 04 moin >\"What are Ascended Goods?\" [Knowledge Base] + Ascended Goods Production Boost [Wiki]"}, {"17": "salandrine schrieb:\t\t\tEs ist nicht richtig, mir eine unerfüllbare Aufgabe zu geben. Zum Vergrößern anklicken....[BR]Kassiopeia24 schrieb:\t\t\tdas ist aber doch eine Wochenaufgabe, oder? Und ja, ich weiß, dass eine Woche nur 7 Tage hat\t\tZum Vergrößern anklicken....Auf der Beta haben sich bei mir die Wochenquests angesammelt, sprich machste die nicht in einer Woche waren sie nicht weg sondern unten links zeigst dann an das es das noch welche kommen wenn du eine der 4 erledigst.[BR][BR]collect a good amount of ascentent goods of your choise[BR]was sind denn Aufstiegsgüter?? ???[BR][BR]Am Bild orientieren, erleuchtet die 3. Art^^"}, {"11": "Monchhichi2310 schrieb:\t\t\tMir gefällt [BR]Schnalle 04 schrieb:\t\t\tcollect a good amount of ascentent goods of your choise[BR][BR]was sind denn Aufstiegsgüter?? ???\t\tZum Vergrößern anklicken....nochmal die frage\t\tZum Vergrößern anklicken...."}, {"13": "Beau de Bellancourt schrieb:@Schnalle 04 moin >\"What are Ascended Goods?\" [Knowledge Base] + Ascended Goods Production Boost [Wiki]Zum Vergrößern anklicken....@Schnalle 04 moin > \"Was sind Erleuchtete Güter?\" [Wissensdatenbank] + Erleuchtete Güter Produktionsbonus [Wiki]"}, {"2": "salandrine schrieb:\t\t\tUnd bitte keinen Empfehlung: Du kannst doch ablehnen. Es ist nicht richtig, mir eine unerfüllbare Aufgabe zu geben. Zum Vergrößern anklicken.......die wöchentlichen Quests verfallen doch nicht - die landen in der Warteschleife und sowie du eine Quest dann - nächste Woche - fertig hast, rückt die, die durch diese \"alte Quest\" aufgeschoben wurde, automatisch nach...[BR][IMG]https://i.ibb.co/16Q6n9W/https-de-forum-elvenar-com-index-php-attachments-warteschleife-png-33796.png[/IMG]"}, {"125": "Lohnt es sich den Saison-Pass zu kaufen?"}, {"2": "Handelsbaron schrieb:\t\t\tLohnt es sich den Saison-Pass zu kaufen?\t\tZum Vergrößern anklicken.......musst du selbst entscheiden - die meisten denken: eher nicht...ich werd ihn kaufen, weil mir eines der Gebäude in meiner Sammlung fehlt..."}, {"4": "Handelsbaron schrieb:\t\t\tLohnt es sich den Saison-Pass zu kaufen?\t\tZum Vergrößern anklicken....Ich habe es auf der Beta gemacht, da ich dort mangels Rabatten, sowieso nichts mit den Dias so richtig anzufangen weiß.[BR][BR]Hier werde ich es NICHT tun. Warum? Weil ich jetzt auf der Beta so ziemlich verpflichtet bin a) täglich teils mehrfach im Spiel zu sein, b) ich mich selbst damit verpflichtet habe, möglichst alle Tages- und Wochenquests zu spielen und mich selbst somit unter Druck gesetzt habe.[BR][BR]Ich werde hier gucken, wie weit ich komme mit den Season Erfolgen und dann kurz vor Schluss erst entscheiden, ob ich die Dias investiere oder nicht.[BR][BR]Ich denke, wer noch nicht zuviel zu zahlen hat für eine Erweiterung, ist mit dieser sicher besser bedient, es sei denn, die möglichen Gebäude helfen ihm wirklich sehr weiter. Aber auch dann die Empfehlung: ERst mal gucken, wie weit man überhaupt kommt - genau, wie ich es auch beim Royalen Preispass im Event mache."}, {"126": "Handelsbaron schrieb:\t\t\tLohnt es sich den Saison-Pass zu kaufen?\t\tZum Vergrößern anklicken....Ich persönlich empfinde es zu teuer für das, was ich bekomme. Vor allem, weil er auf der Beta 2500 Diamanten kostete und jetzt noch mal hochgesetzt wurde. Ich gebe aber auch in Events nie Diamanten für den Königlichen Pass aus."}, {"55": "salandrine schrieb:\t\t\tIch habe es auf der Beta gemacht, da ich dort mangels Rabatten, sowieso nichts mit den Dias so richtig anzufangen weiß.[BR][BR]Hier werde ich es NICHT tun. Warum? Weil ich jetzt auf der Beta so ziemlich verpflichtet bin a) täglich teils mehrfach im Spiel zu sein, b) ich mich selbst damit verpflichtet habe, möglichst alle Tages- und Wochenquests zu spielen und mich selbst somit unter Druck gesetzt habe.[BR][BR]Ich werde hier gucken, wie weit ich komme mit den Season Erfolgen und dann kurz vor Schluss erst entscheiden, ob ich die Dias investiere oder nicht.[BR][BR]Ich denke, wer noch nicht zuviel zu zahlen hat für eine Erweiterung, ist mit dieser sicher besser bedient, es sei denn, die möglichen Gebäude helfen ihm wirklich sehr weiter. Aber auch dann die Empfehlung: ERst mal gucken, wie weit man überhaupt kommt - genau, wie ich es auch beim Royalen Preispass im Event mache.\t\tZum Vergrößern anklicken....[BR][BR]Beta Welt ist immer noch der Testserver, und kann mit den Liveservern nicht verglichen werden."}, {"125": "salandrine schrieb:\t\t\tIch habe es auf der Beta gemacht, da ich dort mangels Rabatten, sowieso nichts mit den Dias so richtig anzufangen weiß.[BR][BR]Hier werde ich es NICHT tun. Warum? Weil ich jetzt auf der Beta so ziemlich verpflichtet bin a) täglich teils mehrfach im Spiel zu sein, b) ich mich selbst damit verpflichtet habe, möglichst alle Tages- und Wochenquests zu spielen und mich selbst somit unter Druck gesetzt habe.[BR][BR]Ich werde hier gucken, wie weit ich komme mit den Season Erfolgen und dann kurz vor Schluss erst entscheiden, ob ich die Dias investiere oder nicht.[BR][BR]Ich denke, wer noch nicht zuviel zu zahlen hat für eine Erweiterung, ist mit dieser sicher besser bedient, es sei denn, die möglichen Gebäude helfen ihm wirklich sehr weiter. Aber auch dann die Empfehlung: ERst mal gucken, wie weit man überhaupt kommt - genau, wie ich es auch beim Royalen Preispass im Event mache.\t\tZum Vergrößern anklicken....Dankeschön für Dein Feedback"}, {"127": "Freue mich darauf, sieht gelungen aus!"}]