[{"28": "Na ja, die 5 Blütenblätter wären dir für diese eine Quest direkt sicher gewesen. Ist zwar nur ein Mini-Schritt aber jedes Blütenblatt führt ja in die richtige Richtung um bei den Belohnungen die Auswahlmöglichkeiten zu erhöhen und vielleicht doch noch ein Saison-Souvenir mitzunehmen.[BR][BR]Edit: Gerade die vielen kleinen Souvenirs der Saisons, insbesondere die Gebäude, lassen sich ja schön lange aufheben bis man sie abholen muss bzw. bis man sie automatisch erhält. [BR]In Winyandor wird mir dies im nächsten Kapitel recht hilfreich sein, da wird dann Mana benötigt, was ja einige Gebäude aus den Saisons-Belohnungen direkt mitbringen.[BR][BR][IMG]https://i.ibb.co/XxNjS6W/https-de-forum-elvenar-com-index-php-attachments-1687729016741-png-37232.png[/IMG][BR][BR][IMG]https://i.ibb.co/bRFKWpv/https-de-forum-elvenar-com-index-php-attachments-1687729035074-png-37233.png[/IMG]"}, {"28": "Gefällt mir![BR][BR]Spoiler[IMG]https://i.ibb.co/ysQhHMx/https-de-forum-elvenar-com-index-php-attachments-1688756486124-png-37401.png[/IMG]"}, {"113": "Ich hab das gar nicht so recht mitbekommen, hab einfach immer die Quests bedient und plötzlich ist die Season zu Ende. Aber der Teich ist hübsch. [smilie--sprite1]"}, {"135": "lovelymonster schrieb:\t\t\tIch hab das gar nicht so recht mitbekommen\t\tZum Vergrößern anklicken....[BR]Wird langsam Zeit, auszuwählen...[BR][BR][IMG]https://i.ibb.co/zftSVW5/https-de-forum-elvenar-com-index-php-attachments-1688835148075-png-37419.png[/IMG]"}, {"181": "Bin gespannt, wie viele Beititel der Seasons noch auf uns warten. Da wäre vielleicht ein kleines Spiel zur Namensfindung ganz interessant. Wie auch immer: Ich freue mich und hoffe, dass noch mehr davon kommen. [smilie--sprite1]"}, {"21": "Unnötig wie immer........"}, {"8": "ich erhöhe um 7 [smilie--sprite2][BR][IMG]https://i.ibb.co/gVVpL46/https-de-forum-elvenar-com-index-php-attachments-tollesaisonquests-jpg-37825.jpg[/IMG]"}, {"9": "gergerw schrieb:\t\t\tch erhöhe um 7 [smilie--sprite2][BR][IMG]https://i.ibb.co/gVVpL46/https-de-forum-elvenar-com-index-php-attachments-tollesaisonquests-jpg-37825.jpg[/IMG]Zum Vergrößern anklicken....Du kannst wechseln, also ausweichen, @Indianaking nicht.  [smilie--sprite2][BR][BR]Edit:[BR]Obendrein hast du 1 Woche Zeit dafür, @Indianaking nur ein paar Std."}, {"1": "Wer die Quest mit der einen Eventaufgabe lösen heute nicht beenden kann, da er bei den Tagesquests ist und diese bereits heute morgen erledigt hat, kann sich gerne an den Support wenden.[BR][BR]Das dies keine tolle Aufgabe für den ersten Tag ist, wurde auch direkt weitergeleitet."}, {"35": "Man könnte auch die Tagesesquests austauschbar machen. Der Vorschlag ist nicht neu. Wurde das auch weitergeleitet?"}, {"8": "AngelOfDead schrieb:\t\t\tEdit:[BR]Obendrein hast du 1 Woche Zeit dafür, @Indianaking nur ein paar Std.\t\tZum Vergrößern anklicken....1 Woche um 8 quests zu lösen???[BR][smilie--sprite8][BR][BR]ok, wieviele Diamanten muss ich stibitzen, damit das klappt?[BR][BR][BR]Pssst, hab einfach getauscht... 600k erleuchtete Güter erwirtschaften... easy! [smilie--sprite1]"}, {"104": "Tacheless schrieb:\t\t\tDas dies keine tolle Aufgabe für den ersten Tag ist, wurde auch direkt weitergeleitet.\t\tZum Vergrößern anklicken....Nicht schon seit erster Saison (oder man traut sich kaum zu erwähnen: Beta) oder in 10 sec aufzufallen wenn auch nur ein Verantwortlicher die Liste durchgeht und nachdenkt?[BR]Andere Aufgaben wie größere Menge Mana bekannt auch schlecht am 1. Tag, falls die 24h-Produktionen des Tages schon durch.[BR][BR]Allzu schlimm die Aufgabe nicht zu schaffen nicht, aber wenn tatsächlich vor gegenzusteuern, erstaunlich schlechtes Vorgehen.[BR]Wäre erträglicher wenn ehrliche Meinung dazugeschrieben: 'Ja, da geht bei Inno wieder alles schief, mir peinlich hier zu arbeiten' [smilie--sprite2][BR]Aber wenn so nüchtern geschrieben, als wäre das normal, dann selber direkt für alles Schlechte mitverantworlich..[BR][BR]Wieso überhaupt eine Saison in einem Event zu beginnen, warum solch unnötige Fehler, da gibt es doch keinen guten Grund?[BR]Auf Kalender schauen, Wochen zwischen Event wählen, dort Saison beginnen lassen, so simpel..[BR]Und: 2:00 Uhr nachts beginnen lassen, nicht mittags, dann weniger Probleme für jene die ihre 24h-Produktionen gerade morgens einsammeln.[BR][BR]Es ist so supersimpel, aber alles falsch gemacht.."}, {"104": "Saison 1 in Beta erste Tage kann man das sagen. [smilie--sprite2] Wo ist die Korrektur dann, wo ist die Selbsterkenntnis des fehlerhaften Prozesses, der nicht erfolgenden Arbeit? Wo ist die interne Nachfrage, ob und wer daran arbeitet, mit welcher Professionalität? Ob Schlechtigkeit erkannt, große Umstellungen, oder alles egal und immer so weitergeht?"}, {"1": "@ForgeS44 Dir ist aber schon klar, dass es sich bei den täglichen Quests in der Saison um Zufallsquests handelt? Nicht alle Spieler hatten diese Quest. [BR][BR]Deine anderen generellen Anfeindungen kannst du aber bitte gerne hier unterlassen. Danke für dein Verständnis."}, {"104": "Nichts zum Fehler oder zur Lösung beizutragen, nur eine sinnlose Nachfrage und Abweisung aller glasklarer logischer Kritik/ Verbesserungsvorschläge (die man eigentlich gar nicht erst nennen müsste). [BR]Keinerlei Einsicht/ Gelobung Besserung, wie dass tatsächlich mal irgendjemand die Liste durchgeht und Ja/Nein zu allen für ersten Tag unterschreibt..[BR][BR]So geht es voran.."}, {"178": "Naja. es gibt unschöne Quests für den ersten Tag der Seasons... auch unpassendes für die Woche...[BR][BR]Mir selbst ist es relativ egal. da ich kein Echtgeld für den Seasonpass ausgeben werde, sind mir auch die lächerlichen 5er Aufgaben am ersten Tag egal.[BR]Bisher bekomm ich immer genug dieser Seasonwährung zusammen um bei den Kisten auf Belohnungsseite 11 zu landen. Diese sind dann einfach zu lasch in der Belohnung um ohne Seasonpass überhaubt über den Nutzen dieser nachzudenken.[BR][BR]Und selbst wenn man bei INNO meinen würde man müsst es jetzt deshalb schwerer machen.... auch die vorherigen Preise der Seasons sind nicht Überlebenswichtig!!![BR][BR]ein Gedanke dazu wär es eventuell den Season Start auch 1-2 Tage vorher anzukündigen. dann könnte man darauf gefasst sein... andererseits. Nach der Season ist vor der Season... irgendwie kann man es ja auch ahnen![BR][BR]Was ich allerdings an den Tagesquests auch lästig finde ist dieses fordern der Zauber. kann ich nicht bitte selbst entscheiden wann ich die nutzen möchte. müssen mir immer wieder Seasons oder andere Quests vorschreiben wann ich was verschwenden muss.[BR][BR]Der letzte Witz, hatte eine mag Mitgift nutzen sollen.... die Tagesbelohnung dann ein 30min Zeitbooster.[BR]Meiner Meinung nach ein völlig lächerlicher Tausch..... das auch das was ich von verschiedenen Dingen hier halte... Unverhältnisse welche vieles einfach lächerlich machen![BR]Ist aber nur meine Meinung."}, {"14": "das geht mir tatsächlich auch so: [BR]den Pass werde ich nicht gegen Echtgeld erwerben, Dias wäre eine andere Geschichte[BR][BR]es ist DESHALB absolut egal, wie weit man am Ende innerhalb des Kistendrehs kommt, weil die Belohnungen dort ohne Pass nicht sehr ansprechend sind: [BR]es reicht also einfach die Saison vor sich hinzuspielen: bis zum Ende kommt man eh, wenn man täglich online ist[BR][BR]was mich manchmal auch stört (aber ich müsste es ja auch nicht wegen 5 Blütenblättern machen): springe einmal durch einen Ring[BR]denn an Tagen, an denen man wegen des Tagesgewinnens nicht spielen würde, ist es eigentlich Eventwährung-Verschwendung[BR]aber ich hatte dann doch tatsächlich Glück und habe Eventwährung zurückgewonnen, in der anderen Stadt allerdings nicht[BR]also, ich hätte heute keine Eventwährung ausgegeben und nach dem Post von @Hanlar und der Überlegung zu den Drehpreisen nach der letzten Belohnung, werde ich so etwas zukünftig auch auslassen"}, {"178": "Neris schrieb:\t\t\twas mich manchmal auch stört (aber ich müsste es ja auch nicht wegen 5 Blütenblättern machen): springe einmal durch einen Ring[BR]denn an Tagen, an denen man wegen des Tagesgewinnens nicht spielen würde, ist es eigentlich Eventwährung-Verschwendung[BR]aber ich hatte dann doch tatsächlich Glück und habe Eventwährung zurückgewonnen, in der anderen Stadt allerdings nicht[BR]also, ich hätte heute keine Eventwährung ausgegeben und nach dem Post von @Hanlar und der Überlegung zu den Drehpreisen nach der letzten Belohnung, werde ich so etwas zukünftig auch auslassen\t\tZum Vergrößern anklicken....Hast du es gegen Ende etwas mit dem Event verwechselt... denn in den Seasons gibt es keine Eventwährung zurück...[BR][BR][smilie--sprite2] ansonsten ja . leider folgt alles irgendwie dem gleichen Muster.... Seasons, Events.... mehr davon was irgendwie einfach doch nur dasselbe ist.[BR]Wenn das dann neu und abwechslungsreich sein soll...."}, {"14": "nee, in den Saisons gibt es keine Eventwährung zurück, aber wenn dort die Aufgabe lautet:[BR]springe einmal (mit einem Seepferdchen) durch einen Ring oder so ähnlich, dann sollte ich wohl einmal Eventwährung ausgeben[BR][BR]naja, aber was sollten sie denn neu erfinden?[BR]die Grundstruktur lässt doch gar nicht so extrem viel zu in dem Spiel?[BR]und eigentlich wird alles mal abgedeckt[BR][BR]man könnte es nur schwerer machen: springe 5x durch die Ringe, prodde 10 Werkzeugkisten, spiele 20 Turniere etc..[BR]da ist es doch im Prinzip ganz gut, wie es ist, denn man kann ja auch mal was weglassen"}, {"178": "Neris schrieb:\t\t\tnee, in den Saisons gibt es keine Eventwährung zurück, aber wenn dort die Aufgabe lautet:[BR]springe einmal (mit einem Seepferdchen) durch einen Ring oder so ähnlich, dann sollte ich wohl einmal Eventwährung ausgeben[BR][BR]naja, aber was sollten sie denn neu erfinden?[BR]die Grundstruktur lässt doch gar nicht so extrem viel zu in dem Spiel?[BR]und eigentlich wird alles mal abgedeckt[BR][BR]man könnte es nur schwerer machen: springe 5x durch die Ringe, prodde 10 Werkzeugkisten, spiele 20 Turniere etc..[BR]da ist es doch im Prinzip ganz gut, wie es ist, denn man kann ja auch mal was weglassen\t\tZum Vergrößern anklicken....erfinden macht man dennoch... mehr Spielmodule und dennoch nix neues. kostet den User nur mehr Zeit und auch die Bezahloptionen werden damit mehr.[BR]Das ist der Fortschritt!"}]