[{"4": "Sicher wäre es möglich, das Event auch nachts beginnen zu lassen. Nur, da arbeitet niemand. Und extra für mögliche Fehler, die vielleicht gar nicht auftreten, extra einen Nachtschichtmitarbeiter aufrecht zu halten, ist nicht gerechtfertigt, da zu Kostenintensiv.[BR][BR]Ja, der erste Tag ist immer nicht so günstig, nur muss man nicht alle Tagesquests lösen, um zum Hauptpreis zu kommen."}, {"28": "Hanlar schrieb:\t\t\tein Gedanke dazu wär es eventuell den Season Start auch 1-2 Tage vorher anzukündigen. dann könnte man darauf gefasst sein\t\tZum Vergrößern anklicken....Der Gedanke gefällt mir! [smilie--sprite2]"}, {"4": "einfach mal die Ankündigungen lesen[BR][BR]\"[BR]Liebe Menschen und Elfen,[BR][BR]am 27.07.2023 startet eine neue Saison![BR]Die Saison des Triumphs wird euch die Möglichkeit geben, Belohnungen zu erhalten, indem ihr über einen langen Zeitraum hinweg tägliche und wöchentliche Quests erfüllt!\"[BR][BR]\t\t\thttps://de.forum.elvenar.com/index.php?threads/die-saison-des-triumphs.27249/\t\t[BR]vom 19. Juli"}, {"28": "salandrine schrieb:\t\t\teinfach mal die Ankündigungen lesen\t\tZum Vergrößern anklicken....Danke @salandrine die hatte ich tatsächlich entweder übersehen oder schon wieder vergessen! [smilie--sprite2][BR][BR]Ich würde es aber schon irgendwie gut finden wenn es ähnlich wie für GA und Event auch für den Saisonstart so einen schicken \"ingame-Timer\" vorab geben würde - so als kleine Erinnerung nochmal kurz bevor es los geht. Das übersehe ich dann jedenfalls nicht."}, {"176": "Falls es euch interessiert - Schaut mal in eure  Saison nach - bei zwei meiner Städte kann ich den Pass scheinbar für 3000 Dias bekommen. [BR][IMG]https://i.ibb.co/n0L716t/https-de-forum-elvenar-com-index-php-attachments-saison-2023-07-30-032306-jpg-37883.jpg[/IMG]"}, {"2": "loselfe schrieb:\t\t\tbei zwei meiner Städte kann ich den Pass scheinbar für 3000 Dias bekommen\t\tZum Vergrößern anklicken.......hast du den Pass in einer Stadt bereits gegen Echtgeld gekauft?..."}, {"50": "Ich gebe für die Saison definitiv kein Geld geschweige denn Dias aus (da mir Geld und Dias dafür zu schade wären) und bei meinen 9 Live-Städten habe ich 6x die Möglichkeit den Saison-Pass für Dias zu erwerben und 3x für den Einsatz von Geld.[BR][BR]Die nachfolgenden Screenshots stammen vom selben Account, bei dem ich 4x für Dias den Saison-Pass und 1x für Geld bekommen würde ->[BR][IMG]https://i.ibb.co/2YxJsmS/https-de-forum-elvenar-com-index-php-attachments-1690697120653-png-37884.png[/IMG] [IMG]https://i.ibb.co/xzK3C7T/https-de-forum-elvenar-com-index-php-attachments-1690697143504-png-37885.png[/IMG]"}, {"2": "...die Pass-Preise sind diesmal so uninteressant, daß ich nicht mal Dias dafür ausgeben würde..."}, {"118": "Da muss ich Romilly zustimmen, die Preise sind dieses Mal wirklich alles Nieten. Die Endpreise der zwei letzten  Seasons haben mir optisch wirklich sehr gefallen und ich habe versucht wirklich jeden Tag alle Quests zu erfüllen. [BR]Da war die Überraschung umso größer,als ich gesehen habe welche Ansammlung von Nieten es dieses Mal gibt. [BR]Das Positive daran: ich kann diese Seasons wirklich getrost ignorieren und verpasse gar nichts."}, {"2": "...wenn der Preispass schon (nur) gegen Echtgeld angeboten werden soll, wieso kombiniert man ihn dann nicht mit anderen seltenen Kauf-Angeboten, wie z.B. den Gebäuden, die beim Erreichen eines neuen Kapitels angeboten werden...[BR][BR]...also die da... [IMG]https://i.ibb.co/kD5Mw1C/https-de-forum-elvenar-com-index-php-attachments-kapitelangebot-png-37886.png[/IMG]...[BR][BR]...also hier meinetwegen 5 Euro drauf schlagen und dann bekommt man das entsprechende Gebäude zusätzlich zum Preispass (bzw. andersrum) - dafür können dann auch die Diamanten aus den Preisen gegen Blaupausen ersetzt werden...man hätte so regelmäßig die Chance, an diese Gebäude zu kommen - selbst, wenn man im Kapitel nicht fortschreiten möchte (warum auch immer)...[BR][BR]...ebenso wäre es gut, wenn die Premium-Zusatztruhen nach den 50 Meilensteinen ordentlich aufgebessert werden würden und man hierfür weitere Blütenblätter gegen Diamanten erwerben könnte...[BR][BR]...nebenbei wäre es toll, wenn man generell bereits abgelaufene Gebäude einlagern könnte - es ist echt schade (für Sammler), wenn man die Dinger nach Ablauf einfach wegschmeißen muss, um keinen Platz zu vergeuden...[BR][BR]...ich hab nichts gegen Echtgeld-Kaufangebote - aber das Preis-Leistungs-Verhältnis sollte schon passen..."}, {"4": "ich finde den Hauptpreis dieses Mal wirklich sehr gut. Das beste oder eines der besten Kulturgebäude insgesamt.[BR][BR]Nur die Preise gegen Dia-/Echtgeld-Kauf sind wirklich dieses Geld nicht wert. [BR][BR]Ich konnte im Browser nur gegen Echtgeld kaufen, andere Spieler haben mir den Kauf gegen Dias bestätigt, allerdings dann auf dem Handy."}, {"178": "salandrine schrieb:\t\t\tNur die Preise gegen Dia-/Echtgeld-Kauf sind wirklich dieses Geld nicht wert.[BR][BR]Ich konnte im Browser nur gegen Echtgeld kaufen, andere Spieler haben mir den Kauf gegen Dias bestätigt, allerdings dann auf dem Handy.\t\tZum Vergrößern anklicken....Scheint als wär diese Umstellung ähnlich wie auch das Ding mit der Werbung noch in der TestPhase... also hat wohl mancher den Nachteil immernoch Dias investieren zu müssen und  nicht den Segen das mit Echtgeld kaufen zu können ^^"}, {"113": "Bis gestern, glaub ich jedenfalls - ich achte da nicht so drauf, gab es in meinen drei bespielten Städten den Saisonpass am PC und am Handy für Diamanten. Heute ist mir aufgefallen, dass jetzt Echtgeld angesagt ist, an PC und Handy.[BR]Ist womöglich terminiert für frühe Würmer (oder so ähnlich [smilie--sprite2] )"}, {"3": "Träum ich?[BR]Bei mir in der App (Android) gibt es seit dem Update auf Version 1.180 den Saisonpass wieder für Diamanten. 3000 an der Zahl.[BR]seltsam, aber gut [smilie--sprite1]"}, {"104": "[IMG]https://i.ibb.co/7X9rScx/https-de-forum-elvenar-com-index-php-attachments-1691044203890-png-37928.png[/IMG][BR][BR]Ganze 3 Min. an Zeitbooster zur Auswahl? [smilie--sprite2] Was ein Preis. Da dauert ja drüber wundern länger.[BR]An anderen Zeitboostern schwankt es, 10 Min. vorher auch schon mal, aber auch 14h + 8h. Darf man da nicht etwas mehr Konzept dahinter verlangen?"}, {"111": "Die besch ... euerten Booster gibt's immer mit Alternativen. Die brauchbaren einzeln. Macht die Entscheidung leichter."}, {"4": "Ich kann auch die Alternativen häufig nicht nachvollziehen. Da steht ein 3 Min Zeitbooster gleichberechtigt neben einem Seepferdchen-Gebäude?"}, {"178": "salandrine schrieb:\t\t\tIch kann auch die Alternativen häufig nicht nachvollziehen. Da steht ein 3 Min Zeitbooster gleichberechtigt neben einem Seepferdchen-Gebäude?\t\tZum Vergrößern anklicken....Eh, du beschwerst dich auch... willste zukünftig ne 1x1 Kultur-Toilette als Alternative zu den 3 Min [smilie--sprite2]"}, {"4": "Hanlar schrieb:\t\t\tEh, du beschwerst dich auch... willste zukünftig ne 1x1 Kultur-Toilette als Alternative zu den 3 Min [smilie--sprite2]Zum Vergrößern anklicken....Bitte mir nichts in den Mund legen. Ich habe mich nicht beschwert, ich habe nur mein Unverständnis kund getan, sonst nichts."}, {"112": "den mini-booster habe ich auch mit erstaunten augen entdeckt und mich gefragt was das soll... naja, hab dann aber doch aber was anderes ausgewählt  [smilie--sprite2]"}]