[{"28": "Als ich damals anfing Elvenar in mehreren Welten zu spielen, fiel mir genau ein einziges Mal in einer Stadt in der Nachbarschaft ein, wie ich finde sehr witziges, Gebäude auf, von dem ich dachte wenn sich die Gelegenheit mal irgendwann bieten sollte werde ich zuschlagen.[BR][BR]Nach etwas über 2 Jahren fiel es mir nun zufällig in die Hände - ich bin happy! [smilie--sprite2][BR][BR]Spoiler[IMG]https://i.ibb.co/7tBDJ9L/https-de-forum-elvenar-com-index-php-attachments-1691899011464-png-38210.png[/IMG][BR]               Es hat direkt einen Platz am Beta-Campus bekommen, ich hab gehört die Studenten stehen auf solche Musik.[BR][IMG]https://i.ibb.co/NFZCKYF/https-de-forum-elvenar-com-index-php-attachments-1691900987929-png-38211.png[/IMG]"}, {"28": "OMcErnie schrieb:\t\t\tIch gebe für die Saison definitiv kein Geld geschweige denn Dias aus (da mir Geld und Dias dafür zu schade wären) und bei meinen 9 Live-Städten habe ich 6x die Möglichkeit den Saison-Pass für Dias zu erwerben und 3x für den Einsatz von Geld.[BR][BR]Die nachfolgenden Screenshots stammen vom selben Account, bei dem ich 4x für Dias den Saison-Pass und 1x für Geld bekommen würde ->[BR][IMG]https://i.ibb.co/2YxJsmS/https-de-forum-elvenar-com-index-php-attachments-1690697120653-png-37884.png[/IMG][IMG]https://i.ibb.co/xzK3C7T/https-de-forum-elvenar-com-index-php-attachments-1690697143504-png-37885.png[/IMG]Zum Vergrößern anklicken....Hanlar schrieb:\t\t\tScheint als wär diese Umstellung ähnlich wie auch das Ding mit der Werbung noch in der TestPhase... also hat wohl mancher den Nachteil immernoch Dias investieren zu müssen und nicht den Segen das mit Echtgeld kaufen zu können ^^\t\tZum Vergrößern anklicken....Sorry für den Doppelpost aber im bereits geposteten Beitrag lassen sich leider keine Zitate mehr einfügen.[BR][BR]Ein Schelm wer böses dabei denkt, denn eine Art Abfrage wie bereitwillig Geld ins Spiel  investiert wird oder nicht, lässt ja eventuell zumindest allgemeine Rückschlüsse auf die Bereitschaft Geld online auszugeben und auch auf die allgemeine Kaufkraft zu.[BR]Immer gut! Wenn man Werbeverträge verkaufen will redet man ja in erster Linie immer von \"conversations per thousand\".[BR]Das heißt das vorab kalkuliert wird wie viele von jeweils 1000 Nutzerinnen und Nutzern denen eine Werbung präsentiert wird auch darauf reagieren, sprich zumindest zum Beispiel die betreffende Website besuchen um sich mehr Infos zum beworbenen Produkt anschauen und im Idealfall eine Konversation mit dem Werbetreibenden beginnen.[BR]Wenn man das ganze jetzt noch an eine gewisse statistisch berechnete Kaufbereitschaft und evtl. auch Kaufkraft koppelt die man ja vielleicht auf diesem Weg auch zu ermitteln versucht, lässt sich Werbung doch in Zukunft immer passgenauer platzieren - ich bin begeistert! [smilie--sprite2]"}, {"178": "Thebigunknown schrieb:\t\t\tImmer gut! Wenn man Werbeverträge verkaufen will redet man ja in erster Linie immer von \"conversations per thousand\".[BR]Das heißt das vorab kalkuliert wird wie viele von jeweils 1000 Nutzerinnen und Nutzern denen eine Werbung präsentiert wird auch darauf reagieren, sprich zumindest zum Beispiel die betreffende Website besuchen um sich mehr Infos zum beworbenen Produkt anschauen und im Idealfall eine Konversation mit dem Werbetreibenden beginnen.[BR]Wenn man das ganze jetzt noch an eine gewisse statistisch berechnete Kaufbereitschaft und evtl. auch Kaufkraft koppelt die man ja vielleicht auf diesem Weg auch zu ermitteln versucht, lässt sich Werbung doch in Zukunft immer passgenauer platzieren - ich bin begeistert!\t\tZum Vergrößern anklicken....[BR]OK, das erklärt dann einen Eindruck den ich aktuell hab.[BR]offenbar hat es also nen Grund warum man das Ganze erstmal nur mit einem Teil der Spieler testet. [BR]Also meine eigenen und auch einige Spieler mit denen ich das Thema mal etwas erörtert hab...[BR]Offenbar wurden auch eher die Spieler mit Werbung belohnt die schon ab und an mal gezahlt haben... vielleicht auch nur mehr Dias ausgaben...letzteres läge ja aber auch etwas am Glücksfaktor...[BR][BR]Also erstmal mit dennen testen die sowieso eher bereit zum zahlen sind macht natürlich Sinn wenn man etwas verkaufen möchte."}, {"120": "Hanlar schrieb:\t\t\tOffenbar wurden auch eher die Spieler mit Werbung belohnt die schon ab und an mal gezahlt haben... vielleicht auch nur mehr Dias ausgaben...letzteres läge ja aber auch etwas am Glücksfaktor...[BR][BR]Also erstmal mit dennen testen die sowieso eher bereit zum zahlen sind macht natürlich Sinn wenn man etwas verkaufen möchte.\t\tZum Vergrößern anklicken.... 4 Accounts, 3 haben Werbung, einer nicht. Einer hat schon Dias gekauft die anderen 3 nicht."}, {"178": "Kassiopeia24 schrieb:\t\t\t4 Accounts, 3 haben Werbung, einer nicht. Einer hat schon Dias gekauft die anderen 3 nicht.\t\tZum Vergrößern anklicken....Alle mir Bekannten die gekauft haben haben Werbung.... das Nicht fällt auf den anderen Teil [smilie--sprite2].... kann ja auch Zufall sein."}, {"4": "nee, stimmt bei  mir auffallend nicht. Die Werbung ist rein zufällig verteilt.[BR][BR]Klar will Inno Geld verdienen und nutzt dazu einfach die Möglichkeiten, die andererseits auch schon Erfolg gebracht haben. Wer soll das Inno verdenken?[BR][BR]Ob ich es nutze und investiere, oder ob ich nur den Nutzen einer Werbung für mich, sprich die Belohnung, kassiere, hängt doch alleine von mir ab."}, {"2": "...sind wir hier jetzt noch beim Feedback zu den Saisons?..."}, {"167": "Mir ist jetzt wiederholt aufgefallen, dass ich zwar die Kiste mit dem Tagespreis öffne, aber den Gewinn nicht angezeigt bekomme (also kein Popup-Fenster) . Hat das noch jemand bemerkt?"}, {"2": "Falbala Di schrieb:\t\t\tMir ist jetzt wiederholt aufgefallen, dass ich zwar die Kiste mit dem Tagespreis öffne, aber den Gewinn nicht angezeigt bekomme (also kein Popup-Fenster) . Hat das noch jemand bemerkt?\t\tZum Vergrößern anklicken......ja - das hab ich auch gelegentlich (wenn du den Preis nicht erhalten hast, bekommst du aber am nächsten Tag eine Nachricht in der Glocke und den Preis nachträglich gut geschrieben)..."}, {"167": "Da hab ich bisher nicht drauf geachtet. Muss ich morgen dann mal machen."}, {"28": "Wahnsinn! 7 Tage 14 Stunden läuft die Saison des Triumphs noch und ich stehe in meiner Erststadt schon kurz vor der großen Auktion.[BR]So gefühlt schnell ging es bei mir noch nie! [smilie--sprite2][BR][BR][IMG]https://i.ibb.co/3fx346m/https-de-forum-elvenar-com-index-php-attachments-1696275347937-png-39349.png[/IMG]"}, {"4": "will dich ja nicht enttäuschen, aber bei mir steht die Auktion schon seit 4 tagen"}, {"14": "vermutlich hast du den Pass [smilie--sprite2]"}, {"28": "salandrine schrieb:\t\t\twill dich ja nicht enttäuschen, aber bei mir steht die Auktion schon seit 4 tagen\t\tZum Vergrößern anklicken....[smilie--sprite8] Glückwunsch @salandrine! Nein enttäuschend für mich ist das ganz und gar nicht, ich muss weder der Erste noch der Größte oder der Beste sein. Alles gut! [smilie--sprite2][BR][BR]Ich schätze aber den Austausch unter Spielerinnen und Spielern über zum Beispiel auch solche Themen hier im Forum wirklich sehr.[BR]Echt schade dass das in nicht allzu ferner Zukunft schon alles der Vergangenheit angehören wird.[BR]Discord ist für mich in dieser Hinsicht absolut kein vollwertiger Ersatz und wird es meiner Meinung nach auch nie werden können, ganz egal wieviel Energie da reininvestiert wird - es liegt halt an der Struktur!"}, {"35": "Ich habe die Auktion auch seit Tagen und den Kreis schon das erste Mal geleert. Ohne Pass.[BR][IMG]https://i.ibb.co/WxJkxwq/https-de-forum-elvenar-com-index-php-attachments-1696280984398-png-39351.png[/IMG]"}, {"4": "Nein, ich habe keinen Pass gekauft. Nur täglich alle Aufgaben gemeistert. ^^"}, {"50": "Wenn man ausnahmslos alle bisherigen Aufgaben (inkl. der heutigen 4 Aufgaben) der laufenden Saison erledigt hat, sollte die Anzeige ohne Kauf des Saison-Passes so aussehen ->[BR][IMG]https://i.ibb.co/dgbF4zB/https-de-forum-elvenar-com-index-php-attachments-1696315755999-png-39353.png[/IMG][BR][BR]Selbst wenn man hin-und wieder eine der täglichen Aufgaben nicht gemacht hat, sollte es kein Problem werden bis zum Hauptpreis zu gelangen. Problematisch wird es nur, wenn es bei den wöchentlichen Aufgaben zu Problemen kam und dort einige Aufgaben nicht geschafft wurden."}, {"167": "Aus den Truhen am Ende habe ich heute wieder (somit 3te) eine 'Filigrane Eisblase' bekommen.[BR]Bin Kap.15 und da gibt die mir 1260 Mana in 24h:[BR]a) das ist entweder ein Fehler, weil die Höhe entspricht eher den Werten für Saat - für Mana ist es komplett nutzlos[BR]b) ein ganz schlechter Scherz - dafür, das man diese Truhe überhaupt nur mit dem Saisonpass öffnen kann und vorher gar nicht sieht, was da drin sein könnte[BR][BR]Damit habe ich für meinen Saisonpass 3x den Zonk gezogen."}, {"104": "Filigrane Eisblase ist halt auch primär ein Kulturgebäude, mit 6200 Kultur dabei in Kapitel 15.[BR]Ein reines Kulturgebäude wie Kuchenmarktstände hat 7300 auf derselben Fläche 6 Felder.[BR]Immer etwas schwierig mit den verschobenen Werten, wenn so ein Gebäude noch paar Einwohner hat dann wiederum die anderen Werte niedriger, schwimmt hin und her, aber in der Regel in der Summe recht brauchbar.[BR]Goldene Weide auf 6 Felder 680 EW, 2300 Kultur, 7500 Mana am Tag.[BR][BR]Wenn du im Moment Mana suchst, dann andere besser, das ist klar, aber dann wäre auch ein reines Kultur-Gebäude oder Einwohner-Kultur ein Zonk. Mana oder Saat usw. sucht/ sammelt man häufiger, ich jedenfalls auch, der Rest als Standard nebenher vorhanden. Insofern besonders für bezahlten Pass eine unglückliche Auswahl, das stimmt."}, {"35": "Lohnt der Pass denn überhaupt? Ich habe mal die zusätzlich zu gewinnenden Gebäude angeschaut. Das wäre für mich nicht lohnend. Da warte ich lieber auf 200% Diaangebote für das Geld [smilie--sprite2][BR]Tip: Der heutige Event-Tagespreis (unergründlicher See) ist es dagegen durchaus wert, ihn anzustreben, wenn man Mana sammelt."}]