[{"128": "Die total nervenden Schleifenquests sind endlich Geschichte - das ist das Beste an den Seasons."}, {"129": "da soll einer sagen dass sich geduldiges warten nicht doch irgenwann lohnt...[BR]diese \"saison\" ist die seit langem beste erweiterung die ich hier spielen durfte und was soll ich sagen: sie macht riesen spass[BR][BR]das ist tatsächlich genau mein ding... viele super schöne neue gebäude die ich schon immer gern gehabt hätte. ein schnäppchen für die paar dias[BR]das schönste an elvenar sind doch die gebäude und die damit verbundene stadtgestaltung. und dafür sind nun mal gebäude notwendig.[BR][BR]jetzt kann man auch gerne mal ein event nicht mitspielen ohne angst zu haben auf schöne gebäude zu verzichten.[BR]wenn sich das durchsetzt sehe ich einer wunderschönen zeit entgegen. hier schon mal meinen dank"}, {"35": "Mein Feedback von Tag 1:[BR]Die meisten der Quests und alle Wochenquests sind schon erledigt, incl. derjenigen mit den Zaubererdörfern.[BR][BR]Für letztere Quest habe ich durch vorsichtigen Versuch herausbekommen, dass man pro Zug der Spielfigur ein \"Zaubererdorf\" erkundet. Nicht pro Schritt auf der Karte und auch nicht pro Erreichen des Endschlosses.[BR][BR]Hier würde ich mir eine klare und konsistente Begrifflichkeit im Spiel wünschen, dass man gleich versteht, was zu tun ist. Die Aufgabe liest sich auf den ersten Blick nämlich schwerer als sie ist. 10 x die Spielfigur bewegen in einer Woche sollte in einem Event nebenher schaffbar sein.[BR][BR]Dass man bei den gestapelten Belohnungen sich eine aussuchen kann und nicht alle erhält - kleines Lehrgeld gezahlt und auch das war dann ersichtlich.[BR][BR]Die Extra-Preise lassen mich nicht \"neidisch\" werden auf Dia-Besitzer. Manche Gebäude wären nett, aber finde ich nicht spielentscheidend.[BR][BR]Insgesamt:[BR]Der Einstieg fällt leicht und der Verzicht auf die Sonder-Belohnung auch.[BR]Mir gefällt diese Neuerung."}, {"130": "Feedback aus der Sicht eines kleineren Spielers (Kapitel VI):[BR][BR][BR]Negatives Feedback:[BR][BR]1. Ankündigung[BR]Mir ist das vollkommen unverständlich, warum eine so einschneidende Änderung im Gameplay (durch die Seasons fallen die Schleifenquests weg) nicht im Spiel selbst RECHTZEITIG kommuniziert wird. Damit meine ich weder 1 Tag noch 1 Woche vorher. Für sowas wäre wohl 1 Monat erst genug. [BR][BR]2. Fehlende Übersetzung[BR]Es fehlt an einigen Stellen mal wieder die Übersetzung. Das muss der Neue, der das letztes Mal auch schon übersehen hat, wohl noch lernen.[BR][BR]3. Teurer Season-Pass[BR]Ja, was soll man dazu sagen. Für mich vollkommen uninteressant für den Preis.[BR]Hier hat man die Chance verpasst (aber man kann es zukünftig ja anpassen), direkt mit richtig guten Season-Pass-Preisen aufzufahren. Vielen würde vermutlich schon 1 oder 2 Artefakt-Wildcard ausreichen, um da zuzuschlagen.[BR][BR]4. Wegfall der Schleifenquests[BR]Für viele ist das verständlicherweise nur eine Kleinigkeit, da es vermutlich nur nervig war und nicht viel gebracht hat. Aber wenn man mal über den Tellerrand hinausschaut und vielleicht sogar zurückblickt an die Zeit, in der man selbst noch eine kleinere Stadt hatte, ja dann fällt einem auf: [BR]Oh, kleine Städte sind ja viel abhängiger von Schleifenquests.[BR]In den Kapiteln sind die Werkstätten noch absolut ineffektiv und man konnte das Ganze mit den Schleifenquests abfedern.[BR]Will man hier kleine Städte wirklich zu mehr Werkstätten nötigen? Mehr Werkstätten -> weniger Manufakturen / Rüstkammern -> weniger Nutzen für die Gemeinschaft -> weniger Ansehen neuer Spieler -> weniger neue Spieler.[BR]Und nachdem, was ich bisher gesehen hab, kompensieren die Seasons den Wegfall keineswegs.[BR][BR][BR]Positives Feedback:[BR][BR]1. Design[BR]Wirklich schön finde ich das Design.[BR][BR]2. Wegfall der Schleifenquests[BR]Zwar hätte ich mir eine Kompensation für den Wegfall gewünscht, etwa durch höhere Produktionen der Werkstätten in den frühen Kapiteln oder mehr / bessere Vorratssegen, aber trotzdem sorgt der Wegfall der Schleifenquests für ein schöneres Gameplay. Die Schleifenquests waren einfach schon immer stupides Geklicke, das keinen Spaß gemacht hat.[BR][BR]3. Gameplay[BR]Es macht Spaß, sich täglich Belohnungen abzuholen für kleine Herausforderungen, die man erledigt und dann auf lange Sicht ein paar schöne Sachen bekommt. [BR][BR][BR]MfG"}, {"2": "Homeflow schrieb:\t\t\t2. Wegfall der Schleifenquests[BR]Zwar hätte ich mir eine Kompensation für den Wegfall gewünscht, etwa durch höhere Produktionen der Werkstätten in den frühen Kapiteln oder mehr / bessere Vorratssegen, aber trotzdem sorgt der Wegfall der Schleifenquests für ein schöneres Gameplay. Die Schleifenquests waren einfach schon immer stupides Geklicke, das keinen Spaß gemacht hat.\t\tZum Vergrößern anklicken.......wegen des Wegfalls der Schleifenquests wirkt sich schon seit mehreren Wochen der Kulturbonus auch auf die Wunder goldener Abgrund, Ausgrabung und Türme der Reichhaltigkeit aus..."}, {"113": "Hach, das war jetzt aber schön [smilie--sprite8][BR]Erst dachte ich uiuiui, langsam könnte auch meine Zeit knapp werden bei all dem Neuen auf einem Haufen, aber die Saison der Träume spielt sich ja quasi von selbst und ich bekomme dafür auch noch Belohnungen. [BR][BR]Gefällt mir sehr.[BR][BR]Die Optik ist auch gelungen, leider sind deutsche Übersetzungen wohl gelegentlich zu lang, denn [BR]hier [BR][IMG]https://i.ibb.co/cD6wL80/https-de-forum-elvenar-com-index-php-attachments-saison01-png-33810.png[/IMG] und hier [IMG]https://i.ibb.co/LCLRHVc/https-de-forum-elvenar-com-index-php-attachments-saison02-png-33811.png[/IMG][BR][BR]fehlt was"}, {"48": "Nett.[BR]Bin in Kapitel 20. Brauche nix von den Belohnungen. Die Premiumbelohnungen wären eine Ergänzung, aber nicht nötig. Spiele es, hole die Belohnungen, welche ich bekomme ab und Ende.[BR]Warum muss das mitten im Event starten?[BR]Führt zu Verwirrung, bei mir zu mindest. Wenn auch nur kurzzeitig.[BR]Feedback: Nett"}, {"48": "Cole6666 schrieb:\t\t\t...weil es keinen optimalen Zeitpunkt gibt...egal wann auch immer, erscheinen [smilie--sprite1]Zum Vergrößern anklicken....Du hast recht.[BR]\t\t\tBeta Welt ist immer noch der Testserver, und kann mit den Liveservern nicht verglichen werden.\t\tZum Vergrößern anklicken....Ein Testserver -im eigentlichen Sinn- ist nicht zum Geldverdienen, wie diese beta, sondern um zu testen.[BR]Dieser Server ist vor allem da, um Geld zu verdienen. Der Test fällt nur nebenbei ab. Außerdem hilft es dem Support. Er kann immer sagen  - tut er auch zur Genüge- \"Is nur beta, wir erstatten nix und können auch nix tun\".[BR]Aber das ist nun Mal hier sio"}, {"2": "...nette Quest...[BR][IMG]https://i.ibb.co/p3gnQRv/https-de-forum-elvenar-com-index-php-attachments-sch-tze-png-33819.png[/IMG]...wollte ich sowieso machen [smilie--sprite2] ..."}, {"20": "Positiv:[BR]nette Optik[BR]Die Schleife nervt nicht mehr, viele Aufgaben erledigen sich von selber, am Beta kann ich sogar sowas erledigen, weil ich grade Platz habe[BR][IMG]https://i.ibb.co/yd5B7tj/https-de-forum-elvenar-com-index-php-attachments-1674746987704-png-33818.png[/IMG][BR][BR][BR]Negativ: [BR]Saisonpass für die angebotenen Preise schlicht viel zu teuer, 1 Häppchen und 2 Booster für 3000 Diamanten? Der Rest käme ohnehin in den Schredder[BR]Die normalen Preise reizen auch zu wenig, um sich anzustrengen[BR]Solche Wochenaufgaben wie oben vom Beta wäre nur mit GA-Aufbau machbar, im normalen Spiel braucht so was Wochen bei 2 mag. Werken [BR][BR]Fazit: [BR]Ich werde mich darin üben solche Aufgaben auch unerledigt zu ignorieren, bis ich die letzte dieser Art austauschen kann."}, {"8": "Homeflow schrieb:\t\t\tWill man hier kleine Städte wirklich zu mehr Werkstätten nötigen?\t\tZum Vergrößern anklicken....Nicht nur dazu. Auch dazu, sich schnell guten Gemeinschaften anzuschließen! [smilie--sprite2][BR][BR]Mit meinem kleinen Muck auf Ari gings erst aufwärts wo er regelmäßig die Turmmitte erklimmen konnte. Er konnte nicht gleich ganz hoch. Da ging ihm die Puste aus! ...8 aktuelle Werkis waren erstmal notwendig![BR]Aber nach ein paar Versuchen.... Und vor allem: Den Gemeinschaftsgewinnen gewann ich krasse Mengen 50% Werkzeugsegen. Total wichtig zu dem Zeitpunkt![BR][BR]Die + ein paar gewonnene mag. Werkis und es lief immer besser an der Vorratsfront![BR]Der nächste große Sprung war dann bei den Feen... Türme der Reichen.[BR]Das Turnier mit nicht mal 10 Provinzen war eigtl. ein Witz [smilie--sprite8] (Als Händler)[BR][BR]Jetzt mit 3 mag. Werkis ists schon fast Luxus wie bei meinem Großen auf Kheelo.[BR]Jedenfalls komm ich nun ganz gut ohne Hilfe zur Spitze rauf... Dank Feuerpiepmatz und Braunbärbaby auch mit immer weniger Verlusten/mehr[BR]Gütern auf der hohen Kante ===> Nun kann ich schon Anderen helfen.[BR][BR]Aber das geht nicht gleich. Und erst recht nicht ohne Gilde! Die ist überlebensnotwendig gewesen![BR]===> Wie ich finde: ne sehr gute Idee der Entwickler![BR][BR]Wer elvenar allein spielen will muss jetzt noch viel mehr Geld und Zeit mitbringen."}, {"103": "Erstes Statement vom Moderator:[BR][BR]Natürlich tut es mir leid, dass Übersetzungen fehlen und ich versichere,[BR]dass wir daran arbeiten.[BR][BR]Nach dem Querlesen des ersten groben Feedbacks ein paar Anmerkungen:[BR][BR]-> eine Quest mit Eventaufgaben am 3. von 21 Eventtagen kann ich nicht als unerfüllbar werten, nur weil[BR]einige Spieler schon bei den Tagesquests sind (nicht schön für die Spieler aber das Event so runterzurasen widerspiegelt[BR]wohl nicht die angedachte Spielweise )[BR][BR]-> Kosten-Nutzen-Beschwerden zum Preispass sind als Feedback aufgenommen[BR][BR]-> Info: im Gegensatz zum aktuellen Event (momentaner Stand) sollten bei Quests \"Güter Deiner Wahl\" in der Saison auch höherwertige Güter zählen[BR][BR]-> angesprochene Probleme mit Wochenquests wegen fehlender Werkstätten oder Manufakturen können evtl. durch Tauschen der Quest abgeholfen werden, dafür gibt es diese Funktion[BR][BR]-> andere Sachen wurden bereits von der Community selbst beantwortet ( es gibt keinen \"optimalen\" Starttermin für jederman, Ankündigung zu kurz ist nicht wirklich relevant, da es keiner besonderen Vorbereitung auf Saisons bedarf )[BR][BR]Vielen Dank für den Moment..."}, {"129": "ach so ja, die schleifenquests.... jetzt wo sie weg sind hätte ich plötzlich wieder lust drauf.... hahaha spass....."}, {"6": "littleFlex schrieb:\t\t\t-> Kosten-Nutzen-Beschwerden zum Preispass sind als Feedback aufgenommen\t\tZum Vergrößern anklicken....Hierzu noch eine Anmerkung:[BR]3000 Dias entspricht bei Diakauf ziemlich genau 20€. Das werden sich die meisten Spieler wohl genau überlegen, zumal wohl niemand alle dadurch freigeschalteten Belohnungen gebrauchen kann.[BR]Bei mir z.B. wären es genau 2 Gebäude, die interessant wären. 3000 Dias sind dafür aber viel zu viel.[BR][BR]Würdet ihr den Preispass für z.B. 1000 Dias anbieten, wäre die Hemmschwelle deutlich niedriger.[BR][BR]Einfaches Beispiel:[BR]Wenn sich 500 Spieler für den Preispass für 3000 Dias entscheiden würden, aber 5000 Spieler für einen Preispass für 1000 Dias, wo wäre der Gewinn wohl größer?  [smilie--sprite2] [BR][BR]Ähnlich gelagerte Fälle gab es bereits zuhauf im Real Life. Der größere Gewinn hat sich dabei immer beim niedrigeren Preis ergeben."}, {"131": "littleFlex schrieb:\t\t\t-> eine Quest mit Eventaufgaben am 3. von 21 Eventtagen kann ich nicht als unerfüllbar werten, nur weil[BR]einige Spieler schon bei den Tagesquests sind (nicht schön für die Spieler aber das Event so runterzurasen widerspiegelt[BR]wohl nicht die angedachte Spielweise )\t\tZum Vergrößern anklicken....[BR]Wie wäre denn die \"angedachte Spielweise\"???"}, {"103": "Aufgaben lösen, so wie sie kommen, ohne Booster vermutlich..."}, {"132": "Auch mir sind die 3000 Dias zu happig, [BR]schön finde ich die Grafiken, das Bäumchen mit den dahinwehenden Blättern gefällt mir ausnehmend gut, das hätte ich gern mal in einem Event als Tagespreis ( so als Gegensatz zu den *Winterbäumen* )  [smilie--sprite1]"}, {"2": "littleFlex schrieb:\t\t\tAufgaben lösen, so wie sie kommen, ohne Booster vermutlich...\t\tZum Vergrößern anklicken.......hab ich nicht gebraucht  [smilie--sprite2] ...."}, {"133": "Die Wochenaufgabe ---verwende Vorratssegen---- funktioniert nicht, habe jetzt auf Gold gewechselt, das klappt.[BR][BR]schön, schön, sieht nett aus ,[BR][BR]kann ich alles gebrauchen. Dia ausgeben , eher nicht"}, {"3": "Mir gefällt es erstmal gut. [BR]Schöne Optik, die Quests sind doch schön nebenbei zu lösen, sind mal neue dabei, z.B den mit der Event-Währung, den @Romilly erwähnt hat. [BR]Besonders schön, man kann ungeliebte Wochenquests 2 mal tauschen![BR][BR]Der Saisonpass ist mir auch zu teuer, aber ich finde man kann es ja auch erstmal ohne spielen. Die Truppensegen sind mir sehr willkommen! [BR][BR]Und ja, ich vermisse die alten Schleifenquests auch ganz furchtbar, @Sir Backblech [smilie--sprite2] [smilie--sprite8][smilie--sprite8][smilie--sprite8]"}]