[{"103": "zenka schrieb:\t\t\tDie Wochenaufgabe ---verwende Vorratssegen---- funktioniert nicht, habe jetzt auf Gold gewechselt, das klappt.[BR][BR]schön, schön, sieht nett aus ,[BR][BR]kann ich alles gebrauchen. Dia ausgeben , eher nicht\t\tZum Vergrößern anklicken....definiere bitte \"funktioniert nicht\""}, {"133": "na es tut sich nichts, man kann die Aufgabe nicht lösen, 3 soll man verwenden, ich habe sogar 10 genommen, nix."}, {"131": "Mikara schrieb:\t\t\tWie wäre denn die \"angedachte Spielweise\"???\t\tZum Vergrößern anklicken....[BR]littleFlex schrieb:\t\t\tAufgaben lösen, so wie sie kommen, ohne Booster vermutlich...\t\tZum Vergrößern anklicken....[BR][BR]Sorry... Dann muß ich allerdings wiedersprechen.[BR][BR]die Spielweise ist individuell... Jeder spielt so wie er / sie es mag.[BR][BR]Und (ich sprech nun mal für mich) wenn ich 1 bis 3 Tage brauche, um die ersten Aufgaben zu lösen und dann nur noch Tages-Aufgaben habe, weil...[BR]1) es mir Spaß macht[BR]2.) es MEINE Spielweise ist[BR]3.) es für mich am sinnvollsten ist [BR]4.) ich ein Event so auch in mein RL gut integriert bekomme[BR]5.) ich auch einige Zeitbooster benutze - wofür gibt es die denn sonst?[BR][BR]dann ist das meine bevorzugte Spielweise...[BR][BR]Wenn das Falsch ist, dann sollte seitens INNO, da eine Sperre eingebaut werden.[BR]Damit ich nicht unbeabsichtigt gegen eine Regel verstoße...[BR][BR]Von daher, denke ich, dass ich eine - mögliche - angedachte Spielweise nutze.[BR][BR]Somit muss ich Deiner Aussage @littleFlex   \"... eine Quest mit Eventaufgaben am 3. von 21 Eventtagen kann ich nicht als unerfüllbar werten, nur weil einige Spieler schon bei den Tagesquests sind...\"   absolut widersprechen.[BR][BR]Als Deine persönliche Meinung... ist diese Aussage OK für mich.[BR]Ich denke - als Feedback - als \"Fehler-Quelle\" für Inno wohl ganz hilfreich.[BR][BR]Daher meine Bitte: Kläre dies doch bitte mal mit Inno bzw. gib dies bitte weiter. DANKE"}, {"103": "@zenka[BR][BR]wirklich sicher, dass es da um Vorratssegen ging?[BR]es gibt Quests für Vorräte-Zauber..."}, {"133": "littleFlex schrieb:@zenka[BR][BR]wirklich sicher, dass es da um Vorratssegen ging?[BR]es gibt Quests für Vorräte-Zauber...\t\tZum Vergrößern anklicken.... ahhh, danke , Zenka doof und blond, das wird es wohl gewesen sein. also kein Fehler,"}, {"131": "hier müßte beim nächsten Update, die Grafik etwas angepasst werden...[BR][BR]Teile des Textes sind nicht sichtbar..."}, {"133": "übrigens dieser Baum ist der Oberknaller, davon mal ein Eventgebäude, schön groß,[BR][BR][IMG]https://i.ibb.co/4ZRnQKG/https-de-forum-elvenar-com-index-php-attachments-baum-jpg-33827.jpg[/IMG][BR][BR]könnte man dieses Pass Diabild vielleicht in die andere Ecke schieben, sodass man den Baum vollständig genießen kann."}, {"1": "Mikara schrieb:\t\t\thier müßte beim nächsten Update, die Grafik etwas angepasst werden...[BR][BR]Teile des Textes sind nicht sichtbar...\t\tZum Vergrößern anklicken....Die Grafik wird nicht angepasst werden. Ich werde aber jedoch die Texte ein wenig anpassen. [smilie--sprite1]"}, {"134": "3000 Dias! Ja klar.....Daumen runter"}, {"135": "So schlecht, wie sie teilweise gemacht werden, sind die Gebäude aus der Standard Gewinnreihe auch nicht. [BR][BR]Es gibt 2 Saat Gebäude, die auch immer wieder empfohlen werden[BR][BR]Es gibt 2 Mana Gebäude, eins davon wird immer wieder empfohlen, das andere ist noch etwas besser[BR][BR]Es gibt ein ehemaliges Premium Gebäude kostenlos[BR][BR]Es gibt einige B/K Hybriden aus alten Events, die zumindest über dem Durchschnitt liegen[BR][BR]Es gibt für mich den Wachtturm der Wüste, der ne ordentliche Menge Einheiten für Quest liefert. [BR]Habe schon ein paar im Inv, aber Nachschub ist immer gut, solche Teile lager ich bei Platzmangel nicht ein, sondern reisse ab."}, {"133": "ups, zu spät gesehen. und keine Wahlmöglichkeit mehr. Sehr Arbeitnehmer unfreundlich. [BR][BR][IMG]https://i.ibb.co/qp1grCr/https-de-forum-elvenar-com-index-php-attachments-3h-jpg-33842.jpg[/IMG]"}, {"103": "10 verschiedene Manus, 1x am Tag, fertig"}, {"133": "ja natürlich, ich baue meine Stadt nicht um, habe anderes vor, so wichtig ist mir die Saison nicht.[BR][BR]ist wirklich sehr niedlich gemacht, keine Frage, wenn sich Aufgaben nebenbei ergeben wunderbar, aber mich einem Dauerevent anzupassen, mag ich nicht so."}, {"103": "also ich habe ohne irgendwelchen Umbau 17 Manus in der Stadt"}, {"2": "...naja - im Prinzip hast du für diese Aufgabe nun 75 Tage Zeit..."}, {"3": "Verbesserungsvorschlag: Könntet ihr für das Tauschen eine Bestätigungsabfrage einbauen?[BR]Habe eine halbfertige Wochenquest AUSVERSEHEN weggeklickt [smilie--sprite5][BR]Schnief, schnüff"}, {"136": "wollt ihr wirklich ganz ehrlich wissen, wie ich von der 'Saison' denken?! Nach zwei Jahren treuem Elvnargedaddel frag ich mich heute zum ersten Mal, wie lange das Spiel noch meins sein wird? (hätte ich nicht gedacht, auch wenn ich schon öfters von anderen ähnliches gelesen habe...)[BR]Warum wird man während einem laufenden Event (Dampfgolem) ohne Vorwahrnung nun auch noch mit einem dämlichen lila.blink.blink  alles.muss.zappeln überrumpelt?! Ich vermisse hier die von mir bisher sehr geschätzte Dezens (auch wenn es das Wort warscheinlich nicht gibt). Egal ob Events, GAs oder Sonderangebote, sie waren auf dem Appbildschirm zwar sichtbar, haben aber nur wenig gestört. Dass riesen lila Ding in der Questleiste ist alles andere als unaufdringlich. Es nervt nicht nur, sondern geht mir als gestresster Arbeiter richtig auf die Nerven. So kann ich mich nun gar nicht mehr auf das übliche entschleungende Gamen (Turm, Turnier, Evenquest...) konzentrieren. Alle Naselang soll ich nun wohl gucken, ob 'so nebenbei' noch ein weiteres Quest erledigt habe? ...alles immer wieder grün? 75 Tage lang(!) (OT, war nicht schon das Winterevent für manche gefühlt zu lang?)[BR]...ganz zu schweigen von dem hektischen Sortieren der erledigten Quests... ich finde diese Animation mehr als übertrieben,[BR] nein, gefällt mir überhaupt nicht. Wenn ich blink.blink.mischen will, würde ich Candycrush spielen, oder Kartenspiele.[BR] 'Treffer, versenkt', nach einer Runde spar ich mir nun lieber diesen (Alb)Traum. Ist zwar eine nette Idee mit der Wahlmöglichkeit für die Rewards, aber das ganze drum herum will ich meinen geschundenen Nerven nicht auch noch antun."}, {"112": "ich habe heute bereits fast alle aufgaben fertig, bis auf eine die morgen wohl ohne anstrengung erledigt ist. und dann? ok neue tagesaufgaben. lahm. ich heul aber nicht. [smilie--sprite3]"}, {"137": "Im Moment finde es die Saison erst mal gut. Vielleicht wäre es schöner gewesen nicht während dem Event zu starten, aber der „Stress“ den das macht könnte auch an meinem Alter liegen.[BR][BR]Fast hätte ich die Truhe übersehen, die man nach Abschluss der Tagesaufgaben öffnen muss (da wäre echt toll wenn die sich automatisch öffnet) aber in einer Welt gab es daraus einen 20er Wunder-Segen - ich war begeistert![BR][BR]Auch die Belohnungen zum wählen sind cool.[BR][BR]Die 3000 Dias (gerade im Angebot für ca 20 €) für die Sonderpreise sind nicht gerade ein Schnäppchen aber wenn man keine Events spielen mag vielleicht eine Alternative um an coole Gebäude zu kommen - muss man mal schauen wie viele Aufgaben sich von alleine lösen."}, {"40": "3000 Diamanten sind für den Saison-Pass schon eine ordentliche Menge, keine Frage, aber wenn ich es richtig verstanden, dann gilt der Pass für die ganze Saison, also für ein Vierteljahr, richtig? - Da finde ich dann 3000 Diamanten wieder irgendwie angemessen."}]