[{"6": "Dominus00 schrieb:\t\t\t... aber wenn ich es richtig verstanden, dann gilt der Pass für die ganze Saison, also für ein Vierteljahr, richtig? - Da finde ich dann 3000 Diamanten wieder irgendwie angemessen.\t\tZum Vergrößern anklicken....Das ist eine mögliche Sichtweise.[BR]Allerdings kannst du dir die Belohnungen mit Preispass zuvor ansehen. Und wenn ich das mache, finde ich die 3000 Dias ziemlich unangemessen.[BR][BR]Muss natürlich jeder selbst für sich entscheiden."}, {"138": "Schönen guten Tag zusammen, was mich sehr stört (wie übrigens auch beim Gemeinschaftsspiel) ist dieser scheppernde Ton wenn eine Aufgabe erledigt ist. Ich kann zwar im Spiel die Töne insgesamt abstellen, aber eben nicht diesen einen einzelnen. Im Gemeinschaftsspiel schalte ich die Töne insgesamt ab. Aber dieses läuft ja nun viel länger. Gibt es da wirlich nichts anderes? Ein optisches Signal ohne Ton oder eben einen angenehmeren Ton?"}, {"120": "Da Nu schrieb:\t\t\tFast hätte ich die Truhe übersehen, die man nach Abschluss der Tagesaufgaben öffnen muss (da wäre echt toll wenn die sich automatisch öffnet)\t\tZum Vergrößern anklicken....wenn ich das heut früh richtig mitbekommen habe, öffnet sich die Kiste am nächsten Tag automatisch"}, {"69": "Erste Tageskiste : 1x10min Zeitbooster ! Das macht so richtig Lust auf das Event [smilie--sprite3]"}, {"81": "Dominus00 schrieb:\t\t\t3000 Diamanten sind für den Saison-Pass schon eine ordentliche Menge, keine Frage, aber wenn ich es richtig verstanden, dann gilt der Pass für die ganze Saison, also für ein Vierteljahr, richtig? -\t\tZum Vergrößern anklicken....[BR]Es ist nicht wirklich relevant wie lange die S. Dreams laufen.[BR]Die Belohnungen bleiben gleich und für 3000 Dias gibt's da keinen Mehrwert.....selbst wenn man das Tierfutter vom Häppchen großzügig veranschlagt. Frechheit triffts wohl eher.[BR][BR]Dominus00 schrieb:\t\t\tDa finde ich dann 3000 Diamanten wieder irgendwie angemessen.\t\tZum Vergrößern anklicken....[BR]Wenn die selben Belohnungen in einem 30 Tages Event kommen würden wären 3000 Dias nicht mehr Angemessen?[BR][BR]Das ist mir zu hoch das erklär mir mal bitte in ner PN [smilie--sprite2][BR][BR][BR]So kleine Auflistung und Feedback Gedanken zu den 3000 Dia Pass der +70 Tage läuft[BR][BR]- Mantarochen[BR]  Top Mana Gebäude war auch mal um 450? oder so  Dias zu kaufen[BR]- Herbstteich[BR]  War mal wegen der begrenzten Auswahl an Saaten Gebäuden gut wenn man davon mehrere gehabt hatte siehe Manahütten[BR]- Trainingsdojo[BR]  naja hab davon noch 13 im Inventar also wird es wohl wenig wert sein.......[BR]- Markt für Schmackhafte Lebensmittel[BR]  auch so ein Ladenhüter von Saatengebäude.....[BR]- Hummelställe[BR]  Siehe Trainigsdojo....11 davon noch liegen[BR]- Schrein des Schweren Nahkampfs[BR]  Booster sind zwar immer toll aber \"Nahkämpfer\" haben immer Verluste und die will man eigentlich vermeiden[BR]- Seepferdchen Ställe[BR]   Frösche ja nice und hab das ding auch nur 1x im Inventar aber das Hexenhaus ist toller und gibt auch noch Orks und WP[BR]- Amuni Schiffe[BR] auch so ein Rohrkrepierer von Saatengebäude........[BR]- Monument des alten Wissens[BR]  das ich nach 2 Jahren wieder mal sowas sehen darf.... gegen WP sagt man nichts [smilie--sprite1][BR]- Zum Herzhaften Häppchen[BR]   Futter ist immer nice aber das ding liegt auch schon 2x im Inventar[BR]-  Teichsäule[BR]    ähm ja ok Fragmente?[BR]- Bambusbrunnen[BR]   wird ja immer schlechter statt besser noch mehr Fragmente[BR]- Portalgewinn 20%[BR]   freue ich mich auch jedes mal wenn im Turm das ein Boss ausspuckt.....[BR]- Wachturm der Wüste[BR]   eher Wachturm des Inventars.........Fragmente[BR]- Tierisches Fang Team[BR]   das xte Saaten Gebäude und nicht einmal ein tolles.....Fragmente?[BR]- Lebenspunkte Verbesserung[BR]   Booster sind toll <3[BR][BR]Warum keine Blaupausen? 2-3 Würden da zusätzlich sicher dem Preis von 3000 Dias näher kommen.[BR]Warum keine Tomes mit Artefakten? Wär doch toll das zu kombinieren Events in dem Zeitraum mit den Artefakten dazu?"}, {"104": "Frau Silvia schrieb:\t\t\tSchönen guten Tag zusammen, was mich sehr stört (wie übrigens auch beim Gemeinschaftsspiel) ist dieser scheppernde Ton wenn eine Aufgabe erledigt ist. Ich kann zwar im Spiel die Töne insgesamt abstellen, aber eben nicht diesen einen einzelnen. Im Gemeinschaftsspiel schalte ich die Töne insgesamt ab. Aber dieses läuft ja nun viel länger. Gibt es da wirlich nichts anderes? Ein optisches Signal ohne Ton oder eben einen angenehmeren Ton?\t\tZum Vergrößern anklicken....Nicht nur Ton, welchen ja konstant abzustellen. Die Meldungen in der GUI sind für sich auch störend, falls man es nicht mag.[BR]GA sind 6 Tage Dauer-Meldungen, bei Event gibt es jeden Tag mit Häkchen wegzuklicken Einnahmen, aber zumindest nur einmal, beim ersten Login quasi halbwegs dran zu gewöhnen als Aufgabe.[BR]Hier den ganzen Tag über evtl. unerwünschte Häkchen und noch viel mehr Ausrufezeichen für Zwischenfortschritte mühsam wegzuklicken oder sich irgendwie dran zu gewöhnen dass dauerhaft angezeigt. Für 75 Tage durchgehend, und danach wie lange Pause bis wieder neu? Also quasi durchgehend Rest des Spiels sowas nun nötig?[BR][BR]Ganz schön drastisch, selbst wenn man mitmacht, umso mehr für Nicht-Interessierte.[BR]Die freundliche Variante wäre, das mit einer Einstellung in den Optionen ganz zu unterbinden..[BR]Und selbst für normale Spieler könnte man das auch runterschrauben. Die Ausrufezeichen für Zwischenschritte wahrlich verzichtbar."}, {"135": "Sardukar schrieb:\t\t\tSo kleine Auflistung und Feedback Gedanken zu den 3000 Dia Pass der +70 Tage läuft[BR][BR]- Mantarochen[BR]  Top Mana Gebäude war auch mal um 450? oder so  Dias zu kaufen[BR]- Herbstteich[BR]  War mal wegen der begrenzten Auswahl an Saaten Gebäuden gut wenn man davon mehrere gehabt hatte siehe Manahütten[BR]- Trainingsdojo[BR]  naja hab davon noch 13 im Inventar also wird es wohl wenig wert sein.......[BR]- Markt für Schmackhafte Lebensmittel[BR]  auch so ein Ladenhüter von Saatengebäude.....[BR]- Hummelställe[BR]  Siehe Trainigsdojo....11 davon noch liegen[BR]- Schrein des Schweren Nahkampfs[BR]  Booster sind zwar immer toll aber \"Nahkämpfer\" haben immer Verluste und die will man eigentlich vermeiden[BR]- Seepferdchen Ställe[BR]   Frösche ja nice und hab das ding auch nur 1x im Inventar aber das Hexenhaus ist toller und gibt auch noch Orks und WP[BR]- Amuni Schiffe[BR] auch so ein Rohrkrepierer von Saatengebäude........[BR]- Monument des alten Wissens[BR]  das ich nach 2 Jahren wieder mal sowas sehen darf.... gegen WP sagt man nichts [smilie--sprite1][BR]- Zum Herzhaften Häppchen[BR]   Futter ist immer nice aber das ding liegt auch schon 2x im Inventar[BR]-  Teichsäule[BR]    ähm ja ok Fragmente?[BR]- Bambusbrunnen[BR]   wird ja immer schlechter statt besser noch mehr Fragmente[BR]- Portalgewinn 20%[BR]   freue ich mich auch jedes mal wenn im Turm das ein Boss ausspuckt.....[BR]- Wachturm der Wüste[BR]   eher Wachturm des Inventars.........Fragmente[BR]- Tierisches Fang Team[BR]   das xte Saaten Gebäude und nicht einmal ein tolles.....Fragmente?[BR]- Lebenspunkte Verbesserung[BR]   Booster sind toll <3[BR][BR]Warum keine Blaupausen? 2-3 Würden da zusätzlich sicher dem Preis von 3000 Dias näher kommen.[BR]Warum keine Tomes mit Artefakten? Wär doch toll das zu kombinieren Events in dem Zeitraum mit den Artefakten dazu?Zum Vergrößern anklicken....[BR]Ist das nicht die Liste aus der Standard (kostenlosen) Reihe?[BR]Etwas ungünstig, dass ich aktuell überhaupt nicht die Preise nachsehen kann, weil wohl keine Aufgabe ansteht..."}, {"104": "Xebifed schrieb:\t\t\tIst das nicht die Liste aus der Standard (kostenlosen) Reihe?[BR]Etwas ungünstig, dass ich aktuell überhaupt nicht die Preise nachsehen kann, weil wohl keine Aufgabe ansteht...\t\tZum Vergrößern anklicken....Nun, es sind jedenfalls die Sonderpreise[BR][BR][IMG]https://i.ibb.co/RPpj6vf/https-de-forum-elvenar-com-index-php-attachments-1674821243735-png-33848.png[/IMG][BR][BR]Wobei den ersten noch vergessen in der Liste, von Seite 1/10, Ludibria Ventis, 18% Einheitenproduktionsbonus für 10 Tage."}, {"4": "Wenn man vergisst, die Tagesbelohnung abzuholen, dann poppt die automatisch am kommenden Tag beim log-in auf. zumindest das ist gut gemacht. [BR][BR]und Markt der schmackhaften Lebensmittel und die amunischiffe sind mit die besten Saatlieferanten überhaupt. Offenbar brauchst du die Saat noch nicht so dringend, @Sardukar"}, {"135": "ForgeS44 schrieb:\t\t\tNun, es sind jedenfalls die Sonderpreise[BR][BR]Anhang 33848 ansehen[BR][BR]Wobei den ersten noch vergessen in der Liste, von Seite 1/10, Ludibria Ventis, 18% Einheitenproduktionsbonus für 10 Tage.\t\tZum Vergrößern anklicken....[BR]ah, das 3mm große logo über dem preis....richtig gut zu erkennen [smilie--sprite1]"}, {"113": "Xebifed schrieb:\t\t\tah, das 3mm große logo über dem preis....richtig gut zu erkennen [smilie--sprite1]Zum Vergrößern anklicken....Naja, es ist ja nicht nur das Logo, der ganze Preis ist gelb(golden) eingerahmt, mMn durchaus zu erkennen"}, {"103": "[IMG]https://i.ibb.co/7CvxxV7/https-de-forum-elvenar-com-index-php-attachments-1674829497089-png-33849.png[/IMG][BR][BR]also ich denke mal auch, dass sich gut von normalen Preisen abhebt"}, {"135": "littleFlex schrieb:\t\t\tich denke mal auch, dass sich gut von normalen Preisen abhebt\t\tZum Vergrößern anklicken....[BR]Aber man muss es erraten, warum die Gebäude eingerahmt sind, vielleicht weil es hübsch ist und es Gebäude sind. So als Zwischenhauptpreis.[BR]Auch auf dem Dia Kaufen Feld gibt es keine Info dazu, für was genau bezahlt wird.[BR][BR]Mein Inventar ist ziemlich vermüllt und ich habe beim wegklicken der Preise nicht so richtig hingeschaut, aber ich war bis eben überzeugt, dass dort die Gebäude stehen müssten [smilie--sprite1][BR][BR]Dann muss ich aber auch mein Feedback oben revidieren, ich dachte echt, das wären alles freie Gebäude. Für Premiumgebäude sind die etwas schwach. (war das Geisterwölfe Rudel damals eigentlich auch) [BR][BR][IMG]https://i.ibb.co/YRXfVvY/https-de-forum-elvenar-com-index-php-attachments-1674832067678-png-33852.png[/IMG]"}, {"103": "[IMG]https://i.ibb.co/txvr87G/https-de-forum-elvenar-com-index-php-attachments-1674831963292-png-33851.png[/IMG][BR][BR]es wird sich einspielen"}, {"50": "Es ist doch offensichtlich, dass die exklusiven Belohnungen nur durch den Saison-Pass zugängig sind ->[BR][IMG]https://i.ibb.co/dB3WLmK/https-de-forum-elvenar-com-index-php-attachments-1674832267153-png-33853.png[/IMG][BR][BR]Weiterhin gibt es sogar eine Info dazu ->[BR][IMG]https://i.ibb.co/Q6XkSSs/https-de-forum-elvenar-com-index-php-attachments-1674832424906-png-33854.png[/IMG][BR][BR]Ob diese besonderen Preise den Einsatz von Dias wert sind, ist eine andere Frage."}, {"139": "Ich mag es. Ist etwas ungünstig, weil gleichzeitig mit dem Event läuft, aber wirklich nur etwas. Der Einsatz ist überschaubar, die Belohnungen recht nett und nützlich. Von mir aus könnte es einen oder anderen Event ersetzen so, dass die Entwickler etwas Verschnaufpause hätten. Ich muss an dieser Stelle gestehen, dass m.E. die Grafik und die Anzahl der Eventgebäude bei letzten Events etwas nachgelassen hatten. [BR]Eine willkommene Abwechselung im Spiel, die nebenbei und ohne übermäßig viel Mühe mitgespielt werden kann. Vielen Dank!"}, {"83": "littleFlex schrieb:\t\t\t-> eine Quest mit Eventaufgaben am 3. von 21 Eventtagen kann ich nicht als unerfüllbar werten, nur weil[BR]einige Spieler schon bei den Tagesquests sind (nicht schön für die Spieler aber das Event so runterzurasen widerspiegelt[BR]wohl nicht die angedachte Spielweise )\t\tZum Vergrößern anklicken....\"angedachte Spielweise\"??? was soll das sein?[BR][BR]Wann begreift inno eigentlich, dass hier im Spiel überwiegend Erwachsene spielen, die selber denken können und wollen und die man nicht gängeln muss??"}, {"103": "Inno muss das nicht begreifen..."}, {"133": "littleFlex schrieb:\t\t\talso ich habe ohne irgendwelchen Umbau 17 Manus in der Stadt\t\tZum Vergrößern anklicken....naja , die wenigsten Spieler verbleiben über Jahre im GA Modus. [BR][BR]manchmal ein wenig Verständnis, für 0815 Spieler, die dem Grundspiel ( Forschung und Gastrasse) folgen, und im Modus 2 x 9 h und 1x 3 h spielen, [BR][BR]Es geht um Feedback, daher beziehe ich mich im Feedback immer am Grundspiel . Weitere Spielangebote beurteile ich wie gut diese zum Grundspiel passen."}, {"81": "salandrine schrieb:\t\t\tund Markt der schmackhaften Lebensmittel und die amunischiffe sind mit die besten Saatlieferanten überhaupt. Offenbar brauchst du die Saat noch nicht so dringend, @SardukarZum Vergrößern anklicken....[BR]Ähm nein?! kein früheres einsammeln? z.b.: Amuni Schiffe ist richtig doof[BR]Du darfst Äpfel nicht mit Birnen vergleichen. [BR]Und nein der Beste Saatlieferant ist und bleibt der Händler.[BR]Ab einem gewissen Spielstand brauchst du keine Saatengebäude mehr, das kann schon im Kapitel 15 sein wenn genug Wunderstufen vorhanden sind. Und ja bis zum Siegelturm muss man noch ab und zu umschalten.[BR][BR]Darum ist jegliches Saatengebäude recht sinnfrei für mich.  (hab ja knappe 33k Saatensammelbonus beim Händler)[BR]Ich hab es ja mit meiner persönlichen Einteilung und Beurteilung versehen.[BR][BR]Ist ja für jeden anders aber ich bin der Meinung das das Angebot eher \"kleine\" Spieler ansprechen soll die noch nicht die Ahnung von den Gebäude haben.[BR][BR]littleFlex schrieb:\t\t\tInno muss das nicht begreifen...\t\tZum Vergrößern anklicken....[BR]Ja Inno lernt immer nur was dazu wenn die Zahlen einbrechen...(ich rede da vom Umsatz)[BR]War ja bei dem Bibiset nicht anders da musste es Inno auf die Harte Tour lernen. Wir haben ja 15 Monate gegen eine Wand Feedback gegeben![BR]Hat halt 4 Welten gekostet und die Nachwirkungen haben wir heute noch.[BR][BR]Sorry das ein typisches amerikanisches hyperkapitalistisches Unternehmen das nicht mal seine \"Angestellten\" zahlt die das Forum betreuen.......[BR]Und jetzt kommt mir bitte nicht mit dem Schwachsinn von Ehrenamtlich das gibt es nur bei nicht Profit orientierten Unternehmen und das ist hier nicht der Fall."}]