[{"103": "17 Manus ist kein GA-Aufbau, sorry, das ist normales Gameplay eines 0815 Spielers, wie ich es bin,[BR]mit Gastvolk und so weiter"}, {"28": "Sardukar schrieb:\t\t\tSorry das ein typisches amerikanisches hyperkapitalistisches Unternehmen das nicht mal seine \"Angestellten\" zahlt die das Forum betreuen.\t\tZum Vergrößern anklicken....Die InnoGames GmbH ist ein Spieleentwicklerstudio und Betreiber von browserbasierten und mobilen Online-Spielen mit Sitz in Hamburg.[BR][BR]Edit:[BR][BR]InnoGames gehört zu den weltweit führenden Entwicklern und Publishern von Online-Spielen. An unserem Standort in Hamburg arbeiten zurzeit mehr als 400 Mitarbeiter aus über 30 Nationen. Community Management, Entwicklung und Systemadministration stehen in engem Kontakt zueinander. Dies und die direkte Kommunikation mit unseren Spielern versetzt uns in die Lage, auf Ideen und Kritik einzugehen und unsere Spiele kontinuierlich zu verbessern.[BR][BR]Die Nutzung unserer Spiele ist komplett kostenlos, uneingeschränkt und dauerhaft möglich. Optional bieten wir unseren Spielern die Möglichkeit, über kostenpflichtige Premium-Inhalte zusätzliche Vorteile im Spiel zu genießen. Wir legen dabei höchsten Wert darauf, dass auch ohne Premium-Accounts optimaler Spielspaß gegeben ist."}, {"56": "littleFlex schrieb:\t\t\t17 Manus ist kein GA-Aufbau, sorry, das ist normales Gameplay eines 0815 Spielers, wie ich es bin,[BR]mit Gastvolk und so weiter\t\tZum Vergrößern anklicken....17 Manufakturen dürfen aber im \"Normalfall\" für einen 08/15 Spieler \"überreichlich\" sein. Ich habe nie mehr als 12 Manus gehabt. In meiner kleinsten Stadt Kap.10/11 jeweils  4 von jedem Gut und in meiner größten Stadt Kap.16/17 sind es auch 12 jeweils 2 von jedem Gut.[BR]Im Normalfall ist das kein Problem, denn aus Eventgebäuden/Sets etc. fällt zusätzlich reichlich an ([off topic]Nur beim derzeitigen Event weniger).[BR][BR]Die \"Gebäude-Angebote\" im Bereich \"Seasons\" sind sicherlich für die Spieler gut, die die ursprünglichen Events nicht gespielt haben. Für die Spieler, die \"Alles\" schon haben (oder ohnehin nicht wollten), ist das \"Angebot\" für 3000 Dias sicherlich nicht besonders verlockend![BR]Ich selbst warte z.B. lieber auf den Tag, wenn es Gebäude von VOR 2019 gibt, denn die interessieren mich! [smilie--sprite1]"}, {"83": "Athaneia schrieb:\t\t\tIch selbst warte z.B. lieber auf den Tag, wenn es Gebäude von VOR 2019 gibt, denn die interessieren mich! [smilie--sprite1]Zum Vergrößern anklicken....und ich schlag erst zu, wenn´s ne 2.Grundplatte für den Feuervogel gibt [smilie--sprite2]"}, {"14": "17 Manus empfinde ich jetzt aber als das komplett andere \"Extrem\"...und auch nicht 08/15[BR][BR]es gibt eben verschiedene Wege um zum Ziel zu kommen und eigentlich dachte ich, sie wären alle möglich, aber  je nachdem bekommt man dann Probleme[BR]viele Manus = Platzprobleme[BR]wenig Manus = schwierigere Eventbewältigung[BR][BR]aber bis zu den höheren Kapiteln dauert es bei mir eh noch..[BR]aber 17 Manus? ich habe gerade mal 10[BR]( plus 2 erweckte)"}, {"56": "Thebigunknown schrieb:\t\t\tDie InnoGames GmbH ist ein Spieleentwicklerstudio und Betreiber von browserbasierten und mobilen Online-Spielen mit Sitz in Hamburg.[BR][BR]Edit:[BR][BR]InnoGames gehört zu den weltweit führenden Entwicklern und Publishern von Online-Spielen. An unserem Standort in Hamburg arbeiten zurzeit mehr als 400 Mitarbeiter aus über 30 Nationen. Community Management, Entwicklung und Systemadministration stehen in engem Kontakt zueinander. Dies und die direkte Kommunikation mit unseren Spielern versetzt uns in die Lage, auf Ideen und Kritik einzugehen und unsere Spiele kontinuierlich zu verbessern.[BR][BR]Die Nutzung unserer Spiele ist komplett kostenlos, uneingeschränkt und dauerhaft möglich. Optional bieten wir unseren Spielern die Möglichkeit, über kostenpflichtige Premium-Inhalte zusätzliche Vorteile im Spiel zu genießen. Wir legen dabei höchsten Wert darauf, dass auch ohne Premium-Accounts optimaler Spielspaß gegeben ist.\t\tZum Vergrößern anklicken....InnoGames ist inzwischen eine Tochter des schwedischen Medienkonzerns Modern Times Group (MTG) die 51% der Anteile halten und deren gesamte Geschäftsstrategie - wie bei vielen internationalen Unternehmen - durchaus US-orientiert ist!"}, {"81": "Thebigunknown schrieb:\t\t\tDie InnoGames GmbH ist ein Spieleentwicklerstudio und Betreiber von browserbasierten und mobilen Online-Spielen mit Sitz in Hamburg.[BR][BR]InnoGames gehört zu den weltweit führenden Entwicklern und Publishern von Online-Spielen.\t\tZum Vergrößern anklicken....[BR]Richtige Bezeichnung währe waren.[BR][BR]Saisonale Pässe gibt's schon etwas länger am Markt....*hust* nur so als Beispiel[BR][BR]Thebigunknown schrieb:\t\t\tAn unserem Standort in Hamburg arbeiten zurzeit mehr als 400 Mitarbeiter aus über 30 Nationen. Community Management, Entwicklung und Systemadministration stehen in engem Kontakt zueinander.\t\tZum Vergrößern anklicken....[BR]Und wieviel arbeiten da an Elvenar? ist ja nicht so das Innogames ein weit gefächertes Portfolio hätte.[BR]Thebigunknown schrieb:\t\t\tDies und die direkte Kommunikation mit unseren Spielern versetzt uns in die Lage, auf Ideen und Kritik einzugehen und unsere Spiele kontinuierlich zu verbessern.\t\tZum Vergrößern anklicken....[BR]Also das Parade Beispiel war immer noch das Bibiset. 16 Monate Feedback bitten und betteln und was hat das Personal hier gemacht? Die Spieler sind schuld... man wenn es nicht so traurig gewesen währe hätte ich einen Lachflash nach dem anderen bekommen.[BR][BR]Zu Innogames selber:[BR][BR]Das Innogames zwar den \"Hauptsitz\" in \"de\" hat aber kein \"deutsches Unternehmen\" mehr ist und das schon seit Jahren lässt du außen vor.[BR]Das es über die MTG Group gelaufen ist die wiederum von 2 Amerikanischen Unternehmen finanziert wird.... naja lassen wir das.[BR][BR]Wenn es wer wissen will kann er ja Nachforschungen anstellen und bleibt dann in den US Firmen stehen.[BR][BR]Also bitte wenn ich heuchlerische Eigenwerbung lesen will dann schau ich auf die Seite von Innogames selbst und brauch das nicht hier extra von einem Mod als Argumentationsgrundlage hingeworfen bekommen. Sowas ist lächerlich[BR][BR]Haltet euch mal bitte selber an Eure Forenregeln.[BR]Das ist hier das Feedback Topic und lässt mal Eure Offtopic Reactions die sich ständig durch das ganze Forum ziehen.[BR]Wenn Ihr euch nichtmal selber daran haltet erwartet das nicht von den anderen es gibt da wohl keine Vorbildfunktion.[BR]Nur ein gut gemeinter Rat.[BR][BR]Können wir jetzt bitte wieder zum Feedback kommen?[BR][BR]Zu den Manus:[BR]G1/G2/G3  6/ 6-4/ 4 steht bei mir Standard bis Kapitel 20[BR]1-2/1-2/1-2 Erweckte wenn die GM Güter braucht.[BR]0 / 2 / x für die erleuchteten wird dann auf T0 verschoben da es nur sinn macht die höchst produzierende Manu laufen zu haben.[BR][BR]Ich hab aktuell in Kapitel 19 (letzte Forschung) stehen:[BR]6 Marmor[BR]4 Kristall[BR]4 Edelstein[BR]1 Stahlmanu[BR]1 Rollenmanu[BR]2 Elexiermanu[BR][BR]2 Flugstaub[BR]----[BR]Sind 20 Manus und hab noch 13 Rüstkammern stehen........  + Kapitel 19 Gastvolk.....[BR]Manus kann man halt hin und her porten je nachdem wie ichs brauche genauso wie ich mit FF auch die Produktion erhöhen kann.[BR][BR]Also 17 Manus = Platzprobleme würd ich jetzt nicht sagen [smilie--sprite2]"}, {"35": "[IMG]https://i.ibb.co/k9N9x6Y/https-de-forum-elvenar-com-index-php-attachments-1674854087120-png-33856.png[/IMG][BR][BR]Man sieht hier:[BR]- Preise, die man erhalten hat oder erhalten könnte (farbig)[BR]- Preise, die man erhalten hat (farbig mit grünem Häkchen)[BR]- Preise, die man noch freischalten kann (farbig mit Schloss)[BR]- Preise, die man (noch) nicht erhalten hat[BR][BR]Ich finde es recht selbsterklärend. [BR]Vor allem, wenn man erst einmal weiß, dass die gestapelten Preise \"oder\" sind und nicht \"und\" [smilie--sprite2] Aber das lernt man schnell.[BR][BR]Zu den Manus: [BR]Im Moment habe ich 15 im Spiel. Für mehr ist leider kein Platz. Der Rest liegt im Inventar und hofft auf bessere Zeiten.[BR][BR]Zu den Tagesaufgaben:[BR]Bitte die \"nur abends\"-Spieler nicht ganz außen vor lassen. Betrifft meinen kleinen Account gerade. [BR]Abends ins Spiel zu kommen und eine 9h-Produktion-Quest sehen, wenn die Werkis wegen Event auf 3h standen, ist etwas frustrierend.[BR]Wie wäre es, wenn eine Tagesaufgabe tauschbar wäre, so wie die zwei Wochenaufgaben? Oder für den nächsten Tag aufhebbar?"}, {"94": "salandrine schrieb:\t\t\tIch habe es auf der Beta gemacht, da ich dort mangels Rabatten, sowieso nichts mit den Dias so richtig anzufangen weiß.\t\tZum Vergrößern anklicken....Kannst du denn auf Beta bereits sehen was es nach dem 50ten Checkpoint noch für Preise gibt?[BR]Falls ja, bitte um kurzes Feedback.[BR][BR]Vielen Dank im Voraus"}, {"140": "vielen dank an die ewige jammergemeinde, es hat sich ausgeträumt."}, {"140": "...nu isses doch wieder da, hat wohl nen wackelkontakt. [smilie--sprite2]"}, {"81": "hobbitrose schrieb:\t\t\tBitte die \"nur abends\"-Spieler nicht ganz außen vor lassen. Betrifft meinen kleinen Account gerade.[BR]Abends ins Spiel zu kommen und eine 9h-Produktion-Quest sehen, wenn die Werkis wegen Event auf 3h standen, ist etwas frustrierend.[BR]Wie wäre es, wenn eine Tagesaufgabe tauschbar wäre, so wie die zwei Wochenaufgaben? Oder für den nächsten Tag aufhebbar?\t\tZum Vergrößern anklicken....[BR]Jup das mit 1x am Abend nach Feierabend einloggen hat sich erledigt wenn man hier mitspielen möchte.[BR][BR]Meine Dailyaufgaben für heute:[BR][BR]Fenster 1: produziere 8x Einfache Werkzeuge[BR]Fenster 2: produziere 8x Bessere Werkzeuge[BR]Fenster 3: produziere 4x Gemüsekörbe[BR]Fenster 4: Invest Knowledge Points into any kind of Ancient Wonder[BR][BR]Ist toll wenn man 4 Werkis stehen hat [smilie--sprite8][BR][BR]Jetzt 9h starten, dann 2x 3h dann 2x 15 Minuten ist ja schon fast ein GA Training.[BR][BR]Ist ein Einzeiler um sowas zu unterbinden im coding.......[BR][BR]Wobei gibt ja so tolle Quests wo man Orks einsammeln darf......toll ist wenn die Rüssis länger als 24h laufen und sonst nix Orks gibt....solls ja geben...[BR][BR]Aber hey ist ja nicht so das man auf die Probleme am Beta hingewiesen hätte....."}, {"134": "seit das Spiel nur noch aus Events und Gewinnspielen besteht, hört ein Spieler nach dem anderen auf. Das kann doch nicht im Interesse von Inno sein. Klar kann man vieles links liegen lassen aber bissl nerven tuts schon."}, {"119": "Sardukar schrieb:\t\t\tJup das mit 1x am Abend nach Feierabend einloggen hat sich erledigt wenn man hier mitspielen möchte.[BR][BR]Meine Dailyaufgaben für heute:[BR][BR]Fenster 1: produziere 8x Einfache Werkzeuge[BR]Fenster 2: produziere 8x Bessere Werkzeuge[BR]Fenster 3: produziere 4x Gemüsekörbe[BR]Fenster 4: Invest Knowledge Points into any kind of Ancient Wonder[BR][BR]Ist toll wenn man 4 Werkis stehen hat [smilie--sprite8][BR][BR]Jetzt 9h starten, dann 2x 3h dann 2x 15 Minuten ist ja schon fast ein GA Training.[BR][BR]Ist ein Einzeiler um sowas zu unterbinden im coding.......[BR][BR]Wobei gibt ja so tolle Quests wo man Orks einsammeln darf......toll ist wenn die Rüssis länger als 24h laufen und sonst nix Orks gibt....solls ja geben...[BR][BR]Aber hey ist ja nicht so das man auf die Probleme am Beta hingewiesen hätte.....\t\tZum Vergrößern anklicken....hast schonmal überlegt, einfach ein paar 1er Werkis und Manus aufzustellen ?[BR]kostete kaum Platz und Personal, macht aber vieles einfacher  [smilie--sprite2] [BR]es gibt schwierigere Tagesaufgaben [smilie--sprite1]"}, {"4": "Wo ist das Problem? Wie laufen denn deinen Werkis über Nacht? Meine haben dann immer die 9h Produktion drin, laufen tagsüber auf 3 h und mal so zwischendurch 15 Min. anwerfen sollte doch möglich sein.[BR][BR]Oder, stell halt ein paar Mini Werkis und Mini Manus. Bei den derzeitigen Eventanforderungen anfangs ist das sowieso notwendig und fürs GA ist es auch nicht schlecht.[BR][BR]Ich hab eine Ecke dafür freigehalten inzwischen, lohnt den ständigen Umbau nicht. Und am Ende einer Straße immer mal noch Platz für eine Mini Manu. [BR][BR]Die Anforderungen ändern sich halt immer mal ein bisschen, sonst kommt absolute Langeweile auf."}, {"141": "Neris schrieb:\t\t\t17 Manus empfinde ich jetzt aber als das komplett andere \"Extrem\"...und auch nicht 08/15\t\tZum Vergrößern anklicken....jetzt hab ich doch mal nachgezählt - bei mir stehen 21 Manus rum... [BR]Bin ich jetzt extrem? Komplett?"}, {"61": "OHHH wie ist das schön! Ohhh wie ist das schön![BR]Mit ausgewognem Stadtaufbau die Saisons spieln![BR]Sooo schön! Sooo schön!"}, {"135": "Athaneia schrieb:\t\t\t17 Manufakturen dürfen aber im \"Normalfall\" für einen 08/15 Spieler \"überreichlich\" sein. Ich habe nie mehr als 12 Manus gehabt.\t\tZum Vergrößern anklicken....Hier. 47 ausgebaute Manus [smilie--sprite1][BR]23 Holz[BR]16 Marmor[BR]8 Magiestaub"}, {"14": "krass....[BR]was macht ihr mit so vielen Manus?..[BR]die brauchen auch alle Arbeiter..und somit exorbitant Platz?[BR][BR]irgendwie spiele ich komplett anders  [smilie--sprite8]"}, {"135": "Neris schrieb:\t\t\tkrass....[BR]was macht ihr mit so vielen Manus?..[BR]die brauchen auch alle Arbeiter..und somit exorbitant Platz?[BR][BR]irgendwie spiele ich komplett anders  [smilie--sprite8]Zum Vergrößern anklicken....[BR]Keine Sorge, bei dir ist alles richtig, wenn es für dich passt![BR]Ich fokussiere im Turm und Turnier auf Handel."}]