[{"94": "vaas85 schrieb:\t\t\tseit das Spiel nur noch aus Events und Gewinnspielen besteht, hört ein Spieler nach dem anderen auf. Das kann doch nicht im Interesse von Inno sein. Klar kann man vieles links liegen lassen aber bissl nerven tuts schon.\t\tZum Vergrößern anklicken....Also ich verstehe diese Logik nicht, Leute hören auf weil zu viele Feature da sind die sie eh nicht machen würden und wollen.[BR]Daher soll es keine Feature mehr geben weil es sie nervt sie anzusehen? Somit sollen auch alle anderen die sich wünschen mehr im Spiel zu tun sich damit zufrieden geben was bereits im Spiel ist. Das klingt ja nach einem richtigen Masterplan."}, {"133": "ist doch recht egal wieviel wer was stehen hat und wie wer das Spiel angeht,[BR][BR]das Spiel hat sich verändert,[BR][BR]so man die Nebenschauplätze des Spiels mit abgrasen möchte, brauchts es eine kleine  \"GA\" Gebäude Ecke auf Dauer, anders wird das leider nichts,[BR][BR]3 Rüstkammern und ein super geplanter Aufbau weniger, nicht ganz so schick, Kompromisse"}, {"104": "Jammin schrieb:\t\t\tDaher soll es keine Feature mehr geben weil es sie nervt sie anzusehen? Somit sollen auch alle anderen die sich wünschen mehr im Spiel zu tun sich damit zufrieden geben was bereits im Spiel ist. Das klingt ja nach einem richtigen Masterplan.\t\tZum Vergrößern anklicken....Eine ganz simple Maßnahme wäre das 'Ausschalten' der Features, nur leider keine Option. Turm, Turnier und GA kann man unter Nicht-Teilnahme Gilde entgehen, falls abgelehnt. Für Events + Season wäre es schnell einzubauen, dann erstmal eine gewisse Möglichkeit der Ruhe."}, {"133": "ForgeS44 schrieb:\t\t\tEine ganz simple Maßnahme wäre das 'Ausschalten' der Features, nur leider keine Option. Turm, Turnier und GA kann man unter Nicht-Teilnahme Gilde entgehen, falls abgelehnt. Für Events + Season wäre es schnell einzubauen, dann erstmal eine gewisse Möglichkeit der Ruhe.\t\tZum Vergrößern anklicken....[BR]sag mal einem Supermarktbetreiber , er soll die Kinder quengel Ecke, bunte Süßigkeiten etc. an der Kasse wegräumen, gleiches Prinzip."}, {"1": "Da wir natürlich möchten, dass die Features genutzt werden, werden wir diese auch nicht abschaltbar machen. Dennoch muss niemand diese Features nutzen."}, {"40": "Wer ein Spiel spielt, sollte damit leben, dass das Spiel ihn beschäftigt:[BR]Natürlich blitzt und blinkt es irgendwo, ein schriller Ton, ein Warngeräusch, ein Oh, ein Ah und Uh.[BR]Das ist das Essenz des Spielens und es gehört einfach irgendwie dazu.[BR][BR]Ja - zugegebenen - früher war das Spiel ruhiger. Man hatte einfach weniger zu tun.[BR]Der eine mag diese Änderung, der andere mag sie nicht.[BR][BR]Die Konsequenz als Spieler ist immer dieselbe:[BR]Man kann mit einem Spiel aufgrund der Änderungen mit dem Spielen anfangen oder man kann als langjähriger Spieler aufgrund einer Änderung mit dem Spielen aufhören.[BR][BR]InnoGames weiß, was besser ankam, wenn sich über einen gewissen Zeitraum die Zahlen verändert haben."}, {"56": "Tacheless schrieb:\t\t\tDa wir natürlich möchten, dass die Features genutzt werden, werden wir diese auch nicht abschaltbar machen. Dennoch muss niemand diese Features nutzen.\t\tZum Vergrößern anklicken.......ob das die richtige Einstellung ist, das möchte ich bezweifeln. Wer ein Feature nutzen möchte, der wird es sich auch anstellen und nutzen. Wer es nicht möchte, der ist nur sehr genervt und wird schon aus \"Protest\" (\"jetzt erst recht nicht\") alles ignorieren! Man kann niemanden der nicht \"will\" auf diese Weise animieren sondern höchstens komplett verärgern! [BR]Aber Ihr müsst ja wissen was ihr macht (rein psycholisch ist das aber ein Vabanquespiel!)"}, {"141": "ZeNSiErT schrieb:\t\t\tOHHH wie ist das schön! Ohhh wie ist das schön![BR]Mit ausgewognem Stadtaufbau die Saisons spieln![BR]Sooo schön! Sooo schön!\t\tZum Vergrößern anklicken....bevor ich es like - war das Ironie?"}, {"81": "Primus71 schrieb:\t\t\thast schonmal überlegt, einfach ein paar 1er Werkis und Manus aufzustellen ?[BR]kostete kaum Platz und Personal, macht aber vieles einfacher  [smilie--sprite2] [BR]es gibt schwierigere Tagesaufgaben [smilie--sprite1]Zum Vergrößern anklicken....[BR]Wir alte Hasen haben sowieso beim Eventbeginn ein paar kleine Manus und Werkis stehen [smilie--sprite1][BR]Da brauchen wir nicht mal in die  Questliste schauen ist doch eh  immer das selbe....[BR][BR]Neris schrieb:\t\t\tkrass....[BR]was macht ihr mit so vielen Manus?..[BR]die brauchen auch alle Arbeiter..und somit exorbitant Platz?[BR][BR]irgendwie spiele ich komplett anders  [smilie--sprite8]Zum Vergrößern anklicken....Richtige Wunder ausbauen => Abgrund / Hallen / Thermalbrunnen[BR]dann Wohngebäude durch magische ersetzten[BR]Auf Eventgebäude mit Bev/Kultur verzichten[BR][BR]Ja du spielst komplett anders darum wirst du mit dem Spielstil nie auf die Anzahl der Manus kommen."}, {"141": "Xebifed schrieb:\t\t\tHier. 47 ausgebaute Manus [smilie--sprite1]Zum Vergrößern anklicken....wow - das hab ich auch noch nicht gesehen [smilie--sprite1][BR]ich sehe keinen Feuerphönix bei Dir und bist trotzdem im Turnier sehr gut - handelst Du das alles?"}, {"135": "Fritzilein schrieb:\t\t\twow - das hab ich auch noch nicht gesehen [smilie--sprite1][BR]ich sehe keinen Feuerphönix bei Dir und bist trotzdem im Turnier sehr gut - handelst Du das alles?\t\tZum Vergrößern anklicken....Wenn ich Lust habe, schmeiss ich in den ersten 4 Begegnungen mal ein paar Einheiten ins Gefecht, die sammeln sich ja auch aus Eventgebäuden an. Darüber hinaus gewinne ich aber eh keinen Kampf mehr und verhandel alles.[BR]Ich mache meisst, je nachdem wie ich es zeitlich schaffe, einen Zyklus (9 Turniere) mindestens 32 Provinzen a 6 Sterne, dann ein paar Wochen etwas ruhiger, kommt auch immer auf das Güterlager an. Hin und wieder dann auch mal 40 Provinzen a 6 Sterne.[BR]Dafür muss ich aber schon täglich 4x die 3 Stunden Produs abholen und über Nacht die 9H."}, {"119": "@Xebifed : Hab ich auch so gemacht. Anders kommt man nicht auf <100M von jedem Gut.[BR]Allerdings kämpfe ich mittlerweile wieder mehr, denn beim Verhandeln gehen mir so langsam die Gold-und Werkzeugbooster aus [smilie--sprite3][BR][BR]Die letzten Jahre kam ich gut damit zurecht, was meine 50 Rükas an Gütern ausgespuckt haben, aber ich denke, ab dem nächsten Kapitel werde ich wieder auf Manufakturen umstellen."}, {"135": "Primus71 schrieb:@Xebifed : Hab ich auch so gemacht. Anders kommt man nicht auf <100M von jedem Gut.[BR]Allerdings kämpfe ich mittlerweile wieder mehr, denn beim Verhandeln gehen mir so langsam die Gold-und Werkzeugbooster aus [smilie--sprite3][BR][BR]Die letzten Jahre kam ich gut damit zurecht, was meine 50 Rükas an Gütern ausgespuckt haben, aber ich denke, ab dem nächsten Kapitel werde ich wieder auf Manufakturen umstellen.\t\tZum Vergrößern anklicken....[BR]Bei mir sind es die Münzen, die regelmässig knapp werden. Während Events, wo ständig WP gekauft werden müssen, schmelzen meine Münzsegen wie Käse in der Mikrowelle.[BR]Wenn ich 1x die Woche alle Manus verzaubere und die Güterphoenixe füttere, und es dann noch schaffe, während des Füttereffekts die 9H + eine 3H einzusammeln, kommt gut was rum. Logisch, der Füttereffekt macht Bonus auf 47 Manus...da lohnt sich das [smilie--sprite2][BR][BR]Und die Kurve zu den Seasons: Die Aufgaben \"49x 3H Produktion\" sind demnach nebenbei erledigt."}, {"2": "...ihr habt vielleicht Probleme - da back ich mir lieber noch ein paar 3-Millionen-Brote und geh shoppen  [smilie--sprite2] ...."}, {"135": "Romilly schrieb:\t\t\t...ihr habt vielleicht Probleme - da back ich mir lieber noch ein paar 3-Millionen-Brote und geh shoppen  [smilie--sprite2] ....\t\tZum Vergrößern anklicken....[BR]Wenn die Stadt demenstprechend ausgebaute Wunder hat, mag das gehen, aber du schliesst zu oft von dir auf andere. Wenn ich die Vorräte in der Hummel versenke, bleibt nicht genug fürs Turnier."}, {"2": "Xebifed schrieb:\t\t\tWenn die Stadt demenstprechend ausgebaute Wunder hat, mag das gehen, aber du schliesst zu oft von dir auf andere. Wenn ich die Vorräte in der Hummel versenke, bleibt nicht genug fürs Turnier.\t\tZum Vergrößern anklicken.......??? - warum? - wie viele Lagerfüllungen landen denn bei dir im Turnier? Bei mir machen halt 7 solche Brote 1x das Lager voll (also eine Runde) ...das fasst nämlich nur 20 Millionen...und die passenden Wunder hast du mit Abschluß der Amuni...vielleicht solltest du doch mal über Alternativen nachdenken..."}, {"135": "Romilly schrieb:\t\t\t...??? - warum? - wie viele Lagerfüllungen landen denn bei dir im Turnier? Bei mir machen halt 7 solche Brote 1x das Lager voll (also eine Runde) ...das fasst nämlich nur 20 Millionen...und die passenden Wunder hast du mit Abschluß der Amuni...vielleicht solltest du doch mal über Alternativen nachdenken...\t\tZum Vergrößern anklicken....[BR]Im Turnier landen so um die 5 Lagerfüllungen Vorräte. Für Brot habe ich selten Zeit. Für eine Lagerfüllung bräuchte ich, selbst verzaubert (VV und MM), ca.  81 Brote. dafür müsste ich den ganzen Tag jede Stunde online kommen, das geht schon aus arbeitsgründen nicht.  [BR][BR]Ich brauche auch nicht über Alternativen nachdenken, ich mache auf meine Art ja 4x so viel Turnierpunkte wie du. Und darum geht es mir."}, {"2": "...interessant - du schaffst 32.400 Turnierpunkte?...[BR][BR][IMG]https://i.ibb.co/qygMppv/https-de-forum-elvenar-com-index-php-attachments-turnierromi-png-33880.png[/IMG]"}, {"61": "Fritzilein schrieb:\t\t\tbevor ich es like - war das Ironie?\t\tZum Vergrößern anklicken....nö"}, {"135": "Romilly schrieb:\t\t\t...interessant - du schaffst 32.400 Turnierpunkte?...[BR][BR]Anhang 33880 ansehenZum Vergrößern anklicken....[BR]Ok, 4x war etwas übertriebeben...war ja auch nur geschätzt.[BR][BR]Xebifed: [IMG]https://i.ibb.co/svrpr8c/https-de-forum-elvenar-com-index-php-attachments-1674932863940-png-33881.png[/IMG][BR][BR]Romilly: [IMG]https://i.ibb.co/Kwr43jp/https-de-forum-elvenar-com-index-php-attachments-1674932916882-png-33882.png[/IMG]"}]