[{"2": "Xebifed schrieb:\t\t\tOk, 4x war etwas übertriebeben...[BR][BR]Xebifed: Anhang 33881 ansehen[BR][BR]Romilly: Anhang 33882 ansehenZum Vergrößern anklicken.......du solltest schon in der richtigen Welt nachkucken...(und nicht in meiner Nebenwelt in der ich einfach nur 2x am Tag Prods anschmeisse)...."}, {"135": "Romilly schrieb:\t\t\t...du solltest schon in der richtigen Welt nachkucken...(und nicht in meiner Nebenwelt in der ich einfach nur 2x am Tag Prods anschmeisse)....\t\tZum Vergrößern anklicken....[BR]Meinst du das? Das ist auch kein höherer Schnitt.[BR][BR][IMG]https://i.ibb.co/889d7FT/https-de-forum-elvenar-com-index-php-attachments-1674933174003-png-33883.png[/IMG]"}, {"2": "Xebifed schrieb:\t\t\tMeinst du das? Das ist auch kein höherer Schnitt.[BR][BR]Anhang 33883 ansehenZum Vergrößern anklicken........nein - FELYNDRAL...[IMG]https://i.ibb.co/Srr1Npp/https-de-forum-elvenar-com-index-php-attachments-romilly2-png-33884.png[/IMG]...[BR]...und da ist genügend Platz für Mini-Manus und Werkis für Events, GA und jetzt die Saison..."}, {"135": "Du weisst aber schon, dass ich die Erweiterungen nur viel viel teurer bekomme, und die Städte somit kaum vergleichbar sind, nachdem du den Platz quasi \"geschenkt\" bekommen hast. Aber lass mal gut sein, alle anderen spielen falsch, nur du machst es richtig."}, {"1": "Und jetzt dürft ihr zum Feedback zurück kommen!"}, {"2": "Xebifed schrieb:\t\t\tDu weisst aber schon, dass ich die Erweiterungen nur viel viel teurer bekomme, und die Städte somit kaum vergleichbar sind, nachdem du den Platz quasi \"geschenkt\" bekommen hast. Aber lass mal gut sein, alle anderen spielen falsch, nur du machst es richtig.\t\tZum Vergrößern anklicken.......von was sprichst du da? Die Preise für Premium-Erweiterungen wurden am 10.11.2016 angepasst (erhöht) und haben sich seitdem nicht mehr geändert...diese \"Geschenke\"  muss ich wohl verschlafen haben (vermutlich meinst du die Diamanten, die man sich ingame verdienen kann) - vielleicht spiel ich ja doch wenigstens teilweise nicht ganz so verkehrt...zumindest hatte ich bisher nie Probleme mit Events aller Art..."}, {"40": "Dieses gegenseitige Belegen einander ist einfach unerträglich![BR]@Romilly , @Xebifed - Was soll das?  [smilie--sprite4] [BR]Das macht das ganze schöne Feedback kaputt, das nun keiner mehr ungestört lesen kann, weil zwischendrin mal wieder nur \"Schrott\" steht.[BR][BR]@littleFlex , @Tacheless - Ich bitte darum, dass diese - meine - Wortmeldung nach 24 Stunden gelöscht wird. (Ersatzweise mache ich es selbst.)[BR]Aber ich möchte einfach mal die Diskutanten erinnern, wie unschön immer solche Einwürfe sind, vor allem innerhalb eines Feedback-Threads."}, {"81": "Dominus00 schrieb:\t\t\tDieses gegenseitige Belegen einander ist einfach unerträglich![BR]@Romilly , @Xebifed - Was soll das?  [smilie--sprite4] [BR]Das macht das ganze schöne Feedback kaputt, das nun keiner mehr ungestört lesen kann, weil zwischendrin mal wieder nur \"Schrott\" steht.[BR][BR]@littleFlex , @Tacheless - Ich bitte darum, dass diese - meine - Wortmeldung nach 24 Stunden gelöscht wird. (Ersatzweise mache ich es selbst.)[BR]Aber ich möchte einfach mal die Diskutanten erinnern, wie unschön immer solche Einwürfe sind, vor allem innerhalb eines Feedback-Threads.\t\tZum Vergrößern anklicken....[BR]Und wie immer schaut bei Romy der Support zu wie eine Offtopic Meldung und Provokation nach der anderen kommt.[BR][BR]Romilly schrieb:\t\t\t...ihr habt vielleicht Probleme - da back ich mir lieber noch ein paar 3-Millionen-Brote und geh shoppen  [smilie--sprite2] ....\t\tZum Vergrößern anklicken....[BR]Sowas ist nur überheblich, provokant und hat hier nichts verloren. [BR]Vor allem wenn man weis wie ineffizient hier Romy spielt.[BR]Wer im Glashaus sitzt und so.[BR][BR]Solche Forumsmitglieder wurden über Jahre gezüchtet indem sie kaum bis gar nicht in die Schranken gewiesen werden.[BR]Ist ein Teil warum es im \"de\" Forum so drunter und drüber geht. Einige sind halt gleicher........[BR]In anderen Foren hätte Romy schon öfters pausieren dürfen. [BR]Darum mag ich das EN / US und Beta Forum viel mehr. Toleranz aber sowas wird im Kein erstickt.[BR][BR]Alternative ist nur, wie ich es mache, solche Teilnehmer auf die Igno packen. Da liest sich das Forum gleich viel besser.[BR][BR]zum Feedback:[BR][BR]Eigentlich sollten die Quests der Seasons in den täglichen Spielfluss einfließen aber ich muss sagen es gibt genug Quests die dem nicht entsprechen und ich mich genötigt fühle Dinge jetzt anders zu machen [smilie--sprite2][BR][BR]Wird man von Inno jetzt praktisch dazu in eine bestimmte Richtung \"gezwungen\" zu spielen? Ich weis es nicht  ist aber eine Überlegung wert."}, {"8": "In den Saison Preisen schlummern immer mal gewaltige Mengen normale Güter.[BR][BR]Hat schon mal Jemand versucht die einzusammeln um eine eventaufgabe zu beenden?[BR][BR]Hihi, das fänd ich ja super wenn das ginge! [smilie--sprite1][BR][BR]Mich hat bisher noch keine Manuheavyquest genervt... die seasons scheinen da sehr liberal zu sein? Hummler dürfen dort weiterhin gemütlich Gütermeere erschaffen und die quests auch mit minimanus erfüllen. Puh! Glück gehabt [smilie--sprite1][BR][BR]Ein paar Mal hab ich geschmunzelt... Ok, du hast jetzt sinnlos Gemüsekörbe gecraftet... ein paar Mio. Güter in den Wind geschossen... und bekommst? 15 min. Zeitboost [smilie--sprite8] [smilie--sprite8] [smilie--sprite8][BR]aber ich hätte ja auch Miniwerkis nehmen können?! [smilie--sprite9][BR][BR]Ich glaub, was mich jetzt am meisten anstachelt: Die Verheißung auf ne Überraschung die noch keiner verraten hat... am Ende der Season.[BR]Aber ich werde das wohl bald vergessen haben???[BR][smilie--sprite6]"}, {"2": "gergerw schrieb:\t\t\tIn den Saison Preisen schlummern immer mal gewaltige Mengen normale Güter.[BR][BR]Hat schon mal Jemand versucht die einzusammeln um eine eventaufgabe zu beenden?\t\tZum Vergrößern anklicken.......mit Gütern (und Werkzeug) funktioniert das idR nicht...was anderes ist es mit Gold und Zaubern, die man z.B. beim Kapitelwechsel oder auch für andere Quests bekommt...bei den Gütern gab es mal die \"erwirtschafte\" Quests - da hatten z.B auch Handel gezählt - das gab es dann aber nur noch in der Schleife - aber die ist ja jetzt Geschichte..."}, {"100": "gergerw schrieb:\t\t\tIch glaub, was mich jetzt am meisten anstachelt: Die Verheißung auf ne Überraschung die noch keiner verraten hat... am Ende der Season.[BR]Aber ich werde das wohl bald vergessen haben???\t\tZum Vergrößern anklicken....Wer hat den verraten  das es in den livewelten eine Überraschung gibt ?[BR]Von Beta hab ich etwas gehört ..... [smilie--sprite1][BR][BR]Da ich eine Stadt nicht für die season umbauen möchte  , werd ich nicht alle quests  schaffen . [BR]Manus hab ich null ( für das Event  8 kleine )  , werks  mur 2  ( 6 kleine für das event  ) [BR]Anpassen zu 0815 mag ich nicht . Das sind die Preise nicht wert .[BR][BR]Die Hauptstadt freut sich über die seasons  . Platz ist kein Problem  . Die Aufgaben schnell erledigt . [BR]Das geht schnell und ist spassig .   [BR]Belohnungeffekt in Kapitel 18  ......   Placebo"}, {"48": "Kurze Frage. [BR]Ich spiele zur Zeit nur am Handy, deshalb kein Screenshot, aber eine Tagesaufgabe lautet Heute: Schließe eine Zauberer-Eventquest ab. Die tägliche Quest des derzeitigen Events hat nicht gezählt und die Tagesaufgabe kann ich erst in ein paar Stunden lösen.[BR]Ist das jetzt ein Übersetzungsfehler oder ein richtiger?[BR]Nur das ich vorbereitet bin"}, {"1": "@j.fili Irgendwie werde ich nicht schlau aus deiner Anfrage. \"Die tägliche Quest\" hat nicht gezählt, ist das nicht auch die \"Tagesaufgabe\"?[BR][BR]Generell: Bitte Fragen in den Thread bezüglich Fragen zur den Saisons. Danke. [smilie--sprite1]"}, {"48": "Tacheless schrieb:@j.fili Irgendwie werde ich nicht schlau aus deiner Anfrage. \"Die tägliche Quest\" hat nicht gezählt, ist das nicht auch die \"Tagesaufgabe\"?[BR][BR]Generell: Bitte Fragen in den Thread bezüglich Fragen zur den Saisons. Danke. [smilie--sprite1]Zum Vergrößern anklicken....Die tägliche Quest kommt jeden Tag mit der Uhr. Die Tagesaufgabe kommt erst, wenn die Aufgaben so weit gelöst sind, dass man nur noch eine am Tag bekommt."}, {"1": "Hm, tägliche Quest und Tagesaufgabe sind ein und das gleiche. Wenn du heute eine Quest vom Zaubererevent gelöst hast, dann schreibe bitte den Support an, dass dieser dir die Saisonquest manuell auf beendet setzt."}, {"103": "Sardukar schrieb:\t\t\tUnd wie immer schaut bei Romy der Support zu wie eine Offtopic Meldung und Provokation nach der anderen kommt.[BR][BR][BR][BR]Sowas ist nur überheblich, provokant und hat hier nichts verloren.[BR]Vor allem wenn man weis wie ineffizient hier Romy spielt.[BR]Wer im Glashaus sitzt und so.[BR][BR]Solche Forumsmitglieder wurden über Jahre gezüchtet indem sie kaum bis gar nicht in die Schranken gewiesen werden.[BR]Ist ein Teil warum es im \"de\" Forum so drunter und drüber geht. Einige sind halt gleicher........[BR]In anderen Foren hätte Romy schon öfters pausieren dürfen.[BR]Darum mag ich das EN / US und Beta Forum viel mehr. Toleranz aber sowas wird im Kein erstickt.[BR][BR]Alternative ist nur, wie ich es mache, solche Teilnehmer auf die Igno packen. Da liest sich das Forum gleich viel besser.[BR][BR]zum Feedback:[BR][BR]Eigentlich sollten die Quests der Seasons in den täglichen Spielfluss einfließen aber ich muss sagen es gibt genug Quests die dem nicht entsprechen und ich mich genötigt fühle Dinge jetzt anders zu machen [smilie--sprite2][BR][BR]Wird man von Inno jetzt praktisch dazu in eine bestimmte Richtung \"gezwungen\" zu spielen? Ich weis es nicht  ist aber eine Überlegung wert.\t\tZum Vergrößern anklicken.... Danke für die Hinweise ![BR][BR]Es ist zum Einen Fakt, dass es keine Ungleichbehandlung von Usern im Forum gibt.[BR](ich streite mich gern mit jedem)[BR]Auch eine Romy hat genug Posts von uns und gelöschte Beiträge auf ihrem Konto.[BR][BR]Ich handhabe es nun eben meist so, dass ich lieber auf Offtopics hinweise, als rigoros Posts zu löschen,[BR]weil oft auch in Offtopic-Posts eine gewisse Wahrheit steckt.[BR][BR]Zu Deiner Kritik will ich noch sagen, dass es ein wunderbarere Weg ist,[BR]in einem Post erst 20 Zeilen Offtopic zu schreiben und die letzten 5 Zeilen dann als eigentliches Feedback zu deklarieren.[BR][BR]Das stellt mich als Moderator dann immer vor die Wahl,[BR]den Post als Offtopic zu löschen und genau von Dir im nächsten Post wegen Zensur oder Löschung von ungewolltem Feedback[BR]angeklagt zu werden[BR]oder es einfach stehen zu lassen dem wenigen Feedback Vorrang vor dem Offtopic zu gewähren.[BR][BR]-> Wer im Glashaus sitzt..."}, {"142": "Tacheless schrieb:\t\t\tHm, tägliche Quest und Tagesaufgabe sind ein und das gleiche. Wenn du heute eine Quest vom Zaubererevent gelöst hast, dann schreibe bitte den Support an, dass dieser dir die Saisonquest manuell auf beendet setzt.\t\tZum Vergrößern anklicken....Was j.fili wohl meint, ist der \"Loginbonus\" (Tägliche Eventbelohnung oder so ähnlich). Der schaut aus wie eine Eventquest, wird aber bei den Seasons nicht als solche gezählt."}, {"1": "Der Loginbonus zählt natürlich nicht, ist ja auch keine Quest. [smilie--sprite1]"}, {"143": "Wieso geht denn die Anzeige für die Seasons komplett weg wenn man Tages- und Wochenquest erledigt hat?[BR]Da wäre es doch besser wie bei den Events das ganze als gesperrt bzw. im Wartemodus zu kennzeichnen."}, {"2": "Jeanne68 schrieb:\t\t\tWieso geht denn die Anzeige für die Seasons komplett weg wenn man Tages- und Wochenquest erledigt hat?[BR]Da wäre es doch besser wie bei den Events das ganze als gesperrt bzw. im Wartemodus zu kennzeichnen.\t\tZum Vergrößern anklicken.......das kommt wieder, wenn du die Seite neu lädst - ist sozusagen ein momentaner Anzeigefehler..."}]