[{"1": "Dear Humans and Elves,[BR]"}, {"2": "Wow.  The merge game ahead of the Halloween event.  You guys sure know how to wear down players."}, {"3": "Really dislike this style so it means a nice break for me. Simply will not do it!"}, {"4": "You may not like the style, but according to elvenArch, the Solunar Nexus has the 2nd highest mana production of all the evolving buildings, at least for chapter 21. Wise Golem is higher, but mine would require 80 RR to upgrade."}, {"5": "Lelanya said:\t\t\tWow.  The merge game ahead of the Halloween event.  You guys sure know how to wear down players.\t\tClick to expand...[BR]And there will be a FA in between too."}, {"6": "FA should runs without any event...."}, {"2": "I think whoever is making these decisions should be condemned to running an entire fellowship through their own events, on their own time."}, {"7": "I like the format of this event and the building is worthwhile as @Yogi Dave says chap 21 mana hungry.   It's nice there's not so much blue colour when fully evolved.   As MRs and MWs are so blue it would be great to have event buildings of completely different colours as my cities are so very eye achingly bluuuue.[BR]Whilst I appreciate some people aren't keen on regular events I enjoy them so yay for me but would be much happier if FAs were a special once a year thing then we could actually look forward to it, and have a worthwhile prize."}, {"8": "The board is much smaller this time. I don't like this event and that doesn't make it better for me!"}, {"9": "Ehm....who the *** did the board so small?[BR]I just logged to my inactive beta city and I'm seriously thinking about not playing this event on live - and i play all events, but with the board so small it seems pointless to even try."}, {"10": "I don't know if it's just me being cranky because I'm tired or whether the game board is truly irritating but I found the whole thing just a bit too fiddly and time consuming. Takes ages to assemble a chosen menu and then if only rubbish menus come out that offer very low ROI you have to wait 30 min for another option. What am I supposed to do for those 30 min? It's not like I sit at the game all day. [BR]I'm going to bed. Fingers crossed I'll have a more agreeable disposition in the morning."}, {"11": "I see others notified it also, but IMO the board is way to small now.[BR]Previously i could arrange the items before merging them as i want. The space availble for it now is very limited.[BR][BR]The previous 5x9 is much better as 4x6"}, {"12": "Lovec Krys said:\t\t\tEhm....who the *** did the board so small?\t\tClick to expand...The board was made smaller to make the recipes more expensive and let you waste more event currency.[BR]If you have a large board, you also have a better chance of getting the right piece out of one of the cups and don't have to shove anything together, which would increase your costs.[BR][BR]Therefore smaller board better for Inno."}, {"8": "Has been difficult enough last year to get all set-items. [BR]Seems like Inno is not interested in our feedback."}, {"13": "Nice to compare the \"previous past 2022\" with the \"present past 2023\".[BR]Two days less, 4 missions less, between 5 and 6 % less of dwarven chips.[BR]Here's the motto: Leave any hopes, who is entering the past. For all the rest, there's a credit card.[BR]To be more specific @Souliena , it seems like Inno is not interested in people who play."}, {"5": "Does anyone know if there are event quests that require us to use Lucky Draws, like in the last merge event? Do we have to hoard them for quests or can we use them as we win them?"}, {"14": "Enevhar Aldarion said:\t\t\tDoes anyone know if there are event quests that require us to use Lucky Draws, like in the last merge event? Do we have to hoard them for quests or can we use them as we win them?\t\tClick to expand...No, there aren't"}, {"8": "Enevhar Aldarion said:\t\t\tDoes anyone know if there are event quests that require us to use Lucky Draws, like in the last merge event? Do we have to hoard them for quests or can we use them as we win them?\t\tClick to expand...[BR]Maybe there will be quests like that in the next \"season\". But I think nobody could know that before the season will start."}, {"15": "Is event currency supposed to drop out of the ether as in other events?[BR]I haven't had any yet and its 7 hours after the start. I logged out and back in and checked for up-dates as well (there weren't any).[BR][BR]Thanks"}, {"4": "Mrietha said:\t\t\tIs event currency supposed to drop out of the ether as in other events?[BR]I haven't had any yet and its 7 hours after the start. I logged out and back in and checked for up-dates as well (there weren't any).\t\tClick to expand...Have you completed a quest? I don't think they start dropping until you do one."}]