[{"16": "Nope, logging in and accepting notification about new event started is enough. + maybe getting first free event currency from daily quest, not sure as I've clicked them both and logged off then got 6 drops on the ground when logged in few hours later."}, {"15": "Thank you![BR]Just logged on and finally have a couple.[BR]I had completed at least a couple of quests when I wrote, but maybe I was too impatient."}, {"2": "I found that the city litter drops were slow to start."}, {"5": "The Lunar Factory is back in this event!"}, {"17": "So if iDavis numbers are correct, it seems that the main prize mana numbers for chapters 9 and 10 are messed up"}, {"18": "Ibison2 said:\t\t\tSo if iDavis numbers are correct, it seems that the main prize mana numbers for chapters 9 and 10 are messed up\t\tClick to expand...The numbers on ElvenArchitect make it clearer. When fully evolved in chapter 9 it is 7600 and 6080 mana, so 13680 total. In chapter 11 it is 13400 mana and 2320 seeds."}, {"19": "As some other players already stated; the board is too small.[BR]Apart from that, I will likely just have to skip this event; I simply do not have the time to sit here to endlessly try to merge stuff to match what I need to match the offers.[BR]Maybe the Dev-team can afford to spend most of their day on this game as it is part of their job, I cannot as it is not part of mine.[BR][BR]The concept of the merging is fine, but it just is too timeconsuming for me to really make the most of it and I absolutely hate doing things half-way, so I rather just skip it entirely.[BR][BR]Oh, and probably this will fall on deaf ears too, but who knows. This has been mentioned before by many players too; please add some more time between events. I am just getting event-weary."}, {"13": "And NOW it’s official. Celebration![BR]it‘s a happy anniversary here. Event after event. Time by time, any lesson learned from the past.[BR](I want to be paid for this perpetual check, even it’s a simple check, like shooting to the red cross, I can do it by default, even without knowing).[BR]Again, there is something wrong with the number of the episodic quests. They are 19 instead of 20, so the last one will be on Sept. 25 while the end is scheduled for almost half of 27, as stated by the game countdown.[BR]And thanks god it’s Friday, anyone will pay the attention that should have been paid before.[BR]Happy anniversary!"}, {"10": "Enevhar Aldarion said:\t\t\tThe Lunar Factory is back in this event!\t\tClick to expand...And I've been trying all day to get one but I'm being sorely tested!"}, {"10": "Dhurrin said:\t\t\tAs some other players already stated; the board is too small.[BR]Apart from that, I will likely just have to skip this event; I simply do not have the time to sit here to endlessly try to merge stuff to match what I need to match the offers.[BR]Maybe the Dev-team can afford to spend most of their day on this game as it is part of their job, I cannot as it is not part of mine.[BR][BR]The concept of the merging is fine, but it just is too timeconsuming for me to really make the most of it and I absolutely hate doing things half-way, so I rather just skip it entirely.[BR][BR]Oh, and probably this will fall on deaf ears too, but who knows. This has been mentioned before by many players too; please add some more time between events. I am just getting event-weary.\t\tClick to expand...I agree. Even after ensuring I was well rested and not just a cranky pants I can confirm this event is infuriating. [BR]Normally I'd only make the 3 gem recipes because they proved the most cost effective last time but I noticed they've group the prizes on recipes this time (not sure if they did that last time) so I'm going to end up wasting a lot of time and energy just to get junk I don't want."}, {"13": "mythandry said:\t\t\tAnd I've been trying all day to get one but I'm being sorely tested!\t\tClick to expand...I’ve made 82 steps for only two factory. Boring."}, {"5": "Uffauffa said:\t\t\tAgain, there is something wrong with the number of the episodic quests. They are 19 instead of 20, so the last one will be on Sept. 25 while the end is scheduled for almost half of 27, as stated by the game countdown.\t\tClick to expand...[BR]Yes, if the number of daily quests matched the number of days correctly, I should be on the quest lock right now, but I am not. I am working on quest 55, when I should be at the lock after completing 54. I wonder if they forgot to put the lock in, like they did in one other event, where everyone who went past the lock, had to sit around with no quests until the game caught up to them?  @Astram @Deadeye Jerry this needs to be looked into."}, {"18": "Enevhar Aldarion said:\t\t\tI am working on quest 55, when I should be at the lock after completing 54. I wonder if they forgot to put the lock in\t\tClick to expand...I've done quest 55 and the next quest is locked - opening in 7.5 hours."}, {"14": "Enevhar Aldarion said:\t\t\tDoes anyone know if there are event quests that require us to use Lucky Draws, like in the last merge event? Do we have to hoard them for quests or can we use them as we win them?\t\tClick to expand...[BR]PrimroseSylvia said:\t\t\tNo, there aren't\t\tClick to expand...I was thinking for days at your request, because I wasn't able to find where, in past event, a lucky draw was asked to be used.[BR]Then I had an epiphany: it was not in event, but in season! And I'm sorry to tell you that most likely it will be the same request in the next season..."}, {"5": "Uffauffa said:\t\t\tAgain, there is something wrong with the number of the episodic quests. They are 19 instead of 20, so the last one will be on Sept. 25 while the end is scheduled for almost half of 27, as stated by the game countdown.\t\tClick to expand...[BR]@Uffauffa Check the count again. It says 73 quests now, and like you, I am sure it said 72 before, so now the number of days and quests match up. But it is very sad that none of the moderators here could answer either of us or tell us that this was fixed by adding an extra quest."}, {"16": "It was changed with today's game restart"}, {"20": "\t\t\t54. Produce 10 Advanced Tools[BR]    Invest 25 Knowledge Points into any Ancient Wonder - 33\t\tClick to expand...I have a friend who just started playing a new city here in BETA, she is now in the middle of chapter 3. With the new research requirements and the first AW's showing up in chapter 4, this quest is a complete stop for her. As an alternative, why not \"Spend 25 Knowledge Points\" instead?[BR][BR]She's a veteran Elvenar player and knows her stuff with this game, and yet she's having a very difficult time in this event. Quests like \"Produce X CC's\" are impossible, no spire access, no magic academy. \"Gain X Spell Fragments\" is equally difficult, as she does not have much to disenchant (if she even can?). Relics without tournament now, because tournament has to be researched.[BR][BR]Even joining a fellowship has to be researched? Seriously? This is how you drive away new players. Make the game virtually impossible for them at the starting gate.[BR][BR]I am providing this feedback on her behalf as a witness. I have no options to give her."}, {"5": "@Ergolas77 in past events, the CMs of the forums have always told us to write to Support from in-game and if we are stuck on an impossible quest, they would complete it for us. That was a while back, though, so the current crew may just say \"tough luck\" and \"advance your city until you unlock what you need\"."}, {"2": "I mentioned this in the Discord feedback thread as well, @Ergolas77, I pointed out that we need to remind them in every event.  Or, move the AW researches back to where they were, as a couple of the mods pointed out."}, {"20": "Enevhar Aldarion said:@Ergolas77 in past events, the CMs of the forums have always told us to write to Support from in-game and if we are stuck on an impossible quest, they would complete it for us. That was a while back, though, so the current crew may just say \"tough luck\" and \"advance your city until you unlock what you need\".\t\tClick to expand...She did just that and was advanced in response by support. Nevertheless, I still think it should be EASIER for new cities not harder. I don't see what we are accomplishing by requiring research for these[BR]Magic Academy / CraftingFellowshipsTourneySpireTourney, Fellowships, MA stuff should all be accessible from the beginning. Spire at the beginning of chapter 3 worked fine for me."}]