[{"19": "Ergolas77 said:\t\t\tI have a friend who just started playing a new city here in BETA, she is now in the middle of chapter 3. With the new research requirements and the first AW's showing up in chapter 4, this quest is a complete stop for her. As an alternative, why not \"Spend 25 Knowledge Points\" instead?[BR]Click to expand...[BR]Exactly the same things I'm running into with a city I just started. Even the 'produce x-amounts of goods' are hard because pop is a major issue, as is keeping culture up. And with only a handful of relics the amount turned out by such small factories are so low you need a lot of productions to get to the required amount and just placing a few more factories is not an option, both space-wise and pop-wise.[BR][BR]The having to research the tech to join a FS was an absolute shock. It means all through chap 1 you have nothing in the way of help.[BR]For players who know the game it's not a big deal, but for new players it is horrible."}, {"19": "Dhurrin said:\t\t\tExactly the same things I'm running into with a city I just started. Even the 'produce x-amounts of goods' are hard because pop is a major issue, as is keeping culture up. And with only a handful of relics the amount turned out by such small factories are so low you need a lot of productions to get to the required amount and just placing a few more factories is not an option, both space-wise and pop-wise.[BR][BR]The having to research the tech to join a FS was an absolute shock. It means all through chap 1 you have nothing in the way of help.[BR]For players who know the game it's not a big deal, but for new players it is horrible.\t\tClick to expand...[BR]Just as an update; for 2 days now I have been techlocked. I still need to finish 5 more provinces for the next chapter. Except that with 5 lvl 7 T1 factories and 2 lvl 3 T2 factories it's hard to produce enough for that. As I am trying to play it straight I'm only posting 2-star trades so far, but I guess I will have to place 100-for-200 trades because it's not doable this way and at this pace I'd be techlocked for another 3-4 days or so, maybe longer. Which for someone not knowing the game would be a huge turnoff. [BR]Being techlocked in this stage is absolutely annoying as there is nowhere to spend the KPs for now, so the KP bar slowly fills up over 10, as each 1-2 encounters I can do a day add their 1-2 points, just sitting there.[BR]Heck, it is a turnoff for me and I know the game.[BR][BR]Fighting is absolutely out of the question; even manually fighting I am losing more troops in 2 encounters than I can replace in a day, partly because the short queues, meaning the barracks and traininggrounds are idle at times as I cannot constantly be online. And partly because the troops just are too weak and often get slaughtered before they have a chance to even move.[BR]Just unlocked the treants, but even those get their asses handed to them by orc-strategists, which absolutely kill any other units I have without much effort.[BR]Whoever redesigned this set-up really should try to bloody well play through the first few chapters a few times, without all those fancy dev-tools to make life easy, because the word 'horrible' doesn't even begin to describe it."}, {"5": "Dhurrin said:\t\t\tJust as an update; for 2 days now I have been techlocked. I still need to finish 5 more provinces for the next chapter. Except that with 5 lvl 7 T1 factories and 2 lvl 3 T2 factories it's hard to produce enough for that. As I am trying to play it straight I'm only posting 2-star trades so far, but I guess I will have to place 100-for-200 trades because it's not doable this way and at this pace I'd be techlocked for another 3-4 days or so, maybe longer. Which for someone not knowing the game would be a huge turnoff.[BR]Being techlocked in this stage is absolutely annoying as there is nowhere to spend the KPs for now, so the KP bar slowly fills up over 10, as each 1-2 encounters I can do a day add their 1-2 points, just sitting there.[BR]Heck, it is a turnoff for me and I know the game.[BR][BR]Fighting is absolutely out of the question; even manually fighting I am losing more troops in 2 encounters than I can replace in a day, partly because the short queues, meaning the barracks and traininggrounds are idle at times as I cannot constantly be online. And partly because the troops just are too weak and often get slaughtered before they have a chance to even move.[BR]Just unlocked the treants, but even those get their asses handed to them by orc-strategists, which absolutely kill any other units I have without much effort.[BR]Whoever redesigned this set-up really should try to bloody well play through the first few chapters a few times, without all those fancy dev-tools to make life easy, because the word 'horrible' doesn't even begin to describe it.\t\tClick to expand...[BR]When the new tach tree was introduced on Beta, I started a new city to see how it would play out. I got from the start of chapter 1 to the research for the Spire in chapter 5 in just under a month. I did not join a regular fellowship until unlocking the Spire, though I did make my own one-person fellowship in chapter 4, so I could solo the tournament and get some extra relics and stuff. I had plenty of spare time to spend on the city at the time, so I could log in every couple of hours to take care of everything."}, {"19": "Enevhar Aldarion said:\t\t\tWhen the new tach tree was introduced on Beta, I started a new city to see how it would play out. I got from the start of chapter 1 to the research for the Spire in chapter 5 in just under a month. I did not join a regular fellowship until unlocking the Spire, though I did make my own one-person fellowship in chapter 4, so I could solo the tournament and get some extra relics and stuff. I had plenty of spare time to spend on the city at the time, so I could log in every couple of hours to take care of everything.\t\tClick to expand...I however am rather limited in how often I can log on. So apart from the first day, I have been logging on just 3-4 times a day. And yes, I still think I can get to chap 5 in a month or so, but that is not the point.[BR][BR]I know I can do it and that things will get better at that point. So did you.[BR][BR]A new player has, unless coaxed by a friend or relative, no way of knowing that. And is unlikely to find a very active FS that will take beginning players. With both catering and fighting being extremely hard to do while at the same time being pushed by the quests to do so or get stuck it is an absolute turnoff and will see a lot of new players quit. Obviously so, one only has to take a look at the pages upon pages of abandoned small cities in the rankinglist on any world.[BR][BR]Any game should make sure that new players can be kept relatively busy so they will want to play on.[BR]I now still need to finish 2 more provinces before I can enter chapter 3; no troops left and no goods left, so that will be a couple of days, where the only thing is to reset stuff when I get online.[BR]That is NOT a way to encourage someone to keep playing."}, {"4": "Enevhar Aldarion said:\t\t\tWhen the new tach tree was introduced on Beta, I started a new city to see how it would play out. I got from the start of chapter 1 to the research for the Spire in chapter 5 in just under a month. I did not join a regular fellowship until unlocking the Spire, though I did make my own one-person fellowship in chapter 4, so I could solo the tournament and get some extra relics and stuff. I had plenty of spare time to spend on the city at the time, so I could log in every couple of hours to take care of everything.\t\tClick to expand...You are not a new player, so you know the ins and outs of the game. It also sounds like you were trying to see how fast you could get to the guest race chapters. It is definitely doable, but I don't think your experience is at all comparable to new players who do not know diddly squat about the game. It's even hard for them to get advice until they can join a fellowship, unless they know someone in the game or have a nice neighbor who offers to mentor them.[BR]Dhurrin said:\t\t\tAny game should make sure that new players can be kept relatively busy so they will want to play on.\t\tClick to expand...This is a key point that Inno seems to have ignored with the rework of the tech tree. Joining an FS should have been made a priority. It would also have been nice if there was a way to encourage established FS's to accept a lower ranked city into their ranks. However, I don't know how that could have been done.[BR][BR]In my opinion, everyone in the game should have a decent chance of completing events."}, {"19": "Yogi Dave said:\t\t\tIn my opinion, everyone in the game should have a decent chance of completing events.\t\tClick to expand...[BR]That I already gave up on. Buy 20 KPs? Whatever for, as there is nothing to spend them on until I get the next 2 provinces completed, which will give me yet more KPs. Not to mention that the cost may be low, but for a small, starting city, it quickly adds up,[BR]And the techs that will become unlocked do not require a lot of KPs yet, so even if I did buy them it only will lock me again right away. [BR][BR]So at least this current event I will basically ignore. That is not even including the fact that trying to make the matches is way too timeconsuming."}, {"4": "Yogi Dave said:\t\t\tIn my opinion, everyone in the game should have a decent chance of completing events.\t\tClick to expand...Dhurrin said:\t\t\tThat I already gave up on.\t\tClick to expand...I hope you didn't think I was saying you should be able to complete it. My meaning is Inno should make the events such that everyone has a decent chance of completing them.[BR][BR]The summer of '17 event, \"March of the Herds\", was horrible in making it impossible for newer players to complete. A lot of quest required you to \"donate\" goods. Assuming you could even make the required goods, the quantities were very high, and besides, you needed them for your city. If you couldn't make them due to not having opened the tech for that tier good, you had to find someone willing to trade a lot of goods to you. To me, that was the most unfair event - ever! At least the sugar beets were fairly easy to find around the city."}, {"5": "Yogi Dave said:\t\t\tThe summer of '17 event, \"March of the Herds\", was horrible in making it impossible for newer players to complete. A lot of quest required you to \"donate\" goods. Assuming you could even make the required goods, the quantities were very high, and besides, you needed them for your city. If you couldn't make them due to not having opened the tech for that tier good, you had to find someone willing to trade a lot of goods to you. To me, that was the most unfair event - ever! At least the sugar beets were fairly easy to find around the city.\t\tClick to expand...[BR]The qualifier for this is that back in the first few years of the game, in between the normal events were the 2-week long mini events. While the big events were never meant for early chapter players to complete, the mini events were simpler and easier for anyone to complete. I had only been playing for a couple of months when I was able to complete my first mini event, for Wonky Walter's, and I did it while in chapter 3. And completing here means completing all the quests, not completing whatever building set was offered in the big events, because in those early years, if you did not spend money and diamonds, you could not get all the special buildings."}, {"19": "Yogi Dave said:\t\t\tI hope you didn't think I was saying you should be able to complete it. My meaning is Inno should make the events such that everyone has a decent chance of completing them.\t\tClick to expand...Nope, I was agreeing with you that players SHOULD be able to complete an event. Actually, especially newer players since they are being denied so much else.[BR]I was just stating that the 'buy x-amount of KP' quests are in many ways even more of a horror to smaller players since though they technically may be able to do so, there just is no use for those KPs which means it is nothing but squandering already very scarce resources.[BR][BR]@Enevhar Aldarion [BR]Yes, those mini-events at least gave smaller players some chance too. Even some of the daily quests in the seasons I find hard to do.[BR]Though I must say I have not had an event yet, even all the way back, that I needed to pay for to complete. However, it does require one to be online regularly to collect the event-currency and also meant forgoing high chances on particular daily prizes by always picking the chest/orb/whatever that uses the lowest amount of currency per step. Which means lesser rewards there, very little extra event-currency, but for me basically always getting the end-prize/ 9 artifacts and more often than not a 2nd base for the evolving building if that is the end-prize."}, {"9": "Yogi Dave said:\t\t\tThe summer of '17 event, \"March of the Herds\", was horrible in making it impossible for newer players to complete. A lot of quest required you to \"donate\" goods. Assuming you could even make the required goods, the quantities were very high\t\tClick to expand...Yeah, i remember those quests, it was my first big event and i couldn't finish it since my T3 wasn't even researched yet."}, {"5": "Dhurrin said:\t\t\tYes, those mini-events at least gave smaller players some chance too. Even some of the daily quests in the seasons I find hard to do.[BR]Though I must say I have not had an event yet, even all the way back, that I needed to pay for to complete. However, it does require one to be online regularly to collect the event-currency and also meant forgoing high chances on particular daily prizes by always picking the chest/orb/whatever that uses the lowest amount of currency per step. Which means lesser rewards there, very little extra event-currency, but for me basically always getting the end-prize/ 9 artifacts and more often than not a 2nd base for the evolving building if that is the end-prize.\t\tClick to expand...[BR]I am talking about the events in the first few years of the game. You had three big grand prize buildings to win. The first one could be won by most people, the second could be won with a lot of work and time, but the third was virtually impossible to get by just playing the event. You had to spend money or diamonds for extra currency to have a chance at the third building. The first Winter event and the original March of the Herds, and so on."}, {"19": "Enevhar Aldarion said:\t\t\tI am talking about the events in the first few years of the game. You had three big grand prize buildings to win. The first one could be won by most people, the second could be won with a lot of work and time, but the third was virtually impossible to get by just playing the event. You had to spend money or diamonds for extra currency to have a chance at the third building. The first Winter event and the original March of the Herds, and so on.\t\tClick to expand...I am talking about exactly the same thing. There were no events when I started playing, Dwarves was the new chapter back then. And still I have no recollection of ever having had to pay to get to the main prize, but I know it was really hard to get there."}, {"2": "Dhurrin said:\t\t\tI am talking about exactly the same thing. There were no events when I started playing, Dwarves was the new chapter back then. And still I have no recollection of ever having had to pay to get to the main prize, but I know it was really hard to get there.\t\tClick to expand...It was possible to  get the third prize without paying diamonds, but it took an incredible run of good luck to win extra snowflakes. One of my girlfriends did it, but she was trying to win relics at the time."}, {"19": "With my new test city I just entered chap 3. This event is just a disaster for small cities. [BR][BR]Gain CC spells? haven't unlocked the crafting yet, so I can't make them. And hey, can't get into the Spire either. Great. And yes, I know, I can contact support, or wait a couple of days so I can unlock the crafting tech. Lovely options. [BR]Or opt to overscout even further, since BOTH the regular questline AND the event ask constantly for relics or encounters or scouting. And without access to the tourney, there is no way of gaining relics but to scout and I need them to cook CC-spells. No encounters to do but the ones on the map.[BR][BR]Gain or use 8 enchantments? Hello? any clue on how long it takes to cook enchantments in a lvl 3 MA? (which btw already means I spent diamonds on that). Not to mention the fact one already has pretty few relics to begin with? Use 8? Right now in this stage of the game these are valuable, rare, resources, not to be spent on a stupid quest. And without access to the tourney, not a lot of relics to use.[BR][BR]And then the 'buy x-KP' quests. Half the time I have nothing to spend them on anyway as I'm waiting on goods to unlock a tech. And gee, can't put them in AWs, as that does not get to be unlocked until chap 4. Not to mention the resources available are rather low anyway.[BR][BR]'Upgrade 2 buildings to lvl 5 or higher OR gain X-amount of Vision Vapor'. [BR]Well, there is pretty limited space to place extra buildings to just upgrade and sell them off. I can't upgrade the T3 factory beyond lvl 3 yet. the T1s and T2s and workshops are maxed for now and for the residences I need T3 goods. But since I haven't yet unlocked the boostertech for that, the yields are so low that will take a while. But VV? Haven't unlocked it yet and even if I do, there is no way to gain enough spellfragments except by disenchanting the few spells one has to do so, so that is out too.[BR][BR]I can go on. But from a beginners point of view, things like this absolutely are turn-offs. Anyone who doesn't know the game already is not exactly encouraged to keep playing this game this way.[BR][BR]But hey, since all this is going to Discord, I won't have to keep this city going. That at least is a blessing"}, {"21": "I just rearranged my Beta-City a little and initiated a \"Dwarven-District\". [smilie--sprite1][BR][BR]Now the light of the Solunar Nexus is shining through the Temple of Sun and Moon to iluminate the Gates of Dawn and the Gaming Lounge. [smilie--sprite2][BR][BR][IMG]https://i.ibb.co/9ZrFRBW/https-beta-forum-elvenar-com-index-php-attachments-1696207202143-png-11811.png[/IMG]"}]