[{"1": "Liebe Menschen und Elfen,[BR][BR]das Warten hat bald ein Ende und ein neues Kapitel wird in Elvenar aufgeschlagen. Und wir freuen uns auf euer Feedback zu eben diesem Kapitel: Kapitel 21 - Die vallorianische Legende.[BR][BR]Viele Grüße[BR]Euer Elvenar Team[BR]​"}, {"2": "...somit startet das neue Kapitel am letzten vollen Tag des aktuellen Events..."}, {"1": "Romilly schrieb:\t\t\t...somit startet das neue Kapitel am letzten vollen Tag des aktuellen Events...\t\tZum Vergrößern anklicken....Und das sagt uns jetzt was?"}, {"3": "Mir sagt es: juhuuuuh![BR]Ich freu mich schon."}, {"2": "Tacheless schrieb:\t\t\tUnd das sagt uns jetzt was?\t\tZum Vergrößern anklicken.......daß ich damit warte, die Hauptpreise einzusammeln...außerdem kommt dann noch ein wenig Unurium durch die Eventwährung rein..."}, {"4": "Tacheless schrieb:\t\t\tUnd das sagt uns jetzt was?\t\tZum Vergrößern anklicken....Wir sind es gewohnt, dass die Leitungen von Elvenar überlastet sind und das Spiel bei hohem Aufkommen immer abbricht, man nicht mehr reinkommt und ähnliches.[BR][BR]Wenn sichergestellt ist, dass alles läuft, wie gewünscht, dann ist das sicherlich kein Problem.[BR][BR]... Aber, das wäre das erste Mal. [BR][BR]Ich lass mich gerne positiv überraschen."}, {"5": "Immer positiv denken. Freut Euch doch einfach drauf.[BR]Ich bin auf jeden Fall voller Vorfreude und positiv gestimmt."}, {"2": "...meine Planung ist auch so ziemlich fertig... https://www.elvenarchitect.com/city/planner/350214d50ba1499ab97c2bd1ea6db5f2/"}, {"6": "@Romilly: hast du die hohe Anzahl der Gastrassengebäude wegen der Questreihe eingeplant?[BR]Bei Einsatz von Zeitsegen sollte man doch auch mit weniger auskommen, oder?"}, {"7": "Wisst ihr schon, wann es startet ?"}, {"2": "...ja - ich will die Quests schon alle spielen - ich muss auch gar nicht so viel weg räumen, um alles stellen zu können..."}, {"1": "Drachenstern schrieb:\t\t\tWisst ihr schon, wann es startet ?\t\tZum Vergrößern anklicken....Am 07.08. Die Uhrzeit werden wir vorab nicht bekannt geben."}, {"6": "Tacheless schrieb:\t\t\tDie Uhrzeit werden wir vorab nicht bekannt geben.\t\tZum Vergrößern anklicken....Naja, die üblichen Uhrzeiten sind 11 oder 12 Uhr. 'Ne Stunde mehr oder weniger ist aber auch egal, ist ja kein 5-Tage-Event.  [smilie--sprite2]"}, {"7": "Vielen lieben Dank"}, {"8": "Geilo! Endlich kommen die Drachen! [smilie--sprite1][BR][BR]HG, Kaserne, Werkies und Wohnungen geben Wohlstand.[BR]...bin bissl verblüfft, dass ich für die bald noch mehr belohnt werde...[BR]Die Gebäude, die ich bei Kapitelwechsel sowieso am schnellsten versuche zu leveln, brauche ich in Zukunft um forschen zu können.  Hmm?![BR][BR]Was die Innosier da wohl wieder vor haben?[BR][BR][BR][IMG]https://i.ibb.co/QJPz3D2/https-de-forum-elvenar-com-index-php-attachments-barracksupdatexxi-jpg-37953.jpg[/IMG][BR]AngelOfDead schrieb:\t\t\tErgo, weniger Truppen, aber höhere Kosten, denn die Steigerung ist in der Tat viel zu gering.\t\tZum Vergrößern anklicken....Genau deshalb hoffe ich, dass bald höhere Wunderstufen freigeschalten werden.[BR]Es sind ja jetzt alle erleuchteten Güter in Hülle&Fülle vorhanden.[BR]Sogar Sozialarbeit als neues Zerfallsgut gibts.[BR][BR]Als letztens alle erweckten Güter und Saat freigeschalten worden, durften Wunder von 31 bis Stufe35 gelevelt werden[BR]Analog sollten nun eigtl. die Stufen 36 bis 40 verfügbar werden. Vllt sogar mehr???[BR][BR]Wie lange werden wir diesbezüglich noch auf die Folter gespannt? @Moderatoren [smilie--sprite2][BR][BR]...damit könnten wir dann in aller Ruhe die überproportional gestiegenen Verluste wieder ausgleichen[BR][BR]Indianaking schrieb:\t\t\tFür den Bau sind für beide Wunder Fragmente, Kombinationskatalysatoren und Königliche Wiederherstellungszauber erforderlich. Jedes folgende Level benötigt 2000 weitere Zauberfragmente und 2 weitere Kombinationskatalysatoren. RR-Zauber sind dann nur noch in jedem 5. Level erforderlich und werden jedes Mal um 10 erhöht. Demnach müßte der Ausbau auf zB lv 20 bereits 50 RR kosten abgesehen von den Fragmenten Kombis , Relikten usw [smilie--sprite11]Zum Vergrößern anklicken....Auf jeden Fall heftige Kosten![BR]Kombis und Fraggies werden immer wertvoller... wer sich wohl noch über Fraggies im Turm beschwert? [smilie--sprite8][BR][BR]Eines der Wunder voll auf Stufe 35 zu leveln kostet echt fette 1,26 Mio Fraggies, 1260 Kombis und 280 Restaurationen!!![BR]Wow! Die Restaurationen brauchen wenigstens 14 Wochen durchgängig 19 Turnierkisten+OrakelMaxErnte! Aber wie krieg ich die Fraggies gespart??? Die werden echt ein Problem [smilie--sprite12][BR][BR]Jedenfalls denke ich, sinds die Wunder wert. Vor allem die Valloschule![BR]===> Mit ihr wird der Kessel sehr viel zuverlässiger... und 100% Wirkwahrscheinlichkeit sollte einem vor dem totalen Pech bewahren...[BR]Als Elf warte ich eh schon auf Free vallos... Aber als 3ten Effekt noch ne Akabeschleunigung? Krasse Show![BR]Bald können Händler viel entspannter ihre Hummelzauber verdienen... Sie müssen nicht mehr auf Teufel komm raus im Turnier Alles geben. Sie können auch ganz entspannt die nötigen Zauber in der Aka craften [smilie--sprite1][BR][BR]Tja und der Antiquitätenladen macht dann im Prinzip die erleuchteten Manus wieder völlig überflüssig...[BR]Zwar auch verdammt nützlich, doch in Anbetracht der Kosten, ist die Valloschule wichtiger![BR]Die werd ich als erstes versuchen zu leveln."}, {"9": "gergerw schrieb:\t\t\tGenau deshalb hoffe ich, dass bald höhere Wunderstufen freigeschalten werden.\t\tZum Vergrößern anklicken....Das wird so schnell nicht passieren, auch wenn es laut File Daten bereits bis 37 geht, so müsste man einiges ausbalancieren.[BR]gergerw schrieb:\t\t\tEines der Wunder voll auf Stufe 35 zu leveln kostet echt fette 1,26 Mio Fraggies, 1260 Kombis und 280 Restaurationen!!![BR]Wow! Die Restaurationen brauchen wenigstens 14 Wochen durchgängig 19 Turnierkisten+OrakelMaxErnte! Aber wie krieg ich die Fraggies gespart??? Die werden echt ein Problem [smilie--sprite12]Zum Vergrößern anklicken....Wenn du den Turm Regelmäßig spielst, alles wie Dschinns etc. mit einkalkulierst, geht es schneller. Denn auch hier darf man, wenn gewisse Sachen fehlen an Ressourcen, auf Dias ausweichen, sodass die erspielten Dias hier ebenfalls verbraten werden können. Von dem her, alles gut mit Hut.[BR]Deswegen ist die Steigerung der Rekrutierungsgebäude dennoch nicht optimal gelöst, denn die Steigerung ist einfach zu gering.[BR]Rechnet man nun die neue Erweiterungen und die neuen obligatorische Technologien dazu, wirst du unterm Strich weniger haben (derzeit)."}, {"10": "gergerw schrieb:\t\t\tGeilo! Endlich kommen die Drachen! [smilie--sprite1][BR][BR]HG, Kaserne, Werkies und Wohnungen geben Wohlstand.\t\tZum Vergrößern anklicken....Neben der Kaserne... geben Trainingsgelände und Söldnerlager auch Wohlstand?[BR][BR]Liebe Grüße"}, {"11": "Hurra Kapitel XXI wird bestimmt gut, entlich wieder Puzzlen ohne ende."}, {"2": "...kennt schon jemand die Lagerkapazitäten vom HG auf Stufe 47?...(bzw. die Mengen, die man dann mit einer 35er-Hummel kaufen kann?..."}, {"12": "220 Mio Münzen & 22 Mio Werkzeug lt. elvenarchitect. Das mit der Hummel versteh ich nicht."}]