[{"11": "Ayla Ayla schrieb:\t\t\t220 Mio Münzen & 22 Mio Werkzeug lt.elvenarchitect. Das mit der Hummel versteh ich nicht.\t\tZum Vergrößern anklicken....Bei meinen elvenarchitect geht das HG nur bis lv 45, kapitel XXI ist noch nicht drin"}, {"13": "Schnalle 04 schrieb:\t\t\tBei meinen elvenarchitect geht das HG nur bis lv 45, kapitel XXI ist noch nicht drin\t\tZum Vergrößern anklicken....@Schnalle 04 - moin, stell' mal auf 'BETA' um, dort ist es bereits eingepflegt > [ElvenArchitect-BETA] Main Hall - Humans"}, {"2": "Ayla Ayla schrieb:\t\t\tDas mit der Hummel versteh ich nicht\t\tZum Vergrößern anklicken.......damit hatte ich das hier gemeint: [IMG]https://i.ibb.co/jvn2Cw9/https-de-forum-elvenar-com-index-php-attachments-hummelpreise-png-38012.png[/IMG]...die Mengen, die man zukaufen kann, sind abhängig vom HG bzw. den Lagerkapazitäten - mit einem 200 Mio Goldlager kann ich 200 k Marmor einkaufen (Hummel auf mind. 30) - also müsste ich dann mit einer Kapazität von 220 Mio auch 220 k Marmor einkaufen können..."}, {"4": "Was macht denn der Newsletter? Ich habe keinen einzigen Effekt gesehen, auch kein Geschenk. Ich soll mich einloggen und dann, ja, was dann? Vor allem, wenn der Account irgendwie unter 10 rumdümpelt, ist es zwar eine Info, aber die hätte nicht über den Newletter kommen müssen.[BR][BR]Oder übersehen ich was?"}, {"14": "ist wohl für die, die zeitweilig aufgehört haben, um sie wieder ins Spiel zurückzulocken [smilie--sprite1][BR][BR][IMG]https://i.ibb.co/Km2xK5N/https-de-forum-elvenar-com-index-php-attachments-screenshot-965-png-38028.png[/IMG][BR][BR]ist tatsächlich etwas irritierend, wenn man in Kapitel 15 diese Nachricht bekommt [smilie--sprite2]"}, {"15": "Das Kapitel ist freigeschallt, auch wenn es noch keine Quests gibt.[BR][BR]PS: das mit den Quests ist hinfällig. Danke Tacheless"}, {"1": "Doch, die Quests sind auch schon da. Lehne einfach mal die alte Quest ab."}, {"12": "Wenn man den val. Siegelturm stehen hat, wird von den Steuern der Wohnhäuser Unurium ausgeschüttet.[BR]Wie ist das nun, wenn man Wohnhäuser von Steuer auf die neuen Dinge umstellt - gibt so ein Wohnhaus dann gar kein Unurium mehr ab ?"}, {"2": "Ayla Ayla schrieb:\t\t\tWenn man den val. Siegelturm stehen hat, wird von den Steuern der Wohnhäuser Unurium ausgeschüttet.[BR]Wie ist das nun, wenn man Wohnhäuser von Steuer auf die neuen Dinge umstellt - gibt so ein Wohnhaus dann gar kein Unurium mehr ab ?\t\tZum Vergrößern anklicken.......doch - 1 bei mir ^^...dafür wirkt der Kulturbonus auch auf die Sozialarbeit (also den hochschrauben - dann kannst du bald wieder auf Gold umstellen)...[BR][BR][IMG]https://i.ibb.co/37x2TSf/https-de-forum-elvenar-com-index-php-attachments-sozialunurium-png-38034.png[/IMG]"}, {"12": "Noch ein \"Unding\":[BR]Wenn man das HG ausbaut, ist die Obergrenze dann bei 300 Wohlstand[BR][IMG]https://i.ibb.co/hdXHN8w/https-de-forum-elvenar-com-index-php-attachments-1691436847738-png-38039.png[/IMG][BR][BR]Allerdings werden für das 1. Siedlungsgebäude 600 Wohlstand gefordert[BR][IMG]https://i.ibb.co/7GN7XSD/https-de-forum-elvenar-com-index-php-attachments-1691437031086-png-38041.png[/IMG][BR][BR]Ist das ein Schreibfehler, oder wie will man 600 haben, wenn max. 300 möglich sind ?[BR][BR]Dass im Wiki noch gar nichts steht hilft nicht gerade weiter..."}, {"2": "Ayla Ayla schrieb:\t\t\tNoch ein \"Unding\":[BR]Wenn man das HG ausbaut, ist die Obergrenze dann bei 300 Wohlstand[BR]Anhang 38039 ansehen[BR][BR]Allerdings werden für das 1. Siedlungsgebäude 600 Wohlstand gefordert[BR]Anhang 38041 ansehen[BR][BR]Ist das ein Schreibfehler, oder wie will man 600 haben, wenn max. 300 möglich sind ?[BR][BR]Dass im Wiki noch gar nichts steht hilft nicht gerade weiter...\t\tZum Vergrößern anklicken.......du bekommst mit dem Ausbau deines HG 300 Wohlstand - es gibt da keine \"Obergrenze\"[BR][BR]...ich hab bisher... [IMG]https://i.ibb.co/qrzkcR5/https-de-forum-elvenar-com-index-php-attachments-wohlstand-png-38046.png[/IMG]...300 vom HG - je 54 von 4 mag. Häusern und 120 aus ner mag. Werkstatt...das reicht, um die ersten paar Gebäude aufstellen zu können...[BR][BR]...die Sozialarbeit kannst du mit dem Kulturbonus aufbessern...[IMG]https://i.ibb.co/JcSrZnb/https-de-forum-elvenar-com-index-php-attachments-sozialarbeit2-png-38047.png[/IMG]...Bonus ist auf 764 %....man muss also nicht alle seine Wohnhäuser umstellen..."}, {"16": "Also anders gesagt Wohlstand ist wie Kultur - es wird also nicht \"Produziert\" und \"gelagert\" im Sinne von Gütern/Münzen, sondern gewisse Gebäude liefern Wohlstand, andere benötigen Wohlstand [smilie--sprite1]"}, {"8": "Deelfin schrieb:\t\t\tNeben der Kaserne... geben Trainingsgelände und Söldnerlager auch Wohlstand?[BR][BR]Liebe Grüße\t\tZum Vergrößern anklicken....Ja äh nein thx to Romilly [smilie--sprite2][BR][BR]Warum bekommt man eigtl. nicht auch durch Rüka Wohlstand??? [smilie--sprite6][BR][BR]AngelOfDead schrieb:\t\t\tWenn du den Turm Regelmäßig spielst, alles wie Dschinns etc. mit einkalkulierst, geht es schneller. Denn auch hier darf man, wenn gewisse Sachen fehlen an Ressourcen, auf Dias ausweichen, sodass die erspielten Dias hier ebenfalls verbraten werden können. Von dem her, alles gut mit Hut.\t\tZum Vergrößern anklicken....Ja gut, was königliche angeht...Möglicherweise kann mans in unter 14 Wochen schaffen...[BR]Allerdings gehör ich eher zur AkaRotierFraktion und hab sehr starken Fraggiemangel... 1 Mio davon zu beschaffen dauert Monate! Monate disziplinierten Sparens... [smilie--sprite10][BR]AngelOfDead schrieb:\t\t\tDeswegen ist die Steigerung der Rekrutierungsgebäude dennoch nicht optimal gelöst, denn die Steigerung ist einfach zu gering.[BR]Rechnet man nun die neue Erweiterungen und die neuen obligatorische Technologien dazu, wirst du unterm Strich weniger haben (derzeit).\t\tZum Vergrößern anklicken....AngelOfDead schrieb:\t\t\tDas wird so schnell nicht passieren, auch wenn es laut File Daten bereits bis 37 geht, so müsste man einiges ausbalancieren.\t\tZum Vergrößern anklicken....Na, das lässt doch hoffen![BR]Ich nehm auch erstmal 37 Wunderlevel [smilie--sprite1]"}, {"2": "gergerw schrieb:\t\t\tJa [smilie--sprite2]Zum Vergrößern anklicken.......nein - bekommt man nicht...da wird nichts angezeigt..."}, {"2": "...es gibt 4 verschiedene Opfergaben, die du für die Forschung brauchst - diese wirst du (vermutlich) dann ab Stufe 2 im Drachenturm herstellen können..."}, {"2": "...lol...[BR][BR][IMG]https://i.ibb.co/cN16Kt8/https-de-forum-elvenar-com-index-php-attachments-wohnhaus-png-38048.png[/IMG]...ich wollte eigentlich nur Unurium für die Forschung haben...[BR][BR][BR]Taurendis66 schrieb:\t\t\tStufe 3 hat 3 Produktionen\t\tZum Vergrößern anklicken.......was kann der dann auf Stufe2? [IMG]https://i.ibb.co/pydjsZr/https-de-forum-elvenar-com-index-php-attachments-drachenturm-png-38049.png[/IMG]...(freier Platz: 3)..."}, {"17": "Fühl mich bissle betrogen, es stand noch die letzte Quest vom Kessel aus, erforsche eine Technologie und die wurde jetzt einfach gelöscht. Was soll sowas?"}, {"2": "TravelerTheodor schrieb:\t\t\tWas ist das für eine doofe Quest im letzten Kapitel Produzieren einen besiegelten Friedensvertrag das wäre Wunderwachs und das ist keine Bonusproduktion von mir, muss ich das Gebäude jetzt erst aufstellen und bis 40 hochziehen damit ich die Quest erfüllen kann?\t\tZum Vergrößern anklicken.......dieses Gebäude solltest du eigentlich längst haben..."}, {"6": "9 Monate hat es für die neue Gastrasse gebraucht.[BR]Alles was in dieser Zeit im Wiki zu finden ist, ist ein nicht funktionierender Link zu den neuen Wundern![BR][BR]Wieder mal ganz großartig!"}, {"2": "ustoni schrieb:\t\t\t9 Monate hat es für die neue Gastrasse gebraucht\t\tZum Vergrößern anklicken.......es waren 11 - hust..."}]