[{"1": "Das internationale Wiki-Team hat unter erschwerten Bedingungen alle Infos zum neuen Kapitel zusammengetragen. Gestern haben dann die Sprachversionen alle benötigten Infos erhalten um das neue Kapitel in das Wiki einzupflegen.[BR]Es wird also noch den ein oder anderen Tag dauern, bis dort alles eingetragen ist und auch funktioniert. Wir bitten um Verständnis. Für die Verzögerung entschuldigen wir uns.[BR][BR]Wer meint, ist besser machen zu können, kann sich gerne für das Wiki Team bewerben. [smilie--sprite2]"}, {"6": "Romilly schrieb:\t\t\t...es waren 11 - hust...\t\tZum Vergrößern anklicken....Hast recht. Ich hatte vom Zeitpunkt meiner Erledigung von Kapitel 20 an gerechnet, was natürlich falsch ist. [smilie--sprite2]"}, {"18": "Weiß jemand, wo ich nachschauen kann, welche Ressourcen ich dann für die Produktion der diversen Gastgüter brauchen werde?"}, {"18": "Indianaking schrieb:\t\t\tDas Portal: produziert auf Stufe 1 nix, weil man ohnehin erst Ressourcen aus den GR Gebäuden braucht. Auf Stufe 2 dann 3 Sorten Opfergaben und das steigert sich. Durch den Ausbau erhöhen sich die zu produzierenden Mengen nicht.[BR]Vallorianische Werkstatt: warum diese Forschung vor der der Diabhals Werkstätten steht erschließt sich mir bis jetzt nicht, da ich die Sachen aus letzteren für die Produktionen der ersteren brauche. Wenn  man trotzdem erst nur mit den Vall. Werkstätten produzieren möchte (bis ich bei den Diabhals Werkst. bin)  muß man paar Dias springen lassen.[BR]Diabhals Werkstätten: liefern die Ressourcen für die Vall. Werkstätten, und produzieren - ganz wichtig- Orkkunst. Aber erst wenn man die hiesigen Produktionen in Prods. der Vall. Werkstätten steckt und diese Prods dann zurück in den Diabhals braucht um die Orkkunst zu produzieren.[BR]Insgesamt braucht man zum Bau und für die Forschung sowohl alle Opfergaben aus dem Portal, als auch Ressourcen aus beiden Werkstätten.[BR]Habe deshalb meine Planung nach Erscheinen auf beta auf je 12 GR Werkstätten gesetzt.[BR]Fazit: zu einfach, keine knifflige Sachen auf die man achten muß, nix großartig zu planen. Aufbauen und hin und her produzieren , dauert halt.[BR][BR]Edit: die Mengen erweckten und erleuchteten Güter halten sich im Rahmen. Meine ausgebaute Biene ist wieder sehr hilfreich [smilie--sprite6]Zum Vergrößern anklicken....Danke, also brauche ich jedenfalls erweckte UND erleuchtete Güter, das hilft ja schon einmal weiter. Mana und Saat auch, nehme ich einmal an."}, {"2": "Indianaking schrieb:\t\t\tDurch den Ausbau erhöhen sich die zu produzierenden Mengen nicht\t\tZum Vergrößern anklicken.......jein - ab diesem Kapitel steigen die produzierenden Mengen in Abhängigkeit vom Wohlstandsverbrauch - da der Grundverbrauch bei 600 liegt und der Ausbau des Portals 27 weiteren Wohlstand benötigt, könnte es (rein theoretisch) schon zu einer geringfügigen Steigerung kommen (außer der Grundwert liegt dann bei 627 - dann würde der übrige Verbrauch aber zu einer möglichen Senkung führen, was ich nicht annehme)...[BR][BR][IMG]https://i.ibb.co/3khSXfw/https-de-forum-elvenar-com-index-php-attachments-wohlstand3-png-38065.png[/IMG][BR][BR]...Fazit: je mehr Gebäude man aufstellt oder ausbaut - also, je mehr Wohlstand man verbraucht, desto höher sind die Produktionsmengen...[BR][BR]...um es hier nochmal zu zeigen - gestern hatte ich 41 [IMG]https://i.ibb.co/BsDC8ny/https-de-forum-elvenar-com-index-php-attachments-wohlstand5-png-38067.png[/IMG]...gefertigt - da ich aber mittlerweile weitere Gebäude gebaut habe (13 oder 18 mehr Wohlstand - weiß ich nicht genau), ist mein Bonus nun auf +2 gestiegen und ich produziere aktuell 42...[BR][IMG]https://i.ibb.co/pXy0wPB/https-de-forum-elvenar-com-index-php-attachments-wohlstand4-png-38066.png[/IMG][BR][BR]...der verfügbare Wohlstand deckelt somit gleichzeitig die Anzahl der Gastrassengebäude - will man mehr aufstellen, muss man auch mehr Gebäude besitzen, die Wohlstand zur Verfügung stellen (also z.B. die Kaserne oder Wohnhäuser - man kann nicht einfach alle einlagern, um Platz zu schaffen)..."}, {"18": "Ich danke euch, das ist schon super, das einmal zu wissen ... DANKE !"}, {"2": "..es ist halt nun einfach eine ganz andere Mechanik - diese wird aber auch für kommende Kapitel gelten, deshalb ist es nicht unwichtig, wie das genau funktioniert...[BR][BR]...also nur Portal und minimale Anzahl an Gebäuden bremst einen aus und beim Platzschaffen für mehr Siedlungsgebäude muss man ebenfalls aufpassen, was man wegräumt - das ist der Punkt..."}, {"19": "Das Kapitel 21 finde ich sehr schön  [smilie--sprite1] [BR][BR]Mit den gesammelten Wissenspunkten bin ich schon sehr weit im FB gekommen[BR]Da ich ein \"Sparschwein\" bin - und zig Zeitbooster im Lager habe - habe ich davon [BR]auch ein paar eingesetzt [BR]Den Hexenkessel heute starten und versuchen die Gastrassenproduktionen zu steigern -[BR]dann lohnen sich die Zeitbooster noch mehr [BR]Die Güter für den FB stehen dann schon mal zur Verfügung - jetzt fehlen noch die Wps [BR][BR]Heute Turnierstart - Lebenspunkteverbesserer etc. sind noch aktiv- also wird da etwas mehr Gas gegeben[BR][BR]Das wird schon werden [smilie--sprite6]"}, {"11": "Romilly schrieb:\t\t\t..es ist halt nun einfach eine ganz andere Mechanik - diese wird aber auch für kommende Kapitel gelten, deshalb ist es nicht unwichtig, wie das genau funktioniert...[BR][BR]...also nur Portal und minimale Anzahl an Gebäuden bremst einen aus und beim Platzschaffen für mehr Siedlungsgebäude muss man ebenfalls aufpassen, was man wegräumt - das ist der Punkt...\t\tZum Vergrößern anklicken....Romilly         Beiträge                                    10.906            Ändere dein Zitat, oder hör auf alle 2 minuten was zu Schreiben,[BR]und lass andere auch mal zu (Wort) Schrift kommen^^"}, {"20": "Nicht nur das der val. Sigelturm abgewertet wurde, auch der Wirbel zeigt keine Auswirkung mehr auf die Portalkapazität. Ist das so gewollt oder ein Fehler?"}, {"2": "...leider hab ich nicht mit nem kritischen getroffen, aber der erhaltene Kesseleffekt ist so auch ganz nett...[BR][BR][IMG]https://i.ibb.co/D5Gv37t/https-de-forum-elvenar-com-index-php-attachments-portalsuppe-png-38095.png[/IMG][IMG]https://i.ibb.co/VCt6nm3/https-de-forum-elvenar-com-index-php-attachments-portalsuppe2-png-38096.png[/IMG][BR][IMG]https://i.ibb.co/qRdgP3J/https-de-forum-elvenar-com-index-php-attachments-portalsuppe3-png-38097.png[/IMG]...ist wie ne 2. Hummel (es hätten auch 57,3 % für 62 Stunden sein können - vielleicht nächste Woche, wenn mehr Gebäude stehen)..."}, {"6": "FCL001 schrieb:\t\t\tder Wirbel zeigt keine Auswirkung mehr auf die Portalkapazität. Ist das so gewollt oder ein Fehler?\t\tZum Vergrößern anklicken....Ich halte das für einen Fehler. Der Wirbel sollte sich immer auf das mengenbegrenzte Gut im Portal auswirken.[BR][BR]Man muss dabei aber bedenken, dass Kapitel 21 sehr überhastet entwickelt wurde. Da kann so ein Flüchtigkeitsfehler schon mal passieren. [smilie--sprite2][smilie--sprite1]"}, {"20": "ustoni schrieb:\t\t\tIch halte das für einen Fehler. Der Wirbel sollte sich immer auf das mengenbegrenzte Gut im Portal auswirken.[BR][BR]Man muss dabei aber bedenken, dass Kapitel 21 sehr überhastet entwickelt wurde. Da kann so ein Flüchtigkeitsfehler schon mal passieren. [smilie--sprite2][smilie--sprite1]Zum Vergrößern anklicken....also werde ich wohl Fehlermeldung aufmachen"}, {"3": "​ustoni schrieb:\t\t\t9 Monate hat es für die neue Gastrasse gebraucht.\t\tZum Vergrößern anklicken....[BR]Romilly schrieb:\t\t\t...es waren 11 - hust...\t\tZum Vergrößern anklicken....Wunderbar! Kann ich mir aller Wahrscheinlichkeit nach richtig viel Zeit lassen mit diesem Kapitel![BR][BR]Der Anfang ist ja schon mal ganz vielversprechend mit all den Neuerungen. Bin mal gespannt.[BR]Die Gebäude sehen jedenfalls sehr schön aus."}, {"2": "Fayence schrieb:\t\t\tDie Gebäude sehen jedenfalls sehr schön aus.\t\tZum Vergrößern anklicken.......ja - und der Drachenturm wird riesig (= sehr hoch)... [smilie--sprite1]"}, {"2": "...das Wiki wird wohl gerade umgebaut - es sind aber nun schon ein paar Infos zu Kapitel 21 vorhanden - https://de.wiki.elvenar.com/index.php?title=Die_vallorianische_Legende[BR][BR]...die Ausbaukosten der neuen Wunder sind echt übel... https://de.wiki.elvenar.com/index.php?title=Antike_Wunder_der_Die_vallorianische_Legende"}, {"3": "Oha, dann werden sie wohl erstmal nur zur Deko aufgestellt  [smilie--sprite10] [BR][BR]Das Hauptgebäude der Menschen ist auch ganz schön hoch --- schick!"}, {"8": "FCL001 schrieb:\t\t\tNicht nur das der val. Sigelturm abgewertet wurde,\t\tZum Vergrößern anklicken....Ja auch auf Beta wurde das gesagt.[BR][BR]Allerdings hab ich mir mal die Forschungen genauer angesehen.[BR][BR]Das höchste was an Sozialarbeit verlangt wird:[BR][IMG]https://i.ibb.co/7Kwk9Bp/https-de-forum-elvenar-com-index-php-attachments-teuersteforschungsozialarbeit-sozialarbeitwohnung-j.jpg[/IMG][BR][BR]...= 3 Tagesernten meiner Häuschen. Bin absolut underwhelmed![BR][BR]Weil man die ja ernten kann, wann man will und auch nur 10% Zerfall pro Tag anfallen komm ich mit wohl 2 Häusern auf Sozialarbeit ganz entspannt durchs Kapitel. Bei allen anderen Forschungen wird ja deutlich weniger verlangt.[BR]===>Das heißt 8 von den 10 Häusern (für die quests) können Münzileins und Unurium herstellen[BR]===>[BR]Also mein Siegelturm ist immer noch das mächtigste der beiden Unuriumwunder [smilie--sprite6][BR][BR]P.S.: Den Siedlungsverbrauch kann ich noch nicht abschätzen. Vermutlich wird der aber auch erstmal nicht stören. schlimmstenfalls würde ich 5 Häuschen Sozialarbeit machen lassen... Die allergrößte Münzquelle bleibt eh unangefochten der Abgrund!"}, {"19": "Kapitel 21 [BR]Sehr schönes und einfaches Kapitel ![BR][BR]Finde ich super gut [smilie--sprite1] [BR][BR]Läuft alles prima  [smilie--sprite6]"}, {"21": "gergerw schrieb:\t\t\tJa auch auf Beta wurde das gesagt.[BR][BR]Allerdings hab ich mir mal die Forschungen genauer angesehen.[BR][BR]Das höchste was an Sozialarbeit verlangt wird:[BR]Anhang 38125 ansehen[BR][BR]...= 4 Tagesernten meiner Häuschen. Bin absolut underwhelmed![BR][BR]Weil man die ja ernten kann, wann man will und auch nur 10% Zerfall pro Tag anfallen komm ich mit wohl 2 Häusern auf Sozialarbeit ganz entspannt durchs Kapitel. Bei allen anderen Forschungen wird ja deutlich weniger verlangt.[BR]===>Das heißt 8 von den 10 Häusern (für die quests) können Münzileins und Unurium herstellen[BR]===>[BR]Also mein Siegelturm ist immer noch das mächtigste der beiden Unuriumwunder [smilie--sprite6][BR][BR]P.S.: Den Siedlungsverbrauch kann ich noch nicht abschätzen. Vermutlich wird der aber auch erstmal nicht stören. schlimmstenfalls würde ich 5 Häuschen Sozialarbeit machen lassen... Die allergrößte Münzquelle bleibt eh unangefochten der Abgrund!\t\tZum Vergrößern anklicken....Die meiste Sozialarbeit braucht man beim Bauen. Bei 24 Siedlungsgebäuden + Portal + 20 % Baumeister komme ich mit 19 mag. Wohnhäusern bei 24/7 Ernte seit Start gerade so hin."}]