[{"22": "[IMG]https://i.ibb.co/v1kcXk0/https-de-forum-elvenar-com-index-php-attachments-batmankapitel21-480-jpg-38130.jpg[/IMG][BR][BR]Ich kann ja noch nicht mitreden. Ist für mich noch ein ziemlicher Weg bis dahin.[BR]Aber ginge es nicht weiter, würde es ja irgendwann langweilig [smilie--sprite7][BR][BR]Hört sich aber erfrischend an, dass es nicht so schwer sein soll.[BR][BR]Also... viel Erfolg [smilie--sprite8][BR][BR]lg.[BR]Leo"}, {"8": "Indianaking schrieb:\t\t\tDie meiste Sozialarbeit braucht man beim Bauen. Bei 24 Siedlungsgebäuden + Portal + 20 % Baumeister komme ich mit 19 mag. Wohnhäusern bei 24/7 Ernte seit Start gerade so hin.\t\tZum Vergrößern anklicken....Ja gut, du gibst wahrscheinlich Gas.[BR][BR]Meinereiner will das erstmal letzte Kapitel in aller Ruhe auskosten [smilie--sprite2][BR][BR]Wenn ich mir die Kosten so angucke...[BR][IMG]https://i.ibb.co/vqdyb2W/https-de-forum-elvenar-com-index-php-attachments-kostensozialarbeitbau-jpg-38145.jpg[/IMG][BR]und mal so tue, als könnte ich die sofort ausbauen...[BR]Beide brauchen für Maximalausbau 72 Stunden Bauzeit...[BR]4 Stck bau ich gleichzeitig... mein 5ter Baumeister hat immer mit Wundern zu tun[BR][BR]Dann brauch ich ca. 947 Sozialarbeit pro Tag zusätzlich.[BR][BR]Ok, sagen wir einfach, ich lass 3 Häuser auf Sozialarbeit und alles roger [smilie--sprite6][BR][BR]Übrigens:[BR]Ich dachte ja, mit der Wohlstandsmechanik wird Schlitzohren wie mir, die gerne mal Wohnungen wegbeamen um Siedlungsplatz freizuschaufeln, ein Riegel vorgeschoben...[BR][BR]Habs heut probiert...[BR]-80k Bev[BR]Wohlstand unverändert[BR][BR]Find ich gut [smilie--sprite1][BR][BR]Wird das so bleiben????"}, {"20": "gergerw schrieb:\t\t\tJa gut, du gibst wahrscheinlich Gas.[BR][BR]Meinereiner will das erstmal letzte Kapitel in aller Ruhe auskosten [smilie--sprite2][BR][BR]Wenn ich mir die Kosten so angucke...[BR]Anhang 38145 ansehen[BR]und mal so tue, als könnte ich die sofort ausbauen...[BR]Beide brauchen für Maximalausbau 72 Stunden Bauzeit...[BR]4 Stck bau ich gleichzeitig... mein 5ter Baumeister hat immer mit Wundern zu tun[BR][BR]Dann brauch ich ca. 947 Sozialarbeit pro Tag zusätzlich.[BR][BR]Ok, sagen wir einfach, ich lass 3 Häuser auf Sozialarbeit und alles roger [smilie--sprite6][BR][BR]Übrigens:[BR]Ich dachte ja, mit der Wohlstandsmechanik wird Schlitzohren wie mir, die gerne mal Wohnungen wegbeamen um Siedlungsplatz freizuschaufeln, ein Riegel vorgeschoben...[BR][BR]Habs heut probiert...[BR]-80k Bev[BR]Wohlstand unverändert[BR][BR]Find ich gut [smilie--sprite1][BR][BR]Wird das so bleiben????\t\tZum Vergrößern anklicken....Du brauchst schon auch Sozialarbeit zum produzieren der Gastrassengüter, also etwas mehr als Du denkst"}, {"12": "Seh ich das richtig? 2 Std. Produktionszeit - ist ja fast so arg wie bei den Händlern damals. Ich nehme an, da gibt es keine Slots wie in der Kaserne. Nicht gerade freundlich gegenüber der arbeitenden Bevölkerung."}, {"9": "Ayla Ayla schrieb:\t\t\tSeh ich das richtig? 2 Std. Produktionszeit - ist ja fast so arg wie bei den Händlern damals. Ich nehme an, da gibt es keine Slots wie in der Kaserne. Nicht gerade freundlich gegenüber der arbeitenden Bevölkerung.\t\tZum Vergrößern anklicken....Die 2 Std. machst du, wenn du Zeit hast und gelegentlich mal boostern mit Zeitis. [BR]Über Nacht und wenn du schaffen gehst/bist, setzt du dann die Orkische Kunst an, denn die dauert dann 12 Std. und hiervon brauchst du reichlich."}, {"8": "FCL001 schrieb:\t\t\tDu brauchst schon auch Sozialarbeit zum produzieren der Gastrassengüter, also etwas mehr als Du denkst\t\tZum Vergrößern anklicken....Wegen Geringfügigkeit vernachlässige ich die [smilie--sprite2][BR][BR]9 Vallowerkies mit 3 mal 4h Prods + Opfergabe des Drachenturms... = nicht mal ein halbes Haus an Sozialarbeit...[BR][BR]Wenn mein Bürgermeister mehr als 3 Häuser zur Sozialarbeit zwingt, wird er zum Latrinenputzen verdonnert![BR]Beim 2ten Mal dann der Strick [smilie--sprite6]"}, {"2": "...haha - ich wußte doch schon immer, daß die ganzen Klos im Spiel für die Orks gedacht sind...[BR][BR][IMG]https://i.ibb.co/MCc7Lpv/https-de-forum-elvenar-com-index-php-attachments-klo-png-38213.png[/IMG]"}, {"11": "Romilly schrieb:\t\t\t...haha - ich wußte doch schon immer, daß die ganzen Klos im Spiel für die Orks gedacht sind...[BR][BR]Anhang 38213 ansehenZum Vergrößern anklicken....Wer schreibt dir den immer eine PN??, du schreibst ja alle 5 minuten was [smilie--sprite1][BR][BR]Es wäre schön wenn man die Wohlständigen Wohnhäuser und Werkstätten nicht forschen müßte, Ich habe nur Magische.[BR]So werden die, die ja viel ausgeben doppelt bestraft."}, {"23": "Schnalle 04 schrieb:\t\t\tEs wäre schön wenn man die Wohlständigen Wohnhäuser und Werkstätten nicht forschen müßte, Ich habe nur Magische.[BR]So werden die, die ja viel ausgeben doppelt bestraft.\t\tZum Vergrößern anklicken....Zum Vergrößern anklicken....wieso doppelt bestraft??[BR]eben nur einmal bevorzugt mit den Magischen...[BR]ohne die Forschung wäre es ja wohl eher zweifach belohnt [smilie--sprite2]"}, {"24": "Bisher wirkt das Kapitel relativ gut strukturiert, aber durchschnittlich. Die Story mag ich gar nicht - Ich bin aber generell kein Fan von Orks und das Gewimmere meiner Leute ist nicht grade immersiv.[BR][BR]Dafür lässt es sich abgesehen vom für mich sehr überbordenden Orkbedarf recht locker spielen. Hätte schlechter sein können, merklich... Aber irgendwie hatte ich auf einen neuen Motivationskitzel gehofft.^^°"}, {"25": "Hallo, in der Questreihe zum Kapitel 21 wird unter anderem eine Pilzvilla gebraucht zum produzieren, wo finde ich die ? Danke für eure Hilfe..."}, {"2": "whighlander schrieb:\t\t\tHallo, in der Questreihe zum Kapitel 21 wird unter anderem eine Pilzvilla gebraucht zum produzieren, wo finde ich die ? Danke für eure Hilfe...\t\tZum Vergrößern anklicken.......was soll das für eine Quest sein? - bitte mach mal einen Screenshot..."}, {"25": "76Research City Expansion 59 + Produce 1 Mushroom Mansion3 10% \t\t\t\t\t\t\t\t\t\t\t\t\t[IMG]https://i.ibb.co/Zxz4MZP/https-image-ibb-co-c8e7-FL-supply-windfall-png.png[/IMG]"}, {"25": "Laut Idavis...."}, {"1": "Dabei handelt es sich um die Produktion Pilzpalast die man in der Magiestaubmanufaktur der Goblins herstellen kann."}, {"14": "der Pilzpalast ist in der tollen Liste von Cruller aufgeführt:[BR][BR]https://de.forum.elvenar.com/index.php?threads/namen-der-güter-produktionen.27286/post-453473"}, {"25": "Aha, vielen Dank für die Hilfe..."}, {"25": "Tacheless schrieb:\t\t\tDabei handelt es sich um die Produktion Pilzpalast die man in der Magiestaubmanufaktur der Goblins herstellen kann.\t\tZum Vergrößern anklicken....Aha, vielen Dank für die schnelle Hilfe@ Tacheles"}, {"26": "Naja eine grosse herausforderung scheint kapitel 21 nicht zu sein. Da schon einer fertig ist [smilie--sprite2]"}, {"1": "@Baloothebear Ja, aber vermutlich nicht auf dem Weg, den die meisten Spieler gehen. [smilie--sprite1]"}]