[{"2": "...schon wieder...  [smilie--sprite7][smilie--sprite7][smilie--sprite7]...[BR][BR][IMG]https://i.ibb.co/GFhQPHR/https-de-forum-elvenar-com-index-php-attachments-klo2-png-38291.png[/IMG]....bitteschön...[IMG]https://i.ibb.co/ysxjNcw/https-de-forum-elvenar-com-index-php-attachments-29-png-38292.png[/IMG][IMG]https://i.ibb.co/DD6twM4/https-de-forum-elvenar-com-index-php-attachments-30-png-38293.png[/IMG]"}, {"27": "Hallo, eine Frage, braucht man noch mehr Vollowerkies als die 9 Stück????? [smilie--sprite3]"}, {"2": "Robin7 schrieb:\t\t\tHallo, eine Frage, braucht man noch mehr Vollowerkies als die 9 Stück????? [smilie--sprite3]Zum Vergrößern anklicken....[BR]...laut den Quests nicht... https://idavis-elvenar.com/guestRaces/vallorianlegend.html#quests"}, {"27": "Hallo Romilly, Danke, werde die kurz aufbauen und die 3 dann ins Lager schicken. [smilie--sprite1]"}, {"2": "Robin7 schrieb:\t\t\tHallo Romilly, Danke, werde die kurz aufbauen und die 3 dann ins Lager schicken. [smilie--sprite1]Zum Vergrößern anklicken.......je mehr du auf- und ausgebaut hast, desto höher ist deine Produktion, da das nun vom benötigten Wohlstand abhängt und die Siedlungsgebäude Wohlstand brauchen..."}, {"6": "Auch positiv an Kapitel 21: wieder 2 Wunder die man nicht aufstellen muss.[BR]Zwar hört sich eine Verkürzung der Produktionszeit in der Aka erstmal gut an, vergleicht man aber die Kosten mit dem Nutzen stellt man schnell fest, dass man Jahre bräuchte um die Investition wieder heraus zu holen.[BR]Deshalb: gut so, Platz gespart. [smilie--sprite1]"}, {"27": "Sicher, zur Zeit sind bei mir 4 Häuser auf Sozialarbeit eingestellt und jetzt sind schon 2710 fertig, die ich noch nicht brauche und es wird immer mehr."}, {"2": "Robin7 schrieb:\t\t\tSicher, zur Zeit sind bei mir 4 Häuser auf Sozialarbeit eingestellt und jetzt sind schon 2710 fertig, die ich noch nicht brauche und es wird immer mehr.\t\tZum Vergrößern anklicken.......nein - Wohlstand (die rosa Perlen) - nicht Sozialarbeit[BR][BR]...siehe hier...[BR]Romilly schrieb:\t\t\t...jein - ab diesem Kapitel steigen die produzierenden Mengen in Abhängigkeit vom Wohlstandsverbrauch - da der Grundverbrauch bei 600 liegt und der Ausbau des Portals 27 weiteren Wohlstand benötigt, könnte es (rein theoretisch) schon zu einer geringfügigen Steigerung kommen (außer der Grundwert liegt dann bei 627 - dann würde der übrige Verbrauch aber zu einer möglichen Senkung führen, was ich nicht annehme)...[BR][BR]Anhang 38065 ansehen[BR][BR]...Fazit: je mehr Gebäude man aufstellt oder ausbaut - also, je mehr Wohlstand man verbraucht, desto höher sind die Produktionsmengen...[BR][BR]...um es hier nochmal zu zeigen - gestern hatte ich 41 Anhang 38067 ansehen...gefertigt - da ich aber mittlerweile weitere Gebäude gebaut habe (13 oder 18 mehr Wohlstand - weiß ich nicht genau), ist mein Bonus nun auf +2 gestiegen und ich produziere aktuell 42...[BR]Anhang 38066 ansehen[BR][BR]...der verfügbare Wohlstand deckelt somit gleichzeitig die Anzahl der Gastrassengebäude - will man mehr aufstellen, muss man auch mehr Gebäude besitzen, die Wohlstand zur Verfügung stellen (also z.B. die Kaserne oder Wohnhäuser - man kann nicht einfach alle einlagern, um Platz zu schaffen)...\t\tZum Vergrößern anklicken....[BR]...mein Wohlstands-Bonus ist mittlerweile gut angestiegen...[IMG]https://i.ibb.co/GJkCBGJ/https-de-forum-elvenar-com-index-php-attachments-wohlstand-png-38309.png[/IMG][IMG]https://i.ibb.co/9qvCS7r/https-de-forum-elvenar-com-index-php-attachments-wohlstand2-png-38310.png[/IMG]"}, {"12": "Ich habe 2 Vallorianische Werkstätten mit dem Teleporter-Zauber eingelagert. Nun tauchen die aber im Invertar nirgens auf. Wurden die woanders hin teleportiert oder sind die gänzlich verschwunden (wie beim Verkauf) ?"}, {"6": "Du findest sie ganz hinten im Inventar, unmittelbar vor eingelagerten Manufakturen."}, {"12": "Danke, brauchte wohl einen \"refresh\""}, {"27": "Hallö Romilly, Danke  für die Nachricht, so wie ich dies zur Zeit spiele ist  es für mich ok, komme sehr gut weiter und in der Forschung schon weit genug.   [smilie--sprite1]"}, {"8": "Die Geschichte... eine Ork-Romanze find ich ja mal niedlich! [smilie--sprite1][BR]Volles Verständnis... So ne Ork-Dame die stolz und ehrfurchtgebietend einen Drachen reitet ist schon ziemlich sexy![BR][BR]weiter so![BR][BR]Sowas ist auf jeden Fall ausbaureif! [smilie--sprite2][BR]...Bitte mehr Interaktionsmöglichkeiten für den Spieler bei sowas in Zukunft..."}, {"2": "...Strike!...[BR][BR][IMG]https://i.ibb.co/T4kR8XH/https-de-forum-elvenar-com-index-php-attachments-portaleffekt2-png-38572.png[/IMG]..[IMG]https://i.ibb.co/t3DX2sX/https-de-forum-elvenar-com-index-php-attachments-portaleffekt3-png-38573.png[/IMG]"}, {"28": "Romilly schrieb:\t\t\tStrike!\t\tZum Vergrößern anklicken....Das kann sich wohl mal sehen lassen! [smilie--sprite2][BR][BR]Kurze OT-Zwischenfrage @Romilly Auf welcher Stufe ist denn dein \"Geschenk der Hohen Wesen-Trankeffekt?[BR][BR]Anhand des Screenshots kann man dies ja aufgrund des Anzeigefehlers leider nicht erkennen - da steht ja immer nur eine 1 am Stern, völlig unabhängig von der Stufe"}, {"2": "Thebigunknown schrieb:\t\t\tDas kann sich wohl mal sehen lassen! [smilie--sprite2][BR][BR]Kurze OT-Zwischenfrage @Romilly Auf welcher Stufe ist denn dein \"Geschenk der Hohen Wesen-Trankeffekt?[BR][BR]Anhand des Screenshots kann man dies ja aufgrund des Anzeigefehlers leider nicht erkennen - da steht ja immer nur eine 1 am Stern, völlig unabhängig von der Stufe\t\tZum Vergrößern anklicken.......der ist auf Stufe 75 und dann natürlich mit Fragmenten/Dias aufgewertet auf 50 % Kritsche Wahrscheinlichkeit (war auch ein Kritischer) - daher auch die lange Laufzeit...[BR][BR]...hier die normalen Werte...[IMG]https://i.ibb.co/8mLZPxg/https-de-forum-elvenar-com-index-php-attachments-portaleffekt4-png-38598.png[/IMG]...im Portal transportiere ich jetzt auch jeweils 6 Opfergaben mehr (25 anstatt 19)"}, {"29": "Was ich bis jetzt sagen kann, das neue Kapitel scheint gut gelungen zu sein. Noch ist es nicht langweilig, die Größe der Gastrassenhäuser ist angemessen, es bleibt noch Platz. Die Verweilzeit der Gastrasse wird wohl doppelt so lang sein, wie bei Kapitel 20, weswegen genügend Zeit sein sollte, die Stadt nach und nach auf Vordermann zu bringen. Beschleunigen lassen sich die Neuen nur sehr schwer. Es sieht auch deshalb alles nach einem gemütlichen Spaziergang aus. Aber ich bin ja noch ganz am Anfang, ..."}, {"9": "Feedback:[BR][BR]Ich bin zwar schon seit 1 Woche fertig, aber trage das mal nach... .. .. ..[BR][BR]Positiv: [BR]Generell sehr Spielerfreundlich gestaltetStoryline gut spielbar (machbar)Questline folglich gut getroffenStoryline-Preise/Gewinne sind ok, darf aber gern auch mal wieder mehr seinStoryline an sich, eine sehr lustige Geschichte (ausgefallen, aber sehr gut)Die Größe ist ok (Flächenbedarf)Produktionszeiten gut getroffen (man kann auch viel mit 1, 2 Std.-Zeit-Boostern hantieren)Die Grafik sowie das Design ist gut, jedoch Geschmacksache[BR](Drachen-Fans, kommen hier voll auf ihre Kosten)Die Ideen/Gestaltung die einem als Spieler/in ins Auge fallen sind wirklich einzigartig (weiter so)Negativ (was \"mir\" nicht so gefiel):[BR]Die Grenze im Bezug auf Mana, Unurium wird eindeutig überschritten[BR](auch im Bezug, späterer Ausbauten/Kapitelbezogen)Besonders zum Schluss hin, wird Unurium knappDas Umschalten der Häuser auf Sozialarbeit[BR](Es sollte möglich sein, mit nur einen klick zu bestimmen, wie viele Häuser Sozialarbeit verrichten sollen. Das einzelne angeklicke kann doch sehr nervig sein.)Die neuen Antiken Wunder sind sehr Kostspielig und es hat den \"Anschein\" als wären diese nur für Payer da[BR](Spielerbezogene Meinung)Das doppelte anzeigen der Storyline[BR](Zum einem im Aufgabenfenster selbst und nebenbei noch zuvor als Extra-Einblendung in Form des Sprechers mit dem Fabelwesen/unten links)Aufgaben welche sich darauf beziehen, sein \"Nicht-Bonus-Gut\" herzustellen[BR](Auch wenn es gerade zur Storyline passt, so verhindert es ein weiterkommen, bzw. wird man ausgebremst und man hat so gut wie keinen Nutzen davon / Spielerbezogene Meinung)Aufgaben, welche 2 Tage und mehr andauern[BR](Z.B. eine Horde Orks züchten etc. / ohne Spoiler der Storyline eine enorme Bremse)Zum Schluss des Forschungsbaums sehr unausgewogen, da man das eine Gast-Rassen-Gut bereits in Massen hat, auf das andere jedoch noch warten mussWP-Anspruch im Forschungsbaum zu gering[BR](Da man mitunter die Forschung bereits mit WPs gefüllt hat, aber das Gast-Rassen-Gut noch nicht zusammen hat / Spielerbezogene Meinung und bereits bei den letzten Gast-Rassen erwähnt - Bitte anpassen, denn Turniere spielt man auch nicht mehr wie noch vor 5 Jahren)Die 88 Aufgaben in der Storyline sind für das erscheinen einer Gast-Rasse (auf den Zeitraum/Abstände gesehen) zu wenig (dürfen gern mehr sein)Selbst wenn man XXX Portal-Segen hat oder auch nicht, man braucht sie nicht wirklich und wenn dann ist der Mengenbedarf sehr gering[BR](Also doch lieber Fragmente daraus machen)Allgemein eine sehr gelungene Gast-Rasse und so gut wie Perfekt. Generell ist das \"nur meine\" Spielermeinung. Es mag durchaus Spieler/in geben, welche das ein oder andere anders sehen/beurteilen.[BR][BR]Der Negativ-Teil spiegelt also nur \"meine persönliche Meinung\" wieder und ist nicht unbedingt/zwingend als negativ anzusehen, es dient auch der Überlegung, dass ein oder andere eventuell zu verbessern.[BR][BR]Ich fand die Gast-Rasse nicht gerade herausfordernd oder generell schwer. Aufgrund der langen Wartezeit (auf diese Gast-Rasse) hat sich vieles angesammelt im Inventar und konnte hervorragend genutzt werden, sodass ein schönes Spielen möglich war.[BR][BR]Ein großes Plus war diesmal die wirklich gelungene Story, zwischenzeitlich konnte ich mir ein lautes lachen nicht verkneifen. Die Geschichte an sich ist \"in meinen Augen\" seit langen wieder eine, die man durchaus lesen kann/sollte. Hier hat sich der/die Schreiber/in wirklich Mühe gegeben - Vielen Dank dafür![BR][BR]Abschließend kann man der gesamten Gast-Rasse ein gut (Schulnote 2) geben, ich tue dies zumindest.[BR]Hat \"mir\" sehr gefallen und wünsche mir mehr davon.[BR][BR]PS.:[BR]Wenn Gast-Rassen so den Live-Server erreichen, dann warte ich gerne erneut 10 Monate auf eine weitere, zumal man so auch wieder viel ansammeln kann.[BR][BR]So bleibt mir nur zur sagen .. .. ..[BR]Ich freue mich auf das neue Zeitalter. Auch wenn Diabhals blöde Herrschaft nun endet, so hoffe ich doch, dass König Bruitemail uns eine neue so faszinierende und tolle Geschichte bringt.[BR][BR][IMG]https://i.ibb.co/L89XgtP/https-de-forum-elvenar-com-index-php-attachments-1693297649633-png-38719.png[/IMG][BR][BR]Vielen Dank - Hat Spaß gemacht![BR][BR]Edit:[BR]Vielleicht noch zu erwähnen ist,[BR]ich spielte anfangs mit je 9 Gast-Rassen-Siedlungsgebäuden also so:[BR][IMG]https://i.ibb.co/3FhHk54/https-de-forum-elvenar-com-index-php-attachments-1693298500638-png-38720.png[/IMG][BR]Erhöhte aber nach kurzer Zeit auf je' 12 Siedlungsgebäude, was es mir um einiges leichter machte, jedoch viel Fläche kostete."}, {"30": "Grundsätzlich begrüße ich die Idee mit einer weiteren „verfallenden“ Ressource.[BR][BR]Die eingeführte „Sozialarbeit“ ist vielleicht moralisch nicht soo toll.[BR]Ich finde es nicht ok, das geleistete Sozialarbeit bereits einen Tag später 10% weniger Wert haben soll. Dann müssten auch die Münzvorräte über Nacht um 10% verfallen (Inflation und so). Ähnlich zweifelhaft ist auch der Zusammenhang Wohlstand in Bezug auf die Militäranlagen. Klar, nur mit den Wohngebäuden und Werkstätten wird das möglicherweise ein wenig mau, aber sollten dann nicht auch die Manus zum Wohlstand beitragen? Wäre in meinen Augen schlüssiger, als der Gedanke, das eine Kaserne in der Stadt den Wohlstand erhöht. Vielleicht greife ich hier aber auch vor, und sobald eine neue „Händler“ Gastrasse auftaucht, erreicht man auch mit den Produktionen Wohlstand. Jetzt ist es ja doch eher eine „kriegerische“ GR, für die möglicherweise gute Ausbildungsstätten für Kämpfer höheren Wohlstand bedeutet.[BR][BR]Da ich eigentlich gar keine Wohngebäude mehr stehen habe (hole sie nur noch bei den Gastrassenquests kurzzeitig hervor), ist die „Produktion“ der Sozialarbeit über Wohngebäude für mich Platzvergeudung, gibt aber den Wohngebäuden in der Stadt wieder einen Sinn und erschwert das Puzzeln mit dem Platz. Also durchaus für meine Spielweise eine interessante Herausforderung, was mir sehr gut gefällt.[BR][BR]Sinnvoll wäre vielleicht, das all die in der Stadt ohne Beschäftigung herumlungernde Bevölkerung die Sozialarbeit „leistet“ - also für jeden „Untätigen“ je 1x Sozialarbeit. Das würde der zur Zeit bei mir sinnfreien Überbevölkerung eine Aufgabe übertragen.[BR]Und die neue Ressource könnte neben den Wohngebäuden noch über andere Kanäle generiert werden.[BR][BR]Sind vorerst eher philosophische Gedanken, die mir in der ersten Phase der neuen Gastrasse in den Sinn kamen. Alles andere werde ich erst beurteilen können, wenn ich weiter bin und auch die entsprechenden Produktionen laufen. [BR][BR]In jedem Fall wird es diesmal sicher dauern, alleine wegen der vielen benötigten Orks. Da ich eher der „Verhandler“ als Kämpfer bin, bin ich bisher gut mit 3 Rüstkammern klar gekommen - da dauert das dann aber und ich hatte nicht vor jetzt noch eine weitere hochzubauen. Also muss ich halt gaaanz langsam machen, bevor ich die ganzen erforderlichen GR Gebäude hinstellen kann. Dadurch werde ich vermutlich auch nicht an Engpässen durch Unurium hängen. Bis ich weiter komme, hat sich das wieder angesammelt. (hoffe ich zumindest...).[BR]Hier muss ich bestätigen, was schon an einigen Stellen vermerkt wurde: die benötigten WPs im Forschungsbaum sind schnell zusammen, die entsprechenden Güter dauern aber deutlich länger. Die Punkte könnten tatsächlich erhöht werden."}, {"31": "AngelOfDead schrieb:Negativ (was \"mir\" nicht so gefiel):[BR]Die Grenze im Bezug auf Mana, Unurium wird eindeutig überschritten[BR](auch im Bezug, späterer Ausbauten/Kapitelbezogen)Zum Vergrößern anklicken....Die Grenze in Bezug auf Mana wurde definitiv weit überschritten. Ich spiele eigentlich jede Woche mind. 10k Punkte im Turnier und habe dementsprechend viele Zauber, denke aber es werden viele Spieler ein Problem mit den \"Unverschämten Opfergaben\" haben. Diese alleine fordern über 80 Mio. Mana, wenn ich das richtig in Erinnerung habe. Ohne diesen sinnlosen \"Verzögerer\" kann man die Gastrasse sicher bequem in 4 Wochen durchspielen, wenn man etwas zu den Ausbauten der Werkstätten (Gastrasse) durchboostet. [BR][BR]Ansonst ist die Gastrasse fair und gut gestaltet, auch der Einsatz an Portalsegen ist angemessen (im Gegensatz zum Kapitel 20). Mit Unurium hatte ich jetzt kein Problem, im Gegenteil. Hatte vor der Gastrasse ca. 4 Mio. auf Lager."}]