[{"9": "Balanaar schrieb:\t\t\tDie Grenze in Bezug auf Mana wurde definitiv weit überschritten.\t\tZum Vergrößern anklicken....Dem stimme ich vollkommen zu. [BR]Man lässt Spieler schneller und schneller werden, treibt sie förmlich an indem sie ganze Kapitel springen u.s.w., doch woher sollen sie dann diese Unmengen Mana und anderes nehmen? [BR]Soll ja im Prinzip auch nicht mein Problem sein, sondern nur meine Meinung, doch an die 2500 Zauber langen nicht, die ich nur für Mana verschossen habe. Man stelle sich vor, man hat diese nicht oder man stellt XXX Mana-Produzierende-Gebäude auf .. .. .. Oha ... das \"könnte\" zum Frust führen. [BR][BR]Balanaar schrieb:\t\t\tMit Unurium hatte ich jetzt kein Problem, im Gegenteil. Hatte vor der Gastrasse ca. 4 Mio. auf Lager.\t\tZum Vergrößern anklicken....Zum Schluss wird es nochmal viel. Ich hatte da auch nicht sooooo die Probleme, musste jedoch manchmal 1-2 Tage warten, aufgrund Unurium Mangel. Zum Glück hatte ich einen Boten, der mir flüsterte, dass es zum Schluss raus eng werden könnte und jener Bote war im übrigen mit 5 Mio. gestartet. So konnte ich vorplanen. [BR][BR]Balanaar schrieb:\t\t\tAnsonst ist die Gastrasse fair und gut gestaltet\t\tZum Vergrößern anklicken....Finde ich auch, hat wirklich Spaß gemacht, mal abgesehen von den Mana-Mengen und den kleinen Sachen die man \"vielleicht\" hätte anders machen können, ein sehr gelungenes Kapitel."}, {"32": "vom vielen positiven abgesehen, Kritik:[BR]dass nur Wohnhäuser (WH) Sozialarbeit erstellen.[BR]**edit: es sei denn Portalsegen ergeben Sozialarbeit..[BR][BR]AW: Abgrund, Gebirgshallen, Thermalbrunnen und dann noch Event-Gebäude mit Bev. zielen alle daraufhin WH zu reduzieren.[BR]> und nun braucht man wieder mehrere WH -_- sogar zum festen Bestandteil des Spiels. das ist doch doof.[BR][BR]Lösungsvorschlag:[BR]irgendein anderes Gebäude welches Sozialarbeit erstellt.[BR]> Option beim Händler (statt Saat/Urinium)[BR]> Option beim HG (statt Gold)[BR]> (neu erstelltes) Sozialstation -gebäude, Kulturgebäude, Eventgebäude[BR]> ein Wunder.."}, {"8": "TischFlasche schrieb:\t\t\t**edit: es sei denn Portalsegen ergeben Sozialarbeit..\t\tZum Vergrößern anklicken....nein, die geben bloß Beute[BR]TischFlasche schrieb:\t\t\tund nun braucht man wieder mehrere WH -_- sogar zum festen Bestandteil des Spiels\t\tZum Vergrößern anklicken....Ja, ich denke, darum gehts. Die sollen noch wertvoller sein?! ich muss jetzt wenigstens 2 behalten obwohl ich forsche...[BR]TischFlasche schrieb:\t\t\t(neu erstelltes) Sozialstation -gebäude, Kulturgebäude, Eventgebäude\t\tZum Vergrößern anklicken....Papa Juuls Gulaschkanone [smilie--sprite8]"}, {"14": "das Kapitel ist doch ganz neu?[BR]und du bist fast am Ende: also sehr schnell[BR]ich weiß nicht, ob es nicht auch so gedacht ist, dass man zwischendurch mal ausgebremst wird?[BR]kommt eben auf die Stadt an: bei dem einen ist es Mana und beim anderen etwas anderes und im nächsten Kapitel noch was völlig anderes?[BR][BR]einfach versuchen etwas dagegen zu unternehmen und ruhig weiterspielen [smilie--sprite1][BR]dabei hast du extrem viele Managebäude und das Kloster auf 30[BR]allerdings aber auch keinen Leuchtturm der guten Nachbarschaft, der durch Verzauberung der Managebäude (+Politur) doch schon extrem viel Mana zusätzlich produziert[BR]auf Stufe 21 z.B. bringt dann jedes polierte Managebäude 75% mehr Mana[BR]das schwarze Materie-Wunder wäre mir persönlich auch zu groß [smilie--sprite2]"}, {"2": "...pssst - Güter kann man auch einkaufen - dazu braucht man dann nur Werkzeug und nen hohen Kulturbonus...(ich hab nur noch je 1 von jeder Manu)...[BR][BR]...und durch den regelmäßigen Einsatz von Vorratszaubern und Mitgiften fällt dann nebenbei auch noch viel Mana an..."}, {"14": "ja, aber für die Hummel und Gütereinkauf fehlt auch letztlich der Leuchtturm (zumindest für mich)[BR]und der erhöht ja auch ziemlich die Ausbeute an Mana, aber jeder wie er spielen mag, aber anscheinend geht jetzt nur wegen Mana die Freude am Spiel verloren?"}, {"6": "Mit dem Drachenkloster ist das Mana eigentlich recht einfach zu erzeugen.[BR]Mana war dadurch für mich kein Problem. Nebeneffekt: meine 4 magischen Werkstätten sind noch für 206 Tage verzaubert, meine Mondsteinbiblios für 168 Tage und noch diverse andere Gebäude für 20 bis 70 Tage. [smilie--sprite8][BR]Zumindest bei den Werkstätten könnte das bis Kapitel 22 reichen. [smilie--sprite1]"}, {"2": "Taurendis66 schrieb:\t\t\tIch bin mit 10 Mio. ins Kapitel gegangen.\t\tZum Vergrößern anklicken.......und die hab ich halt immer noch (bei 10 Forschungen Rest) - vor dem Kapitel hatte ich halt meist so um die 22 Mio (hab dann immer 7 in den Kessel gesteckt und die Woche drauf waren es wieder 22) - mit Leuchtturm bzw. Kulturbonus-Taktik ist das easy...nebenbei bringt der hohe Bonus halt auch jede Menge Güter, Sozialarbeit und Unurium..."}, {"14": "naja, ich hab nur 5 Mio Mana in Kapitel 15, spiele aber auch gar nicht auf Mana, hab die meisten Gebäude mit Mana aus der Stadt entfernt und habe den Kessel mit Mana hochgespielt, weil ich das im Überschuss habe[BR]wie gesagt, der Leuchtturm ist wichtig um überhaupt einen hohen Kulturbonus zu bekommen, verzauberte Gebäude wie die verbotene Ruinen bringen dann extrem viel Mana[BR]da ich die ganze Zeit verzauber für den Kulturbonus und die Werkstätten (8) täglich neu, hätte ich gar nicht so viele Verzauberungen um dann so viele Tage zusammenzubekommen, aber so erhalte ich jeden Tag für jeden Zauber durch das Kloster noch zusätzlich Mana:[BR]also irgendwelche Engpässe in der Zukunft machen mir da jetzt keine Angst[BR]aber mir geht es auch noch gar nicht um Mana in Kapitel 15[BR]aber schlimmer fände ich es, wenn man so viel Saat brauchen würde: das würde dann für mich doch schon ein Problem bedeuten!"}, {"4": "Hast du eventuell noch eine Mana Rune? Dann setze die doch ein."}, {"8": "Bin mit 60 Mio Mana ins Kapitel rein und hab jetzt 100 Mio.[BR]Der Amunileuchter machts möglich! (und natürlich Laby+Draklo)[BR][BR]Bei den unverschämten Opfergaben lächle ich... wie auch sonst... Ich meine was sind das für Opfergaben???[BR]voodoopuppen? iPhones der älteren Generation? Oder veraltete Waffen die verschrottet gehören??? [smilie--sprite8][BR][BR]Allerdings forsch ich chillig... Gibt ja kein neues Kapitel...[BR]über Nacht prodden die Vallowerkies Beute und die Diabhalwerkies Orkkunst...[BR]Ich denk gar nicht dran hier durchzupushen nur um mich dann ein Jahr lang zu fragen, wann das nächste Kapitel kommt.[BR]Ich hab ja noch nicht mal 200k Fraggies für die neuen Wunder! [smilie--sprite12]"}, {"2": "Taurendis66 schrieb:[smilie--sprite8] Den Hilfsversuch von euch find ich echt klasse. Ich verstehe es und vieles nutze ich nach[BR]so langer Spielzeit automatisch. Alle Hexereien die mit Mana zu tun hatten, einschl.2x Mana Runen und das Kyrodingens[BR]alles verbraten. Verzauberungen in Dauerschleife[smilie--sprite2].. Kulturbonus nutze ich nur schubweise wenn ich[BR]das mal brauche. Hab ein paar Gebäude geschreddert und den Leuchtturm aufgestellt. Ich wollte den nie haben weil der mich an das Amuni Kapitel erinnert. Da hab ich ja wohl doch[BR]ein bischen was zu tun in meiner Stadt\t\tZum Vergrößern anklicken.......wenn du nach dem Kapitel dann wieder am Umbauen bist, versuch doch mal, von den vielen Straßen weg zu kommen - ich hab 30 Erweiterungen mehr als du (in Felyndral), aber du hast ca. 87 Straßenfelder mehr - die nehmen dir Platz weg..."}, {"14": "Taurendis66 schrieb:\t\t\t...[smilie--sprite2].. Kulturbonus nutze ich nur schubweise wenn ich[BR]das mal brauche. Hab ein paar Gebäude geschreddert und den Leuchtturm aufgestellt. Ich wollte den nie haben weil der mich an das Amuni Kapitel erinnert. Da hab ich ja wohl doch[BR]ein bischen was zu tun in meiner Stadt\t\tZum Vergrößern anklicken....[BR]für mich ist der Kulturbonus der Angelpunkt in meiner Stadt, dabei habe ich nicht mal die Hummel auf 30 bislang..[BR]aber im Prinzip hole ich sämtliche Waren mit Werkzeug und die erweckten mithilfe der Pyramide durch Orks[BR]ich brauche eigentlich gar keine Manus, die stehen da eigentlich nur für die Quests, und da kann man auch häufig einfach Level 1 -Manus nehmen, wenn es nicht gerade um die Gütermenge geht[BR]für mich heißt das aber auch: ich brauche IMMER den Kulturbonus, am besten so hoch wie möglich..momentan ist er bei 580[BR](ich muss erst noch die Wunder weiter wachsen lassen, mehr geht zurzeit noch nicht)[BR]der Nebeneffekt ist dann sehr viel Mana nebenher...[BR][BR]das Amuni-Kapitel fand ich ganz gut..[BR]ich glaube die blöden Kapitel kommen bei mir erst jetzt (nach 15)"}, {"33": "Danke für das tolle Kapitel hat richtig Spaß gemacht - Ich hatte je 11 Gaststrassen-Werkstätten - damit bin ich gut durchgekommen, Mana wurde mit Segen erstellt, Saat hatte ich genug im Lager und Unurium mit Geistertempel auf 35 auch kein Problem.  Habe heute die neuen Wunder aufgestellt und freue mich auch auf die neuen Gäste, die da dann irgendwann auf meine Insel kommen [smilie--sprite1]"}, {"34": "Taurendis66 schrieb:\t\t\tNaja, nur wegen Mana? Ich bin mit 10 Mio. ins Kapitel gegangen. Bis auf 1 Forschung bin ich im letzten 4er Block und die 10 m Mana sind läääängst futsch.[BR]Ich brauche noch ca. 1200 von den blauen Kisten aus dem Portal. 1 Satz, also 1 Produktion die 20 Kisten bringt, benötigt u. a.[BR]930000 Mana. Es geht nicht um Mana[smilie--sprite2] Es ist ein Fass ohne Boden.Viele Ausbauten brauchen ja auch noch Tonnen von dem Zeugs. Ok, damit kann man sich Zeit lassen. Ich verstehe einfach nicht wie man auf diese irren Mengen kommt. Aber gut.. soll so sein, muß aber längst nicht jedem gefallen\t\tZum Vergrößern anklicken....Falls es noch keiner Erwähnt hat: Ich habe immer im Hexenkessel Geschenk der Hohen Wesen aktiviert und so 28-30 Kisten pro Produktion erhalten. Macht anstatt 60mal eine Produktion starten nur 40mal. Also anstatt 55,8 Mio Mana dann nur 37,2 Mio Mana."}, {"2": "SidKane schrieb:\t\t\tFalls es noch keiner Erwähnt hat: Ich habe immer im Hexenkessel Geschenk der Hohen Wesen aktiviert und so 28-30 Kisten pro Produktion erhalten. Macht anstatt 60mal eine Produktion starten nur 40mal. Also anstatt 55,8 Mio Mana dann nur 37,2 Mio Mana.\t\tZum Vergrößern anklicken.......ja - das habe ich heute auch noch intensiv ausgenutzt, solange mein Effekt noch gelaufen ist - jetzt brauch ich nicht mehr viel (und von den noblen Opfergaben sind es auch nur noch 442 - letzten Endes werd ich nun doch ein wenig auf Mana für die letzten Forschungen warten müssen - aber nicht lange... [smilie--sprite2]"}, {"2": "Taurendis66 schrieb:\t\t\tWas ist das? Wie funktioniert das? Soll ich den Threat wechseln? Mag mir das wer erklären? Ich nutze und mag den Kessel nicht. Wenns hilft würde ich das versuchen. Ich hab mich jetzt erstmal an @ustoni  's Hinweis, bzw. Tipp gehalten. Danke dafür[smilie--sprite1] Ich hab zwar schon Verzauberungen genutzt um Mana zu generieren,[BR]wäre aber nie drauf gekommen solche Mengen zu nutzen.. hab ca. 1500 zur Verfügung und schon ordendlich verteilt[smilie--sprite1]Zum Vergrößern anklicken.......siehe hier...[BR]Romilly schrieb:\t\t\t...Strike!...[BR][BR]Anhang 38572 ansehen..Anhang 38573 ansehenZum Vergrößern anklicken....bzw. hier...[BR]Romilly schrieb:\t\t\t...leider hab ich nicht mit nem kritischen getroffen, aber der erhaltene Kesseleffekt ist so auch ganz nett...[BR][BR]Anhang 38095 ansehenAnhang 38096 ansehen[BR]Anhang 38097 ansehen...ist wie ne 2. Hummel (es hätten auch 57,3 % für 62 Stunden sein können - vielleicht nächste Woche, wenn mehr Gebäude stehen)...\t\tZum Vergrößern anklicken....[BR]...natürlich musst du die Effekte auch erst mal leveln (und dann mit Fragmenten/Diamanten die Chance auf einen Kritischen Treffer erhöhen)..."}, {"14": "ohne die Effekte zu leveln, kommt man da nicht wirklich weit..[BR]also zumindest den einen Effekt, den du haben willst[BR]also frühestens dann beim zweiten Mal Kessel[BR][BR]wenn du dann noch einen Haufen Fragmente übrig hast und ggf Dias, könnte dabei dann schon was extrem Gutes an Boost rumkommen ;-)"}, {"14": "hier ist ein Beispiel mit einem anderen Effekt:[BR][BR]https://de.forum.elvenar.com/index.php?threads/spiel-modul-der-hexenkessel.26178/post-440130[BR][BR]da sieht man, was man an Fragmenten und Dias für einen mehrere Tage dauernden Effekt einsetzen muss/kann[BR]auch die Höhe des Effekts wird extrem höher, wenn es ein kritischer Erfolg ist[BR][BR]man muss sich aber auch mit den Zutaten auseinandersetzen, um sie bestmöglich einzusetzen, das ist eine Wissenschaft für sich, weil die Dia-Zutaten wöchentlich wechseln, außer man sieht darüber hinweg, wenn man das bestmögliche herausgefunden hat für den Effekt, den man anstrebt[BR]in dem Thread hat Romilly auch eine Tabelle, was positiv und was negativ auf welchen Effekt wirkt: die negativen Zutaten braucht man meist auch um die Wahrscheinlichkeit für einen best. zu erhöhen[BR][BR]ich selber habe für so etwas nicht genug Fragmente, um eine 100%-Chance rauszuholen[BR]und bei mir sind es auch nur Orks, die ich wöchentlich pushe, das hält dann meist nur unter 20 h, aber z.B. mit 38% mehr Orks für 2 Abholungen kann ich gut leben (ohne Fragmente und Dias)[BR]die 20% täglich aus dem Hobbyraum habe ich leider nicht"}, {"2": "Taurendis66 schrieb:\t\t\tKann man über den Daumen peilen wieviele Fragmente und Dias ich springen lassen muß?\t\tZum Vergrößern anklicken.......generell gilt: je mehr du einsetzt, desto höher werden die Werte des Effektes - bei den max. 50 % Chance auf einen Kritischen Treffer kannst du den 3fachen erforschten Wert erhalten (wenn du den kritischen dann auch triffst) und die 4,5fache Dauer - ich schaff das öfters mal, setze dafür aber jede Woche ca. 32.000 Fragmente und 500 Diamanten ein (ohne Dias braucht man 165.000 Fragmente für den max. Wert) - ob du den gewünschten Effekt auch tatsächlich triffst (und in welchem Ausmaß) bleibt aber Zufall - ich würd mich erst einmal näher mit dem Kessel beschäftigen und nicht gleich zuviel davon erwarten - aber falls dir während der Warterei auf Kapitel 22 langweilig ist, kannst du den Portal-Kesseleffekt (und vielleicht auch Mana oder was sonst noch gerne mal knapp wird) ordentlich ausbauen - mit jedem neuen Diplom werden die Preise für zugekaufte Hexenpunkte wieder günstiger - generell steigen die Preise aber recht schnell und es wird sehr teuer (deshalb sammle ich schon seit Monaten mit der Kulturbonus-Taktik Güter an, um die dann in Hexenpunkte umwandeln zu können, sobald die Preise gesunken sind - da du nicht unbedingt auf Effizienz setzt (mach ich auch nicht), kannst du das als nettes Nebenprojekt betrachten - es dauert aber, bis sich das entwickelt..."}]