[{"33": "SidKane schrieb:\t\t\tFalls es noch keiner Erwähnt hat: Ich habe immer im Hexenkessel Geschenk der Hohen Wesen aktiviert und so 28-30 Kisten pro Produktion erhalten. Macht anstatt 60mal eine Produktion starten nur 40mal. Also anstatt 55,8 Mio Mana dann nur 37,2 Mio Mana.\t\tZum Vergrößern anklicken....Ich spiele den Hexenkessel gar nicht hab mein Mana mit Segen gezaubert"}, {"9": "Taurendis66 schrieb:\t\t\thmm, nicht meins. Macht aber nix. Rund 800 Segen schon verbraten[BR]und wenn die alle sind dann bleib ich halt wo ich bin [smilie--sprite2] alles gut\t\tZum Vergrößern anklicken....Schau mal ob du diesen Foliant im Inventar unter Hexereien hast (Foliant der Manastärkung).[BR][IMG]https://i.ibb.co/YWLrTz6/https-de-forum-elvenar-com-index-php-attachments-1694277761809-png-38908.png[/IMG][BR]In diesem Foliant befindet sich die Manarune, das Gebäude ist nur 1x2 groß und steigert alle Managebenden Gebäude, einschließlich Wunder um 75%. Das Gebäude ist auch Stapelbar. Also bei 2 aufgebauten dann 150% mehr, egal woraus du Mana beziehst. [BR][IMG]https://i.ibb.co/vwYTcxv/https-de-forum-elvenar-com-index-php-attachments-1694277951191-png-38909.png[/IMG][BR]Mir hat das sehr weitergeholfen. Denn ich nutzte den Hexenkessel ebenfalls nicht, bzw. nicht für Gast-Rassen-Produktionssteigerung."}, {"12": "Dann geb ich mal etwas feedback ab, solange es hier noch möglich ist (ich erstell mir mit Sicherheit nicht wieder einen Discord account für irgendwas).[BR][BR]Positiv finde ich die 3-Teilung des Forschungsweges, da konnte ich mich voll auf den Ausbau der Gastrassen-Gebäude konzentrieren. Sogar den oberen Weg hab ich heute fertig beschritten, jetzt kommt der untere dran...[BR]Meinen geplanten Zeitbooster-Verbrauch von max. 30% konnte ich bis jetzt einhalten.[BR][BR]Jedoch der Verbrauch an Mana ist enorm - kann es sein, daß sie sich bei den Unverschämten Opfergaben um den Faktor 10 verplant haben? - Fast 1 Mio. Mana für 2 Std. Produktion, dagegen nehmen sich 11000 Saat bzw. 28000 Unurium für die anderen beiden Opfergaben wie peanuts aus, und selbst die Mana-Ausgaben für die anderen Dinge sind noch im normalen Rahmen (generell hatte ich beim Vorrat ein grob gerundetes Verhältnis von Saat:Mana als 1:10). Allein für die Unverschämten Opfergaben werde ich gerundet 100 Mio. Mana verbrauchen, ein mehrfaches des Manaverbrauchs für sonstiges.[BR][BR]Ansonsten scheine ich etwas schneller voranzukommen als die letzten Kapitel. Liegt teilweise auch am moderaten Wp-Bedarf im Forschungsbaum. Und ich hatte bisher noch kein \"auf der Stelle treten\".[BR]Verglichen mit den Händlern erheblich angenehmer zu spielen."}, {"24": "Die Missionen für die vallorianischen Werkstätten sind zu hoch angesetzt. Es genügen erheblich weniger als die Missionen einem aufzwingen wollen. Jetzt soll ich neune auf Stufe 3 haben wo ich doch schon bei 6-7 häufig Leerlauf (und keinen Platz) habe. Ehrlich, ich hab überlegt die Hälfte ABZUREISSEN."}, {"24": "Okay, nach einem BLick in die Elvenarchitectlisten geht mir der Sinn des Ganzen auf... Es soll das Seeschlangenbiotop gebaut werden - Dessen Mana-Pro-Feld-Produktion zugegeben echt spitze ist und den nachfolgenden bisherigen ewigen Spitzenreiter, den Partygängerbrunnen um fast 100% (!) übertrifft. Haken: Es ist eines der regulären Kulturgebäude, die aber Dias kosten - Satte 3600 an der Zahl und es kann im Gegensatz zu Eventgebäuden nicht ins nächste Kapitel geholt werden. Angesichts des Gegenwerts ist dieser Inovische Lockvogel (bzw... Lockschlange...) aber echt mal zu überdenken. Selbst wenn dann in Kapitel 22 was bessres Käme, der Nutzen hält sich noch ne Weile wenn die Eventgebäude alter Zeit nicht merklich nachgezogen werden. 185.000 Mana pro Tage auf 15 Feldern sind schon ne Ansage..."}, {"10": "Kleine Korrektur @Feytala1986 [BR]Es soll laut Quest \"eines der neuen Kulturgebäude\" aufgestellt werden.[BR]Also entweder das Seeschlangen-Biotop ODER die Drachenfelsschlucht."}, {"35": "@Feytala1986 der Elvenarchitekt ist bei Set- und Evogebäuden mit Vorsicht zu nehmen, Er berücksichtigt leider die Links nicht immer richtig.[BR]Der Partygängerbrunnen liefert bei mir in Kapitel 19 (mit NBH und MM) schon 194.150 pro Tag. In Kapitel 21 wird das noch mehr sein.[BR]Die 100% mehr klingen mir dann nicht ganz richtig."}, {"24": "hobbitrose schrieb:@Feytala1986 der Elvenarchitekt ist bei Set- und Evogebäuden mit Vorsicht zu nehmen, Er berücksichtigt leider die Links nicht immer richtig.[BR]Der Partygängerbrunnen liefert bei mir in Kapitel 19 (mit NBH und MM) schon 194.150 pro Tag. In Kapitel 21 wird das noch mehr sein.[BR]Die 100% mehr klingen mir dann nicht ganz richtig.\t\tZum Vergrößern anklicken....Ich finde die Berechnungen offen gesagt selber mittlerweile nur noch schwer nachzuvollziehen. Aber bei mir schwingt da auch Kultur mittlerweile mit rein, die Manarune derzeit, etc. Trotzdem dürftest du Recht haben. (Wenn man die andren Setgebäude NICHT mit einrechnet liegt der PG-Brunnen bei 1187,037 pro Feld pro Stunde). Fazit ist dennoch dass die Seeschlange ein ganz schönes Sümmchen bringt, auch wenn es hinter dem Partygängerbrunnen zurückbleiben sollte. Platz 2 ist ja auch noch gut, die ansonsten darauffolgende Manahütte (Den Schrein rechne ich nicht - Zu selten, zu klein) sticht sie jedenfalls merklich aus und auf die wird oft noch immer geschworen [smilie--sprite2] - Zumal sich mehrere bauen lassen und man darüber streiten kann inwieweit beim Brunnen die Felder der andren Setteile zumindest teilweise mit in den Schnitt eingerechnet werden müssten.^^ Dazu kommt dass der Leuchtturm der guten Nachbarschaft alle Mana verstärkt - Beim PG-Brunnen wird so wie ich das sehe der Linkbonus nicht mitmultipliziert. Stellt man also einen Manamehrbedarf fest und hat die Dias übrig, kann man durchaus alte Managebäude ersetzen. [smilie--sprite2] Der einzige Knackpunkt in meinen Augen sind wirklich die Frage nach dem Bedarf (Ich weiss dass es Turnierspieler gibt die eher 60-70 als die 40 Provinzen spielen die ich habe und sich vermutlich daher immer noch pur durchs Drachenkloster finanzieren können) und die Diakosten.[BR][BR]Deelfin schrieb:\t\t\tKleine Korrektur @Feytala1986[BR]Es soll laut Quest \"eines der neuen Kulturgebäude\" aufgestellt werden.[BR]Also entweder das Seeschlangen-Biotop ODER die Drachenfelsschlucht.\t\tZum Vergrößern anklicken....[BR]Ich habe mich zu keinem Zeitpunkt auf einen Quest bezogen, sondern lediglich auf den immensen Bedarf an Mana zum durchspielen des Kapitels, primär durch die Kosten der unverschämten (no Pun intended) Opfergaben, der potentiell durch das Seeschlangengehege bekämpft werden kann. Die Drachenfelsschlucht bringt bei gleicher Felderzahl unter der Hälfte dessen was das Seeschlangengehege erbringt - Da rechnen sich gewisse Eventgebäude erheblich mehr."}, {"10": "Feytala1986 schrieb:\t\t\tEs soll das Seeschlangenbiotop gebaut werden -\t\tZum Vergrößern anklicken....Dann war das nur unglücklich formuliert.[BR]So entsteht der Eindruck, man müsse das Biotop gegen Dias kaufen, um die Questline abschließen zu können ;-)"}, {"24": "Deelfin schrieb:\t\t\tDann war das nur unglücklich formuliert.[BR]So entsteht der Eindruck, man müsse das Biotop gegen Dias kaufen, um die Questline abschließen zu können ;-)\t\tZum Vergrößern anklicken....Nein, es war nur eine laute Vermutung was Inno mit den hohen Manakosten (im Vergleich) in diesem Kapitel bezweckt [smilie--sprite2][BR]Aber dann haben wir es ja geklärt.^^"}, {"25": "Im Nachgang war mir das Kapitel zu leicht für Endgamer und viel zu kurz. Wo bleiben da die Anforderungen über die ich dann negativ urteile ?[BR]Schöne Grafiken aber sonst eher alles mittelmässig.Ich wünsche mir für das nächste Kapitel ein höheres Anforderungsprofil mit allem, was dazugehört..."}, {"24": "Joa, stimmt schon, ich bin auch fast durch. Der einzige Flaschenhals ist das Mana... Aber ich finde es bisher eher gemütlich, versuche nicht zu hetzen, sonst sitze ich eh wiede rlang genug rum und warte auf das nächste Kapitel [smilie--sprite8]"}, {"3": "Ja, die Mana-Mengen. Ok, ich warte auch jeden Tag auf Mana. Das zieht sich in die Länge. Doch wozu es eilig haben, das nächste Kapitel ist ja noch nicht in Sicht, ooooooder?[BR][BR]Mir gefällt das Kapitel ganz gut. Die Gebäude sind schön, besonders das Portal, dieser riesige Turm mit dem Drachen![BR]Es spielt sich recht flüssig (bis auf das mit dem Mana), aber der Anfang geht gut und man gewöhnt sich schnell an die vielen seltsamen Siedlungsrohstoffe.[BR]\"Wohlstand\" und \"Sozialarbeit\" haben mir weniger Schwierigkeiten gemacht als zuerst befürchtet. Irgendwie war doch immer genug da.[BR][BR]Die Story ist witzig, ich frage mich wo das noch hinführen soll! Keine Ahnung ob irgendwer die Story liest?"}, {"2": "...mir hat am Schluß geholfen, daß ich 2x hintereinander einen hohen Kesseleffekt für die Siedlungsproduktion ausgelöst hatte - damit hab ich dann möglichst viele Endprodukte (Opfergaben) produziert, für die irgendwie Mana notwendig war - also auch in den Vorproduktionen - ich musste dazu am Schluß zwar ziemlich viele Zauber einsetzen (Manus und Werkstätten haben jetzt wochenlang geglitzert), hab mir dadurch aber sehr sehr viele Herstellungskosten (also vor allem Mana) gespart, denn das reicht sich ja durch und die Ersparnis wird immer höher: da ich mehr Opfergaben pro Auftrag bekommen habe, musste ich weniger Produktionen starten und brauchte natürlich dadurch weniger Vorproduktionen - von den Vorproduktionen musste ich aber auch weniger in Auftrag geben, da die ja auch pro Produktion mehr abwarfen und das hat wieder Ressourcen aus der Produktions-Stufe darunter eingespart - nachdem ich dann alle Opfergaben beisammen hatte, hab ich in Ruhe auf das Mana für die letzten Forschungen gewartet (und dabei Mana über den Hobbyraum gefördert)..."}, {"24": "*grummel* Ich will auch den Hobbyraum."}, {"3": "Ich hab für den Endspurt jetzt schon ein paar der Werkstätten abgerissen, nur je 5 behalten, aber Vorsicht, das drosselt die Produktion der Opfergaben! - was ich erstmal übersehen hatte. [smilie--sprite5][BR][BR]Und ich habe alle Managebäude aufgestellt, die ich nur irgendwie mobilisieren konnte. Zum Beispiel diverse Drachenfelsenschluchten."}]