[{"1": "Dear Humans and Elves,[BR][BR]Please use this thread to discuss the update to Chapter 19, Revenge of the Exile.[BR][BR]We're looking forward to your feedback![BR][BR]Kind regards,[BR]Your Elvenar Team"}, {"67": "I will not ask why a year ago my profile in the forum without deleted for no reason.[BR]I will not ask why there was no notice of the new chapter the day before.[BR]I will not ask why the two technologies of ancient wonders were included as mandatory at the last minute.[BR]I will ask why the price of these two technologies has changed dramatically at the last moment - instead of 600 badges, the two technologies now cost a cosmic sum of seeds?[BR]I have produced 600 badges in the warehouse - what to do with them?"}, {"32": "Viskyar said:I will not ask why a year ago my profile in the forum without deleted for no reason.[BR]I will not ask why there was no notice of the new chapter the day before.[BR]I will not ask why the two technologies of ancient wonders were included as mandatory at the last minute.[BR]I will ask why the price of these two technologies has changed dramatically at the last moment - instead of 600 badges, the two technologies now cost a cosmic sum of seeds?[BR]I have produced 600 badges in the warehouse - what to do with them?\t\tClick to expand...They send you 3 forum mails to connect your forum account to your game account with a link to click over a period of many weeks.[BR]Else your forum account would be deleted[BR]You did not respond so it was deleted"}, {"35": "Viskyar said:\t\t\tI will not ask why there was no notice of the new chapter the day before.\t\tClick to expand...Advance notice would have been nice!  I've had my trader on seeds production non-stop since the end of chapter 18, so that I'd have a big store of seeds ready for chapter 19, so that I could hopefully set my trader on Unurium when the new chapter arrived and hopefully make it through the whole chapter without running out of seeds and having to switch my trader to seeds again.  This of course means that I woke up this morning to stocks of 9 Unurium and 13.5 million seeds and what does the first research need to unlock... Unurium, about 18 hours of production worth of it!  [smilie--sprite5]"}, {"43": "Saying hi, so there are 4 replies in the thread …[BR]3 is depressing …"}, {"2": "@Paladestar - don't be sad, at least at the start of the chapter you don't need too much Unurium, instead you will need huge amounts of seeds for sentients, as well for T2 upgrades. I burnt over 1M seeds in a heart beat. I could use 1 more M but unfortunately I don't have it [smilie--sprite8]. Now I am forced to produce strictly what I need for the very next Tech.[BR][BR]use this:[BR]tinyurl.com/ch19-excile[BR]Please, make a copy before making any changes. TY[BR]P.S. the first 3 techs are using different sentient, depending on boosted. The rest are like in the SS."}, {"37": "What I really want is the questline for XIX please"}, {"35": "Booff said:\t\t\tWhat I really want is the questline for XIX please\t\tClick to expand...Watch this space (not mine, not in English, but Google translate, but it's been a reliable source for the previous few chapters' quests lists):[BR][BR]https://cavalieridellozombiaco.blogspot.com/p/la-vendetta-dellesiliato-capitolo-xix.html#paragrafo6[BR][BR]Edit: quests list is now available at the link"}, {"39": "Hello, I would like to ask a question beta players: How many of white/black matter do Towers of Light/Darkness give after they expire? Is it still 1?"}, {"2": "Regina8 said:\t\t\tHello, I would like to ask a question beta players: How many of white/black matter do Towers of Light/Darkness give after they expire? Is it still 1?\t\tClick to expand...Yep, just 1."}, {"39": "Alcaro said:\t\t\tYep, just 1.\t\tClick to expand...Ok, thank you Alcie [smilie--sprite1])"}, {"2": "oh, my bad .. I should have added - after are SOLD. They give nothing just because they expire. [BR][BR]I got a piece of advice to build and sell and/or build + upgrade then sell. For the White and Black Magic, just use PP.[BR]The problem is ... actually are more: not enough Unurium and Seeds and the market on En2 at least is $#^*()# up. Not a single trade offering Ingots. I needed almost 2 days to get enough of them to build 10 Towers. I will need other 2 for other 10 ...  Is the same ascended for everybody for Towers? Is not related to your boosted?"}, {"27": "Alcaro said:\t\t\tand the market on En2 at least is $#^*()# up. Not a single trade offering Ingots. I needed almost 2 days to get enough of them to build 10 Towers. I will need other 2 for other 10 ... Is the same ascended for everybody for Towers? Is not related to your boosted?\t\tClick to expand...Building Tower (and Fortress) asks for Sprouts. I’m Ingot boosted. So as opposed to research, the buildings’ requirements are actually based on our boosts.[BR][BR]And yes, I noticed the hunger for Ingots in Winyandor. I never take trades from the market, but instead always offer my Ingots on the market. They get taken and I re-post. That’s the only way I can help to add more Ingots on the market. Hopefully more Ingot-boosted people are trying to help in some way."}, {"2": "Soon I'll need  240K Sprouts  just to upgrade 10 Towers. It hurts only to think how long will take to trade those as it seems my boosted - Minerals - are in very low demand.  [BR][IMG]https://i.ibb.co/rvVZTdn/https-en-forum-elvenar-com-index-php-attachments-tears-sobbing-gif-5942.gif[/IMG]"}, {"48": "FieryArien said:\t\t\tBuilding Tower (and Fortress) asks for Sprouts. I’m Ingot boosted. So as opposed to research, the buildings’ requirements are actually based on our boosts.[BR][BR]And yes, I noticed the hunger for Ingots in Winyandor. I never take trades from the market, but instead always offer my Ingots on the market. They get taken and I re-post. That’s the only way I can help to add more Ingots on the market. Hopefully more Ingot-boosted people are trying to help in some way.\t\tClick to expand...[BR]Thank you for that. We got couple of players like that in Felyndral as well and it does help a lot. So far I got all goods I need for the settlement just out of checking available trades and haven't used the merchant yet. It might be a different story once I actually decide to build it and put myself through the suffering. [smilie--sprite8]"}, {"39": "Last chapter, minerals were the rarest on EN2 server, but indeed, this time around it's ingots. I guess more people boosted in minerals are in chapters 18 & 19 now. We need to sell 72 Towers of darkness in total for all portal upgrades and it's a lot of ascended goods to be produced and traded. I can't imagine how trading of refined ascended is going to be, since even less people have started ch 19."}, {"12": "Ch XIX has started well. It's nice to see some more city expansions [smilie--sprite1][BR][BR]I have yet to research the guest race buildings, but I'm hoping they won't be too ridiculous. It's good to see only a few guest race goods needed, after the horrible Ch XVII cluster."}, {"39": "Trading on EN3 server is abysmal, I cannot shift my 150K of minerals at all to get anywhere close to get moving with Towers. Much higher merchant amounts would solve that problem and no, 4800 is not high enough either."}, {"2": "I just noticed that the Towers of Light/ Darkness can't be teleported, only Breeding Facilities can. I wonder why! In the previous chapters only capped buildings from settlements (as Portals, the Embassies, Flag ships etc) couldn't be teleported. Why this change? Only because they expire? If this is the reason, then pardon me, but it sucks. :[ [BR][IMG]https://i.ibb.co/LNkgFKJ/https-en-forum-elvenar-com-index-php-attachments-frowning-pup-small-jpg-5946.jpg[/IMG]"}, {"39": "I wouldn't spend my teleports on Towers, Alcie. We only need them for white and black matter and we have to build 144 Towers of Light and 72 Towers of Darkness. I sell them as soon as I build them or upgrade them. The white and black magic I am getting from PPs."}]