[{"2": "@Regina8 - Yeah, but I came to the quest asking 10 Towers and 10 Facilities ... I thought ... mmwell .... [smilie--sprite3] eventually I teleported a good chunk from the city to make space for all those buildings. The positive part is that they count even though are disconnected from Fortress."}, {"35": "Regina8 said:\t\t\tI wouldn't spend my teleports on Towers, Alcie. We only need them for white and black matter and we have to build 144 Towers of Light and 72 Towers of Darkness. I sell them as soon as I build them or upgrade them. The white and black magic I am getting from PPs.\t\tClick to expand...Yep, they're not really needed.  I only kept 10 towers around until I'd cleared the 'have 10 towers and 10 breeding facilities' quest, after that, they're just taking up space for no gain, with PP instants being able to totally replace their magic production.  Just need one 4x4 space to build and sell one tower at a time, as many times as needed, until you've made a cumulative total of 72 black matter.  That saved space is going to be needed, as there's a later quest to have 10 level four breeding facilities, which take up a rather large 6x6 space each."}, {"39": "Alcaro said:@Regina8 - Yeah, but I came to the quest asking 10 Towers and 10 Facilities ... I thought ... mmwell .... [smilie--sprite3] eventually I teleported a good chunk from the city to make space for all those buildings. The positive part is that they count even though are disconnected from Fortress.\t\tClick to expand...I was sincerely hoping that they would count, even when disconnected, so at least that's a good news [smilie--sprite1]."}, {"2": "... and I reached Stone Heart Street tech, which requires \"only\" 20000 Creatures o.t. Light.[BR]10 Facilities can make 500 Creatures/ 6h. Because I am used to sleep at night I'll count only 3 batches/ day = 1500 CotL[BR]20000 : 1500 = 13.33 days just for ONE tech. Probably will be less tragic (in theory only) once the Facilities will be upgraded, unless you don't think that one upgrade (only 1 lvl. from total of 4) costs 700k Mana and 58k Wax and ofc, if you have Mana then for sure you don't have enough Unurium.[BR]I didn't even look how much the Fortress' upgrade costs. I don't want a heart attack! [smilie--sprite8][BR]I think Inno decided that this chapter must take at least 6 month if not a year for casual players. I wonder how many players will quit. [BR][BR]About Unurium, I was reluctant to build more wonders but eventually I've built the Temple of Spirits and replaced the Museums with Dragon Statues > smaller AND better ratio of Unurium/ tile. Thanks to this Temple at lvl.6 atm, I got 125k Unurium from the Spire. Also, for once I am happy that an event will start soon [smilie--sprite8] [smilie--sprite8] I will probably be more happy to collect Keys/ Unurium than thinking at the event."}, {"2": "The Merchants are a pain!!! If you are unfortunate to have the ascended nobody want them, then you are screwed. I am one of those unfortunate players. None of my Ascended are needed, therefore, I needed a week to build 10 Facilities and I built a Tower yesterday. Since then I couldn't get 8900 Ingots to build another one. I hired the last 2 Merchants too, but 4400 of something (x5=22.000) is not that much, when you need 58.000 for a single upgrade to lvl.2 and for lvl.3 is even worse - 73.000. They either have to increase the amount we can trade or to lower the time we have to wait until they are free. All those numbers must be seen actually as 580.000 and 730.000, because we must have 10 Facilities. I don't know yet how much it costs for lvl.4, probably is somewhere near 100.000 each of those 10.[BR]At the beginning I thought that Unurium will slow me down. It seems I was wrong. The merchants are slowing me down!!! They are a game killer.[BR][BR]EDIT:[BR]Another problem with the merchants is that you don't know what trade was taken. In the notifications you get only \"Player XY has traded with your Merchant\". I try to cover building Towers, Upgrading (1) Towers, upgrading Facilities. From 5 trades 3 were taken but I have no idea which one was taken."}, {"39": "I agree with Alcaro, the experience of playing with the least demanded goods is frustrating and disappointing. My city on EN3 server has both ascended the least desired, it will take me forever to get anywhere in ch 19 there, considering how small that server is. Also, the amounts of everything (mana, unurium, seeds, sentient goods and ascended goods) are ridiculous. Those, who arrived to ch 19 and didn't quit yet, will consider doing so."}, {"35": "The people posting ascended cross-tier trades aren't helping either.  I find this pretty lame, truth be told.  I really wish they'd add a 'do not show cross-tier trades' option on  the trader and make it on by default to discourage it.[BR][BR]What @Alcaro said is true.  It becomes somewhat of a viscious circle too, the people with the most in demand goods don't even need to unlock merchants and can simply just accept offers, instead of posting them for other people to grab when they need."}, {"12": "Paladestar said:\t\t\t...the people with the most in demand goods don't even need to unlock merchants and can simply just accept offers, instead of posting them for other people to grab when they need.\t\tClick to expand...Are these type of people lazy or inconsiderate? I can never decide [smilie--sprite5]"}, {"2": "SkyRider99 said:\t\t\tAre these type of people lazy or inconsiderate? I can never decide [smilie--sprite5]Click to expand...I would say they are neither of that. Until we don't have a proper notification system, people would avoid at any costs to post trades of any kind, they will do it only when they are forced to and except the Ascended goods where we have a fixed amount/ Merchant, all other goods will be offered in big or huge numbers, again - to avoid getting gazillion notifications."}, {"12": "Gazillion? We shouldn't give anyone any bright ideas [smilie--sprite8][BR][BR]Somebody could post a thread asking how they can get a gazillion, and is it upgradeable  [smilie--sprite7]"}, {"43": "I’m one of those chapter 15 stagnant cities. [BR]Does the game have a future for anyone past c15 ?[BR]Feel discouraged reading the posts about merchants and stuff."}, {"43": "@Far Reach [BR]You are the strong advocate for progressing in chapters. [BR]how are the numbers here. [BR]convince us please. Really looking for some motivation."}, {"48": "JollyElf said:\t\t\tFeel discouraged reading the posts about merchants and stuff.\t\tClick to expand...[BR]They are the pioneers, they'll fix it for us by the time we get there. [smilie--sprite8][BR][BR]Personally, not much can stop me from progressing in this game and getting through the chapters. I love the new challenge, fresh city look, something new to do etc that comes with new chapters. I even reached end of game once, got bored and started new city from scratch and it was actually quite good to be going through the beginning again with a different twist that the changes brought.[BR][BR]PS: I still love to know more about this chapter and have more numbers about troops etc."}, {"57": "JollyElf said:\t\t\tI’m one of those chapter 15 stagnant cities.[BR]Does the game have a future for anyone past c15 ?[BR]Feel discouraged reading the posts about merchants and stuff.\t\tClick to expand...I have progressed.[BR]I am just doing slowly and enjoying the gaming experience. A good FS help.[BR]I think a lot of the griping (ignoring the new chapter) is due to the fact that you can't rush through it in a couple of weeks.[BR]My opinion folk. No nasty responses if you don't mind."}, {"2": "Stucon said:\t\t\tI think a lot of the griping (ignoring the new chapter) is due to the fact that you can't rush through it in a couple of weeks.\t\tClick to expand...I didn't expect to finish a chapter in couple of weeks, but as it appears this chapter will take more than 3-4 months, even being a player who likes to finish a chapter as soon as possible and then to enjoy the break and taking care only on developing the city [smilie--sprite1][BR][BR]and placing all Genies and other stuff to increase the stocks of .. everything [smilie--sprite8]"}, {"8": "JollyElf said:\t\t\tI’m one of those chapter 15 stagnant cities.[BR]Does the game have a future for anyone past c15 ?[BR]Feel discouraged reading the posts about merchants and stuff.\t\tClick to expand...Hey @JollyElf - I was also one of those cities that stopped at chapter 15 after they rehashed the tournament formulae - But I got bored of hanging around and decided to carry on through the chapters and if that meant the game was killed for me, so be it, I would have quit and found myself another game.[BR]But moving into the next couple of chapters has not been nearly as bad as some of the posts on the forums would have you believe, a lot might depend on the number of aw levels you have, I don't know.[BR]I know some of the bigger players in my fs face much larger enemy squads then I do but they have 500+aw levels, I had 297 aw levels at the end of chapter 15 and I've continued to upgrade them, I now have 333 levels and with very little negative effect.[BR][BR]I am currently near the end of chapter 17, it's slow, but no slower then sitting in chapter 15 twiddling my thumbs. I did notice a slight increase in tournament difficulty, bigger enemy squad sizes but nothing I couldn't manage to keep up my troop training with, without using bears for training.[BR]I now intend to do the last 2 chapters and continue to upgrade my aws and do my weekly spire and tournament. I get 6-7k tournament score regularly, that's good enough for me, for now. [BR][BR]Onwards and Upwards @JollyElf [smilie--sprite1]"}, {"12": "I finished Ch XVIII a couple of weeks ago. Yes it was a slow progress, but the challenge of balancing the guest race with all the usual city activities was very entertaining. It was a very similar experience with earlier chapters too. Having said that, I will concede that some of the chapters are a real drag. But the sense of achievement (relief?) at finishing them is worth the effort IMHO.  After all, that's part of the game, even if some players choose to ignore it.[BR][BR]I'm into Ch XIX and am under no illusions that it will be quick. I do like to keep seeing something new and interesting though. And there's no end in sight  [smilie--sprite1][BR][BR]So am I an advocate for progressing chapters? That would depend on my audience's desire to unfold new vistas and have fun.[BR][BR]JollyElf said:\t\t\tFeel discouraged reading the posts about merchants and stuff.\t\tClick to expand...[BR]There's no need to feel discouraged JollyElf.  A lot of what you may be reading is not giving the whole picture.  When you are the one dealing with the issue you will have a different and unique approach that most likely will have you scratching your head and asking, \"What were they all talking about?\"  [smilie--sprite6]"}, {"53": "JollyElf said:@Far Reach[BR]You are the strong advocate for progressing in chapters.[BR]how are the numbers here.[BR]convince us please. Really looking for some motivation.\t\tClick to expand...[BR]I'm not quite sure what you are asking. I don't think that I'm unusual in wanting to progress through chapters. It is a city building game after all.[BR][BR]As far as the difficulty/challenge/effort is concerned, C19 isn't going to be quick. I do think that it is somewhat better balanced than previous chapters though. There is no longer a reliance on very short production times, and many of the best upgrades are available very early in the Chapter. [BR][BR]The argument against chapter progress has always been about tournaments. From a pure Tournament perspective, a player at the end of C19 is definitely better off than a player at the end of C18. How much better off is hard to precisely assess - but it is the equivalent of at least a 10% reduction in squad size and at least a 5% boost to score. A player who uses Rangers a lot will get a bigger benefit. My feeling is that Inno is now calibrating new chapters properly - so that the Tournament formula is reducing, perhaps halving, (but no longer eliminating or penalising) the effects of progress. Based on that I expect the trend to continue."}, {"48": "What I've noticed is that it's all about space. The more space you got for the settlement, the easier the chapters are. That's why I max my AWs before I add new ones, spent all my diamonds on premium expansions and just generally try to get the most out of each square."}, {"24": "I am not sure anymore, but isn´t that a general feature? I mean that expiring buidings, just like buildings that have a number limit cannot be teleported at all?[BR]Too tired to remember right now..."}]