[{"43": "Far Reach said:\t\t\tMy feeling is that Inno is now calibrating new chapters properly - so that the Tournament formula is reducing\t\tClick to expand...I really wish the tech factor is weighed differently from chapter 15 onwards.[BR]Far Reach said:\t\t\tequivalent of at least a 10% reduction in squad size and at least a 5% boost to score\t\tClick to expand...Would love it if expense = gain.[BR]@Inno please[BR]Or is it @MTG"}, {"68": "As somebody who is well in Ch19 on Beta (just upgraded the Fortress to lvl 3) and underway very slowly here, people should resign themselves to it taking a long long time if they don't have lots of expansions (premium) or are coming into the chapter straight from Ch18 and haven't had the time to build up large stocks of urunium, seeds and mana.  Thoughts from my Beta FS is that it could take 9 months to a year to get it done."}, {"39": "I just made approximate calculations and it looks like that I will finish chapter 19 in early May of 2022. I have 10 more techs to do (I'm counting only the ones that need settlement goods) and Oh dear God!  why would you make chapters so boring and tedious??? It's not like we gain anything cool out of them, if anything, they are just having a detrimental effect on our tournament and spire performances. 10 breeding facilities updated to level 4 (btw I'm not even going to go into complaining about 1.1 m of mana to upgrade each and about getting ascended goods needed) are not enough. I think that settlement goods requirement for the last 10 techs should be halved at least. This chapter is lame."}, {"69": "Regina8 said:\t\t\tI just made approximate calculations and it looks like that I will finish chapter 19 in early May of 2022. I have 10 more techs to do (I'm counting only the ones that need settlement goods) and Oh dear God!  why would you make chapters so boring and tedious??? It's not like we gain anything cool out of them, if anything, they are just having a detrimental effect on our tournament and spire performances. 10 breeding facilities updated to level 4 (btw I'm not even going to go into complaining about 1.1 m of mana to upgrade each and about getting ascended goods needed) are not enough. I think that settlement goods requirement for the last 10 techs should be halved at least. This chapter is lame.\t\tClick to expand...[BR][BR]Or/And it is exactly what Inno wanted, to slow things down."}, {"35": "Regina8 said:\t\t\tI just made approximate calculations and it looks like that I will finish chapter 19 in early May of 2022. I have 10 more techs to do (I'm counting only the ones that need settlement goods) and Oh dear God!  why would you make chapters so boring and tedious??? It's not like we gain anything cool out of them, if anything, they are just having a detrimental effect on our tournament and spire performances. 10 breeding facilities updated to level 4 (btw I'm not even going to go into complaining about 1.1 m of mana to upgrade each and about getting ascended goods needed) are not enough. I think that settlement goods requirement for the last 10 techs should be halved at least. This chapter is lame.\t\tClick to expand...[BR]Really, May?  I have 8 researches that require settlement goods left to unlock and I just calculated how long it'd take to make the goods for all of them combined and it comes out as 44 days, so around mid-Feb.  I have 10 Breeding Grounds at level 4 and the BTG at level 31.  Got to the point where I don't need Ascended goods anymore about a week or so ago (just have to save 250K A1 goods for the final Fortress upgrade and I have that covered already and can beat decay with a minimal amount of trading per day).[BR][BR]I had loads of mana and seeds saved up before chapter arrived, so neither of those have ran out yet.  My EN3 city doesn't have as high a level of Maze of the Dark Matter or Sunset Towers, but even there it's not really been a problem, I just have to keep switching my Trader between Seeds and Unurium every few days and for Mana, Dragon Abbey has it covered (but I also passively make about a million mana per day anyway).  I used a total of about 300 each of 5-hour and 1-hour time boosters (per city) at critical points earlier in the chapter where they could be used to save time in the long-term by getting the Fortress and Breeding Grounds upgraded faster.  Clearing spire every week and various events ensured that I had a good stock of time boosters when the chapter arrived (e.g. I had a little over 800 5-hour boosts on each city).  I have no plans to use any more boosters this chapter now.[BR][BR]This chapter isn't really any more arduous than those that came before it.  I hadn't even looked at what this chapter entailed until it hit the live servers, so I didn't have it all planned out beforehand either, I just did what I usually do after the end of each chapter - stockpile mana, seeds and time boosters.  Oh and ofc I used MM enchants on my Sentient and Ascended manufactories (using the MM enchants, one of each kind of S/A manu. is enough)."}, {"39": "My BTG is level 16. I produce 361 creatures of the night and 237 creatures of the light in each of breeding facilities. In portal level 3, I produce 93 of ultimate creatures per slot. I have 10 techs to unlock still and my calculations came to over 100 days. I am not going to use any time boosters and I calculated 3 X 10 breeding facility productions per day. I guess BTG lvl 31 makes big difference."}, {"55": "They'll probably ease up some of the requirements when chap 20 is released and not enough people have finished chap 19 to start on it.  Inno seems to get carried away with the 'slow it down' strategy - they have become down right absurd about it.  I could take breaks between churning chapters (some people take months off from playing at all - glacier pace is not exciting).  I like having enough time (100 days) between them to use up some wishing wells and genies.  I have developed a fantasy wish list that I'll never ever see happen where new chapters take 3 to 4 months to finish and the entire settlement size completely fits within 3 5x5 expansions - and upgrading existing buildings shrinks them in size.  They could pretend they invent something transistor like, (hire Lilliputians, what ever) - resulting in everything getting smaller (while they produce more). I know it'll never happen but I can dream if I want to."}, {"12": "BonnyGwen said:\t\t\tI know it'll never happen but I can dream if I want to.\t\tClick to expand...You don't need diamonds to have dreams  [smilie--sprite1][BR][BR]BonnyGwen said:\t\t\tThey could pretend they invent something transistor like, (hire Lilliputians, what ever) - resulting in everything getting smaller (while they produce more).\t\tClick to expand...Or the guest factories could turn into smaller portals, with access to the larger factories in the guest race dimension. i.e. not in my back yard [smilie--sprite7]"}, {"70": "Regina8 said:\t\t\tMy BTG is level 16. I produce 361 creatures of the night and 237 creatures of the light in each of breeding facilities. In portal level 3, I produce 93 of ultimate creatures per slot. I have 10 techs to unlock still and my calculations came to over 100 days. I am not going to use any time boosters and I calculated 3 X 10 breeding facility productions per day. I guess BTG lvl 31 makes big difference.\t\tClick to expand...[BR]It does![BR][BR]At level four I am producing 401 Creatures of the Night.[BR][BR]Note: I used so far about Four Hundred (400) Diamonds in this chapter so far.[BR][BR]In my honest opinion, I feel that this Chapter requires more strategy, and to put some more thinking, but it is not very complicated, in fact, I found chapter 18 to be more tedious. The biggest challenge for this chapter is space and mana. [BR][BR]Unurium and seeds are tight. I started with Unurium Museums and Broken Dragon Statues, as well as the Trader for Unurium. I had event buildings in the settlement making seeds. As the settlement grew, I started to switch back and forth at the trader... and of course, Temple of Spirits, it is a must-have, mine is at level 7 (stayer), and I have enough. With the Winter Event its easier, and of course, multiplying x10 the worth for the Spire, and I get over 200K per run.[BR][BR]On my end, I managed to fit 11 Breeders at level 4 (currently, 3 leveled up, but the room is available for the others to grow 6x6) Additionally, I am fitting two level 2s, and I will be able to add three-level ones. I focused solely on Black Matters at first, so I do not need to waste room with Towers, which means one more lv1 Breeder.)[BR][BR]How about the room? Simple... BTG at level 31 yields massive amounts of resources from Wholeseller. Furthermore, Magic Workshops yield massive amounts of tools in this chapter (even more than the previous), so with enchanted Magic Workshops, you manage to purchase each good four times every day (and possibly some with the Gold too.) Ancient Wonders that help with tools productions and Neighbors are all at level 6 (a goer level, otherwise, it would be 7), but I keep a culture of 170% Endowed up to 285-420%. [BR][BR]This of course requires participating in the tournament, to keep a good flow of spells. But guess what, if you build Dragon Abbey to level 31, you produce a little over than 26.000 mana PER SPELL. This MASSIVELY helps with the mana requirements.[BR][BR]Thanks to this, you can reduce the number of manufactories, you don't need them, not even one for the Boosted Standard goods. I keep one of each for aesthetic reasons. This alone yields you a lot more space for the settlement, and to build more Breeders. This week I negotiated millions of goods as I pushed 75 provinces this week (20250 pts at Winyandor) to get plenty of spells for mana, I auto-fight most, but 75 provinces needs also negotiating if you wanna make it hahaha.[BR][BR][BR][IMG]https://i.ibb.co/TqDZ3cW/https-en-forum-elvenar-com-index-php-attachments-goods-jpg-6043.jpg[/IMG][BR][BR]I do not know how long it will take me, I do not obsess with that, but its a nice chapter.[BR][BR]It is tough, and I sweat bricks with the mana requirements, but isn't that part of the game too? With or without complains, we all will manage this chapter too, but you need a lot of planning. With the mana requirements from Chapter 18, we already were cued to work our Dragon Abbey to level 31 the least."}, {"29": "Anyone good at maths ? Is it cheaper to produce Ultimate creatures using Creatures of the light or Creatures of the night ?"}, {"53": "Robbo1894 said:\t\t\tAnyone good at maths ? Is it cheaper to produce Ultimate creatures using Creatures of the light or Creatures of the night ?\t\tClick to expand...[BR]It doesn't matter. Both cost almost exactly the same."}, {"12": "Far Reach said:\t\t\tIt doesn't matter. Both cost almost exactly the same.\t\tClick to expand...Damned if we do, damned if we don't  [smilie--sprite6]"}, {"6": "Far Reach said:\t\t\tIt doesn't matter. Both cost almost exactly the same.\t\tClick to expand...Almost only counts in horseshoes and hand grenades.[BR][BR]While I claim the Elvenar Forum TradeMark on Semi-Pointless Math, would someone like to provide some details, please?"}, {"39": "My BTG is level 26. To produce 102 of Ultimate Creatures in the Fortress, I need 660 of Creatures of the Light and 1000 of Creatures of the Night, which is a standard for everyone with the Fortress of lvl 3. I am currently producing 254 creatures of the light per 6 hours in a breeding facility of lvl 4; and 388 creatures of the night per 6 hours. [BR]So: 660/254 = 2.5984[BR]    1000/388 = 2.5773[BR]Both can be approximated to 2.6, which is what @Far Reach said."}, {"6": "Thank you for the numbers."}, {"2": "I am at the end of the chapter (finally!!!!) and I am asked to produce  Featherweight Chainmail. No idea what it was until I checked all my \"Refined goods\" manufactories. Sooo, that  Featherweight Chainmail thing is the 9h Ascended production from a Silk manufactory. My boosted Ascended goods are Ethereal Aerosols (Crystal manuf). Why I am asked to use a non-boosted manufactory? I think it's plain stupid after 19 chapters where we were taught to keep only boosted manufactories and trade for the other goods.[BR][IMG]https://i.ibb.co/DYwJ5Tx/https-en-forum-elvenar-com-index-php-attachments-featherweight-chainmail-ch-19-jpg-6291.jpg[/IMG][BR][BR][IMG]https://i.ibb.co/fp8S90S/https-en-forum-elvenar-com-index-php-attachments-silk-manuf-jpg-6292.jpg[/IMG][BR][BR]The next quest is asking either to Sell the Fortress OR to unlock the Ultimate Power. There is no \"or\" - you have to sell the Fortress in order to complete the last tech > Ultimate Power.[BR][BR][IMG]https://i.ibb.co/Hzhm1hJ/https-en-forum-elvenar-com-index-php-attachments-ch-19-non-sense-quest-jpg-6293.jpg[/IMG]"}, {"48": "Alcaro said:\t\t\tI am at the end of the chapter (finally!!!!)\t\tClick to expand...[BR]Great! [smilie--sprite1][BR][BR]It's still 45 days to go for me including finishing upgrades of 25 breeding facilities but I did started only two months ago. It's surely a different chapter than previous ones. I can't wait to see the next chapter. I'm surely getting prepared for even bigger challenge."}, {"14": "Silly Bubbles said:\t\t\tI'm surely getting prepared for even bigger challenge.\t\tClick to expand...[BR]A challenge for your patience, really."}, {"1": "Alcaro said:\t\t\tThe next quest asks either to Sell the Fortress or unlock the Ultimate Power. There is no \"or\" - you have to sell the Fortress to complete the last tech > Ultimate Power.\t\tClick to expand...[BR]It is for our most avid players who might have sold the Fortress of Revenge beforehand. Due to this chapter's nature, the possibility of selling the Fortress of Revenge before completing the chapter is trivial but present. These players will still be able to complete the Questline. The game needs to check that the \"Ultimate Power\" is activated, hence the wording."}, {"2": "anonglitch said:\t\t\tIt is for our most avid players who might have sold the Fortress of Revenge beforehand. Due to this chapter's nature, the possibility of selling the Fortress of Revenge before completing the chapter is trivial but present. These players will still be able to complete the Questline. The game needs to check that the \"Ultimate Power\" is activated, hence the wording.\t\tClick to expand...thankfully I am done with all quests but IIRC only the lvl.4 Fortress gives that \"thing\" (sorry, I already forgot its name) when it's sold, necessary to unlock the last tech. Am I missing something?"}]