[{"48": "Alcaro said:\t\t\tthankfully I am done with all quests but IIRC only the lvl.4 Fortress gives that \"thing\" (sorry, I already forgot its name) when it's sold, necessary to unlock the last tech. Am I missing something?\t\tClick to expand...[BR]It's possible that you can unlock it with diamonds as usually research can be completed this way. Anyway, I'm not sure, I'm not there yet, I still got some blinking to do. [smilie--sprite8]"}, {"12": "Blanking Ch XIX research is a blinking pain in the blanking neck!  [smilie--sprite12] [smilie--sprite1]"}, {"48": "Oops, I might've overdone it again, this is my biggest settlement yet. [smilie--sprite8][BR][BR][IMG]https://i.ibb.co/nPCv3R6/https-en-forum-elvenar-com-index-php-attachments-chapter-19-png-6321.png[/IMG]"}, {"12": "Silly Bubbles said:\t\t\tOops, I might've overdone it again, this is my biggest settlement yet. [smilie--sprite8]Click to expand...That's not a settlement. It's an invasion of biblical proportions.  [smilie--sprite1]"}, {"46": "anonglitch said:\t\t\tIt is for our most avid players who might have sold the Fortress of Revenge beforehand. Due to this chapter's nature, the possibility of selling the Fortress of Revenge before completing the chapter is trivial but present. These players will still be able to complete the Questline. The game needs to check that the \"Ultimate Power\" is activated, hence the wording.\t\tClick to expand...... Being still in mid-Halflings, I know virtually nothing about the mechanics of the game's final Chapters, including Ch.19 - but thinking about it, it's quite interesting that the Ch.19 Questline can be completed both by the 'traditional' route (for most players?) of methodically completing Researches roughly in order and the less-traditional (and I'll bet even more gruelling - I am at least aware of that aspect of Ch.19!) route of selling the Guest Race Portal (which I'm assuming the Fortress is?) at some point before the Chapter is otherwise completed, and the next Chapter is opened up, so those players who haven't completed some, any, or all of the previous Chapter's Quests can simply cancel them.[BR][BR]After all - there IS no Chapter beyond Chapter 19, at the moment... although when there is, I'm assuming that Inno won't be including any Quest which requires selling the Portal for a reward - wow, that would be, er, annoying [politeness is the thing... haha]. In fact, and since I really do know  SO little about Chapters 16-17+ ... are there any 'Sell Portal' Quests in those later-game Chapters at all, or do they stop entirely by that point?[BR][BR]I myself am not planning to advance much beyond the vital 'All-3* Merc. Camp Troops' point in any hurry, if at all... well, unless as-yet unforeseen future game alteration(s) can make those terrifyingly vast Squad Sizes - and lengthy, Resource-demanding Researches - very worthwhile indeed...! [smilie--sprite8]"}, {"9": "does the fortress need to be level 4 in order to receive the supreme matter when sold?"}, {"5": "@kimkimkim Yes it does  [smilie--sprite1]"}, {"9": "Herodite said:@kimkimkim Yes it does  [smilie--sprite1]Click to expand...wahhhhhhh.......ty @Herodite"}, {"4": "Finally got through the tech of this one, followed the storyline, anyone know how many quests come asking for unusual productions after the 200 diamond one for the usual completion of a chapter?"}, {"48": "m4rt1n said:\t\t\tFinally got through the tech of this one, followed the storyline, anyone know how many quests come asking for unusual productions after the 200 diamond one for the usual completion of a chapter?\t\tClick to expand...[BR]Here's the quest list:[BR][BR]Stephen1 said:@Lissette a guide to chapter 19 revenge of the exile can be found at: https://cavalieridellozombiaco.blogspot.com/p/la-vendetta-dellesiliato-capitolo-xix.html[BR]The page and site that the guide comes from is in Italian so you will need to translate into English.\t\tClick to expand..."}, {"4": "Silly Bubbles said:\t\t\tHere's the quest list:\t\tClick to expand...[BR]Thank you, looks like I have 2 quests left now to complete the storyline. [smilie--sprite1]"}, {"48": "Is the last research worth unlocking?[BR][BR]I kind of like looking at the portal at this moment and the research doesn't seem to offer much so I'm wondering whether it's better to wait till they release next chapter before I unlock it. I might sell the portal a bit earlier, we'll see. [smilie--sprite6]"}, {"14": "Silly Bubbles said:\t\t\tIs the last research worth unlocking?[BR][BR]I kind of like looking at the portal at this moment and the research doesn't seem to offer much so I'm wondering whether it's better to wait till they release next chapter before I unlock it. I might sell the portal a bit earlier, we'll see. [smilie--sprite6]Click to expand...[BR]Doesn't give you anything special whatsoever."}, {"46": "OK, so who's going to open the book on whether or not Chapter XX will be the final Chapter - in their present form?[BR][BR]My bet - I'll offer up ALL the many PPs and Coin / Supply Instants I win every week without fail in the Spire - randomly, of course! - for 10K Spell Fragments. No, make that 5K. I currently have >100 of them... just after [again] reaching Gold Spire level, this week - and with 6K at Spire start.[BR][BR]Haha. If I didn't laugh, I'd cry... while Disenchanting another bucket-load of 5% and 10%-value PPs and Coin/Supply Instants [worth more pro rata], just to make up [fewer than] the Spell Fragments I should have won... according to the always extremely accurate stated RNG odds, that is... [smilie--sprite2]"}, {"71": "Herodite said:@kimkimkim Yes it does  [smilie--sprite1]Click to expand...So this is the benefit to upgrading to lvl4? I've been wondering if it's worth the resources. Though, I can't see Inno letting us get away with not fully upgrading a portal... :/"}, {"5": "HollyGolddust said:\t\t\tSo this is the benefit to upgrading to lvl4? I've been wondering if it's worth the resources. Though, I can't see Inno letting us get away with not fully upgrading a portal... :/\t\tClick to expand...[BR]You'll need to in order to finish the Chapter!  [smilie--sprite1]"}, {"2": "HollyGolddust said:\t\t\tSo this is the benefit to upgrading to lvl4? I've been wondering if it's worth the resources. Though, I can't see Inno letting us get away with not fully upgrading a portal... :/\t\tClick to expand...indeed, as a portal you don't get anything special, but selling it, will give you an item (forgot its name) which is needed to unlock last tech. [smilie--sprite1]"}, {"71": "Alcaro said:\t\t\tindeed, as a portal you don't get anything special, but selling it, will give you an item (forgot its name) which is needed to unlock last tech. [smilie--sprite1]Click to expand...Thanks for the info!"}, {"12": "Alcaro said:\t\t\tindeed, as a portal you don't get anything special, but selling it, will give you an item (forgot its name) which is needed to unlock last tech. [smilie--sprite1]Click to expand...True. Another way to unlock that pesky critter is to throw diamonds at it.  [smilie--sprite6]"}]