[{"102": "Přidává Simia Sapiens jednotky i při sběru z divů?"}, {"43": "nepřidává.Jen při rekrutování v kasárnách."}, {"102": "Předpokládám tedy, že kromě kasáren i cvičák a tábor. Jen ty běžné, to je škoda [smilie--sprite3] v kásárnách už neplánuji cvičit když mi bude většinu z nich dávat nějaký div."}, {"5": "ano jen standartní výroba vojska v divech se nic nenavyšuje..."}, {"31": "Termín veľkonočnej udalosti je už známy a je uvedený v prehľade."}, {"153": "Ahoj nemáš tam náhodou překlep?? Nemůže to přeci končit tři dny před začátkem. [smilie--sprite2][BR][BR][BR]Tak se moc omlouvám moje chyba neměl jsem brýle když jsem to četl. [smilie--sprite1][BR][BR]Příspěvky sloučeny. Embla"}, {"94": "No Tak to vyslo perfektne. Prave jsem skoncil kapitolu..."}, {"154": "Ale docela by mě zajímalo, jestli tam dají nějakou inteligentní populační budovu, kult fenixe ani hnízdo fenixe mě moc nezaujalo."}, {"2": "kult je jedna z nejlepších co kdy byla, nemyslíš exkurzi?[BR]ale jsou tam i hlavní odměny z prvního fénixího eventu[BR]tedy myslím, že co se týče budov populačně kulturních, vybereš si"}, {"148": "Já si počkám na Fialové vejce Fénixe, přijde mi výhodnější než kult a hnízdo.[BR]Znovuzrození Fénixe by také šlo."}, {"154": "Kult fenixe má si hodně kultury, ale ta mě nezajímá, té mám přebytek, doufám, že tam budou nějaké budovy s přibližně vyrovnaným počtem kultury a populace jako byly u minulého eventu elfí a orčí vůz."}, {"11": "jestli dobře koukám tak kult fenixe má v poslední kapitole 6500 lidí a 8600 kultury na 20 polí a vejce 3300 lidí a 12200 kultury na 16 polí[BR][BR]A ted koukám na jinou budovu,taky s názvem kult fenixe a tam je to zase jinak [smilie--sprite1]"}, {"16": "Dnes na betě Kult Fénixe: (Pro kapitolu čarodějů 2900 pop 3900 kult 5x4), také dobrá velikost na rozčarování."}, {"119": "@ANCARY Úkoly k současnému eventu najdeš ZDE. @iDavis to sem dal už dávno s předstihem. [smilie--sprite1]"}, {"31": "Sneak Peek: Spirála #1[BR][BR]Spoiler: Sneak PeekTajemné místo v Elvenaru? [smilie--sprite9][BR][BR][IMG]https://i.ibb.co/tMkqBcP/https-i-ibb-co-w-RR5-Dfm-EL-sneak-peek-19-4-2019-1-png.png[/IMG][BR][BR]>>>​"}, {"16": "Že by došlo na temné elfy obětující lidi?[smilie--sprite8]"}, {"59": "Počkáme si, počkáme, však se určo dočkáme :-D[BR]Napínáky iDavise - co to bude nedozvíš se.[BR]Pak pár lehkých náznaků, skoro jako zázraků,[BR]objeví se tady zas, až poznání přijde čas."}, {"2": "Obětování lidí zní pěkně ale neveřím[BR]poslední kapitola hlásá že lidi a elfové jedno jsou[BR]ale jiné rasy jsou něco jiného, orkové jsou stále v otroctví, možná objevíme mlýn na výrobu vílího prachu nebo Amuního oleje"}, {"72": "Nemůžu si pomoct, dveře mi připoměly fable.. opět [smilie--sprite1]"}, {"16": "@GorGlin Jo četl jsem nějaké spekulace na beta fóru. Ale já popisy stejně nečtu a úkoly neplním (u úkolu mít 12 ostrovů jsem skončil, když jich mám 8)."}]