[{"31": "Veľký koncept.. [smilie--sprite1][BR]Sneak Peek: Spirála #2[BR][BR]Spoiler: Sneak Peek<<<[BR][BR][smilie--sprite9][BR][BR](kliknite na obrázok pre zväčšenie)[BR][IMG]https://i.ibb.co/8Dcpd1g/https-i-imgur-com-4-ZTdn-MS-png.png[/IMG][BR][BR]>>>​"}, {"94": "@iDavis Asi jsi pretizil server[smilie--sprite2]...[BR][BR]// Odstraněna citace. Jumala"}, {"31": "Chyba opravená, obrázok by sa mal teraz zobrazovať správne. [smilie--sprite1]"}, {"16": "Proč mi to jen připomíná DS? Akorát s jednou cestou."}, {"20": "Moc pěkná grafika, uvidíme, co se z toho vyklube [smilie--sprite1]"}, {"114": "wau! wau! tak ta je parádní !!! ..noooo, už jsem natěšená [smilie--sprite1]"}, {"43": "Zajímavé,pěkná grafika.Připomnělo mi to hru Skyrim,co jsem dříve pařil... [smilie--sprite1]"}, {"155": "Nebylo by spatny, kdyby se jednalo o podobnou funkci jako je ve FoE cechovní expedice [smilie--sprite1] Vím, že už máme dobrodružství společenství, ale zkrátka mi to ty expedice trošku připomíná. Kdo ví co na nás vývojáři chystají. [smilie--sprite1]"}, {"31": "Na bete dnes štartuje..[BR]Výzva - manufaktury[BR][BR]Spoiler: Výzva - manufakturyDoba trvania je 72 hodín, medaile sa tentokrát získavajú za produkcie v manufakturach, konkrétne za nasledovné úkony:[BR]3h produkcia - 10 medailí9h produkcia - 20 medailí24h produkcia - 40 medailí48h produkcia - 60 medailípoužitie kúzla - 10 medailí* všetky produkcie sa vzťahujú k manufakturam (nezáleží na tom či sú bonusové ani na ich type)[BR][BR]Odmeny:[BR]180 medailí = 500x úlomky kouzel[BR]540 medailí = 3x spojovací činidlo[BR]1080 medailí = 1000x úlomky kouzel[BR]1980 medailí = 5x spojovací činidlo[BR]3600 medailí = 25x opar vidění[BR][BR]Predpokladaný termín: čoskoro"}, {"11": "v libovolný manufaktuře nebo v bonusovce?"}, {"94": "Pise tam v libovolne..."}, {"11": "pardon, jsem ten řádek přehlíd."}, {"146": "vysledna odmena zase nic, zadna knihovna, tak za tu namahu to nestoji, a kdo nema misto nemusi litovat"}, {"102": "No tak je to práce na 10 min, stačí mít 60 mramoráren, postavit to na 10*15 místo, tzn za těch 10 min to celkem stojí, ale kdyby to někdo musel nějak jako sbírat více to ne no [smilie--sprite1]"}, {"11": "přesně tak to zamejšlím, 60 mramoráren na dvoudenní výrobu"}, {"16": "@bohusDR 8 spojovacích činidel - to je 48h nepřetržité výroby v Magické akademii lv 5. Těch pár fragmentů navíc se taky hodí (a 1/4 odměnové bedny jako bonus).[BR]Takže ano, stojí to za to (ovšem že ne všem, ale pro hráče, kteří by potřebovali magickou akademii zrychlit nejméně na dvojnásobek, je to určitě plus).[BR]Za mne by výzvy mohly být i častěji než jsou teď."}, {"3": "ale tím, že nejsou tajné to trošku ztrácí kouzlo. Kdyby byly výzvy snazší, ale předem na betě neprovalené, byly by opravdovou výzvou..."}, {"66": "Já jsem naopak ráda, že se tady šustne o každé výzvě předem. Nemám ráda, když na mě ve městě vyskočí něco vyžadující nadměrné přistavování lvl 1 budov a já nejsem připravená."}, {"102": "Vyzvou je spíše se na tu hru nevy... [smilie--sprite1]"}, {"31": "My presný dátum, napriek tomu že sa objavila s predstihom na bete, aj tak nevieme. Keďže je zvykom že na bete to býva 2 týždne dopredu tak sa môzeme len domnievať že niekedy zhruba o tie 2 týždne sa u nás objaví, ale len zhruba, lebo už v prípade, zdá sa mi že minulej výzvy, sa stalo že ju naschvál oproti tomuto tradičnému posunu o trochu oneskorili (aby to teda bola výzva)."}]