[{"5": "Výzva celkem: 3600 medailí = 360x sběr po 3. hod = 72hod je cca 24 sběrů po 3hod. = min. 15 celkem jakýkoliv manufaktur sbírajících po 3.hod /což je skoro nereálné/. Reálný sběr 1.aktivní varianta = 4x 3hod + 1x9hod za den tj. 60medailí na manufakturu a den x 3dny = 180 medailí na manufakturu a celou třídenní výzvu = 3600/ 180 je min. 20 manufaktur ve městě.  2. méně aktivní varianta: nutno přistavět a přepočitat [smilie--sprite1]"}, {"3": "iDavis napsal/a:\t\t\tMy presný dátum, napriek tomu že sa objavila s predstihom na bete, aj tak nevieme. Keďže je zvykom že na bete to býva 2 týždne dopredu tak sa môzeme len domnievať že niekedy zhruba o tie 2 týždne sa u nás objaví, ale len zhruba, lebo už v prípade, zdá sa mi že minulej výzvy, sa stalo že ju naschvál oproti tomuto tradičnému posunu o trochu oneskorili (aby to teda bola výzva).\t\tKlikněte zde pro zvětšení...no, kdybych náhodou stihl do té doby vyklidit orky, tak se možná připravím, ale jinak asi výzvu nechám výzvou a splním to, co bych splnil i normálně [smilie--sprite1]"}, {"114": "uf, to se mi ulevilo že tam není odměna artefakt, nemám totiž ve městech místo, kde bylo stojí teď studny [smilie--sprite1]"}, {"128": "@luterina Dotaz mimo tema.Ten profilovy obrazek co mas,neni to nahodou Pergler?[BR][BR]// Odstraněna citace. Jumala"}, {"114": "@Klimoriz ne ne, je to Jaroslav Malák [smilie--sprite1]"}, {"102": "no studny..., za 13 dní mi každá dala jednou 25 dia, super věc no [smilie--sprite8] k nezaplacení, mít tím zacpaný město, a dostat z toho jen tohle, resp z každé jen tohle, tak to se fakt nevyplatí no [smilie--sprite8]"}, {"31": "@ExplorerFfff jeden hráč z nášho spoločenstva z nich dnes dostal 750 diamantov. [smilie--sprite1]"}, {"117": "ja mam denne ze studen 150-400 dia, tak holt je to o stesti... plus nezanedbatelné množství VB a zasob"}, {"11": "@ExplorerFfff s dvěma studněma to nevytrhneš, to je snad logický a když jsi takovej počtář tak si  určitě spočítáš že tam za 10. dní je pravděpodobnost čtyř výběrů, tedy 100 diamantů."}, {"114": "@ExplorerFfff , mám studny od 5 do 19 na jedno město a je to o štěstí kolik diamantů na konci celkem v každém bude, ale už teď mám na 4 kouzelné obytky, jen čekám až na ně bude akce [smilie--sprite1] ..spíše se snažím město na některých místech komprimovat a okolo nich vzniklý volný prostor přesouvat na okraj města..., místo je prostě drahá komodita, někdo to řeší jinak, třeba \"bramborami v řádku\", hromaděním \"kulturního harampádí\" do rohu města a pod., i když s prostorem a využitím místa na maximum se dá pohrát i jinak než jen tím nejjednodušším způsobem, přes to se ho někdo drží jako klíště a neuhne z cesty ani o píď [smilie--sprite8] ..studny jsou prostě nejvíc! diamanty a zábava [smilie--sprite2][smilie--sprite1][BR][BR]..jinak nechápu, jak to že je tu tolik uvzdychaných a nešťastných když díky eventu mnohým z těch nejuvzdychanějším praskají sklady ve švech a město vzdychá nad novou kulturou a úplně božím ptákem [smilie--sprite1] nevděčníci jste! [smilie--sprite4][smilie--sprite4][smilie--sprite4][smilie--sprite8]"}, {"11": "však kromě explorera tu nikdo nevzdychá, já teda určitě ne, ani jsem nikdy nad nějakou hrou nevzdychal, možná za mlada při sexuálních hrátkách ale to Ty asi taky ne? [smilie--sprite1]"}, {"102": "No jenže vy na to koukáte jednoduše, dáte jich tam hromadu a pak vám to logicky sype, ale už nekoukáte na to, že jste v eventu nevyměnili vše, já si vyměnil vše, mám dost kultury i lidí, tzn mám klid i místo. Dostal jsem zadarmo dvě studny k tomu, no postaveno a dávají nula nula prd prostě, já to věděl, že budou dávat prd, stavěl jsem je jen proto abych se jich zbavil líp než rozčarováním - přeci jen z nich třeba něco padne. Ale píši to sem proto, aby lidi od dvou studen nečekali, že jím to bude sypat, protože z toho co píšete vy ten dojem minimálně já mám, při tom kolik dia vám to hodí to prostě znamená, že vám každý den musí polovina hodit dia, jenže to neodpovídá menšině.[BR][BR]Přítelkyně měla kdysi 4 studny a dnes jsem se jí ptal, získala z toho prý jen 110 dia a taky nechápe to nadšení, jasný když to dnes dává tak by měla 275 dia, jenže to mi na to zabrané místo v tom relativně malém městě přijde k smíchu, už staví max jednu, sorry jako lidi. Je to prostě jako by jste nechali opít rohlíkem pak, ke všemu pak navnadíte lidi, kterým bude smrdět ve městě sto dnů 2-5 studen, dostanou z nich třeba kulový.[BR][BR]Ovšem já chápu, že logika je tady velmi slabá stránka, ovšem kvantitou prostě nedoženete kvalitu, je to asi stejné jako když si vsadíte milion losů, taky logicky vyhrajete. Ovšem už nepočítat, jak to celé komplikuje situaci města, co ztratíte, jak to ovlivní situaci. Ale to je marný tady vysvětlovat, tady se smí hra jen chválit a ***** nad tím, co nám přidali [smilie--sprite8][BR][BR]A o tom mindrákovi, co má radost když mi někdo oponuje ani nemluvím [smilie--sprite8][BR][BR]PS. K luterině, to jak má kdo efektivní město poznáš podle toho kolik tam má silnic [smilie--sprite1] Efektivní město je do 200 silnic (nepočítat eventové a jiné farmy)[BR][BR]A klidně si mějte kolik chcete z nich dia, ale jestli můžou lidi psát kolik mají dia, tak by se mělo psát i jak na prd to padá když jich je málo, jinak značně deformujete veřejné mínění.[BR][BR]//Odstraněn nevhodný výraz, Dellingr"}, {"145": "Taky se tu nezmínilo, že dia se sčítají z obou světů,v tom je možná ten rozdíl markantnější,a ty dva města ten větší počet studen přecejen pohltí snáz"}, {"117": "ja za sebe mohu říct, ze studny se mi vyplati... mam je pouze na jednom svete v poctu 17ks, ze kterych denne dostanu v průměru 300 dia, 30 a vice VB, 200k zasob, 1,5kk minci, desitky surovin t3...[BR][BR]a jak pise @luterina, je to i predevsim zábava, kterou by si mel kazdy ve hre ucit jakou chce, me osobne vzdy bavily studny, proste kazdy den mit xkrat prekvapeni... nekoho to holt nebavi. ale neni duvod, abys tu @ExplorerFfff neustale někoho nazýval pomalu mene inteligentnim a nepremyslivym... vis, ne vsichni hraji hru tvym stylem, a to bys mel jednou pro vzdy pochopit a respektovat... pro tebe byly dulezite vymeny event budov, pro me ne, nemam je zapotřebí, chci mit diamanty a 2x denne zabavu a překvápko ve forme studny, tak se a tim už smir a prestan tu neustale vsechny s jinym nazorem poucovat a ponižovat[smilie--sprite10]"}, {"126": "ExplorerFfff napsal/a:\t\t\tEfektivní město je do 200 silnic\t\tKlikněte zde pro zvětšení...[BR]Opravdu? Platí to i pro hráče s 80.rozšířeními stejně tak jako pro hráče s 120+ rozšířeními?  Né každý hraje tuto hru pro takovou efektivnost či podobným stylem, jako Ty. Těch lidí bude troufám si říct i přes 90%.  [BR]To, že někdo zde popíše svoji radost ze studní už pro ten pocit překvapením, co bude a Ty to vehementně vždy odsoudíš, nechápu Tě. Přitom jsi dle mě velice inteligentní a sečtělý člověk. Ale není každý, jako Ty. Sám na Diamanty ze studen moc štěstí nemám (mám 9.studní) , ale jak tu už bylo psáno, většině lidem jde o to, že mají o důvod víc se těšit zapnout hru a těšit se z šance, co studna nabídne, a je jedno, jestli získám 25 dia nebo 200 dia, O to víc mě to pak pozitivně nakopne, když se získá víc. Žádná logika, žádné propočítávání.. prostě jen radost z neznámého [smilie--sprite2]  Neber nám to neustále prosím [smilie--sprite6]"}, {"102": "To že se to sčítá vím, ale to je jen další věc nad kterou se pozastavuji, že se někomu vyplatí hrát stejnou hru dvakrát, když rozdíl je jen v jiný grafice, jinak stejně jednoduchá hra, ale v tom bude právě asi ten rozdíl, co já nechápu, asi toho času mají lidi tolik, že pro ně není tak cenný a pak jsou vlastně rádi, že ho můžou zabíjet tím, že klikají a klikají.[BR][BR]Studna zaplácne místo na 100 dní, za tu dobu budou minimálně dva eventy a tudíž mě to pobavilo skrz ten výkřik nahoře, že tam snad nebude artefakt, protože s tím jak nasadili tempo, se dá očekávat že bude DS, dvě výzvy a snad dva eventy. A lidi mají plné město studen a co když tam ten poslední artefakt bude, doufám v to a jak budou pak bědovat, za těch pár dia [smilie--sprite1][BR][BR]@donutka To nemyslím nijak ponižujíc, ale mě prostě zaráží to, že někdo nevidí občas souvislosti, kolikrát vidím narvané město manufakturama a dílnama, aniž by ten hráč hrál turnaje, říkám si proč? Sysel? Nebo hráč hraje turnaje tak, že se to dá v klidu bojovat, opět miliarda budov k ničemu. No a takovým lidem pak nadělá inno studny a oni jdou a opět tím zaplácnou celý město - ostatně kolik lidí má ve městě všechny ptáky, jen proto že je dostali a o je to, na co tu často narážím [smilie--sprite1] Ano, já tu hru hradu strategicky, ostatně je to budovatelská hra, takže promiň, že nechápu co je zábavného dvakrát za den kliknout na random generátor odměny [smilie--sprite8][BR][BR]@BiggJOEcz Platí, to že máš totiž 130 znamená zpravidla, že máš více místa na rasu či eventy, ale neznamená to, že musíš to město narvat k prasknutí manufakturama, já mám rozšíření 124 při 206 silnicích a od určité doby, se prostě silnice motají okolo dvoustovky ale pak vidíš lidi, co třeba jsou o dvě tři rasy zpět a vidíš, že mají třeba silnic 300, tzn tohle je základní známka jak poznáš, že máš efektivní město, jasně, že pokud si někdo narve město manufakturami pak nebude mít místo na rasu, bude mít hodně silnic ale reálně to moc nikam nevede a je to už moc klikání za málo užitku."}, {"117": "@ExplorerFfff ty se tu neustale ohanis tim,ze je  neco ztrata casu, ale to, ze tu denne pises sahodlouhe romany, ktere zaberou vice casu, nez moje hrani, to uz ocividne nevidis... a naposledy se vyjadruji: ty to nemusis chapat, jak kdo hraje a proc ma kdo kolik veci ve meste, staci, kdyz to konečně zacnes respektovat, ze kazdy chce hru hrat JINAK NEŽ TY."}, {"102": "Pro mě něco napsat, je otázkou několika sekund nebo minut [smilie--sprite1] Netušíš, že psaní mě totiž živí, i když ne psaní slohů ale napsat sloh na podobného ražení to pro opravdu není náročnější, než spustit hru a zadat tam výrobu [smilie--sprite8]"}, {"117": "jestli te zivi psaní s tema hrubkama, tak potěš pan bůh [smilie--sprite1]"}, {"102": "Číst si po sobě, co píšu na nějaké fórum? Jako opravdu? [smilie--sprite8] To víš jinak, říkám, neživí mě slohy ale za týden napíšu poměrně hodně věcí a hrubky tam technicky nasekat nejdou. Ale ty máš třeba čas klikat 2x na hru a ještě se tu se mnou hádat, tak kdo toho času plýtvá více? [smilie--sprite8]"}]