[{"117": "ja si ve hre nikdy na cas nestezovala, v tom je ten zasadni rozdil mezi tebou a mnou "}, {"102": "Člověk bez nohou si zpravidla taky nestěžuje, že je nemá ale to víš, že kdyby ty nohy měl, tak se mu bude žít líp "}, {"117": "snad z tohoto arogantniho chovani vyrostes... protoze nedokážeš ani akceptovat to, ze kazdy ma jine priority a kazdeho bavi neco jineho a neni to zadny duvod k tomu, aby ses tu neustale nekomu vysmival a psal, ze tak je to spatne, kdyz kazdy ma moznost hrani svoji vlastni a uprimne me by nebavilo hrat hru, jak ji hrajes ty, ale kazdy si muze vybrat svůj styl hrani, kolik do hry vlozi casu ci penez, nebo treba to, ze budu mit ve meste jen prastare divy a zadne jine budovy... je to kazdeho svobodna volba, takze by to chtělo trochu tolerance, misto tech tvych vypoctu, ktere jsou vetsine hracum naprosto jedno"}, {"102": "Ty spíše máš tendenci mě stavit do role, že něco nedokážu akceptovat. Ano jsem sice takový sheldon cooper, pokud něco nedává smysl je to prostě hloupost a žádný vyšší smysl to prostě nemá, a opět ti řeknu další věc kde si zase odporuješ, divy produkují věci v závislosti na budovách, mít tedy pouze divy, což technicky moc nejde, ale i kdyby se zbouralo jen to co zbourat jde, bude většina divů produkovat krásnou nulu nebo nule se číslo blížící  A ano je svobodná volba takové město mít, ale asi to není věc, za kterou budeme někoho chválit ne, že hraje budovatelskou hru nějak jinak. Asi jako na kole jezdit hlavou dolů.[BR][BR]Ještě řeknu takové tajemství, tady se s vámi hádám, ale po tom co vždy to okno zavřu do doby, než mi přijde další notifikace si na to, že jsem tu něco řešil ani nevzpomenu a tudíž mě fakt ty města netrápí, ale rád diskutuji když je na co. Pravda tohle není zrovna moje parketa, zde nebudu sbírat palce, jako na politických diskuzích, kde mám poměrně úspěch pokud nepřijdou voliči vepřové hlavy, tam totiž se svým pragmatismem uspěji víc [BR][BR]Ale už toho necháme, trochu tu děláme bordel myslím "}, {"126": "ExplorerFfff napsal/a:\t\t\tmě prostě zaráží to, že někdo nevidí občas souvislosti, kolikrát vidím narvané město manufakturama a dílnama, aniž by ten hráč hrál turnaje, říkám si proč? Sysel?\t\tKlikněte zde pro zvětšení...[BR]právěže někdo ty \"souvislosti\" vidí, ale má jiné priority. To zase nevidíš ale ty. A dle Tvého \"vždy-posledního slova\" a vidinou Tvé herní vize a tím přizpůsobenými Tvými radami ostatním, vidět ani nechceš. Je to škoda.[BR]Ještě se zastavím nad Tvoji otázkou - Sysel?   A proč ne? Proč bych si v čase mezi kapitolami nemohl syslit suroviny? Je to neefektivní z pohledu mého myšlení v této hře?? Ty znáš moje priority, že všechny soudíš pro jakousi neefektivnost, která je maximálně jen v Tvých očích?  To místo májí lidi většinou zaplácané třeba proto, že DS nemá hlubší význam v jeho vývojové fázi hrát, události a eventy není přece třeba mít splněné všechny úkoly hned 3-4.den. I tak jdou splnit cca za 1/2 až 2/3 požadovaného času s přehledem. Že bude ze startu málo třeba essencí , když dávají první dny lepší budovy? Vždyt první 1/3 ukolů lze zvládnout většinou s přehledem, a na to ty essence stačí. [BR][BR]Tobě koukám stačí mít na konci hry po 4.manufakturách. Já to beru a nijak to nezpochybnuji. Stejně třeba že mezi kapitolama máš volný prostor 38x21 (téměř 800 políček) , když všichni víme, že stačí na kapitolu co 500.políček.  Vidím, že máš i 3.sety a věřím , že to máš propočítané přesně dle Tvých představ.  Také mám sety ve městě, a dohromady dávají pěkný ranec všeho možného (viz zde: https://ibb.co/PC9hX6v). A že to má být zbytečný? Není. Ty přebytky využívám třeba pro lepší výsledky v turnajích, jako velitel hlavně pro výpomoc mým spoluhráčům z Klanu, atd atd..  Ale co hlavně, můžu si s těmi přebytky v klidu vzít \"herní volno\" a budu vědět, že když se přihlásím opět po pár dnech do hry, nebudu muset ohledně surovin nic dohánět.[BR][BR]Škoda, že se přeci jen nechceš na určité věci dívat jinýma očima, než těma Tvýma   Každý hraje dle jeho uvážení. A kdo naopak potřebuje pomoc a řekne si o ni, pak to je právě TA tvoje šance těmto lidem věnovat Tvuj drahocený čas s pomocí"}, {"3": "ExplorerFfff napsal/a:\t\t\tPravda tohle není zrovna moje parketa, zde nebudu sbírat palce, jako na politických diskuzích\t\tKlikněte zde pro zvětšení...tohle asi mluví za vše. jestli ti jde o to sbírat palce (tedy mít ten názor, který má většina a ostatní jsou a priori špatné názory), tak jsi ještě smutnější bytost, než jsem si myslel.[BR][BR]Takoví lidé si myslí, že diskutují. Jenže principem diskuze je výměna názorů, respekt k ostatním řečníkům a ochota respektovat jiný názor. Tobě jde jen o sdělování vlastního názoru a jediným argumentem hlasitost. Opravdu se nejedná o diskuzi. [BR][BR]Ale v pohodě, takových podobných lidí je spousta. Ať už fandí vepřovým hlavám a nebo jiným hlavám, jsou to stejní ubožáci. Už jen proto, že pohrdají lidmi s jiným názorem "}, {"102": "@BiggJOEcz No ty sety jsou právě bezkonkurenční a ty sety ale mají výsledný efekt, že již moc nemůžu ani stavět kouzelné budovy, protože bych nedokázal sety táhnout dál spolu s kouzelnýma budovami, tzn pro mě už ani dia moc smysl nemají, není co za ně koupit a pozemky za ty ceny od 14 dál, už jsou nerentabilní. Opět to dojde do stavu, že lidi budou mít třeba 10 kouzelných budov, ale pak zjistí, že nemají dost RR. A sysel jsem tady, ale nedobrovolný, tak nějak se mi to syslí samo vše, nemám vyloženě nouzi o nic, to je právě tím, že to město je udělané taky aby produkovalo více, než kolik spotřebuje při té turnajové a eventové aktivitě co má - není tohle cílem budovatelské hry? být v černých číslech?[BR][BR]@Emhyr var Emreis II kde píšu, že to dělám pro palce? jen píši, že tam se spíše koncentrují lidi s mým myšlením, tudíž tam člověk nemusí řešit tyhle jiné roviny řešení problémy, ale spíše se diskutuje jak ten problém v té logické rovině nejlépe vyřešit. Tady je to furt jen diskuze, že když to někdo má \"propočítané\" , tak je to špatně protože to pak není zábava (jako by to byla zábava jakkoliv tyhle klikačky) "}, {"117": "ExplorerFfff napsal/a:@BiggJOEcz Tady je to furt jen diskuze, že když to někdo má \"propočítané\" , tak je to špatně protože to pak není zábava (jako by to byla zábava jakkoliv tyhle klikačky) Klikněte zde pro zvětšení...[BR]a tady jsi zase ukazal, ze jsi absolutne nepochopil nic... nikdo nepise, ze nekdo hraje spatne, krome tebe... kazdy at si hraje, jak uzná za vhodne a je fajn to respektovat, coz ty nedokazes a porad budes vsem cpat tve vypocty, i kdyz nektere lidi nezajimaji a nejsi ochotný přijmout fakt, ze hra se neda hrat dobre ci spatne,ale hra se hraje tak, aby te bavila a je uplne jedno, jak si kdo svoji zabavu ve hre vymysli nebo zařídí... tebe baví propocitavat, me to nebavi a nebyla by to pro me hra, ktera me bavi, ale byl by to pro me trest... nejsi schopny a ochotny prijmout jiny nazor, nez tvuj, a koukam, ze se to tyka i politiky... jakmile nekdo nejde volit někoho stejneho jako ty, tak je hned pod palbou tvych urazek... proč? protože vidi veci jinak a ma vlastni nazor?... pravda je totiz relativni pojem, a to bys mel zacit prijmout a nesnazit se za kazdou cenu pochopit, proc někoho bavi hra jinak, nez tebe, ale naucit se to prijmout jako fakt"}, {"102": "Pravda je jen jedna a určuje se vahou argumentů a důkazů. Zkus to u soudu, s tímhle přístupem  Na příští zprávu už reagovat nebudu, jen chci vyvrátit tvrzení, že kdo nevolí to co já, je špatný, nemám problém s voliči asi 5 stran, protože právě i když bych ty strany nevolil tak z jejich pohledu jsou racionální ale o tom zbytku se to říct nedá a to proto, že tam chybí argumenty, pokud nebudou argumenty proč hrát strategickou hru nestrategicky, tak to prostě nemůže být správná volba, nevím co na tom nechápeš. Správné je nekouřit, můžeš klidně kouřit ale asi víš, že neděláš správnou věc. Stejně tak hrát nestrategicky hru která strategická je, je hraní jinak, než je hra zamýšlena, tedy špatně."}, {"117": "tva poznamka se soudy je mimo,jinak by neexistovaly odvolaci soudy, ktere dost casto rozhodnutí predesleho soudu zmeni... to same, kdyz se s jednou veci soudís u odlisnych soudcu, tak je casto rozhodnuti odlisne, ocividne nemas s justici zkusenosti, tak prosim nepis o necem, o cem vis pouze z novin "}, {"102": "Právě, že mám ale to tu spíše nebudu rozepisovat. A nebavím se o tom, když se soudíš se sousedem, že ti padají jeho hrušky na tvůj anglický trávník, ale to trochu zásadnější věci, kde pravda je jen jedna a u odvolání uspěješ, pouze pokud důkazy zpochybníš nebo dodáš jiné, tam už to není o tom, jak se ten člověk vyspí. Chodit s nesmysli k soudu nemá smysl, ty nesmysl kde každý soudce řekne něco jiného je lepší řešit mimosoudně ale tam je potřeba aby obě strany měli trochu rozumu."}, {"117": "Kajinek by ti o nesmyslech mohl vypravet [BR][BR]PS: psal jsi, ze uz nebudes reagovat, tak se toho drz "}, {"156": "Pěkně jste to tu rozjeli. Prosím dodržujete dané téma a vyhněte se zbytečným konfliktům! Děkuji za pochopení."}, {"31": "Vyhliadka na slnovrat? [BR]Sneak Peek: Slunce, seno, Elvenar #1[BR][BR]Spoiler: Sneak Peek[BR]Letní slunovrat v dálí na obzore,[BR]stín vrhají pouze stavby ve Wiltshire. [BR][BR][IMG]https://i.ibb.co/F8dJSXk/https-i-ibb-co-hfm7w-PF-EL-sneak-peek-10-5-2019-2-png.png[/IMG][BR][BR][IMG]https://i.ibb.co/Y3xnbXN/https-i-ibb-co-1-G4jv-WC-EL-sneak-peek-10-5-2019-1-png.png[/IMG][BR][BR]>>>​"}, {"16": "@iDavis  Ty nás vždycky navnadíš a napínáš a vlastně se nic nedozvíme, dokud to nevypukne. Ty jsi na nás teda zlej."}, {"15": "@iDavis  Náhodou právě tohle mně na tom baví nejvíc , aspoň se mám na co těšit . "}, {"66": "Upgradovaná grafická úprava, tak to se teda rozšoupli. To se mi líbí.[BR]Mimochodem, ten dvoubarevný text je nějaká nápověda?"}, {"102": "Mě vždy více, než co znamenají ty nic neříkající spoilery zajímalo, kde ty informace asi bere, protože má věci co v kódu asi nejsou  Myslel jsem si, že je člen teamu ale když staví studny tak jím asi platí mizerně a nebo není "}, {"125": "ExplorerFfff Jeden kamarád děsně staví studny, aby to nevypadalo tak blbě, že mění reálný peníze za vobrázky, takže pak tvrdí, že silně namodralé město a  provincie má z nich "}, {"116": "@ExplorerFfff ad pravda a tvuj vyrok, ze pravda je jen jedna. Zkus si pustit todle videjko s Duskem, trva 2m16s. Treba to tvuj pohled na jednu jedinou pravdu alespon castecne zmeni. Me osobne pohled Tolteku, ze pravda je jen dohoda lidi oslovil a souhlasim s nim."}]