[{"3": "kalicz napsal/a: pravda je jen dohoda lidi Klikněte zde pro zvětšení...no samozřejmě. Lidé se dohodli na základních pravdách, které pokud by se začaly rozporovat, tak se už nikdy nikam nedostaneme. Ve fyzice máš třeba jednotky SI apod. :D[BR][BR]ale už jsme zase mimo, takže na elvenarský slunovrat se moc těším, zatímco na ten skutečný ne. Zima sotva končí a už se má zase zkracovat den... :("}, {"31": "@ExplorerFfff aby som dal veci na pravú mieru; nie som žiaden člen tímu, nikdy som nebol a ani ma nikto neplatí. Som rovnaký hráč ako ostatní.[BR][BR]@Prealiena dvojfarebný text je indikátor maximálne tak môjho deficitu nápadov, akú farbu po toľkých sneak peekoch ešte použiť.  Rovnako tak samotný obsah toho názvu.."}, {"117": "davis ocividne vi, kde hledat nebo sledovat [BR][BR]a ty reci o mizernem placeni vs. chudak si nekdo nemuze koupit diamanty... to nekdo nedokaze pochopit fakt, ze nekdo NECHCE davat penize do hry, i kdyz ma vysoke vydelky? nechapu tuto logiku, ze dia kupuji jen bohati a chudi ne..."}, {"116": "@Emhyr var Emreis II - no vidis a jsme u tech pravd. Diky za tvuj prispevek. Je to typicka ukazka takzvane pravdy ( no ofens ) .  Zeme je placata a pokud dojdes na konec, prepadnes pres okraj. Nerozporovat, nebo se nikam nedostanem, dogma. Zrovna ve fyzice co platilo pred 5-ti lety, pred rokem atd neplati. Prednaska profesora Kulhanka Nova soustava jednotek SI. Mimochodem doporucuju jeho prednasky, pokud se alespon trochu zajimas o fyziku, vesmir, astrofyziku atd. Nejznamejsi cesky fyzikalni youtuber  ...[BR]ad zakladni lidske pravdy. Kdyz si pustis toho Duska, pripadne nekoho jineho a budes nad tim trochu premyslet. Zjistis, ze prave tyhle zakladni lidske pravdy se neustale meni a je to porad jen ta dohoda lidi v dane dobe, v dane komunite atd ..."}, {"102": "@iDavis jo, no je to pro me zahada, bavi me proste vice hledat kde to beres nez co to je  nektere veci jsem nevyhrabal ani na jejich kanalech tak jsem dosel k jedinemu moznemu zaveru, musi existovat server pro team kde si predem osahavaji hru co jde ven, nebo co closed beta, tak mi prijde ze nektere veci co mas musi unikat z neceho takoveho [BR][BR]@donutka ty se taky chytis vseho, se koukni na smajliky a dej si cajik na nervy radsi "}, {"117": "ja jsem naprosto v klidu, na nervy nic nepotrebuju, tak si nech reci od cesty"}, {"91": "kalicz >> Ty přednášky jsou opravdu velmi zajímavé."}, {"72": "Na betě je nový event, letní slunovrat.[BR]Než Vám to sem iDavis hodí komplet, tak v kostce. Kdo počítali s tím, že se bude evoluce budov konat i nadále, měli pravdu. Samozřejmě, není to kompatibilní s fénixem. Vylepšuje se podle všeho jen jedna budova. Na lvl 10 bude dávat 2VB.. [BR]No a truhly jsou zas úplně jinak "}, {"11": "kurňa, tak brzo už..."}, {"65": "mohl by někdo poslat hodnoty toho stonehenge pro 10. úroveň a poslední kapitolu?  já tam v 2. kapitole vidím jen 3x zásoby, takže hádám, že to bude nějaká mana / semínka a tak."}, {"102": "No dává to stejně lidi jak se zdá, a místo mincí to dává více kultury, taková budova zdá se k prdu uvidíme, jaká bude produkce, se mi nechce to hledat.[BR][BR]těch reliktů bude třeba 9, to máme hned myslím 27 tisíc paliva do craftu, no krása ne? [BR][BR]Ale budovy mám vylepšeno, tak přemýšlím že tento event zkusím tahat studny abych vám to mohl omlátit o hlavu, že si lidi vymýšlí  Ale asi ne, nejsem blázen spíše najdu něco co půjde efektivně spálit "}, {"72": "Na betě jsem v orcích, takže dál nevím. Pro okry takto:[BR]"}, {"102": "Nedalo mi to, podle kódu to asi dává 10300 many a 1140 semen, k tomu asi 4000 kultury a 1980 lidí, ale lepší je když to někdo potvrdí, tyhle evolve budovy nevím zda to dává do kodu max nebo min. a blbě se to v tom hledá ve spěchu. V případě, že je to základ tak snad by mělo stačit vynásobit 1.7x ale dle screenu výše se zdá jako max.[BR][BR]PS. Hodnoty jsou asi pro 15 rasu, tzn pak jen 7800 many a 1010 semen, plus 3500 kultury, 1740 lidí[BR][BR]Artefakty mají hodnotu jen 960, tzn 1920 scriptů, není to tak dobré na podpal jako ty fenixové."}, {"31": "Na obzore.. [BR]Letní slunovrat[BR][BR]Všetky detailné informácie nájdete ako vždy v téme Události a úkolové linie. V tomto príspevku nájdete všeobecný popis udalosti a taktiež sa tu neskôr objaví textová verzia úloh.[BR][BR]Spoiler: PopisBehom udalosti budeme získavať Slnečné paprsky. Tie sa budú po novom objavovať aj ako odmena v Tajomnom objekte v craftení v akadémii, kde budeme môcť získať 200 paprskov so šancou 25%. Novinkou bude nová rozvinuteľná budova Stonehenge.[BR][BR][IMG]https://i.ibb.co/phZW0Jz/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-summer2019-summersolstice2019-tab02-png.png[/IMG][BR]Spoiler: Textová verzia úloh1. Získaj malé množstvo mincí[BR]2. Utrať 2 VB[BR]3. Získaj malé množstvo zásob[BR]4. Vyrob 3x nápoje[BR]5. Kúp 2 VB[BR]6. Získaj 1 relikviu[BR]7. Vyrob 5x obyčajné nástroje[BR]8. Získaj nejaké množstvo mincí[BR]9. Získaj nejaké množstvo zásob[BR]10. Vyrieš 2 strety ALEBO vyrieš 10 turnajových stretov[BR]11. Vyrob 4x chlieb[BR]12. Vyrob 7x obyčajné nástroje[BR]13. Získaj 3 relikvie[BR]14. Vyrob 3x košík jedla[BR]15. Vyrob 9x nápoje[BR]16. Vyrieš 4 strety ALEBO vyrieš 20 turnajových stretov[BR]17. Vyrob 5x pokročilé nástroje[BR]18. Získaj 2x ľubovoľné kúzlo[BR]19. Získaj 200x úlomky kouzel ALEBO vyskúmaj 1 technológiu[BR]20. Vyrob 4x sada nástrojov[BR]21. Utrať 9 VB[BR]22. Kúp 9 VB[BR]23. Získaj 5 relikvií[BR]24. Vyrieš 5 stretov ALEBO vyrieš 25 turnajových stretov[BR]25. Získaj 2x kúzlo Spojovací činidlo[BR]26. Získaj 300x úlomky kouzel ALEBO vyskúmaj 1 technológiu[BR]27. Vyrob 5x produkt základnej bonusovej manufaktury (3-hodinový)[BR]28. Vyrob 4x produkt základnej bonusovej manufaktury (9-hodinový)[BR]29. Vyrob 3x produkt základnej bonusovej manufaktury (24-hodinový)[BR]30. Vyrob 3x produkt základnej bonusovej manufaktury (2-dňový) ALEBO získaj 900x úlomky kouzel[BR]31. Vyrieš 7 stretov ALEBO vyrieš 35 turnajových stretov[BR]32. Získaj 4x kúzlo Spojovací činidlo ALEBO získaj 4 relikvie[BR]33. Vyskúmaj 1 technológiu ALEBO vylepši 1 budovu na level 14 alebo vyšší[BR]34. Získaj 4x kúzlo Spojovací činidlo ALEBO utrať 16 VB[BR]35. Získaj 400x úlomky kouzel ALEBO kúp 20 VB[BR]36. Vyrieš 8 stretov ALEBO vyrieš 40 turnajových stretov[BR]37. Preskúmaj 1 provinciu ALEBO vyskúmaj 1 technológiu[BR]38. Získaj 6 relikvií[BR]39. Dokonči 1 provinciu[BR]40. Získaj 3x ľubovoľné kúzlo[BR]41. Trénuj nejaké množstvo jednotiek[BR]42. Vylepši 1 budovu na level 11 alebo vyšší ALEBO kúp 30 VB[BR]43. Vyrob 10x chlieb[BR]44. Vyrob 8x košík jedla[BR]45. Vyrob 9x pokročilé nástroje[BR]46. Vyrob 7x sada nástrojov[BR]47. Trénuj nejaké množstvo jednotiek[BR]48. Vyrob 8x produkt základnej bonusovej manufaktury (9-hodinový)[BR]49. Vyrob 9x produkt základnej bonusovej manufaktury (3-hodinový)[BR]50. Vyrob 6x produkt základnej bonusovej manufaktury (24-hodinový)[BR]51. Vyrieš 9 stretov ALEBO vyrieš 45 turnajových stretov[BR]52. Získaj 5x kúzlo Spojovací činidlo ALEBO získaj 5 relikvií[BR]53. Vyskúmaj 1 technológiu ALEBO vylepši 1 budovu na level 14 alebo vyšší[BR]54. Získaj 5x kúzlo Spojovací činidlo ALEBO utrať 20 VB[BR]55. Získaj 500x úlomky kouzel ALEBO kúp 25 VB[BR]56. Vyrieš 10 stretov ALEBO vyrieš 50 turnajových stretov[BR]57. Preskúmaj 1 provinciu ALEBO vyskúmaj 1 technológiu[BR]58. Získaj 7 relikvií[BR]59. Dokonči 1 provinciu[BR]60. Získaj 4x ľubovoľné kúzlo[BR]61. Utrať 11 VB[BR]62. Kúp 11 VB[BR]63. Získaj 6 relikvií[BR]64. Vyrieš 8 stretov ALEBO vyrieš 40 turnajových stretov[BR]65. Získaj 5x kúzlo Spojovací činidlo[BR]66. Získaj 500x úlomky kouzel ALEBO vyskúmaj 1 technológiu[BR]67. Vyrob 11x produkt základnej bonusovej manufaktury (3-hodinový)[BR]68. Vyrob 9x produkt základnej bonusovej manufaktury (9-hodinový)[BR]69. Vyrob 8x produkt základnej bonusovej manufaktury (24-hodinový)[BR]70. Vyrob 7x produkt základnej bonusovej manufaktury (2-dňový) ALEBO získaj 1500x úlomky kouzel[BR]71. Vyrob 13x chlieb[BR]72. Vyrob 19x obyčajné nástroje[BR]73. Získaj 7 relikvií[BR]74. Vyrob 9x košík jedla[BR]75. Vyrob 23x nápoje[BR]76. Vyrieš 11 stretov ALEBO vyrieš 55 turnajových stretov[BR]77. Vyrob 11x pokročilé nástroje[BR]78. Získaj 5x ľubovoľné kúzlo[BR]79. Získaj 700x úlomky kouzel ALEBO vyskúmaj 1 technológiu[BR]80. Vyrob 8x sada nástrojov[BR]81. Vyrieš 12 stretov ALEBO vyrieš 60 turnajových stretov[BR]82. Získaj 6x kúzlo Spojovací činidlo ALEBO získaj 6 relikvií[BR]83. Vyskúmaj 1 technológiu ALEBO vylepši 1 budovu na level 14 alebo vyšší[BR]84. Získaj alebo použi 7x kúzlo Spojovací činidlo ALEBO utrať 28 VB[BR]85. Získaj 800x úlomky kouzel ALEBO kúp 40 VB[BR]86. Vyrieš 13 stretov ALEBO vyrieš 65 turnajových stretov[BR]87. Preskúmaj 1 provinciu ALEBO vyskúmaj 1 technológiu[BR]88. Získaj 8 relikvií[BR]89. Dokonči 1 provinciu[BR]90. Získaj 5x ľubovoľné kúzlo[BR]91. Trénuj nejaké množstvo jednotiek[BR]92. Vylepši 1 budovu na level 10 alebo vyšší ALEBO kúp 30 VB[BR]93. Vyrob 15x chlieb[BR]94. Vyrob 13x košík jedla[BR]95. Vyrob 11x pokročilé nástroje[BR]96. Vyrob 9x sada nástrojov[BR]97. Trénuj nejaké množstvo jednotiek[BR]98. Vyrob 11x produkt základnej bonusovej manufaktury (9-hodinový)[BR]99. Vyrob 13x produkt základnej bonusovej manufaktury (3-hodinový)[BR]100. Vyrob 9x produkt základnej bonusovej manufaktury (24-hodinový)[BR]101. Preskúmaj 1 provinciu ALEBO vyskúmaj 1 technológiu[BR]102. Vyrob 13x pokročilé nástroje[BR]103. Vyrob 15x košík jedla[BR]104. Vyrob 11x sada nástrojov[BR]105. Vyrob 19x chlieb[BR]106. Vyrob 15x produkt základnej bonusovej manufaktury (3-hodinový)[BR]107. Vyrieš 15 stretov ALEBO vyrieš 75 turnajových stretov[BR]108. Získaj 9 relikvií[BR]109. Dokonči 2 provincie[BR]110. Získaj 7x ľubovoľné kúzlo[BR]111. Vyrob 13x produkt základnej bonusovej manufaktury (9-hodinový)[BR]112. Vyrob 11x produkt základnej bonusovej manufaktury (24-hodinový)[BR]113. Vyrob 9x produkt základnej bonusovej manufaktury (2-dňový)[BR]114. Vyskúmaj 1 technológiu ALEBO vylepši 1 budovu na level 15 alebo vyšší[BR]115. Preskúmaj 1 provinciu ALEBO vyskúmaj 1 technológiu"}, {"16": "@ExplorerFfff Ono se taky může stát, že studny ve slunovratu nebudou (podobně jako nebyly v karnevalu). A pro spoustu lidí je to spíše výběr mezi budou dia ze studen / nebudou vůbec místo dia ze studen / koupím si je.[BR][BR][BR]Zdá se mi to, nebo už nebudou malé úkolové linie a místo nich budou častější velké eventy (přesněji větší (karneval, slunovrat) a velký (fénix, něco dalšího v létě)), tzn. až 8 / rok?"}, {"31": "@Lovec Krys je možné, že už od nich (aspoň čiastočne) upustili, viem si predstaviť, že veľký zárobok pre nich úkolové rady nepredstavovali. A pre nás taktiež nie.[BR][BR]Čo sa týka letnej udalosti, vypadá to tak, že získavanie, aspoň denných odmien, bude o čosi náročnejšie. Pôvodná fialová debna z fénixovej udalosti je teraz zdražená na 85 a má zníženú šancu na dennú odmenu (z 30% na 15%), avšak na druhej strane už konečne neobsahuje požehnání na mince. Debna s 30%nou šancou na dennú odmenu bude teraz nová fialová, za 142, tá dokonca obsahuje 5% šancu na 500 slnečných paprskov naspäť."}, {"66": "Takže oni plánují dát eventovou měnu (sluneční paprsky) jako odměnu v tajemném objektu při kraftění?[BR]A to jako vymění jednu z možných odměn za paprsky, nebo je přidají jako čtvrtou odměnu?[BR]A co pak udělají s těmi procenty na výhru?[BR][BR]Mám obavu, že to odnese pravděpodobnost výhry diamantů z tajemného objektu."}, {"31": "@Prealiena malo by to byť takto:[BR][BR][IMG]https://i.ibb.co/x5svsjt/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-summer2019-mysticalobject-png.png[/IMG][BR][BR]Teda ak sa nemýlim, znižuje sa tým šanca na ostatné odmeny (vrátane diamantov)."}, {"102": "@Lovec Krys to je možný, ono já to psal trochu jako reakci na situaci co mám doma, říkal jsem přítelkyni nestav si studny jsou k ničemu a nemáš místo, ona že na foru píší, jak z N studen získávají každý den stovky dia, tzn ze tří musí padnout taky a jí chybí jen asi 6 dia do dalšího levelu akademie, takže i jednou by jí stačilo, již je to asi 13 dní a ze tří neviděla dia ani jednou, teď přijde event a ona už politovala místo a tak bych to jen tak z nudy zkusil postavit, počítat jaká je reálná návratnost třeba z 10 studen, protože u nás je reálně produkce dia z 5 studen = 50 dia celkem od postavení což je směšný oproti tomu co se zde píše  A čistě výzkumně by mě zajímalo na jak špatné hodnoty se dostanu [BR][BR]No a to, že nebudou ty krátké eventy já osobně vítám, kromě valpružině noci kde člověk měl u každého ukolu urychlovače to většinou bylo \"moc práce za málo muziky\", tady člověk má celkem hodně věcí oko, jsem zvědavý na odměny a hlavně seznam úkolů, tedy náročnost a zisk toho smetí, to ukáže zda to bude výhodné dělat nebo ne."}, {"16": "@iDavis Pokud by bylo těch velkých událostí (i třeba se dvěma variantami, tzn. o pár dní kratší karneval a o pár dní delší fénix s různorodostí odměn) 6 - 8 ročně, vůbec by mi to nevadilo, kdyby se takhle komplentně nahradily úkolové řady. I ty studny by pak klidně mohly být jako denní odměna 4x ročně. Více velkých eventů také znamená, že velká část hráčů (včetně těch rychlejších) pak stihne nejméně 2 eventy za věk a tudíž se pak může soustředit na různé odměny.[BR]Mohli by dát i zase nějaký slušný set, co by mi mohl nahradit zimní set/neúplný karnevalový set (zejména ten zimní by se hodil za set z denních odměn, ať se nemusím rozhodovat, zda do stromků vrážet KR nebo ne).[BR][BR]@ExplorerFfff 3 studny jsou poměrně málo. To je lepší jich postavit více v době, kdy člověk to místo má (nebo s ním počítá). U studen to máš jako u craftingu, někdo z něj diamanty získal (i vícekrát), někdo ne. Jen u studen máš mnohem více pokusů, takže při dostatečném počtu studen a délce se ta šance srovná (pořád je to šance, takže se může stát, že někdo z nich vydoluje řádově méně dia než někdo jiný (tak jako v eventu si z truhel někdo vybere odměn 20 a někdo 2, byť většina bude mezi tím))."}]