[{"11": "ono je i deset málo, já už překročil 2500"}, {"28": "CorwinOfAmber napsal/a:\t\t\tmohl by někdo poslat hodnoty toho stonehenge pro 10. úroveň a poslední kapitolu? [smilie--sprite1] já tam v 2. kapitole vidím jen 3x zásoby, takže hádám, že to bude nějaká mana / semínka a tak.\t\tKlikněte zde pro zvětšení...[BR]Všechny hodnoty se už dají najít tady (úplně dole, rozkliknout příslušný level).[BR][BR]Stonhenge vypadá vzhledově parádně, ale ty hodnoty mě moc neoslovily, škoda [smilie--sprite3]"}, {"31": "V prehľade Události a úkolové linie - Letní událost je už uvedený kompletný zoznam úloh.[BR][BR]O zatiaľ chýbajúcej textovej verzii viem, tú pridám do príspevku pravdepodobne niekedy zajtra.[BR][BR]EDIT: Budova Stonehenge dostala mierne úpravy - zvýšenie produkcií. Tieto nové hodnoty ako už aj kompletnú tabuľku tejto budovy nájdete v téme Speciální budovy - Stonehenge."}, {"31": "Sneak Peek: Spirála #3[BR][BR]Spoiler: Sneak Peek<<<[BR][BR]Spirála, aneb tajemná věž v Elvenaru? [smilie--sprite9][BR][BR][BR]>>>​"}, {"148": "Tajemná věž v Elvenaru vypadá moc dobře. DS stále není, místo toho hned event letní slunovrat. Chystají pro nás nový způsob DS?"}, {"157": "Tajemná věž je nejen moc povedená, evokuje film Avatr a vzbuzuje otázky - rozšíří se město do vyšších sfér?[BR][BR]Odstraněna citace. Embla"}, {"102": "Nakonec z toho bude jen jiné pozadí, resp styl černé díry na konci DS a budete mít po srandě [smilie--sprite8]"}, {"148": "Doufám, že nemáš pravdu, jako jindy ve všech svých propočtech. To by bylo zklamání. Já se těším na něco nového."}, {"40": "Docela rád jsem četl Tvé pragmaticky/matematické komentáře. S odstupem času mám pocit, že jsi se \"zbláznil z peněz\" jako mí společníci. Je to jen hra, PRO ZÁBAVU! NE menežerské cvičení!!!"}, {"102": "Můžu tě uklidnit, já byl blázen ještě dřív že jsem peníze měl [smilie--sprite8]"}, {"40": "Fotr byl lotr! O mladším braráchovi ani zmínka!  [smilie--sprite3]"}, {"148": "Za sebe musím říct, že jsem ráda, že to někdo prezentuje i z pozice pragmatičnosti. To mne nikdy moc nebavilo počítat. Takže si přečtu a je na mé svobodné vůli zda využiju. Většinou půl na půl [smilie--sprite1] Něco pořídím z důvodu užitečnosti, ale klidně si postavím budovu, která se mi líbí. Jako teď se chystám získat a vylevlovat Stonehenge  kvůli designu stavby a fajn nápadu něco levlovat."}, {"66": "Stonehenge vypadá opravdu hezky, ale jeho statistiky nijak neoslňují a mám před sebou Amuni a místa je zoufale málo."}, {"102": "Já jsem sem chtěl ten stonehenge poslat s výpočtem, ještě v době kdy byla výroba 1d v kombinaci max vs div knihovna na 11 levlu + popkultutní vejce a ten div vyšel jako solidní propadák, protože semen dává 11 level divu prostě více při 5 sběrech za den, i lidi, kultura, kladiva a VB na tom byli lépe na políčko, pak to změnili na 48 a to už mi přišlo jako ztráta času počítat [smilie--sprite8] mě by nedonutili stavět ani fenixe kdyby tam nedali 50% utoku s pernamentnícm portálem a ulomky [smilie--sprite8] Ta budova je prostě co do lidí/kultury mizerná a jediná hodnota je efekt + ulomky a portál [smilie--sprite1]"}, {"66": "Zajímavé, že Stonehenge ani speciální efekt nemá, to už pak fakt nestojí za to stavět.[BR][BR]No, poděkujme za to designérům, alespoň ušetřím místo. To by dopadlo, kdybych musela stavět hlavní ceny ze všech eventů.[smilie--sprite9]"}, {"2": "barák 4x4 co mi dá každý den 2 VBčka?[BR]Já ho moc rád postavím"}, {"102": "@GorGlin Kdyby jsi si místo zbytečné storm fenixe pořídil fire, tak budeš mít desítky bodů týdne navíc za cenu 3*4 prostoru (protože 2*2 prostor z něj se bere jako trading outpost extra) [smilie--sprite8] [smilie--sprite7] Od doby fenixe mám každý týden navíc 70-100VB [smilie--sprite1] I když pravda, koukám že turnaje jeden aktivně celou dobu, možná je jedeš výkupem ale i tak si myslím že pro turnaje není takovým přínosem [smilie--sprite8][BR][BR]Hele fakt, to ti stojí za 1,5VB denně tolik místa? (3VB za 48h) Když knihovny dávají 1VB na tak málo místa tedy 0,5VB na čtvereček vs 0,093VB u stonehenge?"}, {"20": "Kdysi jsem hrála v cechu s hráčem, který pořád jen přepočítával hodnotu budov na políčka. Dokonce i divy a přitom přínos divů evidentně nepochopil. Dnes už nehraje. Hodnota jednotlivých budov se dá nahlížet z více hledisek. Dokonce i estetického. Prostě někdo chce mít ve městě něco, co se mu moc líbí a nehledí úplně na výhodnost. Určitě je dobré občas věci spočítat, taky to dělám, ale není to jediné hledisko. Výhodnost budovy je pro každého z nás trochu něco jiného."}, {"105": "ExplorerFfff napsal/a:\t\t\tNakonec z toho bude jen jiné pozadí, resp styl černé díry na konci DS a budete mít po srandě [smilie--sprite8]Klikněte zde pro zvětšení...Nestraš s dobrodružstvím. Ale když se nad tím zamyslím, tak černá díra je na houby. A POKUD by tohle patřilo k dobrodružství, tak by to byl částečně dobrý nápad. Ale neřešilo by to ten problém: Co bude, až když to dokončíš dříve. Já osobně doufám, že to bude nějaká samostatná akce a třeba i sólo pro jednoho hráče a ne týmovka."}, {"102": "@Ludi I divy maji ale prece smysl az kdyz na policko davaji dost, jaky smysl by melo v nizkem veku stavet divy co ti zaberou pul mesta a daji nula nula nic? Hrajete budovatelskou hru - cilem je mit ekonomicky silne mesto, tohle neni ikea planovac zarizeni pokoje kde resite ktera skrinka ma hezci korpus [smilie--sprite8] Jako klidne si to tak hraj ale je to podobne jako se na kole odrazet nohama misto slapani [smilie--sprite1][BR][BR]A gems ti hodnoty na policko zobrazuje, ja pocitam pouze predem sporne budovy abych si byl jisty ze mi treba neutece vyhodna budova ci set/hybrid [smilie--sprite1] puvodne jsem treba moc neveril zimnim stromum a po propocteni a slozeni hybridu mas nejvykonnejsi manovou budovu hry."}]