[{"137": "Tajemná věž.....? Příprava na další rasu....?"}, {"20": "@ExplorerFfff  Samozřejmě, že každý div na 1. lv. je slabý. Jenže divy se staví s výhledem do budoucna. A každý hráč, řekněme od 3. kapitoly, má období, kdy stojí ve výzkumu. Proč tedy nepostavit alespoň Zlatou propast a VB, které by jinak vyfučely oknem, nedávat alespoň tam? U divů je právě přepočítávání na políčko velmi sporná věc, protože už od 6 lv. je každý div přínos. Možná bych vyřadila jen Velvyslanectví, protože jakmile člověk čeká na průzkum dva dny, tak už se nevyplatí. Dřív bylo výhodné kvůli úlomkům run, ale ty dnes člověk snadno získá i jinak. Např. Fénix, Karnevalová sada a pod.[BR]Je jasné, že kulturní budovy je dobré přepočítávat z hlediska účinnosti na políčko. Většina z nás to dělá. Ale jen jsem chtěla poukázat na to, že jsou situace, kdy dá člověk přednost něčemu jinému.[BR]Myslím, že by sis měl odvyknout pohlížet na druhé tak nadutě.[BR]I já dávám přednost ekonomické výhodnosti, ale estetický vzhled města je pro mě také důležitý. Je to hra, která mi má pomáhat, abych se tu odreagovala. To je pro mě hlavní cíl. Jinak město mám ekonomicky vyvážené dostatečně.[BR]Víš, je opravdu víc způsobů, jak hrát tuto hru a není dobré, když tu přesvědčuješ pořád dokola, jak jedině ty znáš správný způsob. Nerozumíš všemu tak, jak si myslíš. Hodně mi připomínáš jednoho hráče..."}, {"102": "@Ludi Myslel jsem to jinak, většina divů dává % z města, pokud máš malé město dává ti málo. Zlatá propast se vyplatí vždy ale někdy do 6 věku jsem neměl většinu divů, protože v té době se proti jiným budovám naprostá většina nevyplatila svou velikostí, naopak později jsou divy nutnost, nejde bez nich žít protože město je tak velké, že ty % už se za to místo vyplatí. Do té doby se mi ale vyplatili kulturní věci, protože dávali víc [smilie--sprite1] Snad jsem to vysvětil, divy ale ne \"hned\".[BR][BR]No a s tím jak to vypadá, já bych s tebou souhlasil kdyby místa bylo dost ale místa má většina lidí málo a proto mi nepřijde rozumné ho plýtvat pro \"vzhled\" [smilie--sprite1] Jo dělat to lidi můžou ale to není správné chování ve hře, kde cílem je mít ekonomicky nejlepší město viz oficiální wiki \"vytvořte co nejefektivnější ekonomický systém\"."}, {"16": "@Ludi [BR]První seknutí záleží na tom, jak hráč hraje a kolik toho ví.[BR]Já se například poprvé seknul až ke konci trpaslíků, a s dnešními informacemi bych se poprvé sekl až u orků (vše bez zahrnutí portálových požehnání).[BR]Co se týče divů, tak tam to záleží na více věcech, jelikož každý div závisí na něčem jiném, tak složení divů hráče je hodně určeno jeho herním stylem (asi bude mít rozdílné divy hráč dávající a dostávající denně hodně motivací a nehrající turnaj od hráče, který je turnajově vysoce aktivní, ale na motivace kašle).[BR]Jinak zrovna Zlatá propast se vyplatí i na lv1 - někdy kolem 5. věku, pokud hráč do té doby jede plynule, není důvod stavět divy dříve (nezapočítávám do toho požehnání na VB z turnaje, s nimi možná o něco dříve)."}, {"20": "@Lovec Krys [BR]Na začátku toho většina hráčů moc neví. A snadno se stojí ve výzkumu kvůli nedostatku surovin, někdy i mincí a nástrojů. Nebývá to zastavení na několik dní, ale určitě pár VB uteče. A škoda jich. Hodně záleží na tom, jestli má hráč nablízku někoho, kdo mu v začátku poradí. Já měla tehdy kolem sebe lidi, kteří také začínali, tak jsme všichni tápali v základech. Dnes bych si v začátcích počínala úplně jinak. Každopádně Zlatou propast jsem postavila hodně brzo a nelituji. Byl to můj první div. Samozřejmě, že první delší zastavení bývá až u trpaslíků, to je pravda. [BR]A souhlasím, že složení divů velmi záleží na herním zaměření. O tom to celé je. Lidi můžou hrát jinak než já a přitom nemůžu říct, že by hráli špatně."}, {"16": "@Ludi Já toho moc na začátku taky nevěděl, ten příklad byl z mého hlavního města, které bylo mojí premiérou. Mi to bez sekání vyšlo až do trpaslíků, občas byť těsně. Na pár hodin - jednou jsem přišel asi o 10 VB, ale to bylo kvůli mojí blbosti, kdy jsem ráno točil bedny v eventu a získal z nich asi 50VB, kdybych je točil odpoledne, na těch pár hodin bych se nesekl.[BR]Zlatou propast jsem taky stavěl jako první, ale až v tom 5. věku. Do té doby jsem to táhl bez divů.[BR][BR]Mimochodem moje nevědomost a snaha získat více informací (a výhod s tím spojených) je to, co mě ve 3. věku dovedlo na fórum - proto mám např. vyzkoumané první 2 nepovinné zvětšení jednotek, naštěstí jsem fórum začal číst včas a další nezkoumal."}, {"20": "No já právě začala chodit na fórum dost pozdě, takže mám toho vyzkoumaného víc... ale teď už pár kapitol vynechávám a vnímám, že se situace zlepšila. Ono přeci jen ty první kapitolky není to zvětšení oddílu tak dramatické. Ale vědět to dřív ... Každopádně než člověk přelouská Wiki a jiné zdroje, tak to taky chvíli trvá."}, {"102": "Největší a jedinou chybou v té hře kterou jde udělat je zkoumat nepovinné oddíly jednotek, to je chyba kterou už nikdo nezvrátí a dost mu přitíží. Zbytek chyb lze vždy opravit a tohle se nedočtete ani na wiki. To jsem zjistil až náhodou někde z fóra snad v ementálech... [smilie--sprite1][BR][BR]osobně jsem také měl zlatou propast až někde z toho 5-7 divu, ostatní divy jsem začal stavět až v 9 věku, teprve tehdy začali dávat smysl, bylo v plánu jet turnaje totiž a město už dost velké aby se vyplatili."}, {"20": "Já začala tyhle výzkumy vynechávat v čarodějích, takže alespoň tak. Úplně přesně si nepamatuji, kdy jsem postavila Zlatou propast, ale hodně brzy. Tehdy jsem to udělala spíš proto, že se mi moc líbila. A vida, co se z toho časem vyklubalo [smilie--sprite1]"}, {"99": "A pak jsou tady tací, kteří už byli ve výzkumu bůhví kde, když do hry přišly divy a turnaje [smilie--sprite8]"}, {"16": "@Angedev Ale zase měli i výhody - např. cenu prémiových rozšíření.[BR][BR]@iDavis Jelikož na betě běží letní slunovrat, nechceš nám zase trošku zaspoilerovat na co se to vlastně máme těšit?"}, {"31": "@Lovec Krys v tomto príspevku a tomto prehľade nie je dosť o letnom slnovrate informácií?"}, {"16": "@iDavis Já myslel o spirále. Promiň, napsal jsem to neúplně.[BR]O slunovratu mám jako hráč na betě dost informací z první ruky[smilie--sprite1]"}, {"31": "Aha, k veži je toho síce hodne na spoilovanie, len sa vždy snažím trochu počkať na to, kým vývojári urobia nejaké ďalšie kroky vo vývoji a ja si tak overím, že veci ktoré sem dávam, nie sú len moje domnienky (najmä pokiaľ ide o informácie, než o grafiku). Stále nedokážem dať ruku do ohňa napríklad za to, pre koho tá udalosť bude (v zmysle, či pre jednotlivcov alebo spoločenstvá), čím ale môžem minimálne zodpovedať otázku, či to nebude len úprava víru v DS - nie, bude to nová udalosť (zrejme väčšia než samotné DS)."}, {"157": "ExplorerFfff napsal/a:\t\t\tNejvětší a jedinou chybou v té hře kterou jde udělat je zkoumat nepovinné oddíly jednotek, to je chyba kterou už nikdo nezvrátí a dost mu přitíží. Zbytek chyb lze vždy opravit a tohle se nedočtete ani na wiki. To jsem zjistil až náhodou někde z fóra snad v ementálech... [smilie--sprite1][BR][BR]osobně jsem také měl zlatou propast až někde z toho 5-7 divu, ostatní divy jsem začal stavět až v 9 věku, teprve tehdy začali dávat smysl, bylo v plánu jet turnaje totiž a město už dost velké aby se vyplatili.\t\tKlikněte zde pro zvětšení...Hraju od konce června, Divy jsem začala zkoumat, co nejdříve to šlo, ještě než jsem vstoupila do funkčního společenství. Od té doby znám elvengems, kde pečlivě pročítám výhody a nevýhody. Bez společenství jsme netušila, že úkoly v eventu jsou předem známy, a ani jsem neznala další užitečné odkazy. Vylepšení jednotek jsem naopak nikdy neaktivovala, chtěla jsem být mírumilovný hráč a přestože turnajuju o 106, kvůli VB a magické výrobě a relikviím, tak mě to tedy fakt nebaví. Na rady až nátlak společenství jsem pak knihovnu zbourala a hlubinu nestavěla. Až posléze jsem pochopila, jak dobré bylo rozhodnutí, nevylepšovat velikost oddílu. Tuším, že nepostavit MA vůbec nešlo (nebo jsem myslela, že to nejde). Obecně řečeno, hra se dá hrát i s chatrnou nápovědou od Inno, stačilo by krátké úvodní tipy na začátku rozumněji rozkošatit a začátečníci by pak netápali. Wiki ve srovnání s Elvengems nic moc."}, {"2": "ExplorerFfff[BR]Já postavil bouřného fénixe, protože mi dává VBčka[BR]postavil jsem i knihovničky a vůbec všechny budovy které mi dávají VBčka[BR]Turnaje jedu bojem, mám veškerou produkci i podporu, proč toho nevyužít.[BR]Mám i vyzkoumané všechny rozšíření oddnílu.[BR]Krom toho, že to ovlivňuje efekt některých divů, tak zvládám provincie získávat vojensky.[BR]Ikdyž jsem daleko za plánem Inno.[BR]Když pozbírám dost fénixích zlepšováků, tak ohnivého postavím, ale v turnaji asi o moc víc nepojedu, už takhle to všechno oklikat je docela fuška."}, {"102": "Tak to ale musíš jet manuál, nebo jak se ti to daří vyprodukovat to vojsko? Já zvládám jet více trvale až díky divům a pták dost pomáhá, ale jedu na automat, na manuál čas nemám."}, {"136": "@Arweene:[BR]Na knihovnu mě nikdo šahat nebude.. [smilie--sprite8]"}, {"66": "@Corwin22:[BR]A mně na hlubinu [smilie--sprite8]"}, {"102": "Obojí si myslím časem rádi zbouráte [smilie--sprite8]"}]