[{"158": "Hlubina je dobrý div do endgame. Produkuje více zásob než dílna a zároveň je na menším prostoru a nepotřebuje lidi."}, {"102": "Leda pro někoho, kdo se do hry přihlašuje jen jednou denně. Jinak je to div dost o ničem proti takovým věžím prosperity, které umí udělat boost kladiv mnohem větší."}, {"5": "A právě o tom to je = 1x denně, ti méně ,,dokonalí,, , méně zapálení a časově více omezení   hrajou ,,želbohu,, pouze 1xdenně a je pohodlné - pro ně, si raději sklidit 1x rozdávačnou hlubinu...navíc např. v poměru hlubina/dílna je na tom lépe hlubina a to nejen co do zabírání místa /hlavně pak s vyšším lev. a kap./...[BR][BR]ExplorerFfff napsal/a:\t\t\tjedu na automat, na manuál čas nemám.\t\tKlikněte zde pro zvětšení......a o tom to vše je o čase [BR][BR]Příspěvky sloučeny. Embla"}, {"102": "No jenže pokud hraješ jednou za den, tak zase nemáš takovou spotřebu na manufaktury a další věci, protože by jsi stejně nestihl zadat výrobu více krát, a ten kdo hraje 3x za den prostě z věží dostane víc, protože jednak lze občas použít kouzlo ale hlavně, těch 24 se furt posouvá, tzn ti co hrají jednou denne často přijdou o celých 24 hodin, je to na prd ta 24 výroba, nemám to rád protože to právě často skáče do druhého dne. Mělo by to být tak, že sice se další výroba začne vyrábět až za 24 hodin ale sebrat by šla třeba už 3 h před koncem, ale takhle jak to je, je to vždy k prdu."}, {"117": "proc tu je jeden jediny clovek, ktery neustale vsem cpe sve nazory... ja snad kvuli jednomu blbcovi prestanu na forum chodit... to je des"}, {"102": "Protože tohle je diskuzní forum a já diskutuji ke hře? Ty tady taky cpeš svoje s prominutím mindráky ze mě a nemám kvůli tomu potřebu sem nechodit.[BR][BR]Lidi jako jsi ty miluji, sami objektivně hrají minimálně zvláštně, ale mají pocit, že každý se jim musí klidit z cesty, protože kdo nemá názory jako oni, tak by své názory neměl vůbec prezentovat. Argumenty nemáš, protože většinu ti prostě dokážu shodit (logicky a matematicky) a to ti viditelně dost hýbe žlučí, protože jediné co proti mě máš, jsou nějaké své pocity, že to hraješ nejlíp jak to jde hrát. Jestli jsi si nevšimla, tak já nikomu nezakazuji zde psát jak to hrají, jak by se to hrát mělo, ale já pouze jdu a pokud mám pocit, že to jde hrát lépe, výhodněji tak to napíšu a je pouze a jen na lidech jak se k tomu postaví. Od toho forum je aby se zde diskutovalo, chápu pro tebe je forum místo kde si chodíš hrát nějaké hry nebo co to tam děláte, ale já sem chodím proto abych se dozvěděl jak nejefektivněji třeba tu hru hrát, co nejlépe postavit a případně najít jiný pohled na věc, to že zde většina lidí neumí hodit do placu argument ale jen své pocity, to je fakt ale již jsem tu diskutoval i s lidmi, co dokázali hodit do placu opravdu dobré argumenty proč něco postavit, například dračí opatství které jsem stavěl díky argumentům zde z fóra. [BR][BR]Mě by docela vyhovovalo kdyby tu bylo více lidí jako já, protože bych přišel, přečetl si že zatím event stojí za prd, že ta budova se nevyplácí a nemusel bych si to zjišťovat sám. Ale pokud už si dám práci a něco zjistím nebo spočítám, nejsem sobec a rád se o tyhle informace zase podělím, nehraji si na svém písečku."}, {"43": "Koukám,pěkně tu zase děláte bordel.Založte si vlastní téma,když chcete plácat voloviny..."}, {"117": "@ExplorerFfff nejsem jedina, kdo ti napsal, ze to prehanis"}, {"20": "@ExplorerFfff [BR]Chápu, že výhodnost budov je dobré počítat, ale na to mi stačí jeden pohled v přehledu budov od iDavise. (Dá se jít i na  elvengems.com, kde už to přepočítané na políčko je, ale to už ani nepotřebuji). Kouknu, co to dává a na první pohled vidím, jestli to má cenu nebo ne. Vedle ekonomické výhodnosti je třeba brát ohled i na velikost - prostě jestli na to mám místo. Často jde ve hře o kompromis, takže méně výhodná budova je někdy lepší než nic, když na výhodnější věc nemám plac. A někdy je nejlepší některé budovy ignorovat. Tvoje výpočty vždy sledují jen jedno hledisko, ale těch možností je prostě víc a vždy záleží na hráči, čemu dává přednost. V tom je to kouzlo této hry. Je více možností a je na každém hráči, jakou cestu zvolí. A nějak nemůžu najít tvoje město, abych se podívala na tvůj ekonomický zázrak."}, {"102": "@Ludi Ono ale nejde jen o tu budovu jako takovou, to samozřejmě jak píšeš hledám na gemsu, kde je to pro mě přehlednější. Ale to co mi tady chybí je věc co sem dávají snad jen dva tři lidi ve smyslu \"tahle budova se vyplatí více než tahle, nebo tahle budova je na prd protože divy A a B ti v součtu i přes svou velikost dávají více\". Protože to není tak snadné vidět na první pohled a to tu chybí, nebo kdekoliv.[BR][BR]Všude je pouze jednoduché porovnání budov ale nikoliv už porovnání v závislosti na funkci města. Většina lidí se prostě koukne na 24h výrobu a sedne si na prdel, nebo se koukne na 3h výrobu. U ptáků se zde porovnávala pouze budova vůči manufakturám, ale už se nekoukalo na provozní náklady nebo negativní věc pro většinu turnajových hráčů což je 24h a 48h výroba, kdy se to posouvá a zaručeně člověku někdy i jednou týdně uteče pak \"hodně surovin\" co pak dost zhorší výsledky té budovy v rámci týdenního průměru, to jsou věci co prostě nějak zřejmé nejsou jen z tabulku na gemsu a z toho teprve poznáte co je výhodná budova. A moje město je na CZ1, ty jsi na CZ2. Mě tyhle složitější statistiky chybí, protože to, že budova dává něčeho stejně nebo více ještě neznamená, že toho člověk tolik taky dostane. Jen za týden se mi sběr 24h výroby posune o 1 den, a jako odečíst jeden den ze sedmi, je zhoršení budovy o 15% a to není málo, co teprve lidi co se nepřihlašují 4-5x denně ale za týden se jím někdy ztratí i dny dva? pro takové už taková budova může značně ztratit smysl a kde tohle najdeš?"}, {"157": "Ludi, na všechna města se můžeš dívat na elvenstats.com, na rozdíl od gems jsou i v české verzi. Porovnám-li wiki, iDavis info, fórum, a elvengems, tak za mě nejlepší zdroj informací gems a elvenstats ."}, {"31": "Nastali malé zmeny v niektorých úlohách pre nadchádzajúcu udalosť Letný slnovrat. Aktuálny zoznam nájdete v prehľade Události a úkolové linie - Letný slnovrat.[BR][BR]Údajne dôjde ešte k ďalším zmenám, kedy niektoré z úloh so zadaním \"Preskúmaj 1 provinciu ALEBO vyskúmaj 1 technológiu\" dostanú 3. alternatívu - \"Získaj x opar vidění\". Tieto úpravy budú taktiež začlenené do zoznamu neskôr."}, {"3": "třetí varianta? jupí!!"}, {"5": "Prohlédl jsem si Stonehenge - hlavní odměnu a poprvé asi budu skeptický k jejím parametrům...  ...za to denní odměny vypadají slušně "}, {"102": "Jen aby tam těch slz herpesu nebylo moc  Protože při tom odpadu co tam je většinou, to není snadné si něco vybrat "}, {"31": "Tuším nejak 10-15 na úlohu.."}, {"20": "@ExplorerFfff Už jsem tvoje město našla, asi jsem to blbě prve napsala. Jo, máš to pěkný. Ale asi bych některé věci rozhodla ve městě jinak. Každý máme jiné kouzlo osobnosti "}, {"126": "škoda, že ten Stonehenge nedává raději bonus na životy vojska.  Co level, to 2,5% navíc, takže na 10.levelu by to bylo +25% HP (ideálně +50%  )celé armádě Pak by pro mě ta budova měla význam, když už v porovnání s Ohnivým fénixem dává místo 140.000 kladívek jen 15.000 . Ty životy navíc by se ke všemu tématicky perfektně hodily právě k Stonehenge.. Třeba jindy.."}, {"102": "Já jsem třeba rád, že ta budova stojí za prd, protože když se koukneš na gems tak uvidíš, že bychom jí vytáhli tak na 6-7 level jen  Takže člověk nemá stres, že by jí chtěl, nikdo normální nebude chtít utrácet - myslím, že pro hráče fajn počin, šetřit jim peníze ne? "}, {"159": "Dát mu makat s lopatou by asi dostalo smyslu jeho slov, ..... 3 x denně !!!, to by ty ručičky asi nedaly. Obraťme list, například v Bohnicích nebo v Kroměříži jsou PL pro patologické hráče."}]