[{"16": "@Emhyr var Emreis II[BR]No moc se neraduj, ta třetí varianta taky není nic moc. A craftit odpad kvůli tomu nebudu (i krmivo musím občas vynechat, jelikož katalyzátory neprodukuju dost rychle ani s lv5 a na výrobu kouzla magická výroba jsem rezignoval úplně (a co teprve chudáci s lv2 - to je furt získej x požehnání, vyrob 5xkatalyzátorů).[BR]ps: pro ty, co by nevěděli: Katalyzátor = Spojovací činidlo (ten český název se dle mě fakt nepovedl)."}, {"20": "Je pravda, že poslední dobou vyrábím v Akademii především to činidlo. Ale na druhou stranu díky Fénixovi získám hodně kouzel přímo z turnaje, takže v pohodě. S nakrmeným Fénixem jsou v boji podstatně menší ztráty vojska. A jelikož se bojová síla jednotek sčítá s posilou z divů, tak např. střelce mám momentálně na + 74%, takže je opravdu šikula  A to jsou tu lidi, co mají bojové divy na 30 lv., to se jim musí bojovat jak po másle. Kam se na ně hrabu. Ale nezávidím  V turnaji teď surky  potřebuji minimálně. Fénix je prostě pecka.[BR]Letní slunovrat bude zřejmě první event, na který vynechám... Nebo ho budu hrát velmi laxně. Uvidím."}, {"31": "Sneak Peek: Expanzie #1[BR][BR]Spoiler: Sneak Peek[BR][BR]Před:[BR][IMG]https://i.ibb.co/ZXx3VzV/https-i-imgur-com-6nt5-FVl-jpg.jpg[/IMG][BR][BR]Po:[BR][IMG]https://i.ibb.co/t8yyrVB/https-i-imgur-com-x0-Bsdir-jpg.jpg[/IMG][BR][BR]>>>​"}, {"148": "Jako vždy nás napínáš "}, {"154": "Já bych řekl podle toho obrázku a názvu, že přidají možnost nové plochy pro rozšíření města."}, {"102": "To já bych řekl, že nepřidají vůbec nic, jen se nudili, protože pracovat na zprávách nebo divech je nuda, ale tak překreslit pozadí aby třeba šlo mapu posunout výše, to je fajn zábava, tak nám tam nakreslili trochu více lesa, půjde lépe hledat bordel v z eventů nahoře když tam jsou ty \"akce\" a tím to celé hasne "}, {"148": "Na týmovém setkání Elvenaru v Hamburku odpovídali na otázky hráčů.  Rozšíří se stavební plocha města a bude existovat více provinčních rozšíření  Také  bude možné prostřednictvím aplikace posílat zprávy ostatním hráčům..prý se štěstím do konce roku. Snad mají na mysli tenhle  Tak uvidíme."}, {"102": "Tak to docela změnili názor, protože to není tak dlouho co na nějakém streamu říkali, že se zvětšovat mapa nebude "}, {"11": "Jedna řada rozšíření se přidávala vloni když začínala v srpnu nová rasa tak taky čekám že se letos další řada přidá. No ne že bych ji hned chtěl koupit, ještě mám víc než jednu řadu k dispozici."}, {"102": "Tak kupovat za peníze už to nebudu. Koupil jsem jich 14 a to je strop co do toho jsem ochotný investovat  To jestli to přidají pouze za dia, tak je to jako by to nepřidali vůbec "}, {"31": "@ExplorerFfff budú k dispozícii aj nové rozšírenia z provincií (od 15. kapitoly) v množstve približne 1 rozšírenie na kapitolu. Provincie získané dovtedy sa taktiež započítajú."}, {"102": "Tzn, získáme místo jedné rovnou dvě za rasu? No to je lepší zpráva  Díky"}, {"11": "jo, to by nebylo špatný a kdyby šli z provincií získat dvě, to by bylo ještě lepší "}, {"99": "Odkud to máte? Je někde nějaký zápis nebo video nebo něco?  Docela by mě to zajímalo celé, ale nic jsem nenašla... "}, {"148": "z německého fora: Setkání týmů 2019 a vaše dotazy pro tvůrce Elvenaru"}, {"16": "@iDavis ehm, fakt jenom dva? Takže pokud někdo čistí jen vyžadované minimum provincií, tak bude mít místo 4+1 za kapitolu jenom 1+1? To už ty úkoly typu postav 16 létajících ostrovů bude plnit jen masochista, co si zbourá půlku vesnice asi...[BR]Já doufám, že budu mít dost požehnání, abych si postavil dost výroben na vylepšení portálu na max. lv a zbytek dojel více méně jenom na požehnáních, když se místo bude ještě více zmenšovat. Nebo se očekává, že prostě začneme bourat i divy? (o bourání manufaktur nechci ani slyšet a to přesto, že už většinu střetů v turnajích jedu bojem)."}, {"11": "jak 4´+ 1? Ten kdo už dávno dojel provincie už, asi tři rasy dostával jedno rozlišení v každý rase."}, {"16": "@voyager-1 Psal jsem v případě, že čistí jenom vyžadované minimum."}, {"28": "Platí tedy ta třetí varianta s oparem vidění k úkolům \"prozkoumej provincii nebo otevři technologii\"?"}, {"31": "Dnes bolo vydané oficiálne video k nadchádzajúcej veľkej novinke! Toto je zároveň pokračovanie série sneak peekov Spirála, avšak s novým názvom, nakoľko toto bude oficiálny český názov tejto funkcie. [BR][BR]Sneak Peek: Věž věčnosti #4[BR][BR]Spoiler: Sneak Peek<<<[BR][BR][BR]Oficiálna diskusia k veži[BR][BR]Oficiálne oznámenie k veži[BR][BR]>>>​"}]