[{"154": "Hmm, zajímavé."}, {"72": "Tak nějak nevím, jestli se mám těšit nebo děsit [BR]Nehledě na to, že tam budou zřejmě zase rozdíly oproti funčnosti v browseru a v mobilu."}, {"102": "No bude to vidtelně to samé nebo velmi podobné, jen omezené na jednoho hráče jako je tohle https://cz.wiki.forgeofempires.com/index.php?title=Cechovní_expedice[BR][BR]takže nějaké \"vymyšleno přímo pro elvenar\"... haha "}, {"31": "V porovnaní s FoE to má podobnosti, ale určite nie v grafike, ktorá je v prípade Elvenaru mnoho krokov vpred.. "}, {"102": "Tak grafiku je jasný, že musí vymyslet extra, ale pro mě jako vývojáře nedělá věc věcí grafika, ale funkce a tam vidím více než málo stejného. To jestli tomu dají jiný název nebo obrázky na tom min pro mě nic nemění. Jsem zvědav tedy na náročnost, případně cenu/odměny "}, {"31": "Ak si dobre pamätám okrem iných (tiež zaujímavých) vecí som tam videl aj šance na diamanty a kouzelné budovy, čo by mohlo stáť za to. "}, {"102": "To ano, celkem se těším, bude to změna a jistě to i dost lidí přivítá, že je to pro jednotlivce, tzn se nebude tvořit tlak na všechny nuceně. Já jen reagoval, že to prostě vzali z FOE a nemyslím si, že to vymysleli extra pro nás "}, {"160": "Ahoj všichni, už nekdo víte, kdy začne událost Letního slunovratu tady u nás?"}, {"3": "brzy "}, {"160": "   Joo, to vím taky  : D"}, {"15": "čoskoro! "}, {"102": "Já to vím přesně, kdy bude slunovrat u nás v zemi, bude to v pátek 21 června v 17:54 "}, {"5": "...myslím zítra, start 14dní po Betě /16.5./ bez záruky "}, {"146": "myslim že nejdříve v ponděli, na začátek eventu vždy aspoň dva dny předem upozorňovali"}, {"90": "Tipnul bych si začátek až po updatu hry na verzi 1.80. Ten na beta serveru upravoval periodicitu výběru ze Stonehenge na 48h ap. A podle mne proto spíš až ve čtvrtek 6. června, tj. 21 dní po beta serveru."}, {"146": "no a ten má být v pondělí"}, {"31": "Termín letnej udalosti je už známy a je uvedený v prehľade."}, {"31": "Sneak Peek: Věž věčnosti #5[BR][BR]Spoiler: Sneak Peek<<<[BR][BR]Věž věčnosti by mala byť z hľadiska časovania podobná s turnajmi - opakovať sa bude každý týždeň, trvať 5 dní, začínať vždy v nedeľu a končiť v piatok.[BR][BR][IMG]https://i.ibb.co/Zhy0yVL/https-i-ibb-co-8j-Z8-Jwf-EL-sneak-peek-31-5-2019-4-png.png[/IMG][BR]Veža bude rozdelená na 3 mapy, každá s inou grafikou (grafika prvej sa už objavila v treťom sneak peeku, konkrétne v tomto videu). Pohybovať sa budeme riešením jednotlivých stretov, tie budú zrejme označené truhlami a rôznymi duchmi, ktorí ich budú strážiť.[BR][BR][IMG]https://i.ibb.co/L0x070j/https-i-ibb-co-X83-Vk-FK-EL-sneak-peek-31-5-2019-7-png.png[/IMG][IMG]https://i.ibb.co/pd562Dk/https-i-ibb-co-DLq-FL0c-EL-sneak-peek-31-5-2019-6-png.png[/IMG][IMG]https://i.ibb.co/GJdKn0p/https-i-ibb-co-0j-Gp-SZg-EL-sneak-peek-31-5-2019-5-png.png[/IMG][BR][BR]Riešenie stretu bude možné dvoma spôsobmi - boj, alebo nová mini-hra s vyjednávaním. Každá truhla bude mať nejaké množstvo, percentuálne odstupňovaných odmien. Na konci každej mapy by sa mal nachádzať nejaký boss, ktorého truhla bude s cennejším obsahom.[BR][BR][IMG]https://i.ibb.co/nQvk1rj/https-i-ibb-co-z-PPHr-Rt-EL-sneak-peek-31-5-2019-2-png.png[/IMG][IMG]https://i.ibb.co/hVbwt3T/https-i-ibb-co-zbr-Dsn0-EL-sneak-peek-31-5-2019-8-png.png[/IMG][IMG]https://i.ibb.co/zhqfkSB/https-i-ibb-co-x2z0b8b-EL-sneak-peek-31-5-2019-3-png.png[/IMG][BR][BR]Za prejdenie celej veže by mala byť zrejme k dispozícii dodatočná (bonusová) odmena, v podobe novej budovy s dočasným efektom.[BR][BR][IMG]https://i.ibb.co/fMrVWw9/https-i-ibb-co-VM84-C2-F-EL-sneak-peek-31-5-2019-1-png.png[/IMG][BR]​"}, {"114": "tak byla bych raději, pokud by hra ve Věži věčnosti byla časově neomezená, takto sice nebude tlak na společenství, ale tlak na jednotlivce aby stihl dojít do cíle, i když nemám představu jak rychle se Věží projít dá, přeci jenom bez hlídání času to nepůjde..., ale i tak se na ní těším "}, {"102": "Spíše jde o to, že pokud to bude podobně náročné jako turnaje, může to dělat problém pravidelně plnit turnajovým spolkům, ne každý totiž má toho vojska dost, pak bude záležet zda výkupy nebudou nerentabilní. Ale uvidíme, třeba budou ceny stát za prd a necháme to plavat a nebo budou super a pak se vždy nějaká cesta jak to zvládat obojí asi najde."}]