[{"43": "Nějak mi uniká smysl toho puzzle zde v tématu zprávy z beta serveru.Může mi někdo říct co to má společného???[BR]To asi patří uplně nikam jinam,né..."}, {"2": "nebud morous, je to hezké"}, {"43": "Nejsem morous,proti tomuto nic nemám,ale když se sem po nějakém čase podívám a vidím že v této těmě jsou nové příspěvky,tak se těším na novinky co se chystá ohledně hry a né že někdo složil puzzle.Se divim,že to ani moderátorům nevadí,že tu mají takový s prominutím bordel.Od toho je tu snad krčma,kde jsou hry,tam si můžete skládat puzzle třeba až do soudného dne..."}, {"31": "@papap tak zase bordel tu určite nie je. Táto téma všeobecne slúži na zdieľanie pripravovaných noviniek, niektoré (väčšina) sú práve z bety, iné sú napríklad ako tieto puzzle z pripravovanej novej aplikácie. Možno to priamo pod názov \"Novinky z bety\" nezapadá, ale ide proste o novinky ktoré sa chystajú, takže to nie je bordel. [smilie--sprite2][BR][BR]V tejto chvíli majú puzzle už svoju samostatnú tému tu kde si môžete poskladať obrázky a grafiku z novej pripravovanej aplikácie. [smilie--sprite1]"}, {"31": "Zaujímavá novinka z bety.. [smilie--sprite1][BR][BR]SpoilerVyzerá to tak, že dôjde k obmene obsahu truhlí, ktoré odomykáme na začiatku jednotlivých kapitol, po preskúmaní určitého množstva provincií. Zatiaľ čo doteraz sme z nich dostávali kúzla, teraz na nás budú čakať diamanty. [smilie--sprite1][BR][BR][BR][BR]EDIT: Na bete práve prebehol ďalší update obsahujúci novú funkciu..[BR][BR]Spoiler: Okamžité kúzlaOkamžité kúzla[BR]V inventári nájdeme novú záložku nazvanú okamžité kúzla. Tieto kúzla slúžia na okamžitý zisk mincí alebo zásob, obidve v určitom počte % z vašej kapacity v hlavnom sídle. Okrem toho budú dostupné aj ďalšie kúzla, tzv. skracovače (napr. pre výrobu, výstavbu alebo prieskum provincií). Všetky tieto kúzla budú dostupné vo viacerých hodnotách, napr. bežné (10%) alebo najvzácnejšie (až 100%). Budú sa dať získavať z úloh, akcií alebo kúpou za diamanty.[BR][BR][BR]EDIT 2: Ďalšia novinka...[BR][BR]Spoiler: Prieskum provinciíPred prieskumom vybratej provincie sa nám zobrazí jej aktuálna náročnosť.[BR][BR][BR][BR]"}, {"44": "tak co zas něco nového[smilie--sprite4][smilie--sprite1]"}, {"25": "Wow, todle se ted objevilo na facebookove strance Elvenaru: https://www.facebook.com/elvenar/. Ocividne pujde o nejakou hooodne zajimavou novinku. Co myslite, co to bude? [smilie--sprite9][BR][BR]Spoiler[IMG]https://i.ibb.co/HFcHP1N/https-cz-forum-elvenar-com-index-php-attachments-20617137-1427424497346777-4450928436237798447-o-jpg.jpg[/IMG]"}, {"29": "Jestli takhle bude vypadat mapa světa, tak to bude pecka..."}, {"2": "já si netroufám hádat"}, {"56": "To by bylo super na divy, aby neubíraly ve městě místo. [smilie--sprite1]"}, {"2": "cožeto?"}, {"28": "To vypadá úžasně [smilie--sprite1] Že by nějaký typ dobrodružství? Kde se budeme muset přes jednotlivé body dostat až na vrchol do těch ruin strážní věže? Čuju, že právě zde budeme moci získávat ta \"požehnání\" a doufám, že to bude akce pro společenství [smilie--sprite1]"}, {"49": "Přesně takhle to taky vidím @Thespia . Napadlo mě úplně to samé. Něco podobného je ve FoE, nemýlím-li se."}, {"31": "Blíži sa nová akcia - Maškaráda. [smilie--sprite1] A čo rozhodne stojí za zdôraznenie je fakt, že odmeny z nej nám konečne budú produkovať manu. [smilie--sprite2][BR][BR]SpoilerPredpokladaný termín: 18.8. - 24.8. bude pravdepodobne už skôr (14.8. - 20.8.)[BR][BR][IMG]https://i.ibb.co/9pSQyHt/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-masquerade-Banner01-png.png[/IMG][BR][BR]Akcia bude tentokrát pozostávať z 2 častí, tá druhá sa začne neskôr.[BR][BR]Bude obsahovať sadu 13 úloh. V nich sa ako odmeny poprvýkrát objavia nové požehnání.[BR][BR]Spoiler: Úlohy1. Utrať 1 VB[BR]2. Získaj malé množstvo mramoru[BR]3. Získaj malé množstvo ocele[BR]4. Získaj malé množstvo dreva[BR]5. Dodaj nejaké množstvo kryštálov[BR]6. Dodaj nejaké množstvo svitkov[BR]7. Dodaj nejaké množstvo hedvábí[BR]8. Získaj 1x kúzlo Sila zásob[BR]9. Vyrob 20x produkt základnej bonusovej manufaktury (3-hodinový) + dodaj nejaké množstvo mramoru[BR]10.[BR]11.[BR]12.[BR]13.[BR]Ako budú vyzerať odmeny:[BR][BR][IMG]https://i.ibb.co/kKVBcZB/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-masquerade-Building01res-png.png[/IMG] - toto bude odmena za túto časť akcie[BR][IMG]https://i.ibb.co/6wqT4yk/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-masquerade-Building02res02-png.png[/IMG] - táto odmena bude dostupná až v druhej časti akcie[BR][BR]Na prehľade jednotlivých budov už pracujem. [smilie--sprite1]"}, {"29": "Ty budovy vypadají moc hezky, už se na event těším [smilie--sprite2]"}, {"43": "No super.Na to jsem zvědavý,jak zakomponují ty požehnání do eventu a na ty budovy s manou. [smilie--sprite1]"}, {"28": "Náš starý známy Crazy Wizard již taky pracuje na soupisu informací k eventu. Můžete mrknout na 1.část a 2.část. Na betě se lidi hodně rozčilují, že nebudou platit surovinami za to, aby získali 1 minutový urychlovač.... Pokud někdo není až tak aktivní a pravidelně nevybírá z budov manu, tak budovy ani nejsou až tak sympatické. Ale vzhledově se jim opět moc povedli, to se jim musí nechat."}, {"57": "Krásné budovy a v rozumné velikosti.[smilie--sprite1]"}, {"31": "Vývoj mobilnej aplikácie pokračuje...[BR][BR]SpoilerDo mobilnej aplikácie Elvenaru boli pridané nové funkcie:[BR]susedská výpomoc (bez nutnosti navštevovania miest)nové zvukyrebríček hráčovgrafické zmenyopravy chýb a vylepšenie stabilnosti hryObjavili sa zároveň tieto obrázky poukazujúce na avizované novinky:[BR][BR][IMG]https://i.ibb.co/QD0592s/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-mobile-mobile-ui-ghje35jaj-png.png[/IMG][BR][IMG]https://i.ibb.co/8rpQgGr/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-mobile-nh-notif-uuanek24k-png.png[/IMG][BR][IMG]https://i.ibb.co/6sdp8hD/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-mobile-nh-wm-afljh2ad2-png.png[/IMG][BR][IMG]https://i.ibb.co/7NqnJm0/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-mobile-ranking-yhjeal53k-png.png[/IMG][BR]A aplikácia je dostupná už aj pre hráčov z Francúzska, uvidíme kedy sa konečne dostane aj k nám. [smilie--sprite1]"}, {"58": "Ako dlho bude ešte trvať ?[smilie--sprite11]"}]