[{"16": "To zjístíme my hráči bety jakmile to tam rozběhnou."}, {"31": "Sneak Peek: Expanzie #2[BR][BR]Spoiler: Sneak Peek<<<[BR][BR]Před:[BR][IMG]https://i.ibb.co/SVfY4Xc/https-i-imgur-com-z-IZ7-J85-jpg.jpg[/IMG][BR][BR]Po:[BR][IMG]https://i.ibb.co/L0YJNSt/https-i-imgur-com-re-Hw-XVZ-png.png[/IMG]"}, {"148": "Chápu to dobře, že Věž je pro jednotlivce ?"}, {"119": "Ano, mělo by to být pro jednotlivce."}, {"114": "@iDavis a to bude něco nového - že by ta Věž věčnosti? - na té vodě?"}, {"102": "ta bude nahoře vlevo, tohle bych řekl jen říká, že pás 11 rozšíření přibude také nahoře vlevo"}, {"66": "@iDavis A kam půjdou obrazy divů na skalách?"}, {"102": "nikam, když se podíváš, je to stejný obrázek, jen má nalevo prodloužení o \"výhled\" do propasti se sochou."}, {"31": "Celé to funguje ako zväčšenie plochy, teda na niektorých miestach pribudnú nejaké nové prvky (grafika) a to spôsobí, že sa (aspoň vo väčšine prípadov) zvyšok posunie do jednej strany. Teda zrejme v prípade tých dvoch obrázkov, bude miesto na divy akurát viac vpravo."}, {"66": "Jo, takže oni přidají řadu nahoře vlevo, z pohledu hry na severní stranu. Aha"}, {"31": "Na bete bola spustená..[BR] Věž věčnosti[BR][BR]Spoiler: Věž věčnosti[IMG]https://i.ibb.co/cT6CDkJ/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-spire-spire-reward-chest-wide-png.png[/IMG][BR]Väčšina základných informácií o veži bola popísaná v 5. sneak peeku tu. Na bete sa jedná o testovaciu fázu, ktorá je spustená zatiaľ čo sa na funkcii ešte stále intenzívne pracuje.[BR][BR]Na obrázkoch nižšie je možné vidieť nový spôsob boja (rozdeleného do niekoľkých vĺn) a taktiež novú mini-hru s vyjednávaním:[BR][BR][IMG]https://i.ibb.co/NL7Wxz8/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-spire-spire-unit-selection-mobile-png.png[/IMG][BR][IMG]https://i.ibb.co/Cmxtjnq/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-spire-spire-diplomacy-png.png[/IMG][BR]Na bete má byť údajne vykonaných ešte niekoľko testovaní tejto funkcie, preto zatiaľ nie je známy termín jej príchodu na náš server.[BR][BR]Cestou na vrch veže budeme odomykať odmenové truhly, z ktorých budeme získavať rôzne odmeny - požehnání na mince, zásoby, portálové bonusy a pod., diamanty, kouzelné obytné budovy, kouzelné dílny, úlomky kouzel a spojovací činidlá, zesilovače a ďalšie.[BR]Okrem týchto odmien budú k dispozícii aj úplne nové - zatiaľ neobjavené v Elvenare - nové budovy súčasťou nového setu Sada měsíční knihovny. Tabuľky týchto budov sa práve objavili v Speciální budovy - Věž věčnosti. Detaily setu sú uvedené v Setové budovy - Sada měsíční knihovny."}, {"43": "Nejde mi vykoupit souboj,tlačítko pro vykoupení je černé.To je bráno zatím jako beta chyba nebo se proto musí něco udělat,aby šlo vykoupit?"}, {"102": "nemají to hotové, proto to nejde, není to chyba."}, {"148": "Ahoj na betě mi chybí jen otevřít truhlici do druhé kapitoly, Věž nevidím. Je to tedy limitované od druhé kapitoly a dále?"}, {"31": "@Sycorax áno, veža je od 3. kapitoly."}, {"16": "No já na betě udělal první bednu. Na druhou nemám dost jednotek:[BR][IMG]https://i.ibb.co/1njmFQG/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-6-3-18-26-24-png-3377.png[/IMG][BR]Pro srovnání moje aktuální beta armáda:[BR][IMG]https://i.ibb.co/Y7m6rc2/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-6-3-18-27-8-png-3378.png[/IMG][BR][BR]Až zavedou vyjednávání, můžu vyzkoušet.[BR]Pokud se poměry ve vyšších truhlách zásadně neliší anebo nezmění, budu na cz1 jen vyjednávat anebo se na to úplně vybodnu.[BR]Pokud mi něco zásadního neuniká (např. ten nepoměr mezi počtem jednotek spolu s tím, že mám 0 šermířek a tudíž nevidím, jestli jich nepotřebuju radikálně méně než luků), tak si nenechám vybít celou armádu určenou na turnaje ve věži."}, {"148": "achjo, tak ja nahodila betu kvuli zkoušce Věže "}, {"31": "Tak ako som avizoval v piatok, vo veži sa dá získať nová budova s dočasným efektom, konkrétne v úplne poslednej truhle poslednej mapy. Jej detaily nájdete až teraz v Speciální budovy - Džin, keďže som jej tabuľku robil, kvôli neobvyklosti jej produkcií, manuálne."}, {"102": "Od kdy džin plní náhodná přání? "}, {"16": "@ExplorerFfff Tohle je speciální Elvenar Džin, studoval 4 roky elvenarskou školu a pak vypil studnu přání."}]