[{"114": "Jó, to chci! Sada měsíční knihovny a Džina! [BR][BR]..jsem nedočkavá jako malé dítě na Vánoce co se ptá \"..a když už přiletí Ježíšek?\" [smilie--sprite8]"}, {"43": "No uvidíme,zatím mám z toho nic moc pocity,je to ale na začátku,snad se to zlepší.Jen mi není moc jasný ten převod v počtu jednotek,když v kasárnách mám kolem 15 jednotek všechny typy a ve věži před soubojem mi u některých ukazuje kolem 12 a další jen třeba kolem 2.A ikdyž jsem použil urychlovače na rekrutování,tak se jednotky v té věži o moc nezvedli..."}, {"102": "ten přepočet jednotek je na oddíl jakým bojuješ v tom boji"}, {"16": "@ExplorerFfff Otázka zní, dle jakého klíče se ten oddíl tedy určuje (viz. můj srovnávací obrázek z věže a tábora, kde lukaři jsou 3,6 vs 3,6, ale golemové 4,1 vs 24,2)."}, {"139": "alespon tuseni mame co nas ceka [smilie--sprite1] Dekujeme"}, {"11": "není to tím, že velikost jednotky golem je 6 a u luků 1 ?[BR][BR]edit: jo Tobě jde asi o tu desetinu, že tam není 24,6"}, {"16": "@voyager-1 Byl to bug. Teď už je to opravené. Velikost jednotky v Army camp = 1161, velikost jednotky ve Spirále druhé truhle 1160.[BR]Jestli to radikálně nezmenší, nejspíše budou Spirálu ignorovat přinejmenším všichni, kdo se umísťují v top bodovaných pozicích v turnaji a všichni z deseti truhlových společenství."}, {"102": "Už jsem taky koukal, že to opravili si totiž každou chvíli kliknu na věž, když posouvám město ale na to si stěžuje hromada lidí na betě, ale že se mi to stane několikrát za 5 min co se jdu na betu podívat co je tam za denní odměnu je děs [smilie--sprite8]"}, {"161": "Ahoj, v seznamu je u úkolu 42 chyba nebo to ještě dodatečně změnili. Je tam vylepši budovu na úroveň 10 anebo vyšší ne na úroveň 11. [smilie--sprite1] Jinak dobrá událost. Líbí se mi Venarova skaliska."}, {"162": "Má někdo tušení, kdy by se mohla objevit nová rasa? Alespoň hrubý odhad."}, {"102": "okolo srpna"}, {"119": "@palni Těžko říct. Odhaduji od poslední rasy Konstrukti, že by mohla přijít nanejvýš do konce roku. Ale jsou to jen spekulace. [smilie--sprite2]"}, {"72": "no, rámci inovace za každou cenu budou možná vymýšlet nějakou náhradu za \"živoucího\" zboží, tak by to mohlo trvat i déle, než v posledích dvou případech"}, {"72": "na betě se te´d objevila drobná annonce, že zabitý jednotky se neobjeví ve druhý vlně souboje, nebo v bitvě.. tak nevím co to má bejt, zda k té věži, ale pokud by to bylo v i v turnajích, tak by to nebylo špatné.."}, {"102": "To se neměli zobrazovat ani před tím, to byla chyba. A je to logický, tvoje zabitý jednotky se tam taky neobjevili [smilie--sprite8]"}, {"72": "A je to k tý věži? Že je to bugfix vidím, ale jinak tam totiž není žádná souvislost. Jde to tak vztáhnout i na běžný boj, kdy bys v provincii v boji zabil polovinu jednotek a prohrál, a při druhým pokusu by tam bylo už jen to co zbylo po tvém předchozím pokusu, to by nebylo marný."}, {"99": "Ano, je to k věži. Některé boje jsou ve 2 až 3 vlnách a pokud ti zabili v první vlně nějaký oddíl, objevil se i ve vlně 2., ovšem s velikostí 0 a nedalo se s ním nic dělat..."}, {"72": "Ok, díky."}, {"31": "Sneak Peek: Dobrodružství společenství[BR][BR]Spoiler: Sneak PeekŽe by už konečne? [smilie--sprite1][BR][BR][IMG]https://i.ibb.co/R7ym3xY/https-i-ibb-co-YDgfrym-EL-sneak-peek-14-6-2019-1-png.png[/IMG]"}, {"154": "Když to bude ono, tak takhle nějak jsem si to představoval [smilie--sprite1] to by bylo ideální"}]