[{"16": "@mohyla98 Ne ne, to jsou jenom ikony, budeme klikat 3x tolik co teď [smilie--sprite8]"}, {"102": "akorát tohle vypadá jako grafika z mobilu, tak aby to zase neměl jen mobil."}, {"2": "s tím novým nahazováním je mobil stejně favorit"}, {"102": "no jen u dílen, ty manufaktury to je dost pomalý proti klávesám na PC"}, {"114": "mně to rychlý nahazování funguje na mobilní jen u jednoho účtu, u druhého ne [smilie--sprite3]"}, {"102": "asi nechtějí aby jsi byla moc rychle hotová [smilie--sprite8]"}, {"117": "luterina napsal/a:\t\t\tmně to rychlý nahazování funguje na mobilní jen u jednoho účtu, u druhého ne [smilie--sprite3]Klikněte zde pro zvětšení...vzdyt je to tady napsala xkrat, ze to maji jen nahodne ucty na testovani a ne všechny...."}, {"31": "Blíži sa tohtoročná letná úkolová rada.. [smilie--sprite1][BR]Kráľovná morí Mauriel[BR][BR]Spoiler: Kráľovná morí[IMG]https://i.ibb.co/Fh5tK25/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-queenoftheseas-forumbanner01-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]Behom úkolovej rady nás bude čakať séria úloh, ich riešením budeme postupne odhaľovať príbeh morskej panny Mauriel a zároveň sa pripravovať na jej nadchádzajúcu veľkú letnú oslavu.[BR][BR]Kompletný prehľad úkolovej rady nájdete v Události a úkolové linie - Královna moří, tabuľku odmenovej budovy v Speciální budovy - Královna moří Mauriel.[BR][BR][IMG]https://i.ibb.co/CbPmZZ6/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-queenoftheseas-rewardbuilding01res-png.png[/IMG]"}, {"163": "zdravím, měla bych dotaz . Rada bych si zalozila ucet na Betě ale nějak nevím jak. Děkuji za radu ci odpoved.)"}, {"146": "https://beta.elvenar.com/"}, {"164": "iDavis napsal/a:\t\t\tBlíži sa tohtoročná letná úkolová rada.. [smilie--sprite1][BR]Kráľovná morí MaurielKlikněte zde pro zvětšení...[BR]Opravdu si jste jistí, že se jedná o Mauriel a ne Muriel? Fakt ze mě královna moří nebude? [smilie--sprite1]"}, {"16": "@Muriel [BR][IMG]https://i.ibb.co/7nnHQyM/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-6-24-20-9-8-png-3477.png[/IMG]"}, {"18": "Spoiler: Kráľovná morí[IMG]https://i.ibb.co/Fh5tK25/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-queenoftheseas-forumbanner01-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]Behom úkolovej rady nás bude čakať séria úloh, ich riešením budeme postupne odhaľovať príbeh morskej panny Mauriel a zároveň sa pripravovať na jej nadchádzajúcu veľkú letnú oslavu.[BR][BR]Kompletný prehľad úkolovej rady nájdete v Události a úkolové linie - Královna moří, tabuľku odmenovej budovy v Speciální budovy - Královna moří Mauriel.[BR][BR][IMG]https://i.ibb.co/CbPmZZ6/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-queenoftheseas-rewardbuilding01res-png.png[/IMG][BR][BR]Sic peče nás tu letní slunovrat,[BR]z dálných hlubin blíží se k nám velký zvrat.[BR]To pomoci nám schladit se,[BR]připlouvá podmořská krasavice.[BR]Je to paní Mauriel,[BR]Mocná Královna Moří Mauriel.[BR][BR]Zlákal ji Elvenar,[BR]nádherný a mýtický to kraj.[BR]Nabízí pomoc a znalosti,[BR]za trochu místní zručnosti.[BR][BR]Odstraněna citace. Embla"}, {"66": "@Muriel Ale stejně je to na žalobu, jako tenkrát soudní spor Horalky vs. Tatranky.[smilie--sprite7]"}, {"31": "Na bete došlo k rozšíreniu plochy (graficky)..[BR]Expanzie[BR][BR]Spoiler: ExpanzieAktuálna verzia expanzie plochy súvisí s úkolovou radou Královna moří a jej nadchádzajúcou veľkou letnou oslavou.[BR][BR]Obrázky niektorých častí novej grafiky:[BR][BR][IMG]https://i.ibb.co/mv00VPy/https-i-imgur-com-Crnln-Gq-jpg.jpg[/IMG][BR][IMG]https://i.ibb.co/0QFJX24/https-i-imgur-com-s-XTBllz-png.png[/IMG][BR][BR]Okrem grafickej zmeny došlo taktiež aj k zväčšeniu mapy - celá plocha je teraz väčšia, čo bude v budúcnosti pravdepodobne využité pre možnosť umiestnenia väčšieho počtu rozšírení."}, {"3": "hned bych si tam na pár dnů zajel..., to pobřeží vypadá lákavě"}, {"150": "část rozšíření se už ukazuje i mě v \"normálním\" světě, ale tu želvu nevidím... jsem zvědavá, jak se to bude ještě upravovat, vílí divy ve skále vypadaly líp, když byly poblíž vody a ne v horách"}, {"72": "ano, nějaká část je i na cz serveru, minimálně ty plážový serepetičky, opticky se to sice protáhlo po třech stranách, ale celá ředa se vejde asi jen ve směru k želvě."}, {"18": "co sse týká vílích divů tak souhlasím s ledova kraska, u vody vypadali  líp. Otázka jestli to tak plánují nechat na trvalo, či jen podobu eventu nebo léta."}, {"31": "Verzia na našom serveri nie je finálna. Skôr mi to pripadá ako nejaký bug. Na bete sa totiž vykonali 2 úpravy - rozšírila sa plocha, aplikovala sa nová grafika. U nás sa aplikovala len tá grafika a preto to teraz vypadá nedotiahnuto, okrem zle zobrazených divov je aj celé mesto v úplne zlej pozícii. Predpokladám že ešte vyjde update, ktorým sa to pokúsia vyriešiť.[BR][BR]Každopádne grafika je viac než skvelá. [smilie--sprite1]"}]