[{"136": "Souhlasím. Pláže jsou vážně pěkné. [BR]Ale želvu jsem hledal marně. [BR]Alespoň jsem našel sopku na ostrově, co je asi radioaktivní. Nebo co má ten modrý paprsek do nebe znamenat...?[BR]https://ibb.co/m8cHDkX"}, {"65": "želva je posunutá mimo viditelnou oblast, naskočí, když přes přes ctrl odzoomoješ kolečkem. (ale jakmile do toho klikneš, už se mapa zase \"srovná\")[BR][BR][IMG]https://i.ibb.co/Kh3WDTm/https-cz-forum-elvenar-com-index-php-attachments-zelva-jpg-3523.jpg[/IMG] [BR][BR][BR]ale ty budovy ve vzduchu se povedly  [BR][BR][IMG]https://i.ibb.co/rZ4sp5D/https-cz-forum-elvenar-com-index-php-attachments-vzduch-jpg-3524.jpg[/IMG]"}, {"66": "@Corwin22 Ta sopka je příprava na Věž věčnosti, hádám. Stylem jí odpovídá."}, {"136": "@CorwinOfAmber :Máš recht. Díky. [BR]@Prealiena : No nevím. Spíše mi to evokuje Fukušimu.. "}, {"15": "@Prealiena  Doufám , že to taky nevybouchne . A ty domy ve vzduchu jsou fakt legrační - snad to spraví . "}, {"165": "Taky mi přišlo divný, že ty poslední budovy v horní řadě částečně levitují ve vzduchu. U mých obyvatelů v městečku to dokonce vyústilo ve všeobecnou paniku, protože někteří obyvatelé se nemohou zbavit dojmu, že jim každou chvíli spadne barák do propasti.  V takové náladě si jen těžkou můžou užívat toho, že mají najednou na dosah ruky pláž a moře...  Naštěstí mám zrovna ve městě čaroděje, kteří to zachraňují kouzly, ale i tak doufám, že se to brzy spraví. Už pro ten pocit. "}, {"31": "No dúfal som, že nebudeme musieť čakať 2 týždne na opravu lietajúcich budov.  Pred chvíľou vyšiel update, ktorý túto chybu opravil a taktiež rozšíril plochu (graficky), takže už vidíme aj korytnačku. "}, {"20": "Už to vypadá dobře ... levitující město už dosedlo na své místo ..."}, {"74": "@Lunaja, ....tví obyvatelé by se měli zdržet nadměrného požívání alkoholu v těchto teplých dnech..... pak z toho mají závratě,,,,jestli zvrací do moře, tak mají ryby alespoň co žrát....[BR][BR]@iDavis, ...to je dobře.. korytnačku je třeba ulovit a udělat z ní polévku pro hladové obyvatelstvo[BR][BR]Příspěvky sloučeny. Embla"}, {"5": "Kdyby jste něco dělali, makali, pěstovali, chovali a neváleli se jen u moře ...nemusíte lovit chráněnou elfí želvu obrovskou "}, {"74": "@ElfNostradamus, no.... pokud je to \"želva obrovská\", tak nemá ve vodě co dělat  je to největší suchozemská želva "}, {"165": "Taky už to mám v pořádku.  A ve městě najednou není ani noha. Všichni se válejí u vody, někteří skáčou šipky z želvího krunýře.  Doufám, že se těch radovánek nabaží, než přijde další event... "}, {"5": "Naše elfí želva obrovská má vodu ráda, občas si i hraje a na zádech vozí elfíčata, jinak funguje jako přívoz z jednoho břehu na druhý "}, {"16": "Tak jsem si vyzkoušel vyjednávání ve věži a nemůžu říct, že bych si tu úplatkovou ruletu užil, navzdory mým předchozím pokusům, ta banda dává i nějaké nápovědy. Takže pokud nebudete bezduše klikat jako já ve svých prvních pokusech, tak se možná i dostanete mnohem dále, ale za cenu toho, že vám jedna truhla při tom všem přemýšlení zabere mnohem více času než vyjednávání hned několika provincií v turnaji. A později máte stále jen 3 tahy na uhodnutí kombinaci z 5 surovin, což z toho dělá doslova loterii.[BR][BR]Spoiler: 6. truhla[IMG]https://i.ibb.co/sgcK1hP/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-7-3-19-47-14-png-3545.png[/IMG][BR][BR][IMG]https://i.ibb.co/hsb2CCF/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-7-3-19-48-31-png-3547.png[/IMG][BR][IMG]https://i.ibb.co/NSfv8ZX/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-7-3-19-49-43-png-3548.png[/IMG][BR][IMG]https://i.ibb.co/Q94VK8c/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-7-3-19-50-14-png-3549.png[/IMG][BR][IMG]https://i.ibb.co/vVf9wtp/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-7-3-19-50-48-png-3550.png[/IMG][BR][IMG]https://i.ibb.co/H7kYMrP/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-7-3-19-51-34-png-3551.png[/IMG][BR]Na třetí pokus uhádnuto.[BR][BR]Odměny z truhly:[BR][IMG]https://i.ibb.co/Rz9SdSx/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-7-3-19-47-48-png-3546.png[/IMG][BR][BR]A dostal jsem překvapivě tu nejúžasnější odměnu:[BR][IMG]https://i.ibb.co/2sN6gqv/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-7-3-19-52-20-png-3552.png[/IMG][BR]No neberte to![BR]ps: Tak jsem došel do 8. bedny, získal Mana plant (1x1 manu produkující budova součástí setu), a můžu si užít 3-hodinovou přestávku, což v praxi znamená, že se k věži můžu dostat až zítra odpoledne po práci (takže ze 3 hodin se stane 20)."}, {"3": "mince vždycky potěší "}, {"91": "Cože, nějaký hazard? Sem s tím. Že by konečně šlo v Elvenaru gamblovat?"}, {"66": "Tak ve Forge of Empires dostávají v cechovní expedici (předloha pro věž věčnosti v Elvenaru) vyjednávací pokusy navíc jako odměnu za vyřešené střety. Doufám, že je do věže také nějakým způsobem zavedou."}, {"16": "@Paoleo Jo, ve věži si můžeš užít nový typ uplácení. Nejen, že po tobě chtějí úplatky, ale máš na výběr až z 5ti surovin (od mincí a kladiv až po prošlé zboží (pokud jsi v dostatečně vysoké kapitole) a oni ti maximálně naznačí, když jim dáš špatný úplatek (a ten špatný, co nechcou si samozřejmě nechají). A když se netrefíš ani na 3. pokus, tak můžeš odznovu (nebo přes dia)."}, {"91": "Zkažená to hra, už se těším , za zkoušku to určitě stojí."}, {"31": "Termín úkolovej rady Královna moří je už známy a je uvedený v prehľade."}]