[{"102": "Zakládat na to vlákno nebudu, jen se podělím o něco co jsem tu kdysi řešil:[BR][BR]16 studen, průměrně 25 dní sběru[BR]Získáno 1350 dia tj 54 dia za den a 27 dia za jeden sběr, celkem uskutečněno 800 sběrů a získány dia 54 krát, tudíž šance na získání dia je 6,75%[BR]Na jedno políčko ve městě připadá 0,16 dia na sběr (studny zabírají 167 políček včetně silnic)[BR][BR]V porovnání s nákupem dia při 100% akci tedy, bylo ušetřeno za 25 dní narvaného města u přítelkyně celkem 112 Kč, no co si budeme povídat, více peněz vyhodíme za měsíc zkaženým jídlem v lednici. Ale my tu statistiku vedeme jen proto, abych měl podklady."}, {"117": "ja za 2 mesice sbirani cca 20 studen ziskala pres 7000 dia, tak je to holt o nahode.... plus velke mnozstvi VB, zasob a podobne"}, {"157": "@donutka   pravděpodobnost  těžby dia ve tvém městě je jen o málo vyšší než deklarovaná, 11,5%[BR][BR]jinak mám také studny ve městě, celkem 6"}, {"3": "já jsem od studen nic moc nečekal a tak letmým pohledem mám pocit, že to padá zhruba statisticky. Akorát mince mi připadají, že padají víc, než by měly, ale na ty jsem asi vysazený  Dia se mi zdá, že padají zhruba na těch 10 %, to spíš 3 VB mi připadá, že padá málo"}, {"20": "Vyjádřit náhodu v procentech je samozřejmě možné, ale zkušenosti ve sběru dia ze studen jsou u hráčů odlišné. Asi to bude průměrně kolem 10%, ale individuálně to bývá dost rozdílné. Občas se mi stane, že i týden nic nepadne a pak zase něco přijde. Ale říkám si, lepší než drátem do oka  Ale jsou hráči, kterým to padá hodně. Asi jako točící bedny v eventech ..."}, {"157": "@Ludi a přesně to kolísání náhody, kdy padnou diamantu, lze definovat jako pravděpodobnost, a tak je to i programátory definované, no a více studní tu nepravidelnost jaksi více vybalancuje, zkus si to jeden rok zaznamenávat...., ano jistě i točící bedny ve eventech mají naprogramovanou pravděpodobnost, a pokud by se sečetli všechny naše pokusy, věř že bychom byli na číslech daných programátory, nakonec v lotynce také nevyhraje každý, ale jistěže, s vyšší investicí narůstá počet točení beden a tedy i možnost toho, že si vylosujeme to, co chceme.[BR][BR]No a protože studny jsou naprogramované, nelze říci, že je to důsledek náhody, zda nám dia padnou či nikoli, náhoda tedy patří do reálného života..[BR][BR]Náhoda v běžné řeči označuje jevy, jejichž výskyt neumíme vysvětlit. Pokud něco označíme za náhodný jev, můžeme tím mínit dvojí odlišný názor:[BR]příčinu či vysvětlení jevu neumíme nalézt;jev žádnou příčinu nemá.Definici jsme převzala z wiki, a v konečném důsledku body 1 a 2 mohou splynout, být totožné."}, {"20": "@Arweene  Problém je v tom, že zapisovat si, jak mi padají dia ze studní určitě nebudu, jelikož mě takové věci nebaví. Vím, co je statistika, sama občas podobné věci musím dělat, ale tady si hraju a práci do toho netahám [BR]Náhoda nebo řekněme pravděpodobnost, je často jen kombinace různých maličkostí, které ovlivní výsledek činnosti. Ovlivnit to může spoustu věcí. Tady ve hře třeba i to, že každý z nás hraje na jiném přístroji, v jiném prohlížeči atd. Takže v reálné zkušenosti platí, že každému to může padat jinak. Už se toho tady v minulosti na toto téma napsalo hodně."}, {"16": "No prostě někomu to padá málo někomu hodně. Ten, komu to padá málo může být rád, že mu padá alespoň něco, nebo se na to vykašlat a prostě si je koupit - to už záleží na každém, jak se rozhodne."}, {"11": "Ban skončil a už zase prudí  Tak se ke statistikám taky přidám. Po dvou třetinách získáno něco málo přes 10k diamantů takže papírových 15k asi nebude problém. A není psáno že za ušetřených 1300 korun v 100% akci, nemůžu koupit dalších 15k."}, {"102": "Hlavně, že píšu nereagovat na mě... díky že čtete. Ty @voyager-1 ten ban byl asi na den nebo dva, já sem prostě už nechodím, ban neban, to že mám ban jsem zjistil náhodou po kliku z mailu a bylo mi to šumák. Ale na tenhle nesmysl už jen proto, že jsi napsal ten začátek zareagovat musím napočítal jsem u tebe asi 40 studen, tzn 66 dní a 10 tisíc dělá 151 dia/den a to je 3,78 dia na studnu, tzn 7,57% na sběr na studnu to není o moc lepší něž můj výsledek a tak o co ti jde, viditelně jen o znevážení mé statistiky tvými zavádějícími údaji.[BR][BR]Lidi pokud něco píšete, pište A i B, tohle je to co mi vadí a to je důvod proč jsem tu statistiku sem dal, hážete sem tisíce ale už nepíšete, že máte obě města plné studen. ."}, {"3": "proč bychom nemohli reagovat, ty statistiky jsou zajímavé a hlavně podložené daty, ne jen pocitovky "}, {"102": "Myslím nereagovat tak, aby to očekávalo odpovědět ode mě, nebo se to týkalo přímo mé osoby. Já sem nechci chodit ale pokud vznikne nějaká mystifikace nebo otázka na kterou musím reagovat osobně, pak v zájmu slušného vychování či obrany osobnosti musím, což pak vede k diskuzi kterou nechci na nesvobodném fóru vést. O té statistice si mluvte, od toho jsem to sem dal, ale tam jsou prostě čísla a nemá to nic společného s autorem."}, {"157": "ahoj, protože si sama statistiky nevedu, jsem fakt ráda, že to někdo nejen dělá, ale je i ochoten se o výsledky podělit. Dojmologie je sice fajn, ale zajisté záleží na duševním rozpoložení např. majitele studen, pesimista a škarohlíd si stěžuje, že mu vynášejí málo, neb má dojem, že by měly nésti více a optimista a radovánek se raduje z každého diamantu, byť nedosáhne ani na deklarovaných 10%. Takže všem pragmatikům, statistikům a dalším sběratelům dat díky, a je jen na mě, zda se nadále budu řídit pocity nebo statistikou, či tzv. estetickým hlediskem, protože i to je velmi individuální."}, {"20": "Jedna věc je naprosto jasná: Diamanty jsou pro InnoGames zdrojem příjmů, a proto, když nám dají nějakou možnost získat dia zadara, tak to logicky nebude úplně snadné. Samozřejmě, že se dá hrát i bez dia. Je to volba každého z nás. A každý z nás má při stavbě města jiné priority.[BR]Nikdy jsem nestavěla město na \"dojmologii\" . I já si kdysi věci počítala, ale to už mám za sebou, teď už hru znám a tak prostě spoustu věcí vím i ze zkušenosti."}, {"157": "Otázkou je, zda je-li značná část herní plochy zastavěna studnami a cestami k nim, zdali toto město není náročnější na diamantovou dotaci než město, kde je toto místo využito produkčně (tj, dílny, obytky, sety, manuf, divy - vše co přináší jakoukoli produkci), může to být stejné. jako štíhlejší město s méně manufakturami,. tedy i méně obytkami a dílnami, může být výhodnější."}, {"20": "@Arweene - to je právě ten omyl, že město s méně obytkami a dílnami atd., může být výhodnější. Celé je to především o vyváženosti. Samozřejmě, že na běžný provoz tolik zlaťáků a kladiv člověk nepotřebuje. Jenže nedostatky se projeví ve chvíli, kdy je třeba vylepšovat budovy, dělat průzkum města apod.[BR]I když já už problémy se zlaťáky a kladivy nemusím řešit. Počet manufaktur, dílen i obytek je velmi individuální. Můj počet manufaktur mě vyhovuje, protože mi dovoluje hrát v naprosté pohodě. Kulturní bonus 170% i víc je fajn a lze ho snadno dosáhnout i s více obytkami i dílnami.[BR]Hlavní je to, jak člověk využije místo, které ve městě má. A tam je to právě o prioritách, které člověk ve hře zvolí."}, {"157": "@Ludi, prosím, reaguj na to, co píšu, ano? tedy si to důkladně přečti, děkuju"}, {"3": "jako, jen tak od oka, studny moc výhodné nejsou. Zabírají místo, házejí věci, které by si člověk dokázal opatřit efektivněji (až na těch pár dia a VB).[BR]Na druhou stranu, ta radost z toho, když padne něco hezkého. A v neposlední řadě, když už je mám, tak je nevyhodím.[BR][BR]Výsledek: v eventech se po nich určitě nepídím. Na druhou stranu ty, co získám, určitě nerozkraftím, ale užiju si je "}, {"31": "S argumentom že studne nie sú výhodné pretože zaberajú miesto nesúhlasím. Sú veľmi dobre využiteľné vo chvíli, kedy hráč dokončí výskum a čaká na ďalšiu kapitolu (čo je momentálne aj môj prípad (i keď ja nečakám, ja si práve užívam kľud, keďže len dnes som výskum dokončil ) a aj prípad veľa ďalších hráčov). Takže v takomto prípade možno povedať, že sú spôsobom, akým efektívne využiť prázdne miesto po osadníkoch."}, {"157": "@Emhyr var Emreis II   z duše s tebou souhlasím [BR]@iDavis nojo, ale exspirují až po 100 dnech a to většina z nás má mezičas kratší, takže pak nezbývá než Nerudovská otázka: Kam s tím?"}]