[{"148": "Spoiler: animace[IMG]https://i.ibb.co/zF5yd2c/http-ipic-su-7y-FAm-L-png.png[/IMG]"}, {"166": "Budovy vypadají hodně povedeně co se týká vzhledu."}, {"3": "taky jsem si říkal... ten set mě sice zatím letmým pohledem nezaujal, ale nějakou tu manovou plážovou boudičku si asi rád pořídím. Hlavně abych stihl přeskočit do čarodějů[BR][BR]edit: a jak se tak dívám na systém lastur, vypadá stejně, jako minule. TO jsem měl mega smůlu, tak čekám, jak mi teď budou padat korály zpátky!"}, {"31": "Novinkou v nadchádzajúcej udalosti Morské panny je neobmedzené množstvo úloh. Je teda celkom pochopiteľné, že vytvoriť kompletný zoznam je nemožné, avšak v prehľade sa už objavili prvé z úloh, ku ktorým som priložil aj vysvetlenie tejto problematiky a tiež fungovania segmentov, do ktorých sú úlohy začlenené."}, {"28": "Dnešní upgrade na betě přinesl vylepšení turnajů. Sbohem otravné okno s odměnou za střet [smilie--sprite1][BR]Spoiler[IMG]https://i.ibb.co/Z6Mq11f/https-cz-forum-elvenar-com-index-php-attachments-v-st-i-ek-2-jpg-3577.jpg[/IMG]"}, {"31": "V rámci testovania udalosti Mořské panny na bete došlo k zisteniu, že nekonečný počet úloh spočíva v opakovaní posledného segmentu. Tento segment je známy (vrátane viacerých variácií jeho úloh) a rozpísaný v aktualizovanom prehľade Události a úkolové linie - Mořské panny."}, {"16": "Jo, ten segment jsem si ověřil - už ho jedu na betě po šesté. Zatím moje město těsně před koncem půlčíků nejvíce zdržuje 15 oparů vidění."}, {"15": "@iDavis   Kde  byla k vidění (a příp.sehnání) tahle budova ? Nikde jsem to nenašla včera ani dnes .Můžeš mi to[BR]upřesnit ? Zdravím  a děkuji . Myslím tím tu budovu přátelství .[BR][smilie--sprite10][smilie--sprite8][BR][BR]Příspěvek přesunut. Embla"}, {"66": "Jj, nabízelo jí to včera ka koupi v rámci světového dne přátelství (bylo toho plné oznámení).[BR]Zajímalo by mě, jestli ji někdo postavil, ráda bych viděla její animaci."}, {"1": "\"Ak máte akékoľvek pripomienky ohľadne tejto témy, kontaktujte ma súkromnou správou tu na fóre alebo napíšte do témy Zprávy z beta serveru.\"[BR][BR]Respektujte prosím přání iDavise a jakékoliv dotazy mu pište sem. [smilie--sprite2]"}, {"31": "@Green Jane ako píše Prealiena, len včera v rámci platených balíčkov.[BR][BR]@Prealiena animácia:[BR][BR]Spoiler[IMG]https://i.ibb.co/QCVKcs5/http-ipic-su-7y-FVUf-png.png[/IMG][BR]A vďaka @Embla za presunutie."}, {"16": "Ví někdo, kdy začne event tady? Čekal jsem, že bude Inno chtít, aby se celá vešla do Srpna, ale zatím nic."}, {"99": "Nějak už jsem si zvykla na odstup 2 týdnů od bety, tak bych to očekávala v pondělí... Ale je to jen odhad [smilie--sprite1]"}, {"3": "to já doufám, že ještě o chvíli později. Potřebuju ideálně týden na přechod do další kapitoly [smilie--sprite8]"}, {"16": "Měl by to být letní event, takže by bylo trošku divné, kdyby trval do půlky září."}, {"3": "léto končí 23.9. [smilie--sprite7]"}, {"157": "Mě by se hodil odsunout až po 20. září [smilie--sprite2][smilie--sprite11][smilie--sprite8], skoro celý event budu v Tramtárii [smilie--sprite4]."}, {"16": "@Arweene To už bude klepat na dveře zase podzimní event."}, {"91": "U mě končí až na konci září. Tak zase ale odehrát každou událost není třeba, teď jsem na tom stejně bídně s místem, a úkoly bývají stále záludné na místo."}, {"157": "@Lovec Krys  no to jen, že každému se to hodí někdy jindy [smilie--sprite1]"}]