[{"11": "Letní event se říkalo už letnímu slunovratu a budovy jako shrom. stád nebo V. skaliska mi do letního eventu dle tradice sedí víc než nějaký mořský panny.[BR]Holt je letos těch eventů s truhlama trochu víc."}, {"31": "Termín udalosti Mořské panny je v tejto chvíli známy a nájdete ho v prehľade."}, {"66": "@iDavis V těch segmentech běží úkoly v pořadí, jak jsou napsané? Nebo vyskakují náhodně a až se dobere jeden segment, začnou náhodně padat z dalšího."}, {"31": "@Prealiena jednotlivé úlohy idú v poradí. Avšak ako je tam uvedené, niektoré z nich môžu mať medzi hráčmi rôzne zadania."}, {"28": "@iDavis Dopřekládáš i další segmenty? Je jich tam koukám daleko více, viz https://elvengems.com/mermaids/quests/.[BR][BR]Jinak tedy nevím, ale na elvenstats píšou, že úkoly jdou náhodně z daného segmentu, ne popořadě. Pouze úkoly v prvním segmentu za 30 korálů jsou pro všechny stejné. Navíc v těch segmentech jsou vypsány úkoly, které hráči vypozorovali na betě, může se tedy stát, že se tam někomu objeví i něco, co v seznamu uvedené vůbec není, protože to na betě neodchytili. I když se podívám na seznam úkolů od jednoho hráče na betě zde, tak ty úkoly má přeházené oproti tomu, co je na elvenstats, tj. i zde od iDavise. Zdá se tedy, že to bude spíše náhodně."}, {"31": "@Thespia áno ako som tam napísal, pripíšem aj ďalšie.[BR][BR] Okrem prvého je našťastie dokázané poradie úloh aj posledného segmentu (opakujúceho sa), náhodnosť zvyšku úloh môže spočívať vo väčšom množstve variantov, pri jednotlivých úlohách (posledný segment má v každej maximálne 2)."}, {"28": "@iDavis Ah, pardon, já to jen zběžně proletěla a viděla jsem, že tam segmenty chybí.[BR][BR]@voyager-1 Jo, poslední dobou se to tu eventy jen hemží [smilie--sprite1] Tenhle event je spojený nejen s mořskými pannami, ale i pláží a ta ve spoustě lidí léto evokuje [smilie--sprite1] Viz některé budovy, třeba tahle https://i.ibb.co/Njpg4qw/beachbar.png, ta mě strašně baví [smilie--sprite8][BR][BR]Jsem na to celkem zvědavá, jak mi to půjde [smilie--sprite1] Věřím ale, že pro hráče s nedostatkem prostoru to bude celkem oříšek, když nebudou s jistotou vědět, co přijde, a nachystat si toho více, pro všechny případy, nebude kde."}, {"16": "K poslednímu segmentu:[BR]Úkoly jsou v tom pořadí, v jakém jsou sepsané.[BR]První 2 jsou v každé iteraci vždy.[BR]Úkoly 3 - 10 mají subvariantu a a b, z nichž se vždy jedna náhodně vybere.[BR]Tzn., dostanete např.[BR]1,2,3a,4a,5b,6a,7a,8b,9b,10a[BR]a v dalším průchodu[BR]1,2,3b,4a,5b,6b,7b,8a,8b,9b,10b[BR]a tak pořád dokola."}, {"5": "Tiše závidím těm, kdo má mramor a elfům s bonusem na prkna, mohou tam těch pidi manufaktur nasypat 2x tolik [smilie--sprite1][BR]...řekněme, že cca 50% hráčů je zvýhodněno na Eventy oproti druhé polovině s ocelí a /prkna u lidí/"}, {"148": "Hraji na betě ve 3. kapitole. Pořadí úkolů nemám stejné. Uvedu příklad : V segmentu za 54 korálů se mi některé úkoly opakovaly dvakrát : např.nakup 15 VB, výroba T1 24 hodin 7x, výroba T1 9 hodin 7x.[BR]Příprava dopředu moc nefunguje, když ti naskočí 24 hodinová výroba, kterou jsem v seznamech nikde neviděla.[BR]Zatím jsem u u segmentu 57, protože po všech těch 24 hodinovkách mám ted T1 48 hodin 3x. Nevadí mi to. Nikam se nehoním.[BR][BR]Tak beru zpět [smilie--sprite1])) Už nebaví. Další úkol T1 24 hodin 7x. Ve zveřejněných seznamech tento úkol také není. Takže pochybuji, že je stejné pořadí  úkolů u všech."}, {"158": "@ElfNostradamus ono není co závidět, protože tam jsou stejně úkoly typu postav 2x budovu na level 16+ nebo místo toho prozkoumej provincii. A pak úkol typu dokonči 2 provincie. To je prostě neprostý nesmysl v konečných fázích hry. Takže ty iterace úkolů budou stejně limitované tím co má člověk teď k dispozici na mapě. Protože já například musím čekat 4+ dny na průzkum provincie, které prý potřebuji 2 na dokončení úkolu, to je přeci absolutní NONSENSE!!![BR][BR]Takže za mě toto bude nejhorší event v dějinách eventů a překoná to starou frustraci, že neplatící člověk nemohl dosáhnout na 3, leckdy na 2 hlavní odměnu v prvních verzích eventů [smilie--sprite8]."}, {"16": "@Fjorgyn No moje beta vesnice sice není na konci výzkumu (začátek elementálů), ale nejvíce mě zatím brzdí úkol získej 15 oparů vidění (= 3x žrádlo, nebo 1x věc, co se objeví jednou za uherský rok, dneska jsem dokonce craftil 15xVB, protože už mě nebavilo čekat na nějaký smysluplný recept).[BR]Ale mám výhodu v tom, že provincií vyzkoumaných ale nevyčištěných mám slušnou zásobu a na průzkum cca den.[BR]Nicméně úkoly na 10 střetů (s turnajovou alternativou) a dokončení 2 provincií se dají kombinovat a to tak, že při úkolu 10 střetů si nechávám 1 nevyřešený střet a pokračuji v další provincii. Takže když tohle vyjde, tak mě dokončení 2 provincií stojí jenom 2 střety.[BR][BR]Ale jsou tam i další zábavnosti, stává se mi, že se mi úkoly 4 a 5 nakombinují na 40VB do divu + utrať 30 VB(ten tam je dokonce 2x), takže zásoby VB požehnání to dokáže vyluxovat taky rychle, pokud je člověk průběžně investuje."}, {"158": "@Lovec Krys takže ve výsledku člověk skončí po prvních 50 úkolech a má klid od eventu to je fajn [smilie--sprite8]"}, {"3": "no je to zkrátka první pokus. Pokud se to osvědčí, můžeme se na to asi těšit pokaždé... [smilie--sprite8]"}, {"15": "Pokud vím tak začnou v pondělí 5.8.2019 . [smilie--sprite8][smilie--sprite11][smilie--sprite8]"}, {"167": "ahoj, vím že toho máš moc, ale přesto bych se rád zeptal: okopíroval jsem od Tebe úloha, do compu uložit ( kopírovat ) jdou, ale do zprávy pro společenství ne. Vůbec se neobjeví nabídka \"vložit\""}, {"28": "@Lovec Krys Kolikrát jsi to na betě zatím stihl otočit, ten poslední segment?[BR][BR]@joskap Použij ctrl+c (kopírovat) a ctrl+v (vložit), úkoly si zkopíruj z textové verze, kterou najdeš tady."}, {"167": "děkuji převelice[smilie--sprite1][smilie--sprite1][smilie--sprite1]"}, {"16": "@Thespia Teď zase stojím na 15 oparech vidění (zatím vyrábím žrádlo na prvních 5) a jedu ten cyklus po 11., tzn. 10x celý.[BR]Mám 7692 korálů a jsem 60 perel od druhého mořskopanenského ráje."}, {"31": "Čo sa skrýva v mušliach.. [smilie--sprite1][BR][BR]"}]