[{"66": "Zprávy z Facebooku, zítra v 17.00 hod bude Live Q&A"}, {"31": "Poznámky zo živého vysielania 7.8.2019[BR][BR]Spoiler: Poznámky zo živého vysielaniaBudú pridané nové rozšírenia?[BR]Áno, samozrejme. Hra je založená na spriatelených rasách a práve pri týchto budúcich príležitostiach budú pridané. Už sme na to spravili prípravu, keď sme rozšírili hernú plochu.[BR][BR]Dajú sa získať úlomky kouzel bez akadémie?[BR]Momentálne iba prostredníctvom výziev, ale v budúcnosti budú dostupné aj z nadchádzajúcej Veže večnosti.[BR][BR]Prečo sa nezapočítavajú zásoby získané z úlohy do inej úlohy?[BR]Princíp úlohy je aby vyžadovala vykonať nejakú akciu v meste a tak získať danú surovinu, nie aby odmena z jednej úlohy bola potrebná do druhej.[BR][BR]Kedy príde nová kapitola?[BR]Dátum je zatiaľ náročné povedať, ale pracujeme na nej. [BR][BR]Budú niekedy zavedené univerzálne artefakty na akúkoľvek rozvinuteľnú budovu?[BR]Nad týmto nápadom sme už rozmýšľali. Má to klady aj zápory - keď počas udalosti ťažkou bojujete o artefakt a niekto iný nie, nebolo by fér keby získal tento artefakt nabudúce len tak. Preto si v tejto chvíli nie sme istí, či by to bolo férové. Ale nikdy nehovor nikdy.[BR][BR]Budú morské panny v ďalšej kapitole?[BR]Ak sledujete príbeh Elvenaru, určite ste si všimli že tam nikde nie je zmienka o morských pannách. Morské panny výborné fungujú ako príležitostná udalosť, ktorú práve máme. Možno sa objavia inokedy zase v udalosti, ale ako spriatelená rasa nie sú v pláne.[BR][BR]Bude niekedy šanca získať opäť budovy Fénixov?[BR]Tieto budovy sa vzťahujú priamo k daným udalostiam a je to váš benefit, ak ste sa ich vtedy zúčastnili a získali ich. Pokiaľ získate artefakty budov, ktoré nemáte, môžete ich stále využiť vo výrobe.[BR][BR]Nejaké novinky o Veži večnosti?[BR]Práve sme na bete spustili funkciu tajomných bední, ktoré sa objavujú v okolí veže (počas toho ako ňou prechádzate) a v rôznych hodnotách ponúkajú rôzne, náhodné odmeny. Tieto odmeny sú vždy zaujímavejšie ako ostatné, ktoré vo veži získavate. Stále sledujeme spätnú väzbu a naďalej sa venujeme vylepšovaniu veže. Máme s ňou obrovské plány, takže rozhodne sme teraz neskončili.[BR][BR]Budeme mať správy na mobile?[BR]Áno. Pripravujeme túto funkciu spolu s niekoľkými ďalšími plánmi, ale je rozhodne na našom zozname plánov.[BR][BR]Môže byť v jednom meste postavených viacero budov Ráj mořských panen?[BR]Áno. Keď získate 10 artefaktov k prvému raju, v hlavných odmenách sa objaví druhý. Takto ich je možné behom udalosti získať niekoľko. Tentokrát máme nekonečné úlohy, takže to je možné.[BR][BR]Poznámka hráča k možnosti výberu z troch, rôzne farebných, fénixov.[BR]Budovy fénixov boli navrhované inak ako ostatné - statické - rozvinuteľné budovy. Chceli sme, aby bolo možné cítiť že fénixovia žijú a teda ich je treba kŕmiť, aby bolo možné využiť ich plný potenciál. A čo je viac, na obzore je nová udalosť, v ktorej plánujeme predstaviť nové zvieratá. [BR][BR]Pridáte niekedy ďalšie možnosti získavania bodov do rebríčka?[BR]Máme nejaké nápady a budeme radi aj za vaše a vašu spätnú väzbu.[BR][BR]Veža vypadá byť dosť drahá na náklady. Máte nejaké plány?[BR]Keď porovnáme náklady turnajov s vežou, sú vlastne rovnaké. Veža obsahuje jeden stret s hodnotou niekoľkých v turnaji, čo šetrí čas a počet klikov, ale preto musí mať aj vyššie náklady. Veža je viac zameraná na pocit dobrodružstva. Aj keď vykonáme vylepšenia súčasných odmien ktoré veža ponúka, nebudeme zdvíhať ceny ktoré sú tam zavedené práve teraz.[BR][BR]Zvažujete pridanie plánkov ako odmien v udalostiach?[BR]Plánek je vlastne špeciálna odmena za turnaj, čo robí turnaj jedinečnou príležitosťou jeho získania. Snažíme sa, aby bolo viacero herných komodít, ktoré sú získateľné práve z nejakého jedinečného zdroja.[BR][BR]Bude niekedy možné otáčať budovy?[BR]Nie.[BR][BR]Ako sa korály okolo mesta dostali do stromov?[BR]Museli to byť nejaké Elvenarské opice, skákajúce okolo.[BR][BR]Budeme mať viacero udalostí v rámci spoločenstiev?[BR]Dobrodružstvá spoločenstiev je jedna z možností, ale máme veľa nápadov na nové veci. Pravdepodobne nie tento rok, ale rozhodne je to niečo, čo považujeme za možné.[BR][BR]Budeme niekedy schopní darovať VB do prastarých divov iných hráčov v mobilnej verzii?[BR]Áno, je to na zozname spolu so správami.[BR][BR]Zadávanie produkcií na mobile bolo vylepšené, je takáto zmena plánovaná aj pre prehliadačovú verziu?[BR]Možno, niekedy v budúcnosti možno áno."}, {"154": "A mate to jasně řečeno, náklady na vež jsou stejné jako turnaje, nevím co pořád řešíte."}, {"66": "Dost mě zarazilo, s jakou neurčitostí/neochotou odpovídali na tu poslední otázku o vylepšení zadávání produkce na pc. Bylo to podobné, jako jejich reakce na otázku o univerzálních artefaktech, skoro jako kdyby chtěli říct ne, ale aby nikoho nenaštvali, tak se uchýlili k \"možná někdy/nikdy neříkej nikdy\". Ale jsem dost zklamaná, že to pro ně není více reálná věc."}, {"16": "@mohyla98 Nějak jsem si toho nevšiml, proč jim v tomhle jenom nevěřím? Možná jestli nepočítali 50 provincií na 6*, to už by se možná mohlo i blížit.[BR]Každopádně i kdyby ano, stačí porovnat zisk z turnajových 50*6 provincií a z jedné věže, to ta věž vyjde z toho porovnání obzvláště tragicky - to budou muset ještě hodně vylepšovat, jen nesmí zároveň s krouháním obtížnosti krouhat i odměny.[BR][BR]Dajú sa získať úlomky kouzel bez akadémie?[BR]Momentálne iba prostredníctvom výziev, ale v budúcnosti budú dostupné aj z nadchádzajúcej Veže večnosti.\t\tKlikněte zde pro zvětšení...To je sice hezké, že úlomky kouzel bude možné získat i z věže, ale hráčům bez Akademie kouzel to stejně v eventech nepomůže, když vzápětí dostanou úkol na opary vidění, které bez Akademie získat nepůjde ani s věží.[BR]Jo já zapomněl - vývojáři předpokládají, že si věž všichni postaví.[BR][BR]Nová kapitola:[BR]Takže si můžeme v klidu ještě odpočinout, než domyslí další kapitolu, jejich odpověď v praxi znamená, že budeme čekat ještě další měsíce (možná to i letos stihnou). Aspoň si před ní ještě vylepším divy[BR][BR]ps:[BR]\t\t\tA čo je viac, na obzore je nová udalosť, v ktorej plánujeme predstaviť nové zvieratá. Klikněte zde pro zvětšení...Že by veverky?"}, {"11": "Tak že si někdo nepostaví akademii je jeho problém, já si to bez ní nějak neumím představit."}, {"16": "@voyager-1 Nejspíše z podobného důvodu, proč si někdo nepostaví Kasárna.[BR]Kasárna se dá na eventy obejít tím, že se postaví cvičiště nebo tábor - ty jdou po eventu zase zbourat. [BR]To Akademie nejde."}, {"3": "hrát bez akademie je stejné, jako hrát bez událostí. Nechápu proč někdo, kdo nehraje hru celou brečí, že nemůže dělat jinou část..."}, {"114": "taky nechápu proč někdo nemá akademii, co do velikosti města zabírá nic nic a umí tolik užitečných věcí které lze zužitkovat v turnajích - kraftění vojenských budov, na krmení fénixe (a přibudou další zvířátka) na zvýšený sběr zboží a kladívek atd., odmítat mít akademii to je jako odmítat jeden z prstů na ruce..."}, {"168": "Úprimne povedané, ja som dlho nadávala, že som postavila akadémiu, ktorá mi veľmi dlhú dobu stála bez akéhokoľvek využitia. Odkedy tam je kraftenie, tak má aspoň nejaké využitie. Čo sa týka vojenských budov, tak ak by bola taká možnosť, tak kasárne zbúram, to ale bohužiaľ nejde. Cvičisko a tábor nemám vôbec, jedno som nikdy nepostavila, druhé dávno zmazala. Celkovo vyrábam vojakov len preto, že mám priveľa kladívok a keď už mám kasárne, tak nech je to aspoň na niečo použijem. Inak fungujem bez bojov, len vykupovaním surovín, som na Amunoch a ide to bez problémov. Áno, rozčuľujú ma úlohy, ktoré chcú vyrobiť nejaké množstvo vojska, prípadne vyrobenie určitého množstva oparov, ale beriem to ako súčasť hry - bolo to moje rozhodnutie, čo postavím a čo nie, takže tomu musím prispôsobiť zvyšok.[BR][BR]Viac mi vadia úlohy v rôznych eventoch, ktoré odo mňa chcú 24-hodinovú výrobu, ktorú už nemám kvôli špeciálnemu zboží od lvl 24 v manufaktúrach dostupnú."}, {"3": "bez armády? A jak jedeš turnaje? A pokud nejedeš, víš, co všechno ti utíká? Jinak cvičiště a žoldnéře taky nemám a zatím ani neplánuju "}, {"11": "se podívej do její historie na obou světech a pochopíš. Jinak jestli se snažíš hrát turnaje ve větším, bez cvičiště to taky není ono. Ale jsem línej hledat v který jsi kapitole "}, {"91": "To mě taky štve, že od elementálů kvůli speciálnímu zboží už nejsou 24h a 48h výroby základního zboží. Sice tu někdo řešil neefektivitu dlouhých výrob, ale já je využívám, toho zboží jsou spíš přebytky. Cvičiště a tábor mám, protože jsou tam zajímavé jednotky, sic teď teprve některým přicházím na kloub. Výcvik v táboře jsem už trochu dohnal oblačkou, ale cvičiště furt nestíhá, ještě nemám na to div. Každopádně ti psi mi pak chybí, šermířka se psu prostě nevyrovná. V táboře je plno zajímavých jednotek, jen chce mít vyzkoušené která se na jaký turnaj hodí."}, {"16": "Když má pokročilý hráč dostatečnou výrobu surovin, tak může jet turnaj i bez armády jen výkupem. Dle mého odhadu se tak dá týdně nahrát cca 1000-200 bodů.[BR]Tedy dost i na deseti truhlové společenství.[BR]Ale k bodovaným pozicím se prostým (pravidelným) výkupem nedostane.[BR][BR]To, že nejdou zbourat některé budovy, je dle mého blbost, jediné dvě budovy, u kterých to dává smysl, jsou sídlo a dělníci. Vše ostatní by dle mě mělo být zbouratelné."}, {"168": "Emhyr var Emreis II napsal/a:\t\t\tbez armády? A jak jedeš turnaje? A pokud nejedeš, víš, co všechno ti utíká? Jinak cvičiště a žoldnéře taky nemám a zatím ani neplánuju Klikněte zde pro zvětšení...[BR]Idem ich cez suroviny. Iba keď sa veľmi nudím, tak idem cez pár bojov, na ktoré vyrábam vojsko postupne v kasárňach. Mňa jednoducho boje nebavia, v tejto hre už vôbec. [BR][BR]A čo sa týka tých turnajov, tak u nás v spoločenstve sa hrá turnaj tak na maximálne 4 debnu. Bola som v spoločenstve, kde sa to hrotilo na 1000 bodov každý turnaj od každého a dosť ma to otravovalo. Hlavne keď som v stave, že tie relikvie už nepotrebujem, lebo som na maxime bonusu. Áno, plánky sú super, ale z toho obdobia som ich mala asi 15, doteraz z nich fungujem. Nebaví ma bojovať každý týždeň 5 dní kvôli pár bodom a relikviám. To si to radšej vyrobím postupne. [BR][BR]Aj tak sa nie je kam ponáhľať. Tak či tak som už dvakrát túto hru prestala na pár mesiacov hrať, keď som sa dostala do stavu, že som bola necelú kapitolu pred aktuálnym koncom. Vždy si dám pauzu ( v mojom spoločenstve to tak nevadí) a po jednom až troch mesiacoch sa zase vrátim a pokračujem. Pomedzi to sa občas prihlásim, aby mi nebolo zmazané konto, pozriem, čo je nové..  Jednoducho je to hra, tak sa hrám, keď mám na to náladu a čas.[BR][BR]Momentálne hrám turnaje len vtedy, keď odtiaľ potrebujem kúzla pre nejakú úlohu a čakám na turnaj kde je hodvábí, lebo to mám ako živoucí zboží a nemám tam ešte maximálny bonus."}, {"16": "@Rona Elrondino Mažou se pouze města, která nedosáhla 3. kapitoly a nekoupila diamanty. Proto na mapě zůstává roky tolik mrtvých měst (vím o městech ve své blízkosti, která jsou neaktivní již nejméně 2 roky (např. mají již dva roky rozestavěnou tu samou budovu))."}, {"168": "To je možné, ale ako som vravela, kontrolujem tým aj to, čo je nové. Prihlásim sa, skontrolujem, či sa nejako nezmenil výzkum, či niečo nové nepribudlo a podobne [BR][BR]Odstraněna citace. Embla"}, {"3": "Rona Elrondino napsal/a:\t\t\tA čo sa týka tých turnajov, tak u nás v spoločenstve sa hrá turnaj tak na maximálne 4 debnu. Bola som v spoločenstve, kde sa to hrotilo na 1000 bodov každý turnaj od každého a dosť ma to otravovalo. Hlavne keď som v stave, že tie relikvie už nepotrebujem, lebo som na maxime bonusu. Áno, plánky sú super, ale z toho obdobia som ich mala asi 15, doteraz z nich fungujem. Nebaví ma bojovať každý týždeň 5 dní kvôli pár bodom a relikviám. To si to radšej vyrobím postupne.\t\tKlikněte zde pro zvětšení...tak já taky nebojuju ručně a jedu přes automat. co nejde ubojovat, to vykoupím.[BR]Ale turnaje jsou pro mě především zdrojem VB. Z celého turnaje (10 beden) dostaneš kolem 100 VB pro svoje divy a to nemluvím o VB z provincií. Kromě prvních devíti z každé další dostaneš 5VB na druhé úrovni a dalších 6 na 5. Na tu už nechodím často, ale udělat si třeba 20 dalších provincií na druhou úroveň znamená dalších cenných 100 VB. To už stojí za to [BR]A samozřejmě množství kouzel (zatím hlavně do craftu). úlomky run bohužel letí komínem a runy a relikvie se spíše hromadí, ale věřím, ež časem je půjde nějak zužitkovat, tak proč si je nenasyslit?[BR][BR]A k plánkům, kouzelnou budovu mám jedinou, ale táhnu napříč kapitolami dva sety a fénixe a do budoucna těch budov určitě přibude a jen na tohle potřebuju cca 150 královských rekonstrukcí (15 plánků co 4 měsíce). Kdyby jich bylo víc, využil bych i víc... [BR][BR]Ne, turnaje jsou opravdu mocná věc"}, {"168": "Emhyr var Emreis II napsal/a:\t\t\tNe, turnaje jsou opravdu mocná věc\t\tKlikněte zde pro zvětšení...[BR]Áno, sú super, keď máš na to dosť času a okolo seba kopec ľudí, ktorí na to tiež majú veľa času. Ja to hrám ale čisto ako zábavku, nemám sa kde ponáhľať, keďže som 1,5 kapitoly pred aktuálnym koncom. Viac mi vyhovuje, že idem pomaly, takže mi ani nevadí to, že nemám všetky svoje divy nabité bodmi z turnajov. Tak nejako ich mám stále dosť aj z rôznych eventov, prípadne bonusových budov a podobne. Plánkov mám zatiaľ ešte stále tuším 6 a to som povylepšovala v amunoch kopec budov na vyššie kapitoly kvôli bonusovým ľudom za to."}, {"43": "Co to je tady zase za diskuzi,to si nemůžete jít krafat tam kam to patří.Jsem tu dlouho nebyl,tak si říkám,mrknu se na zprávy z beta serveru a najdu tu tohle! Se divím,že ten bordel tady nikomu nevadí..."}]