[{"91": "papap >> Úděl tak obecně zaměřené diskuse. Téměř jakékoliv téma coby zpráva z beta serveru dá vzniknout odpovědi na onu zprávu, kdyby byla jinde, nedávalo by to žáídný smysl, ani taková konkrétní témata znovu zakládat."}, {"169": "Tu výzvu z odměnami mysli tvůrci vážně????Odměny 15min boost,3VB,pak 7VB,hodinové boosty a hlavni cena 5h boostu????!Nebo je to bug,záměr nebo sranda"}, {"16": "@CrazyWolf Cz To máš pár drobných k tomu, co běžně děláš. Kvůli tomu nemá smysl stavět manufaktury navíc. Ale taky to může být jen na betě a na ostré servery se to nedostane vůbec (místo toho bude něco jiného nebo v jiné podobě)."}, {"3": "možná je to tím, že po eventu má spousta hráčů ty manufaktury postavené, ale kdo ví... já jsem pořád doufal ve stonehenge artefakt, ale asi už fakt nebude"}, {"158": "V jedné z posledních výzev se také lišily odměny beta vs oficko. já bych ještě neztrácel naději "}, {"2": "Možná dají fénixe. To je jediný barák kde další kouzla slíbili.[BR]Pokud nedají další kouzla na Stonehenge, asi ho nahradím."}, {"16": "Na betě oznámeno dobrodružství se začátkem v Pondělí. Bližší informace zatím nejsou známy.[BR][BR]Edit: Tak dle dalších informací z beta fóra by měla být konfigurace takováto:[BR]Spoiler[IMG]https://i.ibb.co/hWj1yHL/https-beta-forum-elvenar-com-index-php-attachments-upload-2019-8-24-11-17-40-png-6235.png[/IMG]"}, {"103": "Nevíte kdy bude Další Dobrodružství Společenství prosím?  [BR]Děkuji ♥ =)"}, {"16": "@ANCARY Na betě zítra, tady odhadem za týden až dva."}, {"66": "@Lovec Krys A co ta výzva, co tam teď byla?"}, {"16": "@Prealiena U té těžko říct, buď přijde nebo ne, vzhledem k odměnám v ní je mi to fuk."}, {"5": "Nějak se nám ustálil 14denní odskok od Bety, tedy DS za 14dní, pokud zítra začne a do toho se příští týden může vejít ona výzva...je tam pár urychlovačů jako odměny, což se vždy hodí "}, {"31": "Prehľad odmien v nadchádzajúcom kole..[BR]Dobrodružství společenství[BR][BR]Spoiler: Dobrodružství společenstvíOdmeny v zlatej veži[BR]1. mapa1x prastará vědomost (10)1x prastará vědomost (15)1x prastará vědomost (20)2. mapa1x prastará vědomost (15)1x artefakt Stonehenge1x artefakt mořské panny3. mapa1x prastará vědomost (30)1x artefakt Stonehenge1x artefakt mořské panny[BR]Dátum dám vedieť až sa termín trochu priblíži (aby sa zredukovala šanca dovtedajšej prípadnej zmeny)."}, {"66": "Kde jsou artefakty fénixe?"}, {"3": "jupí, stonehenge!"}, {"160": "Dá se nekde najít konkrétni mapa, která bude na dobrodružství?"}, {"148": "také jupíí za Stonehenge "}, {"103": "Všechny možné novinky o Věži Věčnosti, všechny patra i Finále a ZAMRZLÝ KONEC KTERÝ POKRAČUJE DÁL, je již přístupný zde na našich fanouškovských stránkách. Jsou tam i Budovy které se dají získat ve Věži a další různé novinky  ...Vypadá to že vývojáři a Elvenarovci chystají další patra =)[BR][BR]Odkaz: https://www.elvenarczsk.cz/i-novinky/[BR][BR]Příspěvek upraven. Embla"}, {"88": "Jestli další patra s ještě menším poměrem mezi vloženým a vyhraným, tak to asi půjde pouze jen okolo mne..."}, {"16": "Na betě už je zkrácený čas v akademii kouzel pro rotaci receptů z 8h na 6h. Kromě toho byly některé recepty odstraněny, jiné přidány a některé změněny:[BR]https://beta.forum.elvenar.com/index.php?threads/release-notes-version-1-88.13588/"}]