[{"16": "Thespia napsal/a:\t\t\tNáš starý známy Crazy Wizard již taky pracuje na soupisu informací k eventu. Můžete mrknout na 1.část a 2.část. Na betě se lidi hodně rozčilují, že nebudou platit surovinami za to, aby získali 1 minutový urychlovač.... Pokud někdo není až tak aktivní a pravidelně nevybírá z budov manu, tak budovy ani nejsou až tak sympatické. Ale vzhledově se jim opět moc povedli, to se jim musí nechat.\t\tKlikněte zde pro zvětšení...No jestli bude poměr nákladů na úkoly vs odměny takový, jako v odkazu, tak končím 4. úkolem. Fakt nehodlám vypláznout takové nehorázné množství surovin za budovu, jejíž bonusy ani nestojí za postavení - to by ty bonusy museli vynásobit tak 10. Radši za ty suroviny vykoupím pár provincií na rozšíření města."}, {"31": "Nové okno noviniek v hre[BR][BR]SpoilerNa bete dnes prebehol update, ktorý priniesol vedľa ikony spoločenstva novú ikonu, smerujúcu do nového okna noviniek:[BR][BR][BR][BR]Aktuálne na bete obsahuje 2 novinky, ktoré pomocou nových tlačidiel odkazujú na fórum:[BR][BR][BR][BR]A zároveň Marindor prezradil niečo viac k blížiacej sa veľkej novinke, spomenutej už tu.[BR][BR]Spoiler\"One of the next things that we'll be testing shortly on Beta, will be a super secret kind of multiplayer event. [BR]This feature will have totally new game mechanics and in order to have enough time to test that properly, we had to reduce the beta testing time for this QLE event.\"[BR]Preklad:[BR]Jedna z vecí ktorá bude zakrátko testovaná na bete, bude super tajný typ multiplayer udalosti. [BR]Táto funkcia bude obsahovať úplne nové herné mechaniky a aby sme mali dostatok času na jej dôkladný test, museli sme zredukovať čas venovaný akcii Připravte se na maškarní!"}, {"31": "Na betu dorazil nový update... Dobrodružstvá spoločenstiev[BR][BR]Spoiler: Dobrodružstvá spoločenstiev (Fellowship Adventures)Jedná sa o úplne nový event, zameraný špeciálne na spoločenstvá. Bude trvať jeden týždeň a vraj ho plánujú pravidelne opakovať s obmenenými požiadavkami a odmenami.[BR][BR][IMG]https://i.ibb.co/Xz5XsFR/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-fellowship-adventures-FA01-png.png[/IMG][BR][BR]Základ bude spočívať v plnení úloh, ako sme na to zvyknutí. Z nich budeme dostávať nové predmety, ktoré nám umožnia ďalej pokračovať v evente.[BR][BR][BR][BR]Novým prostredím eventu bude táto mapa:[BR][BR][BR][BR]Na nej budeme ako spoločenstvo postupovať riešením jednotlivých stretov. Tie sú vyznačené troma farbami, ktoré nejakým spôsobom odlišujú ich koncept. Úlohou spoločenstva je dostať sa k Zlatej veži. Existuje viacero ciest ako sa k nej dostať a je iba na stratégii spoločenstva, ktorú si vyberú.[BR][BR][BR][BR]Zlatá veža obsahuje odmeny pre členov spoločnosti v troch truhliach.[BR][BR][BR][BR]Súčasťou truhlí sú nové požehnání a špeciálne kultúrne budovy.[BR][BR]Okrem vyššie uvedeného bude spoločenstvo za riešenie jednotlivých stretov na mape eventu získavať body do špeciálneho rebríčka.[BR][BR][BR][BR]Spoločenstvá ktoré sa umiestnia v TOP 50 budú odmenení ďalšími odmenami v podobe nových požehnání zesilovačov (až 14 hodinových), eventových kultúrnych budov (konkrétne z udalosti Znovuzrození fénixe) a bodov do rebríčka spoločenstiev.[BR][BR]Na našom serveri by sa mala akcia objaviť 25.8., ale nakoľko ide o veľkú novinku, je možné že príde až neskôr."}, {"28": "Jupí, akce pro společenství. Těším se  Uvidíme, jak to bude ve finále vypadat. Klidně sem hoď i nějaké svoje osobní dojmy z této novinky, až to na betě vyzkoušíš "}, {"29": "Tak tohle vypadá hodně dobře, jsem na to neskutečně zvědavá, hlavně na náročnost těch střetů..."}, {"32": "Taky jsem na to zvědavý, snad to bude stát za to . A hlavně doufám, že u mě ve spolku bude dostatečná spolupráce..."}, {"2": "já jsem na to moc zvědav[BR]bojím se že to bude jako turnaj, plný výkon dává jen pár agresivních společenství, která vybírají aktivní hráče z celého serveru, zbytek má útrum"}, {"59": "Asi to nebude stejné jako turnaje, to by ztrácelo smysl. Záleží hodně na tom, jaká bude koncepce úkolů či střetů. V každém případě to vypadá na rozšíření hry a více mozolů na zadnicích. "}, {"60": "to vypadá zajímavě, už se těším )...hodně mně to připomíná expedici společenství na FOE "}, {"31": "Čoskoro k nám dorazí... Maškaráda - 2. časť[BR][BR]Spoiler: Maškaráda - 2. časť (Masquarade pt 2)Pokračovanie úkolovej sady Maškaráda sa k nám dostaví ešte pred príchodom akcie spoločenstiev Dobrodružstvá spoločenstiev. Začiatok je naplánovaný už na budúci týždeň a to skôr, ako sa táto úkolová sada bude testovať na bete![BR][BR]Dôvodom je ten, že na bete sa práve testujú Dobrodružstvá spoločenstiev ktoré chcú na naše servery pustiť začiatkom septembra a technicky je momentálne nemožné, aby tam prebiehali dva eventy súčasne. Preto úkolová sada Maškaráda - 2. časť bude na bete až po testovaní eventu pre spoločenstvá.[BR][BR][IMG]https://i.ibb.co/9pSQyHt/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-masquerade-Banner01-png.png[/IMG][BR]Úkolová sada by mala bežať necelých 6 dní a obsahovať 12 úloh.[BR][BR]Spoiler1. Vyrob 50x nápoje[BR]2. Vyrob 30x chlieb[BR]3. Preskúmaj 1 provinciu ALEBO vylepši 1 budovu na level 10 alebo vyšší[BR]4. Vyrieš 26 stretov ALEBO získaj 26 relikvií[BR]5. Vyskúmaj 1 technológiu ALEBO vylepši 1 budovu na level 12 alebo vyšší[BR]6. Vyrob 40x jednoduché nástroje[BR]7. Získaj 14 relikvií[BR]8. Vylepši 4 budovy na level 4 alebo vyšší[BR]9. Vyrob 16x pokročilé nástroje + získaj nejaké množstvo zásob[BR]10. Utrať 23 VB[BR]11. Vyrob 12x košík jedla + získaj nejaké množstvo zásob[BR]12. Vyrob 10x sada nástrojov + získaj nejaké množstvo zásob[BR]Odmena za splnenie všetkých úloh bude tentokrát:[BR][BR][IMG]https://i.ibb.co/6wqT4yk/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-masquerade-Building02res02-png.png[/IMG]"}, {"44": "něco nového, nějaká rasa?"}, {"31": "Novinky v mobilnej aplikácii[BR][BR]SpoilerVčera prebehol update 1.38 v mobilnej aplikácii Elvenar, tak sme zase o krok bližšie k jej spusteniu. [BR][BR]Čo priniesol:[BR]Základné funkcie spoločenstievRebríček spoločenstievOpravy chýb"}, {"28": "Některá okna dostanou vizuální update, viz například záložka s relikviemi v hlavním sídle. Myslím, že se jim to tentokrát velmi povedlo  Jen by možná u informací o zvýšení výroby mohlo všechno začínat buď na malé nebo na velké písmeno.[BR][BR][IMG]https://i.ibb.co/g7RHGc2/https-cz-forum-elvenar-com-index-php-attachments-upload-2017-9-9-15-44-34-png-1882.png[/IMG]"}, {"29": "To je docela dobrý nápad, noví hráči kolikrát nevědí, na jaké suroviny mají bonus, takhle to poznají hned. "}, {"31": "Špekulácie[BR][BR]SpoilerNadviažem na to, čo vyššie spomenula @Thespia .[BR]Podľa špekulácií ktoré som čítal, pravdepodobne nepôjde iba o úpravu vzhľadu, ale stoja za tým aj nejaké ďalšie plánované novinky.[BR]Pozorne sa pozrite na tento obrázok (nový vzhľad v hlavnom sídle) a porovnajte ho s tým starým, na našom serveri:[BR][BR][BR][BR]Povráva sa, že by to mohlo súvisieť s novou rasou, ktorá by sa na bete mohla objaviť vraj už koncom tohto mesiaca.  Čo bude na tom pravdy?[BR]Na bete zároveň prebehol update ktorý priniesol... Novú ikonku inventára[BR][BR]Spoiler: Nová ikonka inventára"}, {"32": "To skoro vypadá, že půjde obchodovat se surovinami nové rasy, jak jinak si vysvětlit popisek - standartní zboží"}, {"37": "to neni trh, ale sklad. zrejme uvidime neco noveho ve skladu, ale to neznamena, ze s tim pujde obchodovat "}, {"32": "Ale ani to neznamená, že nepůjde [BR][BR]Trh to není, to máš pravdu ale to co je ve skladu s tím jde obchodovat, takže to klidně možné je . I když i samotné zobrazení všech surovin na jednom místě by bylo fajn.[BR][BR]A taky se klidně můžu stát, že jde jen o grafickou opravu a nic nového to nepřinese..."}, {"37": "no, bylo by fajn,videt tam orky, manu, seminka....[BR]to je muj typ. uz jen ze se to do rasovych produktu moc nehodi a problem se zobrazovanim bude mozna v mobilni verzi."}, {"2": "možnost obchodovat s dalšími surovinami, třeba jen s lidmi ze společenství, to by byla bomba"}]