[{"117": "chapu to dobre, ze v akademii pujde vyrobit fenix atd.? nebo uz mam vygumovano"}, {"148": "můžu potvrdit právě se mi na Betě nabídla možnost Ohnivého Fenixe v řemeslné výrobě [smilie--sprite1]"}, {"28": "Píšou tam, že půjde vyrobit pouze pokud ho už nemáš, ať už postaveného ve městě nebo jen v inventáři. Zároveň se ale hráči na betě ozvali, že jim ho to v akademii nabídlo, i když ho už mají. Takže buď chyba ve hře nebo v informacích. Tipuji to spíš na to první, ač doufám v to druhé [smilie--sprite1]"}, {"91": "Však ať to jde, aby ho mohl získat i ten, kdo událost nehrál, sic nevím jak jsou řešené artefakty pro vylepšení. Ale zase pro to, aby se dalo získat nekonečno Felixů nejsem, takže tu podmínku bych tam určitě dal."}, {"154": "konečně rozumná věc, to zkrácení rotace receptů [smilie--sprite1]"}, {"28": "Pauleo napsal/a:\t\t\tVšak ať to jde, aby ho mohl získat i ten, kdo událost nehrál, sic nevím jak jsou řešené artefakty pro vylepšení. Ale zase pro to, aby se dalo získat nekonečno Felixů nejsem, takže tu podmínku bych tam určitě dal.\t\tKlikněte zde pro zvětšení...[BR]Tak ono zase ty artefakty k tomu není úplně jednoduché získat."}, {"117": "ja treba omylem rozkraftila fenixe, kterého jsem chtěla, tak to uvitam"}, {"170": "mužete nekdo zjistit, kolik ulomku kouzel bude z artefaktu ? U budov to snizili na polovic."}, {"31": "Počet úlomkov za artefakty bol zredukovaný z 1500 na 1000. Teda pri akadémi na 5. leveli to činí 2000 úlomkov. Ak máte v inventári artefakty, ktoré plánujete rozcraftiť, rozhodne teda doporučujem urobiť to čo najskôr."}, {"16": "Tím snížením moc nepotěšili. My s aka5 a tisíci kouzly z turnajů s tím problém mít nebudeme, ale hráči s aka2 a s malou zásobou věcí na rozbití s tím problém mít budou."}, {"20": "@iDavis - Tak to je asi důsledek Věže. [smilie--sprite7] Aby se nám jinak slabé odměny ve Věži zdáli lepší, tak jinde sníží výdělek. No potěš košte [smilie--sprite12]"}, {"16": "Jen tak mimochodem, pokud je za tím opravdu strategie, jak píše Ludi, tak je to velice nebezpečná strategie.[BR]K čemu vede, jsem mohl vidět před pár roky v jiné hře.[BR]Hra sice ještě stále existuje, ale oproti původnímu počtu ji hraje jen zlomek hráčů.[BR]Tak doufám, že to není tento případ, nerad bych, aby se Elvenar vydal stejným směrem."}, {"20": "@Lovec Krys  To je také důvod, proč se tady tak roučiluju kvůli Věži od jejího spuštění. Nejde jen o Věž, ale o strategii vývojářů, kterou Věž jasně naznačila. Alespoň já to tak vnímám. Tak jen doufám, že včas dostanou rozum."}, {"31": "Doporučujem na pondelok 2.9. pripraviť nejaké tie manufaktury, inak vás môže hádajte čo prekvapiť. [smilie--sprite1]"}, {"16": "@iDavis Takže dobrodružství s týdenním zpožděním?[BR]Anebo ta zábavná výzva, jejíž odměny mě nemotivovaly k postavení žádných extra manufaktur, když běžela na betě?"}, {"31": "@Lovec Krys bude to tá výzva."}, {"171": "v pondělí je 2.9. [smilie--sprite2]"}, {"91": "No já uvažoval o rozložení artefaktů s rájem, ale když jsem si spočetl co už mám z minulých (Stone + pár artefaktů) úlomků kouzel (a s věží jich viditelně nemálo přibylo), a navíc se mi kvůli věži podařilo stihnout na poslední chvíli ještě nějaké úkoly, a mohl jsem ráj dostat aspoň na devátou úroveň, tak jsem si to rozmyslel, a žádné rozebírání se nekoná."}, {"31": "Na bete sa objavila táto animácia.. že by vyžadovala kŕmenie? [smilie--sprite1][BR][BR]Spoiler"}, {"66": "Takže budeme mít v elvenaru čínsky laděný event jako ve forge of empires?[smilie--sprite1]"}]