[{"3": "škoda, že na těch vyšších levelech už není tak roztomilý"}, {"28": "@Prealiena Proč spousta tvých příspěvků končí \"...jako ve forge of empires\"? "}, {"91": "Emhyr >> Mě se to teda nelíbí, na tohle se koukat v Elvenaru, no nevím."}, {"66": "@Thespia Prostě sleduji youtubery hrající forge a vždycky mi je nějaká novinka v elvenaru připomene.[BR]Teď mi to připomnělo tyhle:[BR][BR][BR]Kromě toho, od té doby, co se provalilo, že dlouho chystaná zbrusu nová herní mechanika je vlastně kopií guild expedition ve forge, tak už mi to připomíná úplně všechno."}, {"3": "všechno už bylo v Simpsnech "}, {"31": "@Prealiena až na to že táto udalosť nebude mať s čínskym motívom spoločné asi nič (teda až na tú pandu). "}, {"66": ""}, {"91": "A ještě k tomu dost pochybuji, že se panda živí bobulemi pro ptáky, takže to krmení pro ní nebude."}, {"31": "@Pauleo sme v magickom svete kde sa fénixovia živia rozmletými ocelovými a elixírovými relikviami, čo myslíš, aká je šanca že by podobná strava nebola požívateľná pre pandy? "}, {"91": "iDavis >> No já nevím jak u tebe, ale moje relikvie jsou jen odměnou na vyslání sběračů bobulí, které jsou vidět jak v pytli, tak u Felixe na misce. Tohle panda nechce. ;-)"}, {"28": "Medvědi jsou všežravci, tj. sežerou i bobule  Už když přišlo krmení do hry, vyjádřili se, že časem zvířátka přibudou, tedy krmení časem využijeme víc. Nemyslím si, že by změnili názor a přidali různá krmení, ostatně se to i jmenuje krmení a ne bobule  Tak snad nám pak krmení nebude chybět, když ho teď bude v řemeslné výrobě méně... Jinak medvědi budou tři - medvěd hnědý, medvěd lední a panda."}, {"91": "No to sice jo, ale přirozeně to není jejich hlavní strava, živí se zcela jiným. Stejně tak další medvědi, lední medvěd by to asi brzy vzdal. Tak já vím, že se mluvilo o dalším využití, proto se divím, že já tu mám jen ptačí bobule, ty samé, co má Felix na podnosu.[BR][BR]Medvědi proč ne, ale animace se mi teda přinejmenším nelíbí. Jako jo, práce je to dobrá, ale do Elvenaru se mi to nehodí."}, {"138": "Jako na testu mi v nabídce naskočil hořící Fénix, i když už ho mám postavený. To co bych ale uvítal, je aby se daly vyrábět i artefakty v knihovně.Zatím jsem nic neviděl."}, {"91": "Jo, to už se tu řešilo, asi chyba v podmínce. A artefakty se zatím do akademie asi neplánují, nejspíš půjdou nějaké získat jako odměny v nějakých akcích."}, {"20": "Panda je pěkná, líbí se mi. Jestli to budě inspirované Dračím bojovníkem (Kung Fu Panda) a nějak to např. pomůže v bojích - proč ne. Jestli postavím Pandu, tak určitě bude hlavně záležet na tom, co umí."}, {"72": "Měli byste doufat, že to bude případně \"žrát\" to samý, co fénix. Než aby přidali do craftingu novej sajrajt."}, {"91": "Chudinka. Tak nový sajrajt nepřidají, to si nemyslím."}, {"31": "Zajtra 17:30 na oficiálnej stránke Elvenaru na Facebooku živé vysielanie k veži večnosti.  S Rikou a Jonasom (čo je podľa mňa najlepšia dvojica, čo sa týka ich informačných videí)."}, {"31": "Poznámky zo živého vysielania 3.9.2019[BR][BR]Spoiler: Poznámky zo živého vysielaniaČo sú to tajemné truhly?[BR]Vo veži večnosti môžete získavať veľa odmien. Navyše, zakaždým čo vyriešite stret, sa môže niekde na aktuálnej mape objaviť tajemná truhla. Tá môže obsahovať ešte cennejšie odmeny. Truhla sa avšak môže objaviť v ktorejkoľvek časti mapy, teda aj za zamknutými bránami. V takomto prípade je nutné najprv odomknúť príslušnú bránu, aby bolo možné truhlu otvoriť.[BR][BR]Aké exkluzívne odmeny sa vo veži nachádzajú?[BR]Predovšetkým Sada měsíční knihovny, taktiež budovy s dočasným efektom (Trpasličí zbrojíž, Obchodní stanice, Džin). Súčasťou setu je taktiež aj budova Nekonečný svitek, ktorá poskytuje 1 obyvateľa (je to čarodejník stojaci na vrchole tejto budovy). Veža sa opakuje každý týždeň, takže budete mať veľa príležitostí získať tieto odmeny.[BR][BR]Momentálne hráme vo veži sami. Bude v budúcnosti pridaná aj funkcia pre viacerých hráčov?[BR]Rika: \"Momentálne mám tento projekt rozrobený na svojom stole a pripravujem prvé koncepty\". Samozrejme sa zaoberáme aj spätnou väzbou od hráčov, takže je to zatiaľ otvorená téma.[BR][BR]Plánujete pridať body do rebríčka ako odmeny vo veži?[BR]Rika: \"Už som dokonca čítala nápady na túto novinku na fóre, avšak zatiaľ neviem povedať, či by to bolo možné alebo nie, totižto každá možnosť získavania bodov do rebríčka môže ohroziť ich balans, takže je to asi skôr otázka pre herného dizajnéra\".[BR][BR]Prečo nie je možné otáčať budovy?[BR]Rika: \"Toto je asi vaša obľúbená otázka.  Dôvodom je vysoká technická náročnosť, všetky budovy sú totižto v súčasnosti navrhnuté v 2D režime, pri otočení by vlastne vznikol pohľad na prázdny objekt. Taktiež je dôležité spomenúť, že v hre sú už tisíce budov a táto zmena by znamenala upraviť každú jednu budovu, každej jednej úrovne, každej jednej rasy. Takže krátka odpoveď - technicky to nie je možné. Je mi to ľúto.\"[BR][BR]Poďakovanie za zmeny v grafike okolia mesta.[BR]Ďakujeme. Momentálne, po skončení udalosti Letní mořské panny, sme nasadili klasické pozadie. Všimli sme si otázku, aký účel má jaskyňa, ktorá sa nachádza v hornej časti mapy. \"Keď náš grafik pracoval na tomto pozadí, pracovali sme na veži. Vtedy sa vlastne ešte nevedelo, že z toho bude veža, ale možným scenárom bolo podzemie. Zrejme by mala jaskyňa takéto využitie, avšak momentálne v tom netreba hľadať nič iné, ako len zaujímavý prvok v pozadí.\"[BR][BR]Čo je jednoduchšie - diplomace alebo boj?[BR]Závisí to od stretu. V niektorých stretoch je veľmi náročné bojovať (napr. kvôli terénu alebo jednotkám), v iných je nákladná diplomace. Treba to teda posúdiť pre každý stret zvlášť. Vidíme ale, že hráči využívajú tieto funkcie v priemere 50 na 50.[BR][BR]Prečo sú náklady vo veži tak vysoké?[BR]Áno, sú vysoké, avšak dôvodom je to, že jeden stret vo veži je ekvivalentný jednej provincii v turnaji. Tá obsahuje 4 strety, preto musia byť náklady tohto stretu vo veži vyššie. Avšak odmeny za rovnakú náročnosť sú približne rovnaké. Rika: \"Ja radšej hrám vežu, keďže mi príde omnoho zaujímavejšia a tiež môžem používať logiku, pri riešení diplomacie, namiesto klasického klikania na Vyjednávať.\"[BR][BR]Spomenutie novej odmeny vo veži.[BR]Sme si istí, že chcete počuť o novinke, ktorú plánujeme začleniť medzi odmeny vo veži. Podobne, ako poskytujú turnaje plánky, aj veža bude mať svoju špecifickú odmenu, okrem už spomenutých nových budov. Bude to nové kúzlo, ktoré ocení isto väčšina hráčov a ktoré je žiadané snáď už od začiatku existencie tejto hry. S týmto kúzlom, budete môcť presunúť budovy z mesta naspäť do inventára. Kúzlo bude vzácne, ale nie natoľko, že sa vám ho nikdy nepodarí získať. Ale určite bude limitované. Tom: \"Stále mám kúzla z prvej letnej udalosti, takže pridanie ako odmenu nového kúzla namiesto už zavedených, bude isto dobré aj pre vyváženosť hry.\" Samozrejme to ešte bude vyžadovať nejaký čas na implementáciu, všetko to bude závisieť od výsledkov z testovania na bete.[BR][BR]Je nejaká logika v tom, aké suroviny duchovia vo veži vyžadujú?[BR]Nie, je to náhodné. Samozrejme podľa toho, čo sa duchom páči, ale problém je v tom, že sa im vždy páči niečo iné.[BR][BR]Je možné hrať vežu na iOS?[BR]Áno, vežu je možné hrať na ktorejkoľvek platforme.[BR][BR]Bude čoskoro zavedená nová kapitola?[BR]Tento rok, možno. Určite na tom pracujeme. Možno data mineri budú vedieť viac. (Ja: \" \")[BR][BR]Bude kúzlo na presun budov do inventára dostupné aj na mobile?[BR]Určite áno, všetky nové funkcie budú dostupné pre obidve platformy."}, {"154": "To kouzlo sice zní zajímavě, ale celkem si nedokážu představit, jeho využití, když bude tak málo dostupné, hodilo by se při přestavbě města, když bych potřeboval získat místo, ale na to ho plýtvat se mi zdá škoda, třeba někoho napadne lepší využití[BR]Já osobně bych tam místo nového kouzla přidal spíše plánek nebo několik královských rekonstrukcí, aby mě to více motivovalo (1. boss 10% šance na plánek, 2. boss 20% šance na plánek, 3. boss 30% šance na plánek) nebo před každou bránu dát 25% šanci na KR"}]