[{"16": "Tak kouzlo na vrácení do inventáře ať si tam klidně šoupnou - předpokládám, že až na konec.[BR]Naštěstí to kouzlo neupotřebím, takže můžu v klidu jet dále svým tempem prvního až druhého podlaží (dle času, nálady a surovin)."}, {"3": "kouzlo je dobré, když máš nějakou velkou starou kulturku si ji uklidit a následně rozkraftit [smilie--sprite8]"}, {"66": "Mnohem víc bych ocenila kouzlo na přidání rozšíření. Vlastně, když jsem sledovala záznam a oni zmínili nové kouzlo, tak jsem si vzpomněla na obrázek prémiového rozšíření, který tu před časem iDavis spoileroval se spekulací, že to dají jako odměnu při nákupu. Chvíli se mi z toho zatajil dech, ale pak řekli, že to umožní vrátit budovu do inventáře ...[smilie--sprite11]ach jo, tohle nepotřebuju."}, {"3": "na druhou stranu, pořád tu lidi brečí, jak je zbytečná akademie kouzel, ale že bez ní nejdou dělat eventy... tak k tomu bude taky možná tohle kouzlo [smilie--sprite8]"}, {"16": "A ještě jedna poznámka k Ričině srovnání nákladů věž vs. turnaj.[BR]Nějak zapomněla na to, že zatímco náklady na vyjednávání v turnajovém střetu jsou fixní, tak ve věži to neplatí.[BR]A při více surovinách (2. a 3. patro) a troše smůly při hádání (o nic jiného při 6+ surovinách nejde, samotná strategie při 3 pokusech prostě nestačí) se náklady snadno vyšplhají do násobků (už ve druhém patře se průměrný střet dělá 2x (i 3x))."}, {"172": "Emhyr var Emreis II napsal/a:\t\t\tkouzlo je dobré, když máš nějakou velkou starou kulturku si ji uklidit a následně rozkraftit [smilie--sprite8]Klikněte zde pro zvětšení...[BR]...ked hras vezu na 3.lv., tak s fragmentami uz mat problem nebudes. Ziskas ich viac ako dokazes minut..."}, {"31": "Kúzlo by mohlo byť veľmi efektívne v prípade súčasných rozvinuteľných budov, ako napríklad Stonehenge alebo Ráj morských panien. Veľa hráčov váha, či budovu postaviť alebo nie, pretože ak to už raz postavia, nikdy nebude možné urobiť krok späť. S týmto kúzlom avšak tento \"strach z nenavratnosti\" vymizne, čo bude mať celkom pozitívny dopad na vzťah hráčov k týmto budovám.[BR]Takže ja to vidím ako celkom dobrú vec, je otázne, do ktorej časti veže ho začlenia."}, {"158": "Ta lenost ohledně otáčení budov je vážně neuvěřitelná. Za prvé to stačí budovu jen za zrcadlit a za druhé není potřeba dělat všechny budovy, stačí jen ty, které nemají čtvercový půdorys. Kouzlo na schování budovy. Otázka zní jaké budovy půjdou schovat, jestli jen ty z eventu, tak je to již naprosto zbytečné kouzlo, které nemá odůvodnění, ale pokud půjde schovat libovolná budova (mimo klíčových), pak bych v tom nějaký potenciál viděl ( např. schovat si rozdělané budovy a pak je používat na eventové úkoly, typu vylepši budovu na level xy)"}, {"66": "Vidím to na poslední střet třetího patra, možná nějaké tajemné truhly, když budou hodní.[BR]Je otázka ohledně rozvinutelných budov, v jaké fázi se vrátí zpět do inventáře, aby se nestalo, že si člověk rozvine budovu na max a v inventáři se poté objeví v základní první fázi. To by bylo asi plýtvání artefakty, pokud by se nevrátili zpět mezi požehnání."}, {"172": "iDavis napsal/a:\t\t\tKúzlo by mohlo byť veľmi efektívne v prípade súčasných rozvinuteľných budov, ako napríklad Stonehenge alebo Ráj morských panien. Veľa hráčov váha, či budovu postaviť alebo nie, pretože ak to už raz postavia, nikdy nebude možné urobiť krok späť. S týmto kúzlom avšak tento \"strach z nenavratnosti\" vymizne, čo bude mať celkom pozitívny dopad na vzťah hráčov k týmto budovám.[BR]Takže ja to vidím ako celkom dobrú vec, je otázne, do ktorej časti veže ho začlenia.\t\tKlikněte zde pro zvětšení...[BR]...suhlasim, resp. mozno este burkovy alebo zlaty fenix. No pri mojom stasti, kde mam obe veze odohrate so vsetkymi poschodiami a ziskane len 2 budovy 1x1 zo setu, to kuzlo mat mozno nikdy nebudem [smilie--sprite1]"}, {"2": "Mě přijde podivné srovnání věže s turnajem hlavně pro to, že to co získám ve věži se s přínosem turnaje nedá srovnat."}, {"114": "abych pravdu řekla, zatím nevím jak bych to kouzlo na vrácení budovy do inventáře využila, že bych urgentně potřebovala přemístit nějakou budovu a neměla dostatek místa mi od dob jednoho úkolu a ds za druhým a kontinuálním udržováním místa na ně na víc nijak nehrozí, že bych stejně tak urgentně potřebovala rozkraftit nějakou velkou kulturku na zlaté svitky co si budovy na něco takového nastřádám z eventu či získám přímo zlaté svitky z Věže to mi asi taky nehrozí, jedině v jednom městě jsem postavila i modrého fénixe na rozvinutí 5, ale nezdá se mi při pouhých 3h aktivity na jedno krmení dost efektivní, toho bych si asi - než bych získala dalších 5 artefaktů na něj - do inventáře (pokud by na něm to rozvinutí zůstalo) šoupla [smilie--sprite1][BR][BR]jinak co se týká Věže, v jednom městě jsem jí prošla celou až do konce a měla jsem na měsíční budovy řekla bych že velké štěstí, i když určitě bych Věž asi neprošla, pokud bych na ní neměla našetřené suroviny na vyjednávání - to mi přijde na vyšších patrech na úspěšnost spíše jako velká loterie, než že bych vyhrála byť se sebevětší a lepší logikou - a ještě neměla i na výkup na další tahy diamanty (za cca 300 - 400) co mi zbyly ze studní přání..., ale boj u mého města byla katastrofa, snad jen za tři souboje na automat jsem přišla skoro o celou armádu, asi mám vojenské divy proklatě vysoko, jestli je pravda, že čím jsou divy na vyšších levelech, tím je souboj obtížnější či více ztrátový,  což by nasvědčovalo i to, že spoluhráč co má divy na málo, byl v soubojích avšak na manuál úspěšný..., co však zmůže malé město co dosáhne tak k prvnímu portálu? ..řekla bych že zvládne celkem dost, v některých z měst se mi ve Věži po dosažení prvních truhliček a otevření portálu vyskytla i bonusová truhla kde jsem v jednom městě např. získala Džina [smilie--sprite11][smilie--sprite1] I přes to že bych ve Věži přivítala i odměnu např. Královské rekonstrukce, než jen \"vracečku do inventáře\", tak ceny v ní jsou pro mě uspokojivé a Měsíční set úplně super, co bych přivítala asi když už bych měla za odměnu že si lámu ve výkupu hlavu dosáhnout cíle na všech patrech, tak by se mi líbila místo \"loterie\" hra čistě jen postavená na logice tak aby se zužitkovala spravedlivě [smilie--sprite8][BR][BR]..a jen tak na okraj, děkuji za z eventu hodinové časovače, za mě největší terno když můžu za ně cvičit vojáky bez ztráty jediné minuty [smilie--sprite11][smilie--sprite11][smilie--sprite11][smilie--sprite1] ..a ještě někde v odměnách budou??? [smilie--sprite8][smilie--sprite8][smilie--sprite8]"}, {"154": "možná mě ted napadá jedna situace a to třeba u divů, když ho mám vylepšený na nějaký vyšší level a momentálně by mi přišel špatný, tak to by mohlo být dobrý, aspoň bych nemusel do něj znova cpát VB a třeba někdy bych ho zase znova mohl postavit [smilie--sprite1]"}, {"114": "@mohyla98 , dobrý postřeh! [smilie--sprite1] taky bych ho tak využila a to konkrétně na Knihovnu, kde jí mám do 10 lvl a už jí co do hodnot které dává vůbec na to jak je velká nepotřebuji a sypat do ní se mi teď nevyplatí když jsem získala pro město divy daleko důležitější do kterých teď sypu přednostně [smilie--sprite1]"}, {"11": "tak to kouzlo, pokud bude, se podle mně určitě nebude vztahovat na divy ani manu či dílny. Spíš půjde jen o budovy co z inventáře pochází a budou se např. dát rozcraftit.[BR]Protože i v rozhovoru se píše \"S týmto kúzlom, budete môcť presunúť budovy z mesta naspäť do inventára\""}, {"28": "Taky si myslím, že to bude jen na budovy, které šly do města z inventáře. Nevím, takovou dobu jsem se bez toho obešla a nijak mě to nechybělo. Za mě celkem zbytečně kouzlo a pokud tam strčí jen jedno a ještě do posledního střetu, tak je ještě více zbytečné."}, {"158": "Toto kouzlo by bylo fajn, tak před dvěma roky a jen pro sběratele, kteří nechtěli vyhodit unikátní budovu, i když byla stará a s marnými statistikami. Po (konečně) zavedení královské rekonstrukce a závalu událostí je možnost pohodlně měnit/ vylepšovat eventové budovy jak na běžícím páse, takže je plánované kouzlo naprosto neaktuální a zbytečné. [BR][BR]Jediná potencionální výhoda, by bylo třeba schovat věci co normálně v inventáři nejsou, například již zmiňované Divy, které prostě nesplnily očekávání (např Enarovo velvyslanectví)."}, {"31": "Je ale zaujímavé, že aj divy majú priradené odmeny v podobe úlomkov za rozčarovanie. Buď to pridelili automaticky všetkým budovám, alebo sa počíta s možnosťou vrátením aj divov do inventára, i keď tomu sa mi stále nechce veriť.[BR][BR]Mimochodom, ďalšie kolo dobrodružstiev je v tejto chvíli naplánované na pondelok 9.9."}, {"99": "Přesně jak píše @iDavis . Mám v inventáři Ráj mořských panen a kvůli VB bych ho i ráda postavila, ale ne za cenu, že se mi pak do města nevejde nová rasa. Pokud by bylo možné po dobu osadníků vrátit budovu do inventáře v plném rozvinutí, už by dávno stála ve městě [smilie--sprite1]"}, {"66": "@Fjorgyn Taky si myslím. Pamatuji, jak se to tady řešilo, že se někomu nechce prodat eventovku, když ji nemůže vylepšit a tenkrát ani nikdo nevěděl, jestli ji ještě někdy uvidí. V popisu událostí bylo, že budovy jsou unikátní. Horko těžko jsem se loučila s Eldrasilskými posvátnými síněmi z druhé kapitoly.[BR]Teď si říkám, dobře nám tak.[smilie--sprite8] Dlouho zapomenuté návrhy se zapracovávají a ty aktuálně užitečné věci buď nebudou nikdy, nebo už budou zase zastaralé, až se zavedou."}]