[{"31": "Z oficiálnej stránky na instagrame, upútavka k jesennej udalosti.. [BR][BR]Spoiler: Zodiac[IMG]https://i.ibb.co/HPXjXFb/https-i-ibb-co-0t-P5-LS7-Webp-net-resizeimage-jpg.jpg[/IMG][BR]Mimochodom, zajtra doobeda by sa mala začať na bete, takže okolo obeda sem pridám, už pripravené, prehľady udalosti."}, {"31": "Na bete sa začala jesenná udalosť.. [BR]Podzimní událost[BR][BR]Spoiler: Podzimní událost[IMG]https://i.ibb.co/X7cZ64J/https-beta-forum-elvenar-com-index-php-attachments-forumann-zodiac-png-6291.png[/IMG][BR]Predpokladaný termín: čoskoro[BR]Témou tohtoročnej jesennej udalosti budú zverokruhy a rôzne súhvezdia v hlavnom okne akcie, ktoré budú predstavovať obvyklú reťaz akčnej meny k hlavným cenám. Toto je ukážka veveričky:[BR][BR][IMG]https://i.ibb.co/CJvfMYF/https-i-ibb-co-VMM5-Tc-V-EL-akcia-jese-2019-s-hvezdie-veveri-ka-png.png[/IMG][BR]Existujú ďalšie tri súhvezdia, ktoré sa budú striedať. Každé obsahuje 20 hviezd (potrebných k získaniu ďalšej hlavnej ceny).[BR][BR][IMG]https://i.ibb.co/44yJ9sm/https-media-innogames-com-com-ONYX-ZZ-announcements-autumn2019-Evflow-Bear2-png.png[/IMG][BR]K dispozícii bude opäť nekonečné množstvo úloh, pričom niektoré budú mať mierne zmenené podmienky (bližšie informácie pridám neskôr).[BR][BR]Kompletný prehľad udalosti nájdete už teraz v téme Události a úkolové linie - Podzimní událost a prehľad nových zvierat v Speciální budovy - Medvede."}, {"16": "Hm, tak tohle pos... ehm, neví někdo jak to říci slušně? Totálně zkazili s těmi podmímkami na úroveň manufaktur / dílen.[BR]Upřímně řečeno, mít tu pravomoc, tak ten, co tohle vymyslel je okamžitě bez práce."}, {"160": "Tak to je zas vtipný event toto    Medvedi jsou OK   Ale úkoly k tomu.. Jako kdyby nestačilo,že to tedka hrotí a hážou jednu událost, dobrodružství, výzvy, veže za druhým, ješte nám to takhle spestrujou   "}, {"16": "@Slniecko A teď si představ jaký faul je to proti hráčům na konci. Dělat 24h výroby v hlavních dílnách, kterých máme málo a na přistavění dalších není čas ani populace.[BR]To je prostě ... já jdu radši offline, než s tou hrou praštím."}, {"2": "Kde jsou ty úkoly?[BR]kolik si toho vymysleli?"}, {"31": "Prvé úlohy, ktoré vychádzajú z mojich skúseností na bete sú už spísané v prehľade. Úlohy budem naďalej dopĺňať, avšak jedná sa opäť o náhodný systém úloh, takže treba počítať s rozdielmi."}, {"154": "Zatím jsem se teda vždycky dokopal k 10. levelu, sice to bylo pár dní před konce, ale to je celkem jedno, teď už si tím tak jistý nejsem, mám jenom 6 dílen, takže to pujde celkem pomalu, ale přitom jsem ted konečně našel hlavní odměnu, která by byla dobrá a to konkrétně ten hnědý medvěd s těm jednotkama, ten by se mi líbil, tak uvidíme, jak moc to bude náročné "}, {"31": "Povedal by som, že ak sa bavíme o výkone, ktorý sme dosahovali v udalostiach s obmedzeným počtom úloh, problém to nebude. Problém je avšak v tom, že z minulej udalosti sme zvyknutí na trochu iné pomery, ktoré teraz už dosiahnuť nebude možné."}, {"11": "já tam v seznamu nikde úkol na 24hod výrobu v dílnách kapitoly nevidím, nebo není doplněnej?"}, {"173": "Zdravím, můžu se zeptat co přesně s skrývá pod pojmem \"aktuální kapitola\"? Protože má aktuální kapitola jsou čarodějové s tím, že jsem se chtěla dostat do pulčíků než začne event. Jenže manufakturu na ocel mám ještě v elfech a další upgrade bude až v elementálech. Takže v době eventu má aktuální kapitola = pulčíci ale manufaktury v elfech (2 kapitoly zpět). To by pak hráči kteří jsou v pulčících neměli možnost splnit úkol.[BR]Nebo je aktuální kapitolou myšlena nejvyšší možná kapitola ve které daná manufaktura může být?"}, {"11": "vycházej z poslední věty "}, {"94": "Koukam, ze uz se pocita s dalsi kapitolou. Jinak nevím jak vas, ale mne ti medvedi docela zklamali. Nevim jestli nejaky z nich vubec stoji za postaveni "}, {"174": "Spíš to dle popisu vypadá, že už si nepomůžeš s manufakturami a dílnami na 1 levelu jak bylo zvykem [BR][BR]Např: [BR]Vyrob 3x produkt základnej bonusovej manufaktury (3-hodinový) v manufakture aktuálnej alebo predchádzajúcej kapitoly[BR]Vyrob 9x nápoje v dielni aktuálnej alebo predchádzajúcej kapitoly"}, {"175": "Ok ,mam tri ocelarny na max pac se setama a jinejma budovama vic jak tri nepotrebuju. Super kdo to vymyslel jen tak dal. Kdo ma zivouci zbozi vetsinou umazaval produkci zakladniho a oni vymysli takovou hov... Mely nechat pevne stanoveny pocet ukolu a ne neomezene a co nejvic to zneprijemnit aby se nahodou tech ukolu neudelalo moc. Na hlavu postavene."}, {"31": "@Modyara potrebné sú vylepšenia aktuálnej a tiež predchádzajúcej kapitoly. V oboch prípadoch sa avšak jedná o tie kapitoly, v ktorých dostala daná budova vylepšenie. Príklad: základné manufaktury dostávajú vylepšenia v trpaslíkoch, lesných elfoch a elementáloch. Ak je hráč napríklad v amuni, za aktuálnu kapitolu sa považuju elementáli (to je posledná kapitola kedy dostali vylepšenie) a za predposlednú lesní elfovia (to je predposledná). Levely týchto dvoch kapitol pre manufakturu sú akceptované v úlohe (v prípade tohto príkladu levely 20-27)."}, {"94": "petr.wp99 napsal/a:\t\t\tSpíš to dle popisu vypadá, že už si nepomůžeš s manufakturami a dílnami na 1 levelu jak bylo zvykem Klikněte zde pro zvětšení...Jo hromada lidi tu plakala, ze pro ty co maji manufaktury 2x2 je to nespravedlive, tak to vyresili takle, na vyssich levelech uz ty velikosti hodne podobne...[BR]Zase jedna se pouze o trihodinove vyroby, takze pokud nepujdou hned zasebou zas takova brzda by to byt nemela, ty tri kousky snad vetsina bude mit.[BR]No a ja je vlastne nemam na pozadovane urovni "}, {"11": "richardll zrychlení produkce vojska o 50% já naopak beru jako dobrý bonus a zkrácení času mezi kolama v turnaji pro ty co nemají ještě časový skok taky není tak nejhorší."}, {"174": "richardll napsal/a:\t\t\tJo hromada lidi tu plakala, ze pro ty co maji manufaktury 2x2 je to nespravedlive, tak to vyresili takle, na vyssich levelech uz ty velikosti hodne podobne...[BR]Zase jedna se pouze o trihodinove vyroby, takze pokud nepujdou hned zasebou zas takova brzda by to byt nemela, ty tri kousky snad vetsina bude mit.[BR]No a ja je vlastne nemam na pozadovane urovni Klikněte zde pro zvětšení...Mno vypadá to na první sadu, v následujících mohou být samozřejmě delší výroby "}, {"94": "voyager-1 napsal/a:richardll zrychlení produkce vojska o 50% já naopak beru jako dobrý bonus a zkrácení času mezi kolama v turnaji pro ty co nemají ještě časový skok taky není tak nejhorší.\t\tKlikněte zde pro zvětšení...Zrychleni o 50% se nekona, akorat dostanes o 50% vice jednotek, coz odpovida zrychleni o 33%.[BR]Coz o to to by nebylo spatne, kdyby nebyla doba trvani jen 12 hodin, to nestihnes vyrabet krmeni, aby se to nejak vice projevilo...[BR][BR]petr.wp99 napsal/a:\t\t\tMno vypadá to na první sadu, v následujících mohou být samozřejmě delší výroby Klikněte zde pro zvětšení...Vic jak 9 hodin dat nemohou, max mohou navysit pocet...[BR]Ale i to by stacilo k nas..tvani.[BR][BR]Příspěvky sloučeny. Embla"}]