[{"11": "tak dostanu o polovinu vojska navíc, to je důležitý, to krmení se uvidí, nonstop to asi nepůjde, navíc medvědi mají jen 9.polí na rozdíl 16ti u předchozích budov."}, {"94": "Coz treba u mne znamena max 6 oddilu (z kasaren, z tabora, nebo cviciste to bude mene), ale pravda, ze zatim nemam divy jeste moc namakane...[BR]Jinak pocitam s tim, ze necham vyrobit jednotky a tesne pred dojetim fronty 5 policek dam krmeni a budou se nasobit i jednotky vyrobene predtim, ale jeste nevyzvednute..."}, {"66": "Tedy doufám, že designéři mají dost soudnosti, že nepřidají úkoly na 24h produkci manufaktur nebo dílen. A také, že to nebude v řádu desítek podukcí. Teď, když si nemůžeme přistavět 1 lvl budovy, tak už toho nemůžou chtít tolik.[BR]\t\t\tJo hromada lidi tu plakala, ze pro ty co maji manufaktury 2x2 je to nespravedlive, tak to vyresili takle, na vyssich levelech uz ty velikosti hodne podobne...\t\tKlikněte zde pro zvětšení...hezky řečeno, @richardll, dobře nám tak. Teď aby se člověk bál si na něco rýpnout. Designéři mají očividně bohatou fantazii a umí jakýkoli dobrý nápad překroutit na něco, co nikdo nechtěl."}, {"16": "24h produkce dílen tam je. Teď jsem dostal 3x24h v dílnách (grr).[BR]Ano, nejprve s velkou slávou zavedou systém nekonečných úkolů a pak je ztíží tak, že vlastně nahrajeme méně, než s pevným počtem. Tomu se říká klamavá reklama.[BR]A pak si zase budou stěžovat, že s novou kapitolou nemusí spěchat, když na konci výzkumu je jen 5% měst.[BR]No bodejť by nebylo, s tím, kolik klacků hážou pod nohy pokročilým hráčům, to po čase většinu z nich přestane bavit a se hrou praští."}, {"72": "Jako většina noviněk, má to házet klacky pod nohy ne všem, ale těm aktivním, který je třeba zpomalit do ideálního stádního průměru. Masy se to nedotkne.[BR]btw., proč je jako artefakt prasečí hlava? xD"}, {"3": "richardll napsal/a:\t\t\tZrychleni o 50% se nekona, akorat dostanes o 50% vice jednotek, coz odpovida zrychleni o 33%.[BR]Coz o to to by nebylo spatne, kdyby nebyla doba trvani jen 12 hodin, to nestihnes vyrabet krmeni, aby se to nejak vice projevilo...\t\tKlikněte zde pro zvětšení...a k tomu jsou přece urychlovače. Akorát těch nástrojů, co při tom padne...[BR]otázka je, jestli když nakrmíš 2 medvědy (a neříkejte mi, že nikdo dva mít nebude), jestli dostaneš o 100 % jednotek víc nebo jak to bude fungovat "}, {"158": "@Emhyr var Emreis II Funguje to jako Simia Sapiens, kdo mají tento div ví. Funguje to úplně prostě: Žádné náklady navíc, žádný čas navíc, je to jen bonus jednotek při sběru. (jako například bonusové relikvie zvedá produkované suroviny za stejný čas)"}, {"3": "rozumím, takže místo 100 paladinů vyzvednu 150, se dvěma medvědy 200 atd., je tak?"}, {"158": "@Emhyr var Emreis II - Přesně tak chápeš to naprosto správně . [BR][BR]Jelikož zatím lze vybírat z konkrétní výrobní budovy jen jednotky, které se zde vyrábějí, tak díky tomu je možnost, je nevybírat a začít vyrábět jednotky v jiném \"cvičišti\" jakmile průběžně uvolňují frontu. Takže lze nakonec vybrat fakticky 15 vyrobených oddílů najednou a tak maximalizovat nakrmení médi bédi. [BR][BR]Každopádně, já určitě budu chtít Hnědého medvěda, při kombinaci se Simiou Sapiens to produkuje hodně hodně moc jednotek (nedejbože, že má někdo hodně urychlovačů z událostí) a ty prostě vydělají na ty relikvie a úlomky kouzel ve věži věčného utrpení. Jediné omezující ja ta zredukovaná šance na žrádlo ve výrobě, ale tak snad, když zmizel ten výrobní odpad, třeba to nepůjde poznat."}, {"20": "Určitě hnědák je fajn. Oceňuji, že je 3x3. Pro hráče, kteří nemají divy konstruktů mohou být přínos i zbývající dva. [BR][BR]Jsem na ty úkoly zvědavá. Na jednu stranu je to pomoc pro hráče, kteří nemají místo, aby postavili hafo budov 1 lv., ale jinak, si nejsem jistá, uvidím, jak to nakonec bude vypadat. Třeba to nakonec bude pozitivní. Zatím jsem optimista, na nadávání je ještě času dost  No, a taky nejsem na betě.[BR][BR]Je vidět, že se v Inno zamýšlejí nad způsobem zadávání eventových úkolů a to je pozitivní. Hra se vyvíjí a zůstávat u stále stejných zadání není možné. Názory z CZ jsou určitě jen kapka v moři, možná, že celosvětově převažují jiná přání na hru, než u nás. [BR][BR]Otestujeme to a uvidíme. V nejhorším nezískáme takové mega dávky věcí jako dřív."}, {"16": "@Ludi Ona to není ani tak pomoc pro ty, co nemají místo, jako spíše penalizace těch, co to místo mají. A hlavně penalizace pokročilých měst s nízkým počtem dílen/manufaktur.[BR]Oni v Innu se zamýšlejí, ale spíš vezmou návrhy hráčů a překroutí je k obrazu svému."}, {"5": "...á studny jako denní odměna hned jako první den, rovněž mnohé nepotěší, ale bývá tam povětšinou 2x[BR][BR]..ti co mají místo mohou aktuálně přistavět, ovšem často se naráží na strop = počet lidí, takže bude třeba postavit k tomu i nějaké obytky.[BR][BR]Příspěvky sloučeny. Embla"}, {"31": "Aktualizoval som zoznam úloh v prehľade. Obsahuje už zadelenie jednotlivých úloh do segmentov a tiež informácie o tom, ako funguje tentokrát náhodné vyberanie úloh."}, {"5": "Tak naše ,,skromnější,, účast v DS najednou dostává jiný rozměr  ...se v klidu někteří mohou připravit na tento nadcházející náročný event...a stavět a stavět a stavět "}, {"11": "má někdo spočítáno kolik času zabere postavit dílnu na předposlední lvl?"}, {"31": "@voyager-1 zhruba 16 dní na level 30 (ktorý stačí pre hráčov v konstruktoch)."}, {"20": "@Lovec Krys  Máš pravdu, jako téměř vždy . Teď jsem koukla na úkoly - no, nic kvůli tomu stavět nebudu. Pojedu pomalu a snad to nějak dopadne. Lidí mám hafo, ale přijde nová rasa a všechno pak budu bourat? To se mi nechce.[BR]Každopádně úkol \"prozkoumej provincii nebo vyzkoumej jednu technologii\" - pro lidi na konci konstruktů fakt neskutečný "}, {"11": "na druhou stranu,mám ještě urychlovače z minule na zhruba 2k hodin,tak se dá něco urychlit."}, {"132": "Ahoj. iDavis, dík za informace a jedna prosba, jak lze skopírovat  úkoly k podzimnímu eventu? Děkuju"}, {"31": "@betulka1 textovú verziu pridám až bude samotný zoznam úloh kompletne pripravený, nakoľko súčasná verzia ešte nie je finálna. Tú môžeš ale zdieľať skopírovaním adresy návodu."}]