[{"2": "Ty úkoly jsou drsný.[BR]Na bete mám dvě dílny, na cz tri jsem zvědav co s tím nahraju"}, {"16": "@GorGlin No máš následující možnosti:[BR]1) úkoly na 24h dílny budeš dělat 2 a více dnů[BR]2) Na každý takový úkol vyplýtváš stovky hodin urychlovačů[BR]3) Pokusíš se přistavět dílny na event (jestli to stihneš - bez urychlovačů asi ne)[BR]4) Na event se vykašleš[BR]5) Někdo zodpovědný dostane rozum a vyslyší naše návrhy a buď alespoň u některých dlouhých výrob zruší požadavek na věk u dílen nebo dá alespoň rozumnou alternativu (ha ha, ale naděje umírá poslední)"}, {"3": "alternativou je přikoupit za dia kouzelnou dílnu..."}, {"72": "Každopádně se to netýká jen dílen.[BR]"}, {"20": "V posledním eventu jsme mohli získat Ráj i několikrát, takže se Inno poučilo, že tak jednoduše nám to už nedá  ... [BR]Očekávám toto:[BR]1. Dostaneme  Méďu na 5 lv. a pak budeme s nadšením hrát všechny DS a podobné věci, abychom Médu dostali alespoň na 7 lv ... [BR]2. Získáme tak 5 studen a budeme ještě rádi, protože dostatek bodů na klikačku nevyděláme [BR]3. Na ostatní věci radši moc klikat nebudeme, protože chudoba je prostě chudoba [BR]4. Ob den nám budou vyskakovat různé nabídky na usnadnění eventu za dia [BR][BR]Už nám na tu srandu zůstane jenom Věž "}, {"11": "Moc to prožíváte a rádi brbláte.[BR]U Ráje jsem udělal 24 artefaktů a tady těch 7-9 udělám taky."}, {"16": "@voyager-1 Pokud máš tisíce hodin v urychlovačích, tak možná... Jak napsal Karvest na betě, dostal 3/10 úkolů průzkum provincie. Sám si můžeš spočítat, jak dlouho ti ty urychlovače vydrží, než ti dojdou.[BR][BR]Pro místní Elvenar tým: Pokud centrála nedostane rozum a neupraví úkoly, aby nebyly tak anti-hráčské, připravte se na další x-stránkové téma plné naštvaných reakcí (viz. beta forum)."}, {"11": "ty provincie budou problém,to je fakt."}, {"5": "Beru to tak, že kvalitní odměna je nastavena hodně vysoko, všichni předpokládám dostanou automaticky level 1 budov medvědů ,,zadarmo,, pokud půjde získat řekněme aspon 6-7 artefaktů v eventu a další v následujících hrách at´ výzva, DS či vyrobit v akademii, tak to zas tak vysoko není a chápu, že chce mít v zoo medvěda hnědého každý, protože je to parametry skvělá budova. Tak když jsou tam prd odměny remcáme...když je to příliš jednoduché a zisků tolik, že to většina stejně rozcraftí remcáme...nyní to vypadá těžké, ale ne nereálné a pokud půjde dát méd´a na 10level během následujících akcí či vyrobit v akademii, jak již bylo předesláno...tak je to myslím v pohodě  a uvidíme jak se s tím popereme ...přeji hezký den a rychlé stavitele "}, {"3": "taky bych nepanikařil. Vždyť i ta věž mě nakonec baví (no, třetí level už ne  )"}, {"20": "@Emhyr var Emreis II - tvoje situace je jiná, protože nejsi na konci výzkumu. Úkoly jako \"dokonči výzkum technologie\" nebo \"prozkoumej provincii\" jsou pro tebe dosažitelné. Pro hráče na konci výzkumu už ne. Takže pokud mi něco takového padne, tak je to stopka. Podobné úkoly tam jsou a nevidím alternativní plnění. Průzkum provincie mám už víc než 70 hodin a jsou tu borci s daleko delší dobou. Tak uvidíme, jak to nakonec dopadne. Snad to bude trochu respektovat v jaké jsme kapitole.[BR]Jinak výroba v manufakturách a dílnách vyššího lv. mi až tak nevadí. Myslím, že dílny i manufaktury mi budou stačit. A přistavovat nic nechci. Bude to pomalejší, zisk bodů bude menší, takže celkem nuda. Pořád jenom čekat. [BR]Věž dělám max 2 patra - systémem, aby se vlk nažral a koza zůstala celá  Sem tam něco slušného padne, ale jen zřídka."}, {"3": "to máš pravdu. Na druhou stranu hráči na konci výzkumu mají vesměs optimalizovaná města, často už i prostor na event (teď už ne taková výhoda). Jdou po jiných odměnách, můžou se soustředit na ty hlavní atd. Myslím, že se nedá jen tak jednoznačně říct, že je někdo při těchhle akcích ve výhodě. Nebo ano, ale pokaždé se jedná o někoho jiného. Jednou je akce lepší pro větší hráče, jindy třeba pro ty menší, což je ve finále možná i správně. Buďme solidární "}, {"20": "@Emhyr var Emreis II  Místo na event má spousta hráčů. Jde o to, že některé úkoly jsou pro nás nesplnitelné."}, {"3": "chápu, ale stejně tak jsou těžko splnitelné jiné úkoly pro menší hráče"}, {"20": "@Emhyr var Emreis II Je rozdíl \"těžko splnitelné\" - to je totiž ještě splnitelné a nesplnitelné[BR][BR]// Odstraněna citace. Jumala"}, {"3": "chytáš mě za slovo. V tom případě jsou úkoly pro malé hráče taky nesplnitelné. Jinak by jich tu muselo být dost, kteří mají z eventů několik hlavních odměn. Realita je ale taková, že málokdy dosáhnou (třeba kolem IV. kapitoly) výš, než třeba na 4. level.[BR][BR]Nemusí být přece každá událost jen o tom, že si nahrabeme tolik, že většinu vlastně ani nepotřebujeme. Upřímně, z mořských pan toho mám tolik, co jsem myslel, že se bude hodit, že to nakonec asi hodím do craftu. Naprostá inflace hodnoty budov"}, {"20": "@Emhyr var Emreis II   No zrovna s tím mám čerstvou zkušenost. Nedávno jsem začala hrát na CZ1 a Ráj mořských panen jsem hrála ve 4. kapitole. Samozřejmě, že střety v provinciích jsou tam těžké a některé úkoly velmi náročné, ale nakonec jsem Ráj na 10 lv. dostala. A to jsem tam měla malý prostor na event a manufaktury na ocel. Takže přesně vím, o čem mluvím."}, {"3": "tak to jo  neříkám, že to nejde, ale že je to těžké. Hlavně většina těch hráčů ještě v té době ani pořádně neví, co má dělat. No, ať tak či tak, osobně mi tak kritika připadá trochu přehnaná. Ale uvidíme. Sám jsem zvědavý, jak dopadnu, ale toho hnědkobéra prostě chci "}, {"16": "@Emhyr var Emreis II Jo, místo by bylo, ale není čas ani popka pro přistavění kupy dílen na lv 30, což je minimum na výrobu na dílny (pokud vývojáři nedostanou rozum a nezruší podmínku na věk při úkolech alespoň na 24h). Takže příprava nula nula nic."}, {"176": "Zdá se mi, že si Inno nějak nerozumí. Nejdřív přidají Ráj panen s produkcí T1 zboží. A ti kteří si jím nahradili T1 manufakturu(y) teď budou o dalším eventu za blbce, protože jim ty manufatury budou chybět"}]