[{"40": "Možná je to záměr, furt ve střehu![BR]Udržovat - napětí = sladký pocit z Vítězství.[BR]Přece nám nerupne cévka.[BR]Je to relax, ... Alespoň pro mne."}, {"20": "Záměr je jediný: donutit hráče, aby kupovali dia [smilie--sprite2] [BR]Já tvůrce hry chápu, ale když se na hráče bude moc tlačit, tak odejdou. [BR]A pak je tu ještě jedna možnost, jak nedávno napsal v našem cechu na CZ1 jeden hráč: \"budeme sem chodit a vyprávět si vtipy, protože to k hraní nebude.\""}, {"43": "naprostá šaškárna s těma dílnama.To byla jediná věc,co mě u eventu držela,ta hratelnost a zábava při plnění úkolů.No a co,že jsme je plnili na x dílnách první úrovně.Tohle je opravdu ubohost a eventy přestávám hrát a jestli to takhle půjde dál,že nás budou tvůrci někam stupidně tlačit,tak kašlu na celou hru!"}, {"94": "Emhyr var Emreis II napsal/a:\t\t\tchytáš mě za slovo. V tom případě jsou úkoly pro malé hráče taky nesplnitelné. Jinak by jich tu muselo být dost, kteří mají z eventů několik hlavních odměn. Realita je ale taková, že málokdy dosáhnou (třeba kolem IV. kapitoly) výš, než třeba na 4. level.[BR][BR]Nemusí být přece každá událost jen o tom, že si nahrabeme tolik, že většinu vlastně ani nepotřebujeme. Upřímně, z mořských pan toho mám tolik, co jsem myslel, že se bude hodit, že to nakonec asi hodím do craftu. Naprostá inflace hodnoty budov\t\tKlikněte zde pro zvětšení...[BR]No ja nevim, ja s tim problemy nemel, snad vzdy jsem dokazal splnit vsechny ukoly. Ono to taky bude o tom, ze spousta z tech hracu kolem IV kapitoly nbude moc aktivnich, zatimco vy vyssich kapitolach uz tech neaktivnich bude o cim dal tim mene..."}, {"137": "Na takový event. budu víceméně kašlat, nejsem cvičená opička...[BR]Rozhodně nehodlám stavět další budovy až do éry konstruktů abych splnila úkoly ( urychlila jejich splnění)."}, {"177": "Technologie žádná,průzkum 100 hodin,event pase."}, {"72": "Na betě přidali nový kouzlo, které dokáže vrátit budovu do inventáře. To je dobrá zpráva. Horší zpráva, vypadá to, že půjde získat jen ve věži."}, {"3": "@athlan no a jak teda to kouzlo funguje? Resp. které budovy jdou vracet a zůstane jim případně jejich úroveň? [smilie--sprite1][BR][BR]// Odstraněna citace. Jumala"}, {"91": "No o tom dost pochybuji, že by nějaké kouzlo rozložilo budovu zpět na budovu a artefakty."}, {"11": "tak koukám,že včerejší nadšení z příštího Eventu dneska trochu utichlo a vrací se to do svých kolejí. [smilie--sprite1]"}, {"16": "Tak ale co by si všichni stěžovali, vždyť teď už nemusí přistavovat Amuni dílny, teď už stačí jen dílny půlčíků. No a úkol na průzkum provincie bez alternativy dostal alternativu výzkumu technologie, což jistě všichni na konci výzkumu náležitě ocení."}, {"20": "Trochu se mi zdá, že pro hráče na konci výzkumu není chtěno, aby k divům konstruktů měli ještě Méďu ... [smilie--sprite5] A za tohle dia dávat opravdu nebudu.[BR]Jen mě mrzí, že asi nedoplním počet studen. Zdaleka nejde jen o dia, ale dávají spoustu VB i dalších dobrých věcí.[BR]Však kdo máte studnový háj to dobře znáte [smilie--sprite2]"}, {"88": "Z beta serveru přicházejí nehezké zprávy. Trochu OT: mám obavu, že se Inno vydává cestou hry UR, kterou neustálé změny všeho možného (hlavně toho, co fungovalo) poslaly tzv. \"do kytek\"... Za poslední asi dva roky už snad třetí společnost, co je pod ní podepsaná. Na začátku změn měli i počet hráčů online, který se v jakoukoliv denní dobu pohyboval kolem 15K. V půlce změn už měli sotva tři tisíce. A taky se začínalo tím, že se snižovaly odměny a navyšoval se počet věcí za reálné peníze. Hráči na to moc neslyšeli a ubývalo jich a ubývalo, teď už hráče online už ani nezveřejňují..."}, {"20": "To je právě ta věc: pokud odejdou hráči, kteří nic nekupují, nebo jen občas něco málo, tak postupně odejdou i mnozí diamantový hráči, protože herní prostředí se natolik změní, že to přestane být zábava."}, {"160": "Budovy které lze vracet do inventáre jsou všechny, krome tech které jsou nastálo a nejdou smazat - Akademie kouzel, hlavní sídlo,delník,atd. pak nejdou vrátit do inventáre ani prastaré divy a nejdou vrátit ani budovy, které jsou rozvinutelné - Fénix, Stonehenge,atd... Jinak event me teda moc nenatchl.. Jsem z toho sklamaná a taky se mi zdá, že čím víc toho pridávají, tím tu hru jenom víc kazí.. Kdyby chteli radeji hráče motivovat nejakými porádnymi odmenami, treba i v tom blbém dobrodružství.."}, {"160": "Joo a když dáte do inventáre budovu, která vám dáva obyvatele a kultúru,tak samozrejme pak o ty obyvatele a kultúru zase prijdete [smilie--sprite1] A pak vám to vráti, jak to opet postavíte.."}, {"5": "Nové kouzlo - vidím v tom devizy, že při nové rase některé budovy ,,uklidíme,, do inventáře, splní se výzkum a opětovně budovy vrátíme zpět...v eventech se dá využít ke stavbě budov na uklizené místo přijdou úkoly typu budova na xx level a pokud tedy hráč dá do inventáře např. velkou manufakturu, teoreticky by mělo tedy i fungovat ++ lidi a kultura navíc za tuto manufakturu a opětovně splnit něco z eventu a po skončení budovu,y vrátit?!...[smilie--sprite1][BR]+ i na místo při DS"}, {"160": "Pekný postreh, uvidíme co s tím vyvojari všechno mají v plánu [smilie--sprite8] [smilie--sprite8] [smilie--sprite8]"}, {"16": "@ElfNostradamus Za předpokladu, že takové úkoly přijdou, v současném eventu jsem na ně nenarazil.[BR]Spíš to vypadá, že to máme na schování těch x dílen lv y na dobu mimo eventy."}, {"5": "Nové kouzlo Teleport: https://beta.forum.elvenar.com/inde...cenes-the-spire-of-eternity.12989/#post-77911"}]