[{"91": "To se mi nezdá, že by to kouzlo dávalo nějakou výhodu v plnění úkolů. Když je úkol podmíněn úrovní, tak se taky započítá jen první vylepšení nad onu úroveň. Takže když jí teleportuji do inventáře, sice ubydou prostředky, ale stále se jedná o budovu na té úrovni, takže po vložení by se němělo nic měnit. Pokud budou úkoly na lidi a kulturu (jakože takové už byly), tak to stejně bude za nějaký pakatel, kde pomůže jen něco přistavit, těžko budou nějaké náročné úkoly, každý to kouzlo mít nebude (vlastně to vypadá, že ho asi skoro nikdo mít nebude, protože to posledně vypadalo, že věž nikdo nechce hrát, jak je ztrátová). Nehledě na to, že se tu stále píše vracet do inventáře, takže jak se dá vracet něco co tam nikdy nebylo, pochopil bych to u budov z událostí, jak je např. odložit na horší časy, popř. změna strategie ve městě a nechtít se zbavit nějaké pěkné budovy, která se dá teoreticky vylepšit a vystavět opět za nějakou dobu, sic smysl v tom příliš nevidím."}, {"66": "Ale to se hodí. Můžeš si postavit dočasnou pop/kulturku s tím, že jí v další kapitole po dalším eventu vyměníš za lepší, uklidíš do inventáře a rozkraftíš. [BR]Už jsem si několikrát říkala, že by to bodlo, je škoda stavět eventovky, když víš, že ti dlouho nezůstanou a pak z nich nic nezbyde. Vidím to jako motivační element, aby lidi více braly budovy z eventů, i ty statisticky nevýhodnější."}, {"136": "Ludi napsal/a:\t\t\t...Průzkum provincie mám už víc než 70 hodin a jsou tu borci s daleko delší dobou....\t\tKlikněte zde pro zvětšení...By mě zajímalo jak to děláte. Mě chybí do konce kousek(popravdě už ani nechvátám), a mám průzkum 26h. Ale je faktem že na konci asi nebudu mít co dělat, a budu zkoumat někam do pryč.. "}, {"16": "@Corwin22 468 provincií vyčištěných, dalších 13 připravených na eventy (14. se zkoumá), těch 13 je ještě žlutých, ta 14. už je oranžová. Čas výzkumu něco pod nebo kolem 70h, tedy cca 3 dny +- pár hodin.[BR]Asi 3 měsíce jsem na konci výzkumu a zkoumám hlavně na eventy. Pokud někdo dorazil na konec výzkumu dříve, bude jich mít více a tím i delší čas průzkumu.[BR][BR][BR][BR]Jinak dle informací z bety dostane úkol Průzkum/Výzkum třetí alternativu - naše oblíbené opary vidění (15).[BR]To zase všichni budeme vyrábět jak o duši naprostý odpad, jenom abychom splnili ty úkoly."}, {"11": "@Corwin22  jseš si jistej? 21 hod. mám na malým světě střední obtížnost ve vílách(začátek orků)"}, {"31": "@Lovec Krys v každom prípade to je viac než dobrá správa. 15 oparov v optimálnom prípade zjavených receptov nemusí stáť viac než 6-7 hodín zesilovačov a úlomky kouzel a činidlá ja nepočítam, nakoľko mi ich počet neustále, napriek crafteniu, rastie (najmä vďaka veži). Takže ma naozaj teší, že vypočuli spätnú väzbu hráčov z bety a že tá iniciatíva, ktorú sme tam tomu venovali, padla na úrodnú pôdu. (I keď po prvej úprave pridania alternatívy \"alebo vyskúmaj 1 technológiu\" to vypadalo na snahu o konverzáciu s rajčinami.)"}, {"136": "voyager-1 napsal/a:@Corwin22  jseš si jistej? 21 hod. mám na malým světě střední obtížnost ve vílách(začátek orků)\t\tKlikněte zde pro zvětšení...Celkem dost. "}, {"91": "No jo, jenže věž teď dává tolik úlomků kouzel, že něco rozřemeslničovat už téměř nemá smysl, pokud se nezmění cena výroby v akademii."}, {"154": "Popravdě jsem celkem doufal v to, že pujdou pomocí toho kouzla schovávat i divy, mám ve městě pár divů, které se mi už zdají zbytečné (třeba zvonice nebo ruiny věže), ale ,bořit je nechci, tak tohle by se mi hodilo, škoda, kvůli tomu bych i tu vež hrál."}, {"5": "Ruiny dávají velmi slušnou kulturu! ....Třetí alternativu k eventu z plna hrdla vítám, zkoumám provincii 98 hod."}, {"91": "Ruiny dávají kulturu, ale najednou je té kultury tolik, že jakoby už nebyly vůbec potřeba."}, {"11": "kultury není nikdy dost, máš vyšší produkci, já mám momentálně volný 260k a vůbec mi to nevadí "}, {"91": "Produkci jo, ale jen mincí a kladiv. Mincí je furt přebytek, že se za ně neustále kupují VB, ale stále méně, protože se to furt zdražuje. Kladiv mám celkem často nedostatek, ale nějak funguju. Mám teda jen 140k a taky mi to nevadí, ale už dlouho (asi od dob lesních elfíků) např. v událostech nejdu po budovách s kulturou, a spíš kulturu bourám než stavím."}, {"16": "Stačí vykupovat ve věži a hned to mincí ubere docela slušně. Takže díky věži už ani já nenakupuji VB tolik jako dříve."}, {"3": "pěkná ikona kouzla  "}, {"91": "Tak díky věži není ničeho dost, když se vykupuje."}, {"31": "Zatiaľ relatívne úspešné otváranie galaktických koulí na bete..[BR][BR]"}, {"16": "@Pauleo Tak kdybych ve věži bojoval, tak nemám armádu na top pozice v turnaji."}, {"91": "Tak jakýkoliv nadpožadavek vycucne i to, čeho je jinak přebytek. V tom ani žádné ruiny nedokážou zachránit."}, {"114": "Ahoj, tak co jsem si města vybudovala a hrála všechny eventy abych získala zboží a kladívka z eventových budov, abych mohla mít co nejméně dílen a manufaktur, tak teď abych to celé opět předělávala pokud budu chtít hrát event s tím, že budu mít i šanci mít získanou rostoucí budovu na lvl 10, mám totiž v každém městě jen 3 velké T1 manufaktury a jen 2 velké dílny (to jsem si právě koupila kouzelné abych jich tolik mít nemusela), mám vůbec teď šanci nějakého Medvěda dostat na lv 10? Kolik bych měla mít dílen a manufaktur T1 ve městě abych na jedno zadání výroby splnila alespoň jeden celý úkol?"}]