[{"31": "@luterina ja osobne nedoporučujem ísť pod 8 dielní. Ak ich máš menej, odmeny v tejto udalosti sú hodné stavby dodatočných dielní a ich zrýchlenia za zesilovače."}, {"114": "@iDavis , 8 dílen? to je přistavět 6 dílen na max - jsem v kap. (a to čerstvě, takže nemám vylepšené na ní nic, platí že když nevyzkoumám dílny tak se mi počítá kapitola elfů?) draků - to je spousta populace a časovačů na dalších 6 dílen to je 8418 populace a nějakých 1440 h času  ..a kolik bych měla mít manufaktur z T1 abych dala alespoň jeden celý úkol na jedno zadání výroby?[BR][BR]P.S. mám zprávu z beta od kamaráda, že by mělo stačit 6 dílen a 5 mnf na max, je to tak?"}, {"169": "Na bete jsem ve 3kapitole,a hned ve 3truhle my padlo nové kouzlo "}, {"154": "Já teda na betě nehraju, ale podle mě by měli fungovat i kouzelné dílny, ne?"}, {"178": "@iDavis a luterina: samozřejmě, že čím víc tím líp ale podle minmaxe z US fora by na slušné hraní měly stačit 4 dílny. Jinak může mi někdo potvrdit snižení limitu až o 3 úrovně u těch úkolů kde je třeba mít vylevelovaný dílny a mnf?"}, {"114": "ještě nemám nikde kolik by mělo stačit těch manufaktur?[BR][BR]@mohyla98 , však s tím že kouzelné taky platí s tím počítám, ty mám právě jen ty dvě a v druhém městě jednu + klasickou 1 "}, {"31": "Ešte som sa nestretol s poznámkou, že by kouzelné dielne nefungovali, takže verím tomu že áno. [BR][BR]@Baumax iste, ale počítaj, že v takom prípade ťa úlohy na výrobu košíkov a sady nástrojov zbrzdia natoľko, že bude úspech získať vôbec 9 artefaktov na jedného plne rozvinutého medveďa. 8 dielní je asi také minimum, kde sa ešte aj po zhruba 100 splnených úlohách to bude dať považovať za príjemne naberaný progres."}, {"16": "Kouzelné dílny samozřejmě fungují, na betě jednu mám a výroby z ní se do úkolů počítají.[BR][BR]@iDavis Možná bude nejlepší vypsat max. počet jednotlivých úloh v jednotlivých typech  úloh? Počet dílen/manufaktur si už pak každý odvodí sám.[BR]Tzn.: Max. 24h dílen by mělo být 5, že?[BR]Kolik je max na 9h dílen?[BR]Kolik je max na 9h T1? (já dostávám 4x, ale já jsem u úloh za 97 klíčů)[BR]Kolik je max na 3h T1?  (spoluhráč na betě má 7x - je na 160, ale těžko říci, zda už to je konec)[BR][BR]@Baumax Ano, bylo to sníženo, ale není to o 3 úrovně, ale o 3 věky, tzn. Před změnou bylo potřeba dílnu s úrovní dostupnou v konstruktech nebo amunech, nyní se to snížilo na půlčíkovskou. Ten popisek může být dost matoucí.[BR]Taky nás to na beta fóru stálo 15 stránek textu, než jsme si to spolu s alternativou na průzkum provincie vybojovali."}, {"114": "tak z toho co tu píšete bych zatím spodní ještě schůdnou hranici viděla na 5 dílen na max ( mínus tři stupně?) a mnf na max  4 x[BR][BR]to mi přijde celkem sympatické že ve městě mít budu, pokud tedy odpadají ty mega mraků jedničkových dílen a mnf a únavného zadávání a klikání, tím bude i místo na ty další velké dílny a mnf, včetně místa pro osadníky a možná i přistavím tábor žoldnérů který kladívka bere ve velkém a ještě zbude na více kvalitního spánku, tak za mě asi bude i velká spokojenost "}, {"178": "@Lovec Krys: pokud to tedy chápu správně tak když jsem v orcích tak mnf můžu mít jedničkové poslední uprade je v trpaslících a v případě dílen je dostačující 9.lvl dílen? [BR]Jinak fakt nechápu proč ten event takhle zabíjejí - nekonečné úkoly se nepovedly páč pár hráčů dalo moc odměn - tak odměny měly omezit a bylo by to"}, {"146": "Ahoj to snižení o tři věky se týká i manufaktůr? Píše se jen o dílnách"}, {"16": "@bohusDR Jen o dílnách.[BR][BR]@Baumax Ano, T1 má vylepšení v trpaslících a pak v lesních elfech, pro orky stačí nejnižší dostupná úroveň víl, takže to je ta první trpasličí úroveň.[BR]Ano, myslím, že tomu tak bude u dílen (pro elfy), jak píšeš."}, {"146": "manufaktury pro uroveň konstruktu asi na ovni elfů nebo trpaslíků?"}, {"16": "@bohusDR U manufaktur se dívají na předchozí kapitolu, pokud v ní není vylepšení manufaktur, tak v nejbližší nižší kapitole.[BR]Tzn. první úroveň elementálních by měla stačit pro Amuni a Konstrukty, pro čaroděje, půlčíky a elementály to je první úroveň lesních elfů, pro lesní elfy, orky a víly první úroveň trpaslíků."}, {"114": "ještě dotaz, [BR][BR]1. když je daný výzkum mnf např. v lesních elfech takový, že lze vylepšit mnf na úroveň 20 - 23, stačí mít mnf na lvl 20 a nebo musí být vylepšená až na lvl 23? [BR][BR]2. a když jsem zrovna v těch lesních elfech a mám aktivovaný výzkum na mnf T1, tak mi stačí mít mnf na level z výzkumu co je v kap. trpaslíci nebo už musím mít též mnf na level co je v elfech?"}, {"31": "@luterina [BR][BR]1. Podľa najnovších informácií by mal stačiť ten spodný level, teda v tvojom príklade 20.[BR][BR]2. Za aktuálnu kapitolu sa považuje tá, v ktorej si naposledy urobila výskum dotyčnej budovy, takže ak si spravila výskum v lesných elfoch, dostačujúca je kapitola trpaslíkov."}, {"170": "ja jsem tady z toho jelenice  Jaky lvl mnf bude potřeba v konstruktech. 20 nebo 24 ?"}, {"16": "@huhukoktejl 24."}, {"173": "@Lovec Krys Podle toho co píše iDavis by měl stačit 20. protože aktuální kapitola pro manufaktury jsou elementálové a předchozí elfové."}, {"16": "@Modyara To by platilo pro kapitolu elementálů. Pro konstrukty je předchozí kapitola Amuni a ti již mají konstruktí dílny (tzn. je potřeba lv 24+)."}]