[{"173": "@Lovec Krys  ale v Amuni žádné vylepšení na základní manufaktury není. Kapitoly ve kterých jsou vylepšení na základní manufaktury (ocel, dřevo, mramor) jsou: trpaslíci, elfové, elementálové. Takže i když je v konstruktech, tak aktuální = elementálové, předchozí = elfové."}, {"31": "V prípade dielní bola pre riešenie týchto nejasností oficiálne vysvetlená formula aktualna_kapitola - 3:[BR][BR]Od aktuálnej kapitoly hráča sa odpočíta 3 (v prípade konstruktov to je 14-3 = 11, teda pulčíci) a pozrie sa, či táto kapitola obsahuje výskum vylepšenia dielní. Ak áno, zoberie sa najnižší level týchto vylepšení (v uvedenom príklade sa v pulčíkoch odomykajú levely 26 a 27, tj. vezme sa 26) a tento sa vloží do požiadavky úlohy ako minimálny level potrebný na jej riešenie. Ak nie, rovnaký proces sa vykoná s najbližšou nižšou kapitolou, ktorá taký výskum obsahuje.[BR][BR]Pre manufaktury to môže fungovať podobne (aj nemusí, keďže vylepšenia nie sú každú rasu a samotná formula je mierne odlišná), každopádne zatiaľ to takto explicitne vysvetlené nebolo. Treba dúfať, že sa vývojárom podarí do začiatku udalosti na našom serveri implementovať tento požadovaný level priamo do popisu požiadavky úlohy.[BR][BR]EDIT: Tak vývojárom sa to nakoniec podarilo a bude to spísané takouto šarmantnou tabuľkou.[BR][BR][IMG]https://i.ibb.co/Fm4Wjzk/https-i-ibb-co-h-XKCKKg-ws-png.png[/IMG]"}, {"170": "a jsem stále jelenice [BR]Dílny mi jsou jasné, ale manufaktury ne. Právě proto, že není vylepšení v každé kapitole.[BR]Přeci na betě musíte vědět, jak to je, jinak nemate co testovat, když nevite co je spravně "}, {"16": "Edit: Beru zpět. - viz. iDavisův příspěvek.[BR]Jestli jsou ta čísla v popisku správná, tak to je zase guláš s těmi vylepšeními.[BR]To budou mít hráči před koncem výzkumu radost - např. já T1 na 25+ vylepšoval až na konci výzkumu (nedostatek prošlého zboží) a měl jsem T1 až skoro do konce výzkumu (tedy přes 2 kapitoly) na minimální úrovni - 24 a s těmihle požadavky bych ty úkoly ani nemohl dělat.[BR]Takže tu 5. T1, co jsem přistavěl na 24 musím ještě vylepšit o další 2 úrovně.[BR]Nu což, rozčilovat se už nebudu, to přenechám ostatním. Snad mi na to vyjde popka.[BR][BR]Jen tak mimochodem to vysvětlení hezky popírá ten popisek úkolu"}, {"31": "@Lovec Krys ber ale na vedomie, že tá tabuľka vyššie je len pre dielne, takže neznamená to, že aj manufaktury musíš dať na 26. Na tabuľku s manufakturami budeme musieť počkať, kým sa niekomu objaví taká úloha a urobí screenshot."}, {"146": "podle toho co se zde piše by měly vypadnut úkoly typu 1den a 2den vyroba v manufakturach, od konstruktu jiz je nelze v T1 delat. T1 pro Amundi se předce nepovyšuje tak by měli stačit elementalova manufaktura s nejnižším povýšenim. Nebo to chápu špatně?"}, {"16": "@iDavis Sakra, tak to jsem možná nemusel dát vylepšovat tu T1 z 24 na 25. Snad vyjde popka."}, {"169": "Na bete my naskocili 3x za sebou úkoly koupit 10VB,hned na to 3x vyřešit 5stretu a 3x průzkum provincie.Je nějaká postupnost úkolů nebo se systém totálně zbláznil :/"}, {"16": "Tak tady máte ty manufaktury:[BR][IMG]https://i.ibb.co/6wFq2Sw/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-9-17-19-17-39-png-3713.png[/IMG]"}, {"91": "Jak se na to koukám, tak jsem mnoho svých prvních tříd vylepšoval až kdovíkdy u Amunů vůbec na úroveň 24, protože 1. nebylo místo, 2. jsem přicházel o dlouhou výrobu (to jsem nějakou dobu i přemýšlel, zda je na té 23 nenechám), 3. prostě jsem se dlouho kvůli místu a zasekanosti předchozí kapitoly nemohl hnout z místa, kde až přechod do nové kapitoly vše pomalu rozhýbal, ale události jsem hrál. Teď už mám všechny na 24 vylepšené, takže jestli to chápu správně, nemohl bych už nějakou dobu vůbec hrát událost. A patnáctá kapitola je zatím asi jen na betě."}, {"16": "@Pauleo 15. kapitola není ani na betě. Jen s ní hra v některých věcech už počítá. Kdyby byla už na betě, tak vám to tu už spojlerujeme"}, {"136": "Jak to tak čtu, tak mi tenhle event může být ukradený...."}, {"158": "Zbytečně propadáte skepsi a blbé náladě jak malé děti. Minulý event nás sice namlsal a teď se to má trošku skrouhnout, ale podle mě (při přečtení informací na gems) půjde udělat bezpečně jeden méďa na max a s trochou přípravy třeba i dva .[BR][BR]Podle všeho tam jsou jen 9 hodinovky. A paradoxně to bude jeden z prvních eventů, který se bude hrát lehčeji hráčům v začátcích, protože mohou narvat více budov na menším prostoru. [BR][BR]Také uvidíme v praxi jak se budou míchat úkoly, protože některé zprávy v tomto směru nejsou úplně pozitivní, ale zatím to vypadá, že to nebude klik fest s desítkami malých manufaktur, takže si odvažuji říci, že průchod bude více pohodový, než v předchozích letech. [BR][BR]A také je fajn, že bude šance získat unikátní budovy z předchozích eventů. Takže já se těším "}, {"126": "Zde je to přepsané [BR][BR][IMG]https://i.ibb.co/nLmdkmr/https-cz-forum-elvenar-com-index-php-attachments-tabulka-level-manu-d-len-jpg-3714.jpg[/IMG]"}, {"31": "@BiggJOEcz ešte treba zobrať do úvahy že jednotlivé levely sú odlišné pre elfov a ľudí a taktiež pre jednotlivé druhy manufaktur (mramor, oceľ, drevo)."}, {"144": "iDavis napsal/a:\t\t\tPrvé úlohy, ktoré vychádzajú z mojich skúseností na bete sú už spísané v prehľade. Úlohy budem naďalej dopĺňať, avšak jedná sa opäť o náhodný systém úloh, takže treba počítať s rozdielmi.\t\tKlikněte zde pro zvětšení...[BR]iDavis napsal/a:..:: Podzimní událost ::..[BR]Přehled události​[BR]Spoiler: AkceToto nie je oficiálny zoznam úloh a odmien. Všetky uverejnené informácie vychádzajú z bety a je možné, že dôjde k zmenám po zavedení do hry.[BR][BR][IMG]https://i.ibb.co/X7cZ64J/https-beta-forum-elvenar-com-index-php-attachments-forumann-zodiac-png-6291.png[/IMG][BR][BR]Začátek akce:  __.9.2019[BR]Konec akce:  __.10.2019​[BR]Behom akce je dostupná 1 úkolová sada...[BR][IMG]https://i.ibb.co/V92mhrT/https-image-ibb-co-e-XEp-Mp-EL-akcia-jese-2018-sada-loh2-png.png[/IMG][BR][BR]Táto sada obsahuje nekonečné množstvo úloh. Nasledujúca úloha sa odomkne vždy splnením predchádzajúcej.[BR]Spoiler: Úlohy – 1. sadaSkôr než prejdete k zoznamu úloh:[BR]Uverejnené zoznamy úloh nemožno považovať za oficiálne, nakoľko autorom nie je žiadna osoba z tímu hry Elvenar! Jedná sa o informácie získané z testovania udalosti na bete a za prípadné nedostatky nie je nikto z tímu zodpovedný! Oficiálny zoznam úloh neexistuje, ani nikdy predtým neexistoval.[BR]Ak chcete zdieľať zoznamy úloh s ďalšími hráčmi, pripojte k nim tento odstavec.[BR]Spoiler: Zoznam úlohProsím poznamenajte, že zoznam úloh v tejto chvíli ešte nie je finálny. Udalosť sa stále testuje a v úlohách sa môžu vykonávať nejaké zmeny. Do začiatku udalosti na našom serveri bude zoznam aktualizovaný tak, aby obsahoval aktuálnu verziu. Dovtedy doporučujem vracať sa pre aktuálne informácie.[BR][IMG]https://i.ibb.co/j8dzTCY/https-i-ibb-co-6-H4-Nv2-H-EL-akcia-jese-2019-lohy1-png.png[/IMG][BR][IMG]https://i.ibb.co/rwBSwX1/https-i-ibb-co-MCKc-JZ4-EL-akcia-jese-2019-lohy2-png.png[/IMG][BR][IMG]https://i.ibb.co/D5hQYYX/https-i-ibb-co-Fn-XJt-K9-EL-akcia-jese-2019-lohy3-png.png[/IMG][BR][BR]Poznámky:[BR]- úlohy v ktorých je možnosť výberu z viacerých zadaní sú označené \t\t\t\t\t\t\t\t\t\t\t\t\t[IMG]https://i.ibb.co/nLzQmHm/https-image-ibb-co-bvcyc-S-EL-akcia-jese-2017-znak-png.png[/IMG][BR]- presné náklady v úlohách so zadaním „Získaj malé množstvo...“ závisia od vašej aktuálnej kapitoly[BR]- dodávať zboží do úloh je možné priamo v okne úlohy kliknutím na \"+\"[BR]- o spôsoboch akými sa dajú získavať mince, zásoby a relikvie si môžete prečítať TU[BR]- ak chcete zdieľať zoznam úloh napríklad s vašim spoločenstvom, môžete využiť textovú verziu dostupnú TU[BR]Behom udalosti budú do hry zavedené 3 nové zvieratá...[BR]ObrázokNázovDostupnosťDetaily[IMG]https://i.ibb.co/6Y7fCJQ/https-i-ibb-co-h1k-SKWc-EL-akcia-jese-2019-medve-hned-mini-png.png[/IMG]Hnědý medvědúvodné úlohy udalosti[BR]pokročilé hlavné cenyDetaily o budove[IMG]https://i.ibb.co/Z2QDhDf/https-i-ibb-co-7r-Dz-Jhh-EL-akcia-jese-2019-medve-pol-rny-mini-png.png[/IMG]Medvěd polárníúvodné úlohy udalosti[BR]pokročilé hlavné ceny[BR]Detaily o budove[IMG]https://i.ibb.co/f9VCbJD/https-i-ibb-co-71-XPkg5-EL-akcia-jese-2019-medve-panda-mini-png.png[/IMG]Pandaúvodné úlohy udalosti[BR]pokročilé hlavné ceny[BR]Detaily o budove[IMG]https://i.ibb.co/J7TWs1F/https-i-ibb-co-f-Xb-Kb-Xz-EL-akcia-jese-2019-event-currency-png.png[/IMG]Zlaté klíče sú potrebné na otváranie galaktických koulí. Ďalšie zlaté klíče môžeme nájsť na hracej ploche okolo mesta. Objavia sa asi 1x za hodinu a z jedného zberu dostaneme 1-3ks zlatých klíčů (môžeme navýšiť postavením budovy Stanice události).[BR][IMG]https://i.ibb.co/yp2D07Z/https-i-ibb-co-K7-SSd-QM-EL-akcia-jese-2019-na-ploche-png.png[/IMG][BR][BR]Po kliknutí na ikonu akcie sa nám otvorí okno...[BR][BR][IMG]https://i.ibb.co/3WRhW5J/https-i-ibb-co-CKTYs-FV-EL-akcia-jese-2019-okno-akcie-png.png[/IMG][BR]Ponuka pozostáva z troch rôznych galaktických koulí. Každá má inú cenu, ponúka iné odmeny a zaručene dáva nejaké množstvo hvězdného prachu. Po kúpe ktorejkoľvek galaktické koule sa ponuka obnoví a zobrazia sa na výber ďalšie 3 náhodne vybrané galaktické koule. Prehľad všetkých galaktických koulí si ukážeme v nasledujúcej tabuľke.[BR][BR][IMG]https://i.ibb.co/nLM46hb/https-i-ibb-co-8bqd-BYn-EL-akcia-jese-2019-zoznam-truhiel-png.png[/IMG][BR][IMG]https://i.ibb.co/D5xdG8Y/https-i-ibb-co-3-Fs-G75t-EL-akcia-jese-2019-event-payback-png.png[/IMG]Hvězdný prach je potrebný na odomykanie hlavných cien.[BR][BR]Čo môžeme získať z hlavných cien:[BR]Medvědí artefakt (20x hvězdný prach, následne opakovane každých 40x hvězdný prach)Studna přání (opakovane)Rozvážková knihovna (opakovane)Monument prastarých vědomostí (opakovane)Obří ruské kolo (opakovane)Kupecká základna (opakovane)Hnědý medvěd (51. hlavná cena)Medvěd polární (52. hlavná cena)Panda (53. hlavná cena)[BR][IMG]https://i.ibb.co/P5K98h2/https-i-ibb-co-JQb-Jwtc-EL-akcia-jese-2019-hlavn-odmeny-mal-png.png[/IMG][BR][IMG]https://i.ibb.co/w09c66K/https-i-ibb-co-NLCZh-YZ-EL-akcia-jese-2019-artefakt-png.png[/IMG]Medvědí artefakt je potrebný na vylepšovanie budov Hnědý medvěd, Medvěd polární a Panda na vyššie stupne.[BR][BR]..:: Otevírání truhel ::..[BR][BR][BR]..:: Kalendář odměn ::..​[BR]1. deň2. deň3. deň4. deň5. deň6. deň7. deňStudna přáníHoubový lesMagický louskáčekVětev oříškůPole zlataHořící panák4x zesilovač (14 hod)8. deň9. deň10. deň11. deň12. deň13. deň14. deň-------15. deň16. deň17. deň18. deň19. deň20. deň21. deň-------22. deň23. deň24. deň25. deň\u0000----\u0000[BR][BR]Oznámení[BR]Diskuze[BR][BR]Nevkladajte do tejto témy žiadne príspevky, táto téma neslúži ako diskusia!​Klikněte zde pro zvětšení...[BR]Ahoj, nefunguje odkaz na textovou verzi úkolů Podzimní události. Prosím můžeš to opravit?[BR]Předem děkuji[BR][BR]// Příspěvek přesunut z jiného tématu. Příspěvky sloučeny. Jumala"}, {"160": "Krásny den všem a nevíte už nekdo kdy tenhle \"skvelý\" event vypukne u nás?"}, {"16": "@Slniecko Nejdříve v Pondělí, ale může být, že to pustí i později.[BR][BR]@Fjorgyn Trošku? Spíše pořádně. Teď už to možná hratelné bude, ale jen díky ohlasům na betě. Dovedu si představit, jak by to vypadalo, kdyby to pustili v původní podobě. Třeba hráči, co chytli asi 8xprůzkum provincie (s průzkumem 3d/5d+) bez rozumné alternativy, by mohli vyprávět. V původní podobě by ti při troše smůly nepomohly ani tisíce hodin urychlovačů.[BR][BR]Mix různých úrovní manufaktur - Úkol 4x9h T1 jsem splnil s 3xT1(24 lv) + 1xT1(20 lv) (minimální potřebná úroveň - 20)."}, {"158": "@Lovec Krys Ano jen trošku, protože pravděpodobně zjistily, že předchozí stav byl nechtěný omyl, protože hráči odehráli více, než se předpokládalo. Každopádně princip eventu je stále o tom, mít místo ve městě. A díky zavedené změně, je spíše největší problém ten čas, který je potřeba na vybudování dodatečných budov, které umožní rychlejší plnění úkolů. [BR][BR]Navíc já reflektuji aktuální stav a nevracím se k původnímu nastavení. Ano předchozí varianty byly diskriminující, nelogické a v některých úkolech naprosto demotivující vůbec podzimní událost dělat. A od toho je právě beta, aby se hra testovala a hráči nacházely problémy ve hře a vyjadřovali se ke změnám."}, {"16": "@Fjorgyn Jenomže ty odpovědi, na které reaguješ, vycházely právě z těch starších stavů, koneckonců např. alternativa s opary k průzkumu provincie přibyla teprve včera. Dílny měly být taky původně jen o 1 kapitolu nikoliv o 3, atd.. Takže valná většina kritiky vychází z tehdy aktuálního stavu. On ani teď ten stav ještě zdaleka není úplně ideální. Např. vyrábět 24h v dílnách vysokého levelu je neskutečný opruz (pokud teda člověk nemá 14 dílen), při 5 mu to zablokuje všechny dílny na celý den."}]