[{"66": "Tak nějak bych doufala, že si to rozmyslí i s těmi 24h dílnami. Myslíte, že se vám to ještě podaří na betě vyhlasovat?[BR]Stačilo by odstranit tu podmínku s levely, aby se to dalo dělat na jednolevelových.[BR]Vyřadit si všechny dílny na 24h je kritické pro lidi/elfy s optimalizovanou produkcí."}, {"3": "nicméně přesto je asi jasné, jakým směrem se budou eventy do budoucna ubírat a je třeba se tomu přizpůsobit. A osobně jsem radši, že pro plnění úkolů využiju své běžné budovy, než pořád stavět a bourat dokola ty jedničky (mě to třeba vůbec nebavilo...)"}, {"179": "Nevím, ale je tam \" alespoň \" , tedy pokud je poznámka alespoň o jednu kapitolu snížení, dá se předpokládat, že může být i nižší, tedy třeba 1ní lvl...[BR]A pokud ne, nechce se mi tomu věřit, přece po mně nemůžou chtít zbourat dílny 25 lvl a dát je na 20, protože nové opravdu nemám kam nacpat..  Navíc se staví docela dlouho [smilie--sprite1]. To samé manufaktury 1T, řekněte prosím někdo, že jsem hňup a jen jsem to špatně pochopil..."}, {"5": "Vyjádřím se k nadcházejícímu eventu a i tím vlastně pro aikomi /zdravím/ zodpovídám jednu z otázek do měsíčníku Ozvěny lesa v otázkách pro osobnost, protože v říjnu to bude možná již neaktuální, když event již vlastně poběží [smilie--sprite1].[BR]Eventy beru s tím, jak přicházejí, jsou těžší i lehčí a minulý ukázal, že pro některé velmi schůdný a nabrali 4 a více budov ,,akvárií,, /necht´je jim přáno/, ale to asi od tvůrců nebyl záměr...proto nyní přichází změna a holt těžší event. Nevadí mi výroba v manufakturách a dílnách na současných úrovních, beru to jako novou výzvu a když se detailně podíváme na konkrétní úkoly, tak u manufaktur to je o 3hod a 9hod, což lze vše během jediného dne povyrábět /zde nikdo nevidí? a nekvituje např. odpadnutí úkolů typu x 24hod a x 48hod výroba byt´na manu 1levelu!/ u dílen to samé, většinu úkolů lze během dne vyrábět, čekat se musí pouze u 24hod výroby, ale také přeci nic tragického...nejtěžší úkol tedy je ohledně výzkumu provincie! U některých i u mne až 90-100hod, tedy více jak 4dny čekání! Jenže i tyto úkoly byly i v předešlém eventu a měli asi eliminovat u pokročilých hráčů na konci výzkumu zisk více jak 1. či 2. budov Ráje mořských panen /popravdě některým pomohli s dilematem kam potom s tím? [smilie--sprite1]/ ...Dále kvituji zmenšení budov medvědů na 3x3 to je veliké + [smilie--sprite1].... tot´ můj osobní pohled a názor, hezký event všem a pěkně se s tím poperme [smilie--sprite1][BR]PS. někteří jedinci měli eventy hotové během 2-3dnů či max. do týdne a další 3týdny se ,,kopali,, do zadní části těla...ted je to rozvržené na 3-4 týdny práce pro event, ale ty budovy za to stojí a je to jen hra a zábava a o to jde přecejc [smilie--sprite1] ...překonávání překážek ne jít vydlážděnou cestou."}, {"179": "@ElfNostradamus Ahoj, pak jsem asi jitrnice, protože mi ta výroba nepřipadá na výrobu v současných úrovních, ale v úrovních nižších...[BR][BR]// Odstraněna citace. Jumala"}, {"5": "Bude ti to ,,brát,, výrobu i v současných i nižších kapitolách aktuálně o 3...viz příspěvky a obrázky výše = iDavis, BigJoi."}, {"91": "Fjorgyn >> Tak ono např. na konci hry ani v těch manufakturách delší výroba jak 9h nejde, pouze dílny mají den, takže s delší výrobou příjít nemůžou. Hráčům v začátcích by se mělo hrát lépe, protože ti na konci už toho na své sestavě moc nezmění.[BR][BR]Je vidět, že to tvůrci moc odladěné nemají, zkouší co se dá, vždy je na tom někdo bit nebo to způsobuje zatím nepoznané situace. Taky je otázka co všechno teď bude moci hráč ovlivnit. Dřív si po úspěchu toužící hráč zastavěl a zasekal město, což teď už nepůjde, takže bude víceméně vycházet jen z časových možností. Nepředpokládám, že by někdo překopával své město jen kvůli události, která se může zase kdykoliv od základu změnit."}, {"16": "@Pauleo Aby ses nedivil[smilie--sprite8] Někteří hráči dokáží všelicos."}, {"91": "Tak ti co už nehrajou samozřejmě můžou všelicos, tomu bych se opravdu nedivil."}, {"20": "@Lovec Krys   Díky za boj na betě. Jistě, beta je právě na to, aby se vychytaly chyby, ale bez zpětné vazby aktivních hráčů by to nebylo nic platné. [BR]Snad po určité odezvě hráčů sem přijde už vydařenější verze."}, {"138": "Já s tím problém nemám.Mám jen několik podmínek.[BR]1) By měli snížit nároky na množství - když budeme muset mít vylevelované výrobny,tak jich nebudeme moci mít tolik.Bude na ně třeba lidí a kultury.[BR]2) Nároky na zboží se budou muset rozdělit na zboží ze všech úrovní.To znamená T1,T2 a T3. Menší levely,které nebudou mít vyzkoumané T2 nebo T3, budou mít úkoly ve zboží již vyzkoumaného.Nemůžeme vyrábět všichni velké množství jednoho stupně zboží.Je třeba i další.[BR]3)V dobrodružství společenství se budou vyrábět flakónky,diamantové náhrdelníky atd. jen v bonusových výrobnách. Nemá smysl kvůli tomu levelovat další nedostatečně produktivní budovu či dokonce budovy.[BR]4) Hůlka,klobouk a ten třetí by se měli vyrábět z nebonusového zboží pro všechny.To znamená výrobce prken z mramoru,výrobce hedvábí třeba ze svitků a výrobce elixíru z prachu - to už mělo být hotové,bez ohledu na změny[BR]Nic dalšího mne nenapadá."}, {"160": "Cawalla tak ono se to týka jen eventu prozatím, dobrodružství by se to týkat nemelo.."}, {"31": "V tejto chvíli naplánovaný termín udalosti Podzimní zvířetník nájdete uvedený v prehľade. Ten zároveň v tejto chvíli obsahuje kompletne aktualizovaný zoznam úloh na jeho najnovšiu verziu (keďže oproti pôvodnej došlo k viacerým zmenám), aktualizované poznámky, všeobecné informácie k úlohám a taktiež uvedený nový spôsob zdieľania úloh, ktorý odteraz umožní hráčom dostať sa ku všetkým informáciám, ktoré sú s úlohami spojené."}, {"114": "no tak snad stihnu ve svém nejpokročilejším městě - v kap. draků -  dovylepšit dílny https://ctrlv.cz/eseS , v každém městě jsem měla jen 2, takže jsem 3 přistavovala a už teď jsem spokojená: 1. hurá že nemusím do zblbnutí stavět jedničkové budovy a dokola je bourat a všechny zadávat a 2. hurá osadníci nikde nemusejí čekat a konečně mají ve městě své vlastní a jen pro ně vyhrazené a to stálé místo, takže teď už jsem napjatá jen jak půjdou plnit úkoly na dílnách a manufakturách se kterými počítám i do budonoucna je ve městě mít nastálo..., jinak to zkoušení jak co funguje to mě baví a beru jako další možnost dobré zábavy...[smilie--sprite11][smilie--sprite1][smilie--sprite1][BR][BR]tak nechť se všem v eventu daří mít hru na pohodu a štěstí dát alespoň jednoho medvěda (nejraději bych toho hnědého) na nejvyšší level [smilie--sprite1][smilie--sprite1][smilie--sprite1] Eventu a všem hráčům zdar!!!!"}, {"91": "Já chci taky hněďáka. Tuto událost se asi náležitě zapojím. Odlovu medvědů zdar."}, {"160": "Taky jsem za hnedého [smilie--sprite1] Tak doufam,že to pujde aspon tak dobre jako na bete, tam už mám nejakých 6-7 vylepšení a to tam hraju jen tak sporadicky, takže snad tu to bude ješte lepší [smilie--sprite1] Ze začátku to vypadalo zoufale, ale event se zlepšil - tímto dekuju všem, kterí na tom zapracovali a vydupali to na bete,at je to hratelné [smilie--sprite1] Takže už se taky teším na to,že aspon nemusím dookola stavet jedničkové dílny a manufaktúry a zadávat tam porád dookola výrobu [smilie--sprite1] Tak at se nám všem darí a at ten event stojí za to [smilie--sprite1]"}, {"3": "tady už je to skoro jako parta se zácpou: \"Já chci taky hnědku!\" [smilie--sprite8]"}, {"127": "Vie mi niekto povedat ci sa scitava specialny bonus po krmeni? U novych medvedov, pripadne z fenixov, co by malo byt to same. Napriklad ak nakrmim dvoch medvedov hnedych tak budem mat 100% bonus na vyrobu vojska? Ciste zo zvedavosti. Dakujem"}, {"40": "Sčítá, napřed nakrmíš ptáka a prákem medvěda!"}, {"28": "Že by to bylo to nové vylepšení ohledně výroby, co se testuje na malém procentu hráčů? Jsem ani nedoufala, že bychom se toho mohli dočkat na PC verzi. Nemáte to někdo už na svém účtu? (převzato z fan page na FB)[BR]Spoiler[IMG]https://i.ibb.co/19r6Dq9/https-cz-forum-elvenar-com-index-php-attachments-70700419-10156683679142406-4817885143450517504-n-jp.jpg[/IMG]"}]