[{"158": "@PankerSK Ano bonusy se sčítají[BR]@moribundus [smilie--sprite8] [smilie--sprite8]"}, {"131": "iDavis napsal/a:\t\t\tV tejto chvíli naplánovaný termín udalosti Podzimní zvířetník nájdete uvedený v prehľade. Ten zároveň v tejto chvíli obsahuje kompletne aktualizovaný zoznam úloh na jeho najnovšiu verziu (keďže oproti pôvodnej došlo k viacerým zmenám), aktualizované poznámky, všeobecné informácie k úlohám a taktiež uvedený nový spôsob zdieľania úloh, ktorý odteraz umožní hráčom dostať sa ku všetkým informáciám, ktoré sú s úlohami spojené.\t\tKlikněte zde pro zvětšení...iDavis mohol by si prosim dolnit ulohy v textovej forme?"}, {"114": "chtěla jsem se zeptat, v upoutávce videa na event je, že medvědi se získají za splnění prvních třech úkolů, ale já je tam na betě neměla a ani v inventáři je nemám, je to na betě jinak? kdy tam ty budovy medvědů dostanu?"}, {"31": "@luterina je to vraj nejaká chyba (ktorú dúfam do spustenia na live opravia), treba na bete napísať na podporu.[BR][BR]@ixo8 v prehľade je uvedený alternatívny spôsob zdieľania úloh."}, {"91": "iDavis >> Tak opravit by to měli, protože jak v ostré verzi nedostaneš brumlida, tak seš nahraný, zbytek události by už neměl smysl."}, {"114": "napsala jsem na podporu a obratem jsem měla všechny tři v inventáři [smilie--sprite1]"}, {"131": "iDavis napsal/a:@ixo8 v prehľade je uvedený alternatívny spôsob zdieľania úloh.\t\tKlikněte zde pro zvětšení...To neni nic pre mna, ja ich nechcem zdielat, textovky su prosto naj... a nie len pre mna"}, {"91": "Takové uširvoucí ticho tu je, že si nemůžu nemyslet, že se všichni připravují na nadcházející předudálostní přípravy."}, {"103": " Nové seznamy úkolů na zkopírování najdete zde: https://www.elvenarczsk.cz/eventy/[BR] A nebo potom je ještě celý Event v CZ tady i s pokecem: Elvenar CZ SK [BR][BR] Příjemnou soutěž Přátelé =)"}, {"91": "ANCARY >> Hmm, tak se nepodívám, protože téměř každý pododkaz se chce přihlásit na facebook, a ten nevedu, takže... Myslím z toho druhého odkazu. Na druhou stranu z toho prvního jsem se podíval aspoň na ty úkoly.[BR][BR]Tak jsem prozkoumal úkoly, a nejsou mi jasné některé věci:[BR]1. Co je to segment, a jaké jsou vztahy mezi segmenty, resp. jak přicházejí?[BR]2. Střet ve věži se myslí jeden podsouboj a nebo celý truhlový několikastřetový souboj?"}, {"103": "Vše je už doplněné a to v té věži nevím, je to úplně nové tak uvidíme sami v soubojích [smilie--sprite1][BR]Doporučuji šetřit si na otevírání bran klidně i časovače =)"}, {"91": "Asi mi to nějak nedochází, ale jak jdou ty segmenty po sobě? První je asi nějaký základní, ty zbylé tři jsou psané jako náhodné, nevím co si o tom mám myslet. Jinak časovače skoro nemám, teď jsem se o dost pohnul z místa, takže jich hodně moc padlo na budování města a z věže padaj jen majinké. Jinak jasně, je to něco nového, tak se vše uvidí, doufám že nebude moc zákysů a neřešitelných situací. Ono stačí, když se omylem započnou bojovat střety z turnaje na konci turnaje, tak se začne část, která nejde kombinovat s normálními střety, a nejde ani vyresetovat, takže pak nezbývá než tři dny čekat na další turnaj."}, {"31": "@Pauleo segmenty idú podľa očíslovania. Tie úlohy, ktoré obsahujú, to je len nejaká množina úloh, z ktorých sa náhodne vyberajú. V podpise mám link na prehľad udalosti, kde je napísané aj to, pre ktoré úlohy sa vyberá z ktorého segmentu (šedý text)."}, {"31": "Na bete sa objavila táto animácia.. zrejme je jasné, k čomu patrí. [smilie--sprite1][BR][BR]Spoiler: Obrázok - verzia elfov[IMG]https://i.ibb.co/G9Y7hnP/https-i-ibb-co-0-MJ343-P-7y-GAqp-png.png[/IMG][BR]Spoiler: Obrázok - verzia ľudí[IMG]https://i.ibb.co/CMpDfqs/https-i-ibb-co-dpxc-Lpv-7y-GB4-I-png.png[/IMG]"}, {"2": "Já to šacuju na dílnu nové rasy[BR]budovy drží styl posledních dvou let[BR]Ta tapka mě vede k domněnce že další rasa bude zase nějaké zvíře"}, {"3": "jen jestli ta ťapka nebude prostě jen \"stopa\". Ale jinak, žeby po amunech byli ti požadovaní Hafini? [smilie--sprite8]"}, {"180": "Hádám, že dle stylu a provedení je to kouzelná dílna elfů v nové kapitole a zdá se že její velikost bude 5x5."}, {"15": "iDavis @ Jaksi tomu nerozumím , protože po kliknutí na tvůj spoiler se mi zobrazí jenom prázdný čtverec .Tak nevím , jestli je to chyba v počítači , nebo co?  [smilie--sprite9]"}, {"31": "@Green Jane u mňa to funguje bez problémov. Jedná sa o animované obrázky, skús keď tak použiť iný prehliadač ak by bolo problémom že to nefunguje na tom, ktorý používaš teraz."}, {"117": "Vlci, jsem zvědavá, co vse nova rasa prinese [smilie--sprite1] T7? JEN TO NE"}]