[{"28": "Ta tlapka nemá s novou rasou nic společného [smilie--sprite2]"}, {"16": "Tak beta právě dostala novou rasu, tak uvidíme, zda ji taky dostaneme před koncem eventu jako na betě.[BR]Pro angličtináře:[BR]https://beta.forum.elvenar.com/inde...rs-the-elvenar-have-arrived.13782/#post-78633"}, {"66": "Tak to na nás hrňte, co je tam za háček místo živoucího zboží?[BR][BR]Mezitím: Jupí, Wellspring of Youth, to je přesně to, co potřebuji.[smilie--sprite1][BR][BR]PS. Kolik že přesně bude rozšíření z provincie? V Q&A mluvili o 1 na kapitolu, tak proč tady píšou v množném čísle?"}, {"72": "ve výzkumu jsou dvě"}, {"16": "1 z provincií + 2 z výzkumu. Takže 3 celkem.[BR]Snad budou fungovat portálová požehnání, ať se můžu otravovat jenom s vylepšením portálu a pak to plácat přes ně.[BR]Ty nároky na výzkum jsou zábavné. Prošlé zboží ve statisících."}, {"5": "+2 rozšíření diamantová[BR]kapitolu rovněž pojedu skrze %portál bonusy...Budovy jsou ovšem velmi graficky povedené [smilie--sprite1]"}, {"31": "Na bete prichádza nová kapitola, prikladám zhrnutie informácií.. [smilie--sprite1][BR][BR]15. kapitola: Elvenar[BR]Spoiler: Elvenar[IMG]https://i.ibb.co/3f5w8DF/https-media-innogames-com-com-ONYX-ZZ-announcements-elvenar-forumbanner01-png.png[/IMG][BR][BR][IMG]https://i.ibb.co/QKJKFQD/https-media-innogames-com-com-ONYX-ZZ-announcements-elvenar-TTicon-png.png[/IMG][BR]Príbehom je opätovný začiatok spolupráce ľudí a elfov. Kapitola vyžaduje veľké množstvá už objaveného zboží, najmä živoucího (takže nové T7 sa predsa len nekoná [smilie--sprite1]).[BR][BR]Osadnícke budovy budú princípom fungovať podobne ako fungovali budovy konstruktov, teda na systéme setov.[BR][BR]Výskum obsahuje až 2 rozšírenia a so zavedením novej kapitoly má taktiež dôjsť k navýšeniu rozšírení z provincií (teda zdvihnutiu súčasného limitu 457 provincií).[BR][BR]Na konci kapitoly budú ako vždy dostupné 2 nové divy:[BR][BR][IMG]https://i.ibb.co/zVyfGGV/https-media-innogames-com-com-ONYX-ZZ-announcements-elvenar-AW01res-png.png[/IMG][BR][IMG]https://i.ibb.co/6Wt8jxR/https-media-innogames-com-com-ONYX-ZZ-announcements-elvenar-AW02res-png.png[/IMG][BR][BR]Spoiler: Animácie[IMG]https://i.ibb.co/yk0SRmR/https-i-ibb-co-gy9p-Zhk-B-Gr10-AW2-10-Animated-png.png[/IMG][BR][IMG]https://i.ibb.co/G2kbXj1/https-i-ibb-co-4-KV4-Gs-G-B-Gr10-AW1-11-Animated-png.png[/IMG][BR]Jeden zvyšuje kapacitu osadníckych portálov (čím sekundárne dosahuje zvýšenie efektivity požehnání portálový bonus), druhý zvyšuje obyvateľstvo poskytované každou obytnou a kouzelnou obytnou budovou v meste.[BR]V prípade prvého divu sa jedná o postupné navyšovanie do 50% na maximálnej úrovni, v prípade druhého o 20% na maximálnej úrovni.[BR][BR]Okrem toho, všetky technológie na zväčšovanie oddielov sú tentokrát vo výskume nepovinné.[BR][BR]Vo výskume dôjde k možnosti vylepšenia, okrem iných, obytných budov na levely 34 a 35 (rovnaké rozmery), dielní (nové rozmery budú 5x5) a manufaktur T1 (nové rozmery taktiež 5x5)."}, {"181": "Tak doufejme, ze to bylo planovane, ze to neni jen jak zmirnit rozhorceni hracu v tomhle nevydarenem eventu a ze to bude odladene.  [smilie--sprite2]"}, {"66": "A bude nějaký druhý bonus z těchto prastarých divů? Na betě mají prý jenom jeden."}, {"31": "@Prealiena vypadá to len na jeden bonus u každého.[BR][BR]Náklady na vylepšovanie nových prastarých divov avšak budú dosť vysoké. Podobne ako u konstruktov, budú chcieť manu, semienka a k tomu dokonca aj mince a zásoby (vo veľkom množstve), v runových kolách T5. Náklady na VB rastú každým levelom až o 50, čo dosahuje vyššie počty ako ktorýkoľvek iný div v hre."}, {"66": "Taky proto by se měli snažit a přidat tam nějaký druhý bonus, aby nevypadali méněcenné v porovnání se staršími divy.[BR][BR]Doufám že:[BR]a) je to zatím testovací verze a při příchodu na live servery bude funkce divů kompletní (taky tam přidávali upozornění v ofiko představení nové rasy na betě)[BR]                   b) hráči je negativními komentáři ukecají, aby tam nějaký druhý efekt přidali (třeba chtějí dostat návrhy od hráčů, protože už je nic nenapadá, poslední dobou je beta spíše proto, aby si hráči vybojovali lepší podmínky)"}, {"5": "...zatím je tedy zajímavý pouze ten druhý div, který navyšuje počet obyvatel, druhý parametr by ano slušel oběma [smilie--sprite1]"}, {"20": "Zatím jsem koukla přes moje pidi město na betě, jak vypadá výzkum. Celá ta nová kapitola mi přijde taková divná. Jakoby ušitá horkou jehlou.  [BR]I ten název: Elvenar ... Mám podobné pocity jako redking123, totiž že novou rasu spustili předčasně, aby hráči, kteří jsou naštvaní z eventu, měli nové téma k diskuzi. Ještě nedávno byly zmínky, že nová kapitola bude až za delší čas, ale že se na ní pracuje. A teď najednou je tu. Divy jenom s jedním parametrem...[BR][BR]Event je jasně spuštěn s velmi španým \"náhodným\" výběrem úloků, když se většině hráčů opakují pořád dokola podobné nebo dokonce stejné úkoly. Takže radši spustili nehotovou novou kapitolu ....Co se to jenom u těch vývojářů děje?[BR][BR]Ale abych jen nekritizovala: vítám návrat průzkumníka, který snižuje náklady na provincie a že všechna zvětšení oddílu jsou volitelná."}, {"117": "Počkat, ta nová rasa se jmenuje Elvenar? [smilie--sprite8]"}, {"20": "na betě zatím ano"}, {"16": "@donutka [BR][IMG]https://i.ibb.co/3mSsRh5/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-9-26-11-52-16-png-3725.png[/IMG]"}, {"5": "Zatím testování na Betě, třeba právě tam vychytají vyskytnuvší se mouchy /pokud ale mají stejnou mucholapku jako na tento event, tak to moc veselé není/."}, {"3": "O nedodělanosti nemluvím, ale o názvu. Spíš to vypadá, že skončí jedna série/sága/kapitola hry a od 16. kapitoly se můžeme těšit možná na vykročení trochu jiným směrem.[BR]Hlavně, aby to nepoškodilo hráče třeba při hraní turnajů apod..."}, {"117": "Originální název.... a 16. kapitola se bude jmenovat forge of empires ne"}, {"88": "Už jsem to psala jinde na tomhle fóru, jestli se náhodou INNO nevydává cestou, kterou šla známá x-let populární karetní hra UR a cesta ji zavedla takříkajíc \"do kytek\"... [BR]Tak jen opáčko: rozvrtat co fungovalo, neustálé změny formátů a přechod na jakousi pseudo-manga grafiku (to tady nejspíš nehrozí...) [BR]A hlavně neustálé osekávání výher, cen a všeho, co se neplatí v RM. Každé vylepšení / urychlení / zajímavý objekt (u nich kartu) buď za neakceptovatelnou spoustu herní měny nebo za ekvivalent RM. [BR]Výsledek: z 12-15 tisíc aktivních hráčů v jakoukoliv denní dobu tak 2,5 tisíce. Pak už raději počítadlo aktivních hráčů zmizelo a asi dvakrát se změnil majitel. Bratr (mimochodem člen nejlepšího ČR herního klanu) tam chodí už jen párkrát měsíčně z nostalgie a to hrávali s klanem třeba 4x denně hodinové turnaje. [BR]Mám docela strach ze stejného vývoje, pravda, INNO je na tom peněžně i velikostně úplně jinde a má celou řadu onlinovek, oni měli jen tu jednu."}]