[{"3": "na druhou stranu, nekonečné přidávání nových spřátelených ras a dalších a dalších surovin...[BR]možná nastal bod odstavit veškerý ten balast a začít s něčím jiným, nějakým novým principem, jako nadstavbou nad klasickými T1-3 surovinami [smilie--sprite1]"}, {"5": "...a třeba se vydají cestou...ale abych tedy nepředbíhal, tak více v říjnovém rozhovoru v měsíčníku Ozvěny lesy...rozhovor ukončen ještě před včerejším zveřejněním nové kapitoly 15., tak prosím maličko shovívavosti potom [smilie--sprite1]... /trochu tu ohřívám svou polívčičku, tak mi to nemějte za zlé/. [smilie--sprite1]"}, {"66": "@Emhyr var Emreis II To ti může být ale úplně jedno, protože eventy po tobě pořád budou chtít T1 výrobu. Takže, i když nároky v další kapitole na výzkum budou nula, v eventu ti pořád dají úkol Vyrob 7x3h bonusového základního zboží.[BR]A kam pak přistavovat něco nového, když budeš pro event potřebovat nesmyslný počet T1 manufaktur na vysokých levelech."}, {"3": "nečekám, že by základní suroviny zmizely. Ale kdyby zmizeli orkové, mana, semínka a živoucí, tak by se určitě nic nestalo. Ani by to nemuselo zmizet skokově, ale třeba postupně"}, {"2": "Nové divy mě moc nenadchly, snad dostanou druhou funkci"}, {"117": "Můžu někoho poprosit o screeny výzkumu a těch nových divu? popripade kde se na ne da podivat krome bety,tam nejsem"}, {"66": "@donutka https://tinyurl.com/y47pbv9e[BR]Kdyžtak si dej otevřít obrázek na nové kartě, tam je ten výzkum líp vidět"}, {"117": "@Prealiena Dekuji moc [smilie--sprite1] <3"}, {"182": "Thespia napsal/a:\t\t\tŽe by to bylo to nové vylepšení ohledně výroby, co se testuje na malém procentu hráčů? Jsem ani nedoufala, že bychom se toho mohli dočkat na PC verzi. Nemáte to někdo už na svém účtu? (převzato z fan page na FB)[BR]SpoilerZobrazit přílohu uživatele 3716Klikněte zde pro zvětšení...Máme. [smilie--sprite1] Od včerejška mohu zadat hromadnou výrobu v dílnách v prohlížečové verzi. Hraji na  Winyandoru."}, {"88": "Jojo, máme. Hraju na Arendyllu. Mimochodem 35 miliónů peněz u dvou divů (každý) ?? [smilie--sprite9]"}, {"40": "Tak se vybourají kombi setovky a na volné místo se posadí T1. Kde je problém? A že se přijde o \"přidanou hodnotu-bonusy?\" Se za pár týdnů tak nějak zapomene.[BR]\"Život je hořký, elvenaru dík\""}, {"16": "Ok, na další kapitolu přistavuju druhou T6. [BR]Nároky na výzkum prošlého zboží:[BR][BR]Konstrukti: [BR]T4-518K(max 45k)[BR]T5-582K(max 50k)[BR]T6-258K(max 61K)[BR][BR]Elvenarové:[BR]T4 - 555K (max 105K)[BR]T5 - 1575K (max 355K)[BR]T6 - 5870K (max. 370K)[BR][BR]Max = maximální cena za jeden výzkum. Jestli to nezmění, tak to je masakr."}, {"65": "@Lovec Krys : taky na to teď čumím a počítám to... T4 - nebude problém, není ho moc a navíc dostaneme nové levely manuch. T5 : jsou tam jen 3 technologie co chcou 300k+, to se nějak zvládne... ale to T6? to už mi připadne na hranici hratelnosti. no jo, nechtějí, abysme byli s kapitolou zase hotoví na měsíc :-D[BR][BR]také budu přidávat novou T6 výrobnu. kde na ni vezmu lidi nevím, ale to už je problém Corwina z budoucnosti :-D"}, {"16": "@CorwinOfAmber Tak ta budoucnost nebude daleko (tak pár týdnů). Já vím, kde vzít lidi - vylepšuji divy na popku. A jakmile konečně přijde akce na kouzelné budovy, tak pár standardních bude nahrazeno kouzelnými.[BR]Horší to bude s těmi obludami z portálu. Za pár dní mi vyprší kupa studen, tak snad se to tam pak alespoň trochu vleze."}, {"158": "Já se obávám, že nová rasa bude pěkný paskvil, když tak urychlili jejich vydání. Také se ani nedivým, že to bude stát tolik surovin, protože v mezi čase člověk mohl získat hodně velké množství portálových bonusů. Já už mám přes 1000%, což je asi více, než kolik je potřeba na celý výzkum. Takže největší nepřítel budou asi VB a normální suroviny [smilie--sprite1]."}, {"20": "Úplně se mi nechce stavět další manucha na živoucí, musím si to ještě rozmyslet. Lidí mám dost, ale když si představím, co všechno se bude zvětšovat, tak s tím místem to nebude žádná sláva. Tři nová zvětšení to nespasí. Tedy, zase lepší než nic, že ano [smilie--sprite2][BR]Ale zřejmě během nové kapitoly nebudu smět chodit utrácet živoucí do Věže ..."}, {"28": "Taky mám pocit, že na betu novou kapitolu nacpali dřív než původně zamýšleli, a to jen proto, aby zmírnili rozhořčení spousty hráčů z podzimního eventu. Trochu tím ale vzali té kapitole kouzlo. Škoda. Bylo fajn, když se z nové kapitoly postupně objevovali střípky předtím než došlo k jejímu zveřejnění."}, {"40": "Nejsem na beta. Čerpám jen ze zpráv tady.[BR]Možná byl záměr rozhodit 100-ky  procent jako odměnu v eventu,[BR]úplně nesmyslně + budovy s nejich produkci[BR](Myslím tím Portálový bonus).[BR]A potom \"řádně\" osolit výzkum v nové rase...[BR]P.S. stejně se pak najde pár hráčů co to stihnou za měsíc.[BR][BR]Odstraněn nevhodný výraz. Embla"}, {"126": "Toto je konkrétní rozumné využití kouzla Teleport -  T6 (5,4) vyrobit - využít - teleportovat následně budovu do inventáře na příště [smilie--sprite2]"}, {"183": "nevíte kdy začne nová rasa?"}]