[{"91": "Nová rasa se jmenuje podle té slavné online hry a má ve znaku psí ťapku? Tak to je masakr."}, {"117": "Spíš jde vidět, jak to dělali nahonem, aby to dali co nejdříve, když lidi nadávají na hru čím dál více a lidi i odcházejí"}, {"146": "po tomto eventu se snad poučí a Live servery to daji az to fakt odladi, tak at je to hratelné"}, {"74": "Na foru taky někdo spočítal náklady T surovin dohromady: [BR]195K Moonstone[BR]191K Platinum[BR]201K Tree Gum[BR]464K Obsidian[BR]539K Ink[BR]600K Velvet[BR]1775K Soap[BR]2010K Shrooms[BR]1550K Bismuth"}, {"20": "Pokud po diskuzi na betě nedojde ke změnám ve výzkumu, tak samozřejmě spotřeba živoucího je velká. [BR]Teď záleží na jedné věci: totiž, jestli portál půjde vylepšit na 4. lv jen díky portálovému bonusu, nebo budeme muset stavět i ostatní budovy. Pokud půjde postavit jen portál, tak je to moc fajn. Dřív jsme čekali, než se rozvinou výrobní budovy, teď budeme čekat, než vyrobíme živoucí. Jde o poslední kapitolu, takže klidně na tom můžeme pracovat déle. Není kam spěchat, protože pokud budu stát ve výzkumu, budu házet do divů. Až ukončím kapitolu, budu házet do divů ...[smilie--sprite2] Řekla bych, že nemá smysl se plašit. Zatím vylepšuji divy, které ovlivňují produkci živoucího a pak pojedu na kouzla."}, {"16": "@Ludi Stát na konci výzkumu je lepší - volné místo na DS a/nebo farmu studen.[BR]Samozřejmě obrovská spotřeba prošlého zboží znamená v mnoha případech papá výkupu ve věži."}, {"20": "@Lovec Krys - 1. patro Věže bývá s minimem živoucího, ve druhém ho také moc potřeba není, ale možná se to změní, až budeme o kapitolu dál. Samozřejmě, že nevylučuji, že třeba nakonec manufakturu přistavím, ale zkusím to bez ní a uvidím."}, {"146": "Mnozi píšete, že se jedná o poslední kapitolu. Kde jste k te informaci přišli?"}, {"16": "@bohusDR Poslední ve smyslu nejnovější, tzn. neznamená to, že další kapitoly nebudou.[BR]Resp. druhý význam je ten, že ten kdo je v zatím poslední (= z hlediska aktuálně přístupného výzkumu ve hře) kapitole (tzn. blízko konce výzkumu) nemá kam spěchat."}, {"184": "Chci se zeptat pro zkušené z Beta serverů, za jak dlouho se přibližně nové rasy objevují po betě na ostatních serverech? Díky ;-)"}, {"31": "@KerberosGwinblane nemožno povedať jeden konkrétny termín. Závisí to od viacerých faktorov, napríklad počet a závažnosť chýb objavených na bete. V prípade konstruktov a amuni, ak si dobre pamätám, bol odstup asi 3 týždne, čo ale v tomto prípade platiť nemusí, nakoľko tentokrát bola na betu zavedená ešte predtým, ako dosiahla finálnu verziu."}, {"155": "Zdravím, máte někdo z bety ideální rozestavění budov osadníků v té 15. kapitole v elvernarchitectu? Předem děkuji mnohokrát [smilie--sprite1]"}, {"31": "Nové divy z 15. kapitoly dostali druhé bonusy. Ich celkové bonusy sú teraz nasledovné:[BR][BR]Uskladňovací vír[BR]Spoiler: Obrázok[IMG]https://i.ibb.co/6Wt8jxR/https-media-innogames-com-com-ONYX-ZZ-announcements-elvenar-AW02res-png.png[/IMG]- zvyšuje kapacitu portálov (+6.5% na 1. leveli, +50% na 30. leveli)[BR]- zvyšuje produkciu živoucího zboží (+20% na 1. leveli, +80% na 30. leveli)[BR][BR]Fontánka mládí[BR]Spoiler: Obrázok[IMG]https://i.ibb.co/zVyfGGV/https-media-innogames-com-com-ONYX-ZZ-announcements-elvenar-AW01res-png.png[/IMG]- zvyšuje obyvateľstvo z každej obytnej budovy v meste (+5% na 1. leveli, +20% na 30. leveli)[BR]- poskytuje dodatočnú kultúru v závislosti na súčte levelov všetkých divov v meste (22.5 násobok na 1. leveli, 150 násobok na 30. leveli)"}, {"16": "@iDavis Ta produkce prošlého zboží se předpokládám sčítá? (Vír + Skok), škoda jen, že je to ze základu a ne ze základu+bonusu z relikvií.[BR][BR]Kultura do fontánky: No buď se někdy v budoucnu zvýší náklady na kulturu nebo budeme mít všichni max. kulturní bonus i bez motivací[smilie--sprite8] (i když bonus na úrovni Trůnů zase není tak moc)."}, {"31": "@Lovec Krys nemám to odskúšané, ale predpokladám že to funguje rovnako ako doteraz, teda relikvie 700%, plus percentá za časoskok, plus percentá za vír."}, {"66": "No hurá, divy budou mít druhý bonus. Takže Elvenar ještě není rozbitý. (Tak moc [smilie--sprite8])"}, {"16": "@iDavis Tak ještě tak 5 divů a vyrovná se to bonusu z relikvií[smilie--sprite8]"}, {"65": "se nám to nějak opakuje už ty divy, co zase vymyslet něco nového? [smilie--sprite1] máme kapacitu portálu (je k ničemu na konci hry) + kopii jedné vlastnosti časoskoku, pak máme propast kříženou s trůnu [smilie--sprite8] (což je fajn, další podobný div, ale proč ne něco nového?)"}, {"117": "Třeba zkrácení výroby v akademii, to by bo fajn taky... nebo % oparů navíc, nebo svitky z rozcarovanych veci"}, {"91": "Zdá se mi to, a nebo už prostě dochází nápady?"}]