[{"20": "Nějak si nejsem jistá, proč musí být na konci každé kapitoly 2 divy, když je jeden blbější než druhý. Radši jeden a pořádný. Stejně už v těchto kapitolách lidi nemají moc místa ve městě."}, {"74": "Shrnuji změnu velikosti budov:[BR][BR]Hlavní budova z 8x7 na 8x8[BR][BR]Hlavní výroby (T1) z 4x5 na 5x5[BR][BR]Dílny z 4x6 na 5x5[BR][BR]Kasárny z 5x8 na 6x7[BR][BR]Tábor žoldnéřů z 6x4 na 5x5[BR][BR]Zbrojnice = změna orientace z 4x7 na 7x4"}, {"185": "máš to zle, kasárne idu na 6x7 "}, {"16": "@Ludi No u Studánky bych to zase tak zle neviděl.[BR]Udělal jsem si výpočet a už na první úrovni mi vychází, že při mých současných rezidencích dostanu 9065 populace.[BR]Při přepočtu na pole:[BR]Obyč. obytka: 260/pole[BR]Kouzelná obytka: 446/pole[BR]Studánky: 431/pole[BR]Tedy jen o něco horší než kouzelná obytka.[BR]Poměr je procentuální, takže při vylepšených obytkách to nebude vycházet hůře, než teď.[BR]Ano, je horší než Zlatá propast (která vzhledem ke svojí velikosti nemá ve hře konkurenci) a nejspíše i horší než Horské sídlo, samozřejmě se vyplatí spíše hráčům, kteří mají ve městě poměr obytek vs. pop/kult hybridů ve prospěch obytek. Pokud má někdo místo půlky obytek pop/kult hybridy, tak se mu to nejspíše nevyplatí."}, {"20": "@Lovec Krys díky za propočet. Uvidíme, jak na tom budeme po skončení této kapitoly. Jediné, k čemu tento div může přispět, že se vymaže nějaká obytka i pop kultura a získá se tak místo. V 17 kapitole se budou obytky pravděpodobně zvětšovat a to teda bude masakr. Takže pak by to bylo řešení. Ale to už jsem v situaci, která nastane tak za rok "}, {"91": "Ludi >> No já dva divy oceňuji (klidně víc), protože to otvírá možnosti větší variabilitě, každý může postavit co se mu líbí (a naopak), a není jedno město jako druhé, když se ale divy začnou opakovat a nebo jejich výhody nedávají žádný smysl, je to spíš smutné řešení, že už není co zajímavého nabídnout."}, {"3": "já tak trochu doufám, že touhle kapitolou se uzavře jakási éra hry a pak by to mohlo jít trošku jiným směrem... "}, {"117": "Jakým? Třeba mmorog? Střílečka?"}, {"16": "Spíš je otázka, co na nás vymyslí. Asi to chvilku potvrá, pokud už alespoň základ nemají vymyšlený. Všechny jednotky vylepšené na 3*, všechny budovy s druhou funkcí.[BR]Možná nějaký úplně nový druh budovy? Otázka ale, co s těmi jednotkami."}, {"31": "Ja tiež dúfam v nejaké nové, doposiaľ neobvyklé, pokračovanie hry. Je veľa vecí, ktoré by som rád, pri prípadnom \"prelome\" videl, na ich čele je jednoznačne druhá hracia plocha, i keď vždy keď to hovorím sa cítim dosť naivne, pretože u Innogames to býva dosť neobvyklé.[BR][BR]Je samozrejme ale viacero signálov, že 15. kapitolou sa zrejme niečo uzatvára. Už minimálne jej názov, príbeh (opätovný začiatok spolupráce ľudí a elfov) a v neposlednom rade fakt, že všetky jednotky sú maximálne vylepšené. Na druhej strane mi to stále trochu popierajú manufaktury - osobne som nečakal, že sa vrhnú ešte do ďalšieho kola ich levelov (ako sa už písalo vo výskume konstruktov a manufakture na drahokamy, že to má byť jej posledné vylepšenie). A keď už začali s vylepšovaním manufaktur T1, zrejme je možné očakávať aj vylepšenia ostatných. Otázne je len, akou formou. Každopádne v kóde zatiaľ nie je o ničom takomto ani len zmienka (teda minimálne vo frontend nie)."}, {"66": "Že bychom teda začali s budoucností ala Forge of Empires? Minulost už jsme dobraly, tak od 16. kapitoly už můžem jenom do budoucnosti. Na sci-fi se mi moc nechce, mám radši medieval fantasy."}, {"65": "tak pořád to může být budoucnost jen z hlediska elvenaru, reálně budeme stále v pohádkovém středověku "}, {"66": "Jen aby pak nezačali tanky a letadla a dalekonosné rakety a za chvíli to bude sci-fi v elvenarském kabátku."}, {"16": "Goblini ve skafandrech s lasery na Marsu[BR]@iDavis To by mohlo znamenat, že na novou kapitolu si počkáme (možná i rekordní čas)."}, {"20": "Náhodou já bych uvítala vodní svět. Náznaky byly v Ráji mořských panen. Nebo svět duchů z Věže. Kosmonauti už byli [BR]A druhá herní plocha by byla úžasná"}, {"91": "Na události by se hodil nějaký div, který by trochu pošteloval a poladil náhodný generátor v událostech, ten dosavadní je otřesný a nepřející ."}, {"170": "Ví se něco o tom, zda budou někde k sehnání artefakty, např fenixe ? Nebo se jen budou do akademije dávat recepty na eventové budovy aby zabíraly vice a vice mista  a nebylo to k ničemu ?"}, {"31": "@huhukoktejl nie je vopred známe, kde sa aký artefakt objaví takže treba čakať a dúfať, že možno príde v nejakej z budúcich akcií."}, {"16": "Na betu přidali novinku pro rychlejší navigaci k prozkoumatelným a prozkoumaným(s nevyřešenými střety) provinciím.[BR][IMG]https://i.ibb.co/0JHL4hv/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-10-9-16-9-41-png-3749.png[/IMG]Druhé zleva nové tlačítko na spuštění přehledu provincií.[BR][BR]První záložka obsahující provincie, jenž lze zkoumat (vlevo informace o vzdálenosti provincie a šipka se směrem k ní, vpravo obtížnost a tlačítka na průzkum a přechodu k provincii na mapě.[BR][IMG]https://i.ibb.co/d0jvT5m/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-10-9-16-10-27-png-3750.png[/IMG][BR][BR]Druhá záložka obsahující prozkoumané provincie s nevyřešenými střety (vlevo vzdálenost a šipka se směrem k ní, vpravo počet vyřešených střetů a tlačítko pro navigaci k provincii)[BR][IMG]https://i.ibb.co/SPBzywV/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-10-9-16-11-22-png-3751.png[/IMG]"}, {"117": "jeee to je bozi"}]