[{"3": "to je a navíc, mám pocit, že minimálně na českém fóru v sekci nápadů po tom někdo volal. Takže můžeme spekulovat, že je to vylepšení na základě poptávky hráčů [smilie--sprite1]"}, {"91": "Emhyr var Emreis II >> Taky mi to tak přijde. Sice jsem nápad tak úplně nepodporoval, protože jsem si neuvědomoval jeho sílu, ale zase jestli to bude dobré, proč ne, teď bych tam měl asi skoro prázdné pole."}, {"11": "tak tohle mi tu dlouho scházelo."}, {"20": "Je to skvělé a bylo to tu v návrzích. Vlastně i podobný návrh, jako je kouzlo teleport, bylo tady kdysi ve zdejších návrzích. [BR]Jsme tu prostě vynalézaví [smilie--sprite1]"}, {"181": "A k cemu je to dobry?[BR](mozna byt nekde na zacatku, ale na konci vyzkumu to nechapu).[BR]Ted uz dlouho chodim po smeru hodinovych rucicek a co je tam za relikvii mi celkem nezajima. A vim kde jsem byl naposledy.[BR][BR]Co takhle radsi psat kdy ta provincie bude otevrena v turnaji? (mobilni klient to ukazuje)."}, {"154": "Já v tom spatruju hlavne tu výhodu, že tě to rovnou posune na tu danou provincii a nemusíš se tam ručně přesouvat přes celou mapu."}, {"11": "redking123, já vidím na počítači kdy ta provincie bude otevrena v turnaji"}, {"181": "V tom seznamu to nevidim, a hledat 23. provincii je dost na palici - a v turnaji tahle opevovana feature pouzitelne nejspis nebude.[BR]Nejjednodussi je kouknout na mobil..."}, {"91": "To je možná fakt, ale než najdu mobil, než ho zvednu, než se připojim, než nastartuju Elvenar, než se v něm pohrabu, tak to radši ztratím zájem hledat 23. provincii."}, {"181": "@Pauleo [smilie--sprite1][smilie--sprite1][smilie--sprite1][smilie--sprite1][BR][BR]Jasne, jenze event a ukol 9/45 [smilie--sprite3]"}, {"16": "@redking123 Pokud hraješ na 1 serveru s jedním městem, tak možná, ale pokud máš těch měst více, tak to užitečné rozhodně je (v každém městě máš různý počet prozkoumaných a vyčištěných provincií a jsou umístěné jinde). A s tímhle seznamem tě už vlastně ani nemusí zajímat, zda jedeš ty provincie hezky v řadě nebo ne."}, {"114": "tak na tu provinční tabulku se moc těším, odpadne mi ježdění po mapě, která rozhodně už není malá, abych našla nejlevnější provincie k otevření, takto mi to půjde snadno a rychle, nebo budu mít přehled o tom, kolik provincií celkem je možné hrát v turnaji a kolik je tedy možné nahrát turnaj bodů na konkrétní turnaj, za mě tyhle vychytávky vždy bodují [smilie--sprite8][smilie--sprite1] naposledy mě tímto způsobem potěšila tabulka co vyskakovala na ds když se jen najelo myší na ikonku s úkoly, bylo tam vidět kolik je čeho do jakého odznaku nasypáno, miluju informační tabulky [smilie--sprite8]"}, {"31": "Nová kapitola Elvenarové je už popísaná na wiki. [smilie--sprite1]"}, {"146": "JAK UZ JE TO NA WIKY TAK TO ASI NEBUDE DLOUHO TRVAT, TY NAROKY NA SUROVINY JSOU STEJNE JAK NA BETE"}, {"16": "@bohusDR Ty nároky budou nejspíše proto, abychom měli rok co dělat než vymyslí novou kapitolu."}, {"158": "Pokud to bude podobné jako u konstruktů, tak se nebojím, že to budeme hrát rok. Dávám 15 kapitole měsíc, maximálně 2 [smilie--sprite8]"}, {"16": "@Fjorgyn Brzdit budou hlavně T6 suroviny - potřebuješ jich na výzkum 5,8 milionů = 20 násobek toho, co pro konstrukty. T5 potřebuješ 1,5 milionu = trojnásobek toho, co pro konstrukty."}, {"20": "Jak jsem tak koukala na wiki ohledně poslední kapitoly, tak se mi zdá, že běžné surky už na nic nejsou potřeba - ani na vylepšování obytek. Také bude zajímavé, jestli se nějak změní výkupy v provinciích a trunaji. Není to nakonec výzva k tomu, abychom snížili výrobu T1 - T3 a posílili výrobu živoucího? Celkem s tím váhám."}, {"158": "@Lovec Krys - zbrojnice v kombinaci z pyramidou očištění dělají mraky živoucího zboží, Simia mi už preventuje rozpad na 4,6% a dál vylepšuji tento div. Časový skok zvyšuje produkci. Zatím nevidím kolik budou stát technologie, takže operuji samozřejmě jen s informacemi na wiki. Ale samotné vylepšování budov je za pakatel a ani na vylepšení radnice (portál) nejsou potřeby meziprodukty z ostatních budov osadníků, takže produkci hlavních zdrojů řeší portálové bonusy a živoucí zboží bude případně potřeba jen na placení technologií ve stromě.[BR][BR]@Ludi základními surovinami budu podporovat ostatní členy společenství [smilie--sprite2]"}, {"20": "@Fjorgyn - To je také hlavní důvod, proč se mi do toho nechce. Taky doufám, že s podporou divů, jak o tom píšeš ty, to nějak udělám. I když jsem si prohlídla požadavky ve výzkumu na betě a na wiki požadavky na vylepšení budov, tak si prostě nejsem úplně jistá, jestli mě to nakonec nedonutí další manuchu na živoucí postavit, ale nechce se mi do toho, protože nechci zbytečně zaplácnout další prostor."}]