[{"31": "Na bete sa začína..[BR][BR]Halloween[BR]Spoiler: Halloween[IMG]https://i.ibb.co/0nH05zN/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-halloween2019-forumbanner-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]Všetky detailné informácie nájdete v postupne aktualizovanom prehľade, ktorý už obsahuje aj odkaz na detaily novej budovy."}, {"66": "@Fjorgyn Ceny technologií ve výzkumném stromě jsou tady:[BR]https://tinyurl.com/y47pbv9e"}, {"11": "koukám ten dementní systém minimální kapitoly už asi bude ve všem "}, {"172": "@Fjorgyn ...tak cez portalovy zisk zisk ziskas iba manifesty a zbierky a na tachnologie potrebujes aj dalsich 8 osadnickych surovin ( pracovna sila a pod.) takze ti nestaci postavit len radnicu, ale aj ostatne budovy az na pokladnicu, kde vies uz na koniec pouzit portalove zisky...[BR][BR]...opravte ma, ak sa mylim, ale zial asi to tak bude "}, {"3": "voyager-1 napsal/a:\t\t\tkoukám ten dementní systém minimální kapitoly už asi bude ve všem Klikněte zde pro zvětšení...tipuju, že v DS ne. Tam by to dostalo už opravdu grády "}, {"16": "@Emhyr var Emreis II Hlavně by museli kompletně předělat systém odznaků (přinejmenším nemožnost 24/48h výrob manufaktur to prostě vylučuje).[BR]A představa výroby prstenů v lv 24+ manufakturách je taky zábavná (všechny 3 typy T1 24+).[BR]Bez výrazného předělání celého systému by to prostě odrovnalo všechny společenství s převahou hráčů od Elementálů nahoru (a nejen je).[BR]To už by to dobrodružství mohli rovnou zrušit."}, {"3": "Lovec Krys napsal/a:\t\t\tA představa výroby prstenů v lv 24+ manufakturách je taky zábavná (všechny 3 typy T1 24+).[BR]Bez výrazného předělání celého systému by to prostě odrovnalo všechny společenství s převahou hráčů od Elementálů nahoru (a nejen je).[BR]To už by to dobrodružství mohli rovnou zrušit.\t\tKlikněte zde pro zvětšení...Ale líbila by se mi třeba myšlenka, že by ty odznaky nedávali dokupy hráči, ale celé společenství. Tedy dřevař udělá tu dřevěnou část, ocelář tu ocelovou no a mramorník tam dovalí ten šutr. Čím víc nad tím přemýšlím, tak tím je tenhle systém zajímavější a lákavější a lépe odpovídá názvu - dobrodružství společenství"}, {"16": "@Emhyr var Emreis II A skončilo by to tak, že by to hrálo pár společenství, která by na to použila několik specializovaných měst v nízkých kapitolách a zbytek by se na to vykašlal."}, {"3": "a čím by se to jako lišilo od současnosti? "}, {"16": "@Emhyr var Emreis II Tím, že i normální hráč si může postavit pár (i desítek) budov lv 1 a v nich vyrábět odznaky. Při aplikování vysokých levelů budov už to možné nebude."}, {"114": "tak já si umím představit dělat místo 12 kovářů na 60 x 1 lvl dílnách, kováře na velké dílně jen jednoho a plnit bod na mapě místo 20 kovářů jen kováře 2 "}, {"16": "Helloweenský event asi bojkotnu. Kvůli jedné budově ty úkoly prostě dělat nebudu. Samý opar, střet, relikvie a na konci 24h dílny s vysokým lvlem, s tím ať jdou vývojáři do háje. Já si počkám na Zimní hvězdy, ty jsou stejně lepší."}, {"181": "Tak u toho DS pujdes cestou nejmensiho odporu, nebo se na nej vykasles uplne. Ono ty odmeny za poradi (a obcas i celkove) nejsou az zas takova bomba.[BR]I kdyz u nas se vzdycky rika, ze to hrat nechcem a vzdycky je to honicka o tom byt co nejvys [BR]A treba si zas nekdo vyskemra ulevu na kouzelne dilny (zacnu premyslet, jestli nejakou nemit).... "}, {"181": "A tech 32 ukolu je kde?"}, {"31": "@redking123 na zozname sa pracuje, viď. poznámka \"prehľad je vo vývoji a bude postupne aktualizovaný\"."}, {"16": "@redking123 Díky naší hráčce Elois z bety:[BR]Pozn.: Všechny úkoly na dílny a manufaktury vyžadují naše oblíbené vysoké úrovně.[BR][BR]1. Získaj mince[BR]2. Získaj nástroje[BR]3 Použi 2VB[BR]4 3x 15 minútová výroba zvýšené dielne [BR]5 Vyprodukuj určité množstvo surovín na svojej zvýhodnenej manufaktúre T1[BR]6 Získaj 4 vizionárske pary, alebo vylepši technológiu[BR]7 Získaj 2x očarovanie[BR]8 Vyrieš 7 stretnutí vo veži, alebo 7 stretnutí v provincii[BR]9 Kúp 13VB[BR]10 Získaj nástroje[BR]11 Získaj 15 relikvií[BR]12 Získaj odporne veľa mincí[BR]13 Vyrieš 35 turnajových stretnutí alebo 7 stretnutí v provincii[BR]14 Vyrob 4x chlieb  vo zvýšených dielňach[BR]15 Vyprodukuj odporne veľa surovín na svojej zvýhodnenej manufaktúre T1[BR]16. Vyrieš 9 stretnutí vo veži, alebo 9 stretnutí v provincii[BR]17. Získaj 666 fragmentov kúziel (Spell Fragments), alebo preskúmaj provinciu[BR]18. Získaj veľké množstvo nástrojov[BR]19. Použi 20VB[BR]20. Získaj 17 relikvií[BR]21. Vyrob 3x pokročilé nástroje - 3 hodinová výroba vo zvýšených dielňach[BR]22. Získaj 7 vizionárskej pary, alebo vylepši technológiu[BR]23. Vyrob 3x košík jedla - 9 hodinová výroba vo zvýšených dielňach[BR]24. Vyrob 5x produkt 3 hodinovej výroby vo svojej zvýhodnenej manufaktúre[BR]25. Trénuj jednotky[BR]26. Vyrob 4x produkt 9 hodinovej výroby vo svojej zvýhodnenej manufaktúre T[BR]27. Získaj mince[BR]28. Získaj nástroje 25%cca[BR]29. Vyrieš 50 turnajových stretnutí alebo 10 stretnutí v provincii[BR]30. Získaj 6 očarovaní[BR]31. 3x 24 hodinová výroba zvýšené dielne [BR]32. ? (bude vědět zítra)"}, {"40": "Hopla, ale mohlo to být i mnohem horší"}, {"146": "podle ukolu dekuji tvurcum ze mi usetrili cas na jine aktivity, u medvedu se urychlovace vratily zde silne v minusu a za 9 dni dve provincie nevyzkoumam. Hold hra speje k uspesnemu konci. Cekal jsem predse jen neco privetivejsiho u kratkeho eventu na jednu odmenu."}, {"181": "@iDavis Omlouvam se, lovec krys mi zmatl, myslel jsem, ze neco prehlizim (ten drivejsi prispevek LK)[BR]@Lovec Krys & @Elois Dekuju [BR][BR]A tak me vysoke urovne zas az tak nevadi, predtim to bylo o tom kolik kdo ma mista, ted se to srovnava...  Dokonce si myslim, ze to neni tak spatny napad.  [BR][BR]Tak to bude o kouzlech (odporne hodne je asi pouziti kouzla, pokud clovek nechce cekat den a dele) a zbytek se uvidi.Pouzivani urychlovacu maji jiste vsichni jiz, diky eventu, nacvicene [BR][BR]Takze, po tomhle eventu, ja se asi  tesim "}, {"158": "@citellus - pokud vidím dobře, tak v technologickém stromě, jen prvních 13 technologií může obsahovat mezi-produkty, ale pak už tam jsou jen finální suroviny, takže se mohou zbořit meziproduktové budovy a jet jen přes bonusové portály .[BR][BR]Hlavně když jsem viděl jakým způsobem je řešen systém setu, tak si nejsem jistý, jestli jsem vůbec ve městě ten nesmysl schopen postavit. Vidím to na dlouhé odpoledne nad architektem -_-..."}]