[{"5": "...ani ne prvních 13 technologií, ale ,,pouze,, 6 ......8. až 13.v pořadí"}, {"178": "Můžu se zeptat, zda někdo zaznamenal mnf výzvu? Na FB jsem o ni četl, ale na betě ani slovo, tak bych se rád ujistil, že dneska mám stavět mnf anebo ne [smilie--sprite1][BR]Díky"}, {"16": "Můj typ je, že se objeví až po eventu, možná až příští týden - ve čtvrtek dostaneme novou rasu, takže nepředpokládám, že souběžně s tím dostaneme i výzvu. Ale je to jen můj odhad."}, {"160": "Na bete byla výzva až po skončení eventu... Ale ty odmeny opet nic moc.. Hlavní odmenou byla 15 prastará vedomost.."}, {"66": "Na oficiálním facebook profilu se ptají: \"Kterou historickou epochu byste chtěli přenést z Forge of Empires do Elvenaru?\"[BR]Tak to je konec.[smilie--sprite8]"}, {"16": "Odpověď: Žádnou![BR]Epochy FOE se do Elvenaru prostě nehodí.[BR]A jestli lidi budou vymýšlet moderní nesmysly, tak přiletí elfové na dracích a všechny lidi upálí (a draci je sežerou)."}, {"181": "@Prealiena Tak prevzali Vez i ty vylepsovatelne budovy (medvedi, fenix, panny).  Jeste se mi ve FoE libila jedna mezihra, kdy jsi budoval vesnicku Eskymaku. Na extra mape, v podstate na cas... (FoE jsem hral asi 3 mesice a stale jsem si rikal WTF - proste jsem rozmazleny z Elvenaru a ve FoE mi prislo spoustu veci uplne nesmyslnych). A ani nevim kam FoE dospelo, protoze tam meli epochy od staroveku do budoucnosti.Ted uz musi byt u budouci budouci budoucnosti [smilie--sprite2] [BR]Mohli by to pojmout jako (podle me skvely) serial Zpritomneli (Beforeigners)."}, {"16": "Takže poslední úkol je naše oblíbená trojice Průzkum/výzkum/15 oparů.[BR]Já na tuhle úkolovou řadu fakt dlabu - ve všech městech."}, {"31": "Na bete prebehol update, v rámci ktorého pridali nový recept na krmení do akadémie (vyžadujúci iba úlomky kouzel). [smilie--sprite1]"}, {"186": "Jen doufám, že se sem nezavede ta blbost soubojů mezi hráči. PVP mě osobně fakt nebaví."}, {"16": "@Daggoth32 Myslím, že ne, to by nezkousla příliš velká část hráčů Elvenaru.[BR]A znamenalo by to překopat nemalou část hry.[BR]Ale zase, kdyby se vývojáři zbláznili a implementovali to, tak by nějaká nová hra měla perspektivní velkou hráčskou komunitu připravenou hrát novou hru[smilie--sprite1]"}, {"117": "nikdo by nesel hrat od nuly nejakou hru, kde je pvp a kde jsou hraci v 15. kapitole, coz je rok a pul hrani, ne-li vice... do te doby by byli stale pod palbou silnějších hracu a to by dlouho nikoho nebavilo"}, {"17": "Prealiena napsal/a:\t\t\tNa oficiálním facebook profilu se ptají: \"Kterou historickou epochu byste chtěli přenést z Forge of Empires do Elvenaru?\"[BR]Tak to je konec.[smilie--sprite8]Klikněte zde pro zvětšení...Daggoth32 napsal/a:\t\t\tJen doufám, že se sem nezavede ta blbost soubojů mezi hráči. PVP mě osobně fakt nebaví.\t\tKlikněte zde pro zvětšení...Nemusíte se bát, nic z výše uvedeného (tj. historické epochy a ani PvP boje) do hry opravdu přidat neplánujeme. [smilie--sprite2]"}, {"16": "No ale třeba by se přišlo na to, že orkové jsou vlastně Marťani. (Tuším, že snad nejnovější kapitola ve FoE by měla být kolonizace Marsu).[BR]Takže už to vlastně máme splněno[smilie--sprite8]"}, {"181": "Tak jsem si udelal ucet na bete a zacal hrat od zacatku. Tak jako abych mel \"prst na tepu doby\" [smilie--sprite2] (na winyandoru jsem na konci vyzkumu).[BR]No a dospel k nazoru, ze ta nova feature \"show provincies overview\" je celkem nedotazena. [BR]Na prvnim tabu (scoutable) mam provincie kam muzu poslat pruzkum. No dobra,  je tam i vzdalenost a smer, coz bych rekl je irelevantni udaj, obtiznost a typ relikvie, fajn. Na druhem tabu (incomplete) mam kam muzu poslat vojaky nebo vyjednavat. Jenze tam uz chybi info o obtiznosti, co je udaj, ktery je zasadni. Kdyz uz to mam pouzivat, tak potrebuju vedet jestli jdu do zelenych nebo zlutych (nebo jeste tezsich).[BR][BR]viz https://cz.forum.elvenar.com/index....ta-serveru-spoilery.2206/page-135#post-103090"}, {"16": "@redking123 Na začátku prostě můžeš použít mapu přímo a nový přehled si nechat na později.[BR]Ale ano, mohli by tu obtížnost přidat i na tu druhou stránku."}, {"11": "nikde není psáno že se to brzy nevylepší, stále je to jen Beta."}, {"159": "V minulosti jsem hrál podobný počin (Travian), kdy přes den jste něco vytvořili a přes noc o to přišli, jen doufám, že tudy to nepůjde !   ....delete"}, {"3": "jo travian… mělo to svoje kouzlo, ale RTSky jsou náročné (především časově). To drancování okolí ale bylo super [smilie--sprite8] Jeden ročník jsem odehrál a s naší aliancí jsme skončili druzí snad jen o 5 hodin (po roce hraní!) proti mnohem silnější alianci. Nikdy nezapomenu.[BR][BR]Hlavně na to odbíhání z přednášek na internet, abych zadal útok nebo výrobu. Ještě že na chodbách byly PC Kiosky [smilie--sprite8]"}, {"181": "@Emhyr var Emreis II  ja mel tu kliku, ze jsem se dostal do aliance, ktera ten server vyhrala. Celou vecnost budujes armadu, abys ji pak v pikosekunde rozmlatil o nepratelsky div. Ale uz bych to hrat fakt nechtel. Byli tam lidi, co to hrali na regularni 3 smeny a stridali se u kompu po 8 hodinach. A jinak to byla takova hra, kde bud jsi delal nestastny lidi kolem sebe, nebo jsi byl nestastny sam. Byl tam hrac, co mel v patek 8 mest a v nedeli vecer uz jen 1 (posledni se prevzit nedalo). Z toho jsme meli vsichni i trosku spatny pocit (byli jsme spolecenstvi hodne dravych lidi). Tedka uz davam prednost pohodovemu staveni domecku, coz je vec ktera v travianu dost dobre nesla."}]