[{"16": "Já využil ke konci svého hraní travu možnost odstěhovat se do pustiny. Tam na mne nikdo neútočil (všichni byli moc daleko). Stačilo obětovat první vesnici.[BR][BR]Ale to jsme dost OT.[BR]PvP můžem uzavřít, máme oficiální vyjádření, které zůstane v platnosti (leda by se vývojáři časem zbláznili vzhledem ke složení hráčské populace)"}, {"3": "mě na tom nejvíc bavilo to vykrádání a právě přebírání. Jsem škodič od přírody [smilie--sprite8]"}, {"31": "Najbližšia výzva (manufaktury) je v tejto chvíli naplánovaná na sobotu 19.10."}, {"11": "co je tam za odměny, jestli to má cenu hrát?"}, {"16": "@voyager-1 Pár desítek VB, počítají se i manufaktury lv1."}, {"90": "A počítají se všechny manufaktury, nejen ty bonusové - takže tím mizí nevýhoda mít lvl1 bonusové 2x2 a ne 2x1.[BR][BR]Odstraněna citace. Embla"}, {"117": "To se počítaly všechny manufaktury vždy u výzvy"}, {"11": "počítaly se bonusovky, libovolné jsou poprvé."}, {"117": "tak proč se mi počítaly i ty manufaktury, ve kterých mám živoucí? pamatuju si to proto, že 9h živoucího dávalo stejně bodů jako 48h obyč..."}, {"19": "Libovolné manuchy se počítaly poprvé při minulé výzvě."}, {"11": "že by poprvý minule? No možný to je."}, {"117": "mohl by to rozlousknout nekdo z elvenar tymu, protoze dle me to jde od zacatku, minulou vyzvu jsem nehrala vůbec a vim, ze se to resilo uz pri prvni vyzve s manufakturama, ze mame vyhodu ti, co mame manu na zivouci, ze to dava za 9h zivouciho stejne jako za 48 na nizsim lvl"}, {"11": ".koukal jsem po foru, první výzva s budovami byla v květnu a už byla o libovolných manu. Kolikátá je od tý doby tahle se mi hledat nechce. Tak jsi měla pravdu [smilie--sprite1]"}, {"187": "Vzdy se pocitaly libovolne ve výzvě, akorat každý staví ty meněi že?"}, {"91": "Dodheimsgard >> Libovolné jo, ale manufaktury co nemají 24h a 48h počítají obživlé suroviny za 3h a 9h jako za 24h a 48h, je to dost výhodné u bežné obživlé výroby, kdo jí nemá tu možnost nemá."}, {"2": "takouvou manuifakturu mám jednu, tedy dohromady 3[BR]to v tom celkovém počtu snad není tolik aby to někdo hrotil"}, {"44": "Ahoj,[BR][BR]máte někdo někdo úkolovou řadu pro novou rasu, respektive jde mi o to, kolik budov potřebuji ke splnění všech úkolů. [BR][BR]Děkuji"}, {"11": "https://elvengems.com/the-elvenar-preview/#settlement"}, {"31": "V tejto chvíli naplánovaný termín úkolovej línie Dr. Šraňkenstein nájdete uvedený v kompletne pripravenom prehľade."}, {"188": "@iDavis vážně tam je vyrob 666 úlomků kouzel? [smilie--sprite8][BR]To číslo mi něco připomíná. Že by se dr. Šraňkenstein spojil s ďáblíkem. [smilie--sprite9][smilie--sprite8][BR][BR]jo a úkol 29.....50 turnajových střetů? to fakt jo?[smilie--sprite10]"}]