[{"63": "GorGlin napsal/a:\t\t\ttak to maj štěstí že požehnání vyměnili za relikvie, jinak by od tebe dastali co proto[BR][BR][BR]kdo ti tvrdil že nahradili VBčka?\t\tKlikněte zde pro zvětšení...:-D někde jsem to četla... ale je super, že to tak není!! Jsem spokojená [smilie--sprite7]"}, {"65": "už aby to bylo, už se nemůžu dočkat [smilie--sprite1]"}, {"31": "Elvenar dnes vysielal naživo a prikladám pár informácií, ktoré boli spomenuté v...[BR]Q&A vysielaní 5.10.2017[BR][BR]Spoiler: Q&A vysielanie 5.10.2017Nová rasa[BR]V súčasnosti plánujú naraz niekoľko nových vecí a musia sa rozhodnúť, v akom poradí ich zavedú. Avšak snažia sa uprednostniť tie, ktoré budú dostupné pre širší okruh hráčov a teda nakoľko sú na konci 11. kapitoly približne 3% hráčov, na novú kapitolu si ešte chvíľu počkáme. Podľa príspevku od Marindora ktorý som čítal, by mala prísť pár týždňov po skončení jesennej udalosti.[BR][BR]Mobilná aplikácia[BR]Aké pokroky vo vývoji mobilnej aplikácii urobili zatiaľ neprezradili, ale vraj už o pár dní vydajú oznámenie, z ktorého sa isto dozvieme viac. [smilie--sprite2][BR][BR]Dobrodružstvá spoločenstiev[BR]Potvrdili, že do konca roka sa určite dočkáme ďalšej udalosti pre spoločenstvá Dobrodružstvá spoločenstiev a nemalo by to byť už príliš ďaleko.[BR][BR]Rozšírenia v odmenách[BR]Padla otázka či by sa mohli vyskytovať rozšírenia ako odmeny, napríklad v udalostiach. Timon vysvetlil, prečo to nie je možné. Je to logické, hernú plochu máme šírkou aj dĺžkou presne vymedzenú, do ktorej presne zapadajú rozšírenia, ktoré získavame z provincií, výskumu a za diamanty, teda ktoré máme všetci dostupné. Ak by pridali rozšírenia ktoré by získala iba určitá časť hráčov a druhá by viac nemala tú možnosť, narušil by sa tento systém, teda buď by niekomu dostupné rozširenia prevyšovali maximálny počet rozšírení na plochu, alebo by nemal ako dokončiť nejaký z \"pásov\" rozšírení.[BR]Link na video[BR][BR]Edit 17.10.: Podľa odpovede Marindora na beta fóre na otázku, kedy bude spustená mobilná verzia nás delí už iba niekoľko týždňov. [smilie--sprite2]"}, {"31": "Temnota noci a zlých čarodejníc zasadá do Elvenaru...[BR]Halloween[BR][BR]Spoiler: Halloweenska akce (Halloween event)[IMG]https://i.ibb.co/PYbftnG/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-halloween2017-Banner02-png.png[/IMG][BR]Na obzore je strašidelná úkolová rada - Halloween 2017. Predpokladaný začiatok je 27.10. a koniec 7.11.[BR][BR]V tomto spoileri budem o nej dopĺňať jednotlivé informácie.[BR][BR]Úkolová sada obsahuje 32 úloh.[BR][BR]Spoiler: Úlohy1. Vyrob 13x nápoje[BR]2. Kúp 1 VB[BR]3. Vyrob 7x jednoduché nástroje[BR]4. Presuň 1 budovu[BR]5. Získaj desivo malé množstvo mramoru[BR]6. Získaj desivo malé množstvo ocele[BR]7. Získaj desivo malé množstvo dreva[BR]8. Vyrob 3x chlieb[BR]9. Vyrob 7x produkt základnej bonusovej manufaktury (3-hodinový)[BR]10. Vyrob 5x produkt základnej bonusovej manufaktury (9-hodinový)[BR]11. Vyrob 1x produkt z každej základnej manufaktury (3-hodinový)[BR]12. Vyrob 1x produkt z každej základnej manufaktury (9-hodinový)[BR]13. Utrať 25 VB[BR]14. Kúp 17 VB[BR]15. Získaj 19 relikvií[BR]16. Vyrob 4x produkt základnej bonusovej manufaktury (24-hodinový)[BR]17. Získaj 3 ľubovoľné kúzla[BR]18. Získaj nejaké množstvo krvavých mincí[BR]19. Trénuj 300 vojakov[BR]20. Vyskúmaj 1 technológiu ALEBO vylepši 1 budovu na level 20 alebo vyšší[BR]Ako odmeny nás čakajú tieto nádherné strašidelné budovy:[BR][BR][IMG]https://i.ibb.co/3cbsM9P/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-halloween2017-Reward01res-png.png[/IMG][BR]Evil Windmill (4x3)[BR]- kultúra/obyvateľstvo:[BR]I: 220/220[BR]II: 260/250[BR]III: 310/300[BR]IV: 360/350[BR]V: 410/400[BR]VI: 500/490[BR]VII: 650/630[BR]VIII: 780/760[BR]IX: 1470/1430[BR]X: 1800/1740[BR]XI: 2200/2100[BR][BR][BR][BR][IMG]https://i.ibb.co/g7Wmqx4/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-halloween2017-Reward02res-png.png[/IMG][BR]Haunted Graveyard (3x5)[BR]- kultúra:[BR]I: 830[BR]II: 950[BR]III: 1150[BR]IV: 1330[BR]V: 1510[BR]VI: 1860[BR]VII: 2400[BR]VIII: 2900[BR]IX: 5400[BR]X: 6600[BR]XI: 8100"}, {"62": "Nádhera, tak na to se opravdu těším [smilie--sprite8]"}, {"43": "Tý jo,to jeden velký event skončí a za pár dní další akce...Kam to vše mám dávat,když mám v pytli budovy s podzimní a ještě před tím akce.To by také chtělo nějaké místo navíc... [smilie--sprite8] [smilie--sprite1][BR]Ale vypadají ty budovy pěkně."}, {"61": "paráda, jen jsem trochu naštvanej, že jsem v osmý kapitole bo v devátý je to vždycky výrazně lepší [smilie--sprite8]"}, {"66": "To v té akci bude opravdu jenom 10 úloh?"}, {"31": "@Prealiena nie, postupne ich tam dopisujem. [smilie--sprite2] Malo by ich byť 32."}, {"50": "Díky moc @iDavis, vypadá to moc hezky [smilie--sprite1]. Jsem překvapená, že z jednoho eventu přejdeme do druhého, za mě palec nahoru, lepší než Dobrodružství společenství, které mně osobně přijde sice jako hezký nápad, ale hodně náročný pro zúčastněné [smilie--sprite11][smilie--sprite12]."}, {"67": "Vypadá to dobře, budovy vypadají mnohem lépe (dle mého názoru) než ty z loňského roku, které byly tak trochu pěst na oko.[BR][BR]Akorát mi přijde trochu zarážející, že Sněhový hrad, který jsem získal v zimní události, má taky rozměr 4x3 a dává 2200 kultury a 2200 obyvatel, tj. je o fousek lepší než budova, která nás čeká teď [smilie--sprite1] Na druhou stranu, Sněhový hrad byl druhá hlavní odměna ve velkém, více jak měsíc dlouhém eventu, tohle je krátkodobější, tak tam bývají ty odměny o fous slabší. Nicméně je to stále lepší než cokoliv z výzkumu, takže proč ne [smilie--sprite1]"}, {"28": "Já mám čím dál tím větší problém tyhle budovy z malých eventů, které mají horší bonusy jak budovy z velkých eventů, umisťovat. Místo navíc pro ně nenajdu a vyměňovat je za něco, co je lepší je nesmysl. Vždyť ten větrný mlýn je ještě horší jak sněhový hrad, co mám z loňské zimy [smilie--sprite12] Se do toho eventu snad ani pouštět nebudu."}, {"66": "Také si říkám.[BR]Dračí matka, v porovnání s mlýnem, dává ve třetí kapitole stejné množství obyvatel a má ještě lepší kulturu.[BR]Liší se akorát orientací.[BR][BR]Eldrasilská vesnice, na kterou již dosáhnu, mi dá stejně kultury, jako hřbitov a ještě k tomu obyvatele, i když je větší. Navíc Sférický pařez z druhé kapitoly dává stále více kultury než hřbitov a je jen o čtvereček větší.[BR]Jediný důvod pro stavbu hřbitova by bylo účelové zabrání prostoru dokud si nenašetřím runy na Jehly bouře.[BR](Ale já zrovna volným prostorem neoplývám [smilie--sprite1])"}, {"68": "tomu, kdo vymyslel úkoly nakup x VB bych nejraději vydloubal oči. Event vynechám, jak psala Thespia, budovy jsou (alespoň pro mě) k ničemu. A tak by mi to vyždímalo mince, které ani nemám... Zase ale oceňuji snahu oživit hru [smilie--sprite1]"}, {"66": "Jj, zlatej podzimní event a jeho úkoly: Nakup X VB nebo vyřeš X střetů.[BR]To mohl člověk dát za pár dní, i když to bolelo u jednotek i surovin.[BR]Ale stále se mohl vyhnout tomu nekonečnému zdražování VB při nákupu.[BR][BR]Schválně kdo má nejvyšší cenu pro nákup VB?[BR]Dost by mě zajímalo, kolik za to platí pokročilý hráči."}, {"62": "Prealiena napsal/a:\t\t\tSchválně kdo má nejvyšší cenu pro nákup VB?\t\tKlikněte zde pro zvětšení...[BR]Já jsem momentálně na 285000 za 1 VB [smilie--sprite1]"}, {"67": "@Prealiena: Já třeba potřebuji 895 000 mincí, 6520 ocele, 6100 křištálu či 4000 elixíru.[BR]Ale ono nejde o to, jak jsi vyspělá a pokročilá - jde o to, kolik Vb už jsi touto cestou nakoupil/a. S každým nakoupeným VB se ti cena zvýší.[BR]Mezi náma ale nevidím v tomhle problém... Pro mne je tento úkol mnohem jednodušší a pohodovější, než \"vyřeš 20 střetů\" apd... Na to si musím provincie šetřit [smilie--sprite1]"}, {"68": "jak střety, tak nákup VB je z mého de....ita. Eventy by měly být pro zpestření a né proto, aby si člověk uměle zvyšoval cenu VB a nakonec mu nezbylo nic, než takové úkoly plnit za diamanty, nebo se s eventem rozloučit."}, {"67": "Nikdy jsem k těmto úkolům nepotřeboval diamanty teda... A umělé zvedání ceny? Vždyt prostě jen místo toho, abys je koupil později někdy, tak je koupíš teď. Nic uměle nezvedáš, prostě je jen kupuješ teď.[BR]Popravdě, kdyby vývojáři akceptovali všechny podobné stížnosti lidí, tak by se v eventu opakovalo asi pět úkolů a bylo by to pěkně nudné."}, {"66": "Ashen napsal/a:@Prealiena: Já třeba potřebuji 895 000 mincí, 6520 ocele, 6100 křištálu či 4000 elixíru.[BR]Ale ono nejde o to, jak jsi vyspělá a pokročilá - jde o to, kolik Vb už jsi touto cestou nakoupil/a. S každým nakoupeným VB se ti cena zvýší.[BR]Mezi náma ale nevidím v tomhle problém... Pro mne je tento úkol mnohem jednodušší a pohodovější, než \"vyřeš 20 střetů\" apd... Na to si musím provincie šetřit [smilie--sprite1]Klikněte zde pro zvětšení...[BR]Njn, já jsem spíše spořivý typ. Nechce se mi platit, když nemusím.[BR]Ale možná musím k tomuto stylu hraní dospět.[BR][BR]Co jsem tady četla 72 hodin na průzkum provincie a asi 10 provincií na jedno rozšíření.[BR]To mě dost děsí, co mě bude čekat s postupem ve hře."}]