[{"15": "Děsný ,co ? No uvidím , co si na nás vymyslí příště . Asi už jim docházejí nápady .  [BR]"}, {"91": "Tak hlavně ať to zase není mimo turnaj, to je pak nehratelné."}, {"3": "tak to už záleží na tobě, kdy se k tomu úkolu dostaneš "}, {"5": "Nataly : 50 turnaj střetů je 12,5 turnaj. provincií...myslím lehce zvládnutelné i pro menší města."}, {"91": "Emhyr var Emreis II >> No právě, už zase dva dny čekám na turnaj s úkolem, který nedokážu vyřešit."}, {"157": "Taky čekám na turnaj, 1. hvězda a 12,5 provincií je v pohodě, pokud taky neřešíš relikvie turnajem, ale na dalších hvězdách to tak úplně v pohodě být nemusí, a to i v pokročilých kapitolách, kdy po několika vylepšeních velikosti oddílu, které se déle pufrují vylepšením divů nebo jednotek....."}, {"31": "Správy v mobilnej verzii[BR][BR]Spoiler: Správy v mobilnej verziiNa bete sa konečne začína test dlho očakávanej funkcie posielania súkromných správ v mobilnej verzii hry.[BR][BR][IMG]https://i.ibb.co/3CnD63p/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-mobilemessages-mobilepm-png.png[/IMG][BR][BR]Údajne sa jedná o komplexnú funkciu a zdôrazňujú záujem o čo najväčší počet rôznorodých testov, takže implementácia na náš server zrejme ešte nejaký čas potrvá."}, {"130": "Zprávy budou supr a ještě by mohli udělat vkládání VB do Divů ostatním hráčům z mobilu.[BR]Neví někdo na kdy se chystá další Dobrodružství společenství nebo další Event ?"}, {"31": "@KFIV dobrodružstvo bude zhruba o 2 týždne."}, {"123": "ahoj,nevíš jestli budou chtít dílny a manu jako u eventů 3 kapitoly zpět ?,díky za odpověď [BR][BR]Odstraněna citace. Embla"}, {"31": "@lenka roudnice nie, pre dobrodružstvá je dostačujúca akákoľvek úroveň budov."}, {"66": "A nebyla na betě zase nějaká výzva?"}, {"16": "@Prealiena Byla - tuším že minulý týden - ta samá, co předtím (35VB celkem)."}, {"90": "iDavis napsal/a:@KFIV dobrodružstvo bude zhruba o 2 týždne.\t\tKlikněte zde pro zvětšení...Dobrodružství společenství na betě už dnes začalo podle schématu D(=4), který byl už v létě a loni v září. Žádná změna, jen odměny. Na první mapě směšné: knihovna a dvě požehnání na VB. Dál zatím nevidím."}, {"16": "@ElfMaGorr Na odměny se můžeš podívat na všechny kola, co nejde vidět, jsou nároky na jednotlivé cesty v dalších kolech, pokud jsi do nich nepostoupil.[BR]Ve druhém a třetím kole je po jedné medvědí hlavě, nějaké VB a ve třetím 1x20h urychlovač."}, {"160": "U nás se pojede stejná mapa jako na bete? Nevíte nekdo?[BR][BR]A ješte mám otázku, najdu nekde celou tu mapu dobrodružství?[BR][BR]Příspěvky sloučeny. Embla"}, {"158": "@Slniecko  Na elvengems bývají pravidelně zveřejněné všechny potřebné informace. Zatím tam je jen oznámení, že se to na betě objevilo, ale přesné informace ještě nejsou uvedeny, takže vydrž ."}, {"181": "Odmeny jsou [BR]1. knihovna (dava 100dni 1VB/den, 10VB, 15VB)[BR]2. 15VB, Medvedi hlava, 20VB[BR]3. 20h urychlovac, Medvedni hlava, 15VB[BR][BR]vetsinou je to stejne.[BR][BR]mapy jsou ruzne, vesmes predelane do tabulky, nekde tady na foru bude sekce dobrodruzstvi spolecenstvi a tam ta spravna bude ."}, {"90": "Slniecko napsal/a:\t\t\tA ješte mám otázku, najdu nekde celou tu mapu dobrodružství?\t\tKlikněte zde pro zvětšení...Jsou to stejné úkoly jako byly v létě - tj. schéma D (=4). Celkový přehled úkolů je na elvengems.com, zatím jen poznámkou pro to staré DS."}, {"160": "Dekuju  Už jsem to tam našla, tak uvidíme časem, jestli to nejak zmení "}]