[{"28": "ElfMaGorr napsal/a:\t\t\tDobrodružství společenství na betě už dnes začalo podle schématu D(=4), který byl už v létě a loni v září. Žádná změna, jen odměny. Na první mapě směšné: knihovna a dvě požehnání na VB. Dál zatím nevidím.\t\tKlikněte zde pro zvětšení...[BR]125 VB za první, tj. tu nejjednodušší mapu DS, je pěkná odměna [smilie--sprite1]  Bývalo tam těch VBček za první mapu daleko méně. Pro mě osobně je to i lepší jak dvě useless medvědí hlavy."}, {"3": "bych chtěl vidět, kdo z knihovny fakt vytáhne těch 100VB. Když má člověk kliku a čas, tak je schopný dát něco kolem 90..."}, {"66": "@Lovec Krys No právě a bude nejdřív výzva nebo dobrodružství?[BR]A proč musí být všechno naráz hned po sobě?[smilie--sprite12]"}, {"16": "@Prealiena Dle iDavise má být dobrodružství přespříští týden (+-), takže tipuji, že nejdříve výzva a pak dobrodružství, případně pár dnů pauza mezi nimi.[BR]No já měl teď 2 týdny eventovou pauzu[smilie--sprite1]"}, {"31": "Pozrel som sa na to a vypadá to nasledovne:[BR]Dobrodružstvo je v tejto chvíli naplánované na pondelok 18.11.Výzva (manufaktury) je v tejto chvíli naplánovaná na utorok 12.11.[BR]Takto je to aktuálne pre túto chvíľu, môže sa to samozrejme zmeniť (najmä v prípade dobrodružstva, ktoré je až na ďalší týždeň a dovtedy stihne prísť aktualizácia na ďalšiu verziu, ktorá to môže o nejaký čas posunúť)."}, {"90": "iDavis napsal/a:Dobrodružstvo je v tejto chvíli naplánované na pondelok 18.11.Klikněte zde pro zvětšení...Nevím, nějak mi to přijde brzo - na beta to začalo včera a málokdy je to na live dřív než za dva týdny."}, {"2": "Tak samozřejmě to vyžaduje určité plánování, ale já stavím knihovny tak, abych z nich těch 99 možných VBcek dostal"}, {"11": "hlavně se nikde nepíše,pokud jsem se nepřehlíd, že knihovna dá 100 VB, píše se že každých 24 hod. dává jeden. Kolik to znamená v reálu záleží na schopnosti nebo neschopnosti hráče."}, {"31": "Aktualizácia tabuliek[BR][BR]Prednedávnom došlo k zmene (dizajnovej aj technickej) štruktúry fóra. Nanešťastie sa spolu s týmto viazali aj isté zmeny v nastavení BB kódu, čo malo negatívny dopad na vzhľad tabuliek v téme Speciální budovy. Zmenilo sa vlastne to, že tabuľky sa v novej verzii zobrazujú tak, aby zabrali celú šírku príspevku, namiesto dovtedajšieho prispôsobovania sa reálnej šírky jej stĺpcov. Z tohto dôvodu som sa rozhodol tabuľky upraviť a to tak, aby lepšie vyzerali v novej štruktúre fóra. Súčasťou aktualizovaných tabuliek sú:[BR]doplnené údaje k všetkým aktuálnym kapitolám (teda tabuľky obsahujú 15 kapitol)zmenená štruktúra tabuľky - vymenené riadky so stĺpcami (kapitoly sa po novom zobrazujú po stĺpcoch a jednotlivé produkcie sú vypísané v riadkoch) - toto je nevyhnutné riešenie kvôli vyššie spomínaným zmenám v BB kóde, ale som za to, že táto \"opačná\" štruktúra má zase svoje výhody (napríklad zmenšená celková dĺžka príspevku a tak možnosť zobrazenia celej tabuľky k jednej budove naraz)Zmeny sa zatiaľ vzťahujú iba k zimným budovám (zo začiatku témy Speciální budovy), ktoré sa môžu objaviť v nadchádzajúcej zimnej udalosti. Zmeny sa samozrejme budú týkať aj všetkých nových pridaných budov (tabuľky nových budov nadchádzajúcej zimnej udalosti už mám pripravené a objavia sa v téme so začiatkom udalosti na bete).[BR]Ostatné tabuľky budú aktualizované postupne neskôr."}, {"31": "Zima a vianočné pečenie prichádza na betu.. [smilie--sprite1][BR]Zimná udalosť[BR][BR]Spoiler: Zimná udalosť[IMG]https://i.ibb.co/sQjL910/https-i-ibb-co-s3510g-J-EL-akcia-zima-2019-banner-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]Udalosť obsahuje celkom novú mechaniku, ktorá nahrádza doterajší systém rotujúcich truhiel.[BR][BR][IMG]https://i.ibb.co/9r077H7/https-i-ibb-co-Jr5v-Bx-Y-EL-akcia-zima-2019-plocha-mobil-mal-jpg.jpg[/IMG][BR][IMG]https://i.ibb.co/xXPD9HJ/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-winter2019-shufflemechanic1-png.png[/IMG][BR]Všetky detailné informácie nájdete v novom prehľade udalosti a tabuľky nových budov v Speciální budovy."}, {"66": "Teda, netušila jsem, že to někdy bude tak vážné, ale ta mechanika je přímo kopie Forge of Empires.[BR][BR]Nemohli bychom mít něco originálnějšího? Ať to vypadá jako dvě samostatné hry."}, {"16": "@Prealiena To, že to je kopie, by mi ani tak nevadilo. Ale to, že denní odměna je jenom jedna ze 16 beden a že mnohé další dárečky jsou absolutní odpad (asi nejkřiklavější příklad je 1!! relikvie), to už mi vadí hodně. A také to, že nám byla sebrána možnost alespoň nějak ovlivnit, co z eventu dostaneme. Někdo to trefně nazval \"Slot machine\" - Automat na mince.[BR]Je sice předčasné hodnotit dle prvního dne, ale pokud se to dost neupraví, tak celý event je z hlediska odměn prostě demotivující. Proč se nějak snažit, když za to stejně dostanu akorát odpad, co nechci.[BR][BR]ps: Tak je tam ještě jedna absolutně odpadní cena - 1 runový úlomek - Ano, to všichni chceme dostat za 60 eventové měny."}, {"20": "Ach jo, takže to vypadá, že nám udělali utrum se studnama ...[smilie--sprite5]"}, {"16": "@Ludi Nejen s nimi, vlastně se vším. Spousta hráčů se nejspíše na celý event vykašle, když za své úsilí dostane většinově jen absolutní odpad."}, {"160": "Ty jejich eventy jsou čím dál tím smutnejší.. Minule to byl krok vedle s úkolami a tedka je to úplna katastrofa s odmenami.. Kde jsou ty eventy, které sloužili na to, aby jsem si v nich nasbírala cenné odmeny, které pomohly mému mestečkuu.. To co delají je čím dál, tím horší  a horší a vážne me to prestáva bavit... Dobrodružství je porád o tom samém - žádne zlepšení s odmenami pro společenství které do nich investujou spoustu času [BR]Eventy jedna velká katastrofa z puvodních eventu, které byli spravedlivé a hratelné a odmeny byli získatelné pro každého +- stejne se tedka staly eventy které nejsou úkolami a už ani odmenami spravedlivé.. Je to smutný.. Radši vratte puvodni znení eventu - pevná sada úkolu a hotovo, to byla asi ta nejlepší varianta a ješte tohle vykrádaní z jiné hry.. Docházejí nápady? Nekdo v tímu trpí syndromem vyhorení nebo co? Tak je potrebné obmenit asi členy tímu a vzít nejakou novou krev, která do této hry prinese konečne nejaké pozitívni zlepšení a ne aby to byla čím dál vetší katastrofa [smilie--sprite8]"}, {"31": "Nedoporučujem porovnávať túto udalosť s podzimním zvířetníkom ani morskými pannami - tieto dve udalosti boli príliš mimo balansu hry (inno na nich testovalo nový systém úloh) a vysoko nad tým, čo by mala adekvátna udalosť ponúkať.[BR]Na druhej strane, ak porovnáme zimné kúzlo s udalosťami pred tým (s konečným počtom úloh), sme na tom dostatočne dobre."}, {"11": "no, ty denní odměny budou scházet, hodně hráčů se zaměřilo na studně, VB nebo urychlovače, to ted nepůjde pokud event správně chápu."}, {"16": "@iDavis No zatím hodnotím jenom dle začátku, ale tu změnu v denních odměnách vnímám hodně negativně. V podstatě namísto soustředění na to, co chci mám tupý automat na štěstí, ze kterého budu často dostávat absolutní odpad.[BR]Kdysi jsem generoval např. manu 12 žhavými jezírky (dlouho před posledními eventy), to mi v současném systému připadá nemožné získat (bez extrémního štěstí). Za to místo toho získám kupu odpadu, který vyjde stejně, jako kdybych tu eventovou měnu házel do koše.[BR]I kdyby se příjem eventové měny časem vyrovnal na nějaká rozumná čísla, stále to podle mne znamená, že denní odměny v první půlce eventu jsou velmi obtížně získatelné.[BR]No a hlavní odměna je opět odpad, který nemá cenu stavět (stejně jako Stonehenge a Panny). Ani pořádná popka, ani pořádná produkce VB, ani pořádná produkce surovin (T2), ale od všeho trochu, takže k ničemu.[BR][BR]Začínám si říkat, kolik takových negativních změn ještě unesu, než se dostanu do stadia, kde jsou teď jiní hráči, kteří vážně uvažují, že s hrou praští."}, {"11": "Ráj zas není takovej odpad. Nahrazuje jednu T1 na menší ploše, k tomu 3VB a trocha ostatního. Po blížícím se navýšení T1 trochu oslábne."}, {"20": "Souhlas, že Ráj a Stonehenge nejsou zase tak špatné budovy. Navíc bylo snadné je získat a napakovat se i na denních odměnách, takže to byly celkem dobré eventy. Nová zimní budova v mě nebere, protože mám lepší ze setu ze starého eventu. Možná to někomu ale přijde vhod. Jenže způsob získávání denních odměn je opravdu divný. Koukla jsem na betu - no nic moc. Vypadá to, že v Inno propustili dobré vývojáře ... [smilie--sprite5]"}]