[{"11": "Stonehenge se mi nějak nelíbil, tam je myslím 48hod. cyklus"}, {"16": "Kdyby ta produkce byla dvojnásobná, tak bych souhlasil, ale takhle mi za to prostě nestála.[BR]Tak relikvie jsou dokonce 3 namísto 1. Tak možná 50 by bylo pro některé hráče s nedostatkem relikvií užitečné, ale 3 jsou výsměch."}, {"20": "V podstatě hlavní odměna nemusí být vždycky něco úžasného, komu se hodí, tak ji postaví a komu ne, tak nechá být. Jenže od toho tu vždy byly slušné denní odměny, kde se dalo něco vybrat. Ale s tímhle systémem klikání na balíčky si nejsem jistá, jestli se vůbec něco podaří získat."}, {"3": "tak, na druhou stranu, jestli to dobře chápu, tak mezi balíčky je šipka pro protočení odměn a lupa... takže nebude třeba vždy otevřít všech 16, aby člověk dostal to, co chce. Protočí a znovu [BR][BR]Bude to boj, na druhou stranu by to mohlo být alespoň trošku náročnější na mozek, než jen bezduché točení truhel a čekání "}, {"16": "@Emhyr var Emreis II Nebo to taky může znamenat, že než dostaneš co chceš, tak se ti to prohodí na dalších 16."}, {"160": "Nikdo nerekl, že se ti tu šipku podarí získat na první pokus že  A když ti ten skvelý náhodný systém po protočení hodí ješte vetší odpad než jsi tam mel, tak to taky nebude žádna sláva..   Noo, bude to víc nervu u hry..[BR][BR]Jako už na tý bete mne to celkem štve a to tam je ten event od včera.. Ani nemám chut se tam hlásit.. Asi si proste pojedu svoji výrobu a když se mi podarí získat nejakou mašli, tak to náhodne protočím.. Ale získat nejakou denní odmenu bude zázrak.. A pro malé hráče byli práve ty denní odmeny dobré, protože to hodne pomohlo posunout se dál ve hre, nebo získaním ruznych odmen se šlo líp posouvat.. Pokud tenhle systém odmen neprojde opet nejakou zmenou k lepšímu,tak se u toho nebudu rozčilovat, moje štestíčko není tak velké, aby mi padalo vždy to co, potrebuju..  A opravdu získat 1x runový úlomek za 60 mašlí... To je už moc.. [BR][BR]Příspěvky sloučeny. Embla"}, {"157": "@Lovec Krys  Kdyby to alespoň byli relikvie, které nám mizí v kraftingu....., tedy individualizovaná odměna, bojím se, že dostanu nějaké, kterých mám 2,5k...."}, {"16": "@Arweene Já mám i těch, které používám 100% času nejméně 3000. Pravda, v tomhle nejsem úplně typický případ, se svými turnajovými výsledky si jich nahrabu každý turnaj o několik stovek více než jich za těch 9 týdnů stihnu spálit.[BR]Kdyby těch relikvií bylo alespoň 50, tak to i některým hráčům pomůže, ale 3 fakt nikomu nepomůžou."}, {"11": "a co je to za odměny: 1.den studně přání, 2.den Winter Conjuration, když výš píšete  že denní odměny jak jsme byli zvyklí tentokrát nejsou ?"}, {"20": "@voyager-1 Odměny sice jsou, jenže způsob získávání je takový, že je člověk jen tak nezíská. Rotující bedny nebyly nic moc, ale ten nový způsob je tedy výmysl století "}, {"11": "no to se teprve uvidí jak obtížný to bude,, zatím ten systém neznám, v balíčkách denní odměny nevidím."}, {"90": "Denní odměna je jen jedna v celkem 16 balíčcích. Trefit ji je opravdu dooost na náhodě a víckrát skoro nemožné."}, {"11": "jo takhle, ona je v jednom balíčku. Ale to je samozřejmě jen show programátorů. Pokud systém rozhodne že máš denní odměnu získat tak ji získáš at klikneš na kterýkoliv balíček. Stejný jak to bylo u truhel."}, {"90": "Nemyslím - pokud např. dostaneš lupu a ta ti rozbalí balíček zrovna s odměnou tak ji tam opravdu s jisotou najdeš. Alespoň mě to tak vyšlo . A dokud se celý systém 16 balíčků neresetuje (vyčepáním nebo novým zamícháním) tak už další denní odměnu nedostaneš - a to taky s jistotou.[BR]Snad bys při doublu ji mohl dostat dvakrát, ale to jen hádám, to mi nikdy nepadlo.[BR]Přiřazení obsahu balíčkům tedy podle mne probíhá při míchání a pak už je fixní a kliknutí na balíček jej už nemění, pouze vybere obsah."}, {"11": "já betu nehraju, tak se nechám překvapit ale určitě to není naprogramovaný tak, že aby si získal denní odměnu tak musíš trefit jeden ze 16.balíčků."}, {"181": "@voyager-1: ono mi to tak i vychazi. Na bete jsem v 2. kapitole, tzn., ze je to pro me vicemene nehratelny. Takze jsem kliknul kazdy den 2x a mam obe denni odmeny. Nepredpokladam, ze to tak snadno pujde v 15. kapitole na winyandoru "}, {"16": "Kdo ještě neviděl zimní online kasíno, tak tady je:[BR][IMG]https://i.ibb.co/2M5M6qd/https-cz-forum-elvenar-com-index-php-attachments-1573882376210-png-3878.png[/IMG][BR][BR]Už jsem na betě v úkolech poskočil na úžasných 14 mašlí/úkol a už nemám vůbec chuť je dělat."}, {"157": "@Lovec Krys  je to dost hnusný,  a navíc jak pro 6leté děti......"}, {"92": "voyager-1 napsal/a:\t\t\t...musíš trefit jeden ze 16.balíčků\t\tKlikněte zde pro zvětšení...To bude možná snažší se trefit do požadavků duchů ve věži "}, {"157": "@Saux  to určitě, ale zase jsou úkoly poměrně lehké, dají se uhrát s běžným městem bez přestavby, nejsou svaté trojice, ani výzkum provincií..... a nespočetně střetů"}]