[{"91": "Arweene >> Už ne 11 relikvií čtyřikrát po sobě a přes 100 relikvií během jednoho a půl dne mimo turnaj? Tak to by mohlo být hratelné."}, {"11": "@Saux  to je ale vytržený z kontextu, já psal něco jinýho."}, {"16": "@Arweene Ale jsou, jen ne tak často. Ony taky úkoly typu posbírej půldenní produkci manufaktur taky nejsou žádný med."}, {"91": "Tak půldenní výroba pořád není čekání tři dny na další turnaj."}, {"114": "na betě mám na PC rychlou motivačku  "}, {"91": "luterina >> To jako vážně? 1. duben ještě daleko."}, {"88": "Lidi, nesnažte se mi ten event znechutit ještě před začátkem... To jako opravdu, nebo Inno zkouší, co hráči ještě zkousnou po Zvířetníku a Halloweenu? "}, {"31": "V tejto chvíli nie je žiaden dôvod na znechutenie. Udalosť sa začala doslova pred pár dňami a aj to iba na bete, kde je účelom aby sa testovala a vývojári dostali spätnú väzbu. Dokým príde k nám, zostáva ešte niekoľko týždňov a to je dostatok času na to, aby vývojári urobili potrebné kroky (a to môžem potvrdiť, že sa o spätnú väzbu naozaj zaujímajú a vraj už plánujú vylepšenia)."}, {"189": "taky to dobrodružství hraji asi nevyjmenuji všechny zápory tohoto dobrodružství,jen trochu přemýšlím a počítám[BR]balíčky. ze 16 balíčků je minimální šance na hlavní výhru,když odměny za úkol jsou také minimální,dnes odměna za úkol 19 mašlí ,ptám se kolik úkolů bych musela denně splnit ,abych opravdu získala denní odměnu?1 balíček 60 mašlí zhruba tedy 3 úkoly na balíček  a 16 balíčků to tedy opravdu znamená 48 úkolů denně,to nikdy nesplním,takže šance na výhru minimální a ostatní odměny z balíčků jsou nesmysly,kvůli ,kterým nemá smysl úkoly plnit[BR]od vývojářů je to opravdu moc hezký dárek před vánocemi,myslím,že za takových podmínek nad tím nemá smysl trávit drahocenný čas"}, {"16": "@iDavis Kdyby vývojáři trochu přemýšleli, tak se mohli tomu, co logicky nastalo, snadno vyhnout. Bývaly doby, kdy k tomu nedocházelo. Ale ne, oni musí za každou cenu přijít s něčím novým, a místo aby u toho přemýšleli, tak to nějak nastřelí a pak se diví výsledku.[BR]Teď už jde jen zmírnit škody, protože samotná mechanika se moc měnit nebude a ona je špatná už v základu (místo strategické volby ze 3 beden jen jedna se 16 možnostmi).[BR]Takže jen můžeme doufat, že aspoň sníží tu nesmyslně vysokou cenu za pokus a že ten největší odpad nahradí něčím cenějším."}, {"20": "@Lovec Krys - tomu se říká změnu za každou cenu. Rotující bedny nebyly dokonalé, ale nesrovnatelně lepší, než tohle. Navíc celá tahle věc působí graficky jak pro první obecnou. Nezbývá než doufat, že alespoň nějaké slušné změny nastanou."}, {"190": "Nechci váš zklamat, ale stejný princip už byl v loni v FoE použitý, takže podle obrázku co tu je vidět jde v podstatě jen o port bez úprav..."}, {"88": "Kdybych chtěla hrát FoE, tak hraju FoE. Jaksi nechápu, o co kráčí: nejdřív nás znechutí Zvířetníkem, pak pokračují \"Mrazivým příběhem Dr. Šraňkensteina\" a teď nám naservírují grafiku jak pro malé děti. Cokoliv bylo kritizováno, tak bylo následně přepracováno do ještě horší podoby. Jestli se takhle vývojáři \"opravdu zajímají o zpětnou vazbu\" jak píše výše @iDavis ..."}, {"72": "A už to udělali, takže to zůstane, vazba, nevazba."}, {"181": "Veskere deni v Elvenaru posledni dobou vede jen k jedine otazce:[BR][BR]KONCIME ?"}, {"88": "@redking123 : taky se mi tahle otázka honí hlavou. Ne nadarmo jste \"mistr slova\". [BR]A když už tady více lidí nahodilo FoE, tak soukromá spekulace číslo 1: nechtějí nás nějak převést do FoE, třeba jako \"Mystickou budoucnost\"?      [BR]Soukromá spekulace 2: kopírka \"černé díry\" z Fortnite? To už je spekulace hodně divoká..."}, {"114": "nehraju na FoE, takže pro mě je to nové a jiné a to já ráda vyzkouším, hlavně když to není stereotyp - nuda, ale když mě to hru zpestří..., s čím nejsem moc spokojená, jsou ty odměny, brala bych spíš takové, co nelze až tak snadno a rychle získat, např. místo relikvií a kouzel bych raději urychlovače času - hooooodně urychlováků     ..co je super - pro nás \"slepejše\" - jsou ty červené na pozadí výrazné a hned viditelné mašle, ty se povedly, jinak v čase Vánočním proti infantilnímu Perníčku a chaloupce z perníku nic nemám, ba naopak, musím se stále smát a smát "}, {"181": "A jeste jedna otazka:[BR][BR]Existuje jeste nejaky Elvenar tym, nebo uz to tu prevzal tym FoE?"}, {"88": "Asi ještě existuje, protože FoE wiki uvádí jako \"novinku\" pro zimní event propojené budovy. Což my v Elvenaru známe už dlouho. Koukám, recykluje se oběma směry...[BR]Potom co jsem nějakou dobu procházela FoE wiki, zjišťuju: netušila jsem jak moc VELKÁ kopírka FoE je Elvenar... (FoE jsem nikdy nehrála ani se nezajímala. Moje chyba...)"}, {"181": "@Vicky1177 ja hral Foe asi 3 mesice a stale jsem si rikal WTF. Elvenar vypada jako zjednodusena verze FoE s daleko hezci (subjektivne) grafikou. Princip je stejny, nektere spolecne veci ale funguji trosku jinak (treba Vez). Vylepsitelnych budov je tak moc, ze uz ani nevis co je cim vylepsitelne.  Surovin je tak moc, ze nikdo nic nema  a obchodovani je spis zebrani a posilani spamu \"vezmi mi nabidku\". Je moznost loupit, cimz sice skoro nic neziskas, ale na....s oloupeneho (teda pokud  si toho vubec vsimne). Elvenar je daleko \"slunickovejsi\" hra. [BR]Nakonec pro me nebylo tezke splnit pozadavek na zruseni uctu na FoE - neprihlasit se tusim 14 dni. Tady by to bylo pro me o dost tezsi "}]