[{"91": "FoE neznám, a ač mám rád nové nápady a ne kopírování, tak jako třeba, ale ať to aspoň za něco stojí. Zatímco s přidáváním nových funkcí si připadám jako spokojen (ty hře náležitě prospějou), tak s novým obsahem to v poslední době nevypadá moc dobře, a konkrétně události bývají docela slušné zklamání (přitom to je pro hru naprostý základ). A nejde vůbec o štědré odměny, ale o zpracování, bezchybnost textů, grafiku, aby nevypadala jak z první třídy, a hlavně i pobavit a ne to hrát jen z donucení. Vždyť to vývojááři musí vědět co vypouští, a jaká asi bude od hráčů reakce, i jaké obsazenstvo hráčů hru asi hraje."}, {"178": "Koukám, že nová událost je snad ještě horší než předchozí [smilie--sprite1][BR]Jak již bylo zmíněno tohle je už jenom o RNG - žádná strategie, žádné možnosti ovlivnit co dostanu (teda můžu se na to vykašlat a nedostat nic [smilie--sprite1]. Omezení získání daily odměn (dřív člověk pár věcí zkusil za pár drobných, ale tady buď musí mít extra kliku anebo extra úkolové měny). Jinak by mě zajímalo PROČ je postup hlavní odměny náhodně 1-3 bodů to aby člověk už vůbec neměl kontrolu nad tím jak postupovat? Podle mých výpočtů je třeba na lvl 10 eventové budovy 340 bodů (1*20 za první artefakt a 8*40 za ostatní), což je něco mezi 6800 až 20400 mašlí (340/3 pokud vždy padnou 3 body * 60 cena za mašli a 340/1 pokud vždy padne pouze 1 bod), průměr je 13600. Podotýkám abstrahuji od zdojnásobení odměny. Pokud bude průměrná odměna za úkol 25 mašlí (data ještě nejsou kompletní, bohužel zatím to tak vypadá viz FB platinum Leaf) stačí na získání max. lvl budovy něco mezi 272 úkoly až 816!!! úkoly v průměru to je 544 úkolů (abstrahováno od sběru mašlí) což je celkem masakr [smilie--sprite1][BR][BR]Chápu, že autorům se nelíbilo, to co se stalo v ráji mořských panen kdy se dalo úplně v pohodě nahrabat kvantum budov na lvl. 10, ale zvířetník a teď tohle tomu dávaj korunu. Ve zvířetníku šlo alespoň sbírat to co člověk preferuje (urychlovače, kouzla, VB apod..), ale záleželo na úkolech jak velký bank člověk mohl rozbít - případně jak mu zpátky padala bonusová měna. Poslední úprava tyto drobnosti již definitně vyřešila bonusová měna nepadá skoro vůbec z dárků (hypoteticky, lze získat 60 mašlí, ale člověk musí trefit dvojnásobek a pak míchání) a získávání specifických budov z denních odměn je ohromně ztíženo, respektive lze získat víc jak 5 denních budov tak maximálně dvakrát za celou událost. [BR][BR]Celkově odměny v dárcích jsou mnohem horší než v truhlách (skoro vždy byla malá šance na denní odměnu). Nechápu, proč se v dárcích objevily \"úžasné\" malé kulturní budovy a relikvie v počtu 3ks. Proč tam nejsou spojovací činidla a například královské rekonstrukce [smilie--sprite1][BR][BR]Celkově za mě je událost dost špatná v tom stavu v jakém je samozřejmě zkusím dát hl. budovu na maximum, ale spíš z principu. Obecně hlavní budova by potřebovala posílit, aby stála za to úsilí - nechápu proč jsou tam pevně dány t2 suroviny a ne posun podle hráčova boostu - tímhle se deformuje již ne moc fungující trh [smilie--sprite1]"}, {"15": "Uvidíme . [BR][smilie--sprite6]"}, {"91": "To nevím co uvidím, když se tu píše, že se nedá vybrat jaké odměny budu chtít sbírat, to byla ta celkově pozitivní věc na dřívějších událostech. Věděl jsem o co mám zájem a co zkouším získat, a ihned jsem poznal zda se mi to podařilo nebo ne, a byly i bedny kompromisu, kdy jsem v podstatě nic zásadně netratil."}, {"72": "tak neodolatelnou kombinaci technologie/provincie/nebo 15 oparů mám už na začátku úkolů když je za odměnu 14mašlí.. jen si je uvázat [smilie--sprite1][BR]progres, progres, progres.. wow"}, {"157": "Nerozumím úkolům a nářkům na ně, na Elvengems je seznam, ten neplatí? Nikde není úkol na získání stovek relikvií (stovky úlomků, ale to je brnkačka), 1x svatá trojice jako poslední úkol č. 29, který by měl být pro všechny shodný. Chápu, že systém získávání odměn je nakonec náhodný a zřejmě k ničemu, ale úkoly zveřejněné na elvengems jsou splnitelné. Nebo se ty úkoly na betě výrazně liší? Na betě nehraju, tak děkuju za vysvětlení.[BR][BR]@Pauleo   Už ne 11 relikvií čtyřikrát po sobě a přes 100 relikvií během jednoho a půl dne mimo turnaj? Kdes vzal ty stovky relikvií? Nevšimla jsem si jediného úkolu na získání relikvií...."}, {"31": "@Arweene úlohy sú tentokrát rozdelené na 2 časti, tá prvá má konečný počet úloh a náhodnosť nie je nejako veľmi výrazná (má asi 180 úloh), po nej nasleduje časť druhá, tá má výrazne vyššie nároky (a slabšie odmeny) a je nekonečná. Hráči majú s prvou časťou zatiaľ celkovo viac pozitívne skúsenosti (a ja sa k ním pripájam)."}, {"157": "@iDavis děkuju, tedy to nesouhlasí s úkoly na Elvengems?"}, {"31": "@Arweene to povedať neviem, zoznamy úloh som zatiaľ nepozeral. Viem len, že v niektorých zadaniach sú nejaké nezrovnalosti a teda že dokým sa udalosť dostaví k nám, môže sa to trochu zmeniť."}, {"16": "@iDavis No já se k těm pozitivním nepřidám. Moje beta město většinu času nedělá nic jiného, než, že neustále čeká, až vyrobí dost surovin / kladiv. A to množství je takové, že často plním tak 1-2 úkoly denně, protože více s tím městem prostě nestihnu.[BR]A ten úkol na kouzla je taky povedený, nepočítá se turnaj ani sousedská, prostě máš zadání vyrob 3 kouzla v akademii kouzel.[BR]Prostě sice odstranili některé negativní prvky úkolů z minule (např. 1d výroba v dílnách vysokého levelu), ale místo toho tam napráskali kupu jiných, které budou trvat co nejdéle.[BR]Např. dneska ráno jsem dokončil úkol na výrobu T1 surovin ze včerejška a dostal jsem výrobu 3 kouzel v akademii, což znamená, že s jedním vyrobeným a dvěma ve výrobě to dokončím někdy v noci, takže pro dnešek s úkoly konec.[BR]Jen pro pořádek dodávám, že na betě mám 2xT3,3xT2 a 5xT1 a akademii lv 3, což jsou věci, které budou limitující pro spoustu hráčů. Jen menšina hráčů má opravdu hodně manufaktur ve městě.[BR][BR]A jestli výrazně nezvýší možnost získat denní odměnu, tak vlastně z toho eventu budu mít tak nanejvýš houby s octem."}, {"160": "Tak ja se taky pridávam na stranu nespokojených hráču.. Na bete ten event hraju, ale až dneska se mi podarilo získat první rozvinutí budovy..  Pokud se ten systém nezmení, tak to ani hrát na cz nebudu.. Nemám proč.. Aspon si počas eventu mužu vesele vylepšovat svoje mesto a kašlu na nejaké úkoly.. Ty eventy jsou čím dál tím horší a pro mne ztrácí úplne motivaci je hrát.. Podle mne teda vývojarí místo toho, aby tuhle hru obohatili, tak ji jenom znechucujou dalším hračum..  Hraji rok, ale za ten rok místo toho,aby hra prinášela nové skvelé veci, výzvy a odmeny, tak prináší jenom nudu a znechucení.. To je muj názor a muj pohled na tuhle hru, takhle pusobí tahle hra práve na mne a když to takhle pujde dál, tak to nevidím na dlouhé hraní.. Jen mne to mrzí, že dobrou budovatelskou hru dokážou takhle ničit behemm roku.. [smilie--sprite3]"}, {"15": "[smilie--sprite9][smilie--sprite9]@iDavis Mám dotaz : jak se dostanu k seznamu první řady úkolů v Zimní hře , když tebou napsaná adresa http://bit.ly/3783lzg mně odkazuje někam jinam a nic takového tam není ? Dokonce mi počítač jednou napsal , že uvedený web neexistuje .  [BR][smilie--sprite11][smilie--sprite11]"}, {"31": "@Green Jane zoznam úloh bude zverejnený v tom spoileri Úlohy - 1. sada. Zatiaľ ešte nie je, lebo čakám, dokým sa vyriešia na bete nejasnosti s niektorými úlohami. Čo sa týka toho linku, doporučujem ho odtiaľ skopírovať, potom by mal správne odkazovať na prehľad udalosti (ty si ho zrejme prepísala a zamenila veľké \"i\" s malým \"L\")."}, {"16": "Tak zatím to moc nevylepšili. Zatím provedené změny beru více méně jako kosmetické bez zásadnějšího vlivu na výsledek.[BR]Hlavně kdo potřebuje posílit nějaký aspekt města, např. produkci semínek, tak je dost obtížné (resp. nákladné) získat v současném systému více než 1 denní odměnu.[BR]Taky se vám může stát to co mi: Než získáte denní odměnu, tak se vám to 3x zamíchá a když ji konečně získáte, tak než najdete další míchání, tak vám dojdou mašle.[BR][BR]A o neopakování úloh si taky myslím svoje. Zrovna teď jsem dokončil úlohu na kladiva následovanou další \"jinou\" úlohou na kladiva."}, {"181": "@Lovec Krys: ty kladivka potvrzuju, jednou je to uloha typu sezen x kladivek a druha vyrob y kladivek. Odstranili relikvie a nahradili urychlovaci a tak, snizili na 50 masli za otoceni. A z 16 masli za ulohu mi to najednou zvedli na 24."}, {"160": "Joo a stejné jsou úkoly i se zbožím z manufaktúr.. To se mi taky opakuje porad dookola s nejakou obmenou.. A taky už mám tech mašlí víc teda.. Takže už mám doma 2 rozšírení na perníkovou chaloupku.. Jupíí..... [smilie--sprite11]"}, {"179": "Mám z toho deprese"}, {"16": "@BombaySapphire A co teprve až ten event opravdu začne."}, {"179": "@Lovec Krys Toho bych se nebál, to už tu nebudu. Četl jsem to znovu a jdu si vzít nějaké antidepresiva...[smilie--sprite2], život bez hromady časovačů pro mně prostě nemá cenu, jsem na nich závislý... Já jsem Grůt"}, {"20": "Grůt je nejlepší  [smilie--sprite8]"}]