[{"15": "Mám dotaz : kdo je Grůt ?   [smilie--sprite9]"}, {"16": "@Green Jane Postava ze Strážců galaxie."}, {"15": "Jo aha , díky Lovče . Hlava -mapa !!  [BR]@Lovec Krys"}, {"191": "jó no groot je best týpek ever"}, {"31": "Veža pre spoločenstvo[BR][BR]Spoiler: Veža pre spoločenstvoNa bete sa začína testovať nová funkcia veže pre viacerých hráčov.[BR][BR][IMG]https://i.ibb.co/pyF1QnG/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-spire-Spire-MP01-png.png[/IMG][BR]​Celé spoločenstvo bude za plnenie jednotlivých stretov vo veži získavať body (podobne ako v turnajoch) a pri dosiahnutí istých miľníkov, budú zapojení hráči odmenení.[BR][BR][IMG]https://i.ibb.co/5htpTD2/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-spire-Spire-MP03-png.png[/IMG][BR]Na obrázku vyššie je vidieť, že pokrok spoločenstva sa počíta v závislosti od pokroku viacerých hráčov. Jedná sa o celkový počet vyriešených stretov v rámci spoločenstva.[BR]Medzi odmenami na tejto lište pokroku budú napríklad zesilovače, spojovací činidlá, portálové bonusy, teleporty a diamanty. Týmto sa mierne upravia odmeny v bežných truhlách ktoré nachádzame vo veži.[BR][BR]Termín príchodu na náš server zatiaľ nie je známy, funkcia je len v úvodných fázach vývoja."}, {"40": "Bude možné rozlišit vlastní-společný postup věží?"}, {"16": "Jo mírně upraví, seberou se katalyzátory, přešoupnou se do odměn společenství a nahradí se úlomky kouzel. Teleporty to samé (ale ty mě tolik neštvou, více méně pro ně nemám využití), a pár dalších změn, které mě neštvou."}, {"94": "Jen to mirne zkazi? (napadlo mne jine slovo, ale to neni slusne...)"}, {"91": "Tak ale normální věž pro jednotlivé hráče zůstane nebo ne?"}, {"16": "@Pauleo Ano."}, {"15": "No to se mi \"ulevilo\" . Už jsem se bála , že nebudu mít kde utrácet svoje pracně nabyté  zásoby  !  [BR][BR][smilie--sprite2]"}, {"192": "No ja se samozřejmě na zimní event těším, tak jako na každý event[BR][smilie--sprite1][smilie--sprite1][smilie--sprite2]"}, {"20": "Chápu to tak, že Věž budou hrát jednotlivci jako normálně (i s odměnami) a celkový součet střetů se navíc sčítá? Nebo je Věž pro společenství úplně jiná záležitost?[BR]Já mám na Betě vesnici v 2. kapitole, takže Věž ještě nemám."}, {"31": "@Ludi áno, každý člen spoločenstva hrá svoju vežu ako doposiaľ a celkový súčet dokončených stretov bude navyše odomykať odmeny pre spoločenstvo."}, {"181": "Zatim to nebezi ani na te bete. Tak uvidime co z toho vyleze. Na tom tady castokrat zminovanem FoE vez nahrazuje turnaj. A casto je pozadavek pro clenstvi ve spolecenstvi udavan jako udelat aspon 1. level veze (coz muzes brat podobne jako tady X bodu v turnaji). Ja to vidim jako 2. turnaj, vyrazne tezsi. Taky to muze vyrazne promichat spolecentsvi a vzniknou superspolecenstvi, ktera se zameri na vez - tak jako jsou spolecenstvi co maji cil 10 truhlu (a pres to vlak nejede) Takze se budou slucovat lidi, kteri pravidelne prochazeji celou vez (kolik takovych asi je? - male desitky?) V tuhle chvili totiz nema smysl odchazet ze spolecenstvi, co dela 10. truhlu. Pujdes zase do takoveho, ktere je v zebricku vys, ale nic tim  realne neziskas.[BR]Uvidime jak  to bude s odmenami. Pri  soucasnem trendu to nejspis nebude stat za to, ale to predbiham. Mimochodem v tom FoE je zebricek kolik kdo udelal bodu ze spolecenstvi. A tam ty benefity jsou tusim takove,  ze se treba vsem ve spolecenstvi snizi o 0,0000skoronic obtiznost souboju (uz to fakt dlouho nehraju, tak mi kdyztak opravte). Proste tam ma vez vliv na spolecenstvi a je to prestizni. (tady je uplne jedno kolikate spolecenstvi skonci v turnaji, oficialni zebricek neni). [BR]No jsou to vsechno spekulace, nechame se prekvapit, teda pokud tu hru nedomrvi do te  doby natolik,  ze uz to nebudem hrat [smilie--sprite3]"}, {"91": "Tak to mě vůbec nevadí, samotná věž není o tom jí pokaždé projít do konce, takže pokud za účast padnou nějaké odměny navíc, tak jenom dobře. Nevím proč by každou část hry měli všihni odehrát až do konce a získat vše co jde."}, {"20": "iDavis, díky za vysvětlení. Myslím, že to není špatná věc."}, {"16": "Problém vidím v tom, že v současné verzi, kterou (zítra?) spustí přesunuli některé odměny ze samotné věže do odměn společenství."}, {"114": "tak pokud budou odměny z Věže jak za osobní účast v ní tak i za účast společnou s dalšími hráči, nemělo by těch odměn být ve výsledku víc? jak na tom bude jednotlivec co hraje bez společenství nevím..."}, {"16": "Jestli zítra začne věž na betě se změnami, bude možné porovnat skoro ihned po začátku rozdíly v solo bednách."}]