[{"16": "Odměny pro společenství:[BR][IMG]https://i.ibb.co/vsMFHvd/https-cz-forum-elvenar-com-index-php-attachments-1574608284187-png-3911.png[/IMG][BR][BR]Takhle teď vypadá stav, kdy jsme ve 3 vyčistili prvních 8 střetů (do 3h brány).[BR][IMG]https://i.ibb.co/zQTswWr/https-cz-forum-elvenar-com-index-php-attachments-1574609212180-png-3912.png[/IMG][BR]Body to připisovalo následovně: První 3 střety - po bodu. 4. střet před bránou - 2 body.[BR]Další 4 střety šly stejným způsobem - 3x1 + 1x2 body, celkem každý získal 10 bodů a má nárok na první dvě odměny dobrodružství.[BR][BR]Každý hráč dostane jen ty odměny, které jsou odemknuté a zároveň splnil dost střetů k jejich získání. Tzn. odpadá možnost, která je v turnajích - udělat jeden střet a dostat odměnu z 10 truhel, takový hráč by v tomhle systému nedostal nic z odměn pro společenství.[BR][BR]ps: Srovnal jsem bedny získatelné solo na prvním patře a zatím vypadají na cz1 i betě stejně.[BR][BR]ps2: Při zběžném propočtu, pokud bude za každý běžný střet 1 bod a za každý střet před bránou 2b, znamená to, že každý hráč může projitím celého prvního patra získat 20 bodů.[BR]Odměny z první truhly společenství tedy může získat i hráč, který je ve společenství sám (nevím, zda se odměny zobrazí hráči bez společenství)[BR]Na druhou truhlu pak stačí hráči 2, kteří vyčistí první patro (nebo jeden, který k tomu vyčistí část patra druhého).[BR]Na třetí pak stačí hráči 3, kteří vyčistí první patro (nebo jeden hráč, který vyčistí všechny 3 patra (za předpokladu, že ve druhém a třetím patře není více bodů za střety))[BR]Na čtvrtou truhlu pak stačí 6 hráčů, kteří vyčistí první patro (nebo méně hráčů, kteří vyčistí více)."}, {"91": "Tak já doufám, že to hru pro jednotlivce nadále nepostihne, přece jenom věž vypadala, že je alternativou i pro jednotlivce, takže sekci věže pro aliance beru jen jako něco navíc, bez hýbaní odměnami na úkor rozšíření pro společenství."}, {"66": "@Lovec Krys Vysvětli mi, prosím, tu část: \"a zároveň splnil dost střetů k jejich získání\". Když dojetu první patro, mám nárok jenom na odměny za 20b, nebo i více, když budou hrát i společníci?"}, {"31": "Lovec Krys napsal/a:\t\t\tps: Srovnal jsem bedny získatelné solo na prvním patře a zatím vypadají na cz1 i betě stejně.\t\tKlikněte zde pro zvětšení...Aktualizácia na bete, ktorou dôjde k úprave odmien prebehne až zajtra."}, {"16": "@Prealiena Když dojedeš první patro, tak společenství bude míst dost bodů na první odměnu, kterou získáš i kdyby se nikdo další nezúčastnil.[BR]Pokud se zúčastníte v dostatečném počtu na získání 110 bodů, tak získáš za první patro první 4 odměny (tzn. první řádek odměn)"}, {"114": "@Lovec Krys, díky, pěkné přehledné info, zní mi to zatím dobře, těším se až budu moct odzkoušet. "}, {"31": "Aktualizoval som prehľad zimnej udalosti, ktorý teraz obsahuje informácie nových (zmenených) obsahov jednotlivých darčekov a taktiež kompletný zoznam úloh."}, {"181": "Dostavas 1 odmenu z ramecku, co tam jsou nebo obe?, eventualne tri?"}, {"16": "@redking123 Funguje to analogicky bednám z turnaje, jen navíc musíš ty příslušné bedny (odpovídají branám s časovým odpočtem) vyčistit i sám. Tzn. pokud vyčistíš celé první patro a tvoje společenství nahraje dostatek bodů (110), tak získáš první 4 odměny."}, {"66": "A pro 8 odměn musíš tedy vyčistit druhé patro a pro 12 všechny tři?"}, {"16": "@Prealiena Ano. Musíš je vyčistit ty sama + společenství musí nahrát dostatek bodů.[BR][BR]ps: Tak za vyčištění celého prvního patra je nakonec 21 bodů, zřejmě je finální boss patra ohodnocen 3 namísto 2 bodů."}, {"3": "tipuju, že za další patra bude bodů víc "}, {"5": "Tak na tohle se těším "}, {"181": "@Lovec Krys - zrejme se pocitaji souboje a v bosovi na konci 1. patra jsou 3."}, {"16": "@redking123 Uvidíme. Zkusím to ověřit, až budu procházet na betě druhé patro.[BR][BR]ps: Tak zatím první 4 střety v druhém patře stejně jako první 4 střety v patře prvním. Tzn. 1-1-1-2. Takže podle vln to nebude, už první střet má 2 vlny a je za 1 bod.[BR][BR]ps2: Pro představu, jak to vypadá, když je věž rozjetá + je vidět kdo kde ve věži je:[BR][IMG]https://i.ibb.co/SN84K5k/https-cz-forum-elvenar-com-index-php-attachments-1574706398418-png-3915.png[/IMG][IMG]https://i.ibb.co/svSxCFm/https-cz-forum-elvenar-com-index-php-attachments-1574706411251-png-3916.png[/IMG][IMG]https://i.ibb.co/6YcqVZx/https-cz-forum-elvenar-com-index-php-attachments-1574706423394-png-3917.png[/IMG][BR]Odemknuté odměny dostanou hráči, kteří jsou na stejné nebo vyšší pozici než je odemknutá odměna.[BR][BR]Informace o svých bodech (u spoluhráčů jde vidět jen jméno):[BR][IMG]https://i.ibb.co/jf9G7yf/https-cz-forum-elvenar-com-index-php-attachments-1574706519949-png-3918.png[/IMG]"}, {"114": "vypadá to moc pěkně, těším se "}, {"16": "První 2 brány v druhém patře mají stejné bodové ohodnocení jako v patře prvním. Lze tedy očekávat, že stejný bude i zbytek (možná s výjimkou bosse), takže 21b / patro (+ možná nějaký ten bodík za bosse, pokud je druhý a třetí finální boss ohodnocen více než ten první).[BR]ps: Na beta foru bylo potvrzeno (někým, kdo se dlouhodobě hrabe v informacích z HTML5), že je to stejné, tzn. 1b / střet, 2b / strážce brány, 3b / bosse, celkem tedy 21b / patro platné pro všechny 3 patra."}, {"181": "Pokud tomu dobre rozumim 1330 / 25 ~ 54 bodu na hrace (odpovida tem 1600 v turnaji), pokud chci jako spolecenstvi mit vse.[BR]54 = 42 (cele 2. patro) + 5 + 5 + 2[BR]Otazka je kolik je individualni minimum pro ziskani  posledni odmeny ?[BR]To nevypada jako uplne snadne a asi je to dobre.[BR][BR]Je to trosku popsany na elvengems, tak z toho vyplyva, ze jedna ta sipka (zarazka - tick) je jeden souboj. coz je asi i odpoved na mou otazku.[BR][BR]Na obrazku mam sice 10 bodu, takze 1. odmena doma a stojim na 2. odmene. Na tu ale potrebuju 30 bodu... Proste sam nejsi nic   a sam to vsechno neuhrajes.[IMG]https://i.ibb.co/8rmzPty/https-cz-forum-elvenar-com-index-php-attachments-spire1-jpg-3919.jpg[/IMG]"}, {"16": "@redking123 Při zisku 21b/patro můžeš získat solově odměny pro společenství odpovídající 42b za 2 patra a 63b za všechny 3 patra.[BR]Takže max. první 3 odměny pro společenství při solo hře."}, {"31": "V tejto chvíli naplánovaný termín blížiacej sa udalosti Zimní kouzlo nájdete uvedený v prehľade."}]