[{"16": "@iDavis No to bude...hádám, že až to hráči začnou na live serverech hrát, tak se asi spousta z nich naštve ještě více než hráči na betě.[BR]Snad jediná šance pro příště bude, když Innu dají velcí utraceči najevo, co si o tom eventu myslí (tím, že v něm nic neutratí) a že Inno pochopí zprávu a začne se chovat trošku rozumně a ne sebedestruktivně."}, {"31": "@Lovec Krys dali tam špeciálnu hudbu do pozadia, takže moje prianie je tým splnené. Čo sa týka jej nedostatkov, veľa ich tam (po posledných úpravách) nevidím, snáď až na tú možno viac ako by sa žiadalo zníženú šancu na denné odmeny."}, {"66": "Pořád tam nechali 16 dárečků? Jeden z návrhů byl snížit dárky na 12 a umožnit použití reshuffle na potvrzení a ne okamžitě po vylosování, to asi taky nespravili."}, {"31": "@Prealiena počet darčekov je zatiaľ nezmenený, ale vraj si vývojári tento nedostatok uvedomujú (a je otázne, či s tým stihnú niečo spraviť).[BR][BR]PS: Doporučujem zajtra sledovať hru, bude čierny piatok a s tým spojené nejaké prekvapenia, ktoré pre nás majú v zálohe."}, {"141": "Jéjda, těším se na novoty. Jakékoli. To mne baví. Díky."}, {"16": "@iDavis Ty denní odměny jsou mnohem důležitější než hudba na pozadí (já ji mám stejně trvale vypnutou). Ale to přijde, až to hráči začnou hrát. A to, že z toho odstranili jakoukoliv strategii a udělali z toho hloupý automat na mince taky jistě potěší mnoho hráčů zde, stejně jako na betě.[BR][BR]@iDavis Upřímně zatím se moc nepředali. 155 VB mi jako bonus k nákupu za 2k kč nepřipadá ani trochu zajímavý. Takhle kdyby ty VB přidali v tisícíh, tak už by to mohlo některé hráče zlákat. Takhle to nejspíše nezaujme ani začátečníky, natož pokročilé hráče.[BR]Jestli budou všechny dnešní nabídky podobné, tak pro většinu nic moc. Kdyby raději dali slevu na rozšíření."}, {"31": "Pripravil som pre vás z blížiacej sa zimnej udalosti video, v ktorom môžete sledovať, ako funguje nová mechanika. Na základe mojich výsledkov som s touto mechanikou spokojný a myslím, že typ a rozsah odmien je adekvátne štedrý. [BR][BR][BR]Video taktiež nájdete aj v prehľade udalosti."}, {"16": "@iDavis Tak buď máš sakra štěstí anebo jsi hodně skromný, co se týče denních odměn. Já mám zatím jednu a moc optimisticky to nevidím. A v úkolech furt na něčem stojím, tak ani nevím, zda ty základní vůbec dokončím."}, {"20": "Líbí se mi, že je možné dostat krmení, a napakovat trochu sklad. Je podstatné, jaké mi budou padat úkoly. Od toho se všechno odvíjí. [BR]Prostě to musíme brát trochu s humorem, je to prostě taková vánoční blbůstka "}, {"31": "@Lovec Krys či som skromný neviem, ale skôr by som povedal, že neočakávam nadštandardné výsledky ako v posledných dvoch udalostiach."}, {"16": "@iDavis Já to srovnávám s výsledky dřívejších událostí, nikoliv s posledními 2. A pořád mi vychází, že se dostanu tak max. na polovinu tehdejšího stavu. Zvláště, když budu mít štěstí jako na betě, kde dostanu 3x míchání bez toho, abych natrefil na denní odměnu."}, {"72": "Ty úkoly jdou čím dál horším směrem, je evidentní tendence to víc svázat, zpomalit, zprůměrovat hráče do stádečka.[BR]Kouzla musí být jen z akademie apod. Pořád dokola se točí získávání zboží (jen z manufaktur, koupit to nejde), zásob (jen z dílen a ještě to bere studny, požehnání nejde), velmi častá nutnost vyhazovat zdroje u obchodníka, velmi častý úkol na nákup VB.[BR]Samozřejmě se to vše schová za ubohou formulkou že se hráči musí snažit, ale přijde mi že se to snaží hráčům čím dál tím víc znechutit, nevím.[BR]Cokoliv se dalo získat tou vyšší snahou, teda aktivitou, větším časovým fondem hráče se upozaďňuje a masa novinek to tlačí bokem někam \"buď si to koupíš, nebo získáš průměr ať dláš co chceš\".[BR][BR]Co nechápu, proč je u toho novýho okna eventu, který vypadá jak hrací skříňka pro mýho dvouletýho kluka, nutný klikat nadvakrát /ta cukrová hůlka/, stejně to přidělí 1-3 náhodně, nejde to ovlivnit, proč to musím klikat znova.. jen aby se to zpomalilo a proběhla třistakrát stejná animace navíc?[BR][BR]Sorry, ale trochu mě to už asi rozčiluje."}, {"141": "Připadne mi to legrační a zábavné, těším se na nějaký večer, kdy si nandám mísu perníčků, uvařím kýbl čajíku s rumíkem, budu se ládovat a nechávat se překvapovat, co na mne z dárečků vybafne. A pokud nezískám plně rozvinutou perníkovou chaloupku, tak mi holka nějakou hezkou upeče. A bude."}, {"91": "tupecpolni >> A tomu se říká se mít."}, {"40": "Pěkný večer, nedokázal jsem najít nebo neumím číst. Co umí nebo dělají ty dvě překřížený červený šipky a lupa?"}, {"158": "@moribundus iDavis to má přehledně vysvětleno zde na forum a na gems to je také (ale v angličtině). Každopádně, šipky vytvoří novou nabídku dárečků a lupa odkrývá obsah dvou dárečků v nabídce, takže víš co ukrývají"}, {"88": "Ad video od @iDavis:  Co to jako má být? Já si myslela, že Elvenar není hra pro nějaké předškoláky..."}, {"193": "Takže... Opravte mě, pokud jsem příliš velký trotl. Ale pokud někdo dělá event zejména kvůli jedné konkrétní denní odměně a kouzelná budova je mu celkem šumák, tak má smůlu? Jako se mi už nějaká přehnaná aktivita kvůli těm studnám nevyplatí?"}, {"167": "Ahoj,měl bych malinkatý nápad a tak bych se rád zeptal zda to jde. Minule mě dost zdržovaly úkoly  s podmínkou min. lvl. Co kdyby jsem před začátkem eventu pomocí teleportace uklidil např. budovy  manufaktury na mramor ( mám 3 na lvl 25 ) a místo nich pok postavil třeba 20 manufaktur v lvl1. Bude to platit jako min. lvl, nebo se budou počítat i budovy v shromaždišti?"}, {"99": "Minimální lvl je definován tvojí kapitolou, ne tím, jaké máš postavené budovy..."}]