[{"91": "Tohle se podle mě nepovedlo, graficky, stylově, motivově, ta opakující se melodie, byť mám hudbu vypnutou. Možná jen nedokážu docenit snažení vývojářů přinést něco zajímavého, ale tohle se mi nelíbí. A koukám že asi nebudu sám."}, {"114": "athlan napsal/a:\t\t\tCo nechápu, proč je u toho novýho okna eventu, který vypadá jak hrací skříňka pro mýho dvouletýho kluka, nutný klikat nadvakrát /ta cukrová hůlka/, stejně to přidělí 1-3 náhodně, nejde to ovlivnit, proč to musím klikat znova.. jen aby se to zpomalilo a proběhla třistakrát stejná animace navíc?\t\tKlikněte zde pro zvětšení...[BR]vidím to tak, když samotné vyzvednutí dárku s odměnou nepřidělí rovnou cihličky, tak je nutné jejich získaný počet rozhodnout - v tom okénku u chaloupky - ještě extra a bouchat kladívkem, že je další zábava [smilie--sprite8][BR][BR]nezahlédli jste někdo v odměnách víc mašlí než 100? nebo 100 mašlí je nejvíc co lze z odměn získat?[BR]jo už to vidím u @iDavis Zimní kouzlo 2019 - přehled události 100 x / 150 x / 200 x červená stuha, to není špatné, i když třeba 300 x by znělo lépe [smilie--sprite1]"}, {"31": "@luterina existujú darčeky s 50, 100 alebo 150 100, 150 alebo 200 stuhami."}, {"114": "@iDavis , v aktuálním přehledu máš uvedené jiné hodnoty, takže to ještě ponížili místo navýšili? [smilie--sprite3] jak jsou na tom hráči na betě teď co do počtu nejvíc získaných chaloupek v jednom městě? pořád jim říkám ať to tam moc nehoní [smilie--sprite8]"}, {"31": "@luterina aha áno, v príspevku vyššie som sa pomýlil, správne hodnoty sú tie v prehľade (teda 100 / 150 / 200)."}, {"5": "Ok...já v tom hledám něco pozitivního, byt´to není styl ala ,,starý elvenarský event,, ale asi kráčíme směrem k neziskovkám? [smilie--sprite1] a tudíž zisk z eventu bude jen duševní a hřát bude pravděpodobně jen ta účast na něm [smilie--sprite1] ...vypadá vše jako veselé vánoční zpestření a to po nové rase dává asi i trochu smysl a málokdo se tedy musí pro ,,něco /nic/ honit,, .... závěr: krásný veselý vánoční charitativní neziskový event [smilie--sprite1]"}, {"181": "Take hledam pozitivni. Tenhle event jiste zase o trosku zmensi mou zavislost na teto hre a priblizi me k definitivnimu \"a dost!!!\"[BR]Kazdopadne jsem zvedav na tu bouri nevole, az event  zacne.  [smilie--sprite6]"}, {"16": "@redking123 Na betě máme 31 stránek. Ale jenom proto, že spoustě hráčů už se ani nechce psát, stejně bysme se jenom opakovali. Po počátečních úpravách se už nic dalšího nezměnilo. Stále stejná směšná šance na denní odměny."}, {"91": "Tak bouře zajisté bude, přece jen jsem byl u větších událostí zvyklý na to, že jsem si vybral, co jsem potřeboval. Pokud to nejde, tak mě to moc netěší. Každopádně nejvíc nevím zda mě bude bavit to zpracování."}, {"15": "[smilie--sprite7] Takže to shrnu : všem veselé Vánoce !!! [smilie--sprite7]"}, {"114": "tak nemusím si dělat hlavu s tím kterou ze tří truhel vybrat, mně tím jeden ze stresů odpadá [smilie--sprite7] čili krásný dárek k Vánocům  [smilie--sprite8]"}, {"66": "Mně připadne asi šestnáct stresů, který dárek vybrat.[smilie--sprite10][smilie--sprite11]"}, {"114": "@Prealiena , nejezdím myší z jednoho na druhý, nehmatám...., zavřu oči a píchnu [smilie--sprite8] a nechávám se překvapit [smilie--sprite1] a nic jiného než milý dárek - třeba ošklivý bubák, tam být nemůže [smilie--sprite1] [smilie--sprite1]"}, {"191": "@luterina to je super způsob já si vždy lámu hlavu ještě že na klasické hře (ne betě) to ještě jede využiji tvou taktiku"}, {"15": "[smilie--sprite6] @luterina , tak přesně takhle to dělám taky. A je to mnohem zábavnější - i když občas sjedu myškou úplně vedle . [smilie--sprite6]"}, {"73": "Také si myslím, že tento (i pár předchozích) event se nepovedl. Nejen to ustavičné klikání, ale i šance na denní odměnu a hlavně, co to má být pořád za úkoly!? Vím, že po novince řemeslné výroby, ji chtějí výrobci zahrnout i do eventových úkolů, ale jak mám proboha něco rozčarovávat, když v eventech nic nezískám?! A tím pádem, jak mám získávat opary vidění (další úkol), když nemám úlomky kouzel? Pokud to takto bude i v dalším eventu, tak už se ho prostě účastnit nebudu, bohužel :-([BR][BR]Prosím, vraťte nám staré eventy..."}, {"3": "nemáš co rozčarovat? z kraftu je plno bordelu v podobě zmrzlých plamenů, z turnajů se sypou desítky kouzel, věž věčnosti a eventy dávají požehnání na mince, portálovýma bonusama by člověk mohl dláždit...[BR][BR]naopak, já bych tam těchhle úkolů potřeboval mnohem víc. Na druhou stranu mám 200 činidel a 200.000 úlomků a i když kraftím i totální blbosti, tak čísla pořád rostou..."}, {"16": "Ono by to chtělo spíše buď méně bordelu nebo větší výběr než jen 5 receptů najednou.[BR][BR]@LuciskaCh @Emhyr var Emreis II To záleží na aktivitě v turnaji a věži. Pokud hráč hraje aktivně oboje, má obojího dostatek, pokud hráč hraje turnaj jen trošku (pár set bodů týdně) a věž vůbec, nemá z čeho vyrábět.[BR]Já díky odměnám pro společenství ve věži přešel (asi už plně) na výrobu magické výroby a činidla čerpám jen z věže.[BR][BR]Jinak na betě zatím klid. Po skončení vánočního eventu je pauza (zatím nejdelší za celý rok)."}, {"191": "hej ten event...      dnes jsem losoval 5x po sobě jsem losoval a vždy bez budovy. Dokonce 3x z toho se mi stalo to že jsem vybral vše zbyli mi 2dárky (rozcestí a denní odměna) že nevíte co se mi 3x ze 3. případů stalo?? vždy jsem vzal rozcestí... super event chci také ty starší standardní 3 truhly malá velká střední a ty bedny se nemění."}, {"31": "@duchacek2 k starému systému troch truhiel sa už asi nevrátime, každopádne v ďalšej udalosti sa vrátime k minulým rotujúcim truhliam."}]