[{"191": "super"}, {"5": "Rotující truhly? Myslíš systém 9 truhel... Který byl v letní události - eventu?! Ten mi osobně vyhovoval. Ještě návrat k možnosti zisku slušného množství bodů byť za tvrdou dřinu...protože systém 20masli se mi naopak vůbec pranic nelíbí, když není hráč adekvátně odměněn za nadstandardní úkoly."}, {"20": "@ElfNostradamus  souhlasím, jen ten generátor náhodných úkolů by měl být lepší. Pořád se to nějak nedaří vyladit. Tak snad se dočkáme. [BR]Královská rekonstrukce teď nabývá na důležitosti, protože to nevypadá, že v budoucnu nebude možné získat víc kvalitních budov. Mám obavu, že trend, aby hráč nezískal příliš mnoho věcí, bude pokračovat ..."}, {"191": "@Ludi asi tak no protože když dostanu po sobě vyrob pytel zásob, slušné množství prken, oceli nebo mramoru a to se opakuje tak mě to štve. "}, {"18": "duchacek2 napsal/a:\t\t\t@Ludi asi tak no protože když dostanu po sobě vyrob pytel zásob, slušné množství prken, oceli nebo mramoru a to se opakuje tak mě to štve. Klikněte zde pro zvětšení...přesně tak, nebo ještě lépe dvakrát i třikrát po sobě vyrobit zásoby akorát jinak pojmenované."}, {"191": "jojo @WinterPhoenix"}, {"31": "Dobrodružství společenství[BR][BR]SpoilerNa bete sa zajtra začína nové kolo Dobrodružství společenství, ktoré tentokrát prinesie nové rozloženie požiadaviek v jednotlivých stretoch.[BR][BR]Odmeny:[BR]1. mapa[BR]1x Rozvážková knihovna1x prastará vědomost (10)1x prastará vědomost (15)2. mapa[BR]1x prastará vědomost (15)1x artefakt Perníkové chaloupky1x prastará vědomost (20)3. mapa[BR]1x zesilovač (20 hod)1x artefakt Perníkové chaloupky1x prastará vědomost (15)[BR]Predpokladaný termín začiatku tohto dobrodružstva na našich serveroch je okolo 2 týždňov."}, {"5": ",,Na bete sa zajtra začína nové kolo Dobrodružství společenství, ktoré tentokrát prinesie nové rozloženie požiadaviek v jednotlivých stretoch... ,,[BR]To zní lákavě  /ta změna požadavků/ ...odměny lákávé jen pro ty, ktěří si budou moci dostavět celou chaloupku, zbytek jako obvykle ...netřeba se zbytečně moč namáhat "}, {"16": "Odměny: [BR]I: Knihovna, 10VB, 15VB[BR]II: 15VB, 20VB, perníkový artefakt[BR]III: perníkový artefakt, 20h, 15VB[BR]Odměny za umístění: Stejné nebo podobné jako v předchozích případech."}, {"160": "@Lovec Krys tak jak byl sklamanim event, tak pokračujeme ve stejném duchu a stejným sklamánim je i dobrodružství.. Clovek aspon ví, že mu stačí jet jenom jednu trasu  pro odmeny a nemusíme se ve spolku stresovat dobrodružstvím... Čekala jsem, že to projde nejakými zmenami,ale je to bída teda.. :/"}, {"71": "Tak ona je to bída už několik eventů zpět .. žádná bechderoucí topovka která nutí fakt jít za odměnou .."}, {"16": "@jacktenrek Kromě jarních fénixů a podzimních medvědů - pro turnajové bojovníky obojí nezbytnost."}, {"19": "Jestli by nebylo lepší vrátit se k systému 4 velkých eventů ročně, než jet v podstatě jeden za druhým."}, {"3": "Lovec Krys napsal/a:@jacktenrek Kromě jarních fénixů a podzimních medvědů - pro turnajové bojovníky obojí nezbytnost.\t\tKlikněte zde pro zvětšení...no, upřímně, ti medvědi až tak nezbytní nejsou... zatím jsem je krmil dvakrát nebo maximálně třikrát a dá se bez toho žít. Bez felixe by to bylo horší"}, {"91": "Medvěda také moc nekrmím, ale přesto mi to vzhledem k jeho velikosti přijde docela podařená budova, a po nakrmení se dá nahrabat víc jednotek než bez něj na turnaj, sic tu výhodu zatím téměř nevyužívám. Rotující truhly jsou přece jasné, vystřelit za oběžnou dráhu, a poté sledovat jak si tak pěkně rotují prostorem ;-). A kromě toho jinak mi ten systém taky asi nejvíc vyhovoval. Náhodný element tam byl, a přesto se dalo s mnohým udělat, aby padaly vytoužené odměny, když nebyla vyloženě velká smůla, která občas díky podivně fungujícímu náhodnému generátoru nastávala, ale pak tu vždy někdo začal trojčící lidi uklidňovat, ať si jdou radši uvařit čajík na uklidnění, že hned budou mít zase chuť do hraní, a generátor že prý není zle očarovaný, jen občas nemá svůj vytoužený den..."}, {"66": "Rotující truhly mě právě bavily ze všeho nejvíc. Sice trochu více náhodné, než předchozí tři statické truhly, ale po prvním velkém protáčení se z toho také dal dobře odhadnout počet měny na x hlavních odměn nutných k získání potřebných 9 artefaktů a dalo se s tím strategicky pracovat.[BR]Zato Julii z managementu mám po posledním Q&A chuť zabít. Ten systém s náhodnými dárky a absolutně žádnou šancí to nějak ovlivnit opravdu už ne, prosím."}, {"16": "@Radvanus Vrátit se ke 4 eventům ročně namísto 6 nezaručuje lepší odměny z nich, pouze jich bude za rok méně."}, {"169": "@Lovec Krys nezaručuje to je fakt,ale když byli eventy 4xročne,vždy to byla raketa která rozhejbala stereotyp hry typu vyzkoumej,vycvič,vylepší  a odměny byli lepší.Ted jsou častěji a odměny s 90%odpad nebo budovy co byli k sehnání před převratem  nebo něco co ti přijde jako vtip,viz vánoční event:výhra 1ks runy nebo 3VB "}, {"91": "Lovec Krys >> No mohlo by to znamenat, že na tom více zamakají třeba, záruka není, možnost ale ano."}, {"31": "Alebo by sa mohol počet udalostí zvýšiť, ale skrátiť ich doba trvania (a tým náležite prispôsobiť ich náročnosť). Nebolo by to miestami tak frustrujúce, keď človek týždne hrá rovnaký princíp.[BR]Nebol by som proti nápadu nová udalosť každý mesiac, s dobou trvania 2 týždne."}]