[{"65": "úplně na začátku jsem VB nakupoval dost, víceméně jsem za ně vyhazoval zlato, když byly sklady plné. pak přišel okouzlující strom. tam se nějaké VB nakupovaly. pak přišel pochod stád, opět se nějaké VB nakupovaly. a já velice rychle pochopil, že když si to zdražím do nebeských výšin, nebudu moct nakupovat na eventy [smilie--sprite1][BR][BR]i teď jsem vlastně raději vyhazoval suroviny za provincie, když byla volba X střetů nebo X VB. člověk musí myslet do budoucna :-D[BR][BR]6. kapitola, 1 VB za : 33 000 zlata || 320 prken || 100 hedvábí || 60 drahokamů. není to zlé.[BR][BR]BTW já teď mám 16 hodin na průzkum, jedna provincie za den, pohoda. neboj, ještě dlouho tě tahle hrozné čísla nečekají. a to jsem o 31 provincií napřed oproti požadovanému množství na další kapitolu."}, {"66": "S tou politikou nakupování VB souhlasím. Došla jsem ke stejnému závěru [smilie--sprite1][BR]V současnosti mám ve třetí kapitole: 31 500 mincí / 320 mramoru / 100 křišťálu / 10 elixíru.[BR]Ten poslední nakupovací úkol z podzimního eventu (nakup 20 VB nebo vyřeš 20 střetů)[BR]jsem se rozhodla vybojovat, protože jsem si spočítala, že bych za něj zaplatila 755 000 mincí a skončila bych na 42 500 za VB.[BR]Tak mám rozdíl v nákupu 10 000 zlata.[BR][BR]Přemýšlím, že za tento halloween event platit VB nebudu, ty budovy mi nepřipadají ani tak dobré.[BR]Nechám si placení na další velký event.[BR]Stejně čekám, až někdy příště uvidím Valoriánskou čest, ta mi teď unikla. [smilie--sprite1][BR][BR]//Odstraněna zbytečná citace, Delingr"}, {"63": "VB nakupuji za peníze, když mám plný sklad. Momentálně mám 520K za VB, jsem u Orků. V eventech jsem pak použila suroviny (hlavně ocel), které jsem před tím na nákup VB nepoužívala, takže to bylo celkem levné.... Zdražuje se to, ano. Ale uvědomte si, že časem také produkujete více mincí i zboží, takže když jsem měla zaplatit v 2., 3. věku za VB např. 200 krystalů, tak mi to přišlo hrozně moc.... a teď mi to přijde směšně málo. Takže tyhle lamentace moc nechápu. Ano, pokud nakupujete VB ve velkém průběžně, máte pak na eventy už rovnou vysokou cenu. Pokud ale tuhle herní funkci (minimálně při platbě surovinami) budete využívat jen na plnění úkolů v eventech, pak to pro vás bude směšně snadné.... Bo když zaplatím za 20VB 80K oceli a ve sklad jí mám 250K, tak je to pohoda..."}, {"69": "OK v tabulce jsem 99... tak pro vaši zajímavost aktuálně nakupuji 1 VB za 1205K.... průzkum jedné provincie 52 hodin a abych získal jedno rozšíření potřebuji 10 provincií a rozhodně už je nelze vybojovat.. je to bez šance zkoušel jsem x krát, takže jediná možnost je vykoupit"}, {"68": "@Andrie Já tedy VB Kupuji jen a pouze při eventech. Ale když mám sklad na 7700K zlatých a budovy po mě chtějí 1400k zlatých na vylepšení... nevím, hodně dlouho jsem neměl ani z poloviny plný sklad mincí a to patřím k těm aktivním hráčům... bohužel úkoly mi u orků dávají 15k, 30k a tím si fakt nevydělám, to platí i o sousedské a pokud si napíšu o mince, tak zase nevyrobí nic dílny..."}, {"63": "@Safa Jsme na tom asi podobně - orkové, hl. sídlo na 7700K... zrovna jsem sbírala mince po 12hodinové výrobě (ukončená výroba mincí) a \"musela\" jsem koupit 2VB, bo jsem měla plný sklad mincí. Celkem se mi osvědčilo vyrábět kouzla, hlavně magický dar, takže pak jsem schopná (v kombinaci se sousedskou výpomocí na kulturu) z jednoho domečku úrovně 20 vyprodukovat (zrovna teď) 85K mincí (někdy i víc, dle toho jak sousedé motivují)... a to pak přibývá slušně...  jo a pak to samozřejmě je poznat i na dílnách... ;-)  I když u zboží musím přiznat, že jsem zrovna u orků využila 2 x požehnání na 33% zboží, ale to je dáno tím, že většinou využívám produkci na 24hod a tam to přibývá pomaleji, než kdybych to klikala po 5minutách, na což ale bohužel nemám čas :-("}, {"43": "Koukám,opět se stal z tohoto tématu pěkný bordel.Vidím,že jsou tu nové příspěvky,tak se těším na něco nového z beta serveru a tady se řeší akorát ptákoviny.Koukám,vedení asi stojí za prd,když to nikomu nevadí..."}, {"70": "Debata vznikla a rozvíjela se z debaty o příchodu dalšího eventu takže v tom žádný bordel nevidím. Přesunutím by debata ztratila na kontextu..."}, {"28": "Neber to prosím zle, ale to co se tu rozvinulo je už jednoznačně OT. Debata se má držet tématu, ostatně je to i v pravidlech. Nemyslím si, že by přesunutí příspěvků ohledně ceny VB něčemu uškodilo. Ostatně je tady na to samostatné téma..."}, {"17": "My jsme vznik tohoto tématu nijak neiniciovali, hráči si jej založili sami, nejedná se o oficiální zdroj informací. Do průběhu tohoto tématu jsme tedy nijak nezasahovali a nemáme v plánu náš přístup nějak měnit. Jsme v sekci Diskuze o hře, kde se předpokládá, že se povedou sáhodlouhé diskuze o všech herních funkcích. Záleží tedy jen a jen na vás, jak toto téma bude vypadat! [smilie--sprite1][BR][BR]Pokud se vám ale zdá, že některá témata jsou tzv. off-topic, stačí použít tlačítko Nahlásit, čímž nám dáte vědět, že nesouhlasíte s průběhem diskuze."}, {"63": "@Thepsia tak pokud víš, že je o tom někde samostatné vlákno, tak stačí napsat: \"Lidičky, už je TU (odkaz) diskuse na toto téma, tak pište tam, ať tu moc neodbočujeme od tématu...\" Já třeba na dotaz odpověděla tady, bo jsem netušila, že to téma je i jinde. Fórum je obsáhlé a bohužel nemám tolik času, abych tu listovala všemi možnými tématy"}, {"59": "Tak díky @iDavis máme alespoň tušáka, co bude, kdy to bude a fůru obrázků, včetně seznamů úkolů a nevadí mi, že zde diskutujeme i o jiných otázkách, vlákno se mi líbí tak, jak je [smilie--sprite1]"}, {"44": "něco nového, nějaká rasa na obzoru?"}, {"31": "Aktuálne informácie[BR][BR]Spoiler: Aktuálne informácieDnes vyšla nová novembrová epizóda InnoGames TV. To spustilo na beta fóre diskusiu na tému, kedy príde nová rasa, nakoľko nová epizóda o nej neobsahuje ani len malý náznak. Marindor sa k situácii vyjadril a čo sa týka novej rasy, jej vydanie ešte bude nejakú chvíľu trvať. Vraj až ju zavedú, pochopíme prečo bola medzera medzi touto novou rasou a 11. kapitolou dlhšia ako obvykle, prinesie totiž nejaké zmeny a nové funkcie, ktoré nie len že ovplyvnia stratégiu hráča ale budú aj vyžadovať skupinovú prácu pre udržanie progresu.[BR]Môj tip je, že novej rasy sa dočkáme začiatkom nového roka. Predpokladám, že obsahom decembra bude zimný event, ktorý sa na bete začne už koncom novembra. Zároveň spomenuli, že už čoskoro by sa mali začať Dobrodružstvá spoločenstiev (vraj už sa môžme pripravovať[smilie--sprite2]) a do toho tu ešte vchádza nová aplikácia, ktorá si tiež vyžaduje prácu vývojárov. Preto si myslím, že popri tomto všetkom už tento rok novú rasu nebudú pridávať, ale samozrejme všetko môže byť nakoniec inak.[BR]...[BR]Nová rasa ..........................................................................................................[BR]EDIT (6.11.): Pripravte sa! Na bete sa dnes začalo ďalšie kolo udalosti Dobrodružstvá spoločenstiev, predpokladám že na našom serveri sa začnú o týždeň neskôr, teda 13.11."}, {"31": "Prikladám pár obrázkov od hráčov z bety, ktorí narazili na pravdepodobne uniknuté prípravy na...[BR]Nadchádzajúce novinky[BR][BR]Spoiler[BR][BR][BR][BR]Máte nápad o čo by mohlo ísť? [smilie--sprite2][BR][BR]Zároveň pripomínam, že pravdepodobne v pondelok 13.11. sa začne ďalšie kolo udalosti Dobrodružstvá spoločenstiev. Podľa bety nás tentokrát čakajú ako odmeny pre prvé tri spoločenstvá hlavné budovy z udalosti Pochod stád (viac o nich nájdete tu). Je čas pripraviť sa. [smilie--sprite2][BR][BR]A ešte posledná vec, v príspevku vyššie tie bodky naozaj majú nejaký zmysel. [smilie--sprite2]"}, {"61": "106 teček = počet dní do nové rasy? [smilie--sprite8] 23. 2. 2018???[BR]mně ty obrázky přijdou prapodivné: evidentně se mu to objevuje u dolu na žulu v období trpaslíků, ale v tom tajemném bonusu jsou orkové, kteří patří až o dvě kapitoly dál. Taky stejný počet orků u všech je prapodivnost. Nevím, nevím, bojím se, ž to pro budoucnost nic neznamená. Ale tak šup šup neskeptici, pište, pište [smilie--sprite8]"}, {"60": "kdepak důl na žulu a trpaslící, to je poslední kapitola půlčíků [smilie--sprite8][BR][BR]//Odstraněna zbytečná citace, Iddun"}, {"61": "@klapa já myslel ten první obrázek [smilie--sprite2]"}, {"16": "iDavis napsal/a:\t\t\tprinesie totiž nejaké zmeny a nové funkcie, ktoré nie len že ovplyvnia stratégiu hráča ale budú aj vyžadovať skupinovú prácu pre udržanie progresu.\t\tKlikněte zde pro zvětšení...Z tohohle mám trošku obavu ... doufám, že to nebude znamenat znatelné snížení hratelnosti pro drtivou většinu aktivních hráčů, kteří nepatří mezi pár vyvolených top společenství.[BR][BR]//Upravena citace, Iddun"}, {"31": "@Lovec Krys spoločenstvo by to vraj nemalo vyžadovať. [smilie--sprite2][BR][BR]@Karindian o počet bodiek nejde. [smilie--sprite2]"}]