[{"91": "Tak ony menší události byly např. ty dýňové, ale ty mě nějak vůbec nechytly, když mě tykváč hokaido mořil s prapodivnými úkoly a dával urychlovače po 1min, občas nějaký ten 1VB, a odměny kromě finální budovy \"prakticky\" žádné."}, {"31": "@Pauleo no samozrejme som mal na mysli formát veľkých udalostí, akurát v kratšej dobe. Tie niekdajšie malé úkolové línie nepočítam, nie len že sa z nich nič poriadne nedalo vyhrať, ale neboli ani zaujímavé (ani mechanicky, ani po vizuálnej stránke). Som rád, že Innogames ich poslednú dobu tlačí do úzadia a ak by raz došlo k zvýšeniu počtu udalostí práve pre znížený počet úkolových línií (alebo ich úplne odstránenie), bol by som rád."}, {"91": "Ah tak, mě ty malé až tak nevadily, některým hráčům mohly pomoci, jiní je nehráli, jen bych uvítal možnost vypnout jejich aktivitu, popř. vypnout aktivitu událostí celkově, když je někdo nechce hrát. Upoutávky by zůstaly, další pro nákup briliantů by po deaktivaci už nechodily. Akorát bychom se takové funkce určitě během dvou let nedočkali [smilie--sprite1]. Tak ono to velkolepé dlouhodobé pojetí je možná záměr, když už do toho (vždy nově překvapivého nebo šokujícího) pojetí vloží čas, tak ať to nikdy nezůstane zapomenuto. Navždy si budu pamatovat, jak mě zruinovala předchozí událost na provinciích, a stejně tak jak mě vypékaly dárky v události této."}, {"160": "Ahoj všichni, dotaz k dobrodružství? Už se tak nejak ví dátum, kdy to začne na CZ? A pojede se u nás stejná mapa jako na bete? Nebo jsou to prozatím jenom dohady? Dekuju [smilie--sprite1]"}, {"31": "Dobrodružstvo je v tejto chvíli naplánované na 13.1."}, {"5": "Slniecko: většinou byla všechna DS stejná jako na Betě a pro DS je tu jinak jiné vlákno [smilie--sprite1]"}, {"31": "Rebríček veže spoločenstiev[BR][BR]SpoilerNa bete dnes prebehla malá aktualizácia, ktorá zaviedla zobrazovanie veže pre spoločenstvá v rebríčku, podobne ako turnaje alebo dobrodružstvá.[BR][BR][IMG]https://i.ibb.co/94z71Y4/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-spire-Spire-Multi01-png.png[/IMG][BR]Neexistujú žiadne odmeny za umiestnenia, avšak minimálne to umožňuje vidieť, ako je na tom spoločenstvo v porovnaní s ostatnými.[BR][BR]Na náš server by mala byť funkcia zavedená v priebehu najbližších týždňov."}, {"192": "A je žebříček viditelný i na mobilní aplikaci?[BR][BR]Odstraněna citace. Embla"}, {"31": "@Luciasek 7 II nie, tam zatiaľ dostupný nie je."}, {"31": "Na bete sa začína nová udalosť.. [smilie--sprite1][BR]Elvenarský karneval[BR][BR]Spoiler[IMG]https://i.ibb.co/K5Jw14R/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-carnival2020-Carnaval2019add-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]Mechanika tejto udalosti je založená na rotujúcich truhliach, tematicky kombinuje Karneval a Valentín. Hlavnou cenou je Valentínsky voz, ako rozvinuteľná budova.[BR][BR][IMG]https://i.ibb.co/2dFFQb3/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-carnival2020-Evo-Total-png.png[/IMG][BR]Všetky detailné informácie nájdete v nasledujúcich témach:[BR]Prehľad udalostiPrehľad nových budov"}, {"5": "Skvělé, kvituji ten návrat k rotujícím truhlám [smilie--sprite1] ...a ten Dragon Float a A Float of Bubbles vypadají graficky nádherně [smilie--sprite1]"}, {"16": "Dle prvních dojmů:[BR]Návrat je fajn, sice je trošku nepoměr mezi 86 a 161 bednami na šanci denní odměny (25% vs 30% za cenu dvojnásobku, což pro ty, kteří jdou po denních odměnách 161 bednu dosti degraduje).[BR][BR]Trošku mrzí ty urychlovače, ale alespoň máme věž (jsem si vědom důvodů, proč to udělali, ale to neznamená, že se mi to musí líbit).[BR][BR]Celkově to vypadá, že bude šance na zisk více denních odměn.[BR][BR]Všechny bedny mají šanci na denní měnu (obvykle 5-10%), takže šťastlivci si můžou přijít na své.[BR][BR]Denní pop/kult hybridy jsou jako vždy u karnevalu - po zimních peckách nezajímavé pro všechny ve stejné kapitole. To napraví až Venarova skaliska v dubnu (pokud budou, ale předpokládám, že ano).[BR][BR]Hlavní odměna bohužel pokračuje v tradici evolučních budov - hodně atributů a všechny špatné.[BR]Pokud už vývojáři nechtějí přidat větší bonusy (v tomto případě více many, semen, VB), měli by alespoň změnit poměr kultura / populace, který je u této budovy 2:1 ve prospěch kultury, kdyby byl 1:1 nebo 1:2 ve prospěch populace, už by ta budova byla pro spoustu hráčů přitažlivější.[BR]Takže ji zase spousta hráčů ponechá v inventáři a u těch, kteří ji postaví se moc neohřeje a brzo ji vymění (s výjimkou sběratelů, co sbírají vše a pak na nic nemají místo, když si nechají ve městě několik kapitol staré kulturky).[BR][BR]ps: Vrátily se denní úkoly, tzn. úkoláři jsou 2, jeden s hlavní úkolovou linií (bližší info zatím netuším, tzn. jestli je řada konečná anebo náhodná, a jaké budou segmenty apod.) a druhý nabízející každý den nový úkol za 35 eventové měny."}, {"20": "Tak to vypadá, že hlavní odměna bude zase o něco slabší, než ty poslední ... No nic, na něco si klikneme a uvidíme [smilie--sprite2]"}, {"158": "Valentýnský vůz je silnější varianta Stonehenge, jen místo kladiv dává mince a pokud je tedy ta produkce 24hodinová [smilie--sprite1]"}, {"16": "Jo a pokud se někomu nedostává semínek, vykašlete se na vůz a prostě si vyrobte jednoho festivalového obchodníka - dá víc semen než vůz (a je menší)."}, {"5": "...a asi již tradicí Studna přání hned první den jako denní odměna"}, {"20": "Je nepříjemné, že studna je hned první den, kdy člověk ještě nemá tolik \"vyděláno\". Sice bývá ještě jednou, ale bylo by lepší, kdyby první výskyt studny byl alespoň 3. den. Pro hodně lidí  je studna hlavní důvod, proč hrát event.  Nejlepší kulturku si postupně vylepšuji Královskou rekonstrukcí a vyměňuji už jen výjimečně.[BR]@Fjorgyn - Stonehenge už mám vylepšené a Valentiský vůz je v úrovni XV. kapitoly slabší.[BR]P.S. - je fakt, že pro Stonehenge mám slabost, protože se mi moc líbí [smilie--sprite1]. A po vylepšení na poslední úroveň je to celkem fajn."}, {"66": "U studen si můžem v klidu počkat na opakování. Pokud nebude něco lepšího na semínka, než kupci, tak mne asi bude zajímat výměna vysoce efektivních eventovek (Zimní hvězda, Venar III, Iglú festival, Jezírko jeseně/Manachajdy, něco lepšího na manu, než vánoční stromy). Protože mi věž cpe tolik kouzelných budov, že budu většinu plánků používat na jejich vylepšení a nezbude mnoho na královskou rekonstrukci.[BR]Z větší části se tyto eventovky vyskytují v zimních měsících, takže mě tady budou zajímat asi převážně studny.[BR]Atributy hlavní odměny jsou pro mne velkým zklamáním."}, {"158": "@Ludi a počítala jsi koeficient 1,7x, protože ten ti dělá to, že valentýnský vůz má všechny staty o kousek lepší (lidi, kultura, výroby semen) jen manu jsem nepřepočítával, protože ji nepotřebuji"}, {"3": "Prealiena napsal/a:\t\t\tProtože mi věž cpe tolik kouzelných budov,\t\tKlikněte zde pro zvětšení...neprovokuj hele [smilie--sprite8] já jedu pravidelně celou věž a zatím kápla jen jedna obytka.. [smilie--sprite3]"}]