[{"20": "@Fjorgyn - Ano, počítala jsem to tak. Srovnání obojího na úrovni XV. kapitoly.[BR]Stonehenge:  lidi 3570, kultura 7140, kladiva 84600 + kulturní bonus, mana 35020, semínka 3876, 4 VB/ 48 h.[BR]Valentinský vůz.: lidi 3230, kultura 6460, zlato 240 000, mana (zde x 1,8) 16020, semínka 1802, 3 VB/ 24 h.[BR]Valentinský vůz dává denně víc jen o 1 VB, ale je to ve formě placky do divů. STH má normální VB, takže je člověk může případně použít i do výzkumu.[BR][BR]@Prealiena  mě z Věže zatím padla jedna obytka a jedna dílna na CZ2, na CZ1 dvě obytky a jedna dílna. Jsem s tím spokojená.[BR]Elvenary už mám na CZ2 dost dlouho hotové, kulturu téměř všechnu vylepšenou, něco jsem vyměnila v zimním eventu, takže dobrý. Zbývají mi vylepšit asi jen 3 budovy z Karnevalového setu a na to mi stačí KR z turnaje. A pak už jen spořím plánky i KR, abych měla na další kapitolu.[BR]V konstruktech bylo vylepšování horší, protože když přišla Královská rekonstrukce, musela jsem některé věci vylepšovat o několik kapitol. Ale vyplatilo se. Tak dobré věci, jako se daly získat dřív, už asi nikdy nepřijdou. Nové rozvinutelné budovy mají stále slabší parametry.[BR]Městečko na CZ1 je jiná věc, tam jedu teď Orky, začala jsem tam hrát poměrně nedávno. Přesněji  jsem tam začala hrát v pauze mezi konstrukty a začátkem Elvenarů na CZ2."}, {"192": "Tak na Elvenarsky karneval se těším. Vypadá to skvěle [smilie--sprite1][smilie--sprite1]"}, {"31": "V tejto chvíli naplánovaný termín karnevalovej udalosti nájdete uvedený v prehľade."}, {"84": "Tak vzhledem k tomu, že mám dokončený výzkum elvenarů a téměř všechny budovy vylepšené, tak už mám vytipovaný úkol, který se mi bude neustále opakovat  - proveď výzkum technologie, nebo vylepši budovu na úroveň 16 a výš - to se v eventu daleko nedostanu..."}, {"16": "@karhol Není nic jednoduššího než si postavit pár lv15 budov, nejlépe obytek, na těch úrovních se nestaví o moc pomaleji než zbrojnice a na rozdíl od nich nežerou populaci (zbrojnice se staví rychleji, ale zase žerou populaci). (samozřejmě ten úkol nesmíš dostávat jako každý druhý)."}, {"158": "Podle mě je lepší stavět manufaktury T1, sice žerou trošku populace, ale jsou postaveny rychle. Já jsem takto točil manufaktury na prkna"}, {"84": "Tak jasný, nějaké budovy ještě mohu vylepšit a mám pár obytek teleportovaných do inventáře od poslední přestavby města, ale pamatuju jak se mi úkoly opakovaly minule.Ty nejhorší úkoly se opakovaly s železnou pravidelností max. ob dva úkoly.."}, {"72": "Jo, výroba zboží, to se točí pořád dokola."}, {"5": "Rovněž pro eventy raději vylepšuji pidimanuf. je to rychlejší a i skladnější do města"}, {"145": "Karneval 2020..., tak se mi na betě opět zredukoval počet sladkostí za úkol z nějakých 48 na 20, takže to si z minula kluci neodpustili [smilie--sprite3]"}, {"88": "@flego - Je to marný, je to marný, je to marný...  [smilie--sprite11]"}, {"5": "...počet sladkostí 20 = minimalizace rozdílů mez hráči...bič na ty aktivnější...žel"}, {"169": ":/ dělají to tvůrci eventu ze dělají se hry pomalu se rozkládající zhovadilost??????Vynaložit čas,prostředky kvůli něčemu za co dostaneme 20ks odměny????Šílený.Už to není jak kdysi.Hra nabrala směr kolapsu podle mého (งᵒ̌皿ᵒ̌)ง⁼³₌₃   Když se zavedla akademie kouzel na crafting byl to významný posun ve hře,pak dlooooouho dlouho nic pak spustili věž no a nejlepší novinka kterou vydali je věž společenství.Nic lepšího nevymysli proto i Eventy jdou s kopce,kromě FENIXE,jsou rozvinutkyy [smilie--sprite8] jenom náplasti,která zabírá zbytečně místo a i odměny v eventech jsou chudší.Nemá to za následek brexit? [smilie--sprite8]"}, {"3": "tak on by nebyl problém těch 20 kusů, kdyby třeba poměrně k tomu zlevnily i truhly. Ale když ta největší naopak zdraží až na 160... zdá se to být trošku mimo"}, {"31": "Odmena za jednotlivé úlohy sa na 20 zníži až potom, čo splníte základný počet 131 úloh. Dovtedy odmena priebežne narastá z 13 na cca 50 za úlohu. Tým sa základná časť úloh skončí a tak nasledujúce možno považovať za bonusové."}, {"169": "iDavis Bonusové by tedy neměli byt i rotace a získat cennější odměny?[BR][BR]Když budou nadále dávat tyhle poněkud ne příliš povedené eventy tj.budovy,odměny a získávání matrose na točení truhel,nezacnout lidi brát lidi samotný eventy jako rušivý element a budou radsi věnovat čas a úsilí svému městečku než samotný akci?[BR][BR]// Odstraněna citace. Příspěvky sloučeny. Jumala"}, {"16": "CrazyWolf Cz To záleží na tom, kolik lidí bude z eventu něco chtít nebo ne. A nemusí se jednat hned o ten hlavní odpad, jsou tam i další věci."}, {"169": "Lovec Krys VB,urychlovače se hodí všem ale já to myslel globálně.Aby se event nestal rušivým elementem[BR][BR]// Odstraněna citace. Jumala"}, {"114": "flego napsal/a:\t\t\tKarneval 2020..., tak se mi na betě opět zredukoval počet sladkostí za úkol z nějakých 48 na 20, takže to si z minula kluci neodpustili [smilie--sprite3]Klikněte zde pro zvětšení...[BR]že vy to tam na tý betě zase honíte [smilie--sprite8][smilie--sprite7] pořád vám říkám hezky pomalu......alevy nééé..., a potom to vypadá jak to vypadá, tak pěkně děkuji, teď abych se až to přijde sem taky jenom honila a honila [smilie--sprite4] ..kolik na betě zbývá do konce dní? na kolik už jste (v průměru) rozvinuli? [smilie--sprite1][smilie--sprite1][smilie--sprite1][smilie--sprite1][smilie--sprite1]"}, {"181": "@luterina: V kapitole 4 delam neustale  T1. A 4500 T1 pri 100/3h/manuf je docela vopruz. Budova na 16 je neresitelna, z vyzkumu se muze stat take nocni mura, protoze na bete docela vazne obchod.[BR]Prvni den jsem utratil, co jsem ziskal, studanku jsem nedostal, od te doby obcas neco utratim a denni odmenu nemam zadnou. Ono v te kapitole 4 stejne snad ani nic nechces.[BR]Byt beta muj jediny ucet, tak uz tu nejsem...[BR]Zboural jsem nerozvinutou pernikovku a postavil tenhle parez. Necekam, ze ho dostanu na 10.[BR]Proste z meho pohledu je to stejna bida jako predchozi 2 eventy.[BR]Mame sice zpatky truhly, ale jsou prazdne.[BR]Do konce zbyva 13 dni.[BR](ta beta je specificka, stejny ucet na cz1/cz2 by asi fungoval lepe)[BR]Jo a skoro v kazdy truhle jsou sladkosti a jeste se mi nestalo, ze by odtamtud nejaky vypadly. Dale mi prijde, ze po plose se jich generuje nejak malo."}]