[{"145": "@luterina: Jsem v kapitole víl, pařez mám na 5,a představte si,že mi v něm bydlí celých 200  lidiček[smilie--sprite1] Proto mám nějaké cukrátka našetřené,a čekám jen na slušnou denní odměnu, ať to můžu roztočit.Úkoly za 20 dělám opět převážně v T1, přijde mi to ale hodně ujeté...v osmi manufakturách( půl dne byly okouzlené) jsem nezvládl úkol za den... [smilie--sprite1]"}, {"16": "A když si postavíš 1 vílí obytku (obyčejnou), tak ti na poloviční ploše bude bydlet dokonce celých 510 obyvatel. Nebo jednoho dráčka z eventu, ten dává ještě asi o něco více, pokud má pro tebe kultura význam."}, {"145": "[smilie--sprite1] Já jsem ze začátkem eventu vstupoval do víl,tak si ještě musím chvíli počkat na vyzkum,ale k čemu by eventy byly,kdyby se nedalo sehnat něco zajímavějšího, než v základní hře? [smilie--sprite1][BR][BR]Pařez jsem dostal na konci trpaslíků, nečekal jsem, až se přehoupnu do víl, kvůli studnám (4),level 5 -200 lidí,400 kultura, mince, drahokamy...level 10-340 lidí,680 kultura,mince,drahokamy,3 VB do divů/den...[BR]Nevím,co by mě mělo nutit mít pařez na 10, asi jenom,abych ho měl,a odůvodňovat 20 cukrovinek jako vyrovnání mezi silnými a slabšími mi tu nějak nesedí [smilie--sprite1] poškozuje to všechny,a chci vidět hráče,co si koupí balíčky,aby se dotáhli na desítku [smilie--sprite1] ,jinak na krácení dlouhých chvil je to o.k.[BR][BR]Příspěvky sloučeny.  Embla"}, {"16": "@flego To je právě ono. Typická evoluční \"hlavní\" odměna poskytuje tolik bonusů a všechny tak slabé, že se pro jednotlivé bonusy vyplatí si postavit dokonce i standardní budovy, proto je taky nazývám odpadem. Kdyby těch bonusů bylo méně a byly lepší, nebo kdyby z nich alespoň udělali slušné pop/kult. budovy, tak by to hned bylo o něčem jiném.[BR]Takhle je spousta hráčů, kteří mají minimum evolučních budov (typicky ohnivák + medvěd(i)) a zbytek považuje jako já za odpad."}, {"145": "Je to jak říkáš, už se těším, až budu v dobrodružství bojovat o artefakt pařezu [smilie--sprite1][BR][BR]Odstraněna citace. Embla"}, {"31": "Na svoj kanál som nahral videá, v ktorých nájdete malé spomienky na niektoré z uplynulých udalostí (najmä pre tých, ktorí mali behom nich pustené zvuky [smilie--sprite1]).[BR]Woodelvenstock 2018Zimní kouzlo 2019"}, {"181": "Rozumim tomu dobre tak, ze se prechazi na bete na pevne stanovene ukoly a ze za to co mam rozdelane nic nedostanu ?[BR]Takze se budu dělat do zitra s mramorem a nic za to nedostanu [smilie--sprite4].   [BR][BR]Odstraněn nevhodný výraz. Embla"}, {"31": "@redking123 nuž, zjavne to tak naozaj vypadá. Už sa vypúšťajú oficiálne oznámenia pre live servery a v nich naozaj stojí \"akonáhle dokončíte úkolovú radu pre túto udalosť, môžete získavať ďalšie sladkosti otváraním tajomných objektov v craftingu\". Takže viac žiadne nekonečné úlohy."}, {"3": "no a máte to..."}, {"72": "Gretu na Vás!"}, {"181": "No jo zacina se od 1. ukolu (1 pivo) a odmena je ten parez. Proste, kdyz od zacatku, tak od zacatku, [smilie--sprite8] [smilie--sprite8] [smilie--sprite8] [smilie--sprite8] [smilie--sprite8][BR]Takze i kdyz ne uplne chci, tak dostanu druhy.[BR](skoda, ze taky nezacali  1. denni odmenou - studankou [smilie--sprite1] )"}, {"11": "nezačali?"}, {"181": "Ne. vypada to jako by tam hodili nejakou starou ukolovou sadu, ktera dava odmeny i mimo tech cukratek. (surky, zlatky a tak). iDavis to bude muset cele predelavat. ;-) 1 pivo, 2x 15min dilny, 1 relikvie, 2 strety, 200 ulomku, 10VB, surky, kladiva, 5 chlebu -  zhruba takhle. Zacina se na 21 cukratkach, ted jsem na 29. Zatim to vypada docela hratelne.[BR]A dela to na me dojem, ze to bude chtit neco prostoru na triplety manufaktur a dilny, ale to uz predbiham... [BR]Zrejme navrat ke klasice, asi hraci fakt hodne rvali (problem s otravnymi opakujicimi se ukoly) a oni  rezignovali na ten random generator. Takze tam vratili puvodni styl uloh v eventu. Podle me je to tak dobre, protoze ty 2 predchozi eventy mi prisli likvidacni (demotivacni) pro hrace v nizsich kapitolach."}, {"11": "jsem z toho nějak mimo, to jako na betě event zrušili a začíná se od začátku? A co ty odměny co jste dosud vyhráli ?"}, {"181": "NE[BR]Jenom uprostred eventu zmenili ukolovou radu a odmeny za ty ukoly.[BR]Puvodne byly ukoly stejne jako v posledni eventech. Tzn nahodne ukoly, nepovedene nahodne... No proste tak jako minule 2 eventy.[BR]Ted to zmenili uprostred eventu a dali pevne dany seznam ukolu jako byl treba v Karnevalu 2019 nebo Valentynu 2019. (ty ukoly se hodne podobaji tomu seznamu, co tam je) - viz tady na foru.[BR]Takze jsi dodelal ten puvodni ukol (v mem pripade 4500 mramoru, nic za to nedostal - bylo tam tusim 28 cukratek) a jako dalsi naskocil 1. ukol z te nove pevne dane rady. A vzhledem k tomu ze 1. odmena byl ten parez, tak jsem ho dostal podruhe. Denni odmeny se nemeni a pokracuje se dal v puvodni rade (asi teda) .[BR][BR]Tohle je na iDavise, jak ziska info o ukolove rade. Drzim palce.[BR]Takze ted by to melo byt postaru, s pripravou na jednotlive ukoly dopredu. Uvidime, jestli nebude nejake prekvapeni..."}, {"11": "a bude tam třeba manu a dílny dané kapitoly nebo bude stačit lvl.1?"}, {"19": "Na elvengems jsou již nové úkoly. Vypadá to že budou stačit budovy lvl 1, vzhledem k tomu, že obsahují výrobu na 48 hodin."}, {"181": "Jo a presne to sedi."}, {"114": "výborně, zrovna když jsem si ubrala místo a nahodila do města velké dílny a mnf, tak se pojede (i) na ty jedničkové, je to tak?[BR][BR](edit) tak pokud budou ty úkoly vyrob základní vzácné magické zboží, tak se budou hodit i ty velké [smilie--sprite1] a s omezeným počtem úkolů nikam spěchat nebude třeba, tedy ani sázet lány těch jedničkových...[BR][BR]jinak na betě po obnově úkolů z nich odměny včetně bonbónů dostávám..."}, {"194": "ahoj, nevíte jestli v tomhle nadcházejícím eventu vyrábějí kouzelné dílny 2x ?"}]