[{"145": "Přečti si diskusi k eventu..[BR][BR][BR]Dnes mám dvoudenní úkol.Nėjak mi to nesedí s denními odměnami.Bez diamantů nebo zesilovačů nemám šanci na dvě.Tohle je v pořádku v dobrodružství,kde se jede týden na odměnu,ale v eventu?.[BR][BR]// Příspěvky sloučeny. Jumala"}, {"194": "flego četl jsem, ale o kouzelnách dílnách tam není ani slovo. Proto se ptám zde. Nachápu, pokud to víš, prostě jednoduše neodpovíš[BR][BR]// Odstraněna citace. Jumala"}, {"145": "@MasterHawkeye Píše se tam, že pokud se dají použít jedničkové dílny,je to málo pravděpodobné[BR][BR]// Odstraněna citace. Jumala"}, {"160": "Ahoj, ja to hraju na bete a kouzelné dílny se nezapočítavají za dve.. Bohužel.. "}, {"11": "proč bohužel. Kdyby se počítaly, zase by si někteří stěžovali že modrokabátníci jsou zvýhodněni. "}, {"160": "Joo, tak to máš teda pravdu  Tak tedy je to fér aspon po týhle strane, že jsou na tom všichni stejne "}, {"16": "To máte jasné. Současné úkoly jsou narychlo udělanou kopií zhruba rok starých úkolů.[BR]Magické dílny se začaly započítávat až jako jedna z úprav na hráčské ohlasy úkolů vyžadující vysoký level dílen.[BR]Takže je logické, že úkoly, jenž jsou kopií starších úkolů, než ve kterých toto bylo implementováno je 2x započítávat nebudou."}, {"114": "Logické to je, ale tady nikdy nevíš čeho se ve hře dočkáš, pořád se tu něco přizpůsobuje hráčům a inovuje."}, {"16": "Na betě mám konečně rychlou sousedskou - zapnuli to všem.[BR]Pro ty, co už ji mají - žádná změna.[BR]Pro nás ostatní, co jsme byli vynecháni - konečně."}, {"90": "Tak na beta serverech začalo další DS a je to schéma E (stejné jako bylo minule na beta, od schématu D se liší jen cca o 50 % vyššími požadavky ) a odměny mizerné, artefakty jen pro Valentýnský vůz. Vše dle očekávání, bohužel."}, {"31": "Malá novinka v prispievaní VB do prastarých divov bola zavedená na bete..[BR][BR]SpoilerBude možné vidieť, koľko zostáva možných truhlí na odomknutie, pre jednotlivých hráčov (prispievateľov). Nebude tak viac nutné dohľadávať si túto informáciu na fan stránkach.[BR][BR][IMG]https://i.ibb.co/KG6wNWD/https-beta-forum-elvenar-com-index-php-attachments-capture-d-e-cran-2020-02-28-a-13-21-46-png-7002.png[/IMG]"}, {"128": "ElfMaGorr napsal/a:\t\t\tTak na beta serverech začalo další DS a je to schéma E (stejné jako bylo minule na beta, od schématu D se liší jen cca o 50 % vyššími požadavky ) a odměny mizerné, artefakty jen pro Valentýnský vůz. Vše dle očekávání, bohužel.\t\tKlikněte zde pro zvětšení...Ahoj,lze nekde dane schema dohledat?Predem DIKY"}, {"160": "\t\t\thttps://elvengems.com/fellowship-adventures/march-2020-adventure/\t\t[BR]Tu si najdeš schémata  Minule šla tahle verze taky na bete a u nás na live pustili verzi D, takže kdyžtak bych ješte počkala "}, {"43": "Jo tohle mi bylo líto,že nejsou vidět všechny zbývající truhly u divů.To je super. "}, {"31": "Na bete sa začína pokračovanie éry fénixov.. [BR]Shromáždění kultu fénixe[BR][BR]Spoiler[IMG]https://i.ibb.co/JrjpQ60/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-easter2020-Banner-Forum-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]Mechanika tejto udalosti je založená na rotujúcich truhliach, so zmenenými cenami a odmenami (tabuľku zverejním čoskoro v prehľade udalosti). Medzi odmenami budeme môcť nájsť nové požehnání na jednotky.[BR][BR][IMG]https://i.ibb.co/TWkq2Bt/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-easter2020-lightmeleeelves-png.png[/IMG][IMG]https://i.ibb.co/TKBJFXW/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-easter2020-lightmeleehuman-png.png[/IMG][BR]Novou rozvinuteľnou budovou bude Coldfire fénix (detaily budú nahodené čoskoro).[BR][BR][IMG]https://i.ibb.co/wzmTT78/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-easter2020-A-Evt-Evo-Easter-XX-Phoenix-Coldfi.png[/IMG][BR]Na rozvinutie nového fénixa budú potrebné nové artefakty, ktoré sa budú objavovať v hlavných cenách. Avšak, v úkolovej rade sa budú dať získať 3 artefakty na fénixov z minulého roka.[BR][BR]Všetky detailné informácie nájdete v nasledujúcich témach:[BR]Prehľad udalostiPrehľad nových budov"}, {"16": "@iDavis Máš vyzobané info z game files? Budou studny? První den nejsou - to může být +, jestliže budou alespoň v půlce anebo velké -, jestliže je nedají vůbec.[BR][BR]Ten fénix je, jak to říci slušně, velmi slabý.[BR]Zatím nevím, zda je produkce 24h nebo 48h, pro 24h je to slabé, pro 48h je to tragédie. Pro 24h by to měli alespoň zdvojnásobit.[BR]A ten krmný efekt je špatný vtip.[BR]14VB (pro moje město na betě v kap. 15) za nakrmení je špatný vtip. Průzkum na betě mi trvá přes 40h, tady kolem 75h. A když nakrmím něco jiného, dokážu proměnit 1 jídlo na stovky VB.[BR][BR]Doufám, že když nám zase dali konečnou řadu úkolů, že nám nadělili více měny než minule, nebo už s tím nemáme počítat, že bez stále těžšího DS můžeme na lv10 zapomenout? A půlka z nás bude mít smůlu a nedá ho na 10 ani s DS? (teda pokud by stál vůbec za to)."}, {"31": "@Lovec Krys vyzobané mám, ale či budú studne neviem (toto minimálne v klientských súboroch nie je). Každopádne už nebudú ani v hlavných cenách (namiesto všetkých budov budú rôzne požehnání (viď. prehľad)), tak hádam to pre denné odmeny znamená vyššiu šancu."}, {"160": "Tak začal nový event a první dojmy z toho jsou opet sklamání.. Teda snad to na naše live servy prijde v trocha lepším stavu, ale nejak nevidím smysl tyhle budovy.. Jediné plus vidím v tom, že má být možnost získat ješte 3 artefakty pro fénixe z loňského roku, ale jinak nevím, nevím teda a plne souhlasím s @Lovec Krys [BR]Tak teda uvidíme jak to dopadne tentokrát.."}, {"195": "Odkdy očekávat novou akci?"}, {"71": "koukam, že je to pořád dokola slabota a nedokáží vymyslet neco WAU .. jsem zvědavej co dají do upgradu č 2.0 .."}]