[{"20": "Jak jsem na to teď koukla na betu a elvengems.com, tak z toho mám dojem, že studnám odzvonilo [smilie--sprite3]. Ráda bych se mýlila. V odměnách mezi artefakty nejsou žádné budovy jako dřív - ani knihovnička atd. Prostě ty eventy jsou stále horší, DS taky."}, {"16": "@Sahti Tipuju 2-3 týdny po začátku na betě. Přesně to budou možná vědět lidi z Inna a spolupracující a možná ti, co se hrabou v klientských souborech hry.[BR][BR]Jinak další velké mínus jsou hlavní \"odměny\". Namísto obvyklých budov jen požehnání dávající tak 1/8 toho, co ty budovy (např. místo knihovny (až 100VB) jen požehnání 15VB), žádné studny v hlavních odměnách, atd..[BR][BR]@Ludi Ještě je šance, že budou jako denní odměny - uvidíme.[BR]Taky jsem jim tam napsal otázku, zda to má být test, kolik toho hráči vydrží, než se na to vykašlou."}, {"20": "@Lovec Krys - já vím, ale podle posledního eventu a celkového vývoje se mi zdá, že Inno chce Studnu postupně zlikvidovat nebo výrazně omezit."}, {"31": "@jacktenrek ak updatom 2.0 myslíš nadchádzajúcu verziu po 1.99, tak nebude to úplne tak, po 1.99 bude totiž nasledovať 1.100 (nepredstavuje to klasické desatinné číslo)."}, {"16": "2.0 by myslím znamenalo úplně novou hru Elvenar, což by bylo Elvenar 2 v. 1.0.[BR][BR]@Ludi Jo, i to je možnost."}, {"31": "@Lovec Krys novú hru to nutne znamenať nemusí, ale označenie 2.0 sa zvykne uvádzať aj po zavedení \"významných\" noviniek do hier."}, {"31": "Popis nového fénixa bol pridaný do tabuliek, odkaz nájdete v prehľade udalosti. Popis efektu a dodatočných informácií ešte pribudne. Prvýkrát priniesol produkciu živoucího zboží odvodenú od bonusového, takže potreboval som čas na doplnenie týchto parametrov do svojho skriptu.[BR][BR]Zároveň, začal som pre nové budovy udávať aj hodnoty pre 16. kapitolu. Ako vždy aj teraz platí, že to neznamená, že nevyhnutne musí 16. kapitola prísť behom udalosti. Je to len príprava pre budúcnosť, nakoľko sa tieto údaje v kóde už nachádzajú (už majú z novej kapitoly väčšinu hotovú [smilie--sprite1]).[BR][BR]EDIT: Efekt fénixa bol doplnený."}, {"20": "Dík za informace. Když už i já řeknu, že ta rozvinutelná slepice je opravdu k ničemu, tak to už je co říct ..."}, {"196": "Krom pandy kterou jsem nevylepsil na max jsem zatim postavil vsechny rozvynutelny budovy ale tuhle stavet rozhodne nebudu protoze i brana z mesicniho kamene dava vic zivouciho zbozi."}, {"19": "Tak ještě uvidíme, jaký bude mít efekt. Jinak je to vážně tragédie."}, {"11": "tak efekt už je známej ne?"}, {"66": "@voyager-1 Stále můžem doufat, že to před příchodem na live servery změní, kvůli zpětné vazbě.[BR]Když už jsme se tu univerzálně klidně shodli, že je ten nový fénix na nic. (Vážně, dlouho jsem nezažila tak mírumilovné přijetí eventu.)"}, {"11": "myslíš těch 14 VB za průzkum provincie? Trochu pochybuju že to změní. Bez nutnosti použití krmiva by to v nižších kapitolách mělo i nějakej smysl."}, {"197": "Mně pořád ještě průzkum provincie trvá méně než 24 hodin, takže bych na 1 nakrmení mohl získat 28 VB bez použití urychlovačů. Ani tak fénixe asi nepostavím.[BR][BR]Jen si říkám, jestli by aspoň fénix nemohl dávat VB při spuštění průzkumu místo při dokončení. Pro hráče s dlouhou dobou průzkumu by jistě bylo lepší nakrmit fénixe a spustit průzkum, než spustit průzkum a pak si pamatovat, že za 2 nebo 3 dny má nakrmit fénixe."}, {"88": "@Prealiena: spíš bych to viděla jen na \"přijetí eventu\". Vzala jsem na vědomí, že bude další \"recyklovaná událost\". Mají xx stránek podnětů od nás, hráčů jak na betě tak na cz. Já osobně jsem se k eventům otevřeně vyjádřila i do \"Osobnosti Elvenaru\"... A po tom všem, \"nový\" Fénix na nic, bez studen a budov? Má cenu ještě něco psát? [smilie--sprite11] [smilie--sprite5] Prostě beru na vědomí, že bude. Nic víc, tečka.[BR]@Victorious1722: s tím průzkumem to máš stále ještě skvělé, já už nejdu pod 4 dny a 11 miliónů peněz (peníze jsou ovšem problém zcela minoritní)."}, {"181": "Tak tech 14 VB dava smysl pro hrace v nizsich kapitolach. Pokud ovsem maji cim krmit fenixe a pokud ho dostanou na lvl 10. [BR]Jestlize to ma byt krok jak dat neco novym hracum, tak je to dobry krok. [BR]Na druhou stranu se nemuzu zbavit dojmu ze Ino tuhle hru odepsalo.[BR]Apka se nevyviji, zmeny v prohlizecove verzi (hodnotim kladne jak zobrazovani odmen, tak i zrychlenou motivaci) z ni delaji nouzovku. Vsechno  mi to prijde, ze je delane stylem \"mate na to den, tak se s tim moc nepatlejte\"."}, {"44": "Ahoj, už je někdo odkaz na novou rasu a kapitolu? Děkuji"}, {"16": "@martin2007 Ne."}, {"74": "Kult Fénixe raději ani nekomentuji. Než by nechali stejnou sadu jako loni a umožnili získávat rozšíření i pro jiné Fénixe, tak zase vymysleli \"ptákovinu\".... velmi velmi ale jen velmi drobná útěcha je, že je šance až na tři rozšíření stávajících Fénixů...."}, {"193": "A opět je tam u výroby to pravidlo, že se musí provádět jen v budovách odpovídajícího levelu?"}]