[{"31": "@Ereandil nie, odkedy sú konečné úlohy, táto podmienka sa nezvykne realizovať."}, {"19": "Trošku k tomu svádí to, že úkoly na manufaktury jsou maximálně na 9 hodin."}, {"16": "Když dostanete úkol na produkci velkého množství zboží/kladiv, tak to stejně v lv1 manufakturách nevyprodukujete.[BR]Ale jo, lv1 budete potřebovat taky.[BR]A úkol na produkci kladiv 3x po sobě (něco z toho možná splnitelného i požehnáním) je taky mňamka.[BR]A úkol na produkci velkého množství T1 (potřeboval jsem všech 7 T1x9h okouzlených, abych to na betě splnil) následovaný úkolem na produkci ještě většího množství T1 nebo T2 je taky zábavný.[BR]To vypadá, jako kdyby nám ti vývojáři dělali vyloženě naschvály (asi za to, jak jsme nadávali, že se při náhodných úkolech úkoly opakují, tak nám je opakují i při fixních úlohách). [BR]Akorát nevím, zda si uvědomují, že čím více naschválů hráčům budou dělat, tím více hráčů se naštve a půjde hrát něco jiného."}, {"181": "@Lovec Krys Tak tady jsou 2 problemy ktere nejsou resene:[BR]1. udrzet stare hrace. Ja uz to hraju ciste ze setrvacnosti. Cekam na 16. kapitolu a ocekavam, ze to bude horsi nez 15.[BR]2. udrzet zacinajici hrace. A tam je to tezsi, protoze ty tu nic nedrzi. Vsechny nove veci maji horsi pomer cena/vykon nez stare. Fenix je neresitelny (3 artefakty te nevytrhnout i kdyz to mozna zmeni - viz dnesni announce na bete). Na otazku, kde vzit manu, seminka odpovidas \"to resi stare sety, ktere uz se sehnat nedaji\".[BR]A dal z meho pohledu:[BR]- pravidla, ktera stejne nejsou vynucovana.[BR]- cena za dia v browseru a apce.[BR]- zniceny obchod diky kapitole 15.[BR]- nemoznost ziskat 9 artefaktu v eventu (teda pokud nepadne 20x 500 tech blbosti, co se sbiraj)[BR]- demotivujici DS, ktere se hraje nejkratsi cestou, at to mame z krku.[BR]- vyzvy bez zajimavych odmen[BR]- apka, ktera je stale nouzovka a nove funkce v prohlizeci z ni jeste vetsi nouzovku delaji[BR]Abych nebyl uplne negativni, potesilo me zjednoduseni motivace hracu a zobrazovani odmen v divech.[BR]Jinak asi nejsem tak daleko v eventu, ale zatim mi ukoly neprijdou az zas tak hrozny. Uviidime jak to bude dal,  ted zrejme zmenili odmeny, tak uvidime."}, {"181": "Vypada to, ze vyvojarum z Inno definitivne hrablo [smilie--sprite12][BR][IMG]https://i.ibb.co/PMcsRjH/https-cz-forum-elvenar-com-index-php-attachments-fenix-jpg-4309.jpg[/IMG][BR]Akademie kouzel:[BR]artefakt fenixe (ten puvodni) = 2 artfekty fenixe (noveho) + 5 katalystu[BR](nebo naopak stary za novy ?) [smilie--sprite10]"}, {"94": "No tak myslim, ze po necem takovem se docela volalo..."}, {"91": "Takže kdo nechce nového Felixe může doplnit část starého? Asi ano."}, {"11": "asi tak, plno hráčů co před rokem byli malí hráči a získali jen 3-4 artefakty si ho konečně budou moct vyvinout.[BR]Moc dobře vymyšlený."}, {"31": "Na bete prebehli dodatočné zmeny v zadaní niektorých úloh nadchádzajúcej veľkonočnej udalosti. Ak ste sa už pripravovali podľa predchádzajúceho zoznamu, doporučujem pozrieť si aktualizovaný zoznam."}, {"160": "A začátek ješte asi nevíme, že?"}, {"2": "Já dofám, že převod mezi artefakty rozšíří, mám dost takových které jsou mi k ničemu a naopak fenixe a medveda se mi nedostává."}, {"5": "...a opětovné zprůměrování všech hráčů, at´máme všichni stejně a všichni vše podobné, včetně měst a budov v něm [smilie--sprite1]  degradace minulého náročného eventu Fénixe"}, {"3": "ElfNostradamus napsal/a:\t\t\tdegradace minulého náročného eventu Fénixe\t\tKlikněte zde pro zvětšení...úplně bych neřekl, druhého ptáčka ohniváčka stejně nikdo, kdo ho doteď neměl, nezíská (nebo snad půjde získat i ten samotný ptakoš?)"}, {"94": "ElfNostradamus napsal/a:\t\t\t...a opětovné zprůměrování všech hráčů, at´máme všichni stejně a všichni vše podobné, včetně měst a budov v něm [smilie--sprite1]  degradace minulého náročného eventu Fénixe\t\tKlikněte zde pro zvětšení...Proc zpumerovani proste dalsi sance pro vsechny, ty saze muzes jit po necem jinem. Kdo to nedal loni a bude chtit lonskeho dotahnout do konce, bude zase muset ozelet toho letosniho...[BR]Nemuzes prece chtit nejake vyhody jen s toho, ze jsi zacal drive..."}, {"11": "jo, ohnivák je dost klíčová budova a je jasný, že i ti, před rokem menší hráči by měli mít možnost ho vyvinout. A argument že se mohla dát alternativní budova taky nefunguje, protože tu by zase mohli získat všichni."}, {"181": "Tak 2. ohnivaka asi nikdo nema, nicmene v 15. kapitole se hodil i ten modry.[BR]Tady jde o to aby tohle ziskali novi hraci. Ja si myslim, ze handlovani artefaktu mezi sebou je  k nicemu. Kdyz nic jineho, tak to degraduje tu budovu. (jo jasne mam artefakty od pernikovky i stonehenge)[BR]V tom eventu ziskas 3 artefakty stareho + X artefaktu noveho. Kolik to X muze byt? 6, 8? Takze jses na 7 artefaktech stareho.  Furt malo a furt velmi drahe.[BR]Proste ja si myslim, ze ty artefakty by meli byt volne v akademii. Fenixove tam taky jsou.  A vsem to da moznost postavit vsechny 3 fenixe.[BR]Zprumerovani hracu? To si hrajem na elitu, jen proto, ze to hrajem trosku dele?"}, {"88": "Ne, to si \"nehrajeme na elitu\". Ti z nás co hrají déle, tomu věnovali svůj čas (který si jak známo jediný nekoupíš) a nemálo z nich i peníze do dia. Prostě jako ve sportu, třeba v hokeji. Je pár hráčů kvality Hašek, Jágr, Messier atd. a pak spousta neznámých \"obyčejných\" hráčů..."}, {"31": "V tejto chvíli naplánovaný termín fénixovej udalosti nájdete uvedený v prehľade.[BR][BR]"}, {"181": "Jenze tady je to nastavene tak, ze Hasek, Jagr, Messier hrajou s hokejkama (protoze je kdysi dostali)  a ti, co prijdou ted  s klackama (protoze nic jineho nedostanou). To je asi tezko prekonaj.  [smilie--sprite2]"}, {"145": "V tom případě by měla hra běžet jen na jednom určitém druhu telefonu,aby se to někomu náhodou nesekalo.Ti,co začali dříve taky určitě neměli tolik portálových bonusů, se kterými se dá projet hra bez stresu a místa... srovnávate nesrovnatelné [smilie--sprite1]"}]