[{"145": "redking123 napsal/a:\t\t\tJenze tady je to nastavene tak, ze Hasek, Jagr, Messier hrajou s hokejkama (protoze je kdysi dostali)  a ti, co prijdou ted  s klackama (protoze nic jineho nedostanou). To je asi tezko prekonaj.  [smilie--sprite2]Klikněte zde pro zvětšení......a co takhle M. Sáblíková , bez haly na rybníku?"}, {"88": "@flego: Jasně. Každý nováček si prostě musí \"odsloužit\" nováčkovské období. Každý nějak začínal - ve hře i ve sportu. Rovnost mezi hráči prostě neexistuje. Ještě jeden příměr ze sportu: když rozdám všem hráčům z první 50 tenisové ATP stejné průměrné náčiní (vedena jakousi zcestnou myšlenkou \"rovnosti\") vznikne jen a jen škoda, nikdy užitek."}, {"145": "@Vicky1177 :to je pravda,ale i tak se po čase projeví talenty,a ti průměrní zapadnou,ale jak bylo psáno o trochu výš,taky obrovský vliv bude mít tréning a čas tomu věnovaný [smilie--sprite1] (beru nováčky)[BR]Setové budovy,jako fontána hýřilů, ledový vánoční strom, pochodový orchestr dnes už asi neuvidíme,ale na druhou stranu se mi zdá, že se hra tak nějak zjednodušila,viz avizované portálové bonusy, poměry obchodu, dosažitelné urychlovače ve věži,v kraftu...,toť můj názor [smilie--sprite1]"}, {"11": "@flego ano, srovnáváš nesrovnatelné, bez těch port. bonusů se dá hrát, pravda o něco pomaleji, ale bez ohniváka se hráčům s ním, nikdy nevyrovnáš."}, {"145": "@voyager-1 : Pro mně byly bonusy zásadní změnou posledních kapitol,a to hlavně ušetřeným místem pro jiné budovy, než co se staví k portálům.Záleží z jakého úhlu pohledu se na vyrovnání díváš.Pokud z toho,jak je tvůj ohnivák potřebný společenství v turnaji,nebo ve věži, když ne všechna společenství mají ambice na přední příčky a nebo(což si myslím, že je u většiny hráčů nahnat co nejvíce bodů-i když né každý si to přizná)pak ano,ale v žebříčku bodů se nemůžeš rovnat městům přeplněným kouzelnými obytkami a dílnami."}, {"11": "tak ty bonusy byly změna i pro mně, ale tu možnost je  získat měli všichni. Jinak se s tím dá souhlasit co jsi napsal, město přecpané modrýma budovami není můj cíl protože je to jen o penězích. A zapomeňme na ohniváka, bonusy a všechno kolem protože vítězové budou jen ti co do toho narvou nejvíc prachů [smilie--sprite1]"}, {"158": "@voyager-1 nemáš pravdu, toto už dávno neplatí, Diamanty jsou již běžně získatelná surovina a kouzelné budovy padají z věže."}, {"145": "@Fjorgyn : Volně přístupné,asi jako kaviár v chudinské čtvrti,a o dva bloky dál si ho dávají jako přílohu k humrům [smilie--sprite1] a kouzelky neovlivníš,jenom můžeš jít naproti a doufat[BR][BR][BR]V tom mají velcí hráči výhodu, že po turnaji a věži si nezdecimují armádu a zásoby,tolik potřebné k dalšímu vývoji,ale samozřejmě nikdo nikomu nebrání,aby se časem stal \"velkým hráčem\",jen se postupuje jinak ve společenství,kde pravidelně otevírají 10. truhlu, sbírají dva artefakty v dobrodružství,a jinak ve společenství (kterých je většina), kde se jede tak nějak se setrvačností,nic se nehrotí,a když vypadne z věže 50-ka diamantů,tak se jim rozzáří úsměv. Navíc si moc dobře vzpomínám,jak jsem měl kouzelku tuším na čtyřce (tenkrát se rozdávali plošně jako náplast už nevím za co) a velmi nerad jsem se s ní loučil, protože už nestačila normálním obytkám.A kupovat obytku ve vývinu (třeba za dia ze studen),a počítat s tím, že časem už nebude tak super a nezapadne tvarem mezi ostatní,si každý rozmyslí (dílny taky). V tom má hráč na na konci výzkumu opravdu výhodu. Takže k původní diskuzi- to neznamená, že když jsem nebyl někde,kde se něco rozdávalo, že na to mám morální,nebo jakékoliv jiné právo.Prostě dort se nakrájel,rozdal,a pro další nové hosty zbyly jen drobky...[BR][BR]// Příspěvky sloučeny. Jumala"}, {"88": "flego napsal/a:\t\t\tto neznamená, že když jsem nebyl někde,kde se něco rozdávalo, že na to mám morální,nebo jakékoliv jiné právo\t\tKlikněte zde pro zvětšení...[BR]Naprostý souhlas. Prostě když jsem nebyla u krájení dortu, je to můj problém. Tečka."}, {"158": "@flego nemáš pravdu, stačí se podívat na mumuland & ZOO, Ti dělají kompletně věž na všechny odměnu a to znamená zapojení minimálně 20 členů, kteří dají věž až do konce. A toto společenství rozhodně neobsahuje \"velké\" hráče z pohledu velikosti města. Ale klidně se jich poptej jak dokážou ty malé města nahrát tolik pater.[BR][BR]Celkově je to o tom hledat cestu, jak něčeho dosáhnout. Ano je snadné si říci, že ostatní to měli lehčí a tak si jen dál brblat."}, {"11": "@Fjorgyn  no,hlavně že Ty máš ve všem pravdu, nějakejch 150k diamantů aby sis koupil všechna rozšíření jen tak ze hry nezískáš, věž dělám každou min. dvě patra a dílna mi ještě nepadla žádná, obytek asi 6. Navíc možná nastává soumrak studní."}, {"158": "@voyager-1 já pouze odkazuji na reálné společenství, které má jen 5 hráčů nad 200k bodů zbytek je 100k a méně a Ti odehrají věž na všechny patra a dělají to pravidelně, což dá 225dia týdně čistého většině + bonus co padne z bran. Když už máš potřebu přejít do úrovně osobních útoků, tak alespoň používej validní argumenty, protože co jsi schopen nahrát nemusí být evidentně nutně vztaženo jen k ploše, kterou máš k dispozici. [BR][BR]Každopádně hra se vyvíjí, možnosti hráčů se mění a stejně tak co nebylo možné předtím (tedy bylo závislé jen na peněžní investici), již neplatí a NYNÍ každý hráč má možnost získávat kouzelné budovy/ diamanty ve hře tím, že hraje!!!   Můj jediný argument, který používám i s důkazem je to, že možnosti tu jsou  pro všechny a tím myslím úplně pro všechny."}, {"16": "Ony menší města (pokud jsou na to přizpůsobená) mají lehčí věž (na výkup) než pokročilejší města, jenž jsou silně penalizovány např. počtem a úrovněmi divů, taky to po nich chce spoustu prošlého zboží, semen a orků, což po malých městech nechce a základní suroviny potřebují jen mince a kladiva na výrobu, nepotřebují semena.[BR][BR]@Fjorgyn Pokud se zruší nebo silně omezí studny, nemá nový hráč pouhým hraním šanci získat 150k dia ani po 20 letech aktivního hraní (a využitím všech možností ve hře jak je získat)."}, {"158": "@Lovec Krys trošku ad absurdum, nemyslíš. Teoreticky by jsi musel získat 300 studní, při 100% pravidelném sběru a reálných 10% pravidelných dropech 25 dia, aby jsi získal 150k dia.  To je dost extrémní číslo i na počet studen v jeden čas ve městě. Kdyby jsi vyhradil pozemek 10x10 rozšíření, tak na 100 dnů ti tam zůstane jen místo na hlavní sídlo a nějakou drobotinu a i tak by jsi tam měl místo jen na 266 studní."}, {"88": "@Fjorgyn : U odkazu na reálné společnenství pleteš (promiň, ale jo) hrušky s jablkama... [BR][BR]Že někdo (zřejmě) obchází pravidla nebo využívá nějaké skuliny, je věc jiná a není to téma této debaty. Kde není žalobce, není ani soudce. [BR][BR]Prostě hra byla v 01/19 taková a v 01/20 maková... A nikdo opravdu nemá jakékoliv právo dožadovat se v 01/20 stavu z 01/19. To bylo osobní rozhodnutí toho každého hráče, kdy začne hrát. [BR][BR]Příklad z RL (není můj, mám to od bráchy): Kdesi měli reklamní akci na auta. Nabízeli jediný model v jediné výbavě za velmi slušný peníz. A na diskusním fóru jeden exot vyvolal flejm, že jemu to takhle nevyhovuje a že by chtěl za tu cenu jiný (samozřejmě dražší) který by mu vyhovoval a ještě nejlépe s dárkem od prodejce. Ten ať to v rámci \"vstřícnosti k zákazníkovi\" okamžitě zařídí. Výsledek: prodejce se prozíravě nevyjádřil a autor se tam do krve hádal snad celý den, jaká je to nespravedlnost. I když byl sám proti minimálně 10 oponentům, kteří se mu to buď snažili vysvětlit zleva/zprava nebo se do něj strefovali slovy nepublikovatelnými... [BR][BR]Omlouvám se za delší, mírně OT příspěvek, ale bylo potřeba kontextu."}, {"145": "Jak píše Fjorgyn-Celkově je to o tom hledat cestu, jak něčeho dosáhnout.[BR]...Je to jak v životě, miliardáři taky nezbohatli poctivou práci ,a přesto z nich nikdo neseděl, takže například mít ve městě nad 15 dílen se mi zdá luxus a mrhání místem... mít jich ve městě permanentně 100 už je přinejmenším podezřelé [smilie--sprite1] ale toto právě většina nedělá, takže vybrat společenství, které má k tomuto úkolu strategicky postavené města je jako najít jehlu v kupce sena.Tím nechci osočovat spol. mumuland & ZOO,jsem na mobilu,nedíval jsem se, zázrak je už jen mít 20 aktivních členů ve spol...[smilie--sprite1] ale jaké by byly jejich možnosti bez cestiček v pravidlech, tady by se ta výhoda velkých měst ukázala,a to je v pořádku. Já  taky zajedu druhé patro vždy, a sem tam do konce věže,ale pak si vždycky lížu rány..."}, {"3": "pokud někoho věž chytne, tak ji prostě dělá. U nás ten top pravidelně jezdíme cca v 7-10 lidech. Kupodivu jsme taková parta, že nevěžníků máme jen pár a ostatní jedou třeba dvě patra, takže celkově většinou dáme kolem 1050 bodů. Prostě je to sranda [smilie--sprite1]"}, {"114": "taky se dají \"rozložit síly\", dávat méně v turnaji, tak aby stačilo na 10 truhel a více investovat a dávat do Věže až na její vrchol [smilie--sprite1] dvě naše členky nijak extra nedají do turnaje, na rozdíl od jiných extra v něm výkonů, ale začaly dávat celou Věž, také jde vyladit si město jenom na vojáky turnaj a suroviny investovat jenom Věž [smilie--sprite1] a asi by se našlo těch modelů i více..."}, {"145": "Myslíte, že ještě stihnou zařadit studnu do denních odměn?, je tu ještě nějaký \" čekač\" jako já?. Začínám být z toho nervózní,abych pak netočil 1VB,nebo něco podobného [smilie--sprite1]"}, {"31": "@flego začínam mať obavy. Dokým nebude na bete posledný deň, nič samozrejme nie je isté, ale v rámci tejto udalosti sa rozhodli nerfnúť viacero vecí (najmä zesilovače), takže je otázka, či studne nie sú medzi nimi."}]