[{"3": "počítal bych spíš s tím, že studna nebude. Ani nevím, jak to bylo na betě, jestli byla alespoň mezi hlavníma?"}, {"16": "Ne. Hlavní odměny jsou totálně na nic. (např. 20VB místo knihovny apod.)[BR][BR]Odstraněn nevhodný výraz. Embla"}, {"181": "Podle me studny nebudou. Z hlediska byznysu INNO je to nesmysl. Ale mohli jednu dat mezi ty postupne odmeny.[BR]V tomhle eventu je spis zajimava novinka davajici 5 oddilu vojaku z kasaren (jde to do inventare, ne ze rovnou dostanes vojaky).[BR]Odmeny - v 15. kapitole tam nic nevidm, v nizsich lze nahradit to, co clovek dostal v minulem eventu (pokud postoupil o kapitolu vys).[BR](obcas je zabavnejsi byt v nizsi kapitole, nez byt v  15. a cekat ... na co vlastne? )[BR]Jo jinak lze ziskat 3 stare artefakty fenixe a zrejme moznost ziskat dalsi stare vymenou za nove z tohoto eventu. (ale podle me jich 9 dohromady nedate i kdyby jste se rozkrajeli.) [BR]Jo a posledni vec  - zda se mi, ze tech vajec/diamantu na plose se zase objevuje o neco min nez minule?  (jestli 10 denne, tak je to hodne)"}, {"16": "@redking123 Ty požehnání na oddíly jsou jen další snížení odměn. I po odečtení medvědů a všech divů z nich získáš méně vojáků než z těch urychlovačů, co tam předtím byly.[BR]Tenhle event se prostě snižováním odměn za stejnou práci prostě jen hemží.[BR]Asi si někdo odpovědný myslí, že čím méně nám dají, tím více budeme platit? (uvědomují si vůbec, že jsou taky jiné hry a spousta hráčů si při tom může říct, že raději půjde hrát něco jiného?)."}, {"181": "Jasne pro hrace na konci vyzkumu ty pozehnani asi moc nebudou, lepsi by byly urychlovace. Pro hrace rekneme v 6. kapitole (kdy nejspis nemas nic, hlavne nemas kladivka) se snad muzou hodit. Prislo mi  to jako zajimava vec.[BR]U starych hracu lze spolehat na \"leta jsem to budoval, prece to ted nezahodim\". (podle me  dost spolehlive). A krome toho jses nejspis i ve velmi dobrem spolecenstvi. Je to zavislost a k ukonceni musis dospet (tak jako jsem kdysi prestal kourit). Takze mi  prijde pravdepodobnejsi zalozit si dalsi ucet a hrat to od zacatku, nez to zabalit (kdyz uz se clovek nudi na konci) Ono diky tem vsem zmenam se to chova trosku jinak.[BR]Jinak jeste k eventu. Prisel mi jako jeden z tech jednoduchych.  Jsem teda teprv u nejakeho 103. ukolu  a neni to honicka, lze i bez planovani, trosku mista navic se hodi na nejake ty manu a dilny lvl 1. A nezda se mi, ze by to vychazelo na 9 artefaktu."}, {"16": "@redking123 Já jsem od skončení daleko, ale spousta dalších nebude.[BR]S 9 artefakty nepočítej, nebude to lepší než minulý event, možná i horší.[BR]Já se nenudím, naopak, doufám, že nová kapitola přijde co nejpozději (nic dobrého od ní nečekám a zatím si můžu v klidu vylepšovat divy a optimalizovat vesnici, abych byl schopen pravidelně dávat celou věž bez ohrožení turnajových výsledků, což mi nová kapitola akorát ohrozí)."}, {"31": "Malý update k dnešnej otázke, či možno očakávať studne. Studne nebudú. (Táto informácia je súčasťou oficiálnych oznámení, ktoré sú pre túto udalosť vypúšťané (čoskoro nám ho teda zrejme dajú do oznámení))."}, {"145": "@iDavis : díky za jasnou odpověď, zařídím se tedy podle toho..."}, {"196": "Tak snad budou aspon 30 prastare vedomosti."}, {"31": "Nová kapitola prichádza na betu! [BR]Kapitola 16: Ambasády[BR][BR]Spoiler[IMG]https://i.ibb.co/DQvc1dC/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-chapter16-Elvenar-Embassies-Ann-png.png[/IMG][BR]Predpokladaný termín príchodu na náš server: v priebehu nasledujúcich týždňov[BR][BR][IMG]https://i.ibb.co/gPYDmP6/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-chapter16-banner-ch-16-png.png[/IMG][BR]V novej kapitole sa znova stretneme s trpaslíkmi a vílami. Výskum bude obsahovať nové vylepšenia hlavního sídla, obytných budov, dielní, manufaktur na kryštály, svitky a hedvábí, zbrojnice a ďalších.[BR][BR]So zavedením kapitoly budú dostupné 2 nové rozšírenia za diamanty, 2 z výskumu a 1 dodatočné za dokončené provincie (500 provincií).[BR][BR][IMG]https://i.ibb.co/SBjTWGf/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-chapter16-EM-Ancient-Wonder-4x5res-png.png[/IMG][IMG]https://i.ibb.co/yqnGFQp/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-chapter16-EM-Ancient-Wonder-6x4res-png.png[/IMG][BR]Novými prastarými divmi budú Turnajový prostor a Knihovna věže. Ich efekty budú nasledovné:[BR][BR]Turnajový prostor[BR]Poskytuje body do rebríčka za každú odomknutú turnajovú truhlu vašim spoločenstvom (0.5 až 15 za truhlu (podľa úrovne), lineárny rast)Každé 3 hodiny produkuje jednotky Včelí jedovaté jezdkyně (v množstve rovnakom ako každý iný div produkujúci jednotky)[BR]Knihovna věže[BR]Poskytuje body do rebríčka za každý odomknutý kryštál vo veži večnosti vašim spoločenstvom (0.5 až 15 za kryštál (podľa úrovne), lineárny rast)Produkuje VB každých 24 hodín (1 až 6, podľa úrovne)[BR][BR]V spoileri nižšie nájdete grafiku nových budov, ktoré budú dostupné touto kapitolou.[BR][BR]Spoiler: Grafika nových budov[IMG]https://i.ibb.co/chv8Mhx/https-i-ibb-co-GJx-K5-GV-EL-kapitola-16-budovy1-png.png[/IMG][BR][IMG]https://i.ibb.co/cJbZtB9/https-i-ibb-co-PTz-Yr-Y1-EL-kapitola-16-budovy2-png.png[/IMG][BR][IMG]https://i.ibb.co/8MbcqkY/https-i-ibb-co-qyr-RBrg-EL-kapitola-16-budovy3-png.png[/IMG][BR][IMG]https://i.ibb.co/KVWtZd2/https-i-ibb-co-b26-YTy5-EL-kapitola-16-budovy4-png.png[/IMG][IMG]https://i.ibb.co/CtJxH02/https-i-ibb-co-w-CCSYLk-EL-kapitola-16-budovy5-png.png[/IMG][BR][IMG]https://i.ibb.co/vjk5qBD/https-i-ibb-co-f-GBrp-V4-EL-kapitola-16-budovy6-png.png[/IMG][IMG]https://i.ibb.co/hLrcDBD/https-i-ibb-co-t-Q0-Rq5-N-EL-kapitola-16-budovy7-png.png[/IMG][BR][BR][IMG]https://i.ibb.co/HHn9J1n/https-i-ibb-co-27j-CWx-F-EL-kapitola-16-budovy18-png.png[/IMG][BR][IMG]https://i.ibb.co/Mf3p428/https-i-ibb-co-tb-XGYC0-EL-kapitola-16-budovy17-png.png[/IMG][BR][IMG]https://i.ibb.co/dg0Ds89/https-i-ibb-co-L01-DCRv-EL-kapitola-16-budovy16-png.png[/IMG][BR][IMG]https://i.ibb.co/s6zW21k/https-i-ibb-co-NNCGBXk-EL-kapitola-16-budovy15-png.png[/IMG][BR][IMG]https://i.ibb.co/PxBrjhj/https-i-ibb-co-Fqs-ZV5s-EL-kapitola-16-budovy14-png.png[/IMG][BR][IMG]https://i.ibb.co/JFV0rR6/https-i-ibb-co-fkq-Gv-Rb-EL-kapitola-16-budovy13-png.png[/IMG][BR][IMG]https://i.ibb.co/xDzQdDT/https-i-ibb-co-7-GHKQ4y-EL-kapitola-16-budovy12-png.png[/IMG][BR][IMG]https://i.ibb.co/s6hx0QR/https-i-ibb-co-b-N0rw-Jk-EL-kapitola-16-budovy11-png.png[/IMG]"}, {"66": "Kdo jim sakra řekl, že nejlepší vlastnost prastarého divu jsou body do žebříčku za každou kravinu.[BR]To už jim totálně došly nápady na něco kloudného?"}, {"119": "Koukám, že i ve výzkumu to bude chtít i standardní zboží. Jsem na novou kapitolu zvědavá. Už podle shlédnutí, to bude chtít jako vždy velké množství prostoru.... Ale co jsem nečekala, že se bude měnit velikost dílen. Přeci jen v poslední kapitole už došlo ke změně. A pokud koukám dobře, tak se lepší i zbrojnice? A velikost bude stejná? "}, {"31": "Nové veľkosti budov sú nasledovné:[BR][BR]BudovaPredošlá veľkosťNová veľkosťObytné budovy5x35x4Dielne5x55x6Hlavní sídlo8x88x8Manufaktura na kryštál6x47x4Manufaktura na svitky4x65x6Manufaktura na hedvábí4x65x6Zbrojnice7x47x4Cvičiště4x67x4"}, {"16": "@aikomi Jo, a ne málo.[BR]Osadníci a ambasády:[BR][IMG]https://i.ibb.co/PmfxQCR/https-cz-forum-elvenar-com-index-php-attachments-1586258186174-png-4361.png[/IMG] [IMG]https://i.ibb.co/CBrL4Jc/https-cz-forum-elvenar-com-index-php-attachments-1586258228901-png-4362.png[/IMG] [IMG]https://i.ibb.co/tmGtM10/https-cz-forum-elvenar-com-index-php-attachments-1586258246330-png-4363.png[/IMG][BR]A průměrná cena výzkumu 200 VB je taky pěkné plýtvání. V podstatě vše, kromě nepovinných výzkumů, je dražší než nejdražší výzkum z minulé kapitoly.[BR][BR]A nevím, proč ty ambasády musí být tak obří. Tohle bude nadlouho, snad to stihnu před další kapitolou dokončit. (já bych tak chtěl další rasu ala Amuni/Konstrukti/trpaslíci, kde stačí postavit portál a spamovat požehnání namísto stavění těch obludně velkých osad)"}, {"158": "Kdyby na to bylo místo proč ne, že . Já bych si rád postavil ty budovy ve velkém stylu, ale co je moc to je příliš. Ještě tu čekám na Turunena, až tu spustí o tom, že ty jsou divy zase jen zaměřené na společenství . Osobně vítám změnu v barvách, ačkoliv design obytných budov se mi moc nelíbí. [BR][BR]Hlavně mě docela zajímá jak to dopadne s portálovým bonusem, na to, že nám ho hra cpe horem dolem a pak se nebude moc efektivně využít, čili jak na začátku elvenarů."}, {"119": "@Lovec Krys  Díky. Koukala jsem na to, bude to jako vždy mazec. Doufám, že se u toho dlouho nezaseknu. I když to vypadá na delší výzkum, než obvykle...."}, {"198": "Není místo na zveličování a další reálnou měnu do toho cpát nebudu. [BR]Pokud nebudou aspoň 3 rozšíření z výzkumu, tak to asi zabalím.[BR][BR]Tak na gems vidím pouze dvě rozšíření, no asi padla."}, {"126": "Trochu mě ten nárůst populace na vylepšování manufaktur vyděsil. Tak jsem se tomu podíval na zoubek a nebude to s popkou tak zlý.  Ale co bude problém, tak asi kultura..to je masakr.  A taky ta potřeba volného místa pro vylepšení... Tak jsem zvědavej, kolik bude ve výzkumu nových rozšíření...[BR][BR]Hele na to:[BR][BR][IMG]https://i.ibb.co/4gzQXNN/https-cz-forum-elvenar-com-index-php-attachments-kap-16-plan-01-jpg-4367.jpg[/IMG]"}, {"126": "To na kulturu máme opět Feedback od INNA na to, jak jí máme hodně.... Už tu prosím nic nechvalte, jak je něčeho moc "}, {"158": "@BiggJOEcz je plánováno 2 rozšíření z technologií a 1 rozšíření za 500 provincií (+2 nové za dia )[BR][BR]@aikomi zatím je nastaveno tak, že v technologiích je potřeba přes 5000VB, a třeba cca okolo 2M orků (čili kdo je nevyrábí a chce jít do 16 kapitoly, tak by měl začít vyrábět, už teď ), takže zas taková rychlovka to nebude . Ale snížila se potřeba živoucího zboží na 1/3 oproti elvenarům."}]