[{"126": "@Fjorgyn  no tak to nebude dobrý :-D     Budou po nás chtít cca 10+ rozšíření navíc za upgrade budov, ale dají opět 3.  Zase ale navýšili hodně produkci, takže místo vzorce Hodně manufaktur s malou výrobou se asi pojede málo manufaktur s velkou výrobou.  Tím se docílí více místa...to zase budou šachy v přeskládávání města :-D"}, {"198": "Ale ta hormada populace ve vylepšených manufakturách je děsivá, hold nebude po pěti, ale od každé jednu schovám.[BR]2+1 rozšíření, no budiž "}, {"126": "@LivingPool  je to děsivá hromada populace, co bude třeba, ale koukni třeba na ten takový univerzální příklad, jak jsem tam dole uvedl... Budou velké nároky na populaci, ale s vylepšením obytných budov se to vrátí. Zbytek se získá z hybridů či se štěstím obmění za kouzelky z Věže.  Spíše se bojím té hromady kultury... I to, že po vylepšení cest na 16.level, kdy v průměru z 300 cest získáme navíc +19.500 kultury navíc, bude to mazec. Zas mám trocha pocit, že jsme dlouho psávali o tom, že nejvýhodnější hybridy jsou s co nejvíce populací, tak nám to típli na to, abychom se zaměřili i na kulturu   Ale uvidí se až pak v praxi, kde se dají popka i kultura navíc sehnat. Tohle je zatím jen teorie."}, {"198": "Nějaký tip na start v ostré verzi?[BR]Zatím mám volné místo zastavěné knihovnama, studnama a tím balastem, co dává VB."}, {"158": "@BiggJOEcz hybridy je dobré zaměřit na obyvatele, které mají větší přísun obyvatel na políčko, než hráčův aktuální možný level obytných budov a na kulturu používat čistě kulturní budovy, to je základ mého uvažování, co umístit do města.[BR][BR]Jako mám přes 300k volné kultury, takže v tom nevidím problém a díky zvětšování obytných budov to vidím tak, že budu redukovat jejich celkový počet. Ostatní problémy se budou řešit přes divy.[BR][BR]Na tu logistickou výzvu se těším "}, {"16": "Klášter a ruiny to v nejhorším řeší (u mne na 12 a 9, takže spoustu kultury z nich lze ještě získat). Cesty jsou nepovinné a asi je ani nebudu zkoumat.[BR]Spíše vidím problém v tom to tam nějak nacpat. Než mi vyprší studny, tak nemám dost místa ani na portál+ambasády, nemluvě o ostatních budovách."}, {"20": "Jak tak koukám na novou rasu, moc se mi to zvětšování budov nelíbí. Hlavně obytky + 5 políček. A ostatní věci se také zvětšují moc. Někdy mám pocit, že nám Inno chce tu hru zprotivit.  A nejsem si jistá, jestli mě to bude ještě bavit. No uvidím. Mrzí mě, že hra jde stále více směrem, který jde jakoby proti hráčům."}, {"119": "@Fjorgyn  No vzhledem k tomu, že mám 5 zbrojnic a zásobu cca 500tis. a nějak jsem se ještě nepřehoupla přes milion....Tak to bude sranda jich tolik vyrobit  Je lepší pokles živoucího ve výzkumu. Za to nám určitě přichystali něco zajímavějšího... "}, {"72": "tři povinný oddíly a žádný vylepšení jednotek.. asi to vylepšení cvičiště oželím "}, {"11": "a který jednotky by jsi chtěl vylepšovat?"}, {"72": "Kterýkoliv. Vím že většina společnosti je začleněná do chlívků, který předem někdo vytyčí, ale naštěstí jsou pořád i lidi, kteří chápou vývoj jako činnost mimo zaškatulkovaný oblasti. Proč by to jako nemohlo mít čtyři hvězdy?[BR][BR]Beru to tak, že je to něco za něco, vyzkoumání velikosti oddílů nám ztíží boje/zdraží výkup provincií, v posledních kapitolách ne málo. Jsou šikovně hozený před zbrojnici a cvičiště, takže ty dvě věci zkoumat nemusím, ale i tak zbude jeden nutnej oddíl. A ten mi nekompenzuje nic, žádná vylepšená jednotka."}, {"20": "Opravdu mám zatím z nové rasy rozporuplné pocity. Co jsem koukala na požadavky výzkumu, tak asi tvůrci hry chtějí, abychom tu rasu hráli opravdu dlouho. A jak psal athlan - cokoli, co by nám zlepšilo boj chybí, naopak jen nové zhoršení zvětšováním oddílu. Takže turnaj i Věž budou masakr. Ještě uvidím, až to přijde k nám, ale poprvé mám pocit, že bych s tím nejradši sekla. Upřímně - nevím, co mě ta nová rasa přinese kladného do hry, kromě případných bodů do žebříčku ... Zatím každá nová rasa znamenala pokrok - např. právě vylepšením bojovníků, ale teď je to jen o zvětšování budov, A díky tomu teleportování spousty budov do skladu. To je prostě koncept hry, který mě ničím nenadchne."}, {"199": "flego napsal/a:\t\t\tMyslíte, že ještě stihnou zařadit studnu do denních odměn?, je tu ještě nějaký \" čekač\" jako já?. Začínám být z toho nervózní,abych pak netočil 1VB,nebo něco podobného Klikněte zde pro zvětšení...Jsem taky čekac a asi nebudou, tak se teď snažím zjistit do čeho to mam vypálit"}, {"31": "Informácia z bety: Vypadá to tak, že nová kapitola prinesie už iba minimálne zvýšenia produkcií starých setových budov (ako napríklad Karnevalový set, Vianočné sety alebo iné). Na obrázku nižšie je vidieť, že napríklad budova Fontána hýřilů dostane navýšenie už iba kultúry a rovnako tak aj Ledový vánoční strom.[BR][BR]Spoiler: Obrázky[IMG]https://i.ibb.co/7Vbx2VQ/https-beta-forum-elvenar-com-index-php-attachments-fountain-png-7165.png[/IMG][IMG]https://i.ibb.co/8rBzJT0/https-beta-forum-elvenar-com-index-php-attachments-tree-png-7164.png[/IMG][BR]Na beta fóre sa k tomu vyjadrili a údajne je to zamýšľané, aby hráči dostali možnosť nového výberu, či si chcú tieto setové budovy ponechať alebo nahradiť novými budovami z udalostí.[BR][BR]Je to možno fakt, ktorý bude stáť za zohľadnenie pri reorganizácii mesta do novej kapitoly."}, {"16": "Jo, dávají nám evoluční budovy s mizernou výrobou, tak je potřeba staré sety srovnat na jejich mizernou úroveň.[BR]Další kapka pro mnoho hráčů a pro některé i ta poslední..."}, {"84": "Je vidět, že vývojáři reagují na příspěvky z fóra. Jakmile se tady něco pochválí hned to po....u. Jako například teď - tak dlouho se při posledních eventech chválili staré budovy, až se rozhodli jejich produkce zastropovat. Ještě že to nesnížili, jako již jednou v minulosti..[BR]Zkusme tedy jít opačnou cestu a do nebe vynášet nové eventové budovy, které za moc nestojí a na staré a dobré nadávat.Třeba zase zareagují a budou nám nutit to co nechceme a tím se vrátí dobré budovy.."}, {"145": "@karhol -Tak já začnu-Miluju lampiony a zmrazené plameny všech barev,asi si s nima vytapetuju město,anebo oba "}, {"20": "A ještě maličkost - nová nabízená kultura, kterou lze získat díky výzkumu, už je jen za diamanty. Nic jiného . Naprosté znevýhodnění pokročilých hráčů. Mám z toho dojem, že Inno námi naprosto pohrdá. Je smutné, jak kdysi skvělá hra jde totálně do kytek. Řekla bych, že hodně hráčů skončí, nebo se prostě na novou rasu vykašlou."}, {"88": "@Ludi- tady tě trochu poopravím: věc se má tak, že dochází k pomalé a nenápadné přeměně aktuálního modelu hry. MTG - majitel Inno totiž za mnou, za tebou i za každým jiným hráčem vidí jen jeho peněženku a přemýšlí, jak naše peníze udělat svými penězi... To by normálně nebylo nic proti ničemu, ale ten způsob, jakým to dělá, to je slušně řečeno na facku...  Nám pokročilým (a znalým minulého stavu) bude neustále házet klacky pod nohy, aby nakonec těm nohama zvolili a šli jinam a zůstali tu naivní nadšenci, co se budou třepat radostí u každého VB nebo zmrazeného plamene \"za odměnu\" a nebudou moc řešit... To je opravdu hodně smutné."}, {"2": "Nebo přestali lidí stavět běžnou kulturu, protože ta eventova je o tolik lepší.[BR]A tak necítí potřebu dělat ji postaru."}]