[{"114": "Já bych flintu ještě do žita neházela, co znám Inno, tak rádo tahá z klobouku králíky a sem tam i slona a co platilo před čtvrt rokem, za další může být všechno úplně jinak, a že překvapit umí i v tom dobrém, o tom žádná. My chceme prostě všechno hned, neumíme si jen počkat."}, {"20": "@luterina za ty roky, co to hraju, už jsem se načekala až hrůza, ale jde o trend hry, který je čím dál tím horší."}, {"88": "@luterina: vidím to stejně jako Ludi, z čekání bych už mohla mít doktorát... [smilie--sprite2]   A Inno \"vytáhne z klobouku\" jen to, co mu šéfové z MTG dovolí... Přesně jak píše @Ludi, jde o trend hry."}, {"114": "@Ludi, @Vicky1177, \"trend\", no nevím, snažím se na ten vývoj dívat objektivně, stačí si třeba jen vyjet všechny proběhlé aktualizace na novou verzi od počátku Elvenaru a říkám si, že to snad ani není možné tolik nových věcí co do hry přibylo a v podstatě každý měsíc, spíše je to přesycenost globálního charakteru, kde přes tu nekonečnou a ohromnou nabídku snadno dosažitelného přehršle všech věcí, ztrácíme schopnost o něco usilovat, překonávat překážky, jít si za svým cílem důkladně a obrněni trpělivostí, krůček po krůčku a vidět i v těch malých věcech, věci velké, natož je vůbec vidět v nějaké větší komplexnosti, ve které by ten cíl měl i jasnější a zřetelnější obrysy."}, {"20": "@luterina hraji už pár let a trend hry je OBJEKTIVNĚ špatný. To, že dochází k technickému vylepšování hry aktualizací je něco jiného, tím se hra přizpůsobuje technickému pokroku, který je v IT prostředí prostě nutný i vzhledem k pokroku všech ostatních běžných technologií. [BR]Jenže vlastní hra - tedy především nová rasa - přináší změny, které jsou nesmyslné a hru posílají do kopru. Logika tvůrců je jasná: kdo chce pokrok, musí platit. Jenže navíc za platbu nenabízí nic skutečně atraktivního. Jsem v invalidním důchodu a tak nemůžu jen tak vyhazovat peníze. I tak jsem si občas něco koupila, když přišla sleva. Hodně mi pomáhaly studny, ale ty teď evidentně končí. Hra zadara je prostě novou rasou definitivně u konce. Teď mi přišla zpráva, že i za rozšíření ve výzkumu už nepůjde platit mincemi, ale chtějí za to 700 dia ..., takže další bude ještě dražší.[BR]Překonávám překážky v reálném životě docela fest. Žít s tělesným postižením není žádná legrace.[BR]Nemáš právo se takhle nevybíravě do nás navážet."}, {"158": "@luterina Vždyť i na wiki píší, že hra je v ranné fázi vývoje. Čili z této logiky, jsme ještě nehráli kompletní hru, a proto by bylo zvláštní, aby se nevyvíjela [smilie--sprite2].[BR]Nesouhlasím, že jsme přesyceni snadno dosažitelných věcí. Spíše jsem přesycen brutální randomizací, která bez ohledu na snahu způsobí nedosažitelnost, viz moje chybějící hospoda u šaška a jiné staré sety, které prostě nemám kompletní. A když už tu přišli nekonečné úkoly, kde člověk mohl projevit snahu a mohl chtít udělat a nahrát co uznal za vhodné, tak najednou se zjistilo jak jsou hráči moc dobří k získávání věcí, tak se to muselo hned přiškrtit.[BR][BR]Hra je objektivně do kopru. Příběhy v událostech jsou nulové (když hra začínala, tak měli story trošku hlavu a patu), neví co dávat do technologického stromu, cpou ti nějaké zdroje, u který nakonec udusí jejich použití, protože jich dali a dávají prostě moc, takže je jich trapná snaha brzdit hráče, by byla k ničemu (portálové bonusy, já je prostě nechci, ale i tak se neustále narůstají do tisící% a jsou k ničemu). Stále tu jsou další problémy, které se táhnou.[BR][BR]Nevím proč do Elvenarů (když už to mělo být husto shledání a znovu spojení lidí a elfů), nedali například kasárny opačné rasy, tím by se konečně smazal rozdíl v armádách, který prostě nedokázali vyřešit a navíc by to bylo tématické zajímavé (s podmínkou, že by hra umožnila případně jednu z kasáren schovat, protože lidi by stejně moc elfí jednotky nepoužívali), mohli by tam být i mraky technologií na jednotky.[BR][BR]Hra se stává prázdnou!"}, {"119": "@Ludi, kde jsi přišla na to, že se bude platit za rozšíření z výzkumu dia? To nikdy nebylo. Nepletes si to? [smilie--sprite1] [BR][BR]Jinak luterina se určitě nijak nenavazela do vás. Je to jen hra. Sice ano, nejsou lepší odměny co kdysi byly, ale hrát se to pořád dá. Čas ukáže, kam bude hra směřovat. Vemte zase v potaz, že se objevili novinky, jako je věž, kde se dají získat dia, sice ne v tak velké míře jako ze studen, ale pořád lepší něco než nic. Byli jsme moc zhyckani, že jsme měli přísun dia za nic. Ano je to mrzute. Ale i bez toho se dá hrát. Je tu nové kouzlo teleportace, díky kterému můžete schovat budovu, aniž byste ji mazali (samozřejmě jen některé). O tom předtím jsem si mohla nechat jen zdát. [BR][BR]Takže hrajte s radostí a ne s mrzutosti [smilie--sprite1]"}, {"20": "@aikomi  tu informaci o platbě za rozšíření z výzkumu mi napsal psal jeden spoluhráč. Já mám na betě jen malé město, tak to nemohu ověřit. [BR]Není problém v tom, že by se to nedalo hrát.  Nepatřím mezi hráče, kteří by si nevěděli rady. Ale jde o celkovou koncepci hry. A nová rasa je prostě naprosto bez nápadu. Jen zvětšování budov. Nic jiného. Nuda. To je podstatně horší, než to, že není přísun dia. Jak napsal @Fjorgyn : Hra se stává prázdnou![BR]A to, že se Luterina navážela do nás je jisté, protože nás výslovně jmenuje a příspěvek na nás adresuje."}, {"145": "Teleport jako myšlenka fajn,jenom ta ztráta lidí z objektů je nenahraditelná.Kde získám 10000 lidí,abych po měsíci budovu vrátil?.Budu muset zabrat pole min 6x6, abych byl na tom,co před teleportem. Takže s touto \"výhodou\" pracuji velice opatrně. [smilie--sprite3]"}, {"188": "@Ludi[BR]Jen na vás dva reagovala, tak si laskavě nepleť pojmy. Protože jestli to tak je, tak v tom případě já teď utočím na tebe. [smilie--sprite2][BR][BR]Já to vidím , že tady člověk nesmí říct opačný názor, protože jakmile to udělá ukamenujete ho, třeba tím co jsi napsala!"}, {"119": "@flego ano je to ztráta. Ale já třeba, když budu schovávat budovy, tak jako první půjdou mánufaktury, a z toho získáš dost lidí. Možná jak píšeš bude problém vrátit zpět, ale je spoustu možností jak získat lidi. Z vylepšení obytek pokaždé nějaky přísun bude, nebo pop/kulturní budova. Ovšem záleží jak moc jsi náročný v manufakturach. Někteří mají třeba od všech 3 bonusu po 7-10,coz normální obytky dle mého názoru neutahnou...[BR][BR]@Ludi myslím si, že to nebude pravdivé, preci jen to doposud nebylo. Budu muset počkat, až nová kapitola přijde. Taky to nemám jak ověřit"}, {"20": "@nataly111 nejde o jiný názor na hru, ale o to, že luterina napsala:[BR]\"ztrácíme schopnost o něco usilovat, překonávat překážky, jít si za svým cílem důkladně a obrněni trpělivostí, krůček po krůčku a vidět i v těch malých věcech, věci velké, natož je vůbec vidět v nějaké větší komplexnosti, ve které by ten cíl měl i jasnější a zřetelnější obrysy.\"[BR][BR]Hodnotit lidské vlastnosti jen podle toho, jak se stavím k hodnocení hry, je špatně.  Neztrácím schopnost o něco usilovat a překonávat překážky, atd. V reálu rozhodně ne.[BR]Mám právo se bránit. Nenapsala jsem nic útočného na druhé hráče."}, {"200": "Budu krutý nemám co ztratit ... [BR][BR]Přesně jak to napsala @nataly111 [BR][BR]Jinak vy co se tak dušujete odchodem a nejednou vždy pořád dokola to zde píšete, tak už konečně jděte a sekněte s tím !!! Vím je to šok ale i tahle hra není zcela zadarmo a jinde všechny podobné prolížečovky z vás cíleně tahají peníze i způsobem který být zavedený zde tak se nedostanete ani k první kapitolní rase. [BR][BR]A taky jak se cachcáte jak se sedřete s tou snahou ve společenstvích apod. Ano když máme spolek již vyšpektovaný na ideální podmínky pro poslední truhlu tak to není zase taková námaha ... [BR][BR]Zvyšování obtížnosti formou navyšování max počtu členů to se vám nelíbí protože to by se zvýšila míra snahy že? ale to je ve všem. Chcete lepší odměny atd ale s minimem nebo absolutně bez nějaké snahy. [BR][BR]Všichni tady rozepíšete co vám aktuálně vadí v tom vašem případě ... fňuk fňuk a já bych chtěl výzkum pouze za mince a zásoby a suroviny rvát do turnajů ... připadá mi to stejně směšné. [BR][BR]Jde i o trpělovost a šetření. Jak kdo umí hospodařit i s diamanty získaných zadarmo třeba ze studen, soutěží zde i na sociálních sítích, emailů plus dárky které dají diamanty třeba jen tak jednou za čas. [BR][BR]Takže kultura už jen za diamanty jo? No a? Taky jde o to přemýšlet i o budovách a o rozvržení kulturních budov. [BR][BR]@Ludi  Ne hru opravdu nemá co zajímat situace hráčů v realitě a usnadňovat jim to na základě takto vynuceném soucitu. Tady máš stejné herní podmínky jako každý ..."}, {"188": "@Ludi Jako omlouvám se, ale znám Luterinu a vím, že to nemyslela špatně.[BR][BR]Mluvila si třeba o kultuře za dia, jsem hráč kterého už kultura nezajímá a tak tento krok chápu. A pokud nějakou chci, můžu si jí vytáhnout z událostí.[BR]A tak bych mohla pokračovat dál.[BR]Já osobně mám jiný pohled na hru než vy, ale napsat to naplno by znamenalo, že mě prostě ukamenuješ a nejen ty!"}, {"31": "Ja by som asi vážne zmiernil s tými tvrdeniami, že nová rasa je smerovaná výhradne na diamanty a nútenie hráčov platiť. Osadníci sú síce veľkí, ale veľká časť výskumu sa dá preskočiť portálovými bonusmi, takže postavená osada sa dá výrazne skrátiť. Máme teleporty, ktorými jej môžeme uvoľniť miesto a to že nám to nehrá do kariet, pretože sme si chceli postaviť \"zelených jednorožcov\" dodáva hre stratégiu - niečo zmeniť na základe vývoja. Vážne tu nevidím problém.[BR][BR]O rozšírení z výskumu za diamanty naozaj neviem nič, na bete síce tak ďaleko niesom, ale som si istý, že ak by tomu tak bolo, už by sa nejeden jožinko na fóre ozval."}, {"5": "Já se po delší odmlce vracím na forum s nějakým svým poznáním...dospěl jsem, herně... zjištuji, že mne hra naplnuje už jen tím, že jsem členem fajn spolku, kde si můžeme bez nějakých konvencí o všem, co život přináší, popovídat...dělá mi radost, relaxuji od všedních starostí, klidní mi duši i mysl ...tiše vyrábím to co město vyžaduje a co je nejen pro mne důležité, nikam se nehoním a snažím se plnit společné povinnosti ...Event, nenadchl... ano nic mne z denních odměn nezaujalo, tak jsem vybíral truhly aspon podle toho co se mi zdálo pro město vhodné /vojáky nikdy nepohrdnu/ ...těším se na novou rasu i kdybych ji měl dělat rok, spěchat není kam, ale jak se znám opět v zápalu hry, tam bude té aktivity více a rasu proletím dříve než ten avizovaný rok [smilie--sprite1] těším se jak to budu muset organizačně vymyslit co ve městě zůstane co oželím [smilie--sprite1] plánovač bude opětovně přeplněn lidmi a sekat se [smilie--sprite1] ...přeji podobný klid na duši a spokojenou mysl i vám všem ostatním [smilie--sprite1] / v reálným životě, pak hodně zdraví, v dnešním světě je ho o to více zapotřebí [smilie--sprite1] ....krásné Velikonoce vám všem lidičky"}, {"119": "@ElfNostradamus krásně napsané. Hra má bavit, Za ničím se nehonit. Brát vše co přijde tak jak je. I když zrovna event tolik nenadchnul. Přemýšlet ve hře, budovat..... Když jsi ve spolku, ve kterém jsou fajn lidičky.....[smilie--sprite2]"}, {"88": "@ElfNostradamus: skvěle, ba přímo precizně napsáno. @aikomi: souhlas, hra má bavit. Tak dělám špatně něco já, že mne poslední dobou ale vůbec nebaví? [BR]Jinak všem také hezké Velikonoce [smilie--sprite1]"}, {"25": "Ludi napsal/a:\t\t\tJenže vlastní hra - tedy především nová rasa - přináší změny, které jsou nesmyslné a hru posílají do kopru. Logika tvůrců je jasná: kdo chce pokrok, musí platit. [BR]....[BR]Teď mi přišla zpráva, že i za rozšíření ve výzkumu už nepůjde platit mincemi, ale chtějí za to 700 dia ..., takže další bude ještě dražší.\t\tKlikněte zde pro zvětšení...Dovolim si nesouhlasit. Hru posilaj do kopru jen ti, co tu siri takove nepodlozene zpravy. Betu hraju aktivne a rozsireni za diamanty v nove kapitole fakt nejsou. A klidne se vsadim o svoje kalhoty, ze ani v budoucnu se tam nic takoveho neobjevi, protoze to slo proti celemu principu tehle hry. [smilie--sprite2][BR][BR]Holt kazdy, kdo chce, si v Elvenaru najde to svoje, co ho bude bavit. A ti ostatni hledaj jen vymluvy. [smilie--sprite1]"}, {"119": "@Vicky1177 Taky jsem měla chvilku, kdy mne hra nebavila. Ale to spíš když se sejde více okolností najednou, jak ve hře, tak v životě. Pokud to tak cítíš, dej si v klidu pauzu od hry a uvidíš....[smilie--sprite2]"}]