[{"71": "Prosím ty úkoly v dobrodružství jsou stejný jak v tom prvním ?"}, {"50": "@jacktenrek dle zpráv z Bety by to mělo vypadat stejně "}, {"31": "@jacktenrek úlohy sú rovnaké, požiadavky stretov na mape veľmi podobné, čo som sa teraz pozeral a porovnával s minulou udalosťou, našiel som zatiaľ iba jeden rozdiel, v prvom strete 3. stupňa mapy.[BR]Prehľad stretov z minulého dobrodružstva nájdete tu."}, {"65": "a odměny se ví, jaké budou?  slyšel jsem něco o tom, že pro první 3 společenství budou hlavní ceny z pochodu stád, ale co ty normální odměny, co dostane každý, kdo splní?"}, {"31": "@CorwinOfAmber všetky odmeny až na tie 3 hlavné budovy ktoré budú tentokrát z udalosti Pochod stád, sú rovnaké."}, {"16": "iDavis napsal/a:@Lovec Krys spoločenstvo by to vraj nemalo vyžadovať. Klikněte zde pro zvětšení...Tak teď jsem ještě zvědavější, co je tím vlastně myšleno. Jinak já společenství mám, ale z pozice 255 holt půlčíkovským společenstvím konkurovat nemůžeme."}, {"65": "takže zase orc nest a chatrč na manu? :-( to si mě moc nepotěšil... :-( a nemůžeme třeba provést nějaký posvátný elvenarský rituál, aby nám dali lepší odměny? [BR][BR]něco jako \"ovčácký pes chytne veverku, ta mu dá magický oříšek, s ním se rozlouskne vejce fénixe a z něj vypadnou lepší odměny\" ?[BR][BR]ovčáckého psa mám, veverek je všude dost, a ty seženeš vejce fénixe :-D"}, {"31": "Aktuálne informácie[BR][BR]Spoiler: Aktuálne informácieTak tentokrát stručne: už čoskoro zavíta do Elvenaru tohtoročná zimná udalosť a je oficiálne potvrdené, že nová kapitola príde na rad až po nej, čo bude teda najskôr niekedy v januári."}, {"72": "A zanedlouho znamená zpravidla co? Minulý rok to bylo prý těsně před vánoci..."}, {"28": "Minuly rok trval zimni event od 5. prosince do 7. ledna. Da se tedy asi predpokladat podobny termin."}, {"73": "Prosinec se rychle blíží a pořád žádné info o eventu? :-("}, {"72": "Jen v klidu, potřebuju dodělat trpaslíky "}, {"31": "Ľadová sezóna prichádza do Elvenaru...[BR]Zimná udalosť[BR][BR]Spoiler: Zimná udalosť (Three Glacier Giants)Predpokladaný termín: 4.12. - 7.1.[BR][BR][IMG]https://i.ibb.co/8c7r921/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-winter2017-banner-winter2017-png.png[/IMG][BR][BR]V tomto spoileri nájdete aktuálne informácie k tejto novej zimnej udalosti. Spoiler budem postupne dopĺňať, vracajte sa teda k tomuto príspevku.[BR][BR]Zimné pozadie:  Súčasťou udalosti bude aj zimné pozadie. To sa avšak objaví na bete až v priebehu niekoľkých dní.[BR][BR]V priebehu akcie budú k dispozícii 2 úkolové rady, ich plnením budeme získavať zmrznuté kľúče. Tie budeme potrebovať na otváranie ľadových debien z ktorých budeme dostávať ľadové koruny.[BR][BR]Spoiler: ÚlohyKompletný prehľad udalosti so zoznamom všetkých úloh a odmien v tabuľkách nájdete TU.Spoiler: Set bonusNová funkcia: Niektoré budovy ktoré budeme môcť získať v tejto ľadovej udalosti budú tvoriť tzv. set, teda skupinu, ktorá nám bude dávať špeciálne odmeny. Aby sme docielili získavanie týchto odmien, bude potrebné tieto budovy postaviť hneď vedľa seba (obrázok nižšie). Týmto sa potvrdili ešte prednedávnom nepotvrdené obrázky z bety, ktoré som dával sem.[BR][IMG]https://i.ibb.co/M2bHG6H/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-winter2017-Set01-png.png[/IMG][BR][BR]Hlavné odmeny:[BR]Frozen Giants Shrine[BR][IMG]https://i.ibb.co/PNCrtNK/https-static-wixstatic-com-media-42783b-8c83e7c0a50a4e98b2cce3807e72b5d1-mv2-png-v1-fill-w-301-h-274.png[/IMG][BR]2x2[BR]- kultúra: I - 260, II - 310, III - 370, IV - 420, V - 480, VI - 590, VII - 760, VIII - 920, IX - 1730, X - 2100, XI - 2600.[BR][BR]Ice Mountain Troll[BR][IMG]https://i.ibb.co/qMTxJT4/https-static-wixstatic-com-media-42783b-077592abd59c416c8b21a9c03aa2a18d-mv2-png-v1-fill-w-520-h-450.png[/IMG][BR]5x4[BR]- kultúra / mince za 24 hod.: I - 1120/2300, II - 1290/4300, III - 1560/6900, IV - 1800/10800, V - 2100/16300, VI - 2500/23000, VII - 3200/29000, VIII - 3900/37000, IX - 7400/44000, X - 9000/53000, XI - 11000/63000.[BR][BR]Ice Giant Hag[BR]4x5[BR]- kultúra / obyvateľstvo: I - 330/500, II - 380/570, III - 460/690, IV - 530/800, V - 600/910, VI - 740/1110, VII - 950/1430, VIII - 1140/1720, IX - 2200/3200, X - 2600/4000, XI - 3200/4800.[BR][BR].. tabuľky v príprave[BR]Jednotlivé prehľady týchto zimných budov doložím čoskoro aj v tabuľkách."}, {"72": "Vida.. a je to tady "}, {"65": "tak to vypadá, že holky ušatý okřídlený budou muset chvíli počkat, volné místo po trpajzlících padne na událost  ale jsem rád, že mi to tak krásně vyšlo. eldrasil jsem měl také se začátkem nové kapitoly. a teď mílovými kroky k obytným budovám a všem rozšířením "}, {"50": "@iDavis ty nás vždycky pozitivně naladíš svými zprávami , děkuji za info "}, {"40": "Jak zimu nemám rád, tak event vypadá hooodně dobře "}, {"68": "aha, takže jak tam koukám, bude to zase o získávání hromady zásob, několika deseti či stovek tisíc na úkol, tudíž polovina lidí se na to opět vykašle "}, {"16": "@CorwinOfAmber[BR]No já už to místo mám zaplácnuté rozjetou vílí ekonomikou. [BR]Ale v některých částech vesnice mi zbylo množství malých mezer (ty budovy už jsou prostě příliš velké, než abych vyplnil místo beze zbytku a stavět kulturní budovy 1x1/2x2 fakt nemá smysl, až získám další rozšíření, tak to pak přeuspořádám, aby bylo mezer méně), takže toto místo využiju a zaplácám ho několika dílnami a manufakturami lv 1 na event (pro ty dlouhé časy výrob, případně pro výrobu nebonusových manufaktur, které už jsem dávno zboural). Naštěstí teď vylepšuji obytné budovy na vílí, takže populaci na to mám."}, {"43": "To jsem zvědav,kdo postaví ty speciální budovy k sobě,když většina nemá místo ani na normální budovy... "}]