[{"20": "@Jonik Už jsem nechtěla nic psát, ale přece jen mi to nedá. Nějak jsem nenašla tvoje město ne betě, asi hraješ pod jiným jménem.[BR]Je víc lidí, kteří hrají zde na CZ1 i CZ2, ale na fóru diskutují pod jiným jménem s mini městem. Každého věc, ale je to zvláštní.[BR][BR]Na CZ2 mám město na konci výzkumu a nikdy jsem nehledala výmluvy. Turnaj hraji solidně, Věž na 3 patra. Nemám problém plnit eventy, hraji je, ale kritika hlavních cen a celého vývoje je na místě. Co se týče nové kapitoly - není pro mě těžká, doposud jsem všechno zvládla s přehledem, ale vnímám ji jako velký krok zpátky ve vývoji hry. Je to pro mě prostě zklamání, od nové kapitoly jsem čekala podstatně víc. Takhle prostě ztrácím motivaci hrát dál, protože tam není nic skutečně zajímavého. Možná nakonec poslední kapitolu hrát budu, ale hodně pomalu a bez nějakého zápalu. Doposud mě každá kapitola bavila a ve výzkumu bylo vždy něco, na co jsem se těšila. Teď tam není nic. Jen zvětšování budov. Žádný nový nápad. Navíc zhoršení kvality starých setů tím, že se po KR jen zvedne trochu kultura a ne produkce, je také zklamání. A další věci.[BR][BR]Info o platbě za provincie z výzkumu mi poslal jeden hráč, Já na betě mám jen malé město a nemůžu to ověřit. Ale to už jsem vysvětlovala výše. Někdy mám pocit, že lidi tu reagují na příspěvky a vlastně je ani pořádně nečtou.[BR][BR]Očekávám, že za tento příspěvek mě zase spoustu lidí napadne, ale to je jejich věc. Ještě je tu pár lidí, kteří jsou fajn, ale celkově se tu atmosféra hodně zhoršila. Jistě, napíšete mi, že za to můžu já a hráči, kteří mají podobné názory jako já. Těch nepřátelských napadnutí od různých hráčů právě na nás, co jsme vyjádřili svou nespokojenost s vývojem hry, bylo moc. A od lidí, od kterých bych to vůbec nečekala. A přitom my svou kritikou jen doufáme, že třeba ještě dojde k nějaké změně. Odmítáme nadšeně jásat ze všeho, co se ve vývoji hry děje. Elvenare i Fórum - kde ty loňské sněhy jsou ..."}, {"188": "@Ludi[BR]Já na betě hraju pod jiným nickem než mám tady. Nikde není psáno, že tam musím mít stejný jako tady. [BR][BR]Řekla bych že problém je v tom, že ty vidíš útoky tam kde nejsou. Prostě jsou tu i hráči s jiným názorem a to je v pořádku ne?[BR]Na mě taky jistá hráčka včera utočila a napadala mě, když jí to dělá dobře tak ať [BR]Podle mě kritika je v pořádku, ale lepší je diskutovat i s hráči co mají i jiný názor."}, {"20": "@nataly111  řekla bych, že právě ty vidíš útoky, tam kde nejsou. [BR]Chápu, že na betě hrají lidi s jiným nickem, nic proti tomu. Ale jsou lidi, kteří tady diskutují evidentně s mini městem, aby nebylo vlastně poznat, pod jakým nickem hrají na CZ1 a CZ2. Zvláště, když napadají. Ale nebudu je jmenovat, jen si o tom myslím své."}, {"188": "Je to možné. pokud tu někdo diskutuje z malého města a chce se handrkovat asi není nejlepší. Možná vím o kom mluvíš, ale taky nebudu ukazovat. [BR]já diskutuji sama za sebe a prostě mám na věc trochu jiný pohled než vy. Já si vážím všech příspěvků i tech negativních,  ale myslím si že můžeme prostě normálně diskutovat aniž bychom se vzájemně napadali jen protože někdo s někým nesouhlasí."}, {"88": "@Ludi: to já se za své město nestydím. Ten, kdo ano, asi má proč... [BR][BR]@nataly111: [BR]Ano, prostě jsou tu i hráči s jiným názorem. To je v pořádku.[BR]Na mě taky jistá hráčka včera utočila a opakovaně mi vkládala do úst to co jsem neřekla.  [BR]To ovšem není diskuse s hráčem, co má odlišný názor, ale vnucování názoru svého...[BR]Ale každý jsme nějaký, jestli si ta hráčka chtěla jen načechrat ego, tak ať  [BR]Hra nás má bavit a jestli tohle k zábavě u hry potřebuje... [BR]Hezké Velikonoční pondělí."}, {"188": "Obě jsme mluvili o něčem jiném a evidentně se prostě neshodneme."}, {"175": "tu obyc obytku se podivej prosim poradne co vlastne scitas dohromady a vlastne u dilen to plati taky.  urcite ti da obytka 14,3 k obyvatel navic  jestli ono to neni jen +2800"}, {"5": "Obytka obyč. Kouzelka[BR][BR]Velikost, nárůst obyvatel, kultura, body."}, {"5": "Dílna  Kouzelka"}, {"175": "jezis to neni co ti to prida na kazde urovni ale kolik ti to dava nebo ubira na te urovni , na lvl 35 dava +4700 obyvatel a na 37 ti bude davat +7500 obyv. . koukni k sobe do mesta kolik ti obytko ted na aktualni urovni dava lidi a pak ti to treba dojde "}, {"126": "@ElfNostradamus[BR] tady jsem to psal na str.157 :[BR][BR]\t\t\thttp://cz.forum.elvenar.com/index.php?threads/zpr%C3%A1vy-z-beta-serveru-spoilery.2206/post-112940\t\t"}, {"175": "@ElfNostradamus [BR]a nejlepsi je smazat ten první příspěvek aby nikdo nechápal o čem celá diskuze byla "}, {"5": "jo vklidu není to nárůst celkový ale mezi  díky BiggJoe, asi bych měl jít zase na odpočinek , smazáno pro dezinformaci...msf Athlasi a hezký den "}, {"126": "@Anthalas   ..ale notak   Každý se někdy splete. A u Elfa je to spíše vyjímka.[BR][BR]Hezký den lidi "}, {"175": "Ale já nemám nic proti tomu že se spletl , však jsem se mu jen snažil vysvětlit jak to je , jen nemusel mazat ten první příspěvek pač teď to vypadá že si píšu sám pro sebe  proti elf nic nemám jsem rád že je tu na fóru někdo kdo píše k věci . jestli to vypadalo jako nějaký útok na jeho osobu tak se omluvuju "}, {"31": "Májové oslavy sa začínajú na bete.. [BR]Májové oslavy[BR][BR]Spoiler[IMG]https://i.ibb.co/pJPhX4q/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-may2020-Forumann-May-Event-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]Mechanika tejto udalosti je podobná poslednej vianočnej udalosti, so zmenenými cenami a odmenami. Na ploche sa bude nachádzať 16 kvetov, každý ukrývajúci svoju odmenu.[BR][BR][IMG]https://i.ibb.co/zhMmtGt/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-may2020-Tabs-event-progress-png.png[/IMG][BR]Novou rozvinuteľnou budovou bude Májový strom.[BR][BR][IMG]https://i.ibb.co/J5781C7/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-may2020-Evo-Total-May-png.png[/IMG][BR]Na rozvinutie Májového stromu budú potrebné artefakty, ktoré sa budú objavovať v hlavných cenách a tiež v rámci novej mechaniky tejto udalosti - miľníkové odmeny.[BR][BR]Všetky detailné informácie nájdete v nasledujúcich témach:[BR]Prehľad udalostiPrehľad nových budov"}, {"160": "Májové oslavy, to zas bude peklo... :/  Aspon si budu moct dát chvíli pauzu od hraní "}, {"175": "jezis uz zase ? , zlate 4 eventy rocne co za neco staly . ted jich je do roka 600 a vsechny o nicem"}, {"31": "@Anthalas odmeny je síce podnet na zamyslenie, ale za seba môžem povedať, že sa mi tento prístup viacerých (a kratších, táto by mala mať len 19 dní) udalostí za rok páči omnoho viac. Najmä teda, pokiaľ sa jedná o úplne nové udalosti, akou je táto."}, {"16": "Jo! Návrat prosincového míchání se spoustou odpadu! Všichni jsme to milovali a děkujeme za návrat![BR]Produkce stromu T5 ekvivalentní 6 hodinám v jedné T5 lv 27! Nějak moc nás Inno rozmazluje, měli by to snížit, jinak s takovou budeme muset propouštět pracovníky z manufaktur."}]