[{"20": "Zase event? Takže pak hned dobrodrodrůžo? To jako fakt?"}, {"88": "Udělala jsem tu pitomost, že jsem z hlavní stránky otevřela nejdřív budovy a pak až přehled eventu. Jako budovy tradičně hezké, ale co se nám to objevilo nezváno? Tak tě tu opět vítáme, milované míchání... [smilie--sprite2]  Alespoň není u toho infatilní grafika \"udeř kladívkem\" (nezapomněla jsem...)....[BR][BR][BR][BR]Mírný grafický pokrok v mezích zákona..."}, {"31": "Do prehľadu udalosti bol vložený zoznam prvých 38 úloh. V tejto udalosti bude mechanika úloh mierne odlišná - vypadá to tak, že celkový počet úloh bude 58, z nich prvých 38 sa bude odomykať postupným plnením (tie sú už uvedené) a po ich splnení bude zvyšných 20, ktoré budú mať mechaniku denných úloh, teda za každý deň udalosti bude jedna úloha."}, {"72": "Už jim ta snaha \"zbrzdit hráče/mít něco novýho\" trochu přerůstá přes hlavu. Měl by si tam někdo uvědomit, že neustále na něco čekat, až tak zábavný není."}, {"31": "V tejto chvíli naplánovaný termín udalosti Májové slavnosti nájdete uvedený v prehľade."}, {"16": "[IMG]https://i.ibb.co/n7TJ38k/https-cz-forum-elvenar-com-index-php-attachments-1588837793605-png-4444.png[/IMG][BR]Nová hlavní lišta z města. Přidané ikony v pravo jsou do Věže a řemeslné výroby.[BR]Ikona řemeslné výroby během výroby receptu: [IMG]https://i.ibb.co/72P3b62/https-cz-forum-elvenar-com-index-php-attachments-1588837880839-png-4445.png[/IMG],[BR]Recept hotov:[IMG]https://i.ibb.co/g4WDmLT/https-cz-forum-elvenar-com-index-php-attachments-1588837962586-png-4446.png[/IMG]"}, {"197": "Paráda. Ještě by k té ikoně mohli dát upozornění na nové recepty a bylo by to dokonalé."}, {"31": "Dobrý nápad. Dúfam len, že po skončení veže to tlačítko zašedne, a nezmizne, ako v mobilnej aplikácii, kde je tak v tom trochu neporiadok."}, {"72": "V desktopu taky zmizne, když je věž neaktivní."}, {"31": "Novinka z bety:[BR][BR]Úrovne všetkých prastarých divov boli navýšené o úrovne 31-35. Väčšina poskytovaných bonusov a produkcií na týchto úrovniach rastie rovnako ako v predchádzajúcich úrovniach, avšak niektoré sa v týchto leveloch nenavyšujú (ešte nie je jasné, či sa jedná iba o nateraz neimplementovanú funkciu alebo zámer). Príkladom tohto je napríklad skrátenie prodlevy v turnajoch u časového skoku alebo zníženie rozpadu živoucího zboží u simie (a ďalej viacero bonusov u iných prastarých divov)."}, {"3": "a do pytle, tohohle jsem se bál... tak horko těžko jsem některé divy vytáhl na 30 [smilie--sprite3] kde mám ty VB brát, bez podpory push účtů [smilie--sprite7]"}, {"16": "@Emhyr var Emreis II Dle Marindorovy odpovědi na betě se ani nemusíš obtěžovat.[BR]Takový Časový skok nemá smysl vylepšovat nad lv 30, když čas mezi koly turnaje zůstane stejný a vylepšovat to kvůli produkci prošlého zboží navázaného na základní neposílenou hodnotu nemá smysl. To samé platí pro celou řadu divů."}, {"3": "@Lovec Krys to mi je jasné, že některé ty divy nebudou mít smysl jít dál. Když já tak nemám rád \"nedodělanou\" práci... bude mě to rozčilovat [smilie--sprite8]"}, {"16": "To mě to tolik štvát nebude - mám dost jiných divů na vylepšování, spíše mě štve, že teď mám zastropovaných pár divů, které jsem chtěl vylepšovat, jakmile jim zvýší úroveň.[BR]A docela se děsím, co nám zastropují příště....[BR][BR][BR][BR]ps: Obrázek od hráče Brummbaer mluví sám za sebe:[BR][IMG]https://i.ibb.co/CMCMBY5/https-cz-forum-elvenar-com-index-php-attachments-1589281540827-png-4455.png[/IMG]"}, {"20": "Zajímavá zpráva. Vůbec jsem neplánovala některé divy dotáhnout na 30 lv., ale Zlatá propast bude mít určitě smysl posunout výš."}, {"158": "@Ludi z obrázku je patrné, že zastropovali navýšení obyvatel u H. Sídla, takže se obávám, že to samé bude u Z. Propasti, takže ani tento div nebude mít smysl vylepšovat [smilie--sprite3]"}, {"3": "@Lovec Krys tak tady se opravdu už nabízí otázka - proč? alespoň se o horsí nebudu muset dál starat a nechám ho hnít na lvl31 (ty relikvie do toho dám)"}, {"16": "Propast je taky zastropovaná. Lv 31+ zvyšuje pouze produkci mincí. Podle informací z beta fora zřejmě každý div na 31+ pokračuje jen jedním bonusem (obvykle tím méně užitečným).[BR]Na lv 31+ si je můžete vylepšit, abyste:[BR]Měli více bodů (to asi platí jen pro těch pár hráčů na světě, kteří je mají skoro všechny na 30)[BR]Měli dražší věž (každá úroveň zdražuje věž, prý jen trošku, ale formuli nám nikdy nedali a nedají, takže vlastně nevíme, jaký přesný vliv to má, jen víme, že ji to zdraží).[BR][BR]@Emhyr var Emreis II Já do toho nedám ani ty relikvie, jednak to stojí prostě příliš mnoho orků a jednak si tím akorát zdražím věž."}, {"20": "Lovec Krys - já nemám úplně dojem, že by vylepšování divů zdražovalo Věž, zatím jsem nic takového nepostřehla. Určitě se mi o něco výkup zdražil vstupem do nové kapitoly. Bojové divy mají na střety stejný vliv jako v turnaji. Smlouvat se dá snadno první patro, druhé jen něco a třetí už je potřeba bojovat, smlouvání je předražené a málokdy vyjde. Ale je fakt, že urychlovače, které mi to hodí, doplní vojsko velmi snadno. Zdá se mi, že na střety ve Věži má vliv počet získaných provincií."}, {"91": "Také jsem měl za to, že tu kdysi někde byla zmínka, že úroveň divů ovlivňuje náročnost ve věži. Zatímco turnaje by měla ovlivňovat velikost oddílu. Co všechno ovlivňuje věž nevím, ale zdá se mi, že je těžší než dřív, a přitom oddíly úspěšně vynechávám, v nové kapitole ještě těsně nejsem, a předchozí obě měly všechny volitelné."}]