[{"31": "Na bete to moderátor potvrdil a levely prastarých divov sú naozaj vstupným argumentom výpočtu náročnosti veže. Vraj sú ale len jedným z mnoho faktorov, takže ten vplyv nie je nejak veľký, i keď videl som porovnanie nejakého hráča, ktorý mal 2 mestá v rovnakej kapitole, kde jedno malo viac divov ako druhé a rozdiel v nákladoch uviedol 66%."}, {"201": "Tak divy ovlivňují i přísun semínek,žeo ..Takže spíš jde o to nevylepšovat nebo vylepšovat divy ?? ..což je jasná odpověď ..vylepšovat,ale proč je to přínos a na druhou stranu zápor v něčem jiném?? To samé velikost oddílů je kontraproduktivní,ale proč? ..nedává mi to moc smysl ,že je to na jednu stranu přínos který se,ale na druhou stranu jinde stane záporem .."}, {"91": "hanz44 >> Smysl v tom nehledat, je to důsledek toho, když se něčí armáda dopočítává podle pokroku. U těch oddílů se dá zvolit strategie, u divů a věže je to složitější, ale zase v turnajích a celé hře mají divy jinak nemalý přínos."}, {"201": "Kompenzujou nám to pomocnejma budovama ať už z věže nebo z řemeslné a ještě nám dali ohnivého fénixe a hnědého medvěda ..oni to maj promakaný,né že ne @Pauleo "}, {"91": "No teď je otázka, zda to právě není nastavené tak, že musíš mít Felixe, apod., abys mohl hrát. Zkus si vybojovat celou věž beze všeho, docela rozdíl. A pomocné budovy je třeba brát s rezervou, někomu padnou (se objeví), jinému ne."}, {"181": "Jenze fenix je problematicka vec. Fenixe sice sezenes v akademii, ale dost tezko ho vylepsis na 10. level. Me se to treba na cz1 ani na bete nepovedlo (nehraju to  tam tak dlouho).  A buhvi kdy budou dalsi artefakty.[BR]A bez fenixe je v nizsich kapitolach turnaj i vez dost utrpeni.[BR]No promakany... Ani moc ne... Spis na to kaslou... Uz jim nestoji za to vypnout odmeny v akademii, aby nebyly lepsi nez to, co je v eventu."}, {"31": "Narodeninové oslavy sa pomaly začínajú na bete.. [BR]5. narodeniny hry[BR][BR]Spoiler: 5. narodeniny hry[IMG]https://i.ibb.co/hdpQpgT/https-i-ibb-co-c6-QZTJj-EL-narodeniny-5-banner-17-5-2020-png.png[/IMG][BR]Hra sa blíži k svojmu 5. roku a od zajtra (18.5.) sa začnú na bete testovať narodeninové oslavy. Ich súčasťou by mala byť špeciálna výzva a tiež viaceré výhodné ponuky (možno niektoré vo forme skrátených alebo zvýhodnených produkcií v manufakturach, ktoré sa už dlhšie neobjavili).[BR][BR]Do hry bude zavedená takisto nová budova, ktorá bude poskytnutá buď ako narodeninový darček alebo odmena za dosiahnutý pokrok vo výzve. (Jej tabuľku už mám pripravenú a zverejním ju do prehľadu Speciální budovy zrejme zajtra doobeda.)[BR][BR][IMG]https://i.ibb.co/8YPsxzk/https-i-ibb-co-T4-FKy-N8-EL-narodeniny-5-tab-17-5-2020-png.png[/IMG][BR]U nás sú tieto narodeninové oslavy naplánované po skončení májovej udalosti. Pravdepodobne tentokrát nebude prebiehať, bezprostredne po jej skončení, dobrodružstvo, ako to bolo zvykom niekoľko udalostí dozadu, ale narodeniny budú jeho náhradou (na jún je už totiž naplánovaná nová veľká udalosť, ktorá bude pomerne krátko po májovej, a tak priestor na DS tentokrát zrejme nebude)."}, {"160": "OOo,tak žeby konečně nejaká nová, pozitívni zmena??  Tak to jsem teda zvedavá a nechám se prekvapit )"}, {"31": "Prvý deň testovania narodenín na bete sa začal. Podľa aktuálnych informácií to vypadá nasledovne:[BR]5. narodeniny hry[BR][BR]Spoiler: 5. narodeniny hryPočas celej doby narodenín (3 dni), bude prebiehať špeciálna narodeninová výzva.[BR][BR][IMG]https://i.ibb.co/4pHX3VC/https-i-ibb-co-1-Qr9-MRG-EL-narodeniny-5-v-zva-18-5-2020-png.png[/IMG][BR]Výzva sa vzťahuje na manufaktury, teda medaile sa získavajú za produkciu v manufakturach.[BR][BR]Odmeny vo výzve:[BR]1x prastará vědomost (1)1x prastará vědomost (3)1x prastará vědomost (7)1x prastará vědomost (10)1x Mýtina jednorožců[BR]Ako bonus k výzve, budú behom jednotlivých dní prebiehať špeciálne príležitosti zvýšenia produkcií v manufakturach. V prvý deň to bude dvojnásobná produkcia v základných manufakturach a zrejme v ostatné dni bude podobný bonus v prípade manufaktur vzácnych a magických.[BR][BR][IMG]https://i.ibb.co/NVBT39X/https-i-ibb-co-72t-Gyz-R-EL-narodeniny-5-bonus-z-kladn-zbo-png.png[/IMG][IMG]https://i.ibb.co/LCX6tRf/https-i-ibb-co-b1k-YYGR-EL-narodeniny-5-bonus-vz-cn-zbo-png.png[/IMG][IMG]https://i.ibb.co/HxM7VdM/https-i-ibb-co-Kx-YKBsg-EL-narodeniny-5-bonus-magick-zbo-png.png[/IMG]"}, {"16": "Na betě červnový event:[BR]Systém úkolů podobný z aktuálního eventu (denní bonus + úkol), zatím jsem u prvního úkolu, tak nevím kolik má s ním společného.[BR]Máme zpátky bedny, obsah se zdá být stejný jako minule.[BR]Hlavní cenou je set:[BR]Spoiler[IMG]https://i.ibb.co/pwCNLkV/https-cz-forum-elvenar-com-index-php-attachments-1590659788457-png-4485.png[/IMG][IMG]https://i.ibb.co/tMj1pqT/https-cz-forum-elvenar-com-index-php-attachments-1590659946293-png-4488.png[/IMG][BR][IMG]https://i.ibb.co/zP05XcW/https-cz-forum-elvenar-com-index-php-attachments-1590659972082-png-4489.png[/IMG][BR][IMG]https://i.ibb.co/yXDTmGw/https-cz-forum-elvenar-com-index-php-attachments-1590659999905-png-4490.png[/IMG][BR][IMG]https://i.ibb.co/V3RtCMt/https-cz-forum-elvenar-com-index-php-attachments-1590660031933-png-4491.png[/IMG]Úkolů je tentokrát více:[BR][IMG]https://i.ibb.co/VNmQpJp/https-cz-forum-elvenar-com-index-php-attachments-1590660207067-png-4492.png[/IMG][BR]A v akademii je eventová měna (150)."}, {"31": "Júnová udalosť - The Air Traders Voyage[BR][BR]Spoiler: The Air Traders Voyage[IMG]https://i.ibb.co/KWJmzJh/https-i-ibb-co-y-X2wd2w-EL-akcia-j-n-2020-banner-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]Súčasťou udalosti je nový set, všetky detailné informácie nájdete v nasledujúcich príspevkoch:[BR]Prehľad udalostiPrehľad nových budovPrehľad setu"}, {"66": "Takže první set po dlouhé době a dává jen zboží? Nemohlo by být něco na semínka/manu/orky?"}, {"16": "Dle iDavisova přehledu jsou tam budovy na všechny 3 - semínka, manu i orky - mezi denními odměnami."}, {"66": "Viděla jsem, udělala jsem si menší srovnání dle ElvenArchitekt a ta orčí loď mě zaujala."}, {"3": "@Lovec Krys dívám se na to, co set přináší. Ty máš bonusovku na hedvábí? Bo pokud jo, tak mi set bude dávat nejvíc svítků... proč museli dát zrovna T2? "}, {"16": "@Emhyr var Emreis II Jo, mám na betě bonusy na Prkna,Hedvábí a Drahokamy - stejné jako na cz1."}, {"3": "no, budu se na set muset v klidu mrknout, jestli se mi bude hodit. Letmým pohledem spíše ne"}, {"202": "Mě se to líbí, denní budovy skoro jako na přání.  Akorát nevím, proč dali ty pěkné lodě zase na začátek. Že by zpětná vazba? [BR]No, ale jelikož spolehlivě a včas dorazí dárek na uvítanou , tak to zmáknem hravě."}, {"16": "@Emhyr var Emreis II No jestli se ti hodí set zabírající 42 políček a mající produkci menší než jedna T2 za 3h, tak pak jo. To už není ani k smíchu.[BR]Zřejmě dostaneme na vánoce budovu 20x20 dávající 1VB/48h a nic jiného."}, {"91": "Lovec Krys >> Asi vývojáři zjistili, že se musí kvůli tempu některých hráčů přistupovat k odměnám trochu víc minimalisticky, takže do vánoc je ještě stále co ztenčovat ."}]