[{"203": "Tak ten set se mi nelíbí, ale líbí se mi, že zůstávají jako odměna z truhel vojáčci  a VB [smilie--sprite9]). Kvůli tomu to zkusím hrát [smilie--sprite9])"}, {"175": "dobre ranko , jede nekomu arendyll ?"}, {"91": "forthefirst >> Takže jako předminule, odměny žádný zázrak, ale aspoň vojáčci. Kvůli truhlám už to bude hratelné."}, {"174": "Nejede..."}, {"21": "pisou ze probiha udrzba su na pc"}, {"20": "jenže úrdržba už trvá něco přes hodinu ... takže něco je špatně"}, {"174": "Asi chystají ten narozeninový dárek [smilie--sprite8]"}, {"91": "petr.wp99 >> Jaký zasé? To bude stejně zase nějaká poníková klisna do města jako vdždy ne?"}, {"175": "spis nekomu spadl server na zem [smilie--sprite1] , druhy svet jede normalne"}, {"91": "Winyandor jede, Arendyl nevedu, takže vím jen odsud."}, {"181": "ani jeden cz nejel uz ve 3 v noci, v apce matouci zprava, v browseru, ze udrzba. cz2 zrejme v poho (nakonec), cz1 nikoliv.[BR]na bete byla vyva a zvysena vyroba t1, t2, t3, vzdy jeden den."}, {"174": "Info k narozeninám jsou o stránku zpět...[BR]Když si představím, jak se mi teď ve městě dělníci flákají a výroba nejede... [smilie--sprite11]"}, {"91": "petr.wp99 >> Aha, takže poníci budou, akorát na mýtině. Stavět nebudu, VB se hodí."}, {"31": "V tejto chvíli naplánovaný termín júnovej udalosti nájdete uvedený v prehľade.[BR][BR]Do prehľadu boli zároveň vložené aj (zatiaľ nekompletné) zoznamy úloh, neskôr budú ešte aktualizované.[BR]Preklad anglických názvov doplním do prehľadu po tom, čo budú dostupné ich české ekvivalenty (zrejme pri najbližšej aktualizácii hry), pre zachovanie korektnosti názvov."}, {"31": "Na oficiálnej stránke Elvenaru na facebooku sa dnes konalo živé vysielanie, primárne určené k udalosti Cesta vzdušných obchodníků. Asi nemá veľmi zmysel rozpisovať konkrétne otázky, keďže väčšinou to boli také jožinkovské dohľadateľné z každého druhého zdroja, ale za spomenutie určite stojí vyjadrenie sa vývojárov k situácii s prebytkom úlomkov kouzel (ktorý vzniká napríklad získavaním veľkého množstva z veže), o ktorom sú si vedomí a síce ešte nemajú konkrétny plán, ale riešia to.[BR]Toto živé vysielanie na mňa trochu pôsobilo ako zábavná šou (páčilo sa mi to) - dozvedeli sme sa napríklad, ako vlastne Loď orků poskytuje orkov - vypadávajú z letiacej lode k nám do mesta a keďže sa im u nás páči, zostávajú tam. [smilie--sprite1]"}, {"3": "neptal se někdo na svitky?"}, {"31": "@Emhyr var Emreis II ak myslíš prebytok svitkov zo setu tak nie, na to otázka nepadla."}, {"204": "To mě teda překvapuje, myslím, že problém přebytku svitků je čím dál ožehavější. Čekala bych, že když byla možnost komunikovat přímo s vývojáři, že to bude jedno z hlavních témat."}, {"91": "iDavis >> Jak můžou orčí peníze padat z lodě a rozhodovat se, zda zůstanou ve městě? [smilie--sprite1] Na to že se razí orčí mince ve zbrojnicích jsem si už zvykl dávno, ale tohle mi už vůbec není jasné."}, {"197": "To nejsou orčí peníze, ale orkové."}]