[{"91": "A proč se s nima teda uplácí? Je tam i obrázek obchodu, takže leda že by to byl obchod s otroky. Stejně tak vylepšení některých položek ve městě + výzkum, vždy jen surky, nikdy ne armáda."}, {"202": "A proč řeší vývojáři nadbytek šrotu, který nikomu nevadí, leda že někteří jedou řemeslnou nonstop a občas jim z toho nedejbože vypadnou  ? Já např. vyrábím relikvie na lepidla, abych měla z čeho vyrábět relikvie na lepidla a poslední dobou také urychlovače, protože je vyřadili z událostí. Nebo krmení, toho není nikdy dost. A nadbytkem šrotu netrpím. Když nebude dostatek šrotu, ztratí řemeslná význam a zvířata rovněž. Leda že by nám dali možnost, šrotovat ty nadbytečné svitky. [smilie--sprite2]"}, {"3": "tobě nepřebývá šrot? Já mám asi 600.000 úlomků a určitě se najdou borci s ještě větší porcí"}, {"158": "já se stabilně držím mezi 60k-70k úlomků, řemeslná výroba se zastavuje jen když tam jsou naprosto nepotřebné věci. Jinak urychlovače, posilovače, žrádlo. 600k na skladu jde mimo moje chápání [smilie--sprite8]"}, {"3": "napadalo mi to z věže. Rozkraftovávám jen když to chce event nebo když už se mi tam nakupí moc bordelu ze starých kapitol a otravuje mě to [smilie--sprite1]"}, {"203": "HMM a já mám úlomků jen asi 300, takže věru přebytkem netrpím a myslím, že případný přebytek těchto úlomků snad nemůže vadit nikomu. To ty svitky jsou jiná věc [smilie--sprite4]"}, {"16": "@Pauleo Když je můžeš přimýchávat do malty (viz. ceny na vylepšení dílen a vojenských budov ve vysokých kapitolách), proč bys je nemohl prodávat do otroctví.[BR][BR]@Fjorgyn, @forthefirst  Stačí jet každý týden celou věž a úlomky budou přibývat velmi rychle (kdo nemá na celou věž, tak i z prvního případně druhého patra toho napadá dostatek).[BR][BR]@Emhyr var Emreis II  Já jich mám teda jen 424K, ale další budou v inventáři v tom 7 stránkovém bordelu."}, {"205": "Moc Vašim úvahám o přesvitkování a přeúlomkování nerozumím. Pravděpodobně nejsem v dost vysoké kapitole. Dokončuji teprve víly. [BR]Co se týků úlomků, tak pravidelně jdu věž na druhé patro, (třetí se mi zatím nevyplatí, surky a vojáčky potřebuji investovat jinam, tak ho ignoruji). Ulomků mám tak tak na hraně, abych byl schopen vždy něco kraftit. Spíš se nyní dostávám k tomu, že nebudu mít z čeho vyrábět. [BR]A co se týká svitků, tak kolikrát je problém je vůbec získat na tržišti. Nyní aktuálně něco málo vidím, ale to je spíše výjimka."}, {"202": "@Emhyr var Emreis II[BR]Tak proč si je syslíš? Snad abys omylem nevyhrál VB, urychlovače nebo , protože těch máš taky nadbytek? No, tak to je teda nuda! [smilie--sprite8][BR]@Lovec Krys[BR]Stačí jet každý den výrobu a úlomky budou velmi rychle ubývat.[BR]Nedostatkem netrpím, mívám kolem 10k do foroty. A chci snad trpět? Tak to už bylo, dokud nebyl šrot ve věži. Řemeslná mi stála, ne proto, že by mě nebavila, ale protože jsem na ní neměla. To přece nemůže nikomu vadit, že mají všichni dost. Tím nevzniká žádná nerovnost v podmínkách hry.[BR]@prchlik[BR]Co se týče svitků, jsi spíše výjimka. Vyrábím svitky a nemívám v nabídce skoro nic jiného. Jak ráda bych Ti je měnila za křišťál nebo hedvábí. Takových je nás hodně."}, {"3": "Jirinazel napsal/a:@Emhyr var Emreis II[BR]Tak proč si je syslíš? Snad abys omylem nevyhrál VB, urychlovače nebo , protože těch máš taky nadbytek? No, tak to je teda nuda! [smilie--sprite8]Klikněte zde pro zvětšení...nesyslím. Vyrábím skoro nonstop (teď zrovna stojí, protože v nabídce jen odpad typu relikvií, jednorožců apod), ale přesto zásoba narůstá..."}, {"16": "@Jirinazel Já vyrábím každý den, ale taky nevyrábím non stop. Takže to co získávám, mi aktuálně stačí. Takže odhadem tak na 80% kapacity oproti stavu, kdy bych měl neomezený přísun činidel. Recepty mám rozdělené na ty, které vyrábím vždy, když se objeví (budovy do turnaje), téměř vždy (jídlo pro mazlíčky - vynechám jen občas, když se to bije s budovami do turnaje a nechce se mi použít urychlovač) a pak další recepty, které vyrábím, když se ty prioritnější neobjeví (typicky VB, požehnání na mince a kladiva, urychlovače).[BR][BR]ps: Jsme už trošku OT s výrobou věže."}, {"91": "Lovec Krys: Když myslíš, ale já s nimi fakt celou dobu nakládám tak, že mám za to, že jsou to orčí peníze ve tvaru orčí hlavy, tzv. orky [smilie--sprite1].[BR][BR]Jinak je fakt, že kvůli úlomkům jsem ještě před věží rozčarovával přebytečná kouzla, protože budov tolik nebylo, ani v událostech. Ale teď ani netřeba celá věž. Na začátku dost hráčů hrálo první patro, a i tak jim rychle přibývaly."}, {"158": "@Lovec Krys já dělám pravidelně celou věž. Možná neděláš dostatečně řemeslnou výrobu. Pokud jsou dobré věci najednou, tak i urychluji. Postavením druhé knihovny už jedu do kladných hodnot i s činidly, takže se nemusím omezovat. Nerozebírám kouzla a budovy jen když dostanu duplicitní z novější kapitoly."}, {"206": "Nechápu proč řeší zrovna úlomky kouzel, podle mě jich nikdy není dost. Jestli to nějak rapidně omezí tak můžou rovnou zrušit akademii. Jestli jich někdo má přebytky tak asi nevyrábí. Myslím že tu jsou jiné věci co stojí za řešení než tohle."}, {"91": "Melindra >> Právě že je dost lidí, co vyrábí nonstop, občas i urychlují, a i tak jich mají statisícové přebytky. A to je ještě možnost rozkládat, což dnes už moc hráčů nemusí vůbec dělat, leda do úkolu. Na druhou stranu nechápu proč nepadla vůbec zmínka o problému setu půlmsíční knihovny a vlivu na rozvážení surovin, např. bismuthu."}, {"16": "@Melindra Jedním slovem: Věž.[BR]Každý, kdo jede celou věž, má přebytky úlomků, aniž by rozbíjel věci v inventáři.[BR]Druhým významným zdrojem svitků je set z knihovny, zvláště, pokud jich hráč má několik, byť většina, ne li všichni, má tento set kvůli činidlům a ne kvůli úlomkům."}, {"207": "Já jen k úlomkům. Jsem v druhé kapitole, takže věž mám zamčenou. Ale myslím si že velké zásoby mohou mít jen hráči, kteří jsou již v velmi  vysokých kapitolách. Pro nás ostatní kteří jsme nízko (sebe zatím nepočítám)  bude dlooooouho úlomků kouzel akorát. Obtížnost střetů ve věži je myslim individuální podle toho v jaké kapitole se hráč nachází. Ale čím lehčí střety tím méně i úlomků jako odměna mám pocit. Takže hráč ve vysoké kapitole má vyšší odměny (samozřejmě těžší střety), ale v řemeslné výrobě je spotřeba za výrobu pro všechny stejná. Takže proto ty přebytky hráčů ve vysokých kapitolách si myslím. Do ničeho samozřejmě nechci mluvit. Jen je to logické. Těším se na věž, odměny vypadají skvěle  [smilie--sprite1] [smilie--sprite1] [smilie--sprite2]"}, {"16": "@LucyLoo Odměny z věže jsou pevně dané bez ohledu na kapitolu.[BR]Pokud, až vstoupíš do 3. kapitoly, dokážeš udržet dostatečně vysokou produkci mincí, kladiv a surovin, můžeš vesele jet věž a získávat stejné odměny jako my na konci (nebo alternativně bojovat, ale ve vyšších patrech se bez nakrmeného fénixe a podpůrných budov pro boj moc bojovat nedá).[BR]U věže platí jedno pravidlo - výkup surovin se vybírá náhodně ze surovin dostupných o kapitolu níže, než ve které jsi. Tzn. že vstupem do 3. kapitoly můžeš mít ve výkupu mince, kladiva, všechny 3 T1 a všechny 3 T2 - tzn. výběr z 8 surovin - což je také důvod, proč je věž přístupná až od 3. kapitoly, jelikož v závěrečném střetu na konci 3. patra hádáš z 8 surovin.[BR]Ten přebytek úlomků bude souviset spíše s tím, že pokročilí hráči mívají častěji optimalizované vesnice tak, aby kromě turnaje mohli dávat pravidelně i 2-3 patra věže a hlavně již věž hrají nějakou dobu, takže jim napadali budovy na několik setů z věže - já například mám 3 knihovny a v inventáři dalších 5, takže kdybych chtěl, mohl bych z nich mít 8 činidel denně a spoustu úlomků. V mojí aktuální konfiguraci získávám 1455 úlomků denně jen ze setu + všechno, co mi napadá z věže - to bývá velmi často 1000 úlomků se šancí typu 40% apod. - přesněji to můžu napsat zítra až věž začne - většina odměn je pro všechny 3 patra stejná."}, {"207": "@Lovec Krys .Děkuji moc za vysvětlení. Toto mě potěšilo. Většinou řeším vše bojem, ale to půjde nyní asi jen že začátku, protože čím vyšší patro, tím vše jistě náročnější. Nevadí. V turnaji nezvládám čtvrtou úroveň provincií, ale než dokončím kapitolu, tak již budu mít vylepšení sermirek a lesního ducha. Takže boje budou snadnější a jistě i ve věži půjdou aspoň že začátku lépe. Moc děkuji za vysvětlení. Potěšil jsi mě"}, {"203": "Lucy tak zrovna ty šermířky a plácači roztleskávači (duchové) ti ty boje neusnadní. To jsou velmi slabé jednotky a navíc je bez fenixe v nízkých kapitolách moc nevylepšíš ( pouze zdraví jednotek ne útok). Takže s usnadněním bojů nepočítej"}]