[{"91": "Tak pořád lepší něco než nic. A duch není zase tak slabá jednotka, pouze je pomalý a zranitelný na dálku, stále ho z pozdějších těžáků žádný vyloženě nenahrazuje. A jet u ducha na zdraví taky není k zahození."}, {"20": "@forthefirst - šermířka není vůbec slabá jednotka, jen se musí správně použít.  A Lesní duch je naprosto vynikající. Teď už sice většinou používám k boji jednotky z Tábora, ale v některých bojích pořád bojuji jednotkami z kasáren, protože je mám z divů. A Lesní duch i Obrňák z kasáren jsou pořád vynikající.[BR]@LucyLoo - je pravda, že jak pokračuješ hrou, jsou boje těžší, ale postupně získáš silnější jednotky a také je možné postavit divy, které s bojem pomohou. Také jsou kulturní budovy, které posilují v boji: Trpasličí zbrojíř z Věže, a pak ty různé 5 denní budovy z Akademie (stromečky). A časem se určitě zase něco šikovného objeví v eventech."}, {"203": "@Ludi - šermířka i plácač jsou velmi slabé jednotky a to z toho důvodu,že útočí z bezprostřední blízkosti. Ve srovnání s lidským těžkooděncem, který útočí přes jedno pole je to nebe a dudy. Při ručním boji sundám se svým jednohvězdičkovým těžkooděncem toho plácače klidně i tříhvězdového, kór pokud je na mapě nějaké křoví ). Ty jednotky, které musí být při útoku přímo u protivníka mají v bojích vždy ztráty. A nejlepší jednotka z kasáren je pro mě lidský mág ( kněz ), který je mnohem lepší než elfí čarodějka."}, {"91": "forthefirst >> Tak ale furt srovnáváš jednotky lidí s jednotkama elfů (pokud někdo hraje elfy, tak mu to asi moc nepomůže). Taky nesrovnávej ruční boj s automatem, většina hráčů manuál z časových důvodů nehraje. A ty jednotky co útočí přes pole jsou sice dobré svým rozsahem, ale zase mají podlomené zdraví, typicky když jdu proti rytířům toho moc nevydrží, zatímco třeba bažiňák je významně odolnější jednotka, ale zase má omezený rozsah útoku. Takže ono je to spíš o tom, zda stihneš jednotky vyřídit včas, jinak dostaneš na zadel. Za elfy máš taky později valorianskou stráž, ale s duchem se rovnat odolností nemůže, přesně proč v některých soubojích pošleš duchy a v pohodě, pošleš strážce, a všichni umřou. Jsou totiž spíš na slabší obrněné střelce než plnohodnotná těžká jednotka. A ty mágové na dálku mají zase podlomené zdraví. Mají silné a daleké útoky, ale nesmí se jim nikdo dostat na kobylu, jinak jsou hned v pánu. Typicky kněz nebo květinová kouzelnice. Takže ono má vše pro a proti, záleží proti čemu stojíš, a taky každá má jiné oslabení nepřítele a proti některým uskupením s mágy má silější útoky. A na manuál se hraje celkově s úplně jinými ztrátami, to i s duchem, ale kdo to hraje."}, {"16": "@Ludi Problém šermířek je, že ve střetech, kdy je dobré je použít je většinou lepší volbou obrněný střelec. Takže je používám jenom proto, že se mi generují v Trpasličím valu.[BR][BR]@forthefirst Ruční boj je v dnešním turnaji nepoužitelný. Nikdo nemá čas ručně bojovat 800 a více střetů týdně. Absolutní špička jede i přes 60 provincií na 6*, což je 1440 střetů. I automatem to trvá strašně dlouho."}, {"20": "@Lovec Krys - znám limity šermířek, ale jsou prostě střety, kdy jsou lepší než střelec. Je to podobné jako s Včelí jezdkyní. Některé boje ve Věži jsou stavěné přesně na tyto jednotky. I v turnaji je užiju.[BR]Jinak souhlas, že ruční boje dlouho trvají. A když už hraju pár let, tak mě už ani moc nebaví mlátit to ručně. Já otvírám většinou 40, někdy i víc provincií, a to bych se z ručního boje zbláznila. A víc provincií neotvírám právě proto, že to všechno trvá tak dlouho i na automat trvá věčnost.[BR][BR]@forthefirst - boje elfů jsou prostě jiné, než u lidí, nedá se to srovnávat."}, {"206": "Ahoj, chci se zeptat ten automat je jen v PC verzi nebo i mobilní?"}, {"66": "@Melindra V mobilní verzi je právě pouze automat. Ručně bojovat na mobilu nejde. Jen v PC verzi si můžeš vybrat."}, {"206": "@Prealiena Aha tak to jsem špatně pochopila. Myslela jsem že automat znamená, že se mi sami doplní jednotky k boji bez toho abych je vybírala. Jak tedy vypadá ruční boj?"}, {"91": "Melindra >> Ruční boj vypadá tak, že všechny své vybrané jednotky ovládáš na mapovém poli ručně podle jejich skutečných parametrů jako je rozsah pohybu, útoku, iniciativy (kdo hraje dřív), popř. zdržení se kola, a po odehrátí kola hraje počítač. Když hraješ automat, tak hraje počítač za obě strany, a vyhodí ti jen výsledek."}, {"206": "@Pauleo Děkuji za vysvětlení "}, {"11": "@Melindra  pak je ještě možnost dát bojovat ručně a po naskočení obrazovky přepnout na automat. A můžeš se dívat na boj v přímým přenosu a dá se z toho vyčíst u jakých jednotek třeba děláš při nasazování chybu. Ale to jde asi taky jen na PC"}, {"91": "Je to tak, možnosti kde se zobrazí mapa jdou jen na přohlížeči, v mobilu je jen automat s vyhodnocením výsledku. Tam jde jen vybrat jednotky a to je celé."}, {"31": "Prichádzajúce zmeny a novinky postrehnuteľné na bete a ďalšie[BR][BR]Spoiler: Nadchádzajúce zmeny a novinkyZa poslednú dobu sa na bete objavilo viacero známok toho, že sa do hry chystajú nejaké novinky a zmeny niektorých funkcií. Niektoré z nich vo forme bugov (ktoré naznačili, že sa okolo niečo deje) a iné vo forme zatiaľ oficiálne nespomenutých drobných zmien. O niektorých plánovaných zmenách sa už začala aj nejaká tá diskusia, síce s veľkým množstvom domnienok, ale keďže vývoj pokračuje a hra naberá informácie, ktoré to potvrdzujú, tak zhruba takto to vypadá v tejto chvíli:[BR][BR]1. Turnaje[BR]Istá debata a špekulácia podľa postrehnutej zmeny už aj na našom serveri sa začala tu. Je veľmi očividné, že na pláne sú nejaké zmeny a zásah do turnajov (čo ako tak kvitujem, keďže turnaje si roky žiadnou zmenou neprešli). Zrejme najväčšou novinkou bude pridanie nových truhlí pre spoločenstvo, čo by mohlo z turnajov raz a znova spraviť výzvu. Aktuálne je naplánovaných celkovo 19 truhiel, prvých 10 sú nezmenené súčasné (aspoň zatiaľ), zvyšných 9 je nazvaných ako \"bonusových\", s dodatočnými odmenami pre spoločenstvá, ktoré dosiahnu nad 40000 bodov. Počet bodov potrebný na dosiahnutie všetkých nových truhiel asi nemá zmysel v tejto chvíli konkretizovať, keďže ďalšími zmenami, ktoré sa okolo turnajov plánujú, sa môže zmeniť aj pohľad náročnosti.[BR]Bugmi, ktoré sa objavili na bete, vznikla špekulácia, či nedôjde aj k nejakej zmene štruktúry a hrateľnosti turnajov. Konkrétne išlo o spomalenie turnaju (v tom zmysle, že nárast náročnosti jednotiek sa čistením provincií zmiernil (teraz sa 3* jednotky objavujú od 10. provincie, vtedy sa objavili až okolo 35.)). Špekulácia teda bola, či sa plánuje prechod zo 4 stretov na provinciu na 1 stret na provinciu a vypadá to tak, že táto zmena naozaj na pláne je (najnovšie informácie za tento týždeň to vlastne explicitne potvrdzujú), čo by teda výrazne znížilo klikanie pri turnaji a možno aj zvýšilo záujem viacerých hráčov ho hrať.[BR]Aký dosah toto bude mať na odmeny z provincií zatiaľ jasné nie je, ale nemožno vylúčiť taký scenár, že sa budú, podobne ako vo veži, snažiť motivovať k spolupráci všetkých členov spoločenstva (teda je možné, že dôjde k poklesu individuálnych odmien, ale nárastu spoločných (spomenuté vyššie), ale toto je len moja domnienka, takže či, a aký vplyv to bude mať na borcov s 15000+ bodmi za turnaj zatiaľ nemá zmysel riešiť).[BR][BR]2. Nové zboží a kapitoly[BR][BR][IMG]https://i.ibb.co/0fPDm92/https-i-ibb-co-52h-Vj-Xg-EL-aplik-cia-nov-preh-ad-relikvi-3-7-2020-mal-png.png[/IMG][BR]Tí ktorí hrajú aj na mobilnej aplikácii, si možno všimli, že poslednou aktualizáciou došlo k zmene zobrazovaniu stavu relikvií v hlavnom v sídle. Na obrázku vyššie je screenshot aktuálneho výzoru. Jeden hráč na bete postrehol, že sa nejedná iba o zmenu výzoru, ale je tam čosi viac. Do pozornosti spadá hlavne posledný riadok relikvií (na obrázku vyššie mramor, hedvábí a drahokamy, čo sú moje jediné neposílené relikvie) a ich zámky, ktoré naznačujú, že ich bonus nie je ešte dostupný. Po prvotnej diskusii bolo domnienkou, či sa blížime k zavedeniu zboží T7 - T9.[BR]Isté veci sa medzičasom čiastočne potvrdili, a teda vypadá to tak, že v 17. kapitole sa dočkáme vylepšenia budovy tržiště na 6. level, v ktorom pravdepodobne bude produkovať novú surovinu (podobne ako v 11. kapitole to boli semienka) a tá bude potrebná na následnú produkciu nového zboží. V tejto chvíli sú už vlastne nahodené aj levely tržiště 7-9, postupne odomykané v kapitolách 18-20. Vypadá to teda na podobný scenár ako pri kapitolách 11-14, akurát samozrejme v tejto chvíli ešte nie je jasné, či sa bude jednať o živoucí zboží, alebo o nejaké úplne nové (tú druhú možnosť avšak považujem za pravdepodobnejšiu - žeby Cesty vzdušných obchodníkov svojím príbehom čosi napovedali o obchodovaní s Unurom?).[BR]Časom teda uvidíme, do akej miery budú tieto veci, na základe aktuálnych príprav už viditeľných v hre, reálne.[BR][BR]3. Udalosti[BR]Tento rok máme harmonogram udalostí naozaj nabitý a inak to zjavne nebude ani v druhej polovici (čo určite kvitujem). Bežia posledné dni júnovej udalosti a asi koncom júla príde letná (ktorá by sa mala v dohľadnej dobe začať testovať na bete, spolu s mierne upravenou mechanikou). Či bude nejaké dobrodružstvo medzitým, sa v tejto chvíli ešte nevie."}, {"3": "noo, už tak odměny z věže způsobili lehkou tenzi mezi hráči (chtějí odměny/pohodu) a pokud se pohne s turnaji, může to brzy spustit zajímavá škatulata... Osobně jsem ale pro změny u turnajů. Jen ale aby to neznamenalo pokles VBček. Z těch (pro mě lehčích) turnajů jsem byl aktuálně schopný vytáhnout skoro 600VB..."}, {"16": "Já samozřejmě uvítám, když se mi klikání v turnaji zmenší na 1/4 času (zabírá to strašně hodně času, když jedu všechny turnaje na 10K+ bodů a ještě u toho klikám turnaj na cz2 a betě (zacíleno na 1600)).[BR]Zásadní pro mne samozřejmě bude osud plánku.[BR]A případné změny v počtu získaných VB (ale i relikvií - jelikož při 24/7 výrobě mag. výroby je potřeba v současné době mít přísun odpovídající score přes 7000 bodů v odpovídajících turnajích).[BR]Takže důležité bude, jestli někdo nechytne nerfovací mánii, to rozhodne, zda to bude vítaná změna nebo ne.[BR][BR]ps: Zajímavá motivace do turnajů by mohla být v případě, že by se alespoň částečně přenesl zásluhový systém odměn z truhel z věže. (Tzn. že hráč, který nahraje 30 bodů nedostane odměny z truhel i kdyby společenství dalo všechny truhly)."}, {"3": "je fakt, že vzhledem k tomu, že divy z poslední kapitoly dávají body za výsledky ve věži a v turnaji se asi dalo čekat, že s těmi turnaji taky něco provedou..."}, {"20": "Otázka je, kolik dalších bodů to bude chtít a jaké zásahy budou do dosavadních truhel. Samozřejmě, kde bude plánek a jestli se nakonec nesníží zisk VB z vlastní hry hráče. Moc se mi nelíbí, že je možný pokles individuálních odměn. Jeden střet na provincii zní dobře, jen jestli to nebude znamenat pokles zisku bodů v turnaji a odměn za provincii. Aby z toho nakonec nebyl zvláštní pokus, jak dát hráčům vlastně méně, než doposud.[BR]A další druh zboží - pokud by to znamenalo budovat nové manufaktury od lv. 31, tak nadšená zrovna nejsem. No, uvidíme."}, {"91": "No hlavně to zase nezakřikněte, nevíte že Inno má ucho všude? ;-)[BR][BR]Emhyr >> Tak ale to je věc ale jen pokročilých společenství, ostatní ty divy nemají, a přitom si doteď mohli při větší snaze něco nahrát v turnaji.[BR][BR]Ludi >> No je to dost možné, ucho vývojářů zachytilo, že řada hráčů je už opět na konci, a čas mezi kapitolami berou jako čas na vylešování divů, takže je napadlo je přibrzdit."}, {"66": "Tak tím T7-T9 zbožím mě naštvali. Zase stavět manufaktury od nuly. Kde na to mám pořád brát místo/populaci?[BR][BR](S tou populací se to asi nějak udělá, když máme termální prameny, ale to místo. )"}]