[{"3": "T7-9[BR]spíš bude zajímavé, jak to bude s výrobou. když tam budou výroby základních surovin (3h a 9h), pod tím t4-6 (3h a 9h), tak kde zbyde místo na ty T7-9?..."}, {"11": "tak postavíš tu třetí T1 kterou ještě nemáš ne? a bude to stejný jak u T4"}, {"16": "@voyager-1 Emhyr má na mysli, že v manufakturách jsou jen 4 pozice na výrobu (1-23lv 3h,9h,24h,48h a od 24+ 3h,9h,3h,9h).[BR]Nejjednodušší je upravit je na 6 pozic (jako je tomu u dílen), pak se to tam vleze."}, {"114": "Páni! Takže na město mám bonus:[BR]T1 - T3[BR]prkna 3 x, hedvábí 5 x,  prach 5 x (celkem manufaktur 13),[BR][BR]na živoucí T4 - T6[BR]mramor 1 x, křišťál 1 x, drahokam 1 x (celkem manufaktur 3)[BR][BR](co přijde po živoucím?) - počítám, že bude také stačit od každé 1? T7 - T9[BR]ocel 1 x, svitky 1 x, elixír 1 x (celkem manufaktur 3, ty ještě nikdo nechtěl)[BR][BR]To je mít ve městě celkem 19 manufaktur! Tak to je výzva! [smilie--sprite1][BR][BR]Jinak to chápu asi jako @voyager-1 , postavím zbývající 3 manufaktury, které ještě ve městě nemám, tedy mám základní zboží, potom živoucí zboží je +1 výroba, a ta další trojice neznámého druhu je +2 výroba, tedy v nabídce výroby mi bude opět stačit 3h - 9h základ a 3h - 9h bonus, co by tedy přibylo, tak jen další 3 manufaktury do města a další druh zboží, vyráběný jako to živoucí, ale na zbývajících 3 manufakturách, které ještě co do jejich druhu ve městě nemám + tedy další 2 sloty do manufaktur."}, {"91": "Preali >> No já jedu cestou hybridek, a nevím jak to s populací zvládnu."}, {"126": "@Pauleo  také jedu celé roky cestou Hybridní..ale tak nějak začínám mít pocit z průběhu posledního vývoje kapitol, že od toho budu muset ve větší míře upustit, pristavět Termální prameny a pár obytek. Hybridní si nechám jen ty nej (typicky budovy zimní), jako je Věž Krále zimy, Hvězdy..[BR]Nerad bych ale, neb mít město zasekané pro mě nevzhlednou řadou budov, místo nějakého oživení v podobě jiných budov.[BR]Tím bych také určitě přehodnotil výběr denních odměn z událostí a už by nebyly hybridy prioritní..maxímálně obměnit jednou za rok ty zimní[BR][BR]Ještě se uvidí..:-("}, {"91": "Já lázně postavil, ale mám je jen na 1. úrovni. Ono je to vidět i na jistém oslabení odměn z událostí, kdy nějak nejsou ty pro nahrazení starších, jak to bude v zimě nevím. Jestli přijde zase perníčková ruleta, tak se od jejího hraní distancuji. Taky se mi nechce odstraňovat své duhové poníkoviště."}, {"31": "Letná udalosť - Sorcerers Pilgrimage[BR][BR]Spoiler: Sorcerers Pilgrimage[IMG]https://i.ibb.co/h7jJRyJ/https-i-ibb-co-q-WFp5nt-EL-akcia-j-l-2020-banner-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]Súčasťou udalosti je nová rozvinuteľná budova, všetky detailné informácie nájdete v nasledujúcich príspevkoch:[BR]Prehľad udalostiPrehľad nových budovV rámci tejto udalosti dôjde k viacerým zmenám v obsahu truhiel (tentokrát zastávok), všetky detaily sú uvedené v prehľade."}, {"114": "Místo truhliček Poutní místa, nádherné. [smilie--sprite1]"}, {"145": "Fajn změna [smilie--sprite1][BR][BR]Odstraněna citace. Embla"}, {"3": "no, v podstatě zmizela ta největší truhla, kde bylo 500 měny, 30VB požehnání, 20VB, velká šance na denní odměnu - ta mi bude chybět"}, {"202": "Zatím to vidím jako dost velký sešup a to po všech stránkách. Škoda. [smilie--sprite11]"}, {"20": "Ale jo, nebude to tak špatný. Hráčům, kteří nejsou tak daleko, může být budova, která dává mágy, celkem prospěšná. Já je mám z oblačné akademie. Kdyby to tak dávalo Květinovku z Tábora, to by byla jiná [smilie--sprite2]. Ale zase je léto, takže na prázdninový režim se nadala čekat nějaká bomba."}, {"3": "Já mám rozvinutelné baráčky docela rád a T3 ještě žádný nedává, tak si alespoň doplním sbírku [smilie--sprite8] Jen kdyby to dávalo víc lidí..."}, {"16": "@Ludi Počkej tak 5-10 kapitol a bude na ně div (už nám dali včelí jezdkyně a předpokládám, že nám je budou dávat v pořadí od těch nejméně užitečných)."}, {"20": "@Lovec Krys tak jasně, no [smilie--sprite8].[BR]Jinak doporučuji láskám vašim svoje nové básně v sekci Zbloudilý Poeta ...[BR]Je tam i něco k novému eventu."}, {"202": "@Ludi[BR]Já mám nejraději psy, žáby a sršně. Goléma nemusím, ani ten příběh a černé magie mám po desáté kapitole tak akorát po krk. Ale nakonec, nic mě do eventu nenutí, alespoň si odpočinu, mám to zapotřebí. Takže mi to vlastně vyhovuje  [smilie--sprite2]."}, {"16": "Kdo umí anglicky a chce se naštvat:[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/behind-the-scenes-upcoming-tournament-changes.15181/#post-87024\t\t\t\t\thttps://beta.forum.elvenar.com/index.php?threads/upcoming-tournament-changes.15182/\t\t"}, {"203": "Hm, taky z toho nejsem zrovna excited. Hodně se to zkomplikuje frajerům, co dávají dneska 50+ provincií. Taky když prohraješ střet, tak příjdeš o 4x více vojáků než teď. Ale zase se to bude dát hrát ručními boji. A těch 9 truhel navíc mě bude ve spolku asi vadit, když na ně budeme čučet pěkně z povzdálí."}, {"139": "ja se zeptam mozna blbe, ale at mame jasno. To ze pisou ze bude random/nahodne vybirana kombinace nepratel, znamena ze uz nebude jako ted ze v kristalovem turnaji byli ti a ti, tak bojujte tim a tim, v svitkovem to a to tak bojujte tim a tim...?[BR][BR]Dekuji"}]