[{"88": "Jsem z toho všeho znechucená. Jak ze změn, předhozených Elvenar týmem, tak z reakcí některých hráčů, třeba názoru, že hráč kolem levelů 8-10 je užitečnější (rozumějte \"výdělečnější\", protože víc utratí), proto má být stále zvýhodňován. Tedy z tak zcestné filozofie \"čím víc hraješ a víc se zdokonaluješ, tím víc budeš znevýhodněn\" je mi na... (není tu správný emotikon). Elvenar je stále prezentován jako strategická budovatelská hra, což však víc a víc mizí...   Jak můžu budovat, když se mi hází furt nějaké klacky pod nohy? Pořád nějaké náhodné klikačky a urputně křečovité snahy o \"podojení\" (nevím, jak to jinak nazvat) hráče o reálné peníze."}, {"11": "jsou uvedeny nějaké změny v odměnování? např. když někdo zahraje jen 30 bodů má stejné odměny jako ostatní."}, {"66": "Jako je fajn, že už nepovinné vylepšení oddílů nebude nevýhoda v turnaji, ale nelíbí se mi, že do kalkulace obtížnosti tahají divy a rozšíření.[BR]Rovněž ta tabulka stoupající náročnosti dle úrovně provincie, to si jako myslí, že nemáme dělat víc jak 20 provincií? Zvýšení obtížnosti počáteční úrovně provincií 20+ znamená, že na páté/šesté úrovni budou skoro nehratelné. Pro hráče, který dělá všechny započaté provincie až na konec (a ne všechny dostupné provincie na dvě hvězdy, jak zmiňují ve videu jako hlavní strategie) je to pro mne negativní změna.[BR]Náhodnost protivníků a zboží na výkup provincií se mi také nelíbí."}, {"175": "Me by treba zajimalo jaka vyhoda spociva ve meste, ktere je na konci vyzkumu nebo ve vetsich kapitolach ? uz ted jsou spolky ktere vez prochazeji s double ucty kolem 5 kapitoly pac ji prochazi skoro zadarmo , to same je vlastne turnaj ale tam je aspon omezeni v poctu provincii / suroviny si nasypou z vetsich mest / . a ted to jeste vypada ze vetsim mestum seberou i turnaje 50+ provincii . a jako odmena v truhlach 11-19 : 10 vb a jedna rekonstrukce ? jako fakt ? "}, {"139": "Udajne ano, uvidime jak to v utery spusti"}, {"31": "@BaluWizova v utorok sa to týka len bety, na náš server to bude zavedené až po otestovaní (čo môže trvať niekoľko týždňov) a s rôznymi zmenami (oproti aktuálnemu stavu)."}, {"114": "Lovec Krys napsal/a:\t\t\tKdo umí anglicky a chce se naštvat:[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/behind-the-scenes-upcoming-tournament-changes.15181/#post-87024\t\t\t\t\thttps://beta.forum.elvenar.com/index.php?threads/upcoming-tournament-changes.15182/\t\tKlikněte zde pro zvětšení...[BR]Proč naštvat? Ještě jsme se spolkem neodzkoušeli, tak nemůžeme vidět finální výsledek a taky než si člověk na nový systém zvykne a pošteluje co a jak, to taky nějaký čas trvá, ale např. je hodně hráčů, co na turnajích moc nenahrají jenom proto, že je nebaví klikat, nebo nemají čas tolik klikat, takhle budou mít možnost odehrát na víc hvězd a tím i bodů do turnaje, těch faktorů je v té změně tolik, že se bez odzkoušení dá akorát tak přednášet ničím neověřené teorie, prostě až praxe a např. 2 - 3 odehrané turnaje dají možnost mít k novému systému turnaje nějaké ty poznámky věcné. Taky hráči co moc s vojákama neumí, nebo nemají ptáka a medvěda a jedou na surky by měli uhrát víc když výkup bude levnější a co se týká vojáků, že nepůjdou cvičit již konkrétní na daný turnaj prioritní, myslím že jen začneme cvičit prostě všechny od každého stejně a stejně tak je i ve střetech uplatníme. Já nevím jak vy, ale už bych chtěla mít alespoň ten jeden nový turnaj za sebou, abych viděla jak bude ten finální výsledek opravdu vypadat. "}, {"208": "Tak já se tedy moc netěším. Méně soubojů, klikání, fajn. S počtem provincií extrémně roste obtížnost, mnoho hráčů zřejmě přejde na výkup, což znamená překopat město. Při rotaci nepřátelských jednotek nepůjdou účinně uplatnit stromkovę budovy na posílení mágů a střelců. Pokud se hráč nedostane v turnaji k většímu množství vb, půjdou divy nahoru hodně pomalu."}, {"16": "@luterina Přečti si příspěvky zejména od CrazyWizzarda a Donyho, pak zjistíš proč. [BR]Jestli to bez zásadních změn pustí takhle, tak to nejspíše fakt dopadne tak, že turnaji budou kralovat optimalizovaná mini města v Lesních elfech/orcích s minimem rozšíření a jedním divem a města na konci výzkumu jim nebudou moci konkurovat - prostě jejich náklady vzrostou natolik, že to neutáhnou a nebude existovat žádná možnost ani strategie, jak to vyrovnat."}, {"114": "@Dagobertt , nedělala bych si předčasné závěry a v Elvenaru už vůbec ne, překopávala jsem město nesčetněkrát, tak to že opět, už není žádné překvapení a jak se něco zaběhne a začne stereotyp, je to na nic a o ničem, změna v této hře je určitě u mě věc vítaná. Co se týká stromkových budov, právě že se budou dát uplatnit v každém turnaji, když mágové a střelci v něm budou v každém, zdraví jednotek šlo v každém vždy, co se týká těžby VB z turnajů, tady opravdu spekulovat nechci, dokud neodzkouším a ještě, vývojáři vždy reagovali na postřehy hráčů, které opodstatněné byly, a nejednou něco na základě jejich poznatků poupravili, že něco vypadá na začátku zle, neznamená, že se z toho nevyvine po vychytání much, něco lepšího, viz. event, který si přesně změnou od propadáku k větší spokojenosti hráčů prošel, nebo např. Věž, nejdřív hrůza a potom chvály až do nebes, a to nebylo jen u nich, týká se to celkově ve hře se všemi novými prvky, které do ní časem přibyly.[BR][BR]@Lovec Krys , ty bys měl za to malování čertů na zeď dostat metál! A už si někdy zažil, tady v Elvenaru, aby se něco pustilo aniž by se na tom mouchy dál nevychytávaly? Já tedy ne a znám to tu pátým rokem. Jinak podle mě nemá cenu dělat chytrého jak to vypadat bude, když to ještě žádný spolek nevyzkoušel a zatím tedy nikdo neví."}, {"16": "@luterina[BR]\t\t\tA už si někdy zažil, tady v Elvenaru, aby se něco pustilo aniž by se na tom mouchy dál nevychytávaly?\t\tKlikněte zde pro zvětšení...Naposledy v Májových slavnostech například. Oproti betě tam bylo pár doslova kosmetických změn. Dokonce i \"odměny\" typu 1 relikvie tam nechali a v podstatě úplně ignorovali veškerý negativní ohlas k eventu.[BR]Takže důvod k obavám je opodstatněný.[BR]Já se budu rád mýlit, ale zatím to vidím tak, že aktivní turnajoví hráči dostanou změnami nafackováno a turnajová špička dostane kladivem po hlavě."}, {"114": "@Lovec Krys :  \"odměny\" typu 1 relikvie tam nechali a v podstatě úplně ignorovali veškerý negativní ohlas k eventu.\"[BR][BR]Odměna jedné relikvie je prostě Smolíček pacholíček, proč by tam být nemohl? Psala jsem \"opodstatněné postřehy\", jako např. ty, které vedly k tomu, že pokud hráč odehraje event, má budovu na 10 nebo celý set zaručeně.[BR]Myslím si, že ten rozdíl mezi městy malými a městy velkými, v turnajovém skóre, bude menší než do teď, co byl i propastný. Tedy za mě by to bylo jisté vyvážení a to je žádoucí vždy."}, {"175": "Luterina , asi jsem to nepochopil . Proč by mělo město v 5 kapitole mít za A mnohem lehčí věž a za B teď už i turnaj než města na konci výzkumu ? teda turnaj měly lehčí i teď a brzdily je jen provincie ale po těchto změnách už bude nejspíše počet provincii irelevantni "}, {"20": "Pročetla jsem si to a mám rozporuplné pocity.[BR]1. Méně klikání je fajn, v tom se asi všichni shodneme.[BR]2. Jeden velký střet místo čtyř malých podle mého znamená celkově větší ztráty vojska. Ale nemusí to tak být. Prostě jak píše @luterina zatím je to nějaká teorie, a praxe ukáže, jestli to bude dobré nebo ne.[BR]3. Podle dosavadních zkušeností mám pocit, že jde o to, aby hráči, kteří otvírají víc jak 20 provincií, byli znevýhodněni. Praxe může být nakonec i jiná:  Třeba těch prvních 20 bude daleko snazších, než doposud, a tím nám zbude více vojska na ty těžší provincie. Takže v konečném důsledku to nemusí být dražší, než teď. Prostě to musíme vyzkoušet a uvidíme.[BR]4. Nelíbí se mi, že protivníci v boji budou náhodní, čili jestli to bude jako ve Věži občas předhazovat velmi nepříjemný mix, na který se jen těžko skládá vojsko, tak nevím. Teď mi vyhovovalo, že jsem na turnaj cvičila jen určitý druh bojovníků, což, zdá se, nyní nebude stačit.[BR]5. Pokud budu muset stále cvičit všechno, budu mít méně vojska.[BR]6. Pochopila jsem dobře, že i v pozdějších kapitolách se bude platit mincemi a kladivy? Doufám, že jsem to jen špatně pochopila. Nějak nemám trpělivost to všechno číst příliš pečlivě. Mana mi nevadí. Jen mám obavu, kdy nám tam na platbu dají semena. To by mě šlehlo.[BR]7. Chápu dobře, že vzorec na vypočítání velikost vojska bude podobný, jako ten ve Věži? Nebo jsem to špatně pochopila?[BR]8. Nikde jsem nenašla, jak to bude vypadat s odměnami za jednotlivé provincie z přímé hry.[BR]9. Nakonec najdeme určitě metodu, jak to zvládnout, podobně jako Věž, ale asi nám to bude chvíli trvat."}, {"11": "píše se tam např. kdo dával 30 provincií na 3 kola by měl zvládnout 30 provincií na 5-6 kol.[BR]Nevím co tady zase všichni jančíte "}, {"91": "No hlavně ať není při stejném snažení méně odměn, jinak bych to až tak neřešil."}, {"3": "voyager-1 napsal/a:\t\t\tpíše se tam např. kdo dával 30 provincií na 3 kola by měl zvládnout 30 provincií na 5-6 kol.[BR]Nevím co tady zase všichni jančíte Klikněte zde pro zvětšení...přesně tohohle se snažím chytit. Z ostatních indicií to tak ale úplně nevypadá. A to by mě mrzelo, rptoože jsem 5 z devíti turnajů jel na 50+ provincií...[BR][BR]nicméně, i tak se na nový systém těším. Změnu to už chtělo a to klikání, kdy mi kolo turnaje trvá skoro 45 minut je pekelné"}, {"16": "@Ludi [BR]6 - Ano. Změna totálně na prd. Jako by nám neluxovala mince věž, teď ještě turnaje. A jestli to taky jako ve věži bude v milionech, tak to vlastně znamená znemožnění výkupů pro hráče na konci výzkumu (nebudeme stačit vyrábět požehnání).[BR]4 - To je taky pěkně hnusná změna. Jakákoliv strategie trénování jednotek jde do háje, jestli to bude jako ve věži.[BR]7 - Dle informací to tak vypadá.[BR]8 - Z absence je některými hráči vyvozováno, že se přímé odměny nezmění (z čehož vyplývá, že pro vysoce aktivní turnajové hráče to znamená drastické snížení odměn z turnaje a tím i ochota se snažit)[BR]9 - Věž má ve výpočtu zabudovaný zásadní problém exponenciálního růstu obtížnosti, což mnohem pomalejší růst produkce časem nemůže stíhat - u některých hráčů se již projevuje dnes.[BR][BR]@Pauleo Záleží kolik dneska nahráváš. Pokud málo nebo průměrně, tak se tě to asi moc nedotkne, pokud vysoce nadprůměrně, propad bude velký až drastický."}, {"20": "@Lovec Krys : dík za odpověď. Nechápu proč musí v obtížnosti bojů ve Věži, a teď i v turnaji, hrát roli divy a rozšíření. To mi rozum nebere. K obojímu nás hra přímo vybízí a má to být na druhé straně nevýhoda? Podobná, jako doposud ve výzkumu nepovinné rozšiřování oddílu? Přijde mi to naprosto nelogické."}, {"114": "@Anthalas :  \"Proč by mělo město v 5 kapitole mít za A mnohem lehčí věž a za B teď už i turnaj než města na konci výzkumu ?\"[BR][BR]Protože malá města se perou ještě i s malými věcmi, o kterých ta velká už ani nemají tucha."}]