[{"3": "a výhoda/nevhoda. Ve videu zaznívá, že nemůžeš udělat nic špatně. Takže teoreticky by ti lepší divy měly ztížit turnaj o 5 %, ale pomoct o 10 [smilie--sprite8]"}, {"20": "@Emhyr var Emreis II - s tím taky počítám  [smilie--sprite2]"}, {"91": "Lovec Krys >> Střídavě, vždy si počkám na pár turnajů, kde se snažím vyždímat maximum, a zbyku moc nedávám. Takže mi jde o to, abych nepřicházel o odměny, to by mě asi přestalo bavit."}, {"20": "Pamatuji, když před několika lety změnili systém odměn v turnajích. Dřív po skončení turnaje byly jako odměna normální VB a to pak změnili na odměnu VB placky do divů. V úkolech se stále častěji objevují věci jako přispěj do divu. Ve městě dochází k neustálému zvětšování budov a nová rozšíření jsou nutná. Teď k divům přidali dalších 5 lv. Prostě nechápu, kde je logika věci, že nás k tomu hra vybízí a přitom to má na druhou stranu dopad na zhoršení hry ve Věži a v turnaji.[BR]Nevylepšovat divy? Nepřidávat rozšíření? To mi přijde jako nesmysl. Kde bych byla např. s manou bez Dračího opatství, počet obyvatel bez divů by byl zoufalý a tím i výroba a tak bych mohla pokračovat.[BR]Prostě bychom měli víc žádat po tvůrcích hry, aby přestali hráče trestat za jejich pokrok. Samozřejmě, že u hráčů na konci výzkumu musí být hra náročnější, než u začátečníků, ale tohle? Produkce zlaťáků ve městě není teď tak dobrá jako dřív. Zvětšováním domů zamířilo spoustu obytek do skladu. A nové domy, které sice dávají dost obyvatel, nedávají tolik zlaťáků, jako dřív. A oni dají platbu v turnajích i ve zlaťácích. V nižších kapitolách mi připadala hra vyváženější, ale teď mi to připadá nedomyšlené. Nějak se s tím popasujem, jenže jde tu o princip: něco vylepšíš, zvětšíš město, popojdeš ve výzkumu a šup, hned jsi za to potrestán. Takže přibývá hráčů, kteří raději ukončili výzkum, hrají jen turnaj a eventy, někteří i Věž. To má být vize hry do budoucna?"}, {"209": "voyager-1 napsal/a:\t\t\tpíše se tam např. kdo dával 30 provincií na 3 kola by měl zvládnout 30 provincií na 5-6 kol.[BR]Nevím co tady zase všichni jančíte [smilie--sprite1]Klikněte zde pro zvětšení...[BR]Zřejmě narážíš na video na youtube, kde změnu turnajů oznámili.[BR][BR]České titulky tvrdí, že:[BR]...\"To znamená, že pokud jste doteď zvládali řekněme 30 provincií do úrovně dvou hvězd, v budoucnu si pravděpodobně poradíte právě s tolika provinciemi na úrovni pěti nebo šesti hvězd a tak dále.\"...[BR][BR]Anglické titulky: [BR]...\"This means that when before you did like 30 provinces all on the first two star levels, maybe in the future you will complete as many provinces as you can on five or six star levels, and go less down the road.\"...[BR][BR]Překlad anglických titulků od strejdy Googla:[BR]...\"To znamená, že když jste předtím měli rádi 30 provincií na prvních dvou hvězdných úrovních, možná v budoucnu dokončíte tolik provincií, kolik je možné na pěti nebo šesti hvězdných úrovních, a jdete méně po silnici.\"...[BR][BR]Tedy nemám překladatelské zkoušky, ale tam se nikde nic o zvládnutí 30 provincií na 5 kol neříká. Naopak fráze \"do less down the road\" je něco ve smyslu \"nepokračovat tak daleko\". Ten člověk tvrdí (a je to konzistentní s tím grafem co tam ukazuje), že pokud někdo měl zdroje na dosáhnutí 30 provincií na 2 hvězdy, nyní mu stejné zdroje rozumně vystačí na dosahování 5-6 hvězd, až kam mu to půjde. [BR][BR]Změna obtížnosti chce turnaje překlopit z vodorovného na sloupcový systém. V současnosti je zvyšování náročnosti menší v rámci provincií, ale další hvězdy jsou už obtížnější. Chtějí to překlopit naopak, tedy udělat další provincie těžší, ale pokud už v nich jednu hvězdu otevřeme, je větší šance na dosažení třeba až těch 5-6.[BR][BR]Tedy rád bych se mýlil, ale pokud mi někdo do očí říká, že dělají těžší provincie nad 10 a naopak to kompenzují snadností hvězd v těchto prvních 10... tak asi opravdu nedojdu tolik provincií, jak jsem zvyklý..."}, {"158": "Problém věže (aktuálně) a potencionální problém s turnajem je, že přes empiricky získaná data se přišlo na to, že náročnost věže roste exponenciálně (kdo neví jak exponenciála vypadá, ať se na tu křivku mrkne), to ve výsledku znamená, že od jistého bodu se budou náklady/ obtížnost zvyšovat tak, že hráč nebude mít možnost toto zvýšení kompenzovat a naopak další pokusy to ještě zhorší. Takže to co říkal vývojář ve videu je tedy potencionální mystifikace [smilie--sprite1] Je to i tím, že do výpočtu \"náročnosti\" se započítávají vlivy, které nemají žádný efekt na snížení / kompenzaci nárůstu obtížnosti.[BR][BR]Sice je fajn, že prvních 5 provincií bude levnější než teď, ale to Vám 19 beden z turnaje neudělá. A 10 VB a 1KR za dalších např. 10000 bodů v turnaji je, resp. bude sebemrskačství [smilie--sprite8] A z největší pravděpodobní se můžeme rozloučit s VB farmou [smilie--sprite8]"}, {"91": "Fjorgyn >> VB farma z turnajů (a až takovou farmou bych to zase nenazval, jsou to např. u mě tak 2-3 turnaje, které sežerou čas, stojí prostedky, a dodají jen o něco málo v čase navíc v chybějící kapacitě velkého množství divů, že stejně nevím co dřív) je momentálně jedna z mála věcí, co mě na hře baví, nemyslím to klikání, ale ta možnost odehrát a něco si vylepšit, a nebo neodehrát a nezískat nic. Takže doufám, že ono další vymezení pevných hranic, nemyslí vážně."}, {"20": "@Fjorgyn  Můj názor je, že hra má ve vývojářském týmu skvělé grafiky, ale méně kvalitní programátory."}, {"88": "Nevím, co to tak složitě rozebíráte. Toto je stále na úvodní stránce Elvenar wiki: [BR][BR][IMG]https://i.ibb.co/THxzPHL/https-cz-forum-elvenar-com-index-php-attachments-02-jpg-4613.jpg[/IMG] [BR][BR]Kolik z toho opravdu platí? Je to budovatelská strategie. Ale za každý pokrok v budování se tu trestá. Hra je zdokonalována \"díky návrhům a nápadům hráčů\"?? A teď tu o Červené karkulce, prosím... Hezkou neděli přeji."}, {"114": "@Ludi , ještě že o názor někoho erudovaného nejde a žádnou váhu tedy nemá. Fakt je ten, že Elvenar existuje už pátým rokem a hráčů neustále přibývá, což je neoddiskutovatelný parametr kvality.[BR][BR]@Tydlibum , já tedy než strýčku google více věřím našemu překladateli, který má, a zvláště s překladem v Elvenaru, dlouholetou intenzivní praxi.[BR][BR]Co se týká toho jak tomu bude či nebude s novým systémem turnaje, stále bez odzkoušení jde jen o \"myslím si\", které ve výsledku vůbec platit nemusí, jak jsem se z příspěvků některých \"malířů čerta na zeď\", již několikrát v historii diskuzí přesvědčila a to nemluvě o tom, jak v některých zaznělo že např. Věž je na nic a po čase od stejného autora jak je to nejlepší za poslední dobu, co vývojáři do hry dali. [smilie--sprite8] Já si tedy počkám na tu praxi, co ukáže, než abych tu psala něco, a strašila se něčím, co ve finále může být úplně jinak.[BR][BR]Nevím co je to za \"trest\", že při vyšších levelech divů mám o 5% těžší turnaj, ale o 10% nahraji více? Potom více takovýchto trestů! [smilie--sprite8]"}, {"91": "Za mě je to spíš logická hra, pod pojmem budovatelská strategie rozumím spíš něco, co funguje podobně jak známe z reálného světa, a ne že vše opakovaně přizpůsobuji ne přirozenému vývoji, ale tomu jaké klacky jsou mi ne příliš logicky a uměle naházeny pod nohy, abych se jim přizpůsobil, poboural, překopal město s přednastaveným omezením, utvořil pár nabízejících se vylepšení, a pokračoval zase dál."}, {"88": "@luterina: nechytej mně za slovo. Myslela jsem to všeobecně. Já ti neberu tvé sluníčkářské nadšení, tak mi neber můj náhled, že když si někdo neváží mého času, neváží si tím i mně... Díky a hezký den. [smilie--sprite2]"}, {"114": "@Vicky1177 , je mi líto, ale když jsem příspěvek psala a odesílala, ten tvůj jsem ještě zobrazený a tedy ani přečtený neměla, tedy těžko bych tě v něm nějak cíleně chtěla chytit za slovo."}, {"16": "luterina napsal/a:\t\t\tNevím co je to za \"trest\", že při vyšších levelech divů mám o 5% těžší turnaj, ale o 10% nahraji více? Potom více takovýchto trestů! [smilie--sprite8]Klikněte zde pro zvětšení...Tady se nebavíme o pár procentech. Tady se bavíme o desítkách procent až násobcích. Jenom rozdíl mezi mým beta městem a cz1 městem (obě stejná kapitola - Ambasády, cz1 o 3 výzkumy popředu) ve věži byl před měsícem(21.6.) o 66% vyšší náklady na cz1 oproti betě (282 úrovní divů oproti 96 a více rozšíření než na betě), teď bude turnaj to samé.[BR]Takže já už zvažuji, které divy budu nadále vylepšovat a které zbourám, aby ta obtížnost nerostla tak rychle. Navíc budu nucen vyrábět v řemeslné výrobě doslova všechny požehnání na mince, abych byl vůbec schopen utáhnout alespoň nějaký výkup, jelikož do teď chtěl výkup v turnaji jen suroviny (a orky - alespoň tady se ten tlak na orky trošku sníží).[BR][BR]ps: Aktuální rozdíl: cz1 o 76% dražší než beta (292 vs 96 + zvětšil se rozdíl v počtu rozšíření a také trošku narostl náskok ve výzkumu (stále rozdíl do 10 výzkumů))."}, {"20": "@luterina Podle čeho soudíš, že nejsem erudovaná? Například na angličtinu překladatele nepotřebuji. Prosím, příště bez osobních útoků. Bavme se věcně o hře, ale osobní útoky sem nepatří.[BR][BR]@Lovec Krys, je fakt, že kdysi jsem tu říkala, že Věž neporoste tak divoce, ale položila jsem 2 nová rozšíření a cena střetů velice stoupla. Před tím, jsem měla výkup prvního střetu za 44000 kladiv a dnes už za 46000. Od ceny prvního střetu se pak dál odvíjí cena dalších věcí. Takže 3. patro bude masakr. Pořád to můžu uhrát, ale je to divočina. Divy vylepšovat budu, už jsem přesáhla limit 333, ale budu dál hodně zvažovat, co vylepším a co ne."}, {"3": "dokud nám neuvolní vzorec, jsou to jen spekulace. Roste to lineárně nebo exponenciálně? A co všechno se vlastně počítá a s jakými vahami? Ten turnaj bude třeba vyzkoušet. Stejně, jako cítím nadšení, tak i velké obavy (hlavně o ta kvanta VB - teď v turnaji jsem si přilepšil do svatostánku přes 600 VB...)[BR]Ludi napsal/a:@Fjorgyn  Můj názor je, že hra má ve vývojářském týmu skvělé grafiky, ale méně kvalitní programátory.\t\tKlikněte zde pro zvětšení...neřekl bych programátory, jako vývojáře..."}, {"20": "@Emhyr var Emreis II - jak vývojáře, tak programátory. Když si vzpomenu na ty \"random\" úkoly v eventech, tak mám obavy z \"random\" složení vojska protivníka. [smilie--sprite2]"}, {"16": "@Ludi Podle dosavadních zkušeností je vysoce pravděpodobné, že to bude podobné věži (pokud to nezmění), naštěstí bez více vln, tím by to zcela zabili.[BR]@Emhyr var Emreis II Parametry mající vliv jsou shodné s věží, takže je vysoce pravděpodobné, že vzorec bude podobný jako ve věži, což znamená exponenciální růst.[BR][BR]Samozřejmě vše jsou jen spekulace a odhady, v praxi to uvidíme pozítří (resp. to uvidí vysoce aktivní turnajoví hráči na betě, mezi které na betě nepatřím)."}, {"2": "Prošel jsem si co tu je napsáno nebo naodkazováno.[BR]Dovolte mi dotaz.[BR]Mám dojem, že:[BR]Zlevnil se starý turnaj, kdy se každá člen společenství snažil o 1600 bodů.[BR]Kdo hrál trunaj na dvě strany, tak je na tom cca stejně[BR]A kdo jel turnaj na plný počet provincií má prostě smůlu.[BR]Zdražené až k nemožnosti bude i projet první dvě kola kvůli VBčkům.[BR]Místo toho můžu získat 9x 10 VBček do divů.[BR]Když na to ukecám celý cech.[BR]Kolik to bude stát se zatím nikdo neodvážil říct veřejně.[BR]Takže vlastně hlavní změna je výrazné snížení VBček, které můžu z turnaje získat.[BR][BR]Chápu to správně?"}, {"91": "Emhyr >> Pokud vývojáři nestíhají hráčům, pak by měli posílit řady, a vytvořit další, popř. hodnotnější obsah, a ne jen okrouhávat možnosti, které některé hráče ve hře drží, nebo které je na hře baví. A že by se dal natřískat nesmysl, to každý nedal, možnost jsem vždy vítal, a divy mám proti jiným vylešené po málu. Mě přijde, že z bohatší hry se stává chudá, přednastavená jak se má plnit, a jak dlouho se bude hrát. Viz např. ona volba vylepšení oddílu, doteď možnost, výhoda s nevýhodu na obou stranách. Teď už jen nevýhoda, takže nutno dovyzkoumat, což není snadné. Hybridní populačky, opět volnost, výhody i nevýhody, po přidání divu do Elvenarů a nemožnosti nahradit z událostí už celkem na obtíž tak hrát."}]