[{"20": "Nová básnička, tentokrát o turnaji ."}, {"11": "ještě jsem se stále nedopátral jestli se bude měnit systém odměnování. Např. jestli pořád bude hráči stačit nahrát 30 bodů."}, {"119": "Sice nejsem žádný matematik, abych v tomto ohledu posoudila změny, které nás čekají v turnaji. Ale i přesto se těším, až je budu moci vyzkoušet. Pokud se mi zjednoduší klikání, tak budu velice spokojená. Třeba budeme všichni mile překvapeni, že nakonec změna bude k lepšímu, nikoliv k horšímu. To vše se brzy ukáže."}, {"19": "@voyager-1 [BR]Předpokládám (a doufám), že v tomhle ohledu se nic měnit nebude. Nevidím důvod, aby v turnaji byla tato hranice definována hrou. Limity by si i nadále mělo určovat společenství a spoléhat na férovost hráčů, což není problém, pokud je dobře sestavené. Pevný limit by navíc znemožnil umožnit menším hráčům nahrát méně a tím jim vypomoci. A o tom by společensví mělo být především."}, {"210": "Vicky1177 napsal/a:\t\t\turputně křečovité snahy o \"podojení\" (nevím, jak to jinak nazvat) hráče o reálné peníze.\t\tKlikněte zde pro zvětšení...Vicki, podle dílčího infa z bety je evidentní, že ti, co si dokoupili dostatek provincií budou penalizování jaksi navíc - dle výpočtového mechanismu. Takže otázka: komu co platit? Jako že bych si dokupovala dia, abych za ně točila po padesátce nové random nabídky v akademii?"}, {"88": "@M4r13nk4: vytrženo z kontextu a to přesně odsud...  [BR][BR]Vicky1177 napsal/a:\t\t\tElvenar je stále prezentován jako strategická budovatelská hra, což však víc a víc mizí... Jak můžu budovat, když se mi hází furt nějaké klacky pod nohy? Pořád nějaké náhodné klikačky a urputně křečovité snahy o \"podojení\" (nevím, jak to jinak nazvat) hráče o reálné peníze.\t\tKlikněte zde pro zvětšení...[BR]Psala jsem o hře jako celku. Při každém eventu, při každém DS, atd. opakovaně nabídka \"hypervýhodných setů\" atd. Nevíš-li o co jde, napiš, mám xx screenů ze hry."}, {"20": "@Vicky1177 - řekněme, že celkem chápu, když se na nás snaží vydělat nějaké ty chechtáky. Přeci jen Inno není charitativní organizace. Kupovat za dia není nutné, ale některé výhody za to člověk může získat. [BR]Ale, když i za koupená rozšíření ve městě jsou pak hráči penalizování ve Věži, a zdá se, že nově i v turnaji, tak to je hodně divné. [BR]Nejvíc asi změny poslední dobou dopadají na hráče v poslední kapitole. Nevím co se stane, až spustí novou rasu, a po prvním výzkumu se mi zase skokově zhorší Věž. Netuším, jestli to bude pak ještě hratelné. No, zatím ty 3 patra pořád uhraju každý týden.[BR]A jsem zvědavá na nový turnaj, jestli to bude zlepšení nebo zhoršení situace."}, {"88": "@Ludi: ale jo, samozřejmě nejsou charita, souhlasím. Mám na mysli případy, jako třeba tenhle z posledního eventu. Jako dárek jsme dostali 100 krystalů. A později na mě vyběhne hláška \"výhodné balíčky\". Rozkliknu a tohle: [BR][IMG]https://i.ibb.co/JvrR2js/https-cz-forum-elvenar-com-index-php-attachments-04-jpg-4615.jpg[/IMG] [BR]Za 125,- Kč ani o diamant navíc, k tomu pouhých 35 krystalů (tedy méně než za jeden úkol) a to má být výhodné? Ano, pro majitele Innogames. Mám dlouhou praxi v obchodě, takže tyhle triky znám. Ale pramálo se mi líbí takový způsob prezentace... Konec příspěvku mimo téma."}, {"20": "@Vicky1177 - jasně, souhlas. Mezi námi, nevím, kdo jim tuhle blbost koupí ."}, {"17": "Děkujeme za veškerou zpětnou vazbu. A to za tu pozitivní ale i negativní, protože jen kvalitní konstruktivní kritika posouvá tuto hru vpřed. Vězte tedy, že všechny vaše připomínky a postřehy postupně přeposíláme tvůrcům hry v Německu. [BR][BR]Zároveň si vás ale dovolujeme požádat, abyste se prosím vyvarovali osobním invektivám vůči jiným hráčům a neodbíhali od tématu, tato diskuze se týká výhradně novinek z Beta serveru. Pakliže chcete diskutovat o něčem jiném, využijte prosím k tomu určeného tématu. Děkujeme!"}, {"2": "priznám se, že já bych taky nějakou zpětnou vazbu uvítal.[BR]Je mi jedno jestli to bude \"No sakra to máš pravdu toho jsme si vůbec nevšimi, hnedka s tím něco uděláme\"[BR]nebo \"Nic takového jsme neměli v umyslu, výnos VB v turnaji je závislí váhradně na slunečních erupcích a vztahy mezi Stalinem, Mao Ce Tungem a Kim Ir Senem a tedy jsetli něco chceš, tak se modli\"[BR]Ale samozřejmě bych s klidnou hlavou přijal i \"Ano, rozhodli jsme se snížit dostupnost VB, proto se jejich vstup do hry snižuje, ve všech aspektech hry a jejich poptávka bude i nadále stoupat.[BR]Mám to raději než tohle mlžení, které mi připomíná poslední vylepšení bojového systému.[BR]Když jsem si vyhrál se starými jednotkami, dokázal jsem věci o kterých se mi ted ani nezdá.[BR]Čekání na nové jednotky, protože jejich schopnost přelétnout překážku je obtížná na implemantaci, které jsme se nikdy nedočkali.[BR]A to nemluvím o upravách které nebyli nikdy komentovány.[BR]Jako v drahokamovém turnaji, kde se objevovala kombinace dvou jednotek obrněných střelců a k tomu čtyři jednotky střelců.[BR]A najednou obrněné střelce nahradili těžkooděnci.[BR]To je kombinace které patří do mramorového turnaje a najednou je v drahokemovém.[BR]Jak se to jen mohlo stát.[BR]Že je tahle kombinace pro hráče méně výhodná v tom jistě nemůže hrát žádnou roli.[BR]Bude to náhoda, nebo ufoni.[BR]Trochu mi to připomíná jedno RPG z mládí kdy moje postava přišla o celou rodinu a GM řekl \"Já za to nemůžu, vyžadoval to příběh\"[BR]Kdo ví kdo drží kvér na spánku lidem u Inna, vlastně jsou to oběti.[BR]Co všechno nás ještě čeká nechci ani domýšlet, ale až to zjistíme asi zase žádná reakce nebude."}, {"66": "@voyager-1 Já ji u žabáka vidím, stále stejně s 5%. Něco se má měnit?"}, {"114": "Máme už nějaké první dojmy z praktického odzkoušení nového systému turnaje?"}, {"66": "Začíná až večer. Ale taky se modlím za hráče na betě, aby vývojářům rozmluvili všechny negativní dopady, které se v testech ukážou."}, {"2": "Mě už začal[BR]První střet je opravdu drtivá přešila, ale 4 provincie už je soupeře půlka, takže konec první strany bude naferovku.[BR]Tedy první stranu možná trochu zlevnili, ale zbytek se secsakramentsky prodraží.[BR]Navíc se armáda soupeře skládá bez původních vztahů mezi jednotkamy, což dělá souboje na ztráty ještě náročnější."}, {"203": "Tak hlavně sem pište první dojmy, co a jak a případně srovnání nahraných provincií před a po. Hodně mě to zajímá, protože turnaje jsou to, co mě u této hry hlavně drží !!!"}, {"91": "Ne že by mě změna příliš zajímala, ale co znamená bez původních vtahů mezi jednotkami?"}, {"2": "Dřív proti tobě stáli dvě jednotky na které jsi mohla poslat jednu a měla jsi převahu.[BR]Například obrnění střelec si snadno poradil s lehkooděnci a střelci.[BR]A k tomu byl přidám třetí druh, který ti to počistil, v tomto případě nějaký mág.[BR]Tenhle vzorec platil provinciích i turnaji.[BR]A byl při změně bojového systému prezentován jako systém nastavený pro lepší orientaci hráče v bojovém systému.[BR]Jenže pro věž to neplatilo nikdy a ted ti je to k ničemu i v turnaji."}, {"91": "Počkat, takže sestava jednotek tam není jako doposud jestli to dobře chápu, doteď se na turnaj dalo připravit, což mě též bavilo. No věž je dost chaotická, radši jí nebojuji, když nepadne něco předvídatelného, protože tam mám často velké ztráty, a pak nemám jednotky na turnaj. Takže u mě se věž krásně doplňuje s turnajem. Budu doufat, že změna neprojde, nebavilo by mě to."}, {"11": "jednotky by měly být spíš náhodně, nebo různě, určitě ne známy dopředu jak nyní."}]