[{"72": "To záleží na hodnotě toho bonusu. Spíš doufám, že bude event podobný jako ten poslední, tedy na výběr řada smysluplných odměn.. u novinek bývá někdy potíž, že se vše smrskne právě jen na ně."}, {"2": "záleží co z nich kápne"}, {"41": "Co jsem zatím pochopil z popisků na betě na foru, tak by měli v celém eventu být 4 budovy, které vám vytvoří ten \"set\". Jedna z nich je 2. Hlavní odměna a o zbylých 3 se zatím neví, jelikož je dostupná pouze 1. denní odměna. To tedy znamená, že celý \"set\" můžete vytvořit pouze jednou, protože 2. Hlavní odměna je jen jedna. Ale teoreticky by šlo vytvořit více nekompletních setů, sestavených jen ze zbylých 3 budov z denních odměn. Ale u těch byste získali max 2 bonusy.[BR][BR]Bonus má celkem 3 úrovně a vy aktivujete novou úroveň po přidání nové budovy do setu. Tudíž pokud vlastníte 2 budovy, aktivujete první bonus. Pokud vlastníte 3 budovy, tak aktivujete 2 bonusy a pokud vlastníte všechny 4 budovy tak aktivujete všechny 3 bonusy. A pokud vlastníte jen jednu, tak nemáte žádný bonus.[BR]Podle jednoho hráče na betě, by měli bonusy v kapitole lesních elfů být následující: 22k zásob --- 22k mincí --- 1 VB[BR]Tudíž nic moc, ale zase to musíme brát, že to je navíc k již přidávající kultuře. Je to zas další věc \"zadarmo\" pro nás, tudíž jsem rád za něco nového, a osobně se pokusím získat všechny 4 budovy i s tak malým bonusem. Sami o sobě ty eventové budovy vždy přidávají dostatek kultury a dalších věcí, takže se i tak budou hodit.[BR][BR]Všechny informace jsou převzaty z bety, kde se řešili již před několika hodinami. Tudíž není jisté, že to tak opravdu je, a na potvrzené informace si budem muset ještě chvíli počkat."}, {"72": "Zajímalo by mě, zda je nutné, aby měli všechny budovy stejný level. Když získám dejme tomu dvě budovy při trpaslících a dvě při vílách..."}, {"43": "To zase bude.Když koukám na ty hodnoty,co budovy vyrábějí to je velká slabota.Kvůli pár desítkám tisíc mincí a za 24 hodin si plácat místo,no nevim a ostatní na tom asi budou stejně.A to budou za celý event jen tyto čtyři budovy a žádné v denních odměnách nebudou?[BR]Jestli to tak bude tak z eventu na který jsem se těšil,se stane pěkná ptákovina."}, {"31": "@papap nie, bude to ako vždy, teda 3 hlavné a niekoľko denných odmien. Z týchto všetkých práve tie 4 tvoria ten set."}, {"43": "No to jsem na to teda zvědav.Každopádně tyto lego budovy,doufám,že nezískám..."}, {"68": "vidím to podobně, na to, kolik místa to zabírá je to hodně velký výsměch a i ta první odměna se mi zdá celkem dosti slabá na to, že je to velký event ://"}, {"72": "Ta první se mi tedy tak špatná nezdá, budova 2x2 s pro mě dost kulturou, těch bych bral klidně víc. Nicméně, jak jsem psal, to bývá daň novinek, že na jejich základě jdou zpravidla praktické atributy stranou, zamázne to skutečnost, že máš něco \"novýho\" "}, {"43": "Ono potom,jak je hráč dál,tak tyto malé budovy spíše překážejí.Sice je to zprvu dobré nějakou dobrou kulturu na 2x2 ale pak je potřeba mnohem více kultury a hlavně v kombinací s manou.Takže každý to bere podle svého..."}, {"72": "Jasně, končím teprve trpaslíky a určitě se to bude vyvíjet. Ale i tak si myslím, e to špatní není, přitom jak se všechny budovy zvětšují je s ohledem na dispozice mapy menší budova dobrá, navíc tady je to dobré i s ohledem na kulturu na políčko. Ale jistě to je subjektivní."}, {"28": "V tomto odkazu již můžete najít informace k hlavním odměnám, odměnám do toho setu a unikátním denním odměnám, které nás letos v zimním eventu čekají "}, {"68": "Těším se na to, jen nechápu ty úkoly s vylepšováním budov :/"}, {"72": "máš vylepšit zadaný počet budov, libovolných, na zadanou úroveň, nebo vyšší..."}, {"65": "frozen father tree! 4. den, je tam! to abych si naplánoval aspoň prvních 40-50 úkolů do té doby  [BR][BR]teď jen doufám, že ty setové budovy budou nějak rozumně třeba až v druhé půlce eventu. fakt bych se nerad rozhodoval mezi otcem pralesa a setovoým barákem "}, {"63": "Budou zase nějaké dny, kdy bude možné získat dvojnásobek klíčů, jako v minulém eventu??"}, {"72": "Safra, strom dobrej. Zato v tom setu pořád hledám nějaký smysl.. a kromě sběratelskýho nevidím, poučte mě "}, {"74": "Úkoly zatím dobrý, jen doufám že zase nebude úkol s vyzkoumáním technologie neboť výzkum pod 125K Many není a nasbírat to jde s bídou.... nákup VB za goldy je proti tomu dost velká sranda....."}, {"74": "No tak teď jsem prošel 108 úkolů.... celkem na nás čeká získat 193 relikvií a 2x zkoumat technologie, nebo vylepšit barák na lvl 20+    to zase bude opruz"}, {"65": "jj, na ty relikvie to bude dobrá sada... buď to člověku vyjde na turnaj, nebo prostě čekat do nejbližšího úterka. jinak co to pozadí dneska? [BR][BR]docela jsem se lekl, fakt doufám, že akce bude fakt až od pondělí."}]