[{"16": "@Pauleo Je to teď náhodně. Tzn. příprava je pro všechny turnaje stejná - trénuj vše, co bys mohl v turnaji použít, bez ohledu na to, jaký turnaj to je."}, {"91": "Dobře, koukám že ten vývoj dle vzoru loterie prostupuje celou hrou, nejen v událostech, zlatý věk Elvenaru je už asi nenávratně pryč."}, {"2": "Hlavně to asi bude záležitost pro stejné jednotky jako věž, takže ropuchy, holky na kytce a lovec"}, {"20": "@Lovec Krys -takže ty řečičky ve videu, že nic nemůžeme v turnaji udělat špatně a jak nový způsob turnaje bude pomáhat k lehčímu pochopení systému boje novým hráčům, co to jako je? [smilie--sprite5]"}, {"114": "Základní jednotky jsou na ztráty poměrně co do druhu vyvážené, u jednotek ze cvičiště a z tábora ještě nevím, na 1* jsem je potřebovala až na vyšších provinciích jen ojediněle, jedu jen na automat a vojáků jsem si hlavně základních vycvičila od každého přibližně stejně, naštěstí na celkem dost provincií lze použít jen jeden druh vojáka proti všem, takže je mixovat moc nemusím, uhrát celou provincii na jeden klik, na to si budu muset ještě zvyknout, taky asi na větší opatrnost při výběru vojáků, protože jedno ukliknutí je teď mnohem dražší, než bývalo to jedno ze čtyř. Výkup jsem jen sledovala a nikdy jsem ho nijak nejela, tak nemohu vůbec posoudit jak to běží v něm. Trochu jsem si i pohrála a dospěla jsem k závěru, že divy sice mohou turnaj na vojáky podražit (hlavně tou investicí do nich), ale stejně tak zároveň ty vojáky i posílit - moji vojáci porazí mnohem silnějšího protivníka, a dojdou dál na počet odehraných provincií s vojenskými divy než bez nich - tedy že budu i nadále v sypání do divů pokračovat, i když možná mnohem pomaleji, to ale ukážou až další kola.[BR][BR]Moje příprava na life bude určitě vycvičit co nejvíce druhů vojáků tak nějak vyváženě, ve cvičišti a v táboře asi moc nestíhám, spoléhám se na produkční budovy, že mi něco z nich nastřádají. Určitě nakrmím ohniváka a dám zbrojíře a od každé stromkové jednu mágy a luky."}, {"16": "@Ludi Já z toho videa viděl jen pár vteřin. Pak jsem ho vypnul, protože to na mne působilo tak, že se mi vysmívají."}, {"114": "@Lovec Krys , když jsi z toho videa viděl jen začátek, z jakého tedy jiného oficiálního zdroje jsi všechna ta fakta, pro tu předešlou kritiku, načerpal?"}, {"66": "@luterina Na beta serveru k tomu měli obsáhlý článek, ve kterém psali vesměs to samé, co potom ukázali ve videu.[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/behind-the-scenes-upcoming-tournament-changes.15181/\t\t[BR]Asi to chtěli prezentovat v psané i vizuální formě."}, {"16": "@luterina Z informací, které oficiálně napsali na betě a z informací hráčů, kteří to video viděli celé.[BR]@voyager-1 Možná, že kdybych nejprve kouknul na video a pak teprve četl informace, a ne naopak, tak by mi to jako výsměch nepřišlo a zkouknul bych jej celé."}, {"20": "Kdo alespoň někdy zavítá na forum bety, tak ví, že Lovec Krys je tam velmi aktivní. Lovec opravdu ví, co se ve hře děje, aniž by koukal na informační video. Ne ve všem s ním vždy souhlasím, ale přehled má.[BR]Já nechodím na forum bety pravidelně, ale sem tam nakouknu. Na betě mám jenom mini město, abych taky občas koukla, jak věci vypadají, ale tím že je malé, tak mi to tolik informací neposkytuje. Prostě to už časově není možné, abych ještě hrála na betě."}, {"2": "Já nemám problé přijmout změny, hra se musí vyvíjet.[BR]Jsem tu už fakt dlouho a mám ted možnosti o kterých se mi na začátku ani nesnilo.[BR]A je mi jasné, že s tím občas přijdou i nepopulární kroky.[BR]Věci jako omezení klikání vítám. Sakra, kdo kdy hrál turnaj na 50+ provincií ví o čem mluvím.[BR]Jednou jsme si v cechu všimli hráče, který podle mě v úterý večer odehrál tři kola turnaje.[BR]Poctivé 4 hodiny klikání.[BR]V kuse.[BR]Ruku na srdce, kdo z vás by to dal, fakt zapálený hráč, smekám.[BR]Ale jako člen cechu, co dal 10 beden každý týden je mi zlevnění na začátku docela lhostejné.[BR]Mnohem víc mě trápí že to vypadá, že odehrání všech provincií zvládnu, když na to budu pár měcíců šetřit.[BR]Když město potřebuje VBčka, tak se smířím s pomalým postupem a nebo zaberu.[BR]Ted mi to přijde že zabrání nepomůže.[BR]Pořád se tu řeší podpůrná města, ale tohle mi připadá přesně jako krok pro jasné určení, pořid si pushing město nebo máš smůlu..[BR]Protože z turnaje stejný zisk VBček nedostanu ani kdybych se rozkrájel.[BR]Jediný náznak ceny nových truhel je 10k bodu za jednu.[BR]Nevím, jestli to tak opravdu bude, Inno se neobtěžovalo mě informovat.[BR]To znemaná, že by společenství potřebovalo 130k bodu, to je 5200 bodů na osobu.[BR]Což je odehrát na plno 20 provincií a to už nemluvím o tom, že člověk by měl spát 8 hodine denně a tak nejde odehrát 6 kol pokud nebudeme brát inno jako někoho kdo nás nabádá porušovat pravidla zdravého životního stylu.[BR]Ale co, respekt že si nahrajou na někoho komu na mě záleží.[BR]Ale bez ohledu na to co můžu vytřískat z nových truhel, tak z odehrání celého turnaje můžu mít 11 VBček z každé povincie.[BR]Takže jejich 90 VBček v nových truhlách bych zvládnul vyklikat z devíti provincií.[BR]Ale přitom s touhle upravou přijdou řekněme o dvacet provincií které jsem v turnaji odehrát zvládnul a už mám smůlu.[BR]A to nemluvím o tom, že k získání kolektivních truhel musím ukecat celý klan a odměna je jen pro divy místo aktuálně univerzálního VBčka.[BR]Já body v žebříčku nijak neřeším a je mi fakt jedno, kolik kdo má bodů a na kolikátém místě jsem.[BR]Tak mi dejte do hry políčko, které když zakliknu, tak se mi město nebude počítat do žebčíčku, ale z turnaje mi bude padat dvojnásobek VBček.[BR]Slibuju že budu klikat jako magor."}, {"88": "V rámci posledního vývoje mne napadá: co se už vykašlat na nějakou \"zpětnou vazbu\", která je naprosto k ničemu a nefunguje a hlasovat nohama? (A může tu stokrát někdo psát, že \"předáváme dál\"...)[BR]Ať si účetní z MTG hrajou tuhle hru sami..."}, {"114": "@Vicky1177 to snad ne, pokud by neexistovala a nefungovala zpětná vazba, potom by celá tato diskuze Změny ve hře a všechno co se v těch vláknech píše byla jedna velká lež, což není, neboť si to, že je to pravda, může každý ověřit ve hře, a většina těch změn právě vzešla díky té zpětné vazbě, stejně tak by neexistovaly ve hře všechny tyto Nápady a návrhy (nyní celkem 44 zavedeno, a to je výčet jen z českého serveru, nemluvě o těch desítkách z dalších dvou desítek zemí).[BR][BR]Co se týká tématu nového systému turnaje (na základní vojáky z kasáren a na automat), ..vojáci mi někdy přišli tak namixovaní, že se mi kouřilo z hlavy, než jsem vymyslela tu nejlepší kombinaci, ale určitý styl těch kombinací se zdá být s nakoukaným větším počtem odehraných střetů vypozorovatelný, tedy setkávala jsem se ze začátku i s kombinacemi, na kterých jsem přišla o všechny vojáky (ta ztráta mě co do množství dost překvapila, určitě bych byla pro, jí snížit) což mě natolik vyděsilo, že jsem ten střet musela opravdu pečlivě znova promyslet, abych ho na tu výhru dala, avšak s přibývajícím počtem střetů, už jsem se na tu kombinaci tak nachytat - když se znovu objevila - nenechala a zvládala jsem jí čím dál tím více na první dobrou. Na PC mi to přišlo s vojáky příliš zmatečné, tak jsem přešla na aplikaci a řídila se podle pravidla barviček, barva proti barvě, voják proti vojáku s bonusem na +2 napravo, což mi však přestalo fungovat, když jsem se dostala do těch nejvzdálenějších provincií, ale na prvních tak dvacet pět provincií to fungovalo bez jediné prohry zcela bezpečně. Dívala jsem se i na cenu výkupu a tu bych tedy taky byla pro snížení, tak velké množství kladívek, mincí, many a orků za střet ve vzdálenějších provinciích u mě absolutně nepřipadá v úvahu, za 5 takových a jsem se vším na nule. Můj závěr je takový, že k vyrovnání menšího počtu otevřených provincií bude zapotřebí nahrát více hvězd, a že zvláště teď, co se týká bodů do žebříčku, půjde mnohem více i o tu hvězdu šestou."}, {"91": "GorGlin >> Jo i to mě vždy bavilo, kdo na hru neměl čas, tak si klikáním dokázal nahrát dostatek i přes to, a desátá bedna společně nebyla problém, a kdo chtěl hře věnovat víc, nahrál si i užitečná VB. Na tom nevidím nic špatnho, že hráč, který jejich hře věnuje víc času, si odnese body např. do divů. To mě bavilo, a i tak to nešlo každý turnaj.[BR][BR]Též mě bavilo, že jsem se mohl na konkrétní turnaj připravit, netrénuji všechny jednoky, proto ani nemám na to vždy bojovat věž, a to s těmi hvězdami je co, na šestou hvězdu jsem se z časových hledisek ještě nikdy nedostal. Dokonce se mi párkrát stalo, že jsem musel z časových hledisek vynechat i jedno kolo, ale dohnal jsem to nějakým způsobem na provinciích, nebyl problém.[BR][BR]Pro změnu stačilo např. jen zahýbat bednami a připravit nový systém beden, ale ne překopávat vše do systému další loterie bez odměn a možností. U věže beru, že to bylo něco nového a rovnou to tak vzniklo, ale překopávat starý zaběhlý turnaj dle vzoru věž se mi nelíbí. I jsem to dal ve společenství na vědomí, že jestli tohle projde, končím, nebude mě to bavit."}, {"20": "Jak pročítám reakce na fóru bety, názory na turnaj jsou dost rozporuplné. Až turnaj přijde sem, budu ze začátku opatrná, než si na nový systém boje zvyknu. Střety v turnaji vyhrávám v pohodě, pomocné budovy používám jen výjimečně. Po této stránce to snad zvládnu.[BR][BR]Nyní jde tedy především o trénování všech druhů bojovníků. Pokud budou v turnaji protivníci rozloženi řekněme rovnoměrně, tak vlastně není problém trénovat všechno, protože místo, aby ztráty byly výraznější u jedné či dvou druhů jednotek, tak teď by měly být ztráty úměrně rozložené na všechny jednotky. To se prostě uvidí. Každopádně \"random\" soupeř je velký problém pro méně zkušené hráče.[BR][BR]Jeden hráč z mého společenství psal, že otevřel na betě 30 provincií úplně v pohodě. Ovšem jak to bude do 40. provincie a dál, toť otázka. Navíc budou velké rozdíly mezi hráči, protože pokud nyní bude vzorec velikosti oddílu podobný tomu ve Věži, tak pro některé hráče, ač jsou stejně daleko ve výzkumu, to bude daleko těžší, než pro jiné.[BR][BR]Změna, která dává podobné prvky jako ve Věži i do turnaje, není dobrá. Turnaj byl prostě jiný a to mělo zůstat. Myslím tím specifiku jednotlivých turnajů.[BR][BR]Jak píše Pauleo, mám obavu, že díky novému systému turnaje hodně hráčů skončí. A to mě vadí podstatně víc než to, že nezískám ze hry případně tolik VB.[BR][BR]Nové bedny v turnaji mě nezajímají. Mám ve společenství fajn lidi, na 10 beden hrajeme naprosto v pohodě, většinou máme hotovo v pátek dopoledne. Ale nebudu nikoho nutit, aby seděl u hry a drtil turnaj, jen kvůli dalším bednám. Každý má svůj život a hra je jenom hra."}, {"141": "Jéjdamane, když to tak vše přelouskávám, jsem nadmíru šťasten, že celé tři roky v Elve nic nepočítám, nedbám žádných rad a hezky se vyvíjím téměř samovolně. Určitě blbě, to je jasné, ale jupíííí.[BR][BR]A co tak kdyby někdo radil  \"zboř tábor, naprosto k ničemu\". A za nějakou dobu -  \"tábor je bezpodmínečně nutný\" [smilie--sprite8]DD Nezapomenu, jak se ozval hráč, který dle původní rady boural. Ano, tristní.  Omlouvám se, to víte, sprostej dědek. Si nepamatuju dnešní oběd, ale ptákoviny - to mi jde, to joo."}, {"20": "@tupecpolni - Tábor je skvělý, ale trvá to pár kapitol, než se kvalita jeho bojovníků projeví. Proto se zdá dlouho zbytečný. Já to taky tak měla. Jenže, jak už jsou bojovníci alespoň na **, natož když jsou na ***, jedná se o velký kvalitativní skok."}, {"3": "Je otázka, kdy se do něj pustit. Teď jsem načal konstrukty a můj odpor začíná polevovat. Nicméně na něj nemám lidi, ani navýšení rychlosti výroby, což jsou zatím dva docela silné argumenty proti"}, {"11": "zkouším teleport, nešly dřív cvičiště a tábor uklidit ?"}, {"99": "Nešly. Cokoliv, čeho můžeš postavit jen omezený počet, teleportovat nejde."}]