[{"114": "tak jsem si zabrouzdala po cizojazyčných serverech a slabší spolek na truhly jim uhrál v novém systému truhel daleko víc, asi tedy slabší hráči, za což bych byla v našem spolku ráda, nahrají víc, a i když ti silnější nahrají třeba méně, mohly by se ty bodové rozdíly slabší vs. silnější zmenšit, za což bych taky byla ráda, kolikrát se potýkám s nespokojeností lepších hráčů, že ti slabší toho moc nenahrají a tolik se nenadřou jako oni, ale není to o tom, že by nechtěli, oni taky dřou, jen jim to tak dobře nejde a v novém systému to vypadá, že by jim to lépe jít mohlo, tedy co už neuhrají ti lepší, mohli by o to víc nabrat ti slabší, za mě tedy by to bylo super, pokud by tedy tak celkové skóre zůstalo stejné, né-li ještě lepší [BR][BR]jinak asi nejvíc mě zaujalo srovnání boje v turnaji vs. Věž  a srovnání hráče, co hrál na 40 - 50 provincií na 2*, kde se zmiňuje o tom, že teď má v plánu nahrát 6* na prvních 10 provinciích a na 2* v provinciích 11-20, což je styl, který jsem uplatňovala v počátcích mých bojů a tedy bych zvládnout měla, jen nevím jak na tom budu s časem, takže zřejmě se do hry u mě vrátí i poslední dobou tolik nevyužívaná Polárka, protože nařizovat si budíka na 4 ráno opravdu nehodlám..., dále asi pro tu nejlepší představu, jak to v novém turnaji teď vypadá, jsem našla pěkný přehled vojska a výkupu na 1* na 30 provincií, kap. 15, divy 156, prémiových rozšíření 8: [BR][BR]Co mi není jasné, když vyzkoumané/nevyzkoumané vylepšení velikosti oddílu, nemají v novém systému turnaje žádný vliv, jaký by to tedy a na co přesně mělo vliv, pokud bych, ty co ještě vyzkoumané nemám, všechny dovyzkoumala?"}, {"99": "Vylepšení velikosti oddílu ti usnadní boje na mapě a produkce vojska z divů se zvýší "}, {"114": "Děkuji, ale vyplatí se to nebo nevyplatí, když se navýší náklady na rekrut a na mapě nebojuji, ale vyjednávám? Tedy, je potom to navýšení počtu vycvičených vojáků nějak zásadní v boji a v čem by to mělo být konkrétně výhodné?"}, {"99": "Navýší náklady? Teď přesně nevím, co tím myslíš... Větší oddíl už by teď neměl mít žádný negativní dopad. A pokud se ti po vylepšení velikosti oddílu změní provincie na mapě např. na lehké, tak můžeš ušetřit suroviny za výkup a s klidem to vybojovat  A jak už jsem zmínila, např. Trpasličí val produkuje jednotky v závislosti na velikosti oddílu, takže s větším oddílem jich bude produkovat víc "}, {"114": "Pokud bych v jednom slotu vycvičila víc vojáků, asi by byly i větší náklady na kladívka? Jinak tedy mít více vybraných vojáků z divů, by se mi líbilo.  ..pokud tedy není nic, co by ve zvětšení velikosti oddílu nějak něčemu vadilo..."}, {"88": "Po dosažení už nevím jakého vylepšení velikosti oddílu všechny další provincie už jen \"velmi těžké\". Poslední mám \"49\", \"50\" je sice vyzkoumané, ale neaktivované a moc se do toho ani nehrnu..."}, {"99": "Tak jasně, když v jednom slotu vycvičíš víc vojáků, tak tě ten slot bude stát víc, ale v přepočtu na vojáčka je to pořád stejné. Nicméně výcvik myslím není vázán na velikost oddílu (pokud jsem na něco nezapomněla  ), takže ten slot budeš mít pořád stejně velký.[BR][BR]Co tě bude stát víc je jeden oddíl, protože se do něj vejde více vojáků, ale počet oddílů je důležitý pouze pro boje na mapě (turnaj i Věž budou mít své vlastní výpočty) a tam ti větší oddíl pomůže, protože velikost oddílu protivníka zůstává stejná. Stejné množství jednotek tě bude stát pořád stejně, a to je podstatné pro Věž a nový turnaj "}, {"205": "Pročetl jsem si anglické forum ohledně nového systému turnaje. Je tam hodně negativních reakcí, dalo by se říci, že většina, ale asi nejzásadnější je ta věc, že výkup je velmi drahý a jednotky jsou tak namixované, že jsou obrovské ztráty. Samozřejmě chápu, že je to dáno tím, že INNO jednoduše sečetlo požadavky 4 bojů do jednoho a tak jim vyšly hrozný čísla. Nevím jak ostatní, ale kolikrát ze 4 střetů jedu 2-3 automat(eventl. manuál) a 1-2 vykoupím, pokud cítím, že nasazené jednotky by nadělali velkou neplechu. Z toho plyne, že rozhodně se nedostanu na ty masivní ztráty v absolutních číslech a nemám tak drastický výkup tak, jak je prezentováno na betě.[BR]Když jsem nad tím zadumal, tak mě napadlo toto:[BR]Při volbě mezi bojem nebo surovinami, by byl slider, kterým bych řekl, do jaké výše to odzásobuji, tím se mi sníží velikost oddílu nepřátelského vojska pro boj. Myslím, že by to byla vhodná kombinace, aby se zachovalo něco z principu 4-bojového turnaje.[BR]A dále bych ocenil, aby systém nasazování vojska zůstal stejný jako nyní. To znamená, že se člověk může připravit, co ho čeká a ne že to bude hrát dle random situace.[BR]Jedna drobnost. Mohl by se změnit systém stromečků, a to že stromeček pro střelce bude útok pro všechny, stromeček pro mágy by nebyl, ale byl by na obranu pro všechny a stromeček na životy by zůstal.[BR][BR]Tolik můj příspěvek k novému systému, který jsem tedy ještě neměl šanci osahat, ale informace jsem čerpal z ohlasů a komentářů na beta foru."}, {"31": "Do prehľadu nadchádzajúcej udalosti som pridal zoznam úloh. Nie sú v ňom avšak zohľadnené chystané turnajové zmeny (ktorými keďže dôjde k redukcii stretov, možno dôjde aj k redukcii ich požiadaviek v úlohách), keďže zatiaľ nie je jasné, či stihnú vôbec pred / počas udalosti prísť (treba dúfať, že sa na bete venuje dostatok času ich testovaniu (i keď sa mi zdá, že bolo písané, že nemajú v pláne sa s tým uponáhľať))."}, {"16": "@iDavis K redukci došlo, tuším, že včera jsem plnil úkol na střet a chtělo to stejný počet v turnaji jako v provincii. Tzn. pokud bude event se starými turnaji (vzhledem k charakteru změny radši budu déle klikat než bourat divy) zůstane poměr 1:4, s novými by byl 1:1."}, {"203": "iDavis - díky za seznam - to by šlo - ty úkolyjsou O.K.[BR]luterina - díky za obrázky z turnaje - to by tedy nešlo - nikdy nebudu mít tolik vojáků, abych mohl bojovat ve vzdálenějších provinciích, stejně jako jich nemám dost na boje ve věži. Tzn., že udělám tak 10 provincií na 6 kol (2700 bodů), tj. asi polovinu toho, co jsem schopen uhrát dnes. Díky INNO, nechci !!!"}, {"202": "Mě to s tím posunem na mapě nedochází. Třeba jak budu hrát, když se některý den o denní cenu chci pokusit vícekrát a jindy vůbec."}, {"114": "z těch tří truhel si vybereš kterou chceš a místo aby se ti plnil ukazatel nahoře, tak se do cíle posouvá panáček po mapě a ukazatel je dole "}, {"31": "@Jirinazel namiesto zbierania 20tich kusov eventovej meny pre dosiahnutie ďalšej hlavnej ceny, tak ako sme na to boli zvyknutí z predošlých udalostí, sa teraz posúvame po mape - každá zastávka je v každom momente od postavičky v nejakej vzdialenosti. Čím väčšia vzdialenosť vybranej zastávky, tým o väčší kus na mape sa posunieme (v predošlom systéme ekvivalentné zvoleniu väčšej truhly). Hlavnú cenu dostaneme po tom, čo dosiahneme koniec mapy (a tak sa to opakuje dokola pre získavanie ďalších hlavných cien)."}, {"15": "Tak to jsem zvědavá , jak dopadnu . Mapy nikdy nebyly moje silná stránka . Ale uvidíme (jak řekl ten slepej) .   "}, {"91": "Událost přijde před koncem hry, teda změnami v turnajích, a nebo až potom?"}, {"202": "Děkuji za info, snad už to chápu, je to jen grafická úprava, nikoli věcná. Hlavně, že to půjde hrát jako jindy."}, {"31": "@Pauleo keďže nie je známe kedy prídu turnajové zmeny, ťažko povedať."}, {"20": "Co se týče turnaje, viděla jsem na betě malinko jiné srovnání Věže a turnaje, než uvedla luterina, ale to je určitě dáno podmínkami jednotlivých hráčů. Stejně jsou to zatím předběžné informace.[BR]Pokud bude velikost oddílu srovnatelná s Věží, dá se to asi uhrát, ve Věži jsou na střetech nejhorší ty dvou a až tříkolové, což v turnaji není. Tak uvidíme.[BR][BR]Přesto by bylo dobré, aby růst velikosti oddílu v bitvách ve Věži i turnaji byla ještě přehodnocena.[BR][BR]Včera se objevila zpráva (od Marindor), že do příštího turnaje na betě se vrátí určité charakteristiky jednotlivých turnajů, ovšem z vyjádření není jasné, do jaké míry. Přímo je napsáno, že je to proto, aby dočasné budovy na podporu bojovníků mohly být použity přesněji.[BR]Jsem moc ráda, tohle je krok správným směrem. Přeci jen úplně \"random\" protivníci jsou na přípravu výstřel do tmy."}, {"2": "Já bych trochu systému do volby jednotek také uvítal.[BR]Asi to je o zvyku, protože těch kombinací co budeme dostávat není zase tolik, ale jedno kolo turnaje je přecijen dost klikání a řešit pokaždé co že mi to tam vlastně přišlo a co nasadit je zdržující.[BR][BR]Já našel na betaforu tabulku od Danyho, kde je sepsaný nárust přesili soupeře.[BR]Je to jen jeden z faktorů, není tam jak rostre síla jednotek, ani jak jsou velké s ohledem na velikost oddílu.[BR][BR]Co jsem ale nikde nenašel je, kolik budou stát ty jejich nové bedny.[BR]Víte to někdo?"}]