[{"16": "Bedny 11-19: Cena se pohybuje od 10000 do 18000 (roste po 1000) za každou bednu.[BR]V každé bedně je ta samá odměna: 1 královská rekonstrukce + Požehnání 10VB."}, {"19": "No, neber to  ."}, {"2": "Takže 6640 bodů na hlavu, no, nejsou to troškaři.[BR]To znamená 25 provincií na 6 kol.[BR]Pěkný"}, {"20": "Když bylo poprvé oznámeno, že v turnaji budou další bedny, čekala jsem, že v každé další bude přinejmenším odměna jako v 10. [BR]Co dodat? [smilie--sprite8]"}, {"3": "tak, je to lepší, než nic. Asi není cílem, aby se dávalo 19. SPíš jen, aby ty body navíc úplně nepropadly. Mě to stačí, i když druhý plánek by byl bezva"}, {"2": "Souhlasil bych kdyby to bylo jen přidání dalších beden.[BR]Ale protože už v prvním kole stojíš v nějaké 32 provincii proti dvojnásobné přesile, tak si nejsme jistý jeslti jsem nepřišel o víc než jsem získal."}, {"3": "taky si asi pohorším, ale uvidíme až v praxi"}, {"91": "Já na praxi nevěřím, že budu moci nahrát stejně jako jsem mohl nahrát teď, ani na to, že když nebudu mít všechny jednotky, že nic neuhraju, pokud to nevrátí."}, {"66": "Tak už je to oficiální, rasové zboží se zruší u výzkumů velikosti oddílu. Chápu to tak, že u všech.[BR]+To, co řekla @Ludi, chtějí vrátit převahu určitých typů jednotek do určitých turnajů.[BR][BR]\t\t\tBefore going into the weekend, please let me already share with you 2 changes that we strive to implement before the next tournament will start next week:[BR][BR]We will remove Guest Race Resources from the Squad Size Upgrade techs, so players who have skipped those can unlock them without having to rebuild settlements.We will implement a way to make certain unit types appear more often in certain tournaments, to bring back some more flavor, enable Fellowships to plan better again and make sure the expiring battle buildings can be used more strategically.Klikněte zde pro zvětšení..."}, {"114": "A mě to baví teď to na betě klikání v turnaji, neklikám pořád dokola jeden druh vojáka až z toho usínám a omylem si smažu budovu a nejsem u toho věky, ale je to mnohem kratší a příjemně mi to zaměstnává mozek, ale přemýšlení prý někoho bolí, tak i pochopím, že mu stačí jen bezmyšlenkovitě pořád to samé klikat a klikat a klikat [smilie--sprite8]"}, {"66": "Oni hlavně potřebovali dát smysl stromkům (Osvícená střelnice, Velký magický násobitel, Jedinečné vylepšení jednotek).[BR]S random výskytem nepřátel nemělo cenu je stavět, nebyly by tak efektivně využité. Byly nějaké návrhy na změnu jejich efektů, ale vyřešili to takto jednodušeji."}, {"88": "@Prealiena: to je tedy opravdu hlavní věc k řešení... [smilie--sprite11] [smilie--sprite11]"}, {"11": "tak to je důležitý, kromě vylepšení jednotek, tam je to jedno."}, {"20": "@Prealiena - čerpala jsem evidentně ze stejného zdroje, i když jsem se zmínila jen o jednom bodu.[BR]Obě věci - tedy možnost zpětně si ve výzkumu udělat nepovinné rozšíření oddílu, i to, že turnaje budou mít zpět určitou specifiku, jsou zatím pro betu a uvidíme jak se vše dál bude rozvíjet.[BR][BR]Není také úplně jasné, co to znamená, že turnaje budou mít zpět určitou specifiku, protože si nemyslím, že to bude naprostý návrat k předešlému stavu. Ale je dobré vědět, které jednotky budou v turnaji převažovat a podle toho se připravit. To je celé.[BR]Není to o tom, že se člověku \"nechce přemýšlet\". Je to jen o cílené přípravě. Mezi námi, kdo je trochu zkušenější, tak v turnaji většinu kombinací už řeší celkem automaticky.[BR]Na \"zaměstnávání mozku\" mám například svou práci a jiné věci, tady jsem ve hře a relaxuji. Vzpomínám na jednu poznámku, kterou tu kdysi napsal ElfNostradamus : \"Šachy bych z toho nedělal\" ... [smilie--sprite2]"}, {"114": "Nevím co se na těch vojácích nedá připravit, když místo 500 duchů vycvičím 5 x 100 vojáků, tedy od každého základního druhu 100 a vyjde to s těmi 500 nastejno, jen s tím rozdílem, že nedávám jako robot x krát pořád dokola ten jeden druh v jakémsi stavu nepřítomnosti, ale lehce si u toho zaměstnám i mozek aby zůstal bystrý. Jinak to je právě to, co u strategické hry očekávám, že neusnu u stereotypu, ale zarelaxuji si u pestrých činností, které ta hra nabízí."}, {"11": "postaru jsem např. připravil 100 oddílů žab a věděl, že mi ani nebudou stačit. Když připravím 5 krát 20 různých oddílů, nevím jestli některé vůbec použiju. Stereotyp to je, to Ti nikdo nebere. Poslední turnaj jsem odehrál asi 1500 střetů a převážně pořád dokola nasazoval žáby [smilie--sprite1]"}, {"91": "Já to teda mám jinak, než že bych stavěl jen jeden druh jednotky, sic teba u některých jedna velmi převažuje, proč bych na turnaj trénoval např. orka stratéga, když mi vychází lépe golem (není to jen pět jednotek). To je přesně důvod, proč ve věži moc nebojuji, protože mi tam často chybí jednoky, někdy nemám např. vůbec lehkooděnce, apod."}, {"114": "Co jsem vyrozuměla, tak jenom základní jednotky by mohly stačit (bez podpůrných budov) na 10 - 20 provincií na 6*. Pro zkušenější hráče a pokročilejší města jsou tu ještě vojáci ze cvičiště a z tábora, kteří sníží ztráty vojáků a uhrají i vzdálenější provincie, tedy že by právě i na té strategii a zkušenosti hráče, záležet mělo, jako na faktoru, kolik kdo uhraje, a ne jak je tomu u starého systému co nejvíc provincií, co nejvíc vojáků, pětkrát ťuknu/kliknu a jdu dál až kam to dojde, tedy že už turnaj na 1. místo nezvládne jen tak někdo, kdo opravdu ten turnaj neovládá a své vojáky dobře nezná."}, {"148": "Podle nového turnaje - rozšíření oddílu na žádné boje vliv mít nebude kromě provincií. Ovlivní v kasárnách velikost oddílu a má vliv u některých divů. Má vůbec význam si dělat zpětně nepovinné rozšíření oddílu?"}, {"114": "@Sycorax , viz. v historii má diskuze s @Angedev ."}]