[{"91": "luterina >> 10-20 je málo, každej nehraje na 5-6*. Proto je teba zahrát víc provincií, teď se dá v některých turnajích i přes 60, a hlavně je třeba vědět jaké jednotky trénovat, trénovat všechny nebo spoléhat jen na kasárny je dle mě nesmysl, to teď nedělám. A ono hraní je i o čase, naklikat dnešní turnaj stojí nějaký čas, ale pořád ne jak nahrát ho třeba na manuál, na což mnozí čas nemají. Takže on výsledek není jen o znalosti jednotek, ale času celkově. Já třeba manuál ve věži nehraju, sic by byl daleko lepší jak automat. Kromě toho že rozvětvení turnaje také mělo něco do sebe. Daly se vykoupit jen některé velmi ztrátové střety, a nemělo to takovou prioritu, jako kdyby měly být spojeny."}, {"16": "@Sycorax Nepovinné rozšíření oddílu ovlivňuje 2 věci:[BR]1) Velikost oddílu a tím i obtížnost boje v provinciích (které většina z nás vykupuje)[BR]2) Počet jednotek, které jsou produkovány v divech (+ bonusy nejméně jednoho divu - Trpasličí val, možná i dalších, ale z paměti nevím)[BR]Pokud je některý z těchto bodů pro tebe užitečný, pak to smysl má.[BR][BR]@luterina V novém systému lze nahrát i přes 10K bodů, jak ukázali někteří hráči na betě, jenže to dokázali stylem, kdy 1) bojovali ručně (tzn. trvalo jim to déle než ve starém systému na automat se 4x tolik střety. 2) Spotřebovali při tom výrazně více prostředků než ve starém systému (více jednotek, protože absentují lehké souboje, všechny jsou středně těžké nebo těžké) a bez kombinace fénix + dočasné turnajové budovy  (v dostatečném počtu) to není šance dát, takže neudržitelné pravidelně, ale max. každý druhý-třetí turnaj (pokud stihneš všechny výroby dočasných budov v akademii, a ani pak to není jisté).[BR][BR]Další problém je výpočet nákladů ala Věž, který je prostě exponenciální.[BR]Je prostě pouze otázka času než se počet rozšíření, úrovní divů a vyzkoumaných technologií vzájemně vynásobí do nehratelných čísel.[BR]Je prostě matematicky nemožné, aby lineární funkce (naše produkce - jak jednotek, tak i surovin(i mincí a many!)) udržela chod s funkcí exponenciální (náklady)."}, {"114": "@Pauleo , píšeš o starém systému co je v něm třeba, a 10-20 na 5 - 6* v něm nenahraje každý, to až ve vyšších kapitolách, já píši o novém systému, že těch 10 - 20 na 6* se dá nahrát bez podpůrných budov a rozhodující ve výsledku bude i to, jak dobrý a znalý boje bude samotný hráč, už ne jen kolik má počet otevřených provincií a množství vycvičených vojáků na medvěda (včetně času na úmorné klikání a předimenzované divy), tedy že nový systém, by měl přinést do turnaje, jako další rozhodující faktor, i samotnou dovednost hráče v boji, což ve starém systému nebylo tak patrné a také mnohem větší úsporu času.[BR][BR]@Lovec Krys , nahrát přes 10k bodů, na nový systém, pěkné číslo. Pokud ho dosáhli jen hráči, co umějí bojovat i ručně, potom tomu říkám výzva a ne tomu, kolik jsem schopná si pootvírat provincií, vycvičit vojáků a nasypat do turnajových divů, že by tím odzvonilo (zvláště když úroveň divů už jim teď nahrávat nebude, a ani nahamounění knížek v každém městě ze 150 provincií na 2*) turnajovým pušingářům? To by také nebylo špatné. A že něco takového nahrát bude možné jen jednou za dva turnaje? Podmínky budou mít všichni stejné, tedy o to asi i daleko více půjde o tu strategii. Že by konečně turnaje, začaly být opravdovými turnaji? Tak já se jich nebojím, naopak, konečně se na ně začínám těšit, jen ať se ukáže, kdo je ten pravý bojovník tělem i duší. [BR][BR]Jinak asi málo pláčeme a hořekujeme nad starým a máme příliš mnoho věcných připomínek na nový, že hned přišli s tou úpravou na účinnost stromkových budov "}, {"91": "luterina >> Ona je zkrácena doba mezi koly, že se teď dá nahrát víc kol, když někdo odehrává jen 5 a někdy 4 kola bežně na stávajícím turnaji (tady se nebavím o tom, zda jsou první provincie dalších hvězd jednodušší než jsou teď) (má vliv i na např. na plnění úkolů v událostech, kde přes provincie se plní snáze než čekáním na další kolo, pokud někdo pravidelně neplní svůj limit)? Tak počet provincií byl stejný faktor, jako odemčené jednotky, popř. jejich úroveň, prošel si tím každý, to se zvedlo až s postupem hry (to už rovnou můžeš zrušit výzkum jednotek, a dát je všechny od postavení cvičišť, aby na tom byli všichni stejně). Ono zasoustředit se na hru, a odehrát si manuál (když už je tu řeč o pochopení jednotek), když je dostatek času, není až taková věda, ale kdo to z hráčů, kteří hrají delší dobu (kdy se vše neustále opakuje), dělá, popř. kdo na to má čas (já už od toho upustil, sic vítám, že to (u prohlížeče) jde, nebaví mě to). Podle mě víc bodů opět nahrají hráči, kteří opět obejdou nějaké vytyčené mantinely krajními možnostmi, popř. hráči, jímž bude dle podmínek hra nějakým způsbem ulehčena. Já to opět beru jen jako možnost nahát víc nebo občas vyřešit souboj, kde to AI moc nedává, jinak bych asi hrál jinou hru, pokud mi půjde o to si dokázat co dokážu vypotit v jednom souboji (proto mě stávající zjedndušený způsob vyhovuje (ten má kouzlo ve hře i jako takové, každý turnaj je specifický, nikoliv náhodný jako věž), navíc pro změnu je tu už věž). Já přecpané divy nemám jak někteří pushingeři, mě to naopak na té hře jako jedna z mála věcí momentálně baví, ty body občas získávat, a vylepšovat si je (ve hře jako takové jsem se nikdy nikam nehnal, poslední kapitoly jako takové mě vážně moc nebaví, možná je to tím umělým přetahováním), takže pokud bodů jde při stejném časovém úsilí a stejných prostředcích města získat méně (tak to tady ze zdejších referencí na mě působí (betu nehraji, zkušenosti nemám, jen velké obavy), i to byl můj předpoklad od doby, co se to tu řeší), tak nevím co mě na tom má dle tvých postřehů bavit, umělé protahování, nebo si dokazovat, že nahraju víc bodů na manuál než někdo na automat, stejně je to zase opět o tom kdo natrénuje víc přes dva brtníky, pokryje větší ztráty, popř. využije berliček. Vež taky kdo postaví budovy ubojuje s klidem i s minimem jednotek, a vůbec žádný bojovník hrdina být nemusí (pravý turnaj opravdu nezačíná) (stačí mít štěstí na budovy, nebo si je koupit za briliant přes obnovení receptů v akademii). Ale bez nich je to aspoň pro mě někdy celkem obtížné. A jakákoliv změna je stejně jen otázka dost krátkého času, než spadne do stejného stereotypu, navíc se o nějakou změnu ani nejedná, pokud je systém jen zkopírovaný z věže. Mě by na hře třeba bavilo víc kratšího nového obsahu, takhle to na mě působí spíš jako umělé omezování určité skupiny hráčů (+ osekávání volitelných strategií ve hře (hybridní budovy ve hře přestávají mít význam, volitelný výzkum oddílů také, co přijde příště už v rozehrané hře), a nevím co mě na těch změnách má nějak víc bavit. Zatím jako jeden klad vnímám, že se uvažuje o odstranění survin ras z výzkumu odílů, jinak mě změna neoslovuje, proto se ani momentálně nějak ve hře o nic velkolepého nesnažím, divy vylepšuju jen takové, aby se body z odměn vrátily zpět do společenství a nezůstaly viset u nějakého většího divu, apod.[BR][BR]A už vůbec se nebavím o tom, jak je obtížné hrát nynější klikací turnaje, když mi zlobí levé tlačítko trackballu, a napsat tak dlouhý a neustále opravovaný nevěcný příspěvek, když mi tak hrozně zlobí kláveska, většina znaků zdvojených nebo vynechaných, i backspace. [BR][BR]// Příspěvky sloučeny. Jumala"}, {"20": "Dřív jsem hrála boje ručně, ale upřímně: už mě to nebaví. Ruční boje tu umí spoustu lidí, nic zvláštního nebo těžkého to není. Jenže je to zdlouhavé a taky vlastně pořád stejné. Bavilo mě to tak 2 roky a teď už na ruční boje kašlu. Prostě se snažím jen vybrat kvalitní bojovníky, aby ztráty byly co nejmenší, což se mi celkem daří. V turnaji hraji na 6* běžně, kdo má Skok, tak to není problém stihnout. Prostě chci různé odměny ze hry, nejen VB.[BR]Nemám žádné výhrady k hráčům, kteří hrají turnaj na 2 kola, aby získali velký počet VB. Proč ne, je to jejich strategie hry. Nemám ani nic proti hráčům, kteří celý turnaj kupují. Prostě to dělají jinak než já a je to v pořádku. Dokonce nemám nic proti hráčům, kteří do hry dávají spoustu peněz. Je to jejich rozhodnutí. Mezi námi, být milionář, tak si taky nakoupím hafo dia . A vůbec nemám nic proti hráčům, kteří plní poctivě v turnaji své minimum, protože jsou pro společenství velkým přínosem v jiných věcech, třeba ve spolehlivosti a kamarádství. Takže být kvalitní hráč, je prostě o mnoha věcech."}, {"11": "zkrácena doba mezi koly ? To pak zas ztrácí na hodnotě časový skok."}, {"16": "Doba mezi koly zůstala na 16h, nevím odkud se informace o zkrácení vzala. Polární medvěd i Čas. skok mají tím pádem hodnotu nezměněnou (ani jedno moje beta vesnice nemá, takže mám mezi koly těch 16h)."}, {"31": "V tejto chvíli naplánovaný termín júlovej udalosti nájdete uvedený v prehľade."}, {"175": "Takze o celo zebricku v turnaji si to rozdaji uz jen ti co maji nekolik hnedych medvedu a samozrejme fenix . kdo je nema a nebo zacal dele tak stejne bude bez sance at uz to mrnavejm mestum ulehci jak chcou. kdo ma hnedaka vi jakej je rozdil ve vyrobe jednotek a to nemluvim o lidech co maji tri  ono prohrat v provincii kdyz si za dve hodiny naklikate 500 oddilu a nebo 100 ... hmm "}, {"16": "@Anthalas Ještě o tom bude rozhodovat množství dočasných budov (fénix a medvědi aktuálně sami o sobě nestačí na čelo) a jak velkou penaltu bude mít za extra rozšíření a úrovně divů. A pokud zůstane obtížnost na současné úrovni tak i to, zda je někdo po redukci střetů ochoten strávit více času než dnes ručním soubojem (bez něj půjde obtížnost vyvážit zřejmě jen větším množstvím dočasných budov).[BR][BR]K události: Zatím nic, co by mě zaujalo, takže jsem v klidu zastavěl volné místo po Ambasádách semennými hybridy z předminulého eventu, což by mi konečně mohlo urychlit vylepšování budov (jenom na zbrojnice potřebuju ještě milion semen) a když vás jeden pokus ve věži stojí několik tisíc semen, tak to holt jde pomalu.[BR][BR]ps: Už jsou z výzkumu odstraněny požadavky na suroviny osadníků pro rozšíření oddílů (zatím jsem neporovnával, zda se ostatní požadavky na ně zdražovaly nebo ne."}, {"3": "tak, ono to taky něco stojí, žejo. Já mám medvídky dva a zatím jsem je aktivoval jen asi 3x. Naposled mě to stálo cca 20 kouzel na 100 % nástrojů a asi 750 hodin urychlovačů.[BR]Myslím, že ty změny tu výhodu sice neodstraňují, ale o něco zmenšují."}, {"16": "Srovnání starých a nových cen vylepšení velikostí oddílů (jen těch, které vyžadují osadnické suroviny):[BR][IMG]https://i.ibb.co/Cb03H2J/https-cz-forum-elvenar-com-index-php-attachments-1595251732905-png-4638.png[/IMG]"}, {"91": "Ludi >> Dnes to tak také vnímám.[BR][BR]Lovec Krys >> Ta informace se vzala ode mě jako podnět k tomu, že pokud někdo nahrál doposud běžně do páté hvězdy, a někdy dokonce, když měl např. zabitý jeden den, jedno kolo ještě vynechal, takže skončil u čtvrté hvězdy (nic vyjímečného to není, tahle situace u mě několikrát nastala, každý nestíhá přesně periodu, aby stihl odehrát všechna kola, popř. nevěnuje hře všechen svůj čas, a přesto touží si zahrát a něco získat), tak určitě v nástinu nového turnaje na tom nebude nijak moc dobře, když si to nemůže nahrát na provinciích, a měl by uhrát např. jen těch 20 provincií dle příkladu. Šestou hvězdu jsem odehrál minulý turnaj poprvé, protože mi to tentokrát vyšlo, a našel jsem si na to ten čas, a to mám i skok, sic jen na 6. úrovni (a vyšlo mi to jen taktak). Hráči co ho ještě nemají jsou na tom ještě hůř. Takže brát automaticky, že se dá bez nějaké změny nahradit sílu provincií hvězdami mi nepřijde zcela na místě. Proto jsem se spíš částečně i ptal (otazník tam byl), zda nedošlo k nějaké změně, když to bylo tak nabízeno.[BR][BR]Emhyr >> Ti dva brtníci byly spíš příkladem, že stále půjde zapojit zrychlený výcvik, aby se vytvořily rozdíly mezi hráči, což nový systém moc nemění. Náročnost dvou méďů si dovedu jakžtakž představit, sic mé medvědárium sčítá jen jeden exemplář."}, {"11": "já na Arendyllu u těch výzkumů ještě osadnické suroviny mám"}, {"16": "@voyager-1 To proto, že tato změna byla teprve dneska nasazena na betu."}, {"2": "Jsem na to zvědav.[BR]Ať to počítam jak to počítám, tak třeba rozdíl ve fénixech mi přijde propastný.[BR]Divy ho nedohoníš a podpůrnými budovami jen u mágů a střelců, takže tři turnje.[BR][BR]Objevili jste nějaký systém v jednotkách? Na betě mám jen pár provincii a já žádné omezení náhodnosti nezaznamenal."}, {"114": "Budete zkoumat nepovinná vylepšení oddílu? Proč ano, a proč ne?[BR][BR]@GorGlin , mně to přišlo, že v prvních provinciích je ten systém nabídky protivníků odlišný od těch provincií vzdálenějších. Jinak ty jejich kombinace se podle mě náhodně neopakují a neobměňují, čistě jen na náhodu to nevidím."}, {"2": "Já velikost oddílu zkoumal i předtím.[BR]Bojuji provincie a tak se mi to tam hodí.[BR]Velikost oddílu určuje efekt mnoha divů."}, {"197": "Jediný důvod, proč jsem nezkoumal nepovinná vylepšení oddílu, byl, že to mělo negativní vliv na turnaj, takže si je vyzkoumám, když už to bude mít jen pozitivní efekty."}, {"91": "Tak jinou výhodu to asi nemělo, pokud jí zruší, nevidím jiný důvod proč ta možnost ve výzkmu bude (je řada položek, coby se zkoumat nemusela, a ve výkumu volitelná není)."}]