[{"11": "já se zatím unáhlovat nebudu. V čem jako ted bude výhoda ? Jasně, divy mi vyrobí pár vojáčků víc ale já jich taky budu muset vyrábět víc do oddílu.[BR]Nebo ted budou boje lehčí při větší velikosti?"}, {"16": "@voyager-1 Velikost oddílu protivníků se bude (stejně jako ve Věži) počítat nezávisle na vyzkoumaných velikostech vlastního oddílu.[BR]Co se týče vlastního vojska.. tam si nejsem jist.[BR][BR]Nicméně, pokud na nich bude záviset velikost tvého vojska, větší oddíl pak bude znamenat lepší poměr tvých vojáků oproti nepříteli, ale zároveň větší absolutní ztráty, které můžou být vyrovnány vyšší produkcí na velikosti oddílu závislých divech.[BR][BR]Pokud na nich záviset nebude, jen ti to zvýší produkci divů závislých na velikosti oddílu."}, {"11": "no právě, bud bude nebo nebude, já si počkám až bude nový systém turnajů dotažen do konce. Myslím, že těch pár vojáků co divy vyrobí navíc to nevytrhne, navíc jsou to jen vojska z kasáren."}, {"2": "Můžu potvrdit vliv divů[BR]postavil jsem zlatou propast a velikost oddílu v první provincii mi vyskočil ze 7 na 13"}, {"127": "Chcem sa opytat ci sa diskutuje na bete alebo je aspon snaha o vynatie urovni divov z vypoctu obtiaznosti?[BR]Ja osobne vidim divy ako jedinu vec ktora ma v tejto hre vyznam, mala by dlhodobym hracom prinasat prospech a umoznit im dojst v turnajoch dalej ako novym, este malym hracom.....ale uz dalej nie?[BR]Ja som sa zastavil vo vyskume u elfoch, optimalizoval mesto na vsetky poschodia veze a turnaj na dve hviezdy vsetky mne dostupne provincie. Vsetko som daval do divov....a teraz uz ani nedokoncim tretie poschodie lebo 4 vyjednavania ma stoja cca 70% skladu minci, proste ich nestiham doplnat.[BR]A tento system bude teraz aj v turnaji?[BR]Ak to takto dojde na live servery tak koncim....preco hrat nieco co nas za postup bude trestat stale viac a viac?[BR]Spytajte sa prosim Marindora ci by zostal v praci kde dostane nastupny plat 1000 EUR ale za kazdy rok co odrobi a ziska skusenosti mu znizia plat - to je presne to co robia nam"}, {"2": "Tohle je aktuální trent.[BR]Asi není k diskusi jak moc zvedne výkon města ten či onen div.[BR]To by byla nekonečná dikuse.[BR]Podle mojí zkušenosti, sem musíš chodit a psát.[BR]Jen trvalý hate dosáhne změny.[BR]A musí být samozřejmě plošný, jeden nespokojenec nic nezmění.[BR]Mám osobní zkušenost."}, {"114": "Na divech jsem si začala zakládat hned, jak se ve hře objevily, takže dnes je nemám nijak nízko, tedy abych si vyšlápla Věž až nahoru výkupem, tak do ní taková 3 - 4 požehnání 100% na mince vrazím, ale jinam je v podstatě v takové míře nijak zvlášť nepotřebuji a za ten týden je v akademii ukutím, tedy díky řemeslné výrobě mince na celou Věž zajistím, totéž i na přilepšenou kladívka - včetně na Hnědáka a výcvik vojska. Co se týká boje, ve Věži nebojuji, ale v turnaji jedu převážně, až na malé výjimky, jen na vojáky, tady počítám s tím, že v novém systému už neuhraji co dříve, tedy na co jsem byla zvyklá, ale to přeci všichni, a že díky vyšší úrovni divů, budu mít boj těžší, s tím také počítám, avšak také počítám s tím, že z podstaty uhraji více než někdo, kdo má ty divy nízko, tedy ano, s vyšší úrovní divů jsem oproti těm, co ji mají níže, v nevýhodě, že protivník je u mě \"zlejší\", ale zároveň i ve výhodě, kterou ty divy dávají, uhraji v turnaji i mnohem více, neboť tu nevýhodu svou výhodou - co všechno městu poskytují - přebijí - pokud tedy nebudou nějak nezvykle, co do vyspělosti města, předimenzované, což nejsou. Tedy podle mě, mít divy,  bude stále výhodné, jen ne už když budou předimenzované, ale úměrně navýšené s ohledem na vyspělost města. Jinak určitě jsem pro, ne nějak do nového systému zasahovat, ve smyslu úplného vyjmutí divů, jako toho, co turnaj/výkup ovlivňuje, ale celkově všechny ty náklady v turnaji snížit, podle mě jsou zbytečně až moc veliké."}, {"20": "Vylepšovat divy není snadné. Při čekání na novou kapitolu (což už jsem několikrát zažila ) je to jediná věc, kterou člověk může dělat. Hrát slušný turnaj a vylepšovat divy. Takže všichni hráči, kteří jsou už dlouho ve hře a mají divy vysoko, budou teď potrestáni zvýšenými nároky ve Věži i turnaji. Je opravdu nefér, že vývojáři mění ve hře něco tak podstatného a z výhody dělají nevýhodu. Naprosto neobstojí argument, že divy pořád dávají větší přínos, než to, co nám díky jejich penalizaci vezme turnaj a Věž. To je nesmyslný argument. Prostě nejvíc budou potrestáni nejvěrnější hráči.[BR][BR]Ještě chci dodat a zdůraznit: po tolika letech naprosto změnit kontinuitu vývoje hry a penalizovat divy, pokrok ve výzkumu a rozšíření města, je výraz pohrdání hráči. Mnozí z nás ve hře nechali určitou částku peněz a teď se všechno obrátilo proti nám.[BR]U mnohých hráčů v poslední kapitole musí některé kouzelné budovy do skladu, protože se po zvětšení nevejdou do města. Koupíš rozšíření a hned jsi za to penalizován.[BR]Inno potřebuje naše peníze, ale jak je chce od nás do budoucna dostat, když si nikdo nemůže být jistý, že to, co si dnes koupí, nebude zítra proti němu?[BR][BR]//Příspěvky sloučeny. Jumala"}, {"114": "Turnaje pro společenství[BR][BR]Nás v dějepise učili, že historie se opakuje.  Tedy určitě se máme ještě na co těšit, až nám ten další nový turnajový systém spustí zde na live.  Očekávám mnoho změn a též očekávám, že nám to vývojáři časem vyštelují, tak, jako tomu bylo i u toho předešlého, tenkrát ještě opovrhovaného \"nového systému\" a dnes tak vychvalovaného. Já flintu do žita zatím neházím. Hlavu vzhůru a vypnout hruď, drazí spolubojovníci! "}, {"16": "Však oni ti zelenáči se taky dostanou na konec ... a pak narazí na exponenciálu."}, {"11": "chtěl jsem sem něco napsat ale koukám je to promazaný, no škoda práce, je to velkolepý projev o věčně brblajících hráčích "}, {"203": "Pamatujte že každá změna je vždy k horšímu ("}, {"91": "Jak se začne něco omezovat, tak vždy.[BR][BR]Lovec Krys >> Nováčci než se dosanou na konec, tak už ta hra bude zase vypadat jinak."}, {"20": "Pokud budeme jenom nadšeně chválit, jak je ve hře vše úžasné, tak žádná změna nenastane. Fórum je tu, krom jiného, také k tomu, aby vývojáři dostávali zpětnou vazbu od nás, a tím jasnou informaci, že např. momentální situace nových turnajů i Věže není dobrá. Pak mají impuls k tomu, aby něco změnili. Jestli to udělají je druhá věc, ale přeci jen, občas něco akceptovali. Chceme změnu? Pak je třeba to jasně vyjádřit."}, {"91": "Zpětná vazba funguje podle mě dobře, jen nevím, zda v úrčitých případech chce být slyšena. Je to stejné jako u jiných her."}, {"114": "když se podívám na elvenstats na turnajová skóre spolků na betě, a na prvních místech porovnám výsledky ty ze starého systému s tím novým, že bych nějaký rozdíl viděla se vůbec říct nedá"}, {"16": "@luterina Porovnej si výsledky jednotlivých hráčů. Ti, co se v novém systému dostali přes 10K bodů tak jsou schopni učinit jen s neudržitelnými náklady (tzn. úbytek urychlovačů a podpůrných budov v zásobě).[BR]Navíc je výpočet závislý na exponenciále, tzn. hráčům na konci hry bude turnaj ztěžovat každý další výzkum, každé další rozšíření a každá další úroveň divů a to hlavně rychleji, než bude růst jejich shopnost produkce armády i surovin (navíc tam je nově mana a mince a kladiva, takže dlouho před tím, než ti dojdou suroviny budeš bez mincí/kladiv/many/orků).[BR][BR][IMG]https://i.ibb.co/qkZZHc6/https-cz-forum-elvenar-com-index-php-attachments-1595707974849-png-4666.png[/IMG][BR]Tohle je výkup z 11. provincie mého beta města (pouze 98 úrovní divů), zatímco obě T3 jsou ok, cena v mincích je silně přestřelena (stejně jako je silně přestřelena ve věži) a dle mého posledního srovnání nákladů ve věži předpokládám stejný poměr i mezi turnaji (když je použita stejná nebo téměř stejná formule pro oba), tzn. o 76% vyšší náklady na cz1 kvůli vyššímu počtu rozšíření a úrovní divů). [BR]A exponenciální růst nákladů mi do budoucna zajistí, že pro mne jak věž, tak i turnaj budou stále méně hratelné."}, {"114": "@Lovec Krys děkuji. Jinak to je to, co tu kromě jiného (exponencialita mi sama o sobě nevadí), celou dobu píši, že ty náklady v turnaji jsou zbytečně moc veliké, že jsem pro jejich snížení."}, {"141": "Exponenciála je evidentní hrozbou. Stejně jako \"sebevražedné\" vykoumání nepovinných oddílů kdysi. Pro začínající hráče bych si dovolil podotknout - pokud si chcete někdo Elve jen užívat, budovat, bavit se, doporučil bych - nedbejte toho. Ano, patřím k těm spokojeným s vývojem hry, kteří jsou divní, tak tu příliš nepíšou. Chjo.[BR][BR]Jo a  - opravdu mne INNO neplatí. To jen dle předchozích reakcí."}, {"91": "Tak já nepotřebuji vykupovat ještě turnaj, od toho \"mám\" věž, tam toho zase bez pomocných budov moc nevybojuji, protože ztráty jsou velké, a hlavně náhodné jednotky mi často boj vylučují, když nemám čím. To bych taky v turnaji mohl zjistit, že neodehraju vůbec první nebo další kolo, než natrénuju to co potřebuju (věž je rozdílná, že je hraní časově jinak rozložené a náročné na čas, takže turnaj pro mě znamená odehrát kolo až druhý den).[BR][BR]tupecpolni >> Sebevražedné vyzkoumání oddílů mělo zase výhodu na mapě, kdy ostatní museli bojovat výrazně těžší souboje a nebo automaticky vykupovat."}]