[{"141": "Pauleo - to jsem psal vždy, pokud někdo zmínil onu domnělou \"hrůzu\" nepovinných. Marně.[BR]K nějakým zmiňovaným průzkumům tabulek z júesej jsem se nevyjadřoval. Nevím. Neznám. Vím, že mi výzkumy[BR]nevadí. Toť vše.[BR]Aha, teď tě dočítám. Ano, každý hrajeme jinak. To je přece na Elve ta nejnádhera. Já např. ve Věži nedám ani surku, vše bojuji. Ano, ručně, ale časově mi to přijde skoro stejně jako hádání. Turnaje už dlouho na automat, to se časově nedalo. Ale neplatím nikde, to nee. Jak mi hra na začátku řekla, že se mám rozhodnout, věděl jsem, že místo je pro mne důležitější. Ale těžko mi bylo! Vojcly nesnáším!!! Ale co nadělám. Eščeže jsme virtuál [smilie--sprite8][BR]Rozumím zcela, pokud se hráč rozhodne spíše pro výrobu, tedy výkup. Nerozumím, pakliže si v tomto případku stěžuje na cokoli. A především chápu, že připadám nesrozumitelným. Neumím se vyjadřovat, promiňte. Jen bych rád, kdyby se třebas začínající hráči nenechali otrávit některými přinejmenším diskutabilními příspěvky. Například jakmile začnu psát, že jde hra do kopru, odměny jsou více a více odpadem, vývojáři si ze mne  dělají srandu atp... A budu stále hrát! Prosím, ťukněte do mne, že nemusím, že mohu jinam. Díky.[BR]Byl bych za to, by se nenechal nikdo otrávit. Elvenar poskytuje jistě mnoho prostoru těm, kdo rádi počítají. Ale i tomu, kdo má počítání za celý den plné kecky a chce si ve hře jen tak hezky rozrůstat se a povídat. Nechme se a nestrašme se. Děkuji."}, {"91": "Problém je, že těch možností hrát jinak na hře začíná ubývat, a postupně se to začíná měnit na přednastavenou cestu. Já se na začátku nijak nerozhodoval, bojovat jsem chtěl, ale když se otevřela věž, zjistil jsem, že ten boj je bez podpory pro mě docela ztrátový (hraju už jen automat). Na surky taky, ale v podstatě jich tolik nepotřebuji (ani ukazovat kolik jsem nasyslil), počet manufakur jsem volil v dobách, kdy jsem nevěděl co přijde, a chtěl být přínosem na surky pro společenství (výjimka byla přistavování nebo úprava manufaktur z důvodu změsíčnění mých bonusů, což se doposud nevyřešilo). Tak ale hra není jen o jednom nebo druhém. Počítat mě nebaví, ale i když bych chtěl, chci mít ráz města dle svých představ, a to se vylučuje. Rozvíjet se už nerozvíjím, vše se jen přestavuje, ale baví mě vylepšovat si divy z tunaje, a nový systém turnajů by tohle z velké části uzavřel, takže zrovna u mě, to co mě na hře baví především, končí."}, {"20": "Opakuji, co už jsem psala: fórum je tu od toho (krom jiného), aby vývojářům přinášelo zpětnou vazbu od hráčů a tak je důležité, aby se tu vyjádřilo, co se nám nelíbí. Já věřím moderátorům, že naše podněty komunikují tvůrcům hry. Proto sem také podobné věci píšu.[BR][BR]Samozřejmě hrajeme každý jinak. Pokud budu hrát turnaj na 3K, tak samozřejmě není problém bojovat celou věž i turnaj. Ale taková hra by mě nebavila. Když pravidelně hraji v turnaji víc, tak už je to podstatně náročnější. Takže turnaj bojuji, Věž část vykupuji a 3 patro jen bojuji. Prostě šetřím ve Věži vojáky.[BR][BR]Celý současný vývoj v novém turnaji vede k tomu, aby znemožnil silným hráčům kvalitní výsledky. Vše vede k jakémusi průměru. Je to nepříjemné, ale nejhorší věc vidím právě v tom, že co bylo dosud výhoda, se stává nevýhodou, tedy především penalizace za divy a rozšíření města. A udělat takový veletoč v kontinuitě hry, není správné. Nevím, proč by mi u divů část účinku měla být v podstatě odebrána? Proč nedávno přidali vývojáři dalších 5 lv. k divům, když je zároveň penalizují v turnaji i věži? To jsou kroky, které jdou proti sobě.[BR][BR]Pokud vidíte, že náklady v novém turnaji i věži jsou vysoké, je to právě exponenciálním růstem. Kdo není na konci výzkumu, může naše výhrady k vývoji hry brát jako přehnané. I já jsem ještě celkem nedávno byla zastáncem toho, že náklady ve věži nejsou zase tak hrozné, ale to jsem byla v 15. kapitole. Když jsem dokončila výzkum 16. kapitoly, tak mě ten skok nákladů ve věži celkem vyděsil. Navíc jsem přidala pár rozšíření a bylo to zpečetěno. Velký skok byl už při vstupu do kapitoly. Pokud se nezmění vzorec velkosti oddílu, tak při vstupu do další kapitoly už bude pro mě věž prakticky nehratelná. Nejde tu o to, že hádám z křišťálové koule. Prostě pokud bude dál růst exponenciální, tak vlastně každým krokem ve hře se blížím k její nehratelnosti. Je to logika věci. A nebo hratelnosti 1 patro Věže a turnaj kolem 3K. To pak ale přestanu hrát, protože mě to nebude bavit.[BR][BR]Současný vývoj hry vede k tomu, že hru opouští řada skvělých hráčů. Nebudu je jmenovat, ale vím o nich. A pokud se vývoj v plánovaném turnaji nezmění, odejdou další. A to mě moc mrzí."}, {"158": "Podzim is coming[BR][IMG]https://i.ibb.co/P4wwy8D/https-i-redd-it-9onkfb5cksb51-png.png[/IMG]"}, {"211": "Vyjma příspěvku GorGlin ze středy (Zlatá propast -- velikost oddílu) máte někdo další zajímavé postřehy z Bety ohledně změn v turnajích? Účet na Betě nemám, tak vám držím palce. Po počátečním rozčarování se na změny v ostré verzi začínám těšit a snad se parametry u divů díky vašim komentářům do té doby podaří vývojářům upravit."}, {"114": "Nejsem vývojář, ale podle mě exponenciální růst a výška nákladů jsou dvě různé věci, pokud mi něco roste např. tempem dvojnásobku předešlého 2 - 4 - 8 - 16 - 32 a pokud by to měl být např. počet mincí co bych musela všechny zaplatit, tedy celkem 62 mincí a moje kapacita skladu byla 620 mincí, tak by to bylo v pořádku, pokud však bych při zachování stejného tempa růstu měla hodnoty 20 - 40 - 80 - 160 - 320, tedy celkem 620, tak mám sklad mincí na nule a to v pořádku podle mě není, ta výše nákladů. Podle mě tady hrůza exponencialita není, ale ta částka, která v ní roste, tady bych ocenila, pokud by byla mnohem nižší.[BR]Jinak ani nevidím vývojářům do jejich práce, ale přijde mi dost nepravděpodobné, že by neměli odzkoušené např. jak a co uhraje takové město se všemi, do té exponenciality zahrnutými, rozšířeními, divy a výzkumy na jejich maximálních hodnotách a vypustili něco, co by bylo u takového města nehratelné, natož pro něj, oproti těm méně vyvinutým, degradující. Stručně, u vývojářů moc na nějaké školácké chyby nevěřím."}, {"91": "Fjorgyn >> Koukám, že je mezi vývojáři nějaký medvědomilec. A nový medvěd vypadá pěkně vykutáleně, zanechává falešné psí stopy.[BR][BR]luterina >> Já zase nevěřím, že mají něco odzkoušené, když se to testuje chvíli (a to že někdo nahraje 10k bodů na manuál s pomocí pomocných budov nic nedokazuje, navíc nikde jsem neviděl srovnání získatelných přímých odměn např. ze čtyř kol). Např. situaci na trhu dodnes nechápu, ať mi nikdo neříká, že je to promyšlené a schválně. Opakující se úkoly nekonečné řady událostí byly také zpočátku promyšlené, když přišly do ostré verze, že jsem si povšiml, že nekteré hráče to odradilo hrát. Promyšlené je dle mě hlavně to, že je chtějí v jejich hraní, a v tom, co je u hry drží, omezit. Ty to píšeš, jako kdyby to mělo utěšit hráče u konce - \"Ale podívej, vždyť to není vyloženě nehratelné, tak co zase máš...\"."}, {"114": "@Pauleo , pokud jsi něco takového z mého příspěvku vyčetl, tak to myšlené nebylo, to by bylo nedorozumění, asi je rozdíl v tom, vypustit něco, kde se hráč zasekne, ne z důvodu mylně nastavených parametrů - kde by šlo o problém u všech hráčů a tedy bylo chybou na straně hry, ale z důvodu nedostatku zdrojů, či třeba počtu manufaktur ve městě, a tedy bylo chybou ve městě. Řeč v mém příspěvku byla tedy o tom, že je dost nepravděpodobné, že by vývojáři neměli odzkoušené něco, a vypustili něco, co by nemělo globálně fungovat, ne tedy o tom, že si nedovolí vypustit něco, co nemusí všechna města zvládnout, od čehož pro odzkoušení a vybalancování (např. už jenom samotné hodnoty nákladů) mohou dát na betu a implementovat do live, to si asi dovolit mohou."}, {"2": "Takže jako byl čtvrtý pták, bude i čtvrtý medvěd?"}, {"31": "Áno. A tento týždeň už nahodili aj efekt kŕmenia a vypadá to byť poskytovanie nejakého množstva VB za každé použité krmivo (teda podobne ako u pandy)."}, {"91": "Akorát panda dává surky, VB dává ledový Felix, akorá ve vztahu s průzkumem."}, {"31": "@Pauleo podobnosť s pandou som mal na mysli ten princíp, akým to funguje (teda odmena za každé použité krmivo)."}, {"16": "Takže k ničemu. Nevadí, alespoň budu mít dost artefaktů na vylepšení druhé Pandy (další 2 magické výroby obden se hodí, i když asi brzo jenom na produkci surovin na výzkum, když turnaj bude omezen mincemi, kladivami, orkami a manou a bude úplně jedno, kolik máme surovin)."}, {"3": "to já zas lituju, že jsem pandu nabušil na max a neudělal polárku. Tak se zase vrhnu na ni [smilie--sprite1]"}, {"16": "Z posledních Marindorových (CM bety) vyjádření na foru jednoznačně vyplývá, že v nových turnajích se dočkáme více méně pouze kosmetických změn - tzn. jádro problému = výrazná penalizace měst na konci výzkumu na základě jejich počtu výzkumů, úrovní divů a počtu rozšíření a exponenciální růst nákladů zůstane zachován. (stačí nějaký čas sledovat růst nákladů ve věži a uvidíte, co vás čeká v turnaji)."}, {"20": "@Lovec Krys - četla jsem to a jsem z M. vyjádření zklamaná. V podstatě je jasné, že při testování na betě jen dolaďují funkci turnaje jako takovou, jen aby to běželo, ale zpětná vazba na názory hráčů je nechává v klídku. Mám dojem, že si čtou jen happy příspěvky a ostatní ignorují."}, {"88": "Bohužel mám stejný dojem a to nejen u vývojářů...  [smilie--sprite3]"}, {"91": "Takže projde, že všechno se bude prostě hrát stejně, protože někdo chce brzdu, a nic s tím už nepohne. Už to neřeším, užívám si hru tak jak je teď, dokud je, škoda."}, {"169": "Ahoj[BR]Podle mého tvůrci nereagují na s5nou vazbu od nás hráčů.Vždy si vemou jenom to GoodEventy stratili caro očekávání a snahu dokončit úspěšně dokonce.Jsou pomalu pravidelně.1chyba.Lidi už frustruje dělat něco co ve výsledků je kontraproduktivní (dam-dostanu),vzali nám nejprve studny (dia zadara stačilo ne,kupujte lidi),pak z event odměn vytrhli urychlovače (no tak si lidi počkají déle no bože),snížili příjem VB (nemůžete mít všichni divy na full přece) atd atd.Byla to hra kde se lidi bavili.Ted je to hotdog ( tzv ber co nabidnem) a víc pay pay.Za mne odezva do prázdná.Lovu zdar a at se daří"}, {"20": "Stačí se podívat na žebříček - dobře se orientuji spíš na CZ2 - kolik hráčů, kteří bývali dřív na 1. místě nebo alespoň blízko k vrcholu, se nyní propadá žebříčkem. Evidentně přestali hrát nebo hru omezili na minimum. Je jich docela dost. A řekla bych, že největší problém bude právě v tom, že v Elvenaru se prostě \"zdaňuje\" i to, co si nakoupíš za peníze. Někteří hráči tu utratili celkem dost peněz, a teď, díky nakoupeným rozšířením a vyspělým divům, mají věž naprosto příšernou. Prostě je exponenciála dohnala už nyní. Od některých to vím přímo, takže se jen nedomýšlím. A vidina, že turnaj bude stejná záležitost, je špatná. Inno ztrácí nejkvalitnější hráče, kteří tu zaplatili pěkných pár tisíc a byli by ochotní utrácet i dál, pokud by hra měla lepší směřování. Uvědomuje si to někdo? Místo toho nazývá Marindor na beta fóru všechny, kdo poukazují na tyto problémy, fanatiky. Výraz je doslovný. Jen ti, kdo jsou spokojení se vším, jsou ti skvělí hráči. Tohle už ničím nespraví. Ve hře zůstávám zatím kvůli skvělé partě, ještě tu je pár věcí, které mě tu drží, ale jak dlouho? Každopádně žádné peníze ode mě už jen tak neuvidí."}]