[{"31": "Na bete bola zavedená úprava dizajnu technológií vo výskume..[BR][BR]Spoiler: TechnológieOkrem nového dizajnu je aj novinka zobrazovania odomykania miľníkových surovín (ako napríklad orkov, many, živoucího zboží alebo aj nových avatarov).[BR][BR][IMG]https://i.ibb.co/C9cs153/https-i-ibb-co-55-Jkn-Wd-EL-nov-dizajn-technol-gi-1-2-8-2020-png.png[/IMG][BR][IMG]https://i.ibb.co/rk0Zkf6/https-i-ibb-co-B2-Tn-Z1-Y-EL-nov-dizajn-technol-gi-2-2-8-2020-png.png[/IMG]"}, {"66": "Doufám, že nebudou měnit barvy technologických oken, to se mi na výzkumu líbí, že každá rasa má svůj vlastní odstín."}, {"31": "@Prealiena budú sa meniť, ale grafický rozdiel tam zostane + dokonca budú mať u spriatelených rasách ďalšie grafické detaily. [BR][BR]Napríklad:[BR][BR]Lesní elfovia:[BR][BR][BR]Pulčíci:[BR][BR][BR]Elementálové:[BR][BR][BR]Ambasády:[BR]"}, {"66": "Grafické detaily v rozích mi nevadí. Hlavně, že zachovají příslušné rasové odstíny."}, {"91": "No zatím jsem si jako hlavní změny všiml přebarvení celého pole již vyzkoumané položky do patřičné barvy, u orků to tak znamená přidáním zelené, že se změní rasový odstín v názvu z červené na oranžovou, i odstín obrázku k výzkumu celý chytne nádech do zelena. A dále ve stylu zaoblování hran jako zde na fóru se o nějaký ten stupeň víc zaoblí všechny rohy (teď chybí na rámečku bez stínu jeden pixel, takže to vypadá estetičtěji), takže to vypadá víc jako kdysi nové (dnes už staré) OS od MS. Prvky v rozích naopak vypadají (obzvlášť třeba u půlčíků nebo lesních elfů) zase docela pěkně."}, {"20": "Podstatná výhoda této změny je v tom, že na klik reaguje celé políčko, takže je jedno, kam na něj kliknu. Vzhledově se mi dřívější verze líbila víc, ale nová je praktičtější. Takže dobrý."}, {"169": "Změnu vzhledu vyřešili okamžitě ale zpětnou vazbu od hráčů jaksi taksi přehlíží.Kdy se konečně začne řešit hra jako taková a problémy v ni?Nikde na fore jsem nenašel zmínku o změnu vzhledu prostředí a šup změna provedenamy to připadá ze si dělají co chtějí a důležitější připomínky obcházejí nebo řeknou to své:JE TO V ŘEŠENÍ,TRPĚLIVOST"}, {"91": "Ludi >> Tak to mohli udělat i beze změny vzhledu, kdyby nová verze nebyla vizuelně lepší. Na druhou stranu, mě funguje už teď celé políčko, když ho chci otevřít, není třeba otevíat přes kádinku.[BR][BR]CrazyWolf Cz >> Jo, tohle mě též napadá. Ale je možné, že kvůli přepracovávání turnajů upravují některý výzkum, a došlo i k ladění vzhledu stromu. Ač změnu turnajů nesdílím, a připravuji se, že nejspíš nebudu ve hře dále pokačovat, jsem dost zvědav, zda tam padne v rozhraní nějaký přínos, i když nejsem si s tím až tak jist, protože věž také nic nezaznamenala, a stále je nutné např. celkem zdlouhavě překlikávat karty trénovišť."}, {"31": "Pauleo napsal/a:\t\t\tAč změnu turnajů nesdílím, a připravuji se, že nejspíš nebudu ve hře dále pokačovat\t\tKlikněte zde pro zvětšení...Komentáre tohto typu sú absolútne zbytočné. Zmena je v tejto chvíli na bete, nie tu a to, že niekto sem napíše svoje dojmy a podľa môjho názoru absolútne nedobre zrekonštruované vyjadrenia moderátora ohľadne nadchádzajúcich krokov, je len zbytočná frustrácia ľudí, ktorí na bete nehrajú alebo nechcú hrať a nemajú tak možnosť si vytvoriť vlastný názor. Nehovorím, že zmena je úplne ideálna, ale minimálne výrazne prispieva k balansu hry (čo bude mať pozitívny dopad na dlhodobý chod) a férovosti medzi skupinami hráčov (a to ak by sme sa chceli baviť o úplnej férovosti, do formuly by mali spadať aj fénixovia a medvede, o ktorých zatiaľ nepadla ani zmienka)."}, {"203": "iDavis - pokud jde o férovost, tak tu já chápu tak, že ti, kteří to tu mastí už léta, by opravdu měli mít výhodu oproti nám hráčským elévům. A my bychom pak měli mít motivaci postupovat dál, abychom těch výhod dosáhli také."}, {"3": "jo, jenže ti hráči byli v podstatě nedohnatelní, protože rozhodoval jen počet otevřených provincií..."}, {"114": "@forthefirst \"ti hráči co to tu mastí už léta\", vždy měli, mají a výhodu pořád mít budou, stále platí, že malá města toho nahrají méně než ta města vyvinutá více, chápu, že výkony velkých měst a těch, kde jsou divy předimenzované, už tak velké nebudou, ale pořád ta rovnice malé město = méně, velké město = více, platná bude a takovými strašáky, jak bude něco po nějaké změně na pytel, jsme si prošli nesčetněkrát, viz. Věž, ta si snesla nadávek než přišel její čas slávy (netrpělivost v této hře není na místě), Elvenar je hra, která je neustále ve vývoji a změna podmínek v ní, k tomuto nevyhnutelně patří, Elvenar není něco hned vyprojektovaného co se zavede a padla. "}, {"20": "@iDavis vážím si práce, kterou pro nás děláš, ale tvůj poslední komentář mě mrzí.[BR]Nevím, proč by hráči nemohli vyjádřit svůj názor na základě informací, které tu jsou? Snad jsme svobodní lidé.[BR]O tom, kdo ze zdejších hráčů hraje na i betě ani sám nevíš, protože hráči si tam občas dávají jinou přezdívku, než mají tady.[BR]CO je férového na tom, že když hráč pracně získá ve hře nějakou výhodu, hned mu musí být zároveň část odebrána? To je totiž oč tu běží. Nejde o nový způsob turnaje, ale o penalizaci něčeho, co má být výhoda. A to prostě není fér vůči hráčům, kteří do hry investovali spoustu času a mnohdy i peněz.[BR][BR]Je naprosto normální, že hráči si ve hře nejsou rovní. Já nikdy nebudu v první desítce,  protože jsou tu hráči, kteří mají proti mě výhodu v různých věcech. Z různých důvodů. Tak to tak beru a nezávidím jim. Jsem spokojená tam, kde jsem. Ale když už nějakou výhodu získám, tak nechci, aby mi byla obratem zdaněna.[BR]Vyjádření Marindora bylo zde interpretováno správně. Později se to snažil nějak \"zahladit\", ale jeho vysvětlení je nedostatečné. Udělal chybu. Ale už se o tom nechci dál bavit.[BR][BR]@luterina jen malý příklad:  trh se svitky je pořád na pytel a je to právě způsobeno špatně vyladěným setem z věže. Kdo má bonus na svitky, tak je to fakt děs. Svitky jsou na trhu neprodejné. Před věží byly svitky jako bonus výhoda. Upozorňovalo se tu na to víckrát a nic se neděje.[BR]Věž se stala jediným zdrojem urychlovačů a jedním z mála zdrojů dia, a tak jí lidi hrají o sto šest. Takže o \"slávě\" věže to zas až tak není, ale spíš o tom, že jsme přišli o urychlovače v eventech a studny."}, {"91": "iDavis >> Tak pro mě je to nepříjemné téma (proto ta definice), ale přesto k němu občas (komě toho co jsem již napsal, opakovat se nechci) toužím něco připsat. Na balanc hry mám jiný názor, nevidím v něm smysl, proč by se mělo balancovat něco, co se ve hře přirozeně vyvíjí, bylo to tak od začátku, kdy jsem se se hrou setkal, a bude to tak v jistých ohledech vždy (mohli by pokračovat, a setřít všechny aspekty výzkumu, bylo by to tak lepší?). Když jsem poprvé vstoupil do společenství, tak jsem svůj přínos rozhodně měl, a není pravda, že by se nedalo např. v půlce hry hrát podobným stylem jako teď, zase bylo méně divů na vylepšení, apod.) a s vývojově pokočilejšími hráči mě nenapadlo srovnávat, proč bych měl. Takže balanc pro mě znamená, že jsme přišli o jinak hratelnou část hry než např. vež, a stává se z toho výrazně méně zajímavá hra, jen kvůli tomu, aby jí někteří mohli nazvat vybalancovaná. Naopak sdílím názor s Ludi, a to i že např. problém se změsíčněním bonusů se stále dlouhodobě neřeší, a to se jedná o značnou nevýhodu i pro hráče ve stejné vývojové fázi."}, {"37": "tahle hra není, nebyla a nikdy nebude a ani nemuze být ferová. Zde se událo takových disbalancí, že již není cesty z5."}, {"90": "Již z principu hra typu \"pay2win\" nemůže být \"férová\". Osobně vidím na Elvenaru nejférovějším to, že fakticky pro zábavu ze hry nezáleží na tom jak hrají jiní. Nejde jinému hráči škodit, zato mu lze pomoct, spolupracovat. To se mi na Elvenaru líbí.[BR]A pro soupeřivé dravce, kteří koukají na ten směšný \"žebříček\" a pořadí měst a spolků holt není pomoci."}, {"31": "Niektoré z najnovších plánovaných vecí, ktoré sa týkajú turnajov:[BR][BR]Zníženie šance na objavovanie sa many, orkov, mincí a zásob vo vyjednávaníRedukcia vplyvu rozšírení (aj klasických, aj prémiových) na náročnosť turnajuA to, čo mňa prekvapilo najviac - rozdelenie trénovacích radov vo vojenských budovách (teda zrejme už bude možné trénovať vo všetkých naraz)[BR]Pokiaľ ide o to posledné, nie som si istý, či to je niečo, čo plánovali už od prvej chvíle turnajových zmien, alebo to má byť nejaká reakcia na spätnú väzbu (párkrát sa na toto pripomienka objavila, aj keď panujú obavy z toho, či to výhodu naozaj prinesie)."}, {"72": "Poslednímu bodu se mi nechce věřit, no uvidíme."}, {"148": "Vyrábět ve všech najednou by nebylo špatné. Ale spotřebu kladiv si ani neumím představit )))"}, {"16": "Když se nad tím zamyslíte, tak tato změna sníží vliv urychlovačů(urychlení jen jedné fronty) při nakrmených medvědech, ale zase posilní vliv Simie na sběr (3 fronty s bonusem Simie)."}]