[{"72": "Faktický vliv urychlovačů by byl stejný. [BR]Bez ohledu na zabití turnaje, to samozřejmě sníží vliv všeho. [BR]Tohle by mohlo trochu pomoci, ale jen za předpokladu, že jen rozdělí fronty. Bez změny cen jednotek a podobných rovnostářských opatření co jsou tu poslední dobou tak in."}, {"3": "to abych pomalu začal stavět cvičiště a tábor. Kdo nepojede ve všem najednou, bude ztratný..."}, {"31": "Ale pripomínam, že tu hovoríme o veciach, ktoré ešte nie sú ani na bete, takže v tejto chvíli nemá žiaden zmysel sa na to nejak pripravovať. Zatiaľ je to len jedna z informácií o dianí, až nadchádzajúce týždne ukážu, do akej miery sú reálne."}, {"20": "Navrhované změny, které byly oznámeny na betě, jsou velmi dobré. Výskyt materiálu při smlouvání se má týkat turnaje i věže. Zmenšení dopadu rozšíření na celkový vzorec velikosti oddílu vítám. Jak to nakonec bude vypadat, je druhá otázka. [BR][BR]Jsem zvědavá, jestli hromadný trénink ve všech vojenských budovách najednou, nebude nakonec něčím podmíněn. Třeba použitím nějakého kouzla a pod. Každopádně je to dobrá věc a je jasné, že tím nám výrazně stoupne spotřeba kladiv. Ale to je v pořádku. Je to změna, kterou jsem si dávno přála."}, {"103": "Je plánované DS po Eventu Kouzelný Golem?[BR]Dost hráčů to zajímá kvůli stavbě osadníků a bonusových budov. Prosím a děkuji za každou informaci ♥"}, {"3": "ano"}, {"31": "Áno, dnes sa začalo na bete, takže niekedy po skončení aktuálnej udalosti je ho možné očakávať aj u nás.[BR][BR]Odmeny sú ako vždy, plus tentokrát artefakty na golema."}, {"2": "S radostí vám oznamuji, že jsem dnes měl na betě všechny střety ve stejné skladbě jako na live serverech[BR]tedy obrněný pěšák, mák a zlodějka"}, {"103": "Už se ví přesné datum DS prosím ??[BR]Na GOK furt nic není, ale třeba někdo ví více. A myslíte že bude ještě tento měsíc na live serverech? Nebo začne pěkně až 1.9. ať je po eventu chvíli klid. Děkuji za odpovědi. ♥ "}, {"16": "Na betě začal do dvou týdnů po eventu, počítal bych, že na tady začně podobně tzn. 1-2 týdny po skončení eventu.[BR]Podle zvyklosti nám jej nejspíše oznámí 2 dny předem.[BR]A možná někdo vyšťourá naplánované datum z dat hry dříve než jej oficiálně oznámí.[BR]Takže chystat se můžete tak do týdne po skončení eventu (pokud máte v plánu odteleportovávat vesnice, pak můžete počkat na oficiální oznámení nebo vyšťourání datumu).[BR]U nás na cz1 u koček asi zase projde cesta nejmenšího odporu (tzn. 3 kola po nejjednodušší cestě) - Místa málo a na cz1 mě nikdo nedonutí odteleportovat půlku vesnice do inventáře. A jedno DS šílenství s odteleportovanou vesnicí (aktuálně na betě) mi na dlouhou dobu stačí (jsme druzí a bojujeme s francouzi o první místo (zatím si udržují náskok asi tisíc bodů))."}, {"2": "Tak to byla asi jen náhoda, dnes už tam mám střelce i další pěšáky.[BR]Tak nic, škoda."}, {"16": "@GorGlin Před zhruba hodinou byl update, tak to může být tím (mimo jiné opravili bug zdvojení odměn při vybírání za odznaky)."}, {"31": "Tak podľa najnovších informácií z bety testovanie nových turnajov pokračuje a už budúci týždeň budú zavedené na anglický server (čo je jeden z live serverov). Dôvodom je rozšírenie komunity poskytujúcej spätnú väzbu. Zároveň sa vyjadrili tak, že na ostatné servery nové turnaje neprídu počas aspoň 3 týždňov od zavedenia na anglický, takže z toho vyplýva, že ich nemusíme čakať skôr než v turnaji začínajúcom 8.9."}, {"16": "To bude sranda na anglickém fóru.[BR]No mi už je to jedno, mi už v novém turnaji půjde jen o udržení plánku a relikvií na nepřetržitou výrobu kouzel bez ztráty relikvií (takže všechny moje síly budou koncentrovány do dvou turnajů a výledky těch ostatních 7 půjdou do háje (někam do průměru).[BR][BR]ps: Má to i svou výhodu, když budu (se 2 výjimkami) dělat standardně kolem 20 provincií po 1 střetu, tak to zabere výrazně méně času než současných 50+ provincií po 4 střetech. Obojí samozřejmě automatem."}, {"91": "Zbytečně to protahují, měli to už dávno spustit, stejně na to dojde."}, {"126": "Nevím, jestli to tu už někde není, ale zajímalo mě, co způsobí ten strašák Vylepšení Velikosti Oddílu u turnajů v číslech.[BR]Po vylepšení velikosti oddílu č.59, kde jsem zjištoval aktuální nárůst vojska i koláč obtížnosti provincií na mapě a výsledek je takový:[BR][BR]Před vylepšením :[BR][BR][BR]Po vylepšení :[BR][BR][BR]Počet jednotek v oddílu se tedy navýší o +4,25% za jedno Vylepšení velikosti oddílů.[BR]Suroviny to zde navýšilo jen T3 (o +4.25%) a surovinu Orky (o cca +3%). T1 zůstala beze změny.[BR][BR]Zatímco koláč obtížnosti na mapě u provincií zůstal beze změny."}, {"31": "@BiggJOEcz jedna technológia vylepšenia veľkosti oddielu nestačí na to, aby sa hneď upravili farby náročnosti provincií. Treba ich zrejme viac (naposledy keď som odomykal tieto technológie na bete, až po tuším 3. alebo 4. sa farby zmenili). To ale taktiež neznamená, že ak zostane farba rovnaká, rovnaká je aj náročnosť, každá z tých farieb pokrýva nejak široké spektrum náročnosti."}, {"72": "Teď sem zapnul betu, je tam FA a zase starej systém proklikávání se úkoly.. to jako vážně?"}, {"16": "@athlan To je jenom bug po skončení DS - skončilo v 7."}, {"2": "Gratuluji k druhému místu"}]