[{"103": "DSko teda bude bývat už jen 2x za rok že jo  Konečně normální změna, ty Eventy a DSko celej rok nonstop se ani nedali dělat skoro  A to nemluvím o věži a turnajích. Uf ♥[BR][BR]A ví se už přesné datum i čas prosím? "}, {"31": "Najbližšie dobrodružstvo je v tejto chvíli naplánované na 21.8."}, {"11": "v pátek? divnej termín"}, {"16": "Jinak tady je srovnání dvou posledních ocelových turnajů na betě:[BR]Body..........Minule....tento[BR]>20000.....1...............0[BR]>10000.....9...............3[BR]>7000.......19.............7[BR]>6000.......31...........12[BR]>5000.......49...........27[BR]>4000.......72...........61[BR]Výsledek hráče na stém místě v turnaji: (3378 (minule) vs 3462 (tento).[BR](20 prov. 6* = 5400 b, 15 prov. 6* = 4050 b, 20 prov 5*=4200 b)[BR][BR]To abyste měli představu, co nás vlastně čeká a co čeká konkrétně vás, dle toho, do které bodové skupiny patříte.[BR]Tzn. hráči s nízkými body si polepší, zatímco ti s vysokými výsledky si pohorší a turnajová špička zažije doslova genocidu."}, {"3": "no, tak to vypadá hůř, než jsem si představoval."}, {"91": "Takže dle očekávání."}, {"2": "A to mluvíme o tom nejsnažším turnaji."}, {"16": "@GorGlin On zase nebude tak velký rozdíl mezi jednotlivými turnaji (bude záležet více na náhodě, jestli se zrovna objeví specifické jednotky pro turnaj nebo náhodné z kteréhokoliv turnaje)."}, {"40": "Asi nemá cenu ronit slzy, smiříme se s novým nastavením, budem hrát \"to svoje\" a nakonec to nějak dopadne."}, {"91": "No nebudem hrát to svoje, když se máme smiřovat s něčím, s čím se zásadně smiřovat nechceme."}, {"3": "těžko si stěžovat na něco, co zatím vlastně neběží. Jak to vypadá na beta fóru? Taky taková nespokojenost?"}, {"16": "@Emhyr var Emreis II Beta forum je již irelevantní (aktuálně 63. stránka diskuze ke změnám v turnaji (+10 před nasazením)). Teď záleží jen na velkých plátcích na EN serverech. Pokud to oni zkousnou (resp. pokud jejich reakci shledá INNO jako dostatečně vyhovující), máme před sebou poslední 3 staré turnaje."}, {"37": "pokud to na EN foru nekdo sledujete, muzete zalozit vlakno a informovat, co se tam odehrava ?"}, {"3": "@Lovec Krys no ale i tak, byl to na betě fóru jednoznačný odpor?"}, {"16": "@Emhyr var Emreis II Většinový, pár takových, co to podporují (protože nahrají více) se tam našlo. Ale z těch, co jim to ublížilo se myslím neradoval nikdo (ale pročítat znovu všech 63 stran příspěvků se mi nechce)."}, {"20": "Odkaz na EN fórum: https://en.forum.elvenar.com/index.php[BR]Jak jsem to zběžně pročítala, tak to tam čiší \"meganadšením\" z nových přicházejících změn v turnaji "}, {"3": "přitom to je tak jednoduché. Stačilo neměnit obtížnost. [BR][BR]Seskupení střetů i nákladů dokupy? Není problém![BR]Omezení velikosti soupeřovy armády na 5 pozic? Taky OK![BR]Změna výpočtu síly soupeřovy armády? Rozumím tomu![BR]Zrušení zaměření na surovinu, ke které turnaj patří a preference některých jednotek? I s tím by se dalo žít![BR][BR]Ale ta rostoucí obtížnost a ještě evidentně takovým rapidním způsobem... "}, {"16": "@Emhyr var Emreis II Ale když ta obtížnost byla hlavním cílem - tedy spíše prostředkem, cílem bylo snížit náš nadprůměrný výtěžek z turnaje. Otázka tedy je, jak velký podíl mezi nadprůměrnými turnajovými hráči mají hlavními platiči."}, {"90": "Z turnaje pro mne poslední dobou nebylo problém nahrát okolo 10 tisíc bodů bez nějakého mimořádného úsilí - s nakrmeným Ohnivákem a případně nějakými bonusovými budovami - a získat tak hlavně v 2. a 5. kole obrovské množství VB použitelných do technologií. Fénixové a Medvědi turnaj zlehčili až moc a protože cesta zpět už není tak chápu snahu INNO o omezení turnajových dravců. Chápu neznamená, že by mne to těšilo. Ale to je asi všechno co s tím nadělám."}, {"3": "já bych řekl OK, ale v tom případě mi vadí komunikace INNA. Kdyby rovnou deklarovali, že tohle je cílem nebo jedním z hlavních cílů, řekl bych si OK. To samé je případ slabších a slabších odměn z eventů. Ať nemlží a na rovinu přiznají, že přestřelili, čímž narušili rovnováhu hry a těmito opatřeními se snaží hru balancovat s vědomím toho, že to některým hráčům vyloženě ublíží."}]