[{"16": "@Maxa Zatím reakce na EN foru vypadají dost podobně těm z bety."}, {"31": "Podzimní zvířetník[BR][BR]Spoiler: Podzimní zvířetník[IMG]https://i.ibb.co/W3Pyvt9/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-autumn2020-Forumann-zodicac20-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]Súčasťou udalosti je nová rozvinuteľná budova, všetky detailné informácie nájdete v nasledujúcich príspevkoch:[BR]Prehľad udalostiPrehľad nových budov"}, {"176": "Nový event má na betě 75 úkolů. Takže pokud kouzelníci jich měli 89 a těch 9 artefaktů se dalo nahrát, tak teď se zřejmě postarali, aby to už vůbec nešlo."}, {"31": "@Alatriste síce je menej úloh, ale dávajú viac, takže podľa toho sa to merať veľmi nedá."}, {"16": "@Maxa Teda nejméně tak španě, ne li hůře. Myslím, že trefně to vyjádřil jeden hráč na EN foru(neplatí pro ty, co dávají v turnaji pár set bodů). Jeho příspěvek se dá přeložit jako: Za dvojnásobek práce poloviční odměna. Neboli, pokud někdo nyní dá 10K bodů, může očekávat, že v novém turnaji dá 5k bodů za dvojnásobných nákladů."}, {"37": "mužeme jen doufat, že jim to da amerika \"sežrat\". Ale mam takove obavy, že jim je to uplně jedno."}, {"16": "EN nejsou americké servery, ty jsou US, EN jsou mezinárodní anglické servery. Jediné, co může Inno před touto zrůdností zastavit je masívní pokles příjmů (a možná ani to ne).[BR]Jinak si můžeme jen vzájemně škodit investováním VB do divů[BR]Anebo si vybrat divy, které chceme a ty i nadále vylepšovat a kašlat na výsledek v turnaji."}, {"90": "Nebo individuálně kašlat na žebříček, udělat v turnaji jako společenství 10 beden větším zapojení slabších hráčů a holt mít z turnaje míň KP a pomalejší postup v technologiích."}, {"91": "To jim nikdo \"z déle hrajících\" hrát nebude. O body jako takové nejde, jde o získatelné odměny dle aktivity hráče při nepřehnané obtížnosti. Pokud nepůjde získat podobný počet odměn, mám jasno."}, {"16": "Asi umřu smíchy:[BR][IMG]https://i.ibb.co/KyDn8qv/https-cz-forum-elvenar-com-index-php-attachments-1598065467854-png-4855.png[/IMG]"}, {"66": "Si dělají srandu? To mi dává fénix případně kupecká základna, co je každou chvíli v eventech.[BR]To je snad tento event dělaný pro ty, co nehrají déle než měsíc?"}, {"11": "tak na tu odměnu se hodně těším, těch 90 portálů co můžu momentálně naplnit se mi zdá pořád málo "}, {"2": "Nejlepší na tom je, že v pokročilích kapitolách je ti to třetinu výzkumu k ničemu."}, {"66": "Myslím, že denní odměny v eventech by měly být něco vyjímečného. Něco, co se jinak těžko schání. Rozhodně ne to, co se dá vyrobit v běžně dostupných budovách.[BR]Už to, že například v cestě vzdušných obchodníků byla denní odměna 20VB, když jedna z truhel dávala 30VB jako jednu z možných odměn, je na hlavu. Mělo by to být opačně, pak by to motivovalo hrát ten den s denní odměnou a ne kterýkoli jiný, když získám více VB jako vedlejší odměnu z truhly.[BR]5% potrálové požehnání vyrábí Kupecká základna - jedna z opakujících se hlavních cen mnoha posledních eventů, hráči je automaticky získávají, když hrají o artefakty. Před tím, ve starších eventech, byla i jako denní odměna. Je pro mě tedy běžně dostupná budova.[BR]10% portálové požehnání vyrábí Obchodní stanice - dá se získat ve věži, sice ne nějak mnoho, ale pár se jich aktivním hraním nabere.[BR]Pokud se tedy 5 a 10% dají jednoduše vyrobit, očekávala bych v eventech alespoň 15%, aby to bylo něco extra, co člověka nakopne.[BR][BR]Reaguji na celkový vývoj odměn v eventech a nedostatek jejich exkluzivity v očích hráče. Množství nastřádaných portálových požehnání jednotlivých hráčů mě nezajímá. Klidně ať dávají portálovky mezi denní odměny ale takové, které stojí za to."}, {"91": "No a v poslední události dokonce denní odměna 10 VB, přitom ty body padaly i z truhlic jako vedlejší odměna. Mě přijde, že se vždy něco zajímavého vymyslí, ale omezený repertoár hry z toho udělá něco, co je časem zcela bezcenné, a nebo se to opět zruší."}, {"20": "V eventu je sice více bodů za splnění úkolu, ale sféra za 60 klíčů dá jen 1 hvězdičku. Prostě nejhorší event, co jsem zažila. Snažím se to už nevnímat, protože bych se jen rozčilovala."}, {"20": "Pozvání do cechu Lesní hrádek na betě: Hrála jsem dlouho sama a poslední dobou se ke mě připojilo pár lidí. Je nás zatím 9 - CZ i SK hráči. Jsme velmi klidné společenství, nikam se neženeme, ale v turnaji v 9 lidech 4 bedny dáme, trochu věže, máme i kolečko na VB. Takže pokud hledáte společenství pro město, se kterým si testujete novinky na betě, tak to třeba zkuste u nás. Vstup je volný."}, {"2": "Ludi napsal/a:\t\t\t60 klíčů dá jen 1 hvězdičku.\t\tKlikněte zde pro zvětšení...No počkej, to je trochu vytržené z kontextu.[BR]Koule za 139 klíčů dá 5 hvězdného prachu.[BR]Takže ano, máš pravdu, že tam je koule za 60 co dá jen jeden, ale je to ta nejdražší a tedy budeš mít vždy dvě levnější možnosti."}, {"20": "@GorGlin souhlasím, že teď je větší sféra relativně \"levnější\" na počet hvězdiček. Ale dřív byla např. bedna tuším za 83 a dávala 3 nějaké ty sběrné artefakty a teď je za 81 a dává 2, dřív, to co bylo např. za 45 dávalo 2 a teď dává 1. Prostě na ty\"menší\" koule se moc nevyplatí klikat. Dá se to hrát, ale nadšená z toho nejsem.  Jediná výhoda eventu je v tom, že kdo má nedodělané medvědy z minulého roku, tak je bude možné dotáhnout. To je dobré."}, {"203": "@Ludi a v jakém kurzu se mění artefakty za ty staré a zase v akademii ?"}]