[{"75": "Silversnake napsal/a:\t\t\tNo tak teď jsem prošel 108 úkolů.... celkem na nás čeká získat 193 relikvií a 2x zkoumat technologie, nebo vylepšit barák na lvl 20+    to zase bude opruz\t\tKlikněte zde pro zvětšení...Jéé,kdes našel všechny úkoly,pls?"}, {"31": "@Mijecek všetky úlohy nájdeš tu. [smilie--sprite2]"}, {"16": "Takové množství 24h a 48h výrob...nevím, zda mi to bude stát za tu námahu, asi ke konci pojedu spíše rekreačně - více výroben lv1 už nemám kde postavit.[BR]Relikvie jsou taky velká sranda, v kombinaci s turnajem mi snad vyjdou provincie nepotřebující orky.[BR]Po kouknutí na setové bonusy na ně kašlu.[BR]Škoda, že 1. hlavní odměna není větší a druhá by místo peněz mohla dát raději populaci."}, {"31": "Pohľad na rok 2018[BR][BR]Spoiler: Pohľad na rok 2018Rok 2017, ktorý priniesol veľké množstvo noviniek a udalostí, sa nám pomaly blíži ku koncu a je na čase nahliadnuť, čo nám prinesie začiatok nového roka. [smilie--sprite1][BR][BR]Tu je prehľad toho, čo môžme očakávať v prvých týždňoch 2018:[BR]Mobilná aplikácia:[BR]- Úkolové rady budú ďalším veľkým prídavkom a počuli sme, že Magická akadémia si nájde svoju cestu do aplikácie čoskoro taktiež.[BR]Prehliadačová verzia:[BR]- Už naozaj čoskoro bude predstavená nová rasa: Elementálové (The Elementals). [smilie--sprite1][BR]- Povedal niekto Spoločenská funkcia? V roku 2018 budete mať možnosť úzko spolupracovať na vytvorení prvej komunitnej kultúrnej budovy v Elvenar! Viac informácií už čoskoro.[BR][BR]Citovaný bol Marindor z bety.[BR][BR]Indíciu na novú rasu som dával už tu, správna odpoveď je teda Elementálové, ktorú uhádla @klapa . [smilie--sprite1]"}, {"72": "Když přijde nová rasa, upravuje, resp. zvětšuje se mapa města?"}, {"16": "Elementálové - to by mohla být dílna ve tvaru sopky [smilie--sprite8]"}, {"2": "athlan napsal/a:\t\t\tKdyž přijde nová rasa, upravuje, resp. zvětšuje se mapa města?\t\tKlikněte zde pro zvětšení...[BR]ne, prostor si musíš udělat sám"}, {"46": "athlan napsal/a:\t\t\tKdyž přijde nová rasa, upravuje, resp. zvětšuje se mapa města?\t\tKlikněte zde pro zvětšení...Zpravidla vždy se s novou rasou přidala jedna řada rozšíření k celkové možné velikosti města."}, {"72": "Výborně, díky za info."}, {"66": "Zpravidla. Tak budeme doufat."}, {"31": "Nová úkolová rada je za dverami...[BR]Robert Redbeard[BR][BR]Spoiler: Robert Redbeard[IMG]https://i.ibb.co/S0L3pzK/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-redbeard-Redbeard-Banner01-png.png[/IMG][BR]Predpokladaný termín: 15.1. - 22.1.[BR][BR]Toto bude prvá časť úkolovej rady, rovnako ako v minulej rade Maškarní ples príde po krákej prestávke druhá časť.[BR][BR]Poprvýkrát pôjde o úkolovú radu, ktorá bude dostupná aj v mobilnej aplikácii.[BR][BR]Spoiler: ÚlohyZoznam všetkých úloh a odmien nájdete tu.​[BR]Celkovými odmenami z oboch častí budú 2 kultúrne budovy, ktoré budú tvoriť jeden set.[BR][BR][IMG]https://i.ibb.co/yFD9zBL/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-redbeard-Reward01-png.png[/IMG][BR][BR][IMG]https://i.ibb.co/S5DknRC/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-redbeard-Reward02-png.png[/IMG]"}, {"66": "Skvěle aktualizováno @iDavis. [smilie--sprite1][BR][BR]Na Gems of Knowledge již nyní info o hlavních cenách:[BR]https://www.gamersgemsofknowledge.com/robert-redbeard-prizes[BR][BR](Nějak mě napadá, že ta druhá odměna bude opět zajímavá až od deváté kapitoly)"}, {"72": "Nj, teď budou všade sety [smilie--sprite12][BR][BR]Ale dobře, že se něco děje."}, {"68": "mě čím dál tím víc přijde, že chtějí pomocí eventů spíše docílit toho, aby to lidi přestali hrát, než je spíše podpořit. Nechápu to"}, {"76": "Domečky jsou krásné a určitě budu hrát, jen bych řekl, že začne být daleko složitější udělat sety kvůli místu. [BR][BR]To co psala Safa, jsem vůbec nepochopil. Přece nikdo hráče nenutí úkoly dělat. [BR][BR]Nu a v neposlední řadě bych chtěl moc poděkovat iDavisovi za rychlé aktualizace úkolů. Myslím si, že díky němu má sousta hráčů mnohem větší šanci úkoly udělat. Upřímně řečeno, nechápu, jak někdo může nedodělat celou sestavu úkolů, když jednou za čas rozklikne forum ..."}, {"16": "Další event? Ok. (jo, já vím, že tohle je ten kratší typ)[BR]Jelikož jsem v půlce orků, tak asi budu úkoly plnit lážo plážo, případně tenhle event úplně vynechám - budovy jsou sice hezké, ale bonusy mě nijak nezaujaly.[BR][BR]Malá rada pro Inno - myslím, že by bylo rozumnější místo surovin raději posílit manu - všichni hráči v 9+ kapitole to jistě ocení. Produkce surovin (pro můj věk) ve stovkách za 12h, když každé 3h produkuji v 1 manufaktuře 2k suroviny stejné úrovně, je prostě k ničemu.[BR][BR]Nová kapitola tedy nejdříve na konci měsíce?[BR]Vím, jsem teprve u orků, ale zajímá mě, zda elementálské budovy (zejména obytné a dílny) budou hezčí než ty elf-hobití zrůdnosti.[BR][BR]@Prealiena To doufám, že přidají řadu, když podle pravidla dosavadních kapitol se nejspíše zase budou zvětšovat obytné budovy - teda pokud se nebudou zmenšovat(9>8 políček) jako u trpajzlíků. Ale i tak se určitě budou zvětšovat manufaktury a kdo ví, co ještě."}, {"74": "Vzhledem k objemu Elementála z \"fyzikálního hlediska\" by se budovy měly rapidně zmenšit...bo kontrolní otázka soudruzi: \"Kolik soudruhů Elementálů se vejde do jedné Elementární budovy?\""}, {"31": "Nová úkolová rada by mala byť poprvýkrát dostupná aj v mobilnej aplikácii. [smilie--sprite1]"}, {"31": "Sneak peek (1/2)[BR][BR]Spoiler: Sneak peek (1/2)Prvá ochutnávka z novej kapitoly.. ktorá je už za rohom. [smilie--sprite2][BR][BR][BR]"}, {"66": "Přidám další spoiler z Youtube, pauzněte video a přečtěte si zprávu na beta fórum.[BR]Prý máme stavět manufaktury na nezvýšené zboží 1. kategorie (pro hráče v 11. kapitole).[BR][BR][BR]Rasa očekávána v únoru."}]