[{"66": "@forthefirst Minule to bylo 2 nové za 1 starý a 3 staré za 1 nový."}, {"16": "Nové:Staré 2:1, opačný recept jsem zatím neviděl (jestli tam vůbec je, nedivil bych se kdyby ne)."}, {"31": "Na bete sa objavili prvé náznaky novej kapitoly..[BR][BR]SpoilerPred pár dňami sa na bete objavila chyba, ktorou boli zobrazené nové avatary 17. kapitoly v zozname:[BR][BR][IMG]https://i.ibb.co/XpVqvtD/https-beta-forum-elvenar-com-index-php-attachments-port1-jpg-7824.jpg[/IMG][BR](konkrétne po riadkoch 2., 4., 6. a 8. avatar patrí k novej kapitole)[BR][BR]Vývoj mimochodom stále napreduje, v tejto chvíli je hotová viacmenej väčšina z nej, takže očakávam, že to nebude tak dlho čo sa začne testovať na bete. Zároveň sa istým spôsobom medzičasom potvrdilo, že to, čo som v tomto príspevku ešte písal o novej kapitole ako čistú špekuláciu, bude naozaj jej, dokonca hlavnou, témou.[BR][BR]Zároveň, keďže existujú už viaceré zaujímavé dáta, trackujem si niektoré z nich v rámci príprav mesta a surovín. Na obrázku nižšie je vygenerovaný nový výskum s jednotlivými nákladmi:[BR][BR]Spoiler: Výskum[IMG]https://i.ibb.co/gy6pG8s/https-i-ibb-co-3-N4cc-BC-EL-kapitola-17-v-skum-men-surov-n-podpis-png.png[/IMG]"}, {"2": "Vypadá to zajímavě.[BR]Zvednutí veškeré vojenské produkce.[BR]Ale jinak se v této kapitole asi nic zvláštního nestane."}, {"16": "Jo, koukám zase pěkný záhul na mince - asi aby nás ani náhodou nenapadlo začít vykupovat v turnaji/věži (výkupy v obou žerou mince ve velkém).[BR]Max. kapacita mincí na konci Ambasád - 54M, takže hned první technologie stojí 92% kapacity mincí a 92% kapacity kladiv. Kdo nestihne vylepšit sídlo na max., do nové kapitoly se ani nedostane.[BR]Nějak se tím prokoušu, ale lituju ty, co nebudou mít alespoň měsíc-dva po skončení ambasád na vylepšení budov (taky všechno požírá mince a semena(nebo orky namísto semen) ve velkém, bez doplnění mincí/kladiv na max. nehrozí, že byste vylepšili více než 3 budovy najednou, předpokládám, že tento trend bude pokračovat).[BR]V nové kapitole asi i zbytek hráčů, kteří ještě používají pop/kult hybridy, přejde na rezidence kvůli nedostatku mincí (já už mám ve vesnici jen 1 (evoluční budovy a sety knihovny do toho nepočítám, ty nemám kvůli populaci))."}, {"2": "Pro mě jsou peníze to poslední co mě trápí.[BR]Je pranda, že mám ambasády hotové, ale peníze je to první co začne přebývat.[BR]Rád vidím, že požadavky na VBčka jsou proti ambasádám nižší."}, {"16": "@GorGlin To teda nevím, jak to děláš, ale já ještě dokončuju vylepšování budov a dohromady s výkupama ve věži jsou hned pryč. Já už mám dokonce v řemeslné výrobě vyšší prioritu na požehnání na mince než na krmení (z Kolotočů už taky vyrábím jen požehnání)."}, {"31": "Lovec Krys napsal/a:\t\t\tbez doplnění mincí/kladiv na max. nehrozí, že byste vylepšili více než 3 budovy najednou\t\tKlikněte zde pro zvětšení...Vypadá to tak, že tomu tak naozaj bude. Náklady nových vylepšení budov vediem tu (ľahšie sa mi to tam updatuje v prípade zmien) a taktiež to vypadá aj na pekné nároky na manu (hlavne manufaktury T3).[BR][BR]Z nejakého dôvodu som ale zatiaľ ešte nikde nezahliadol semená. Samozrejme ich bude treba na živoucí zboží, ale nikde nie sú explicitne potrebné na vylepšenie (aspoň zatiaľ), takže je možné, že si od ich nátlaku trochu oddýchneme (čo po 16. kapitole padne isto vhod)."}, {"16": "Rezidence 4x5 - znamená, že se nám otočí?[BR]Hm, bezva, zbrojnice upgradované orkami. Zvýší se alespoň nějak rozumně jejich produkce orků, nebo zůstane stejně ubohá jako je teď?[BR]Osadníci 8x8 + 9x4+ 6x6 + 4x9 + 7x4 + 5x5 + 4x7 + 5x3 + 4x4 + 3x5 (vše po jedné!) - buď je v tom více úrovní nebo budeme mít 8 různých osadnických budov kromě portálu? Pokud by to tak bylo, tak se tady se asi někdo zbláznil (ještě že mám v inventáři přes 100 teleportů a v novém turnaji mě bude zajímat jen plánek a dostatek relikvií ze dvou turnajů (v ostatních 7 spadnu z top pozic do průměru)).[BR]ps: Je mi jasné, že to jsou neúplné a předčasné informace, tak jen doufám, že se nikdo nezbláznil a že to jen blbě čtu nebo se to ještě upraví.[BR][BR]ps2: Informace o zbrojnicích je špatná - blbě jsem se podíval. Takže jen namísto semen tam budou T5."}, {"20": "Abych řekla pravdu, nějak těm vývojářům rozumím pořád méně. Utěšuju se, že jsou to předčasné informace. Přibude hráčů, kteří skončí hru nebo zastaví výzkum. Už nyní je dost hráčů, kteří sice hrají, ale výzkum Ambasád zastavili. Že byl to byl hlavní záměr vývojářů? Tak proč ty nové kapitoly vymýšlí a dělají je tak divně?"}, {"16": "@Ludi Význam těch čísel by nám mohl ozřejmit iDavis, on to ze souborů vytáhl, takže by tomu mohl rozumět líp než my. Případně někdo, kdo má přístup k informacím zevnitř by nám mohl vyspojlerovat, kolik těch osadnických budov vlastně bude (ať nezačínám paniku na základě špatných vstupů).[BR][BR]ps: Teď na to koukám znovu a iDavis tam má poznámku:  ^ portal and 9 different production buildings (not names yet) [BR]Takže asi fakt nám tam narvou 9 různých produkčních budov k portálu navíc. Doufám, že je nebudeme muset stavět najednou, nerad bych musel odteleportovávat půlku města."}, {"2": "dost dramaticky se smrsknou kasárna"}, {"126": "Lovec Krys napsal/a:\t\t\tOsadníci 8x8 + 9x4+ 6x6 + 4x9 + 7x4 + 5x5 + 4x7 + 5x3 + 4x4 + 3x5 (vše po jedné!) - buď je v tom více úrovní nebo budeme mít 8 různých osadnických budov kromě portálu? Pokud by to tak bylo, tak se tady se asi někdo zbláznil\t\tKlikněte zde pro zvětšení...[BR]Neviděl bych to v tomto případě tak zle.  Tady je srovnání velikostí budov, jak jsi psal a vedle 16.kapitola - ambasády .[BR]A pokud by to takto bylo, budou tam rezervy (třeba pro cesty, další budovy extra..)[BR][BR]Teoreticky by to bylo zatím ok[BR][BR][IMG]https://i.ibb.co/Gs7B7Xg/https-cz-forum-elvenar-com-index-php-attachments-x-vs-y-02-jpg-4866.jpg[/IMG]"}, {"31": "@Lovec Krys áno, je to 9 rôznych produkčných budov osadníkov, zatiaľ nemajú dané vyššie levely ako 1, takže je možné, že sa vylepšovať ďalej nijak nebudú (a vlastne tomu napovedá aj výskum).[BR]A tak náhodne ich poukladať okolo portálu ako vyššie ukazuje @BiggJOEcz asi nebude možné, keďže nebudú všetky rovnocenné, nakoľko tých 9 produkčných budov tvorí 3 sety (a teda v rámci tých setov sa budú musieť navzájom nejak dotýkať). Ale veľkosti by som sa zatiaľ nejak neobával."}, {"16": "4x4 je i tak dost. A to pouze za předpokladu, že ty budovy budou po jedné (mám tak trošku obavy, že v takovém případě to bude jak u čarodějů, takže z toho vznikne takový hnusný obtížně umístitelný ježek).[BR]A u ambasád nikdo, kdo měl dost Portálových požehnání nestavěl více než 1 Kruh (a to jenom kvůli úkolu).[BR]No, teleporty to jistí. Na upgrady budov v průběhu kapitoly stejně asi můžu zapomenout."}, {"126": "@iDavis @Lovec Krys   to jsem samozřejmě jen orientačně naskládal pro velikost, která zatím vypadá asi v pořádku.  A pokud to budou 3 sety po 3.budovách, prostor tam k tomu asi taky bude."}, {"2": "baráky se dycky nějak poskládají[BR]Jsme zvědav kolik z těch 5 surovin půjde pořídit přes portálový bonus"}, {"72": "Herdek, obytky, dílny, zbrojnice.. to se jako všechno otočí o 90stupňů? "}, {"16": "@athlan To by neměl být moc velký problém. Jestli to bude jako ambasády, tak to stejně většinou budeme vylepšovat až po dokončení kapitoly."}, {"2": "Zbrojnice se zvedat nebudou"}]