[{"17": "Jelikož se tu rozjela diskuze o něčem, co zatím není ani na Beta serveru této hry, dovoluji si upozornit, že vše, co se tu zatím objevilo, jsou jen a pouze dohady. Nová herní kapitola zatím není hotová, nemá tedy cenu se znepokojovat nad něčím, co vlastně ještě neexistuje."}, {"31": "Na bete dnes prebehol update, ktorý priniesol nejaké zaujímavé veci..[BR][BR]SpoilerKasárne, cvičisko a tábor žoldnierov viac nezdieľajú trénovaciu frontu, čo znamená, že je možné trénovať vo všetkých budovách súčasne.Balancovanie Mesačného medveďa nadchádzajúcej udalosti - boli zmenené a zväčša navýšené niektoré produkcie a taktiež zmenený efekt - namiesto predošlého poskytovania VB za každé použité krmivo s dĺžkou trvania 1h, teraz poskytuje VB za každú obdržanú truhlu susedskej výpomoci, s dĺžkou trvania 24h. Viac aktualizovaných detailov o tejto budove nájdete tu.[BR]Čo sa týka prvého bodu, neostáva nám zrejme nič iné, než dúfať, že je to jediná zmena, ktorá ohľadom toho prišla a nie je v tom skrytý nejaký chyták typu \"ale aby sme zachovali balans, všetky vojenské budovy budú produkovať 33% súčasného množstva\".."}, {"3": "zajímavé a zároveň - SAKRA! mám jen kasárna a lidi chybí"}, {"16": "Tak jen doufám, že nám to zase něčím neztíží (ach ta důvěra v Inno dev tým) a že je to kompenzace za obrovské oddíly v novém turnaji (neřeší samotnou bojovatelnost, pouze doplňování ztrát a nepřímo snižuje význam medvědů, resp. rozdíl mezi hráči s medvědy a bez nich).[BR][BR]ps: Co ohledně trénování orčích jednotek? Dokud budou požadovat orky na vstupu v podstatě ve cvičišti nelze tyto jednotky trénovat kvůli nárokům na orky v jiných částech hry (a jejich směšné produkci v posledních kapitolách, kdy se 10+ zbrojnic stává pomalu standardem a stejně to nestačí na cvičení orčích jednotek)).[BR][BR]ps2: upravena přeškrtnutá věta, ve skutečnosti změna snižuje význam urychlovačů (obvykle používaných ve spolupráci s nakrmeným medvědem), jelikož urychlení taky funguje zvlášť."}, {"119": "To se mi líbí mít možnost vyrábět ve všech frontách vojáky, aniž by byla fronta sdílená. Otázkou je, jestli nebude ještě nějaká zmena... Každopádně mě tímto potěšili. A už by mohli spustit nové turnaje, je to výzva.!!! "}, {"16": "@aikomi S rychlostí výroby zatím nehýbali(zřejmě), jestli nám na oplátku neprovedli něco jiného se asi dozvíme večer, až turnaj na betě/EN serverech začne.[BR]No výzva znamená, že si vyplýtváš spoustu prostředků navíc (posilovacích budov), pokud chceš nahrát neudržitelný výsledek.[BR]S novým turnajem můžeš trénovat klidně nekonečno jednotek, ale bez posilovacích budov tě dříve nebo později přesila nepřátel prostě umlátí čepicema (to dříve nebo později záleží na tvojí ochotě a znalosti ručního boje a vyspělosti tvého města (tzn. jak moc velkou penaltu máš z výzkumu, divů a rozšíření)). Stačí porovnat turnaj první 2 týdny na betě a teď (třeba ten poslední).[BR]Když si to na začátku hráči testovali a používali spoustu posilovacích budov, tak tam špička turnaje měla podobné výsledky jako před změnou. Teď má jeden hráč 12K bodů, za ním 3K mezera a 8. místo uzavírá hráč se 6126 body (na cz1 by se umístil na 45. místě a na cz2 na 39. místě)."}, {"37": "mě by take zajimalo, zda bude videt cas do konce fronty. Nejen cas prave trenovane skupiny."}, {"20": "V každém \"cvičišti\" je vidět čas fronty. Fronty jsou úplně oddělené. Na betě mám kasárna a cvičiště a vše funguje dobře.[BR]Co se týče urychlovačů - zde na live - stejně je budu požívat jen na jedno výcvikové místo. Na CZ1 mám pořád nejlepší vojsko z kasáren, na CZ 2 z tábora. Ale to, že bude možné cvičit najednou i ostatní jednotky je fajn. Prostě rezerva, která se moc hodí."}, {"126": "@Ludi  on to určitě myslel tak, že po najetí myší nad \"cvičištěm\" se zobrazí fronta právě trénované skupiny a né všech jako celku."}, {"20": "Samozřejmě, že se nad každým cvičištěm po najetí myší zobrazuje právě trénovaná skupina. A když otevřu kasárna i cvičiště, je tam vidět čas do konce fronty v každém zvlášť. Prostě je to úplně oddělené."}, {"37": "@Ludi takže pokud budu chtít vidět čas do konce, musím \"sklidit\" vytrénované jednotky z jednoho trenovaciho strediska. TO JE NAHOUBEC, ikdyž lepší, jak to sebrat vsude. Uz tet mě to vadilo, ze to nenividět a dost často jsem přez noc stál, protože ani ty Zzzz nejsou vsude vidět. Letitá nedokonalost a ani tet to neopraví ? :-([BR][BR]Edit: tak jsem to chtel asi chápat v lepším světle.protože tet není vidět čas do konce vycviku. Takze nakonec změna k horšímu. nic nám to nepomůze a jeste uškodí. budou bud prostoje a nebo nadměrná spotřeba krmení. obé je zlé. Já tuhle hru asi fakt nemám zapotřebí. počkám co z toho vyleze a nez nervy, to raději o5 zmizim[BR][BR]//Odstraněn nevhodný výraz. Jumala"}, {"2": "Maxa, já ti asi nerozumím co je špatného na tom, že můžeš produkovat trojnásobek jednotek proti současnosti?"}, {"205": "Maxa, já ti taky nerozumím. Když se podívám na frontu, tak vidím kolik času potřebuje aktuální jednotka a hned vedle vidím, kolik času potřebuje celá fronta. Takže celkem v klidu jsem schopen naplánovat trénink přes noc, aby mi výcvik jednotek nestál."}, {"197": "@prchlik Jenže na to musíš otevřít kasárna a abys je otevřel, musíš nejprve vyzvednout již vycvičené jednotky a to @Maxa nechce, protože chce vycvičit celou frontu, nakrmit medvěda a poté vyzvednout jednotky."}, {"37": "@Victorious1722 diky. přesne tak. Takže pokud to nevidim, bud budu krmit medvěda neefektivne a zbytečně brzo a nebo naopak mit dlouhé prostoje třeba celou noc kvuli par minutám. Mozná se nevyjadřuji uplně přesně, ale kdo to hraje a ma medvěda, musí mít snad stejný problém. Ano, muzu jko magor si vest deníček a zapisovat si časy. Díky ...nechci."}, {"2": "jenže ted už to není tak důležité sledovat, protože nahodiš všechny baráky najednou a při jejich nahazování budeš vědět, že ted jsou například 4 odpoledne a ráno nahodím medvěda.[BR][BR]Já naopak myslím, že celou věc kolem medvěda zjednodušilo[BR]už si menusím dva dyn dávat pozor abych naplnil výcvikové řady tří budov"}, {"16": "@Maxa Efekt medvěda trvá 12 hodin, takže ti stačí si pamatovat čas nejrychlejší budovy a zbytek do vybereš během trvání efektu. Nemyslím, že nakrmit ho o pár minut předčasně by byl tak velký rozdíl.[BR]Ale mohli by ten tooltip upravit, aby tam byly vidět oba časy."}, {"37": "tak podrbat se mohu i pravou rukou za levym uchem, ale ......"}, {"3": "já jsem medvědy zatím krmil jen 3 nebo 4x. Vždycky k tomu spotřebuju stovky, resp. tisíce hodin urychlovačů a kladivokouzla a jednotky pak vydrží několik měsíců. Těch pár hodinech promarněných za tenhle případ mě fakt nevytrhne..."}, {"16": "Přinejmenším příští turnaj bude ještě po staru dle vyjádření anglického komunitního managera:[BR]\t\t\tAre you able to confirm whether or not it will be implemented on the other Live servers next week?\t\tKlikněte zde pro zvětšení...\t\t\t@Verde It is not planned for next week, due to the amount of feedback we have had.\t\tKlikněte zde pro zvětšení..."}]