[{"31": "V tejto chvíli naplánovaný termín podzimnej udalosti nájdete uvedený v prehľade."}, {"205": "Victorious1722 napsal/a:@prchlik Jenže na to musíš otevřít kasárna a abys je otevřel, musíš nejprve vyzvednout již vycvičené jednotky a to @Maxa nechce, protože chce vycvičit celou frontu, nakrmit medvěda a poté vyzvednout jednotky.\t\tKlikněte zde pro zvětšení...Tak to pak jo, ale Maxa se o medvědovi ani nezmínil. Takže nebylo jasné, o co mu jde. Systém použití medvěda dobře popsal emhyr. Používat ho jinak mi nepřijde smysluplné. Tím pádem ztrácí smysl hlídání času."}, {"37": "@prchlik tak to co popisuje  Emhyr var Emreis II je plytvani urycholavaci a kouzly, ktere jsem zminil. Pokud chci efektivně vyuzít čas a kouzla, potřebuji sledovat čas. Ovšem pokud k tomu ma inno stejný přístup jako vy, tak se nedivím."}, {"3": "Maxa napsal/a:@prchlik tak to co popisuje  Emhyr var Emreis II je plytvani urycholavaci, ktere jsem zminil. Pokud chci efektivně vyuzít čas a kouzla, potřebuji sledovat čas. Ovšem pokud k tomu má inno stejný přístup jako vy, tak se nedivím.\t\tKlikněte zde pro zvětšení...záleží, co je ti vzácnější. Jestli krmení nebo urychlovače. Já jsem vysledoval, že za ten čas, po který mi ty vyrobené jednotky vydrží, jsem schopný (především) z věže získat více urychlovačů (i 100% kladívkových kouzel), než kolik jich vrazím do tady té výroby vojáčků."}, {"16": "Animované budovy kap. 17:[BR]\t\t\t\t\t\tPublic Druids - ch17\t\t\t\t\tch17\t\t\t\t\tsites.google.com\t\t\t\tZdrojem zřejmě Karvest z bety, případně ve spolupráci s někým z PL (nalezeno na PL foru)."}, {"3": "hodně konstruktí styl, ale líbí se mi [smilie--sprite1]"}, {"2": "Jo, taky se těším"}, {"31": "Aktualizoval som budovy nadchádzajúcej udalosti o hodnoty 17. kapitoly. Rozdiely vypadajú byť zhruba rovnaké, ako medzi 15. a 16. kapitolou.[BR][BR]Nová kapitola sa zatiaľ spája s pomenovaním \"Traders of Unur\", v preklade Obchodníci Unuru. Vypadá to teda tak, že predzvesťou tejto kapitoly bola udalosť Cesty vzdušných obchodníkov (a len nedávno som si všimol vetu v oznámení, ktorá hovorí Nikdy nevíte, třeba se vám spolupráce s nimi v budoucnu vyplatí... )."}, {"2": "Až tak, že by budovy z eventu měli nějaký dopad  na kapitolu, nebo jen řečnický?[BR]Že na začátku budu pochválen za předešlou spolupráci bez ohledu na to jestli nějaká byla."}, {"3": "no pokud by nějak ten získaný set (případně jiné budovy) získaly na síle třeba při připojení k budovám kapitoly, bylo by to zajímavé. Zatím ho mám ještě postavený [smilie--sprite8]"}, {"16": "Takže pokračujeme v započatém trendu nízkých nárůstů produkce a vysokých nárůstů nákladů:[BR]Např. produkce semen v jedné z budov v eventu:[BR]Kapitola - produkce(přírůstek)[BR]XI - 920[BR]XII - 1030 (+110)[BR]XIII - 1150 (+120)[BR]XIV - 1280 (+130)[BR]XV - 1350 (+70)[BR]XVI - 1390 (+40)[BR]XVII - 1430 (+40)[BR]Myslím, že další komentář netřeba. Jsem si jist, že ceny všeho vzrostou o dost více.[BR][BR]ps: Na anglickém foru už pondělní start eventu oznámili oficiálně. Takže v PO začínáme."}, {"2": "Na betě je potvrzené DSko.[BR]Konec bude zase v sedum večer"}, {"66": "A je tam artefakt na měsíčního méďu?"}, {"2": "to zatím nevím"}, {"16": "Měli by tam být 2."}, {"31": "Na bete sa už začalo DS, odmeny z truhiel sú tentokrát trochu zmenené, vypadajú nasledovne:[BR][BR]1. mapa[BR]1x prastará vědomost (10)1x Rozvážková knihovna10x zesilovač (10 min)2. mapa[BR]2x prastará vědomost (15)1x Artefakt měsíčního medvěda20x zesilovač (15 min)3. mapa[BR]1x Obří ruské kolo1x Artefakt měsíčního medvěda30x zesilovač (30 min)"}, {"119": "VBcka a Artefakty se vždy hodí. Jinak za mě  DS ztratilo své kouzlo a nějak nemám potřebu se hnát s odznaky ku předu a trávit s tím čas."}, {"91": "Tak nějak, u nás se seberou jen odměny, a nějaké honění se nekonná. Těch vědomostí je sice nějak málo..."}, {"3": "právě, VBčka ze hry mizí stejným tempem, jako předtím studny [smilie--sprite3]"}, {"2": "Jejich potřeba roste ještě rychleji"}]