[{"31": "Ako som už niekde spomínal, ja by som sa toho, že sa nám zníži príjem VB až tak neobával. Minimálne podľa nákladov výskumu 17. kapitoly je vidieť, že vývojári tieto okolnosti nejakým spôsobom zobrali do úvahy a množstvo VB potrebných na odomknutie jednotlivých technológií sa v porovnaní so 16. kapitolou zníži.[BR][BR]Okrem toho možno sledovať, že sa do popredia dostávajú evo budovy z udalostí, ktoré VB poskytujú, aj v kombinácií s ďalšími produkciami (súčasne napríklad mesačný medveď, ktorý je síce pri voľbe určitej konkurencie v tieni, ale v porovnaní s budovami, ktoré sme tu mali poslednú dobu, je asi jednou z najlepších)."}, {"91": "iDavis >> Ale oni snžují příjem VB do divů, to se stromem nemá nic společného. A navíc VB normální jsou taktéž i do divů, takže to že jsou snížené náklady na výzkum jsou jen pro hráče, kteří hrají hru \"jen\" pro dohrání kapitoly."}, {"40": "Pokud jsem na konci výzkumu na co jsou mi VB? Z turnajů. Abych je cpal do divů? A hru si za odměnu stížil? Dávám je po dohodě \"potřebným\" V kase mám cca 2600 jen do divů. [BR]Čekám že se na ně udělá místo \" třeba na tržišti\""}, {"91": "No jo, když jsem někdy dávno poukazoval na situaci kolem věže, tak odpověd byla, jak je to naprosto zanedbatelné, a pak někdo přišel s tím, že zase tak moc ne. A najedou mají zrušit turnaj a udělat další převlečenou věž, a najednou všichni řeší, že přestanou hru hrát, jak se vždy hrála, a začnou se bát."}, {"16": "@Pauleo U věže jim to prošlo, protože hráči MinMax Gamer nějakou dobu trvalo, než rozluštil formuli věže. Zatímco vzhledem k podobnosti s turnajem to bylo jasné už po oznámení, na čem nový turnaj závisí. No a navíc věž byla nová věc a turnaj se mění...[BR][BR]Tady:[BR]\t\t\thttps://cz.forum.elvenar.com/index.php?threads/nové-turnaje.6778/#post-126170\t\tjsem přidal, jak to konkrétně v aktuálním turnaji na betě (z pohledu mojí beta vesnice)."}, {"91": "No já nevím kdo to tu kdysi oficiálně zmiňoval (protože jsem to pak už nenašel), ale něco ve smyslu, že např. divy mají vliv na obtížnost průchodu věží tu někdo již dříve zmiňoval, a bylo to ještě předtím, než se to tu tenkrát začalo řešit a spekulovat o tom, takže určitou představu jsem měl, ale jak jsem též psal dříve, věž byla něco nového, odlišného od turnaje, takže to, že je počítaná jinak než turnaje, jsem bez problému přijal, sic bojem mi to dodnes bez pomocných budov na automat docela nejde, a ztráty jsou dost vysoké, ne-li někdy pro mě i často nehratelné, a to těch úrovní divů, popř. jiných činitelů ani zdaleka tolik nemám jako jiní hráči tady. Díky za doplnění těch kritérií, ale jestli to takhle bude vypadat, tak to vážně hrát nechci, nic si tam nenahraju, a navíc mě to ani nebude bavit, tohle není známý turnaj, ale další hon na pokusné králíky. Věž jako takovou jsem přijal dobře, dokonce jsem byl jeden z mála, kdo tu o ní už od začátku mluvil relativně v dobrém."}, {"16": "Tak na polském foru už někdo vyslepičil bonusy divů v 17. kapitole:[BR]Dračí archa:[BR]Prošlé zboží za úkoly ( [smilie--sprite8] tohle fakt vymyslela nějaká super hlava)[BR]Spoj. činidla při výběru mystických objektů (jednodušší je hrát věž).[BR][BR]Orakulum štěstěny:[BR]Prošlé zboží za řemeslnou výrobu[BR]1(až 7 na 35lvlu) Královská rekonstrukce týdně (akorát dobré pro někoho, kdo vůbec nehraje turnaje)[BR][BR]Takže z mého hlediska (a z hlediska nových turnajů) je dobře, že mě ani jeden neláká k postavení, alespoň si v turnajích a věži neublížím jejich postavením."}, {"126": "Mě se třeba ten Orákulum štěstěny celkem zamlouvá. neb díky tomu, že už dlouho nejsou rozumné alternativy třeba za Venary, tak KR se bude hodně hodit. A mít třeba jen i 4ks denně(snad budou denně)  je hodně dobré. A pokud nějak nepromyslí nějaké budovy s lepším poměrem pop/kult / políčko, tak se budou vesele ignorovat budovy z nových eventů a bude se jen vylepšovat ty starší / lepší... Což by mě mrzelo..:-( Přitom po estetické stránce jsou to pro mě nádherné budovy..ale co s nimi, když se ani vzdáleně nevyrovnají těm z roku 2017.. . [smilie--sprite10]"}, {"16": "@BiggJOEcz Bohužel je to týdně. Snad nemyslíš, že by nám to dali denně. Ad Skaliska: Já dávám přednost obytkám + Termálním pramenům, pop/kult hybrida už mám jen jednoho (posledního Cukrového otce pralesa)."}, {"119": "Pokud to do té doby neupraví a nechají to tak, budu jedině ráda.. Aspoň nebudu stavět další. Už tak jich mám dost a než to vše vylepším, je běh na dlouhou trať. [smilie--sprite1]"}, {"31": "O nových divoch si zatiaľ nerobím názor. Dôvodov je viacero, ako napríklad celkový balans novej kapitoly alebo fakt, že tržiště bude zdrojom novej suroviny (unuria), o ktorej zatiaľ nikto nevie, či náhodou nebude náhradou semienok (v zmysle, že to bude akoby výberová produkcia \"jedno alebo druhé\" alebo podobne)."}, {"2": "Mám postavené všechny divy a zatím jsem jen jediný považoval za plýtvání místem, ale uz o turnajové aréně jsem se musel hodně přesvědčovat a tohle taky nebude snadné.[BR]Na druhou stranu vizuál je pro mě taky důležitý.[BR]Stále mám ve městě Ochránce lesa a Dračí orakulum.[BR]A jeslti bude další drak, není co řešit."}, {"119": "GorGlin napsal/a:\t\t\to turnajové aréně jsem se musel hodně přesvědčovat a tohle taky nebude snadné.\t\tKlikněte zde pro zvětšení...Taky jsem ji původně nechtěla stavět. Nakonec jsem se rozhodla, že ji postavím, ale jen kvůli tomu, že to dává včelí jezdkyně. Jinak bych o ní nestála."}, {"212": "Kam ty divy dáváte? [smilie--sprite7] já bych tedy na všechny místo neměla :-D"}, {"66": "Právě po Turnajové aréně jsem čekala, že začnou nasazovat divy produkující jednotky z tábora a cvičiště. Ale tohle je snad vtip. Nevěřím, že by to byla konečná verze, která se dostane na live servery.[BR][BR]PS. Jelikož je Enarovo velvyslanectví často zmiňováno jako nejneužitečnější div ve hře. Tak bych čekala, že už poznali, že týdenní výroba je na nic."}, {"16": "@Prealiena Anebo je právě to inspirovalo."}, {"3": "Mám postavenou cca polovinu divů (možná dokonce menší polovinu) a o tyhle kousky svou sbírku pravděpodobně nerozšířím. Což je asi dobře [smilie--sprite8]"}, {"2": "Užitečnost divu je sporná věc.[BR]Div který někdo nevyužije může jinému hráči přijít užitečný a naopak.[BR]Jsem zvědav s čím přijdou na betu."}, {"126": "@Lovec Krys spíše než myslel, tak v to doufal... nebo i po 48h. Ale to bych chtěl moc. Vím.[BR]Nad Termálama jsem také hodně uvažoval..ale nemůžu se zbavit dojmu, že tento div je nasazen právě proto, aby snížil hodnotu těch nej hybridů, kvůli kterým hodně lidí neustále nadává na ty \"nové\" budovy z eventů a vytlačil ty staré nadsazené hybridy ze hry. Pak už by se radovalo a těšilo podstatně více hráčů na eventy, jakmile by se trocha vyrovnaly ty propočty na políčko. Takový pocit no... Proto Termály nestavím (byt ted na 1.levelu by přidaly cca +14.000 populace.), a držím si Venary a top zimní budovy viz můj avatar zde. Ale už teď tak nějak tuším, že se tomu nevyhnu. Plánky rostou pomaleji, než je potřeba na KR + upgrade kouzelek a KR přibývá ještě méně..."}, {"28": "Já spíš čekám, kdy ty staré eventové budovy nenechají \"růst\" (nebo výrazně sníží jejich růst) do další kapitoly. Tedy, že už se je nebude vyplácet přes KR vylepšovat. Koneckonců už do něčeho takto zasahovali."}]