[{"2": "To snad ne, těch budov je par"}, {"126": "@Thespia  pevně doufám, že do toho touto degradací zasahovat nebudou... jen to ty budovy z Eventů z let 2016-2018, kdy jsme opravdu dřeli (třeba i kupovali) pro jejich získání a právě i ty vydřené plánky a KR jsme do nich investovali během těch těch pár let a ty budovy drželi ve městě... Kdyby i takovéto unikáty nám vzaly, bylo by to opravdu hodně smutný "}, {"16": "Už to provedli některým setům (např. Stromy ze Zimního setu mají nárůst many v Ambasádách 0). Takže to můžou provést kdykoliv čemukoliv (a nést následky ve formě úbytku hráčů)."}, {"31": "Pár aktualít a čo nás čaká[BR][BR]Spoiler: Pár aktualít a čo nás čaká1. Dobrodružstvo společenství[BR]Blíži sa dobrodružstvo spoločenstiev, odmenou budú artefakty z jesennej udalosti, teda artefakty na mesačného medveďa. V tejto chvíli je začiatok naplánovaný na niekedy v priebehu týždňa od 5. októbra. Setup je rovnaký ako v predchádzajúcom dobrodružstve.[BR][BR]2. Nová kapitola[BR]Vývoj novej kapitoly vypadá byť už viacmenej na konci, takže osobne očakávam jej zavedenie na betu v blízkej dobe. Viacero vecí už o nej bolo spomenutých, takže hodil by sa nejaký source-hub:[BR]Výskum a náklady vylepšovaniaGrafikaBannerPrastaré divy[BR]3. Udalosť[BR]Nasledujúcou udalosťou bude Halloween. A moje nadšenie tento rok asi nebude môcť byť väčšie, keďže poprvýkrát do Elvenaru prichádza Halloweenska udalosť vo veľkom formáte - teda nie ako úkolové rady minulé roky, ale ako veľká, tematická udalosť.[BR]Zároveň to vypadá tak, že nás čaká úplne nová mechanika, v ktorej sa kompletne presunieme z doterajších \"truhlicových\" formátov. Tá bude založená na novej minihre, ktorá bude okrem iného obsahovať aj nové druhy odmien (teda také, ktoré sa doposiaľ v udalostiach neobjavovali).[BR]Hlavná cena sa zrejme tiež pokúša chytať pozornosť, podľa všetkého by mala mať redukovaný počet rôznych produkcií a tým zvýšené tie existujúce. A vzhľadom k tomu, že ide o celkom zaujímavé suroviny / jednotky, budova sa javí tak, že vykazuje celkom veľký potenciál. Jej animácia:[BR][BR]"}, {"91": "Také doufám, že se neplánuje na událost systém další loterie (ty dárky bylo to první co mě napadlo), ale nějaký nový promakanější systém."}, {"31": "Premakanejší bude, hlavne bude hráčov výkon dosť záležať na jeho stratégii, narozdiel od šťastia (na čom stáli asi všetky doterajšie udalosti)."}, {"2": "Tak na ten nový event jsem opravdu zvědaví."}, {"91": "Dosavadní byly sice všechny o náhodě, ale u truhel se dalo vybrat aspoň ty, které nám jsou odměnami nejblíže, a některé vyloženě obejít, zatímco dárková loterie byla čistě o náhodě, a furt se jen míchalo, čímž se dost znemožnil zisk odměn."}, {"88": "Tak to jsem na nový event přímo žádostiva...  "}, {"90": "No, konečně snad zase zajímavý event, který bude radost hrát. Uvidíme. Bylo by to příjemné překvapení."}, {"213": "Eventy mám rád což je vidět i na mém městě a už se těším na tenhle páč vypadá velice zajímavě"}, {"214": "Event vypadá zajímavě, dobrodružství společenství si mohli nechat .)  (asi už se je nikdy nenaučím mít ráda). Co kdyby se nové příspěvky řadily opačně od nejnovějšího? Tento dnes končící event se mi líbil."}, {"172": "Lovec, musis hladat inu strategiu, ved je to hra . Napr. ja mam 11 zbrojnic + 3 mam este na sklade, ktore vylozim neskor (teraz mi miesto zabera 15 setov kniznic). Okrem toho, ze mi vyrabaju orkov (na sklade ich mam 3,3M a aj pri 100% vyrobe strategov v cviciskach, tak to neklesa) a predlzia vyrobu v kasarnach, tabore a cviciskach, tak aby som kazdu chvilu nemusel klikat a vyberat, tak dodavaju aj citiaci tovar a to pomocou pyramidy, ktoru mam len na lv.1 (este nenastal ten cas na jej vylepsenie). Na lv.1 je to len 30% co je denne na 1 zbrojnicu len 960 surovin (pri 11 je to 10560 ), no na lv.30 je to 200% co je na 1 zbrojnicu 6400 surovin (pri 11 je to 70400 a pri 14 je to 89600 surovin/den). Tato hra je maraton a kazdej zmene sa da prisposobit, resp. kazda zmena je nova motivacia a osobne ma to vzdy nakopne a doda novy naboj do hry.[BR][BR]PS: Pozrel som sa k tebe a mas aj pyramidu aj pekny pocet zbrojnic, takze nerozumiem, preco tie pochmurne prispevky "}, {"2": "Na betě je nová událost[BR]získávaní odměn je něco úplně jiného, než jsme zatím měli.[BR]Za dýně kupujete světlo a tím odkrýváte plochu na které nacházítě odměny.[BR]Jsem rád, že si to můžu vyzkoušet nanečisto, nepředpokládám, že nám dají dost zdrojů abychom si mohli dovolit chyby.[BR]Hlavní odměna se mě moc líbí.[BR]Budova 4x4 které dává VBčka a ropuchy, tu bych si postavil rád."}, {"31": "Halloween 2020[BR][BR]Spoiler: Halloween 2020[IMG]https://i.ibb.co/ctQM9vz/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-halloween2020-Banner01-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]Udalosť obsahuje zcela novú mechaniku. Detailné informácie nájdete v nasledujúcich témach: Prehľad udalostiPrehľad nových budov"}, {"206": "Vypadá to velice zajímavě. Zeptám se když odkryjí třeba políčka 3x3 tak si vyberu všechna odkrytá policka nebo jen jednu odměnu?"}, {"16": "@Melindra Odměny můžeš vybírat z těch odkrytých políček, tzn. pokud se v poli 3x3 nachází více odměn, tak můžeš vybrat všechny (ale musí být odkryté (ty, co jsou v mlze a vidíš je, tak odkryté nejsou))."}, {"31": "@Melindra môžeš si vybrať všetky odmeny, ktoré sa nachádzajú na odkrytých políčkach. Závisí teda, koľko odmien sa na nich bude nachádzať, a to už je potom rola nejakej vhodnej stratégie."}, {"3": "taky se těším. Obrázky pěkné, téma super, baráčky šikovné (orkové prostě chybí). Jen těch VBček v odměnách zase ubylo..."}, {"206": "@iDavis Díky za info, když budeš mít čas dej sem pak pár obrázků i z odkrytých políček nebo strategii pro představu. Díky"}]