[{"2": "můj postřeh je takový, že čistíš mapu, kde je rozmístění náhodné, takže můžeš jen objevovat prázdná pole[BR]strategie není o nic důležitější než dřív, náhoda je stále určující[BR]otázkou jen zůstává, jeslti spolu s dobrodrůžem postavím barák"}, {"205": "GorGlin takže je to obdoba stíracího losu, respektive je to převlečený systém náhodného klikání odměn, tak jak to bylo u májového stromu. No jsem na to zvědav. Na betě nehraji, tak se nechám překvapit až to dojde na live servery. Tajně jsem doufal, že bude potřeba zapojit mozek a zapřemýšlet nad strategií."}, {"172": "GorGlin, to ako cistis mapu je velmi dolezite, kedze za kouzelne prisady si kupujes sviecky, lampase a lahvicky s bleskem, to co najdes v stratenych predmetoch je o nahode, ale to ako sa k nim dostanes a za aku cenu, tak tam vies spravnym pouzivanim, tychto troch predmetov dost usetrit a ziskat tak viac moznosti na najdenie dalsich predmetov..."}, {"16": "@prchlik Strategii zvolit můžeš, není to \"klikání na dárečky\". Jiná otázka je, kolik a jakých odměn z toho získáme, zda nám to zase nezkrouhli."}, {"205": "Lovec Krys zatím budu věřit, že do toho nějaká strategie jde vložit. Ale z těch indicií, co jsou zde na foru, to vidím jako \"klikání na dárečky\" akorát to dostalo jiný kabát."}, {"20": "Za mě tedy způsob vybírání odměn nic moc. Je to zase především o náhodě a využití strategie není zase tak velké, jak se první pohled může zdát. Je to jen \"pocit\" že můžu něco ovlivnit, ale upřímně, není toho zase tak moc, protože spoustu překážek v cestě neumožní volit zcela podle libosti. Chápu snahu vývojářů přijít s něčím novým, budiž. Je to prostě změna.[BR]Připomíná mi to kamarádku, která pracovala v supermarketu a tam jim přikazovali často měnit místa vystaveného zboží s důvodem, \"že myši mají vychozené cestičky\" a je potřeba je provést znovu celým obchodem...[smilie--sprite2]"}, {"145": "Normálně jsem z toho \"paf\" vůbec nevím,co se po mě chce, uvalil jsem snad 800 bazmeků a myslím jsem pobral 10 PV a jedno kouzlo,ani nemůžu odkrývat pole, které chci,ale které mi to dovolí,a vlastně všude je nic [smilie--sprite1], mám \"už\" 7/20 z prvního atrefaktu, fakt jsem na toto krátkej, můj mozek se zjevně ubírá jiným směrem, než toho, kdo toto vymýšlel [smilie--sprite1]"}, {"91": "Ludi >> [smilie--sprite8][smilie--sprite8] Dobrý příklad s těmi myšmi, pobavilo."}, {"205": "Tak jsem se díval na video, jak klikat a je jasné, že to je čistá náhoda. Vidím v tom úplně stejnou strategii jako v předchozích eventech, kde jsem si vybíral určitě typy beden, abych došel co nejdál."}, {"31": "Pripravil som video k Halloweenskej udalosti, v ktorom ukazujem ako funguje nová mechanika a vysvetľujem nejaké vhodné stratégie.[BR][BR]Video je nahrané v anglickom jazyku a obsahuje slovenské titulky. Môžete si ich zapnúť v nastaveniach videa.​[BR]Video je taktiež súčasťou prehľadu, v ktorom dopĺňa popisy vysvetľujúce fungovanie jednotlivých častí udalosti."}, {"215": "prosím, napsali by jste mi odkaz jak se přihlásit na beta verzi ?"}, {"16": "V prohlížeči: zz1.elvenar.com[BR]V aplikaci je tuším někde nahoře výběr serveru (zz1)."}, {"72": "Vida, tak nám sebrali i vedlejší odměny z truhel [smilie--sprite1]"}, {"203": "@iDavis - mockrát díky za video. Mám však několik dotazů, neboť můj intelekt mi nedovolil pochopit systém na první dobrou. Co chápu, tak že za body získané za plnění úkolů, příp.za přihlášení nakupuji osvětlovací předměty, které pak používám na mapě k hledání pokladů a kocourů. Za každého osvíceného kocoura se mi automaticky připíše 1 bod na lištu k hlavním cenám. A teď k dotazům - pokud najdu nějaký poklad, tak ho otevřu, bez ohledu na to, jestli se mi případné odměny hodí, protože už mě to nic nestojí? Mohu nějak ovlivnit, které poklady chci najít ( dříve výběr ze tří truhel) ? Nebo jsem odkázán na náhodu, co mi bude stát zrovna v cestě? A denní odměny získávám jak ? Náhodou mi také stojí v cestě nebo je to z těch pokladů? Děkuji za odpověď."}, {"3": "iDavis napsal/a:\t\t\tPripravil som video\t\tKlikněte zde pro zvětšení...super, díky moc. Funguje to přesně tak, jak jsem si představoval. To mě bude bavit.[BR]I když to vypadá, že odměn moc nebude... ale vždyť je stejně až tak nepotřebuju..."}, {"31": "@forthefirst za väčšinu, kocúrov sa ti pripíše jeden. V prípade úplne prvého na tej mape sa mi pripísali dva (neviem či to je od náhody alebo prednastavené).[BR]Áno, otvorenie pokladu nestojí nič. Avšak ak je v hmlistom políčku, ty vieš vidieť obsah aj hmlistých políčok, pokiaľ sa dotýkajú tých, ktoré sú už vyčistené, takže v takom prípade sa vieš rozhodnúť, či ti jeho odmena stojí za to a teda či ho predsa len odkryješ alebo nie. Ako sa objavujú jednotlivé stratené predmety závisí od náhody. Tie stratené predmety sú niečo ako truhly v minulých udalostiach, takže s nejakou pravdepodobnosťou z nich môžeš dostať dennú odmenu."}, {"203": "@iDavis - díky, no přijde mi to docela překombinované a já razím heslo - v jednoduchosti je krása. Takže moje strategie bude jasná - šetřit ty bodíky a někdy koncem eventu je rozfofrovat za lampy a pak nějak proběhnout lesem a pochytat co nejvíc kočiček [smilie--sprite2]"}, {"114": "no, bude si třeba i rozmyslet, nejen kam ta světla pokládat, ale i jaká kupovat, třeba jenom s lucernou na kraji mapy se nedá odkrýt nic, takže asi si hlídat i počet svíček, přijde mi, že jejich spotřeba je nejvyšší, čili nebude záležet jenom na štěstí na odměny, ale k tomu štěstí bude třeba i za další, zvolit tu správnou strategii jak v pokládání, tak i v nákupu, aby se odkrylo těch dárků co nejvíc..., jinak pokud nechám odkrytý, ale nevyzvednutý dárek nebo kočku na mapě a zajede do neviditelné oblasti, automaticky se připíše, tedy není třeba se obávat, že by se o nějaký nevyzvednutý přišlo..."}, {"202": "Já to prostě nepochopila, asi bych potřebovala speciální počítačový kurz. Prosté slovo \"odkrývat políčka\", ale jak? Kliknout na co? nebo posunout ten zdroj světla, odkud a kam? zleva doprava nebo libovolně tak jak tedy? Škoda, konečná budova se mi líbí, ale vůbec netuším, co bych měla dělat, abych jí získala. Video pěkné, ale mě nejde spustit - nebo to neumím - z ručního posunu jsem se nedozvěděla nic. Zdravím Flega."}, {"2": "Mluvíš obecně, nebo máš problém jen na mobilu?"}]