[{"31": "Ak je problém s prehratím videa na fóre, alternatívnou možnosťou je spustenie videa priamo na youtube - odkaz."}, {"145": "[IMG]https://i.ibb.co/C1z6Mvk/https-cz-forum-elvenar-com-index-php-attachments-img-20201004-103129-jpg-4949.jpg[/IMG][BR]No já se dopracoval tady k tomuto stavu,jsem v polovině úkolů a u prvního atrefaktu, video jsem viděl, ale nějak to nemůžu pobrat. "}, {"31": "@flego pozerajúc na obrázok vidím, že sa snažíš čistiť takmer všetky hmlisté políčka. To je zbytočné, pretože väčšina z nich neobsahuje žiadnu odmenu. V tom stĺpci úplne vpravo je vidieť len 2 odmeny (a vidieť ich je preto, lebo dotýkajúce sa políčka si už vyčistil) a teda napríklad čistiť ostatné okrem tých dvoch nemá zmysel. Vo videu od času 2:15 hrám tu minihru a snažím sa posúvať čo najviac doprava, pričom popri tom čistiť len tie políčka, pri ktorých je to buď nevyhnutné, alebo je už vidieť, že skrývajú odmenu. Zhruba si dovolím tvrdiť že na 1 hlavnú cenu by pri dobrej stratégii malo stačiť okolo 500-600 ingrediencií."}, {"145": "iDavis napsal/a:@flego pozerajúc na obrázok vidím, že sa snažíš čistiť takmer ...\t\tKlikněte zde pro zvětšení...No,to bude asi ono,jen jsem trochu natvrdlej , snad to do spuštění live serveru vybrousím, díky..."}, {"202": "Nechápu to obecně, iDavisovi díky za radu, na youtube by to mělo jít, a taky doufám, že při zahájení hry podají nějaké vysvětlení, jak s tím zacházet. Vážně jsem nepochopila, jak \"čistit políčka\", nemyslím strategii, ale nechápu ani technickou stránku věci, jestli to světlo přetáhnout myší na vybrané pole, když se mi tam něco objeví v mlze, jestli na to kliknout nebo ne, ap. Asi mi chybí nějaký závit. Všem děkuji za spoluúčast. "}, {"3": "jak to chápu, políčka jsou tmavá (ve tmě), ta musíš nejdřív projasnit. Na ta projasněná můžeš klást předměty, abys je úplně osvětlila. A teď jde jen o to, jaký předmět použiješ a co chceš osvětlit. Když vidíš, že tam je opar a v něm žádný předmět, nemá smysl osvětlovat a šup dál. Tak samo, pokud tam je předmět, o který nestojíš nebo jen málo neodkrytých políček, která nestojí za to odkrývat (škoda předmětu). [BR]To půjde, hlavně si to dvakrát rozmyslet, ale na druhou stranu se s tím zbytečně nes...ééé... nezlobit "}, {"91": "Celkem zajímavé, ale škoda že ta událost nepřišla tak o měsíc dřív."}, {"2": "pročpak?"}, {"20": "Určitě všichni, kdo hrají na betě, mají výhodu, že si to vyzkouší jaksi nanečisto. Není to zase tak složité, jak to na první pohled vypadá. Jistě, trochu té strategie tam je, ale je to pořád i o náhodě, co se vám v té mlze objeví za odměny. Já osobně beru hlavně kočky. Hlavní cena je po dlouhé době moc pěkná."}, {"202": "@Emhyr var Emreis II[BR]políčka jsou tmavá (ve tmě), ta musíš nejdřív projasnit.[BR]Projasnit čím? Světlem. Asi tak, že vybrané světlo přetáhnu myší na libovolné políčko? [BR]Na ta projasněná můžeš klást předměty, abys je úplně osvětlila... jde jen o to, jaký předmět použiješ [BR]Takže předmět je světlo?[BR]Když vidíš, že tam je opar a v něm žádný předmět ... předmět, o který nestojíš nebo jen málo neodkrytých políček ...[BR]V tom případě je předmět lebka nebo kocour? A to si ty bazmeky musím všechny pamatovat, jaké mají hodnoty? A kolik dostanu kocourů, závisí čistě na náhodě, ne na postupu?[BR]Pak jsou tam ještě nějaké předměty, to jsou asi překážky, že?[BR]Ono to snad půjde metodou pokus-omyl, na myšlení nebude příležitost. Stejně díky za instruktáž - docela pobavila ."}, {"3": "Myslím že z videí je většina těch věcí jasných  hnidopichu "}, {"31": "Dennou odmenou 7. dňa halloweenskej udalosti sú Znepokojivé dýně, čo je jedna z najstarších budov udalostí hry. Prvýkrát sa objavila v úkolovej rade Pán dyní, čo bolo na halloween 2016. Predpokladám, že už pamätá len málokto..  V úkolovej rade sa spolu s ňou nachádzala aj budova Halloweenský skřek, o ktorej zatiaľ neviem, či sa objaví v tejto udalosti, ale pre kompletnosť som ju začlenil do prehľadu tiež."}, {"88": "@iDavis: Nejen, že Znepokojivé dýně pamatuju, ale dokonce je mám dodnes postavené ve městě...   [BR][BR][IMG]https://i.ibb.co/pnp5G4j/https-cz-forum-elvenar-com-index-php-attachments-03-jpg-4956.jpg[/IMG]"}, {"15": " Tak to jsem teda zvědavá , jak to zvládnu . Podle toho videa mně to připadá dost zajímavé a už se na to začínám těšit . Konečně hra , která není stereotypní a zaujme (hlavně mozek -problém!) . Kočky miluju , takže si udělám sbírku \"mňaukadel\" . Všem hodně zdaru v bloudění lesem a nenechte se začarovat před cílem ! "}, {"202": "Už i mě se podařilo spustit video a díky tomu snad už chápu. Projela jsem ho několikrát. Ano, bude možnost zapojit mozek a bude to napínavé. Taky se těším."}, {"31": "Do prehľadu nadchádzajúcej Halloweenskej udalosti som pridal zoznam väčšiny úloh. Zvyšok bude pridaný čoskoro."}, {"10": "Pro mě zatím zajímavá jen FONTÁNA S CHRLIČEM - mana na 2x2. Jinak odměny nezajímavé. Uvidíme, co přinese dalších 11 políček, bral bych alespoň mágy a paladiny, ale ne čety "}, {"31": "Kapitola 17: Obchodníci Unuru [BR][BR]Spoiler: Kapitola 17: Obchodníci Unuru[IMG]https://i.ibb.co/QHKH0kd/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-chapter17-forumann-Unur-Traders2-png.png[/IMG][BR]Na betu dnes prišla 17. kapitola s názvom Obchodníci Unuru. Je súčasťou verzie 1.116, ktorá by sa mala na náš server nahrať o zhruba 2,5 týždňa, takže pre túto chvíľu to môže byť predpokladaný termín.[BR][BR]Kapitola prináša novú surovinu - Unurium, ktorú bude produkovať tržiště od levelu 6. Keďže ale vie produkovať iba jednu surovinu v jednej chvíli, fungovať bude na spôsobe prepínania produkcie medzi semienkami a unuriom.[BR][BR]Kapitola chce byť strategická čo sa týka rozmiestňovania osadníckych budov. Údajne bude pre hráča prínosom, ak aj počas jej priebehu bude budovy prehadzovať, nakoľko sa v priebehu budú meniť požiadavky a zrejme aj dostupné budovy (výskumom budú postupne pribúdať). Osadnícke budovy sú v podstate rôzne druhy lodí, patriace do 3 gildov, celá kapitola je viacmenej pirátskeho charakteru.[BR][BR]Nové divy:[BR][BR][IMG]https://i.ibb.co/RHVSBgQ/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-chapter17-Dragon-Ark-Res-png.png[/IMG][IMG]https://i.ibb.co/JvpbdvT/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-chapter17-Oracle-Of-Fortune-Res2-png.png[/IMG][BR]Prvý div (vľavo) poskytuje živoucí zboží za každú splnenú úlohu hlavnej úkolovej linie kapitoly a spojovací činidlá za každý otvorený tajomný objekt.[BR][BR]Druhý div (vpravo) poskytuje živoucí zboží za každý vyrobený recept a nejaké množstvo královské rekonstrukce každý týždeň.[BR][BR]Rozšírenia - 2 nové za diamanty, 2 z výskumu a 1 za 525 dokončených provincií."}, {"16": "Jo, produkovat buď unurium nebo semena je výborný nápad. Motivuje to hráče mít co nejvíce úrovní divů, aby tržiště stačilo zásobovat oběma surovinami, za což hráč bude spravedlivě potrestán dražšími turnaji a věží.[BR][BR][BR]ps: Kdo by chtěl nějak výrazněji teleportovat pro místo, tak produkce unuria se počítá jinak než produkce semen:[BR][IMG]https://i.ibb.co/q14bv68/https-cz-forum-elvenar-com-index-php-attachments-1602514362370-png-4979.png[/IMG][BR][BR]A tady je náhled na lv 6 tržiště:[BR][IMG]https://i.ibb.co/6gVPhd9/https-cz-forum-elvenar-com-index-php-attachments-1602514415557-png-4980.png[/IMG]"}, {"2": "Co je to otevřený tajemný předmět?"}]