[{"31": "@GorGlin to je ten objekt v magickej akadémii, ktorý otvoríš za 100 oparov."}, {"16": "@GorGlin Bedna z řelmeslné výroby:[BR][IMG]https://i.ibb.co/ykWXG4L/https-cz-forum-elvenar-com-index-php-attachments-1602514854535-png-4981.png[/IMG]"}, {"2": "No, tak tyhle divy jsou divný."}, {"16": "@GorGlin Ber to z té lepší stránky, když tě nic nemotivuje je postavit, nezdražíš si jimi turnaj a věž (stále je dost užitečných divů, které se dají vylepšovat)."}, {"31": "Máme čas prakticky celú 17. kapitolu aby sme si o nových divoch spravili názor. Produkcia semienok bude znížená, bude treba produkovať v tržišti unurium, tým pádom klesne výroba živoucího zboží a hneď tie dodatočné zdroje, bez semienok, naberú veľkú hodnotu. Len je škoda, že sekundárnou výrobou sú činidlá, ktorými som zrovna presiahol počet 1000.."}, {"16": "@iDavis Asi málo vyrábíš. Anebo máš moc knihoven a můžeš pár uschovat do inventáře bez snížení výroby unuria."}, {"31": "@Lovec Krys ja si zámerne nechávam miesto navyše, tzn. že všetkých 12 knižníc ktoré mám momentálne v meste mi poskytujú obyvateľstvo navyše (teda nevyužité)."}, {"188": "Mě by se ten div hodil, neustále mam činidel málo. Moje akademie jede pořád na 100%.[BR]Podle ti co vidím z Idavisova příspěvku se mi nova rasa líbí už teď."}, {"2": "kolik děláš pater věže?"}, {"119": "@GorGlin sice to není otázka na mě, ale já dělám celou věž pravidelně a spojovací činidel mám nedostatek. Ale zatím si je držím cca kolem 50... Bude to to, že hodně craftim.."}, {"16": "Hodně s tím můžou pomoci knihovny, ale jejich počet zase záleží, kolik volného místa může hráč obětovat (on je dost rozdíl mít ve městě 1 set, nebo 5 nebo 10)."}, {"2": "Taky co vyrábíš v akademii.[BR][BR]Nemáte někdo informaci které rasové suroviny budou v nové kapitole s omezením?[BR]Tedy bude možné je získávat pomocí portálových instantů."}, {"16": "[IMG]https://i.ibb.co/sH2KRsQ/https-cz-forum-elvenar-com-index-php-attachments-1602617887514-png-4996.png[/IMG][BR]Jen Elvenarin Zero (vyrábí portál, dle informací od MinMaxe se dá vyrábět z many, semen anebo T6), což znamená, že PP nám ušetří vstupní suroviny pro výrobu Elvenarinu Zero, ale kromě počátečních 5 výzkumů budeme potřebovat osadnické budovy celou kapitolu."}, {"90": "Ledaže to půjde obejít přes portálové kouzlo, protože to vypadá, že ten Elvenarin Zero bude právě to, co kouzlo mohlo dát.[BR][BR]Odstraněna citace. Embla"}, {"16": "@ElfMaGorr: [IMG]https://i.ibb.co/mFkB6g3/https-cz-forum-elvenar-com-index-php-attachments-1602647102095-png-4997.png[/IMG][BR]Vtip je v tom, že takhle nám znemožňují, abychom projeli kapitolu jen s portálem na požehnání (od jisté doby můj nejoblíbenější způsob průchodu kapitolou).[BR]Takže místo toho skončíme na pár měsíců s kupou obřích osadnických budov."}, {"31": "V tejto chvíli naplánovaný termín Halloweenskej udalosti nájdete uvedený v prehľade."}, {"205": "@iDavis budou kouzelné přísady v tajemné truhle?"}, {"16": "Na betě nejsou, předpokládám, že nebudou ani tady."}, {"162": "Nebyl by někde STROM VÝZKUMU pro 17 kapitolu i s náklady? Pro nás co nehrajeme na BETĚ"}, {"31": "@palni je tu. Avšak naposledy som to aktualizoval 26.9., takže je možné, že odvtedy už povznikali nejaké zmeny (i keď zbežným pohľadom som zatiaľ žiadne v porovnaní s betou nenašiel)."}]