[{"31": "Prehľad zajtra začínajúcej Halloweenskej udalosti je v tejto chvíli kompletný, tj. doplnený o všetky úlohy, denné odmeny a ďalšie."}, {"3": "možná jsem to někde minul, ale bude po eventu DSko? nebo zatím nevíme?"}, {"16": "Zatím nevíme (pokud není něco vidět v game files, což může ověřit iDavis a pár dalších hráčů, kteří se v nich hrabou)."}, {"31": "@Emhyr var Emreis II zatiaľ ťažko povedať, v tejto chvíli ešte naplánované nie je."}, {"216": "@iDavis V eventu je rozvíjitelná budova a nevypadá to, že by bylo možné získat všechny artefakty v mlžném lese. Tak nějak jsem předpokládal, že bude možné je doplnit v DS - jako zatím vlastně vždy. Asi tedy chybný předpoklad :-((."}, {"31": "Napokon správny, v tejto chvíli dobrodružstvo na bete naplánované je. A vypadá to byť nejaká nová verzia.."}, {"183": "nevíte někdo prosím kdy tady začne nová rasa---mám ve městě studánky tak jestli skončí dřive než začne nová rasa"}, {"31": "@krix na bete bola súčasťou verzie 1.116, tá by mala prísť na náš server zrejme budúci štvrtok. Takže môže to byť ten predpokladaný termín.."}, {"183": "jo děkuji -nějak budu řešit místo"}, {"2": "Nová verze DSka, jako že nová mapa?[BR]Nebo nějaký větší zásah?"}, {"31": "@GorGlin zrejme nová mapa, zmena spočíva v označení verzie ako mpe_f (teda verzia F), predošlé boli A-E (v niekoľkých posledných dobrodružstvách sme mali iba verziu E)."}, {"66": "@krix Na YouTube už je oficiální video k nové rase, tak asi brzy.[BR]"}, {"11": "dneska jsem si s ní hrál v elvenarchitectu, no moc mi to nevychází otáčet obytky, dílny i zbrojnice..."}, {"16": "Na EN serveru už mají oznámení o nasazení: https://en.forum.elvenar.com/index.php?threads/chapter-17-the-traders-of-unur.13297/#post-82641[BR]Otázka tedy je, zda dostaneme novou kapitolu také dnes anebo EN server bude popředu jako v turnajích."}, {"2": "To bych řekl, že spíš ne, na to už je pozdě."}, {"16": "@GorGlin Už je to vedle oznámeno - u nás až ve čtvrtek."}, {"2": "Tak to je super[BR]Kde je to vedle?"}, {"88": "Ve vedlejší sekci tohoto fóra (základní informace a oznámení)...   [BR]Zde prosím..."}, {"15": "Vypadá to nesporně zajímavě . Až se k tomu doplazím(tak za deset let) , tak už to bude mít vychytaný všechny mouchy . Jsem zvědavá! "}, {"2": "Na betě je oznámení o DSku.[BR]Začne v pondělí 2. Listopadu"}]