[{"31": "Na bete sa začalo celkom nové dobrodružstvo spoločenstiev..[BR]Nové dobrodružstvo spoločenstiev[BR][BR]Spoiler: Nové dobrodružstvo spoločenstievSúčasťou tohto dobrodružstva je nová mapa (konkrétne nazvaná verzia F), ktorá vyžaduje získavanie celkom nových odznakov. Tieto sú potrebné ako na prechod mapami, tak aj v záverečnej bezodnej jame.[BR][BR][IMG]https://i.ibb.co/PcB7LKm/https-i-ibb-co-V2-HQk-Jd-EL-dobrodru-stv-spolo-enstiev-zmeny-2-11-2020-png.png[/IMG][BR]Prehľad nových odznakov:[BR]Ghost in a bottle - Vyrieš 4 turnajové strety ALEBO vyrieš 4 strety vo vežiDruid Staff - Vyrob 1x spojovací činidloArcane Residue - Získaj 15x opar viděníElemental Marbles - Získaj 10 relikviíEnchanted Tiara - Použi 3x ľubovoľné kúzlo[BR]Rovnako došlo aj k zmenám v odmenách:[BR][BR]1. mapa[BR]1x prastará vědomost (15)1x Rozvážková knihovna10x zesilovač (10 min)2. mapa[BR]2x prastará vědomost (20)1x Artefakt Chatrč čarodejnice15x zesilovač (30 min)3. mapa[BR]1x Obří ruské kolo1x Artefakt Chatrč čarodejnice25x zesilovač (45 min)[BR]Mierne navýšené boli aj niektoré odmeny za umiestnenia, konkrétne množstvá získaných zesilovačov.[BR][BR]Zároveň, požiadavky niektorých súčasných odznakov boli pozmenené, konkrétne napríklad požiadavky odznaku predtým vyžadujúceho výrobu vo všetkých troch manufaktúrach (aj tých, ktoré pre hráča nie sú bonusové) sú teraz disjunktívne, takže stačí buď vyrobiť v mramorovej manufakture, ocelovej alebo drevenej.[BR][BR]Spoiler: Detaily zmenených odznakovNáramok - Vyrob nejaké množstvo základného zboží[BR]Náhrdelník - Vyrob 3x produkt základnej manufaktury (24-hodinový)[BR]Socha - Vyrob 2x produkt základnej manufaktury (2-dňový)[BR]Klobúk - Získaj 2x ľubovoľné kúzlo[BR][BR]Pekárske odznaky a odznaky duchov boli zrušené.[BR]Za seba hovorím, že sa mi tieto zmeny veľmi páčia a to najmä kvôli tomu, že požiadavky, ktoré nové odznaky majú, viac testujú hráčske stratégie z toho \"ozajstného\" herného hľadiska, najmä dlhodobého, ako vie hráč preliezť vežou, prebojovať sa turnajom, ako efektívne mu funguje remeselná výroba atď., narozdiel od doterajšieho \"ako veľmi si vie hráč zlikvidovať mesto\". Takže za mňa palec hore.[BR][BR]Táto zmena je údajne jednou zo zmien z dlhodobejšieho plánu vývojárov \"upratať hru\" tak, aby jej funkcie buď to lepšie do hry zapadali, alebo viac odpovedali ostatným funkciám, ktoré sa za roky výrazne zmenili. To sme mohli už vidieť napríklad pri turnajoch, takže teraz prišli na rad dobrodružstvá spoločenstiev."}, {"126": "iDavis napsal/a:\t\t\ttakže stačí buď vyrobiť v mramorovej manufakture, ocelovej alebo drevenej.\t\tKlikněte zde pro zvětšení.......a od té doby se propustí všichni oceláři, polovina dřevorubců a v mramoru se bude makat na 250%... [smilie--sprite8]"}, {"205": "@iDavis díky za zprávu. Vypadá to pěkně, jen jsem zvědav na čísla do mapy. Předmět s 15x oparem vidění bude pravděpodobně pro malá společenství nepřekonatelný problém.[BR]Škoda, že nebyla vyslyšena myšlenka, aby artefakt na třetí mapě byl libovolný dle vlastního výběru hráče. Nějak mi uniká důvod tam dát měsíčního medvěda. Ještě, že ten sklad je nekonečný."}, {"16": "@BiggJOEcz Tam jsou jinačí brzdy, třeba naše oblíbené úkoly na relikvie(10) a opary vidění (15!). Na propast se všemi odznaky už asi každý dlabe.[BR][BR]@prchlik Minimum do 3. mapy je 24 (na modré 2x12 odznaků)"}, {"205": "@Lovec Krys vidím v tom konspirační teorii, jak nás zbavit vojenských jednotek ve velkém. hrajte turnaj, budete mít relikvie, ale zaplatíte vysokou cenu.. [smilie--sprite2]"}, {"172": "...neviem cim som si to zasluzil, ale v poslednej dobe INNO prisposobuje hru mojmu stylu hrania, resp. zlozeniu mesta a pod. Osobne mam ale rozpoltene pocity, kedze dane zmeny prinesu inym hracom tazkosti a pre mna vzdy bolo DS na vedlajsej kolaji...[BR][BR]...len k tej pare, tak osobne otvaram 2 truhlice za tri dni (200 pary), niekedy aj jednu denne..."}, {"2": "No, zajímavé"}, {"31": "Malá aktualizácia môjho príspevku vyššie: Moderátor na bete potvrdil, že artefakt na mesačného medveďa, ktorý je v tejto chvíli v DS na bete je chybou a že čoskoro dôjde k náprave na správny artefakt - Chatrč čarodejnice. Teda bude možné získať 2 artefakty na chatrč čarodejnice."}, {"172": "@iDavis tak to vela hracov potesi, dnes som ziskal svoj 8 artefakt a tak osobne som bol v klude [smilie--sprite1], je velka sanca, ze ich len z eventu nakoniec budem mat 9 a tak, tie co sa ziskaju z DS ostanu v sklade..."}, {"3": "představoval bych si razantnější změny u DSka... no, uvidíme [smilie--sprite1]"}, {"205": "nevím, jak to děláte, ale udělat truhlici za den bez urychlovačů prostě nejde. Zrovna nyní mám v akademii výroby, za které dostanu 2 nebo 3 opary, každá ta výroba je na 3-3,5hodiny. takže 15 oparů za cca. 15hodin, což je prakticky celý den. a dělat jeden předmět celý den, je dost odrazující."}, {"3": "a proč nepoužít urychlovače? [smilie--sprite1] však z věže jich padá..."}, {"205": "Tak zase dojedu na spojovací činidlo. Jinak z té věže toho zase moc nepadá."}, {"3": "po skončení věže (pokud máte zlato) dostaneš 22 5h. Za týden jich tolik nespotřebuješ, takže ti zásoba narůstá. A to nepočítám truhly, které posbíráš při postupu věží... perpetum mobile [smilie--sprite1]"}, {"2": "Já z toho cítím snížení váhy jedince a větší důraz na kolektiv.[BR]Víc cetek bude potřeba aby vyráběli a přizpívali všichni.[BR]Náramky, klobouk, kuličky, duch v lahvi...[BR]Lidi se asi budou víc zamýšlet jak moc můžou klikat za druhé."}, {"213": "no nevím já jich spotřebuji na W ted podstatně víc než jen 22 musím si je přidělávat ještě v akademce abych jich měl dostatek[smilie--sprite1]"}, {"205": "@Emhyr var Emreis II naše společenstvo dělá stříbro, ale to je jedno. Když si to tak propočítávám, tak ani 22kusů 5h nestačí, abych denně dělal bednu. Spotřeba urychlovačů na bednu denně by byla mezi 15-20kusy, záleží , jaké předměty chytneš z hlediska OV (opar vidění). Můžeš klidně dostat v jednom kole předměty, které v součtu dají 7 OV. A s takovou budeš mít problém udělat i těch 15 OV do DS."}, {"214": "Já spotřebuju spoustu urychlovačů na armádu. Doufám, že se tomu půjde nějak vyhnout, to samé ty relikvie. U velkých měst je to dost masakr, protože průzkum trvá tři dny, po tomhle eventu mi došla zásoba provincií."}, {"16": "Kdyby jenom 3 dny. S tím, jak jsou v posledních kapitolách průzkumníci každou druhou až třetí kapitolu, spousta hráčů má průzkum ku nebo i přes 100 hodin."}, {"214": "Přitom z toho vlastně nic není, že? Když už se nedá z průzkumu získat rozšíření.[BR][BR]// Odstraněn nevhodný výraz. Jumala"}]