[{"29": "@iDavis Děkuji za úžasný obrázek, ty budovy vypadají luxusně. Obří, ale nádherný. Už teď se na Elementály těším."}, {"62": "@iDavis přidávám se k @Santerr. Chtěla jsem to rovněž komentovat, ale lépe bych to nenapsala [smilie--sprite1]"}, {"31": "Sneak peek (2/2)[BR][BR]Spoiler: Sneak peek (2/2)Novou rasou Elementálové nás vo výskume bude sprevádzať nové logo.. [smilie--sprite2][BR][BR]"}, {"66": "Tak to si dám líbit [smilie--sprite1]"}, {"61": "no tak už konečně chápu to Elementálové [smilie--sprite8]"}, {"16": "Hlavně to jedno rozšíření z výzkumu bez navýšení rozšíření z provincií je hezké - viz. beta fórum.[BR]No ještě mě to 3,5 kapitoly nemusí trápit. A pak budu buď muset snížit produkci (méně manufaktur) nebo nestavět některé divy.[BR][BR]ps: Anebo prostě zmenším plochu na produkci spřátelených ras. Stejně pak budu na konci výzkumu dávat knížky jen do divů, tak je do nich můžu dávat průběžně a častěji se ve výzkumu sekat na nedostatek produkce spřátelených ras."}, {"59": "Nechám se překvapit. Bylo by divné, kdyby to nebylo složitější než  v předchozích kapitolách [smilie--sprite1] A s tím místem, to je obehraný popěvek typu, \"kup si dia tři sta - přibude Ti místa, kup si dia 10k -stavět budeš kde se dá\" :-  Ale ani tomu se nedivím a nezlobím se, tak už to prostě je a jiné to nebude. Něco přesunu, něco zbourám (čabas setové budovy) a ono to nějak vyjde [smilie--sprite1]"}, {"31": "Robert Rudovous - 2. časť[BR][BR]Spoiler: Robert Rudovous - 2. časť[IMG]https://i.ibb.co/82QjcWp/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-redbeard-Redbeard-Banner04-png.png[/IMG][BR]Predpokladaný termín: 23.1. - 29.1.[BR][BR]Spoiler: ÚlohyCelý prehľad úkolovej rady vrátane odmien nájdete tu.[BR]Odmenou bude Redbeard's Kitchen.[BR][BR][IMG]https://i.ibb.co/yFD9zBL/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-redbeard-Reward01-png.png[/IMG][BR]Elementálové - ďalšie informácie[BR][BR]Spoiler: Elementálové - ďalšie informácieZatiaľ neviem kedy sa na bete objaví táto nová rasa, ale môj odhad je že začiatkom budúceho týždňa. Dnes sa tam začala druhá časť úkolovej rady Robert Rudovous, ktorá sa končí v nedeľu, takže dávalo by to zmysel.[BR][BR]Nová rasa prinesie okrem iných tieto nové budovy:[BR]Portál elementálovSevero-južný kanál - prepájacia \"ulica\"Východo-západný kanál - prepájacia \"ulica\"Manifestation of Air (vzduchu)Manifestation of Fire (ohňa)Manifestation of Earth (zeme)Manifestation of Water (vody)Názvy si netrúfam preložiť celé, predsa len môže byť po zavedení na český server použitý iný ekvivalent a zbytočne by to len mýlilo.[BR][BR][BR][BR][BR]Výskum novej 12. kapitoly umožní vylepšiť základné manufaktury (mramor, oceľ, drevo) na levely 24, 25, 26 a 27. Od levelu 24 údajne stratia tieto manufaktury možnosť 24 a 48 hodinových produkcií. V týchto slotoch sa budú nachádzať nové výroby, 3 a 9 hodinové, nového zboží Sentient goods.[BR][BR]Sentient goods bude nové permanentné zboží. Manufaktura na mramor bude produkovať okrem mramoru Moonstone, manufaktura na ocel Platinum a manufaktura na drevo Elven tree gum. Rovnako ako tomu je pri základnom, vzácnom a magickom zboží, aj tu budeme mať na jeden z nich bonus. Ten bude závisieť od bonusu vášho základného zboží a to nasledovne: ak je vaším zvýšeným základným zbožím mramor, vaše zvýšené sentient zboží bude Platinum. Ak je zvýšená oceľ, bude to Elven tree gum a ak je zvýšené drevo, bude to Moonstone. Dokazuje to nasledovný obrázok:[BR][BR][BR][BR]Sentient zboží, rovnako ako mana, sa bude po určitom čase rozpadať."}, {"59": "@iDavis pak dává smysl to stavění nebonusových manufaktur, otázkou je, kolik a kam až je vyhnat levelově. Jinak moc děkuji za infa. A ještě otázka: \"budou ty nové suroviny obchodovatelně?\" Asi ne a tak bude třeba nebonusové manufaktury na level min. 24. Uff to bude nářez na místo jako hrom."}, {"61": "a to opravdu bude až od 24 levelu? protože jinak ani nebude s kým obchodovat... Navíc, kde se budou brát relikvie? zajímavé"}, {"59": "@Karindian relikvie? No přeci jako vždy [smilie--sprite1], provincie, turnaje, motivace..."}, {"61": "no právě, že provincie mi přijde, že asi těžko, možná jen za dokončenou provincii, ale už ne za střety..."}, {"31": "@pes63 nové suroviny budú obchodovateľné, takže by malo stačiť postaviť navyše jeden druh základnej manufaktury ktorá ti bude produkovať to sentient zboží, na ktoré budeš mať bonus.[BR][BR]@Karindian keďže sentient zboží je súčasťou novej rasy, tak áno až od 24. levelu. A práve preto aby bolo s kým obchodovať sme na túto rasu čakali tak dlho, teda aby sa do nej dostalo už hneď po jej zavedení viac hráčov. [smilie--sprite2]"}, {"59": "@iDavis hm, to by šlo, ale co to video ke stavění těch nebonusových manufaktur?"}, {"61": "no jo, ale kolik máš objevených sousedů, kteří mají ukončenou 11. kapitolu? myslím, že to s tím obchodem nebude snadné. A co ty relikvie? ani turnaj nemůže bejt na ně, když rozhození provincií je dané..."}, {"59": "@Karindian  U nás ve společenství jsme tuším 4 a i nějací sousedé jsou, uvidíme, bude to zábava [smilie--sprite1] a relikvie? Od základních manufaktur mám nejméně 350, ale i víc, tak je to v pohodě."}, {"31": "@pes63 tými nebonusovými manufakturami vo videu myslia manufaktury z pohľadu základného zboží. Ja mám napríklad bonusovú oceľ, takže ja si v 12. kapitole postavím nebonusovú manufakturu na drevo, ktorá mi ale bude produkovať elven tree gum a na to budem mať bonus.[BR][BR]@Karindian ľahké to nebude, bolo viackrát spomenuté že to bude ozajstná výzva. [smilie--sprite2] Čo sa týka relikvií, neviem, niekde sa to už riešilo, ale tým som sa zatiaľ nezaoberal."}, {"59": "@iDavis  aha, díky"}, {"66": "@iDavis Ty kanály se jako mají stavět mezi ulice, tzn. končit a začínat ulicemi?[BR]Tak to absolutně nemam páru, jak to budu stavět.[BR]Snad přijdou nějaké screenshoty a videa z bety."}, {"31": "@Prealiena s istotou neviem povedať ako budú fungovať, domnievam sa ale že to bude ako ulice v predchádzajúcich kapitolách, ktoré spájali portál s osadníckymi manufakturami. Až na ten rozdiel, že teraz nebudú mať veľkosť 1x1, ale aspoň ako podľa obrázku vidím tak 1x3 možno (veľkosť bude 2x6 a 6x2) ."}]