[{"88": "Mimochodem, aktuální průzkum u mne 5 dní a 11 hodin. Cena 12 miliónů peněz ..."}, {"214": "Tak to jste mi to vytmavili "}, {"16": "@Jana.souck Rozšíření z toho je s každou další přidanou kapitolou 1 (o 25 provincií dál), navíc potřebuješ prozkoumané provincie do eventů."}, {"11": "@Emhyr var Emreis II za zlato ve věži jich je 32 nebo 33 ne?"}, {"3": "prchlik napsal/a:@Emhyr var Emreis II naše společenstvo dělá stříbro, ale to je jedno. Když si to tak propočítávám, tak ani 22kusů 5h nestačí, abych denně dělal bednu. Spotřeba urychlovačů na bednu denně by byla mezi 15-20kusy, záleží , jaké předměty chytneš z hlediska OV (opar vidění). Můžeš klidně dostat v jednom kole předměty, které v součtu dají 7 OV. A s takovou budeš mít problém udělat i těch 15 OV do DS.\t\tKlikněte zde pro zvětšení...jo pardon, nějak špatně jsem to přehlídl. Truhlu dnně nedělám. Na to ani nejsou dobré recepty... ale tak 5 za dva týdny jo"}, {"11": "ahoj, nemáte někdo screen obrazovky na PC když je nabídka akce na diamanty za 100% ? Měli jsme malou rozepři."}, {"31": "@voyager-1 myslíš túto?"}, {"11": "nene, myslím ty sloupce na nákup diamantů, když příjde nabídka 100% navíc.[BR]když nahoře kliknu na plus"}, {"88": "Myslím, že mám. Ale musím projít archívní složku.[BR][BR][IMG]https://i.ibb.co/4WkRKRs/https-cz-forum-elvenar-com-index-php-attachments-02-jpg-5065.jpg[/IMG][BR][BR]@voyager-1: Tuhle jsi myslel?"}, {"11": "díky za snahu ,ale tam není ta nabídka 100% navíc"}, {"88": "Tak to bohužel víc nepomůžu..."}, {"72": "Zkrouhli to, pořád nabízejí 100%, ale faktická částka diamantů se snížila.. ale to už je delší dobu, možná rok, jestli ti jde o tohle."}, {"11": "nevím jestli jsi četl u nás chat ale podle mě za 249 peněz stále dostanu 2800 dia, takže to 100% je. Jedině že bych něco minule přehlíd."}, {"126": "Takhle to podle mě nefunguje.[BR]Těch 1400 dia za 249Kč je už se zvýhodněním 12% (1.249 + 12%)   Pokud bude bonus +100%, tak by to mělo být 1.249 + 100%.[BR]Ale možná se pletu, moc to nesleduji"}, {"11": "podle mě se zvýší základ na 2500 a k tomu se připočte zase 12% a to dělá 2800. Tolik jsem vždy dostal,co pamatuju."}, {"172": "@BiggJOEcz praveze funguje, kupis si DIA s tym bonusom napr. 12% 1400 a dostanes 100% bonus s nakupu, cize dalsich 1400..."}, {"175": "ale pozor na mobilu a prohlizeci je to jinak . na mobilu jsou drazsi a nebo mene dia uz si nepamatuju[BR][BR]Edit :Na mobilu dostanes mene diamantu za stejny penize"}, {"119": "A hojky všem, dá se najít někde nová mapa DS z Beta verze? "}, {"205": "Na beta fóru jsem si našel tento odkaz. https://docs.google.com/spreadsheet...9YimGCyr4CJALhX1S0JpuQxk6cFXyA/htmlview#gid=0"}, {"5": "na apce máš nákup dia stejný jako na pc, pouze se ti nazobrazují ty nejvyšší nabídky...nej základní bonus 49% a nákup pak je 38k dia, kdy při 100% bonusu získáš 76k dia, to je max... cena 5049 Kč"}]