[{"3": "GorGlin napsal/a:\t\t\tAle vrátili nám studnu[BR]předělanou, ale je to ona\t\tKlikněte zde pro zvětšení...no, je to hodně slabý odvar studny... 30 dnů, dia s 5 %. 50% šance na prachy a zasoby, dalších 36 % na surovinu... nic moc teda"}, {"203": "ale zase lepší než drátem do oka . Navíc je jen 2x2"}, {"11": "myslím, že starý studně měly taky jen 5% na dia, běžely díl, to je pravda"}, {"31": "Staré studne mali na diamanty šancu 10%, ale ako tu už padlo, lepšie ako nič. Aj keď predpokladám, že úkolová rada je jediné miesto, kde sa nová studňa v tejto udalosti objaví."}, {"203": "@iDavis - nemůžou ji dát jako hlavní denní cenu - to by ji šlo vyhrát třeba 10x , a to není žádoucí"}, {"72": "Trochu mi uniká smysl toho, že je to od události k události horší, vždycky nám něco co dřív bylo seberou.[BR]Kam se na tohle hrabe slavná Cimrmanova flustrační kompozice.[BR][BR]Odstraněny nevhodné výrazy. Embla"}, {"202": "To víš, Elvenar vysychá. Přerostlé osady, splavování půdy do moře, intenzivní výroba - kde byly dříve studny, budou teď malé studánky. Buďme rádi, že nám je ještě nezdanili."}, {"216": "Kdy DS začne na ostrých serverech? Už se proslýchá datum? Bude alespoň týden oddych?"}, {"2": "iDavis už uváděl předpokládaný začátek na 19.11."}, {"216": "@GorGlin díky - nechytil jsem to."}, {"2": "když utrácím klíče, a nechci vybrat všech 16 políček, musím si připlatit za zamíchání 45 klíčů[BR]je to tak že?"}, {"172": "@GorGlin je to tak..."}, {"72": "Ano, všechny ty tři věci co jsou nyní vedle za extra poplatky byly dříve v těch 16ti polích. Vždy a zdarma. Pokrok nezastavíš "}, {"172": "@athlan iba zamiesanie je za 45 klucov, dvojnasobok a lupa je za otvaranie schranok, 15 je za lupu a 17 je za dvojnasobok, pri kazdej otvorenej schranke dostanes bod do oboch..."}, {"16": "Na betě byla dneska upravena sova: (vlevo původní vpravo upravená)[BR][IMG]https://i.ibb.co/CW93fVG/https-cz-forum-elvenar-com-index-php-attachments-1605537942360-png-5126.png[/IMG]"}, {"3": "manu nepotřebuju, ale to ostatní je lákavé... začínám o sově uvažovat..."}, {"2": "no mazec[BR]Ale já mám ohníváka, takže mě na to neutáhnou, to by museli dát platinu[BR]to že dali už druhý barák na měsíční kámen, gumu dává blahovičník, tak si tak říkám, jeslti stav trhu není záměr"}, {"16": "Uvidíme jaké hodnoty tam budou zítra. Dle Marindora jsou hodnoty u many a T4 chybné a budou zítra opraveny. Takže předpokládám, že se vrátíme tam, kde jsme byli (viz. nárůst u efektu krmení vs nárůst u many/T4)."}, {"203": "takhle by to nebylo špatné, to bych si možná i ten event zahrál celý. Takto zatím uvažuji pouze o sběru odměn za přihlášení a klíčů kolem dědiny a poslední den těch zhruba 1200 klíčů rozfofrovat za 3 denní ceny a spoustu dalších blbostí zdarma  "}, {"16": "Tak nová verze Sovy (produkce many o chlup lepší než moje 2 kapitoly staré Žhavé jezírko (na betě), tak se chvilku ohřeje než bude za pár měsíců zase nahrazena něčím lepším):[BR][IMG]https://i.ibb.co/sRv52SF/https-cz-forum-elvenar-com-index-php-attachments-1605602478180-png-5127.png[/IMG]"}]