[{"3": "tak to je slabota. Hlavně, jak zkrouhli ty lidi a kulturu [smilie--sprite3] Navíc to nedává ani VBčko, jak bývalo dobrým zvykem [smilie--sprite3] za krmení to taky nestojí... budu dlouho přemýšlet"}, {"2": "Eventovek bez VBcek je docela dost, jsou tu už od fénixů"}, {"3": "ty další pak vždycky dávaly alespoň kouzla - většinou na úrovni 10 to bylo 3VB do divů. První barák bez VBček byl snad až ten, co dává mágy... (nepočítám medvědy, ti jsou menší a úplně jiní)"}, {"2": "A není trochu zvláštní nepocitat medvědy, když měsíční medvěd je ten nejlepší barák na VBcka který nám dali?"}, {"3": "ale ne přímo [smilie--sprite7][BR][BR]fénixové (bouřný dává 2VB, ale co 2 dny)[BR]stnhg (4VB, taky co 2 dny)[BR]pany (kouzlo 3VB)[BR]medvědi (nic [smilie--sprite2] )[BR]perník (kouzlo 3VB)[BR]valentýn (kouzlo 3VB)[BR]májka (3VB)[BR]nový fénix nevím - toho nemám[BR]golem (nic)[BR]měsíční medvěd (3VB + při krmení až 18 za dva dny)[BR][BR]myslím, že jsem nic nevynechal. Jen většina fénixů a medvědů a golem nedávali VB. Sova bude další [smilie--sprite3]"}, {"11": "nový fenix dává 14 při nakrmení před zahájením výzkumu provincie plus dva za dva dny"}, {"2": "A měsíční medvěd i nenakrmený dává vejvíc VBček na pole"}, {"3": "já jsem mluvil o těch původních třech medvědech [smilie--sprite1] jasně, nový je bombič"}, {"217": "To jo[smilie--sprite1]"}, {"2": "Zase v cechu řešíme platinu.[BR]Nevíte někdo jak to vypadá jinde ve světě?[BR]V jiných zemích případně na betě?"}, {"11": "na Arendyllu je momentálně asi 150 stránek požadavků platiny"}, {"202": "U mě - Winyandor - je to stejné. Začínám živoucí zboží, jakožto majitel svitků mám bonus na pryskyřici, nabízí se jen pryskyřice a měsíční kámen, platiny ani ťuk, samé požadavky. Ono to všechno souvisí, ráda bych se o tom rozepsala, ale na tuhle stránku to nepatří, počkám si, až někdo otevře novou, k danému tématu."}, {"2": "beta mi dnes napsala, že 31. prosince končí podpora flashpayeru a pak se pojeden jen přes HTML5[BR]já používám flashplayer, abych mohl kopírovat text protože to v HTML5 nefunguje[BR]nevíte jeslti to plánují řešit?"}, {"3": "já mám spíš problém, že můj stařičký PC hru na HTML5 už nezvládne..."}, {"31": "@GorGlin u mňa kopírovanie funguje bez problémov, ako vo Flashi tak v HTML5 (používaním klávesovej skratky CTRL+C a CTRL+V)."}, {"2": "tak to u mě nejde text označit, ale na betě už ano, tak snad to pak půjde i na českých serverech"}, {"11": "mě to jde myší označit celou dobu, přejedu myší a dám ctrl+ c ale ve flashi je to samozřejmě jednoduší"}, {"114": "na HTML přejedu text myší a i když se celý text nezačerní, dám Ctrl + C a potom Ctrl + V a text je celý"}, {"2": "zítřejší akce černý pátek[BR]víte o tom někdo něco?[BR]žeby nějaká výzva?[BR]nebo dárek zdarma a pak nabídky pro platící publikum?"}, {"16": "Pokud to bude stejné jako loni, tak dostaneme jednorožce (tentokrát zřejmě 2x2 viz. iDavisovy budovy) a pak budou nabídky.[BR]Já doufám v opakování cyber monday s jeho loňskou 20% na rozšíření."}]