[{"202": "Noční jednorožec [smilie--sprite8]. Ten se teda vydařil! To si určitě postavím."}, {"31": "V tejto chvíli naplánovaný termín udalosti Kouzlo zimy nájdete uvedený v prehľade.[BR][BR]Zároveň som aktualizoval niektoré nové budovy patriace k tejto udalosti v prehľade budov, ktoré dospeli k drobným zmenám v poskytovaných hodnotách (zväčša len zaokrúhľovanie čísel, rádovo v desiatkach až jednotkách). Objavila sa tiež jedna nová budova, ktorá by zrejme ešte mala byť súčasťou tejto udalosti.[BR][BR]Prikladám video k udalosti, v ktorom sa mi vhodným používaním špeciálnych predmetov, ktoré majú v tejto udalosti trochu zmenenú mechaniku, podarilo získať až 15 denných odmien v jeden deň (čo samozrejme nevylučuje fakt, že udalosť je do veľkej miery o náhode, ale určite to ukazuje, že tá náhoda sa dá nejako škálovať).[BR][BR][BR]Video je taktiež súčasťou prehľadu udalosti."}, {"218": "Lovec Krys-a pamatuješ si kdy bylo Cyber Monday?"}, {"16": "V Pondělí hned po Black Friday, takže uvidíme v pondělí.[BR][BR]K eventu - doufám, že bude i čistá mana. Jinak bude moje beta vesnice nucena vyrábět i nadále manu ze 2 kapitol starých Žhavých jezírek."}, {"205": "Pokud bude cyber monday v duchu Black friday, tak se vlastně nejedná o žádný významný slevový den."}, {"2": "Na betě obnovili provincie.[BR]Všechny prozkoumané provincie lze znovu vybojovat se ziskem VBček, run i relikvií.[BR]Opakovaně[BR]myslíte že trénují na Jéžiši?"}, {"31": "Tak zrejme bug (a zjavne znemožnili dokončovať provincie, dokým ho nevyriešia)."}, {"2": "Ano, ted už to nejde."}, {"31": "Na bete sa začínajú testovať...[BR]Nové odmeny vo veži[BR][BR]Spoiler: Nové odmeny vo veži - prehľadNa bete sa testuje nová zostava odmien vo veži, ktorá vypadá v tejto chvíli nasledovne:[BR]Set mesačnej knižnice bude z veže odstránený.Nahradený bude artefaktmi na fénixa, použiteľné na budovy Ohnivý fénix, Bouřný fénix a Zlatý fénix.Do 6. kapitoly budú doterajšie odmeny v podobe portálových bonusov nahradené požehnaniami na zásoby.Nejaké ďalšie odmeny boli pridané do tajomných truhiel: déšť mincí (20%) a příděl zásob (20%) do modrých truhiel, zesilovače (8 hod) do zlatých truhiel a artefakt na fénixe do zlatých a fialových truhiel."}, {"16": "A sebrali nám zbrojíře z prvního bosse (dle Karvestova porovnání).[BR]Vyměním svých 10 fénixích artefaktů (co se mi válejí v inventáři) za zbrojíře.[BR][BR]ps: Beru zpět - zbrojíř tam zůstal, jen jsem se blbě díval."}, {"21": "A co bude s mesicnm setem kterej ma hodne hracu ve meste bude k necemu?"}, {"31": "@indian068 set ako taký sa nemení, len jeho dostupnosť (teda z veže už dostupný nebude).."}, {"94": "A bude v tom pripade vubec nejak dostupny?"}, {"31": "Po zavedení tejto úpravy zrejme nie. Avšak nová veža je implementovaná ako prídavok pod novým id-čkom (konkrétne spire_phoenixartifact), pričom súčasná verzia bude stále uchovaná (spire_a), takže z ich strany je to len otázka \"prepnutia\" naplánovanej veže na nadchádzajúci týždeň. Neznamená to teda, že už by nikdy nemala byť dostupná pôvodná veža (teda tá s pôvodnými odmenami). To tiež znamená, že do budúcna môžu pridať ďalšie \"verzie\" veží, s rôznymi id, takže z ich strany je tam možnosť variability odmien a ich pravidelného obmieňania."}, {"94": "Tak snad to budou stridat pravidelne a pripadne dopni i dalsi artefaky (a idealne i budovy)"}, {"16": "To, že ji uchovají neznamená, že ji zapnou. Kdy naposledy jsme měli DS typ a-d?"}, {"2": "já myslím, že[BR]\"available for a limited time of several weeks\"[BR]zančí, že to bude jen na chvilku[BR]jako artefakty na fénixe?[BR]to nebude na furt ani omylem[BR][BR]Chápu to správně, že ve věži půjde o náhodné zisky z truhel, krysalů se změna netýká[BR]zatímco v turnaji to bude natvrdo?"}, {"16": "O krystalech nebyla řeč. Takže je slušný předpoklad, že nebyly změněny. Uvidíme pozítří, kdy začne nová věž."}, {"11": "mohlo by to ještě v akademii nabízet další ohniváky, třeba do pěti kousků [smilie--sprite1]"}, {"2": "no, bral bych jich pár"}]