[{"203": "No to nezní tak moc špatně, doufám, že se mi ty chybějící 4 fénixové artefakty podaří nějak z věže vyšašit, než to zase zruší  "}, {"11": "abychom nakonec neměli těch artefaktů v inventáři desítky..."}, {"84": "Artefakty ve věži znamenají, že teoreticky mohou fénixe vylepšit na maximum všichni (jistěže záleží na štěstí). Jsem rád, že to vývojáři umožnili, ale hlavně aby za tím nebyl nějaký \"zlý\" úmysl - například další ztížení bojů, které by už bez fénixů nebyly vůbec hratelné, nebo příprava na nehorázné požadavky na suroviny v dalších kapitolách - bouřný i zlatý fénix mají po nakrmení zaměření na produkci surovin... No uvidíme a necháme se překvapit. Doufám, že nějaký artefakt ukořistím.."}, {"2": "@forthefirst [BR]v truhlách z turnaje by měli být pevně dané[BR][BR]@voyager-1 [BR]raději 10 navrh, než aby jeden chyběl"}, {"5": "tím, že se ,,nedostane,, v akademii možnost zisku další základní /kromě oné té jedné/ desky k Fénixovi, je začlenění artefaktů do odměn hezké pro nové hráče, kteří neměli tu možnost je získat a budiž jim přáno, budou Vánoce a opětovné průměrování ostatních, kteří se většinou na nějaký ten artefakt dříve slušně nadřeli..."}, {"20": "Jsem ráda, že hráči v obou mých společenstvích (na CZ1 a CZ2), kteří nemají Fénixe, ho budou mít možnost získat."}, {"203": "@GorGlin - jak to myslíš s tím v truhlách turnaje? Tam snad budou také? Kde to píšou?"}, {"2": "@forthefirst [BR]moc se omlouvám, moje chyba, špatně jsem pochopil oznámení z bety"}, {"219": "Ahoj, mám v inventáři 2 Fénixe z lesních elfů. Když je rozčaruju, budu je mít znova v Akademii?"}, {"11": "pokud to jsou dva různí Fenixové tak by to mělo fungovat."}, {"203": "@SparkySprinkles - v minulém fenixovém a medvědím eventu to fungovalo. Rozčarovat a v rámci eventu se objevovali v akademii. Ale jen v rámci eventu!!! Takže bych si je radši být tebou ještě nechal. Přinejhorším si je postavíš a vylepšíš za KR."}, {"16": "Srovnání odměn ve věži - první patro: (změny orámované zeleně)[BR][IMG]https://i.ibb.co/Sxpwk5c/https-cz-forum-elvenar-com-index-php-attachments-1607872812050-png-5210.png[/IMG]"}, {"16": "Druhé patro: (2. a 3. minibos + Finální bos, zbytek je stejný):[BR][IMG]https://i.ibb.co/5cgxdNc/https-cz-forum-elvenar-com-index-php-attachments-1607875235270-png-5211.png[/IMG][BR][BR]Třetí patro:  (2. a 3. minibos + Finální bos, zbytek je stejný):[BR][IMG]https://i.ibb.co/j3RGRBg/https-cz-forum-elvenar-com-index-php-attachments-1607875284426-png-5212.png[/IMG][BR][BR]Bonusové truhly: (zlatá mi na betě nepadla):[BR][IMG]https://i.ibb.co/fnXWbht/https-cz-forum-elvenar-com-index-php-attachments-1607875311212-png-5213.png[/IMG]"}, {"2": "No, samozřejmě záleží také na tom, jak dlouho budeme tuhle věž mít, ale nějakého enormního přebytků bych se nebál."}, {"206": "Chci se zeptat a základnu phoenixe kdyz nemám, získám z akademie kouzel kdyz bude běžet věž?"}, {"19": "Základna fénixe se v akademii objevuje průběžně, bez ohledu na věž či cokoli jiného. Jde pouze o štěstí."}, {"2": "Všechny setove a levlovaci budovy se tam náhodně objevují dokud je nevyrobis.[BR]Tedy jen ptáci, medvědí a sachy"}, {"5": "Tím pádem, pokud má někdo ,,starou,, základovou desku ve skladu o několik kapitol zpět, je vhodné ji propálit komínem a potom si počkat na novou z Akademie a ušetřit nějakou tu KR."}, {"216": "No, nevadilo by mi mít dva ohniváky."}, {"5": "mne taky ne   ...pokud by dali možnost zisků dalších ,,základových desek,, do Akademie a tou možností zisku artefaktů ve věži, tak by ta města byla samý pták  přepokládám..."}]