[{"3": "třeba v budoucnu ty základové desky pustí do věže... ale pochybuju[BR]nicméně spíš bych potřeboval medvědí artefakt "}, {"31": "V tejto chvíli je prehľad udalosti Kouzlo zimy doplnený o všetky denné odmeny a úlohy.[BR][BR]Zároveň, vzhľadom k prípravám novej skupiny budov, ktoré budú zrejme dostupné v blízkej budúcnosti, som pridal drobnú inováciu do prehľadu speciálních budov - jednotlivé budovy budú mať vo svojej tabuľke nový parameter, zvaný Typ produkcie. Ten bude môcť nadobúdať jednu z nasledovných hodnôt: automatická (pre budovy, ktoré svoju produkciu poskytujú automaticky bez nutnosti jej manuálneho štartu (väčšina budov z udalostí)),manuálna (pre budovy, ktoré poskytujú svoju produkciu ako výber z viacerých možností; príkladom takejto budovy je Obří ruské kolo),prepínateľná (pre budovy, ktorých produkcia funguje ako produkcia semienok / unuria na tržišti lvl 6).Tieto údaje budú aktuálne až pre nové tabuľky v prehľade, teda zrejme počnúc novým rokom."}, {"205": "@Lovec Krys díky za přehled. s mojí štěstěnou budu rád za jeden artefakt za rok. Příkladem budiž kouzelná obytka, která má mít 10% šanci na výhru. Ze všech letošních pokusů ve věži, 51x,  jsem ji dostal jednou."}, {"2": "statistika funguje jen když se počet pokusů blíží nekonečnu"}, {"3": "mě obytky docela padají. Řekl bych, že jsem tak někde na těch 10 %, možná i o něco výš. Zato dílna padla zatím jen jedna. Ale nestěžuju si, džinové padají poctivě"}, {"10": "Kouzelky mi padají ve věži celkem pravidelně, nato že chodím pravidelně jedno patro. Mám jich 12, jednu jsem si z toho koupil i s dílnou jako set k Valentinu  . Ale dílna mi nepadla zatím žádná. Obě jsem si musel koupit. Džin ani ťuk."}, {"5": "...na kouzelnou dílnu se načekáš ... ,, nato že chodím pravidelně jedno patro ,, ...je totiž ve druhém patře, když políbíš toho žabáka a pak ho sejmeš "}, {"16": "@Showstall dílna viz. ElfNostradamus. Džin = finální boss a fialová truhla. Takže při prvním patře jen ta fialová truhla."}, {"205": "GorGlin napsal/a:\t\t\tstatistika funguje jen když se počet pokusů blíží nekonečnu\t\tKlikněte zde pro zvětšení...To je sice pravda, ale pro šanci 10%, je pravděpodobnost, že z 50ti pokusů nedostaneš ani jednu kolem 0,5%. Takže jsem vlastně klikař.  "}, {"2": "jo, na to se soustřed"}, {"2": "Na betě jsem v remeslne výrobě měl májový strom.[BR]Myslel jsem že tam nechali jen ptáky a medvědy, nevíte někdo něco?"}, {"114": "V nabídce by měly být všechny 4 fénixové a májový strom v1.108 - změny v nastavení , o medvědech nic nevím."}, {"2": "Aha, to jsem minul .[BR]Medvědy jsem v řemeslné výrobě udelal"}, {"114": "Medvědy jsi stihl udělat nebo udělal i po té aktualizaci na v1.108?"}, {"2": "To ti nedokážu říct.[BR]Město jsem založil v určitě driv. Ale jak rychle jsem postavil akademii a vyrobil všechny medvědy to netuším."}, {"169": "Ahoj lidi.Jsou nějaký novinky ve světě Elvenar?Nějak utichla komunikačna infrastruktura Jinak vše nejlepší v novém roce přátelé "}, {"16": "Vývojáři mají vánočně-novoroční dovolenou, takže na betě se teď nic nového neděje."}, {"203": "@Lovec Krys - a Lovče, jak jsi na tom ve věži s těma fénix artefaktama? Sype to nebo pouze sporadicky ?  "}, {"31": "U mňa zatiaľ kde nič tu nič (aj keď by sa mi tam zrovna jeden hodil). Na druhej strane, na fóre niekto písal, že sa mu z jednej mapy podarilo dostať až 2 artefakty, takže koniec koncov to neznamená zrejme nič iné než len \"proste náhoda\"."}, {"20": "Já ve Věži na betě zatím dobrý. Ze začátku jsem jí tam nedělala celou, ale 1 artefakt padl. A teď 2x věž celou a v každé mi padly 2 artefakty, takže Fénix už je na 6 lv. Doufám, že to to tak půjde dál."}]