[{"16": "@forthefirst Upřímně - netuším. Mám jich v inventáři 5, ale netuším, kolik jsem jich měl předtím. Jelikož mám ohniváka na 10 již od původního fénixe, tak jsem (ne)přísun artefaktů ani nesledoval (navíc na betě často dávám jenom první patro věže).[BR]Je to samozřejmě o náhodě - bude to fungovat podobně jako s jinými věcmi, co ve veži padají - někomu za 6 týdnů napadá 10 artefaktů a někdo nezíská ani jeden."}, {"2": "Tak to je možné že jsi nedostal ani jeden, protože o od první akce bylo možné získat další.[BR]Myslím že bylo DSko a loni o Velikonocích což by dalo právě těch 5."}, {"20": "Dnes věž na betě - ještě mi chybí 4 střety a bude celá, to udělám později. A další 2 artefakty doma, Fénix na 8 lv.,  a to před změnu odměn z věže byl jen 1. lv. Jen upozorňuji, že v prvním patře to moc nepadá. Prostě to chce 2. patro i 3. patro. Ale kdo Fénixe nemá, bude možné díky věži, až to přijde sem, reálná šance ho postavit."}, {"2": "Na betě je na zítra oznámený začátek DSka"}, {"31": "Najbližšie dobrodružstvo je v tejto chvíli na náš server naplánované na 19.1."}, {"91": "Ve hře již nejsem aktivní, a zatím ani neplánuji nějakou změnu, na druhou stranu jsem rád, že se hra nějakým směrem vyvíjí nejspíš dál, tímto chci pozdravit všechny své známé, známé tváře zde, popř. moderátory tady na diskusích, a chci jim popřát vše nej v novém roce ."}, {"20": "Dnes jsem ve věži na betě získala poslední artefakt a mám Fénixe na 10 lv. Stavěla jsem ho úplně od začátku. Takže kdo ho budete chtít, až tato věc přijde sem, máte možnost, ale chce to hrát pokaždé 3 patra, výjimečně 2. Někdy mi z celé věže padl 1 artefakt, jindy 2."}, {"203": "Super Ludi, gratulace a díky za pozitivní informaci "}, {"139": "ta vez je jak komu...nekteri clenove maji dziny, kouzelne budovy, portalove posilovace, a ja dostanu naradi, sem tam urychlovac, a hafo ulomku.....nespravedlive  na Bete sem Fenixovo rozsireni este nedostala, asi me nemaj radi"}, {"31": "Na bete sa začína...[BR]Karneval 2021[BR][BR]Spoiler: Kouzlo zimy 2020[IMG]https://i.ibb.co/bRzRmCp/https-i-ibb-co-NLRx-J7y-EL-akcia-karneval-2021-banner-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]Všetky detailné informácie o tejto udalosti nájdete v nasledujúcich témach:[BR]Prehľad udalostiPrehľad nových budovVšimnite si, že v prehľade budov je po novom zadaný aj nový atribút, ktorý hovorí o type produkcie danej budovy (tento atribút je samozrejme uvedený iba v prípade, že sa jedná o produkčnú budovu)."}, {"211": "Mno, šišky všude  i nová budova Šiška.    http://prntscr.com/xlp7wn[BR]Ten časovač nad nečinnou MA a dílnama mi tam nesedí..[BR]A jinak asi zajímavá akce pro milovníky dekorací na obměnu pár budov. Speciálka pro nižší levly o ničem (škoda místa), ale jsem zvědav na reakci manařů a semínkářů."}, {"3": "za mě, nic moc. Pokud rozvinutelná budova nedává přímo VB nebo kouzlo 3VB, tak zůstane pravděpodobně v inventáři. Stejně, jako sova..."}, {"172": "@Emhyr var Emreis II nova budova na lv.10 dava vedomost 3 VB[BR][BR]lv.10"}, {"3": "tak v tom případě si pro ni místečko asi udělám "}, {"31": "Za tými pomiešanými ikonkami nad budovami (chyba na bete) sa zrejme skrýva plánované pridanie nových ikoniek, ktoré budú napríklad odlišovať trénované jednotky nad vojenskými budovami alebo zobrazovať vyprodukované požehnání nad budovami s udalostí.[BR][BR]Spoiler[IMG]https://i.ibb.co/yfY0qg0/https-i-ibb-co-Wkn-DYTp-EL-beta-ikonky1-png.png[/IMG][BR][IMG]https://i.ibb.co/5xVBzY3/https-i-ibb-co-3-B3-Lkh-G-EL-beta-ikonky2-png.png[/IMG][BR][BR]A zjavne je pripravené aj zobrazovanie viacerých ikoniek pod sebou na jednej budove, čo to odlišovanie trénovaných jednotiek len potvrdzuje..[BR][BR][IMG]https://i.ibb.co/KL990S7/https-i-ibb-co-RQWPc-Dd-EL-beta-ikonky3-png.png[/IMG]"}, {"2": "Pěkná věcička, už vím kam ji postavim"}, {"220": "Tak to je dobrá zpráva Ludi ,už se pár spoluhráčů ptalo jaká je pravděpodobnost získat artefakty na max. vylepšení."}, {"211": "Další event, kde na mne jak strašák vyskakuje opakovaně úkol bez alternativy - Nakup VB![BR]Hned první úkol řady - 4 VB, po chvilce 8 VB, ...[BR]Tohoto \"krtka\" nemám rád "}, {"3": "mi to nevadí. Sice VB kupuju aktuálně někde kolem 3,5 milionu mincí, nicméně za suroviny jsem nikdy VB prakticky nenakupoval a šetřím si nízké ceny právě na eventy "}, {"2": "Já už mám bod za víc než 4m a kupuji body ta mince[BR]Stejně je musím utrácet aby mi nepretekli[BR]Horší to je ke konci kdy přijdou s nákupem 16 bodu"}]