[{"3": "pravda, ale vždycky se dá zakouzlit..  jinak, já pořád kupuju VB za jednotky, max nižší desítky tisíc ostatních surovin "}, {"11": "mohli by udělat nějakej div na snižování nákladů za nákup jednoho VB a brzdění jeho nárůstu. "}, {"2": "To by byl velmi populární barák"}, {"73": "nákup VB je ještě dobrý, mě spíš vadí úkoly na vylepšení budov na určitý level, když už nemám co vylepšovat nebo vyzkoumání provincie, které mi trvá už skoro 80h a moc urychlovačů nemám :-( Vím, že k těmto úkolům jsou ještě nějaké alternativy, ale ty jsou taky na nic."}, {"16": "@LuciskaCh Možností je vylepšovat dřevěné manufaktury (elfů, nevím, jak je to u lidí), ty jsou 2x1 až do lv 6, takže se dají nacpat na konec vodorovných ulic a dají se s nimi ty úlohy plnit."}, {"2": "já vylepšování budov řeším přes jednorožce a podobné malé kulturkykrálovskou rekonstrukcí je zvednu a je hotovo"}, {"10": "u lidí je to mramor 2x1, ale jen do LVL4"}, {"60": "já zase povyšuji blahovičník a manovec...mám toho v inventáři mraky a mají jen 1 políčko, takže pouze 1 královská rekonstrukce"}, {"3": "škoda každé KR..."}, {"31": "V tejto chvíli naplánovaný termín karnevalovej udalosti nájdete uvedený v prehľade."}, {"202": "Nějak nám z toho rozpisu vypadl Burukbrakův most lásky - to je divný "}, {"31": "@Jirinazel ten v denných odmenách nebude (do prehľadu budov som ho začlenil len preto, lebo pochádza z rovnakej udalosti ako Balkón Gaelagil (Valentín 2017), tak že nech tam je pre kompletnosť).[BR][BR]Do prehľadu karnevalovej udalosti som pridal zoznam všetkých úloh. Prehľad sa tak stal kompletným, teda obsahuje všetky úlohy, odmeny a ďalšie."}, {"73": "Lovec Krys napsal/a:@LuciskaCh Možností je vylepšovat dřevěné manufaktury (elfů, nevím, jak je to u lidí), ty jsou 2x1 až do lv 6, takže se dají nacpat na konec vodorovných ulic a dají se s nimi ty úlohy plnit.\t\tKlikněte zde pro zvětšení...a pokud to chce vylepšení např. na lvl. 16 a výš?"}, {"11": "to už dlouho nechtělo, navíc můžeš navýšenou budovu v dalším úkolu zvednout o jeden lvl a je splněno."}, {"16": "@LuciskaCh Na to už mám nějakou dobu připravené obytky lv15 v inventáři, ale právě kvůli hráčům v nízkých kapitolách to změnili a max. je už delší dobu lv6."}, {"73": "Tím, že nemám co vylepšovat, jsem samozřejmě myslela i to, že nemám místo, kam bych něco dalšího nacpala, co bych mohla vylepšovat (teď tedy ne, teď jsem skončila kapitolu, tak nějaké místo je, ale to se mi stalo snad poprvné za 2 roky). To samé výzkum, když nemám co zkoumat, tak jak to mám udělat... teď jsem se dívala, že alternativa bude např. ...nebo získej 20 oparů + získej asi 16 relikvií. Relikvie taky nejsou takový problém, ale ty opary... A než se tu rozepíšete o tom, že v akademii vyrobím hned, tak pro mě to není hned. Nehraji věž, tak nemám zásoby těch modrých koulí, co na to potřebuju a trvá delší dobu než můžu dát vyrobit něco za víc oparů.[BR]Ale asi nemá cenu to tu už dál řešit, je mi jasné, že každý hru jede jinak a každý na to má samozřejmě jiný názor. Jen jsem přidala poznatek, co konkrétně mě dost zdržuje v eventech, toť vše "}, {"3": "a můžu se zeptat, proč nehraješ věž?"}, {"73": "protože do ní odmítám cpát bonusové suroviny, které potřebuji na výzkum a vylepšování"}, {"3": "a je nějaký důvod se hnát hrou zběsile kupředu, pokud jsi se surovinami na štíru? Není lepší trochu zpomalit, vylepšit infrastrukturu, aby zásoby spíše narůstaly i při (byť pomalejším) průchodu hrou?.[BR]Já jsem snad už od nějaké 4. kapitoly nikdy nebyl se surovinama na nule... vždycky jsem vyráběl víc, než jsem utrácel a to i při hraní turnajů apod. TO, že jsem kapitolu hrál třeba 4 měsíce místo možných dvou jsem nebral na překážku. [BR]Ale záleží, co kdo od hry vlastně chce, pravda. Já už bych si to bez věže představit neuměl. Je to obrovská pomoc po všech směrech"}, {"73": "však já jedu lážo plážo, každou kapitolu dělám cca půl roku minimálně "}]