[{"31": "Na bete bola implementovaná zmena funkcionality znovu objavovania sa správ v pošte - po novom sa to bude vzťahovať iba na tie konverzácie, ktorých je súčasťou iba jeden ďalší člen. Teda hromadné správy na výmenu VB sa po zmazaní opätovne objavovať nebudú."}, {"31": "Aktuálne informácie a novinky[BR][BR]Spoiler: Dobrodružstvá a nové odmeny vo vežiNa bete sa začalo nové kolo dobrodružstiev spoločenstiev (verzia F, teda tá, čo naposledy).[BR][BR]1. mapa[BR]10x zesilovač (10 min)1x Rozvážková knihovna1x prastará vědomost (15)2. mapa[BR]2x prastará vědomost (20)1x Karnevalový artefakt15x zesilovač (30 min)3. mapa[BR]1x Obří ruské kolo1x Karnevalový artefakt25x zesilovač (45 min)[BR]Odmeny za umiestnenie sú rovnaké ako minule.[BR][BR]Ďalšou novinkou je obmena odmien vo veži:[BR]Artefakty na fénixa nahradené artefaktmi na StonehengeBudova Stonehenge pridaná do řemeslnej výrobySet mesačnej knižnice je taktiež pridaný do řemeslnej výroby[BR]V tejto chvíli ešte nie je jasné, či sa nové budovy pridané do craftingu budú objavovať aj hráčom, ktorí ich už v meste / inventári majú. Zároveň sú zrejme všetky tieto zmeny naplánované až po dobehnutí súčasného cyklu s artefaktmi na fénixa.[BR][BR]V neposlednom rade, Innogames plánuje pre rok 2021 spustenie niekoľkých nových titulov, výhradne zameraných na mobilné zariadenia. Na svojom kanáli som pripravil malé prezentačné video."}, {"2": "Takže u vás už se knihovna do věže vubec nevrátí?"}, {"31": "@GorGlin na bete bola medzi fázou artefaktov na fénixa a na stonehenge nejaká doba, kedy bola opäť dostupná knižnica, ale nie je isté že podobný scenár budeme nasledovať aj tu (a vzhľadom k tomu, že sa stane súčasťou craftingu, by som s tým pre istotu ani nepočítal)."}, {"211": "viz. info od iDavis:[BR]Set mesačnej knižnice je taktiež pridaný do řemeslnej výrobyJsem zvědav na četnost výskytu v MA. Jestliže se určité prvky setu nyní množily u hráčů hrajících aktivně Věž, tak dostupností pro všechny dostane trh další řachu. (Že by se něco mělo měnit u parametrů setu nepadla v příspěvku žádná zmínka.)"}, {"16": "@Trumpetka Rozdíl bude pravděpodobně v tom (=moje spekulace), že stejně jako u dalších podobných budov, bude set zřejmě omezen (to nyní nevíme, jen si to myslím) na 1 kus.[BR]Takže pokud je moje spekulace správná, tak výsledek bude takový, že noví hráči budou mít k dispozici max. 1 set knihovny, zatímco staří veteráni budou muset používat KR na jeho vylepšování.[BR]Tzn. problém časem sám zmizí, jak bude ubývat hrajících hráčů, kteří mají více než 1 set (to je na dlouho). (tedy podobně jako hráči, kteří mají k dispozici jeden nebo více starých setů oproti novějším, kteří je již nemají)."}, {"20": "Upřímně, nejlepší by bylo, aby nám časem dali ve věži nový druh setu, který bude dávat zelenou placku a ostatní surky podle bonusu hráče.[BR][BR]Možná už jste si toho všimli, ale jen pro pořádek upozorňuji, že na betě se v hlavním sídle již ukazuje nový druh zboží, který nás čeká od 18. kap. [IMG]https://i.ibb.co/94PW9gq/https-cz-forum-elvenar-com-index-php-attachments-sildo-jpg-5299.jpg[/IMG]"}, {"139": "@Ludi myslis tu zelenou kapicku u relikvie dreva? to je zivouci zbozi, ktere budes delat v manuf. na drevo [smilie--sprite1] tvoje bonusove zakladni zivouci"}, {"221": "jo tohle mas od elementalu pokud mas zakladni zvysenou ocel"}, {"19": "@BaluWizova  ne, je myšlen ten třetí řádek, označen jako \"Ascended goods\"."}, {"16": "@BaluWizova Ludi měla spíše na mysli to, že už tam je přidaná třetí řada pro namyšlené zboží (Ascended goods (T7-9))."}, {"221": "tak to je na apce uz dlouho ne? aspon myslim ted ale na telefonu moc nehraju (myslim zhruba par mesicu)"}, {"31": "@Hexik je to dlho, ale iba prehľad, spolu s nápisom že sa jedná o Ascended goods sa to prvýkrát objavilo až teraz na bete."}, {"20": "@BaluWizova @Hexik:  Samozřejmě jsem chtěla upozornit na 3. řádek: Ascended goods. Na betě jsem v trpaslíkách, ale na live mám ukončenou 17. kapitolu, takže vím, co je to živoucí zboží [smilie--sprite2].[BR]Jistě pro nás není překvapení, že od 18. kapitoly přijde nový druh zboží na manufakturách, dalo se to čekat. Ale zaujalo mě, že už se to objevilo nyní na betě v hlavním sídle tímto způsobem."}, {"139": "@Ludi dik za vysvetleni. Jo toho jsem si nevsimla, tak alespon vime ze nas jeste nejake dalsi zabavne rasy cekaji [smilie--sprite1]"}, {"221": "tak to uz asi pripravuji nejspis s tim maji vic prace no pak jsem si toho taky nakonec vsimla na ty bete na prohlizeci jinak tak daleko nejsem tepve v pristi kapitole to rozjedu a vim ze je tu spousta hracu co uz v te fazi jsou"}, {"2": "Počkám na DSko a začnu stavět poslední manufaktury."}, {"84": "Já už mám poslední manufaktury v inventáři, postavil jsem je v rámci čekací doby na tuto kapitolu. Zbývá mi jen dotáhnout poslední manufakturu (T9) z 27 na 31.."}, {"11": "@karhol , myslíš T6 že..[BR]a ví se vlastně jak to bude  se surovinama T7-T9 ? Budou v nový kapitole? Ted je vhodná doba si budovy připravit."}, {"84": "Myslím T7-T9. Mluví se o tom, že by od příští kapitoly mohla být zavedena T7. Před Unurama jsem měl čas, tak jsem si T7-T9 připravil a mám je v inventáři. Až vylepším všechny T3 a T6, vrhnu se na T9. T7 a T8 už mám v inventáři připravené na lvl 31."}]