[{"27": "Má to různé lvly ano, asi to chtěl ukázat i jiným hráčům ale má minimálně každou 3. a 4. lvl včetně náměstí, zbytek 1. a 2. lvly."}, {"2": "Thespia napsal/a:@Jonik Nebo pokud máte někdo info o tom jak to zatím na betě s tím automatem po úpravě vypadá, tak sem s tím Klikněte zde pro zvětšení...[BR]Co je s automatem? To mi nějak uniko."}, {"28": "Ve verzi 1.23 by měla dostat update i umělá inteligence v boji a měla by být mnohem chytřejší. Mělo by to mít vliv jak na nepřátelské jednotky, tak na tvoje vlastní při použití automatu. Jak to ale ve finále vypadá, to nevím, na betě nehraji "}, {"27": "Myslím , že to brzy zjistíme už i u nás, pokud jde překlad a přípravy dobře, mozná už příští týden nebo ten týden následující, takže kdo si počká ten se dočká, není kam spěchat "}, {"30": "Řekla bych po prohlídce měst hráčů na betě co jsou v době draků, že se jim moc dobře nevede. Ukázky jsou pouze od jednoho hráče ,který investoval ,takže si zřejmě může dovolit ubourat domy a  kulturu a tím vytvořit prostor, obrovský prostor. Má spoustu budov za diamanty co dávají hodně kultury a šneky. Našla jsem manufaktury na křišťál ,které se zvětší u jedné hráčky. Spousta hráčů na betě těch předních co investovali už nehraje. Probírá se na forum bojový systém , opět . Grafika nových budov se mi jeví více propracovaná a je pěkná ,ovšem nevím k čemu mi to je, když to nemám kam postavit. Momentálně mám přesně město vypočítané na lidi i kulturu a manufaktury , které potřebuji. Divy do kterých jsem investovala body,některé již 11.lv . Vzhledem k tomu, že v celém výzkumu jsou pouze dvě rozšíření a zbytek budu muset získávat přes provincie , můj odhad nyní je 8.měsíců než získám řadu rozšíření a budu moc stavět aniž bych ničila co jsem vybudovala. Protože bourat manufaktury nehodlám . Možná zbrojnice, ale pak je zase opět stavět od píky je docela na hlavu. Nevím co je záměrem a jaké budou další kroky,ale představa, že vystavím krásné budovy u elfů dračí a magické a tím zruším pomalu celé město skrze jeden výzkum , kde se u mne pouze ohřejí jako jiní osadníci je divná. Kdyby aspoň člověk věděl, že mu zůstanou ve městě po delší čas. Pokud jste měli problémy umístit předešlé manufaktury u orků teď u draků je to tedy pořádný para ořech ."}, {"26": "Thespia napsal/a:\t\t\tVe verzi 1.23 by měla dostat update i umělá inteligence v boji a měla by být mnohem chytřejší.\t\tKlikněte zde pro zvětšení...No, teď mě tak napadlo. A jak k tomu přijdou ti chudáci, kterým nejde bojovat už teď? Vždyť oni proti sobě budou mít nepřítele, který má nejen početní převahu, ale dokonce i něco jako mozek. To zase bude ... [BR][BR]woody69 napsal/a:\t\t\tPokud jste měli problémy umístit předešlé manufaktury u orků teď u draků je to tedy pořádný para ořech .\t\tKlikněte zde pro zvětšení...U mne naštěstí problém nenastal, vše se mi zatím vlezlo přesně na kostičku  Takže mám do budoucna alespoň nějakou naději, díky "}, {"29": "woody69 napsal/a:\t\t\tŘekla bych po prohlídce měst hráčů na betě co jsou v době draků, že se jim moc dobře nevede. Ukázky jsou pouze od jednoho hráče ,který investoval ,takže si zřejmě může dovolit ubourat domy a  kulturu a tím vytvořit prostor, obrovský prostor.\t\tKlikněte zde pro zvětšení...[BR]Prostor bude hodně velký problém, jen to jejich náměstí zabere v podstatě 4 rozšíření... "}, {"26": "A ty budovy se asi budou muset nacpat kolem toho náměstí, že? To aby jsme si vykuchali střed plochy a zbytek domečků oplácali nějak dokola."}, {"27": "Budovy draků a čarodějů jsou zabarveny fialově a zdá se mi to jako jedno z nejlepších řešení i vzhledem k rekrutování čarodějů. Samozřejmě pokud není jiná možnost, tak školy dát jen po dvou kusech. Jinak je to dobré hodit vše do rohu a ostatní budovy naházet do toho výřezu a potom okolo. Berte to prosím jenom jako inspiraci, nikomu necpu jak by měl město stavět a jedná se čistě o uložení budov nové rasy kolem náměstí. Snad to někomu pomuže se rozhodnout, pokud to takhle uvidí na vlastní oči.[BR]Spoiler[IMG]https://i.ibb.co/L6MRXVw/https-cz-forum-elvenar-com-index-php-attachments-screenshot-1-png-1349.png[/IMG][BR]//Obrázek schován do spoileru, Iddun"}, {"30": "Santerr večer ti sem hodím nejnovější screen jeho města jestli chceš , škoda, že nemůžeš vidět tady ten pohyb postaviček a tak , ruka kostlivce mává , fakt je to moc pěkně . Docela by se mi líbilo to mít už na věky ve městě ."}, {"27": "Jo jo Miciah se číní jen co je pravda a koukám, že rozšiřuje pole působnosti na 4 čarodějné školy z každého druhu... šikula. [BR][BR]A je k vidění první kulturní budova nové rasy :[BR][BR](Arcane Library)[BR]Spoiler[IMG]https://i.ibb.co/PhwvZ3Q/https-cz-forum-elvenar-com-index-php-attachments-screenshot-1-png-1373.png[/IMG]"}, {"29": "Nibelion napsal/a:\t\t\tJinak je to dobré hodit vše do rohu a ostatní budovy naházet do toho výřezu a potom okolo. Berte to prosím jenom jako inspiraci, nikomu necpu jak by měl město stavět a jedná se čistě o uložení budov nové rasy kolem náměstí.\t\tKlikněte zde pro zvětšení...[BR]To je sice pravda, ale o dost se zvětší i ostatní budovy, pokud se nepletu, myslím tím dílny, obytné budovy a další...[BR][BR]woody69 napsal/a:\t\t\tSanterr večer ti sem hodím nejnovější screen jeho města jestli chceš , škoda, že nemůžeš vidět tady ten pohyb postaviček a tak , ruka kostlivce mává , fakt je to moc pěkně . Docela by se mi líbilo to mít už na věky ve městě .\t\tKlikněte zde pro zvětšení...[BR]To budeš moc hodná, na pohyb postaviček si holt počkám, až to bude u nás a budu se moct chodit kochat k hráčům tady. "}, {"30": "Tak kočko , máš zde jeho celé město pro představu a pak jen osadníky jak se mu hezky rozrostly,myslím budovy obří dračí  .[BR]SpoilerSpoiler[BR]//Obrázky schovány do spoileru, Iddun"}, {"2": "Já na betě jsem a testuju krom jiného teorii poslušného klikače.[BR]Jsem na konci 4 kapitoly a aby mě pustili do páté, musím získat ještě 6 provincií.[BR]Ted jsem v křištálové a automat dost zklamal.[BR]Což s ohledem na to, že mám všechna rozšíření oddílu která pro danou situaci jde získat mě trochu zklamalo.[BR]Při prohlídce prozkoumaných provincií jsem si spočetl, že i když držím hubu a krok, musím se potýkat s přesilou.[BR]Takže pokud vezmu v potaz, že obě armády můžou lépe využít svých výhod, viděl bych to s automatem dost zle, protože nepřítel bude mít většinou navrch početně.[BR]Ty rozpočty, že v prvním kole turnaje bude soupeře 85% tebe, v druhém kole 100% a tak dál jsou jen řeči.[BR]Čím větší je počet jednotek, tím je celá armáda silnější.[BR]A zatímco v druhém kole, kdy by měla být síla armád stejná, je soupeř se 4  oddíli ve dvouprocentní nevýhodě, tak soupeř s osmi jednotkemi je v 15% výhodě. A hádejte kolik jednotek človět potká spíš...[BR]Takže celé mi to vychází, že ti poctiví klikači ručního boje to budou mít složitější, zatímco ti co používají v automat neuhrajou už skorem nic.[BR]Jestli se UI zlepšila nemůžu posoudit, ale určiět bych si od toho nesliboval přínos pro hráče využívající automat.[BR][BR]Já jsem narazil na jinou věc.[BR]Kultura přestala s eventy být určujícím faktorem.[BR]Kdo se eventu patřičně věnoval má rozumnou zásobu kultury případně populace a nemusí se tím moc trápit.[BR]S Wood elfi přišla nová manýra, kulturní budovy musí být napojené na cesty a produkují manu.[BR]Vlastně to není problém, výzkum poskytne hned z kraje velmi dobrou alternativu, kterou lze stávající kulturní budovy nahradit.[BR]Ale u draků dochází k rozdělení, manu produkují jen některé budovy, jejich prodikce many je lepší proti WE, ale kulturně nejsou tak hodnotné. To je částečně vyváženo budovami, které poskytují jen kulturu, ale razantně víc.[BR]Ale k těm se hráč dostane až mnohem později."}, {"33": "Nibelion napsal/a:\t\t\tBudovy draků a čarodějů jsou zabarveny fialově a zdá se mi to jako jedno z nejlepších řešení i vzhledem k rekrutování čarodějů. Samozřejmě pokud není jiná možnost, tak školy dát jen po dvou kusech. Jinak je to dobré hodit vše do rohu a ostatní budovy naházet do toho výřezu a potom okolo. Berte to prosím jenom jako inspiraci, nikomu necpu jak by měl město stavět a jedná se čistě o uložení budov nové rasy kolem náměstí. Snad to někomu pomuže se rozhodnout, pokud to takhle uvidí na vlastní oči.\t\tKlikněte zde pro zvětšení...Koukám že se mění i rozměr budov jako je tržiště, dělnická chatrč a obchodní akademie, ( v obrázku 4x4, 2x3 a 5x4) nebo to je nějaký omyl?"}, {"2": "nevšiml jsem si změny chatrče ani tržiště a co je obchodní akademie?"}, {"27": "Trokavec: to bude pravděpodobně způsobeno tím , že ja hraji za lidi a ty za elfy. Tyto budovy se rozlohou nepatrně liší. Proto jsem tak nějak psal ať se lidé dívají na fialovou část, která je pro všechny stejná.[BR][BR]Santerr: ty budovy se zase tolik nemění a kde jedna budova naroste, druhá určitý počet čtverečků ztratí a třetí zůstane stejná, místa je teoreticky dost jenom si ho musíme otevřít, v tom já vidím asi největší kámen úrazu, protože valná většina hráčů prostě nemá jak. Bohužel né každý může nebo chce do hry vrážet peníze za diamanty."}, {"33": "To mi nedošlo  , že to jsou lidský budovy. To jsem celej já[BR][BR]Myslel jsem Akademii kouzel "}, {"27": "Miciah nám otevírá nové a nové budovy nové rasy, tak tady je tedy máme, tentorát ne-premiová obytná budova lvl 24, další kulturní budova (Seal of Ansgard) a nakonec několik úrovní zbrojnice:[BR][BR]Spoiler[IMG]https://i.ibb.co/SQfpZNL/https-cz-forum-elvenar-com-index-php-attachments-screenshot-3-png-1390.png[/IMG][BR]Spoiler[IMG]https://i.ibb.co/JHSJJMH/https-cz-forum-elvenar-com-index-php-attachments-screenshot-2-png-1391.png[/IMG]"}, {"2": "Provedl jsem nějaké další testy boje a tedy doufám, že jejich vylepšení dojdou razantních změn a ne že to pustí i sem.[BR]Hra by byla tak dokonalá, že bych to asi neunesl."}]