[{"16": "No obchod, [BR]ve svém odkrytém okolí i v alianci jsem nejvyspělejší. Jen jeden další odkrytý hráč je v kapitole orků jako já. Ostatní nejaktivnější z okolí i aliance jsou o 1-2 kapitoly pozadu.[BR]Nejbližší hráč, který je dál než já je kolem 25 polí daleko. Takže pojedu evidentně na výrobu neboostnutých T4 (asi bude zajímavé sledovat, co mi bude chybět více, jestli T4 suroviny, mana nebo semena (no já vím, že to bude místo -  s tím jedním rozšířením to bude na palici, tak snad ještě budu mít aspoň rezervu v provinciích, až se k elementálům prokoušu - snad je nenapadne přidat T4 do provincií po vzoru orků a nejlíp do vzdálenosti a množství, aby výkup provincie trval týdny)).[BR][BR]S místem to už asi mám vymyšlené. Přinejmenším nebudu stavět některé divy, které jsem původně chtěl stavět a které by mi urychlily spřátelené rasy a divy na manu taky asi ne. Sice mi to zpomalí vývoj, ale na konci mě stejně čeká mnoho měsíců házení knih do divů, takže knížky do divů budu házet průběžně. [BR]Není místo, nebudou holt divy.[BR][BR]Ad relikvie pro T4 - já už jsem přestal vyrábět kouzla, akademie kouzel pojede nyní jen při úkolech do eventů."}, {"31": "Na betu dorazili...[BR]Elementálové[BR][BR]Spoiler: Elementálové[IMG]https://i.ibb.co/rpFh3bY/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-elementals-Banner01-png.png[/IMG][BR]Na betu dnes dorazila zatiaľ najdlhšie očakávaná rasa - Elementálové.[BR][BR]To, že prinášajú nový typ permanentného zboží som spomenul už tu, kde som aj vysvetlil, ako bude fungovať.[BR]Nové zboží bude obchodovateľné, avšak budeme musieť opäť vylepšiť tržište, čo nám sprístupní výskum 12. kapitoly.[BR][BR]Ako každá iná rasa nám aj Elementálové prinesú 2 nové prastaré divy:[BR][BR][IMG]https://i.ibb.co/SfP5VGH/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-elementals-AW01res-png.png[/IMG][BR][IMG]https://i.ibb.co/pdg1LBH/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-elementals-AW02res-png.png[/IMG][BR][BR]Otázkou je, kedy sa objavia u nás. Na bete sú súčasťou verzie 1.47 a tá by sa u nás mala objaviť takto vo štvrtok o 3 týždne. Tak uvidíme či to bude pravda. [BR][BR]Čo za informácie sa doteraz objavilo o Elementáloch v tejto téme:[BR]Sneak peek (1/2)[BR]Video s informáciami o fungovaní manufaktur[BR]Sneak peek (2/2)[BR]Elementálové - ďalšie informácie[BR][BR]Začiatok výskumu:[BR][BR]"}, {"43": "iDavis,díky za skvělé info.Ještě pár výzkumů u pulčíků a budu mít hotovo,tak by to mohlo být akorát.Jen si pak chci trochu přeformulovat město až bude plac po pulčících...Už se těším na novou rasu,vypadá to pěkně a nový typ zboží a vylepšení tržiště se mi líbí,tak uvidíme..."}, {"62": "Vypadá to krásně a já jsem teprve u Orků a goblinů...chjo... No, budu se mít dlouho na co těšit. Mezitím mi to ještě zpříjemní Lesní elfové "}, {"2": "Papap:[BR]jsem moc zvědav jak ti půjde přechod, protože ceny v průzkumu jsou děsivé.[BR]Manu utrácíš po statisících, séměn po dsetitisících[BR]fákt mazec"}, {"29": "Mám čelist až u země... ty jejich divy jsou nádherný! Už se těším, až se budu chodit u nás kochat do měst hráčů z top 10. "}, {"43": "GorGlin napsal/a:\t\t\tPapap:[BR]jsem moc zvědav jak ti půjde přechod, protože ceny v průzkumu jsou děsivé.[BR]Manu utrácíš po statisících, séměn po dsetitisících[BR]fákt mazec\t\tKlikněte zde pro zvětšení... No jó no,tak už je hra v této části vyspělá a hráči co zde jsou s tím musí počítat,tak nemůže být vše zadara a neni kam spěchat... já si sem tam rád užívám krásy města a prohlížím si grafické detaili,tak aspoň budu mít na to čas.  Každopádně budovy a ty nové věci se mi líbí a jak to pak bude praktické se uvidí,až to bude ve hře,jelikož dříve se k tomu nedostanu."}, {"66": "Apropó divy.[BR]Nemohu to vydržet a musím se s vámi podělit o to, co jsem vyčetla z diskuze na beta fórum (odkaz byl v popisku videa na YouTube).[BR]Zmiňují 2 jména:[BR]Sunset Towers - dodává božská semínka v truhlách s odměnou za sousedskou výpomoc, redukuje degradaci (rozpad) božských semínek[BR]Victory Springs - prý fungují podobně jako Jehly bouře, zrychlují výrobu ve Cvičišti (konečně na to nějaký div máme ) a zvyšují sílu lehkooděnců[BR][BR]Na přesné údaje o množství snad aktualizují wiki."}, {"74": "Tak to by se pak měly upravit i Eventy.... když přijdeme o možnost ve stávajících budovách vyrábět 24/48h produkci.... pokud ne, tak se bude muset stavět několik budov 1lvl navíc.... "}, {"75": "iDavis napsal/a:Robert Rudovous - 2. časť[BR][BR]Spoiler: Robert Rudovous - 2. časť[IMG]https://i.ibb.co/82QjcWp/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-redbeard-Redbeard-Banner04-png.png[/IMG][BR]Predpokladaný termín: 23.1. - 29.1.[BR][BR]Spoiler: Úlohy1. Vyrob 5x nápoje[BR]2. Presuň 1 budovu[BR]3. Získaj nejaké množstvo mramoru[BR]4. Získaj nejaké množstvo ocele[BR]5. Získaj nejaké množstvo dreva[BR]6. Vyrob 2x mramorová mozaika + vyrob 2x cenný prsten + vyrob 2x dřevěné figurky[BR]7. Vyrob 1x okrasné sloupoví + vyrob 1x válečná maska + vyrob 1x dřevěná truhla[BR]8. Získaj nejaké množstvo mramoru[BR]9. Získaj nejaké množstvo ocele[BR]10. Získaj nejaké množstvo dreva[BR]11. Vyrob 50x nápoje[BR]12. Vyrob 30x chlieb[BR]13. Vyrob 10x košík jídla[BR]...[BR]Odmenou bude Redbeard's Kitchen.[BR][BR][IMG]https://i.ibb.co/yFD9zBL/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-redbeard-Reward01-png.png[/IMG][BR]Elementálové - ďalšie informácie[BR][BR]Spoiler: Elementálové - ďalšie informácieZatiaľ neviem kedy sa na bete objaví táto nová rasa, ale môj odhad je že začiatkom budúceho týždňa. Dnes sa tam začala druhá časť úkolovej rady Robert Rudovous, ktorá sa končí v nedeľu, takže dávalo by to zmysel.[BR][BR]Nová rasa prinesie okrem iných tieto nové budovy:[BR]Portál elementálovSevero-južný kanál - prepájacia \"ulica\"Východo-západný kanál - prepájacia \"ulica\"Manifestation of Air (vzduchu)Manifestation of Fire (ohňa)Manifestation of Earth (zeme)Manifestation of Water (vody)Názvy si netrúfam preložiť celé, predsa len môže byť po zavedení na český server použitý iný ekvivalent a zbytočne by to len mýlilo.[BR][BR][BR][BR][BR]Výskum novej 12. kapitoly umožní vylepšiť základné manufaktury (mramor, oceľ, drevo) na levely 24, 25, 26 a 27. Od levelu 24 údajne stratia tieto manufaktury možnosť 24 a 48 hodinových produkcií. V týchto slotoch sa budú nachádzať nové výroby, 3 a 9 hodinové, nového zboží Sentient goods.[BR][BR]Sentient goods bude nové permanentné zboží. Manufaktura na mramor bude produkovať okrem mramoru Moonstone, manufaktura na ocel Platinum a manufaktura na drevo Elven tree gum. Rovnako ako tomu je pri základnom, vzácnom a magickom zboží, aj tu budeme mať na jeden z nich bonus. Ten bude závisieť od bonusu vášho základného zboží a to nasledovne: ak je vaším zvýšeným základným zbožím mramor, vaše zvýšené sentient zboží bude Platinum. Ak je zvýšená oceľ, bude to Elven tree gum a ak je zvýšené drevo, bude to Moonstone. Dokazuje to nasledovný obrázok:[BR][BR][BR][BR]Sentient zboží, rovnako ako mana, sa bude po určitom čase rozpadať.Klikněte zde pro zvětšení...[BR]Vidím jen úkoly 1-13,to asi není vše?Ale rozhodně díky!!! [BR][BR]//Příspěvky spojeny. Forseti."}, {"31": "Úloh bude 26 a práve som pridal aj tie ostatné. "}, {"28": "@Silversnake Na betě se k tomu vyjádřili, že úkoly na 24 hod. a 48 hod. výrobu zůstanou. Můžeš si prý ponechat nějaké manufaktury na lvl 23 nebo si kvůli těmto úkolům vždy vystavět nové manufaktury na menším lvl.[BR][BR]Celkem mě s tím zrušením jednodenní výroby naštvali. Jedu jen na jednodenní výroby, na častější sbírání se k tomu nedostanu. A víc manufaktur mít určitě nezvládnu, když mám mít ještě i manufaktury na mramor. Takže se obávám, že mě čeká zpomalení  No uvidíme...[BR][BR]Celý strom výzkumu, viz spoiler.[BR]Spoiler: Výzkum[IMG]https://i.ibb.co/YcywHDf/https-cz-forum-elvenar-com-index-php-attachments-upload-2018-1-19-16-53-7-png-1997.png[/IMG][BR][IMG]https://i.ibb.co/XzfCLPz/https-cz-forum-elvenar-com-index-php-attachments-upload-2018-1-19-16-54-5-png-1998.png[/IMG][BR]Jinak více infa k nové rase můžete už čerpat i tady: https://www.gamersgemsofknowledge.com/elementals-preview"}, {"28": "Na betě se začne v úterý testovat další dobrodružství pro společenství. Přinese pár změn, viz spoiler.[BR]Spoiler- budou nové dobrodružné předměty (Wand, Magic Potion a Witch Hat) - blíže zatím nespecifikované[BR]- budou nové odměny (požehnání na VB)[BR]- bude nový blokovací systém (pokud opustíte nebo se připojíte ke společenství během kola dobrodružství, ztratíte svůj pokrok a nebudete moci dostat odměny)[BR]- budou nové odměňovací mechanismy[BR]- systém questů prozatím zůstává, ale odpadnou zbytečná potvrzovací okna při odmítání úkolů (uvedli, že feedback ohledně otravnosti točení questů vyslyšeli a pracují na tom, ale bude to ještě dlouho trvat než ke změně dojde)"}, {"29": "Budovy vypadají nádherně, ale vůbec netuším, kde na ně máme vzít to místo..."}, {"2": "Po vyšmírování všech základních manufaktur jsem rozpolcen.[BR]Doufal jsem že Ocelový poblijon mi z města zmizí.[BR]Zklamání[BR]S novou surovinou ale získám epesráder dřevěný vír.[BR]Nadšení[BR][BR]Člověk nemůže mít všechno, takže suma sumárum se moc těším."}, {"31": "Elementálové - obrázky niektorých budov[BR][BR]Spoiler: Elementálové - grafika budovPrinášam pár obrázkov budov z novej rasy z miest hráčov na bete. [BR][BR]Kouzelná obytná budova - level 12[BR][IMG]https://i.ibb.co/rMFSpfy/https-i-imgur-com-d-Kl-RSh-Q-png.png[/IMG][BR][BR]Kouzelná dílna - level 12[BR][IMG]https://i.ibb.co/yshvv8W/https-i-imgur-com-sxguha-T-png.png[/IMG][BR][BR]Manufaktura na mramor - level 24[BR][IMG]https://i.ibb.co/Jkvxjng/https-i-imgur-com-JGcsx-OX-png.png[/IMG][BR][BR]Manufaktura na ocel - level 24[BR][IMG]https://i.ibb.co/wyh1Lwn/https-i-imgur-com-t-YIwie-Z-png.png[/IMG][BR][BR]Manufaktura na drevo - level 24[BR][IMG]https://i.ibb.co/9gnsxxk/https-i-imgur-com-9srd20k-png.png[/IMG][BR][BR]Tržiště - level 3[BR][IMG]https://i.ibb.co/MfzCvhq/https-i-imgur-com-Gb-PMmpf-png.png[/IMG]"}, {"2": "tržiště je lidské"}, {"77": "Ty budovy Elementálů jsou něco opravdu skvostného, i na tu výrobu,ty se vám moc povedli. Už se nemohu dočkat až to spustíte. Za to děkuji."}, {"66": "Ta mramorárna mě dostala. jsem ráda, že na něj mám bonus, i když nebudu moci vyrábět bonusově moonstone.[BR]Ale stejně se těším, až jí vyupgraduju. [BR][BR](I když vypadá to obrovsky, jajx[BR][BR]Update. OK, bude to jen 5x4, to se dá přežít.[BR]Jen to bude chtít opět překopat město.)"}, {"50": " tipuji, že místa se opět nebude dostávat, bude přidán nový pruh pro Elementály nebo ne? "}]