[{"11": "jo chápu, jsem si to pořádně nepřečetl, tak se do to taky pustím."}, {"3": "než přidali T4-6, tak přibyla semínka, za které se vyrábí. Teď přibyl nějaký ten nový nesmysl, takže lze očekávat, že v příští kapitole se z něj T7 bdue vyrábět. Ve skladu se dvě tři dílny neztratí, teleportů je dost"}, {"16": "Někteří to už vykopali z game files někdy kolem vánoc:[BR]\t\t\thttps://minmaxgame.com/elvenar-chapter-18-research-preview/\t\t[BR]A nemusíte se ani hrabat  v game files, na betě už je v hlavním sídle vidět:[BR][IMG]https://i.ibb.co/q9cj5xL/https-cz-forum-elvenar-com-index-php-attachments-1614673278424-png-5301.png[/IMG][BR]Takže pro nás, co máme výzkum i vylepšení budov dokončen, je vhodné si dopředu připravit budovy na T7-T9 (přičemž je jedno, kdy vlastně přijdou, v inventáři se nezkazí a zejména T2/5/8 a T3/6/9 trvá výstavba od lv1 poměrně dlouho a v podstatě vše nasvědčuje tomu, že T7=ch18, T8=ch19, T9=ch20)"}, {"31": "Na bete sa začína...[BR]Fénixova udalosť 2021[BR][BR]Spoiler: Fénixova udalosť 2021[IMG]https://i.ibb.co/sV0R13m/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-easter2021-mainbanner-easter2021-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]Všetky detailné informácie o tejto udalosti nájdete v nasledujúcich témach:[BR]Prehľad udalostiPrehľad nových budov[BR]Zároveň, dávam do pozornosti novú webovú stránku, obsahujúcu databázu všetkých budov z udalostí ktoré sa kedy objavili v hre. Je to nová verzia vyššie uvedeného prehľadu, ktorá mi, možnosťou využitia nových nástrojov, dovolila pridať do zoznamov veľké množstvo nových funkcií (vrátane rôznych filtrovaní a usporadúvaní budov podľa ľubovoľných parametrov).[BR]V tejto chvíli tam nájdete aj tabuľku novej rozvinuteľnej budovy, ktorá narozdiel od doterajších verzií, obsahuje prehľadné rozpísanie všetkých hodnôt pre všetky jej stupne.[BR][BR]Prezentačné video​"}, {"66": "Bude tedy na live serverech DS s artefakty na trvalkové saně (popř. kdy?), nebo přejdeme rovnou na další event?"}, {"11": "ten novej fénix nemá dočasný efekt ?"}, {"16": "@voyager-1 Jestli myslíš krmení, tak krmící efekt je 2% bonus k eventové měně(na lv 10) z úkolů na 30 dní."}, {"31": "@Prealiena dobrodružstvo bude, v tejto chvíli je naplánovaný začiatok na 11.3.[BR][BR]@voyager-1 špeciálny efekt obsahuje, detailný popis som doplnil do prehľadu."}, {"11": "jako ty věci co sbíráme při eventech, jako třeba pírka, nasbírám místo 5000 , 5100 jo? Berete to jako dobrej efekt?[BR]A už se ví jestli bude možnost výměny artefaktů za ohniváka?"}, {"19": "Spíš než dobrej efekt je to dobrej výsměch."}, {"11": "taky si myslím, pokud to správně chápu"}, {"2": "Je dost smutnej[BR]Kultura i lidi málo, vbcko jedno mana 14k[BR]A k tomu efekt pro lidi co moc nehrajou"}, {"16": "Jinak řečeno, ušetříme místo za pro nás zbytečnou budovu."}, {"3": "třeba s efektem ještě trošku pohnou na základě zpětné vazby. toho loňského myslím upravili za pochodu..."}, {"211": "pěknej bělouš ... rozšíří inventární sbírku[BR]nebo ho jednorázově postavit s lvl 1 - 1% a užít si v poklidu event (na lvlu 10 má procenta 2) - pro ty, co neví kam s krmením [BR]hlavně aby šlo měnit artefakty za univerzální, ani 6 týdnů ve Věži na full můj apetýt nezahnalo, další by se hodily"}, {"2": "Graficky je moc povedenej, ale tím to vadne.[BR]ta čísla mi přijdou opravdu hodně slabá, takže to ne mě působí jako záměrné ponechání prosotru pro navyšování[BR]lidi budou stejně řvát že mají málo, tak jim to dám"}, {"222": "Taky se mi líbí. Snad parametry zvednou. Jinak doufám, že bude zas možnost \"přepracování\" artefaktů v akademii, abych zvedla ohnivaka."}, {"31": "@Ladonka bude. Jednak za 2 artefakty popelavého fénixa a 2 činidlá, alebo, druhým receptom za 3 plánky a 10000 úlomkov kouzel (to sú aktuálne hodnoty z bety)."}, {"11": "to jsem taky potřeboval slyšet, takže jich půjde získat hafo. V malým městě toho využiju a zvednu ho o deset kapitol. [BR]Takže dobře že novej Fenix je o ničem. "}, {"211": "na konci úkolů není ani studna, ni studánka, jen toto[BR]"}]