[{"16": "@Trumpetka To je ta Inno logika: Bohyně dává málo dia > Zrušíme Bohyni a dáme místo ní avatar."}, {"3": "alespoň nezabere místo [smilie--sprite7]"}, {"222": "Vidím v tom snahu o kreativitu  [smilie--sprite1] . Na konci eventu bych ale chtěla vidět něco lepšího."}, {"11": "to je jako jen obrázek do profilu jo, tak to je hodně dobrá odměna [smilie--sprite1]"}, {"223": "Popelavý fénix je graficky moc pěkně ztvárněný, ale účinek krmení jsou 2 % z denní odměny na 10. úrovni...[BR]z 50 krystalů za denní odběr je odměna 1 krystalz cca 65 krystalů za provedení úkolu je odměna 0.65 x 2 = 1.3 krystalu ?!Chápu to správně? :-([BR][BR]A jak se to bude počítat na nižších úrovních rozvinutí tohoto fénixe (1.0 % - 2.0 % pro 1. - 10. úroveň rozvinutí)? Něco mi asi uniká... :-/"}, {"2": "Já si ho na zkoušku postavil a nakrmil.[BR]přínos jak to tu bývá se zaokouhluje nahoru, takže mi hned začal dávat +1 bod za úkol 46 bodů.[BR]když jsem si udělal tabulku, tak mi to vyšlo na přínos 136 bodů  na lvl 10[BR]Hrobeso [BR]@ lovec krys mě to prijde spíš jako když rvou že dává bohyně málo, tak ji nedáme vubec a oni budou příště vděční aspoň za ní.[BR]Vzpomeň si na VBcka.[BR]Bejvala třicítka[BR]Pak nám ukázali že taky nemusí být nic a jak jsme teď vděční za desítku."}, {"211": "@Mescal , taky mi něco asi uniká.. propočty jsem si dělal stejným způsobem a jediné, co mě napadlo, je zaokrouhlování, které potvrzuje GorGlin. Pak by ale nebyl rozdíl mezi jedním a dvěma procenty u hodně úkolů. Bělouš by připsal stejně u levlu 1 jako u 10. A při počtu úkolů to není zázrak. Pozitivem je jen, že to krmení má efekt na měsíc (jestli jsem se nepřehlédl). Snad se pletu a jak píšeš, něco jsme nepobrali..[BR]Parametry (ty ostatní - čert vem jedno krmení) se mi prostě nelíbí (úroveň Trpaslík) a to je škoda, budova je to pěkná a rád bych si ji postavil. Jen na krásu ji však do vísky cpát nebudu.[BR]dodatek: možná plácám blbosti, koukám na to na Betě z fáze výzkumu III a pak na parametry k levlu 5 budovy (VI) v přehledu - počkám si na live, případně na iDavise (idavis-elvenar.github.io), zatím to tam nemá"}, {"221": "tak co bohyne stejne za moc nestala ale kdo si da slepici na profil?[BR][BR]jo jo ty 2% jsou smesny jako kdyby bylo krmeni na tyden - 10 dnu a radej to zvedli aspon na 5% takhle kdyz mi to da 1-2 body za ukol vic nez tak je to zhruba do 200 bodiku za event koukam ze tu ma nekdo presnejsi propocty kazdopadne je to malo na budovu co me ve meste bude starnout protoze rekonstrukce budu investovat jinam"}, {"11": "kdyby bylo 10 dní 5% a pak nic, tak je to ještě mín než 30 dní za 2% [smilie--sprite1]"}, {"114": "Hexik asi myslela krmit á 10 dní po 5% [smilie--sprite1]"}, {"2": "@Hexik [BR]S ohledem na to kolik hráču používá jako avatára nějaké zvíře, tak by mě nějaký další pták vůbec nepřekvapil."}, {"11": "slepici si tam dá spíš nějaká ženská, já bych tam potřeboval dát vola, protože to vůbec hraju [smilie--sprite1]"}, {"224": "iDavis napsal/a:@Prealiena dobrodružstvo bude, v tejto chvíli je naplánovaný začiatok na 11.3.[BR][BR]@voyager-1 špeciálny efekt obsahuje, detailný popis som doplnil do prehľadu.\t\tKlikněte zde pro zvětšení...[BR][BR]Dobré ráno, prosím vás, nevíte někdo, jestli už je ten začátek DSka potvrzený???  Rádi bychom se připravili  [smilie--sprite2]  Díky za info."}, {"31": "@Reyahana potvrdený bude, až sa objaví ohlásené v novinkách hry / oznámeniach, avšak zatiaľ je stále naplánované na 11.3."}, {"211": "To je darda, půlka bedny sice splněná, ale to jde i jinak. A těch činidel..[BR]"}, {"2": "Asi to je kvůli těm vecnim remcalum že toho mají moc"}, {"16": "@GorGlin Ti mají právě i ty knihovny, takže se jim to ve výrobě neobjeví."}, {"222": "Stěžovat si na nadbytek je hloupost a musí být po zásluze potrestána  [smilie--sprite1]"}, {"114": "hhhmmm, takže když už ve městě nějakou knihovnu mám a v inventáři žádnou, tak už jich víc asi nebudu moct do města postavit než mám teď? [smilie--sprite11] ajaj, a já jich chtěla mít ve druhém městě taky 4 [smilie--sprite10]"}, {"31": "Na bete sa v prehľade relikvií objavila ikona novej kapitoly a nového zboží, ktoré prinesie..[BR][BR][IMG]https://i.ibb.co/TtpC6mD/https-i-ibb-co-9w53-C7-R-EL-beta-kapitola-18-relikvie-png.png[/IMG][BR][BR]Toto, rovnako spolu s vývojom kapitoly samotnej len potvrdzuje, že jej príchod sa už zrejme čoskoro blíži na betu. Presný dátum zatiaľ nie je známy, avšak má zrejme zmysel si pripraviť chýbajúce manufaktury T1 - výroba nového zboží bude totiž prebiehať v týchto manufakturach, ktoré budú obsahovať až 6 slotov na výrobu (2 na standardní, 2 na živoucí a 2 na nové zboží), zrejme od 32. levelu.[BR][BR]Zároveň - na novom portáli s databázou budov udalostí som vykonal malú aktualizáciu, vďaka ktorej sa denné odmeny v kalendári udalosti generujú automaticky (každú noc). Môžete tu teda s okamžitou aktualizáciou sledovať nové denné odmeny ktoré sa objavujú na bete (samozrejme stále sú pridávané aj do prehľadu, avšak kvôli nutnosti manuálnej manipulácie sa tu objavujú až s istým oneskorením)."}]