[{"16": "Dneska na betě Lávové vejce.[BR]A zde je porovnání mezi 15. a 17. kapitolou (která názorně ukazuje, jak je to v posledních kapitolách s růstem produkce (zejména v porovnání s růstem nákladů)):[BR][IMG]https://i.ibb.co/b17z5DG/https-cz-forum-elvenar-com-index-php-attachments-1615700180085-png-5343.png[/IMG]"}, {"84": "To je teda bída.. Dvě kapitoly a nárůst jen 2000 za den.. Ale náklady v Unurech byly v desítkách milionů.."}, {"221": "to vypada spis jako chyba misto o 2k by to spis melo vzurst aspon o 20k meli by na tom jeste zapracovat"}, {"31": "Chyba to nie je. Je to len vhodné naškálovanie produkcie many vzhľadom k jej nárokom, ktoré ostatné funkcie hry v tejto kapitoly vyžadujú (v predch. kapitolách rástla produkcia many v eventových budovách voči jej nárokom príliš rýchlo, tak to teraz potrebovali vybalancovať)."}, {"16": "@iDavis Jo, je naše chyba, že máme moc manufaktur (třeba 6xT3 + 2xT6). Jako vždy to Inno tím balancováním přehnalo (přemrštěný růst nároků vs směšný nárůst produkce). Kdybychom jich měli méně, jak Inno předpokládá (nejspíše tak 2+1), tak nás to nestojí 36,8 milionů many a nevylepšujeme to 2 měsíce.[BR]A součástí toho balancování je i mana v levelech na divy a výkup v turnaji, nebo na to zapomněli a nepočítají to?"}, {"114": "spíš bych řekla, že čím vyšší kapitola teď, tím déle bude trvat, třeba ta další těm největším machrům až půl roku, podle mě profrčet kapitolu raz dva není gró samotné hry a v těch nejvyšších kapitolách už vůbec ne, náročnost zdolat kapitolu může stoupat klidně i exponencionálně, tak, aby se nováčci mohli dříve vyšvihnout a staří pardálové vyšvihnout zase v tom, jak si se stoupající náročností umí poradit [smilie--sprite1]"}, {"31": "Na bete je od dnešného dňa umožnené zadávať hromadné produkcie aj v manufakturach..[BR][BR]Spoiler[IMG]https://i.ibb.co/CvVHhMf/https-i-ibb-co-Fn-BWPVs-EL-beta-produkcie-png.png[/IMG][BR]Oficiálne to zatiaľ oznámené nebolo, takže je možné, že sa to len nejak ticho testuje, ale zrejme je to dobrým znamením, že by sme sa už čoskoro mohli tejto funkcionality dočkať.."}, {"11": "tak to je dobrá zpráva."}, {"84": "Konečně.."}, {"16": "Jen dodám, že dle mého dnešního testu je to omezeno na stejný druh a úroveň - jestli je to finální stav anebo ne, netuším."}, {"178": "@Lovec Krys tak alespoň na DS to bude fajn"}, {"31": "Údajne to funguje aj na osadnícke budovy.. takže demolátori z unuru už nebudú to čo boli. [smilie--sprite1]"}, {"20": "@iDavis - je to tak, mě to na betě na osadnické budovy funguje.  A na manufaktury na stejný druh + stejný lv.  Je to fajn vylepšení."}, {"203": "Tak to by bylo super[smilie--sprite1]"}, {"11": "a já si to musel odklikat [smilie--sprite3] [smilie--sprite1]"}, {"31": "V tejto chvíli naplánovaný termín udalosti Vzestup kultu fénixe bol doplnený do prehľadu. Rovnako boli do prehľadu doplnené aj všetky úlohy udalosti a zoznam truhiel s odmenami. Pre zobrazenie detailov novej rozvinuteľnej budovy doporučujem využiť tabuľky na novom portáli, kde sú rozpísané do všetkých detailov, vrátane všetkých stupňov budovy."}, {"225": "V přehledu máš chybu (teda doufám že chybu)[smilie--sprite1][BR]iDavis napsal/a:Artefakt popelavého fénixe je potrebný na vylepšovanie budovy Trvalkové saně na vyššie stupne.\t\tKlikněte zde pro zvětšení..."}, {"203": "@iDavis - perfektní, díky moc. Mám radost, že se mi volno protáhne i přes další event, protože nevidím sebemenší důvod, proč to hrát.  Ohniváka už mám na level 10 a pro další zvěř se již nedostává krmiva. Potřebuji už jen vytunit hnědého medvídka, tak snad se dočkám i medvědího eventu, či věže s artefaktama. Nicméně ještě jedou dík, že nás zásobuješ skvělými informacemi [smilie--sprite2]"}, {"221": "hromadne zadavani funguje vyborne ja jsem spokojena"}, {"226": "Ve hře se objevilo nové tlačítko, pod diamanty přidali modré plus, když se na to klikne, dostane se člověk na nákup diamantů a uplně na konci je nějaká denní odměna a jde vybrat. Dostala jsem manu. je to jen v mobilní aplikaci, na pc to tam nemám, nevíte o tom někdo něco? Teprve to testují nebo o co jde?"}]