[{"225": "Tak jsem zkontroloval mobil a nic nového tam nemám[smilie--sprite3] a mana by se hodila [smilie--sprite1]"}, {"31": "Testujú to zatiaľ len na nejakej množine hráčov, teda nemá to ešte každý (a tí ktorí to majú, vedia to vyzdvihnúť iba z mobilnej aplikácie). Jedná sa o dennú odmenu, každý deň sa z nejakej zostavy vyberie náhodná odmena (pričom jednou z nich sú diamanty, v množstve rovnom kapitole, v ktorej sa hráč nachádza)."}, {"16": "Ani bych si toho nevšiml, kdyby to někdo nenapsal na forum bety:[BR][BR]Aktuální zobrazení ostatních zdrojů:[BR][IMG]https://i.ibb.co/xzNRJ9B/https-cz-forum-elvenar-com-index-php-attachments-1616061446569-png-5350.png[/IMG][BR]Nové zobrazení:[BR][IMG]https://i.ibb.co/Pm2vW40/https-cz-forum-elvenar-com-index-php-attachments-1616061410792-png-5349.png[/IMG]"}, {"178": "Hezké na ten upgrade se začínám těšit"}, {"2": "U nás o tom mluvili lidi na českém serveru[BR]Já nemám nikde nic."}, {"16": "@GorGlin Taky nepatřím mezi testované (ikdyž jestli je to jen na mob. aplikaci, tak to stejně nepoznám)."}, {"205": "Uvedené tlačítko pro denní odměnu mám v mobil aplikaci na live serverech jak A tak W.[BR][BR]A tak jsem zlobil a už není. [smilie--sprite12][BR][BR]to je sranda. další edit. tlačítko s denní odměnou se mi do hry vrátilo."}, {"139": "Lovec Krys napsal/a:@GorGlin Ti mají právě i ty knihovny, takže se jim to ve výrobě neobjeví.\t\tKlikněte zde pro zvětšení...prave se to neobjevi ani tem co nemaji knihovny...ja knihovnu na svem uctu v akademii jeste nikdy nevidela. To same artefakt ohniveho fenixe, vsichni jak je tam furt a jak ho dostavaj ve vezi, ja ve vezi jednou jedinkrat jednoho a v akademiii jsem ho nevidela nikdy [smilie--sprite8] tak asi spis nejakej zajimavej algoritmus..."}, {"11": "V akademii artefakt ani neuvidíš. Ta knihovna v akademii zas není tak dlouho, Tvůj čas teprve přijde [smilie--sprite1]"}, {"221": "tak to se mylis predpokladam ze ma na mysli betu kde ted artefakty ve vyrobe budou jeste par dnu do konece eventu vetsinou to byva jeste par dnu po konci"}, {"11": "jo, na event jsem zapomněl."}, {"221": "nevadi my s balu docela hrajem na bete takze tak a musim rict na to ze ona ma na ne smulu me to uz tak 6x do vyroby prislo a chodi me obe verze takze uz tam mam dolepsino tesim se ze dolepsim ohnivaka i tady na cz stejne letosni fenix je horsi nez ten lonsky jsem doufala ze ho jeste upravi ten efekt krmeni je proste smesny"}, {"2": "já bych ocenil kdyby ho zvedli jako celek[BR]ta jeho čísla jsou fakt smutná[BR]krmení poteřbuju pro jiná zvířata"}, {"2": "Dnešní denní odměna je instant na jednotky z kempu[BR]Konkrétně drony[BR]Jestli přihodí i ropuchy a podobně, tak věřím že popularita vojenských instantu vzroste"}, {"16": "Už byly luky (13. den).[BR]Zrovna drony by mohli ze hry vymazat úplně (tak moc užitečné jsou)."}, {"4": "@Lovec Krys - Náhodou včelí jezdkyně jsou fajn, používám to k ničení těch zelených mrch[smilie--sprite2]"}, {"2": "tak ty jsem minul, ale i tak je to dobrá zpráva"}, {"16": "Takhle v praxi vypadá zvýraznění cesty v DS (oranžová), zatím zřejmě jen na pc verzi:[BR][IMG]https://i.ibb.co/ns8Gtdj/https-cz-forum-elvenar-com-index-php-attachments-ds-cesta-jpg-5359.jpg[/IMG]"}, {"2": "V aplikaci je zase to hromadné nahrazování, které bylo doposud jen na počítači.[BR]Bohužel si ho zatím není možné zaškrtnout trvale"}, {"2": "Tak já už nahrazuji hromadně i na cz[BR]Je to parada"}]