[{"2": "DSko je zase Fko?"}, {"16": "Jo. Už to nestřídají."}, {"2": "příští kapitola je oficiálně oznámená[BR][BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/chapter-18-team-spirit.16516/\t\t"}, {"16": "Nejen oznámená, moje beta město už je v ní (díky spoilerům od minmaxe na suroviny výzkumu a nákupu 180VB) a odklikávám úkoly unurů.[BR]Produkce lávového vejce 68k>83k, ale ve výzkumu není žádná budova na manu, takže se můžeme jen spoléhat na KR a ochotu vývojářů dát do příštího eventu i něco na manu nepatřícího do kategorie pop-kulturně-manový odpad.[BR]Festival Merchant 1590>1660 semen.[BR][BR]Moje gheto kouzelných obytek mezi unurskými obyč. obytkami:[BR][BR][IMG]https://i.ibb.co/423NBYZ/https-cz-forum-elvenar-com-index-php-attachments-elvenar-210408-beta-gheto-jpg-5367.jpg[/IMG][BR]Nové suroviny:[BR][IMG]https://i.ibb.co/377yNZF/https-cz-forum-elvenar-com-index-php-attachments-1617899437763-png-5368.png[/IMG][BR][BR]A ještě kouz. dílny:[BR][IMG]https://i.ibb.co/8PT9VJv/https-cz-forum-elvenar-com-index-php-attachments-1617899629753-png-5369.png[/IMG]"}, {"11": "jaký bude to vylepšení jenotek?"}, {"224": "@Lovec Krys   vauuuu, ty budovy jsou moc krásné [smilie--sprite1]  Nevím, jestli obrázek klame, ale zdají se mi menší než byly v předchozích kapitolách?"}, {"31": "K novým divom:[BR][BR]Shrine of the Champions[BR][IMG]https://i.ibb.co/cFQXkbC/https-oxzz-innogamescdn-com-frontend-assets-iso-rgxnp7mfnh7accfhoqswp7l3e5rfs4kd-png.png[/IMG][BR]Produkuje ťažkoodencov z cvičiska[BR]Poskytuje orkov po skončení každého turnaju (v množstve závislom od počtu nahratých bodov a požadovanej kultúry - pri 1m spotrebovanej kultúry a 10k nahratých bodov to vychádza na 184000 orkov na 35. leveli)[BR]Temple of Spirits[BR][IMG]https://i.ibb.co/6RdbZts/https-oxzz-innogamescdn-com-frontend-assets-iso-gura75tl7bks37tg27xk35qbisv76nfk-png.png[/IMG][BR]Poskytuje unurium za každú otvorenú truhlu vo veži (v množstve závislom na požadovanej kultúre - pri 1m spotrebovanej kultúry to vychádza na 11500 unuria na truhlu na 35. leveli)[BR]Poskytuje unurium za každú menu udalosti vyzbieranú okolo mesta (v množstve závislom na požadovanej kultúre - pri 1m spotrebovanej kultúry to vychádza na 5750 unuria na jeden zber na 35. leveli)"}, {"2": "já na betě viděl portál a mramorárnu lvl32 a moc se mi to líbí[BR][BR]co jsem si hledal informace, tak mana by nemusela být takový problém, ale uvidíme kolik jí vezmou vylepšení budov[BR]já budu asi nejvíc honit unurium"}, {"16": "No nemusela...ti z nás, kdo si vylepší manové budovy/sety za KR na tom tak špatně nebudou, jako ti, co se budou spoléhat na to, že do eventu Inno dá něco slušného na manu."}, {"196": "Jak velike jsou kouzelne obytky a dilny?"}, {"66": "A jak veliké ty divy? (Na obrázku vypadají maličké)"}, {"31": "@Prealiena ten s orkami je naozaj pomerne malý (3x4), druhý je 7x4."}, {"16": "Obytky zůstávají stejné - 4x5, dílny mají stejnou velikost, jen se otáčí z 6x5 na 5x6."}, {"2": "Tak to je super, dílny mám jen dve"}, {"20": "Koukala jsem zběžně na výzkum, je tam zlepšení bojových jednotek - střelec a Dron, takže to je konečně krok dobrým směrem. Po dlouhé době se na tu kapitolu celkem těším, nebude to jen vylepšování budov, ale prostě celkově něco nového, takže uvidíme, jak to bude hratelné."}, {"2": "Krom toho i ork stratég[BR]Takže čekáme mlžnou chodkyni se čtyřmi hvězdami[BR]A to bude výživné"}, {"4": "@GorGlin - no a myslím, že to zasáhne všechny ( **** soupeři ). Takže zase ztížení turnajů. Jsem zvědav, od které provincie budou 4**** protivníci. Že by od 16. ? Může být, že tato legrace dorazí i do věže[smilie--sprite12]"}, {"2": "ná na betě tak daleká dobrodružství nepodnikám, takže netuším, možná že Lovec bude vědět."}, {"16": "Já na betě obvykle dělám 15 provincií.[BR]16. mám odkrytou, ale tam vidím jen 3* jednotky (což může být i tím, že je ještě do turnaje nepřidali anebo je na ně špatný turnaj."}, {"66": "Hlavní sídlo se mění?"}]