[{"16": "Zůstává 8x8:[BR][IMG]https://i.ibb.co/DCMTs33/https-cz-forum-elvenar-com-index-php-attachments-1617986526820-png-5370.png[/IMG]"}, {"4": "@Lovec Krys - 2,1 mega many je drsný a co je to těch 200K, to je unurium?"}, {"2": "ano[BR]to je, podle mě aktuální brzda[BR]průchod kapitolou bude primárně určen tím jak dokážeš prdukovat a hosporařit a uriniem[BR]požadavek na výzkum, spotřeba na výrobu[BR]kdo má malé město bude plakat krev"}, {"11": "s tím uriniem je to nějak divně vymyšlený, že ty menší města mají takovou nevýhodu."}, {"2": "celkové pořadí jsem nikdy neřešil, šlo mi jen o to aby město fungovalo a mě se dobře hrálo[BR]když přišli se semenem, tak mě to prakticky neovlivnilo, už dlouho předtím jsem budoval divy a tak mi jeho produkce plně pokryla náklady.[BR]ted naopak trefili mou slabinu[BR]když tu iDavis psal o nových divech a vztahl produkci na 1M kultury, tak jsem se nestačil divit jak špatně na tom jsem[BR]ale to se nedá nic dělat, na kazdého jednou dojde"}, {"196": "Lovec Krys napsal/a:\t\t\tZůstává 8x8:[BR]Zobrazit přílohu uživatele 5370Klikněte zde pro zvětšení...Ahoj, dal by jsi sem jeste nejake takove obrazky? Třeba kouzelnou obytku"}, {"16": "@VStanikV [BR][IMG]https://i.ibb.co/Rjqq6p9/https-cz-forum-elvenar-com-index-php-attachments-1618033832403-png-5371.png[/IMG][BR]Jak vypadá ve městě je na předchozí straně."}, {"196": "Dik, jeste se zeptam. Ta populace 19200? Je v ni uz nejak zapocitanej bonus z termalniho pramenu mladi?[BR][BR]Beru otázku zpět, bylo by to napsané zeleně."}, {"16": "Není, na betě ho nemám postavený. Je to bez bonusu."}, {"20": "Mám dotaz, na profilu společenství na betě se objevila 4. trofej. Nevíte o tom někdo něco bližšího? [BR][IMG]https://i.ibb.co/C0STzHB/https-cz-forum-elvenar-com-index-php-attachments-ls-jpg-5386.jpg[/IMG]"}, {"3": "žeby trofej za max bodů ve věži?"}, {"16": "Má to požadavek na 1 bod:[BR][IMG]https://i.ibb.co/qBvZFQ6/https-cz-forum-elvenar-com-index-php-attachments-1618392199921-png-5387.png[/IMG][BR]Tzn. odlišuje to společenství, které nedosáhne na bronzovou (tzn. nenajdou se tam ani 2 hráči, co projdou celé první patro(2x63)) od společenství věž zcela ignorující."}, {"211": "  [BR][BR]Co to je na Betě za pokusy u obchodníka? Proč se tam má malým hráčům něco takového motat?"}, {"31": "Na bete sa začína...[BR]Májová udalosť 2021[BR][BR]Spoiler: Májová udalosť 2021[IMG]https://i.ibb.co/4phygWV/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-may2021-mainbanner-easter2021-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]Všetky detailné informácie o tejto udalosti nájdete v nasledujúcich témach:[BR]Prehľad udalostiPrehľad nových budov[BR]Zároveň, ako som už behom minulej udalosti avizoval, ku prehľadom budov udalostí som vytvoril nový portál. Pre návod tejto, ako aj každej nasledujúcej udalosti už plne nahrádza doterajší kalendár, ktorý zvykol byť prehľadov súčasťou. Na stránke udalosti Všetky udalosti nájdete tento kalendár v novej forme, ktorá je svojim vzhľadom takmer totožná s kalendárom na fóre, avšak jednoduchšia na manipuláciu a preklikávanie sa medzi budovami.[BR][BR]Nové budovy udalosti sú stále súčasťou prehľadu budov na fóre, avšak skripty, ktoré používam na ich tvorbu, sú už z mojej strany nepodporované. To znamená, že ich už nedopĺňam o nové funkcie, ani neopravujem ich prípadné chyby. Doporučujem teda využívať platformu stránky, pre ktorej účely som vytvoril nové skripty, ktoré sú lepšie navrhnuté ako pre moje generovanie a aktualizovanie dát, tak pre budúcu údržbu / pridávanie dát.[BR][BR]Od minulej udalosti bolo na stránke vykonaných viacero zmien a úprav, vrátane implementácie jazykového systému. To znamená, že stránku je teraz možné preložiť do českého jazyka (kliknutím na glóbus v pravej hornej časti). Prehliadač si túto voľbu zapamätá, takže nemalo by byť nutné nastavovať jazyk pri každej návšteve.[BR][BR]Zároveň vďaka všetkým, ktorí ma kontaktovali s nájdenými bugmi na stránke - všetky z nich by mali byť v tejto chvíli opravené."}, {"16": "A nový portrét pro sběrače za dokončení úkolové sady:[BR][IMG]https://i.ibb.co/YhwJV4Z/https-cz-forum-elvenar-com-index-php-attachments-1618481238577-png-5392.png[/IMG][BR]Jo, kde jsou ty časy, kdy jsme za dokončení úkolové sady eventu dostali něco lepšího než ošklivý portrét."}, {"227": "Teda tenhle portrét mi tak trochu něco připomíná...no nebudu psát co "}, {"228": "Nevíte,kdy bude DSko?"}, {"31": "Najbližšie dobrodružstvo je v tejto chvíli naplánované na 22.4."}, {"16": "Obchodování s T7:[BR]Můžete přijmout nabídku jiného hráče, ale nemůžete podat nabídku klasickým způsobem, pouze přes novou záložku.[BR][IMG]https://i.ibb.co/fdqDtQv/https-cz-forum-elvenar-com-index-php-attachments-1618554951400-png-5394.png[/IMG][BR](pozn. jo, skoro všechny nabídky na těch 9 stranách jsou na cihly. Naštěstí můj bonus jsou právě ty cihly, jinak bych to začal nejspíše vyrábět v nebonusových manufakturách.)[BR][BR]Nová záložka pro obchod s T7(+)[BR][IMG]https://i.ibb.co/HhZ1R7T/https-cz-forum-elvenar-com-index-php-attachments-1618554880393-png-5393.png[/IMG][BR]Kupce je potřeba si nejprve najmout (první stojí 8M), kupec se najímá na 20 dnů, poté bude potřeba jej najmout znovu.[BR][BR][IMG]https://i.ibb.co/GpGmd0K/https-cz-forum-elvenar-com-index-php-attachments-1618555164634-png-5395.png[/IMG][BR][IMG]https://i.ibb.co/wKgD0qV/https-cz-forum-elvenar-com-index-php-attachments-1618555187537-png-5396.png[/IMG][BR]Počet zboží, které může kupec najednou vyměnit je omezen formulí závislou na úrovni hlavního sídla.[BR]Pro počáteční úroveň hl. sídla kap. 18 (39) je to 1800![BR][BR]Jakmile zadáte nabídku, okamžitě dostanete zboží, ale váš kupec má 6 hodinový odpočet před dalším použitím.[BR][IMG]https://i.ibb.co/Cn60qRR/https-cz-forum-elvenar-com-index-php-attachments-1618555325518-png-5398.png[/IMG] [IMG]https://i.ibb.co/0F2PzG0/https-cz-forum-elvenar-com-index-php-attachments-1618555291006-png-5397.png[/IMG][BR][IMG]https://i.ibb.co/d0q1CbW/https-cz-forum-elvenar-com-index-php-attachments-1618555403644-png-5399.png[/IMG][BR]Odpočet lze snížit 3 způsoby:[BR]Pokud někdo vezme vaši nabídku (viz. poslední obrázek s kloboukem)[BR]Pomocí urychlovačů (6h)[BR]Pomocí diamantů[BR][BR]ps: Obchodníky jsem přejmenoval na kupce, aby se to nepletlo s obchodníkem.[BR]Klasického obchodníka (Záložka Obchodník (v EN verzi Wholesaler)) nelze použít na výměnu T7+ zboží."}, {"2": "Tohle vymyslel někdo se sadistickymi sklony.[BR]Požadavky jsou v desetitisících, nebo statisících?"}]