[{"20": "@Lovec Krys díky za informace, i když to nevypadá pro hráče moc přátelsky ..."}, {"16": "Oznámení o obchodu s obchodníkem (tím, co jsem vyslal)[BR][IMG]https://i.ibb.co/cgQkQrY/https-cz-forum-elvenar-com-index-php-attachments-1618559283889-png-5406.png[/IMG][BR][BR]Asi tak odhadem za 2-3 dny napíšu, o kolik se mi zvýšila kapacita obchodníka po vylepšení Hl. sídla na 40 (chybí 200k unuria).[BR][BR]ps: Ještě jsem zapomněl na důležitou informaci:[BR]Klasického obchodníka nelze k výměně T7+ použít.[BR]Jediné možnosti výměny jsou:[BR]Přijmout nabídku jiného hráče anebo vyslat obchodníka.[BR][BR]ps2:[BR]Jsem zvědav, jak si překlad poradí s Wholesaler vs Merchant.[BR]Ale je možné, že Wholesaler zůstane přeložený jako Obchodník a Merchant se přeloží jako Kupec.[BR][BR]ps3: V původním příspěvku jsem rovněž přjmenoval obchodníky na Kupce ať se to neplete."}, {"2": "Takže kdo bude mít štěstí, že bude vyrábět nedostatkovou surovinu, se celé téhle opicarne vyhne, protože mu bude stačit brát poptávku ostatních?"}, {"3": "třeba to bude agent nebo dealer [smilie--sprite8]"}, {"16": "@GorGlin Ano. Samozřejmě nedostatková surovina se může časem měnit. Já jsem první vyrobenou várku T7 vyměnil tak, že jednou jsem poslal kupce a 5x jsem přijal nabídky jiných hráčů."}, {"11": "cihly jsou ocelárny že? Tak ty budu mít."}, {"2": "Časem se měnit možná budou, ale pro mě bude relevantní jen to období kdy budu mít spotřebu já.[BR]Stále si pamatuji jak to vypadalo když spousteli živoucí a platina prostě nebyla.[BR]Výroba v nebonusovych manufaktura s ohledem na spotřebu uriny není moznost"}, {"183": "nevíte kdy --kolektivní duch-- spustí tady u nás mám nějaké studny ,kolotoče tak jestli to výjde Dík"}, {"196": "Hádám správně že se bude vylepšovat tržiště? Jak bude veliké?"}, {"16": "@VStanikV  6x5[BR]A připrav si poslední nebonusovou T1, výzkum lv 32 je ještě před vylepšením tržiště."}, {"196": "Dik. Poslední T1 uz mám připravený dvě."}, {"114": "Tedy s novou kapitolou (a počítám s dvěmi následujícími) přichází do hry čtvrtá (poslední) trojice manufaktur na bonusovou výrobu, tak to očekávám, že to s trhem hne tím správným směrem, nakonec kterým se nějaký ten výnosný bonus zatím ještě na manufakturách nezadařil, tak v té poslední trojici by mohl mít naopak na trhu výnos moc pěkný. [smilie--sprite1][BR][BR]ad Kupec, moc ještě nechápu k čemu taková \"brzda\"? slouží, i když asi si začínám zvykat, že čím vyšší kapitola, tím asi delší čas nad jejím projití mám strávit..."}, {"183": "takže nikdo neví kdy se nová rasa spustí?"}, {"2": "Proč brzda?[BR]Teď můžeš přistavět druhou manufakturu, ale bude ti k ničemu[BR]Mas čmeláka na max, aby jsi mohl směňovat 1:1[BR]Taky je ti to k ničemu[BR][BR]Odstraněn nevhodný výraz. Embla"}, {"11": "už se trochu ví kolik bude v nový kapitole třeba místa?[BR]druhá T7 se nebude hodit ?"}, {"2": "Jedno rozšíření za provincie už naskočili a ve výzkumu jsou dve"}, {"11": "já myslel místo pro osadníky"}, {"114": "@GorGlin - ..tak \"opět\" nebo \"další\" brzda, spíš jaký jiný má ten \"kupec\" účel?"}, {"2": "@voyager-1 na fóru Bety je jeden návrh cca 4x5 rozsireni[BR][BR]@ luterina[BR]Já bych to šacoval na to že z hráčů chtějí vyrazit diamanty[BR]Čtvrtý a pátý se platí diamanty a vydrží ti jen 20 dni"}, {"11": "to by šlo, ale takovej návrh tu byl i v této kapitole a pak to bylo mnohem víc [smilie--sprite1]"}]