[{"2": "@voyager-1 [BR]To máš pravdu. Netuším jakou ta sestava bude mít produkci.[BR]Ale zdá se, že by tentokrát mohly být užitečnější portály.[BR]Jestli to správně chápu, tak to co bylo  v na obrázku mě bude stát přes 150k nové neobchodovatelné suroviny kterou nevyrabim. Takze víc možná ani nebude jak postavit"}, {"196": "Jak moc a kreré vojenské budovy se v nové kapitole budou zvětšovat?"}, {"126": "@VStanikV koukni třeba sem:[BR][BR]Spoiler: ch17+\t\t\thttps://minmaxgame.com/elvenar-chapter-17-upgrades-preview/?fbclid=IwAR2n_O9LrP-hLmYbDLTCiNSPQPMlT6INyGzqLCChCvuvq0L06ZedzbIEy9M\t\t[BR]a nebo hledej zde:[BR]Spoiler\t\t\thttps://www.elvenarchitect.com/buildings/\t\t"}, {"16": "Takže vylepšení sídla z lv 39 na 40 zvýšilo kapacitu kupce z 1800 na 2000:[BR][IMG]https://i.ibb.co/Jdgh9FW/https-cz-forum-elvenar-com-index-php-attachments-1618828666376-png-5415.png[/IMG][BR]Myslím, že komentář netřeba..."}, {"2": "K tomu není co dodat"}, {"205": "To je pěkný nárůst. Co bychom nechtěli krásných 11%."}, {"11": "kolik je třeba provincií, 520 ? v malým městě bude problém"}, {"16": "520, nárůst o 40 nijak nevybočuje z řady posledních kapitol."}, {"11": "já vím že ne, ale na malým světě mám jen 508 a kapitolu hotovou. Ale tak, bude na to půl roku, do měsíce provincie dám."}, {"2": "Ono je otázka za jak dlouho to sem pustí.[BR]Ti pašeráci co jsou v plánu jsou zatím dost diskutovaní, třeba s tím budou dělat ještě nějaké úpravy."}, {"11": "já vycházel z toho, že to začne ve čtvrtek, no měsíc to asi trvat nebude."}, {"16": "@GorGlin Myslím, že se můžu vsadit, že nezmění ani ň. Neboli přístup, tohle jsme na vás nachystali, poraďte si s tím jak umíte. Počítal bych, že kapitolu dostaneme někdy po skončení DS před začátkem květnového eventu."}, {"2": "@Lovec Krys [BR]Taky mě to napadlo, ale naděje umírá poslední."}, {"11": "tak jak, už je někdo na betě s kapitolou hotovej ? [smilie--sprite1]"}, {"114": "optimista [smilie--sprite1]"}, {"2": "podle pokroku ve městě bych to šacoval, že těm nejrychlejším zbývají tak dva týdny"}, {"16": "Otázka je, kolik z těch nejrychlejších do toho narvalo spoustu diamantů.[BR]Přede mnou je ještě 7 sloupců výzkumů vyžadující odznaky (= všechny, které vyžadují odznaky), takže asi ještě na dlouho.[BR]Tipuji, že to dopadne stejně jako kap16 - tam moje beta město taky začalo kapitolu o pár týdnů dříve než na cz1 a dokončilo ji tak 2 měsíce po cz1."}, {"2": "To se nikdy nedozvím, ale pilousd má tak velké město, že věřím že to naklikal."}, {"31": "V tejto chvíli naplánovaný termín Májovej udalosti nájdete uvedený v prehľade."}, {"214": "Další event? To už je neúnosný [smilie--sprite3][BR]Týden stojím ve výzkumu kvůli týhle šikaně, mám vyzkoumaný senát, potřebuju zkoumat ambasády a ostatní. Tyhle eventy jsou jen zdržování od pořádný hry.[BR][BR]Odstraněna citace. Embla"}]