[{"206": "Mě zas eventy nevadí, je to takove akcnejsi. Nez kdybych jen přišla, zadala vyrobu a sla pryč. A získám i nějakou odměnu, za me je to fajne zpestření."}, {"31": "Môj názor je, že poriadna hra je práve vďaka týmto udalostiam.  Navyše už dávno nemám pocit, že by ma akokoľvek zdržovali v progrese samotnom."}, {"196": "Navíc není nikde napsáno že jsou eventy povinné."}, {"224": "Jani, já je mám taky ráda.  A pak budeme mít zase fajnové DSko...Však nám to tak pěkně šlo.  Uznej sama.[BR]Event tě nezdržuje přece. Stav si v městečku, co chceš. Většina věcí se plní sama. Já se těším. Dokonce se zdá, že se mi ta budova bude líbit a postavím ji, oproti jiným eventovkám."}, {"229": "Presne Eventy su fajn aj keď odmeny už nie su čo byvali ,ale to je na ine tema.Elevenar bez eventov si nedokažem a ani nechcem predstaviť.V tomto evente ma zaujala tato budova Bumblebee Stables a určite po nej pojdem je uvedena hneď na prvy deň.Zas niekto može namietať a niekto sa zase može  zastavať včelich jazdkyň -Ja snimy proste hrajem a pride mi, že to čo budova ava je v pomere k vystavbe včelich jazdkyň hodne dobre."}, {"3": "pokud divy a další věci dávají bonusy k eventovým měnám apod., tak je jen logické, že se budou točit..."}, {"2": "Nevíte někdo jak je to s rasou?[BR]spustí jí zítra nebo ne?[BR]Chtěl bych tímto vyjádřit ohromný vděk našemu wiki týmu, že zprostředkoval informace o nové rase.[BR]Bohužel nevydržím muka čekání ve všech otázkách a tak mi odpusťte následující stať.[BR]Jeslti chápu popisy správně, tak základní surka pro týmovou práci jsou lidi, elfi a elvenarové, které nalákáme do parku, nebo si je vytáhneme z kapsy pomocí PP.[BR]nebo to jsou jen otroci kteří zemřou při výstavbě center?[BR]není mi to zcela jasné[BR]nevím jak je to myšleno, ty bytosti budeme pomocí živlů přetvářet do nějakých předmětů, nebo se stanou součástí vyvolávacích struktur a jejich duše, jistě blažené, nám pomáhají?[BR]Ale ať tak nebo tak PPčka zařídí, že nemusím mít parčík a stačí ty lidi, elfi a elvenari likvidovat.[BR]Já se na rozdílnosti ras dívám nez předsudků a i když si rovnoprávnost představuji jinak tu věc na G i na H nebudu hanět, je to jiný svět a když  hubíme orky neměli bychom ostatním měřit jinak[BR]nebo jsem něco přehlédl?"}, {"16": "Podle oznámení na jiných elvenařích fórech to bude dneska (pokud je dají na všechny najednou (což předpokládám)).[BR][BR]ps: Na SK je taky oznámeno na dnešek a dost pochybuji, že by CZ a SK servery měly kapitolu v jiný den."}, {"20": "Asi to bude náročné, ale grafika 18. kapitoly je krásná, takže na to se těším. Plán dle architekta je zhruba navržen, takže to nějak půjde. Po dlouhé době se mi líbí i budovy osadníků, nádhera. Uvidíme, co to udělá s turnajem a věží, doufám, že to zůstane hratelné."}, {"3": "turnaj by nové zboží chtít neměl. Pokud věž jo, tak snad až od příští kapitoly..."}, {"214": "Když jsem začala hrát, tak bylo pár eventů do roka, teď je co pár dní nějaká blbost. Jak už je to město velký, tak už člověk většinu těch věcí ani nepotřebuje, buď se mu nehodí nebo nevejdou. Odměny jdou kvalitou dolů. Asi je to daň za velký město. Hra mně baví, líbí se mi její grafika, ale brala bych zpomalit."}, {"31": "Úlohy k nadchádzajúcej Májovej udalosti sú v tejto chvíli zverejnené v prehľade. Prehľad udalosti sa tak týmto stal kompletným."}, {"2": "ovlivní nové tržiště vzorce na produkci semene a uriny?"}, {"214": "Tohle se teď objevilo na Facebooku: [BR][BR]Zdravím všechny,[BR]Byl jsem informován mým obloukem, abych podal oficiální stížnost na Inno Games. Tak to je moje otázka, jak někdo může podat stížnost na Inno games?[BR]Minulý říjen proběhla akce v Elvenaru.[BR]potom bylo dobrodružství Fellowsip.[BR]potom proběhla další akce se sovou,[BR]potom další FA.[BR]Další akce s Phoenixem.[BR]další další FA.[BR]a teď mi bylo řečeno, že od 4 května 2021. se koná akce Fairy Queen[BR]Tohle je prostě moc. tyto události a FA trvají přes 1 nebo 2 hodin denně, někteří z nás mají rodiny a práci. Tak hrajeme Elvenar, abychom si odpočinuli a bavili se, ne dělat odznaky a sbírat artefakty, abychom získali nespočet cen,[BR]Chci podat reklamaci na INNO hry, poradí mi prosím někdo, jak to udělat?[BR][BR]Takže si to nemyslím jen já, že je toho prostě moc. Překlad dělal Facebook."}, {"229": "Uplny nezmysel ,,,,  keď nechce nemusi hrať , nebudem sa tu ani radšej vyjadrovať k inteligencii takychto ludi ktory by chceli sa kvoli takemuto nezmyslu sťažovať na Inno "}, {"224": "Jak naložíme se svým časem je čistě věc každého z nás. Elvenar je dobrovolné rozhodnutí ten čas věnovat hře. [BR][BR]Např. když si půjdu zaplavat do akváče, tak nebudu žalovat poskytovatele služeb, že tam má moc vodních  atrakcí...ještě lepší je třeba jít na pouť a u pořadatele reklamovat, že tam má moc kolotočů... Tohle opravdu nechápu... [BR]Když to někomu vadí, proč to tedy hraje? [BR]Prostě event ignoruj nebo si vybírej jen to, co tě zaujme a to hraj, ostatní nech plavat.[BR]Taky nemusím mít všechny eventové budovy. Vím přece s předstihem, co ta budova nabízí a jestli ji budu chtít nebo ne..."}, {"2": "Omlouvám se za absurditu svého srovnání, ale něco jsi mi připoměl.[BR]V indii je případ kdy chlapec žaloval své rodiče za to že ho splodily aniž by se ho předtím zeptali jeslti chce.[BR]Jsou hry ketré se hrají jedou za den, stačí ti na to 10 minut[BR]Elvenar k nim nepatří.[BR]Tedy není to úplně pravda.[BR]Můžeš, ale tvoje město bude pajdat na obě nohy.[BR]Můžeš sem chodt každou hodinu.[BR]Nebo taky ne.[BR]co děláš a jak často je jen tvoje věc.[BR]Pokud máš pocit že Inno řídí tvůj život, měl by jsi to řešit u sebe."}, {"31": "Čo viac k tomu dodať, než len to, že Inno s týmto podnetom naloží adekvátne k jeho obsahu."}, {"196": "Mě by zajímalo jak by ta reklamace zněla? [BR]Dobrý den INNO, jmenuju se ........... a nechci ve hře tolik eventů a Dobrodruzstvi společenství protože to všechno nestíhám, je mi jedno že nejsou vůbec povinné a klidně je můžu ignorovat, nezajímá mě že je plno hráčů co to hrajou rádi a těší se na každej event JÁ prostě nemám čas využívat všechno co hra nabízí tak to kvůli MĚ všechno pěkně omezte abych byl JÁ spokojen."}, {"229": "@VStanikV[BR] asi tak "}]