[{"31": "Na portáli som vykonal zopár zmien a vylepšení v rámci prehľadu budov:[BR]Budovy je odteraz možné vyhľadávať pomocou názvu - slúži na to nový search-box v ľavej hornej časti,Každú budovu je odteraz možné otvoriť v samostatnom okne kliknutím na malú šípku napravo od jej tabuľky - toto konečne umožňuje odkazovať sa na jednu konkrétnu budovu v zozname (ID budovy sa vkladá do adresy v novom okne, takže skopírovanie a zdieľanie tejto adresy automaticky presmeruje hráča na danú budovu),Plná podpora setových budov - nadchádzajúca udalosť mi z toho spravila prioritu; príklad zobrazenia setových detailov budovy môžete nájsť napríklad pri tejto budove."}, {"2": "Na betě je ve věži set knihovny"}, {"11": "a artefakty žádný?"}, {"20": "Taky jsem si všimla, že ve věži na betě je zpět set knihovny. Artefakty zatím nevidět  Ale jsem ráda, protože doufám, že obnovím staré sety."}, {"11": "měli bejt prý medvědi, na malým světě se na ně někteří těšili, ale třeba je jen týden, dva pauza."}, {"31": "Údajne tam bolo nejaké pracovné voľno, kvôli ktorému zrejme nestihli nahodiť vežu s artefaktmi včas. Počítal by som preto, že to je len chyba a na náš server sa veža s knižnicou nedostane (ani by to nedávalo logiku, vzhľadom k tomu že spojovacie činidlá budú odmenou v nasledujúcej udalosti - asi by ju nechceli ukracovať o záujem..)."}, {"16": "Na betě začal event (bez DS mezi eventy).[BR]Odměnou je set s činidlem.[BR]Za poslední úkol je bohyně po dvou eventech s portréty.[BR]Systém 3 beden.[BR][BR]ps: Jedna novinka:[BR][IMG]https://i.ibb.co/6mBPzDv/https-cz-forum-elvenar-com-index-php-attachments-1621329346590-png-5504.png[/IMG][BR]Odměny z tohoto zřejmě budou souviset s množstvím splněných úkolů (tzn. pokud je moje doměnka správná, po splnění témeř všech úkolů (70/75) dostane hráč odměny ve zlatém baneru.[BR][BR]ps: Ještě jsou tam ty top x%, takže ty body mohou být jen vstupní podmínka a co vlastně hráč dostane bude záležet na více věcech, které teď nevíme."}, {"3": "je lepší, než knihovňácký set?"}, {"16": "[IMG]https://i.ibb.co/zZCF4fD/https-cz-forum-elvenar-com-index-php-attachments-1621331384429-png-5505.png[/IMG][IMG]https://i.ibb.co/CtCkHfq/https-cz-forum-elvenar-com-index-php-attachments-1621331406237-png-5506.png[/IMG][IMG]https://i.ibb.co/3F4zKfS/https-cz-forum-elvenar-com-index-php-attachments-1621331429249-png-5507.png[/IMG][IMG]https://i.ibb.co/Ydqm0Kc/https-cz-forum-elvenar-com-index-php-attachments-1621331446664-png-5508.png[/IMG][IMG]https://i.ibb.co/JvRdTjR/https-cz-forum-elvenar-com-index-php-attachments-1621331468232-png-5509.png[/IMG][IMG]https://i.ibb.co/8x95W89/https-cz-forum-elvenar-com-index-php-attachments-1621331493456-png-5510.png[/IMG][IMG]https://i.ibb.co/qCGhfC2/https-cz-forum-elvenar-com-index-php-attachments-1621331513888-png-5511.png[/IMG][BR][BR]Záleží.[BR]Pokud půjde získat více než 1 Pilgrim's Manor, tak při šikovném poskládání čistě z hlediska činidel, by být lepší mohl.[BR]Jestli ne, je Knihovna menší.[BR]Ale zase relikvie, které to poskytuje, jsou ty, ze kterých se vyrábí právě činidlo, takže pro města méně turnajově aktivní by to mohla být varianta."}, {"66": "A semínka nikde? Zklamání[BR][BR]Ta liga mi připomíná trofeje pro nejaktivnější hráče eventu ve Forge of Empires."}, {"31": "Júnová udalosť 2021[BR][BR]Spoiler: Júnová udalosť 2021[IMG]https://i.ibb.co/CHpS6P6/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-june2021-mainbanner-sorcerers2021-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]Všetky nové budovy z tejto udalosti sú zverejnené na portáli, pripravený priestor na denné odmeny je tu.[BR][BR]Setové budovy sú od tejto chvíle na stránke plne funkčné, takže je možné ich zobraziť so všetkými detailami.[BR][BR]Prehľad udalosti je dostupný tu. (bude doplnený)"}, {"88": "Set vypadá velmi zajímavě, ovšem kde vzít na něj místo... [BR]iDavis, díky... "}, {"16": "ps: K lize:[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/sorcerers-homecoming.16705/#post-98810\t\t[BR]Jestli to chápu správně, záleží hlavně na % mezi hráči hrajícími event (kouzelnické tyče se získávají za použití eventové měny) a každou hodinu se přepočítá minimální množství kouzelnických tyčí potřebných pro jednotlivé ligy a hráči se přeřadí do jednotlivých lig.[BR]Takže na konci eventu dostanou hráči další odměny navíc dle aktivity (získané čarotyčky) v porovnání s ostatními hráči eventu.[BR]Takže se to bude poměrně hodně míchat během dnů s populárními denními odměnami a v poslední den, kdy hráči utratí zbytek eventové měny.[BR][BR]Tzn., jestliže budu patřit mezi 20% hráčů s největším počtem čarotyček(bronz), dostanu nakonci navíc 20VB,5KR, a Pojízdnou knihovnu.[BR]jestliže budu patřit mezi 5%(stříbro), dostanu nakonci navíc 35VB, 8KR, Ruské Kolo a jednu z budov setu."}, {"88": "Odměny za ligu získáte až po skončení eventu.  [BR]Do ligy se počítají pouze aktivní účastníci eventu.[BR]Každou hodinu se ligy přepočítávají, přičemž se mění umístění hráčů podle aktuálního použiti eventové měny, a podle toho, jak se umisťují z hlediska procentuálního omezení každé ligy. To také způsobí, že se minimální požadavek pro každou ligu stane dynamickým.[BR]Jakmile je hráč s nejnižší úhradou eventové měny stále umístěn v jedné z lig (na základě procentuálních skupin), stane se z požadavku Ligy požadavek výše úhrady eventové měny hráči.  [BR] Poslední výpočet proběhne 1 hodinu před koncem události. [BR] Jsme si vědomi, že na konci akce můžeme mít v lize více hráčů, než by to umožňovaly její vlastní omezení, když mnoho hráčů zaplatí stejnou částku eventové měny. Toto je „bonus“, který v takovém případě těmto hráčům poskytneme. [BR][BR]Vcelku to chápeš správně, Lovče..."}, {"66": "Asi budu klidnější, až uvidím video ze hry. Nebo až si to vyzkouším v prvním eventu s touto mechanikou.[BR][BR]Ta část \" Jakmile je hráč s nejnižší úhradou eventové měny stále umístěn v jedné z lig (na základě procentuálních skupin), stane se z požadavku Ligy požadavek výše úhrady eventové měny hráči. \"[BR][BR]Mám to chápat, že kupříkladu hráč spotřebuje všechnu měnu v jeden den na začátku, dostane se do zlaté ligy a zůstane v ní do konce eventu i po posledním přepočítání. A jeho spotřebovaná měna bude minimální požadavek do zlaté ligy?"}, {"2": "já to chápu tak, že to je prostě žebříček kolik kdo získá holí a ude se přepočítávat každý den[BR]Ale součástí ceny jsou i hole, takže to asi dostaneš dřív než nakonci.[BR]asi chtějí odměnit ty co kupují eventovou měnu"}, {"31": "Prepočítava sa to každú hodinu, na percentá. Napríklad v zlatej lige môže byť jedno percento hráčov. Na obrázku vyššie je znázornených 70 potrebných palíc na to, aby sa hráč dostal do tejto ligy - v momente vytvorenia toho obrázka malo teda 70+ palíc len 1% hráčov. Každú hodinu budú ale hráči pribúdať a teda na tú ktorú ligu bude potreba stále viac a viac palíc.[BR]Odmeny sa rozdajú na konci udalosti - teda podstatná bude pre hráča tá liga, v ktorej bude na konci udalosti."}, {"16": "Ona je otázka, kolik hráčů vlastně event hraje a kolik z nich si eventovou měnu přikoupí. Od toho se bude odvíjet šance na 1% pro hráče, kteří se eventovou měnu nepřikoupí.[BR](při 5000 hráčích je 50 v 1%, při 15000 to je 150, při 500 jen 5)[BR][BR]@Prealiena Zřejmě to bude tak, že když použiješ eventovou měnu první/druhý den (za předpokladu splnění dostatečného množství úkolů), tak tě to vyšvihne na stříbrnou/zlatou, kde zůstaneš do doby, než další hráči budou točit denní odměny a tak tě předeženou. Takže ve dny s populárními denními odměnami to bude zřejmě dost skákat a totéž se bude dít v poslední dny eventu, kdy hráči budou používat zbytky eventové měny.[BR][BR]@iDavis Ony ty hodnoty jsou tam od začátku eventu (nebo krátce po něm), takže je možné, že jsou to hodnoty výchozí a ještě moc hráčů odměny netočí, takže se to nehýbe."}, {"229": "No pokial sa tam budu započitavať nakupene eventove meny všetko straca svoju krasu a myšlienku"}, {"66": "Jde mi o to, jak moc bude potřeba točit poslední den. Jestli to mohu vyházet pár dní před koncem, když tam bude něco lepšího, nebo musím šetřit na poslední den, aby mě nevyřadili níž hodinu před koncem."}]