[{"31": "@Darkness2613 nový rad rozšírení pridaný nebude."}, {"29": "Portál elementálů 1. level[BR][BR]Spoiler: Portál"}, {"29": "@GorGlin  potěším tě, poblijón ti z města zmizí.[BR]Ve spoileru máš ocelárnu na lvl 24 a ta druhá je na lvl 25, už se konečně uzdravil a nezvrací. [BR][BR]Spoiler: ocelárny"}, {"72": "Jojo, už má bypass přímo ze žaludku [BR][BR]Pěkný budovy."}, {"2": "Velké díky autorům i tobě Santerr"}, {"28": "Přidávám avatary elementálů a musím říct, že se jim moc povedli [BR]Spoiler: Avataři[IMG]https://i.ibb.co/XtMkS99/https-cz-forum-elvenar-com-index-php-attachments-a-jpg-2010.jpg[/IMG][BR][BR][IMG]https://i.ibb.co/gTvypgB/https-cz-forum-elvenar-com-index-php-attachments-b-jpg-2011.jpg[/IMG][BR][BR][IMG]https://i.ibb.co/vHQfy7f/https-cz-forum-elvenar-com-index-php-attachments-c-jpg-2012.jpg[/IMG][BR][BR][IMG]https://i.ibb.co/V9k8GYs/https-cz-forum-elvenar-com-index-php-attachments-d-jpg-2013.jpg[/IMG][BR]Na betě aktuálně probíhá nové dobrodružství společenství. Již jsem tu jednou zmiňovala, že přibudou nové dobrodružné předměty. Více infa k nim ve spoileru. Také ve spoileru najdete info k novým odměnám. Pro mě osobně zklamání [BR]Spoiler: DobrodružstvíNové dobrodružné předměty:[BR]Wand – získej 1x kouzlo „Magická výroba“ + získej x prken (zavísí na kapitole, ve které se nacházíte)[BR]Magic Potion – získej 1x kouzlo „Magický dar“ + získej x elixírů (zavísí na kapitole, ve které se nacházíte)[BR]Witch Hat – získej 1x kouzlo „Síla zásob“ + získej x hedvábí (zavísí na kapitole, ve které se nacházíte)[BR][BR]Nové odměny v jednotlivých fázích:[BR]1. fáze – potulný kupec I + 2x požehnání na 3 VB + požehnání na 5 VB[BR]2. fáze – potulný kupec II + 2x požehnání na 7 VB + požehnání na 10 VB[BR]3. fáze – potulný kupec III + 1x požehnání na 15 VB + požehnání na 20 VB[BR]VB lze použít jen v divech (vlastních i spoluhráčů)[BR][BR]Odměny za umístaní v žebříčku – jako minule zesilovače a pro první tři spolky hlavní odměny z podzimní události."}, {"77": "Ano ty Avataři jsou moc pěkné, na tom zapracovali moc pěkně. Ale máš pravdu, že k té hře \"dobrodružství společenství \"odměny nic moc zas nejsou. Myslela jsem , že to více změní, též zklamání."}, {"29": "@Thespia Také jsem z dobrodružství zklamaná... Na to, jak to ztížili, ty odměny nejsou nic moc."}, {"66": "Já jsem za to ráda. Nechce se mi používat akademii a užírat si relikvie na sentient zboží.[BR]Tak se alespoň nemusím hnát za nějakou extra dobrou odměnou. [BR](Požehnání na VB jsou dobré, ale sami o sobě za to nestojí.)"}, {"29": "@PWMOON  tady "}, {"74": "Tlačítko \"Delete\" bude v případě Elementálů asi nejpoužívanější..... takže se nehrnu do toho získávat nové budovy v Eventech a jiných akcích, když nebudou kam dát....[BR]You will want to prepare to really reconsider your city needs and layout. [BR]The Elementals settlement is very big; you will need no fewer than 456 grid squares which equates to 18.3 expansions' worth of space in order to fit the full settlement.[BR]This will likely take some considerable changes to your city layout and the number of other buildings you decide to keep."}, {"74": "Ohledně těch obsazených polí to znamená, při využití 100%!!! Nezapomeňte na mezery atd....Nicméně vývoj provází též Quest a tím pádem je potřeba mít jistou skladbu budov:[BR][BR]Based on the required quests for the chapter, the full Settlement Layout will require:[BR][BR]♦  Portal[BR]♦  8 canals[BR]♦  3 Air Manifestations[BR]♦  3 Fire Manifestations[BR]♦  5 Earth Manifestations[BR]♦  4 Water Manifestations[BR]This is a total of 456 squares........"}, {"78": "Ahoj jak velky jsou ty lvl23+ T1 manufaktury ?"}, {"66": "@torakus Lze zjistit na Elven architekt[BR]http://www.elvenarchitect.com/buildings/[BR][BR]vedle type zaškrtni \"goods\" a omezíš to na manufaktury.[BR]Dále při rozkliknutí určité budovy to zobrazuje velikost v každém levelu."}, {"72": "silversnake > to je cca 4x4,5 pole, draci nezabírali o moc méně ne?[BR][BR]Ale rozhodně jsem pro, aby se s novým obsahem přidala i možnost kam ho umístit, ne nutit hráče aby si vybíral co bourat."}, {"16": "No u další rasy by přidat další rozšíření(včetně zvýšení limitů na provincie a max. velikost města) určitě měli, troufnu si tvrdit, že nedostatek místa a obětování budov ve stylu elementálské kapitoly většina hráčů zkousne, ale pokud by se to mělo opakovat i další kapitole, tak už tomu tak být nemusí.[BR][BR]@Silversnake Já při každém čtvrtletním eventu nahrazuju starší budovy novějšími, takže mi o moc více místa nezabírají (ne jen ty se stejnou velikostí, takže mě při každém získání budov čeká menší rošáda části města). Např. z předchozích eventů už mi zůstaly pouze Eldrasilské síně, vše ostatní už je nahrazeno. A u jarního eventu předpokládám, že to vyměním komplet všechno (a to nejen proto, že v té době už budu mít po orcích a budou mě zajímat i budovy na manu)."}, {"78": "Hmm takze 4x5, to jsem tedy tipoval dobre. Takze je to 18 policek navic oproti lvl23, kdyz pocitam 6 T1 a 3 T4 manufaktury "}, {"29": "Tak mám pro vás pár dalších obrázků, ať se máte na co těšit. [BR]Portál elementálů na druhé úrovni[BR]Spoiler: Portál 2[BR]Následují jejich dílny:[BR]Manifestation of water + fire[BR]Spoiler: Voda + oheňManifestation of air + earth[BR]Spoiler: Vzduch + země(To s těma lodičkama a mostíkama, co tam je místy vidět jsou ty spojovací kanály)[BR][BR]Manufaktury na mramor level 25 a 26[BR]Spoiler: mramorárny[BR]Manufaktury na prkna level 24 a 25[BR]Spoiler: prkna 24Spoiler: prkna 25"}, {"77": "\"Santerr\"     Opravdu díky moc za ty nádherné ukázkové budovy, už se nemohu dočkat až se to spustí ty Elementály. "}, {"79": "To je tak hezký  už se těším až se budu chodit kochat pokrokem k vám co na elementály dosáhnete"}]