[{"16": "@Prealiena Hodinu(spíše 2) před koncem tě vyřadí maximálně ti, co si eventovou měnu dokoupí. Jinak je úplně jedno, jestli vše vytočíš průběžně anebo na poslední chvíli.[BR]Jak moc nebo málo to bude skákat, to si budeme muset vyzkoušet."}, {"2": "sežen co nejvíc svitků a za ně co nejvíc holí"}, {"4": "Jejda, takový krásný set - škoda, že jeho velikost je 40 políček, takže s vysokou pravděpodobností zůstane pouze v inventáři.  Jinak umístění v prvních ligách jsem už předem oželel, protože tu chaloupku, co dává dvojnásobek měny kolem města nikdy nekupuju, za dia taky ne a budíka si kvůli tomu nočnímu sběru dávat nebudu. Maximálně jsem ochoten nakrmit toho ptáčka z minulého eventu ."}, {"221": "jak to tady ctu myslim totez chteji aby si lidi koupili svitky nez jsem prisla na to jak to je s tema odmena bonusovejma tak jsem z nich mela radost ... podelaj kde jaky event ktery vypada ze by mohl byt nejaky lepsi"}, {"3": "no, ono je to s těmi procenty otázka. Jestli je to limit nebo jen ukazatel... jinak, set krásný, ale pro mě k ničemu a radši si nechám knihovny. T3 se hodí víc, než T1 atd"}, {"2": "Mě na těch ligových odměnách mrzí, že knihovnička je jen jednou.[BR]Event odehraju jako vždy a nebudu řešit kam se v lize umístím, ale kdybych si mohl vybrat, určitě raději knihovnu než kolotoc"}, {"3": "GorGlin napsal/a:\t\t\turčitě raději knihovnu než kolotoc\t\tKlikněte zde pro zvětšení...Poulíček by z tebe neměl radost..."}, {"20": "Poslední dobou eventy hraju tak nějak ze zvyku levou zadní  . Prostě odehraju úkoly cestou nejmenšího odporu, nečekám zisk extra odměn a jsem v klidu. Občas padne něco přínosného, tak dobrý.[BR]Nový set mě nenadchl, takže to bude \"písnička na stejnou melodii\". Alespoň mám víc pohody na to, abych se věnovala kapitole."}, {"2": "@Emhyr var Emreis II [BR]Lenin no,[BR]Učíť sa, učíť sa, učíť sa.[BR]Jsem ze staré školy"}, {"16": "Eventová liga na betě se začala hýbat:[BR]Na zlatou už nestačí 70, teď je to 80.[BR]Ostatní zůstaly zatím stejné.[BR][BR]edit:[BR]Aktuální liga (20.5. 8h (3. den eventu)):[BR]12-30-57-89[BR][BR]edit 2:[BR]Pro info jak se vyvíjí liga na betě (informace jsou obvykle z večera nebo podvečera, tzn. z cca 17-21 hodiny):[BR]Den.....Amatér(50%)/Bronz(20%)/Stříbro(5%),Zlato(1%)[BR]1. den...10/30/50/74[BR]2. den...10/30/50/80[BR]3. den...15/36/74/109[BR]4. den...20/51/92/140"}, {"2": "Tušíte někdo co má být ta novinka v turnajích?[BR]Já si na betě ničeho nevsiml"}, {"16": "To je novinka i pro hráče bety. Prostě to vyskočilo tady na cz.[BR][BR]Mimochodem, stav ligy 10. den:[BR]52/123/196/229 (já jsem se 169 aktuálně v bronzové, 8. den jsem vybíral denní odměny)."}, {"3": "@Lovec Krys a pořád drží ty procenta - tedy že golden league je jen pro první procento?"}, {"31": "Plánuje sa zavedenie trofejí v rámci turnajov. V tejto chvíli ešte nie je jasné, koľko bude ktorá trofej vyžadovať (súčasné hodnoty asi nie sú finálne), ale zrejme to bude v závislosti od počtu získaných truhiel (podobne, ako sa momentálne získavajú trofeje z veže za 4, 8 resp. 12 miľníkov, budú trofeje z turnajov, podľa aktuálnych čísel za 5, 10 a viac ako 10 turnajových truhlí). Či tieto trofeje budú mať iný význam ako nálepka spoločenstva je zatiaľ neznáme."}, {"3": "co by tak v nich mohlo být za odměnu... je to z turnajů, takže bych tipl nějaké ty VB instanty, možná pár KR..."}, {"2": "Nebo to bude jako ve věži[BR]Dostaneš odznacek"}, {"3": "pravda, ty odměny nejsou za ty trofeje, jako takové... nicméně v oznámení se o odměnách mluví"}, {"88": "No, víme přece, co se tu všechno prezentuje jako \"odměna\"...   [BR]Počkám, co z toho nakonec ve finále vypadne, zatím se zdržuju dalšího komentáře."}, {"4": "a můj typ je, že odměnou bude nějaký pěkný obrázek [BR][BR]@Emhyr var Emreis II - na betě jsou ligová procenta stále stejná[BR][BR]Příspěky sloučeny. Embla"}, {"3": "no, jedno procento je hodně málo..."}]