[{"16": "Aktuální stav 69/155/221/255.[BR]Dle mého je zlatá více méně o utracených dia (+ pár extrémních šťastlivců) (neboli v angličtině pay to gold).[BR]Ostatní aktivní se budou prát o stříbrných 5%."}, {"211": "Avizace změn k turnajům = jedno velké zklamání a palec dolů. Opět se zdá, že se budou snažit napravit nedomyšlené vývojové změny dodatečnými zásahy a vytloukat klín klínem (turnajem). Nu, uvidíme."}, {"3": "taky jsem na facebooku zahlídl screen, ze kterého jsem na první pohled spíš rozpačitý"}, {"211": "měli to nazvat \"řešení pro brekalíky hrající naše nové rychlokvaškové kapitoly aneb antiturnajové změny\"[BR]snad jen čtu moc mezi řádky, ale jestli to tak bude, pak snad se \"angličtináři\" na Betě včas ozvou a zavedení změn se nedočkáme"}, {"16": "@Trumpetka Uvidíme zítra. A na názoru hráčů na betě nezáleží (jinak by nové turnaje nebyly nikdy nasazeny v aktuální podobě)."}, {"18": "Ano opravdu uvidíme, ale taky stoho nejsem moudrý a tak uvidíme."}, {"2": "Na mě to dělá dojem, že hlášené přidání budou opravdu jen odznáčky.[BR]Zbytek změn je jen přerozdělení, takže kdo hraje aspoň jednu stranu na šest kol pravidelně nepozná rozdil"}, {"11": "tak co je teda novýho v tom turnaji?"}, {"88": "Jestli se to ukáže až po pár odehraných provinciích tak nevím, normálně žádná změna vidět není... "}, {"18": "tak já z osmi dostupných provincií v prvním kole krom elixíru postupně všechny relikvie"}, {"16": "Změnily se relikvie na výrobu kouzel (na betě mám stejné bonusy jako na cz1, tak to můžu ukázat takhle) (kouzlo/stará cena/nová cena):[BR][IMG]https://i.ibb.co/jD7bVvQ/https-cz-forum-elvenar-com-index-php-attachments-1622604755911-png-5550.png[/IMG][BR][BR]A zpřeházely se odměny v turnaji (lépe to je vidět na str. 2 (prov. 9-16)):[BR][IMG]https://i.ibb.co/ss30gNk/https-cz-forum-elvenar-com-index-php-attachments-1622604193664-png-5548.png[/IMG][IMG]https://i.ibb.co/mG8tDnV/https-cz-forum-elvenar-com-index-php-attachments-1622604225674-png-5549.png[/IMG][BR][BR]Malá města možná budou mít rovnoměrnější růst relikvií(a bonusů), ale obvyklá strategie spousty hráčů se soustředit na jeden nebo několik turnajů s danými relikviemi na zvýšení jednoho bonusu anebo výrobu jednoho kouzla jde touto úpravou do háje.[BR][BR]ps: A jestli je má úvaha správná, tak nejvíce biti na tom budou hráči vyrábějící nepřetržitě kouzlo Magická výroba v akademii lv5.[BR]Doposud jim stačilo nahrát něco přes 7k bodů ve dvou turnajích z 9, teď těch 7k bodů musí nahrát ve všech turnajích, jinak neudrží nepřetržitou výrobu kouzla Magická výroba bez ztráty relikvií, ze kterých se vyrábí. (pro hráče vyrábějící pouze činidla to číslo bude nižší, jelikož je levnější)."}, {"2": "Kdo otevře hromadu provincii, tam se to asi srovná, ale s prvními devíti, je prachovi turnaj na prachové relikvie ten nejhorší."}, {"211": "Po avizacích jsem čekal změnu v turnajích, tj. něco nového, vylepšení, inovaci... Místo toho obrovská blamáž. Jako když místo programátora zaplatili někoho, kdo si jen hrál v tabulkách a přehazoval a přehazoval. No fajn, úroveň holt klesá, ať si ho platí, ale proč to cpou do hry? I nasazení na Betu je ostuda.[BR]Celkem dobře to na Beta fórum schytávají, pár hlasů sice přepapouškovalo část oznámení a jako že to bude \"optimalizace\", ale z těch měl každý srandu (ti ať se dají na politiku), argumentů proti tam zaznělo hodně a fakt mnoho dobrých."}, {"20": "Řekněme změna pro změnu. Chápu, že pro začínající hráče je to pomoc, aby brzo měli základní počet relikvií, ale nevím, proč se má hra pořád přizpůsobovat začátečníkům. Samozřejmě, že odzvonilo snaze některých hráčů hrát silný turnaj pro zisk určité relikvie. Já už delší dobu hraju pořád ve zhruba vyrovnaných výsledcích, ale i tak se mi změna nelíbí."}, {"88": "@Lovec Krys: to bude závislé na našich vlastních bonusech? U sebe nepozoruju žádnou změnu v ceně za výrobu, mám relikvie pořád stejné...    [BR]@Ludi: Já \"přizpůsobení\" vidím nejen zde. Tady se vychází neustále vstříc novým hráčům snad ve všem, a takový FB má předělaný vzhled jak pro děti z pomocné školy, všechno velké a přehledné (a ošklivé). Snad nás nečeká to samé, aby to začátečníci (nebo aby se ti méně bystří necítili diskriminováni) měli ještě jednodušší.   Člověk jim věnuje jednu z toho mála věci, co nelze koupit (svůj čas) a místo toho, aby si alespoň trochu vážili komunity dlouholetých hráčů, tak podstrojují začátečníkům, co toho obvykle nechají při prvním problému, nebo když je to po dvou, třech levelech přestane bavit. Spousta lidí neudrží pozornost u něčeho delší dobu s poměrně trapnou výmluvou \"protože YOLO...\""}, {"16": "@Vicky1177 Relikvie na kouzla je závislá na bonusech i teď. Pouze se posunují některé relikvie na jiné.[BR]Můj obrázek platí na bonus dřevo/hedvábí/drahokam. Hráči s jiným bonusem tam budou mít jiné relikvie, pouze posun bude stejný.[BR]Orientace na nové hráče vychází nejspíše z logiky, kdy se snaží zachytit co nejvíce nových perspektivních potencionálních platících hráčů (a to zřejmě i za cenu vysokého průtoku - začne hrát, utratí nějaké peníze a za pár týdnů/měsíců jde hrát něco jiného)."}, {"88": "@Lovec Krys: já mám aktuálně toto a změny jsem si nějak nevšimla... [IMG]https://i.ibb.co/tsWy2kV/https-cz-forum-elvenar-com-index-php-attachments-04-jpg-5552.jpg[/IMG][BR][BR]Bonus: hedvábí / svitky / ocel"}, {"2": "Změna je zatím jen na betě"}, {"88": "@GorGlin: Dík, to vše vysvětluje. "}, {"11": "aha a co znamenají ty 4VB v druhým kole? To je na betě normální nebo to snížili?"}]