[{"16": "Rozdělili. Ten pátý je přesunut do 1. kola a z 5. do 3. a 4. Takže pokud se nepletu, tak kromě 6. kola dostaneš z každého střetu nejméně 1VB."}, {"11": "tak to je trochu výhoda pro ty co na pátý kolo už moc nemají."}, {"4": "tak přísun VB by měl být trochu vyšší a přísun relikvií rozložený - místo velkého množství jednoho druhu dostaneme nic, ale zato od všeho [smilie--sprite2]. Naštěstí mě už relikvie nějak moc netrápí [smilie--sprite7]"}, {"3": "já nechci rozložený přísun VB, já je chci hromadně, ať se to dá měnit... co to tam sedí za šašky. Oni tu hru snad nehrajou [smilie--sprite2]"}, {"2": "Nesnížili, jen máš jeden bod už v prvním kole [BR]Body budou v součtu stejne, jen je rozdrobil do všech střetu[BR]Zatím se zdá že jedine šesté kolo bude bez VBcek"}, {"31": "V tejto chvíli naplánovaný termín júnovej udalosti je v prehľade. Rovnako som doložil aj zoznam doposiaľ známych úloh a zostávajúce obrázky a tabuľky. Denné odmeny udalosti sú vedené na portáli."}, {"223": "@iDavis ad nový event, jde někde dohledat jak vypadá složený celý set budov Poutníka?"}, {"31": "@Mescal výťažok z grafiky v hre:[BR][BR]"}, {"11": "dává vůbec nějaký VB ?"}, {"20": "@voyager-1 tenhle set nedává VB. Je tam jedno spojovací činidlo, surky a 3 relikvie ..."}, {"2": "Ne, dává lepidlo, tři runy na druhé lepidlo a k tomu základní surky"}, {"11": "tak to radši vrátím potřetí set obchodníků a nějakou knihovnu."}, {"17": "Trumpetka napsal/a:\t\t\tPo avizacích jsem čekal změnu v turnajích, tj. něco nového, vylepšení, inovaci... Místo toho obrovská blamáž. Jako když místo programátora zaplatili někoho, kdo si jen hrál v tabulkách a přehazoval a přehazoval. No fajn, úroveň holt klesá, ať si ho platí, ale proč to cpou do hry? I nasazení na Betu je ostuda.[BR]Celkem dobře to na Beta fórum schytávají, pár hlasů sice přepapouškovalo část oznámení a jako že to bude \"optimalizace\", ale z těch měl každý srandu (ti ať se dají na politiku), argumentů proti tam zaznělo hodně a fakt mnoho dobrých.\t\tKlikněte zde pro zvětšení...Ahoj, dovolím si připomenout, že beta verze her (a tím myslím beta verze všech her, nikoliv jen Elvenaru) existují od toho, aby vývojářské týmy mohli jednotlivé funkce testovat, upravovat, doplňovat a různě balancovat. Určitě se nejedná o místo pro prezentaci finálních produktů.[BR][BR]Což znamená, že pokud se něco objeví na betě, tak to rozhodně nezaručuje, že něco takového se objeví i na české verzi. V tuto chvíli neexistuje žádné konkrétní datum, které by stanovovalo, kdy dojde k nahrání turnajových změn i k nám. Ano, turnaje se budou přepracovávat, každopádně co se týká jednotlivých změn a úprav, tak nic není pevně stanovené. Pakliže nejste s danými úpravami spokojeni, velmi rádi uvítáme vaši zpětnou vazbu v příslušném tématu na betě. Děkujeme. [smilie--sprite1]"}, {"211": "Kéž bys měl pravdu![BR]Bojím se, že Betu poslední dobou používají jen k odchytání chyb od hráčů, ale nikoli k respektování zpětné vazby.[BR]I tady zaznělo v nápadech, že třeba kouzlo Magická výroba je v turnaji málo a pozdě dostupné, chtělo by ho to předřadit a promíchat se Silou zásob a Magickým darem (co se týče množství, nevím, jestli to změna řeší - na Betě mám jen malý účet nedostatečný k otestování)[BR]Magická výroba a činidlo se tluče v relikviích na jejich výrobu - změna v relikviích je Ok.[BR]Ale na to stačí oznámení k nové verzi a prostě to udělat![BR]Ty další kroky jsou fackou původním lidem, kteří něco vymysleli a nastavili. Z turnaje si nyní dělají nástroj k řešení čehosi (netuším čeho, s avizací to nesouvisí, nikdo z hráčů v posledních kapitolách nepotvrdil, že by byl bez relikvií - ono po tolika letech hraní by to i znamenalo, že na turnaje léta kašlali)."}, {"31": "Na bete už je vidieť nové trofeje, získané za uplynulý turnaj:[BR][BR][IMG]https://i.ibb.co/CvrW0gy/https-i-ibb-co-Rv-Yz-Zg-J-EL-beta-trofeje-png.png[/IMG][BR][BR]Prvá trofej (zľava) je získaná za dosiahnutie 10. truhly (teda za turnaj sa dá získať len raz) a druhá je za každú získanú bonusovú truhlu (teda za jeden turnaj sa dá získať <=9x). Iný efekt trofeje zrejme nemajú, ale veľké plus v nich vidím najmä z dôvodu možnosti prezentácie spoločenstva a tiež niečoho, čo je možné v rámci spoločenstva nejakým spôsobom \"budovať\". Toto je niečo, čo podľa mňa v hre dlho chýbalo, hráči spoločenstva sa mohli zbaliť, odísť a vytvoriť úplne nové, pričom technicky bez stopy na strate predchádzajúcich výsledkov, čo podľa mňa bolo proti logike spoločenstva ako takého."}, {"20": "Není to tak špatný [smilie--sprite2]. Budeme pěkně ošperkovaný spoustou štemplů. Určitě je dobrá informace i o turnaji, protože doposud to vypadalo, jakoby turnaj byl méně než věž. Přitom, co se hry týče, obě disciplíny pokládám za stejně důležité, i když každá v jiném směru."}, {"2": "Kvalita společenství je velmi složité věc a každý to posuzuje subjektivně.[BR]Mám tři města ve třech světech a pro každé hledám jiné společenství.[BR]Ukazatel je to jistě zajímaví, ale vypovídající až se zpožděním.[BR]Když se společenství rozdělí, jestli v původní partě zustali ti či oni se projeví až za pár turnajů."}, {"19": "A ta poslední trofej je za co?"}, {"2": "že jsi ve věži dokázal vypotit jeden bod[BR]cenný to artefakt"}, {"20": "@Radvanus - to je kolik společných odměn - krystalů - společenství ve věži získalo."}]