[{"2": "nojo, žil jsem v bludu, je to tak"}, {"4": "Zítra začíná na betě DS, tak uvidíme, jaké budou odměny. Možná dají nějaké ty setové domečky ze stávajícího eventu?"}, {"66": "@pavelb Na první pohled se mi to zdá příliš dobré, aby to byla pravda. Leč na druhý pohled mě napadá: \"Ale co jiného by tam dali, aby ty lidi nalákali to vůbec hrát?\""}, {"169": "No mohli by dat poslední budovu eventu do setu.Ta poslední se bude získávat těžce :///"}, {"16": "Anebo tam budou artefakty z předchozí evo."}, {"18": "Dá se někde najít, lepší popis budovy ve třetí truhle DSka, pro novější kapitoly?"}, {"2": "Jako že nevěříš tomu, že to může být 4x4 lidokulturni hybrid?[BR]Pokud já vím, tak je.[BR]Je to velmi stará odměna z eventu .[BR]Ještě z dob kdy set neexistoval.[BR][BR]V poslední kapitole dává 11900 lidi a 10200 kultury.[BR]Jediné misto kde jsem ji našel je architect."}, {"18": "Ne jde mi spíš o to, porovnat si to s jinými podobnými budovami. Co mám třeba v inventáři či ve městě."}, {"11": "má ta budova nějakej název, nebo to ještě není vidět ?"}, {"2": "@voyager-1[BR][BR]Menhirok's Barrow                    "}, {"169": "To už tvůrčím docházejí nápady?Nemáme artefakty,tak tam prdnem hybrida a lidi budou šílet [smilie--sprite8] jako děkuji.První DS které ignorují [smilie--sprite8] Prosím vraťte slávu Elvenaru o 3 roky z5 kde každý event DS byla výzva."}, {"11": "no v přepočtu lidí na jedno pole je kolem třicátýho místa ale použitelná asi bude, ono navýšit dvě ver. skaliska3 taky něco stojí.[BR]https://www.elvenarchitect.com/buildings/details/a_evt_menhiroks_barrow/"}, {"126": "@CrazyWolf CZ  pro mě nejsrdcovější event je z 5.prosince 2016 - 7.ledna 2017 , a to Sněhová Záplava. Doba, kdy bylo ve hře 9.kapitol, kdy jsme byli ještě malí herní caparti a snažili jsme se urvat nejlépe všechny z 3.hlavních cen. A komu se to tehdá podařilo, a vydržel na dobu, než přišlo očekávané i pak nenáviděné update Eventových budov, kde jsem i já téměř 2.roky držel už hodně zastaralé 3.budovy, tak mu zůstaly nejlepší hybridy na populaci ve hře. A ikdyž mnohé špičkové budovy se několikrát v eventech opakovaly (Venaři, Aukce,  Útulný statek, Hvězdy...) Tak tyto 3 hybridy už se nikde více neobjevily.  [BR]Spoiler: Věž Krále zimy[IMG]https://i.ibb.co/tLw9G6d/https-cz-forum-elvenar-com-index-php-attachments-1623917424672-png-5569.png[/IMG]"}, {"31": "Letná udalosť 2021[BR][BR]Spoiler: Letná udalosť 2021[IMG]https://i.ibb.co/2ygr9mP/https-i-ibb-co-vh3-BQGv-EL-akcia-j-l-2021-banner-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]Všetky nové budovy z tejto udalosti sú zverejnené na portáli, pripravený priestor na denné odmeny je tu.[BR][BR]Okrem novej témy a grafiky tejto udalosti je novinkou aj nová rozvinuteľná budova, ktorá poprvýkrát prináša prepínateľný systém produkcie - podobne ako tržište od úrovne 6. Detaily tejto budovy sú dostupné tu.[BR][BR]Podobne ako predchádzajúca udalosť, aj táto prináša ligy s novými odmenami a novým finálnym avatarom:[BR][BR][IMG]https://i.ibb.co/7kM1RHS/https-i-ibb-co-d-PXC2-Yp-EL-akcia-j-l-2021-ligy-png.png[/IMG][BR]Budovy z ligových odmien:[BR][BR]Bronzová:[BR]1x Rozvážková knihovnaStrieborná:[BR]1x Obří ruské koloZlatá:[BR]1x Obří ruské koloPrehľad udalosti bude čoskoro dostupný tu."}, {"2": "Možná je to tím, že jsem na mobilu, ale nevidím to přepínání. Mezi kterými efekty se bude přepínat?"}, {"31": "@GorGlin medzi všetkými okrem kultúry a obyvateľstva. V každej kapitole na 10. stupni poskytuje 4 rôzne produkcie, medzi ktorými bude možné prepínať."}, {"2": "Aha, tak to ta čísla hned vypadají úplně jinak"}, {"31": "Doprogramoval som do portálu k novej rozvinuteľnej budove funkciu zobrazovania prepínateľných produkcií. Odteraz sú označené ikonou modrého krúžku, nad ktorou je možné podržať kurzor a zobrazí sa vysvetlenie.[BR]V prípade, že by niekomu po tejto aktualizácii zmizlo zobrazovanie hodnôt, aktualizujte stránku pomocou CTRL+F5."}, {"11": "použitelní tam jsou asi jen valoriáni pokud to jsou, v některých fázích semínka"}, {"2": "Valloriani a zásoby jsou tam od začátku, třetí linka jsou na začátku peníze a na konci živoucí vzácné zboží[BR][BR]V elfech ještě přibude mana, která se po dvou kapitolách změní na semeno[BR][BR]Konečně mám čas se rozepsat, tak mi dovolte trochu písmenek navíc.[BR][BR]Barák je bomba po grafické stránce, celý event mi přijde jak reklama na nejlepší aquapark na světě.[BR]Je fakt, že jako bydla z paneláku je těžké se na něco takového koukat, ale to autor nemůže vědět.[BR]Levlovací budovy pro mě měli trochu problém s tím, že jejich přínos byl rozdělen do mnoha aspektů a vlastně pořádně nedělali nic.[BR]Tohle je pro mě super věc.[BR]Otázka je, kolik si za to Inno řekne.[BR]Když na to kouknu z pohledu vojáka, valorianská čest lepší.[BR]víc kultury na pole i valorianů a to nemluvím o tom, že u valorianské cti, kterou můžu sbírat každých 6 hodin, nemusím řešit kdy mi výroba doběhne.[BR]Ani jiná produkce není zrovna dechberoucí.[BR]Chápu a souhlasím, že při kadenci eventů není možné roztáčet inflační spirálu, kdy každá další odměna bude trumfovat tu předešlou, ale pokud budovy, co můžu získat jinak, dají hlavní odměně na zadel, tak proč?[BR]Aktivní hráč, má dostatek budov, ale třeba i teleportů[BR]Můžu se složitě snažit získat Triumf přílivu a odlivu, který má spoustu nevýhod, včetně toho že ho není možné teleportovat, nebo postavit dva valoriany, které vyrobím v ŘV.[BR]Jsem na tom lépe, budovy můžu kdykoli uklidit, nebo nahradit nově vyrobenými bez investice KR.[BR]Já bych nerad aby to vypadalo, že jen kritizuji, taky si nemyslím, že sem píšu něco převratně objevného, jen bych nerad aby si někdo myslel, že neumíme počítat."}]