[{"230": "Produkce této budovy se opravdu nevyplatí, ani kulturně a ani počet obyvatel navíc na mě takový dojem neudělal, pokud nejsem začínající hráč, takže za mě, až dojde tenhle event na oficiální server -  pojedu hodně na pohodu a stavit budovu určitě nebudu."}, {"11": "GorGlin napsal/a:\t\t\tKdyž na to kouknu z pohledu vojáka, valorianská čest lepší.[BR]víc kultury na pole i valorianů a to nemluvím o tom, že u valorianské cti, kterou můžu sbírat každých 6 hodin, nemusím řešit kdy mi výroba\t\tKlikněte zde pro zvětšení...[BR]to jsem nějak nepochopil, ta budova by měla dát 2700 valoriánů za den a val. čest nějakejch 450 ne? I když má jen 9 polí"}, {"20": "Pro mě je to po dlouhé době dobrá budova. U rozvinutelných je vždycky problém že dávají od všeho trochu a tím v ničem nevynikají. Tady, v porovnání s jinými budovami, je slušná dávka semínek a solidní kultura. Bude tam možné volit produkci zboží. Úplně si nejsem jistá, jestli tam bude pro 18. kapitolu živoucí nebo osvícené? Valoriáni jsou dobrý bonus navíc."}, {"2": "@voyager-1[BR]ted jdi mě vyděsil, jestli nepíšu blbiny[BR]já řešil orky, kde je to pro mě aktuální, ale!!![BR]já to nedokážu zopakovat[BR]omlouvám se, ale napsal jsem nesmasl[BR]všem se moc omlouvám, ignorujte můj přírpěvek"}, {"11": "Ludi, nebude volba zboží a valoriáni jako bonus navíc, pojede jen jedna věc. Kladívka, semínka, zboží nebo Valoriáni. Pokud jsem to správně pochopil."}, {"20": "@voyager-1 máš pravdu, je to tak. Ale to vůbec není špatné."}, {"11": "není to nejhorší ale zase tam schází VB. Co takhle přepínač na třeba 5 nebo 10 VB za den  "}, {"16": "Ta semínka mohou pomoci hráčům s nízkou produkcí semen (tzn. těm, kteří se už dnes v produkci semen musí spoléhat na kulturky).[BR]Produkce pro kapitolu 18:[BR][IMG]https://i.ibb.co/V2BCbYG/https-cz-forum-elvenar-com-index-php-attachments-1624594524406-png-5582.png[/IMG][BR][BR]Jinak druhý den Manta Ray (mana). Se vsadím, že jako u vejce už do konce události nebude."}, {"2": "A dnes je kulturka s lidmi velká 20 polí.[BR]Něco takového dlouho nebylo."}, {"4": "@GorGlin - jo jo, krabí hotel de luxe, už mám 3 x v inventáři "}, {"221": "i ja si jednoho kraba urvala ale nevim co s tema kulturkama vsichni maji na cz mi hniji lode ve sklade holt nemam k temto kulturkam moc vztah radej si postavim neco na vyrobu"}, {"230": "Ahojky, mrkla jsem k iDavisovi a zatím - jestli mohu zhodnotit, tak tato událost tak úplně nové budovy nemá, kdo hraje pravidelně, mrkněte do inventáře, protože hotelkrab deluxe, rejnok - tak tyto budovy už tu byly (událost mořských panen, 2. vlna - jestli se nepletu), Leviathan (a jako naschvál je hned 1.den- jinými slovy šance mrňavá, tak hajdy do obchodu) je tu poprvé a jako kulturně-populační budova není špatná, celkem srovnatelná s útulným statkem."}, {"221": "tak jiste byly ale kdy neni lepsi je nahradit novyma a lepsime nez oprasovat ty zasle? osobne delam pravidelne cistky a jen na nektere budovy vyjdou rekostrukce"}, {"43": "zdravím, omlouvám se že to píši sem, ale nikdo mi neodpovídá a už mě to docela štve. Jde vám spustit hra? Mě po spuštění se objeví zatmavená obrazovka, kde je jen text, už půl dne to trvá..."}, {"221": "nevim nejspis bude problem u tebe me jde jak beta tak i oba cz servry"}, {"230": "Ano, je lepší získat aktuální budovy a staré vyhodit, ale kdyby se náhodou u některých nepoštěstilo, tak lze právě oprášit a vylepšit ty staré (byť to trvá déle). Prostě jet víc na pohodu ). A u toho Leviathana se chci omluvit za chybu - je o cca polovinu horší než útulný statek (jak kulturně, tak i na počet obyvatel)."}, {"31": "Čo do dnes vyzeralo nemožné a ako neprekonateľná technická výzva, čoskoro sa stáva realitou: Rozvinuteľné budovy bude možné vkladať späť do inventára (pomocou teleportovacieho kúzla).  Funkcia bola zavedená na betu, takže počítam, že v priebehu niekoľkých týždňov bude zavedená aj k nám."}, {"3": "a udrží si svou úroveň nebo klesnou na 1 a vrátí se artefakty nebo klesnou na 1 a nevrátí se nic? "}, {"16": "Vyzkoušeno:[BR][IMG]https://i.ibb.co/7SPkGrV/https-cz-forum-elvenar-com-index-php-attachments-1625217693018-png-5603.png[/IMG][BR]Teleportuje se celá budova i s úrovněmi.[BR][BR]V inventáři vypadá takto:[BR][IMG]https://i.ibb.co/sFLQG5h/https-cz-forum-elvenar-com-index-php-attachments-1625217810739-png-5604.png[/IMG]"}, {"20": "Už jsem to vyzkoušela na betě - teleportuje se budova a ve skladu je v patřičné úrovni rozvinutí. Jak jinak, že  . Takže za mě naprosto skvělá věc, to mi moc chybělo. Ještě by se to hodilo na divy, ale to asi nepůjde, protože jde o výpočet pro boj. Ale každopádně teleportace rozvinutelných budov je skvělá.[BR]Teď koukám, že Lovec Krys byl o minutu rychlejší  ."}]