[{"16": "Jinak rozčarování na fragmenty ukazuje stejnou cenu jako pro samotný základ (pro ty, kterým na tom záleží)."}, {"227": "Teleportace rozvinutých budov super, na divy by to taky nebylo k zahození "}, {"222": "Volejte sláva a tři dny se radujte  "}, {"2": "Já budu"}, {"11": "tak Ty máš co teleportovat v nouzi  Kolik jich máš?"}, {"3": "já třeba mám aktuálně ve městě (jestli dobře počítám) 14 4x4 rozvinutelných budov a 4 3x3 medvědy k tomu. To už může být pěkných až 260 políček v případě největší nouze..."}, {"11": "ted by se dal využít při eventech popelavej fenix, mě ale zbyly jen dva artefakty. Musí být na lvl 10 aby dával měnu. že?"}, {"20": "@voyager - na 10 lv. přidává Popelák 2% k eventové měně, v nižších lv. taky něco přidává v menších procentech."}, {"11": "jo, vypadá to, že dává 1% od začátku, no je to hodně málo a dvě nejsou o moc víc."}, {"231": "1% by mělo davat jednu měnu za ukol a čim lepši je popelavej fenix tim dřiv ti to skoči na 2 (ve vysledku je tahle vlasnost fenixe dle mě momentakně podhodnocena)."}, {"31": "Najbližšie dobrodružstvo je v tejto chvíli naplánované na 8.7."}, {"31": "V tejto chvíli naplánovaný termín udalosti Elvarianské hry nájdete uvedený v prehľade.[BR][BR]Zároveň, v rámci videa k udalosti som tentokrát po prvý raz prešiel na nový formát, v ktorom namiesto doterajších gameplay-ov k udalostiam, predstavujem najzaujímavejšie denné ceny, na základe výpočtov a usporiadaní na novom portáli. Video je zatiaľ dostupné iba v angličtine - mám záujem vytvoriť aj slovenské titulky, avšak zrejme budú dostupné až s oneskorením, podľa mojich časových možností.[BR][BR][BR]Všetky úlohy k nadchádzajúcej udalosti Elvarianské hry sú teraz rozpísané v prehľade."}, {"31": "Podzimní zvířetník 2021[BR][BR]Spoiler: Podzimní zvířetník 2021[IMG]https://i.ibb.co/W2q9D1L/https-i-ibb-co-Sv8-KCqt-EL-akcia-september-2021-banner-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]Všetky nové budovy z tejto udalosti sú zverejnené na portáli, pripravený priestor na denné odmeny je tu.[BR][BR]Novinkou tejto udalosti je tzv. funkcia Royal Pass. Hlavné odmeny sú zobrazené v novom okne, pričom okrem získavania klasických hlavných odmien, môžeme získavať aj odmeny Royal Pass, ktorý je možné kedykoľvek behom udalosti aktivovať za 1500 diamantov.[BR][BR][IMG]https://i.ibb.co/16rkMnp/https-i-ibb-co-9s9zqq-H-EL-akcia-september-2021-royal-pass-png.png[/IMG][BR]Podobne ako v predchádzajúcich udalostiach, prichádzajú aj ligy s nasledovnými odmenami:[BR][BR][IMG]https://i.ibb.co/8YvPqGC/https-i-ibb-co-NY6b-Qt8-EL-akcia-september-2021-ligy-png.png[/IMG][BR]Budovy z ligových odmien:[BR][BR]Bronzová:[BR]1x Rozvážková knihovnaStrieborná:[BR]1x Obří ruské koloZlatá:[BR]1x Obří ruské koloPrehľad udalosti bude čoskoro dostupný tu."}, {"229": "Diiiik, už som netrpezlivo čakal na event medvedej budovy mam tento event moc rad .Ide pre mňa o najkrajšiu medvediu budovu ale bohužial je strašne slabučkaaaaa ,  čo je obrovska škoda , bohužial ...... Časy hnedeho medveďa asi už nikdy nebudu......."}, {"232": "Minimálně vizuálně to vypadá parádně! Díky iDavis!  Těším se."}, {"90": "@Marian24 Ta budova je v běžném provozu asi opravdu slabá, ale zajímavá může být při Dobrodružství společenství když na 10 stupni dává po 3 dny po nakrmení navíc 3 ty opary.[BR]Gives additional Vision Vapor for every completed crafting recipe while the effect is active.[BR][BR]Tím by najednou \"tajuplný zbytek\" byl ne za 9 oparů, ale za 6 a to už by bylo zatraceně znát. Takže rozvinout a schovat teleportem do skladu a stavět jen na dobu DS."}, {"4": "na betě mi přišel do akademie recept na výměnu dvou nových pandích artefaktů za 1 artefakt starých medvědů  "}, {"221": "ano na to jsem take myslela pri ds ale jak moc efektni to bude v beznem hrani kdyz clovek vyrabi podle toho co mu chodi a jak mam vedet kolik za 3 dny vyrobim napad neni spatny jen setri knizkama mohli dat klidne 3 jako mesicniho[BR][BR]pro me kdo jeste nema to stare kompletni tedy schazi me polarka tak je to taky dilema jinak na bete uz klasicky jsou artefakty na stare medvedy uz ve vyrobe tak uvidim"}, {"16": "Pro ty, co mají zoufalý nedostatek krmení, můžete využít denní odměny 3. den události."}, {"4": "no a teď mám na betě v akademii recept na směnu 2 artefaktů popeláka za 1 starého fénixe. Že by INNO vyslyšelo prosby hráčů ? "}]