[{"221": "jako vazne jeste porad jsou na bete k mani fenix artefakty? ale jinak ano i me pred nekolika dny taky prisel artefakt na na fenixe za popelaka jen uz nevim ktere to mesto bylo protoze ty uz nejak nepotrebuju spis bych byla radej kdyby ted chodili jen artefakty na medvedy aby clovek na to dlouho necekal"}, {"4": "@Hexik - běžně chodí recepty na fénixe za 3plánky, tenhle za 2 popeláky je novinka"}, {"221": "ano jiste vim to jak jsem psala ze celkem pred par dny me prisel ten recept co pises i tak si myslim ze uz by nemusely nebo melo to byt celou dobu a ted medvidci[BR][BR]......[BR][BR]co vlastne rikate na novy event a trebas moznost extra odmen za \"trochu\" dia napad asi dobry ale porad mi prijde ze pokud budu hrat jako vetsinou dostala bych se na jeden planek a jedno rusky kolo zbytek je ranec many a jinych bezne dostupnych veci"}, {"20": "Event celkem ujde, jen ke třeba dát pozor, že hlavní odměny se musí aktivně vybírat, nepadají automaticky po doplnění celého souhvězdí.[BR]Možnost kupovat odměny za dia mě nebere, ale Inno vymyslelo další možnost, jak z některých hráčů dostat peníze. Proč ne, někdo rád utrácí.[BR]Nový Méďa není zas tak slavný, ale dává možnost za 2 nové artefakty vyměnit v Akademii 1 artefakt na staré kvalitní medvědy. Takže pro hráče, co je potřebuji vytáhnout, je to dobrá volba."}, {"221": "no to je ono zvazuju jestli prave noveho prekopat na stare artefakty a jinak tech odmen jsem si vsimla az prave jeden spoluhrac psal ze to nema nejake dia mam v zasobe prave na ty artefakty protoze i tak jich chci hodne teda 11 coz me stejne medvedi nevystaci takze to stejne bude na dyl ale jestli budou porad ve vyrobe je prubezna sance to mit[BR][BR]kdyz se ale zamyslim nad tou extra odmenou za dia tak mi je jasne ktera mesta to budou nejvice kupovat takova ta vyrabejici knihy pro vetsi mesta ... takze mozna se mi to uz prestava libit"}, {"31": "@Ludi po skončení udalosti sa nevyzdvihnuté odmeny z pass-ov vyzdvihnú automaticky, takže nie je úplne nutné na to nejak zvlášť myslieť."}, {"2": "@Hexik [BR]Myslíš, že druhou řadu odměn využijí především pushi g účty?[BR]Proč a jak?"}, {"221": "no tak me napadl dalsi zdroj knizek ikdyz je pravda ze ziskavaji knihy hlavne z turnaju + odmen za ne a to jsou jine polozky"}, {"2": "V základu mi to přijde přínostné hlavně lidem co se snaží o maximální zisk v řemeslné výrobě z tajemného předmětu.[BR]I pro DS mám dojem, že ve většine případů mi nakrmení moc nepomůže. Slabé recepty stejně budu muset udělat dva a silné stačí už ted.[BR]Po grafické stránce se mi to líbí, ale jeslti to postavím jsem se zatím nerozhodl.[BR]Popravdě, hlavní co mě na téhle akci zajímá je kloudná cistě kulturní budova.[BR]Snad se něco odjeví."}, {"31": "Prehľad jesennej udalosti je teraz zverejnený na správnom mieste, spolu s v tejto chvíli naplánovaným termínom konania."}, {"2": "Dnes je na betě v denních odměnách instant na 20 VB.[BR]Dvakrat jsem to kontroloval."}, {"4": "@GorGlin - jj, už jich je pár na skladě  [smilie--sprite2] . Ale dnešní denní úkol - získej 20 relikvií je na neděli docela fajný [smilie--sprite4]"}, {"2": "tohle mi nevadí, nejsme ani v půlce, takže spousta času na splnění, když to dají tři dny před koncem, je to pro mě větší sprostárna.[BR]Připadá mi že ale hodně zahýbali s cenami  a procenty v koulích.[BR]Já asi přehodnotím dosud používanou strategii[BR][BR]A co si myslíte o Výcvikové dojo?[BR]Přijde mi, že lovci budou hlavně pro malá města citelnou posilou."}, {"4": "Já ve 4. kapitole mám 3 a dává mi to 2,5 oddílu lovců denně, ke kterým bych se jinak nedostal. Za mě OK  [smilie--sprite1]"}, {"2": "@pavelb [BR]A už jsi to zkoušel v boji?"}, {"84": "Tak hlavně aby to zase nezměnili. 20VB v denních odměnách už hodně eventů nebylo..[BR]Ty změny procent jsou ale určitě k horšímu, že ?"}, {"2": "@karhol [BR]Myslím, že na tohle není jednoznačný pohled.[BR]Nejdražší koule dá 5 hvězd za 162 klíčů[BR]to je dost[BR]ale je tam 29% na denní odměnu, 9% na 15% portál, 20% na 250 klíčů a 42% na 14 VB.[BR]Prostě to předělali, neodvážím se soudit dokud tím neproženou 5k klíčů."}, {"84": "Tak uvidíme, počkám si až něco protočíš."}, {"4": "@GorGlin - zkoušel a jsou lepší, než 2** kušníci z kasáren, bo doběhnou o políčko dál. A dnešní denní úkol je pro změnu získej 20 relikvií. To jsem v eventu ještě neviděl, takhle 2x za sebou [smilie--sprite4]"}, {"16": "162 - takže o štěstí. Můžeš z toho vytřískat spoustu klíčů anebo pořád dostávat těch 42% 14VB a mít málo hlavních odměn (ne zrovna dobrý poměr na hvězdy(nebo co to je)).[BR]Takže záleží, co je hráčův cíl v této události:[BR]Jdu po denních odměnách a je mi jedno, kolik artefaktů získám? Pak to může být dobrá volba.[BR]Jdu po artefaktech a jsem ochoten hodně riskovat? Pak to může být dobrá volba.[BR]Jdu po artefaktech, ale nechci příliš riskovat? Pak půjdu po jiných bednách s lepším poměrem klíče-hvězdy (většina z nich taky vrací s menší pravděpodobností a množstvím klíče) a 162 bednu budu ignorovat."}]