[{"20": "@Lovec Krys - přesně vystiženo.[BR][BR]Jinak event celkem v pohodě. V úkolech je dobré, že se poslední dobou dají udělat bez jediného střetu v provinciích. Na betě už to po mě chce orky a já tam ještě nejsem a dlouho nebudu, takže kombinace střetů ve věži a v turnaji je fajn. Na betě budu měnit artefakty v Akademii, chci trochu vylepšit hnědáka.[BR]Červený panda není úplný zázrak, ale 2VB denně na 3x3 je to celkem dobrý, takže na live ho postavím. A při možnosti případně teleportovat rozvinutelné budovy do skladu je to jasná věc."}, {"2": "Tahle hra je gembl, to ano, ale 5% nebo 7% na 500 fufníků[BR]nebo 20% na 250 fufníků mi vychází jako trochu lepší pozice pro hráče[BR]Nechci innu skočit na špek, tak to určitě nejdřív otestuji jinde než budu utrácet v hlavním městě, ale celkově mi přijde, že v tomhle eventu se trochu rozpoměli na minulou slávu eventů 14 VB v kouli, 20VB jako denní odměna, procenta u klíčů se o kousek zvedla.[BR]Doufám, že někdo udělá soupis koulí a pořádně si to prostuduji."}, {"221": "koukam to pekne pocitate ja vcera vytocila naky vb na divy ano 20 uz dlouho nebylo takze nejake klicky padly, dneska aby se nereklo jedno liskove mesto kdyby se hodilo a ted uz cekam na nakou zajimavou kulturku na vyrobu nebo manu, dojo  taky jedno mam kazdy typ vojska se hodi[BR][BR]a nakonec me nadeje na lepsi artefakt ve vezi se dnes rano zacaly roplyvat kdyz mi do vyroby prisel lonsky valentynsky vuz"}, {"5": "3.den denní odměna Krmení ... za mne fajn věc [smilie--sprite1] zlepšili se[BR]Red Panda - na DS také plus /mezitím může sedět ve skladu/"}, {"31": "Prikladám video v pokračovaní série videí Najlepšie denné ceny udalosti, tentokrát pre zajtra začínajúcu udalosť Podzimní zvířetník.[BR][BR]Video je nahrané v anglickom jazyku, v tejto chvíli si z časových dôvodov nie som istý, či sa mi v rozumnom predstihu k udalosti podarí doplniť aj slovenské titulky, každopádne všetky výpočty a porovnania pochádzajú z príslušnej stránky na portáli.[BR][BR]"}, {"31": "Zdá sa, že môžeme povedať zbohom príkazu /who - na bete bude zajtra zavedené zobrazovanie online statusu členov spoločenstva.[BR][BR][IMG]https://i.ibb.co/Tm7G18X/https-beta-forum-elvenar-com-index-php-attachments-player-online-jpg-9303.jpg[/IMG]"}, {"18": "Toš to su teda zvědavý"}, {"232": "Připomíná mi to facebook/ messenger. :-D"}, {"31": "Ďalšou chystanou novinkou sú nové recepty do akadémie, ktorou sa vývojári zrejme snažia zlepšiť využitie úlomkov kouzel. Nové recepty umožňujú ich výmenu za spojovací činidlá / opary vidění.[BR][BR][IMG]https://i.ibb.co/8mW1BR1/https-beta-forum-elvenar-com-index-php-attachments-screenshot-1-png-9308.png[/IMG]"}, {"90": "12alfa napsal/a:\t\t\tPřipomíná mi to facebook/ messenger. :-D\t\tKlikněte zde pro zvětšení...No ono se toho zase moc jinačího vymyslet nedá. A taky proč.[BR][BR]iDavis napsal/a:\t\t\tNové recepty umožňujú ich výmenu za spojovací činidlá / opary vidění.\t\tKlikněte zde pro zvětšení...To by mohlo docela pomoct v rámci Dobrodružství společenství[BR][BR][BR]//sloučení příspěvků - doublepost - Ódin"}, {"4": "No malé kapitoly těch úlomků moc nemají, takže těm to moc nepomůže"}, {"90": "Každý kdo hraje trochu aktivněji věž - stačí alespoń první patro a to by měl bez problémů dát snad každý - jich má nadbytek.[BR]EDIT: Možná se mýlím a pravdu má @pavelb , přesnou analýzu jsem nedělal, sám jich mám spoustu a přitom věž hraji jen na dve patra, ale je fakt, že mám i několik knihoven ... a manželka jich má dvakrát tolik a má i dvakrát tolik úlomků a věž hraje taky na dvě patra."}, {"232": "@OldMaGorr Tady bych si dovolila nesouhlasit, vymyslet se dá spousta věcí, může to mít formu fajfčičky, mávající ruky, tepajícího srdce, zářícího slunce, nebo jen tučného zvýraznění jména hráče či podsvíceného portrétu... Neříkám, že je toto mnou uvedené lepší než zelený puntík, říkám jen, že se dá vymyslet. A proč? Protože tohle je krásně graficky pojatá hra s tolika úžasnými fantasy prvky, že nepotřebuje vypadat jako obyčejný messenger, a to v žádném svém aspektu. ;-)"}, {"4": "@OldMaGorr - no s tou věží asi pravdu nemáš. Nadbytek úlomků mají města s několika knihovnami, ne ty , které hrají věž jedno či dvě patra. Na betě mastím věž dvě patra každý týden a mám jen jeden set knihovny a nadbytkem úlomků věru netrpím. Na cizích fórech je k tomu někde i výpočet hráčů matematiků [smilie--sprite2]"}, {"66": "@12alfa jen doufejme, že to není důkaz personálního podstavu v Elvenar týmu Innogames."}, {"90": "@12alfa - ano, grafika by mohla být jiná a třeba hezčí, ale šlo mi spíš o technickou stánku věci a způsob řešení. Já mám raději spíš přehlednost a jednoduchost než moc obrázků. I budovy Elvenaru nějak nedokážu asi dost ocenit a stačily by mi \"čtverečky\". Animace mám vypnuté - i to o něčem svědčí."}, {"11": "já mám úlomků kolem 280 k a to jsem 6 knihoven postavil poprvé nyní po skončení kapitoly abych mohl vyrábět hnědý kouzla. Předtím jsem měl jednu nebo žádnou. Věž dělám 3. patra. Takže si myslím že jich je dost. Nebo je 280k málo? Nevím. Ale pamatuju dobu, že tu každý remcal, že má přebytek úlomků."}, {"221": "puntik neni spatny v jednoduchosti je krasa myslim ze to staci tak jeste by se hodil nejaky ten seznam pratel - sousedu[BR][BR]ulomky - tak znam i hrace co jich ma malo, ale je fajn mit moznost vyuzit prebytky jak moc to pujde je otazkou jak casto neco takoveho do vyroby prijde na cz furt cekam na medvedi artefakty a kdyz nahodou prijdou tak prevazne jsou za artfakty nove coz nechci ale fenixove tam chodej furt .."}, {"90": "@Hexik - u mne zase už několikrát přišla výměna nových za staré medvědy. Asi právě proto, že mám hnědého i ledního na desítce a starou pandu nestavím, ale tu novou červenou bych chtěl."}, {"16": "Na betě bez varování začalo DS.[BR][BR]Tak nevím v čem je chyba, jestli původní datum v DS ukazovalo špatně a teď (nebo dneska) to někdo opravil aniž by informoval osoby zodpovědné za sdílení informací na beta foru, anebo je špatně to, že DS začalo dneska.[BR][BR]Každopádně jsou v něm 2 artefakty na Rudého pandu*, takže to dle mě znamená, že DS po skončení události bude.[BR][BR]* - V minulosti byly chyby, že v DS zůstaly chybně artefakty z minulého DS. Z toho usuzuji, že přítomnost správných artefaktů v odměnách znamená, že DS je plánováno bez ohledu na to, zda začalo na betě ve správný den či nikoliv.[BR][BR][BR]ps: Tak začít mělo dneska, jen to někdo zapomněl sdělit komunitnímu manažeru bety."}]