[{"16": "Od zítřka je oznámena na betě úprava produkce T2 (Svitky) Měsíční knihovny:[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/balancing-the-moonstone-library.16996/\t\t[BR]Už to nebudou svitky natvrdo, ale dynamicky T2-1."}, {"2": "No to je skvělá zpráva"}, {"221": "@OldMaGorr ja to nehraju tak dlouho takze hnedaky mam ale na polarky nevyslo vlastne jsem byla v zacatcich kdyz jeste ti 3 spolecne s pandou byli k mani a ja si rikala no tak dam pandu samozrejme byla jen na 4 a casem sla do kytek a prave toho novyho taky chci no na bete mi to jaksi nevyslo ale ds bude tak toho cervenaka vytunim[BR][BR]zmena knihovny vypada dobre az na jednu vec proc upravuji jedinou surovinu? lepe receno proc upravuji jen jednu soucast setu? kdyz je rozbity cely?"}, {"2": "Jednu, ale tu nejhorší.[BR]Bizmut nemám, takže to je jen pocit z trhu, ale jsou chvíle kdy ho mám problém sehnat.[BR]S gumou je to horší, ale požadavky na T4 suroviny nejsou tak drastické.[BR]Pro mě jako pečlivého udržovatele zasob.[BR]Je fakt že kdybych potřeboval rychle schrastit 0,5M platiny za gumu byl by to smutný příběh.[BR]Ale svitky, to je fakt tragédie.[BR]Jak to dělají lidi co mají bonus na svitky a jedou turnaj s věží na výkup, je mi jich líto."}, {"221": "no jako mam knihovnu nebudu rikat ze ne a na zvysenou no ale kdyz to vemu tak dobre ubude svitku takze jedna moje surovina by mohla byt casem i v pozadavcich nadale vyrabim i smulu kterou vlastne nevyrabim protoze ji mam z knihovna setu bismut vyrabim teda aspon ve jedne manufakture aspon ze mam ten samet co celkem jde lepe obchodovat[BR][BR]jak to delam abych smenila svitky no proste dam slevu ale porad je to vyhodnejsi nez vyrabet neco co mi neurcili snad jednou nebude problem dat 1:1 cokoli i slevu davam malou treba 5-10% nekdy ale co vidim za nabidky no proto musim mit zasoby abych nemusela cekat az nekdo se slituje i tak nerada pisu do spolku potrebuju tohle, vetsinou to nejak zvladnu, zatim mam jen stadarni a zivouci takze ok na 2 patra veze to zvladam"}, {"2": "@Hexik [BR]Uvidíme jak rychlá bude odezva.[BR]Čekal bych pár měsíců"}, {"20": "@Lovec Krys o tuto změnu jsme tu opakovaně žádali a tak je to moc fajn. Ještě by jí mohly alespoň občas vrátit do věže, aby jí všichni hráči mohli mít víc, než 1x."}, {"16": "Tak nakonec jsou Knihovny T2+1 namísto T2-1.[BR]Tzn. Křišťál>Svitek, Svitek>Hedvábí, Hedvábí>Křišťál.[BR]Moje beta vesnice s bonusem na Hedvábí nyní produkuje v Knihovnách křišťál."}, {"2": "No super, to je pro mě ideální."}, {"90": "I pro mne je to velmi dobrá zpráva - bonus mám hedvábí a křišťálu trvale nedostatek. Manželka to má úplně stejně a tak už hedvábí dlouho prodáváme se slevou. To by se snad mohlo trochu změnit."}, {"221": "tak ja taky byla prekvapena ze jsem bud vcera spatne koukala nebo nevim byla jsem presvedcena ze s hedvabim budu mit svitky a ze zmena je jen pouze u hlavni budovy ale i nekonecny svitek produkuje na zaklade zvysene takze na bete super[BR]aspon se to casem srovna jestli to bude i s produkci zivouciho muzou vratit knihovny jen nevim proc jim zmena tak dlouho trvala mohli to to udelat mnohem drive ikdyz chteli dat do veze ty artefakty"}, {"16": "@Hexik A vidíš, toho jsem si ani nevšiml. Nějak mě nenapadlo Nekonečný svitek zkontrolovat. Nicméně, když už změnili 2 budovy ze setu, mohli už změnit rovnou všechny."}, {"66": "A až se nás nováčci jednou budou ptát: \"Proč budova jménem Nekonečný svitek neprodukuje svitky?\" Můžeme jim říct: To bylo tak ...[BR](Aneb velká pohádka o vyvažování produkce svitků)"}, {"221": "@Lovec Krys no ja prave nevim jak to je trebas s krovickama uz tam vyrabim manu jestli i v nizkych se bude stridat nebo ne a ci zivouci na to jsem zase prilis mala"}, {"2": "@OldMaGorr [BR]Žena ti vzkazuje že by tě chtěla za souseda.[BR]Krystalů má kopec a hedvábí nedostatek."}, {"4": "Já už delší dobu nabízím svitky v poměru 2:1, tak snad už budu moci obchodovat trošku levněji"}, {"16": "@Hexik Produkuje to elfí pryskyřici. Brány pak bizmut."}, {"2": "Na betě se objevilo oznámení tajemného lesa[BR]Za dva dny"}, {"232": "@GorGlin A to bude u nás po DS, prosím? Nebo DS nebude?"}, {"2": "Bylo na betě, takže bych ho čekal i tady."}]