[{"139": "DS prislo na betu bez predchoziho oznameni, takze asi to bude stejne na CZ"}, {"221": "na foru bety psali ze to byl problem v komunikaci snad zde zadne komunikacni problemy nebudou a oznameni prijde"}, {"90": "Já si myslím, že DS bude a že asi začne ve čtvrtek 7. října 2021 okolo poledne. Na CZ bývá začátek obvykle ve čtvrtek a - tak jako na beta - zhruba týden po skončení události. Ale to je jen můj odhad. iDavis mívá zpravidla skutečně dobré informace dřív než se objeví oznámení."}, {"31": "Najbližšie dobrodružstvo je v tejto chvíli naplánované na 7.10."}, {"31": "Halloween 2021[BR][BR]Spoiler: Halloween 2021[IMG]https://i.ibb.co/N7CXyCm/https-i-ibb-co-b-L1jy-DX-EL-akcia-halloween-2021-banner-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]Všetky nové budovy z tejto udalosti sú zverejnené na portáli, pripravený priestor na denné odmeny je tu.[BR][BR]Udalosť prináša 2 novinky:[BR]Nový predmet Sip of Clarity (Dúšok múdrosti) - dá sa získať z hlavných a kráľovských odmien udalosti. Použiteľný je v craftingu v Magickej akadémii, kde bezplatne obnoví zostavu receptov.Výmena dennej ceny - za každých 5 nazbieraných priateľských duší v udalosti (mena potrebná na odomykanie hlavných cien) sa umožní vymeniť aktuálnu dennú odmenu za náhodnú inú ponúkanú v tejto udalosti.[BR]Prehľad udalosti je dostupný tu.[BR]Na svojom kanáli som pre udalosť vytvoril novú Halloweensku sériu videí. Prvé video je zamerané na stratégie udalosti, kde vysvetľujem ako najvýhodnejšie používať jednotlivé nástroje.[BR][BR][BR]Druhé video obsahuje zrýchlený priebeh celej minihry, v ktorom je možné sledovať moje používanie nástrojov. Toto video je podkladom k videu so stratégiami, kde jednotlivé kroky prechádzam s podrobným vysvetlením.[BR][BR][BR]Videá sú nahrané v angličtine a obsahujú slovenské titulky. Môžete si ich zapnúť v nastaveniach videa."}, {"2": "díval jsem se na novinky v události a několik jsem jich našel[BR]získat druhou platformu bude o trochu těžší, přidali k doměnám obrázek[BR]Ale objevil se i nový lektvar, který umožní protočit recepty v řemeslné výrobě, nebo každý den příděl rerollů, když nebudete spokojeni s \"losovanou\" odměnou."}, {"16": "U mne osobně reroll prakticky nic nezmění. Já stejně budu točit jen VBčka, takže reroll použiju max. poslední den a vzhledem k náhodnosti dostanu místo odměny, kterou nechci, jen jinou odměnu, kterou nechci.[BR]U hlavní budovy mi bude stačit lv10 i s následným DS (do sbírky evo budov dávající VB), takže žádná přehnaná snaha."}, {"90": "@Lovec Krys - vidím to úplně stejně"}, {"5": "Já zatím nic nevidím, takže vyhodnotím až v jakém stavu to zavedou [smilie--sprite1]"}, {"221": "no dneska jsem taky na to koukala  na to protoceni denni vyhry a zhodnotila ze vyznam to ma spise ke konci eventu kdy uz vis ze nic co chces neprijde ale bodiky masjen me prekvapila ta zmena v ty mape loni to preci videt nebylo tak jsem pak zvedava jak to letos pujde"}, {"88": "Zase ten nesmysl se svíčkami a osvětlováním mlhy?  [smilie--sprite11] Beze mne..."}, {"31": "Prehľad udalosti je v tejto chvíli na správnom mieste. Okrem iného, do videí k udalosti (ktoré sú tiež súčasťou prehľadu) som pridal slovenské titulky, ktoré je možné zapnúť si v nastaveniach videa."}, {"4": "Co se týká úkolů, tak je tam 2x použij krmení ( celkem 3 kusy ), jinak nákup VB taky asi 3x a dost velká množství ( i 20 ), pak ze začátku dílenské výroby, ale jen 5x (pivo 8ks, chleba 3ks,nástroje 2ks, jednoduché nástroje 7ks a zase chleba 6ks) a 4x 3h manucha ( 2ks, 2ks, 4ks a 4ks ). Jinak klasika hodně zboží, packování, relikvie, provincie, kouzla, střety atd. Tentokrát se musím pochlubit s osobním rekordem- prvních 54 úkolů za 28,5 hodiny  [smilie--sprite2] . Městečko v kapitole 4."}, {"2": "Na packování teď stojím, packovat na mapě nejde[BR]Super"}, {"31": "@GorGlin chyba sa vzťahuje len na hráčov bez spoločenstva. Ostatní motivovať idú. Na nich som úlohu splnil."}, {"2": "Jenže ostatní už jsou namotivovani"}, {"16": "@GorGlin Já taky na ten úkol čekal, jen v mém případě je to leností, jelikož to je moc klikání* klikat pomoc na mapě. Tak jsem počkal až se mi obnoví packy společenství.[BR][BR][BR]* a čekání na načtení města, a kvůli NH fakt nebudu pouštět apku (a ještě ji předtím aktualizovat na aktuální verzi)."}, {"221": "Ja kdyz musim souseda na pc a zvonek a spolek mam hotove tak jdu na mapu a vybiram mrnavy mesta co se rychle nactou pak to neni ani tak hrozne 7 pomoci a uplne nejjednodussi je jdyz mas misto sousedu penizky"}, {"20": "@iDavis jsem na betě ve společenství a motivace na mapě nám nejdou u nikoho. Jen ve polku a pak ze zvonečku. Přímo na mapě, když otevřu cizí město, tak mě to vždy restartuje hru.[BR][BR]Eventy v mlze nemám moc ráda. Hraju to, ale připadá mi to ještě nespravedlivější, než ty ostatní. [BR]Jsou tam ale nové druhy odměn: např. kouzlo na posun řemeslné výroby bez dia je zajímavá novinka."}, {"5": "Lon´ský event - Helloween:  https://elvengems.com/misty-forest/[BR]...kdyby si to chtěl někdo trochu osvěžit - přiblížit"}]