[{"213": "@ElfNostradamus  myslím, že toto je zbytečné Stačí se podívat na to co pro nás dělá iDavis"}, {"20": "@Danber7777 souhlas, info iDavise o eventech je v mnohém lepší, než je na elvengems.com. Navíc poslední dobou tam aktualizace témat poněkud vázne."}, {"221": "ja si to pripominam sama osobne na bete na videa od idavise se nedivam nikdy no vlastne na zadna z elvenaru ale jak ma ten servr na deni odmeny a tak za to jsem rada to je fajn a pouzivam"}, {"20": "@Hexik  já taky hraju na betě, však je to tu fórum pro zprávy z bety  .  Ale pro ostatní, co na betě nehrají, je určitě přehled od iDavise velký přínos."}, {"221": "tak v podstate je to asi stejny jak loni jen nebyla liga a extra truhlyza dia kazdopadne vyber odmen byl rozhodne lepsi a prijemnejsi v predchozim eventu[BR][BR]taky by me zajimalo jak to delate s tema novyma spolkovyma bodama kam je davate a jak se vam to vlastne libi, byla naka aktualizace ale k memu zklamani sousedska na mape stale nejde ..."}, {"213": "@Ludi  Zcela s tebou souhlasím Na betě nehraji stačí mi A a W úplně bohatě a iDavis za mne dělá opravdu práci k nezaplacení"}, {"5": "Danbere, pokud odkaz nechceš číst, tak to nečti, máme svobodu slova a volby  [BR]...před prací některých hráčů klobouk dolů, jen podotknu, že to nedělají jen pro nás, ale částečně rovněž také pro sebe "}, {"31": "V tejto chvíli naplánovaný termín Halloweenskej udalosti je uvedený v prehľade."}, {"4": "JJ, tak to mi stačí hrát na betě. V tej mlze mám strach někde bloudit, abych náhodou do něčeho nešlápl "}, {"20": "@pavelb jo mám to podobně . Ale hlavní budova se mi líbí."}, {"31": "Kompletný zoznam úloh Halloweenskej udalosti je v tejto chvíli na správnom mieste.[BR][BR]Zároveň som nahral 3. video z Halloweenskej série, tentokrát zamerané na najlepšie denné ceny udalosti:[BR][BR]"}, {"2": "Na betě dnes začalo DS.[BR]A v druhé i třetí truhle není artefakt z předešlého eventu.[BR]Nýbrž zcela nove kouzlo, kterým si hráč může přičarovat artefakt na budovu letošního, nebo loňského halloweenskeho eventu[BR]A není to náhodné, ale hráč si vybírá."}, {"90": "To je fakt daleko lepší než ten přiblblý konkrétní artefakt ! Konečně máme výběr a ne artefakty zaplevelující sklad."}, {"16": "Vypadá to takhle:[BR][IMG]https://i.ibb.co/QCMjygv/https-cz-forum-elvenar-com-index-php-attachments-1635420142682-png-5799.png[/IMG]"}, {"11": "@OldMaGorr , tak hodí se to jen těm hráčům kteří nemají naplno chatrč čarodějnice a v tom případě zas nejspíš nedaj naplno letošní budovu. Sklad se mi díky věži  zapleveluje stejně. Není už žádný artefakt který by se mi hodil kromě popelavýho fenixe protože jsem jeho artefakty směnil."}, {"205": "No hurá. Po něčem podobném jsem volal už asi před rokem. Akorát bych dal na výběr ze všech předchozích artefaktů."}, {"221": "vypada to dobre dalsi bordylek do skladku ale kdo nema z lonska vylepsino jiste to oceni lepe"}, {"90": "prchlik napsal/a:\t\t\tAkorát bych dal na výběr ze všech předchozích artefaktů.\t\tKlikněte zde pro zvětšení...Snad to takhle bude pokračovat i v dalších DS a bude na výběr alespoń po částech - fénixové, medvědi atd."}, {"20": "Za mě krok dobrým směrem. Možná se blížíme k tzv. univerzálnímu artefaktu, což by bylo skvělé.[BR]Ale už nyní, kdo nemá loňskou chatrč na 10 lv., tak se rozhodně vyplatí vylepšit, protože je daleko kvalitnější, než letošní budova."}, {"11": "Jsou už nějaký informace ohledně další kapitoly? Vloni touto dobou jsme už pilně stavěli lodě."}]