[{"2": "zatím se na fóru o další kapitole jen mluví[BR]S ohledem na to, že zatím neprosakují žádné obrázky a podobně, tak si myslím že nová kapitola nehrozí."}, {"16": "Kdy přijde, těžko říct. Nicméně vzhledem k té zastropované výrobě portálu na 2h, je nejspíše ještě spousta hráčů nehrajících 24/7 (nebo nenahrazujících menší aktivnost spoustou 1h a 2h urychlovačů) minimálně týdny ne li měsíce před dokončením kapitoly*.[BR]To může být jedním z důvodů zpoždění, prostě na obchod nového zboží (T8) ještě dost hráčů nedokončilo kapitolu.[BR]Na druhou stranu se klidně může stát, že nám novou kapitolu hodí třeba už příští týden (nebo taky za měsíc nebo dva).[BR][BR]*Prostě bez použití urychlovačů, pokud je hráč schopen udržet portál přes den v nepřetržité činnosti a jedinou prodlevu má během spánku, tak je schopen vyrobit přibližně 45 odznaků za den. Hráč, který toho schopen není (například proto, že může kromě spaní taky pracovat bez možnosti klikat Elvenar a nemá v zásobě stovky/tisíce 1h a 2h urychlovačů na kompenzaci) může jet klidně poloviční rychlostí a s kapitolou se piplat 8 mě"}, {"1": "Až bude nová rasa na betě, můžete sem přeposílat obrázky. Ale do té doby mějte prosím trpělivost. "}, {"11": "Tak já bych se nezlobil kdyby přišla až po Novým roce."}, {"221": "se me zda ze spis ladi blbinky zrovna ted v tydnu jsem koukala na nove ikonky v zalozkach obchodnika a v okne turnajovych provincii tedy na pc verzi nejdriv jen at daj na cz ty levly spolku a pak at si hraji s novou kapitolou jsou lidi co ji jeste nemaji hlavne neni vlastne kam spechat tezko rict kolik jeste jsou schopni naservirovat kapitol"}, {"2": "neboj, všechno bude"}, {"11": "@Hexik  prý má být 100 kapitol, pak se servery vypnou. To už tu bude válka "}, {"221": "@voyager-1 100 kapitol to jako ja nechci hrat do smrti jo ... tak ja jsem v klidu zatim mam jen max 14 takze do tech nejvetsich silenosti mam jeste dost daleko"}, {"11": "no, v patnáctý ty \"šílenosti\" začínají "}, {"31": "Ja osobne som sa na bete vo výskume práve dokončením konstruktov zastavil. Nikdy som tam nehral obzvlášť aktívne (skôr som sa len zúčastňoval udalostí a turnajov a ten výskum budoval tak nejak popri), no hrať druhý raz kapitoly 15+ a s takouto aktivitou, to by som už znova psychicky nedal a odznaky by zbierala asi moja druhá generácia (netuším síce aká). Zároveň mám dojem, že taký ten niekdajší dôvod snahy na bete \"vyskúšať novú kapitolu prv než sa objaví u nás\" sa už do veľkej miery vytráca - ako môžeme vidieť kapitoly sa pridávajú nanajvýš dvakrát do roka a ich samotné prejdenie už trvá toľko že to častejšie byť ani nemusí, takže vyskúšať si niečo 3 týždne vopred už zrejme nemá úplne tú váhu ako kedysi.."}, {"31": "Dobrá správa pre tých, ktorí ešte nemajú výskum 18. kapitoly dokončený (menej dobrá pre tých, ktorí ho už majú):[BR][BR]Osadnícke suroviny boli na bete ako požiadavky pre výskum divov zrušené. To znamená, že zrejme nebudú potrebné pre výskum 19. kapitoly ale hráči, ktorí sa ich spätne rozhodnú vyskúmať, nebudú musieť stavať osadníkov znova.[BR][BR][IMG]https://i.ibb.co/ZzFHW2d/https-beta-forum-elvenar-com-index-php-attachments-2021-11-08-2-png-9536.png[/IMG]"}, {"2": "To jsou dobře dva tydny klikání.[BR]No mazec."}, {"11": "no, jak jsem předpovídal, ale pro jistotu jsem je stejně vyzkoumal...[BR]možná budou výzkumy povinný tak ani nic jinýho nezbývalo."}, {"16": "@GorGlin To je přesně důvod, proč část rychlejších ty 2 výzkumy vynechala a ti pomalejší se k tomu ještě ani nedostali."}, {"2": "@Lovec Krys[BR]Já divy stavím, takže cekat čtvrt roku jestli nebudou ve slevě se mi moc nechce."}, {"16": "@GorGlin Já ne, ale vyzkoumané už je mám kvůli neoficiální informaci, kterou tu psát nebudu, protože ještě není nová kapitola na betě (ikdyž dle mého je již z vyjádření Marindora dostatečně potvrzena)."}, {"126": "tak to je dobrá zpráva..zrovna mám 250/300 odznaků, kde se chystám nejdříve na Tábor, pak až na ty divy..takže konec kapitoly se značně urychlí "}, {"2": "Dokonale načasování"}, {"16": "My o vlku a vlk (nová kapitola) na betě.[BR]Oba divy z kap. 18 jsou dle předpokladů povinné.[BR][BR]Nové divy:[BR][IMG]https://i.ibb.co/CQjWCcX/https-cz-forum-elvenar-com-index-php-attachments-1636456699304-png-5822.png[/IMG] [IMG]https://i.ibb.co/NL1P6HY/https-cz-forum-elvenar-com-index-php-attachments-1636456745779-png-5823.png[/IMG][BR](pro neangličtináře - první div redukuje rozpad unuria a dává unurium při sběru mincí, druhý zvyšuje produkci T7-9 zboží a produkuje střelce z tábora).[BR]ps: A za 2 dny začne na betě zimní událost.[BR][BR]ps2:Jedna z osadnických budov je expirační (7 dní):[BR][IMG]https://i.ibb.co/xfzP2yq/https-cz-forum-elvenar-com-index-php-attachments-1636457060433-png-5824.png[/IMG]"}, {"2": "škoda"}]