[{"3": "divy skvele, za rok jsem u nich "}, {"2": "bohuže, opět bez vylepšení průzkumu[BR]ale je tu pár pěkných kousků.[BR]čtvrtá hvězda pro lovce a psy"}, {"31": "Na najvyššom leveli má nový div násobok 0.00184 unuria na zber mincí, čo pri prepočte na moje mesto by vyprodukovalo len okolo 400.000 unuria za týždeň. Chrám Duchov z 18. kapitoly by mi na najvyššom leveli dal až cez 600.000 unuria za týždeň (a aj to rátam len vežu - povedzme že na menu udalosti sa nechcem spoliehať, keďže nebeží stále) vďaka môjmu rozloženiu mesta a pomerne vysokých nárokoch na kultúru. Takže myslím že moja dilema ktorý div na unurium vybrať má vcelku jasného víťaza - tiež zvažujúc fakt, že Chrám Duchov má oba efekty, ktoré unurium produkujú, čím sa viac vytráca potreba produkovať ho v tržišti (a všetci vieme, že tam to ide trochu ťažkopádne, keďže to nahrádza semienka). Znižovanie rozpadu unuria teda nemá až taký význam, keďže pri tomto efekte ho treba stále niekde vyrábať.[BR][BR]Inak posledná technológia v novej kapitole vzbudzuje celkom zvláštne prognózy:[BR][BR]Spoiler[IMG]https://i.ibb.co/Sxtmt7r/https-i-ibb-co-Lr-Mx0pg-EL-kapitola-19-posledn-technol-gia-png.png[/IMG][BR]Možné samozrejme je, že za tým bude len technicky nič neznamenajúci príbeh, ale radšej by som dúfal, že to prinesie niečo, čo budeme môcť považovať za nejakú novinku v hernom progrese.."}, {"16": "Já myslím, že když si přečteme poznámky k ostatním výzkumům, tak to prostě znamená, že jsme úspěšně pomohli čaroději k jeho pomstě a to je celá tragédie rovná srovnání našeho města se zemí (asi studem)."}, {"5": "19. Kapitola: Forum Bety: https://beta.forum.elvenar.com/index.php?threads/chapter-19-revenge-of-the-exile.17190/[BR]Diskuse: https://beta.forum.elvenar.com/index.php?threads/chapter-19-revenge-of-the-exile-discussion.17218/[BR][BR]Výzkum: prvních 20 de facto za aktuální převážně živé zboží a urunium, osadnické zboží naskakuje zhruba od 20položky výzkumu...[BR][IMG]https://i.ibb.co/rvW8YCN/https-cz-forum-elvenar-com-index-php-attachments-19-png-5826.png[/IMG][IMG]https://i.ibb.co/s2k2LSW/https-cz-forum-elvenar-com-index-php-attachments-19a-png-5827.png[/IMG][IMG]https://i.ibb.co/pRvHTL6/https-cz-forum-elvenar-com-index-php-attachments-19b-png-5828.png[/IMG]"}, {"2": "@iDavis [BR]je otázka, jak to bude, zdá se, že v tom divu zatím mají nejasno[BR]na lvl 12 je 0,076 a pak to najednou přeskočí na 100,08[BR]uvidíme kde nakonec tu desetinou čárku nechají.[BR][BR]Co se týká posledního výzkumu, tak mi to přijde, že tentokrát dostaneme na budku, ale kapitola skončí s nadějí do budoucna.[BR]Ta ultimate power bude něco co nám v budoucnu pomůže zachránit svět.[BR]Aktuální dopad je, že dostaneš obrázek"}, {"31": "@GorGlin to bude podľa všetkého len preklep pri zadávaní hodnôt. Očakávam, že to na všetkých leveloch rastie lineárne."}, {"16": "Vylepšení budov:[BR][BR]Manufaktury:[BR][IMG]https://i.ibb.co/8gf7GTk/https-beta-forum-elvenar-com-index-php-attachments-1636472370987-png-9543.png[/IMG][BR][IMG]https://i.ibb.co/gTsyn8B/https-beta-forum-elvenar-com-index-php-attachments-1636472395757-png-9544.png[/IMG][BR][IMG]https://i.ibb.co/mt5d0Z8/https-beta-forum-elvenar-com-index-php-attachments-1636472422857-png-9545.png[/IMG][BR][IMG]https://i.ibb.co/nQKyJWX/https-beta-forum-elvenar-com-index-php-attachments-1636472481313-png-9547.png[/IMG][BR][BR]Dílny (mám jen kouzelné):[BR][IMG]https://i.ibb.co/9tdDc8w/https-beta-forum-elvenar-com-index-php-attachments-1636472458113-png-9546.png[/IMG][BR][BR][BR]Rezidence:[BR][IMG]https://i.ibb.co/mD07Sz7/https-beta-forum-elvenar-com-index-php-attachments-1636472516054-png-9548.png[/IMG][BR][IMG]https://i.ibb.co/d7rzVSX/https-beta-forum-elvenar-com-index-php-attachments-1636472538093-png-9549.png[/IMG][BR][BR]Tržiště:[BR][IMG]https://i.ibb.co/94PZcNT/https-beta-forum-elvenar-com-index-php-attachments-1636472562815-png-9550.png[/IMG][BR][BR]Zbrojnice:[BR][IMG]https://i.ibb.co/CQ0qtM6/https-beta-forum-elvenar-com-index-php-attachments-1636472586986-png-9551.png[/IMG][BR]Hlavní sídlo:[BR][IMG]https://i.ibb.co/Gc2tM7n/https-beta-forum-elvenar-com-index-php-attachments-1636472836670-png-9555.png[/IMG][BR][BR]A ještě kulturní budovy (konečně někoho napadlo zvýšit produkci semenných kulturek více než o směšnou hodnotu):[BR][IMG]https://i.ibb.co/3dtvp1D/https-cz-forum-elvenar-com-index-php-attachments-1636473168934-png-5829.png[/IMG][BR][IMG]https://i.ibb.co/yPNVjNs/https-beta-forum-elvenar-com-index-php-attachments-1636472750927-png-9553.png[/IMG][BR][IMG]https://i.ibb.co/CH2TgFZ/https-beta-forum-elvenar-com-index-php-attachments-1636472774013-png-9554.png[/IMG][BR][IMG]https://i.ibb.co/rpdg7Bb/https-beta-forum-elvenar-com-index-php-attachments-1636472899062-png-9556.png[/IMG]"}, {"2": "@iDavis [BR]to je pravděpodobné, ale když ty máš na konci  0.00184  a já na začátku 0,024, tak bych čekal, že se to ještě může změnit, ne že budu mít mnohem lepší div než ty"}, {"31": "@GorGlin ja som to číslo uviedol v hodnote násobku, v hre je to už uvedené ako percento (teda *100). Aktuálne hodnoty sú[BR][BR]Spoiler\t\tJSON:\t    \"values\": {      \"1\": \"0.00024\",      \"2\": \"0.00028\",      \"3\": \"0.00032\",      \"4\": \"0.00036\",      \"5\": \"0.00040\",      \"6\": \"0.00048\",      \"7\": \"0.00052\",      \"8\": \"0.00056\",      \"9\": \"0.00060\",      \"10\": \"0.00064\",      \"11\": \"0.00072\",      \"12\": \"0.00076\",      \"13\": \"1.00080\",      \"14\": \"1.00084\",      \"15\": \"1.00088\",      \"16\": \"1.00096\",      \"17\": \"1.00100\",      \"18\": \"1.00104\",      \"19\": \"1.00108\",      \"20\": \"1.00112\",      \"21\": \"1.00120\",      \"22\": \"1.00124\",      \"23\": \"1.00128\",      \"24\": \"1.00132\",      \"25\": \"1.00136\",      \"26\": \"1.00144\",      \"27\": \"1.00148\",      \"28\": \"1.00152\",      \"29\": \"1.00156\",      \"30\": \"1.00160\",      \"31\": \"1.00168\",      \"32\": \"1.00172\",      \"33\": \"1.00176\",      \"34\": \"1.00180\",      \"35\": \"1.00184\"    },[BR]kde priam bije do očí, že niekto sa po 12. leveli preklikol a namiesto nuly pred desatinnou čiarkou začal \"písať jednotku\".[BR][BR][BR]Čo sa týka budov z udalostí a ich hodnôt pre novú kapitolu, budem aktualizovať databázu budov tento štvrtok, kedy tam rovno nahrám aj budovy z vtedy na bete začínajúcej zimnej udalosti."}, {"2": "pokud se to ale počítá z aktuálního počtu mincí, můžeš ho zvedat použítím kouzel na kulturu a podobně[BR]ale když to vezmeš kolem a kolem, tak je to podobné jako bludiště[BR]samotná produkce zas tak závratná není, ale každý den ti může ušetřit další desítky tisíc snížením rozpadu"}, {"3": "jen je otázka, kdo bude mít tolik uriny, aby vůbec tvořil rezervu, která by se mu nerozpadala... nemám bludiště, ani ty semínkové věže, protože prostě k čemu, když co mám, to použiju a pokud ty suroviny zrovna nepotřebuju, tak ať se klidně rozpadají. pořád je to pomaleji, než jak přibývají"}, {"16": "@Emhyr var Emreis II Ale zase mít menší zásobu many taky není k zahození:[BR][IMG]https://i.ibb.co/kykzcbF/https-cz-forum-elvenar-com-index-php-attachments-1636570554751-png-5830.png[/IMG][BR][BR][BR]Jinak tohle jsou osadnické suroviny:[BR][IMG]https://i.ibb.co/fQZCxj9/https-cz-forum-elvenar-com-index-php-attachments-1636570612218-png-5831.png[/IMG][BR]Ta první lahev se vyrábí v té expirující věži, takže PPčka půjdou použít na ušetření této budovy. [BR]Ta druhá láhev se vyrábí jinde, nejspíše v portálu spolu s White a Black matter, jelikož Creatures of the Light & Night jsou z té druhé osadnické budovy.[BR]Ultimate Creatures a ta věc na poslední výzkum nejspíše taky v portálu (tomu by nasvědčovalo i pořadí finálních výzkumů:[BR][IMG]https://i.ibb.co/YbyNkcc/https-cz-forum-elvenar-com-index-php-attachments-1636570937604-png-5832.png[/IMG][BR]Chybí nám minmax, ten by nám to vytáhl z game files už tak před čtvrt rokem a podrobně to sepsal a zhodnotil."}, {"2": "některé suroviny budeme získávat za bourání rasových budov, doufám, že to budou ty černý flašky.[BR][BR]Instanty mám tím zvládnou řešit ty dočasné budovy[BR][BR]Jinak by to bylo dost nesystémové[BR][BR]Jsem na to zvědav."}, {"31": "White Matter a Black Matter sa obe získavajú za predaj budov, konkrétne práve tých dočasných, takže aj keď produkujú suroviny s limitovanou kapacitou, úplne na nich miesto využitím PB asi neušetríme. Tá surovina jedného kusu v poslednej technológii sa predpokladám získa za predaj portálu na 4. leveli.[BR][BR]White Magic aj Black Magic sa obe vyrábajú v tej dočasnej budove, ktorá na svojom prvom leveli vyrába White Magic a na druhom Black Magic (teda za predaj ich jednotlivých levelov budú jednotlivé Matter (keďže na prvom leveli je táto budova v \"svetlom\" štýle, na druhom v \"temnom\" štýle, čím náležite produkujú White a Black Magic a za predaj poskytujú White a Black Matter)).[BR][BR]Kreatúry svetla aj kreatúry temnoty sa vyrábajú v tých rozmnožovačkách, svetlé kreatúry použitím White Magic a temné kreatúry použitím Black Magic (plus k obom semienka alebo mana). Následne v portáli sa na spôsob tréningu jednotiek vyrábajú tie finálne kreatúry, za unurium a White Magic + Temné kreatúry alebo unurium a Black magic + Svetlé kreatúry.[BR][BR]White Matter a Dark Matter sú potrebné na vylepšovanie portálu."}, {"16": "No ještě že alespoň tak, že nebudeme muset s neustálým stavěním a bouráním osadnických budov šaškovat celou kapitolu, ale jen při vylepšování portálu."}, {"2": "Přeleštil jsem kouly a vidím to asi takhle.[BR]Budem stavět dočasné baráky a po týdnu je bourat, abychom vyrobyli Matter[BR]než je zbouráme budou baráky vyrábět Magic, které bude tak málo, že pro plynulý chod celého stroje budu zásoby Magic doplňovat portálama.[BR]O všechno budem přicházet ve Facility, které spolu s tím pozřou další surky abychom získali světlé, noční a ultimátní chytrolíny, kteří nám pohnou s výzkumem.[BR]A kdo nebyl dost prozíraví aby měl čmeláka na plno spláče nad vejdělkem, páč finální vylepšení portálu je předposlední výzkum.[BR][BR]Da?"}, {"31": "@GorGlin zhruba. Okrem toho že svetlé a temné kreatúry budú potrebné na výskum, tak budú potrebné aj na liaheň tých finálnych kreatúr (ktoré budú tiež potrebné vo výskume).[BR][BR]Za seba avšak zatiaľ musím povedať, že sa mi táto kapitola zdá ďaleko sympatickejšia, než tímový duch (ten ma veľmi nezaujímal už od samého začiatku). Možno to bude tým, že celá táto kapitola je vcelku bizarná (príbehom, grafikou, aj mechanikou), a to sa mi ľúbi asi odjakživa. Hlavne to do hry prináša nejaké nové bytosti, zatiaľ čo tímový duch len zrecykloval elementálov."}, {"3": "Lovec Krys napsal/a:@Emhyr var Emreis II Ale zase mít menší zásobu many taky není k zahození:[BR]Zobrazit přílohu uživatele 5830Klikněte zde pro zvětšení...tak jako, nepohrdnul bych... ale dá se bez toho žít "}, {"16": "Zimní událost začala:[BR][IMG]https://i.ibb.co/Y3jskcb/https-cz-forum-elvenar-com-index-php-attachments-1636622031235-png-5836.png[/IMG][BR]Evo budova (pro kap. 19):[BR][IMG]https://i.ibb.co/yPXK0Xy/https-cz-forum-elvenar-com-index-php-attachments-1636621908133-png-5834.png[/IMG][BR][BR][BR]U některých odměn je výběr z více možností:[BR][IMG]https://i.ibb.co/1JGmtjp/https-cz-forum-elvenar-com-index-php-attachments-1636621710965-png-5833.png[/IMG] [IMG]https://i.ibb.co/C0hJXQG/https-cz-forum-elvenar-com-index-php-attachments-1636621943617-png-5835.png[/IMG]"}]