[{"31": "[IMG]https://i.ibb.co/XSzLNQB/https-i-ibb-co-QC32rp-F-EL-akcia-zima-2021-banner-png.png[/IMG][BR]Tentokrát sa javí, že ligy nebudú súčasťou udalosti. Prehľad udalosti bude čoskoro k nájdeniu tu, ako aj zoznam úloh a dátum začiatku.[BR][BR]Zároveň sú v tejto chvíli všetky budovy udalosti zverejnené na portáli, miesto pre denné odmeny je pripravené tu. Databáza bola zároveň pregenerovaná aby obsahovala všetky hodnoty budov pre 19. kapitolu a tiež som vykonal pár dodatočných úprav (ako napríklad tooltipy nad rôznymi ikonami, čo konečne umožňuje podržať kurzor nad obrázkom a zobrazí sa čo to je)."}, {"2": "V aplikaci se zatím nic nedeje"}, {"31": "@GorGlin je nutné mať ju na verzii 1.141 (ktorá ale vraj v niektorých lokáciach ešte nie je).."}, {"2": "Aha, tak nic."}, {"4": "tak hlavní cena je opravdu extrémně bědná  . Pozitivní je, že mám až do konce roku klid od eventů. Zahraju si jej na betě a budovu stavět nebudu."}, {"20": "@pavelb vidím to stejně . Event budu hrát, ale nepřetrhnu se ."}, {"21": "Tentokrat to taky tak vidim"}, {"2": "Já bych ho nezavrhoval, dává urinu, takže se určitě bude občas hodit."}, {"5": "...taky tam vidím pozitivum toho urunia výhledově pro 19kap. a stavět tedy finální budovu budu "}, {"221": "no hlavni budova z eventu me taky moc nenadchla unurium mam daleko a manu ci semena no si vyrobim i tak a jako relikvie to uz byl lepsi ten set co dava i cinidlo asi kvalitu teto budovy nedokazu dostatecne ocenit uvidim jake budou ostatni odmeny z eventu[BR][BR]ale tesi me ze konecne prichazi do hry ten fialovy kamen na vezku"}, {"11": "no nevím, 10k urinia za den, to je na tržišti za 3hod bez bonusu za výběr. K tomu relikvie který nepotřebuju  ani VB tam nevidím. Má trochu slušnější počet lidí"}, {"31": "A dokým príde zimná udalosť, objaví sa ešte ďalšie kolo dobrodružstiev, ktoré je v tejto chvíli naplánované na 18.11."}, {"20": "Dívala jsem se na Chrám duchů i budoucí div v 19. kapitole na unurium a myslím, že porovnání, který div je lepší, je trochu podobný, jako srovnání Bludiště s Opatstvím na manu. Snížení rozpadu je jistě dobrá věc, ale město má omezené rozměry, takže pro hodně hráčů je lepší volit jen jeden podpůrný div. Kouzel mám dost, používám je pravidelně, takže u many to pro mě byla jasná volba na Opatství, k tomu trochu kultury a nedostatkem many jsem zatím netrpěla.[BR]Myslím si, že kdo hraje pokaždé celou věž a při eventu může být častěji ve hře a sbírat eventovou měnu, pak je Chrám duchů výhodný. Ale kdo není ve hře přes den tak často a nehraje celou věž, tak je lepší si počkat na div se snížením rozpadu.[BR]A z toho vyplývá, že kdo čeká na nový div, asi postaví kulturku z eventu ."}, {"21": "Pokud ve hre nepospichas mas vseho dost"}, {"2": "@voyager-1[BR]No, když vidím kolik rasa sežere, tu 60k, tam čtvrt mega a k tomu pojedem výrobu surovin a řasy, tak jsem rád za každý zdroj.[BR][BR]@Ludi [BR]Bludiště s věží si je podobné, ale myslím že chrám se s opatstvím nedá srovnat.[BR]I když vezmu, že spotřeby jsou různé a tím pádem i množství many many za kouzlo je srovnatelné s urinou za truhlu, tak kouzel můžeš mít tisíce a použijes je přesně v tu chvíli kdy manu potřebuješ. Zato počet beden je omezený.[BR]S deseti procentním rozpadem mi zásoby sakra mizí a s hotovou věží a mimo událost prostě jen mizí.[BR]Mužů zaúkoloval trh, ale tím zas přijdu o semeno.[BR]Opatství je v produkci unikátní budova a rozpad ostatních surovin je větší problém než u many."}, {"20": "@GorGlin dost mě ovlivnila zkušenost spoluhráčky, která má Chrám duchů na 11 lv., unurium vůbec nevyrábí a po eventu ho má na kontě milion. Unurium za sběr eventové měny je právě ta podstata přírůstku. Eventy jsou jeden za druhým, takže to alespoň k něčemu bude. A když z věže někdy padají jen pitomosti, tak vždy tam bude alespoň to unurium dobrá odměna . Když jsem se nad tím zamýšlela, tak díky Chrámu se dá uriny naklikat opravdu hodně."}, {"2": "@Ludi [BR]Shodou okolností mám také chram aktuálně na lvl 11.[BR]A aniž bych urinu vyráběl, taky se mi ve skladu nastřádal slušný regál.[BR]Ale teď nemám žádnou spotřebu.[BR]Máš pravdu, že eventy jsou teď pravidelně, stále jsou mezi nimi cca tři týdny mezery a já i věž dělam nárazově a pak nějakou dobu nic.[BR]Je mozne že si to tím dělám horší, ale mám tím pádem období s velkou produkci a obdobi s žádnou a tím je rozpad hodně znát."}, {"11": "já se nemůžu rozhodnout jestli navyšovat chrám nebo počkat na ten příští proti rozkladu "}, {"2": "Já aktuálně zvedám čmeláka.[BR]Portál je v nové rase zase o trochu slabší a tak už to nebudu odkládat.[BR]Někde jsem slyšel, že si můžeš hodit korunou a podle toho jestli z výsledků budeš nebo nedudes mít radost zjistíš, co vlastně chceš."}, {"2": "@Lovec Krys [BR]Vylepseni tržiště mi umožní obchodovat T8, zatímco kolik se toho vejde do batůžku pašerákům se změní až zvednu sídlo?"}]