[{"5": "V 18.kapitole to tak je u T7:  obchod jen přes kupce a jen fixní množství podle hl. sídla lvl 38 - 1600, lvl 39 - 1800, lvl 40 - 2000, 41-2200.[BR]Snad půjde obchodovat i nahoru a dolů mezi T7 a T8 jako u všeho ostatního zboží..."}, {"2": "@voyager-1 [BR]Zkusil jsem si nějaké propočty, hodně jsem předpokládal a zaokrouhloval, takže to určitě nebude uplně sedět[BR]Ale vyšlo mi, že když vytáhneš div na lvl 30, tak ti chrám zvládne zajistit cca 200k za den a tím pádem budeš schopný nasyslit zásobu 2M uriny[BR]Oproti tomu věž ti umožní získat až 4M z produkce 80k za den, když si to budeš hlídat.[BR]Já myslím, že ty nemáš co řešit."}, {"11": "no , stejně teda nevím co je lepší. Mě už nebaví pořád řešit nějaký čísla a vzorečky. Včera jsem si poslechl přednášku Pribáňe a jejich cestu trabantama po světě a nějak mi to připadalo zajímavější než řešit unurium.   Postavit div na lvl 30 je dost dlouhá cesta, spíš pro příští kapitolu. Takže poprosím česky, kterej div je lepší?"}, {"2": "Já si myslím, že pro tebe je lepší chrám."}, {"11": "OK, poděkování dávám i když si nejsem jistej jestli není lepší vsadit na stabilitu tzn. snížení rozkladu. Ale to je zas otázka dalších několika měsíců než k tomu divu dojde."}, {"31": "Obchodovanie medzi T7 a T8 je možné (teda napríklad pri hlavnom sídle na 42. leveli je možné dostať 6900 T7 za 4600 T8)."}, {"2": "@iDavis [BR]Díky, ještě poslední věc, nemáš informaci o tom, kolik rasa vyrábí a za jak dlouho.[BR]Zatím je vidět jen to, magie se vyrábí 2000 za hodinu.[BR]Ale kolik matter padne za zbourání jedné budovy nebo jak se zadává výroba ve facility nikde vidět není."}, {"31": "@GorGlin za predaj Tower of Light (veža na 1. úrovni) je 1x White Matter a za predaj Tower of Darkness (veža na 2. úrovni) je 1x Black Matter. Výroba vo facility funguje podobne ako v manufakturach, sú tam 4 produkcie, dve pre biele dve pre čierne kreatúry."}, {"2": "@iDavis [BR]Kolik kreatur se vyrábí najednou a na kolik hodin se zadává výroba?"}, {"31": "Na 1. leveli produkuje 40 bielych alebo 60 čiernych kreatúr za 6 hodín."}, {"2": "díky 380k bílých breberek po 40, no bude to pěkný"}, {"31": "Tak na najvyššom leveli budov Facility a 3. leveli portálu vyrábajú 202 / 308. Navyše ich môže človek postaviť neobmedzený počet, keďže bežia len na  surovinách ktoré sa dajú dopĺňať portálovým bonusom (zrejme od istého počtu facilities už veže ktoré sa dokážu vtesnať okolo portálu stačiť nebudú) a inak mane a semienkach, takže pokiaľ má človek dostatočný prísun týchto surovín, mohol by byť realizovateľný princíp obchodníkov z unuru (čím viac zbúraš, tým viac osadníckych budov tam postavíš). Teda už len poriešiť náklady na vylepšovanie toľkých facilities, kde budú najviac limitujúce T8 a mana (a tej celkom dosť veľa (dokopy 2,8M na kompletné vylepšenie jednej facility)).[BR][BR]No a na záver prichádzajú ultimate creatures, ktoré sa v portáli na 3. leveli vyrábajú v množstve 75 za 3 hodiny (4. level portálu už uvažovať nemá zmysel, keďže ten sa odomyká až na konci výskumu a už sa v ňom nič neprodukuje)."}, {"2": "Jak se mi to podaří živit trojilístkem rozpadajících se surovin se uvidí.[BR]U obchodníků jsi to nemusel řešit, prodával sis věci z pravé ruky do levé[BR]tady bude logistika trochu jiné úrovně[BR]doufejme že to spustí ještě za chodu zimního eventu, aby mi to pomohl chrám poplatit[BR]já se těším"}, {"11": "možná to tu už padlo, jen jsem se chtěl zeptat, rozšíření budou zase 3? A jak je to s náporem na orky, jestli mám šetřit."}, {"2": "2 z výzkumu, 1 za provincie, další 2 za diamanty."}, {"16": "A to jsem si myslel, že osadnická cesta z týmové kapitoly je drahá:[BR][IMG]https://i.ibb.co/LYxddm1/https-cz-forum-elvenar-com-index-php-attachments-1637314770578-png-5855.png[/IMG][BR][IMG]https://i.ibb.co/fvBkNQ5/https-cz-forum-elvenar-com-index-php-attachments-1637314810435-png-5856.png[/IMG][BR]Kam se hrabe 10600 unuria na 450000 many (cena v těch flaškách odpovídá 6%PP)."}, {"2": "Tohle nemůžeš srovnávat.[BR]Urina byla bez podpory divů, produkce odkázána na jedinou budovu a ještě se střídala se semenem[BR]Uznávám že ty cifry jsou šílený, ale jen samotné opatství to zvládne slušné pořešit.[BR]Kdo má k tomu i bludo má jistě odstojnou zásobu.[BR]Kdyz k tomu přidáš spotřebu many na facilities, výrobu a kdo ví co ještě, tak myslím že tahle rasa vezme přes sto milionů many bez větších obtíží.[BR]Poslední lvl portálu až na konci výzkumu mě zklamalo víc."}, {"16": "@GorGlin Srovnávat to můžu z hlediska denní produkce many vs unuria.[BR]Ano, ty a já a další, kteří máme v inventáři tisíce kouzel, si to můžeme naklikat přes opatství, ale je tu i rozsáhlá skupina hráčů, kteří se mohou spoléhat jen na svou denní produkci many, a pro ty to znamená, že žádnou velkou osadu nebudou moci postavit a o to delší pro ně kapitola bude."}, {"2": "To máš jistě pravdu, ale kdo se doplahoci až sem s tím že chodí na hru dvakrát za den, tak je na to tempo zvyklí.[BR][BR]Perks jsou na betě už docela dloho, nemáte někdo info o tom kdy to případně chtějí zavádět tady?"}, {"18": "@GorGlin taky by mě to zajímalo."}]