[{"11": "podle beta fora asi bude dřív nová kapitola. Má význam dopředu vyrábět T7?"}, {"2": "No to sakra.[BR]Budeš ho potřebovat na stavbu rasy v řádech statisíců.[BR]Bude to zase pekelná klikacka, takže čím dřív začneš tím dřív to budeš mít z krku."}, {"16": "@voyager-1 Pokud ti to nenaruší shromažďování semen a unuria, tak klidně můžeš začít, ale prvních pár výzkumů je potřebovat nebudeš. Až na stavbu portálu myslím a to je hned 120k T7+1.[BR]Získávání bílé a černé hmoty je taky zábavné (a hlavně \"levné\"):[BR]Bílá hmota (1): Postavit Věž světla (8,9k T7+1)a pak ji zbourat.[BR]Černá hmota (1): Postavit 2 věže světla(17,8k T7+1), jednu z nich zbourat a druhou vylepšit na lv2 za 1 bílou hmotu a 24k T7-1 a pak zbourat."}, {"2": "Na věže stačí schrastit 500 VB.[BR]Když se to dobře sejde s turnajem, tak jsme tam coby dup"}, {"2": "Na betě oznámili další úpravu knihovny.[BR]T4 a T6 produkovaných setem se bude řídit podle bonusu města.[BR]Já dělám mýdlo s gumou, tak budu dostávat mýdlo s gumou."}, {"5": "Již ty první úpravy knihovny opravdu trhu pomohly, jen tak dále..."}, {"11": "ty kupci tentokrát frčí. Jsem se třemi za den směnil 100k"}, {"221": "ano o knihovne jsem rano cetla taky, potesilo me ze vyrabet pryskyrici uz nemusim pokladat za smulu[BR][BR]asi pred par dny jsem ale vyzvedla naky ty odmeny z cesty eventem a nyni ve vezi na me pri kazdem vyjednavani sviti ten kamen a jen cekam kdy se ukliknu ...[BR][IMG]https://i.ibb.co/DYXYv12/https-cz-forum-elvenar-com-index-php-attachments-kamen-jpg-5863.jpg[/IMG][BR]myslim ze ze ho neumistili zrovna dobre"}, {"31": "@Hexik aj keď sa uklikneš a nejakému duchovi ho dáš, ešte stále ho môžeš zameniť za inú surovinu. Takže áno, je akurát pod rukou, ale zatiaľ sa mi ho našťastie nechtiac použiť nepodarilo.."}, {"221": "no uvidim nekdy kdyz jde na me unava nebo tomu nevenuju dostatecnou pozornost a pak koukam co tam vubec klikam takze bych radej aby to bylo nejak zvlast kdyz to neni moc k sehnani"}, {"31": "Budova s drakom, ktorá bude dostupná behom akcie Čierny piatok je už nahraná aj v databáze a konkrétne parametre si môžete pozrieť tu."}, {"2": "Pěkná, mám rád draky."}, {"18": "Já taky"}, {"31": "V tejto chvíli naplánovaný termín Zimnej udalosti je uvedený v prehľade."}, {"31": "Väčšina úloh zimnej udalosti je v tejto chvíli zverejnená v prehľade."}, {"233": "AHoj zeptám se, je znám seznam úkolů v současném eventu? Našel jsem kouzlo zimy, ano, ale jen tu verzi s 75 úkolama. SOučasnou rozšířenou na 100 nikoliv.[BR][BR]Díky"}, {"66": "iDavis je má už všechny na svém portálu."}, {"233": "A to najdu kde ten jeho portál?"}, {"66": "Interaktívny kalendár odmien nájdete na novom portáli. Portál podporuje český jazyk, ktorý je možné zapnúť kliknutím na glóbus v pravej hornej časti stránky."}, {"221": "z bety[BR][IMG]https://i.ibb.co/BqBRdbK/https-cz-forum-elvenar-com-index-php-attachments-golem-nebo-fenix-jpg-5908.jpg[/IMG][BR]krom toho ze jsem si nahodou vsimla navratu dousku tak by me zajimalo jestli nekdo nevi jestli to ma byt golem ktery je na obrazku a nebo artefakt na stareho fenixe ktery mi padl jinak je to truhla za 12. stret"}]