[{"2": "Na betě začal odpočet na nový event.[BR]The Forbidden ruins"}, {"11": "a co DS ?"}, {"2": "nebylo"}, {"11": "nebylo už náhodou v minulosti jednou, že na Betě DS nebylo a na live ano?"}, {"2": "Nevím, je to možné, zatím k tomu není žádné oficiální vyjádření[BR]možná vycházelo DS na svátky a tak se rozhodli ho vypustit[BR]nebo prostě nebude, to by taky nebylo prvně"}, {"31": "Myslím že balans tohtoročnej zimnej udalosti dovoľoval bez problémov dosiahnuť 9. artefakt, takže DS zrejme nedali zámerne. Tiež je ale pravda, že frekvencia udalostí v prvých mesiacoch nového roka chce byť tentoraz trochu vyššia (minulé roky bol len karneval, teraz v rovnakom časovom horizonte sú už naplánované Zapovězené ruiny a ďalšia nová udalosť), a tak naňho asi neostal čas."}, {"11": "\"  bez problémov dosiahnuť 9. artefakt \" To je sporný, záleží jakým stylem kdo hrál. Ten kdo hrál na VB a po jejich získání protočil odměny neměl šanci. Získal 7-8 artefaktů a spoléhal na DS."}, {"8": "Zrovna tady se nejak extra moc planovat neda. (max se tvarit ze se clovek snazi vychytat a nasobit nasobne postupy a nevybira kola kde nejsou nebo jsou male). Hral jsem stylem, ze jsem seber a utrat hned co padne. zadny \"plan\" na cokoliv. a 9 artefaktu mam uz ted a cely den jeste pred nama. 0 utracenych diamantu. Denne sebrano tak 25 klicu kolem mesta - kvuli uranu. A doufam ze brzo bude dalsi udalosta at uz to bude cokoliv, protze uranu je porad malo "}, {"16": "@iDavis S tím by moje beta město rozhodně nesouhlasilo, tomu 1 artefakt chybí. Přetočení jsem tam nepoužil, ale asi jsem neposbíral dost klíčů kolem vesnice. Moje hlavní město má 9 artefaktů, ale jen těsně (261 z potřebných 260).[BR]Bez DS bude spousta hráčů bez lv10."}, {"20": "@Lovec Krys - souhlas, jsem na tom naprosto stejně: na betě Boblina 9 lv., na live úplně na těsnovku 10 lv."}, {"2": "já mám dva klíče a chybí mi jeden dárek na sovu[BR]je pravda že jsem nakrmil popeláka a svědomitě sbíral kolem města, ale tolik to zase hodit nemohlo"}, {"20": "@GorGlin řekla bych, že tentokrát mi ty klíče moc na město nepadaly. Jindy jsem jich nasbírala víc."}, {"234": "Já jsem popeláka zavrhnul. Nemyslím si, že by byl v Eventech nápomocný a když, tak jen málo. Ale to, že nedali DS mě zklamalo. Že by další nátlak na útratu peněz?"}, {"2": "když si počkáš, dostaneš artefakt ve věži[BR][BR]popelák tentokrát dal 99 klíčů, to jsou 4 okna[BR]to můžou být 4, ale až 9 dárků[BR]mě pomohl zarovant odměnu, bez něj bych to nedal"}, {"18": "Ono otázka na snadě je i ta, jestli nevyužijí nové druhy kouzelných formulí a do příštího DSka místo artefaktu hodí tyhle formule a my si budeme moci vybrat ze dvou či tří artefaktů. Teď se totiž běžně stávalo a všiml jsem si občas i zde na fóru že si na to někteří stěžovali, že po DSku hráčům jeden artefakt přebíval. A ty se pak hromadili v inventáři. Sám jich tam mám jen na arendylu podobných asi deset."}, {"2": "Možné to je, levlovacek už je kopa a posledně to tak udelali"}, {"18": "@GorGlin právě proto mne to napadlo."}, {"229": "Zapnuty popelak sber okolo mesta normalne mam 9 Artefaktov na A. Na W bez popelaka 8 Artefaktov."}, {"21": "Popelak nenakrmen zber okolo mesta pravidelne artefakty 10"}, {"2": "@indian068 [BR]10?[BR]jako devět artefaktů a jeden svazek?"}]