[{"222": "Všechny úkoly splněny, pravidelny sběr klíčů, bez finanční výpomoci. Přesto dost hráčů ve spolku má 7-8 artefaktů a spoléhali na DS."}, {"21": "GorGlin[BR]Omluva 9 preklep dik za upozorneni"}, {"2": "@indian068 [BR]omluv netřeba, přál bych ti to"}, {"31": "Na bete sa začala najnovšia udalosť - Zapovězené ruiny.[BR][BR][IMG]https://i.ibb.co/VCgWqZZ/https-i-ibb-co-m-N9k-Rp1-EL-akcia-janu-r-2022-okno-akcie-mal-png.png[/IMG][BR]Prehľad udalosti je dostupný tu.[BR][BR]Týmto zároveň dávam do pozornosti, že počínajúc touto udalosťou, zoznamy úloh viac nebudú súčasťou témy Události a úkolové linie, ale budú presunuté na môj portál, kde budú dostupné spolu s celou databázou budov. Úlohy je na podstránke Všetky udalosti možné zobraziť kliknutím na \"Úlohy\" v paneli na ľavej strane obrazovky. Tieto nové zoznamy zároveň obsahujú aj nové interaktívne funkcie a možnosť zdieľania pomocou vygenerovaného odkazu zobrazeného nad zoznamom úloh. Jednotlivé poznámky k úlohám ktoré na stránke vykonáte si prehliadač zapamätá, takže pri ďalšej návšteve sa vám zobrazia tak, ako ste ich nechali naposledy.[BR][BR]Aby sa zoznam úloh zobrazil preložený, je nutné si na stránke nastaviť český jazyk (kliknutím na glóbus v pravej hornej časti). Do systému zoznamu úloh som totiž zakomponoval funkciu prekladu do viacerých jazykov, čo znamená, že bude dostupný širšiemu spektru komunity.[BR][BR]Všetky nové budovy udalosti sú dostupné na podstránke Všetky budovy. Táto stránka zároveň obsahuje zopár inovácií, ako napríklad konečne preložené možnosti filtrovania a usporadúvania budov, ako aj najnovšia možnosť zoskupovania budov podľa jednotlivých setov.[BR][BR]Súčasné množstvo interaktívnych funkcií v zoznamoch úloh (označovanie splnených úloh a vyznačovanie úloh na prípravu) sú moje aktuálne nápady. Som samozrejme otvorený pridaniu akýchkoľvek ďalších funkcionalít, takže pokiaľ máte nejaký zvyk, ktorý pri sledovaní úloh v zoznamoch zvyknete vykonávať a radi by ste ho videli ako súčasť portálu, napíšte mi cez kontaktnú stránku a pokiaľ to bude realizovateľné, je možné že sa to na portáli v budúcnosti objaví."}, {"2": "Já bych rád poukázal na několik zajímavostí.[BR]Odměnou je opět set, jsou tu jisté podobnosti s lonským, ale.[BR]Hlavní budova dává zase manu a lepidlo, ale místo run, trnové kouzelnice.[BR]Liga poskytuje kouzlo na získání budov z lonského eventu.[BR]V hlavních odměnách je nové kouzlo, které zachrání až 75/100% ztrát jednotky ve střetu."}, {"31": "Požehnání na doplnenie jednotiek je možné využiť po boji v okne s výsledkami:[BR][BR][IMG]https://i.ibb.co/XFXTMZ1/https-i-ibb-co-d6-Scp-Wy-EL-akcia-janu-r-2022-po-ehn-n-na-dop-anie-jednotiek-png.png[/IMG][BR][BR]Po kliknutí na tlačidlo so srdiečkom sa zobrazia nazbierané požehnání (podobne ako zesilovače pri snahe o urýchlenie výroby) a umožňuje vyliečiť príslušné percento (v závislosti od sily vybraného požehnání) jednotiek oddielu. Z tohto zrejme jasne vyplýva, že toto požehnání nadobúda silu najmä vo vyšších stretoch turnajov, kedy je veľkosť jedného oddielu už značne vysoká.[BR][BR]Tiež je využiteľné vo veži na doplnenie jednotiek medzi jednotlivými vlnami."}, {"2": "@iDavis [BR]Ou, tak to je zklamání.[BR]Myslel jsem že to využiju, když se seknu a přijdu o všechny vojáky v automatu.[BR]Ale abych je oživil, potřeboval bych těch požehnání 5.[BR]Takhle to vypadá že to není na ušetření jednotek, ale spíš do věže."}, {"31": "Termín udalosti Zapovězené ruiny je v tejto chvíli uvedený v prehľade."}, {"223": "@iDavis,  jen drobná nejasnost, video k události v čase 1:28 ukazuje 78 úkolů, Ty máš ve svém přehledu uvedeno v Milníkových odměnách 89 úloh."}, {"31": "@Mescal ďakujem za pripomenutie, ale nerozumiem, kde vo videu si našiel úlohy?"}, {"11": "v tom videu se v tom čase, dole na časový ose,  opravdu zobrazuje 78 úkolů[BR]https://imgur.com/Dxa6dl0"}, {"31": "Aha takže toto video. Ono v prehľade mám ako \"video k udalosti\" označené to z môjho kanála, tak som myslel, že má @Mescal na mysli to."}, {"2": "Tak to je skvělá zpráva, s ohledem na fázi rasy mi urina za sběr eventove měny vytrhne trn z paty"}, {"20": "Event není špatný, určitě hráčům, kteří dnes nemohou postavit víc setů Knihovny, pomůže s produkcí činidla. Na betě mi set dost pomůže, na live ne, ale to máme každý jinak. Možná postavím na live část setu kvůli maně, ale ještě jsem se nerozhodla. Zatím to vypadá, že při běžném plnění úkolů se dá zvládnout celý set."}, {"2": "Set je trochu oříšek.[BR]Many je celkem dost a na plný výkon stačí tři budovy, ale nějakým nedopatřením je druhá budova z komba až na posledním místě a tudíž řada hráčů tu výhodu nezíská.[BR]nasbírat dost eventové měny na 260, v tomto případě holí, není samozřejmost.[BR]já jsem na denních úkolech a za zbývajících 12 dní eventu potřebuji nasbírat 2k svitků a to asi nedám.[BR]Produkce setu mě překvapila.[BR]V maně je určitě jistá konkurenceschopnost, ale to je asi jediné.[BR]Produkce T3 suroviny odpovída cca 1,5 manufaktuře[BR]ale kouzelnce v daném počtu vypotím v táboře asi za 2 hodiny[BR]a cena lepidla se neustále zvyšuje[BR]knihovna dá jedno lepidlo při velikosti 24 polí a to vůbec nemluvím o produkci za 21 hodin, která je skvělá a nikde jinde nevídaná.[BR]poutnický set má 40 polí a ztracené ruiny 42[BR]Já osobně set nepostavím nikde, tedy celý.[BR]Manová sekce bude stát kde padne, zbytek mě neoslovil.[BR]Dost mě překvapilo, že budovy produkují jedné T3 suroviny cca dvojnásobek než těch ostatních.[BR]Tak uvažuji jak si to vyložit.[BR]Budova je dost špatná že se nečeká tak velké rozšíření jako u knihoven, produkce je navázaná na bonusy města, nebo je to plánované rozhození trhu, kdo ví.[BR][BR]Pro mě zajímavé v tomto eventu je z ligy přístupný loňský set.[BR]Pokud se Inno rozhodne, tak staré sety během nějakých pěti sesti let můžeme postavit což by bylo skvělé."}, {"11": "Takže kdo chce set tak netočit výhry kvůli VB [BR]Ohledně starých setů, jak vyřešit pokud je někdo má? Postaví si druhej nebo na něj nebude mít nárok? Třeba karnevalová sada s fontánou"}, {"2": "Já to tak neberu, svitky určitě vytočím na VBčka, jasně, pokusím se chytit pár oblizováků, ale mě nejde o odměnu ale o volbu...[BR]hradů?"}, {"2": "Mno, tak jsem na betě juknul do divu, výzkum, a přidali mi tam čudlík.[BR]Že prej mám 36 run[BR]Tak jsem na něj kliknout, a jestli jsem se neprekouk, tak mi jedna zmizela a v divů přibylo 10 VB[BR]Dlouho jsem ignoroval šesté kolo v turnaji, runy ani úlomky mě moc nezajímají[BR]Ale jestli jsem se nepřehlédl, tak to asi prehodnotim[BR]A když je takhle pošleš k sousedovi, tak dokonce 15[BR]Ne soused, člen cechu"}, {"16": "Nemusí to být člen společenství. Zkoušel jsem to i sousedům na mapě i neobjeveným hráčům. Dává jim to taky 15."}, {"31": "No nejaké VB z toho budú..[BR][BR][IMG]https://i.ibb.co/DgJw1fq/https-i-ibb-co-v-VW9q-TR-EL-runy-19-1-2022-png.png[/IMG][BR][BR]Zatiaľ sa mi nejak ťažko verí, že súčasný pomer 1 runa = 10/15 VB sa dostane aj k nám."}]