[{"18": "No ty kudla @iDavis stoho zatáhneš několik levelů v každém divu."}, {"2": "Pst, ať to nezakriknes"}, {"31": "Majú prístup k dátam takže určite vedia, že existujú aj takéto prípady. Skôr si myslím, že hráčov, ktorí majú takéto zásoby (najmä z čias starých turnajov), je drvivá menšina."}, {"16": "Asi takhle (cz1 / cz2 / beta):[BR][IMG]https://i.ibb.co/9YFmT7Z/https-cz-forum-elvenar-com-index-php-attachments-1642617225394-png-5916.png[/IMG][BR]Vsadím se, že velká většina hráčů bude mít runy na nebo i pod úrovní mojí cz2, takže z toho průměrně zase tak moc nebude.[BR]A kdyby to nastavili podle nás, tak z toho zase většina nic nemá."}, {"3": "No, když už jsme u toho chlubení, přidám i svou trošku. Zlaté propasti pro všechny!! [BR][IMG]https://i.ibb.co/qp34Lh3/https-cz-forum-elvenar-com-index-php-attachments-1-png-5918.png[/IMG]"}, {"20": "Jedna drobnost - na VB se dají použít jen runy, ne runové úlomky. Je vidět, že počet run k použití v divu je viditelně nižší, než v počet run a úlomků v celkovém seznamu."}, {"2": "Jaký je rozdíl mezi runou a runovým úlomkem?"}, {"3": "taky přemýšlím... mám pocit, že jsou úlomky run a pak zlomené úlomky (což je teda fakt srandovní název)"}, {"31": "V mojom porozumení - a môže to byť inak ale ja som si už na to takto za tých 100 rokov zvykol - je runový kruh, ktorý sa naplní 9timi runami, ktoré možno rozbiť na runové úlomky, pokiaľ sa zasadia do už obsadeného slotu. To znamená, že môj počet rún je podľa môjho slovníka a obrázku na predošlej strane okolo 11000, čo činí okolo 170.000 VB pri zasadzovaní do cudzích prastarých divov."}, {"20": "Rozdíl je mezi celou runou a runovými úlomky. Na složení 1 runy potřebujeme 10 runových úlomků. V turnaji (i jinde) občas získáme celou runu, ale častěji runové zlomky, takže celkový počet toho, co máme ve skladu, mohou být jak celé runy, tak runové úlomky. A když se na betě podívám do divu, tak mi to nabízí k prodeji určitý počet run, ale v celkovém počtu ve skladu mám daleko víc, tedy, ten rozdíl jsou jasně runové úlomky."}, {"229": "Tak toto je hodne zajimave,čo sa to tu piše.Mam otazku .Priklad[BR][BR]Mam runy zlata propast možem tieto runy (VB) vložiť aj do ineho divu než je zlata propast susedovi ? alebo je tam pravidlo že runy (VB)musia suhlasiť s konkretnymy divamy ?"}, {"16": "@Marian24[BR]Vypadá to takhle:[BR][IMG]https://i.ibb.co/X44tWtH/https-cz-forum-elvenar-com-index-php-attachments-1642672865447-png-5919.png[/IMG] [IMG]https://i.ibb.co/PTM5379/https-cz-forum-elvenar-com-index-php-attachments-1642673115631-png-5920.png[/IMG][BR]A je to omezeno dle typu divu.[BR]Tzn. runy ze zlaté propasti můžeš použít pouze ve zlaté propasti (své nebo jiného hráče)."}, {"3": "nechci chytračit, ale myslím, že @Ludi to neříká úplně dobře a plete jablka s hruškama  a @iDavis zase nepoužívá přesnou terminologii [BR]Ale i z těch @Lovec Krys obrázků vyplývá, že používat se budou \"úlomky run\". tedy ty pěkné barevné fragmenty, které se používají každých 5 úrovní divu a zasazují se do toho kruhu. Skoro bych řekl, že jich není třeba 10, jen 9, ale to si nejsem zase já úplně jistý [BR][BR]Jisté je pouze to, že zlomené úlomky, kterých se dá použít 10 na jeden runový úlomek, tady v tomhle případě asi použít nepůjdou... ale to už by musel někdo, kdo to testuje na betě potvrdit nebo vyvrátit"}, {"21": "Emhyr var Emreis II napsal/a:\t\t\tSkoro bych řekl, že jich není třeba 10, jen 9\t\tKlikněte zde pro zvětšení...Presne receno jen 9"}, {"11": "taky jsem z těch úlomků blbej  Podle mě je runa to co při navyšování divu padá přímo do kruhu.[BR]A z deseti úlomků se jedna runa uková."}, {"16": "V originále jsou to \"Rune shards\" a \"Broken shards\".[BR]V češtině to máme jako \"Runové úlomky\" a \"Rozbité úlomky\".[BR]Podle mne je to názvosloví nešťastné už z originálu. Přijde mi logické do runového kruhu vkládat runy a ne úlomky [BR](a myslím, že dost nemalá část hráčů říká runovým úlomkům prostě runy a rozbitým úlomkům prostě úlomky). [BR]Ale jak si to autoři pojmenovali, tak to mají.[BR]Používají se samozřejmě runové úlomky. Funkčnost rozbitých se nezměnila."}, {"11": "aha, takže runa ani neexistuje ale je to úlomek runy a to druhý je rozbitej úlomek. No ale svým způsobem myslíme všichni to samý.[BR]A říkat runa a úlomek mi přijde i srozumitelnější."}, {"20": "@indian068  - ano, do kruhu vkládáme 9, ale vedle máme místo, kde z 10 rozbitých zlomků skládáme runu (nebo jak psal Lovec Krys) runový úlomek, kterému já říkám runa. Původní názvosloví je fakt divné. To, co máme celkově ve skladu, je celkem počet run + rozbitých úlomků, ale úlomky se na VB požít nedají.  Proto celkový počet a počet, který se nám ukáže v divu na nákup VB, je jiný."}, {"11": "To, co máme celkově ve skladu, je   počet  runových úlomků a rozbitých úlomků "}, {"20": "@voyager-1 je to tak, proto tomu říkám runy a úlomky  . Navíc v runovém kruhu, když je hotov, se zaškrtne políčko, kde je napsáno: \"všechny runy získány\". Není tam \"všechny runové úlomky získány\" ..."}]