[{"21": "Ludi Abys ziskala runu potrebujes 10 ulomku jinak 9 run do kruhu.Zjednodusene receno aby to nematlo ostatni"}, {"5": "Pokud to půjde dát sousedům i neobjeveným hráčům , tak opětovně voda na mlýn podvodníkům s push účty!"}, {"3": "pokud má někdo účet jen na to, aby si leveloval své divy, tak nebude mít příliš mnoho run... nevylévejme s vaničkou i dítě. Proti pusherům je třeba zasáhnout, ale jiným způsobem"}, {"2": "Já su rád, že runy získají funkci a pomůže to zvednout divy, které dál pozvednou moje město.[BR]V každé hře jsou nějací fixliri a já si tím hru nehodlám kazit."}, {"221": "novinka skvela na bete menime jak vztekly nakonec kazdy vb dobry, ale tohle?[BR][IMG]https://i.ibb.co/d2fRbL3/https-cz-forum-elvenar-com-index-php-attachments-prilismnoho-jpg-5929.jpg[/IMG][BR]proste nejde pomoci v divu tedy vymenit s timto hracem vb do prkynka doufam ze taky nenarazim na limit tady"}, {"2": "@Hexik [BR]Za jakých okolností se to tam ukázalo?[BR]Já viděl na betě výměny stovek bodů."}, {"19": "Na FB se objevilo info, že se jedná o ochranu proti pushingu. Inno prý tají limit, ale při jednostranném plnění divů, dojde k dočasné blokaci."}, {"221": "@Radvanus myslela jsem si ze to bude neco takoveho[BR]jinak menime taky ve velkem po stovkach"}, {"3": "tak na tohle jsem opravdu zvědavý v praxi. Sám mám nasysleno v instantech tisíce VB, abych mohl rychle vylepšovat užitečné divy z nových kapitol..."}, {"5": "Pokud to nasypeš sobě nebo lidem ze spolku, tak za mne vše ok...pokud kamkoliv jinam už se to může zneužívat a prevence je na místě, takže případná blokace snad odradí případně aspon´ odhalí ,,pušery,,.... myslím košér přístup od INNA, dobře vymyšleno. Palec."}, {"21": "Itak se daji kazit nahozy do divu nemyslim klasicke kolecka"}, {"2": "Všechno se může pokazit, to se bohužel nedá nic dělat."}, {"3": "co znamená \"kazit náhozy\"?"}, {"21": "Znemoznis zisk odmen z divu"}, {"2": "Jak?"}, {"21": "Zablokuje si bednu odmen v divu prastarou vedomosti aby se nevyplatilo dohodit beze strat prastare vedomosti.Pokud ma navic VB treba s rozvinutelnych budov eventu tak je pouzije zbytek dorovna prastarou vedomosti a bude vysmatej.Staci si jen pohlidat dohazovanej div"}, {"2": "Jako že najdu skoro naplněný div a tam pak dám body aby mě někdo jiný nemohl předběhnout?"}, {"3": "já pořád nevidím žádný problém. Někdo použije své runy a těmi ti naplní VB v divu. Kde je problém?[BR]asi mi uniká pointa... může to trošku nabourávat systém \"vláčkařů\", ale \"kolečkáři jsou v klidu. Tam se do divu vždycky nahází víc, než kolik se z něj vytáhne, takže odstřelování ztrácí význam"}, {"2": "vláčkaři a kolečkáři?[BR]To je jedna parta, ne?"}, {"21": "Kolecka sou jen na vymenu VB tam je to jedno.Dohazovani je ze vlastnik divu dohodi VB tak aby zbylo jen na dhozeni 1,2,3 atd. mista v divu.Predstav si ze dohdis na prvni misto abys mel zisk 3 vedmosti,pak te nekdo predhodi a najednu ses na druhem miste,strata 20 vedomosti.Pak mas dve moznsti bud prihodis neb se smiris ze stratou,at tak nebo tak ses uz ve ztrate, pokud se div neuzavre dohozenim volnych pozic.To je ta blokace neboli zkazeny nahoz"}]