[{"65": "ani já nepřispěju pozitivním ohlasem... když srovnám tuhleto s halloweenem, je to mnohem náročnější a odměna poloviční. a nejsou tam urychlovače jako průběžné odměny (kvůli kterým jsem vlastně halloween plnil) [BR][BR]když to srovnám s velkou událostí, tak pokud bych na podzim splnil prvních 57 úkolů, otevíral jen při dvojnásobku, mám jistý pařez. [BR][BR]když vezmu denní odměny ze zimní události, tak 1 loďka je lepší než odměna za 57 splněných úkolů. za 57 úkolů zimní události bych dostal 1172 klíčů, což je 8 zlatých truhel a velká šance na 2 lodě. jedna téměř jistá. a k tomu nějaká požehnání, urychlovače a další věci."}, {"76": "Když je teď orčí valentýn, třeba další bonusová budova bude vílí mučírna [smilie--sprite8]"}, {"16": "Původně jsem neměl v úmyslu se valentýnského eventu zúčastnit z důvodů:[BR]1) Kritický nedostatek místa - nebylo prostě kam postavit potřebné minimum nebonusových manufaktur, aby bylo možné splnit úkoly.[BR]2) Parametry budovy - ty jsou prostě horší než u denních odměn ze zimního eventu, takže nemělo smysl se snažit, když by mi ta budova hnila v inventáři.[BR][BR]Co se změnilo?[BR]1) Přibylo mi jedno rozšíření, na kterém můžu postavit nezbytné minimum nebonusových manufaktur.[BR]2) V průběhu eventu dokončím kapitolu orků a vstoupím do kapitoly lesních elfů, parametry budovy se tedy výrazně zlepší.[BR][BR]Závěr:[BR]Eventu se nakonec díky specifickým podmínkám (přechod do vyšší kapitoly) zúčastním a nahradím tak jednu ze starších budov (Eldrasilské posvátné síně)."}, {"61": "já to taky zkusím, budova mi nepřijde k zahození a u úkolů necejtím nějakej pres, při nejhorším se na to vykašlu v průběhu [smilie--sprite1]"}, {"31": "Prinášam nové info.. [smilie--sprite1][BR]Sneak peek[BR][BR]Spoiler: Sneak peek\"Tajomné vejce v horách ukrývá se,[BR]ne každý pták tak velké snese.\"[BR][BR][BR][BR]Čo myslíte, komu patrí? [smilie--sprite2][BR]​"}, {"29": "Neříkej, že se k nám vrátí fénix... [smilie--sprite9][smilie--sprite8]"}, {"16": "Na jarní událost je ještě brzo ne? Ta by měla začít tak za měsíc.[BR]Možná nějaká zkrácená verze založená na fénixovi nebo jen podobná?"}, {"61": "já myslím, že by to mohla být jarní událost. Tak nějak víc mě zajímá ta postava, co to vejce drží. Osobně tipuji, že to bude vejce něčeho jiného než fénixe, spíš bych to viděl na draka [smilie--sprite11]"}, {"2": "nebo k nám přichází plakopysk"}, {"80": "Jasne,bude to drak.Fenix sa nerodí z vajca,ale s popola. Možno tá tajomná postava s tým mega kinder vajcom je Daenerys a konečne začne masaker[smilie--sprite1]"}, {"72": "A jarní událost nějak souvisela s velikonocema? Minule?"}, {"61": "no tak jakože právě vejcema, myslím, že i některé odměny byly inspirovány..."}, {"2": "Milosko som ja napsal/a:\t\t\tJasne,bude to drak.Fenix sa nerodí z vajca,ale s popola.\t\tKlikněte zde pro zvětšení...[BR]Nevím jak u tebe, ale tady se rodí z vejce, mám ve městě barák, na kterém je to jasně vidět.[BR][BR]Drak by byl super, těch bych si pár do města rád pořídil."}, {"73": "...ne kazdy ptak takove snese... to bude beztak zase fenix, draky by neprirovnavali k ptakum"}, {"79": "nahoře letí cosi červeného, to by mohl být i pták Ohnivák [smilie--sprite2] zajímavé toto [smilie--sprite1]"}, {"72": "Nebo třeba větev [smilie--sprite1][BR][BR]Odstraněna zbytečná citace. Embla"}, {"61": "nene, to letí drak, co bydlí v té jeskyni vzadu [smilie--sprite8]"}, {"81": "Některé události jsou fajn. Přinese to spoustu hlavně denních odměn které se hodí na předělávání měst třeba na lepší kulturní budovy atd. Ovšem při poslední události Valentýn nechápu proč to opravdu nebyla záležitost daného dne, místo toho se to hloupě táhne tak v obchodech black friday který spíše znamená black everyday do vyprodání předloňského zboží aby se uvolnilo místo pro novinky. [BR]Zároveň v poslední době nechápu tu zapálenost splnit celou událost i přes investování více hodnost než odměna nabízí. Za Valentýna já osobně děkuji za relikvie a to je tak vše [smilie--sprite1]. A ještě bych se vrátil na začátek mého povídání že události jsou fajn to jistě ano ale na úkor místa, je sice fajn že se mění budovy za lepší ale někteří rozšiřují a rvou tam nejdřív budovy potřebné ke splnění událostí a pak nevím jestli je to zbouráno ale plus budovy z odměn ale pak každý křičí že není místo pro další kapitolu. Gratuluji velcí a akční hráči jste poraženi promyšlenou taktikou innogames. [smilie--sprite2]"}, {"2": "já to asi nepobral"}, {"31": "Sneak peek[BR][BR]Spoiler: Sneak peek\"Že jde o nový event jste uhádli,[BR]přinese to, co Rudovous s obry společné měli.\"[BR][BR][BR][BR]Čo to bude? [smilie--sprite1] ​[BR]"}]