[{"8": "lidi si zbytecne pridavaji problemy vlastnima zbytecnyma pravidlama [smilie--sprite8] proste volna soutez. chces vic?  dej vic [smilie--sprite1]"}, {"31": "Na bete došlo k aktualizácii odmien z Tajomného objektu. Nová zostava odmien vyzerá nasledovne:[BR][BR]ŠancaOdmena13%1x Dračí balón43%5x prastará vědomost (10)33%2x Spektrální kámen10%1x Zahrada přepychu--10%500x diamanty43%35 VB30%4x požehnání na ľahkoodencov (10)17%1x Zahrada přepychu--13%1x Lahodná oříšková jeskyně50%5x prastará vědomost (10)23%4x požehnání na strelcov (10)13%4x Nejmenší místnost--10%500x diamanty43%5x prastará vědomost (10)37%12x zesilovač (5 hod)10%1x Hvězdárna--17%1x Dračí matka43%35 VB35%8x zesilovač (8 hod)10%1x Dračí balón--17%1x Mořská panna v lastuře40%5x prastará vědomost (10)27%12x zesilovač (5 hod)17%4x Nejmenší místnost--20%500x diamanty47%35 VB10%3x Spektrální kámen23%1x Hvězdárna......[BR]Odmeny sa po týchto objektoch menia aj naďalej, takže zatiaľ neviem, či sa jedná o nejaký cyklus objektov podobne ako predtým, alebo sa generujú celkom náhodne."}, {"8": "smutne, ale i pri vetsinovem 20% sanci diamantu na bednu a tak 5-7 bednach za tyden mi padaji hodne malo.. ted to bude jeste horsi."}, {"66": "Takže sbohem festivalový obchodníci. Teď se budem modlit, aby bylo něco kloudného v eventech. [smilie--sprite3]"}, {"16": "@Prealiena Bohužel ve 2/3 událostí to jsou pouze pop/kult/semena odpady s mizivou produkcí semen."}, {"66": "Jo, pardon. Spletla jsem se, obchodníci jsou v receptech řemeslné výroby a tady se bavíme o tajemném objektu. Uf, to jsem si oddechla.[BR][BR]@Lovec Krys Právě proto mě to tak znepokojilo."}, {"222": "Tak ty záchodky mi opravdu chyběli.[smilie--sprite1] [smilie--sprite8]"}, {"223": "Jediná zajímavá budova je Dračí balón, jinak nic moc."}, {"2": "Takhle se to nadá říct.[BR]Je pravda že to je barák co nahrazuje třpitového otce bez dopadu na výkon.[BR]Jiné jsou nahrazeny se ztrátou, ale jsou tu třeba Glossy Garden ty jsou skvělé nejen v číslech, ale i na úlomky.[BR]Záleží na preferencích.[BR]Já jako pokročilý hráč na konci výzkumu ostrouhám, jako hráč zameřený na boj hned dvakát.[BR]Budovy pro mě nejsou zajímavé, vyjednávací kámen nechci.[BR]Ale čumačumárum samotná prodikce divů je u mě zárukou, že nic flákat nebudu.[BR][BR]Řemeslnou výrobu jedu kvůli ní samé, ne kvůli truhle"}, {"223": "...mluvil jsem jen o budovách, ne o odměnách jako celku."}, {"2": "Na betě je oznámeny další event. [BR]Ikona mi asociuje Amuni.[BR]Tak to možná bude velká výprava za králem Jelimanem."}, {"228": "tak opět nebude DS??"}, {"2": "Zdá se.[BR]Ale na častá DS jsem přečetl stoh kritiky, takže je možné že nám chtěli udělat radost."}, {"228": "asi ano  [smilie--sprite2][BR][BR]Odstraněna zbytečná citace. Embla"}, {"31": "A na túto udalosť sa teším, lebo je to moja obľúbená mechanika. [smilie--sprite1][BR][BR]DS zjavne nebude, ale čo sa týka artefaktov, hlavu by som nevešal. Máme tu nové zväzky a vyzerá to tak, že budú začlenené v budúcich DS, teda umožnia nám vybrať si artefakty aj z udalostí, ktoré neboli nutne hneď pred tým ktorým DS."}, {"2": "@iDavis [BR]ted mě děsíš, tvoje oblíbené je průchod lesem, je to tak?[BR]Tu já rád nemám."}, {"31": "Na bete sa začína najnovšia udalosť Pohřbené město..[BR][BR][IMG]https://i.ibb.co/zGFLDLr/https-i-ibb-co-Bnm-Pn0x-EL-akcia-febru-r-2022-banner-png.png[/IMG][BR]Prehľad udalosti sa čoskoro objaví v tejto téme. Všetky budovy udalosti už teraz môžete nájsť na portáli a denné odmeny udalosti tu. Rovnako tak úlohy sú už v tejto chvíli zverejnené v zozname úloh.[BR][BR][IMG]https://i.ibb.co/FbCTCM2/https-i-ibb-co-zb-Fy-L6v-EL-akcia-febru-r-2022-okno-akcie-mal-png.png[/IMG][BR]Hlavnou odmenou udalosti je rozvinuteľná budova s prepínateľnými produkciami, ktorá zároveň prináša po prvýkrát v histórii udalostí zesilovač ako jednu zo svojich produkcií."}, {"20": "Sice eventy tohoto druhu nemám moc v lásce, ale oceňuji zajímavou grafiku a rozvinutelná budova s volbou odměn se mi taky líbí."}, {"2": "Ano, také se mi hlavní odměna líbí.[BR]Uvidíme co bude v denních."}, {"211": "Taky oceňuji, jak tentokrát šikovně s obměnou využili existující herní schemata a zaměřili se na to co umí, tj. pohrát si obrázky.[BR]I první Amuni bar se mi líbí a mnohým zapadne do města.[BR]A počáteční průchod je vyloženě návodem, jak používat prvky.[BR]Budu zvědav na ty urychlovače z levlu 9 a 10, jaké délky budou. 4 VB na 4x4 za 24h bude taky pro mnohé zajímavé.[BR]Jen jim před uvedením asi došel čas a nestačili vymakat ten portrét u zlaté odměny. Ale to se nás stejně netýká [smilie--sprite1]   Jestli z Bety sbírají zpětnou vazbu, tak ten by mohli vylepšit, než to spustí u nás."}]