[{"16": "30 minutové."}, {"8": "no to vypada konecne pouzitelne   Tahle budova u me bude urcite stat a jako bonus muj  nejoblibenejsi typ eventu  a treba se do te doby uvolni i misto ve meste "}, {"2": "Urychlovače budou 3x 30 minut"}, {"2": "Eventova měna jsou oslíci.[BR]Je mi líto je sbírat, okolo města vypadají moc hezky."}, {"229": "Chválim  za eventovu budovu !!! je to niečo nove , vyhrali sa s ňou a svieži vietor aj v produkci eventovej budovy.[BR]Tešim sa aj na nove budovy z dennych odmien,  som na ne zvedavy .[BR]Palec hore ."}, {"20": "@GorGlin oslíci jsou moc pěkný, to je fakt "}, {"3": "taky mám tenhle systém rád, těším se!"}, {"223": "Podle toho co zde čtu, se jeví nový event zajímavě (jak budova, tak průchod \"mlhou\"). Bohužel ne pro mě, změnil jsem zaměstnání a časově vůbec nestíhám. :-("}, {"221": "event super jsem zvedava co vse pak nakombinuji do ds odmen az pak konecne prijde ikdyz zatim me schazi jen nejake artefakty a tak, ds ani ne[BR][BR]no k eventu moc se me opet libi prepinatelna vyroba ikdyz ty zkracovacky na 30min jsou trosku vysmech kdyby tam byly aspon 2h i tak orci nebo knizky oboji fajn dle potreby staci pro me i jen tyto 2 moznosti[BR][BR]hledani kocek jsem moc nemusela ale tak zle to nebylo uvidim jak mi pujde tohle myslim ze posledni event u me dost pohorel takze snad mi toto pujde lepe protoze tu budovu chci"}, {"229": "Ahoj ,[BR]pozeram na seznam budov v Evente The Buried City a čo davaju ,asi tam možno neake budovy pribudnu ešte , no  zatim tam nevidim žádnu budovu na semena ...vie niekto , či neaka bude ?"}, {"202": "Líbí, líbí, líbí. Miluju oslíky a těším se na ně. "}, {"2": "@Marian24 [BR]Druhý den, Amuni ships dávají božské sémě."}, {"20": "Moc dobrá zpráva - na betě ode dneška hromadné zadávání zbrojnic na PC."}, {"235": "Nevíte někdo, kdy má nový event vypuknout? Předpokládám, že tento týden ještě ne..."}, {"2": "V přehledu od iDavise to ještě není, takže to asi nevi nikdo.[BR]Ale s ohledem že minulý event skončil ani ne před týdnem, odhadoval bych začátek nejdřív v tom příštím."}, {"31": "V tejto chvíli naplánovaný termín udalosti Pohřbené město nájdete uvedený v prehľade."}, {"10": "@maxa21 - minule to bylo po 14 dnech. Začíná to většinou v úterý, takže magické datum 22.2.2022 se nabízí "}, {"2": "Řeknu vám, Inno fakt perlí.[BR]Zvoneček je rozšířen z deseti stran na 5 dní.[BR]Už abychom to měli i tady."}, {"229": "GorGlin napsal/a:\t\t\tŘeknu vám, Inno fakt perlí.[BR]Zvoneček je rozšířen z deseti stran na 5 dní.[BR]Už abychom to měli i tady.\t\tKlikněte zde pro zvětšení...[BR]Jak to mysliš z deseti stran na 5 dni ?  nechapu"}, {"2": "zvoneček byl omezený na 10 stran, omezen konkrétním počtem záznamů[BR]ted tam jsou záznamy za posledních 5 dní[BR]takže moje malé město má ve zvonečku 32 stran záznamů z obchodu a výpomoci"}]