[{"66": "Jasně, jsou líný rozdělovat upozornění na obchodní a packovací na separátních kartách."}, {"8": "mnohem vic bych bral kdyby se info o obchodu (nebo aleposn kupcu) vubec nezobrazovalo  ale asi tak, proc to rozdelit do extra spamove zalozky, kdyz se clovek muze prohrabavat tim spamem na 50 strankach "}, {"2": "Ale notak, je to řešení našeho problému.[BR]Je pochopitelné že jdou cestou nejmenšího odporu."}, {"221": "me se zmena libi trebas ji jeste vysperkuji no to rozdeleni by taky bylo fajn i presto pokud chcete dat souseda tem mene aktivnim tak stejne projdete vic stranek[BR]ale musim rict 25 stranek se 4 obchodama a dlouha doba kdy jsem nedelala celou mapu[BR][BR]trebas tady ve vetsim meste kdyz udelam celou mapu tak uz se mi ani se spolkem nevejdou a postupne ubyvaji i tak ti sousede kdyz pak davam jednou (a kdyz jednou ci dvakrat sousedum nedam tak najednou skoro zadne nemam) dene natoz lidi co delaji hodne obchodu nebo obchodujou osvicene"}, {"73": "Podle mě to také není to, co jsme všichni čekali, ale lepší než nic :-D Aspoň můžu motivovat, tak jak chci a nikdo, kdo mi motivaci oplácí, mi nezmizí. Takže za mě poděkování "}, {"2": "no, můžete si tam zprávy roztřídit[BR]výpomoc, obchod a pašerák[BR]ještě nějaké stížnosti?"}, {"223": "@GorGlin a záznamy jsou dohromady a nebo jsou rozděleny na obchod a výpomoc?"}, {"8": "jestli to jde takhle tridit nebo radit tak uplne super a neni si na co stezovat. to pak omezeni\" na X dni je 100x lepsi nez oemzenina 10 stranek"}, {"2": "@Mescal [BR]Máš tam tři políčka a volíš co chceš aby se ti zobrazilo[BR]podobně jako na trhu[BR]jen se bojím, že v apce to bude až za dlouho.-"}, {"18": "@GorGlin souhlasím s tebou. Taky si myslím že v apce to bude za dlouho. A je to škoda, Protože sám mám ve spolku na Are, pár členů co hrají jen v telefonu"}, {"8": "tak apka ma zase jiny vychytavky, ktery na webu chybi (skryvani budov a vyhledavani ve shromazdisti  )"}, {"84": "A hlavně packování z mapy - to na PC hodně chybí, Kdo má pořád lézt někomu do města, když to trvá tak dlouho..[BR][BR]Odstraněna citace. Embla"}, {"221": "je to tady konecne sousedka na mape bez navstevovani dnes spustena na bete v zalozce provincii[BR]prohlizecova verze"}, {"16": "Na betě začalo nové dobrodružství.[BR]Hlavní změny:[BR] - Odznaky lze sbírat najednou ve větším množství (např. dám do divu 205 bodů a vyberu najednou 20 odznaků a těch 5 zůstane na další odznak)[BR] - V dialogu odměn za úroveň lze vlevo dole vidět počet přispívajících hráčů a po kliknutí na \"i\" hned vedle se zobrazí 2 seznamy hráčů (přispěli + nepřispěli)[BR] - Prvních 100 společenství dostane zkušenosti - 60k - 250k.[BR] - Odměny +- stejné, 2 artefakty jsou na výběr z posledních 2 evo budov.[BR] - Na náhrdelníky se zvýšil potřebný počet (3>4)[BR] - Na duchy se zvýšil potřebný počet (3>4)[BR] - Došlo ke změnám odznaků na trasách, zatím to vypadá, že celková charakteristika tras se nezměnila (=tzn. společenství může jet ty samé trasy, co doposud, pokud nedělá všechny 3)."}, {"221": "@Lovec Krys hezky jsi to shrnul aspon vim ze jsem nic neopomela[BR][BR]je to proste luxus ten sber takze ocekavam ze hraci zase zacnou s ds trochu vic blaznit po tom co jsme ted meli delsi cas na odpocinek a s tema zmenama"}, {"8": "a akorat se mi uvolnuje misto na pomcne stavby, takze pekne vypocitano "}, {"31": "Na bete sa začala tohtoročná fénixova udalosť. Všetky nové budovy z tejto udalosti sú dostupné tu, priestor pre denné odmeny spolu s úlohami udalosti je pripravený tu."}, {"228": "už se ví,kdy začne DS ? díky "}, {"31": "DS je v tejto chvíli naplánované na 24.3."}, {"229": "Ten Fenix vvypada zajimave a tento Event s Medvedim mam hodne rad.Zajimalo by ma kolko tej padlej army dokaže Fenix oživiť ?[BR]Chapu to spravne že počas 3,5 hodin dokaže na 10 levly oživiť 5 procent ?"}]