[{"2": "Tak to chápu já."}, {"31": "Áno, oživí 5% z celého oddielu jednotiek."}, {"16": "Přesněji oživí max 5%. Pokud jsou ztráty menší, oživí jen ty jednotky, co padly."}, {"84": "Tak ještě jednou pro mně, abych to správně pochopil:[BR]Velikost oddílu mám 1000 bojovníků.[BR]Zahyne mi 500 bojovníků - fénix oživí 50 bojovníků a ztratím 450 bojovníků[BR]Zahyne mi 60 bojovníků - fénix oživí 50 bojovníků - čili ztráty 10 bojovníků[BR]Zahyne 50 a méně bojovníků - fénix oživí všechny padlé  - čili ztráty jsou 0[BR][BR]Je to takto?"}, {"220": "iDavis napsal/a:\t\t\tDS je v tejto chvíli naplánované na 24.3.\t\tKlikněte zde pro zvětšení...Jen bych se chtěla zeptat mapy na DS zůstávají stejné nebo tam jsou nějaké změny? Nikde jsem nic nenašla a rádi by jsme se tak trochu připravili. Díky za odpověď"}, {"2": "Mapy jsou jiné"}, {"220": "a je možnost je někde vidět?[BR][BR]Odstraněna citace. Embla"}, {"2": "To nevím, byvalo moc pěkné info na elvengems.com, ale ta už se od lonskeho podzimu neaktualizuje.[BR]Oficiální wiki Inno nechává jen tak orientačně.[BR]Ani cena cetek není aktuální.[BR]Na beta foru je tahle tabulka[BR]https://tinyurl.com/7533n9nf [BR]dá se z toho vyčíst požadavky na jednotlivé cesty, ale jak přesné to je jsem nezkoumal"}, {"223": "@Marian24: ano, chápu to stejně.[BR]Soumračný fénix bude zajímavý pro ty, kdo díky Polárce a divu jsou schopni vyjet Věž až nahoru* udělat turnaj* v jednom tahu. Těch 5 % bude v absolutních číslech celkem zajímavé množství vojska. Pro ostatní je to průměrná budova.[BR][BR]* upraveno na základě konstruktivní poznámky @GorGlin"}, {"2": "myslel jsi turnaj, nebo o polárce něco nevím?"}, {"20": "Takže, abych získala 5% vojska na celou věž + turnaj, potřebuji Skok na 30 lv, + nakrmit Ohniváka, nového Fénixe + Polárku. T. zn. 3 krmení, což není tak málo. Na celou věž jedním tahem spotřebuji dost urychlovačů.[BR]Když hraju normálně turnaj a věž, tak mi stačí 2x nakrmit Ohniváka. Pokud to 3. krmení dám na Hnědáka a pak použiji urychlovače, které bych utratila na věž jedním tahem, na doplnění vojáků, tak si vojsko doplním asi víc, že v prvním způsobu hry. Kdo nemá Hnědáka, tak možná mu nový Fénix přijde vhod, ale já si myslím, že pokud nedojde k jeho úpravě, tak není efektivní. Kdyby nakrmení vydrželo 5 dní, jako u Polárky, tak to by bylo něco jiného. Ale takhle je to hodně slabé."}, {"221": "tak ve vetsim meste uz skok na 30 mam a mam tedy jedno krmeni fenixe na 1 vez a 1 turnaj + jedno krmeni polarky na 2 turnaje takze to jsou 3 krmeni na 14 dni coz je velka uspora takze jsem za skok rada[BR]co se tyka hnedaka tak toho krmim jen kdyz se snazim narychlo vyrabet vojsko aby to melo lepsi efekt pri beznem naboru ho skoro zase nepouzivam a zase je to tak co hrac to jiny styl hry[BR][BR]takze vlastne takhle muzu krasne vyuzit jedno krmeni na tyden navic s tim ze ten efekt proste vyuziju"}, {"2": "pro mě je produkce krmení dost houpačka, někdy chodí, nekdy ne[BR]ale dlouhodobě i zásoba pomalu mizí, takže budova, kterou budu pravidelně krmit jen urychlí moji cestu nefunkčnosti[BR]Barák je zajímavý, určitě bych ho využil, ale jeslti bude jak se uvidí."}, {"221": "jak rikas je to ruzne mam dalsi budovy ktere nekrmim a mohla bych ale nedelam to abych mela nakou rezervu a trebas i neco na ds a tak, pritom bych je rada krmila trebas cervenou pandu nebo mesicni medved taky neni spatny kdyz se dobre nakrmi sovu jestli jsem nekde nakrmila na ukol kdyz jsem tam nic jineho nemela no a to ani spoutu zvere nemam co bych jeste mit mohla radu fenixu nebo pandu a tak"}, {"3": "Krmím jen Polárku, Ohniváka q co dva dny pandu. V eventu Popelku a cca jednou za čtvrt roku obě hnedky, když za pomoci mnoooha nasyslenych časovačů doplňuju armádu. S tímhle přístupem mám cca 260 krmení a zásoba pomaličku roste"}, {"2": "Já to mám podobné, jen krmím hnědého mědvěda co dva týdny a sem tam fénixe chladného ohně nebo pandu"}, {"20": "@Emhyr var Emreis II já s krmením nijak neplýtvám, ale v Akademii se mi evidentně neobjevuje tak často jako tobě. Teď mám na skladě 30 kousků a to je ten lepší případ. Je hodně hráčů, kterým se krmení tak často neobjevuje, jiní ho mají spousty. Takže dávat krmení na slabý efekt nového Fénixe, který vydrží jen 3,5 hodiny, mi přijde fakt slabota. Ale pokud má někdo zásobu krmení jako ty, tak to opravdu nemusí řešit."}, {"229": "Tohle sou uplne jine dimenze , ja mavam tam max 10 krmeni "}, {"2": "Jestli klesnu na 10, přestanu krmit některá zvířata."}, {"229": "Ja krmim len Ohnivaka, Hnedaka,Polarneho  zbyle zviřata sou u mne podviživena "}]