[{"3": "Ludi napsal/a:@Emhyr var Emreis II já s krmením nijak neplýtvám, ale v Akademii se mi evidentně neobjevuje tak často jako tobě. Teď mám na skladě 30 kousků a to je ten lepší případ. Je hodně hráčů, kterým se krmení tak často neobjevuje, jiní ho mají spousty. Takže dávat krmení na slabý efekt nového Fénixe, který vydrží jen 3,5 hodiny, mi přijde fakt slabota. Ale pokud má někdo zásobu krmení jako ty, tak to opravdu nemusí řešit.\t\tKlikněte zde pro zvětšení...Jsem škrt, ani tak neplýtvam. Myslím, že komu chybí krmení, ten ho prostě používá moc. V akademii se objevuje ve vlnách, ale pokud chytneš každou rotaci a vždycky máš všech 5 nových receptů a nevyrábís kdejakou kravinu, aby tak byla šance na krmivo o něco vyšší, tak to musí jít..."}, {"20": "@Emhyr var Emreis II  Mohu tě ujistit, že žádné nové kolo receptů v Akademii neminu a krmení je vždy moje priorita. A krmením neplýtvám. Opravdu je to tak, že některým hráčům se krmení objevuje častěji než jiným. Vím to ze zkušenosti ostatních hráčů v mých dvou spolcích (cz1 a cz2)."}, {"20": "Dnes byl nový Fénix na betě upraven, doba účinku krmení prodloužena na 12 hod."}, {"4": "@Ludi - i tak je to opět bída s nouzí  "}, {"20": "@pavelb - tak jasně, ale přeci jen lepší, než 3,5 hod. Kdyby to bylo na 5 dní jako polární méďa, tak by to mělo trochu smysl, ale takhle ..."}, {"2": "5 dní je hodně, ale den aby to šlo spárovat s havranem by bylo fajn"}, {"229": "Diky INNO ,snad to ešte predlžia na ten deň  aspoň"}, {"11": "já myslím že 5 dní by nebylo hodně, nebo alespoň 3, to dokáže turnaj odehrát dost hráčů. Vždyť 5% je trochu výsměch, z 200 oddílů se obnoví 10[BR]Jsem to nějak nepočítal, jestli se pomalu nevyplatí nasadit místo toho hnědáka. Asi ne."}, {"31": "V tejto chvíli naplánovaný termín udalosti Úsvit fénixe je uvedený v prehľade."}, {"2": "Super, potřebuji vyměnit baráky na manu.[BR]A ten nový pták mě taky zajímá."}, {"31": "Na bete sa zajtra začína najnovšia Májová udalosť.[BR][BR]Všetky budovy tejto udalosti sú v tejto chvíli dostupné na portáli, denné odmeny sa budú spolu s behom udalosti na bete automaticky generovať tu a úlohy sa v príslušnej podstránke automaticky vygenerujú dnes behom noci."}, {"2": "Jsou někde vysvětlené efekty okrasných květin?"}, {"11": "zkus podržet myš nad ikonou"}, {"2": "to se na mobilu dělá dost těžko"}, {"11": "Ty hraješ jen na mobilu ?"}, {"2": "většinou[BR][BR]kouknul jsem na to na kompu a pořád mám otázku[BR]co znamená to číslo?"}, {"31": "@GorGlin hodnota predstavuje číslo, ktorým sa vynásobí čas trvania príslušného kúzla a pripočíta sa k jeho základu. Teda napríklad Okrasná kvetina C zvýši trvanie efektu kúzla Magický dar o násobok 0.03, teda o 3%. V základe efekt tohto kúzla trvá 48 hodín, teda zvýši sa na 49:26h. Efekty viacerých rovnakých kvetín sa sčítavajú.[BR]To že v niektorých veciach funguje stránka v mobilnej verzii crappy viem a postupne sa snažím aj mobilnú verziu dopĺňať o dodatočné funkcie, ale v zásade to má u mňa nižšiu prioritu ako desktopová verzia (väčšina ľudí totiž navštevuje stránku z PC a môj tím má iba jedného člena)."}, {"221": "@iDavis libi se mi tve stranky nakonec asi nikdo jiny nic podobneho nedela na strane druhe mas tam vyber jazyka a stejne to nejdulezitejsi je jen v anglictine ... zrovna ty policka vetsina mi tak nejak byla jasna[BR]nebo vlastne vsechny specificke efekty tak mas[BR]budes to nekdy prekladat do slovenskeho ci ceskeho jazyka? za me a asi vetsinu hracu na cz by to bylo super"}, {"31": "@Hexik áno tie preklady efektov a tooltipov mám na zozname, predpokladám že to v istom momente doplním."}, {"31": "V tejto chvíli naplánovaný termín Májovej udalosti je uvedený v prehľade."}]