[{"5": "Den 5: Mage Instant ...zatímco u lidí jeden z nejlepších bojovníků u elfů nicmoč ... \t\t\t\t\t\t\t\t\t\t\t\t[IMG]https://i.ibb.co/9vpmB7g/https-i-ibb-co-b64-Vn6-C-ins-unit-ma-humans-png.png[/IMG]/\t\t\t\t\t\t\t\t\t\t\t\t\t[IMG]https://i.ibb.co/n6s2gBv/https-i-ibb-co-HT1d-Bv0-ins-unit-ma-elves-png.png[/IMG]"}, {"18": "@ElfNostradamus tak tos mi moc nepomoč."}, {"84": "Ale zase dobrou zprávou je že dle informací z portálu IDavise by 19. den eventu měl po několika letech vrátit instant 30VB jako denní odměna."}, {"126": "@ElfNostradamus zas tak špatný u elfů není..jen je u něj třeba více myslet na to, proti komu ho postavit a s kým.  [BR][IMG]https://i.ibb.co/drZwL0d/https-cz-forum-elvenar-com-index-php-attachments-mags-jpg-6072.jpg[/IMG]"}, {"5": "Joí ahoj a dík, zhruba  se v tom orientuji, ale ten střelecký odstup je často k nezaplacení, nesejmeš li protivníka na poprvé, dosáhne na tebe každý obrstřelec a i těžkooděnec s harpunou, tím už dochází ke ztrátám...a ano myslet na to je hezké  ...ale někdy např při 90.provinciích to potřebuješ co nejvíce zautomatizovat, abys u toho turnaje netrávil dva dny v kuse  a ten odstup je tam sakra znát...proto je lidský mnich jedna z nej jednotek ve hře, žel lidé ji mají již od prvopočátku - budíž jim přáno, elfové dobrého mága s tímto dosahem až s žoldákama. Přesto to vše je spíše taková jen ,,řečnická,, poznámka. moc často sem nepíšu "}, {"126": "@ElfNostradamus každopádně jsem rád, že mám mágy  "}, {"2": "Jo, to že si čarodějka může dojít pro presdrž.., zas takové terno není."}, {"31": "Na bete sa zajtra začína júlová udalosť Šťastná ploutvička.[BR][BR][IMG]https://i.ibb.co/chScvZb/https-i-ibb-co-nw1-K2-Dm-EL-akcia-j-l-2022-banner-png.png[/IMG][BR]Skúšam niečo nové pre svoju stránku - tzv. porovnávač truhiel. Okrem samotného prehľadu truhiel (alebo ako sú nazvané v tejto udalosti - obruče), ich odmien a cien, obsahuje aj funkciu ich porovnávania a usporadúvania podľa výhodnosti buď voči denným alebo hlavným cenám udalosti. Obsah je opäť generovaný automaticky, takže v prípade akýchkoľvek zmien v hre mi to umožňuje rýchlo vykonať potrebné aktualizácie.[BR][BR]Táto funkcia je prístupná na stránke Všetky udalosti pod novým tlačidlom \"Hoops\" (obruče) v paneli na ľavej strane.[BR]Porovnávač truhiel[BR][BR]Zároveň všetky nové budovy udalosti sú dostupné tu, priestor pre denné odmeny je pripravený tu a úlohy sa objavia tu.[BR][BR]Nová rozvinuteľná budova zároveň po prvýkrát prináša náhodné produkcie (podobne ako budovy Studňa prianí, Bohyně přání alebo Džin). Všetky jej produkcie sú detailne rozpísané tu."}, {"2": "Na betě přišlo DS velmi záhy po eventu.[BR]Nevíte někdo co můžeme čekat na CZ serverech?"}, {"31": "Bude podobný scenár aj tu. Najbližšie dobrodružstvo je v tejto chvíli naplánované na 9.6.[BR][BR]Zároveň nás čaká 7. výročie hry. Ako darček dostaneme budovu Festivalová fontána, jej detaily môžete nájsť tu."}, {"31": "V tejto chvíli naplánovaný termín udalosti Šťastná ploutvička je uvedený v prehľade."}, {"183": "chtěl bych poradit. hraji elvenar arendyll+na betě ale pouze arendyll hraji i na mobilu ale nevim jak hrat betu také na mobilu děkuji za odpověď"}, {"31": "@krix cez nastavenia hry sa vieš na mobile odhlásiť. Následne si vybrať server a v zozname serverov zvoliť zz (čo je označenie pre betu)."}, {"183": "odhlašeny jsem   ted tam mámfacebok novy hráč vravo nahoře příhlašení server žadny[BR][BR]nemám kde vybrat server žadna nabidka[BR][BR]iDavis děkuji za radu našel jsem to"}, {"2": "Na betě je upoutávka na novou událost.[BR]Něco jako Brána do minulosti[BR]Něco mi říká, že zase bude mlha v lese"}, {"16": "Má to být nějaký nový systém - nová mechanika události.[BR]Pro angličtináře oznámení zde:[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/a-gateway-into-the-past.17828/\t\t"}, {"31": "Bude to nová mechanika udalosti ktorá sa zatiaľ v Elvenare neobjavila (a ani v inej hre od InnoGames). Čo sa teším, pretože každú zmenu v udalostiach vítam (najmä pokiaľ sa jedná o takú akou je táto, teda úplne nový typ)."}, {"2": "Máte pravdu.[BR]Z popisu mám jen představu.[BR]Podle zminky o trpasličích bramburkach se obávám že opět vliv náhody významný a systém a strategie mi maximálně pomůže aby mě hra úplně neoskubala.[BR]Ale je to jen představa, třeba mě něčím překvapí."}, {"66": "Jenom ne Candy Crush skládání bonbonů v elvenarové verzi.[BR]Mimochodem \"Dwarven Chips\" v tomto kontextu znamená Trpasličí žetony."}, {"3": "To vypadá docela zajímavě. Ještě aby ten set za něco stal "}]