[{"223": "Bože, to budou zase setové budovy? :-([BR]Alespoň budu mít klid, setové budovy nikam nenacpu. :-("}, {"31": "Zajtra sa na bete začína nová augustová udalosť A Gateway into the Past.[BR][BR][IMG]https://i.ibb.co/NnvX3ds/https-i-ibb-co-XV9cdn-C-EL-akcia-august-2022-banner-png.png[/IMG][BR][BR]Všetky nové budovy predstavené touto udalosťou nájdete tu, priestor pre denné odmeny je pripravený tu (budú sa tam automaticky generovať spolu s postupovaním udalosti na bete).[BR][BR]Prehľad úloh sa v deň začiatku udalosti na bete zobrazí tu. Denné úlohy budú pribúdať spolu s priebehom udalosti na bete.[BR][BR]Jedná sa o celkom novú mechaniku ku ktorej som okrem popisov budov a úloh pripravil aj ďalšie tabuľky, tipy a písané návody. Tie budú dostupné v nových záložkách v ľavom paneli podstránky Všetky udalosti. Na stránke sa budú objavovať postupne po tom, čo sa udalosť začne na bete.[BR][BR]Zároveň len pripomínam, že som prednedávnom nastavil novú doménu stránky, ktorá je namiesto predchádzajúcej idavis-elvenar.github.io kratšia a zrejme zrozumiteľnejšia - idavis-elvenar.com. Starú adresu je možné stále využívať, avšak prehodí vás to už automaticky na novú (a zrejme má zmysel si naďalej ukladať tú novú, nakoľko bude používaná odteraz už nastálo).[BR][BR]Čoskoro vytvorím aj prehľad udalosti do témy, ale predpokladám, že nebude tak detailný a tiež nebude obsahovať toľko informácií o novej mechanike, koľko je obsiahnutých v nových záložkách na mojej stránke."}, {"4": "No něco strašného, že se někomu chce něco takového vymýšlet. Příště asi budeme mít 5 mezikroků k tomu, abychom popojeli o jedno políčko k milníku. Za mě palec hodně dolů. Na betě to dohraju, tady se s tím otravovat nebudu ani náhodou."}, {"3": "dobrá, bez zbytečného líčení, jak to teda bude fungovat? tady se nadává na všechno, ale mě třeba baví mechanika temného lesa "}, {"2": "Prozkoušel jsem si taky tu minihru.[BR][BR]Základní cíl je stejný, na složení celého setu je potřeba získat 260 červených kamenů[BR][BR]Ale, s ohledem na to že denní příděl je 20 trpasličích brambůrku a za první úkol je jen 10 tak za jeden kámen si nemůžu dovolit vyhodit 25 herních fufníků jako v současné akci.[BR][BR]Takže kdo chce hlavní cenu uhrát, a ne koupit, tak tomu cíli bude muset podřídit celou hru.[BR][BR]Úkol vždy vyžaduje dva až tři předměty a za to nabízí jeden až čtyři kameny.[BR][BR]S ohledem na to, že v základu jde o převod brambůrků na kameny, tak ideální je měnit bezeztrát.[BR][BR]A to znamená nabrat do nejvíc brambůrku, nakoupit předměty a chodit na hru co půl hodiny a točit úkoly.[BR][BR]Máte z toho podobný pocit?[BR][BR][BR][BR]Zase dělám něco, co se innu nelíbí a tak si na mě došláply. Protože počkat si na pro mě zajímavou denní odměnu a pak protočit všechny body jako jsem to udělal včera je možné, ale velmi velmi drahé[BR][BR]@Emhyr var Emreis II [BR]udělej si obrázek[BR]já les nesnáším"}, {"20": "Nový event na betě - jak to probíhá:[BR]1. Sbírají se brambůrky + odměny za úkoly.[BR]2. Za brambůrky se kupují artefakty - v těch dolních miskách pod tabulkou.[BR]3. První miska dává artefakty: sochy, druhá nástroje a třetí \"kostky\".[BR]4. Každý druh artefaktů padá z misky náhodně, je tam 6 druhů od každého typu.[BR]5. Na pravé straně od tabulky jsou úkoly, kam se dávají různé druhy artefaktů, abyste získali rubíny, které se vkládají do cesty, kde se dají získat odměny.[BR]6. Z náhodně získaných artefaktů se dají skládat vyšší druhy artefaktů, ale vždy přes sebe musíte dávat jen 2 stejné druhy a tak získáte artefakt vyšší.[BR]7. Jakmile máte potřebné artefakty na úkol na pravé straně, tak ho můžete odkliknout  a tím získáte rubíny, které se vloží do cesty. Pozor, abyste omylem neklikli na koš a tím vše nevymazali, pak trvá 30 min, než se nový úkol obnoví.[BR]8. Z celého eventu je pro mě nejlepší úvodní obrázek, ten se povedl, jinak nic moc.[BR][BR][IMG]https://i.ibb.co/7C0bsJX/https-cz-forum-elvenar-com-index-php-attachments-sn-mek-obrazovky-2022-07-08-092105-jpg-6138.jpg[/IMG]"}, {"4": "@Ludi - super, akorát bych tomu asi neříkal brambůrky, ale spíše trpasličí žetony ( angl. chips ) "}, {"2": "Já tomu klidně budu říkat brambůrky, anglicky chips[BR]Ta trpaslice s vousy mě moc nerajcuje"}, {"20": "@pavelb, @GorGlin  názvem \"brambůrky\" jsem se inspirovala u Gorglina  . Ono to stejně bude asi jinak, až bude ofiko překlad."}, {"31": "Prehľad všetkých ponúk, ktoré sa objavujú u trpaslíkov môžete nájsť tu. Ich náklady sú uvedené v počte potrebných predmetov úrovne 1, keďže to je asi najzmysluplnejší spôsob výpočtu ich ceny. Sú tam uvedené rozmedzia, keďže každej ponuke môže byť pridelených niekoľko kombinácií požadovaných predmetov. Jednotlivé rozmedzia sú teda mnou odchytené počas hry na bete.[BR][BR]Inak musím povedať, že sa mi táto mechanika páči. Práve to, že to zvyšuje počet krokov medzi obdržaním meny udalosti a samotným získaním odmeny oceňujem najviac, pretože to nás núti tú udalosť reálne hrať a byť v nej viac interaktívne zapojený, než len klikať po nejakých truhliach alebo boxoch. Z podobného dôvodu som mal vždy rád aj mechaniku hmlistého lesa."}, {"20": "@iDavis tušila jsem, že ty budeš z nového eventu nadšený , jenže mnohým hráčům právě tyhle podivné komplikace berou radost ze hry."}, {"3": "někoho baví relax hra a někoho fádnost naopak nudí. Zatím se těším [BR]každopádně díky moc za popis!!!"}, {"11": "no hlavně ty odměny budou zase bomba  Nebo vidíte ten set jako zajímavej ?"}, {"16": "@iDavis  Na mne ta nová mechanika zatím působí tak, že celý rozdíl mezi bednami a touto mechanikou je v tom, že u beden točím kolem štěstí 2x (jednou kolo štěstí vybírá 3 bedny, ze kterých si pak můžu vybrat a podruhé točím tím kolem štěstí, které jsem si vybral),[BR]a tady točím kolem štěstí hned 3x (1. kolo štěstí vybere požadavky trpaslíků (obdoba beden s odměnami), druhé pak náhodnou úroveň předmětu, který potřebuji a třetí pak samotná náhodná odměna).[BR]Takže akorát hromada klikání navíc, když o všem stejně rozhoduje náhoda.[BR]Tedy pokud nepovažuju za strategii zaplácat si herní pole předměty a pak každou půlhodinu odmítat nové požadavky trpaslíků nevyhovující náhodně vylosovaným předmětům a jejich možné kombinaci.[BR]U mlžného lesa lze vhodným použitím světel strategicky maximalizovat odhalenou plochu, tady je to téměř jen o náhodě."}, {"4": "@Lovec Krys - přesně"}, {"20": "@Lovec Krys - ono ani vymazání nabídky úkolů a čekání 30 min na další nabídku nic nevyřeší, protože málokdy padne něco rozumnějšího. Vyzkoušela jsem to a zjistila jsem, že to nemá moc smysl. Tahle mechanika je především o náhodě, moc se toho ovlivnit nedá.[BR]Prostě se to jen tváří, že jde o sofistikovanější event, ale je to jen klikání po klikání.[BR]A souhlas, že i Mlžný les, který nemám moc ráda, je lepší než tohle."}, {"222": "Mlžný les mám taky ráda. Mechaniku nového eventu znám z jiných her a je to jen o náhodě a klikání. Rozhodně ji v Elvenaru nevítam."}, {"223": "Dle prvních popisů nové herní mechaniky jsem si myslel, že jako hráč si budu  moci vybrat směrování budoucí odměny (např. bude na výběr kulturní budova, VB a instantní vojsko). Já si vyberu co mi vyhovuje a moje volba mi značně navýší možnost získat odměnu se zvolenou vlastností.[BR][BR]To co je zde popisováno je něco jako kolo štěstí, kde náhodu ovlivním max. tím, jak moc pohybové energie vložím do roztočení kola."}, {"2": "Kolo štětí to bylo na začátku, měl jsi tři truhly a podle toho jakou sis vybral se točilo víckrát o menší kousky a nebo to bylo drahé, ale ceny byli macatější.[BR]Když jsi získal kulturku 1x1 tak jsi dostal 3.[BR]Na druhou stranu jsme měli tři hlavní výhry a ta poslední se kupovala.[BR]Ale to už je moooc dlouho.[BR]Možností kdy se ti to může pokazit postupně přibívá.[BR]Teď máš tří poptávky a možnost je každou půlhodinu měnit, poptávka je od jedné do tří věcí, každou musíš získat zvlášť.[BR]Dřív sis volil způsob vyzvednití výhry, tady musíš losovat 1 až 3x a kldyž ti to nepadne, máš to blbí.[BR]Šance na zisk toho co potřebuješ je 38%, ale i 2%.[BR]Prostě paráda.[BR]Když nedostaneš co potřebuješ, můžeš patřičnou věc získat tak, že si jí poskládáš.[BR]Problém je v tom, že 1 až 4 červená broušená sklíčka tě vyjdou od 5/15 brambůrků, jsou to velmi unifikované brambůrky, tak jim můžem říkat pringelsky, jen když jsi klikař.[BR]Když se budeš v současném eventu držet spotřebu cca 20-25 koníčkožrádla na 1/20 asi závodu, můžeš nějak kalkulovat.[BR]Tady tě může jedna věc stát od pěti pringelsek do stošedesát.[BR]Jedna a já jich budu potřebovat víc, dvě ,nebo dokonce tři.[BR]Inno si toho rozdílu je vědomo a proto mi na tento event dá mnohem méně herních fufníků.[BR]Požadavků, které vyžadují jen méně vzácné věci jsem zatím moc nenašel, mám tu zapsaných 18 příkladů a z toho jen dva chtějí jen věci kdy mám šanci na zásk aspoň 10%.[BR]Celé to odklikat bude děsný opruz a já zatím nevidím systém kterým pojedu na live serveru.[BR]Původní nastavení, hlavní výhra je jen pro platící, mi přišla tak nějak čestnější."}, {"2": "@iDavis [BR]Nepovedlo se mi najit nové budovy z Tome of the Fearless.[BR]Heavy melee Shirne a podobně.[BR]Budou teď budovy na podporu všech jednotek?"}]