[{"31": "@GorGlin budovy sú tu: Heavy Melee Shrine, Heavy Ranged Powerup, Light Melee Monument. Oni sú ale generické budovy, teda budovy ktoré sa opakujú nezávisle od udalosti a nie sú predstavené priamo touto udalosťou (v minulosti sa už objavili tuším v nejakej ponuke). Obrázky tam chýbajú, tie pridám.[BR][BR]V zásade každá zvyšuje poškodenie pre danú triedu jednotiek, podobne ako súčasné 2 stromkové budovy pre mágov a lukostrelcov."}, {"20": "Změna v eventu na betě:[BR]Nákup v misce byl snížen z 5 brambůrků na 4 a nabídka je náhodných 5 artefaktů, místo 6. Tak snad to bude o něco hratelnější.[BR][IMG]https://i.ibb.co/FJwzYxP/https-cz-forum-elvenar-com-index-php-attachments-sn-mek-obrazovky-2022-07-13-202038-jpg-6140.jpg[/IMG]"}, {"2": "na betě je to zatím jaksi nedotažené, omezení v produkci například u nástrojů je omezený o poseldní stupeň, ale stále je  v poptávce.[BR]to kladivo z prostřední poptávky nelze získat, stejně jako warlord z té poslední.[BR][BR]přiznávám, že se s touto mechanikou dost trápím[BR]zatím mi to vychází, že správná cesta je točení požadavků a vyhledávání těch více sklíčkových  a na ně skládat figury.[BR]Nemáte někdo nějakou radu?"}, {"20": "@GorGlin taky mě zarazilo, že v poptávce je něco, co nejde získat. Ale doufám, že to ještě opraví."}, {"114": "Absolutně nevím, o co tam jde, takže se na něco nového těším. "}, {"223": "Osobně mám z toho co tady píšete, o nové herní  mechanice, smíšené pocity."}, {"20": "@Mescal  Hrát se to dá, ale žádná hitparáda to není. Kdo chce změnu za každou cenu , tak si to užije. V podstatě je to event s mezihrou, kde se náhodně kliká na herní artefakty a pak následuje skládačka ve stylu dětské kostičky na pískovišti. Šachová partie to fakt není, velkou roli hraje náhoda, extra taktika se použít moc nedá. Asi si to někdo užije, ale já tedy ne. Pro mě je to otravné."}, {"223": "@Ludi, díky za info. Bojím se, že pro mě to bude podobné."}, {"21": "U mě to vypadá na relax vtom novém stylu eventu"}, {"16": "Náhoda ovlivňuje, co vám vypadne z kbelíků.[BR]Náhoda ovlivňuje, co vám padne za odměny (a kolik vám padne šťastných karet/pokusů (Lucky draw)).[BR]Náhoda ovlivňuje, kolik událostní měny dostanete při použití šťastných karet/pokusů (Lucky draw).[BR]Vy ovlivňujete, který ze tří požadavků trpaslíků budete plnit (anebo odmítnete s půl hodinovou pauzou na další požadavek po odmítnutí)[BR]Vy ovlivňujete, jakým způsobem budete plnit požadavky - tzn. který z kbelíků a kolikrát použijete a jak spojíte dohromady předměty, co vám náhodně vypadly z kbelíků."}, {"6": "Podle reakci mohu pouze usuzovat, že to bude méně otravné než lov v mlze, což považuji za sadistické trápení natěšených hráčů."}, {"2": "Já si to zkusil a podle mě víc."}, {"2": "Na beta fóru prosáklo info k nové kapitole.[BR]Zatím je to jen pár obrázků."}, {"4": "@Schoenfeld - mohu garantovat, že je to mnohem, mnohem horší nežli mlha. Toto je extrémní úkrok vedle. Pro mně to znamená v živém světě měsíc prázdnin od eventu, což je jediné pozitivum"}, {"2": "Jo, vlezeš do města koukneš jaká je poptávka, zjistíš že to je špatný, tak je smažeš a za půl hodiny zase"}, {"8": "jako mlzny les se mi vylozene libi, ale tohle uz jen z popisu co tady ctu (na betu nemam cas) vypada na ty vyse psane eventove prazdniny "}, {"219": "GorGlin napsal/a:\t\t\tNa beta fóru prosáklo info k nové kapitole.[BR]Zatím je to jen pár obrázků.\t\tKlikněte zde pro zvětšení...Ahoj, kde se na ně dá podívat?"}, {"20": "@SparkySprinkles - Podívej na forum bety. Správně bychom sem neměli dávat neofiko zprávy od hráčů, jen to co už jede na betě."}, {"2": "Přímo ve hře se zatím objevili jen obrázky nových T9 surovin [BR]V záložce relikvie"}, {"223": "Mlžný les mám celkem rád, ale tahle herní mechanika se mi jeví jako přitažená za vlasy."}]