[{"20": "@Mescal už si pomalu zvykám, v setu mi chybí jen jedna budova, nevím jestli jí dám ze hry, doufám, že bude časem někde v DS. Ale set je funkční i při 6 budovách - tedy produkuje i srdíčko na obnovu jednotek. Každopádně set budu mít zatím jen na betě, na live ho stavět nejspíš nebudu."}, {"2": "@Ludi [BR]Já poslední budovu ze hry určitě nezískám, ale jestli zase dají do DSka jedno kouzlo na barák, tak to budu mít komplet."}, {"31": "Prehľad nadchádzajúcej udalosti Brána do minulosti je v tejto chvíli so všetkými detailami a odkazmi zverejnený v prehľade."}, {"2": "Tak na konci události se dělo něco co jsem naprosto nečekal a vůbec nepochopil.[BR]Poměr získaných sklíček za branbůrek se úplně zbláznil.[BR]Párkrát se mi stalo, že jsem potřeboval na splnění požadavku Trowel nebo 4stěnku a utratil neskuetčně brambůrků než jsem ho dostal.[BR]Ale na konec se mi povedlo většinu herních předmětů směnit za broušená sklíčka a získal jich neskutečných 260.[BR]To mi přineslo celý set a neuvěřitelnou bronzovou pozici.[BR]Poslední 4 brambůrky jsem utrácel s myšlenkou, že 3 možné výsledky mi přinesou potřebné 260 sklíčko a zbylé dva jsou mi k ničemu.[BR]Je fakt, že dnešní utrácení byla adrenalinovka jak penaltový rozstřel.[BR]Oprandu jsem si to užil.[BR]Ale na druhou stranu si pořád nejsem jistý jeslti je potřeba víc než pochopit, že spojením dvou stejných obrázku vytvořím jiný a výsledek je čistý gembl."}, {"20": "@GorGlin taky mi přišlo, že ke konci se to nějak pohnulo. S odřenýma ušima má celý set, takže dobrý, ale tento event se mi nelíbil."}, {"2": "Na betě běží výzva[BR]Hlavní odměna je stan Wonky Waltrse.[BR]Úplně mi vyhrlky slzy když jsem ho viděl."}, {"31": "Wonky Walters je vskutku jeden z nostalgických kúskov (v roku 2016 sa objavil v úkolovej línii krátko predtým, ako bola nasadená tohoročná Halloweenska úkolová línia s pánom dyní).[BR][BR]Detaily budovy Wonky Walters si môžete pozrieť tu.[BR][BR]Zároveň bolo na bete oznámenie, že sa bude rozširovať herná plocha o ďalší rad rozšírení (keďže súčasne dostupné rozšírenia zaberajú všetku kapacitu aktuálnej hernej plochy). Bude taktiež dostupné nové rozšírenie za 620 provincií a asi je zrejmé, že tieto zmeny majú súvis s prípravou na príchod ďalšej kapitoly.."}, {"2": "@iDavis [BR]jeslti si to pomatuji dobřem tak tohle je první eventová budova, které ve hře vůbec je, ne?"}, {"31": "@GorGlin ešte bola predtým udalosť Letný slnovrat 2016, v ktorej boli predstavené Venarova skaliska a pár ďalších budov v denných cenách. A predtým bola ešte jedna úkolová rada, tá ale nepriniesla žiadnu novú budovu, len predpokladám testovala mechaniku úkolových rád ako takých."}, {"11": "no ohledně kultury nic moc ta budova, měla by mít kolem 32k aby dávala smysl, takže není se na co těšit. Možná pro někoho fakt z té nostalgie. Já tenkrát ještě nehrál a byl šťastný "}, {"5": "voyager-1 napsal/a:\t\t\tJá tenkrát ještě nehrál a byl šťastný Klikněte zde pro zvětšení...Ty nejsi štastný ve hře Voi? ..přijd´k nám až bude místo u nás je štěstí a srandy kopec "}, {"11": "se spolkem to nesouvisí ale po 4-5 letech hrání to nadšení přeci jen už vyprchalo a radovat se z nějaké průměrné kulturky se už nedokážu, tak poslušně hraju věž a sbírám portálový bonusy. No snad na ně jednou vývojáři něco vymyslí jak na runy. Ta výměna run za VB bomba byla."}, {"20": "@voyager-1 docela jsi mě inspiroval a tak jsem dala návrh na nové využití portálových bonusů. Je to jen základ, třeba někdo bude mít lepší nápad, ale je třeba s tím něco dělat."}, {"20": "Na betě byl ohlášen start 20. kapitoly:  https://beta.forum.elvenar.com/index.php?threads/chapter-20-the-power-of-music.17889/[BR][BR][IMG]https://i.ibb.co/qMbdBQ7/https-cz-forum-elvenar-com-index-php-attachments-1-jpg-6165.jpg[/IMG]"}, {"2": "Je to jako rozbalovat dárek"}, {"2": "Na betě už je to venku a tak mi dovolte vyslepičit co už víme.[BR]Komu se nelíbí dlouhý průzkum, tak bude mít radost, první výzkum je průzkumník[BR]Asi už méně štastní budete že vojenské zlepšováky padly na tanky, tedy duch, paladin a podobně.[BR]Z budov se bude vylepšovat všechno vojenské, manufaktury, obytky, prostě všechno[BR]Divy jsou na rozpadání ozářeného + produkce banhee[BR]A zkrácení průzkumu, + bedny az výpomoc navíc[BR]Jo a spotřeba živoucího a ozářeného zboží bude velká."}, {"11": "jak to bude s dalším navyšováním divů?"}, {"2": "zatím stále 35[BR]to už nemáš co vylepšovat?"}, {"11": "právě že některé nechci navyšovat pokud nebude pokračování např. druhým efektem."}, {"8": "asi ale porad neni tak velka (pzoadavky na produkci ozareneho) ze to stoji za to mit Strom osviceni? "}]