[{"11": "@Boobika, hlavně nezapomeň, že to navýšení výroby je ve skutečnosti jen navýšení relikvií"}, {"8": "relikvii se ve skladech vali tisice, ale stejnak vetsi vyroba to neprotlaci uzkym hrdlem u kupcu takze [smilie--sprite8] jen si rikam ze pomalu nastava cas prirpavit si startovaci balicek zdroju [smilie--sprite8]"}, {"16": "@Boobika Já už na tom pracuji. Sice se mi to bude rozpadat, ale budu mít dost surovin na přechod do nové kapitoly hned ten den, co ji nasadí."}, {"2": "S ohledem na to, že dává lovce, tak už je dávno vylevlovany.[BR]Teď nemám čas to ověřovat, ale myslím že jedna produkční budova v rase stojí 250k ozářené vzácné suroviny, takže možná dojde i na kouzla a sem tam nakrmim[BR][BR]@Lovec Krys[BR]Myslím že hlavním hrdlem láhve bude zase rasová výroba, hned jak postavíš portál, každý výzkum něco chce, takže surovina vyráběna v jediné budově"}, {"20": "Strom osvícení je dost dobrá věc. Malý div, ale šikovný  [smilie--sprite2]. Lovci se hodí a zvýšená výroba už je znát (zatím lv. 22). Během kapitoly občas hodím kouzlo a bude vystaráno.  [BR]Co se týče kupců, tak situace je o něco lepší tím, že osvícené zboží už vyrábí podstatně víc hráčů, než když se s ním začínalo."}, {"66": "Otázka na betu: Mění něco velikost (manufaktury, hlavní sídlo, obytky a dílny)?"}, {"31": "Na bete sa začala tohtoročná Jesenná udalosť.[BR][BR][IMG]https://i.ibb.co/26bzVQJ/https-i-ibb-co-8-Yp9-Yq-V-EL-akcia-september-2022-banner-png.png[/IMG][BR]Všetky nové budovy tejto udalosti nájdete v tejto chvíli na portáli tu, priestor pre denné ceny je pripravený tu.[BR]Na stránke nájdete taktiež aktuálny zoznam úloh.[BR][BR]V tejto chvíli je zároveň zverejnený aj prehľad udalosti.[BR]Toto je z mojej strany posledná udalosť, pre ktorú som tento prehľad pripravil. Viem, že táto téma si za takmer 3 roky svojej existencie získala obrovské množstvo zhliadnutí a pozornosti a teda z mojej strany patrí vďaka každému, kto ma s jej tvorbou akokoľvek podporil alebo motivoval. Pri aktuálnej súbežnej tvorbe môjho portálu, ktorý do veľkej miery pokrýva informácie poskytnuté v tejto téme, som sa rozhodol ďalej nepokračovať v jej tvorbe, nakoľko je časovo náročná a ja mám pocit, že všetky informácie sú už relevantne pokryté týmto novým zdrojom.[BR][BR]Ako ste mohli behom posledných udalostí spozorovať, na portáli a jeho stránke udalostí sa začínajú častejšie objavovať aj tzv. písané návody, teda návody ktoré vyčnievajú od prehľadov denných cien a zoznamov úloh. To je práve mojou aktuálnou víziou - z niekdajšieho nápadu databázy budov spraviť z portálu web, ktorý pokrýva všetky aspekty dotknutých herných mechaník (a tak si viac napĺňať svoj názov \"portál\" - slúžiť ako rozcestník pre všetky typy návodov a informácií o hre). Behom posledných mesiacov som zároveň sledoval rekordné počty jeho návštevníkov, čo je pre mňa nepochybne ďalším motivačným faktorom na jeho tvorbu.[BR][BR]Keďže je toto pre mňa istým spôsobom nostalgický moment ^^, rád by som pridal ešte jedno historické okienko - téma s prehľadom udalostí bola založená v januári 2019. Tento nápad sa vyvinul z predchádzajúceho systému, kedy som prehľady vkladal na začiatky diskusií príslušných udalostí. Tieto siahajú až do roku 2016, kedy bola spustená historicky prvá udalosť Letný slnovrat. Pozrel som sa do archívov fóra, pokúšajúc sa nájsť tieto staré prehľady a spomenúť si na moje historické formáty, v ktorých som kedysi denné odmeny a úlohy spisoval. Pre záujemcov, tu je ich vývoj:[BR][BR]Spoiler: Všetky prehľady udalostíLetný slnovrat 2016 - iba zoznam úloh[BR]Wonky Walter - rozpísané detaily hlavnej budovy[BR]Pán dyní 2016[BR]Král zimy a snehová záplava 2016[BR]Valentín 2017 - prvý pokus o kompletný prehľad (bohužiaľ sa nezachovali obrázky)[BR]Veľká noc 2017[BR]Menhirokova služba 2017[BR]Okouzlující strom 2017[BR]Pochod stád 2017[BR]Maškarní ples 2017[BR]Podzimní událost 2017[BR]Halloweenska úkolová linie 2017[BR]Traja ľadovcoví obri 2017[BR]Robert Rudovous 2018 - prvý prehľad so zachovanými obrázkami starého formátu prehľadu budov[BR]Valentýnská svatba 2018[BR]Kult fénixe 2018 - prvá veľká udalosť, v ktorej sa zachovali pôvodné obrázky[BR]Valpuržina noc 2018[BR]Dni hudby 2018[BR]Festival Woodelvenstock 2018[BR]Toulavý měsíc 2018[BR]Podzimní událost 2018[BR]Bezhlavý Halloween 2018[BR]Kouzlo zimy 2018 - prvýkrát využitý prehľad budov v tabuľkovej podobe na fóre[BR]Valentýn 2019 - prvý prehľad v samostatnej téme; ostatné prehľady už nasledujú tu"}, {"20": "@iDavis - všimla jsem si, že už máš na webu i úkoly pro 20. kapitolu, což je vynikající! Tvůj web se obsahově pořád zlepšuje: Díky."}, {"16": "Hlavní sídlo zůstává stejné[BR]Obytky zůstávají stejné[BR]Dílny se otáčejí 5x6>7x4[BR]Zbrojnice 5x5>5x6[BR]Většina (ne li všechny) manufaktury se otáčí a některé i mění velikost.[BR]Kasárna a Cvičiště zůstávají stejné[BR]Tábor se otáčí ze 4x7 na 6x5[BR][BR]ps: Jak koukám na seznam úkolů, tak úkoly kapitoly u mne dopadnou jako vždy - už mám několik kandidátních úkolů, na kterých se zastavím, ale na to už jsem zvyklý."}, {"229": "Ohladne novej kapitoly 20 sa chcem opytať , kolko nam da rozšireni mesta z vyzkumu ?Diky"}, {"31": "@Marian24 2 rozšírenia z výskumu, 1 z provincií a 2 za diamanty."}, {"5": "[BR][BR][BR]...i nové profilové portréty jistě zaujmou [smilie--sprite1]"}, {"20": "Nový event na betě už běží, Zvířetník mám moc ráda. [BR]Méďa je bezva, a má vtipný vývoj: na prvním lv. letí mýval na letadle jak blázen, a na 2. havaruje a na dalších lv. to dává do pořádku  [smilie--sprite2]."}, {"2": "A to letadlo je vlastně mechanický ptak"}, {"31": "@Ludi a na 6. leveli má svoje plavidlo hotové, no medzitým sa natoľko preje vafľami z okolitých pekární, že sa do kokpitu nezmestí a tak ho musí od 7. levelu prerábať, aby ho zväčšil.."}, {"20": "@iDavis musím si to všechno pořádně prohlídnout [smilie--sprite8]. Já jsem ty obrázky ještě všechny nezkoumala, ale nápad se mi moc líbí."}, {"229": "Bol som na strope s rozšireniami z provinci 620 provinci splnenych , dneska som mrknul na rozširenia a už s prichodom novej kapitoly na bete sa v normalnom svete da mesto rozširiť, prave som to spravil.Novy strop je 638 provinci.Vyskušajte"}, {"16": "@Marian24 Strop je 620 ne 638. Moje beta město má 632 a je za limitem. 620 bylo i v oznámení pár dnů před novou kapitolou, kdy se rozšíření přidala."}, {"229": "Pak mam 638 dokončenych provinci ....každopadne na Arendylle už rozširujeme mesta z provinci ten limit sa uvolnil na rozšireni na Winyandore zatim neviem som tam ešte nebol .Takže kto ma 620 hotovych ma rozšireni v meste už ."}, {"16": "@Marian24 Ano, koukám, že ta rozšíření nám tady už taky nasadili. Ne, že by na tom záleželo, jestli nám je dají hned nebo až za pár týdnů s novou kapitolou."}]