[{"2": "sety"}, {"80": "@iDavis prečo mi toto robíš?Ja si nepamätám čo bolo včera a nie to ešte čo Rudovous s obrami mal spoločné.Proste to vybaľ,ja budem šťastný jak blcha,že niečo viem a možno to do zajtra nezabudnem[smilie--sprite1]"}, {"31": "Blíži sa ďalšie kolo..[BR]Dobrodružstvá spoločenstiev[BR][BR]Spoiler: Dobrodružstvá spoločenstiev[IMG]https://i.ibb.co/J3sVBzN/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-fellowship-adventures-Fellowship-Adventures-B.png[/IMG]V pondelok 26.2.2018 sa na bete začína nové kolo udalosti Dobrodružstvá spoločenstiev. Vraj môžeme očakávať vyváženie udalosti a 3 nové úlohy:[BR]Trénuj X jednotiekZískaj X mincíDaruj X VB do prastarého divu iného hráčaNaposledy sa dobrodružstvá spoločenstiev u nás začali týždeň aj pár dní po ich spustení na bete, takže začiatok tohto dobrodružstva očakávam v týždni 5. - 9. marca.[BR][BR]Odmenami tentokrát budú:[BR][BR]V zlatej veži v 3. truhle okrem požehnání Menhirokova mohyla:[BR][BR][BR]V rebríčku, spoločenstvo na 3. mieste okrem iných odmien dostane Zamrznutá svatyně obrů a spoločenstvo na 1. mieste Ledová obryně:[BR][BR][BR]Spoločenstvo na 2. mieste dostane Frozen Shipwreck:[BR]"}, {"43": "No tak to bude zajímavé.Myslím,že většina to hrát nebude hlavně kvůli dvěma důvodům: Jestli budou odměny podobné jako minule,kvůli kterým se to v žádném případě nevyplatí u toho sedět a že teď mají ti hráči,co měli prázdné města,města plné elementálů... [smilie--sprite8]"}, {"28": "Odměny v novém dobrodružství pro jednotlivé etapy:[BR]Spoiler1. etapa[BR]požehnání na zásoby 15% + zesilovač 5 hod. + požehnání na 30 VB do divů[BR]2. etapa[BR]zesilovač 8 hod. + požehnání na 20 VB do divů + požehnání na 30 VB do divů[BR]3. etapa[BR]požehnání na mince 50%  + požehnání na zásoby 50% + budova \"Menhirokova mohyla\"[BR]Potřebné předměty na jednotlivé trasy (=náročnost):[BR]Spoiler[IMG]https://i.ibb.co/xJyr2K4/https-beta-forum-elvenar-com-index-php-attachments-fa3-jpg-3964.jpg[/IMG]"}, {"73": "Co to má zase být? Nejen, že všechny trasy chtějí suroviny, ale dokonce i relikvie?[smilie--sprite9]"}, {"74": "To malé písmeno \"k\" znamená skutečně hodnotu \"1000\"? Čili na oranžové trase \"darovat\" 100k = 100 000 Orků?"}, {"73": "jj, přesně to to znamená.[BR][BR]Docela jsme se těšili (v obou světech), že se konečně něco změní a zapojíme se. Ale po zkouknutí úkolů opravdu tentokrát ne. Radovala jsem se, že konečně aspoň malinko zlepšili odměny a nakonec tohle. Takže na dobrodružství už kašleme :-("}, {"61": "tak je to dělaný pro větší společenství s aktivními členy, tam to asi půjde a nevidím to pro ně tolik problematické. Já budu šetřit síly na event [smilie--sprite2]"}, {"73": "jo, tak ti co jsou na špici si asi můžou dovolit dát 150 relikvií od prvních surovin, 600 od druhých a 1500 od třetích (pokud pojedou jen jednu trasu), ale my nejsme na špici a potřebujeme relikvie na kouzla a na zvýšenou výrobu a toto je prostě strašné množství. Suroviny by se ještě daly (i když se do toho nechce každému), ale relikvie, to už je opravdu příliš"}, {"61": "no, ono když to vezmeš tak ze 150 je to 6 (24, 60) na hlavu při plném společenství a jde o to domluvit se, aby je dávali Ti, kdo je nemají jako bonusové. Ale jako jo, je to dost"}, {"16": "Dobrodružství společenství  se evidentně stalo jen hračkou pro pár top společenství, tak ať se baví (bez ironie). My ostatní se mezitím budeme soustředit na svůj rozvoj a užijeme si týden klidu."}, {"74": "Když kouknu na tu tabulku, tak se žlutým pozadím je označen předmět \"money\". Jak si to mám tady přeložit?"}, {"79": "@Silversnake koukni na příspěvek od IDavise na této straně - spoiler k dobrodružství"}, {"74": "@Sosalka, již jsem obdržel info = ve vlastním městě vybírat mince a obdržím sáček s penězi = ten pak odevzdat. Výše bude jednoznačně úměrná levelu hráče."}, {"79": "Nechtěla jsem vypisovat když se jedná o spoiler [smilie--sprite2]"}, {"82": "Jednoznačně na toto dobrodružství kašlu...odměny v podobě zesilovačů se rozhodně nevyplatí,abychom do toho cpali tolik relikvií,surovin či orků...mám pocit,že autoři mrší tyhle eventy víc a víc...[smilie--sprite3] Takže hádám,tohle bude max. tak pro první  třicítku klanů...[smilie--sprite3]"}, {"83": "Nečekal jsem, že tohle dobrodružství bude nastaveno takhle nereálně. Očekával bych vyjádření i od těch kteří ty události připravují. Chtějí se snad vyrovnat FoE aby lidi přestávali hru hrát, nebo se jedná jen o nedopatření??"}, {"84": "Tohle dobrodružství je podle mne opravdu neúměrně náročné na náklady a odměny nic moc. Za tu námahu to ani nestojí.[BR]Navíc by mně zajímalo, proč společenství na nižší úrovni musí dodat stejně materiálu, relikvií a všeho ostatního jako společenství na vysoké úrovni a potom jejich odměna (získaná budova) má mnohem a mnohem horší parametry. Navíc je pro společenství s nižší úrovní mnohem náročnější splnit požadavky dobrodružství a to i když se zapojí všichni.[BR]Je to nefér  - čím nižší úroveň hráčů ve společenství, tím vyšší námaha na splnění požadavků a zároveň horší odměny - s tím by se něco mělo udělat.[BR]Takže buď stejnou odměnu, nebo nižší obtížnost v závislosti na úrovni hráčů ve společenství (když jde udělat rozdílnou odměnu, jistě lze nastavit i rozdílné požadavky na plnění!!! )[BR]A ještě dotaz - jak se dají získat jednotky ORK, které jsou potřeba při plnění jedné z cest, když jsou hráči třeba ve třetí kapitole - je to vůbec reálné??[BR]Karhol"}, {"73": "To máš pravdu, to je hodně nefér. [BR]Orky získáváš v kapitole Orkové a goblini, ve zbrojnicích, takže si budete muset vybrat cestu, kde je nepotřebujete, pokud u nich není více lidí ve vašem společenství."}]