[{"5": "...i ve Winyandoru jsou již rozšíření 1x za provincie, kde minimum je 620 otevřených a další dvě případně za dia, tak jako v každé nové kap.[BR][BR][BR]...podobná trochu Tauriel v Hobitovi a stejně krásná[smilie--sprite1][BR][BR][IMG]https://i.ibb.co/TBkGsjV/https-cz-forum-elvenar-com-index-php-attachments-1660906291165-png-6167.png[/IMG]"}, {"229": "Mam dodelat ješte posledne 4 vyzkumy idem na 15 liahni , snad plynule nadviažem na novu kapitolu .[BR]Vaš hruby odhad , za aky čas bude spustena  na Arendylle a Winyandore ? [BR]Ja myslim , že ešte tak 14 dni budem potrebovať na dokončenie 19 kapitoly ."}, {"16": "Odhad jsou tak 2-4 týdny. Můj typ je, že pokud nebudou nějaké problémy (bugy) s kapitolou na betě, tak by nám to mohli dát už někdy začátkem září (tzn. ty 2 týdny (nebo možná 3, dle toho, jestli budou prodlevy mezi Bránou do minulosti - výzvou - novou kapitolou - Zvířetníkovou událostí stejné nebo podobné jako na betě (na betě jsme dostali kapitolu den před Zvířetníkem, ale tady to může být jinak (i když předpokládám, že kapitolu dostaneme před začátkem Zvířetníku))))."}, {"236": "Letní event končí za dva dny a DS nebude, tak bych čekal, že zvířetník nasadí již příští týden. A kapitolu tak týden po začátku zvířetníku, takže první týden v září."}, {"16": "@hufv Na betě byla mezi oběma událostmi ještě výzva. A nasazení kapitoly a začátek zvířetníku bych viděl přesně opačně (nejprve nová kapitola a pak teprve zvířetník).[BR]Předchozí 3 zvířetníky začínaly:[BR]23.9.2019[BR]7.9.2020[BR]7.9.2021[BR]Takže si myslím, že bychom se mohli letošního zvířetníku také dočkat kolem 7. (tzn. první úplný týden v září).[BR]Ale je to samozřejmě jen moje spekulace na základě toho, co a v jakém pořadí šlo na betě a kdy byly předcházející zvířetníky."}, {"2": "Koukám na tu novou kapitolu a na naší WIKI už jsou informace o nové rasovce.[BR][BR]Velký dík WIKI týmu.[BR][BR]Jestli to správně chápu, dvě třetiny výzkumu pojedeme na písně, které budeme vyrábět po jedné bez ohledu na lvl portálu nebo čmeláka?[BR][BR]A kdo nemá uskaldnovací vír tak rasou prožene kopec PP"}, {"11": "můžeš hodit odkaz?"}, {"229": "\t\t\thttps://cz.wiki.elvenar.com/index.php?title=S%C3%ADla_hudby\t\t"}, {"66": "Musí být přímo nebo nepřímo napojen na manufakturu vyrábějící řemeslné zboží (křišťál, svitky nebo hedvábí)Klikněte zde pro zvětšení...Co znamená nepřímo napojená? To si můžu postavit manuchu na křišťál a vedle ní v řadě houslárny až na konec řádku?"}, {"11": "aha na .cz světech to je, já pochopil že na betě, tam to není"}, {"183": "stačí postavit manuchu na 1levl a k tomu třeba houslarnu  manucha spojena na cestu---toto už tady bylo toto propojení"}, {"66": "@krix Jasně, to přímé propojení. Mě zajímá to nepřímé, jestli jde houslárnu napojit na houslárnu napojenou na manuchu."}, {"16": "@Prealiena  Tam bude nějaký překlep - výrobci nástrojů musí být přímo na manufakturu - vyzkoušeno, že pokud je manufaktura-výrobce-výrobce, tak ten druhý nefunguje - začne fungovat až při přímém napojení na manufakturu.[BR][BR]No nevím, zda celý řádek - jeden výrobce (jakýkoliv) stojí 127 000 semen.[BR][BR]@GorGlin Písně se vyrábí v portálu:[BR][IMG]https://i.ibb.co/HKxdPNf/https-cz-forum-elvenar-com-index-php-attachments-1661440352617-png-6176.png[/IMG][BR][BR]Vše před Hl. sídlem je jen za písně (cca 1/3 výzkumu, pak se bude zkoumat převážně za hudební nástroje - viz. technologie ve sloupci před hlavním sídlem):[BR][IMG]https://i.ibb.co/WgdTjF9/https-cz-forum-elvenar-com-index-php-attachments-1661440578085-png-6177.png[/IMG][BR]Ale cena taky stojí za to (vzhledem ke kapacitě portálu lv1):[BR][IMG]https://i.ibb.co/7j0Cf3z/https-cz-forum-elvenar-com-index-php-attachments-1661440613480-png-6178.png[/IMG][BR]Naklikat přes PPčka se to dá, pokud jich máš dostatečně mnoho, nicméně všechny výroby ve výrobcích hudebních nástrojů jedou taky na písně."}, {"2": "@Lovec Krys[BR]Písně se vyrábí v portálu až od druhého lvl, to o čem píšeš jsou notove zapíší nebo tak něco, edit: tak osnovy[BR]Písně - songs[BR][BR]@voyager-1[BR]Ano, naše wiki je zase o krok před zbytkem světa.[BR]Máme nejlepší wikitym"}, {"66": "@Lovec Krys Tedy oni to na wiki zmiňují několikrát:[BR]U Výrobce houslí - Musí být přímo nebo nepřímo napojen na manufakturu vyrábějící řemeslné zboží (křišťál, svitky nebo hedvábí)[BR]U Výrobce fléten -  Musí být přímo nebo nepřímo napojen na manufakturu vyrábějící vzácné zboží (elixír, kouzelný prach nebo drahokamy)[BR]U Výrobce bubnů - Musí být přímo nebo nepřímo napojen na manufakturu vyrábějící základní zboží (mramor, ocel nebo prkna)[BR]I u všech podpůrných budov (houslový, flétnový, bubnový sbor) - Musí být přímo nebo nepřímo napojen na Hudební háj[BR][BR]Tak chci vědět, co je to nepřímo?"}, {"2": "@Prealiena[BR]podle toho co je na betě nemůžu potvrdit napojení jedné dílny na druhou, všechyn budovy jsou naelpené na manufaktury[BR]nebo jsme to nenašel.[BR][BR]Ale soubory tam tak myslím jsou."}, {"8": "musi to napojeni byt na manufakturu odpovidajici urovne nebo staci 1lvl?"}, {"2": "Stačí mala[BR][BR]A u těch opic naposled nemusel ten barák ani fungovat."}, {"11": "@GorGlin  mě ani nenapadlo to hledat na našem světě protože v minulý kapitole podpora psala, že před spuštěním kapitoly se žádný info zde nesmí zveřejnovat a některé odkazy byly i smazány."}, {"183": "výrobce houslí + fléten + bubnu musí být připojeno na příslušnou manufakturu a nemusí být připojeny na portál[BR]soubor houslí + fletnový komplex + bubnový komplex --musí být připojeny jedině k portálu[BR]výrobce i soubory nelze mezi sebou spojit"}]