[{"2": "Když už přišlo oznámení, tak dlouho to bude ještě trvat?"}, {"66": "Doufám, že až po výzvě. Pátého mi končí bohyně přání, tak bych ráda ten start trochu natáhla až na září"}, {"5": "19.kapitola začala na Betě 9.11. oznámení sem na forum dali 22.11. a live pak začala pak 25.11. tj 16 dní po Betě...[BR]20.kapitola Beta 17.08. - cca 16 dní je kdy?! = 2.9. ?! tj pátek ... vše bez záruky [smilie--sprite1] - pouze matematicky"}, {"31": "Aktuálne video v novinkách je upútavka, takže to nenaznačuje, že kapitola by bola nevyhnutne za rohom. Pred jej spustením bude ešte ďalšie, vysvetľujúce jej hernú mechaniku. Môj predpoklad príchodu kapitoly je približne so začiatkom jesennej udalosti, teda podobne ako tomu bolo aj na bete (a pred ktorou ešte prišla výzva)."}, {"5": "\t\t\thttps://cz.forum.elvenar.com/index.php?threads/kapitola-%C4%8D-20-s%C3%ADla-hudby.8182/\t\t[BR]Nová 20. kapitola již ve čtvrtek 1.9....Tak jsem se ani moc nesekl [smilie--sprite1]"}, {"2": "Na betě ještě neskončila událost a už je oznámené další DS"}, {"221": "no uz jsem to taky cetla ale je tam i datum ktery odpovida tomu tyden po eventu ze by ted davali oznamka driv a nebo jen aby nahodou nezapomeli? coz uz se na bete taky stalo"}, {"31": "V súvislosti s blížiacim sa dobrodružstvom, ktoré je v tejto chvíli podľa oznámenia na bete naplánované na 15. septembra (dátum pre náš server zatiaľ nie je známy), som pridal na portál novú podstránku Dobrodružstvá spoločenstiev. Ten bude tak odteraz okrem udalostí, budov a spriatelených rás pokrývať aj obsah pre dobrodružstvá spoločenstiev. Stránka sa nachádza na portáli pod tlačidlom \"Viac\" a nájdete ju aj priamo pod týmto linkom:[BR][BR]iDavis-Elvenar - Dobrodružstvá spoločenstiev[BR][BR]Stránka dobrodružstiev spoločenstiev obsahuje prehľad predmetov, ktoré sú v tom ktorom dobrodružstve požadované (tento bude vždy aktuálny voči akémukoľvek zvolenému dobrodružstvu), prehľad odmien (v tejto chvíli je tabuľka prázdna, no bude doplnená akonáhle budú tieto dáta známe) a v neposlednom rade prehľad všetkých trás a požadovaných odznakov jednotlivých stretov. Toto je nová interaktívna funkcia pre stránku, ktorá umožňuje zobrazovať počet zostávajúcich odznakov v mape, označiť si hotové strety (resp. zadávať im aktuálny progres) a nastaviť, z ktorých trás sa počítajú zostávajúce požiadavky na dokončenie mapy. Každá akcia zo strany užívateľa je zapamätaná, teda pri opätovnom otvorení stránky v prehliadači sa pokrok zobrazí tak, ako ste ho nechali naposledy.[BR]Tak, ako je zvykom na ostatných stránkach portálu, svoje dobrodružstvo si môžete vybrať v select-boxe v hornej časti (v tejto chvíli je dostupné iba jedno, keďže je toto prvé, pre ktoré bol na stránke vytvorený obsah)."}, {"223": "@iDavis velmi zajímavá stránka, ale mám připomínku k sekci Waypoints - aby byla tato sekce použitelná pro celé Společenství (a pouze pro konkrétní Společenství, z pohledu jiných konkurenčních Společenství) mělo by být možné, aby se aktuální stav chybějících odznaků zobrazoval celému Společenství a nejen autorovi změn."}, {"2": "Na betě běží DSko.[BR]Za mě trochu zklamání, že v něm není možnost získat budovu do trpasličí citadely, nebo jak se to.[BR]Jsou tam dva artefakty na mývala"}, {"2": "Zítra, na betě, vypukne další courani po lese"}, {"31": "Na bete sa začala tohtoročná Halloweenska udalosť.[BR][BR][IMG]https://i.ibb.co/LgvWcZc/https-i-ibb-co-Xx-LJQ3-K-EL-akcia-okt-ber-2022-banner-png.png[/IMG][BR]Všetky nové budovy predstavené touto udalosťou nájdete tu, priestor pre denné ceny je pripravený tu a úlohy udalosti môžete nájsť tu."}, {"6": "Cena v 11. dnu Haloweenu:[BR]Co to je \"balíček many v závislosti na kapitole.\" Jak si to mám spočítat?"}, {"16": "Prostě dostaneš napřímo manu (nějaké množství v závislosti na kapitole). Funguje to stejně, jako když dostaneš \"denní odměnu\" suroviny nebo semena apod."}, {"20": "@iDavis - ve tvém přehledu má budova \"Šaman\" na 10 lv. jako odměnu 3VB, ale mě to na betě ukazuje kouzlo na doplnění jednotek 10%."}, {"16": "Původně tam 3VB bylo, ale změnili to (snad dokonce dneska)."}, {"2": "Aha, takže úspora místa.[BR]Taky dobry"}, {"31": "Budova je teraz upravená podľa dnešnej zmeny. Ak by sa nová produkcia ešte nezobrazovala, aktualizujte stránku pomocou CTRL+F5.[BR][BR]@Schoenfeld rozmýšľam nad spôsobom ako tieto \"balíčkové\" odmeny zobrazovať trochu praktickejšie (ideálne tak, aby tam bolo vidieť presné hodnoty v závislosti od nastavenej kapitoly). Uvidím kedy sa k tomu dostanem."}, {"237": "Prosím kolik je postupných úkolu a od kterého se otvírá jeden jeden denně?"}, {"16": "Počet denních úkolů je roven počtu dní události. Resp. lépe je asi říci, že počet zbývajících zamknutých denních úkolů je rovno počtu dní zbývajících do konce události:[BR][IMG]https://i.ibb.co/hK29DmS/https-cz-forum-elvenar-com-index-php-attachments-1665656633709-png-6291.png[/IMG][BR][IMG]https://i.ibb.co/KFyhnfy/https-cz-forum-elvenar-com-index-php-attachments-1665656688908-png-6293.png[/IMG][BR]Prostě si od celkového počtu úkolů odečti celkový počet dnů události a maximálně se o jeden sekneš."}]