[{"7": "Prosím, dorazí to z Bety sem k nám?"}, {"16": "Až na naprosté výjimky, věci z bety vždy dorazí i sem. Obvykle se 2 - 3 týdenním zpožděním.[BR]Proto taky spousta hráčů na betě hraje - informace z první ruky a možnost si vyzkoušet věci pár týdnů předem."}, {"4": "@Laci654 - základních úkolů je 55 a pak už jsou ty denní[smilie--sprite2]"}, {"31": "Väčšina informácií k najbližšiemu dobrodružstvu spoločenstiev, ktoré bude nasledovať po aktuálnej Halloweenskej udalosti, je v tejto chvíli popísaná tu.[BR][BR]Behom minulého dobrodružstva sa zároveň objavila nejaká spätná väzba, že by nový nástroj s prehľadom máp a jednotlivých stretov mohol obsahovať aj celkový prehľad všetkých chýbajúcich odznakov. Tento som teraz implementoval a je dostupný na spodku tejto stránky tu. Pripomínam, že zoznam odznakov v tomto políčku závisí od toho, aké cesty ste si vybrali na jednotlivých mapách."}, {"223": "Zásadní problém této stránky je ale v tom, že musí být použitelná pro všechny hráče Společenství. Mělo by být možné, aby se aktuální stav chybějících / splněných odznaků zobrazoval celému Společenství a nejen autorovi změn.[BR]Autor úprav (chybějících / splněných odznaků ) musí mít nějakou možnost nasdílet úpravy alespoň ke čtení pro všechny členy společenství, i kdyby to mělo být přes nějaký logovací txt řetězec znaků, který by si každý člen společenství byl schopný nakopírovat do svého zobrazení chybějících / splněných odznaků."}, {"31": "@Mescal vďaka aj za túto spätnú väzbu. To, že momentálne stránka funguje skôr ako informačný zdroj pre jednotlivca si uvedomujem a zamýšľal som sa už aj nad spôsobmi, ako zrealizovať share-ovateľnú verziu pre spoločenstvo, avšak tá by nateraz znamenala zmenu celej infraštruktúry, na ktorej web funguje (bol by potrebný nejaký server, na ktorom by si hráči vytvárali sessions / pripájali sa do už vytvorených alebo čokoľvek podobné, zatiaľ čo momentálne je stránka čisto statická a informácie ktoré si hráči nastavujú, sa uchovávajú vo vlastných prehliadačoch). Alternatíva so zdieľaním nejakého kódu (reťazca) je určite reálnejšia a na toto sa zrejme pozriem skôr."}, {"31": "Na bete sa začala tohtoročná Zimná udalosť.[BR][BR][IMG]https://i.ibb.co/60ZPS1w/https-i-ibb-co-HDK8-Hv-H-EL-akcia-december-2022-banner-png.png[/IMG][BR]Všetky nové budovy tejto udalosti nájdete tu. Súčasťou sú aj nové zimné dekorácie so špeciálnym efektom zníženia rozpadu dôležitých surovín na 60 dní (tieto sú dostupné pomocou požehnání Čáry v hlavných a kráľovských odmenách).[BR][BR]Priestor pre denné odmeny, ktorý bude aktualizovaný automaticky s priebehom udalosti na bete je tu. Podobne, úlohy sú zverejnené tu."}, {"2": "Mám dotaz nassnižování rozpadu.[BR]V kombinaci s divem můžu dostat rozpad na nulu, nebo je tam nějaké omezení?"}, {"223": "@iDavis hlásím drobnou chybu v popisu tabulky odměn u hlavní rozvinutelné budovy eventu https://idavis-elvenar.com/buildings.html#A_Evt_Evo_December_XXII_Chromafrost_Glacier . V levém sloupku s popisy  odměn je předposlední řádek (pod řádkem Urunium a nad řádkem VB) prázdný - chybí obrázek o jaký typ odměny se jedná. [smilie--sprite1]"}, {"31": "@GorGlin nemám to overené, ale keďže je počet cryo dekorácií, ktoré môžeme získať obmedzený (je dostupný len v nových požehnáních a tie dostaneme iba dve), tak by som povedal, že efekt sa normálne sčítava.[BR][BR]@Mescal o tom viem, hľadám nejakú použiteľnú ikonu pre osvícené zboží +1, no zatiaľ som žiadnu peknú nenašiel.. Ale mal by tam byť zatiaľ vidieť text, ktorý typ odmeny popisuje."}, {"223": "@iDavis žádný text u zmíněného políčka není vidět a ani po přejetí myší se nic neobjeví."}, {"7": "Ahojky všem![BR]Prosím připomeňte mi, co je to[BR]= zrakové páry[BR]a[BR]= Toolbox[BR]DíK [smilie--sprite11]"}, {"19": "@Mescal Teď jsem to zkoušel na 4 prohlížečích: ve Firefoxu to vidět není,  v Chromu, Opeře a Edge ano."}, {"31": "@Waso ak narážaš na to, že sa ti takéto pojmy ukazujú v zozname úloh, tak môžeš využiť český preklad, ktorý je dostupný hore v navigácii pod ikonou zemegule. Ak používaš nejaký automatický preklad od googlu, môžu z toho vzniknúť takéto výrazy, ktoré v hre v skutočnosti neexistujú. Zraková pára chce byť zrejme opar vidění a toolbox je sada nástrojov.[BR][BR]Pozerám, že náhradný text za ikonu sa naozaj nezobrazuje vo Firefoxe. Pokúsim sa to dnes vyriešiť.."}, {"238": "a tieto nie su dobré ? ?[BR][IMG]https://i.ibb.co/0KMVbX1/https-en-wiki-elvenar-com-images-c-c6-Ag2-1-png.png[/IMG][IMG]https://i.ibb.co/1qnT5G4/https-en-wiki-elvenar-com-images-9-9b-Ag2-2-png.png[/IMG] (refined ascended goods)[BR][IMG]https://i.ibb.co/YTNmXFL/https-en-wiki-elvenar-com-images-5-53-Ag1-1-png.png[/IMG][IMG]https://i.ibb.co/tpZMLj4/https-en-wiki-elvenar-com-images-4-48-Ag1-2-png.png[/IMG] (basic ascended goods)[BR][IMG]https://i.ibb.co/TTRyBKR/https-en-wiki-elvenar-com-images-4-48-Ag3-1-png.png[/IMG][IMG]https://i.ibb.co/MSpBx0S/https-en-wiki-elvenar-com-images-4-40-Ag1up-png.png[/IMG] basic  asi tiež"}, {"31": "@Ezran SVK tie už som videl. Nie že by som bol dvakrát zahľadený do tých odseknutých okrajov, ale tak je to malichernosť. [smilie--sprite8][BR][BR]EDIT: pridané a vyzerá to dobre."}, {"7": "iDavis napsal/a:@Waso ak narážaš na to, že sa ti takéto pojmy ukazujú v zozname úloh, tak môžeš využiť český preklad, ktorý je dostupný hore v navigácii pod ikonou zemegule. Ak používaš nejaký automatický preklad od googlu, môžu z toho vzniknúť takéto výrazy, ktoré v hre v skutočnosti neexistujú. Zraková pára chce byť zrejme opar vidění a toolbox je sada nástrojov.[BR][BR]Pozerám, že náhradný text za ikonu sa naozaj nezobrazuje vo Firefoxe. Pokúsim sa to dnes vyriešiť..\t\tKlikněte zde pro zvětšení...Díky za ochotu - i když to ení zas tak super důležité.[BR]Jen mne to (jako sklerotika) prostě zaujalo....  JInak překlady jsou dobré, díky za ně i za tu práci!![BR]DS jsem zatím hrál 2x, tak se holt neoriontuji.[BR]Tady to je: [BR]Odznak Cechu kovářeVyrobte 5x Toolbox;  a také: [BR]Tajemný zbytekSbírejte 9x zrakové páry[BR]"}, {"31": "Pridal som jednu zo žiadaných funkcií na svoju stránku. Počínajúc touto udalosťou sa takzvané \"flexibilné odmeny\" budú zobrazovať novým spôsobom. Jedná sa o odmeny, ktoré sa obvykle objavujú v denných cenách a zvyčajne neobsahujú žiadnu budovu alebo požehnání, ale poskytujú nejaké jednorazové množstvo určitého zboží.[BR]V predchádzajúcich udalostiach som tieto odmeny evidoval ako balíčky (teda medzi dennými odmenami stálo niečo ako \"balík many\", ktoré ale neposkytovali žiadnu informáciu o tom, koľko many v skutočnosti hráč obdrží a ani aké iné suroviny hráč získa pokiaľ sa ešte nenachádza v kapitole, v ktorej je mana odomknutá). Toto je teraz vyriešené a odmena je zobrazená presne podľa nastavenej kapitoly na stránke, takže môžete vidieť presné množstvá aké z danej suroviny obdržíte.[BR]Príklad môže byť videný v 7. dennej odmene v nadchádzajúcej zimnej udalosti.[BR][BR][IMG]https://i.ibb.co/5Bm8GWT/https-i-ibb-co-zn-Rjzhy-Screenshot-2022-11-18-113122-png.png[/IMG]"}, {"84": "Dnes mi ve zprávách naskočilo, že na betě je nová funkce KOTLÍK.[BR]Jelikož na betě nehraji, nemám vůbec představu co čekat.[BR]Může někdo objasnit tuto funkci?[BR]Díky Karhol"}, {"6": "Nejdeš to  v novinkách (trumpeta vlevo nahoře pod tvým avatarem)."}]