[{"238": "schoenfeld - myslím že sa skôr pýtal čo to bude za funkciu ten Kotlík, a nie kde nájde oznámenia. aj ked to ich video je celkom informačné[BR][BR]Kotlík v skratke[BR][BR]v akadémii magie pribudne nová karta kde bude možné raz týždenne (nejake časove obmedzenie ako ma veža a turnaj)  namiešať v kotlíku akýsi odvar  s bonusmi do hry..[BR]- v podstate je možné získať akykolvek bonus do hry  - zvyšenie produkcie minci kladiviek, tovarov, zvyšenie utoku jednotiek atd..[BR]- zrejme aj viac bonusov v jednom elixire[BR]- po tom čo kuzelnik elixir vytvori ho rozleje do čiaš(pohárov) 1 ks je zdrama, dalšie 4 sú za úspech v predchadzajucom turnaji +1 za 200 bodov +2 za 600, +3 za 1200, +4 za 2000 bodov[BR]- po tom čo je elixír vyrobeny a vypytý sa presunieš do študovne kde môžeš zvyšovať úroveň a trvanie tých bonusov,  čo som videl screeny na fore tak večšina bonusov stúpa o 0,1% za level[BR]- asi by som mal ešte spomenuť že jednotlive bonusy je možne ziskať len za ukončenie celeho vyskumu v kapitole, a tym je mysleno všetky vyskumy, aj nepovinne,,, napr. niekto je v 15 tej kapitole, ale v piatich kapitolách - to je jedno ktorých nemá dokončeny a aktivivany vyskum napr zvačšenie oddielu,, takže môže získať len prvých 10 efektov[BR][BR]Spoiler: tabulkaSourceNameiconIdpe_301Magical Tax Increasemoney- mincepe_302Supply Surplus Spellsupplies - zásobype_303General's Mayhemhb_strength - sila jednotiek z kasárnípe_304Trader's Basic Pleagoods_standard_basic - zvyšenie produkcie T1pe_305Trader's Refined Pleagoods_standard_refined - Zvyšenie produkcie T2pe_306Trader's Precious Pleagoods_standard_precious - zvyšenie produkcie T3pe_307Monsters' Mayhemtg_strength - sila jednotiek z Cvičískpe_308Gift of the High Menportal_production - zvyšenie produkcie portalu(ako pri cechu obchodnikov)pe_309Horde Uprisingorcs- zvyšenie produkcie orkovpe_310Enar's Boonmana - zvyšenie produkcie manype_311Mercenaries' Mayhemmc_strength- sila jednotiek z Tabora žoldnierovpe_312Harvest Moonseeds - zvyšenie produkcie božskej urodype_313Trader's Basic Prayergoods_sentient_basic - zvyšenie produkcie T4pe_314Trader's Refined Prayergoods_sentient_refined - zvyšenie produkcie T5pe_315Trader's Precious Prayergoods_sentient_precious  - zvyšenie produkcie T6pe_316Monsters' Morale Boosttg_health - život jednotiek z cvičískpe_317Mercenaries' Morale Boostmc_health - život jednotiek z tabora žoldnierovpe_318Unur's Resurgenceunurium - zvyšenie produkcie unuriape_319Trader's Basic Blessinggoods_ascended_basic - zvyšenie produkcie T7pe_320Trader's Refined Blessinggoods_ascended_refined - zvyšenie produkcie T8pe_321Trader's Precious Blessinggoods_ascended_precious zvyšenie produkcie t9pe_322General's Morale Boosthb_health - život jednotiek z kasarníSpoiler: zopar obrazkovSpoiler: 01[IMG]https://i.ibb.co/DCk9G59/https-cz-forum-elvenar-com-index-php-attachments-1670026288306-png-6382.png[/IMG]Spoiler: 02[IMG]https://i.ibb.co/V2gxR5s/https-cz-forum-elvenar-com-index-php-attachments-1670026465819-png-6383.png[/IMG]Spoiler: 03[IMG]https://i.ibb.co/CJTXGMY/https-cz-forum-elvenar-com-index-php-attachments-1670026545758-png-6384.png[/IMG]Spoiler: 04[IMG]https://i.ibb.co/Hn8x73Y/https-cz-forum-elvenar-com-index-php-attachments-1670026666566-png-6386.png[/IMG]Spoiler: 05[IMG]https://i.ibb.co/TmDhQ7D/https-cz-forum-elvenar-com-index-php-attachments-1670026726193-png-6387.png[/IMG]Spoiler: 06[IMG]https://i.ibb.co/bHtcVHy/https-cz-forum-elvenar-com-index-php-attachments-1670026743439-png-6388.png[/IMG]Spoiler: 07[IMG]https://i.ibb.co/6Ydz6ff/https-cz-forum-elvenar-com-index-php-attachments-1670026784823-png-6389.png[/IMG]Spoiler: 08[IMG]https://i.ibb.co/bHrstMp/https-cz-forum-elvenar-com-index-php-attachments-1670026811769-png-6390.png[/IMG]Spoiler: 09Spoiler: 10[BR][BR][BR]to je tak nejako hrubý základ toho o čo ide[BR]kedže na bete nehrám, je to len zakladne zhrnutie poznatkov z beta fóra[BR]- možno sa niekomu kto hrá na bete bude chcieť to tu celé rozpísať podrobne , ale je toho hodne"}, {"223": "Kompletní ukončení výzkumu v jednotlivých kapitolách včetně nepovinných výzkumů je pro mě hodně nemilé. :-("}, {"114": "v těch nepovinných nevím o ničem, co by mělo vadit, já mám vyzkoumané úplně všechny a jsem spokojená, proč je to pro tebe \"nemilé\"? co vím, tak kdysi vadilo mít nepovinné oddíly, ale to už je historií, teď jsou naopak přínosem"}, {"223": "Právě že nepovinné oddíly. Od V. kap. vč. nemám vyzkoumané nepovinné oddíly. Nějak nevidím smysl v tom, že si zvětším oddíl, když jej systém zvětší také.[BR]Když v turnaji postavím oddíl o velikosti např. 25, systém proti mě v turnaji postaví obdobný. A po vyzkoumání dalšího oddílu dojde k jen k tomu že na obou stranách bude větší oddíl, ve svém důsledku bude mít tenhle nepovinný výzkum jen větší požadavky na vojenské budovy.[BR][BR]Nevidím v tom smysl. Jaký je rozdíl, jestli budu bojovat s oddílem složený ze 25 jednotek na obou stranách nebo s oddílem složeným na obou stranách z 50 jednotek. Rozdíl je jen v tom, že vojenské budovy v mém městě musí mít větší výkon, abych mohl do dalšího turnaje postavit stejné množství jednotek. [BR]Systému je to jedno, ten bere své jednotky z \"nekonečného skladu\", mě to jedno není, já musím své jednotky ve svém městě vycvičit."}, {"16": "@Mescal Vyzkoumání nepovinného* zvětšení velikosti jednotky už nějakou dobu nemá na velikost turnajové jednotky žádný vliv.[BR]Ovlivňuje jenom velikost vlastní jednotky na mapě a produkci jednotek v divech (větší jednotka=více jednotek z divů)[BR][BR]*povinné malý vliv mají - každý povinný výzkum ve hře zvětšuje jednotky v turnaji/věži (vlastní i nepřátelské)"}, {"223": "@Lovec Krys dobrá dám na Tebe, vyzkoumám pár oddílů a uvidím.  V každém případě díky za informace a osvětlení mě neznámého.[BR][BR]Doplnit nepovinné výzkumy, no, bude to palba...  [BR]"}, {"31": "Nakoľko je v tejto chvíli Zimná udalosť na bete v pokročilej fáze, informácie na stránke sa blížia ku kompletnosti a už teraz tam nájdete drvivú väčšinu informácií o úlohách a denných cenách udalosti. Ďalšie úlohy a odmeny sa budú automaticky generovať až do konca udalosti na bete, t. j. do 11.12. Vtedy budú jednotlivé zoznamy kompletné."}, {"8": "dobre vedet, preventivne v klidove dobe doplnit nepovinne vyzkumy.. bic jak donutit zkoumat uplne  nesmysly typou chram klidu nebo vylepseny meditacni kruh  (ty oddily aspon nejaky \"smysl\" maji .) )"}, {"238": "iDavis  - v 11 a 19 deň sú budovy zo Zimného setu z roku 2017, kedže udalosť má 30 dní myslíš že zvyšné 2 budovy ešte budú medzi denými odmenami ?"}, {"223": "Mám dotaz  na hráče na betě, kolik klíčů je za vyřešený úkol? Úplně ideální odpověď by byla č. úkolu = ? klíčů."}, {"31": "@Ezran SVK potvrdiť to zatiaľ neviem, ale za prvých 27 odmien to zostane len pri týchto dvoch. Či sa teda vo zvyšných objavia druhé dve setové budovy budem vedieť potvrdiť o 3 dni.[BR][BR]@Mescal začína to pri 26 kľúčoch za úlohu pri prvých úlohách a posledné budú dávať zrejme 40 alebo 41. Behom progresu úlohami to predpokladám narastá postupne."}, {"239": "Boobika​ přesně tak. Oddíly dejme tomu, ale k čemu na konci výzkumu bude dozkoumání: Socha čar a kouzel, Delfíní fontána, Vylepšená akademie Elvenarů, Vylepšená pokladnice vědění a podobné nesmysly, které jsou dávno pasé. To je vyhazování zdrojů do kanálu."}, {"13": "@Mescal č. úkolu 92 = 40 klíčů."}, {"239": "iDavis​na stránkách máš u Zimní události nějakou chybičku.[BR]Když dám seřadit dle kultury, tak vidím[BR]Day 6: Frozen Father Tree[BR][BR]a když seřadit po dnech tak:[BR]Day 5: Frozen Father Tree"}, {"7": "Dotaz na dlouholeté veterány a aktivisty z BETY:[BR]U nás v Souručenství lidi už nevěří na Mikuláše. No budiž.[BR]Ale co Ježíšek?[BR]Nadělí nám Elvenar něco pod stromeček? Jak to bylo minulý rok??? [BR]"}, {"213": "@Waso  jo dostaneš 10000dia které budeš muset utratit během 0.30s než se rozpadnou na prach který by jsi pak musel uklízet ve městě"}, {"7": "add Damber7777[BR]Ajajaj! Tal já už uklízím z ulic Elvenarskej napadanej sníha teď mne čeká toto? To si snad koupím větší koště!!![BR]"}, {"213": "@Waso super odpověď 1:0 pro tebe :-D"}, {"2": "@Ezran SVK [BR]S ohledem na to, že zbylé budovy setu jsou v hlavních a královckých odměnách, předpokládám, že kdo je chce, musí je koupit."}, {"31": "Áno, odpoveď už vlastne bola zodpovedaná aj v téme k zimnej udalosti tu, čiže v denných odmenách budú naozaj iba 2 budovy zo sady."}]