[{"31": "Na bete bola dnes spustená nová funkcia - Seasons.[BR][BR][IMG]https://i.ibb.co/x2nzbp7/https-i-ibb-co-XDx9-ZMt-Season-Season-of-Dreams-Banner-png.png[/IMG][BR]Jedná sa vlastne o nový typ udalostí, ktoré budú bežať súčasne s udalosťami na ktoré sme doposiaľ zvyknutí. Ponúkajú 2 sady úloh - denné (každý deň sa z istej množiny náhodne vygenerujú 4 úlohy na ktorých splnenie je 1 deň) a týždenné (každý týždeň sa z inej množiny náhodne vygenerujú 4 úlohy na ktorých splnenie je čas do konca udalosti, ale úlohy z ďalšieho týždňa sa nezobrazia skôr, než sa vyriešia úlohy z týždňa predchádzajúceho).[BR][BR][IMG]https://i.ibb.co/9pVLPS2/https-i-ibb-co-1-JJb-Qvc-Season-Quests-png.png[/IMG][BR]Za splnené úlohy sa získavajú lupienky lístkov, ktoré nás posúvajú pri zbere odmien z tzv. Season Pass. Celkom je tu 50 úrovní, na každej sa nachádza 1 odmena (v niektorých prípadoch je možný výber z viacerých odmien). Za 2500 diamantov môžeme odomknúť prémiové ceny, ktoré sa nachádzajú na niektorých úrovniach.[BR][BR][IMG]https://i.ibb.co/fvMHd0D/https-i-ibb-co-j5-XPz-Gt-Season-Pass-png.png[/IMG][BR]Hlavnou cenou (na 50. úrovni) je nová budova Jezírko snů. Po jej získaní je pravdepodobne možné získavať ešte niektoré odmeny opakovane.[BR][BR]Pre novú udalosť pripravujem aj vlastnú podstránku na mojom webe. V tejto chvíli je ešte vo veľmi provizórnej verzii a očakávam že pridám ďalší obsah behom nadchádzajúcich dní."}, {"16": "V DS 2 artefakty (resp. 2x na výběr ze 4 artefaktů a KR):[BR][IMG]https://i.ibb.co/RzCSmKF/https-cz-forum-elvenar-com-index-php-attachments-1671098640307-png-6418.png[/IMG]"}, {"240": "Ahoj.A ještě zapomněli oznámit předem ze nefunguje hromadný výběr odznakuVybiraji se o5 a pouze po 1ks.Pokud se nejedna o chybu,dejte si pozor at nepřijdete zbytečně o odznaky"}, {"31": "Bolo potvrdené, že aktuálne dobrodružstvo na bete sprevádzajú isté problémy a nezapočítavanie hromadného zisku odznakov bola naozaj chyba. V tejto chvíli by už mala byť opravená a ako kompenzáciu hráčom predĺžili dobrodružstvo o 2 dni, majúc tak nový termín ukončenia 23.12. Či je toto oceniteľná náhrada, zvažujúc že sa tak dobrodružstvo končí jeden deň pred Vianocami je asi otázne, ale zostáva nám dúfať, že sa podobná situácia nezopakuje aj pri príchode na live servery.[BR][BR]Zároveň je dôležité spomenúť, že toto dobrodružstvo prináša po dlhej dobe nové mapy s novým usporiadaním odznakov (v kóde je označené ako nová verzia H). Všetky detaily týchto nových požiadaviek si môžete v tejto chvíli pozrieť na podstránke odznakov. Odmeny, ktoré budú súčasťou tohto dobrodružstva, sú teraz už taktiež nahrané a dostupné k prezretiu tu."}, {"223": "Dotaz na ty, co hrají Betu, máte nějaké (první) zkušenosti s Kotlíkem? "}, {"4": "Dle mne je to naprosto k ničemu a nemá smysl do toho rvát suroviny na vylepšování. Na druhou stranu je to zdarma, pokud do toho teda nebudeš chtít ty zdroje vrážet. To už ty Seasons jsou pro mne lepší, z toho vypadnou aspoň vojáčci, kteří se hodí vždycky"}, {"241": "Za mne dobrá novinka, sice pokud chcete mít efektivnější buff, tak musíte investovat i vedlejší suroviny, ale hráči co mají vyrobenou do zásoby si myslím, že není problém, respektive i ti, co hrajou nějkolik let. Stejně tak season je super, Je tam možnost si koupit i za 2,5k diamantů pás, kde jsou odměny velmi efktivní např v rámci turnajů.. Ale zase je třeba mít nasbírané diamanty. Není třeba vrážet reálné finance."}, {"20": "Souhlasím s @pavelb. Kotlík je pro mě zatím spíš zklamání, čekala jsem od toho víc, takhle škoda zdrojů. [BR]Seasons je lepší."}, {"16": "Pokud nepřidají možnost s vylepšením efektu i vylepšení šance na efekt, tak je to čistá loterie.[BR]Teď mám možnost namíchat Mercenarie's Mayhem vylepšený na dmg k jednotkám z Tábora +18% (71lv) a to s 19% šancí - v předchozích týdnech jsem to dostal max. na cca 15% šanci - každý týden jsou 4 z 12 surovin náhodně blokovány (jsou za dia).[BR]A kupodivu jsem ho dostal, ale jen oslabený jen na 11,4%, protože jsem nepoužil max. množství surovin, co se do kotlíku vejdou (a kdybych je použil, tak zase snížím šanci použitím různých druhů surovin, které mi zase sníží šanci na to, co chci (protože když použiji jednu surovinu dávající max. šanci na efekt, co chci, tak zase rychle vyčerpám čarodějné body, které každý týden dostávám)).[BR]No zkrátka se mi zdá, že někdo má zálibu v gamblingu a myslí si asi, že když nám dá nástroj s náhodným efektem a s náhodnou sílou efektů, tak to oceníme."}, {"223": "ad Kotlík, díky všem za názory, jsou pro mě dost cenné.[BR][BR]Škoda, myslel jsem si, že Kotlík je o hledání kombinací, jak získat co nejlepší lektvar a ne o tom, jestli za suroviny, které jsem do kotlíku vložil dostanu to, co chci a nebo taky ne. :-("}, {"6": "Vždy se časem v každé hospodářské strategii objeví něco podobného jako kotlík - zařízení na odčerpání zdrojů s gamblingovým efektem.[BR]Takže zřejmě vyzkouším - odložím."}, {"31": "Na bete sa začala tohtoročná januárová udalosť - Tajemství alchymie.[BR][BR][IMG]https://i.ibb.co/b1V6L5S/https-i-ibb-co-jr-DGZLf-EL-akcia-janu-r-2023-banner-png.png[/IMG][BR]Všetky nové budovy predstavené touto udalosťou, vrátane novej rozvinuteľnej budovy nájdete tu. Denné odmeny a úlohy je možné sledovať tu. Keďže sa jedná o mechaniku obdobnú rotujúcim truhlám, pripravil som aj prehľad všetkých dostupných \"zastávok\", ktorý je k nájdeniu tu."}, {"205": "Nějaký náznak nové kapitoly? Konečně jsem se dostal na konec a chtěl bych do města naházet dočasné budovy, jako džiny a pod, ale zase nechci, aby se to krylo se začátkem nové kapitoly."}, {"16": "Zatím jenom pár spoilerů na betě:[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/spoilers-something-rustles-in-the-grass.16032/page-32\t\t[BR]Takže bych s ní nepočítal dříve než za 2-3 měsíce (kdo bude chtít přesnější údaj, může si porovnat první spoilery z kapitol s jejím nasazením na betě a z toho odhadnout za jak dlouho se od prvních spoilerů objeví kapitola nová)."}, {"2": "džiny bych netahal"}, {"205": "džinů mám 18, a bohyně přání 11 (+1 v současné akci)...džin je na 100 dní, tak naházím bohyně, ta kapitola asi přijde dřív než za 100 dní[BR][BR]díky za info Lovec Krys[BR][BR]Díval jsem se, kdy byly poslední kapitoly nasazeny 10/2020 Unur, 4/2021 Týmový duch, 11/2021 Pomsta vyhnanců, 8/2022 Síla hudby. Pokud to bude tímto tempem, tak nová kapitola přikvačí někdy v květnu."}, {"3": "Já bych se ještě teď ty džíny vyhodit nebál... ale nejvyšší čas mě těch mých cca 13 spolu s knihovnami prave v týdnu skoncilo"}, {"209": "prchlik napsal/a:\t\t\tPokud to bude tímto tempem, tak nová kapitola přikvačí někdy v květnu.\t\tKlikněte zde pro zvětšení...A nebo také ne. Vydání kapitoly je závislé na mnoha faktorech a to že síla hudby přišla poněkud opožděně ještě nic neznamená.[BR][BR]Schválně jsem se kouknul (jak ostatně radil Lovec) na betu:[BR][BR]20 kapitola, logo kapitoly na betě 19.7., na našem serveru vydána 1.9.[BR][BR]19 kapitola, logo 21.9., přišla 25.11.[BR][BR]18 kapitola, logo jsem nenašel, ale konkrétní zmínka o divech padla 9.3., kapitola přišla 29.4.[BR][BR]Takže to je 1,5 až 2 měsíce od přidávání konkrétních dat do hry a otevřením kapitoly. Erb 21 kapitoly se objevil 21.12., takže klidně může přijít už za měsíc.... ale pravdu samozřejmě znají jenom vývojáři."}, {"8": "off topic otazka jak dlouho stradate takove mnozstvi Dzinu  nebo koho podplacite, ze vam to ve vezi tak pada "}, {"3": "Myslím, že naděje na džina je 10% a plus něco málo z vzácné fialové truhly. Tzn jeden dzin za 9 týdnu. Ono to tak zhruba vychazi"}]