[{"7": "Hele, proč si ty Džiny syslíte a nestavíte je hned, jak je kus místa?? [smilie--sprite9]"}, {"8": "protze kdyz chces dzina maximalne vytezit musis si hlidat 12h interval [smilie--sprite1] a kdyz uz se musis hlidat proc to neudelat hromadne aspon je to \"hlidani\" jen tech 100 dni nebo kolik dzin ma. U jinych vyberu nemas takovou \"potrebu\" to mit napresno a den sem den tam te tolik nezamrzi. aspon to je muj duvod."}, {"205": "U mě jeden z důvodů místo. V poslední kapitole postavit 18 sborů je fakt mňamka.  A moji džinové jsou i dvě kapitoly staří, protože jsem chtěl dojet na konec a odměnu z džina jsem nepotřeboval"}, {"22": "U mě mají džin, knihovny a kolotoče svoje stále místo ve městě. Když kouzlo vyprchá, nahradím je novými na stejné místo, tudíž mi nepřekáží. Prostě jsou tam pořád [smilie--sprite1]"}, {"229": "Delám to presne s džinama jako Boobika a i ze stejných duvodu , neni nič hezčiho jako když projedeš 15 džínu kurzorem a spadne Ti i 450 DIA.Takže si to hliídaš , čas výberu a ma to o moc vetši čaro jako delat tohle s jednim džinem.Vic se na vybery tešíš , sysliš DIA na BLACK FRIDAY a přemyšliš a seš v napeti kolik Ti dalši pretahnuti džínu hodí DIA . [smilie--sprite8][smilie--sprite8][smilie--sprite8][smilie--sprite8][smilie--sprite8] Tohle s jednim džinem nebo 3-ma nezažiješ nikdy."}, {"7": "Aha.[BR]Děkuji za reakce!"}, {"31": "Na bete sa dnes začala februárová udalosť Velká hlubina.[BR][BR][IMG]https://i.ibb.co/qM7hfxX/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-amuni-Great-Excavation-mainbanner-amuni2023-p.png[/IMG][BR]Táto udalosť predstavuje celkom nový set - Ancient Promise. Detaily tohto setu, ako aj všetkých nových budov, si môžete prezrieť tu. Denné odmeny, úlohy, popisy hernej mechaniky a ďalší obsah, ktorý ešte len bude hotový, budú zverejnené tu.[BR][BR]Informácia: Keďže na našom serveri ešte stále prebieha udalosť Tajemství alchymie a je ešte v relatívne skorej fáze, nechcem spraviť na stránke novú udalosť defaultnou. Z tohto dôvodu je nutné novú udalosť najskôr vybrať z možností hore na stránke."}, {"11": "Zdravím, píšu to sem protože sem chodí nejvíc hráčů. Chtěl jsem se zeptat, Vy co máte nastavený zasílání nových zpráv na mejl, chodí Vám? Mě přišel poslední 25.1, to už je dost dlouho a předtím byla taky pauza. Nastavení jsem před pár dny resetoval (zrušil a znova nastavil) a pořád nic."}, {"4": "Takže k nové události Velká hlubina. Až dnes jsem si našel čas proběhnout se v mlze v novém eventu a mám následující postřeh. Přesto, že se považuji za hráče, kterému ta mlha jde ( většinou končím stříbrný a lépe ), tak tentokráte INNO překvapilo. Došlo ke změně balíčků, jež kupujete za oslíky ( proč nezměnit něco, co funguje ,že ) tak, že celkově to nějak nevychází. K zisku poslední setové budovy potřebujete totiž v mlze sebrat 260 těch náhrobních kamenů, či co to je. Zbývají 4 dny do konce a já jich mám 180 a jsem ve stříbrné lize. Ti, co jsou ve zlaté, tak mají +204, což znamená, že ani tito nezískají poslední budovu [smilie--sprite9]). Tedy bez použití diamantů [smilie--sprite2] . No a pak jsem se juknul na stránku @iDavis a zjistil jsem, že tento nový set budov je opravdu velmi ubohý, a neumím si představit v jaké fázi hry by mohl být nějakému hráči ku prospěchu. Čili za mě na živo event omezím pouze na sběr oslíků kolem vsi kvůli unuriu, jinak je to velká ztráta času. [smilie--sprite4]"}, {"31": "@pavelb dôvodom nového systému kupovania oslíkov je to, aby sa aj do tejto časti udalosti pridala istá stratégia. Doteraz bolo jednoznačné, že najvýhodnejšou ponukou je tá najväčšia, teda hráči nudne nakupovali len tú jednu a tí, ktorí kupovali inú, padali automaticky do zbytočnej \"noob pasce\", čím sa prehlboval rozdiel medzi hráčmi tejto udalosti v aspekte, ktorý určite nie je jej hlavnou pointou. Teraz sú všetky ponuky výhodné približne rovnako, čiže nikto nemôže urobiť nevýhodnú investíciu oslíkov. Som teda názoru, že táto zmena je plusom udalosti (zvažujúc tiež fakt, že teraz treba pri nákupe viac rozmýšľať).[BR]Samozrejme, je druhá vec či balans udalosti počíta s novým cenovým nastavením a toto som si ešte neodsledoval, keďže som zatiaľ nehral udalosť aktívne. To spravím až sa udalosť spustí u nás."}, {"7": "iDavis[BR]Jen tak na okraj, nevíš (neví někdo) kdy se to spustí u nás?? [smilie--sprite6]​"}, {"16": "Nové balíčky jsem si vyzkoušel a už vím přibližně jaký poměr mi bude vyhovovat.[BR]Jak vychází získatelnost setu (který je pro mne naprosto k ničemu) nevím, jelikož po úkolu Výzkum/Průzkum jsem se na událost na betě vykašlal."}, {"20": "Souhlasím s @pavelb, že v tomto eventu je poslední budova prakticky nezískatelná běžnou hrou bez dia. Ale jak už tu zaznělo víckrát, ani pro mě nemá set zvláštní hodnotu. Na betě 4 budovy setu chvíli nechám, na cz1 ani cz 2 set stavět nebudu. Prostě pojedu hru na oddych."}, {"6": "@iDavis Píšu o tom ve vláknu Tajemství alchymie. Vylepšovat - proč ne. Ale zhoršovat podmínky něčeho, vůči čemu nejsou v podstatě výhrady, to my připadá poněkud protismyslné.[BR]Mlha mi někdy nevlezla pod kůži. Na moje zvyklosti je příliš bingová. Ale zvykl jsem si. A zase je něco jinak. Masarakš.[BR]@pavelb, @Lovec Krys, @Ludi To, že je to dnes z hlediska poslední budovy nezajímavé, se může týkat jenom nás, co jsme v horních kapitolách. Navíc, příště to může být i pro nás zajímavé, a pak budeme třeba škrábat prstíčkem."}, {"2": "@Waso[BR]iDavis má na stránkách začátek na 23. čtvrtek[BR][BR]@Schoenfeld[BR]Viděl jsi konec Teorie Velkého Třesku?[BR]Změna je to jedniné na co se můžeš spolehnout.[BR][BR]Rád bych si pořídil staré sety, většinou jen z piety, ale u některých i kvůli výkonu.[BR]Když dali do události starý zimní set, tak jsem si spočítal že mě vyjde na cca 5k diamantů a v klidu si ho nechal ujít, ale jsou varianty, kdy budu prostě platit.[BR]Takže když dají něco do eventu co budu opravdu chtít a bez diamantů to nejde, tak se budou utrácet diamanty.[BR]A to si myslím, že Inno chce.[BR][BR]Co se ted děje na betě je úprava systému který nemám rád a kdybych ho už nikdy neviděl, chybět mi nebude.[BR]Ale buďem fér.[BR]S úpravou balíčků je tam novinka v podobě božího oka a tu se musíme naučit používat.[BR]Navíc je to beta, takže klidně může dojít k nějakým úpravám.[BR]Například všichni na bětě kteří jsou ve zlaté, aktuálně mají 218+ náhrobních kamenů, mají kompletní set, protože chybějící budovu dostanou na konci jako bonusovou odměnu.[BR]Třeba to zatrhnou."}, {"11": "voyager-1 napsal/a:\t\t\tZdravím, píšu to sem protože sem chodí nejvíc hráčů. Chtěl jsem se zeptat, Vy co máte nastavený zasílání nových zpráv na mejl, chodí Vám? Mě přišel poslední 25.1, to už je dost dlouho a předtím byla taky pauza. Nastavení jsem před pár dny resetoval (zrušil a znova nastavil) a pořád nic.\t\tKlikněte zde pro zvětšení...  tak děkuji za četné odpovědi, admini fóra k tomu také nemají co říct? stále mi nepřišel ani jeden mejl."}, {"66": "To boží oko je zajímavé, dle popisu na iDavisově stránce to na mě působí, jako berlička pro ty, co neumí hrát systém mlžného lesa/vykopávek. S použitím iDavisových rad jsem byla vždy schopná odhalit slušnou část hrací plochy a zbytek neodhalených políček byl strategicky nezajímavý (zvláště když se hrací plocha generuje stále dokola do nekonečna, tak není nutné zůstávat na jedné straně příliš dlouho, dá se to vynahradit postupem dopředu.) Boží oko by mi dávalo smysl, pokud by počet generované hrací plochy byl omezen. Tak nevím, co s tím mám vymýšlet, ale budu to zde sledovat, jestli někdo vymyslí smysluplnou strategii.[BR][BR]@voyager-1 Tajemství alchymie 2023 poprvé v historii hraní elvenaru mi nepřišel email s herní měnou do začátku. Ráda bych k tomu slyšela vyjádření Elvenar týmu. (Měla jsem za to, že to chodí všem. Vysvětlení, že prý to vždy chodilo pouze náhodným hráčům, nějak neberu.)"}, {"2": "Já oko použil když mě teren hnal dál a skoro půlka okna byla zakrytá, abych zjistil jestli má smysl se tam kouknout.[BR]Já souhlasím s tvrzením, že kdo nezvládá základní průchod s okem moc parády nenadělá.[BR]I samotné oko musí hráč umět správně vyhodnotit.[BR]Pod tou puklinou může být cokoli, asi i lopatka."}, {"7": "add GorGlin .:​Dík a hezkou neděli! [smilie--sprite8]​PS: Nevíš (neumíte někdo polopaticky vysvětlit, jak se píše takovej ten odkaz na jméno se zavináčem na začátku? [smilie--sprite10]​Takový to: @Waso​"}, {"16": "Na české klávesnici pravý alt + v."}]