[{"17": "voyager-1 napsal/a:\t\t\ttak děkuji za četné odpovědi, admini fóra k tomu také nemají co říct? stále mi nepřišel ani jeden mejl.\t\tKlikněte zde pro zvětšení...Prealiena napsal/a:\t\t\tTajemství alchymie 2023 poprvé v historii hraní elvenaru mi nepřišel email s herní měnou do začátku. Ráda bych k tomu slyšela vyjádření Elvenar týmu. (Měla jsem za to, že to chodí všem. Vysvětlení, že prý to vždy chodilo pouze náhodným hráčům, nějak neberu.)\t\tKlikněte zde pro zvětšení...Tyto nabídky (tedy newslettery) jsou automaticky generovány naším systémem, skutečně proto může dojít k tomu, že daný typ nabídky obdrží jen určitý počet hráčů (a to aniž by šlo o chybu hry).[BR][BR]Jakožto Elvenar tým bohužel nemůžeme ovlivnit to, komu jsou zasílány. Nicméně děkujeme za Vaše připomínky, Vaši zpětnou vazbu předáme tvůrcům hry v Německu, protože jsme si moc dobře vědomi toho, že při poslední události se na fóru objevilo nemalé množství otázek ohledně těchto nabídek!"}, {"6": "@Waso Nebo levý alt+64."}, {"7": "@Lovec Krys[BR]Čili zavináč a kopírování?[BR][BR]O_O[BR][BR]No toto.... [BR][BR]​"}, {"221": "tak uz jsem odklikala neco z eventu to oko je asi vazne vicemene na okrasu balicky kupuju ty druhe 2 na stridacku no asi to neni ideal a ikdyz nemam komplet ukoly uz muzu s klidem rict ze pravdepodobnost je skoro zadna ze bych dala cely set[BR][BR]no kazdopadne velky set, na druhou stranu pokud ho zde slozim cely asi ho na nejaky cas do mesta dam 5vb jako kdyz najdes a k tomu nakej bordel nez to zastara tak z toho neco bude"}, {"2": "@Hexik [BR]Které jsou ty druhé 2?[BR][BR]5VB je fajn, ale bůh ví co to taky není.[BR]Set je 6x6, takže dvě levlovačky daj víc.[BR]Tenhle set mi přijde jako na míru lidem co začali s Amuni.[BR]Dává toho spoustu, takže nic pořádně, ale lidem co právě začali vyrábet T5 přijde vhod každý fufnik."}, {"221": "no myslim ty balicky nastroju jinak co je v truhlach jsem neresila jako obvykle[BR][BR]jak rikam kdyz je volny misto a kdyz to zastara bude to na nic protoze kdo by to vylepsoval"}, {"11": "@Waso prostě klikneš myší do políčka odpovědět a uděláš zavináč jak Ti píšou a začneš psát jméno hráče kterému chceš odpovědět. Po pár znacích se Ti nabídne, žádný kopírování v tom není. Tvůj nick se mi ted nabídl po dvou znacích."}, {"31": "Na svojej stránke som práve sprístupnil novú záložku - Ihrisko.[BR][BR][IMG]https://i.ibb.co/bP017JL/https-i-ibb-co-Nnf2-NWh-playground-screen-fb-png.png[/IMG][BR]Ihrisko je najnovším prídavkom pre moju stránku a nadchádzajúcu udalosť Velká hlubina. Jedná sa o simuláciu zaužívanej hernej mechaniky, ktorú poznáme ako z tejto udalosti, tak z Mlžného lesa počas udalosti Halloween. Ihrisko vám umožňuje spoznať nielen ako táto mechanika funguje, ale tiež si natrénovať rôzne stratégie, obchádzanie prekážok, zbieranie odmien a zamerať sa na čo najefektívnejšie využívanie vašich nástrojov! Behom udalosti Velká hlubina nám bude tiež predstavený nový obchod nástrojov - tento bude po novom taktiež súčasťou stratégie (vďaka novému a už rovnomernému usporiadaniu jednotlivých ponúk nástrojov) a nakoľko je tento obchod taktiež implementovaný v ihrisku, môžete si vyskúšať rôzne kombinácie nákupu nástrojov a spoznať, ktorý z nich vám vyhovuje najviac![BR][BR]S ihriskom môžete interagovať - používať oslíkov, nakupovať nástroje a odhaľovať hmlu z pochovaného mesta! Po otvorení stránky začnete so stavom 1000 oslíkov, ktoré môžete využiť stlačením tlačidla + nachádzajúcim sa pod prehľadom vašich nástrojov. Nástroje umiestňujete na plochu rovnakým spôsobom, ako je tomu v skutočnej hre (jej prehliadačovej verzii).[BR][BR]Pre reštartovanie hry môžete využiť tlačidlo Reštart. Hra sa skončí v momente, kedy za zvyšných oslíkov už nemôžete kúpiť žiadny nástroj a tiež aktuálne nevlastníte žiadne nástroje, ktoré by ste na ploche ešte vedeli použiť. Ihrisko si v takomto prípade uloží vaše aktuálne skóre (merané pomocou nazbieraných starovekých tabletov) a pokiaľ presahuje vaše doterajšie najvyššie skóre, zobrazí sa pod oknom s vašou hrou. Následne môžete začať novú hru a so snahou ďalej vylepšovať jednotlivé stratégie sa pokúsiť prekonať vaše najvyššie skóre znova![BR][BR]Ihrisko sa snaží využívať čo najpodobnejšie správanie tomu, ktoré poznáme zo skutočnej hry. Samozrejme, nepoznám presné algoritmy ktoré stoja za správaním sa pochovaného mesta. Implementácia ihriska spočíva v mojom detailnom sledovaní tejto hernej mechaniky a snahe imitovať ju tak presne, ako sa len dá. V prípade, že by sa v simulácii objavila odchýlka oproti skutočnej hre, bude samozrejme v mojej priorite opraviť ju čo najskôr. V takomto prípade budem rád aj za vašu spätnú väzbu, ktorú mi môžete poskytnúť napríklad cez súkromnú správu tu na fóre alebo cez kontaktnú stránku na mojom webe.[BR][BR]Ihrisko môžete navštíviť kliknutím na tento odkaz:[BR]https://idavis-elvenar.com/events.html#playground-february_xxiii_[BR][BR]Zo stránky sa môžete dostať k ihrisku kliknutím na záložku Playground v ľavom paneli na podstránke Všetky udalosti."}, {"7": "@voyager-1 [BR]= díky! [BR]Políčko \"odpovědět\" sice nemohu najít, ale po napsání zavináče a dvou písmen se to fakt dopíše...[BR]@Lovec Krys  = (pro jistotu) ...prostě mne nenapadlo, že je takhle....[BR]@iDavis  = díky za ihrisko !!!"}, {"237": "Ahojky, chci se zeptat, na BETĚ se dá hrát jenom tak, že město a popis je v angličtině? A když tak jak se dá nastavit čeština? Díky za radu"}, {"16": "Hra na betě je jen v angličtině."}, {"237": "Díky"}, {"2": "Ale je tam několik českých/slovenckých cechů, kde ti rádi pomůžou"}, {"20": "Dnes se na betě objevilo avízo na DS, takže po eventu se dá čekat i tady."}, {"7": "@Ludi [BR]A jéjej = to zas budou nervy!!!  "}, {"2": "Jak jistě všichni víte, dnes na betě začalo DS[BR]A[BR]V odměnách je jen jeden aktefakt, tedy konkrétně kouzlo na jeden artefakt na golema moudrého či parního[BR]a za poslední mapu je kouzlo na jednu budovu, libovolnou, z pouště."}, {"31": "Informácie k dobrodružstvu sú v tejto chvíli nahrané na webe. Okrem nových odmien došlo aj k malej zmene požadovaných odznakov - stále sa jedná o verziu H (podobne ako v minulom kole), ale niektoré strety boli veľmi mierne modifikované v počte odznakov. Dobrodružstvo by malo nasledovať po aktuálnej udalosti Velká hlubina - takýto scenár sa odohral na bete."}, {"2": "A na betě už jsou Velikonoce, sbíráme tam lávová vejce."}, {"11": "ten Fénix, to je zas bomba "}, {"2": "Další možnost ušetřit krmení.[BR]Musíš hledat to dobře.[BR][BR]A to býval silnější, pro jistotu ho zkrouhly."}]