[{"31": "Všetky nové budovy k veľkonočnej udalosti sú ako vždy dostupné tu a priestor pre denné odmeny a úlohy udalosti je pripravený tu. Na stránke je zároveň pripravený aj porovnávač truhiel.[BR][BR]Inak musím ale súhlasiť, že nový fénix ani mňa dvakrát neoslovil, keďže väčšinu stretov vo veži riešim bojom a krmivo má, z hľadiska jeho dostupnosti, už príliš veľa ďalších dôvodov používania v mojom meste."}, {"16": "Ten fénix je dobrý způsob pro nováčky, jak si zvýšit úroveň ohnivého fénixe.[BR]Na cz1 budu hrát událost kvůli VBčkům,[BR]na cz2 jen kvůli bohyni na konci (naštěstí klikání na bedny jde o dost rychleji než odkrývání ruin)[BR]a na betě se ani nebudu obtěžovat dělat úkoly (max. si jednou denně odkliknu denní dávku měny - nějak jsem holt zlenivěl."}, {"11": "za co půjdou artefakty měnit, za popeláka asi ne, že?"}, {"9": "asi jsem zase opet jedina co by v nem mohla videt nejaky potencial, myslenka snizeni ceny vyjednavani se mi libi ikdyz jsou vyjednavaci v mensine, tak proc by nemeli mit fenixe taky nakyho dobryho nevim jestli 10% je ok, ale klidne bych pridala dobu trvani 1-2 dny[BR]a urcite by to melo byt pouzitelne i pro turnaj, protoze pokud nekdo vyjednava vez tak turnaj nejspis taky[BR][BR]no na lavovy vejce sem uz cekam tak jsem zvedava jestli nejake nove ulovim"}, {"2": "@voyager-1 já doufám, že dají všechny ptáky."}, {"11": "@Elvinka12  ale bude Tě to nutit zahrát věž za 12 hod a utratit plno urychlovačů nebo dia. Já např. věž vykupuju velmi výjimečně, mě se určitě nevyplatí. To hodím to krmení radši na jednoho hnědýho medvěda[BR][BR]@GorGlin tak to bych raději navýšil popeláka, mám jen lvl7 i když ho většinou stejně nepoužívám"}, {"9": "@voyager-1 nerikam ze jsem nekdy nevyjednavala, ale ted fakt ne zere to hodne surovin a nekdy se to dost tahne ale jsou hraci co vyjednavaji i ve vysoke kapitole kterym by to mohlo ve hre pomoci[BR]vez i turnaj delam najednou tak proc by nemohli vyjednavaci teda treba jeden den vez a v sobotu turnaj nebo jak mi to vyjde[BR]spis jde o to ze pak jako vyjednavac musis mit vse v dostatku na sklade a myslim ze prave oni nechodi vez najednou ale po castech"}, {"16": "voyager-1 napsal/a:\t\t\tza co půjdou artefakty měnit, za popeláka asi ne, že?\t\tKlikněte zde pro zvětšení...[IMG]https://i.ibb.co/QfLZ6Lm/https-cz-forum-elvenar-com-index-php-attachments-1678946934675-png-6665.png[/IMG]"}, {"20": "Na betě rovnou navyšuju Popeláka, mám to tam zanedbaného. Na konci úkolů je jako odměna stará dobrá Studna 3x3.[BR]Event v klídku, zatím úkoly v pohodě.[BR][BR]Nový Fénix nic moc, hráči si alespoň vylepší dřívější mazlíčky [smilie--sprite6].[BR][BR]Po aktualizaci na betě je změna, opět je tam Studna 2x2.[BR]Dnes na betě začátek další Sezóny."}, {"2": "Na betě dnes začala nová sezóna, Season of Joy.[BR]Poslední budova je taková malá šmudla 2x2 na semeno.[BR]O placené odměny asi mění moc zájem, protože tam narvali diamanty.[BR]Dej 3k a pak si můžeš nasbírat 800 zpět.[BR]A to se vyplatí.[BR]Já z toho nijak odvářeny nejsem.[BR][BR]A ještě dodám, že i odměna za splnění 4 denních úkolů šla hrozně dohaje.[BR]Je to fakt škoda."}, {"16": "Jo, tak to je něco:[BR][IMG]https://i.ibb.co/0r8PCRW/https-cz-forum-elvenar-com-index-php-attachments-1678986582964-png-6666.png[/IMG][BR]To si jako někdo myslí, že když se sníží odměny již něčeho tak málo atraktivního, že atraktivita vzroste?"}, {"2": "Co si myslí Inno je stejné tajemství jako na co myslí naši exprezidenti.[BR]Ty řekni jak dechberoucí byli ty truhly po Snovém Jezírku?[BR]Třeba si myslí že tím to celé vyváží."}, {"16": "Tak dechberoucí, že jsem je ignoroval."}, {"2": "Tak asi spolehají na to, že jsem banda blb.ů s obsesí."}, {"6": "Po studiu u @iDavis pojedu přednostně truhly 103 a 126. [BR]V prvním dnu hodlám zachovat standard 35+ úkolů, takže snad nahradím loňská vejce. [BR]Páč to asi letos na bazény nevypadá, tak dám zase jenom udržovačku a na konci, když bude ještě potřeba, zkusím losnout vejce.[BR]Žádné vzrůšo. Nuda. [BR]Ale pořád lepší než drátem do oka."}, {"2": "@Schoenfeld [BR]Bazén je Burning pool z 15. dne?[BR]Jestli se cítíš na 35 úkolů první den tak proč by jsi nezvládl budovu po dvou týdnech?"}, {"6": "Neboj, na jezírko 15. den jsem už pěkně navrčenej. Ale ještě před tím, chci alespoň 3 vejce. Pak ať se děje vůle boží. Amen."}, {"239": "@Schoenfeld jezírko je ale lepší než vejce"}, {"4": "@XB238 - ano, na políčko o něco lepší. Pro ty, kteří se můžou přihlásit třeba jen jednou denně, je však lepší to lávové vejce, protože má mnohem delší produkci"}, {"2": "@pavelb [BR]Hlavně má dvoudenní produkci.[BR]Takže když už dojde sběr do pozdních nočních hodin a nechám to na ráno, tak všechno stojí.[BR]Krom vajec.[BR][BR]Tak beta nám přinesla novou informaci.[BR]V úterý tam vypukne Mama Juul`s Fusion Feast[BR]Nový event s novou levlovací budovou.[BR]Bude to klasika 4x4 10 lvl s náhodným efektem.[BR]Jasně, jsou tu nějací makanti a kultura, ale kůliva tomu to nestavíme.[BR]Znáte to zklamání, když kliknete na kostku nad hbitostí a naskočí urina?[BR]To se vám tady nesatne, tenhle badák je na...[BR]PRACHY[BR]Kdo má problém, že mu lidi výpomocí nedávají peníze tak tohle je pro vás.[BR]Já to řeším z pohledu kap.20.[BR]Jako bych dostal každý den 12,3% kasy.[BR]Samozřejmě ne uplně, je to náhodná odměna, takže tam jsou nějací orci a tak...[BR]Ale..[BR]Kdo má štěstí a platí pro něj statistika, tak za rok s tímhle barákem dostane 10 krmení.[BR][BR]A to se vyplatí."}]