[{"234": "No to je kravinka. 1% krmení navíc? Tak to vůbec nechápu, kam se tato hra ubírá. Desítky zvířat bude hladovět. Absolutní nepoměr k množství staveb, které vyžadují krmivo. To si určitě pochvalu nezaslouží. Ono vůbec i ta věž. Nově začínající hráči jsou ve velké nevýhodě. I když makají ve věži až navrch, tak pokud jim padne za 6 týdnů pár artefaktů tak je to nevytrhne"}, {"31": "Na bete sa zajtra začína najnovšia udalosť - Hostina mámy Juul.[BR][BR][IMG]https://i.ibb.co/fSvQqZb/https-i-ibb-co-q-FJC5f5-EL-akcia-m-j-2023-banner-png.png[/IMG][BR]Táto udalosť prináša celkom novú tému do hry s už osvedčenou mechanikou zlučovania predmetov (naposledy sme túto mechaniku mohli vidieť pri udalosti Návrat do minulosti behom minulého roka).[BR][BR]Hlavnou budovou je rozvinuteľná budova s náhodnými produkciami - ako už bolo v príspevkoch vyššie spomenuté, jednou z nich je aj krmení, ktoré je možné získať v množstve troch kusov s 1% šancou.[BR][BR][IMG]https://i.ibb.co/6ZdZy4Z/https-i-ibb-co-k44-YXR7-juuls-traveling-kitchen-png.png[/IMG][BR][BR]Detaily budovy si môžete pozrieť tu. K dispozícii budú aj ďalšie nové budovy ako súčasť denných odmien, odmien z kráľovského poukazu a 3 nové budovy s dočasným efektom (ktoré budeme môcť získať od niektorých zákazníkov pri chystaní jedla).[BR]Prehľad všetkých nových budov a ich detailov nájdete tu.[BR][BR]Priestor pre denné odmeny, úlohy a ďalšie písané návody k udalosti je pripravený tu. Denné odmeny sa budú objavovať spolu s priebehom udalosti na bete a úlohy spolu s písanými návodmi sa objavia behom zajtrajšieho dňa.[BR][BR]V neposlednom rade by som chcel dať do pozornosti formulár, ktorý som vytvoril pre účely spätnej väzby k webu - ak máte akékoľvek pripomienky k čomukoľvek na stránke a mali by ste záujem vyjadriť sa k rôznym dizajnovým, orientačným a technickým aspektom stránky, budem rád, keď sa so svojou spätnou väzbou podelíte v tomto dotazníku. Bude pre mňa užitočná pri vymýšľaní ďalších noviniek na stránku a prípadnej editácii súčasného obsahu tak, aby obsahoval zrozumiteľnú navigáciu, bol pre užívateľa lepšie pochopiteľný a napokon obsahoval všetko, čo od neho hráč očakáva."}, {"6": "No asi se kvůli hlavní ceně nestrhám. 1% šance je i na 200 mantů u džina a musím hodně přemýšlet, kdy jsem je neposledy dostal. A to mám standardně v akci 2-3 džiny.[BR]Počkáme, co bude za denní ceny.[BR]Slučování mě moc nezaujalo, ale proti vaření jako takovému nic nemám. Jen aby to nebyla nějaká kotlíkovina."}, {"20": "Loni mi chvíli trvalo, než jsem si na novou mechaniku eventu zvykla, ale pak to bylo celkem dobrý. Kupodivu mi nová budova připadá užitečná, všechno, co z ní padne je dobrý [smilie--sprite2]."}, {"238": "čo sa týka tých záhonov 1x1 čo zvyšujú produkciu bežného tovaru.  tích 5 % je  odpočítané od základu 100% ( bez relikvie 700%)[BR]alebo je to (základ 100% + relikvie 700% + div 100% + kúzlo 400%)   + 5% z toho celého ?[BR]( nie že by mi chýbal základný tovar, len pre upresnenie [smilie--sprite1])"}, {"2": "@Ezran SVK [BR]Bonusy z bonusů se tu nenosí, šacoval bych to na 5%zakladu."}, {"213": "Nová budova se mi líbí bude dobrá na orky a skládačka mne minule bavila čili já se na event těším a snad najdu i místo pro postavení této budovy"}, {"20": "Event na betě už jede, sbírají se čepice šéfkuchaře, grafika eventu je nová, takže dobrý."}, {"242": "Ahojky všem, nevíte kdy nám začne event na živých serverech? Očekávala jsem začátek tento týden a kde nic tu nic...:-D"}, {"31": "@Katrina86 dátum udalosti je už teraz zverejnený v oficiálnom oznámení.[BR][BR]Zároveň je v tejto chvíli aj kompletný návod k udalosti na mojej stránke. Upravil som prehľad úloh na novú verziu, v ktorej došlo k viacerým zmenám, a to vylepšeniu grafického zobrazenia úloh, lepšej čitateľnosti jednotlivých zadaní (a/alebo), pridaniu zobrazovania odmien, podpory hrania na viacerých serveroch a možnosti stiahnutia si aktuálnej verzie úloh. Boli to niektoré z nápadov, ktoré sa najčastejšie objavovali v mojom predchádzajúcom dotazníku, ktorý som ku stránke vytvoril s účelom získania spätnej väzby. [BR]Ďakujem každému, kto prispel svojou odpoveďou - účasť bola naozaj obrovská, vďaka čomu som dostal veľké množstvo konštruktívnej spätnej väzby.[BR]Nové zobrazenie prehľadu úloh je výraznou zmenou na mojej stránke a preto ma opäť zaujíma, aký názor na túto zmenu máte. Na viaceré aspekty ako zrozumiteľnosť, dizajn a technická funkčnosť nového zoznamu úloh je zameraný môj najnovší dotazník, ktorého vyplnenie vám opäť nezaberie viac než pár minút."}, {"213": "Na betě žádé novinky? Nová kapitola či DS?"}, {"20": "Za dva dny začíná na betě DS."}, {"240": "Čus.Jedina novinka že do hry vstoupili reklamy Reklamy po městě,reklama ve výzkumu stromu na VB,nutnost mít vyzkoumany výzkum DS,jinak se nemůžeš zúčastnit, samozřejmě jak u kotla vyzkoumat zpětně[smilie--sprite1]Vcelku žádný zásadní novinky  Hezký den všem"}, {"2": "DS už mám vykoumaný, takže to neposoudím, ale přijde mi to jako druhá denní odměna.[BR]Padne mi do města věc na kterou když kliknu a pustím si 15s reklamy na Inno hru, tak dostanu náhodnou bednu.[BR]Ale jen v apce."}, {"7": "Takže střídat PC a mobil?  [smilie--sprite9]"}, {"20": "Já mám reklamy na betě i na PC. Ale o nic nejde, když mě to nezajímá, neklikám. Jsou u toho drobné odměny."}, {"16": "Vzhledem k tomu, jak moc nenávidím reklamy, tak bych na to neklikl ani kdyby z toho padaly diamanty."}, {"5": "...to nám tady ještě chybělo [smilie--sprite3]"}, {"31": "Nedá sa povedať, že by som bol z toho nadšený, ale asi sa to dalo predpokladať, keďže sme boli jednou z posledných hier od Inno, ktorá reklamy ešte nemala. Nie všetci hráči na bete zatiaľ reklamy majú, čo by som predpokladal, že je len istá forma AB testu a časom sa to sprístupní pre všetkých."}, {"2": "Dobře je, že když nechceš tak se nepodívas. Nevpe se to když jdeš z města na mapu."}]