[{"20": "Pro odměnu se ani nemusí pouštět reklamní video, jen první okénko po spuštění se nechá otevřené 5s a pak vypne. Na odměnu to tak stačí."}, {"213": "no bomba teda:-("}, {"20": "Bomba to sice není, ale taky žádná tragédie. Kdo nechce, nemusí si toho všímat."}, {"2": "A zdá se Adblock na to funguje"}, {"6": "Lovec Krys napsal/a:\t\t\tVzhledem k tomu, jak moc nenávidím reklamy, tak bych na to neklikl ani kdyby z toho padaly diamanty.\t\tKlikněte zde pro zvětšení...Taky je nemusím.[BR]Ale co naplat, nejsou jenom doprovodem naší západní demokracie, ale jsou i zároveň  projevem a jedním za základů téhož. Prostě jiní platí, Lovče, za  nechuť některých z nás hráčů platit přímo za to potěšení hrát tuto hru nákupem za inflační reálný peníz.[BR]Tak si prostě občas odklikneme něco navíc, nebo nás dokonce cosi i zaujme. Kdo ví..."}, {"16": "@Schoenfeld Jestli se někdo chce dívat na reklamy, ať se na ně dívá - jeho problém. Já se na ně dívat nebudu a pokud by někdo v Innu dostal geniální nápad udělat je povinnými pro hru, se hrou okamžitě skončím."}, {"20": "Na betě další novinka: v Chatrči stavitelů je nová záložka: Hobby, tam se za otevření náhledového okénka reklamy (5 s. 4x) dá naklikat zvýšená výroba některých věcí. Takže mám + 20% orků na 14 hod. A výroba není náhodná. Ještě to nemám úplně prohlídnuté a nevím, jaké všechny suroviny to bude zvyšovat ve vyšších kapitolách."}, {"243": "Postřeh z posledního dobrodružství společenství :  Účast pro odměny se počítá zvlášť pro každou fázi (úroveň) dobrodružství, je tedy nutné vložit alespoň jeden příspěvek do jakéhokoliv bodu trasy z dané fáze, abyste na jejím konci obdrželi odměny.[BR][BR]Příklad: Pokud vaše společenství dokončí první tři fáze dobrodružství a vy jste vložili příspěvek do bodů trasy v průběhu fáze 1 a 3, obdržíte odměny právě za tyto fáze. Nikoliv ale za fázi 2, protože do pokroku v ní jste se nijak nezapojili. [BR][BR]Nestačí tedy pro odměny přispět do prvního kola."}, {"9": "ty reklamy asi jsem na tom podobne jako lovec, proste jedna z mala her co byla bez reklam a ted to s.. cpou i sem no co se da delat ta zvysena vyroba u stavitelu vypada pekne, ale reklamy kdo by na ne koukal a kdyz jsem koukala na obsah darecku z filmu kolem mesta tak ty odmeny vypadaji podobne jako darecek na mobilu takze zadna spasa a to same ten nakup knizek do vyzkumu jako po jedne koukat na nakou reklamu? to si radej koupim za mince nebo suroviny[BR]ja bych na reklamy koukala jen kdyby za to byly dia a to jeste si nejsem jista, ale ne tak jak jsou v darecku jako minimalni sance na drobne[BR]podle me by meli ihned zavest nejakou moznost aby to slo vypnout a neobtezovalo to hrace co o to nestoji"}, {"22": "Anitacek napsal/a:\t\t\tNestačí tedy pro odměny přispět do prvního kola.\t\tKlikněte zde pro zvětšení...To je novinka? Měla jsem za to, že kdo nepřispěje, nedostane odměnu z daného kola, tak to bylo vždycky"}, {"20": "Na betě je nepříjemné, že nasadili starší verzi DS, takže pivo zase za 50 kousků. Doufám, že až přijde na live, tak už to bude v pořádku."}, {"9": "s tema odmenama za ds myslim ze to funguje od doby kdy je videt kdo prispel v kazdem kole ale popravde nemam overene, to ze mi unikne prvni odmena se stat muze ale ze bych nestihla druhou nebo treti mapu se mi jeste asi nestalo, ale drive tomu tak bylo kazdopadne bavime se o zmene asi rok zpet[BR]ty pivka me vlastne ani netrapi ty se vzdy nejak udelali problem delali jine odznaky"}, {"5": "Ověřeno: pro odměnu je nutné přispět v každé mapě..."}, {"11": "To bylo kdysi, že stačila jedna mapa, pak to myslím bylo na foru označeno jako chyba ve hře a od té doby je nutné přispívat do každé."}, {"2": "Na betě už jede odpocet na další událost.[BR]Dnes končí DS a zítra začne event.[BR]Je to mazec."}, {"31": "Na bete sa začala najnovšia udalosť Floral Awakening.[BR][BR][IMG]https://i.ibb.co/wpfb3jj/https-i-ibb-co-0m-QJGvz-EL-akcia-j-n-2023-banner-png.png[/IMG][BR]Jedná sa o podobnú tému ako sme tu mali minulý rok v máji (miešanie kvetiniek na ploche). Hlavnou budovou je Dragonheart Estate, ktorá poskytuje prepínateľnú produkciu - na výber máme z mincí, zásob, rôzneho zboží a prastarej vedomosti (7).[BR][BR]Detaily všetkých nových budov si môžete pozrieť tu a denné odmeny spolu s úlohami nájdete tu (zvoľte si najprv túto udalosť z rozbalovacej ponuky na vrchu stránky).[BR][BR]Súčasťou udalosti budú aj nové avatary, ktoré sa podľa môjho názoru tentokrát ozaj vydarili:[BR]Spoiler[IMG]https://i.ibb.co/HYkChfT/https-oxzz-innogamescdn-com-frontend-assets-portrait-evt-shuffle-garden-xxiii-f1-fbb44850ebb2feaed7d.png[/IMG][IMG]https://i.ibb.co/Jx3dFpK/https-oxzz-innogamescdn-com-frontend-assets-portrait-evt-shuffle-garden-xxiii-f2-d60c0e33fbca9116af4.png[/IMG]"}, {"213": "Koukám novej event a nová kapitola pořád nikde?"}, {"5": "Loni byla nová kapitola oznámena v srpnu a začala pak na začátku září...proč by nemohl být stejný harmonogram letos?! [smilie--sprite1][BR]\t\t\thttps://cz.forum.elvenar.com/index.php?threads/kapitola-%C4%8D-20-s%C3%ADla-hudby.8182/\t\t"}, {"3": "přesně to tvrdím od začátku. Jedna kapitola ročně, víc nečekejme..."}, {"6": "Současný koncept staveb kapitol byl vyčerpán. Předpokládám radikální změnu (k lepšímu), nebo naopak rozpačitou uplácanou přístavbu (k horšímu).[BR]Doufám, že budeme příjemně překvapeni."}]