[{"85": "Ahoj, co prosím znamená AW help?"}, {"31": "@Kyntaro nová úloha ktorá bude súčasťou nasledujúceho dobrodružstva: [BR]Daruj X VB do prastarého divu iného hráčaPredmet získateľný v tejto úlohe je v tabuľke pomenovaný ako AW help."}, {"81": "[BR][BR]Ale no ne  když jsem o tom tématu psal tak velká kritika a píšu blbosti, plus mé návrhy. A teď co? Dobře vám tak ...[BR]Aspoň opravdu vidíte pro koho jsou takové soutěže určeny a určitě se budete všichni divit kdo že to teď překvapivě vyhraje  [BR]A to bude opravdu vylepšení a přínos pro stmelování kdy bude nátlak na ty co již jsou nebo už mají kapitolu orků za sebou  [BR]Ale tak odůvodnit se to dá třeba že odměny z cesty kde to bude pro ty orky nejsou určeny pro hráče kteří jsou níže v kapitolách "}, {"73": "a jak je to přesně s těmi body? Když někdo dá 1 VB někomu do divu, tak může ten jeden dodat do dobrodružství nebo musí dát někomu 10 VB, aby mohl 1 dodat do dobrodružství? Asi to tu už někde bylo, ale nemůžu to najít"}, {"31": "@LuciskaCh pozrel som sa na to a úloha vyžaduje dodať 10 VB (neviem či sa množstvo v rôznych kapitolách líši) a odmenou je 1x predmet Wonder society badge, ten sa dodáva do dobrodružstva."}, {"81": "@iDavis  - hmm omlouvám se ale co mají dělat někteří co mají smůlu na sousedy díky dobře fungujícímu systému přesunu hráčů kde není vyloučeno že ani jeden z nich nebude mít žádný div a i ve společenství? Většina hráčů třeba v mém společenství kteří jdou dále než já nemá ani jeden div ale někteří je jich málo co mají."}, {"82": "karhol napsal/a:\t\t\tNavíc by mně zajímalo, proč společenství na nižší úrovni musí dodat stejně materiálu, relikvií a všeho ostatního jako společenství na vysoké úrovni a potom jejich odměna (získaná budova) má mnohem a mnohem horší parametry. Navíc je pro společenství s nižší úrovní mnohem náročnější splnit požadavky dobrodružství a to i když se zapojí všichni.[BR]Je to nefér  - čím nižší úroveň hráčů ve společenství, tím vyšší námaha na splnění požadavků a zároveň horší odměny - s tím by se něco mělo udělat.[BR]Takže buď stejnou odměnu, nebo nižší obtížnost v závislosti na úrovni hráčů ve společenství (když jde udělat rozdílnou odměnu, jistě lze nastavit i rozdílné požadavky na plnění!!! )[BR]Karhol\t\tKlikněte zde pro zvětšení...Tak tohle je úder na \"hlavičku\" ... unfair přístup. [BR]Osobně (a už jsem to psal klanu) bojkotuju tenhle nesmysl...opět myšlenka dobrá,ale nevyvážená .... už vidím,jak tvůrci jedou někam za prací,kde náklady spojené s tím přesáhnou výdělky..."}, {"85": "Děkuji za odpověď."}, {"41": "Nightwish89 napsal/a:@iDavis  - hmm omlouvám se ale co mají dělat někteří co mají smůlu na sousedy díky dobře fungujícímu systému přesunu hráčů kde není vyloučeno že ani jeden z nich nebude mít žádný div a i ve společenství? Většina hráčů třeba v mém společenství kteří jdou dále než já nemá ani jeden div ale někteří je jich málo co mají.\t\tKlikněte zde pro zvětšení...[BR]Darování VB do divů můžeš kterémukoli hráči z celého světa na kterém hraješ. Nemusí být na tebou objevené mapě, ani ve tvém Společenství. Stačí si prostě najít jakéhokoli hráče z žebříčku a darovat VB jemu do divu. Takže tento úkol je splnitelný pro všechny kdo vyzkoumali Tajemné prastaré divy, které se nacházejí ve 2. kapitole."}, {"72": "Zde aktuální tabulka v češtině > elvenar.athlan.net[BR][BR]Ne že by to tedy mělo smysl hrát..."}, {"31": "Dneska tu máme ostré obrázky... [BR]Sneak Peek[BR][BR]Spoiler: Sneak Peek\"Konečne si zaostríme,[BR]nech víc toho uvidíme.\"[BR][BR][BR][BR]\"Zde nové budovy máme,[BR]kam je asi umístíme?\"[BR][BR][BR][BR]​"}, {"73": "ta vypadá dobře, jen ještě, aby se vyplatila"}, {"66": "Vypadá to docela velký, tak 4x5 minimálně, hádám.[BR]Tak aby se to hodně vyplatilo."}, {"72": "Mi to tedy přijde zas jako nějaký set.. a určitě to bude asi víc jak 4x5, jen tu věžičku bych tipl na minimálně 2x2 "}, {"2": "Já do Dobrodružství jdu a snažím se strhnout ostatní členy, je na to nutná spolupráce.[BR]Vyhrát Dobrodružství může asi jen dvě nebo tři společenství na serveru, ale dotáhnout ho do konce věřím zvládneme.[BR]je třeba hledat cestu a ne překážky.[BR]vyhnout se orkům lze, vyhnout se divům lze[BR]je pravda, že obrúčty to dají snáz a nebudou to mít dražší, ale menší účty to dají také, jen musí spolupracovat opravdu všichni[BR]Kdo tyhle akce chce hrát, musí hledat společenství, kde to žije a to si myslím, že je tlak od Inna[BR]Jeslti je to dobré ať posoudí každý sám.[BR][BR]já březen hádám zas na Fénixe[BR]tedy to co tam vidím vypadá jednoznačně jako pták[BR]jak moc se budova vyplatí hodně záleží co člověk má, ale s ohledem na nedávno vypuštěné elementály je svět v pohybu[BR]takže pro dost hráčů to bude event v nové době a tím pádem nečekám nic převratného protoež hlavním přínosem bude že stávající bude výkonější"}, {"16": "@GorGlin No my menší z menších a méně aktivních společenství by jsme si jen zbytečně ubližovali tím, že se zúčastníme. A kvůli jedné budově mi to za to rozhodně nestojí, stačí si pár týdnů počkat a získám mnohem více za mnohem méně námahy..[BR]Pro mne dobrodružství společenství navždy skončila. Efektivita odměn vůči vynaložené námaze je příšerná."}, {"31": "Ľudia, na tom druhom obrázku sú budovy, nie budova.  Zatiaľ iba @athlan správne poznamenal, že sa jedná o set. [BR][BR]Čo sa týka tých dobrodružstiev, nehádzal by som flintu do žita. Môj osobný názor je, že sú ešte stále v testovacej fáze, ktorá zahŕňa experimentovanie s rôznymi požiadavkami a úlohami a chcú proste vidieť, ako hráči reagujú a ako rýchlo sa jednotlivé spoločenstvá \"prehrýzajú\" mapami. Myslím si, že v budúcnosti by mohli byť dobrodružstvá omnoho zaujímavejšie, vyzerá to tak že nás čakajú nové budovy ktoré budú mať celkom zaujímavé efekty pre naše mestá a teoreticky by mohli byť súčasťou práve týchto udalostí. "}, {"86": "Zdravím milí spoluhráči.Naše společenství se pro tentokrát rozhodlo akci Dobrodružství vypustit ,právě z důvodů neustálých změn,které ovšem vedou spíš k horšímu.Za to se velmi těšíme na nadcházející event ,set budov vypadá skvostně a určitě i odměny budou větším přínosem než jak tomu je v Dobrodružství.[BR]Všem pěkný víkend a hodně úspěchů ve hře"}, {"68": "Naše společenství se dobrodružství účastnit nebude. Odměny se absolutně nevyplatí a dokud se to nezmění tak hádám, že to tak zůstane.  Ale na event se těším, jen doufám, že tam nebude vše jen na set.. to by mě asi trefil šlak"}, {"65": "a hlavně, aby se ten set po konci eventu zase nezměnil :-([BR][BR]já půjdu tentokrát asi jen po hlavních odměnách, s nějakou rezervou na zahradu přepychu, kdyby se tam objevila. někdy v průběhu (spíš ke konci) eventu bych mohl končit orky - vrb chci postavit aspoň 10, což je +35 tisíc kultury. čistou kulturu tedy moc potřebovat nebudu."}]