[{"20": "Stačí se podívat na fórum bety, tam už je náhledů na novou kapitolu dost. Jsou to neofiko informace od hráčů, ale něco to napovídá. Každopádně provozování této hry má nějaké náklady, a řekla bych, že uvedení nové kapitoly bude pro provozovatele celkem drahé. Co se týká příjmu, už bylo někde zmíněno, že začínající hráči platí podstatně víc, než zkušení mazáci, co jsou tu už dlouho. Takže 1 nová kapitola ročně je logický závěr."}, {"3": "Schoenfeld napsal/a:\t\t\tSoučasný koncept staveb kapitol byl vyčerpán. Předpokládám radikální změnu (k lepšímu), nebo naopak rozpačitou uplácanou přístavbu (k horšímu).[BR]Doufám, že budeme příjemně překvapeni.\t\tKlikněte zde pro zvětšení...no nevím, myslím, že to ještě jde jednou nastavit, aniž by bylo třeba zavádět něco úplně nového... navíc, už dřív, když došly tříhvězdičkové jednotky jsem čekal, že přijde něco nového a oni prostě přidali čtvrtou hvězdu. Takže bych se ani nedivil, kdyby potom přišla čtvrtá řada surovin T10-12, ale postavená zase na starých známých. Akorát přibudou další dvě kolonky..."}, {"6": "To znamená \"rozpačitá uplácaná přístavba\"."}, {"5": "Někdo může vidět v přístavbě třeba krásnou zimní zahradu, když se povede [BR]Naopak rozpačité jsou pak některé novinky viz kotlík nebo sezona, i když zde je to spíše o zvyku..."}, {"242": "Ahoj všem, nevíte náhodou, kdy začne DSko na živých serverech? Pořád čekám, kdy začne a pořád nic...:-D"}, {"240": "Myslím že ve stvrtek jsem někde četl"}, {"5": "Dva dny předem přichází oznámanení, což by s nej pravdépodobností mělo být zítra v úterý..."}, {"18": "Zeptám se naše členka zmínila před chvílí něco jako \"HOBBY MÍSTNOST\" prý by měla být v dělnické chatrči. Neříká Vám to něco???"}, {"13": "WinterPhoenix napsal/a:\t\t\tZeptám se naše členka zmínila před chvílí něco jako \"HOBBY MÍSTNOST\" prý by měla být v dělnické chatrči. Neříká Vám to něco???\t\tKlikněte zde pro zvětšení...jde o reklamy...na pc jsou všechny 5 vteřin (sem tam 10-15 vteřin), ale v apce kupodivu celých 30 vteřin[BR][IMG]https://i.ibb.co/wYN9NF8/https-cz-forum-elvenar-com-index-php-attachments-sn-mek-obrazovky-2023-06-17-231312-png-6936.png[/IMG] [IMG]https://i.ibb.co/VSJcMxJ/https-cz-forum-elvenar-com-index-php-attachments-sn-mek-obrazovky-2023-06-17-231713-png-6938.png[/IMG][BR]vybereš si co chceš (zboží závisí na kapitole) a klikneš na \"zhlédnout\". Můžeš 4x stejné najednou nebo po pokaždém uplynutí doby něco jiného.[BR][IMG]https://i.ibb.co/10Cg2ZH/https-cz-forum-elvenar-com-index-php-attachments-sn-mek-obrazovky-2023-06-17-231747-png-6939.png[/IMG] [IMG]https://i.ibb.co/G7t1186/https-cz-forum-elvenar-com-index-php-attachments-sn-mek-obrazovky-2023-06-17-231848-png-6941.png[/IMG][BR]Stejně tak je možné za reklamu získat 3 VB každý den ve výzkumu. A kolem města 2x za den padne ikona filmového kotouče a upozornění, že se kolem města nachází poklad...co padne je čistě ruleta.[BR][IMG]https://i.ibb.co/28pVszb/https-cz-forum-elvenar-com-index-php-attachments-sn-mek-obrazovky-2023-06-17-231958-png-6942.png[/IMG]"}, {"213": "jo říká,že to mám ve městě.ale někteří hráči u nás vespolku ne což je divné"}, {"5": "...zatím jsem rovněž bez reklam "}, {"31": "Testujú to na (náhodne) vybranej skupine hráčov. Podľa výsledkov sa následne rozhodnú, či to spustia pre všetkých. Ja zatiaľ reklamy taktiež vo svojom meste nemám."}, {"21": "Tak doufám že k tomu nedojde nemám o to zájem, jen by mě to otravovalo"}, {"99": "Musím říct, že ač jsem se toho obávala, tak minimálně v aplikaci (PC moc nepoužívám, tak nemohu hodnotit) je to uděláno absolutně nenásilnou formou, takže se to dá úplně bez problémů odingnorovat "}, {"7": "Reklamy? Za mne OK !"}, {"20": "Reklamy mám ve městech na cz1, cz2 i na betě a je to v pohodě. Nijak to neruší a Hobby místnost u stavitelů občas použiju. Beru to od Inno jako logický krok, takže v pohodě. Dárečky jsou příjemné a z reklam padají někdy i dia. Množství je podle kapitol. Po skončené 20. kapitole mi občas přistane 20 dia za 5s. reklamy."}, {"13": "Když jsem o tom četla diskuze na beta serveru tak jsem se toho obávala, ale tahle forma je v pohodě - žádné vyskakovací okno s reklamou se nekoná. Běží mi to ve městě od 5.6. a je to nenásilné, neobtěžuje to, nemám s tím problém... když nechci nekliknu. Po pravdě jsem si docela zvykla každý den vybrat 3 VB a bonusy..."}, {"16": "@Angedev Až na ten detail, že tě furt otravuje ve městě hláška s pokladem. A nad dělnickou chatrčí je neustále ikonka, že máš navštívit reklamní záložku."}, {"6": "Byly asi dvě možnosti. Buď platit za přihlášení reálnými penězi nebo strpět minimální reklamu. Takže bych tam dal ještě možnost vypnutí reklamy za nějaký menší obnos, pro ty, co to nechtějí strpět."}, {"20": "Pokud vím, tak reklamy se dají vypnout v nastavení účtu: účet - nastavení osobních dat."}]