[{"16": "Ne, v nastavení nic není. Vypnutí v nastavení bylo diskutováno na beta fóru hráči.[BR]@Schoenfeld Já, než abych se díval na reklamy, tak Elvenar raději smažu. Zatím otravují jen ty hlášky, v okamžiku, kdy se reklamám nepůjde vyhnout, okamžitě skončím."}, {"31": "Reklamy sú súčasťou aj iných hier od Inno (skôr mám pocit že sme boli asi poslednou hrou, v ktorej ešte chýbali) a nikde sa doposiaľ nestalo, že by boli povinné. Rovnako tak na hráča reklamy samotné nijak nevyskakujú; má možnosť sa vždy sám rozhodnúť, či ju otvorí alebo nie. Takže v tomto by som dôvod na obavy asi naozaj nevidel."}, {"20": "Po zprávě od Inno z dubna 2023 https://newsroom.innogames.com/innogames-secures-future-viability-through-strategic-realignment, že propouští 75 zaměstnanců, se dalo čekat, že hledání nových zdrojů příjmu přijde. Reklamy ve hře jsou z hlediska Inno logický krok. Je evidentní, že platby od hráčů nejsou dostatečné. Já osobně kupuji dia jen výjimečně, tak občasné kliknutí na reklamu beru jako náhradu platby [smilie--sprite2]. Avízo na reklamu nijak neruší, ikonka nad chatrčí stavitelů je malá a nenápadná (občas ani samotnou chatrč nemůžu najít [smilie--sprite6]) . Pokud samovolně nikde nic nevyskakuje, tak za mě je to v pohodě."}, {"108": "Moje zkušenost s reklamou ve hře je v celku kladná.  Ve městech využívám hlavně reklamu z dělnické chatrče - Hobby místnost, kde díky ní navyšují hlavně Orky ze zbrojnice.. Jelikož mám v prohlížeči Opera vypnuté veškeré reklamy, tak se mi jen na 5-6 sekund zamlží hra a to je všechno. Zatím  nemám pocit, že by mě ve hře tento systém samo-volitelného kliknutí na reklamu nějak rušil."}, {"7": "A ěkteré reklamy jsou i hezké... [smilie--sprite11]"}, {"6": "A některé i nebezpečné. jako například tato podvodná firma (nabídka), kterou jsem už podruhé zachytil při rozbalení reklamy na hrací ploše:[BR][IMG]https://i.ibb.co/kBtFdP3/https-cz-forum-elvenar-com-index-php-attachments-1687243866662-png-6950.png[/IMG][BR]Neotvírat!!!"}, {"244": "Také jsem byla ráda, že ve hře reklamy nejsou. Na druhou stranu velice oceňuji, že když už musely přijít, jsou do hry zakomponovány vcelku elegantně. Nikde nevyskakují, což je asi úplně to nejdůležitější. Hráč si zkrátka sám zvolí, zda reklamu přehraje. Navíc jsou pod ikonkami, které ani nijak zvlášť nevyčnívají a nejsou \"nastražené\", aby na ně člověk stále omylem klikal. Za mě tedy v pohodě. Když už k tomuto kroku muselo dojít, zvládli to vývojáři do hry dostat velmi ohleduplně k nám hráčům. A ač jsem nemyslela, že bych reklamy nějak extra využívala, tak opak je pravdou, jelikož mi přináší spoustu příjemných výhod a odměn. Ta z okraje města mi už několikrát přinesla 7 dia. A navýšení produkce z chatrče, to je taky super. [smilie--sprite1]"}, {"31": "Na bete sa dnes začala najnovšia udalosť - Aqua Splendor.[BR][BR][IMG]https://i.ibb.co/qdpbjf4/https-i-ibb-co-f25-F5qm-EL-akcia-j-l-2023-banner-png.png[/IMG][BR]Udalosť prináša známu mechaniku s morskými koníkmi. Hlavnou odmenou je set, pre ktorého dokončenie je tentokrát nutné získať niektoré z jednotlivých častí opakovane (aby to bolo jednoduchšie, na miestach, na ktorých sa tieto časti objavujú, sú obvykle hneď poskytnuté vo vyššom množstve). Detaily tohto setu si môžete pozrieť tu (nezabudnite si najprv zvoliť udalosť Aqua Splendor z rozbalovacej ponuky udalostí). Denné úlohy spolu s odmenami sú ako vždy k nájdeniu na stránke Všetky udalosti."}, {"237": "Ahojky, lidičky kdo hráte na Betě novou událost Aqua Splendor, co znamená získej např.4 čarodějnické body? Díky"}, {"9": "[IMG]https://i.ibb.co/zZbXwFD/https-cz-forum-elvenar-com-index-php-attachments-sn-mek-obrazovky-2023-06-26-213712-jpg-6955.jpg[/IMG][BR]staci tam soupnout asi jedno darovani za ty suroviny nebo tak"}, {"237": "děkuji, zkusil jsem to a je to tak"}, {"245": "Jo to mně bavilo s těmi koníky pod vodou, těším se [smilie--sprite1] Díky iDavisi"}, {"6": "Waso napsal/a:\t\t\tA ěkteré reklamy jsou i hezké... [smilie--sprite11]Klikněte zde pro zvětšení...20. června jsem uvedl příklad reklamního průšvihu a koukám, že nikdo s tím nikdo nic neudělal.[BR] A dnes jsem to měl ve hře znovu:[BR][IMG]https://i.ibb.co/vv4r294/https-cz-forum-elvenar-com-index-php-attachments-1687889677255-png-6963.png[/IMG][BR]Je to podvodná firma (nabídka), která dokáže způsobit, že je z naivů vylákáno množství peněz a udělá z nich nešťastníky. Skutečně je nutné, aby nás někdo ve hře pokoušel takovými šmejdskými, ba kriminálními nabídkami?[BR]Jinak, Kraus s tím nemá nic společného. Jeho jméno a fotka jsou jenom zneužity.[BR]Jinak více k tomu třeba na: https://www.novinky.cz/clanek/inter...se-snazi-oskubat-pres-falesne-clanky-40428704[BR][BR]No a před chvílí hned znovu. Dnes podruhé a za sebou.[BR]Jestli mě ta podvodná reklama bude dál otravovat, tak se mi hra přestane líbit."}, {"16": "Co takhle neklikat na reklamy?"}, {"6": "O to přeci vůbec nejde.[BR]Zde jde o to, že tato hra nabízí podvodné reklamy!"}, {"21": "Nejen v této hře ale všude proto reklamy ignoruji"}, {"6": "Takže dnes znovu jeden podvodný Kraus.[BR]Co tedy tento Pseudokraus prostřednictvím Pseudonovinek nabízí?[BR]Nic jiného než Bitcoin Era. Co je to za flignu, se můžete dočíst na:[BR]\t\t\thttps://opcebinarni.cz/bitcoin-era-recenze\t\tS @indian068 vřele sympatizuji, snažím se také reklamám vyhýbat. Ale pokud je to možnost, jak podpořit tuto hru, tak mi tolik nevadí.[BR]Pokud mi tedy někdo dokolečka pořád necpe jednu a tu samou podvodnou."}, {"1": "Než si stěžovat na fóru, kde s tím opravdu nic neuděláme. Bylo by lepší napsat tyto informace na herní podporu a nejlépe i s obrázky těchto reklam. [smilie--sprite2]"}, {"6": "No, já myslel, že názory tu napsané bude třeba zajímat herní podporu an sich, ale budiž - udělám to, až na to budu mít chvilku volna."}, {"1": "Jakékoliv problémy ve hře řeší Herní podpora. Prosím, obracejte se na ni přímo. To platí i v případě podvodných reklam. Určitě je hlaste Herní podpoře.[BR][BR]Fórum slouží pouze jako diskuzní platforma. [smilie--sprite2]"}]