[{"6": "Po nahlášení s tím asi vrchnost něco provedla. Už mi toho Pseudokrause reklama nenabízí.[BR]Jestli je to tak, dík."}, {"9": "postavit ci nepostavit pristi set? trosku jsem si hrala a zkusila poskladat 2 verze, ale moznosti bude spousta jak slozit[IMG]https://i.ibb.co/920zP0B/https-cz-forum-elvenar-com-index-php-attachments-voda23-jpg-6970.jpg[/IMG]"}, {"2": "Fandím tvojí kreativitě, ale trochu mi nesedí počty.[BR]Sám jsem si to zkoušel spočítat a počty nesedí.[BR]Budu se počítat mezi štastné a získám z eventu všechny budovy.[BR]K té horizontální možnosti přidám ješět druhou řadu 1x2 + 2ks 1x1.[BR]Ale tu vertikální?[BR]Jak to chceš poskládat?"}, {"9": "@GorGlin pocty nemusi sedet male budovy jsou k ziskani i mezi denima odmenama takze zalezi jak nasbiras[BR]jinak u malych jsou 3 bonusovky a u velkych budov 4 takze snad by to melo odpovidat, jen me zaujalo ta sirsi moznost dneska jsem na bete neco odklikala a mam jak manove male tak ty orkove[BR]ta vertikalni je proste uspornejsi pokud nechces placat pak moc rekonstrukci a presto o to stojis taky je moznost i nakou velkou vynechat nebo malou proste moznosti je dost jen ty 1x2 mi prijdou nejmene uzitecne - semeno[BR]na prezentacnim obrazku to maji poskladane svisle a maji tam prave dost tech barier[BR][BR]ale musim uznat ze mas pravdu s tim podelnym prvni velka budova ma jen 3 bonusy to by se dalo upravit jakymsi vycnelkem, a tim eliminovat plochu u cesty[BR][IMG]https://i.ibb.co/0f3Zngb/https-cz-forum-elvenar-com-index-php-attachments-2voda23-jpg-6972.jpg[/IMG]"}, {"2": "Máš pravdu, třeba budu mít kliku."}, {"84": "Ted mi přišlo oznámení, že se blíží nová kapitola - ne betě zatím nic?"}, {"9": "taky jsem na to koukala ale na bete zatim nic, tak snad s pristi aktualizaci"}, {"2": "@karhol [BR]Kam ti co přišlo?"}, {"14": "@GorGlin[BR][BR][IMG]https://i.ibb.co/YQk05V9/https-cz-forum-elvenar-com-index-php-attachments-1689140480798-png-6978.png[/IMG]"}, {"84": "@GorGlin: přesně to co poslal @asviik"}, {"2": "Jo, jo, už to na mě taky vyskočilo.[BR]Na FB je podobný výkřik už asi týden.[BR]S ohledem na to co se děje na betě, nic, jsem to nebral moc vážně.[BR]Tahle předpověď je jak od Nostradama, takže informační hodnota nula.[BR]Odchod známé postavy může znamenat dnešní konec eventu stejně jako cokoli jiného co Inno prohlásí za ten pravý odchod známé postavy."}, {"16": "Pochybuji, že by to dali dříve než dořeší přechody na nový výzkumný strom a ty ještě, pokud vím, dořešeny nejsou."}, {"6": "No loni to začalo skákat v půli srpna a v září už bylo vymalováno. Ovšem, jak píše @Lovec Krys, ten přechod může být řádný oříšek. [BR]Ale potom proč to hlásí dlouho dopředu?"}, {"3": "asi už stížnosti na to, že není kapitola, překročily únosnou mez, takže tohle je takový malý cukříček, aby lidi dali měsíc pokoj "}, {"16": "@Emhyr var Emreis II Jakože nám dají oznámení a všichni budou čekat, že kapitolu dají tak za týden a pak budeme zase 2 měsíce čekat? No nedivil bych se."}, {"240": "Ahoj.Indicie naznačuje příchod nový kapitoly při odchodu postavy kterou známe -Mořský koník -takže hypoteticky po skončení nadcházející události"}, {"2": "@sir89[BR]Teď od nás odešel zahradní hoblin, co tě vede k myšlence že ono prohlášení se tyka koníka.[BR]To by tam napsali až odejde koník, ne?"}, {"31": "Nejedná sa o koníka ani goblina, ale kapitána Bonkers, ktorý nám je známy zo 17. kapitoly a bude hlavným aktérom začiatku príbehu novej kapitoly. "}, {"6": "Nevím, jestli goblin nebo koník v tom hrají nějakou roli, ale za 11 měsíců už mohli vývojáři něco stihnout. Jde o to, co to bude."}, {"2": "@iDavis [BR]Takže kapitola začne potom, co odejde Bonkers, to je ten s kachnou na rameni?[BR]Ten tu není a nemáme zprávu o tom že by měl přijít.[BR]Tedy nevíme nic.[BR]Tak?"}]