[{"31": "No áno, ten popis v novinkách nemal byť nápovedou k tomu kedy kapitola príde, ale len načatím príbehu, ktorý bude obsahovať. Čiže áno, dátum z toho nevieme."}, {"3": "sir89 napsal/a:\t\t\tAhoj.Indicie naznačuje příchod nový kapitoly při odchodu postavy kterou známe -Mořský koník -takže hypoteticky po skončení nadcházející události\t\tKlikněte zde pro zvětšení...Podle mě pak bude ještě minimálně DSko"}, {"2": "Na betě končí koník za dva dny a za cca měsíc na živých serverech.[BR]To by byl fofr."}, {"6": "@GorGlin včera napsal, že \"nevíme nic\".[BR]Většina jazyků mimo češtinu nedokáže hromadit zápory tak nápaditě právě jako čeština.[BR]Takže \"nevíme nic\" by přeložili jako \"víme nic\".[BR]Když tedy \"víme nic\", při použití menšího cimrmanovského oslího můstku, tudíž víme alespoň \"něco\".[BR]I když to \"něco\" je vlatně \"nic\".[BR]Potom lepší a výstižnější by bylo to, že \"víme naprostý prd\".[BR]A ať si to přeloží, kdo chce, jak chce, já si du dát frťana, neboť mi z toho horka asi už totálně přeskočilo."}, {"7": "Kolik frťanů je denní spotřeba?"}, {"6": "To záleží na tom, co mám po ruce, nebo kam se v jednom nebo druhém sklepě dostanu. Případně, jestli zrovna nedělám revizi zásob. Ale tu si nechávám na zimu."}, {"5": "...a není to málo Antone Pavloviči?"}, {"6": "@ElfNostradamus ?"}, {"5": "...modří již vědí...[BR]Každopádně je to Cimrmanovská hláška ..."}, {"21": "ElfNostradamus napsal/a:\t\t\tAntone Pavloviči?\t\tKlikněte zde pro zvětšení...Spíš rudej jak modrej podle jména"}, {"5": "...respektuji indiánskou menšinu - rudochy...[BR]Kazdopadně poučím: jsou to dvě hlášky nezávislé na sobě ...Google napoví - viditelně již internet dorazil i do ,, tý pí ,,  "}, {"21": "ElfNostradamus napsal/a:\t\t\tKazdopadně poučím: jsou to dvě hlášky nezávislé na sobě ...Google napoví\t\tKlikněte zde pro zvětšení...Strýčka googla moc nepoužívám nejsu naštěstí naněm zavyslej"}, {"2": "[BR]Jestli nepomůže tohle tak už to asi nemá cenu."}, {"21": "Pokud je to narážka na mě tak tento typ zábavy mě nezajímá"}, {"6": "Jsou citace, které něco osvětlí, jiné spíše matou, a jsou i takové, které vedou k urážkám.[BR]Vyše uvedená naplnila dvě vyjmenované funkce. Hádejte, které?"}, {"21": "To nevím ale rozhodně nebudu ztrácet zbytečně čas ani sem se na to nedíval"}, {"5": "[BR]\t\t\thttps://radiozurnal.rozhlas.cz/vzpomenete-si-odkud-pochazi-hlaska-modri-uz-vedi-6233679\t\t[BR]Když nic může být něco tudíž toho bude málo...je to z cimrmanovskych hlášek takže kdo je zná ...tak může být aktuálně i modrý což je spíše vtip než hláška, pokud je v tom nějaký rozdíl nikoliv ovšev rudý ...rudoši byli ve slangu vždy indiáni...zdali v tom někdo vidí jiné asociace je to pouze jeho osobní vize...hezký večer"}, {"21": "Tvůj pohled na věc akorát že rudí nebyly indiáni ti byly nazyvani rudokozci"}, {"7": "Zejména v běžné mluvě se velmi dbalo, aby \"rudokožci\" byli vyslovováni řádně a srozumitelně!"}, {"6": "Také lze rozvíjet téma Komančové x komančové. [BR]Jen si nejsem jistý, zda je to k věci."}]