[{"20": "Takže zpět k tématu tohoto fora. Na betě 20.7.2023 začne nové kolo DS, drobné změny (pivo za 25 ks):[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/new-round-of-fellowship-adventures.18856/\t\t"}, {"9": "ano stale nevi jestli je lepsi 50 a nebo jen 25 protoze to uz taky bylo, tak snad zustanou u 25"}, {"6": "Pivo za 50 je zvěrstvo, bohužel je už i za víc."}, {"16": "Jak to bylo je naprosto jasné.[BR]1 Pivo za 50[BR]2 Pivo za 25 + zvýšení odznaků[BR]3 Někdo něco zkazil a pivo se vrátilo na 50 se zvýšeným množstvím odznaků[BR]4 Pivo se vrátilo na 25, ale zase se mají mírně zvýšit odznaky (v podstatě někdo napravil chybu ze 3, aniž by přiznal, že v bodě 3 došlo k chybě)"}, {"9": "jo jo to jsem si i myslela uz kdyz bylo tech 50 po 25 jen jsem zvedava kdy dokonci ty migrace aby me ze 3 kapitoly nedali na 5 tesne pred ds - ale delat ten vyzkum sama neplanuju, pockam si"}, {"7": "Schoenfeld napsal/a:\t\t\tPivo za 50 je zvěrstvo, bohužel je už i za víc.\t\tKlikněte zde pro zvětšení...Pivo pod padesát jest boží zázrak !!!"}, {"90": "Pro nás je nejzajímavější, že mezi odměnami bude jeden artefakt Panství dračího srdce. Takže ti co dali na mojí radu nedokupovat artefakty mě nebudou nadávat [smilie--sprite1]"}, {"3": "Waso napsal/a:\t\t\tPivo pod padesát jest boží zázrak !!!\t\tKlikněte zde pro zvětšení...U nas je v létě akce radek za 29 [smilie--sprite1]"}, {"2": "Na betaforu je ohlášen zacatek kapitoly 21 na čtvrtek 20. Července."}, {"11": "\t\t\thttps://de.forum.elvenar.com/index.php?threads/neues-vom-beta-server-achtung-spoiler.827/post-452469\t\t"}, {"16": "A v normálním jazyce:[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/chapter-21-the-vallorian-legend.18866/#post-116133\t\t"}, {"11": "už někdo zjistil jestli v nové kapitole dostanou některé divy další level ?"}, {"20": "Zatím to nevypadá."}, {"2": "Taky bych řekl že ne."}, {"2": "A protože už je rasa na betě.[BR][BR]Spoluhráč z bety našel pěknou stránku kde je asi všechno co o nové kapitole potřebujete vědět.[BR][BR]\t\t\t\t\t\tCapitolo XXI La Leggenda Valloriana\t\t\t\t\tFan-Blog dei Cavalieri dello Zombiaco, dedicato al gioco Elvenar.  In nessuno modo collegato ad InnoGames Gmbh, proprietaria delle immagini.\t\t\t\t\tcavalieridellozombiaco.blogspot.com\t\t\t\t[BR]Dá se říct, že je to klasika na kterou jsme už zvyklý.[BR]5 rozšíření, 3 vypelšené jendotky, zvedají se všechny budovy a tak...[BR]Včetně toho že Inno dál utahuje šrouby.[BR]Portálové bonusy vám ušetří peníze, přestavba města musí začít hned kvůli prosperitě, město nepůjde moc vybourat, protože jinak nebude možné postavit dost rasových budov.[BR]A jako třešnička na dortě, nové překvapení od Inna, nejen portál, ale všechny budovy rasové produkce se budou zvětšovat.."}, {"20": "@GorGlin díky za odkaz, fajn, že jsou tam všechny velikosti budov. Vzhled budov byl dávno i na jiných webech, ale přesná velikost ne. Takže dobrý, můžu plánovat město [smilie--sprite2]. Je jasné, že další kapitola přijde asi za cca rok, takže se Inno snaží trochu zbrzdit hráče, co mají kapitolu hotovou za měsíc a pak se zlobí, že nemají co dělat. Grafika je opět moc pěkná, draci jsou fajn. Nové divy mě zatím moc neoslovily, ale možná změním názor."}, {"9": "@Ludi ty jo uz delas planek to jsi rychlik ale taky jsem na to nakoukla a vlastne tuhle jsem si taky delala predbezny planek na pristi kaspitolu a pak to mam stejne jinak kolikrat jenze ty kapitoly se tahnou - nevim co je vetsi nuda jestli nedelat kapitolu a nebo delat a cekat az se vse vyrobi"}, {"20": "@Elvinka12 já to tak dělám před každou kapitolou. Rámcový plánek už mám, nějaké menší změny vždycky přijdou, ale základ už je. Nikdy jsem nevyklízela celé město a vše vylepšuji pokaždé už v průběhu kapitoly. Ale postavení výroby osadníků ještě neřeším."}, {"6": "@GorGlin Dík za link. Zcela v souladu s @Ludi se začínám připravovat. Plánek je pro mne nezbytností, páč si v něm procvičuji a stanovuji optimální postup. Stačí na to jednoduchá úprava v tabulkovém procesoru."}, {"9": "@Ludi ja nemam vyklizene mesto jen proste tolik obytek nepotrebuju, jediny kdy jsem radikalne stehovala i do - obyvatel byly lode jinak ted si vystacim a planky si delam asi od orku kazdou kapitolu"}]