[{"6": "Hlavní neznámou je optimální počet dvojích dílen. To je zřejmě určující pro zajištění volné městské plochy."}, {"2": "Otázka je i to, kolik si budu moci dovolit.[BR]Komunitní práce chodí po stovkách a spotřebovává taky po stovkách.[BR]Takže by mohlo stačit přehodit výrobu na třeba třech, nebo pěti.[BR]Ale prosperita.[BR]Sídlo dá 300, kasárna 170, dílna 120, obytka 54.[BR]Samotná Vallorianská dračí věž sebere 600, Vallorianská dílna 8, Orčí dílna 5.[BR]Kolik bude spotřeba při vylepšování a jak bude fungovat ten jejich bonus, to teď nevíme.[BR]Ale v mém městě schrastím cca 1000 prosperity jako základ.[BR]To by mohlo pro začátek stačit.[BR]A aby výroba nestála, tak potřebuji orčí dílny, které uživí vallorianské i portál a vallorianské co uživí portál.[BR]Plus něco do zásoby, protože výskum žere i meziprodukty.[BR]Základ je věž a 2x 4 dílny.[BR]Když se podívám kdo co staví, tak nejpokročilejší hráči mají 6 Vallorianů a 8 orků.[BR]Takže to já beru jako cíl.[BR]Odpovídá mým předpokladům, základ postavit to zvládnu.[BR]Jak to bude s vylepšováním se pak ukáže.[BR][BR]Horší je, že tyhle propočty budou fungovat jen v případě že člověk leze na hru co hodinu."}, {"6": "To by snad mělo jít v poho. Honit se jako s Unurem rozhodně nebudu. Času je dost.[BR]Odhaduju to tak maximálně na 3-4 měsíce v poklidném tempu. Do Vánoc času dost."}, {"5": "Výzkum: Strom[BR]Provincií nutno otevřených: 640[BR][IMG]https://i.ibb.co/GTmqtwQ/https-cz-forum-elvenar-com-index-php-attachments-xxi-a-png-7002.png[/IMG]"}, {"2": "Ale bonusové rozšíření je až za 660.[BR]myslím"}, {"2": "úkoly jsou na 9 kusů od každé dílny"}, {"5": "+ spočítáno čistě okna výzkumu co budou stát: kromě kladiv /dost/ , mincí, něco orků tak:[BR]semínka 440 K, urunium 1030 K, mana 32 Mega ...+ dále to bude asi od třetiny i sžírat výrobu osadnickou[BR]- je to opravdu pouze na okna výzkumu samotná výroba osadníků bude brát další a další surky..."}, {"6": "@iDavis už má výzkum spočítaný. Nebude to žádná trága."}, {"9": "presne tak par odkazu uz pristalo v beta diskuzi zde na cz tak ani nechapu na co dalsi zalozene tema kdyz se to tyka zrovna bety[BR][BR]soucet surovin k cemu? prece nikdo neudela kapitolu za tyden ... nebo jo? nevim soucet by me asi v nicem nepomohl spis info kolik ceho postavit v kolika obytkach jet kumunitni vyrobu a tak .. ale nez k tomu dojdu uz bude zkusenosti hafo od prukopniku[BR]jedine co je jeste v nedostatku je beta wiki cekala bych ze to tam hodi s novou kapitolou ale otaleji"}, {"2": "beta wiki není, je to jen angličtinářská wiki[BR]a při minué, nebo předminulé rase to česká wiki měla dřív než anglická"}, {"9": "@GorGlin tak vidis toho jsem si ani nevsimla ze odkaz na bete neni na beta wiki ale jen na anglickou kdyz kliknu odkaz na forum jsem na beta foru, tak dik za info[BR]a ze tady byva wiki nachystana vcas tedy s nouvou a nebo pred novou kapitolou vim"}, {"11": "tak, ke každý kapitole bývalo založeno vlákno. Až se kapitola rozjede tady, tak se příspěvky budou psát sem."}, {"5": "voyager-1 napsal/a:\t\t\ttak, ke každý kapitole bývalo založeno vlákno. Až se kapitola rozjede tady, tak se příspěvky budou psát sem.\t\tKlikněte zde pro zvětšení......byl jsem na dovolené [smilie--sprite1] ...diskusní vlákno jsem nedohledal ...v oznámení o budoucím příchodu nové kapitoly není odkaz na diskusní vlákno, jak bývá zvykem, tak jsem založil toto i vzhledem k tomu, že jiná obecná vlákna jsou ,, přetížena,, s horší orientací na konkrétní kapitolu, a pokud tedy i časem přijde ofiko vlákno, tak už dost informací je v oběhu a s postupem času Bety budou přibývat, tak snad to nebude tolik vadit, že to zatím shromáždíme zde [smilie--sprite1][BR]... vlákno založeno s dobrým úmyslem"}, {"6": "No hlavně, že se někde shromáždíme a vlákno bude živé - neustále v hlavní nabídce."}, {"20": "Jak psal @voyager-1, diskusní vlákno ke kapitole je založeno moderátory fóra, až když je nová kapitola spuštěna na live serverech.[BR]V době testování na betě patří příspěvky sem. Stále je to testovací období a tak jsou možné i nějaké drobné změny, které vývojáři udělají. Zakložit vlákno k 21. kapitole nyní, je předčasné, a může to v budoucnu dělat zmatky.[BR][BR]Zatím nejlepší info o nové kapitole sem dal GorGlin. A vzniká, jako vždy,  skvělé info u iDavise.[BR]GorGlin napsal/a:\t\t\tA protože už je rasa na betě.[BR][BR]Spoluhráč z bety našel pěknou stránku kde je asi všechno co o nové kapitole potřebujete vědět.[BR][BR]\t\t\t\t\t\tCapitolo XXI La Leggenda Valloriana\t\t\t\t\tFan-Blog dei Cavalieri dello Zombiaco, dedicato al gioco Elvenar.  In nessuno modo collegato ad InnoGames Gmbh, proprietaria delle immagini.\t\t\t\t\tcavalieridellozombiaco.blogspot.com\t\t\t\t[BR]Dá se říct, že je to klasika na kterou jsme už zvyklý.[BR]5 rozšíření, 3 vypelšené jendotky, zvedají se všechny budovy a tak...[BR]Včetně toho že Inno dál utahuje šrouby.[BR]Portálové bonusy vám ušetří peníze, přestavba města musí začít hned kvůli prosperitě, město nepůjde moc vybourat, protože jinak nebude možné postavit dost rasových budov.[BR]A jako třešnička na dortě, nové překvapení od Inna, nejen portál, ale všechny budovy rasové produkce se budou zvětšovat..\t\tKlikněte zde pro zvětšení..."}, {"1": "Ano, @Ludi to vystihla naprosto přesně. [BR]Ludi napsal/a:\t\t\tZakložit vlákno k 21. kapitole nyní, je předčasné, a může to v budoucnu dělat zmatky.\t\tKlikněte zde pro zvětšení... Jakmile bude nová rasa na live serverech, tak vlákno určitě založíme.  [smilie--sprite1] [smilie--sprite2]"}, {"20": "Dnes už jsou na ElvenArchitect k dispozici velikosti všech budov 21. kapitoly. Pokud si načtete vlastní město, tak jen přepněte do režimu \"beta\" a už tam můžete sázet domečky i osadnickou výrobu."}, {"5": "Vlákno založeno s dobrým úmyslem, informace se často prolínají i opakují mezi vlákny i servery... výše zmíněné příspěvky jsou již zapadané v jiné obecné diskusi...zde to prostě bylo pod jednou střechou aktuálně....každopádně v klidu plynule můžeme přejít na ofiko vlákno moderátorů až bude, věřím, že mají dostupné možnosti k přesunu, přepisu a opravám [smilie--sprite1]...jak už se tedy již i stalo [smilie--sprite1]"}, {"6": "No jo, no. Hlavně si nepokecat kedsky a vydržať."}, {"5": "Nové ,,suroviny - herní mechanismy,, v nové kapitole - Komunitní práce a prosperita:[BR]podrobnosti a obrázky - hezky popsáno zde:[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/chapter-21-the-vallorian-legend.18867/page-2#post-116802\t\t"}]