[{"6": "Doporučuji studovat průběžně odkaz od @ElfNostradamus.[BR]Zajímavý je tam popsaný problém s komunitní prací. [BR]Mně ale vychází, že se v podstatě vůbec nic nestane, když ji budu maximálně produkovat podle aktuální potřeby v panelácích. V současnosti dávají ručičky 300K mincí za klik. A v 21. kapitole to bude zase o něco více. Mám k dispozici cca 700 provincií, které mi dají více, než kolik pojme sklad. Tudíž je to dostatečná denní rezerva pro nenadálé události i s ohledem na skladová požehnání (déšť mincí). [BR]Pokud někdo nemá panickou hrůzu z klikání..."}, {"20": "@Schoenfeld ten odkaz je dobrý, ale v podstatě už nic převratného. Dobrá je připomínka používat na komunitní práci Hobby místnost, jenže tuhle možnost ještě všichni hráči nemají. Já ano, takže to využiji. Samozřejmě také spotřeba mincí úměrně vzroste, jako v každé kapitole. Ale to není nic, s čím bychom si nedovedli poradit. Jedna věc je komunitní práce, ale je třeba brát ohled i na úroveň produktivity, tedy najít potřebný balanc. Jak jsem se dívala do měst na betě, která už jsou o něco dál, tak by ta kapitola neměla být tak těžká."}, {"31": "Len pre info - ak máte nedostatok surovín do výroby a záujem o nové divy, odporúčam vám pripraviť si nejaké zásoby, keďže stavba a vylepšovanie divov 21. kapitoly ich budú vyžadovať:[BR][BR][BR][BR]Efekty nových divov si môžete pozrieť tu. Ďalší obsah ku kapitole zatiaľ chýba a pracujem na ňom, avšak už teraz tam nájdete kompletný prehľad úloh a prehľad požiadaviek na výskum.[BR][BR]Na stavbu oboch divov sú potrebné úlomky kouzel, spojovací činidlá a královské rekonstrukce. Každý ďalší level vyžaduje o 2000 úlomkov kouzel a 2 spojovacie činidlá viac. Královské rekonstrukce sú následne potrebné iba každý 5. level, kde sa zvyšujú po 10."}, {"2": "@iDavis [BR]Takže pokud správně počítám, tak vystavět jeden div vyjde na 260 královských rekonstrukcí?[BR]No, to hodně podražili.[BR][BR]A prosím tě, v úkolech, úkol 74., 10 dílen lvl 47.[BR]Myslíš že to tak opravdu bude?[BR][BR]Právě jsem si v řemeslné zadal výrobu Heavy Melee Shirne.[BR]Pro mě je to první za celou dobu existence řemeslné.[BR]Už jste někdy tenhle barák měli v nabídce?"}, {"90": "Asi nové. Podle webu elvenarchitect.com:[BR]Heavy Melee Shrine​Grants 75% more Attack value for all of your Heavy Melee Units. Bonus can be stacked. Expires after 5 days.[BR]Takže pomocná expirující  budova 2x2 do turnajů a věže . Prakticky stejný efekt pro všechny kapitoly (maličko zvyšující se kultura)."}, {"11": "posílení těžkooděnců, nová budova to není, objevuje se už delší dobu v různých odměnách, svazcích, pro platící je i v sezoně. Pokud se konečně nabízí v akademii tak to je dobře. Ještě by se mohlo nabízet posílení obrněných střelců a lehkooděnců, pro ty stromečky platí to samé."}, {"31": "Áno, pridali nové recepty pre všetky zvyšné posilňujúce budovy (Památník lehkooděnců, Svatyně těžkooděnců a Posílení obrněných střelců). U mňa je zatiaľ otázkou či je to naozaj taká pozitívna zmena, pretože lukostrelcov a mágov som vždy využíval najviac zo všetkých a pridaním týchto nových budov do rotácie receptov sa znižuje šanca, že sa objaví recept na niektorú z tých pôvodných. Je ale možné že spravili aj ďalšie zmeny, ktorými redukovali niektoré zo starších kultúrnych budov, čím by tento problém čiastočne vybalansovali.[BR][BR]@GorGlin vďaka za upozornenie, naozaj je toto zadanie trochu odlišné. Podľa aktuálnych informácií by malo byť potreba 10 obytných budov na leveli 47, 4 dielne na leveli 47 (kouzelné dielne v kapitole 21 sa rátajú dvakrát) a 50 výpomocí. Text som opravil (môže chvíľu trvať, kým sa zmena prejaví).[BR][BR]A zároveň bolo zverejnené oficiálne video, ktoré k novej kapitole vysvetľuje jednotlivé mechaniky a nové funkcie."}, {"2": "Já z přidání nových stromků mám také smíšené pocity.[BR]Obávám se že to bude znamenat snížení výskytu těch dosavadních.[BR]A to vidím jako problém pro menší města a hráče co je nebaví dumat nad turnajem."}, {"3": "vidím to úplně stejně. I když, domečky pro těžké střelce se v některých turnajích rozhodně šiknou..."}, {"16": "Kdyby jenom stromečky, dle beta fora tam přidali další zbytečnosti (a ještě zdražili některé recepty)."}, {"3": "to proto, abys chtěl nový div a zkrácení doby výroby "}, {"8": "zkraceni doby vyroby v tom ale nepomuze  kdyby to bylo i zkraceni  \"obnovy\" to uz by bylo lepsi "}, {"5": "Doping - stromek pro Obrněné střelce beru jako velké pozitivum, ty používám na některé turnaje, možná i více než mágy.... určitě se dají občas použít i těžkooděnci....lehkooděnci vyjímečně na některé střety občas i něco ve věži, ale na celý turnaj?....to by museli být nadopovaní např masivně kerberosové, pak by se dal časem umlátit i některý z turnajů....což se při dlouhodobém střádání můze i povést, ale dominance šípů-střelců přetrvává hlavně díky jejich aktivitě.[BR][BR]Z Beta diskuse: cituji[BR]I seriously pity anybody coming to Ch21 straight from Ch20 without the gap between chapters which many of us have had and which gave us time to work on our stocks of necessary resources.[BR]Vážně lituji každého, kdo přichází na Ch21 přímo z Ch20 bez mezery mezi kapitolami, kterou mnozí z nás měli a která nám dala čas pracovat na našich zásobách nezbytných zdrojů....[BR]Zahulíme /někomu stačí příprava bez hulení  / a uvidíme ... "}, {"6": "Je tu ale otázka, na jak dlouho nám ty zásoby vydrží."}, {"2": "Já kulturní budovy v řemeslné nevyrábím a jejich ceny si nehlídám,[BR]ale ted tam mám  Royal jelly 1x1 kulturku za 5 lepidel a 300 úlomků.[BR]A za výrobu 2 čmoudy.[BR]To jsou ty budovy tak drahé?"}, {"5": "Z Kultury se tam vyplatí Lávový kodex na pole v TOp budovách a třeba i Duhová květinová klec ta spíše kvůli obyvatelstvu a své praktické velikosti 1x1...."}, {"16": "Emhyr var Emreis II napsal/a:\t\t\tto proto, abys chtěl nový div a zkrácení doby výroby Klikněte zde pro zvětšení...Ten chci i tak (ten druhý ne). Ale problémem bude snížení šance na stávající stromečky po přidání nových receptů."}, {"6": "Jestli upadnou stromečky, tak tu nebude v bojích co řešit. A začne se nakupovat a smlouvat ve velkém."}, {"9": "taky uz jsem narazila na nove pomocniky me to prijde v poradku, prisli mi do vyroby lehkoodenci 75% davaji a mohlo to byt jen skvele zpestreni hry, ale kdyz mi potom do vyroby prislo pole amarylek tak nadseni znacne pokleslo, ze pridali i hromadu bordelu[BR]ted jen zalezi na sancich kdy se co muze objevit kazdopadne ted bych nechtela cekat na nakou zakladnu protoze uz to muze byt na hodne dlouhe lokte"}, {"16": "@Schoenfeld Pouze do určité míry. Vyšší provincie jsou prostě nevykoupitelné ani kdyby sis zapráskal město manufakturami. Takže spíše pokles výsledků v důsledku nižší kapacity výroby stromků."}]