[{"8": "ten novy div urychlujici vyrobu v akademii.. jenda se o vyrobu kouzel nebo remeslnou vyrobu? ve videu co jsem tak zbezne projel jsem zslechnul neco o urychleni vyrobe kouzel -> naprd"}, {"2": "Podle mě to je urychlení výroby v řemeslné"}, {"9": "no nejdrive jsem si myslela ze to bude vyroba pozehnani, ale vypada to spis na vyrobu kouzel, jak v popisku tak v akademii zalozka jmenem produkce, i tak bych ten div nezavrhovala[BR]urcite to neni takovy div ktery by chtel kazdy[BR]nakonec minulou kapitolu byly takovy divy co se hodi asi kazdemu, tak ted to bude hodi se ti to tak to postav a kdyz ne tak nestav ikdyz to plati vlastne porad"}, {"11": "já si myslel, že jde o urychlení výroby kouzel v akademii, no řemeslná by byla zajímavější."}, {"9": "to nejspis ano i tak vetsina z nas porad zadava do vyroby, nakonec relikvii mame dost takze nadprodukce kouzel neni na zavadu[BR]daji se vyuzit na kde co a kdyz je nouze nejvyssi tak rozlozit na ulomky"}, {"16": "Má to snižovat čas výroby kouzel (až o 65%).[BR]Mi osobně se to hodí, poslední dobou zápasím s nedostatkem činidel (24/7 činidla + 4 knihovny + 1 evo na činidla mi jaksi přestávají stačit (ano, v inventáři mám dalších 5 knihoven a nějaké ty sety, ale není místo na ně)).[BR]Ideální stav by pro mne byl, kdyby po postavení a vylepšení divu jsem mohl odteleportovat i ty knihovny (a postavit místo nich nějakou tu zbrojnici na body navíc)."}, {"2": "Tak to je velké zklamání pro mě.[BR]Urychlení kouzel je mi úplne na nic"}, {"5": "Vítám i urychlení výroby kouzel...činidla dobře doplnuje div Dračí archa"}, {"9": "[BR]tak toto me dostalo poradne[BR]za rekonstrukce? chapu ze nekteri jich maji haldu, ale tohle je vylozene vyhazovani oknem"}, {"18": "@Elvinka12 někdo se asi sakra hóóódně uhodil do hlavičky"}, {"6": "Sázet na lidskou hloupost je ale jinak také velmi jistá sázka."}, {"2": "Z řemeslné je minové pole, musíme si dávat sakra pozor na co klikáme."}, {"9": "to jako sakra davat bacha"}, {"6": "Řemeslná  byla odjakživa záludná, takže mne tam už nic nepřekvapí."}, {"22": "Už jsem se jednou napálila a zjistila jsem, že plánky nejdou vrátit  Ostatní výroba jde stornovat a všechno ti to vrátí, ale plánky ne "}, {"9": "[BR]kdyz nevite co artefaktama vyrabejte z nich jidlo no za medvedi bych to asi fakt nedelala, vyroba na bete je ted same prekvapko[BR]ikdyz me prisel ten recpt na jedno za 1650 ulomku lepsi"}, {"236": "Tak jen dávat pozor - jinak krásná stromečková budova, VB a urychlovač - určitě si je z čeho vybrat (ani bych nevěděl co dřív ."}, {"4": "7.9.2023 začíná na betě nový event - bohužel zase to slučování na desce do 6 ti úrovní."}, {"3": "Škoda. Myslel jsem, že další už bude temný les"}, {"8": "asi tak.. druhy ohnivak jako odmena tam nebude. asi jedina vec co by me motivovala tenhle typ eventu hrat."}]