[{"31": "Hlavná budova toho eventu je ale celkom zaujímavá. Je to jedna z budov s najvyššou produkciou many v prepočte na pole, plus poskytuje aj unurium, VB a 10 minútový zesilovač.[BR][BR]Hmlistý les bude nasledovať po nej."}, {"213": "já se na event těším i na skládačku Vše co můžu dostat ve hře navíc se hodí A jak popisuje iDavis tu budovu tak to nevypadá zle No uvidíme uvidíme"}, {"8": "@iDavis  neee tak tohle jsem nechtel cist ( tohle je tak neprijemnej typ eventu tak snad poskladm aspon zaklad."}, {"6": "Fujtajbl, slučování je jako jíst od rána do večera ohřívané zavináče s marmeládou."}, {"16": "Kvíz, kdo si všimne, co je jinak?:[BR]"}, {"240": " 4x6 hrací pole.To je mazec naklikat par věci a o5 spojit Asi chyba v matrixu pro navrhování plánu"}, {"31": "Pri tejto veľkosti hracej plochy aspoň dáva kôš na vyhodenie predmetov nejaký zmysel (a čiastočne to aj pridáva stratégiu tejto hernej mechanike)."}, {"16": "iDavis napsal/a:\t\t\tPri tejto veľkosti hracej plochy aspoň dáva kôš na vyhodenie predmetov nejaký zmysel (a čiastočne to aj pridáva stratégiu tejto hernej mechanike).\t\tKlikněte zde pro zvětšení...Při této velikosti se jen bude plýtvat vyhazováním do koše (a bude ještě méně odměn).[BR]V překladu ...(jak to říci bez spousty sprostých slov)...pokud to nevrátí do původní velikosti, tak událost prostě hrát nebudu.[BR]Masový bojkot události by jim mohl napovědět, že takhle ne."}, {"4": "Prosím, co to znamená vyhazovat do koše?"}, {"31": "@Lovec Krys nerozumiem, prečo by to s novou veľkosťou malo byť také zložité. Veď ak potrebujem na trpasličiu zákazku 3 predmety, tak najprv skombinujem jeden (pripravím si naň predmety nižšej úrovne po ploche, ktorej bude určite dosť, ak budem hneď kombinovať), potom podobne druhý a nakoniec tretí. Jediný nedostatok miesta by mohol prísť keby si hráč nechával príliš veľa vylepšených predmetov na ploche pre prípadné ďalšie zákazky, ale ešte nikdy sa mi nestalo, že by sa ich nahromadilo toľko, že by mi zapratali celú plochu (vždy príde objednávka, ktorá vyžaduje buď daný predmet alebo nejakú jeho nasledujúcu úroveň, kde sa ho zbavím skombinovaním).[BR][BR]@pavelb vľavo od hracej plochy je ikonka s košom, do ktorej je možné niektorý z predmetov pretiahnuť a tým sa ho zbaviť."}, {"66": "Při minulých dvou skládacích událostech jsem vždy měla na ploše minimum věcí, takže se mne to příliš nedotkne. Prostě jsem je klikala a spojovala až podle objednávky a nic jsem neschovávala dopředu. Těch pár předmětů vysokých levelů, co jsem dostala z balíčků, stejně zmizelo po dalších pár objednávkách. Tak si neumím představit strategii, kdy by měl hráč plnou hrací plochu 5x9 polí.[BR]Můžete mi vysvětlit, jak se vám to povedlo, že se té změny tolik bojíte?"}, {"9": "no ja si klidne naklikala celou herni plochu a pak skladala podle potreby no ale kos jsem taky nepouzivala a doufam ze ani ted na nej nedojde, uz tak je tahle hra snad nejzdlouhavejsi ze vsech a jeste mas premyslet kolik si kliknes .. aby se nic nevyhodilo a nebo protacet moznosti a zase cekat pul hodiny[BR]no v teto hre jsem nevynikala a ted to nebude lepsi co pujde odklikam a nazdar[BR]to jak se to hraje zhodnotim az budu neco odehravat, jeste jsem ani nezacla s ukoly"}, {"16": "@iDavis Já naopak vyklikával tak min. půlku plochy, což je místo větší, než to směšně malé, které tam nechali. S ním opravdu hrozí, že hráči budou muset zbytečně házet věci do koše, protože při skládání jim dojde místo."}, {"66": "Přece není nutné mít na ploše neustále každý level každého druhu. Stojí to stejně herní měny jestli to skládáš na objednávku nebo do zásoby."}, {"3": "nutné to není. ale vzhledem k tomu, že člověk jde často po jediné odměně, tak takhle jde ušetřit čas a průběžně si něco připravit. takhle až ten den bude třeba všechno skládat. nicméně i tak, nejde o nějaké závratné časy. zase tolik té event měny stejně není"}, {"16": "No když vám ta menší plocha nevadí, tak si to hrajte s menší plochou. Já jsem zvyklý to hrát na větší ploše a s tou menší plochou to prostě hrát nebudu. Ony stejně odměny v tomto typu události jsou nejhorší ze všech událostí, takže se bez nich obejdu."}, {"2": "Já koš od začátku nechápu.[BR]To je jako bych měl u fenixe čudlík \"nové lůžkoviny\" a po každý truhle zapremyslel, jestli si to peří raci nenacpu do polštáře.[BR]Nevím jak plánujete vy, ale já přemýšlím o nákladech a přínosech těch věcí na pravé straně.[BR]Samotné skládání herních kamenů je jen hra s obrázky.[BR]Byla to pakárna, ale co.[BR]Naklikal jsem 10-15 věci poskládal a pořád dokola.[BR]Ve hře je 18 různých hracích obrázku a my teď máme 24 poli.[BR]Takže už asi nepůjde naklikat tolik věcí najednou.[BR]Věřím že se nic nezmění na volbě těch věcí v právo, prostě jen pakarnu udělali větší pakarnou."}, {"6": "Jakmile je tam neúnosně  \"bingování\", tak je mi to odporné, a také chápu odpor @Lovec Krys."}, {"5": "...je to jen hra, která je nyní s menším polem žel holt méně ,,poskladatelnější,, něž předtím   hlavu vzhůru Lovče "}, {"3": "Pravému lovci by stačilo i jedno pole  "}]