[{"87": "já myslím, že tohle tedy přehnali....teď jen nevím, jestli víc neztratíme , než získáme....a u nás jsme se tak těšili..."}, {"88": "Naše společenství se také dohodlo na úplné ignoraci DS. Odměny naprosto neodpovídají vynaloženému času a vyžadovaným surovinám / relikviím / orkům atd. Toto je budovatelská hra, čili něco za něco. A nové DS je bohužel velmi mnoho dáš  / velmi málo dostaneš."}, {"81": "Ohledně dobrodružství společenství já to psal že víc investic než přiměřených odměn. To už jsou o něco lepší turnaje i přes to že jsou tam taky malé odměny. Zcela nechápu proč někteří tak dbají na úsilí členů společenství v dobrodružstvích, místo aby měli rozumné velitele kteří zváží jestli oni jsou na úrovni aby se podařilo zvítězit a hlavně jestli ty odměny jsou aspoň v poměru vynaložených surovin atd. Ono to stmelování a zlepšení komunikace je asi to co může fungovat i bez dobrodružství."}, {"89": "Zdravim všechny,[BR][BR]Nejprve bych chtěla poděkovat všem, co se podílí na chodu hry, ale ...[BR][BR]zkráceně, třičtvrtě roku dávám dohromady s dalšíma 3 lidma jedno rozpadné společenství,konečně jsme dosáhli toho, že jsme po tisíci třídění, nabírání a vyhazování v počtu 23 aktivních hráčů, a jediný, co jim za to čekání a práci mohu nabídnout je účast v dobrodružství, kde se všichni vyčerpaj ze surovin, z času stráveným nad hrou, z dalších věcí jako darování relikvií, výroby kouzel -  a za všechny tyhle činnosti, do kterých investují mnohé dostanou akorát jedno zkrácení času, bonus do Divů, které pulka společenství ještě ani nemá postavené a jediná budova je na dosah až ve třetí truhle, kam se ze zkušenosti nedostanem. [BR][BR]Jako společenství to nevzdáváme, ještě to zkusíme, protože nás hra  a účast na společných událostech hromadně baví, ale prosím zamyslete se nad těmi odměnami a úkoly, spoustu hráčů to demotivuje a rozloučili se s náma už i ti, kteří tu strávili i dva a více let na hře. [BR][BR]Jinak jak řikam, díky moc za tu hru, je super, nenáročná, ale při tom zajímavá, ale odměny jsou naprd. Ráda bych dostala takovou budovu, kterou po 14 dnech nesmažu, protože mě stojí víc/obírá o prostor, než mi dává, nebo pokud jde o požehnání, tak víc kusů než jen jedno by bylo fajn, vždyť jindy než při eventu ho člověk nemůže získat. [BR][BR]Díky, Šárka"}, {"90": "Dobrodružství společenství je skvělý nápad, ovšem realizace se čím dál tím horší. K úkolům, které tak jako tak přispívaly k rozvoji (všechny výroby v dílnách i manufakturách, ba i kouzel) přibyly nové, které hráče naopak srážejí - vysávají jim zboží a relikvie. To spolupráci ve společenství neposiluje a hru degraduje.[BR]Škoda, na DS jsme se těšili - a nešlo přitom o odměny, ale radost ze hry a odbočení z nudného streotypu -, ale takle diskutujeme, zda to vůbec má smysl. Když to není rozumně hratelné pro nás, kteří patříme mezi 200 top společenství, tak proboha pro koho?"}, {"88": "@ElfMaGorr : Dle mého odhadu pro prvních 50 společenství, možná..."}, {"72": "Uberte.. nebojte se "}, {"91": "Mě by nevadilo, kdyby byly odměny slaboučké, ale ať to má nějaký smysl se zapojit, ne na tom jen ztrácet, to moc zábavy nepřinese."}, {"92": "blessedmary napsal/a:\t\t\ttřičtvrtě roku dávám dohromady s dalšíma 3 lidma jedno rozpadné společenství,konečně jsme dosáhli toho, že jsme po tisíci třídění, nabírání a vyhazování v počtu 23 aktivních hráčů, a jediný, co jim za to čekání a práci mohu nabídnout je účast v dobrodružství, kde se všichni vyčerpaj ze surovin, z času stráveným nad hrou, z dalších věcí jako darování relikvií, výroby kouzel -  a za všechny tyhle činnosti, do kterých investují mnohé dostanou akorát jedno zkrácení času, bonus do Divů, které pulka společenství ještě ani nemá postavené a jediná budova je na dosah až ve třetí truhle, kam se ze zkušenosti nedostanem.\t\tKlikněte zde pro zvětšení...[BR]Tohle zcela bez diskuse (zástupce velitele našeho společenství) podepíšu taky."}, {"66": "Já myslím, že Dobrodružství společenství, jako herní událost, je stále ve vývoji.[BR]Co jsem se tu dočetla je toto historicky teprve třetí nebo čtvrté.[BR]Když je srovnáte, tak je vidět, že úkoly i odměny se pokaždé mění.[BR]Měli jsme tu výroby v dílnách i manufakturách. Nyní po příchodu nové rasy Inno počítá s tím, že nebude mnoho prostoru pro stavění extra 1levelových budov, tak zavedli darování VB do divů.[BR]První dobrodružství bylo zřejmě příliš snadné pro pokročilá společenství, tak jim to ztížili. Zároveň se snaží celkově náročnost vybalancovat.[BR]Po tomto dobrodružství na základě feedbacku a statistiky určitě usoudí, že trochu přestřelili, a pozmění obtížnost.[BR][BR]Z širšího pohledu musíte uznat, že je znát, že se hra neustále vyvíjí a vývojáři se snaží přicházet s novým obsahem.[BR]Akorát jsou to taky jenom lidi, dejte jim čas. "}, {"72": "Já nechci být negativní, ale, ano, DS se stále vyvíjí, ale bohužel stále jen jedním směrem.[BR]A ano, přišli elementálové, lidi budou potřebovat relikvie, takže je z nich chce Inno včas vytáhnout, aby na ně v budoucnu mohlo udělat \"balíčky\". Tyhle \"výprodejové\" eventy se dějí i v jiných hrách, ale vesměs doba, kdy se zače vyvíjet taková činnost neznamená pro herní svět začátek lepšího obsahu, spíše naopak."}, {"68": "Prealiena napsal/a:\t\t\tNyní po příchodu nové rasy Inno počítá s tím, že nebude mnoho prostoru pro stavění extra 1levelových budov, tak zavedli darování VB do divů.\t\tKlikněte zde pro zvětšení...[BR]No dobrá dejme tomu, ale kolik lidí už je v nové rase oproti zbytku serveru? Například na druhém světě jich tolik asi nebude.. jsem momentálně kolem 450 pozici v žebříčku a teprve jsem otevřel lesní elfy. Takže tohle mi nepřijde jako relevantní pro takovou změnu. Navíc pochybuji, že se v Innu zabývají tím, jak kdo úkoly plní "}, {"82": "Jako velitel klanu tohle naprosto ignoruji, ikdyž je mi líto těch,co se budou snažit ....maximálně vložím nějakou tu minci ...prostě paskvil DS .. [BR][BR]Edit: ..a stejně budu měkej je v tom nechat..."}, {"87": "my do toho také nejdeme...co budou chtít příště? Tohle už bohužel není zábava a na stmelování kolektivu to naopak může mít negativní vliv...velice mně to zklamalo....mám zdravotní potíže a byla jsem ráda, že se tato hra dá hrát i když zrovna nemám diamanty...ale vývoj směrem čím dál větší nároky a čím dál menší odměny....mně žádnou nadějí do budoucna nenaplňuje...nejsem otrok.../a navíc platící otrok./...přišla jsem kvůli zábavě.....ale ta v tomto případě nějak chybí....fakt mně to mrzí...těšila jsem se ...všichni jsme se těšili..."}, {"72": "ElfMaGorr napsal/a:\t\t\tVíte někdo kolik jednotek jakých bude potřeba na tu \"gardu\"? Já jsem taky četl, že tři oddíly, ale prý se to u velkých jednotel nějak přepočítává podle jejich velokosti.\t\tKlikněte zde pro zvětšení...Po mě to chce konkrétně 2295 jednotek. A velikost oddílu mám 765.. takže to odpovídá na ty tři.."}, {"72": "Takže ano, počítá to tři oddíly. Tzn. např. těžkooděnce to přepočte na počet lehkooděnců (základních jednotek). Je jedno co vyrábíte."}, {"90": "athlan napsal/a:\t\t\tTakže ano, počítá to tři oddíly. Tzn. např. těžkooděnce to přepočte na počet lehkooděnců (základních jednotek). Je jedno co vyrábíte.\t\tKlikněte zde pro zvětšení...Děkuji. Už přece jenom nakonec hrajeme (prostě pro zábavu, ne pro ty směšné odměny) a tak jsem to nakonec pochopil Toto je jeden z mála dobrých nápadů - člověk si může stavět co potřebuje a hru to neruší."}, {"61": "napadla mě jedna věc, jak se zavádí nová surovina: Myslíte, že od určité kapitoly a vzdálenosti v provinciích nebude potřeba produkovat základní zboží? Jakože bude možné zbourat manufaktury, protože se s poptávkou na ně už nesetkáme. Jediné, co mě napadlo jsou turnaje a eventy, ale zase to by mohlo stačit mít méně těch manufaktur...."}, {"31": "No ak by to tak bolo, bol by som rád lebo produkovať celý herný čas tie isté suroviny už ani v tej 12. kapitole asi nie je veľká zábava. Ale je to teoreticky možné, je totiž vidieť ako živoucí zboží postupne nahrádza štandardné, v elementáloch výskum už zo štandardného vyžaduje iba vzácne a magické a vyzerá to tak, že nadchádzajúca kapitola už bude chcieť iba magické."}, {"61": "a co ty turnaje? nebo provincie, chtějí živoucí? a pokud ano, chtějí i základní?"}]