[{"51": "zatím turnaje, provincie i eventy chtějí základní "}, {"16": "No jestli Inno bude chtít omezit výkupy v turnajích, tak to tak může udělat, jelikož produkce živoucího zboží je omezena produkcí semínek, čímž ale více méně znemožní výkup hráčům, kteří nebudou na konci výzkumu a budou to zboží potřebovat na výzkum. Teda pokud tito hráči nedají přednost vykupování před výzkumem. Zároveň by to zvýšilo užitečnost divů produkujících semínka."}, {"44": "Ahoj, je možné někde sehnat úkolovou řadu pro rasu Elementové. Děkuji moc"}, {"61": "ahoj, jestli stačí anglicky, tak tady. Najeď úplně dolu a tam jsou záložky kapitol, tak si klikni na elementály."}, {"44": "děkuji moc a v češtině asi ne že?"}, {"2": "na překlad ti stačí znát asi 20 slov, to dáš"}, {"44": "jo jo děkuji asi jsem pochopil co jsem chtěl, děkuji"}, {"2": "Na betě už nejsou jako odměna z turnaej VBčka, ale VB požehnání použitelná jen na divi.[BR]Je to tak?"}, {"46": "Bohužel je to skutečně tak "}, {"65": "cože proč? :-/ :-( a je to jenom truhlách nebo i za jednotlivé provincie?"}, {"61": "jestli jsem to správně pochopil, tak jen z turnaje..."}, {"2": "odměny z turnaje, nemáte někdo prodrobné info jak ted vypadají truhly?"}, {"84": "CorwinOfAmber napsal/a:\t\t\tcože proč? :-/ :-(\t\tKlikněte zde pro zvětšení...Nechtěl bych se nikoho dotknout, ale já myslím, že to je uděláno pro TOP hráče, kteří jsou již na konci vývojového stromu a tak jim jsou VB k ničemu, jen k divům. Takže pro ně vlastně žádná změna, jen výhoda, že mi ostatní je budeme déle dohánět.[BR]Nám to jenom vzalo možnost výběru, zda body použijeme k vývoji nebo do divů, ale myslím si, že to není až takový problém, aspoň nám hra déle vydrží. Ale radost z toho nemám.."}, {"31": "Jar prichádza.. [BR]Jarná udalosť[BR][BR]Spoiler: Jarná udalosť (Phoenix Cult)[IMG]https://i.ibb.co/1zkLCDQ/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-easter2018-Forumann-frames-Easter2018-png.png[/IMG][BR][BR]Predpokladaný termín: 19.3. - 12.4.[BR][BR]Všetky nové informácie o tejto novej udalosti budem postupne, ako je zvykom, dopĺňať do tohto spoileru. [BR][BR]Spoiler: ÚlohyZoznam všetkých úloh a podrobné tabuľky hlavných aj denných nájdete tu.[BR]Behom udalosti nás čakajú aj nové kultúrne budovy, ich tabuľky prikladám nižšie. Na dokončovaní tabuliek ešte pracujem, nie sú teda ešte vo finálnom stave.[BR][BR]Udalosť bude zároveň poprvýkrát dostupná aj v mobilnej aplikácii.[BR]Spoiler: ObrázokZ týchto kultúrnych budov sú budovy Cultist's Plaza, Phoenix Worship a Temple of Phoenix hlavnými odmenami. Zároveň tieto 3 a ešte 2 z ostatných (zistím ktoré) sú súčasťou nového setu.[BR][BR][IMG]https://i.ibb.co/3THv3f4/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-easter2018-Set-Buildings01-png.png[/IMG][BR][BR]Momentálne mám menej času, avšak budem sa snažiť aktualizovať spoiler vždy keď budem môcť. [BR][BR][BR][BR][BR][BR][BR][BR]1. deň: Galactical Phoenix Egg[BR]2. deň: Phoenix Lighthouse[BR]3. deň: Osvícená střelnice + dvojnásobok[BR]4. deň: Unobstrusive Housd"}, {"61": "ceny pěkné, set zajímavý, graficky skvělé, ale nadšení se zatím nedostavilo, tak snad časem "}, {"63": "VB z turnaje pro použití v divech je s prominutím trochu podpásovka pro hráče, kteří teprve začínají hrát... A) jim body nepomohou ve vývoji (čímž jsou dost znevýhodněni oproti hráčům, kteří tu možnost měli) a B) pokud ještě ani nemají div, tak jsou jim tak trochu k ničemu = opět to v některých společenstvích sníží motivaci turnaje hrát...  Myšlenka dát ne VB, ale požehnání je SUPER, ale tato požehnání by měla mít možnost použít dle uvážení jak v divech, tak ve vývoji!!"}, {"61": "jinak co mně se líbí, je rozložení odměn ve velkých vajíčkách"}, {"43": "Tady v té hře se vůbec nepřemýšlí.Sice chápu,že se vše vytváří za pochodu,ale v této hře jsou různé typy hráčů.Ti co jsou na začátku anebo mají slabší město a pak ti co jsou daleko.A s těmi VB se mi to moc nelíbí.Pro ty menší hráče je toto hodně nespravedlivé.Do teď si hráči hrabali z jednoho turnaje dá se říci stovky VB (za truhly a + za druhé kolo 5 VB v provinciích).To si vůbec nedokážu představit,kdybych měl celý výzkum ject bez VB z turnajů,to by mi asi jeblo. Kdyby se radši INNO věnovalo vylepšení hry než těmto podpásovkám."}, {"43": "K eventu,zatím vypadá zajímavě.Grafická stránka a budovy se mi moc líbí,snad tam budou ještě lepší s kombinací kultury a lidí,že by se opět vyměnili nějaké staré budovy."}, {"61": "no k těm budovám, nejspíš tam bude něco ze starších eventů, můžeme tajně doufat v zahrady, ale...[BR]...ale mám pocit, že se teď jede hodně na propagaci setů, takže můj odhad je, že budovy budou spíše průměrné až slabé, aby se vyzdvihly setové budovy..."}]