[{"72": "Přemýšlel jsem že ten první den bych se měl dostat někam kolem 50tého úkolu (když nezapomenu spustit vylepšení budov včas). Je pravda, že u vánočního jsem to stihl jen do úkolu 32. [BR][BR]Ale třeba to ještě není vše, je kratší jak vánoční, takže 86úkolů by klidně mohlo odpovídat, ale těch esencí mi přijde málo."}, {"31": "Tak skúškové dni sú konečne za mnou. [BR][BR]Keďže sa tu riešila tá kultúrna budova Wishing Well, v tejto chvíli si nie som istý či bude naozaj súčasťou tejto udalosti, preto k nej ešte nebudem dávať ďalšie informácie. Pokiaľ sa v udalosti ukáže, doplním samozrejme ako aj u ostatných kultúrnych budovách jej tabuľku aj s grafikou, ale zatiaľ to asi nemá zmysel, keďže ju aj tak ešte upravujú. Jej bonusy vyzerajú ale celkom zaujímavo a myslím si, že by to mohla byť konečne prvá ozajstná legendárna budova. "}, {"66": "Gratulujeme iDavisovi k úspěšně zvládnutému zkouškovému období!"}, {"28": "Budovy jsou opravdu nádherné. Na event se těším. Doufám, že konečně vytáhnu nějaké ty menší budovy na vyplnění prostoru. Mám na ně nějak smůlu "}, {"43": "Také se na event těším.Já bych rád obměnil starší budovy za lepší a hlavně půjdu po požehnáních urychlovačů a zásob.Doufám,že budou."}, {"95": "Hezký den všem,  chci poděkovat za zprostředkovávání informací k novým akcím. Netroufnu si Vás jmenovat, abych na někoho nezapomněla. Moc to ale pomáhá. Různé tabulky, přehledy, obrázky, rady... úžasné! Jak říká klasik: \"Ať víme, do čeho jdeme!\"  Květa"}, {"31": "Potvrdené, nová kultúrna budova Wishing Well bude naozaj súčasťou nadchádzajúcej veľkonočnej udalosti! [BR]Wishing Well[BR][BR]Spoiler: Wishing WellTakže nejaké informácie k nej - pravdepodobne každých 12 hodín bude produkovať jednu náhodnú odmenu (symbol kocky v tabuľke tu). Táto náhodná odmena bude môcť s danou pravdepodobnosťou ponúknuť mince, zásoby, zboží, VB alebo diamanty.  Veľkosť budovy bude 3x3 a zároveň bude poskytovať celkom slušný bonus na kultúru. Pôjde o dočasnú budovu (rovnako ako napríklad Osvícená střelnice s ktorou sme sa už stretli) a ak sa nič nezmení, jej efekt by mal trvať 100 dní.[BR][BR]Chystám ešte jednu tabuľku s rozborom všetkých možných náhodných odmien podľa percentuálnych pravdepodobností, ale tú vložím až neskôr.[BR]No a ešte, tentokrát z beta fóra, jeden..[BR]Sneak Peek[BR][BR]Spoiler: Sneak Peek[IMG]https://i.ibb.co/4FKZgT3/http-ipic-su-img-img7-fs-KP-1519598164-png.png[/IMG][BR]​​"}, {"79": "Plecnik napsal/a:\t\t\tHezký den všem,  chci poděkovat za zprostředkovávání informací k novým akcím. Netroufnu si Vás jmenovat, abych na někoho nezapomněla. Moc to ale pomáhá. Různé tabulky, přehledy, obrázky, rady... úžasné! Jak říká klasik: \"Ať víme, do čeho jdeme!\"  Květa\t\tKlikněte zde pro zvětšení...[BR]Moc hezky napsané a připojuji se."}, {"73": "tak to vypadá dobře Wishing Well [BR][BR]A na to požehnání jsem opravdu zvědavá"}, {"2": "čárovné rozšíření?[BR]jakožecože?[BR]to se bude někde vyhrávat?[BR][BR]jinak co se týče změny odměn za turnaj[BR]ano, také jsem body používal i do výzkumu a mrzí mě že to už nepůjde, ale dovoluji si podotknout, že jich bude víc a bude možnost je skladovat a použít kdy se mi to hodí a to je oboje, pro mě, nezanedbatelné plus."}, {"94": "Wishing Well a Sneak Peek?[BR]Pokut to bude tak jak asi všichni doufáme, tak jsou dane dny kdy padne maximum esence..."}, {"73": "To určitě :-D Taky je chci ziskat  Jen nevím, jak to bude s tím rozšířením, když si lidi, co jsou už u elementalů stěžují, že už nemají kam rozšiřovat"}, {"2": "záleží kolik jsi utratila diamantů[BR]já bych rozšiřoval až bych brečel[BR]a to nemluvím o tom, že provincie už mi moc rozšíření nedají"}, {"16": "No já do Wishing Well asi zatím nepůjdu, do konce výzkumu mám ještě pár ras, tak nebude místo něco takového stavět a jestliže z jedné takové bude v průměru bude 100 diamantů, tak mě to nemotivuje utratit všechny pokusy za takovou budovu. Až budu delší dobu na konci výzkumu a většina ostatních odměn pro mě přestane být atraktivní, tak to bude jiná..[BR][BR]No většina z nás nebude mít všechna rozšíření, za sebe jsem počítal, že mi zbude nejméně jeden a půl řady i v případě, že budu mít všechny rozšíření z provincií k dispozici - a to jsem si jistý, že až dolezu k elementálům, tak je všechny ještě mít nebudu."}, {"43": "Silversnake napsal/a:\t\t\tDal jsem do kupy doposud známou úkolovou řadu, tak jak je dostupná. Protože tam nejsou např. u Výcviku jednotek počty, je možné a) že hodnota dosud není známa b) může být odlišná tak jako to bylo u Dobrodružství společenství (hráči na různých úrovních cvičili různé množství jednotek).[BR][BR]SpoilerÚkol     Popis[BR][BR]1.          Produkce 1x Nápoj (1 x 5min)[BR][BR]2.          Produkce 2x Obyčejné nástroje (2 x 15min)[BR][BR]3.          Získej 20 kultury[BR][BR]4.          Získej 10 Obyvatel[BR][BR]5.          Utrať jeden (1) VB[BR][BR]6.          Přesuň jednu (1) budovu[BR][BR]7.          Vylepši dvě (2) budovy na úroveň 2 či vyšší[BR][BR]8.          Získej menší množství mincí[BR][BR]9.          Získej menší množství zásob (kladívek)[BR][BR]10.        Produkce 5x Chléb (5 x 1h)[BR][BR]11.        Produkce 8x Obyčejné nástroje (8 x 15min)[BR][BR]12.        Produkce 3x Košík jídla (3 x 9h)[BR][BR]13.        Produkce 25 x Nápoje (25 x 5min)[BR][BR]14.        Vyzkoumej jednu (1) technologii nebo vylepši 1 budovu na úroveň 12 či vyšší[BR][BR]15.        Utrať 5VB[BR][BR]16.        Přijmi 5 nabídek na trhu + vytvoř 1 nabídku na trhu[BR][BR]17.        Získej 16 relikvií[BR][BR]18.        Vyřeš 12 střetů nebo kup 12 VB[BR][BR]19.        Vycvič 60 jednotek[BR][BR]20.        4x produkce bonusové manufaktury 3-hodinová[BR][BR]21.        3x produkce bonusové manufaktury 9-hodinová[BR][BR]22.        2x produkce bonusové manufaktury 24-hodinová[BR][BR]23.        Výzkum jedné provincie nebo vylepšení jedné budovy na úroveň 12 či vyšší[BR][BR]24.        Získej menší množství peněz[BR][BR]25.        Získej menší množství zásob (kladívek)[BR][BR]26.        Trénuj jednotky[BR][BR]27.        1x 3h produkce všech základních manufaktur (mramor +dřevo + ocel)[BR][BR]28.        Získej menší množství Mramoru[BR][BR]29.        Získej menší množství Oceli[BR][BR]30.        Získej menší množství Dřeva[BR][BR]31.     1x produkce bonusové manufaktury 2-denní (48hodin)[BR][BR]32.     5x produkce bonusové manufaktury 3-hodinová[BR][BR]33.     Utrať 7 VB[BR][BR]34.     Produkce 20x Obyčejné nástroje (20 x 15 minut)[BR][BR]35.     Produkce 2x Sada nástrojů (2 x 24hodin)[BR][BR]36.     1x 9h produkce všech základních surovin (mramor +dřevo + ocel)[BR][BR]37.     Získej 20 relikvií[BR][BR]38.     Vyřeš 14 střetů, nebo nakup 14 vědomostních bodů[BR][BR]39.     Vycvič větší množství jednotek[BR][BR]40.     6x produkce bonusové manufaktury 3-hodinová[BR][BR]41.     5x produkce bonusové manufaktury 9-hodinová[BR][BR]42.     3x produkce bonusové manufaktury 24-hodinová[BR][BR]43.     Výzkum dvou provincií nebo vylepšení 2 budov na úroveň 10 či vyšší[BR][BR]44.     Získej menší množství Krystalu[BR][BR]45.     Získej menší množství Svitků[BR][BR]46.     Získej menší množství Hedvábí[BR][BR]47.     Vylepši 3 budovy na úroveň 3 či vyšší[BR][BR]48.     Získej střední množství mincí[BR][BR]49.     Získej střední množství zásob (kladívek)[BR][BR]50.     Produkce 8x Chléb (8x 1h)[BR][BR]51.     Produkce 25x Obyčejné nástroje (25 x 15 minut)[BR][BR]52.     Produkce 5x Košík jídla  (5 x 9 hodin)[BR][BR]53.     Produkce 35x Nápoje  (35 x 5 minut)[BR][BR]54.     Výzkum jedné (1x) technologie, nebo vylepšení jedné (1x) budovy na úroveň 12 či vyšší[BR][BR]55.     Utrať 10 VB[BR][BR]56.     Kup 8 VB[BR][BR]57.     2x 3h produkce základních surovin (mramor +dřevo + ocel)[BR][BR]58.     Získej menší množství Mramoru[BR][BR]59.     Získej menší množství Oceli[BR][BR]60.     Získej menší množství Dřeva[BR][BR]61.     3x produkce bonusové manufaktury 24-hodinová[BR][BR]62.     15x produkce bonusové manufaktury 3-hodinová[BR][BR]63.     Utrať 13 VB[BR][BR]64.     Produkce 50x Obyčejné nástroje  (50 x 15 minut)[BR][BR]65.     Produkce 5x Sada nástrojů  (5 x 24 hodin)[BR][BR]66.     2x 9h produkce všech základních manufaktur (mramor +dřevo + ocel)[BR][BR]67.     Vylepši 4 budovy na úroveň 4 či více[BR][BR]68.      Získej střední množství mincí[BR][BR]69.      Získej střední množství zásob (kladívek)[BR][BR]70.     Produkce 12x Chléb (12 x 1h)[BR][BR]71.     Produkce 70x Obyčejné nástroje (70 x 15 minut)[BR][BR]72.     Produkce 8x Košík jídla  (8 x 9 hodin)[BR][BR]73.     Produkce 60x Nápoje  (60 x 5 minut)[BR][BR]74.     Výzkum dvou (2) technologií, nebo vylepšení 2x budova na úroveň 12 či vyšší[BR][BR]75.     Utrať 20 VB[BR][BR]76.     Kup 16VB[BR][BR]77.     Získej 32 relikvií[BR][BR]78.     Vyřeš 20 střetů nebo kup 20 VB[BR][BR]79.     Vycvič větší množství jednotek[BR][BR]80.     9x produkce bonusové manufaktury 3-hodinová[BR][BR]81.     7x produkce bonusové manufaktury 9-hodinová[BR][BR]82.     5x produkce bonusové manufaktury 24-hodinová[BR][BR]83.     Výzkum dvou (2) provincií, nebo vylepšení 2x budova na úroveň 10 či vyšší[BR][BR]84.     Získej menší množství Krystalu[BR][BR]85.     Získej menší množství Svitků[BR][BR]86.     Získej menší množství HedvábíKlikněte zde pro zvětšení...[BR]V úkolu 61 je chyba,kdo podle toho jedete.Je 2 dňový a né 24 hodinový.Já podle toho jedu a teď budu dva dny tvrdnout na místě ... :-("}, {"57": "Mně se to taky vymstilo. Měl jsem to vytisklé a v klidu měl vyrobeno 3x24h výrobu. No jo, chybička se vloudila."}, {"96": "Vidím, že nejsem sám já už také od rána jedu znovu úkol 61 a 2 dni si pěkně počkám [BR]Přitom Davis má ty úkoly napsané dobře a bez chyby. To je tak, když jednou vezmu úkoly, které napsal někdo jiný. Slibuji, že už to nikdy neudělám "}, {"66": "Já vždycky porovnávám @iDavis  a Gems of Knowledge. Ještě se nestalo, že by se lišili.[BR]Za což iDavisovi smekám. "}, {"74": "Zdroj jsem měl samozřejmě stejný.... chyba byla že jsem si neudělal originální screen obrazovky. Příště to udělám. Teď sám nevím, zda jsem udělal chybu, nebo došlo k opravě na originálu ...Každopádně Všem velká omluva... "}, {"48": "Já jel ze stejného zdroje, přepisoval (a překládal) jsem to pro cech cca hodinu po tobě (dle časů) - tuhle chybu tam nemám, ale mám zas jinou (místo Vyřeš X střetů nebo Kup X bodů, jsem psal Vyřeš X střetů nebo utrať X bodů  ) Spíš to bude tou brzkou ranní hodinou, kdy jsme to oba dělali, než že by oni měli chybu "}]