[{"27": "Hráč Miciah se nám zase činil a je vidět , že má diamanty velice v oblibě, [smilie--sprite8][BR]přináším screeny maximálních úrovní budov rasy draků a čarodějů:[BR][BR]Hlavní sídlo[BR]Spoiler[IMG]https://i.ibb.co/MZ3p3KT/https-cz-forum-elvenar-com-index-php-attachments-screenshot-1-png-1414.png[/IMG]Cvičiště[BR]Spoiler[IMG]https://i.ibb.co/fQkNhQd/https-cz-forum-elvenar-com-index-php-attachments-screenshot-1-png-1421.png[/IMG]Dílna[BR]Spoiler[IMG]https://i.ibb.co/wcBzyhV/https-cz-forum-elvenar-com-index-php-attachments-screenshot-3-png-1416.png[/IMG]Obytná budova[BR]Spoiler[IMG]https://i.ibb.co/6Zy7Jcx/https-cz-forum-elvenar-com-index-php-attachments-screenshot-4-png-1417.png[/IMG][BR]Tomuto hráči už příliž nechybí k otevření nových urovní manufaktur, posléze i nových cest a dalších kulturních budov a nakonec i divů. S novými budovami se zase rád podělím, jenom co je dotyčný postaví.[BR][BR]a něco málo z fóra Beta serveru, kde Marindor ) CM ( odpovídá dotazu, proč ještě není update 1.23 na našich live serverech.[BR]Spoiler\t\t\tDony[BR]You took the question right out of my mouth. The vid about the release said februari. And usually it is done with an update, which normally happens on wednesday, but it didn't happen last week. And apprently not today (or if it is, its later than usual) but there's not enough days in the month to postpone it a week and still do it in februari\t\tKlikněte zde pro zvětšení...[BR]Marindor - community manager elvenar teamu[BR]We have indeed decided to postpone the live release of 1.23 and the Beta release of 1.24 to next week, so we would have more time to fix the list of bugs, which is above our standards. A lot of the major bug fixes have been made in this weeks hotfix already, but we still want to take a bit more time to reduce the number of bugs even further before releasing it to live [smilie--sprite1]"}, {"29": "Ty budovy vypadají opravdu parádně, jen asi radši nechci vědět, jak moc se zvětší... [smilie--sprite8][BR]Díky Nibelione za ukázky. [smilie--sprite2]"}, {"27": "Já si teď hrál s architektem ...zase. Snažil jsem se přijít na vybalancované město s mými budovami a nějakou kombinací výroby, účastí na turnajích, výzkumu, vykupování provincií a v neposlední řadě s budovami draků a čarodějů kde by byly 4 školy od každého druhu kolem náměstí a ještě aby to sedělo i se všemi divy....po hodině trápení jsem dostal toto [smilie--sprite8] , nejvíc mě mrzí, že event budovy tam prostě nevlezou, takže s nimi nepočítám, do mezer jsem prozatím naházel cestu ale v budoucnu tam budou doplňující kulturní budovy z nabídky . [smilie--sprite1][BR][BR]Nejvíc se těším jak to bude vypadat jako komplet pro tuhle úžasnou rasu.[BR][BR][IMG]https://i.ibb.co/DwVZDtj/https-cz-forum-elvenar-com-index-php-attachments-screenshot-2-png-1422.png[/IMG]"}, {"34": "Těch wisom square máš málo. Potřebuješ je na generování učedníků a teď ty výpočty nemám u sebe, ale pokud chci mít od každé budovy 2, tak jich potřebuju asi 15[smilie--sprite3][BR][BR]//Odstaněna zbytečná citace, Iddun"}, {"27": "Wisdom Square slouží pouze k propojení obyčejné cesty s náměstím (campus), veř mi, když ti řeknu, že tuto cestu nikdo na betě nestaví vicekrát nežli jednou. Ty učedníky to generuje tuším každé 4 hodiny jednoho a pak postupně stavíš a vylepšuješ jednotlivé školy kouzelníků.[BR][BR]Nedovedu si ani logicky představit kdybych 1/7 mé, už tak napráskané hrací plochy musel zaplnit touto alejí, která navíc musí být napojena na cestu a onen \"campus\" to bys poté nemohl/a postavit ani jedinou školu kouzelníků, jelikož podmínka pro fungování škol je být alespoň jedním herním čtvercem napojen na \"campus\". Pokud nad tím tedy zauvažuješ , zjistíš sam/a , že je to nesmysl."}, {"2": "1.23 nahrají o víkndu? Jako ted?[BR]Sakra, Elfy dojedu v úterý a vůbec bych se nezlobil za odklad až do středy osmého března.[BR]Mám tu ješět pár věcí, které musím uplatit manou, třeby ten jejich úkol an cesty, to je fakt mazec, skorem čtvrt milionu many, copak kradu?[BR][BR][BR]Windovs Square neslouží jen jako propojení, generuje apprentice a to 6 za den.[BR]uvidíme jak to mají ošéfované, ale jestli jejich produkci nebude ovlivnivat nic, podobně jako manu, tak budeme věčně čekt na studenty."}, {"27": "Jako u každé předešlé rasy nejprve příjde představení a nejspíš o týden později samotný update 1,23. Podle Marindora k tomu mělo na live serverech dojít o týden později, kvůli opravě chyb , kterých se nasbíralo opravdu hodně a nechtěli to pustit dříve kvuli počtu těchto chyb. Takže jsem čekal tento týden představení a někdy příští týden update. [BR][BR]Jak bylo ale řečeno nespočet krát, raději ať si dají na čas, protože o chybách, které byly na beta serveru potvrzené, bych teda upřímně rád přišel. [BR][BR]Teď něco z novinek na beta serveru:[BR]Beta servery zavádějí \"novou politiku\"automatického updatování .Drobné chyby a i ty ostatní se budou na servery nahrávat každý den v 8 hodin (časové pásmo beta serveru) od verze 1,24. Celá tahle změna ovlivní rychlost opravy chyb a změn ve hře ať už zpětné vazby hráčů o nalezených nedostatcích nebo jenom čistě úpravy herního obsahu, který prostě nevyhovuje před samotným nahráním na live servery. Jedinou nevýhodou těchto updatů bude ale né příliž včasné a přesné podání informací tkz \"patchnotes\" a jednoduše až bude čas, tak to na fórech uvidíme. Zároveň upozorňují na možnost selhání při nahrání oprav nebo herního obsahu na Beta servery, pokud k tomuto dojde bude vrácena verze předchozího dne a další nahrávání bude odsunuto na další den. Zároveň si budou moci hráči na Betě užívat obsahu mnohem dříve než přijdou k nám na live servery."}, {"2": "Když si shrneme, co všechno zatím o rasové produkci nové kapitoly víme, dá se říct, že Inno nám předložilo nelehký úkol a pro ty co ho zvládnou ostré hranice, aby se nevymkli kontrole.[BR]U lesních elfů mi portál s lesní stezkou zabral 45 polí, draci to mají pevně dané na 112.[BR]Kolik si postavím budov pro rasovou produkci, bylo do teď jen na mé volbě. Akademie to jasně určuje obvodem kampusu. Nemám dost informací pro nějaké hlubší propočty, ale v tuhle chvíli to vypadá na 12 fakult, 4 od každého druhu.[BR]No a pak jsou tu ti učedníci.[BR]Co víme?[BR]Učedníky produkuje náměstí rychlostí 6 za 24h. Sebrat se dají asi po jednom, takže nebude problém si je vyzvednout, ale pro nepozorného  hráče to je pěkný způsob jak mu produkci snížit na 5 za den. Nebo i méně, když se nad tím hráč nezamyslí.[BR]začátku to možná nebude takový problém, fakulty budou produkovat  suroviny ze vzácného zboží.[BR]Pak ale dojde na suroviny potřebné pro výzkum a ty vyžadují produkty seminářů, kterým padají za oběť nic netušící studenti. Množství surovin potřebných pro výzkum, je pevně daný, od toho se dovíjí i množství surovin potřebných k jejich výrobě a tedy počet studentů, kteří nenávratně zmizí v tajemných chodbách naší univerzity.[BR]Takže se mi zdá, že náměstí je úhelným kamenem celé dračí kapitoly. Jeho produkce bude stálá a neovlivnitelná a pokud si bude hráč chtít zkrátit dobu strávenou výzkumem, bude muset maximalizovat zisk z každého učedníka."}, {"28": "@GorGlin Kde si přišel na to, že to bude teď o víkendu? Week není víkend ale týden, takže klasicky ve středu by to mělo být.[BR][BR]Jinak jsem se byla na betě podívat k Miciahovi, jak to městečko vypadá celkově, a je to hnus velebnosti [smilie--sprite5] Ani trochu se mi to nelíbí. Všechny budovy jsou hnusně modro-šedé. Žádný prvek to tam nerozbije. Působí to chladně a jednotvárně. Achjo [smilie--sprite3]"}, {"27": "Barevná pestrost je opravdu jinde než například u Víl to určitě ale některým to vyhovuje [smilie--sprite1] , takže stejně jako já musel přetrpět okřídlené ty musiš čaroděje a draky [smilie--sprite8][BR][BR]A výše zmíněný hráč Miciah už došel k manufakturám Křišťálu takže tady tedy jsou lvl 20, 21, 22, 23:[BR]Spoiler[IMG]https://i.ibb.co/2sJCf5P/https-cz-forum-elvenar-com-index-php-attachments-screenshot-1-png-1425.png[/IMG]"}, {"2": "tak to jo"}, {"31": "Čo nás čaká...[BR][BR]Spoiler: 1.25nová načítavacia stránka hrySpoiler: obrázok[BR]možnosť kúpiť VB aj pri ich plnom počteúpravy turnajov:zníženie počtu stretov v jednej turnajovej provincii z 8 na 4zvýšenie nepriateľovej aj vašej armády, zdraženie vyjednávania (po prepočte na 8 stretov by to malo vyjsť avšak rovnako)vybalancovanie bodov za jeden stretzníženie počtu potrebných bodov na dosiahnutie jednotlivých truhlínové odmeny v truhlách (napr. runové úlomky)sľubujú možnosť v budúcnosti uskladniť runových úlomkov z turnajov viac ako 10 (doteraz je možné len 10)"}, {"2": "výkup zdražili, ale jednotky šli naopak dolu"}, {"31": "Nové hodnoty potrebných bodov pre dosiahnutie truhlí...[BR][BR]SpoilerNová hodnota, v zátvorke súčasná hodnota:[BR][BR]600 (2000)[BR]1800 (6000)[BR]3700 (12000)[BR]6300 (20000)[BR]9700 (30000)[BR]13900 (42000)[BR]19000 (56000)[BR]25000 (72000)[BR]32000 (90000)[BR]40000 (110000)"}, {"35": "koukám na ty screeny tý přihlašovací obrazovky a... elfka sexy v pohodě, ale obličej toho člověka? to vypadá jak špatná fotomontáž [smilie--sprite8]D"}, {"28": "Podle mě je i ta elfka pěkně fujky [smilie--sprite8] Pozadí je super, ale postavičky se vůbec nepovedli [smilie--sprite5]"}, {"29": "@Thespia Taky se mi ty postavičky moc nezdají, ten chlap vypadá spíš jak ženská s knírem a elfka, no... bůhví, v čem jede... [smilie--sprite2]"}, {"32": "GorGlin napsal/a:\t\t\tvýkup zdražili, ale jednotky šli naopak dolu\t\tKlikněte zde pro zvětšení...[BR]Tak to abych honem ještě skoupil co pude... Ve které verzi to udělali?"}, {"2": "1.25[BR]Ale znáš to, co je na betě nemusí nic znamenat"}, {"27": "Opět pár screenů z bety, pokud by vás to zajímalo [smilie--sprite1][BR][BR]Hráč Miciah už dosáhl nových divů:[BR][BR]Spoiler[IMG]https://i.ibb.co/yh1DpBP/https-cz-forum-elvenar-com-index-php-attachments-screenshot-2-png-1552.png[/IMG][BR]Spoiler[IMG]https://i.ibb.co/cyG8b2M/https-cz-forum-elvenar-com-index-php-attachments-screenshot-3-png-1553.png[/IMG][BR]Jeden z avatarů , který získame pomocí těchto divů:[BR][BR]Spoiler[IMG]https://i.ibb.co/Y0Hj9WG/https-cz-forum-elvenar-com-index-php-attachments-screenshot-1-png-1554.png[/IMG][BR]Nová tvář známeho bojovníka zadavajícího úkoly:[BR][BR]Spoiler[IMG]https://i.ibb.co/frb0tM1/https-cz-forum-elvenar-com-index-php-attachments-screenshot-4-png-1555.png[/IMG]"}]