[{"66": "jj, trochu se na to vyspěte pánové. [BR][BR]PS: \"ranní\" hodina [BR][BR]Jsem zlá [smilie--sprite1]"}, {"31": "Včera sa konal QaA stream, prikladám informácie ktoré v ňom boli spomenuté [smilie--sprite1][BR]Poznámky z QaA (27.3.2018)[BR][BR]Spoiler: Poznámky z QaA (27.3.2018)Na začiatku streamu sa rozprávali o aktuálnej udalosti - Kult fénixe. Spomenuli, že denné odmeny ktoré sú potrebné do setu sa behom udalosti objavia až 2x a že niekoľko dní budú dostupné dvojnásobky na získavanie fénixovho peří.[BR][BR]Zmena odmien v turnajoch - k tejto téme sa vyjadrili pomocou dvoch dôvodov prečo tieto zmeny vykonali. Prvým boli sťažnosti hráčov na zaplnenie VB lišty po tom, čo obdržali odmeny z turnaju a to im zablokovalo príjem ďalších, automatických VB. Druhým dôvodom je výskum, niektorí hráči vraj tieto odmeny okamžite nahodili do výskumu čo malo za následok zaseknutie sa na potrebných surovinách na odomykanie technológií. Okrem toho ale zvýšili počet dosiahnuteľných VB z truhlí - namiesto 70 je v nich teraz pomocou požehnání obsiahnutých až 135.[BR][BR]Ďalej padla otázka či niekedy rozmýšľali nad druhou hracou plochou. Vraj áno, ale momentálne o tom nemôžu nič viac povedať ale zaoberajú sa tým a riešia, aký by to malo dopad na hru.[BR][BR]Udalosti - mali sme už niekoľko veľkých udalostí, ktoré fungovali na rovnakom princípe. A vraj majú pre ne v príprave nejaké zmeny a prekvapenia a máme sa na čo tešiť. [smilie--sprite1][BR][BR]Problémy s chatom - vedia o tom, že s ním boli problémy, pracujú na tom a dúfajú, že sa to zlepší už čoskoro.[BR][BR]Ďalej jeden hráč navrhol tzv. \"trophy case\", ktorá by umožnila uschovanie budov z udalostí. K tomu sa vyjadrili tak, že so súčasným systémom (kedy nám po čase tieto budovy stratia hodnotu) nie sú veľmi šťastní. Rozmýšľali už nad tým, čo by mohli urobiť, ale je náročné prísť so správnym riešením. Trophy case je jeden z nápadov ktoré mali, rovnako ako aj druhá hracia plocha, ale sľubujú že nájdu vhodné riešenie. Dokonca, práve teraz pracujú na riešeniach ktoré súvisia s týmto problémom. Možno nám niečo ohľadne toho budú môcť oznámiť už čoskoro.[BR][BR]Padol návrh na vytvorenie novej magickej budovy, ktorá by bola naozaj veľmi ťažko získateľná, ale mala by veľmi vysoké bonusy, ktoré by produkovala napr. raz za týždeň. \"V podstate je to niečo podobné ako Wishing Well a to je spôsob akým rozmýšľajú nad zlepšením týchto budov z udalostí.\" Takže Wishing Well svojou vzácnosťou v budúcnosti možno nebude jediná. [smilie--sprite1][BR][BR]Jeden hráč sa pýtal, či bude Elvenar niekedy PVP hra, čo bolo veľmi rýchlo zodpovedané ráznou odpoveďou: \"Nie\".[BR][BR]Zaoberali sa aj mobilnou aplikáciou, u ktorej spomenuli že pravdepodobne ďalšími prídavkami budú prastaré divy a turnaje."}, {"44": "nějaká nová aktualizace změny nebo něco nového ?"}, {"66": "Díky za poznámky @iDavis[BR]A konečně se tu na to upozorňovalo předem. Je trochu divné, když na youtube najdeš Q&A a přitom fórum se tváří jako že nic. Takže díky i Elvenar Týmu. [smilie--sprite1][BR][BR]Akorát u té možnosti uschovat budovy z eventů jsem jim spíše rozuměla \"trophy case\", dá se přeložit jako \"bedna na trofeje\". Podle mě to dává větší smysl než traffic keys (dopravní klíče?)[BR][BR]PS: @martin2007 Ne, opravdu tam nic nového neříkali. [smilie--sprite1]"}, {"31": "@Prealiena asi máš pravdu, ja keď som ten výraz prvýkrát započul, hneď som si pod tým predstavil nejaké magické kľúče ktorými budeme môcť nechať odcestovať budovy do inventára. [smilie--sprite8] Tak som sa tým ani viac nezaoberal. Ale trophy case dáva väčší zmysel, prepíšem to, díky. [smilie--sprite1]"}, {"31": "Vážení, na bete sa postupne začína testovať jedna z najdlhšie žiadaných funkcií.. [smilie--sprite1][BR]Nočný režim[BR][BR]Spoiler: Nočný režim a 13. kapitola (Mysterious creatures and the 13. chapter)Na obzore je nový svet tajomných bytostí.[BR][BR][IMG]https://i.ibb.co/zJbhMKK/https-image-ibb-co-dpjz-KH-EL-no-n-re-im-png.png[/IMG][BR]Možnosť preskúmať tie najtajomnejšie zákutia Elvenaru sa pomaly blíži na náš server. Tajomné, doteraz pre všetkých neznáme bytosti sa začnú objavovať pri našich mestách u všetkých hráčov, ktorí úspešne dokončili dvanástu kapitolu.[BR][BR][BR]Okrem grafickej zmeny celej hernej plochy v tejto tajomnej kapitole budeme mať možnosť osídliť malé tajomné zákutie hneď vedľa nášho mesta, rovno za mostom. Tam nám neznáme bytosti rozšíria spektrum vedomostí o produkcii živoucího zboží, ktoré priniesli Elementálové.[BR][BR][BR]Krvavočervené rubíny, svitky noci a mesačné hedvábí budú kľúčovými surovinami potrebnými pre plnenie ich požiadaviek. Navyše, v priebehu ich kapitoly budeme môcť odomknúť špeciálnu nočnú budovu, ktorá nám bude pravidelne poskytovať diamanty , a to až do momentu ukončenia kapitoly a trvalého uzavretia ich zákutia.[BR][BR][IMG]https://i.ibb.co/nrd4DNH/https-image-ibb-co-d-W6e-KH-EL-apr-l18-1-png.png[/IMG][IMG]https://i.ibb.co/tX06tS7/https-image-ibb-co-i-OXx6x-EL-apr-l18-2-png.png[/IMG][IMG]https://i.ibb.co/nrd4DNH/https-image-ibb-co-d-W6e-KH-EL-apr-l18-1-png.png[/IMG][IMG]https://i.ibb.co/tX06tS7/https-image-ibb-co-i-OXx6x-EL-apr-l18-2-png.png[/IMG][IMG]https://i.ibb.co/nrd4DNH/https-image-ibb-co-d-W6e-KH-EL-apr-l18-1-png.png[/IMG][IMG]https://i.ibb.co/tX06tS7/https-image-ibb-co-i-OXx6x-EL-apr-l18-2-png.png[/IMG][BR][BR]Ako je zvykom, ani v tejto nočnej kapitole nebudú chýbať vylepšenia manufaktur, tentokrát prídu na rad manufaktury na kryštál, svitky a hedvábí, ktoré bude možné vylepšiť až po 27. úroveň.[BR][BR]Spoiler: Manufaktury - úr. 24-27Manufaktura na kryštál - od úrovne 24 možnosť produkcie krvavočervených rubínov[BR]Manufaktura na svitky - od úrovne 24 možnosť produkcie svitkov noci[BR]Manufaktura na hedvábí - od úrovne 24 možnosť produkcie mesačného hedvábí[BR]13. kapitola avšak prinesie okrem vyššie popísaných funkcií ešte jednu zaujímavú novinku vo výskume. [smilie--sprite1][BR][BR]Spoiler: Tajomná novinkaSíce to nezvyknem, ale aspoň na 1. apríla si srandu môžem urobiť, no nie? [smilie--sprite8]"}, {"43": "No jsem zvědav na ten noční režim,jak to bude náročné na hardware...[smilie--sprite1] Novinky zajímavé,díky za ně iDavis. [smilie--sprite1]"}, {"66": "@papap Ehm, rozuměla jsem, že se jedná o apríl."}, {"48": "Což ale nic nemění a tom, že by to bylo mooc zajímavé [smilie--sprite1]"}, {"43": "Aha,jsem neklikl na tajemný spoiler... [smilie--sprite8] Tak třeba po dnešku se začnou hýbat ledy... [smilie--sprite8][smilie--sprite1]"}, {"31": "Tie ľady sa možno hýbu už dnes.. [smilie--sprite8] To hore bol síce len výplod mojej fantázie, ale to okno s novinkami v hre asi fantáziou nebude.. [smilie--sprite8]"}, {"43": "iDavis ,no každopádně jsi mi vlil/a novou krev do žil a budu netrpělivě vyhlížet,až se tu něco nového objeví...[smilie--sprite1]"}, {"44": "takže nic nového ..."}, {"29": "@iDavis Jak dlouho jsi dělal ten obrázek nočního města? Je perfektní a kdyby to vážně přišlo do hry, bylo by to něco, na co bych se vydržela i jen tak dívat. [smilie--sprite2] Abychom se nedivili, co přijde s další rasou, předpokládám, že živoucí zboží z manufaktur na křišťál, svitky a hedvábí nás určitě nemine.[BR]Jinak díky, to byl ten nejhezčí apríl. [smilie--sprite8]"}, {"2": "Jo, iDavis to má dobře zmáknutý, zbaštil jsme to komplet a protože jsem ještě nedal město dohromady po mentálech, tak mě přeběhl mráz po zádech[BR]elfí kovbojka co se objevila na betě mi tak ftipná nepřijde"}, {"31": "Konečne piatok a spolu s ním opäť jedna zaujímavosť.. [smilie--sprite1][BR]Sneak Peek[BR][BR]Spoiler: Sneak Peek\"Dnes jsem našel klobouk tenhle,[BR]nezná někdo majitele?\"[BR][BR][IMG]https://i.ibb.co/mTGDn6y/https-image-ibb-co-jw1-UKH-EL-sneak-peek-13-4-2018-png.png[/IMG][BR]​"}, {"2": "Upozornění na blížící se dobrodrůžo?"}, {"61": "to byla nějaká čarodějnice, ne? [smilie--sprite8]"}, {"51": "jj...taky bych řekla čarodky...30.4. [smilie--sprite8]"}, {"72": "Pokud vím, tak \"čarodějnice se pálí\" kromě nás jen v německu, takže si nejsem jist, že by z toho udělali nějakou globální událost [smilie--sprite1]"}]