[{"2": "kobouky jsme na betě nikde neviděl, ale co ta změna VB za instanty v divech?[BR]Máte o tom někdo nějaké podrobnosti?[BR]Co jsem zvládnul vykoukat tak celková hodnota odměny pěkně vzrostla, ale jejich \"more contributors will receive rewards\" mi vychází na jednoho navíc."}, {"48": "Tak oni píšu \"on higher levels\" - nevim na jakym lvl máš budovy, ale zkus najít rozestavené lvl15+, a tam bych to čekal, že bude poznat [smilie--sprite1]"}, {"31": "Áno došlo k zmene odmien za výpomoc pri prispievaní do prastarých divov. Viac nebude možné získať VB, ale požehnání na VB, ktoré teda nejde využiť vo výskume, rovnako ako prednedávnom zmenili turnaje. Konrétne úpravy a zmeny závisia od levelu na ktorom sa prastarý div nachádza, tu je obrázok starej a novej verzie pre nejaký div na leveli 12."}, {"48": "To vypadá docela slušně [smilie--sprite1]"}, {"65": "hele to je v pohodě [smilie--sprite1] tak nějak už jsem úplně přestal přispívat do divů za účelem zisku VB, raději si prorstě projedu stránku 2 a 3 turnajů. což doufám, že nám nevezmou, protože to už je pomalu poslední možnost, jak si urychlit výzkum. [BR][BR]klasická situace : přispěju 10 VB do divu, už mám jistých 10 zpátky a runu k tomu. jdu spát ve 12, inspirující rozjímání z nějakého neznámého důvodu doběhne o půl 2. druhý den v 10 k tomu sednu, a VBček tam mám 11, protože majitel dokončil div v 1 v noci. takže jsem 9 v mínusu :-D [BR][BR]tedy za mě rozhodně plus."}, {"2": "jo, to jsme taky párkrát zažil"}, {"61": "bude trochu zaprasenej inventář [smilie--sprite8]"}, {"2": "zasuješ odměny tak často?"}, {"61": "celkem jo [smilie--sprite8]"}, {"61": "počkat, teď mi to došlo!!! jako nevadí mi, že to budu muset hodit do divů, ale jestli jako dostanu požehnání a budu muset použít 25 bodů najednou, tak to je trochu blbý :/ jako chápu, že je chtějí směřovat, ale možnost nerodělit tu výhru podle uvážení, to by mě naštvalo hodně -_-"}, {"2": "odměny jsou složené z požehnání 20VB a 5VB"}, {"61": "no tak to je pěkně na prd :/[BR]už vidím, jak někde přispěju a protože budu potřebovat tu runu, tak se tam s někým budu přehazovat a místo po bodech to mám dělat po 5 bodech, jo? -_-"}, {"43": "Copak to je dnes na betě za věc,třikrát rychlejší produkce v manufakturách.Místo 3 hodinovek je 1 hodinovka,místo 9 je 3 atd... [smilie--sprite1]"}, {"72": "A kde to je, v kouzlech nebo? Mě to probliklo ve chvíli, kdy mi hra spadla, nestačil sem přečíst, takže zrovna hledám co to je.."}, {"43": "Ne,ne je to normálně v manufakturách,jak zadáváš co mají vyrobit,tak se akorát zkrátili časy.A koukám,že to je jen jednou,já myslel že to bude celý den...[smilie--sprite8]"}, {"31": "Jedná sa o akýsi \"value manipulator\", informačné okno v novinkách píše o 2 hodinách, počas ktorých tieto skrátenia časov budú dostupné. [BR][BR]Spoiler: Obrázok[IMG]https://i.ibb.co/jzdDsFK/https-i-imgur-com-de-Gv-W8-T-png.png[/IMG][IMG]https://i.ibb.co/9v15TP9/https-i-imgur-com-i-FJFk-KF-png.png[/IMG][BR]Pokiaľ viem tak je to nastavené na plánované zobrazovania v novinkách, takže nemyslím si že ide o nejaké kúzlo, ak to teda neplánujú zmeniť."}, {"31": "Sneak Peek[BR][BR]Spoiler: Sneak Peek\"Zda byly vaše tipy správné,[BR]když přidám i koště,[BR]bude snad všem jasné.\"[BR][BR][IMG]https://i.ibb.co/LZLhFqw/https-s14-postimg-cc-47ffpznm9-EL-sneak-peek-13-4-2018-2-png.png[/IMG]"}, {"29": "Mě napadl akorát text jedné krásné písně...[BR][BR]Vítr vane pouští.[BR]Po písku žene klobouk.[BR]Zahnal ho do houští.[BR]Starý a černý klobouk.[BR][BR]Kdepak je ta hlava,[BR]která klobouk nosila?[BR]Byla černá či plavá?[BR]Komu asi patřila? [smilie--sprite8]"}, {"2": "Ježek je klasika[BR][BR]Takže je to malý event na čáry?"}, {"66": "Nebo je to další dobrodružství, jak říkal @GorGlin Tam už byl čarodějnický klobouk.[BR]Tak tam přidají ještě úkol s koštětem.[BR]Bůh ví, kam to v tom dobrodružství dotáhnou. [smilie--sprite1]"}]