[{"96": "Nebude to nějaký malý event k 1 květnu pálení čarodějnic [smilie--sprite1]"}, {"50": "Spíše k 30. dubnu, to jsou čarodějnice [smilie--sprite1]"}, {"31": "Nová úkolová rada sa blíži.. [smilie--sprite1][BR]Valpuržina noc[BR][BR]Spoiler: Valpuržina noc (Walpurgis Night)[IMG]https://i.ibb.co/XtZmphV/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-walpurgis2018-Banner01-png.png[/IMG][BR]Predpokladaný termín: 23.4. - 3.5.[BR][BR]Úkolová rada bude dostupná aj v mobilnej aplikácii.[BR][BR]Zároveň, ako prvýkrát budeme môcť získavať budovy aj v priebežných odmenách.[BR][BR][IMG]https://i.ibb.co/ZYBJSn4/https-i-imgur-com-3ub-Ok-QK-d-jpg-maxwidth-640-shape-thumb-fidelity-medium.jpg[/IMG][BR][BR]Všetky informácie o tejto úkolovej rade budem postupne dopĺňať do tohto spoileru.[BR][BR]Spoiler: ÚlohyPrehľad úloh, informácií a všetkých odmien v tejto úkolovej rade nájdete tu.[BR]Hlavná cena[BR]Venarovo spirituální centrum[BR][IMG]https://i.ibb.co/9NRLXj6/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-walpurgis2018-Reward01res-png.png[/IMG][BR][IMG]https://i.ibb.co/bQyv6fX/https-i-imgur-com-iu-OD2a-M-png.png[/IMG][BR][BR]K tejto úkolovej rade sa zároveň viazali posledné sneak peeky. [smilie--sprite1]"}, {"72": "Ten předpokládaný termín asi nebude od dnes, dnes to začalo teprve na betě [smilie--sprite1]"}, {"73": "@iDavis jsi úžasný, děkuju ;-)"}, {"66": "Jenom deset dní (11 dle Marindora)? Doufám, že to nebude příliš náročné."}, {"5": "[QUOTE=\"Prealiena,[BR]11 včetně[BR]vypadá to jednoduše...nějaké relikvie, jinak pohodový event...spíše dárek pro všechny i pěkná odměna [smilie--sprite1]"}, {"48": "Potvrzuji, co jsem koukal na úkoly, tak i bez přípravy by mělo jít v pohodě zvládnout... S lehkou přípravu snad i během prvního dne - takže za mne dopředu říkám \"díky za levné odměny\" [smilie--sprite1])[BR][BR](snad si to teď nepřečtou a nezmění [smilie--sprite8] )"}, {"97": "Ten seznam úkolů je už takhle kompletní nebo bude ještě něco přibývat?[smilie--sprite2]"}, {"48": "48 úkolů... přijde ti to na 10 dní málo? [smilie--sprite1])"}, {"97": "No to rozhodně ne[smilie--sprite8]Ale hraju zatim jen chvíli tak nevím co se dá všechno očekávat[smilie--sprite2]"}, {"61": "mně se to moc líbí [smilie--sprite1]"}, {"48": "Fragola napsal/a:\t\t\tNo to rozhodně ne[smilie--sprite8]Ale hraju zatim jen chvíli tak nevím co se dá všechno očekávat[smilie--sprite2]Klikněte zde pro zvětšení...[BR]tak to ber, že takto je to komplet... na Davise je spoleh [smilie--sprite1]"}, {"66": "Lidi jak dlouho trvá ta zrychlená produkce manufaktur?[BR]Nechci tam zadat přes noc Obdivuhodný oltář na 8 hod a ráno zjistit, že už je zase 24 hod.[BR][BR]update: Zkoukla jsem iDavisův obrázek z bety a vysvětluje to tu zlatou barvu výrobního času. Měla jsem to tak dnes už pár hodin před tím. Něvěděla jsem, jestli je to po nové aktualizaci zvýraznění max bonusu manufaktur, nebo změna grafiky v nové verzi. A ono to bylo upozornění před blížícím se zkrácením. [smilie--sprite1]"}, {"98": "Já žádnou zrychlenou výrobu manufaktůr nemám a půlka cechu taky ne to je celkem nefér[smilie--sprite3]"}, {"92": "Mně funguje zrychlená výroba v obou světech, je to super, teď jen jak to bude dlouho trvat [smilie--sprite1] @iDavis, nemáš nějaké info?"}, {"99": "Mě by spíš zajímalo, jestli to mají všichni, nebo jen někteří. Ve společenství jsme zatím rozděleni na ty, kdo hrají v aplikaci a zrychlení nemají, a na ty, kdo hrají na počítači a zrychlení mají, ale zatím je nás jen malý vzorek, tak nevím, jestli to není jen náhoda... Puffin mi dneska stávkuje, tak se na PC verzi nepodívám..."}, {"74": "2x PC, 2x acc na stejném světě a je jednou výhoda.....hraji já a dcera....nejspíš vázáno na IP adresu..."}, {"92": "Aha... tak zdá se, že jediný z našeho společenství, komu to urychlení funguje, jsem já..."}, {"17": "Ricollo napsal/a:\t\t\tJá žádnou zrychlenou výrobu manufaktůr nemám a půlka cechu taky ne to je celkem nefér[smilie--sprite3]Klikněte zde pro zvětšení...Ahoj, jelikož se jedná o úplnou novinku, rozhodli jsme se, že tentokrát ji dostane jen omezený (a náhodně vybraný) počet hráčů. Ale nemusíš se bát, pokud bude vše fungovat bez problémů, tak máme v plánu, že v budoucnu bude tato nabídka zpřístupněna všem hráčům! [smilie--sprite2]"}]