[{"66": "Jo, škoda, že to nefunguje na mobilu. Ráno jsem si z mobilu zadala první výrobu a běží mi 3 hod i po přihlášení na počítač.A to mi v rohu stále svítí ikonka časového bonusu"}, {"100": "Tak na to se těším "}, {"101": "Jsem na to taky zvědavá, škoda, že jsem si to nemohla vyzkoušet už dřív, ale těším se "}, {"31": "Aktuality z bety...[BR]Vylepšovanie budov z udalostí a ich vybalancovanie[BR][BR]Spoiler: Zmeny v balancovaní budov z udalostíNa bete dnes prebehol dôležitý update pre plánované úpravy v nadchádzajúcich udalostiach. Rozhodli sa upraviť niektoré hodnoty budov, ktoré sme mohli v udalostiach získať pred marcom 2017, keďže vtedajšie balancovanie budov bolo odlišné od toho dnešného. To znamená, že väčšina týchto budov, ktoré poskytovali iba kultúru bude teraz poskytovať kultúry viac, zatiaľ čo niektoré menej a niektoré zostanú nezmenené. Budovy ktoré poskytovali kultúru aj obyvateľstvo budú poskytovať menej kultúry, hodnoty obyvateľstva zostanú nezmenené.[BR][BR]Čoskoro budeme schopní vylepšovať naše budovy z udalostí! Momentálne sú v poslednom štádiu vývoja tejto funkcie, ktorá bude dostupná používaním nového kúzla, ktoré nahradí naše doterajšie blueprinty.[BR][BR]EDIT: Podľa najnovších informácií to vyzerá tak, že zmenené budú aj hodnoty obyvateľstva. Napríklad kultúrna budova Záhrada prepychu, ktorá dáva pre istú kapitolu 1150 kultúry aj obyvateľstva, bude dávať 680 kultúry aj obyvateľstva. Nové kúzla na vylepšovanie budov nám vraj ale umožnia následne navýšiť hodnoty."}, {"16": "No já jen doufám, že ten pokles nepřeženou (právě čtu diskuzi na betafóru), jsou hráči, kteří mají spoustu populace z populačně-kulturních hybridů ze zimní a podzimní události a takoví nemusí výrazný pokles populace zkousnout a mohli by se hrou praštit...[BR][BR]Já v nejhorším úplně zavrhnu populačně-kulturní hybridy a budu hrát dál bez nich s větším množstvím obytných budov."}, {"61": "jen by mě zajímalo, jak to kouzlo půjde získat a o kolik to vylepší. Jestli zahrada na nějaké úrovni klesne z 1150 na 680 a jedno kouzlo ji vylepší třeba na 820 atd a někdo má tyhle budovy 4, tak bude třeba potřebovat 12 takovýchto kouzel, aby se vrátil na původní hodnoty. Jestli to třeba bude denní odměna v eventu, tak by za prvé musel čekat do dalšího eventu, za druhé získat 12 denních odměn může být zabiják celého eventu. A pak možná ještě nějaké další budovy, co by chtěly vylepšit. Takže logicky spousta z nich by padla. A nějak se zdráhám věřit, že by šlo vyrábět v knihovně...[BR]ale moc si přeju, ať jsem špatným prorokem "}, {"40": "pořád není jasně daný jak to bude, test probíhá na betě.[BR]Nechme se překvapit a pak můžeme - chválit-nadávat!?"}, {"72": "Začal sem hrát v srpnu, tak doufám že alespoň tohle platí a na nic mi nesáhnou. Sem sice v dracích a kvůli maně sem většinu těch hybridů zboural, ale stejně, o co člověk snažil a získal s tím, že je to permanentní (dokonce dle popisu), by tak mělo zůstat."}, {"28": "Změna by se měla týkat všech budov, které byly představeny před březnem 2017. To znamená, že např. cukrový otec pralesa, který jsem sice získala v zimě 2017, ale již byl v eventu v zimě 2016 bude také změněn. Níže je odkaz, kde jsou konkrétní změny vypsány. [BR][BR]http://www.elvenarchitect.com/beta/buildingchanges154/[BR][BR]@Karindian Tipuji, že zůstane jako odměna v 10 truhle turnaje a vylepší budovu o jednu úroveň, ale necháme se překvapit "}, {"102": "No tak smažu co se dá a půjde to pryč, tohle je podraz. Na hraní už moc čas nemám a jestli mi bude pak svítit po městě tuna červených čísel, tak se jím na to vybodnu  Místa málo a tyhle budovy jsem těžce \"vykoupil\" abych je měl :/"}, {"31": "Podľa toho čo som zatiaľ videl, graficky by toto nové \"kúzlo\" malo vyzerať ako požehnání. A keďže v porovnaní s plánkami bude mať rozšírené spektrum možností jeho využitia (konkrétne vylepšovania magických budov, magických dílen a budov z udalostí), tak očakávam, že bude mať aj rozšírené možnosti získania. Nie je teda vylúčené, že sa bude objavovať napríklad niekde v akciách alebo podobne.."}, {"102": "Tak já přijdu o 4000 kultury a 580 lidí minimálně, tak to děkuji, kulturu bych přežil ale kdybych to věděl, tak některé jiné budovy nebourám jen abych umístil tyhle... ty lidi jsou ale problém, to abych zase postavil další budovu. [BR][BR]Nechápu proč nám v orcích seberou tolik, a těm v elfech tolik přidají. Ach jo"}, {"61": "@iDavis v tom případě je to ještě lepší jak plánek, to se o tu dostupnost celkem bojím :/ a jak jsem psal, kdy a kde jich sehnat tolik aby to dorovnalo tu ztrátu? Jako do budoucna dobrý, ale začátek smutný :/"}, {"103": "iDavis napsal/a:\t\t\tAktuality z bety...[BR]Vylepšovanie budov z udalostí a ich vybalancovanie[BR][BR]Spoiler: Zmeny v balancovaní budov z udalostíNa bete dnes prebehol dôležitý update pre plánované úpravy v nadchádzajúcich udalostiach. Rozhodli sa upraviť niektoré hodnoty budov, ktoré sme mohli v udalostiach získať pred marcom 2017, keďže vtedajšie balancovanie budov bolo odlišné od toho dnešného. To znamená, že väčšina týchto budov, ktoré poskytovali iba kultúru bude teraz poskytovať kultúry viac, zatiaľ čo niektoré menej a niektoré zostanú nezmenené. Budovy ktoré poskytovali kultúru aj obyvateľstvo budú poskytovať menej kultúry, hodnoty obyvateľstva zostanú nezmenené.[BR][BR]Čoskoro budeme schopní vylepšovať naše budovy z udalostí! Momentálne sú v poslednom štádiu vývoja tejto funkcie, ktorá bude dostupná používaním nového kúzla, ktoré nahradí naše doterajšie blueprinty.[BR][BR]EDIT: Podľa najnovších informácií to vyzerá tak, že zmenené budú aj hodnoty obyvateľstva. Napríklad kultúrna budova Záhrada prepychu, ktorá dáva pre istú kapitolu 1150 kultúry aj obyvateľstva, bude dávať 680 kultúry aj obyvateľstva. Nové kúzla na vylepšovanie budov nám vraj ale umožnia následne navýšiť hodnoty.Klikněte zde pro zvětšení...[BR]Já mám polovinu populace z Kulturních budov, a kulturu jen díky nim také.[BR][BR]Všechno ze soutěží, kde sem za to platil i peníze abych je získal protože mě hra baví. S obyvatelstvem jsem jen tak tak na tom. Z takovou ztratí smysl vůbec nějaké soutěže dělat jestli to půjde takto dolů a raději budu stavět obytné budovy a sbírat kouzla :///[BR]Jinak nechtějí změnit doufám i Diamantové Budovy, kupoval jsem je s tím účelem že se vyplatí. Jinak bych na Elvenar pěkně prděl když to takto dělají a mění k horšímu věci za které druzí už Zaplatili!!![BR][BR]Jako vývojář vidím v tomto hrubou chybu vůči hráčům, ale skvělé je to že se dají Kulturní Budovy vylepšit.[BR] Pokud je nápad takový že díky tomu že pujdou vylepšit až do své doby obyčejnou cestou za materiály a surky, tak by vybalancování ne extrémní nebylo tak hrozné, protože některé budovy takto si zpátky dotáhneme na svoji dobu z té dávné a opět tím získáme obyvatelstvo zpět.[BR][BR]I když největší hráči kteří je nemají kam vylepšovat teď na tom budou bídně a nedovedu si představit když mají obyvatelstvo teď na nule, a padne jim to třeba do - 2000 tak jak mají s tímto nakládat když nemají ani místo, ani kam co stavět, a není tu ani druhá mapa ještě. To budou opět muset prodávat doly a jiné budovy, jak to děláme furt dokola poslední dobou a získávat zpátky lidi.[BR]Já který hraji jen na soutěžní budovy v tímto, tak jak to zavedou tak počítám že budu mít také tak -1000 lidí a zničeho nic se nebudu moct pohnout na další levly budov, protože také nemám místo už ani na osadníky jak to moc lidí chce. ... Měli by spíš PŘIDAT LIDI NA VŠECHNY KULTURNÍ BUDOVY, ABY POLOVINA MĚSTA NEBYLA JEN OBYTNÁ ČÁST A MOHLI JSME SI HEZKY HRÁT. ... TENTO KROK JE HRUBÝ NEDOSTATEK A PŘEJI SI HO ZMĚNIT A LIDI NA BUDOVÁCH NAVÝŠIT. VELCÍ HRÁČI BUDOU MÍT PROBLÉM KDYŽ BUDOU MÍT OBYVATELSTVO V MÍNUSU A PLOCHU UŽ MAXIMÁLNÍ,... TAKŽE BUDOU MUSET MAX PRODAT DOLY, KDE PŘIDALI DALŠÍ 3 SURKY NAVÍC ALE ŽÁDNÝ MÍSTO PRO NĚ. ... KDE JE TA SLIBOVANÁ DRUHÁ STAVEBNÍ PLOCHA TEDA???[BR][BR]Nápad Elveranských vývojářů, mít město plné obytných budov kam jen oko dohlédne, což je Hnusné zprominutím, se mi Vůbec Vůbec nelíbí![BR]Přitom někteří lidi už zapaltili aby budovy ze soutěží třeba získaly protože dávají dobré počty obyvatel.[BR][BR]Tento nápad mě ÚPLNĚ ODRAĎUJE OD HRY PŘÁTELÉ. A nějak mě tím hru chce znechutit, až bych začal hrát klidně jiné, pokud takovéto změnit chtějí zavést.[BR][BR]Chci aby PŘIDALI OBYVATELSTVO NA KULTURNÍ BUDOVY, ABY JSME NEHRÁLI JEN S MĚSTEM PLNÝM OBYTNÝCH BUDOV, COŽ SE MI VŮBEC NELÍBÍ PROTOŽE TO KAZÍ VIZUÁLNÍ DOJEM, MÍT JEDNU VEDLE DRUHÉ.[BR][BR]LOL TAK NÁPAD ZA 5 ... Jestli chcou kvůli tomu přijít o hráče i peníze.[BR][BR]\"Doporučuji zavčas tyto mé zprávy, a vlastně celé vyjádření nás všech tady přeposlat velmi rychle na Elvenar, aby s tím stihli něco udělat. I když ho dali už do oběhu, než jim začnou odcházet lidé i peníze. Nejsem ve svém životě profesionální poradce jen tak. A jelikož se zabívám hlavně průzkumeme trhu Her, Filmů a Knih po celém světě, několik let, tak si dovoluji napsat že o tom něco vím. ... i když mě stačí na to i selskej rozum a podívat se co tu my hráči k tomu píšeme, jako nesouhlas. A pochopitelně otázky ztráty peněz i hráčů se firmy dotkne. ... za mě s tímto nesouhlasím a přeji si naopak Navýšit Obyvatelstvo z důvodů Místa + Vizualizace Krásy města. Protože mít polovinu města jen budovy opravdu není co na co koukat a něco krásného. ... Tady se nehraje jen na score, což doufám na druhé straně ví dost dobře. ... Rád bych jim poradil osobně jestli tam nemají schopné lidi, soudím z tohoto i zahraničního fóra, ze slov těch kteří hru hrají.\"[BR][BR]Tyhle mínuska a další mluví sami za sebe,... a mínus a červená není dobrá pro hráče ani pro firmu. Jestli si to jejich finanční herní poradce neuvědomuje a chová se vůči hře stejně jako bussinesman k firmě. Což je velmi velký rozdíl, protože hráčovi ztratit chuť hrát stačí jen kliknou na křížek, kdežto člověk ve firmě si musí najít novou práci. Je to velký rozdíl, a touto cestou, tímto nápadem se kterým nevím kdo přišel, přijdou jen o svoji proslulost a chuť. ... Pokud chtějí hru více zpestřit, měli by opravdu Přidat Obyvatele kde si budeme moci dovolit stavět mnohem více jiných budov a mít tak město opravdu krásné což znamená pro některé, opět si některé takové budovy i někdy zaplatit. Protože se vyplatí někomu kdo rád takto hraje investovat do budovy která má opravdu dobrý bonus. Sám nejsem proti koupit si sem tam něco co má Velké + na lidi i kulturu. I klidně jen na lidi. Ale takto co nám tu ukázali, nevidím ani chuť něco kupovat  Spíš mě to odrazuje, aby se nestalo něco takového že by hrozilo zase nějaké snížení.[BR][BR]Děkuji vám za můj čas, a žádám těmito slovy i celým tímto fórem Administrátory a Podporu o včasné odeslání na Elvenar k majitelům, aby předešli zbytečným finančním ztrátám i ztrátám hráčů s dobrou chutí dál ve hře pokračovat s velkou zábavou, kterou zde doposud bez chyby šířili opravdu Skvěle ♥[BR][BR]Ancary[BR][BR][BR]• http://www.elvenarchitect.com/beta/buildingchanges154/[BR][IMG]https://i.ibb.co/DKLCM54/https-cz-forum-elvenar-com-index-php-attachments-m-nuska-jpg-2378.jpg[/IMG][BR]// Sloučeny příspěvky, Dellingr"}, {"72": "Tak ty stomy smažu, no co už. [BR]Nicméně směřuje to k tomu, že bude jedno co to bude za budovu, ale při určité velikosti bude důraz na to, aby dávala stejné bonusy. Takže unikátnost ve smyslu výhodnosti vymizí. Přesune se do setů, komunitních budov a podobných exkrementů zabalených do třpitivýho pozlátka. Hurá."}, {"62": "iDavis napsal/a:\t\t\tČoskoro budeme schopní vylepšovať naše budovy z udalostí! Momentálne sú v poslednom štádiu vývoja tejto funkcie, ktorá bude dostupná používaním nového kúzla, ktoré nahradí naše doterajšie blueprinty.\t\tKlikněte zde pro zvětšení...[BR]Tak na tohle jsem nejen zvědavá, ale se i těším... "}, {"31": "S čím sa dnešný sneak peek spája? [BR]Sneak Peek[BR][BR]Spoiler: Sneak Peek[IMG]https://i.ibb.co/DMV4KrY/https-image-ibb-co-np-Qfmx-EL-sneak-peek-27-4-2018-png.png[/IMG]"}, {"99": "Že by slibované kouzlo na vylepšení eventových budov? [BR][BR]//Odstraněna zbytečná citace, Iddun"}, {"2": "lidi co ted pilně shromaždují plánky na další kapitolu je můžou zapílit, nebo dojde ke konverzi?"}, {"66": "Plánky se přemění v kouzla. Potvrdil to Marindor na fóru na betě.[BR]\t\t\tFor your questions about the blueprints and magic buildings: Your current blueprints will indeed be converted into the new spells, which will be usable on both the Magic Residence/Magic Workshop AND Event buildings Klikněte zde pro zvětšení..."}]