[{"2": "Takže pokud mám hvězdy, které už jsou dost stará záležitost a k tomu plánky, tak sice ztratím, ale pokud jsem od jejich získání postoupil ve výzkumu, tak můžu úpravou naopak získat[BR]tedy čumačumárum kdo zabere v turnajích žádné čekání ho nečeká[BR][BR]Připadá mi, že i středně aktivní hráč na tomhle jen vydělá."}, {"61": "nemám a nikdy jsem neměl plánek, protože jsem ho ani doteď nepotřeboval. Myslím, že hraju dost aktivně a nevydělám :/"}, {"2": "plánky se rozdávají zadarmo"}, {"94": "GorGlin napsal/a:\t\t\tTakže pokud mám hvězdy, které už jsou dost stará záležitost a k tomu plánky, tak sice ztratím, ale pokud jsem od jejich získání postoupil ve výzkumu, tak můžu úpravou naopak získat[BR]tedy čumačumárum kdo zabere v turnajích žádné čekání ho nečeká[BR][BR]Připadá mi, že i středně aktivní hráč na tomhle jen vydělá.\t\tKlikněte zde pro zvětšení...No mne osobne to tak neprijde. Hraju od leta, a nejvic budov mam asi ze zimniho eventu, kdy jsem zacinal trpaslíky, takze tet diky tomu prijdu o několik tisíc kultury, jenom na okouzlujících stromech. :-([BR]Dostat se na poslední bednu v turnaji nemam sanci.[BR]Ps. snazim se hrat pomerne aktivne."}, {"61": "GorGlin napsal/a:\t\t\tplánky se rozdávají zadarmo\t\tKlikněte zde pro zvětšení...a kde?"}, {"72": "V turnajích za poslední truhlu. Kterou pravidelně získává tak pět klanů na serveru... to možná ještě přeháním."}, {"61": "od kdy jsou Tvoje příspěvky sarkastické? [smilie--sprite8] Jsem tak trochu Sheldon [smilie--sprite8]"}, {"102": "jinými slovy právě zvýhodňují TOP hráče na úkol menších, díky získávání posledních truhel budou moci mnohem rychleji růst -> efekt, nůžky se budou více rozevírat, no co už, ještě že nehraji na žebříček [smilie--sprite1]"}, {"2": "já jsme ho taky nikdy nepotřeboval, ale mám jich kopu, možná právě proto že je nepotřebuju[BR]dostávám jeden každý turnaj[BR]nevím co si představuješ pod aktivní hrou[BR][BR]stejně tak nevím co si představujete pod TOP hráčem[BR]znám hráče, co jsou v žebříčku pod 700 nebo nahrají v turnaji 500 bodů a plánky mají.[BR][BR]možná někde děláte chybu, nebo nevyužíváte potenciál hry naplno[BR]z toho ale neviňte druhé"}, {"61": "jde o to, že obsah truhel v turnaji pro mě nikdy nebyl natolik atraktivní, abych kvůli tomu vstupoval do velkého, celoaktivního společenství. Teď není turnaj, tak to nemohu spočítat, ale tuším, že aby se otevřela poslední truhla s plánkem, tak každý v turnaji musel nahrát kolem 2000 bodů. Což já asi dávám, ale společenstvích, kde to udělá každý hráč myslím tolik nebude. Tak jsem vnímal, že právě kvůli tomu, že ne každej splnil danou účast v turnaji, vznikali rozepře uvnitř společenstvích.[BR]No a právě proto, že jsem plánky vůbec nepotřeboval (nemám kouzelné budovy) a chtěl jsem mít určitej klid, nechtěl jsem být pod tlakem nebo naštvanej na někoho jiného, že kvůli jeho neaktivitě ostatní tratí. Jsem nikdy do žádného velkého společenství nevstoupil. Jinak myslím, že využívám potenciál na velké úrovni. Jen mi prostě těch pár VB z truhel za to nestálo (o kouzlech, relikviích a runách netřeba mluvit...)[BR]Každopádně se asi brzy po nějakém společenství, které otvírá pravidelně poslední truhlu, poohlédneme, protože teď už to bude mít větší význam..."}, {"2": "Já jsme maximalista, když můžu mít každý týden 75 VBček navíc, je mi 60 málo.[BR]ted je to ještě víc[BR]to je samozřejmě věc, která má své klady i zápory[BR]pro člověka který si chce ve hře občas zaklikat pořád není nutnost vstupovat do společenství a honit se za plánky[BR]Eventové budovy s časem ztrácejí na výhodnosti a musí se bourat a nahrazovat.[BR]Ted už jich je tolik, že nemáš záruku, že v příštím eventu bude vhodná náhrada zrovna té budovy kterou bys rád[BR]Mám Kult Fénixe už dvě kapitoly starý doufal jsem že ho na velikonoce vyměním za něco lepšího a ejhle, žádná po mě přitažlivá náhrada nepřišla[BR]je na tobě jestli si prostě počkáš, nebo budeš hledat jiné cesty."}, {"65": "@Karindian : 1600 na člověka to vychází. http://crazywizard.info/en/tnt_tournament_rewards.html (odměny už samozřejmě aktuální nejsou, ale je tam aspoň ten počet bodů na každou truhlu).[BR][BR]my dáváme 6 truhlu minimálně, průměrně 7, semtam 8. těch VB do divů to v tuto chvíli vychází něco mezi 50-90 (cca, abych nekecal...) za zmíněnou 6. - 8. truhlu. plus to, co si člověk nahrabe v turnaji. klidně dalších 50-100 VB za ten týden. další výhoda je, že si píšeme, kdo končí který div. odměny jdou prioritně členům spolku. VBček tím člověk většinou moc nezíská, ale runy se dají sbírat dobře.[BR][BR]a není pravda, že poslední truhlu z turnaje získává jen pár top spolků. jsou i menší (bodově), ale o to zapálenější."}, {"44": "něco nového nebo nová rasa ? Děkuji"}, {"31": "No, väčšina novej rasy je už hotová, ale ešte si budeme musieť počkať. [smilie--sprite2] Ale je sa na čo tešiť.. [smilie--sprite2]"}, {"44": "a co by to mělo být a od kdy"}, {"91": "Hratelná rasa jako dám příklad třeba půlelf? Vždyť to zavrhli, že ten kdo začal hru dřív si jí nemohl vybrat, takže to nebude. To bych hrál radši za půlelfy než celé elfy."}, {"31": "@Pauleo reč bola o novej spriatelenej rase."}, {"72": "Ještě k těm plánkům, mít bych nějaký měl, ale v podstatě jsem nenašel kde a nic za diamanty kvůli tomu kupovat nebudu. V žádném menu co jsem prošel se nevyskytuje."}, {"66": "@athlan Jo, taky nevím, kde jsou.[BR]Na Wiki k tomu píšou pouze toto:[BR]\t\t\tPočet vlastněných plánků zjistíte tak, že myší najedete na ikonku  v okně na vylepšení jedné z kouzelných budov.\t\tKlikněte zde pro zvětšení...A já žádné kouzelné budovy nemám. [smilie--sprite3]"}, {"31": "Už sa to niekde riešilo a ak sa nemýlim, ak nemáte kouzelnú budovu, v hre sa to nedá nijak zistiť. Možno to ale vedia zistiť na podpore."}]