[{"66": "Hlavně, jestli se to shromažďuje i bez nich.[BR]Abychom pak nebyly hahraný, až přijdou ty kouzla. [smilie--sprite1]"}, {"48": "Nejen že je potřeba mít kouzelnou budovu, ale navíc \"neupgradovanou\"... Mám jedinou, už z elementálů a tudíž taky zjistim kulový [smilie--sprite3][BR][BR]Jinak 10. truhlu získává pravidelně 8 spolků na cz2, a 9 spolků na cz1 ;-)"}, {"31": "Dobrodružstvá spoločenstiev[BR][BR]Spoiler: Nové koloBudúci týždeň vo štvrtok 10.5. by sa malo začať nové kolo udalosti. Zmeny by mali byť minimálne, nastavenie by malo byť rovnaké ako v druhom kole."}, {"31": "Nová úkolová rada sa blíži... [smilie--sprite1][BR]Crash and the Undead[BR][BR]Spoiler: Crash and the Undead[IMG]https://i.ibb.co/PYbftnG/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-halloween2017-Banner02-png.png[/IMG][BR]Predpokladaný termín: 14.5. - 28.5. - môže sa zmeniť![BR][BR]Na bete sa v pondelok začína táto nová úkolová rada, ktorá je vlastne zopakovaním halloweenskej z roku 2017. Jej zmysel je vraj taký, aby sa \"nenudili\" hráči, ktorí v mobilných verziách nebudú môcť hrať Dobrodružstvá spoločenstiev (viď. príspevok vyššie). To je zároveň dôvod, prečo bude táto úkolová rada dostupná iba na mobile.[BR][BR]Upozorňujem, že tentokrát je vyššia šanca že sa zmenia dátumy, ako tejto úkolovej rady tak aj najbližších dobrodružstiev, takže ich berte s rezervou.[BR][BR]Spoiler: Úlohy1. Utrať 2 VB[BR]2. Získaj nejaké množstvo mincí[BR]3. Vyrob 7x obyčajné nástroje[BR]4. Presuň 1 budovu[BR]5. Získaj malé množstvo mramoru[BR]6. Získaj malé množstvo ocele[BR]7. Získaj malé množstvo dreva[BR]8. Vyrob 3x chlieb[BR]9. Vyrob 7x produkt základnej bonusovej manufaktury (3-hodinový)[BR]10. Vyrob 5x produkt základnej bonusovej manufaktury (9-hodinový)[BR]11. Vyrob 1x mramorová mozaika + vyrob 1x cenný prsten + vyrob 1x dřevěné figurky[BR]12. Vyrob 1x okrasné sloupoví + vyrob 1x válečná maska + vyrob 1x dřevěná truhla[BR]13. Utrať 25 VB[BR]14. Kúp 17 VB[BR]15. Získaj 19 relikvií[BR]16. Vyrob 4x produkt základnej bonusovej manufaktury (24-hodinový)[BR]17. Získaj 1x kúzlo Magický dar ALEBO použi 1x kúzlo Magický dar[BR]18. Získaj nejaké množstvo mincí[BR]19. Trénuj nejaké množstvo jednotiek[BR]20. Vyskúmaj 1 technológiu ALEBO vylepši 1 budovu na level 17 alebo vyšší[BR]21. Vyrob 25x chlieb[BR]22. Vyrob 15x pokročilé nástroje[BR]23. Vyrob 33x nápoje[BR]24. Vyrob 10x košík jedla[BR]25. Získaj nejaké množstvo zásob[BR]26. Vyrieš 17 stretov[BR]27. Vyrob 7x sada nástrojov[BR]28. Vyrob 37x obyčajné nástroje[BR]29. Preskúmaj 1 provinciu[BR]30. Vylepši 4 budovy na level 5 alebo vyšší[BR]31. Vyrieš 23 stretov[BR]32. Získaj 29 relikvií[BR]Hlavné odmeny:[BR][BR][IMG]https://i.ibb.co/6vFDqPG/https-image-ibb-co-e-S6mb7-EL-akcia-m-j-2018-h-odmeny1-png.png[/IMG]"}, {"66": "Nějak mi to nedává smysl, halloween v květnu. A ty atributy budov (pop/kultura) jsou stejné jako v zimě?[BR]Bude to vůbec dostupné i v pc, nebo je to jen paralelní mobilní akce?"}, {"48": "Je to náhrada pro mobily... Halloween na mobilech nešel, a na PC ve stejnou dobu poběží dobrodružství, které zase nejde na mobilech - tak aby hráči obou platforem měli co dělat (tak to tvrdí na betě) [smilie--sprite1]"}, {"29": "A co když někdo využívá mobil i pc? [smilie--sprite12]"}, {"31": "Údajne bude môcť hrať obe. [smilie--sprite1] Ale nemal by to byť problém, dobrodružstvá budú trvať asi polovicu času úkolovej rady, takže v tej druhej sa dá venovať už iba jej.[BR][BR]Malo by to fungovať tak, že činnosti vykonané cez mobilnú aplikáciu sa budú započítavať iba do úkolovej rady a činnosti vykonané cez prehliadač iba do dobrodružstiev."}, {"48": "Prostě to bude pěknej bordel [smilie--sprite8]"}, {"29": "Jasně, takže protože nehraju přes mobil, budu mít jen dobrodružství, který stojí za nic v poslední době... [smilie--sprite3][BR]Prostě super..."}, {"73": "Ber to spíš tak, že udělali něco pro appku, a podzimní event v ní ještě nebyl, tak je to teď jako vynahrazení."}, {"91": "Tak dýňák taky za něco nestál. Na druhou stranu nevím zda je vhodné, aby se to takto rozdělovalo. Když mobil zatím nepodporuje, beru, ale když je to podmíněně, tak aby se to za chvíli nedělilo na dva tábory, akce pro stabilní a mobilní Elvenar zvlášť."}, {"73": "To si nemyslím, jen dokud to nebude v appce všechno šlapat jako na PC, tak to chtějí nějak přizpůsobit a za to bychom měli být rádi"}, {"31": "Tiež si stojím za tým, že je to len provizórne riešenie a až budú dobrodružstvá aj v aplikácii (čo je vraj jedna z ich prvých priorít), žiadne takéto podobné rozdeľovanie viac nebude."}, {"61": "Když otevřu rozhraní staveb a nejedu myší na pozdější kulturní budovy (od víl), tak se mi nahoře vpravo objevují vlaječky s římskými čísly (podobné jako čísla kapitol). Nesouvisí to nějak s tím plánovaným vylepšováním doteď nevylepšitelných budov? Nebo jsem někde prošvihl nějakou informaci, co to znamená? [smilie--sprite8]"}, {"31": "@Karindian v kóde sú jednotlivé kultúrne budovy označované ako napríklad Fairies_Small1, Fairies_Large1, Fairies_Premium_Small1..., kde to číslo znamená akési poradové číslo pre tú budovu z tej danej kategórie small / large / premium. Keď som si toto porovnal s tými vlajkami ktoré sa pri nich zobrazujú, sú totožné. Či to ale má nejaký väčší význam, prečo sa to v hre zobrazuje netuším, ale s vylepšovaním to asi súvisieť nebude. S tým už súvisia tie modré ikonky zobrazujúce sa po kliknutí na eventové budovy."}, {"61": "no ale velikost to moc neodráží [smilie--sprite8][BR]a u těch eventových bych čekal, že mi to bude ukazovat, v jaké kapitole to bylo získáno, tak jako mi to ukazuje ve shromaždišti"}, {"31": "@Karindian tak napríklad Noblesní lucerna má trojku, pretože je považovaná za tretiu malú kultúrnu budovu víl (prvá je baodubová alej a druhá kokonové lampióny). Prémiová veľká budova Palác obřího šneka má dvojku, pretože prvou je prémiová veľká budova Chrám úrodnosti a pod. Ale je pravda, že hranica veľkej a malej budovy je pre nás len pomyselná, v inno na to možno majú nejaké pravidlo."}, {"75": "iDavis napsal/a:Dobrodružstvá spoločenstiev[BR][BR]Spoiler: Nové koloBudúci týždeň vo štvrtok 10.5. by sa malo začať nové kolo udalosti. Zmeny by mali byť minimálne, nastavenie by malo byť rovnaké ako v druhom kole.[BR][BR]Dík!Klikněte zde pro zvětšení...[BR]Ahoj! Ten začátek je už na normál serveru,nebo u vás na betě?"}, {"48": "To je začátek na živých serverech - na betě běží od minulého čtvrtka..."}]