[{"104": "To opravdu nepůjde hrát obě najednou?? to jako vážně?"}, {"31": "Podľa najnovších informácií to vyzerá tak, že pri hraní v prehliadači budú v pozadí spustené všetky úlohy, teda aj pre úkolovú radu aj pre dobrodružstvo. Zobrazovať sa síce budú iba tie pre dobrodružstvo, ale získaný pokrok by sa mal započítavať aj do úloh pre úkolovú radu. Pre ich splnenie je avšak nutné ísť do aplikácie, nakoľko sa samotná úkolová rada zobrazuje iba tam. [BR][BR]Hlavné odmeny úkolovej rady už nájdete tu, budem pripisovať aj úlohy."}, {"103": "Takže ty Halloweenské úkoly nepůjdou vidět při hraní, ale budou se plnit automaticky co na ně udělám?[BR]Chudáci hráči kteří nechodí na forum, ti ani nepostřehnout že nějaký Halloween je, jestli to bude takto.[BR][BR]Proč to neudělají normálně??? Jestli rozumím správně.[BR][BR]//Odstraněna zbytečná citace, Iddun"}, {"61": "Započítá se Ti třeba výroba do úkolu, takže úkol splníš, ale dokud na něj neklikneš a nepřijmeš odměnu, tak se Ti nezačne plnit další úkol. Teda tak si to myslím já.[BR]A proč to neudělaj normálně už tu někde psal tuším i Davis: hráči, kteří hrají přes apku nemohou krát dobrodružství, tak se jim dá alespoň tahle úkolová řada (která snad nešla na podzim přes apku). No a kdo chce a bude to zvládat, může dělat oboje."}, {"91": "ANCARY >> Tak postřehnou to, pokud budou hrát přes mobil, jinak to nepostřehnou, ale k čemu by měly, když to stejně nebudou hrát přes mobil. Myslím si, že nějakých výjimek, které budou kolidovat s běžným přístupem k hraní, bude minimum. Já např. hraji hlavně na pécéčku, a mobil mám jen jako doplněk na trénování nebo vyjímečně na sbírání surovin, takže událost prostě hrát nebudu a je to. Pokud to někomu nebude jasné proč má na každé platformě něco jiného, dřív nebo později se stejně objeví tu na fóru, a tady se vše důležité dozví."}, {"103": "Tak teď nerozumím už vůbec,... to budou některé úkoly jen možné plnit na mobilu, a některé jen na PC a nepůjde obojí dělat součatně kde výhodu bude mít ten kdo má nadupanej mobil i pc. Oproti tomu kdo to hraje jen na jedné \"platformě\" ? ? ?[BR][BR]Nebo se pletu protože fakt teď nevím.[BR]Přál bych si odpověď, kde mi to někdo lehce a srozumitelně hezky vysvětlí.[BR]Například: ANO můžeš na PC dělat oba úkoly, Dobrodružství i Halloowen, omezení mají jen Mobili.[BR][BR]Děkuji a pěkný večer ♥[BR][BR]//Odstraněna zbytečná citace, Dellingr"}, {"61": "Ne nemůžeš obojí dělat na jedné platformě. Na PC děláš dobrodružství, na mobilu úkolovou řadu.[BR]Jediné, co by mělo fungovat je následující příklad:[BR]V úkolové řadě (na mobilu) bude úkol vyrob 5x 9hod výrobu materiálu. Ty to vyrobíš, ale výrobu vyzvedneš (třeba omylem) na PC. Co se stane: normálně se Ti to do toho úkolu započítá, ale protože jsi na PC, tak ho nevidíš a nemůžeš odkliknout, žes ho splnil (sebrat odměnu za něj). Musíš jít na mobil a potvrdit splnění úkolu. Takže kdyby další úkol byl sehnat 200 prken a Tys na PC získal těch 200 prken předtím, dříve než jsi na mobilu potvrdil, splnění předchozího úkolu, tak se ten úkol za 200 prken nemohl započítat jako splněnej.[BR]Je to stejné, jako když omylem sebereš výrobu pro více úkolů, také se Ti započítá jen ten první, protože ho musíš nejprve potvrdit.[BR][BR]Ale je to jen můj výklad vytvořený na základě informací z fóra"}, {"103": "Karindian napsal/a:\t\t\tNe nemůžeš obojí dělat na jedné platformě. Na PC děláš dobrodružství, na mobilu úkolovou řadu.[BR]Jediné, co by mělo fungovat je následující příklad:[BR]V úkolové řadě (na mobilu) bude úkol vyrob 5x 9hod výrobu materiálu. Ty to vyrobíš, ale výrobu vyzvedneš (třeba omylem) na PC. Co se stane: normálně se Ti to do toho úkolu započítá, ale protože jsi na PC, tak ho nevidíš a nemůžeš odkliknout, žes ho splnil (sebrat odměnu za něj). Musíš jít na mobil a potvrdit splnění úkolu. Takže kdyby další úkol byl sehnat 200 prken a Tys na PC získal těch 200 prken předtím, dříve než jsi na mobilu potvrdil, splnění předchozího úkolu, tak se ten úkol za 200 prken nemohl započítat jako splněnej.[BR]Je to stejné, jako když omylem sebereš výrobu pro více úkolů, také se Ti započítá jen ten první, protože ho musíš nejprve potvrdit.[BR][BR]Ale je to jen můj výklad vytvořený na základě informací z fóra\t\tKlikněte zde pro zvětšení...[BR]Díky, je to stavěné na hlavu. Hlavně že heslo Elvenaru zní: Vytvářet příjemné prostředí pro hráče [smilie--sprite8][BR]Nechápu proč neudělají obojí pro obojí, kde byl ikony hlav jen zmenšili o polovinu a vešli by se tam.[BR]Připadá mi že z toho dělají guláš jenom poslední dobou, místo toho aby přidali už novou herní rasu osadníků.[BR][BR]Díky [smilie--sprite2]"}, {"103": "Jinak dneska 10.5. začíná Dobrodružství Společenství?"}, {"48": "Všichni s tím počítají, ale oznámení zatím nikde, tak nevim [smilie--sprite3]"}, {"99": "Ano, dobrodružství by mělo začít dnes, ale je to jen odhad podle bety.[BR][BR]Jinak obojí pro obojí udělat nejde. Halloween v aplikaci bude právě proto, že dobrodružství pro aplikaci ještě není zcela vyvinuté [smilie--sprite1] Ale úkolových řad jsme se nakonec také dočkali, takže věřím, že dobrodružství se také brzy objeví i v aplikaci [smilie--sprite1]"}, {"48": "Našel jsem na US fóru oficiální oznámení, že Dobrodružství dnes začne... To dává slušnou naději, že tomu tak skutečně bude [smilie--sprite1]"}, {"73": "Není to postavené na hlavu [smilie--sprite2] Tato úkolová linie nebyla ještě přístupná z appky, tak to vynahradili teď a pokud se nechceš účastnit dobrodružství, tak máš alespoň něco, čím se zabavíš [smilie--sprite2][BR][BR]//Odstraněna zbytečná citace, Iddun"}, {"103": "Chcu se zeptat na MOBILNÍ VERZI[BR][BR]Tak jsem to zkusil i já a vypadá to moc pěkně, mám tam nahrávací obrazovku Helloowenu. Ale nevidím tam úkoly, od kdy do kdy tato soutěž běží a jak si mám dyštak úkoly zaktivovat abych je tam měl prosím?[BR][BR]Byl jsem v úkolách ale mám tam ty klasické 2 jenom. Děkuji za odpovědi."}, {"48": "Halloween pro mobili ještě neodstartoval ;-)"}, {"99": "A nahrávací obrazovka přetrvává od Valpuržiny noci [smilie--sprite1]"}, {"73": "pro appku to začíná 14.5."}, {"103": "Děkuji ♥ ^^)[BR][BR]Už se těším [smilie--sprite8] [smilie--sprite2] =)"}, {"105": "athlan napsal/a:\t\t\tV turnajích za poslední truhlu. Kterou pravidelně získává tak pět klanů na serveru... to možná ještě přeháním.\t\tKlikněte zde pro zvětšení...Já bych tipl, že těch společenství, které získají plánek je víc. My ze Sapphire Unicorns už jsme se tak nějak dohrabali k těm plánkům také. Vypadá to, že pojedem 10 beden každý turna.[BR][BR]Karindian napsal/a:\t\t\tNe nemůžeš obojí dělat na jedné platformě. Na PC děláš dobrodružství, na mobilu úkolovou řadu.[BR]Jediné, co by mělo fungovat je následující příklad:[BR]V úkolové řadě (na mobilu) bude úkol vyrob 5x 9hod výrobu materiálu. Ty to vyrobíš, ale výrobu vyzvedneš (třeba omylem) na PC. Co se stane: normálně se Ti to do toho úkolu započítá, ale protože jsi na PC, tak ho nevidíš a nemůžeš odkliknout, žes ho splnil (sebrat odměnu za něj). Musíš jít na mobil a potvrdit splnění úkolu. Takže kdyby další úkol byl sehnat 200 prken a Tys na PC získal těch 200 prken předtím, dříve než jsi na mobilu potvrdil, splnění předchozího úkolu, tak se ten úkol za 200 prken nemohl započítat jako splněnej.[BR]Je to stejné, jako když omylem sebereš výrobu pro více úkolů, také se Ti započítá jen ten první, protože ho musíš nejprve potvrdit.[BR][BR]Ale je to jen můj výklad vytvořený na základě informací z fóra\t\tKlikněte zde pro zvětšení...Myslím, že to dobrodružství bude nehratelné. Je tam úkol: sežeň 19 relikvií a o pár úkolů vyřeš 17 střetů. Jsem u hobitů, mám 400 provincií a jedna provincie, kterou dám prozkoumávat, trvá něco přes tři dny. A to nemluvím o nákladech na vyjednávání, které jsou do statisíců. Když v mobilu nejde turnajovat, tak nevím, jak bych ten event mohl vůbec dokončit.[BR][BR][BR]//sloučen doublepost - Ódin"}, {"104": "No pokud je pravda co se tu píše, tak teoreticky pokud budeš mít v apce nastaven ukol na relikvie, můžeš je získat na pc, a započítají se i v apce ale musíš tam jít a dokončit ho at skočíš na další ukol. Nebo se pletu??[BR][BR]//Odstraněna zbytečná citace, Iddun"}]