[{"73": "jj, tak by to mělo být"}, {"16": "Ehm, tak na betě visí oznámení o dalším FA ve čtvrtek (týden po skončení předchozího).[BR]Tak nevím, zda je to omyl, legrace, nebo zlý úmysl (nebo co dělali v Innu místo oběda)."}, {"48": "Myslím, že zlý úmysl... V diskuzi už tam Marindor potvrdil, že to půjde i na ostré servery (24.5.), a že půjde o rozložení se všemi 16 odznaky... To bude legrace zase [smilie--sprite8]"}, {"73": "Můžete to prosím přeložit pro někoho, kdo netuší o čem píšete? [smilie--sprite8][smilie--sprite8][smilie--sprite8]"}, {"66": "FA = fellowship adventure (dobrodružství společenství)[BR][BR]To jako už zas?[BR]Vážně, co dělali na tom obědě?"}, {"73": "Tak to je mazec, vždyť to je hned příští týden"}, {"99": "iDavis napsal/a:\t\t\t17. Získaj 1x kúzlo Sila zásob ALEBO použi 1x kúzlo Sila zásob\t\tKlikněte zde pro zvětšení...U mě se jednalo o kouzlo Magický dar [smilie--sprite2]"}, {"48": "LuciskaCh napsal/a:\t\t\tTak to je mazec, vždyť to je hned příští týden\t\tKlikněte zde pro zvětšení...Ano... Zítra jedno skončí, taktak týden pauza, a pak hned další... Na Betě na to taky strašně nadávaj, co jsem stihl kouknout. I u nás už diskutujem, jestli nevynecháme, protože většina potřebuje i dělat jiné věci, než mít zasekaná města dílnama/manufakturama L1... V podstatě 3 týdny v kuse [smilie--sprite3]"}, {"16": "Tak já si samozřejmě nehodlám omezovat rozvoj opakovaným dobrodružstvím.[BR]Teď jsem mohl pomoci více, díky místu uvolněnému po lesních elfech, ale za týden už to místo nebude (stavím Kampus a zítra začnu stavět fakulty).[BR]Pokud se naše společenství zúčastní (hlasuji všemi deseti pro ignoraci), tak jim v rámci možností samozřejmě pomůžu, ale bude to výrazně méně, než teď."}, {"66": "@Angedev Tak na Gems of Knowledge u 17. píšou Magický dar (Ensorcelled Endowment).[BR]Asi udělal @iDavis někde chybu. Protože Síla zásob je Power of Provision."}, {"73": "Já se na to dobrodružství těším [smilie--sprite1] Teď jsme byli nepřipraveni, ale příští týden získáme všechny odměny [smilie--sprite1]"}, {"103": "Kdy budou tady ty SNEAK plánky na vylepšování Bonusových Kulturních budov prosím? [smilie--sprite1][BR][BR]( Jinak vy co hrajete na Arendyll, koukali jste jak jsme skočili s Fairy Tail .I. na 8. místo že jo [smilie--sprite8] ... zrvona nabíráme po turnaji nové členy, bude 5 míst volných tak se ozvěte na 100% kdo hrajete a chtěli by jste k nám [smilie--sprite2] ... Tým ... )"}, {"48": "měsíc, dva... kdo si počká, ten se dočká [smilie--sprite1]"}, {"31": "Tak zase trochu oživím tému.. [smilie--sprite1][BR]Sneak Peek[BR][BR]Spoiler: Sneak PeekVykutral som tento obrázok, týkajúci sa jednej z blížiacich sa noviniek. Vidíte na ňom niečo iné v porovnaní s hrou teraz? [smilie--sprite1][BR][BR][IMG]https://i.ibb.co/CHKG8gJ/https-image-ibb-co-c-Tk-Tao-EL-sneak-peek-25-5-2018-png.png[/IMG]"}, {"73": "mě to připadá stejné, jen tam nejsou ty stromečky a skalky, co zmizí po umístění rozšíření.[BR]Jo a paprsky slunce nad řekou a je to trochu víc rozšířené za tou řekou, teď ve měste vidíme jen 2 skály"}, {"99": "@iDavis : No také už netrpělivě vyhlížím, jestli se tu neobjeví nějaké novinky [smilie--sprite8] Ale přiznávám, že kromě toho, co píše LuciskaCh, nic nevidím... Možná to také bude tím, že aktuální verzi zkoumám v Puffinu, kde obraz není zrovna kvalitní [smilie--sprite8]"}, {"48": "Budí to ve mně dojem zvětšení herní plochy... Ale možná jsem jen moc snílek [smilie--sprite1]"}, {"106": "Vidím pláže? [smilie--sprite8] nic víc nevidím :/"}, {"79": "jj, je to širší [smilie--sprite1] [BR][BR]já jen doufám že to nebude další akce typu event [smilie--sprite1] chvilka klidu by mi nevadila."}, {"102": "Je to úplně stejné, nevím co tam jiného vidíte ani co tam vidíte širšího [smilie--sprite8]"}]