[{"73": "super "}, {"31": "Nová úkolová rada na obzore.. [BR]Dni hudby[BR][BR]Spoiler: Dni hudby (Days of Music)Predpokladaný termín: 7.6. - 17.6.[BR][BR]Príbehom tejto úkolovej rady bude príprava na veľký letný festival, ktorý bude sprevádzaný veľkou udalosťou. A práve k nej sa viazal posledný sneak peek. [BR][BR]Spoiler: ÚlohyVšetky detailné informácie k tejto úkolovej rade nájdete tu.[BR]Odmenou za dokončenie úloh bude:[BR][BR][IMG]https://i.ibb.co/k9XvCy6/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-woodelvenstock2018-Reward-Building01res01-png.png[/IMG][BR][BR][IMG]https://i.ibb.co/Pr0QxvM/https-image-ibb-co-cvox-Cd-EL-akcia-j-n-2018-h-odmeny1-png.png[/IMG][BR][BR]Spoiler: Obrázok[IMG]https://i.ibb.co/D7LhGFz/https-image-ibb-co-kd-L2-Vy-EL-akcia-j-n-2018-loading-screen-jpg.jpg[/IMG]"}, {"73": "Jako by toho nebylo v poslední době dost "}, {"79": "Mám úplně stejné pocity   "}, {"99": "Raději úkolovou řadu, než další dobrodružství "}, {"97": "nějak nechápu tu  souvislost mezi eventem  a tim tvým Sneek peekem"}, {"44": "nová rasa???"}, {"97": "No i davis te´d psal že ten předchozí Sneak peek se vázal k tomu eventu co te´d bude,tak mi nějak nedochází ta souvislost "}, {"31": "Pre mňa je úkolová rada vždy príjemným spestrením, nech príde kedykoľvek. [BR][BR]@Fragola časom to bude jasnejšie. [BR][BR]@martin2007 za posledné týždne som nevidel žiadne viditeľné pokroky v prípravách novej rasy, veľká časť vývoju je teraz venovaná vyššie spomínanej letnej udalosti, ktorá prinesie nové mechaniky, takže sa rozhodne do zavedenia novej rasy môžeme tešiť aj na iné veci. "}, {"92": "Mně by asi nejvíc potěšilo, kdyby bylo možné obchodovat i se surovinami spřátelených ras, ale silně pochybuju, že se toho dočkáme "}, {"78": "Ahoj, ta odměna je pro ty co mají elementály nezajímavá. Je nějaký jiný důvod proč se zůčastnit ?"}, {"48": "vážně? 2500 lidí na 3x4 v porovnání s obytkou co má 2800 na 4x4? to jsou lidi navíc a ještě kultura zadarmo [BR]perfektní budova, rozhodně se zúčastnim "}, {"78": "Aha, omlouvám se, nějak jsem přehlídnul ty lidi a kulturku. No vypadá to dobře "}, {"108": "Fragola napsal/a:\t\t\tnějak nechápu tu  souvislost mezi eventem  a tim tvým Sneek peekemKlikněte zde pro zvětšení...IDavid vyhlíží pastevce se svými stády, zda se už z dáli neblíží.   Chystá se letní událost..."}, {"65": "jak tak koukám na seznam úkolů, tak tuhle událost asi vynechám. budova je sice pěkná, hodila by se mi docela dost, ale raději budu šetřit zdroje na velkou letní událost  třeba dračí matku by nám zase mohli dát. ta není nijak přesílená, přesto je to dobrá budova."}, {"109": "Za mne dobrý.Lepší než DS. A korát mne zaráží počet úkolů.Na 10 dní se mi to zdá poměrně málo.Nebo se pletu a ještě to není vše?"}, {"31": "@petr12345 38 úloh je konečný stav."}, {"109": "@iDavis děkuji za vyčerpávající odpověd[BR][BR]//Odstraněna zbytečná citace, Iddun"}, {"105": "torakus napsal/a:\t\t\tAhoj, ta odměna je pro ty co mají elementály nezajímavá. Je nějaký jiný důvod proč se zůčastnit ?\t\tKlikněte zde pro zvětšení...Vždycky je dobré se zůčastnit. Jsem na prahu Elementálů a lidičky se hoděj vždycky. Mimo to, když by nebyly ty úkolové řady, tak by to bylo úmorné čekání na další rasu nebo na hlavní eventy."}, {"59": "@iDavis díky za info, tentokrát se rád zúčastním, budova má dobré staty a navíc vůbec nevypadá špatně "}]