[{"31": "Prinášam zase nejaké novinky.. [BR]Sneak Peek - leto 2018 (1/6)[BR][BR]Spoiler: Sneak Peek - leto 2018 (1/6)>predchádzajúci sneak peek<[BR][BR]Festival zanedlouho začíná,[BR][BR][IMG]https://i.ibb.co/s9hKrcW/https-image-ibb-co-gy-U8-L8-EL-sneak-peek-8-6-2018-1-png.png[/IMG][BR][BR]prodej lístků se už rozbíhá.[BR][BR][IMG]https://i.ibb.co/c1YrGsr/https-image-ibb-co-c-Xhjt-T-EL-sneak-peek-8-6-2018-2-png.png[/IMG][BR][BR]>nasledujúci sneak peek<​"}, {"66": "Chceš říct, že teďko stavíme boudu na prodej lístků a vlastní festival bude následující velký event?[BR]Je pravda, že ten bard říkal, že je to předprodej na červenec."}, {"48": "Však to je napsané i v oznámení )"}, {"31": "@Prealiena presne tak.  Súčasná úkolová rada je označovaná aj ako pre-festival, čo znamená, že naozaj ešte príde nejaký, hlavný festival."}, {"16": "Takže můžu očekávat, že budovy budou podobné té současné?[BR]Doufám, že je vytvářel někdo jiný.[BR]Jednak mám raději jiná témata a jednak ta budova...[BR]Samotná budova ošklivá není, ale když ji člověk postaví, tak mu začne blikat a zářit duhově, až si člověk pomyslí - který zhulený hipísák to dělal."}, {"31": "@Lovec Krys povedal by som, že štýlovo podobných budov festivalovému stánku bude minimálne množstvo. Väčšina z nich bude zapadať do miest so štýlom orkov a lesných elfov. "}, {"59": "zatím jsem ji nepostavil, není potřeba, snad až budou chybět lidi nebo tak."}, {"16": "@iDavis No záleží které[BR]Já půjdu jen po maně a k tomu získám 1., případně i 2. hlavní cenu (dle toho, kolik bude úkolů a eventové měny z nich)."}, {"94": "No mě by se zase líbila nějaká sada. Ideálně taková co by dávala rozbité úlomky a VB. Za manu ale taky budu rad ;-)"}, {"65": "ideálně aby ty hlavní odměny nechtěly cestu. fénix se mi líbil, ale že musím mít kulturu napojenou na cestu, to není ideální. a první hlavní odměna by ještě mohla být co k čemu, narozdíl od zimy a jara. pak to bude super událost "}, {"16": "To je fakt, doufám, že hlavní odměny nebudou součástí setu, staty setů jsou obvykle hrozné. Zvláště těch, co dávají \"úžasné\" množství nebonusových surovin."}, {"48": "staty setů jsou dobré v porovnání s běžnými budovami... nejsou nic moc v porovnání se starými eventovými budovami, ale vzhledem k proběhlé korekci bych si troufl tvrdit, že se na ně už bude koukat jinak [BR][BR]a mimochodem, kulturky co dávaj manu, suroviny, atd. (tedy i sety), pokud nenapojíš k cestě, tak pořád dávají tu kulturu - otestováno na té hlavní budově ze zimy po té, co jsem zboural zbytek setu (měl jsem ho kvuli maně, kterou už nepotřebuju)... a těch 11k kultury co to dává, je pořád top kulturní budova co mám, a už je to zastaralé ;-)"}, {"65": "@ramaloke : já vím, je to stejné i jako třeba klášter bojových mnichů - odpojím od cesty, kulturu stále dává. z jara mám 2. i 3. fénixovu hlavní odměnu. čísla kultury i populace jsou dobrá, to určitě ano. ale ty suroviny, ty by tam fakt být nemusely. musím to kvůli nim mít u cesty, protože ta červená ikonka nad tím mi pak hrozně vadí ^_^"}, {"72": "Tak o tom nepište, nebo to označí za chybu a opraví ji xD"}, {"48": "@CorwinOfAmber Jako tenhle pohled chápu - taky to mám připojené kvuli té červené ikonce  A že by mne vytrhlo 96k mincí 1x za 24hodin? (pro srovnání, propast mi dává 438k každý 3h...)[BR][BR]@athlan Tak zlý snad nebudou, no ne? "}, {"72": "Sneak Peek [BR][BR]Spoiler: Sneak Peek z bety a verze 1.57Tak na betě už mají lidi na hlavě doslova *** [BR][IMG]https://i.ibb.co/fMQxc07/http-images-athlan-net-i-1824-1-jhj-png.png[/IMG]"}, {"31": "Pripravujú tam pridávanie ikoniek novej rasy, tak preto ten chaos.. "}, {"28": "Již brzy.... [BR][BR]Spoiler"}, {"48": "No já nevim, když jsem dnes četl tu aktualizaci 1.57 a hlavně diskuzi k ní...[BR][BR]Hráč: \"Takže shrnuto: Přidána spousta chyb, chyby následně opraveny. Vynechal jsem něco?\"[BR]Hlavní administrátor bety: \"Ne, tohle je naprosto skvělé shrnutí \""}, {"99": "@Thespia : Juchuu! To by byla parada, kdybychom se konecne dockali [BR][BR]@ramaloke : Tak to se mame na co tesit  Koukam, ze na bete take neni o zabavu nouze "}]