[{"31": "Sneak Peek - leto 2018 (2/6)[BR][BR]Spoiler: Sneak Peek - leto 2018 (2/6)>predchádzajúci sneak peek<[BR][BR]Krajina se také změní,[BR]slunce, moře, pláže,[BR]symbol léta přece. [BR][BR][IMG]https://i.ibb.co/TPKVZPB/https-image-ibb-co-ni6qhy-EL-sneak-peek-15-6-2018-png.png[/IMG][BR][BR]>nasledujúci sneak peek<​"}, {"31": "Dneska prinášam, z časového hľadiska, dva v jednom.. [BR]Sneak Peek - leto 2018 (3+4/6)[BR][BR]Spoiler: Sneak Peek - leto 2018 (3+4/6)>predchádzajúci sneak peek<[BR][BR]K výběru bude množství beden,[BR]a k tomu dalších 180 odměn..[BR][BR][IMG]https://i.ibb.co/Pg87JZw/https-image-ibb-co-j-BMg-QJ-EL-sneak-peek-17-6-2018-2-png.png[/IMG][BR][BR]Zájem je podle očekávaní obrovský,[BR]už nyní čekají zástupy lidí na otevření..[BR][BR][IMG]https://i.ibb.co/7WNGDFt/https-image-ibb-co-cve-Msy-EL-sneak-peek-17-6-2018-1-png.png[/IMG][BR][BR]>nasledujúci sneak peek<​"}, {"66": "Doufám, že nemyslí, že by bylo více denních odměn v různých bednách ten samý den. To by lidi řvali, že nedostali to, co chtěli."}, {"61": "třeba se ty bedny týkají turnaje nebo předělají systém odměn v dobrodružství společenství anebo přibude něco úplně nového v tomto duchu..."}, {"99": "@Karindian : Spíš bych očekávala, že se to opravdu bude týkat letní události "}, {"105": "Angedev napsal/a:@Karindian : Spíš bych očekávala, že se to opravdu bude týkat letní události Klikněte zde pro zvětšení...Kdo ví, třeba z toho na konci vzejde nová rasa. Třeba nám to dávají po lžičkách. Nejdříve malý event, pak velký event a nakonec nová rasa."}, {"16": "@mcallen Jako že by nová rasa byla banda zhulených hipíků a ve vesnicích bysme pěstovali marihuanu?"}, {"72": "Hezký, hezký, škoda jen, že to budou všechno jen dekorace, na rozšíření životního prostoru mimo vymezený čtverec to nevypadá "}, {"86": "Tak to vypadá,že s velkou letní událostí ,přichází přes most a projde slavobránou nová rasa PIDILIDI a kdoví co přinesou,respekt.spíš odnesou[BR]Pěkný a pohodový den všem"}, {"72": "Přes most.. ona to není fronta na novej mobil?"}, {"31": "Veľký letný festival štartuje na bete... [BR]Woodelvenstock festival[BR][BR]Spoiler: Woodelvenstock festival[IMG]https://i.ibb.co/xfkR1XY/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-woodelvenstock2018-Woodelvenstock-Banner01-pn.png[/IMG][BR]Predpokladaný termín: 25.6. - 23.7.[BR]Venujte prosím pozornosť v pondelok 25.6. začínajúcemu dobrodružstvu, ktoré pravdepodobne bude mať za následok posunutie udalosti. [BR][BR]Ako som už naznačil v poslednom sneak peeku, udalosť prinesie nové mechaniky. Za plnenie úloh budeme získavať lístky. Tie budeme využívať na otváranie truhlí, pričom po každom otvorení sa zmení ponuka truhiel a objavia sa nové 3, ponúkajúce iné odmeny. Každá by avšak mala obsahovať slot s dennou výhrou, ako sme boli doteraz zvyknutí. [BR][BR]Spoiler: ÚlohyDôležité: Údajne budú medzi úlohami na bete a úlohami ktoré sa dostanú na náš server nejaké rozdiely. Neviem do akej miery sa budú líšiť.[BR][BR]Kompletný zoznam úloh a odmien nájdete tu.[BR]V odmenách nás čaká množstvo požehnání, denných odmien a iných. Tabuľky s odmenami už mám niekoľko dní hotové, ale priložím ich sem až si overím že sa na betu dostali rovnaké hodnoty, aké som do nich vpisoval pred pár dňami.[BR][BR]Za otváranie truhlí budeme získavať tzv. Magic Goo, ktorý bude odomykať hlavné ceny, rovnako ako aj priebežné odmeny, ktorých by malo byť 180 a obsahovať by mali veľké množstvo ďalších požehnání. Každá ďalšia priebežná odmena by mala byť odomknutá nazbieraním ďalších približne 20-40 Magic Goo.[BR][BR][IMG]https://i.ibb.co/4FXVXqJ/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-woodelvenstock2018-Main-Stage-png.png[/IMG][BR][BR][IMG]https://i.ibb.co/Fw7dZMJ/https-image-ibb-co-g-Awqpd-EL-akcia-festival-2018-h-odmeny1-png.png[/IMG][BR][BR][IMG]https://i.ibb.co/G39q6kv/https-image-ibb-co-b9-FNny-EL-akcia-festival-2018-oskoro4-png.png[/IMG][BR][IMG]https://i.ibb.co/2Nxm5JB/https-image-ibb-co-b-GC2ny-EL-akcia-festival-2018-oskoro1-png.png[/IMG][BR][IMG]https://i.ibb.co/NmN1gVW/https-image-ibb-co-nbox-LJ-EL-akcia-festival-2018-oskoro2-png.png[/IMG][BR][IMG]https://i.ibb.co/5Mn3r1z/https-image-ibb-co-hz-Ztud-EL-akcia-festival-2018-oskoro3-png.png[/IMG][BR][BR][IMG]https://i.ibb.co/z2Qt9G0/https-image-ibb-co-ja-O9f-J-20180618-155013-jpg.jpg[/IMG][BR][BR]Na tomto obrázku môžme vidieť hlavné okno udalosti, obsahujúce animované postavy na ich ceste, na ktorej budeme môcť zbierať vyššie spomenuté priebežné odmeny.[BR][BR]Všetky informácie budem zhromažďovať v tomto spoileri.[BR][BR]Spoiler: Sneak Peek - leto 2018 (5+6/6)>predchádzajúci sneak peek<[BR][BR]Příprava jde jak po másle,[BR]výzdoba je hotová...[BR][BR][IMG]https://i.ibb.co/5jtqp0K/https-image-ibb-co-n-PYT9d-EL-sneak-peek-19-6-2018-1-png.png[/IMG][BR][BR]Poslední detaily a festival může začít.[BR][BR][IMG]https://i.ibb.co/sRr6XW5/https-image-ibb-co-f-Yh-PFJ-EL-sneak-peek-19-6-2018-2-png.png[/IMG][BR][BR]>nasledujúci sneak peek<​"}, {"16": "@iDavis Máš nějaké informace o tom, jestli bychom si měli přichystat tradiční eventové budovy na výrobu neboostnutých T1 surovin, dlouhou výrobu dílen a boostnutých T1 surovin...?"}, {"31": "@Lovec Krys s istotou ti to neviem povedať, úlohy a dátumy sú 2 veci ktoré vopred neviem. Osobne ale predpokladám, že sa takéto úlohy vyskytnú a preto by som určite niečo nachystal."}, {"2": "no jsem na to zvědav, zdá se že nás cekají velké změny.[BR]Tento event bude asi opět setový.[BR]Ale systém zelených kapiček a hospodaření s nimi vypadá že předelali.[BR]Jsem zvědavý na detaily."}, {"72": "A to budou jen denní úkoly? Alespoň na betě to tak vypadá...[BR][BR]Jinak chválím za html5."}, {"110": "Sněhovou horu jsem asi několikrát viděl u sousedů . V létě potěší na to klikat , to vedro je hrozné . Škyt . Ale ty vinné farmy jsou taky prima ."}, {"111": "No jestli to nebude na mobilu tak to nedam .... pac bude dovca a jen mobil ..."}, {"79": "Mě asi nejvíc vadí ta magická výroba :/ kladívka bych ocenila, k maně ještě daleko (jsem u orků ) a tu výrobu (suroviny) prostě nedokážu ocenit.... Tak snad bude i nějaká  ta super kultura bez téhle výroby."}, {"72": "No, jsou tam opravdu jen denní úkoly, za mě teda zklamání. Zas zrušit i ty zbytky toho, co Vám umožňuje získat nějakou výhodu vlastní aktivitou a přípravou."}, {"66": "Právě, že na betě dostali jenom denní úkoly. Jestli teda na živo spustěj první úkolovou sadu bez předem známých úkolů, tak to bude mazec. Dost podpásovka od Inna. Je vidět, že se změnou eventového systému chtějí změnit i pravidla hry."}]