[{"65": "z toho co jsem četl na gems of knowledge jsem pochopil, že ta hlavní úkolová řada tam také bude. akorát ji nebudeme znát dopředu no. ale vždycky se najde někdo, kdo zvládne celý event během prvních dvou dnů, takže všechny úkoly budou známé třeba v úterý. pohoda. no tak nám event místo 4 dní vezme 6, svět se nezboří "}, {"72": "Tak jak je to nastaveno na betě, mám obavu aby ta řada vůbec byla, jelikož za denní úkoly dávají dost bodů, asi tolik, že by to odpovídalo oběma řadám dohromady. Ale snad i toto bude upraveno. GoK jsem četl, věřme že to tak bude,"}, {"66": "Na betě dostávají dvojnásobek lístků za denní úkoly i kolem města právě proto, že nemají hlavní úkolovou řadu. IMHO"}, {"2": "Mě přijde, že event došel zásadní změny.[BR]Je možné že:[BR]Budou jen denní odměny, za které dostanete 150 lístků každý den.[BR]Díky tomu suma sumárum získáme při poměru 9 kapek za 140 lístků nějakých 280 kapek.[BR]Na hlavní cestu oděmny je potřeba 200-300-400.[BR]K tomu jsou tu lístky které posbíráme kolem města což by nám mohlo dát možnost s trochou štěstí dosáhnout i na druhou hlavní oděmnu.[BR]Ale proměných je tu mnohem víc než bylo.[BR]Dřív jsme měli jasně definované tři bedny, ted jich bude mnohem víc a po každém zatočení se vybere nová trojka. Takže není jisté že budu točit 140/9[BR]Ani není jisté, že při každém zatočení budu mít šanci vytočit další lístky.[BR]Ale na druhou stranu jsou tam možnosti které mi dávají lepší poměr, teď je na betě akce na dvojnásobek kapek.[BR]Tedy je možné že to mají spočítané tak aby hráč dosáhl na dvě hlavní odměny a třetí byla pro platící zákazníky.[BR]Jako to bylo na začátku.[BR][BR]Tohle je vše jen moje úvaha nemusí to tak být a pro přípané skučili podotýkám, že pokud opravdu nechají zvedat eventové kulturky nebude potřeba jich získávat tolik a tedy se úprava dala čekat.[BR][BR]Taky doufám v nějakou rozumnou kulturolidskou budovu, hlavní odměny jsou opět setové, takže...[BR]Nějaké odměny padají i v průběhu získávání hlavních odměn, jak tam jde těch pár pajduláků, tak jim v cestě přibudou odměny které se zbírají za získané kapky.[BR]iDavis to píše, ale nevím jeslti to tak lidi pochopili, není to palcení kapek navíc[BR]zatím tam mám urychlovače a mince, ale přeba časem padne i něco výživnějšího."}, {"72": "Vylepšování eventovek je také ve hvězdách, před časem, dlouhým, tu dával idavis ikonku kouzla nebo něčeho na rozšíření a taky z toho nic není.."}, {"99": "Tak bylo by fajn, kdyby to zavedli co nejdříve, když už tolik lidí naštvali vyvážením budov..."}, {"2": "tak to tu ale chodí, vymyslí zlepšení, zavedou protiopatření a zlepšení snad jendou přijde"}, {"5": "Tak ten set mi přijde opětovně dost slabej, vzhledem k množství toho co bude dávat ...jen to bude opět dočasně zabírat místo, jestli ho vůbec má smysl stavět a tím pádem i získávat..."}, {"109": "Ten termín letní události 25.6.-23.7. je spuštění na našem servru? Díky za odpověd."}, {"99": "Ano, mělo by to tak být. Na betě už událost běží a u nás obvykle začíná o týden později "}, {"109": "No,je nač se těšit,vzhledem k nastaveným změnám to bude zajímavější-beru to jako výzvu. A myslím si,že odměny jsou přiměřené."}, {"16": "No set je jako vždy na 2 věci.[BR]Doufám, že moje manová budova bude co nejpozději, ať mám na ni co největší počet pokusů.[BR][BR]A ta rychlost přetáčení nových beden, to má být jako špatný vtip? To trvá snad 5s či co - dost to to klikání protahuje (o samotné náhodné výměně nemluvě - obvykle mi to tam strčí bedny, které nechci)."}, {"2": "Jsem zvědavý kolik se povede posbírat setů[BR]mohl by se z toho stát dost drahý koníček, protože nové bedny se zdají nastavené na výhodu pro získání denní odměny, nebo hlavních odměn[BR]ale protože na získání setu je potřeba oboje"}, {"98": "No jsem zvědavá kdy to vlastně začne ,když 25.6. má začít další dobrodružství společenství,"}, {"5": "...DS, že by překlep?? či souběžně s eventem?? )"}, {"48": "Souběžně určitě ne [BR]Zjevně tohle později... Podle logiky Inna - 25.6. - 1.7. bude DS, 2.7. - 8.7. bude volno a od 9.7. event? "}, {"5": "Mne ten event přišel nějak brzy...ted se to potvrzuje "}, {"2": "Tak na betě už je potvrzený set, nevím kolik to vyžaduje štěstí, ale zjevně to jde."}, {"31": "A úplne bez problémov, už včera som ho tam skompletizoval, počas dvojnásobku magického slizu, len za lístky z doterajších denných úloh a pár nazbieraných z okolia mesta. Určite jednoduchšie než to bývalo minule."}, {"72": "ElfNostradamus napsal/a:\t\t\tMne ten event přišel nějak brzy...ted se to potvrzuje Klikněte zde pro zvětšení...Myslím že to bude podobně, protože loni jsem se do hry zaregistroval poslední den letního eventu (nějaká stáda) a bylo to na přelomu července/srpna, takže začátek musel být taky na konci června."}]