[{"59": "Tak to vypadá, že úkoly tentokráte nebudou, co?   mno nevadí, bude legrace, tak snad abych si připravil nějaké budovy na vylepšení, jen tak vědět na kolik je vystavět."}, {"99": "Pokud vím, na betě spustili jen denní řadu úkolů, takže není odkud úkoly brát "}, {"72": "Dneska mi tam vyskočilo oznámení, že druhá úkolová řada na betě od zítra bude."}, {"112": "Dne 4. července, po každodenní aktualizaci hry, bude k dispozici událost Woodelevenstock. Současně se sníží množství jízdenek, které můžete dostat s každodenními questy, protože nyní můžete získat další vstupenky se všemi dalšími úkoly! Doporučujeme, abyste před aktualizací dokončili všechny otevřené denní úlohy."}, {"113": "Jen se tak blbě zeptám neví se kdy event začne na ostro ??"}, {"31": "Pravdepodobne 9.7."}, {"99": "Já myslela, že by to mohli pustit zároveň s druhou úkolovou řadou na betě, ale oznámení zatím žadné nepřišlo, takže asi ne "}, {"65": "pak jsem vůbec nepochopil příspěvek od standy. středa právě nedávala moc smysl, věci se spouští buď ve čtvrtky nebo pondělky."}, {"99": "Příspěvek od Standy se týká bety "}, {"31": "Tak už na Elvenar Official Youtube kanáli zverejnili aj oficiálne video k Woodelvenstocku. [BR][BR]VIDEO"}, {"66": "Příští video o kočkách?[BR]Že by nová spřátelená rasa?[BR][BR]I když mi to připomíná spíš záhadu ztraceného elfa od woody69."}, {"2": "A je nějaká představa, jak to tady bude?[BR]stejěn jako na betě, nebo nějak úplně jinak?"}, {"19": "krásný večer přeji,[BR]chtěl bych se zeptat, zda je pro letní event  nutné mít postavený festivalový stánek."}, {"72": "netřeba.. namáš-li v plánu podávat u Vás na vsi kolemjdoucím vtipné elvenarské želé.."}, {"105": "No, nějakou další rasu bych uvítal. Už se blížím ke konci elementálů."}, {"31": "Je celkom zaujímavé, že v tom videu sú až 2 sneak peeky k novej rase.. "}, {"50": "@iDavis na tebe to vševidoucí oko opravdu padne , díky za tip na hledání "}, {"80": "Ok,čumel som do toho jak bager na dieru a fajn,povedali že budú rozprávať o mačkách.A čo?Inteligentné mačky?No téda ...[BR]Ale dobre,videl som tam niekde napísané aj Bastet a to už je iná káva ...."}, {"59": "V našem společenství se na festival těší skoro všichni, jen některým kalí radost obavy z úkolové řady, protože budou na dovolených a tak alespoň doufají, že budou schopni naklikat z mobilů. A nová rasa? Já se na ni těším, ať bude jakákoli."}, {"102": "Také se těším na event, právě lezu do spermíků takže budu mít hezky budovy \"čerstvé\", jaká bude další rasa je mi jedno, stejně to nečtu, snad ale bude mít hezčí budovy, než spermíči, na ty se moc netěším. Takové plastové "}]