[{"66": "Tak už máme i hlavní úkolovou řadu na Woodelvenstock. Na můj vkus je tam moc úkolů na kupování VB."}, {"59": "a kolik budov a jaké patří do kompletního setu?"}, {"31": "@pes63 všetky 3 hlavné a 2 z denných, vyznačené tu."}, {"102": "Já ten set už od zimy ignoruji, ne proto že bych je nezískal, ten poslední mám skoro celý, ale nemáme tolik místa abychom si mohli stavět jak chceme, takže z toho pohledu fakt set nechápu, když z něj nejde ani udělat XxX beze zbytků aby měl max bonus. Vnímám ty sety spíše jako past na některé hráče, co honbou za sety přehlednou možnou výhodnost denních budov ve větším počtu."}, {"28": "Našel jste někdo ve videu tu druhou nápovědu k nové rase? "}, {"99": "Sice mi to trvalo, ale našla jsem  Nehledej v tom, co říkají, ale v tom, co vidíš "}, {"65": "tak nám to prozraď nebo napověz  čumím na to už po několikáté a jsem prostě slepej. snažil jsem se rozluštit co má slečna na tričku, ale s tím jsem úspěšný nebyl a stejně to asi není ono..."}, {"31": "Oba sneak peeky sú vidieť kedykoľvek v čase 0:32-1:38.  Jeden z nich dokáže dosť napovedať, ten druhý, bude sa treba asi zamyslieť."}, {"102": "Tajemný jak hrad v Karpatech, to nevím k čemu je dobrý... Je to to hlavní sídlo a ta kulturní budova? To vypadá nějak jinak. Ale já prostě nejsem fanatik do hry takže to prostě jen odhaduji stylisticky."}, {"99": "Nápis hledáš správně, ale na špatném místě "}, {"28": "Mám to! "}, {"99": "Gratuluji! "}, {"65": "já tam pořád nic nevidím :-( (ale raději své úvahy hodím do spoileru, aby mé dlouhé vedení nezkazilo ostatním zábavu) [BR][BR]Spoilerbudovy jsem zkoumal a nic tam nevyzkoumal. takže už tam zbývá poslední věc - jméno města a jméno hráče. to mě napadlo docela rychle, ale prostě to nic neznamená. na jméno města mi google našel nějaké basketbalisty a jméno hráče je pizzérie. asi nebude fantasy rasa. [BR][BR]ledaže je to naschvál tak zkomolené, aby člověk, který neví o čem je řeč neměl šanci něcemu dojít. slovo succumb je podobné mýtické bytosti \"succubus\", \"amuni\" zase bohu \"amon\", z čehož mi vychází [BR][BR]staroegyptší život-sající pizza mužíci co rádi sportují. a teď jsem to určitě trefil :-D"}, {"66": "@CorwinOfAmber [BR]SpoilerJá v tom městě nic zvláštního nevidím. A v nápisech je akorát Bastet - staroegyptská bohyně s kočičí hlavou a Amun - staroegyptský bůh slunce. Tak mi z toho vychází jedině ten Egypt."}, {"2": "Já tam taky nic nevidím a je mi to buřt, jen nechápu, proč tady ti ostatní dělaj chytrý"}, {"65": "@Prealiena [BR]Spoilerno já tam původně četl basket a říkal jsem si, že to moc smysl nedává :-D  každopádně starý egypt je furt spíš kultura než rasa"}, {"66": "@CorwinOfAmber [BR]SpoilerOživlé egyptské božstvo je hustej nápad. Byl by to pěknej zvěřinec.[BR]Ale asi si budu muset počkat jak nás rozsoudí vývojáři při zavedení."}, {"80": "Si myslím,že ak niekto niečo vie,tak nech to prosím napíše bez hádanok.Sledujem to tu a dosť nás je trochu mimo.Ja tam vidím len ten nápis ,,Succumb to the Bastet,, Múdry prekladač mi to preložil ,,podľahli Bastet,, No,a spomínali tie mačky a kto sa hodí k mačkám viac ako bohyňa Bastet.Takže,čo ako to bude ta nová rasa?Príde banda levov a iných mačkovitých a požere nám elfíkov?Neznášam ked neviem nič a to je skoro stále.Tak please,čo to bude?"}, {"31": "Sneak Peek: Kočka za maskou lvice #1[BR][BR]Spoiler: Sneak PeekObdobí sucha, horka,[BR]do Elvenaru se blíží,[BR]kto se tu ve stínu plíží?[BR][BR][IMG]https://i.ibb.co/f0Q9LMY/https-image-ibb-co-cmw-V48-EL-sneak-peek-13-7-2018-jpg.jpg[/IMG][BR][BR]Znáte ji?[BR][BR]>>>​"}, {"5": "Rozcuchaná holka,[BR]v garáži prkna k sobě klíží,[BR]pak vyžere celou spíži. [BR][BR]PS:....jen tak "}]