[{"66": "\t\t\tLaskavá Bastet byla ztělesněním rafinované ženskosti. Tak jako u každé ženy či kočky, v jejíž podobě bývala zobrazována, i u Bastet se za klidem a laskavostí skrýval nevyzpytatelný temperament, který ji mohl změnit v obávané stvoření. Bohyně, která byla běžně považována za ochránkyni lidstva, byla v takovém případě ztotožňována s jiným božstvem - bojechtivou lví bohyní Sachmet.\t\tKlikněte zde pro zvětšení...[BR]P.S. Ta silueta vážně vypadá jako socha kočky nebo kočičí mumie."}, {"48": "Takže egyptští bohové? hmm... to zní zajímavě"}, {"28": "Na betě došlo k úpravě tržiště. Zboží k obchodování se nyní vybírá kliknutím na ikonky jednotlivých surovin. Vybraná surovina půjde zrušit buď tím křížkem nebo znovu kliknutím na ikonku dané suroviny.[BR]Spoiler: Tržiště[IMG]https://i.ibb.co/pyT2zdx/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-v1-59-new-trader-place-offer-tab-small-png.png[/IMG]"}, {"114": "Tak to je šikovné."}, {"2": "ceny za sliz nekončí třetí hlavní odměnou[BR]nemáte někdo představu jak to tam je?"}, {"31": "@GorGlin ďalšie odmeny sú studne prianí, každá za 250 ďalších kusov magického slizu."}, {"5": "jj...tak jest ty studny se točí potom furt dokola"}, {"31": "Sneak Peek: Kočka za maskou lvice #2[BR][BR]Spoiler: Sneak Peek<<<[BR][BR]Na pokojném teplém místě,[BR]sedí kočka sebejistě.[BR]Vchody do jehlanů poctivě stráží,[BR]vykradače hrobů její výraz svlaží.[BR][BR][IMG]https://i.ibb.co/gVMd4C1/https-image-ibb-co-f-PKSz-J-EL-sneak-peek-20-7-2018-png.png[/IMG][BR][BR]>>>​"}, {"2": "Jehlan?[BR]Piramida?[BR]Fakt Egypt?[BR]to by mohli celé město hodit do poustního kabátku"}, {"66": "Chci prastarý div tvaru pyramidy. "}, {"2": "socha sedícího faraona by taky nebyla špatná"}, {"59": "To je jedno, ale už ať je to ve hře, přeci jen - mít delší dobu vše hotové je nuda "}, {"77": "Též se moc těším už na něco nového, ať je to cokoliv.     Každá nová hra stojí za to a třeba faraóni to by bylo supr."}, {"16": "Já chci stavět pyramidy[BR]Teda stejně si ještě musím počkat, teprve končím čaroděje (ještě 2 technologie - ty nejpomalejší)."}, {"31": "Sneak Peek: Kočka za maskou lvice #3[BR][BR]Spoiler: Sneak Peek<<<[BR][BR]Dnes zde máme kočku poslednou,[BR]a už bude snad všem jasné,[BR]co nám vlastně přinesou. [BR][BR][IMG]https://i.ibb.co/1vSD8qn/https-image-ibb-co-ktkr-KT-EL-sneak-peek-27-7-2018-1-png.png[/IMG][BR][BR][IMG]https://i.ibb.co/1qcGKJw/https-image-ibb-co-nnvi-ZT-EL-sneak-peek-27-7-2018-aw1-png.png[/IMG][IMG]https://i.ibb.co/HP2gtfh/https-image-ibb-co-h-WWe8o-EL-sneak-peek-27-7-2018-aw2-png.png[/IMG][BR][BR]​"}, {"105": "Já už se Egypta nemůžu dočkat."}, {"73": "A nebude to jen kočičí rada nebo kočičí bohové? U toho posledního sneak peeku jsou ukázky run a jsou tam jen kočičí hlavy ne pyramidy nebo něco podobného."}, {"65": "já chci hlavní sídlo sfingu. a místo obytných budov pyramidy. ale vážně - bylo by fajn, kdyby se grafika obytných budov / dílen / hlavního sídla změnila, přecijen ementálové a pidilidi to mají skoro stejné.[BR][BR]jo a surovina do výzkumu bude whiskas :-D"}, {"16": "@CorwinOfAmber Tož snad budeš produkovat krokodýly a mumie. A otroky, které pak budeš házet jako jídlo krokodýlům. Bylo by fajn, kdyby kromě pyramid a sfing ve městě se i podklad města změnil na poušť v průběhu kapitoly."}, {"31": "@LuciskaCh budú aj pyramídy. [BR][BR]@CorwinOfAmber grafické zmeny tých budov opäť nebudú nijak zásadné, ale tematický nádych budú mať."}]