[{"102": "Ty jsi normální hráč a nebo máš nějak přístup k jejich systému, či analyzuješ zdroják toho flashe či jiné podobné data? Já jsem na to línej abych si to degeneroval ale tak nějak mě napadá, že by tam tyhle zdroje být mohly. Nebo jestli to pouští někam na FB a ty jen překládáš? "}, {"31": "Behom posledných dní prišlo na betu niekoľko noviniek, niektoré z nich súvisiace aj s novou rasou. [BR]Novinky z bety[BR][BR]Spoiler: Novinky z bety1. Nový dizajn niektorých okien v hre[BR][BR][IMG]https://i.ibb.co/9NV6PHk/https-image-ibb-co-f-Hc3w-K-z-Vj-Ev6g-png.png[/IMG][BR][BR]2. V rámci príprav novej rasy boli pridané k dostupnosti 2 prémiové rozšírenia ako aj nové jednotky do niektorých provincií.[BR][BR]3. Toto zatiaľ oficiálne nebolo oznámené a pravdepodobne ide o chybu, ktorá spôsobila skoré zobrazenie nových surovín pre nadchádzajúcu rasu.[BR][BR][IMG]https://i.ibb.co/0QyxK9j/https-image-ibb-co-iaj5-Ae-guyr-png.png[/IMG][BR][BR]Môžem vám potvrdiť, že ikonky vzácneho živoucího zboží tentokrát naozaj patria k novej rase , avšak tie posledné 3, magické živoucí zboží, má zatiaľ iba takzvané \"placeholders\", tzn. dočasné obrázky ktoré držia miesto pre tie orginálne, ktoré momentálne ešte nie sú vytvorené."}, {"115": "Super no Nová rasa plus suroviny se rovná další manufaktory. A tak se musím logicky ptát za hráče co mají již celkové rozšíření zaplněno jestli se jim uleví na nárocích požadavků starých surovin aby mohli uvolnit trochu místa? Já nevím ale ten vývojářský server se s reálným pro hráče moc nedomluví. Ale tak třeba po té úpravě vzhledu se město bude zdát třeba větší "}, {"66": "U elementálů se snížily nároky na T1 suroviny a spousta hráčů tak mohla zbourat jednu T1 manufakturu a postavit místo ní T4.[BR]Očekávám stejný postup u veškerého živoucího zboží."}, {"65": "@Pralinka : ale co se nároků na suroviny týče, tak to bych uživil i s půlkou manufaktur co mám teď  (výzkum, osadnická výroba, provincie akorát na odemknutí truhly...) co žere suroviny nejvíc je průzkum provincií daleko nad doporučené množství a hlavně turnaje (byť řekněme z 3/4 bojuji a ze 1/4 vykupuji) [BR][BR]spíš jde o to, že manufaktury si na nejvyšších úrovních srovnají jak velikost tak požadovaný počet lidí. takže výměna cokoli za cokoli je relativně jednoduchá. [BR][BR]spíš to bude chtít si dopředu nasbírat relikvie, které v akademii kouzel dokážou mizet docela rychle. [BR][BR]no a zase bude míň surovin na turnaje :-( protože co jiného ve hře dělat, než turnajovat, když už je výzkum hotový."}, {"59": "Jak se nám nová rasa přibližuje, těším se na ni stále více i když jsem si plně vědom toho, že zase budu láteřit, že nemám místo a co všechno mi chybí.  Ale  nějak to vykoumám, alespoň pročistím ten chaos, co už ve městě mám [BR]Ještě by to chtělo vědět, které bonusovky na nové živoucí zboží bude třeba stavět "}, {"99": "@pes63 : Předpokládala bych, že zůstaneme u systému aktuální bonusovka +1, aby v tom nebyl chaos, ale je to jen můj odhad [BR]Edit: V diskuzi na betě tvrdí totéž, ale je to jen od hráčů, zatím oficiálně nepotvrzené [BR][BR]Wow, tak teď jsem četla oznámení na betě a už se nemůžu dočkat, vypadá to na spoustu novinek  <3 PS: chybí mi tu ten smajlík se srdíčkama v očích "}, {"31": "Nová rasa prichádza na betu! [BR]Amuni[BR][BR]Spoiler: Amuni[IMG]https://i.ibb.co/51mpk9j/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-amuni-Announcement-banner01-png.png[/IMG][BR][BR]Informácie o tejto novej rase budem dopĺňať do tohto spoileru.[BR][BR]Ako vždy, očakávať môžeme 2 nové divy. [BR][BR][IMG]https://i.ibb.co/4fQg93s/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-amuni-Amuni-AW-02res-png.png[/IMG][BR]Maják dobrého sousedství[BR]- predlžuje dobu trvania kúzla Magický dar[BR]- zvyšuje efekt kúzla Magický dar[BR]- zvyšuje produkciu many v motivovaných kultúrnych budovách[BR][BR][IMG]https://i.ibb.co/fd73v8X/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-amuni-Amuni-AW-01res-png.png[/IMG][BR]Pyramida očištění[BR]- produkuje težkoodencov každé 3 hodiny[BR]- produkuje dodatočné bonusové živoucí zboží pri zbieraní orkov[BR][BR]V rámci nových výziev bude zavedená nová surovina, prestíž, potrebná na výstavbu osadníckych manufaktur.[BR][BR][IMG]https://i.ibb.co/Bf1LrZd/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-amuni-prestige-png.png[/IMG][BR][BR]Prestíž bude možné získavať za výstavbu a vylepšovanie Amuni monumentov, nazvané Chrámy dún. Prestíž bude potrebná na výstavbu osadníckych manufaktur Zlatník a Výrobce pastí, ktoré budú musieť byť tentokrát napojené na obytné budovy a dielne.[BR][BR]Amuni prinesie ďalšie 3 nové živoucí zboží, nazvané Obsidián, Tajomný atrament a Královský samet. Navyše, dôjde k rozšíreniu maximálnej veľkosti mesta, pridaním nového radu rozšírení na juho-západnú stranu! [BR][BR]Zároveň dôjde k navýšeniu maximálneho levelu u všetkých prastarých divov z 25 na 30.[BR][BR]Vo videu nižšie môžeme vidieť množstvo nových budov a ich úžasnú grafiku. [BR][BR]"}, {"59": "OOO, to vypadá velmi pěkně , tak to se můžeme tak do měsíce také těšit "}, {"16": "Je hezké, že přidali novou řadu pro rozšíření, ale zároveň nechali jenom 1 rozšíření z výzkumu a nezvedli limit z mapy.[BR]Evidentně hodlají omezit overscouting tím, že limit na rozšíření z mapy zvednou až se k němu bude blížit povinný počet provincií. (už zvolňuji overscouting - nemá smysl pak rok-dva stát na stejné ploše města. A za ty ceny rozšíření za dia - to je rozumnější (a mnohem levnější) investovat do kouzelných obytek/dílen).[BR][BR]Nové divy mají jednu výhodu - minimálně jeden z nich nebudu stavět (možná ani jeden)[BR]Maják můžu směle vynechat - efekt kouzla, které budu používat občas jen kvůli efektu Dračího opatství (mana za použití kouzla) mě nezajímá a na manu by mi měli stačit Bludiště a Dračí opatství.[BR]Pyramidu jsem tak nějak úplně nepochopil - jak vlastně funguje ta kombinace vnímavého zboží s výběrem orků (jestli při výběru orků ta pyramida vyprodukuje nějaké vnímavé zboží, nebo co vlastně přesně dělá). A jenom kvůli výrobě těžkooděnců to asi stavět nebudu (ale neznám přesný efekt ani užitečnost. Proti samozřejmě mluví stupňující se nedostatek místa)."}, {"66": "Naštvali mě, mám bonus na křišťál, takže obsidián zřejmě vyrábět nebudu.[BR]Jinak rozšíření max velikosti města a zvýšení max levelu divů - Ano, Ano, Ano [BR][BR]PS. Ta kočka z videa se jmenuje Packa "}, {"99": "@Prealiena : To jsme na tom podobně, také se mi nejvíc líbí obsidián  Ale ještě uvidíme, jak budou vypadat budovy, třeba nakonec budu ráda, že ho nemám [BR][BR]Rozšíření mapy je sice fajn, ale pokud mám správné informace (a nic se nezmění), tak ve výzkumu bude pouze jedno a rozšíření z provincií přidána nebudou [BR][BR]Zvýšení max levelu divů super, ale fakt nevím, čím to budu živit, těch divů je nějak moc [BR][BR]Jména kočičky jsem si taky všimla, aspoň nějaký (snad) český zástupce v Innu "}, {"59": "Na provincie asi budou láteřit mnozí (že z nich není rozšíření). Pokud to již nebude průzkum ale archeologie, třeba to přinese něco nového, pozitivního, kdož ví. A místo na place? To bude legranda, vyhodím všechno, co nebude úplně nutné, pryč se sentimentem "}, {"2": "Já upozorním ještě na vojenské upgrade[BR]Driáda na max, ta se mi používá dobře už ted, takže super.[BR]Dron na max, tomu jsem ještě na chuť nepřišel, tak se to snad změní.[BR]A druhá hvězda pro ropuchu, z té mám taky velkou radost."}, {"31": "@pes63 ak sa nemýlim, 13. kapitola vôbec nemá technológiu na zľahčenie provincií, tá archeológia na začiatku je na výskum portálu."}, {"16": "@iDavis To je ..... hezké ..........[BR]Hlavně že tam jsou další tři povinné sabotérské výzkumy. S takovou nebudou schopni hráči udržet své výkony v turnaji, když ani produkce armády a zejména surovin nedrží krok s těmi ******* \"vylepšeními\" oddílu.[BR]Možná to vývojářům dojde, až budou všechny v turnaji bodovatelné pozice obsazeny městy v nižších kapitolách, nebo až na turnaj přestane stačit i výkon diamantových měst. Ale možná je postupná likvidace turnaje jejich záměrem."}, {"105": "No, na novou rasu se také těším jak vosy na tureckej med. Jen mně mrzí že přidávají z výzkumu jen jednu kostku prostoru. Se svými 460 prozkoumanými provinciemi už rozšíření z provincií asi nedostanu a to jsem pak zvědavý, jak to všechno do města nacpu, když s každou rasou se některé typy budov zvětší. Teď bude řada na dílnách. Ty teď mají 3x7, kolik to bude teď, 4x6 nebo rovnou 5x5?"}, {"99": "@mcallen : Zatím koluje informace, že by to opravdu mělo být 4x6 "}, {"102": "Oni se spíše snaží, abychom neměli více budov, než je potřeba k postupu ve stromě ani neměli zbytečně velké kulturní bonusy. K turnajům je totiž potřeba mít výrazně více budov a ty není kam dávat. Částečně se to dá sice vybojovat ale na poslední dvě hvězdy už sahám u prvních 7 provincii skoro vždy k výkupu a to pak lítají stovky tisíc surovin do vzduchu za jedno kolo. Což člověk za týden nezvládne často ani zpět vyrobit a doplnit.[BR][BR]V podstatě bych řekl, že cílem autorů je co nejvíce tu hru zpomalit aby jediný způsob, jak si jí urychlit byli drahokamy. Protože zatím si celkem každý strategický hráč zvládl z eventů a dostupných budov poskládat města tak, aby postupoval rychle."}, {"62": "ExplorerFfff napsal/a:\t\t\tV podstatě bych řekl, že cílem autorů je co nejvíce tu hru zpomalit aby jediný způsob, jak si jí urychlit byli drahokamy\t\tKlikněte zde pro zvětšení...[BR]Ale proč ji urychlovat (myšleno prolítnout rasu - teď plácnu - za 14 dní, tři týdny), zejména je-li hráč  u poslední či předposlední rasy? Co pak bude hrát? Bude stát a čekat, až přijde nová rasa. Jasně, jeden je někdy nedočkavý a platí to i pro mne, ale tak to beru tak, že pokud chci mít něco rychle nebo hned, holt si za to zaplatím a nebo vydržím a budu hrát tempem, které určuje hra. [BR]Myslím tedy, že tvůrcům nejde v tomto případě primárně o zisk z diamantů (i když i ten je důležitý pro další vývoj hry), ale udržet hráče při aktivní hře, než pro nás připraví další rasu či jiná zpestření."}]