[{"102": "Je to asi moje profesní deformace z podnikání, ale mě táhlý systém vadí, připadám si pak jako zaměstnanec. Zrovna rasa je to, co chci mít co nejdříve za sebou z několik prostých důvodů a) místo na případné velké a malé eventy b) možnost věnovat se turnajům c) možnost vylepšit město a efektivně ho přeskládat - rasa co mi trvá déle jak měsíc mě už otravuje.[BR][BR]A pokud se mi někdy podaří hru dohrát do stavu, že se začnu nudit a seknu s tím tak to je pro mě výhra, já totiž nejsem hráč ale bohužel opět z důsledku mé profesní deformace se nevzdám úkolu, dokud ho nedodělám a jednou jsem si z totální hlouposti založil účet, z toho vyplývá i můj ledabylý nick, kdy jsem pouze přeběhl po klávesnici a tak nějak u toho zůstal, protože \"už jsem tomu věnoval 5 min, tak to dodělám\".[BR][BR]A k tomu, čím jsem větší, tím spíše potřebuji turnaje kvůli VB a turnaje + rasa se celkem vylučují co do nákladů celkově, nejlépe se mi tedy hraje hra v době mezi rasami, kdy mám volné pozemky a můžu celkem pohodlně dělat vše."}, {"62": "Co hráč, to jiný styl hry [smilie--sprite1] Hlavně si hru užívej a podnikání nech v práci [smilie--sprite1]"}, {"102": "To ano, ale já v práci bydlím, takže mě se to slejvá [smilie--sprite11] Uvidíme co z toho bude, mě se vyloženě to živoucí zboží zatím moc nezamlouvá a netěším se na něj. (jsem v půčících)"}, {"62": "Já též - myslím tím teď Půlčíky [smilie--sprite1][smilie--sprite1]"}, {"16": "Snaha hráče zpomalit z nich přímo čiší, ale stejně tam logicky zůstanou prodlevy (teda pokud nezajdete do extrémů, jako jedna hráčka na betě, co jí trvali trpaslící přes rok).[BR][BR]Já beru konec výzkumu jako příležitost k vylepšení divů a optimalizaci vesnice (vyšší levely divů mi umožní zredukovat počet potřebných dílen, kulturních budov, ...)[BR][BR]Evidentně se nás rozhodli potrestat za overscouting tím, že nám více rozšíření z provincií prostě nedají (než limit dožene povinné minimum)[BR]Samozřejmě do budoucna můžu potřebné místo získat i zmenšením místa pro rasu (a zpomalením jejího průběhu) - stejně už delší dobu povinné úkoly odklepávám v další rase.[BR][BR]Tady se to nějak hemží půlčíky - taky už jsem u nich (čerstvě asi 2 dny).[BR][BR]S turnaji to do budoucna vidím na vážný problém. Při zachování současného trendu vidím prostě budoucnost, kdy společenství složená z pokročilých hráčů nebudou schopna dávat 10. truhlu, neboť nároky na výkup vzrostou do výšin, kdy turnaje prostě nebude možné vykupovat (a možná ani provincie). A nezbyde, než to vše vybojovat - ale na to zase nebude stačit produkce armády (a to ani posílená divy)."}, {"31": "@Lovec Krys domnievam sa, že si tebou avizované spôsobené komplikácie turnajov vývojári uvedomujú, nakoľko chystajú kroky, ktoré ich zase spravia o niečo ľahšími. Ale to je ešte ďaleká budúcnosť."}, {"99": "@pes63 : Oficiálně potvrzeno, cituji z wiki:[BR]\t\t\tYour new boosted Sentient Good will be your current boosted Crafted Good +1. If your boosted Crafted Good is Scrolls, your new boosted Sentient Good will be Velvet (Silk), for Crystal it will be Arcane Ink (Scrolls) and for Silk it will be Obsidian (Crystal).\t\tKlikněte zde pro zvětšení...[BR]Pro ty, co neumí anglicky - bonusová výroba T5 bude aktuální bonusová T2+1, tedy stejný systém jako u Elementálú [smilie--sprite1][BR][BR]Jinak trochu roztrhám řady půlčíků, já jsem dnes dokončila Elementály [smilie--sprite8] Sice jsem doufala, že stihnu trochu vylepšit divy a posbírat manu na vylepšení hlavního sídla a výstavbu nových cest, ale i tak jsem ráda, že nová rasa je za dveřmi, aspoň se nodstanu do stádia, kdy by mě hra mohla začít nudit [smilie--sprite1]"}, {"65": "jsem jediný, koho tam zaujaly 2 technologie na obytky a 2 technologie na dílny? [BR][BR]jinak s prodražováním turnajů souhlasím, proč ... ideální by prostě bylo, aby ta technologie velikost oddílu na to neměla žádný vliv. turnaj bude úměrně těžký kapitole, takže výhodu bude mít vždy ten na konci kapitoly oproti někomu na začátku, protože upgrade jednotek. je to fér. nová kapitola mi zlevní provincie a skokově zdraží turnaj, ale jak projdu upradem manufaktur / jednotek tak ten deficit pomalu zase doženu. a nebo to bude poměrem vyzkoumaných technologií, třeba... [BR][BR]btw @Lovec Krys máš geniální názvy města, kde na to chodíš? [smilie--sprite1] (sleduji delší dobu)"}, {"59": "CorwinOfAmber napsal/a:\t\t\tjsem jediný, koho tam zaujaly 2 technologie na obytky a 2 technologie na dílny?[BR][BR]jinak s prodražováním turnajů souhlasím, proč ... ideální by prostě bylo, aby ta technologie velikost oddílu na to neměla žádný vliv. turnaj bude úměrně těžký kapitole, takže výhodu bude mít vždy ten na konci kapitoly oproti někomu na začátku, protože upgrade jednotek. je to fér. nová kapitola mi zlevní provincie a skokově zdraží turnaj, ale jak projdu upradem manufaktur / jednotek tak ten deficit pomalu zase doženu. a nebo to bude poměrem vyzkoumaných technologií, třeba...[BR][BR]btw @Lovec Krys máš geniální názvy města, kde na to chodíš? [smilie--sprite1] (sleduji delší dobu)\t\tKlikněte zde pro zvětšení...k těm 2 technologiím: záleží na tom, jak spolu (či vůbec) budou kooperovat nebo souviset, zda půjde používat jen jednu (resp. 2) nebo všechny 4, ale to se uvidí, zatím jsem v klídku a pohodě, samozřejmě vstřebávám (nebo se snažím) informace z fóra, prostě se těším na novou rasu. Mít dokončenou rasu mi nevadí, naopak [smilie--sprite1] mám rád trochu místa na události a také prostor na \"utřesení\" mnou postavených nesmyslů se hodí a navíc, když neutrácím suroviny, mohu je poskytovat novým hráčům společenství, což také někdy není k zahození. Ale pospíchat jistě nebudu, jelikož mi nezáleží na pozici v žebříčku (nebo nemám na to, aby mi na ní mohlo záležet)budu se soustředit na to, abych se alespoň \"vešel\" na plochu a nenapáchal více škody než užitku [smilie--sprite1]."}, {"99": "@CorwinOfAmber : Zatím jsem se prokousávala wiki, ke stromu výzkumu jsem se ještě neodstala [smilie--sprite8] Každopádně je to zajímavé..."}, {"16": "@CorwinOfAmber Těch dvojích technologií jsem si všiml, ale blíže jsem to nespecifikoval - spadá to do té mojí poznámky \"Snaha hráče zpomalit z nich přímo čiší\". Podle mne to znamená prostě, že teď budeme každý level obytek/dílen zkoumat zvlášť a tedy kapitolou půjdeme o něco pomaleji. (může to mít souvislost i s rasou, ale osobně tipuji na to zpomalování hráčů).[BR]Názvy města si vymýšlím, obvykle je odvozuji z výzkumu nebo právě postavených budov (platí pro město na cz1). Vymýšlet tyhle názvy je jedna z věcí, co mě baví."}, {"115": "@CorwinOfAmber  přesně o tom jsem psal úměrně těžké kapitolám. Protože začátečník dá pokud neupřednostní armádu a suroviny pro rozvoj stavění,vylepšení, rozšiřování a řešení provincií, zvládne cca 2 až 3 truhlu. Pokud strategicky upřednostní dané aspekty tak tu jednu truhlu. Pro pokročilého je první truhla nic a až do 4té máslo. [BR][BR]A jinak zpomalování hry není na škodu všimněte si kolik hráčů píše že čeká ve výzkumu atd. Takové chápu že Dobrodružství a různé eventy a turnaje jsou žádané. A taky je lepší nebýt průkopník, já být na konci a čekat na další rasu tak budu čekat trochu dýl až to projde diskuzí zde. [smilie--sprite1][BR][BR]Jen myslím že budoucí problém bude nedostatek místa ... Ono se to bude řešit ale jak to nápaditě vyřeší innogames to bude rébus. Jejich problém jejich peníze nápadů od nás mají dost."}, {"102": "Tak jejich řešení bude zcela jednoduché. Stačí aby v další rase nastavili velikosti budov a jejich \"zisk\" tak, aby se tam vše vešlo a mohlo se něco zbourat, tohle se týká především lidí a kultury. Ale zatím moc tento efekt nevidím.[BR][BR]Jinak důvod, že lidé stojí ve výzkumu je právě táhlost těch ras, věřím že většina tohle neříká, že stojí na konci, ale že jako třeba teď já cpe do divů, protože ty rasy se vyrábí pomalu a nemůžou tedy zkoumat i když VB již naplnili [smilie--sprite1]"}, {"65": "@Turunen - tys to psal v souvislosti s počtem provincií, kde jsem se tebou nesouhlasil. začátečník si nejdřív musí \"zasloužit\" šanci na zisk turnajový bodů tím, že postupuje rychle a otevírá další a další provincie. (mimochodem měl jsem za souseda hráče v 3. kapitole, co každý týden dával top 10, takže to jde. ale byl specializovaný jenom na turnaje a úmyslně seklý v té 3. kapitole). [BR][BR]Turunen napsal/a:\t\t\tPro pokročilého je první truhla nic a až do 4té máslo.\t\tKlikněte zde pro zvětšení...[BR]já a kolega mluvíme o tom, že přesně tohle není pravda. někdy od konce lesních elfů už se ty turnaje zdražují neúměrně tomu, kolik surovin navíc získám vylepšením manufaktur v dané kapitole."}, {"116": "Jedna technicka, to ze prijdeme o rozsireni z vyzkumu provincii bude platit pouze pro hrace, kteri vstoupi do vyzkumu Egypta ci pro vsechny ? Bo jestli jen pro Egypt, tak radsi budu delat dalsiho pul roku jen ta rozsireni, stejne bych Egyptem proletel a pak zase pul roku cekal na novou rasu. Jen to poradi obratim.Zacal jsem s hrou mnohem pozdeji a stale me chybi hodne stavebnich parcel."}, {"2": "Nepřijdeme, jen jestli jsi dosáhl 458 či kolika provincií tak další rozšíření nedostaneš a nezdá se že by to měnili"}, {"99": "@kalicz : To omezení rozšíření z provincií už platí dlouhou dobu, s Egyptem to nemá co dělat [smilie--sprite1] Je úplně jedno, jestli jsi v první kapitole nebo v poslední, jakmile prozkoumáš určitý počet provincií, za další prozkoumané už nové rozšíření prostě nedostaneš..."}, {"16": "Já se obávám, že další rozšíření z provincií dostaneme až se k současnému limitu bude blížit povinný počet na otevření truhly - aneb efektivní způsob, jak nám zrušit overscouting - prostě nám další rozšíření z provincií nedat. A pak si sakra rozmyslíme, co si v tom městě vlastně postavíme. Vůbec bych se nedivil, kdyby se přinejmenším někteří dostali do stádia, kdy budou mít na výběr, zda zmenšit místo na rasu tak na 1/2 nebo i 1/3, anebo na každou rasu prostě kus města zbourat a pak to zase měsíc-dva stavět znovu... (a kupa dalších hráčů to nejspíše nevydrží a s hrou praští). Ale třeba se mýlím a rozšíření z provincií nám dají dříve, než to dojde do takového stádia.[BR]Když se tak koukám - Elementálové 280, Amuni 310, to se tam ještě pár ras vejde."}, {"116": "GorGlin napsal/a:\t\t\tNepřijdeme, jen jestli jsi dosáhl 458 či kolika provincií tak další rozšíření nedostaneš a nezdá se že by to měnili\t\tKlikněte zde pro zvětšení...Nice, ted mam zrovna rozsireni na 457 [smilie--sprite1]. Takze rikas posledni ? :-("}, {"16": "kalicz napsal/a:\t\t\tNice, ted mam zrovna rozsireni na 457 [smilie--sprite1]. Takze rikas posledni ? :-(\t\tKlikněte zde pro zvětšení...Poslední do doby než nastane jedna z následujících variant:[BR]a) Nezbytné minimum na otevření truhly se bude k limitu blížit (tam se ještě pár ras vejde)[BR]b) Dostatečně velký řev hráčů na všech fórech (případně kombinovaný s bodem c)[BR]c) Masívní odliv hráčů ve vysokých kapitolách právě kvůli tomuto"}]