[{"59": "Problém s herním prostorem řešíme skoro všichni, nicméně masivní odliv hráčů nepředpokládám. Jistě to mají spočítané tak, aby hra šla hrát i když bude pro nás hráče vše delší a otravnější  a o to první jde především, tedy zpomalit nás. Hráč na vysokém levelu zřídkakdy odejde tak, aby zrušil účet, jen přestane hrát. Tím je sice hráčů méně, ale účtů nikolivěk. Také se zjevně počítá s tím, že dostat se na vysokou úroveň stálo hráče hodně času i úsilí a často i peněz a tak se málokomu bude chtít učinit tak razantní krok, jako je zrušení herního účtu. @Lovec Krys pěkně seřadil varianty přidání herního prostoru, souhlasím i s jejich pořadím [BR]Jelikož mě 1 čtverec ze hry nevytrhne, abych šel tak nějak prohledat tu svou vesničku a mentálně se připravil na pohřeb několika (hodně) budov  Pořídil jsem si festivalový set i když jsem věděl, že není kdovíjak výhodný a ten zpopelním jako první. Strategie hry setům zjevně nepřeje(nic nového pod sluncem) a tak se snad příště udržím na uzdě a budu sbírat jen ty nejpotřebnější budovy."}, {"92": "pes63 napsal/a:\t\t\tmasivní odliv hráčů nepředpokládám.\t\tKlikněte zde pro zvětšení...Já mám někdy sto chutí odlít se hned  protože vylepšení budovy za 17 hodin, na to fakt nemám nervy..."}, {"115": "Teď bylo ve zprávách že se vrací skořápkáři. A já to věděl dopředu že ty kombi budovy eventů kultura+obyvatelstvo je budoucí chyták.[BR]Ono možná semnou někdo nebude souhlasit ale pořád je lepší obyčejná obytka než kombi budova eventu. A taky se mi líbilo jak zde někdo napsal je opravdu základní promýšlet si co postavit a co a kdy vylepšit už od začátku. Já osobně co už prostřídal několik účtů tak bych bral možnost přeskočit tutoriál nebo upravit do více benevolence hráče. Taky zde v jiném vlákně témat jednou psal že úkoly jsou návodem jak hru hrát. Tak ano když chci hrát dle hry skořápkářů. V jedné dobré aktualizaci byla uvedena možnost přeskočit a odmítnout úkoly z předešlé kapitoly super věc dík za to. Na to někteří hráči co jsou dále ve hře negativně reágovali že oni to museli plnit. Ono ale dobře vám tak teď. Některé úkoly totiž a dodnes i eventové vás nutí k zásadním krokům které se zdají být třeba teď zanedbatelné ale do budoucna nadělají větší či menší problém.[BR][BR]Pokud se podíváte na mé město ve cz2 zjistíte že nemám postavené některé budovy.[BR][BR]Schválně si udělejte průzkum jaké budovy které nejdou zrušit pro vás mají váhu že kdyby to šlo tak je bouráte?"}, {"59": "ale některé budovy z událostí  jsou fajn, například otec pralesa.... v poměru čtverec/výkon nemají chybu a pokud jednou dojde k tomu, že půjdou vylepšit i na vyšší úroveň, budou ještě žádanější. A ty povinné budovy? Za nějaký čas mohou být potřebné nebo také nemusí, to beru jako daň z odhadu, moc se tím nezabývám. Nejsem žádný stratég ani věčný počítálek, hraji pro svoje potěšení a nějaký ten neúspěch moje dušička vydrží. Každý máme ke hře svůj vztah a přístup a dle mého názoru je nemožné určit ten jediný správný. Jsou věci, které nás \"krkají\" skoro všechny, ale jejich řešení jsou rozmanitá - každý dle svých možností, schopností, nálady či chuti a to se domnívám je jedině dobře. Alespoň je pak o čem diskutovat a občas naše diskuze i \"nakopnou\" k jinému postupu. [BR][BR]Odstraněna zbytečná citace. Embla"}, {"59": "Saux napsal/a:\t\t\tJá mám někdy sto chutí odlít se hned  protože vylepšení budovy za 17 hodin, na to fakt nemám nervy...\t\tKlikněte zde pro zvětšení...a) dostatek stavitelů[BR]b) urychlovače[BR]c) trpělivost[BR]d) svěrací kazajka  ?[BR]Někdy je to k popukání, jindy to zamrzí a když na průzkum provincie čekáš kolem 70 hodin, také docela fajn. Ale protože ty časy tak nějak rostou a rostou jiné to asi nebude "}, {"117": "Saux napsal/a:\t\t\tJá mám někdy sto chutí odlít se hned  protože vylepšení budovy za 17 hodin, na to fakt nemám nervy...\t\tKlikněte zde pro zvětšení...A to mas na tak dlouho jen portal ve sve kapitole, ne? Pak se vylepsuji i obytky, dilny, manufaktury i dele jak 17 hodin  to si zvyknes"}, {"116": "Saux napsal/a:\t\t\tJá mám někdy sto chutí odlít se hned  protože vylepšení budovy za 17 hodin, na to fakt nemám nervy...\t\tKlikněte zde pro zvětšení...[BR]A kam jako spechas ? Abys udelal rasu za 3 tydny a cekal dalsich 8 mesicu na novou ?"}, {"117": "ja celkove tohle nechapu... proc nekdo hraje tuto hru a neustale si pak stezuje, ze se mu neco nelibi... tu malo mista, tu dlouha vystavba... ja myslela, ze hraju strategickou hru, kde musi clovek premyslet a rozmyslet a ne, aby se neustale neco ladilo pro celkovou spokojenost a lehke rychle hrani... a pak jsou tu ti, kteri cekaji pul roku na novou rasu, protoze jakoukoli novou proskacou za tri tydny pomoci diamantu a pak tu vypisuji, jak se nudi... tak ty vady, to je jinej vesmir"}, {"16": "Turunen napsal/a:\t\t\tV jedné dobré aktualizaci byla uvedena možnost přeskočit a odmítnout úkoly z předešlé kapitoly super věc dík za to. Na to někteří hráči co jsou dále ve hře negativně reágovali že oni to museli plnit.\t\tKlikněte zde pro zvětšení...Ve skutečnosti nemuseli a mnozí neplnili, jen jim tam visel neodmítnutelný úkol starý několik věků. Ono dokud se nezavedly odměny 200 dia za úkoly na výzkum divů, tak to bylo jedno - ty ostatní odměny stejně nestojí za nic.[BR]Já například od verze, kdy to jde odmítnout, jedu úkoly způsobem, že plním jen ty, co se mi splní při běžných činnostech města. Pokud po mne úkol chce něco, co by mne zbytečně zdržovalo (např. výrobu surovin rasy na vylepšení rasových budov, když už je mám všechny na maximu, nebo postavení budovy, kterou bych stejně po splnění úkolu ihned zboural), tak plnění úkolové řady dané kapitoly ukončím a v nové kapitole prostě odklikám.[BR][BR]@donutka Je několik různých typů \"stěžovatelů\" - od těch, kteří si prostě musí stěžovat za každou cenu, přes ty, kterým se něco nelíbí, protože si to představují jinak než vývojáři až po ty, kteří upozorňují na objektivní problémy (existující, nebo vznikající).[BR]Nedostatek místa samozřejmě řešíme všichni. Každý se s ním vyrovnává jinak a mnozí tomu něco obětují - někteří to např. řeší tak, že kašlou na turnaje (a)nebo eventy, jiní různě optimalizují vesnici, další zmenšují místo pro rasy (a procházejí tak kapitolami déle).[BR]Já sám mám hned několik možností, jak se s tímto vyrovnat.[BR]A zatímco se někteří mezi rasami budou nudit, já to vidím jako příležitost vylepšovat si divy a optimalizovat si vesnici (vylepšením některých divů je možné snížit místo zabírané některými budovami). Kromě toho je toto období výhodou pro události typu dobrodružství společenství nebo eventy obecně (on je v tomhle docela rozdíl ve výkonu města, když má volných pár políček na kterých postaví pár malých budov navíc, nebo zda má volné celé místo po rase a malých budov může postavit desítky).[BR]Jedna z minulých (a stále ještě i současných) strategií, jak se vyrovnat s nedostatkem místa je overscouting. Ten má však svůj limit a rostoucí počet hráčů již na něj narazil - ti pak mají problém, kdy (pokud nechtějí jít cestou rozšíření za diamanty(ale rozumný počet dia stojí jen prvních pár rozšíření, pak to je v kategorii nehorázně vysoká cena(a stále rostoucí))) s každou další rasou mají k dispozici jen 1 rozšíření z výzkumu, což znamená, že v některých oblastech výkon jejich města neroste, ale mnohdy naopak klesá. Což je pro tyto hráče samozřejmě frustrující a ne všichni se s tím dokáží vyrovnat."}, {"92": "Já nikam nespěchám, já mám času dost  Je mi jasný, že budovatelská strategie sežere něco času, ale jak píše kolega @Lovec Krys, vylepšování divů taky není špatný "}, {"59": "Tak kdypak spustí novou rasu na ostrých serverech, dokud o tom nebyla ani zmínka, tak to šlo, ale teď už jsem docela dost zvědavý. "}, {"99": "@pes63 : Na betu přišli Amuni ve čtvrtek, u nás bych je určitě neočekávala dříve než minimálně s týdenním odstupem "}, {"31": "Amuni kapitola bola na bete podľa všetkého súčasťou verzie 1.61, ktorá by mala na náš server prísť o necelé 3 týždne."}, {"2": "Já bych to uvítal, za týden jedu na dovču"}, {"115": "Když jsem si prohlížel wiki a to video tak jako člověk co má rád v reálu starou architekturu k tomu musím napsat svůj názor.[BR]Ono když se to veme z hlediska architektury tak musím ocenit budovy elfů. U některých budov elfů respektivě hlavního sídla jsem si řekl že to bych viděl v realizaci radši než návrh knihovny od Kaplického. [BR]U lidí bych uvítal více z reálu protože lidstvo z hlediska národů a věků má opravdu bohatou architekturu, z pohledu jen stylů romantismu nebo baroka atd starého řecka atd ... by to zaplnilo mnoho kapitol. U hry Grepolis jsem byl spíše zklamán jak odfláknuté to je. Víc by Grepolisu slušel podklad elvenaru.[BR]Ale to hlavní co chci říct že to s tou rasou amuni vůbec nechápu. O tom jestli předchozí rasy se více či méně hodí lidem nebo i elfům je diskuze ... ale amuni úplně ale úplně to celé znásilní egyptskou architekturou jak u elfů tak lidí kde se bude mezi hlavním sídlem ala hrad style a navázanou architekturou 15 století mixlou různýma skřetama dá egypt ... [BR][BR]Ale ono to innogames moc celkově neumí. U foe je bordel celkově všecko špatně. Ať to je údajný čas dob a pojetí budov a výzkumu. O historii ani nemluvím."}, {"66": "Ve fantasy hře asi nemůžeš čekat příliš historickou přesnost.[BR]Zvláště v Elvenaru, tady už jsme zažili lískové ořechy ve slupce od kaštanu, kentaury křížené s jeleny a z nějakého důvodu mají víly tykadla a půlčíci rohy. Je vidět, že si designéři pouštějí představivost hodně daleko.[BR][BR](Navíc tohle není Egypt, jenom vybraná oblíbená egyptská bohyně. V ideálním případě by následující kapitolu mohli udělat třeba s Horem a pokračovat každou další kapitolu s jiným bohem. Ale pochybuji, že jim to zaměření tak dlouho vydrží.)"}, {"116": "Ahoj, mate nekdo nejakej odkaz na strom vyzkumu s Amuni ?"}, {"59": "aaaa  další zvědavec - jako já  no, myslím si, že budeme mít dostatek času strom výzkumu prozkoumat až to přijde, protože zajisté požadavky na výzkum budou náležitě \"mastné\" "}, {"16": "@kalisz Odkaz přímo nemám, ale na betě už je vidět - stačí si tam založit vesničku (zz1.elvenar.com)"}, {"99": "@kalicz : Strom výzkumu je zde https://tinyurl.com/y7xmxbud i s požadavky na odemčení "}]