[{"31": "Pár obrázkov budov z novej kapitoly.. [BR]Amuni - obrázky[BR][BR]Spoiler: Amuni - obrázkyKultúrna budova:[BR][IMG]https://i.ibb.co/3vhgCHj/http-ipic-su-img-img7-fs-A-Gr8-Large2-1-Animated-1531152113-png.png[/IMG][BR][BR]Manufaktura na kryštál (lvl 24):[BR][IMG]https://i.ibb.co/XLXbW7Z/https-en-wiki-elvenar-com-images-thumb-1-11-G-Humans-Factory-Glass-24-png-800px-G-Humans-Factory-Gla.png[/IMG][BR][BR]Manufaktura na svitky (lvl 24):[BR][IMG]https://i.ibb.co/3pGZnCJ/https-en-wiki-elvenar-com-images-thumb-8-85-G-Elves-Factory-Paper-24-png-800px-G-Elves-Factory-Paper.png[/IMG][BR][BR]Manufaktura na hedvábí (lvl 24):[BR][IMG]https://i.ibb.co/3pNLCr3/https-en-wiki-elvenar-com-images-thumb-8-8e-G-Humans-Factory-Silk-24-png-800px-G-Humans-Factory-Silk.png[/IMG][BR][BR]A jednotlivé monumenty (chrámy):[BR][IMG]https://i.ibb.co/DgjpKFf/https-image-ibb-co-gm-BTMK-gr8-monument1-png.png[/IMG][BR][IMG]https://i.ibb.co/276gjnN/https-image-ibb-co-hgy-Wae-gr8-monument2-png.png[/IMG][BR][IMG]https://i.ibb.co/TPRJH5Z/https-image-ibb-co-emp-F1-K-gr8-monument3-png.png[/IMG][BR][IMG]https://i.ibb.co/mSm97bT/https-image-ibb-co-it-VNg-K-gr8-monument4-png.png[/IMG][BR][BR][BR][BR]​"}, {"66": "Hm, že bych se nakonec na ten inkoust začala těšit?"}, {"99": "Ta svitková budova je super!  Mám ji jako bonusovou T2, už se těším, až je všechny vylepším "}, {"118": "Svitková budova s drakem? Super, miluju draky)"}, {"117": "tak vzhledem k tomu, ze je to manufaktura na draci svitky, tak bude porad vypadat jako draci..."}, {"74": "To si dělají srandu, ne? Vylepšit jednu budovu (u mne například krystal) z 23 na 27 level = 5809 obyvatel ?? Obytná budova nově přidá na dvou levelech + 600 dohromady = abych vylepšil jednu krystalovou na max tak musím vylepšit 10 obytných na max.... nemám tedy šanci mít ani 3 výrobny na max....[BR][BR]No a podle všeho tedy T1 budovy ztrácí význam...znamená to tedy prodat a lidi přesunout do T2"}, {"99": "Také už jsem to skládala do architecta a jsem v mínusu jak s lidmi, tak s kulturou. Ještě tam mám pár místeček na malé kulturky, budu muset projít inventář a podle toho to tam zkusit nastrkat, ale stejně si myslím, že mi to stačit nebude. No, nevím co s tím budu dělat..."}, {"102": "To bude druhá odměna k té kouzelné, co jsme asi dostali... Cukr a bič."}, {"99": "Samozřejmě kdybych přidala několik rozšíření, tak mi to nakonec vyjde, ale to bych nerada. Už takhle budu muset kvůli nové rase přidat 3 a nechci se dostat na maximální hranici rozšíření z provincií, pak by mi to chybělo zase v dalších rasách... Asi budu muset vylepšovat divy, ale to je také na dlouho, chce to moc moc bodů  Elementy jsem dokončila minulý týden, tak jsem neměla moc dlouhou pauzu na házení bodů do divů "}, {"74": "@Angedev [BR]Zlatá propast ani Horské sídlo to nezachrání.... jsou to mizivá procenta na populaci....."}, {"99": "@Silversnake : Tak zase mi nechybí třeba 30 tisíc  Přesné číslo teď nevím, musela bych doma na počítači, ale bylo to něco kolem 2 tisíc max při úplném vylepšení budov... Pár stovek to zachrání bez nároku na místo a v kombinaci s malými kulturkami kult.+pop. to třeba klapne "}, {"102": "No ono to povede asi k tomu, že nějací lidé skončí. Já sám o tom už začínám uvažovat, protože stavět se mi další manufakturu a bourat své moc nechce, jde totiž o to, že mě to ochromí v turnajích, které jsou příšerné drahé a overscoutingu, jen proto že budu muset mít \"zbytečně\" min jednu co mi bude dávat pouze živoucí, které člověk potřebuje jen ve stromu apod. K tomu všemu jsem díval jak prudce stoupají nároky na místo, když si vezmu, že jsem o 100 provincii dál, mám asi 5 provincii za diamanty a pokud vylepším vše co mám v aktuální etapě, tak budu defakto na nule s lidmi a místem, pokud zachovám dost místa na rasu, tak si říkám, proč se vlastně stresovat hrou, která člověka nutí se nějak víc a víc omezovat. [BR][BR]Mě by nevadilo, kdyby nároky stoupali spolu s místem. Mě vadí, že místo prakticky máme omezené ale nároky stoupají i když někteří mají, či měli možnost si udělat místa více. Je to to samé, jako by jste si vybudovali firmu, stát vám nakázal, že musíte vyrobit 2x tolik zboží ale nesmíte rozšířit výrobní provoz nad rámec CHKO a protože technologie výroby neumožní zvýšit efektivitu natolik aby se zachoval zisk pro majitele, tak ten majitel prostě půjde a radši továrnu zavře.[BR][BR]Uvidím jakmile se dostanu do ementálů, zda si zvyknu a nebo to zabalím, ještě před časem jsem byl smířený ale to prostudování gamersgemsofknowledge v kočkách mě více méně zklamalo."}, {"119": "skvele za chvilku prijde nova rasa....Jen mne zajima, jestli to bude stejne jako u elementalu,ze si budu muset postavit jinou manufakturu, kvuli specialni vyrobe, nebo to platit nebude.Nechce se mi zbytecne pristavovat manufaktury, ktere jsou pro mne celkem nevyhodne, staci kdyz mam ve meste stale ocel na platinu a zbytecne mi to zabira prostory, kdyz to nevyuziju, teda az u nove rasy, kde to bude chtit "}, {"16": "@aikomi Je tomu tak stejně jako u elem (a u rasy, co přijde po Amuni). T4 využiješ hned u zkoumání archeologie a T5 chvíli poté, co je vyzkoumáš."}, {"119": "Lovec Krys napsal/a:@aikomi Je tomu tak stejně jako u elem (a u rasy, co přijde po Amuni). T4 využiješ hned u zkoumání archeologie a T5 chvíli poté, co je vyzkoumáš.\t\tKlikněte zde pro zvětšení...[BR]Tomu rozumim, takze mam chapat, ze zase budu stavet zbytecnou manufakturu, kterou vyuziji jen na vzacne zbozi, nebo mi to bude produkovat ma dosavadni bonusovka? Nechce se mi zrovna stavet zase jinou manuf, to pak budu muset bourat zbytecne sve hlavni bonusy, jen aby se mi to tam veslo. :-([BR][BR]A jeste jeden dotaz, podle spoileru a videa k tomu dane, tak budu muset potom napojovat suroviny ne k portalu,ale k dilne a obytce? Co jsem dobre pochopila, nebo ne? Anglictina neni muj kamarad :-D[BR][BR]Aaaa tak ut jsem to nasla i na anglickych strankach, tak budu muset zacit lepsit pro mne nevyhodne manuf [BR][BR]// Sloučeny příspěvky, Dellingr"}, {"99": "@aikomi : Potvrzuji obojí. Bonusová T5 = bonusová T2+1, Takže tě opravdu čeká nová budova (já už se stavbou začala ). Budovy osadníků budou opravdu navázány na obytky a dílny - 2 typy, každá na jednu (nechci se pouštět do českých názvů dokud nejsou potvrzené ). Jen portál musí být klasicky spojen cestou s hlavním sídlem a monumenty požadují přímý kontakt s portálem (podobně jako u čarodějů)."}, {"74": "JJ je to tak a ne jinak a jak asi zase když ne jinak?[BR][BR]If your boosted good is Crystal, your Sentient boost will be Arcane Ink \t\t\t\t\t\t\t\t\t\t\t\t\t (Sentient Scrolls.)If your boosted good is Scrolls, your Sentient boost will be Royal Velvet \t\t\t\t\t\t\t\t\t\t\t\t\t (Sentient Silk.)If your boosted good is Silk, your sentient boost will be Obsidian \t\t\t\t\t\t\t\t\t\t\t\t\t (Sentient Crystal.)Mám krystaly takže stavím svitkovou výrobnu... a musím zastavit výrobu kouzel  aby mi nechyběly svitky na boost výroby"}, {"119": "A kolik budes stavet manufaktur, ja mam z elementalu postavene 2 vyrobny na platinu, tak nevim jestli nemam zas postavit 2 vyrobny na tu dalsi specialni vyrobu,jestli je nekde dano, kolik bude stacit, tak aby mi to pokrylo mou vyrobu a nezdrovalo mne to, uz ted ale vim,ze budu muset bourat,aby se mi tam vsechno veslo....kdyby aspon novou rasou ubyla platina a nemusela bych ji mit postavenou....[BR][BR][BR]//odstraněna zbytečná citace - Ódin"}, {"99": "@aikomi : Já mám jednu T4 a plánuji i jednu T5. Nejenom, že je na ně potřeba prostor a lidi, ale také musíš uživit výrobu, která vyžaduje semínka a ta potřebuješ i na výrobu zboží osadníků. Není kam spěchat, další rasa bude určitě zase až buhví kdy, tak klidně pojedu pomaleji "}, {"102": "Taky ty ceny v tom společenství nevypadají tak marně, nevím zda se aktivně dokopeme spolupracovat, se většina stydí psát mám pocit, ale tak první truhlu asi dáme. https://elvengems.com/fellowship-adventures/august-2018-adventure/"}]