[{"2": "Takže zobrazování potivací v přehledu společenství mám nechali schválně, abychom věděli že hrajen hru co se vyvíjí?[BR][BR]Německá wiki je natom stejně blbě[BR][BR]Což mi připomíná, můžete sem někdo nahodit ceny zvedání fakult?"}, {"38": "stavitel :-DDD"}, {"39": "jak tu tak koukám na ty obrázky odměn z eventu ,tak se moc těším.Akorát přemýšlím ,jestli se mi zadaří něco získat ,tak kam to dám  [BR]GorGlin : z těch chyb jsem i já rozladěná.Nevím na copak je zkušební server ,když pak na \"ostro\" je hra plná chyb. Už jsem rozladěná z těch chyb.Zajímalo by mně ,jestli by si Inno toto dovolilo třeba na Forge of Empires  .Když si představím ,že proti mně tam bude stát hromada vytuněných vojáků s mnohem vyšším bonusem a v početní převaze ,tak nevím nevím kolik lidiček by se ozvalo.Asi mnoho."}, {"17": "Luciasek7 napsal/a:\t\t\tNevím na copak je zkušební server ,když pak na \"ostro\" je hra plná chyb. Už jsem rozladěná z těch chyb.Zajímalo by mně ,jestli by si Inno toto dovolilo třeba na Forge of Empires Klikněte zde pro zvětšení...Pokud bych si chtěl takhle bezhlavě stěžoval, tak bych si nejprve uvědomil, že Elvenar je prohlížečová hra, ve které se objevuje nový obsah každých 14 dnů, takže je jasné, že i když se snažíme, nikdy se nám nepodaří nahrát aktualizaci bez chyb. Samozřejmě nás mrzí, pokud se nám do nové verze vloudí vícero chybiček, ale určitě to není naším záměrem."}, {"39": "Forseti vím ,že to není záměr ,ale je opravdu těch chyb moc.Je škoda poznat novou aktualizaci podle chyb a ne podle hezkých změn.Na každou aktualizaci se těším ,co nového přinese a pak jsem z toho rozladěná a mrzí mně ,že tak krásná hra je pokažená množstvím chyb.Ale i tak klobouk dolů.Když to vezmu všeobecně ,tak snaha je opravdu vidět.Až na ten nešťastný bojový systém.Ale to už to bylo psáno mnohokrát  .... a moc se těším na event  ... snad nebudou chyby "}, {"17": "Každá nová verze obsahuje max. 3-4 globální chyby (a ty jsou zpravidla kosmetické, nijak tedy neomezují herní zážitek), takže nevím, jestli je vhodné říkat, že chyb je opravdu moc. Ale samozřejmě nás i ty 3-4 chyby mrzí, protože vaše spokojenost je pro nás to nejdůležitější. "}, {"39": "však vy za to ani nemůžete ...... ono se to poddá.Ale pořád je hra krásná ,takže má cenu jí hrát.Co jsem v lesních elfech ,tak se nemohu nabažit těch krásných budov apd.....povedlo se to.Vím ,že čtete spoustu kritiky ,ale kdyby nás ta hra nebavila ,tak jdeme pryč a ni ta kritika by tu nebyla. Ale je pravda že ty chyby jsou většinou nepatrné ,často jen vizuální ,takže to není problém zase tak veliký "}, {"38": "chci aby elfka nebyla modrá :-DDD"}, {"42": "Maxa napsal/a:\t\t\tod kdy potrebuje \"stavitel\" (dělnická chatrč) napojení na cestu ? Klikněte zde pro zvětšení...No zjistil jsem že nepotřebuje, ale doposud jsem si to fakt myslel a taky se s tím pří stavbě kolikrát trápil. Člověk se holt furt učí "}, {"43": "Forseti napsal/a:\t\t\tKaždá nová verze obsahuje max. 3-4 globální chyby (a ty jsou zpravidla kosmetické, nijak tedy neomezují herní zážitek), takže nevím, jestli je vhodné říkat, že chyb je opravdu moc. Ale samozřejmě nás i ty 3-4 chyby mrzí, protože vaše spokojenost je pro nás to nejdůležitější. Klikněte zde pro zvětšení...No nevím jestli chyby,když vám dá více hráčů motivaci v podobě mincí a vy dostanete jen za jednoho a pak chyba při které se neukazují motivace v podobě zlatých ručiček je jen kosmetická a nijak neomezuje herní zážitek,to bych asi moc netvrdil.Na to že to jsou chyby co způsobili sami vývojáři,už to trvá pěkně dlouho.[BR]Nikde neni psáno,že aktualizace musí být po 14 dnech,tak proč nevyužijí více času k dokonalosti.Kdyby to bylo po měsíci,myslím,že by to nikomu nevadilo..."}, {"27": "Papape tady tě hned opravím, všechny motivace v podobě mincí dostaváš v množství jaké mít máš, to že se to zobrazuje jen jako jedna je věc oné chyby ale za celou dobu od nahlašení, které jsem tu dával na fórum, jsem nepřišel o jedinou minci, kterou mi sousedé či kolegové ve spolku dali pomocí motivací, navíc tě jistě potěší že oprava už by měla být ve verzi 1.26 kde se tento grafický bug odstraní."}, {"17": "papap napsal/a:\t\t\tchyba při které se neukazují motivace v podobě zlatých ručiček je jen kosmetická a nijak neomezuje herní zážitek,to bych asi moc netvrdil.\t\tKlikněte zde pro zvětšení...Ve svém posledním příspěvku jsem jasně psal, že chyby jsou „zpravidla kosmetické“. Holt kdo chce psa bít, hůl si vždy najde.  [BR][BR]Držme se prosím tématu!"}, {"44": "Ahoj,[BR][BR]nevíte kde bych sehnal kolik potřebuji obyvatel na: dílnu a hlavní sídlo u draků a kolik to má úrovní. Zbrojnice, cvičiště a hedvábí je už na wiki ale ostatní jsem nenašel. [BR]jo a ještě kolik dávají obyvatel u draků a kolik je úrovní navíc...[BR][BR]Děkuji Tonda"}, {"2": "Z elvenarachitekta to všechno vytáhneš"}, {"31": "Čo nás čaká...[BR][BR]Spoiler: 1.27vybalancovanie prastarých divov kapitoly II:Knihovna tajemství - namiesto pridávania zásob bude zvyšovať kapacitu skladu zásob v hlavním sídle [BR]Zlatá propast - namiesto pridávania mincí a obyvateľstva bude zvyšovať kapacitu mincí v hlavním sídle a znižovať percento pracujúcich obyvateľovopravy niektorých chýbpoukazujú na ďalšie vybalancovania ďalších prastarých divov v priebehu najbližších týždňov"}, {"45": "@iDavis ... som zvedavy na zlatu propast, lebu ju mam na lvl 20 .... ci mi zoberu ludi co som jej vylepsovanim doteraz ziskal a ako to prepocitaju na zvysenie kapacity sidla.... to bude zaujimave, uz to vidim "}, {"31": "@paulo1414 obávam sa, že obyvateľstvo nadobudnuté týmto prastarým divom nám zoberú.  Mne pridáva okolo 900 obyvateľov (keďže ju mám len na leveli 6) a ak mi ich vezmú, tak budem v mínuse.."}, {"45": "@iDavis ... u mna je to 4000 a ked o nich pridem tak sa z toho bude spamatavat pekne dlho"}, {"2": "to je dost obrat proti tomu co tvrdí v březnové InnoTV"}, {"44": "GorGlin napsal/a:\t\t\telvenarachitekta\t\tKlikněte zde pro zvětšení...kde to najdu děkuji"}]