[{"74": "@Angedev = to souhlasí.... měl jsem dvě a byl problém se semínky je vyprodukovat... nechal jsem si teď jen jednu, radí nám to i \"odborníci\" [smilie--sprite1][BR][BR]1 is arguably plenty to get through the chapter, especially if you have many Magical Manufactoring enchantments and make liberal use of them.[BR][BR]Higher producers may like to have 2.[BR][BR]3 will be very challenging to afford.[BR][BR]@ExplorerFfff, si dělají srandu ne? ukazovat hodnoty pro třináctý level, když dobrodrůžo začně/skončí dřív než budou Amuni....a budova na manu je na tom stejně jako pochodňová fontána (přepočteno na pole....), dnes jsem strávil více jak 2 hodiny na ElvenarArchitectu.....všechny zbytečné budovy musí z baráku....takže ani na tyhle eventové budovy nebude místo...[BR]je potvrzeno že je \"stopstav\" na 457 provincií a je pouze jedno rozšíření v celém 13 levelu.... prostě trvají na tom abychom si zakoupili rozšíření...... já osobně asi zredukuji T1 na 2 budovy.... nějak bude.... vyházel jsem vše od armády, mám jednu zbrojírnu + 1 kasárna.... nebude důvod už válčit když z toho nic nevytěžím (rozšíření z provincií)[BR][BR][BR][BR]//sloučen doublepost - Ódin"}, {"78": "Ahoj, já osobně to udělám tak že nechám 3-4 manufaktury od každé, tj. T1 až T5. V příští rase nepochybně přibyde T6. Požadavky na výzkum nejsou nijak dramatické aby je tři nebo čtyři manufaktury neutáhly a ještě zbyde na výkup provincií. Se semínkama jsem nikdy neměl nějakej zásadní problém."}, {"59": "koukám, že v rotujících úkolech došlo ke změně směrem k Amuni [smilie--sprite1] já dostal neodmítnutelný úkol na utracení 50 VB a kolega, co je dál, dostal úkol vymyslet výzkum archeologie [smilie--sprite1] a tak je jasné, že s další aktualizací je to tady, zatím jsem popřesouval co se dalo a tak nějak rozmyslel, kam s tím novým, už to vypadá slibně. [smilie--sprite1]"}, {"120": "Já dostala oba tyto úkoly.[BR][BR]Odstraněna zbytečná citace. Embla"}, {"59": "Protože je toto místo asi nejvíce navštěvované, tak tedy sem: [BR]děkuji (a pevně věřím, že nejen za sebe) velmi pěkně za krásně zpracovanou českou Wiki a také za to, že jsme si s předstihem a v klidu mohli plánovat novou dobu - Amuni. Vždyť autor české verze měl jistě s překlady mnoho práce i starostí a to, že novinky byly uveřejněny s takovým předstihem a v takové kvalitě svědčí o vysoké profesionalitě našeho týmu Elvenaru. (Klidně mohli vše zveřejnit až k datu nové aktualizace, což by pro mnoho hráčů znamenalo hledat v EN verzích anebo jinde). Normálně by mi to ani nedošlo, co práce a úsilí za tím vším je, člověk to bere jako samozřejmost, ale dnes jsem se věnoval přípravě své vesničky na příchod nové rasy a Wiki jsem použil mnohokrát a tak mi vše došlo. Takže ještě jednou - díky moc."}, {"31": "Prinášam malú.. [smilie--sprite1][BR]Spomienku na Woodelvenstock[BR][BR]Spoiler: Spomienka na WoodelvenstockKLIK"}, {"31": "Blíži sa nová úkolová rada.. [smilie--sprite1][BR]Toulavý měsíc[BR][BR]Spoiler: Toulavý měsíc[IMG]https://i.ibb.co/LxvyMZZ/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-wanderingmoon-banner01-png.jpg[/IMG][BR][BR]Predpokladaný termín: 23.8. - 4.9.[BR][BR]Spoiler: ÚlohyKompletný prehľad úkolovej rady: ..:: Toulavý měsíc ::..[BR][IMG]https://i.ibb.co/vkT6j66/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-wanderingmoon-Rew02res-png.png[/IMG][IMG]https://i.ibb.co/DRxh0B5/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-wanderingmoon-Rew01res-png.png[/IMG][BR][BR][IMG]https://i.ibb.co/M6pFhJq/https-image-ibb-co-d-CT2-Lp-EL-akcia-astronomi-2018-h-odmeny1-png.png[/IMG][BR][BR]Všetky informácie budem postupne dopĺňať do tohoto spoileru. [smilie--sprite2]"}, {"99": "Ani chvilku klidu nám nedopřejí [smilie--sprite8] Teď mám zároveň novou rasu, dobrodružství a turnaj, příští týden hned úkolová řada. Abych za chvíli neskončila v blázinci, jak se budu snažit všechno stíhat [smilie--sprite8]"}, {"59": "@Angedev  Když vezmu do úvahy, kolik vb stojí výzkum v Amuni, tak si myslím, že nám ta událost až tak vadit nebude[smilie--sprite8]. Záleží sice na tom, jaká bude úkolová řada, ale to se nějak utřese. [smilie--sprite8]"}, {"92": "Není těch úkolů nějak málo?"}, {"31": "@Saux celkovo ich je 36, dopĺňam ich tam postupne."}, {"92": "Aha, tak to jo [smilie--sprite1]"}, {"102": "Jako průběžné ceny jsou i urychlovače?"}, {"31": "@ExplorerFfff áno, všetko možné, urýchlovače (ktoré sa ale s Woodelvenstockom porovnávať nedajú), požehnání, mince, zásoby, relikvie, kultúrne budovy ako miľníkové odmeny.."}, {"102": "Super, celkem jsem si oblíbil by pár minutové totiž, ono jak jsem to dříve zatracoval, tak jsou situace kdy se to fakt hodí. A pamatuji si, že když byla ta valpružina noc bylo jich tam hromada."}, {"16": "@iDavis O té druhé budově nevím (nevidím ji). To bude druhá část úkolové řady nebo ji nějak automaticky dostaneme? (např. při splnění určitého úkolu - už jsem dostal Dark Signpost).[BR]Jinak úkoly vypadají zatím celkem rozumně, prvních 13 hotovo."}, {"31": "@Lovec Krys druhá budova je súčasťou priebežných odmien, takže sa dá získať za splnenie určitého počtu úloh prvej sady."}, {"121": "Zdá se mi to, nebo je těch prvních 15 úkolů snad až směšně lehkých?"}, {"65": "nezakřikni to paule :-D jestli tam budou malé urychlovače jako průběžné odměny a ta 2x3 věžička nebude až na závěr, určitě do toho jdu. budov lidi+kultura jsem si na festivalu nahrabal hodně, ale zrovna taká malá sranda co mi dá 3.5k kultury se mi docela hodí [smilie--sprite6]"}, {"5": "bod 29. je hezké, že si lze vybrat, mysleli jste i na malé hráče i velcí budou rádi jen za jedno vylepšení kvůli místu [smilie--sprite1]   děkujeme, je vidět, že čtete, přemýšlíte a vycházíte vstříc...palec. [smilie--sprite1]"}]