[{"102": "Získal jsem první plánek a chci se zeptat. Ví někdo jak bude fungovat královská rekonstrukce?[BR][BR]Mě zajímá především to, zda bude fungovat jako plánky - vylepší budovu o jeden level nahoru a nebo bude na kulturní budovy fungovat tak, že je vylepší na aktuální level ve kterém hráč právě je? Ví tohle někdo prosím?[BR][BR]Tedy vylepší třeba budovu z orků do elementálů jedno kouzlo nebo ne? Z bety se mi zdá, že to bude fungovat jen o jeden level, takže to nebude takové terno jako jsem si myslel."}, {"16": "Jsem si prakticky jistý, že nejlepší poměr, který dostaneme je 1 kouzlo na 1 level.[BR]Dle mého jsou plány některých, kteří si schovávají několik ras staré eventovky s tím, že je vylepší královskou rekonstrukcí, jen plýtváním plánků (pokud jich někdo má stovky, tak to je jiná, ten si jimi může dovolit plýtvat)."}, {"102": "Toho se bojím, já si totiž držím ze zimního eventu kvůli orkům kousek setu a doufal jsem, že to třemi plánky hodím do ementálů, ale když jsem se nad tím zapřemýšlel, tak sice se asi kouzlo bude používat myší a neobjeví se nic jako \"vylepšit\" takže by teoreticky mohlo jít vylepšit na max oproti budově, ale ze strany inno by to asi bylo příliš štědré, člověk by tak snadno počkal ob rasu a vytáhl si to nahoru. Takže si asi nebudu moci dovolit časem ignorovat budovy v eventech ale stejně bude výhodnější některé vyměnit."}, {"99": "Právě jsem se na beta fóru dočetla něco, co jsem se dočíst tedy opravdu nechtěla... Ve čtvrtek 6.9. startuje na betě nové dobrodružství, bohužel opět bez změny systému úkolů [smilie--sprite3]"}, {"43": "Já už tyto akce neřeším a užívám si svého pěkného městečka. [smilie--sprite1] Dobrodružství a úkolové řady (ať je mi to líto,rád bych se zapojil) nestojí za tu námahu šíleného klikání a více času stráveného u PC,.."}, {"99": "S dobrodružstvím je ten problém, že se týká celého společenství. A pokud si většina odhlasuje, že chtějí hrát, pak je v tom nechci nechat... A to jsem zrovna v Amuni, takže naprosto bez místa [smilie--sprite3]"}, {"16": "@Angedev Tak jim holt pomůžeš jen limitovaně, stejně jako já, když jsem uprostřed půlčíků a místa mám taky málo.[BR]I když bych měl raději chvíli klid."}, {"3": "spousta těch úkolů tě téměř nijak neovlivní. Věci za kouzla, mince, vojáčky jsou maličkost, nástroje stejně určitě vyrábí každý a těch pár malých nebonusových dílniček člověk někam nacpe. Každý odznak dobrý [smilie--sprite1][BR]Není třeba mít zázemí pro deset odznaků rázem"}, {"48": "Chi.. Jsem zvyklý na svých 30+ dílen a 6+ setů manufaktur (po konci ementálů jsem měl 60 a 14), takže současný stav, kdy se mi město zrovna začíná plnit amuni, a budu rád za 5 dílniček a 2 sety se mi vůbec nelíbí :-/"}, {"99": "@Lovec Krys : Asi budu muset. Problém je, že mám potřebu přispívat co nejvíc to jde [smilie--sprite8][BR][BR]@Emhyr var Emreis II : Mince a vojáčci nejsou problém, i když po mně už to chce ohromné sumy. Kouzla nevyrábím, mám jich plný sklad z turnajů a téměř je nepoužívám. Během dobrodružství asi něco vyrobím, ale vzhledem k tomu, že nemám vylepšenou akademii, to skoro ani nestojí za řeč, většina kouzel bude z turnaje a překlikávat po každém kouzle celou řadu je za trest (aspoň že v té aplikaci je to celkem přijatelné). Dílen mám 9, takže by to chtělo minimálně ještě jednu. Ocelárny už jsem vylepšila v elementálech, takže na dlouhé výroby musím přistavět i ocel, kromě prken a mramoru, které by mě čekaly v každém případě. V architektovi mám zastavěnou plochu do posledního místečka [smilie--sprite8] Sice ještě nemám všechno vylepšeno a postaveno, ale na volných místech držím fontány kvůli maně, chce jí to spoustu...[BR][BR]Samozřejmě to nakonec nějak vymyslím, jako ostatně vždycky, ale nebude to ideální. Ono by mi ani tak nevadilo dobrodružství samotné, jako to, že ho pořád pouští se starým systémem. U každého dobrodružství napíšou, že ví o připomínkách a že na tom pracujou, ale tohle můžou klidně psát další 3 roky. Za mě by prostě další dobrodružství mělo přijít až zároveň se změnou systému."}, {"5": "Kvůli maně stačí míti Dračí opatství a právě používat ta uskladněná kouzla [smilie--sprite1]"}, {"99": "@ElfNostradamus : Opatství samozřejmě používám, ale také to nejde dělat do nekonečna, i když mám kouzel hodně, pořád je jich omezený počet, a bodů na vylepšování opatství je málo [smilie--sprite1]"}, {"102": "já se dočetl, že to dobrodružství by mělo být jen pro betu... jako že se snad neplánuje na ostré servery, je to tak?"}, {"28": "iDavis napsal/a:\t\t\tNo a ešte, tentokrát z beta fóra, jeden..[BR]Sneak Peek[BR][BR]Spoiler: Sneak Peek[IMG]https://i.ibb.co/4FKZgT3/http-ipic-su-img-img7-fs-KP-1519598164-png.png[/IMG][BR]​Klikněte zde pro zvětšení...[BR]Vytáhnu jeden starý příspěvek. Něco nového, bližšího k tomuto @iDavis ?"}, {"102": "Já k tomu něco vím, tahle ikona se objevila v jednom balíčku za peníze [smilie--sprite1]"}, {"99": "@ExplorerFfff : Znovu jsem pročetla oznámení na betě a nic takového tam nevidím... Ale nestěžovala bych si, kdyby nás vynechali [smilie--sprite11] [smilie--sprite8]"}, {"31": "@Thespia bude to nové požehnání, s presným názvom Rozšíření za diamanty. Je už nejakú dobu pripravené, avšak kedy sa ho dočkáme v hre zatiaľ netuším (ak má @ExplorerFfff pravdu tak už sa vlastne objavilo). Vývojári ho teda pravdepodobne využijú ako možnosť dať nám prémiové rozšírenie či už za kúpu nejakého balíčka, alebo, ak by boli veľmi štedrí, a to by asi nikto nenamietal, odmenou za nejaký úspech v hre. Aspoň po technickej stránke by to bolo vďaka tomuto požehnání možné.[BR][BR]@ExplorerFfff požehnání Královská rekonstrukce bude vylepšovať budovy o 1 level."}, {"102": "Ano, nevím kdy přesně to bylo ale bylo to měsíc dva zpět, v nějakém totálně vtipné balíčku s urychlovačema.[BR][BR]@Angedev na FB Gems of Knowledge to nějak probírali a z toho jsem pochopil, že se snad má testovat jen nějaká nová funkce a nečeká to servery, ale je také možné, že to testují a pak nasadí a jen to ten člověk nepochopil, no uvidíme."}, {"99": "@ExplorerFfff :\t\t\tThere won't be any new things to test this time, just an extra incentive for anyone who wishes to participate.\t\tKlikněte zde pro zvětšení...Nic nového bych nečekala... [smilie--sprite8]"}, {"122": "Ma nekdo fb a vi, co tam presne psali? [smilie--sprite1]"}]