[{"122": "Koukala jsem na spoiler z bety a pokud k nam prijde i toto dobrodruzstvi, jakoze nejspis ano, nejsem z toho vubec nadsena..."}, {"123": "ale aspon je to ta lehčí verze bez stráží,mincí a divu [BR][BR]Odstraněna zbytečná citace. Embla"}, {"122": "Mno to je pravda  Ale za to je tam toho zas pozehnane  Uz sedim a pocitam kudy \"z nudy\" - pujdeme "}, {"123": "já už mám vymyšleno a hotová i tabulka pro hráče,tak už jen začít "}, {"119": "Prosim date odkaz o jakou verzi DS se jedna, pokud uz je to znamo na Bete ? Dikes "}, {"124": "Bude to to samé jako minulé DS [BR][BR][BR]// odstraněna zbytečná citace - Ódin"}, {"99": "Spíš si myslím, že by to mělo být to se 13 odznaky..."}, {"123": "ano,je to 13 odznaku "}, {"117": "ja treba nikdy nepochopim, proc si někdo stezuje na to, ze bude znovu dobrodruzstvi a jak teda nejsou nadseni... a takove hlasky ctu snad u kazdeho eventu... takze moje otazka zni: kdo vas nuti vse hrat? nikdo, tak nechapu proc se tady neustale nekdo zhnusuje  "}, {"88": "donutka napsal/a:\t\t\tja treba nikdy nepochopim, proc si někdo stezuje...\t\tKlikněte zde pro zvětšení...Protože stížnost je znamením toho, že hráč není spokojen. Z nespokojeného hráče se může stát bývalý hráč, tudíž by to mělo být signál pro herní tým, že je něco špatně. Doufám, že to jako vysvětlení stačí..."}, {"117": "stezovat si na neco DOBROVOLNEHO ve hre? a duvod odchodu ze hry kvuli dobrodruzstvi? to je jeste vtipnejsi odpoved, nez jsem cekala...  Dobrodruzstvi neni vubec hlavni naplni hry a ani neni důležitou casti hry, bez ktere by nesla hra hrat... takze ano, je to naprosto zbytecne stezovani a ja byt provozovately hry, tak bych po takovem brblani zadne dobrodruzstvi nedala a byl by klid. Aby se nekdo nevesel z toho, ze nemuze neco splnit, co je jen pro zpestreni a ne povinnost "}, {"102": "Já si stěžuji proto, že jsme aktivní spolek a tak pokud většina bude chtít, prostě se účastnit budu i když mi zrovna ty současné ceny přijdou celkem směšné. Takže ano, někteří si stěžovat mohou, ne každý je ve spolku, který je k ničemu z pohledu hry a tak si tam může dělat co chce  U nás bohužel chci aby si lidi pomáhali a to platí bez vyjímky, od toho jsme aktivní spolek takže budu doufat, že většina uzná, že to moc za ty ceny nestojí a vykašleme se na to "}, {"117": "ale pokud sis vybral aktivni formu hrani, tak si preci taky nemůžeš stezovat... stale to postrada logiku..."}, {"122": "Ja hraju taky v aktivnim cechu a uprimne? Na dovoleny jedno dobrodruzstvi, ani se neoklepem hned udalost a zapocti si do toho kazdy tyden turnaje... ) Ono je to celkem masakr, kdyz mas v turnajich prumer treba 1700b., jsi rada, ze je po turnaji a najednou treba dobrodruzstvi, kde Ti jeste ani nebudou ceny stat za ucast...? A kvuli tomu, ze nemam \"silu\" na jedno dobrodruzstvi, opoustet cech nehodlam...[BR]Ted to neber nijak spatne, ale pokud jsi to nezazila (myslim, hrat v takovem tempu), tak nepochopis..."}, {"102": "Já si jí nevybral, já jí spolutvořil  Ovšem, prostě já bohužel minulé dobrodružství táhl (hodně míst) takže i z toho důvodu. Udělat pár odznaků problém není ale s nezdarem by to pak nemuselo dopadnout."}, {"117": "Umpa Lumpa napsal/a:\t\t\tJa hraju taky v aktivnim cechu a uprimne? Na dovoleny jedno dobrodruzstvi, ani se neoklepem hned udalost a zapocti si do toho kazdy tyden turnaje... ) Ono je to celkem masakr, kdyz mas v turnajich prumer treba 1700b., jsi rada, ze je po turnaji a najednou treba dobrodruzstvi, kde Ti jeste ani nebudou ceny stat za ucast...? A kvuli tomu, ze nemam \"silu\" na jedno dobrodruzstvi, opoustet cech nehodlam...[BR]Ted to neber nijak spatne, ale pokud jsi to nezazila (myslim, hrat v takovem tempu), tak nepochopis...\t\tKlikněte zde pro zvětšení...a neni spolecenstvo nahodou i o tom, ze se lidi domluví na tom, co se bude a co se nebude hrat, aby to vsechny neruinovalo a nenicilo? v aktivním společenství jsem byla nekolikrat a presne to mi nevyhovovalo, honba za vsim naprosto bezmyslenkovite  a brani jako povinnost vsechno delat na maximum... aktivni společenství neznamena nespat pomalu kvuli hre, ale to tu mnozi asi nechapou a nemaji realny život"}, {"119": "ja tedy stiham normalni a realny zivot, a ze bych nespala kvuli hre, to se mi jeste nestalo  nicmene je to na kazdym, mne vyhovuje aktivnejsi spolecenstvi....jak uz jsem zminovala, pokud hraci nechteji hrat DS, tak je nikdo nenuti, je to dobrovolna akce, ktera se da prehlednout, pokud o to nekteri nemaji zajem.....Pro nas je to zpestreni, i kdyz by to nemuselo byt zas tak caste, ale az budes na konci vsech ras a cekat na dalsi,tak ti takove zpestřeni prijde vhod "}, {"123": "tak já se na všechny dobrodružství a ukolové linie vždy těším,bez nich je hra nudná,jen odklikat,zadat a zase čekat několik hodin nebo dní.Většinou se i při akcích víc sejdem a pokecáme.Když nic není,tak na chatu je mrtvo "}, {"117": "tak si pak ale nestezujte, kdyz ta dobrodruzstvi jsou.. vy ten paradox nevidite nebo co?"}, {"48": "Přeci tu nebudem jen chválit - by to bylo jednotvárné, no ne? [BR][BR]@lenka roudnice - u nas je tedy zivo, obcas az moc  a behem dobrodruzstvi? to se ani neda si na chatu povidat, jak to tam lita  "}]