[{"117": "ale ono stezovat si na neco, co neni povinne mi prijde akorat hledani si prilezitosti si stezovat..  pokud to nekoho stve, ze jsou tak casto, tak se muzou ve spolku dohodnout, ze budou delat napriklad kazde druhe a na max... a ne tu pomalu u kazdeho eventu mit vykriky, jak se jim to nehodí a jak jsou z toho na větvi... a jsou to porad jedni a ti sami lide dokola"}, {"48": "Nebude to tim, ze sem vic moc lidi nechodi? "}, {"99": "Zpětná vazba je důležitá. Když se mi něco líbí, ráda to pochválím, když ne, dám o tom vědět. Když budou všichni jenom pozitivní i přes to, že změny půjdou směrem, který se jim zrovna nelíbí, vývojáři to nijak nezjistí a dospěje to k tomu, že místo pár negativních řádek budou lidé rovnou odcházet ze hry.[BR][BR]Že nemám místo ani lidi, ok, vem to čert, s tím si buď poradím, nebo ne, to je můj boj. Mně především vadí přístup Inna, kdy spouští dobrodružství stále dokola i přes to, že vědí, že aktuální systém překlikávání úlolů je nevyhovující. Za mě by nové dobrodružství mělo přijít až zároveň se změnou, toť vše "}, {"31": "Sneak Peek: Přípravy na podzim #1[BR][BR]Spoiler: Sneak PeekDny jsou kratší a noci delší,[BR]farby přírody se již mění.[BR]Zde vidím nejaké rohy,[BR]že by čas na nové úlohy? [BR][BR][IMG]https://i.ibb.co/fdp8zck/https-image-ibb-co-fiypd-U-EL-sneak-peek-7-9-2018-1-png.png[/IMG][IMG]https://i.ibb.co/rkgtqv1/https-image-ibb-co-kh-Mm-Q9-EL-sneak-peek-7-9-2018-2-png.png[/IMG][IMG]https://i.ibb.co/G2znXbh/https-image-ibb-co-dej6-Q9-EL-sneak-peek-7-9-2018-3-png.png[/IMG][BR][BR]>>>​"}, {"43": "Jj,čas na nové úlohy,ale místo na jejich splnění jaksi není a jen tak nebude... "}, {"62": "@iDavis už se těším. Mám ráda podzimní motivy "}, {"16": "Taky se těším, i přesto, že budu mít k dispozici výrazně méně místa, takže nebudu moci zopakovat svou letní strategii a jít jen po jedné budově. Což ale nevadí, zatím mám many i semínek dost, tak když získám na semínka jen pár budov, tak by mi to na elementály mělo stačit. Zatím jsem uprostřed půlčíkovské bažiny a semínek těžký přebytek - uvidím, jak to půjde u elementálů, až mi semínka začně užírat ten živoucí mor."}, {"59": "Na událost se těším, je to sólová záležitost, tak nebudu muset přesvědčovat členy společenství, aby uhráli alespoň něco  Moje účast je jistá, jak to dopadne ale netuším, protože v Amuni je to pro mne velký zápas s prostorem. Ale i tak to bude zpestření hry a snad mi i nějak vyjde čas na plnění úkolů."}, {"31": "Novinky z bety[BR][BR]Spoiler: Novinky z betyDošlo k zmene hodnôt surovín produkovaných v kultúrnej budove Studna přání. Nové čísla vyzerajú takto:[BR]VB odmena navýšená z 1 na 3, diamanty navýšené z 10 na 25 a hodnoty mincí, zásob a jednotlivých surovín boli navýšené 5x.[BR][BR]Pravdepodobne budú taktiež vylepšené aj iné eventové budovy, produkujúce klasické zboží (hovorí sa o násobku 2,5)."}, {"16": "@iDavis - pokud na dia zároveň nesnížili šanci, tak je to velmi příjemná změna.[BR]Týká se to např. i eventovek produkující jednotky? (Např. valoriánskou stráž)."}, {"31": "@Lovec Krys percentá studne zostávajú nezmenené. A pozrel som sa na tie eventové budovy s jednotkami a vyzerá to tak, že tie zmenené nebudú."}, {"16": "@iDavis [BR]% - ok, to je dobře. Tím pádem docela slušné vylepšení (99% lidí má studny právě kvůli dia).[BR]Jednotky - škoda, pár jednotek navíc se vždycky hodí (zvláště pro nás, kteří jsme schopni v turnaji vymlátit pěkná kvanta jednotek)."}, {"99": "Teď si můžu gratulovat, že jsem studny nepostavila hned po jejich získání, naštěstí na ně nebylo místo  Až dojedu Amuni, bude místa dost a s větším případným ziskem, to je super  Škoda, že mám v inventáři jen 4, ale i to se bude hodit "}, {"105": "ExplorerFfff napsal/a:\t\t\tJá si jí nevybral, já jí spolutvořil  Ovšem, prostě já bohužel minulé dobrodružství táhl (hodně míst) takže i z toho důvodu. Udělat pár odznaků problém není ale s nezdarem by to pak nemuselo dopadnout.\t\tKlikněte zde pro zvětšení...Udělat pár odznaků podle mého problém je. Ach to klikání. Když máš 50 dílen a děláš ráno farmáře, tak se uklikáš, než to všechno obejdeš. Je fakt že v mobilu je to teď lepší než na PC, ale na mobilu to ne vždycky jde."}, {"72": "Ano, na mobilu se rychleji přepíná, ale zase se častěji umáčkneš a sebereš toho třeba víc. Kdyby fungoval stylus, fajn, ale nefunguje."}, {"5": "Novinky...a pravděpodobný termín zařazení změn do hry? ...aby to nebylo jako s tím dlouho slibovaným kouzlem na vylepšení budov."}, {"16": "@ElfNostradamus Tohle jsou změny, co už jsou nasazeny na betě. Tzn. že tady budou za pár týdnů (nevím přesně, jak dlouhá je prodleva)"}, {"31": "Sneak Peek: Přípravy na podzim #2[BR][BR]Spoiler: Sneak Peek<<<[BR][BR]V hlavní roli dny a noci,[BR]kto mu to sedí na pleci?[BR][BR][IMG]https://i.ibb.co/0Jw23nk/https-image-ibb-co-mg9-Kjp-EL-sneak-peek-14-9-2018-2-png.png[/IMG][IMG]https://i.ibb.co/1rNbLZk/https-image-ibb-co-g-YTC4p-EL-sneak-peek-14-9-2018-3-png.png[/IMG][BR][IMG]https://i.ibb.co/fkT5zVW/https-image-ibb-co-j-Bb5q-K-EL-sneak-peek-14-9-2018-png.png[/IMG][BR][BR]>>>​"}, {"66": "Norek, nebo hranostaj?[BR]Viděla bych to na něco lasicovitého, pokud si designéři zase nevymyslí nějakého imaginárního křížence."}, {"5": "Fretka "}]