[{"31": "Sneak Peek: Přípravy na podzim #3[BR][BR]Spoiler: Sneak Peek<<<[BR][BR]Mnoho nových budov postavíme,[BR]v některých i nové požehnání vyrobíme. [BR][BR][IMG]https://i.ibb.co/N3M9mXx/https-image-ibb-co-f-UFYUz-EL-sneak-peek-16-9-2018-png.png[/IMG]"}, {"16": "Jaké nové požehnání? Doufám, že to nebude v setových.."}, {"102": "To požehnání vypadá, jako zvýšení výroby v budovách rasy, to vypadá dobře "}, {"125": "Lovec Krys Očekávám že ano. Navíc do setu bude třeba něco nejen získat sbíráním bodíků (kterejch bude stejně málo ale vytahnout z truhly či rohu (pravděpodobnost naximálně 25%). Při tom člověk vypráská bodíky (ona budova nebude v den dvojnásobku), který mu následně budou chybět na poslední barák za sbíraný......"}, {"5": "...já jsem rád, že takové požehnání bude a samo je i předpoklad, že získat to moc jednoduché nebude"}, {"16": "@Jarsa Já už poslední budovu v eventech nějakou dobu nezískal. Já jdu po denních odměnách a hlavní odměny jsou stejně poslední dobou součástí setů, které já ignoruji. Fakt nemám místo na to, abych kvůli jedné užitečné budově stavěl kolem ní další 3 k ničemu, které tu užitečnou budovu zdegradují na úroveň \"nevyplatí se to\".[BR][BR]Požehnání na zvýšení výroby portálu je zajímavý nápad, ale na to aby se to výrazněji projevilo, by jich muselo být přinejmenším tucty."}, {"125": "Lovec Krys Taky už jsem zjistila, že jít po setech je asi pitomost. Nicméně tak nějak bych to viděla, to nové kouzlo."}, {"5": "...poslední set zatím mám, není zase tak veliký, dává denně 6k many, 2,2k semínek + i nějaké mince, kladiva, surky... v této kombinaci ho ještě podržím a uvidíme jak s novým Eventem."}, {"102": "No v tomhle ti budu oponovat. Já mám z posledního eventu, kompletně vytuněnou kulturu pomocí stanů, 6,12k semínek denně, 8k many denně, hromadu lidí a díky tomu všemu, další kulturu a manu z běžných budov, pokud bych šel po setu, jsem na tom mnohem hůře, já si to tehdy počítal a set je opravdu pro strategického hráče nesmyslná věc, z denních si člověk složí lepší set na míru městu."}, {"5": "...mám to samé + set jako takový bonus dokud se vejde  msf"}, {"65": "tak přemýšlím, jak moc tento event budu řešit. místo mám, provincie mám, budovy na vylepšení také. jenže v půlce minulého eventu jsem akorát přestoupil do aktuální kapitoly, takže není moc co lepšího získat. jedině urychlovače, ty mi zoufale dochází. ale zase se minulým systémem truhel to také není moc atraktivní.[BR][BR]...jenže když zkoumám provincii 47 hodin, už ani ty 14h urychlovače nejsou co bývaly :-D[BR][BR]konečně už mám v půlčíkách vše vylepšené jak chci a můžu plně soustředit na výzkum. ale skz mé velké plány na 2 následující turnaje se stejně seknu, protože mě čekají 2 velikosti oddílu. no dřív jak za měsíc ta kapitola stejně nebude hotová, do konce eventu asi nestíhám. [BR][BR]nějaké ty dílničky a lvl 1 výrobny si postavím, ale asi to fakt nebudu hrotit stylem celý event za týden. a sety? nepotřebuji."}, {"31": "Tak vás poteším, sety budú tentokrát dva.. "}, {"16": "@iDavis Grr, Inno vývojáři snad chtějí abysme s těmi eventy sekli.[BR]Tak snad ty sety rozdělí a jeden bude ze dvou - tří budov s podobným zaměřením (a tím i zajímavější pro širší okruh hráčů), doufám, že to nezazdí s tím, že 20 dnů budou setové budovy a do zbývajících pár dnů se už nic pořádného nevleze.[BR][BR]Já mám většinu eventovek ještě z čarodějů, tak budu asi primárně nahrazovat. A jelikož nemám moc místa, tak se stejně nebudu moct soustředit na jednu budovu jako minule, ale spíš to bude pár pokusů na každou slušnou budovu, co se objeví."}, {"74": "Sety jsem zboural a nové stavět nebudu.... 6K many hodím jedním kouzlem z Dračího opatství a semínka 2K získám za 3 požehnání....navíc se mi oboje hromadí, protože výroba a výzkum jdou asynchronně a dlouho, takže mám přebytky obojího...."}, {"31": "Už nám na bete začína.. [BR]Festival zberu úrody[BR][BR]Spoiler: Festival zberu úrody[IMG]https://i.ibb.co/dPBt0vG/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-autumn2018-forum-header-harvest-festival-png.png[/IMG][BR]Predpokladaný termín: 27.9. - 22.10.[BR][BR]Informácie o tejto novej udalosti budem postupne dopĺňať do tohto spoileru.  Priložím aj tabuľky jednotlivých nových odmien akonáhle sa uistím, že sa na betu dostali s rovnakými hodnotami, aké som do nich vpisoval pár dní dozadu.[BR][BR]Čakajú nás 2 úkolové rady - s témou dní a nocí.[BR][BR]Spoiler: ÚlohyKompletný a finálny prehľad udalosti nájdete TU.[BR]Hlavné odmeny:[BR][BR][IMG]https://i.ibb.co/dLwRVRX/https-image-ibb-co-m-Zj-Gx-K-El-akcia-jese-2018-h-odmeny1-png.png[/IMG][BR][BR][IMG]https://i.ibb.co/RbXDfbt/https-image-ibb-co-ib-Vg-XU-El-akcia-jese-2018-d-odmeny1-png.png[/IMG][BR][BR]Kompletný a finálny prehľad udalosti nájdete TU.[BR][BR][IMG]https://i.ibb.co/b627TQc/https-image-ibb-co-nc-LWez-El-akcia-jese-2018-oskoro1-png.png[/IMG][BR][IMG]https://i.ibb.co/g7nsJ8T/https-image-ibb-co-fnrts-K-El-akcia-jese-2018-oskoro2-png.png[/IMG][BR][IMG]https://i.ibb.co/82pLq83/https-image-ibb-co-c-ADjzz-El-akcia-jese-2018-oskoro3-png.png[/IMG][BR][IMG]https://i.ibb.co/bPJyH95/https-image-ibb-co-e-Mco-Re-El-akcia-jese-2018-oskoro4-png.png[/IMG][BR][IMG]https://i.ibb.co/Sc4SXjK/https-image-ibb-co-h-MFEzz-El-akcia-jese-2018-oskoro5-png.png[/IMG][BR][BR][BR]A tentokrát až 2 nové sety.[BR][BR][IMG]https://i.ibb.co/TRPyvv4/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-autumn2018-Summer-Set2018-1-png.png[/IMG][BR][IMG]https://i.ibb.co/GMw7YqK/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-autumn2018-Summer-Set2018-2-png.png[/IMG][BR]Novinkami v tohtoročnej jesennej udalosti sú:[BR]Nové požehnání Věčný portál ktoré doplní určitú percentuálnu časť všetkých limitovaných osadníckych surovín aktuálnej kapitoly.Nové dočasné budovy:Kupecká základna - produkuje požehnání Věčný portál (50 dní)Monument prastarých vědomostí - produkuje požehnání Prastará vědomost (100 dní)Rozvážková knihovna - produkuje 1 VB co 24 hod. (100 dní)[IMG]https://i.ibb.co/qx7qph9/https-en-wiki-elvenar-com-images-4-4f-Harvest-Festival-Banner01-png.png[/IMG]"}, {"102": "Nedalo mi to, a mrkl jsem se a potěšilo mě, že tam nebude ta šílenost s točením truhel ale staré dobré truhly  Hurray!"}, {"66": "Ty budovy vypadají ale sakra povedeně. Jen se mi ty sety nechce stavět, protože se zatím žádné nevyplatily a ani nemám místo kam."}, {"78": "Na to jestli ty baráky vypadají povedeně kašleme. Stejně ty sety budou k ničemu.[BR]Stejně jako každý sety co jsme zatím viděli. Neviděl jsem u top 100 hráče že by měl postavenej set, proč asi taky ?[BR]Teď v Amuni asi máloco překoná barák Koupel rozkoší, chtěl bych vidět set kterej by se vyplatil.[BR][BR]Odstraněny nevhodné výrazy. Embla"}, {"123": "to bude jen těch 25 ukolu ?   děkuji za odpověd"}, {"123": "tak už jsem je našla,je jich 87 "}]