[{"31": "Ako vždy, dopisujem postupne. [smilie--sprite2]"}, {"102": "No, nejlepší kulturka jak se zdá bude hned na začátku, jako ten hořící pták [smilie--sprite8] Uvidíme, čím ten event doplní, ale asi tam moc budov nebude, když člověk vezme, ze 25 - 2x sety, 3x double, 2x studna = 12 + 3 + 2 = 17 -> na další budovy zbude cca 8 dní, to bude výběr jak v Coopu."}, {"123": "teda tentokrát to asi nedám do konce,je to dost těžký"}, {"126": "torakus napsal/a:\t\t\tNeviděl jsem u top 100 hráče že by měl postavenej set, proč asi taky ?\t\tKlikněte zde pro zvětšení...[BR]Ty jsi projížděl všech 100 top hráčů, že tak lamentuješ? Tak se koukni třeba ke mě. Když je místo a chceš mít město tak trochu koukatelnější než jen se samýma obytkama, proč ten set dočasně nepostavit..."}, {"5": "Mám rovněž zatím ještě postaven poslední set...ještě doplním že dává i slušnou K a lidi [smilie--sprite1]"}, {"74": "Tak \"hlavní herní lajnu\" vynechávám, nejsou lepší budovy než mám,... pojedu jen druhou (denní)..."}, {"74": "Dost dobře jsem nepochopil tu \"Kupeckou základnu\".... funguje 50 dní - každých 48h mi dá požehnání = celkem 25 požehnání,,,píšou že je to instant +5%, ale jak dlouho požehnání trvá? Respektive, hodím požehnání a zvedne se mi o 5% hodnota zásob co mám vyrobených na portálu? či jak?...."}, {"99": "@Silversnake : Pokud to chápu správně, tak dostaneš 5% aktuální kapacity skladu osadníků, stejně jako je tomu s kladívky a mincemi [smilie--sprite1]"}, {"102": "Ano, také to takto chápu, já popravdě váhám, zda tuhle budovu chtít. Pokud si totiž vezmu, že 100% kapacity, člověk vyrábí tak týden a tahle budova mu to teoreticky dá za 40 dní, tak je celkem otázka, zda tahle budova není jen takové volání sirén na útes...[BR][BR]Hlavně smysl to kouzlo bude mít až v levelu 4 portálu. I tak ale furt bude plivnutím do moře."}, {"99": "Vyrábíš sice týden, ale z podstatně většího množství budov. A když je postavíš na konci výzkumu, když čekáš na další kapitolu, máš půl práce hotovo [smilie--sprite1] (I když uznávám, že na konci výzkumu s dokončením kapitoly úplně nespěcháš [smilie--sprite8]) Případně kdyby ses měl ve výzkumu zaseknout kvůli nedostatku zboží osadníků, můžeš si takto vypomoct [smilie--sprite1]"}, {"74": "Pokud se v tom orientuji tak je jedno kdy tu budovu postavím. Pokud je hodnota neměnná na jakékoliv úrovni 5% tak prostě vyrábím (sbírám) požehnání do \"skladu požehnání\" a použiji je kdykoliv v průběhu celého vývoje....?"}, {"102": "@Angedev Tohle co píšeš je validní ale jen pokud máš budovu zdarma a máš neomezeně místa. Ale jinak z principu, budova zdarma není, musíš obětovat jinou eventovku pro získání této a místo, které pro ní použiješ, tak pokud použiješ pro budovu osadníků, získáš za stejné množství času pravděpodobně více suroviny, já si minimálně jednu asi vezmu, chci to zkusit a asi to vyřeší situaci, kdy bude chybět pár jednotek do výzkumu. Ovšem tohle je fakt pouze o pocitu, ono totiž kdybych místo toho rovnou postavil tu osadnickou budu ve stejné situaci, jen napřed.[BR][BR]Já u všeho kalkuluji i s místem, proto si myslím, že tohle je volání sirén. Stejně jako studny, min jednu mám ale ani u studny si nemyslím, že je reálně užitečná, je to spíše o pocitu, že má člověk zdánlivě něco zadarmo ale pragmatik jako já tomu stejně nějak nevěří, protože si spočítám, že je to vlastně k ničemu. Oni to mají v inno moc dobře spočítané, aby nám nedali něco příliš silného.[BR][BR]@Silversnake ano, pravděpodobně stejně jako u studny bude jedno kdy postavíš."}, {"99": "Tak ono se o žádné budově nedá říct, jestli je dobrá nebo špatná, každý potřebuje trochu něco jiného [smilie--sprite1] Když budu mít přebytek lidí a kultury, budu v eventu hledat něco jiného, co by mi hru usnadnilo, a tohle by mohla být třeba jedna z možností [smilie--sprite1] Naopak když budu s kulturou v mínusu, půjdu po výhodné kulturce. Záleží na každém, jaké má aktuálně potřeby [smilie--sprite1] Já jsem téměř na konci výzkumu, proto počítám, že nějakou dobu budu mít místa dost, tak bych to ráda zkusila [smilie--sprite1]"}, {"5": "Takže si mohu nastřádat 25x 5% z kapacity portálu do ,,skladu,, a použít případně v další kapitole [smilie--sprite1]  tj. teoreticky pokud budu mít 20 těchto požehnání, tak 20 x 5% mi jednorázově naplní kapacitu portálu..."}, {"99": "Přesně tak to chápu [smilie--sprite1] Samozřejmě těch 25 kousků je jenom z jedné budovy, můžeš jich mít i více [smilie--sprite1] A logicky se nejvíce vyplatí použít je až v momentě, kdy máš portál na max úrovni a tím pádem největší kapacitu skladu [smilie--sprite1]"}, {"65": "také jsem si nejdřív říkal, že 5% kapacity potrálu nic moc... ale když se nad tím člověk azmyslí a vezme si konkrétní čísla :[BR][BR]- v trpaslících to nemá moc smysl[BR]- víly a dál ano - proč - protože nejen že člověk instantně doplní potrál, ale ušetří i ty sekundární suroviny, které musi vyrobit, aby vůbec mohl něco dělat do výzkumu. v čarodějích ušetřím učně, jejichž výroba si jinak než včelou zvednout nedá. [BR][BR]v půlčíkách mi toto požehnání dá 2x výrobu na čtyřkové farmě - od každé suroviny. což znamená dohromady 36 hodin výroby a ušetřené suroviny z polí. a co třeba 2-denní houba v orkách? dostanu jednu a něco + ještě poklad jako bonus."}, {"74": "Tak my o vlku a Vlk mi skočil do požehnání... obdržel jsem 25% a souhlasí to. Takže to bere hodnotu (např 25%) z aktuální herní kapacity portálu. Je to tedy zajímavé. V podstatě se tedy výroba osadníků stane matematikou. Vyrobit co je potřeba v základu a zbytek si \"přihodit\" požehnáním."}, {"5": "V Amuni to ušetří spoustu many a semene ...zbude aspon mana na ty drahé cesty a vylepšení sídla...++na konci si můžeš dovolit zbourat nějaké výrobny, nechat si jen portál a ušetřit tak místo, pokud máš splněno a jistotu v dostatku těchto požehnání ve skladu [smilie--sprite1]"}, {"102": "No v elementálech to dává jen jednu věc, ale pokud se to v amuni bude hodit, tak asi vezmu i dvě když to půjde [smilie--sprite1][BR][BR]Jedno požehnání jsem právě dostal zdarma. Jenže to nás chtějí jen nalákat [smilie--sprite8] Ta budova bude dávat jen 5% to už takové terno nebude, je dobré ale že člověk nemusí počítat a asi uvidí přesně co dostane."}, {"48": "No, já mám celkem jasno... Amuni úplně urychlit nepotřebuju, takže postavím až dokončim amuni, to bude dost místa a nasbírám požehnání na sklad. Až přijde nová rasa - šup rychle postavit portál a jedem na plno [smilie--sprite1]"}]