[{"5": "No s Amuni  já osobně v posledních dnech i právě více spěchám, protože není řádné místo k Eventu...a nechci ho honit v posledních dnech, už hlavně vzhledem k tomu, že některé zajímavé odměny jsou již v prvních dnech a k tomu je třeba dost bodů do truhel .."}, {"99": "Také by se mi hodilo místo na event, ale ještě mi chybí 8 výzkumů, to do čtvrtka nedám "}, {"74": "@ramaloke, souhlas, myslím si, že Amuni jsou celkem dobře vyváženi s ohledem na sběr semen a tvorbu many....takže urychlení nebude až tak nutné, navíc nová rasa jen tak rychle nebude, takže škoda plýtvat..."}, {"5": "Angedev napsal/a:\t\t\tTaké by se mi hodilo místo na event, ale ještě mi chybí 8 výzkumů, to do čtvrtka nedám Klikněte zde pro zvětšení...mne poslední 4 ...ale bude mi stačit zítra a pozítří přejít přes úkol měj 8zlatníků level 4 a 4pasti lv4 a pak již mohu něco z toho ponížit na stavu a zvolnit "}, {"102": "Začínám mít pocit, že to nejlepší co z eventu půjde sehnat je asi ten větší set, protože jak jsem to počítal, asi se tam nevejde ani jedna jiná budova. Jako netématická. Tak se rozmyslím a možná postavím malý set, protože úlomky run se hodí, ještě si ale propočítám zda se to vyplatí, protože ty momentálně sbírám z turnajů.[BR][BR]Dnes je tam totiž ta 1x3 čudla na kulturu."}, {"16": "@ExplorerFfff No pravděpodobnost, že bych získal 3. odměnu, která je součástí toho druhého setu, je jako vždy nulová (toto je můj 6. čtvrtletní event a ještě nikdy jsem 3. odměnu nezískal), tak se můžu na celý set vyprdnout. Já osobně si asi vemu pár 2x2 semínek a zbytek zlatá pole, ty vypadají ještě celkem rozumně a můžou mi nahradit staré kult+pop hybridy, co mám z předchozí kapitoly."}, {"102": "@Lovec Krys  Já myslel ten větší, on sice je jako by větší, více budov, ale je jen jako celek 6*7, resp 7*7 velikost a průměrná kultura +-400/políčko v elemntálech, postavil bych ho dočasně, než dodělám všechny runy co bude v plánu, ono když by mi to hodilo ke každému turnaji navíc desítku ulomků, tak to půjde rychle a nevypadá to, že z toho eventu bude něco lepšího. Jako naštěstí zase až tak nutně měnit kulturky nepotřebuji, zimní asi bude lepší, jen to už nebude místo zase :/"}, {"114": "já se teším na urychlovače času  a když si vylosuju budovu která mi bude pochuti tak budu mít jen radost "}, {"16": "@luterina No na urychlovače budeš mít příležitostí dost. Dneska jsou na betě podruhé jako denní odměna."}, {"102": "Jo, ale 2 hodinový... to už začíná být stejně vtipné, jako když jsme kdysi dostali ty 3 minutové "}, {"16": "A jo, to jsem přehlídl.[BR]Místo aby dali pořádnou denní budovu...to ani netřeba komentovat."}, {"102": "Mě už totiž v elementárních přijdou relativně komické i ty 14 hodinové. [BR][BR]A jinak, mě to na betě nabídlo balíček s tím mirrorem, jsme si jistí, že ta budova bude v eventu? Protože mě to tu budovu nabídlo hned první den snad za 125 korun, pokud si pamatuji. Jako celkem pochybuji, že někdo příčetný si jí koupil a nebo se jí pokusí vytočit, ovšem to, že v noci naskočil už druhý násobič podporuje mou teorii, že kromě tématických budov a setů nic nebude."}, {"48": "Pokud není jako denní odměna v prvních pár dnech, tak podle mne nebude jinak, než ke koupení. Kdyby aspoň byla ke koupi za dia a ne jen za peníze :O"}, {"2": "ano, urochlovač je 2h, ale je jich 10[BR]to je vhodné dodat"}, {"102": "Tak to jsem přehlédl, opravdu, to už není pak tak marný a dost lidem se to bude hodit, už si nepamatuji, zda ten 5 hodinový byl také vícekrát nebo ne? Jo tak dle Gems těch 5h bylo 5x[BR][BR]A dnes je ta budova na ty osadníky."}, {"16": "Na betě studna pro ty, co po ní jdou."}, {"31": "Včera sa konalo vysielanie naživo s vývojármi Tom a Jonas, o čom sa diskutovalo si môžete prečítať v spoileri..[BR]Poznámky zo živého vysielania 27.9.2018[BR][BR]Spoiler: Poznámky zo živého vysielania 27.9.2018Kedy príde požehnání Prastará vědomost do mobilnej aplikácie?[BR]V poslednej aktualizácii sme konečne pridali požehnání Prastará vědomost do inventáru a možnosť ich použitia plánujeme zaviesť už v ďalšej aktualizácii. Zatiaľ ich bude možné pridávať iba do svojich vlastných divov. Navyše, behom jesennej udalosti máte možnosť získať toto požehnání pomocou budovy Monument prastarých vědomostí, ktorá sa objaví ako denná odmena.[BR][BR]Jesenná udalosť a sety[BR]Tentokrát máme v udalosti až 2 sety - jeden z nich je skôr zameraný na suroviny zo začiatkov hry, druhý skôr na pokročilé suroviny ako mana, semínka a podobne. Rozhodli sme sa vytvoriť 2 sety preto, lebo nám dávate pozitívny feedback a vidíme, že ste si sety obľúbili.[BR][BR]Obsahuje aplikácia rovnaké možnosti v jesennej udalosti ako prehliadačová verzia?[BR]Áno, všetky funkcie dostupné v prehliadačovej verzii môžete nájsť aj v mobilnej verzii. Navyše mobilná verzia už obsahuje aj jesenné pozadie, ktoré sa v prehliadačovej verzii objaví pravdepodobne budúci týždeň.[BR][BR]Objaví sa budova Magické zrcadlo aj na live serveroch?[BR]Áno objaví, už čoskoro. Jej efekt je zvyšovanie počtu vyzbieraných měsíčních střepin z okolia mesta. Budova je zaujímavá najviac pre aktívnych hráčov, ktorí často tieto popadané měsiční střepiny majú možnosť zbierať.[BR][BR]Môžeme dostať pozadia grafiky použitej v udalostiach na stiahnutie?[BR]Uvidíme, budeme o tom rozmýšľať.[BR][BR]Studna přání[BR]Je to budova ktorá náhodne produkuje mince, zásoby, suroviny, VB a diamanty. Teraz sme sa ju rozhodli ešte vylepšiť a zvýšili hodnoty jednotlivých odmien, napr. VB dostanete 3 namiesto 1 alebo 25 diamantov namiesto 10. Bude súčasťou jesennej udalosti ako denná odmena, takže pozorne sledujte. Zvýšenie efektu sa týka aj studní, ktoré ste získali pred touto zmenou.[BR][BR]Nové požehnání[BR]Prinášame nový predmet s jesennou udalosťou - Věčný portál. V tejto udalosti príde nová budova, ktorá bude produkovať toto požehnání. Dostávame spätnú väzbu že nedostatok osadníckych surovín je častým dôvodom zaseknutia sa vo výskume, toto požehnání vám umožní doplniť určitú časť limitovaných osadníckych surovín zo skladovacej kapacity vašej aktuálnej rasy.[BR][BR]Prepínanie medzi svetmi v mobilnej aplikácii[BR]Máme dobré správy - s ďalšou aktualizáciou mobilnej aplikácie by mala byť dostupná možnosť prepínania medzi svetmi. Teraz sa musíte pri každom prepínaní svetov odhlásiť a znova zadávať prihlasovacie údaje, no s touto zmenou nebudete musieť prihlasovacie údaje zadávať zakaždým, ale jednoducho vyberiete nový svet na ktorý sa chcete prihlásiť, ušetrí to veľa času.[BR][BR]Budú nejaké zľavy behom udalosti?[BR]Áno budú.[BR][BR]Dostaneme viac permanentných funkcií ako sú napr. turnaje do hry?[BR]Áno. Práve teraz pracujeme na konceptoch niekoľkých nových nápadov ktoré máme a áno, dočkáme sa v budúcnosti viacerých úplne nových funkcií.[BR][BR]Budú niekedy dobrodružstvá spoločenstiev presne naplánované alebo to bude vždy náhodné?[BR]Momentálne nemáme v pláne čokoľvek na ich \"náhodnosti\" meniť, aby sa nekombinovali s udalosťami a podobne. Je dobré, keď vypĺňajú prázdne miesta medzi udalosťami a úkolovými líniami.[BR][BR]Správy v mobilnej aplikácii[BR]Práve sa sústredíme na veľké funkcie na pridanie do mobilnej aplikácie, ale určite sa časom dočkáme aj posielania správ. Už teraz môžete v aplikácii využívať chat spoločenstva, takže nejaký spôsob komunikácie tam je.[BR][BR]Bude možné otáčať budovy?[BR]Nie, je to veľký technický problém, nebudeme môcť túto možnosť priniesť.[BR][BR]Sú nejaké novinky ohľadne zmeny systému úloh (najmä pokiaľ ide o dobrodružstvá spoločenstiev)?[BR]Rozmýšľame nad spôsobmi ako to zmeniť, vieme o tom, dostávame feedback že preklikávanie medzi úlohami je nepríjemné, hľadáme možné riešenia.[BR][BR]Bude možné navštevovať mestá iných hráčov v mobilnej aplikácii?[BR]Chceme aby to bolo možné a pracujeme na tom.[BR][BR]Vrátia sa rotujúce bedny?[BR]Áno, určite sa vrátia v budúcich udalostiach.[BR][BR]Všetky informácie vychádzajú z môjho prekladu a nemusia na 100% sedieť."}, {"66": "Ano, ta třetí otázka od konce. Za to jsem měla sto chutí je zabít, když jsem včera sledovala záznam na facebooku. Trvá to už tak dlouho, myslela jsem, že už mají vybraný koncept a pracují jenom na technickém zavedení."}, {"48": "No, za mne hlavně že zavedou to přepínání mezi světy na apce, to mne dost odrazuje od aktivní hry dvou světů :/"}, {"31": "Sneak Peek: Halloweenská hrůza #1[BR][BR]Spoiler: Sneak PeekHlava bez trupu,[BR]trup bez hlavy,[BR]brzy přijdou,[BR]hrůzostrašné kreatury.[BR][BR][IMG]https://i.ibb.co/kBLt2Dn/https-image-ibb-co-m-HPS3e-EL-sneak-peek-5-10-2018-png.png[/IMG][IMG]https://i.ibb.co/RhV6n8V/https-image-ibb-co-m9q-Zie-EL-sneak-peek-5-10-2018-2-png.png[/IMG][BR][BR]>>>​"}]