[{"16": "A druhá hlaví odměna z právě skončeného eventu bude nahrazena. Aspoň jí nebude smutno, že je ze setu sama."}, {"31": "Nová funkcia sa blíži..[BR]Crafting[BR][BR]Spoiler: CraftingNa betu prichádza nová funkcia, zvaná Crafting. V skratke, funguje na princípe \"odkúzlovania\" položiek v inventári (ako napr. budovy, kúzla a pod.) za účelom získania novej suroviny, tzv. fragment kúzla. Pomocou týchto fragmentov, a taktiež nového, piateho kúzla Combining catalyst budeme môcť produkovať rôzne predmety.[BR][BR][IMG]https://i.ibb.co/4JdTgds/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-crafting-crafting-inventory-png.png[/IMG][BR][BR]Každé kúzlo / budova má stanovenú hodnotu fragmentov kúziel, ktoré za jej odkúzlenie dostaneme. Odkúzlenie, inými slovami predaj budovy za fragmenty kúziel.[BR][BR]Tu môžeme vidieť nové kúzlo Combining catalyst:[BR][BR][IMG]https://i.ibb.co/3FP6bm9/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-crafting-crafting-catalyst-png.png[/IMG][BR][BR]Akonáhle budeme mať dostatok prostriedkov, môžeme zahájiť výrobu. To bude možné v novom okne s piatimi receptami výroby.[BR][BR][IMG]https://i.ibb.co/VpFx1NY/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-crafting-crafting-overview-png.png[/IMG][BR][BR]Je to ponuka piatich receptov, ktorá sa každých niekoľko hodín obmieňa. Tento čas je možné skrátiť pomocou diamantov a po obmenení sa zobrazí ďalších 5 receptov na výber.[BR][BR]Za každý vyrobený produkt dostaneme navyše určité množstvo suroviny crafting_payback. Tá nám bude postupne odomykať miľníkové truhly s odmenami, z ktorých môžeme získať ďalšie odmeny.[BR][BR]Dátum príchodu na náš server zatiaľ nie je známy."}, {"16": "Vzhledem k tomu, že používám Akademii 100% času na výrobu kouzla Magická výroba a proces craftingu od vytváření ostatních kouzel není oddělen, není tam nic, co by mě přinutilo byť jen na okamžik přestat vyrábět magickou výrobu."}, {"102": "Vypadá to slušně, už jsem si to na betě vyzkoušel, konečně bude užitek z toho odpadu co se mi hromadí v inventáři [smilie--sprite8]"}, {"3": "tak na tohle se těším [smilie--sprite1]"}, {"99": "Objevila jsem v inventáři dokonce i budovu z úplně prvního eventu a podobných tam mám spousty, takže určitě se těším, že z nich konečně bude nějaký užitek [smilie--sprite8]"}, {"59": "No paráda, zase bude něco, čím se budeme bavit, těším se. [smilie--sprite1]"}, {"88": "Ano, to je hodně zajímavé. Ovšem nejdříve bych raději, aby konečně někdo opravil základní běh hry na živých serverech, na týmem Elvenaru vytrvale vnucovaném Google Chromu mi hra v HTML5 šla bez padání něco přes jeden den, než nahráli dnešní aktualizaci. Ve Flash verzi to je úplně ztráta času..."}, {"66": "Tak hurá, Inno se nám trochu rozjelo.[smilie--sprite8] Akademie kouzel bude konečně k něčemu dobrá. (Dokonce už jsem se přistihla, že přemýšlím, jestli ji nemám upgradovat. Ale snad si stihnu našetřit Combining Catalysty než přijde nějaký zajímavý recept.)"}, {"99": "@Prealiena : Také už jsem o tom přemýšlela, upgrade budovy ti dá bonus fragmentů při odkouzlení, takže by to určitě mělo něco do sebe [smilie--sprite1]"}, {"102": "@Lovec Krys Jenže aby jsi věděl, tak tohle je funkce navíc, i když ti jede 24/7 produkce kouzel, stále budeš moci craftovat, některé věci totiž Nevyžadují  kombinační kouzlo. Jde jen o to, si počkat na to až tam takové věci budou, tudíž si můžeš něco vyměnit třeba za úlomek. Viz příloha [smilie--sprite1][BR][BR][IMG]https://i.ibb.co/cCKvBX4/https-cz-forum-elvenar-com-index-php-attachments-2018-10-26-234655-png-2706.png[/IMG][BR][BR]A ty odměny v té truhle taky nejsou tak marné.[BR][BR][IMG]https://i.ibb.co/J31tmKm/https-cz-forum-elvenar-com-index-php-attachments-2018-10-26-234805-png-2707.png[/IMG]"}, {"99": "@ExplorerFfff : Tam není sdílená fronta na kouzla a crafting? Pokud by to opravdu bylo zvlášť, je to lepší, než jsem myslela, ale pochopila jsem to tak, že fronta je jen jedna..."}, {"102": "Sdílená fronta je jen na to kouzlo co potřebuješ na některé ty itemy, ovšem pokud si tyhle kouzla vyrobíš dopředu, v době kdy třeba akademie stojí, tak je pak používáš již zcela odděleně i když v akademii vyrábíš furt něco jiného. Jde ale craftit i věci, co to kouzlo nepotřebují, takže se dá obejít u některých věcí bez něj a tím, může být tohle právě užitečné pro každého i toho, co jede akademii full time.[BR][BR][IMG]https://i.ibb.co/p0yPd9c/https-cz-forum-elvenar-com-index-php-attachments-2018-10-27-094048-png-2720.png[/IMG]"}, {"59": "Já jedu akademii pokud možno nonstop, ale ani ne tak z nějaké nutné potřeby, tak nějak si vyrábím kouzlíčka do zásoby. [smilie--sprite1]  V Amuni se mi moc hodila pro velkou spotřebu  many, ale již jsem Amuni dokončil a tak se craftingem budu jistě dobře bavit. V invu mám ještě pár budov, které jsou a budou k ničemu a tak se alespoň inventář pročistí. Tato nová funkce mi přijde jako skvělý nápad pro oživení hry, budeme se totiž snažit získávat více budov jen pro možnost craftingu a tak i mnoho událostí, kde jsou některé odměny slušně řečeno \"ničemné\" získají na důležitosti a bude v nich mnohem větší účast. Tedy, alespoň se tak domnívám. [smilie--sprite1][BR]S nově přicházející funkcí by se ale hodila ještě jedna a to možnost vrátit budovu zpět do inventáře anebo možnost ji rozebrat na fragmenty z plochy."}, {"25": "iDavis napsal/a:\t\t\tNová funkcia sa blíži..[BR]Crafting[BR][BR]Spoiler: CraftingNa betu prichádza nová funkcia, zvaná Crafting. V skratke, funguje na princípe \"odkúzlovania\" položiek v inventári (ako napr. budovy, kúzla a pod.) za účelom získania novej suroviny, tzv. fragment kúzla. Pomocou týchto fragmentov, a taktiež nového, piateho kúzla Combining catalyst budeme môcť produkovať rôzne predmety.[BR][BR][IMG]https://i.ibb.co/4JdTgds/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-crafting-crafting-inventory-png.png[/IMG][BR][BR]Každé kúzlo / budova má stanovenú hodnotu fragmentov kúziel, ktoré za jej odkúzlenie dostaneme. Odkúzlenie, inými slovami predaj budovy za fragmenty kúziel.[BR][BR]Tu môžeme vidieť nové kúzlo Combining catalyst:[BR][BR][IMG]https://i.ibb.co/3FP6bm9/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-crafting-crafting-catalyst-png.png[/IMG][BR][BR]Akonáhle budeme mať dostatok prostriedkov, môžeme zahájiť výrobu. To bude možné v novom okne s piatimi receptami výroby.[BR][BR][IMG]https://i.ibb.co/VpFx1NY/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-crafting-crafting-overview-png.png[/IMG][BR][BR]Je to ponuka piatich receptov, ktorá sa každých niekoľko hodín obmieňa. Tento čas je možné skrátiť pomocou diamantov a po obmenení sa zobrazí ďalších 5 receptov na výber.[BR][BR]Za každý vyrobený produkt dostaneme navyše určité množstvo suroviny crafting_payback. Tá nám bude postupne odomykať miľníkové truhly s odmenami, z ktorých môžeme získať ďalšie odmeny.[BR][BR]Dátum príchodu na náš server zatiaľ nie je známy.Klikněte zde pro zvětšení...Tenhleten post si tu jen tak odkladam pro hrace @papap, az priste zase bude tvrdit, ze prohlizecova verze se nevyviji... [smilie--sprite1]"}, {"59": "Jonik napsal/a:\t\t\tTenhleten post si tu jen tak odkladam pro hrace @papap, az priste zase bude tvrdit, ze prohlizecova verze se nevyviji... [smilie--sprite1]Klikněte zde pro zvětšení...A jak je to, když dosáhnu nějakého toho milníku, odemknou se mi další druhy toho, co lze \"ucraftit\"?"}, {"16": "@ExplorerFfff Já akademii na betě nemám postavenou, tak jsem to nemohl vyzkoušet.[BR]Jestli tam jsou i věci, které nevyžadují kouzlo, tak možná něco použiju (pokud tam najdu něco užitečného a pokud najdu něco za rozložení - můj inventář je prázdný - já všechny neužitečné budovy dávno postavil a vzápětí zboural a kouzla i ta neužitečná si zatím ukládám do zásoby pro použití s dračím opatstvím - i když třeba magického daru mám 453[smilie--sprite1])."}, {"31": "@pes63 objaví sa ďalšia miľníková truhla s ďalšími odmenami."}, {"59": "iDavis napsal/a:@pes63 objaví sa ďalšia miľníková truhla s ďalšími odmenami.\t\tKlikněte zde pro zvětšení...OK, tomu rozumím, zřejmě budou odměny v dalších milníkových truhlách hodnotnější, to chápu, ale jde mi o to, zda od počátku craftingu půjde vyrobit pro všechny vše v plném počtu a hodnotě, tedy jestli crafting umožní například  vycraftit 10 položek a víc co do počtu ne nebo když se dostanu dál, tak budou i nové - lepší. [smilie--sprite1]"}, {"31": "@pes63 no zatiaľ je 72 možných receptov a ako to tak sledujem, tak už teraz sa hráčom objavujú všetky možné, aj tie menej hodnotné, aj tie hodnotnejšie, takže predpokladám že tento systém postupného \"vylepšovania\" receptov, aspoň zatiaľ, nie je."}]