[{"43": "Jonik napsal/a:\t\t\tTenhleten post si tu jen tak odkladam pro hrace @papap, az priste zase bude tvrdit, ze prohlizecova verze se nevyviji... Klikněte zde pro zvětšení...[BR]Nějak nevím,jestli vůbec umíte číst,podle vašich příspěvků asi ne.Má diskuze  zde na fóru se nejednala o nových věcech,ale o zlepšení stávajících.Docela podstatný rozdíl.Příště než začneš machrovat tak si to lépe přečti... "}, {"5": "Pěkný netopýr...na apce povedenější "}, {"16": "Dovolím si trošku citace:[BR]Karvest napsal/a:\t\t\tFor those who want to be prepared:[BR]temp unit boosts = 600 shards + 4 catalysts[BR]orcs/orcs strategists = 1200 shards + 8 catalysts[BR]vallorian valor = 1350 shards + 9 catalysts\t\tKlikněte zde pro zvětšení...Tedy něco, co by už podle mne stálo za to craftit (tedy posilovače jednotek do turnajů - ale jen těch nejcennějších (pro mne asi posílení lehkooděnců na krystalové a prachové turnaje, z jejichž relikvií vyrábím magickou výrobu) a Valoriány(až budu v poslední kapitole, dříve to bez královské rekonstrukce nemá smysl)). Ale taky to záleží na tom, jak dobře se dají úlomky sehnat (bez akademie kouzel to na betě nemůžu vyzkoušet a stavět ji tam nehodlám)."}, {"5": "...hlavně aby to k nám vůbec dorazilo, týden pryč a dnešní aktualizace nic   [BR][BR]...a při tom se na to tak těším "}, {"16": "Tak je to ještě ve vývoji, tak to může pár týdnů trvat."}, {"66": "@ElfNostradamus Na betě v úvodním hlášení to popisovali jako:[BR]\t\t\tWe do want to be transparent about the fact that Crafting is not yet 100% ready for a full release, and that some things have not been fully completed yet in its initial release on Beta.\t\tKlikněte zde pro zvětšení...[BR]Neočekávala bych to příliš brzy, spíš za hodně dlouho, možná za rok. To už Královská rekonstrukce přijde dřív."}, {"16": "@Prealiena Tak černě bych to zase neviděl, královská rekonstrukce byla pouze oznámena, kdežto crafting už na betě je, takže já bych to fakt viděl v řádu těch týdnů. Koneckonců i HTML5 už je na live serverech a to na betě rozhodně nebylo rok."}, {"31": "Sneak Peek: Velice konstruktivní sneak peek #1[BR][BR]Spoiler: Sneak Peek14[BR][BR][BR]... ba možná více, než se zdá ​"}, {"119": "hm, snad neprijde brzy nova rasa  14? jako 14nactá rasa? "}, {"102": "spíše, že 14. nebo za 14 dní přijde to avizované dobrodružství nebo něco s těma medailemi "}, {"119": "no uvidime, nechame se prekvapit  jen to DSko bych nejradsi jeste chvilku nevidela "}, {"48": "tak Amuni jsou 13. kapitola, ne? takže 14 dává smysl... "}, {"117": "vzdyt amuni davali nedávno ... tak doufam ze ne"}, {"102": "Právě, další rasa by měla být někdy mezi únorem a dubnem. Já sám jsem se koukal jak zhruba přidávali rasy a vychází to něco mezi 5-7 měsíci."}, {"99": "Já teď do města naházela všechny dočasné budovy s tím, že na ně mám místo, tak doufám, že nová kapitola bude nejdříve začátkem února, abych je mohla všechny zbourat, teď by se mi tam nová rasa nevešla "}, {"31": "Len pripomeniem, že nie všetko uverejnené v tejto téme musí byť predmetom bezprostredne blízkej budúcnosti. "}, {"102": "No jo, ale to je potom jako říkat, že další den vyjde slunce ne ? "}, {"31": "@ExplorerFfff určite nie, cieľom sneak peekov nie je prezentovať nejaký termín kedy sa niečo plánuje zaviesť a podobne, ale skôr len načrtnúť že sa proste niečo v takom duchu chystá, nejak priblížiť toho charakter, grafickú stránku príp. príbeh, na čo sa asi ohľadne toho pripraviť a podobne, alebo ako v tomto prípade, kedy sa vlastne jedná o taký, zložitejší, rébus. "}, {"16": "@iDavis To je jak hádejte puzzle 2x2metry z 1x1 cm kousku nevýrazné barvy."}, {"48": "Když počkáme měsíc, dva, pět... Tak dostanem další kousíčky, neboj )"}]