[{"2": "http://www.elvenarchitect.com[BR][BR][BR]Možná problém mít nebudete, záleží na tom, co znamená snížit procento pracujících.[BR]Třeba bude každý desátý makant nahrazen robotema  přesune se mezi nepracující.[BR]Ale na betě už 1.27 je a jen se zvedli staty, jak tvrdili v InnoTV"}, {"43": "Tak jestli tohle s tou propastí udělají,tak ať jde celé Inno do háje,já bych přišel o 2000 lidí.Copak něco takového jde,sebrat něco hráčům,co už mají dlouho zavedené ve hře.To by si v jiné hře nikdo nedovolil.To už by byla asi ta poslední kapka před vyschnutím..."}, {"2": "Co když změní jen princip, ale ve výsledku ti pořád bude dělat volné lidi?[BR]I tak budeš nadávat?"}, {"43": "GorGlin tady nikdo nenadává,kdybych chtěl nadávat,tak použiji horší slova,ale takový já nejsem.Za další jsem psal,jestli tohle udělají,tudíš to ještě neni jisté a pak dál reaguji na komentář iDavise,kde píše že namísto přidávání mincí a obyvatelstva bude zvyšovat kapacitu v sídle...Tudíš jsem ze slova namísto usoudil,že ty funkce,co má teď nebudou a budou jiné..."}, {"31": "Ale takýto stav je len na bete. Ak tam budú mať negatívny feedback, možno to ešte upravia. [smilie--sprite2]"}, {"46": "Určitě bych nepředbíhal a nevyvolával paniku nebo fámy [smilie--sprite1] Stejně tak bych se nechytal každého názoru či myšlenky ostatních a z toho neusuzoval, že to bude špatné a že to tak skutečně je [smilie--sprite2] Nebo že dokonce bude mít tento div jiné bonusy než nyní. Nechte se překvapit a přesvědčit, protože změna bude u každého hráče individuální a bude záležet na určitém faktoru. Takže to, jestli ztratíte nebo ne, bych nechal až přijde změna sem k nám a až se budete moct přesvědčit vy sami [smilie--sprite1]"}, {"27": "- Co se týče divů a změny výpočtu populace, kladívek a mincí, tak ja ti iDavisi nevím ale myslím, že je to jinak, než si přeložil z bety. Na betě hraji a žadné navýšení kapacity u sídla a podobně se fakt nedějě.[BR]- Výpočet populace u Zlaté propasti byl změněný z fixní hodnoty pro každou úroveň na % část hráčovy pracující populace a stejně tak výroba mincí byla změněna z fixních hodnot na % část hráčovy zásobárny mincí u Hlavního sídla.[BR][BR]Dám názorný příklad:[BR]Toto jsou mé hodnoty na betě u divu:[BR]- Zde vidíme jak produkci mincí, tak bonusovou populaci.[BR][IMG]https://i.ibb.co/X5BLW3X/https-cz-forum-elvenar-com-index-php-attachments-111-png-1614.png[/IMG][BR][BR]- Zde je možno vidět celkovou populaci a tu pracující část z ní.[BR][IMG]https://i.ibb.co/wJJmqSz/https-cz-forum-elvenar-com-index-php-attachments-222-png-1615.png[/IMG][BR][BR]- Zde vidíme kapacitu mincí hlavního sídla.[BR][IMG]https://i.ibb.co/9GdMSTn/https-cz-forum-elvenar-com-index-php-attachments-screenshot-1-png-1616.png[/IMG][BR][BR]--  Výpočet populace  -- ​Konečná populace Zlaté propasti (dle obr : 59) = % část pracující populace města (dle obr: 2582 * hodnota z tabulky č.1 pro 1. úroveň divu: 0,0225)[BR][BR]--  Výpočet produkce mincí  --​Konečná výroba míncí Zlaté propasti (dle obr: 5100 / 3 h) = % z kapacity mincí Hlavního sídla (dle obr: 680.000 * hodnota z tabulky č.2 pro 1. úroveň divu: 0,0075)[BR][BR]- Každý si již teď může spočítat lehce jak na tom bude po této upravě.[BR][BR]Data vytažená z herního klienta:[BR]Populace propasti: % z pracující populace[BR]Spoiler: Tabulka č.1\"0.0225\"\"0.02625\"\"0.03\"\"0.03375\"\"0.0375\"\"0.045\"\"0.04875\"\"0.0525\"\"0.05625\"\"0.06\"\"0.0675\"\"0.07125\"\"0.075\"\"0.07875\"\"0.0825\"\"0.09\"\"0.09375\"\"0.0975\"\"0.10125\"\"0.105\"\"0.1125\"\"0.11625\"\"0.12\"\"0.12375\"\"0.1275\"\"0.135\"\"0.13875\"\"0.1425\"\"0.14625\"\"0.15\"[BR]Produkce mincí Zlaté Propasti: % z kapacity mincí Hlavního sídla[BR]Spoiler: Tabulka č.2\"0.0075\"\"0.00875\"\"0.01\"\"0.01125\"\"0.0125\"\"0.015\"\"0.01625\"\"0.0175\"\"0.01875\"\"0.02\"\"0.0225\"\"0.02375\"\"0.025\"\"0.02625\"\"0.0275\"\"0.03\"\"0.03125\"\"0.0325\"\"0.03375\"\"0.035\"\"0.0375\"\"0.03875\"\"0.04\"\"0.04125\"\"0.0425\"\"0.045\"\"0.04625\"\"0.0475\"\"0.04875\"\"0.05\""}, {"2": "A kde jsi vzal ta čísla?[BR]Já jsem taky na betě, když jsem koukal na vliv divů, přišlo mi to jako zvednutí efektu, jak tvrdili v InnoTV.[BR]Prostě měla dávat propast 300 a dává 341.[BR]Dávala 7600 zlatých bez bonusu a ted dává 44000 bez ohledu na bonus.[BR]Ale kapacita hlavního sídla je nedotčená.[BR]Takže budto jsou to jen nesmysli, které někdo mylně vyvěštil, nebo proběhla zatím jen změna co zminovali v InnoTV a to co uvedl iDavis teprve přijde.[BR][BR]Co na to zasvěcení?"}, {"47": "Tak -či -onak.je podle mě celkem jedno kolik dává propast.Buď zůstane a nebo ji zruším a postavím něco jiného (tudíž jako bonusová budova je na nic  a tím pádem nemá cenu ji stavět na vyšší úroveň).Tak či onak počkejme co vlastně bude.Pokud bude horší než byla,bude zrušena a na nic tam nebude,ale pokud něco málo přidává,ať si hráči užijí možnosti zvětšit si populaci.[BR]Za mě to na začátku nebylo,ale pokud mají mít ostatní výhodu je mi to jedno,já se předběhnout v tabulce nenechám ;o))))"}, {"2": "Knihovnu mám kvůli VB a můj současný, 4200 zásob na začátku průzkumu, který mám přes 40 hodin, je řekněme  úsměvný.[BR]Když očárám dílmy, tak mi devíti hodinová produkce dá skorem 300k.[BR]4200 mi nepokryje ani jednu třihodinovou produkci magické surky.[BR]Změnu bych uvítal, protože zvednutí skladů by mi dalo víc. Tedy kdyby ohlásili bonus s velkou pompou a pak dali 20k asi bych byl zklamaný.[BR]S ohledem na to, že nechovám hlemýždě nemám nedostatek peněz a tak když by mi propast dala, místo produkce, naopak větší možnost kumulovat peníze, tak to taky nevnímám jako problém.[BR]A když jim došlo, že zásoby vázané na na průzkum nejsou nic moc, třeba časem pochopí jak neužitečná je surovina, která nejen že se produkuje při výzkumu, ale navíc mi pak časem mizí, mana v  Enarově velvyslanectví.[BR][BR]Ale kdo ví, třeba je to kachna."}, {"27": "Náš dobrý pomocník \"Elvenarchitect\" už se také připravuje na změnu u prvních dvou divů, v odkazech níže se můžete podívat sami:[BR][BR]Zlatá propast:[BR]http://www.elvenarchitect.com/buildings/details/b_all_aw2/?culture=[BR][BR]Knihovna tajemství:[BR]http://www.elvenarchitect.com/buildings/details/b_all_aw1/?culture=[BR][BR]PS: všechna data jsou z bety a neberte je prosím jako 100% platná, pořád je šance , že se mohou trošku lišit v závislosti na zpětné vazbě hráčů nebo samotných vývojářů."}, {"2": "Tohle, zdá se, odpovídá zprávám z Inno TV.[BR]Efekt divů roste s městem.[BR]V případě zásob z knihovny a peněz z propasti se výpočet zakládá na procentech kapacity hlavního sídla.[BR]Zatím co lidi z propasti se vypočítávají z počtu lidí umístěných v budovách."}, {"48": "Jestli to takto bude, tak u propasti rozhodně super - mně to v tuto chvíli zvedne efekt propasti na dvojnásobek (mám jen lvl3), ale s každy zaměstnanym človíčkem (pardon, elfíčkem) to vlastně dál bude stoupat [smilie--sprite1]"}, {"2": "mě se lidi zvednou na 2,9 násobek součansého.[BR]Tohle je pěkné.[BR]A když vezmu lidi z klanu, co mají hromady šneků a podobně, tak ty nebudou vědět co s lidma.[BR]Jsem zvědav na úpravy dalších divů."}, {"39": "Také mám propast a jak to tu čtu ,tak jsem ráda ,že jí mám.Snad to bude opravdu veliká výhoda."}, {"2": "Velká samo nebude, to bys pak třeba nechtěla budovy za diamanty.[BR]Už se vzdali mnoha věcí aby přidávali další.[BR]Dostali propast do stavu, že se vyplatí jí pstavit bez ohledu na to kdy a to je fajn.[BR]Mrzí mě ta produkce vázaná na průzkum u Knihovny, produkovat něco, čeho mám omezenou skladovací kapacitu ne plynule, nebo když to potřebuju, ale když se děje něco naprosto nesouvisejícího, to je opruz."}, {"44": "ono budou prastaré divy až do úrovně 30?"}, {"27": "Ano, jenom nevíme kdy[smilie--sprite1]"}, {"44": "tak to mi příjde už přehnané, měli by tedy přidat VB nebo nějak jinak získávat vylepšení divů"}, {"2": "Zatni do turnaje a můžeš mít skorem dvojnásobný příjem VB."}]