[{"5": "...trochu jako mafie, nejdříve ti pošleme jeden prstík potom druhý... "}, {"31": "Malá aktualizácia diania okolo nového kúzla Královská rekonstrukce - na bete došlo k potvrdeniu, že stále je jeho vydanie naplánované na tento rok, dúfajúc v nasledujúce týždne. "}, {"102": "Do konce měsíce by nějak mohl přijít zimní event ne? Nebo je to brzo?[BR][BR]Řeším trochu zda čekat a amuni pořádně rozjet až potom, nebo rozjet a jet pomalu. Ono mě totiž asi ještě tak 14 dní bude trvat než se prokoušu výzkumem ale jestli pak třeba o týden odložit, a mít event z krku tak bych to udělal, loni to začalo 4.12. Takže předpokládám, že to bude podobné že?"}, {"5": "...nějak mi tam chybí ještě DS, že by bylo řidčeji než nás dosud zásobili ?!   ...pak týden ,,odfrk,, a po té někdy v prosinci vánoční Event"}, {"102": "No to mě nechybí vůbec, když nebude vůbec mi to vadit nebude "}, {"40": "Zimní event dle mého začne kolem 15.12. bylo to tak každý rok a ukončí až v lednu. Aby i loudalové stihli získat VIP budovy.Ty loňské mám a jsem nadmíru spokojen"}, {"102": "Loni začal 4.12. nepamatuji si, že by začínal tak pozdě až, ten předminulý 5.12, co jako začínalo 15?  Já osobně čekám, že zde bude první týden v prosinci. Tzn max 30 dní od teď."}, {"65": "no ten event po eventu mě taky trochu zmátl, abych řekl pravdu  čekal jsem letní event / dobrodrůžo / halloween / dobrodrůžo / zimní event. tak možná to prohodili. vždycky je týden pauza, týden něco, takže nejspíš nám dají ještě jeden mini event před tím zimním."}, {"102": "No za týden tady máme dobrodružství  Už je info na betě"}, {"16": "Tak na to mám teď akorát po přechodu kapitoly místo... akorát se svým současným netem se na to ani trošku netěším - posbírat kupu výrob, jen abych dostal disconnect a zjistil, že jsem vlastně nic neposbíral..."}, {"114": "jupí! v obou městech právě dokončuji kapitolu, budu mít na ds volno  [BR][BR]jen tedy nevím jak moc se mi do ds bude chtít, jestli ty odměny za to úsilí budou stát za to..."}, {"102": "Já se na to právě netěším, počkám zítra co tam je a nechám hlasovat, zda se pojede naplno nebo ne, podle mě tam bude zase bída takže asi dáme jen dvě lážo plážo. Turnaje jsou prostě výhodnější."}, {"48": "DS? Paráááda... To zas bude jízda )[BR]Ještě že jsem před koncem Amuni a do DS je nestihnu, tak se mám na co vymluvit O: -)"}, {"119": "@ramaloke jo tak vymlouvat se budeš jo? tak to ti neprojde "}, {"127": "Mozete napisat co je v truhlach za odmeny prosim? Diky"}, {"102": "Odměny budou[BR]1. truhla - 30VB[BR]2. truhla - 35VB +  budova knihovny (100x 1VB/24h)[BR]3. truhla - 8h + 14h urychlovače + budova kupec (5% za 48h na 50 dní)"}, {"5": "č.4 - takže komplet odznaky..."}, {"102": "No já nevím, třetí truhlu bych chtěl, ale asi to moc nestojí za tu námahu, protože už teď vím, že dost lidí ve spolku je proti účasti a jestli těch proti bude moc, tak pro ten zbytek by to bylo zbytečně náročné. Ty první dvě truhly to snad ani nestojí za řeč. Uvidíme jak náročná bude třetí až budou známy cesty.[BR][BR]Já nevím, popravdě dokud neudělají rozumný systém přeblikávání tak mám tendenci tyhle dobrodružství sabotovat, minulé jsem jel jen proto že chtělo dost lidí ve spolku."}, {"31": "Ja už som tak dúfal, tým že bola od tých dobrodružstiev teraz taká dlhšia prestávka, že ich uvidím až niekedy v novom roku, kedy nás rovno príjemne prekvapia novým jednoduchým systémom úloh. Jediné čo teraz vidím je, že som zase len nadmerne naivný a blíži sa rovnaká otrava, ako vždy.  Čo narobíme.."}, {"125": "ExplorerFfff Ta třetí by šla, ale jinak mi celkem nepřipomíná odměny. A nějak to má furt tendemci se horšit, místo toho aby člověk před tim sedl na zadel, zařval \"To chci !\" a nadšeně se jak vyrábět 125x psí uši a 25x lopatu, si jen řeknu \"No\"....."}]