[{"102": "Jo popravdě  pokud to u nás více lidí nepojede aktivně, tak 3 truhla je marná a v tom případě je lepší to zazdít celé  Jako ty dobrodružství jsou fakt k ničemu pokud člověk nemá spolek fanatiků co u toho sedí 24/7 a má je vycvičené jak opice, aby jeli jak vojsko, my jsme spolek co má tak nějak život a pro tyhle ceny se u nás moc lidí nenadchne jak píšeš."}, {"125": "ExplorerFfff No já jezdím aktivně (teda u sebe), momentálně ale rozmítám zda společenství nebo teda ta aktívní část pro podobný akce, rozhodne že pojedem, protože jako jsem měla místo na haldu dílen a manufaktur po trpajzlíkách, teď ho mám po vílách. Minule jsme to zmákli, protože všichni jeli jak draci. Ty ceny to prostě ku....pardon..komplikují."}, {"114": "jedna knihovnička by se šikla, 100VB je 100VB  vzhledem k tomu že v Lenivém sněhulákovi máme celou novou partu členů, vůbec nevím jak to půjde, ale vidím to tak, že právě to si budeme chtít odzkoušet..., v Beleriand, tam jsme vždycky taky draci, tam už mám dvě latríny   a že v obou městech právě končím kapitolu, asi budu drak dvouhlavej [BR][BR]..kdyby se aspoň dalo překlikávat jak po jednom, tak i třeba po pěti, hned by se ušetřila energie na hraní..."}, {"48": "Joo, ten novej systém na úkoly by to už fakt chtělo... Ale jak psali na betě \"pracujeme na tom, ale ještě tam nejsme\" "}, {"99": "Na betě to píšou už od 2.5., přičemž 27.9. v živém vysíláni prohlásili (díky iDavis ): Sú nejaké novinky ohľadne zmeny systému úloh (najmä pokiaľ ide o dobrodružstvá spoločenstiev)?[BR]Rozmýšľame nad spôsobmi ako to zmeniť, vieme o tom, dostávame feedback že preklikávanie medzi úlohami je nepríjemné, hľadáme možné riešenia\t\tKlikněte zde pro zvětšení...Docela by mě zajímalo, kde teď tedy jsou, když tam ještě nejsou a na konci září evidentně nebyli ani blízko "}, {"5": "...zatím jsou daleko a my tím tedy v tirititi "}, {"16": "Asi zabloudili. Nebo chodí v kruzích.[BR]Net už mám lepší, takže můžu na dobrodružství využít své volné místo po půlčících, ještě chvíli potrvá, než vyzkoumám elementální budovy na zaplácnutí místa (mezitím můžu ještě tak 2x překopat celou vesnici, zatím jsem ji překopal 2x a stále se mi nelíbí.[BR]Ale ty odměny mě do dobrodružství teda moc nemotivují, to je zase pěkný výsměch a ne odměny."}, {"31": "Sneak Peek: Zimní kouzlo #1[BR][BR]Spoiler: Sneak PeekZačátek zimy cítit nenáročky,[BR]k nalezení jsou zde první vločky.[BR][BR][IMG]https://i.ibb.co/R3X0DV3/https-image-ibb-co-hw1-Cxq-EL-sneak-peek-9-11-2018-2-png.png[/IMG][BR][BR]Blíží se již Santa letošní,[BR]přinese nám kouzelný čas Vánoční.[BR][BR][IMG]https://i.ibb.co/HzDBq9b/https-image-ibb-co-d-Anfi-V-EL-sneak-peek-9-11-2018-1-png.png[/IMG][BR][BR]>>>​"}, {"115": "[IMG]https://i.ibb.co/9yjFQX5/https-cz-forum-elvenar-com-index-php-attachments-13735231-gif-2745.gif[/IMG] [BR][BR]Tak Dřímal toho Santu teda udělá pro inno "}, {"102": "Tak v poslední aktualizaci mobilu na iBrick již je zmíněn crafting, takže to bude na spadnutí "}, {"5": "...hmmm zrovna když jsem vymlátil 50k kult budov kvůli DS"}, {"31": "Sneak Peek: Zimní kouzlo #2[BR][BR]Spoiler: Sneak Peek<<<[BR][BR]Vánoční perníky, cukroví, jablko slazené medem,[BR]pamatujete systém rotujících beden?[BR][BR][IMG]https://i.ibb.co/YktgGB4/https-image-ibb-co-gq-MKa-L-EL-sneak-peek-16-11-2018-1-png.png[/IMG][IMG]https://i.ibb.co/vqGgTVB/https-image-ibb-co-e-Tob-N0-EL-sneak-peek-16-11-2018-6-png.png[/IMG][IMG]https://i.ibb.co/NxNnPtR/https-image-ibb-co-ir-Vqh0-EL-sneak-peek-16-11-2018-3-png.png[/IMG][BR]Každý nějaké odměny v pochutinách nachází,[BR]dav lidí se při vánočním stánku již schází.[BR][BR][IMG]https://i.ibb.co/XyVGc2N/https-image-ibb-co-d-R3-Pa-L-EL-sneak-peek-16-11-2018-5-png.png[/IMG][IMG]https://i.ibb.co/C0n961x/https-image-ibb-co-ma5ea-L-EL-sneak-peek-16-11-2018-2-png.png[/IMG][IMG]https://i.ibb.co/QY13FCr/https-image-ibb-co-c-BDAh0-EL-sneak-peek-16-11-2018-4-png.png[/IMG][BR]>>>​"}, {"99": "A jeje, rotující bedny mi moc nepřály  I když to bylo zajímavé zpestření "}, {"43": "Super,mám místo po kočkách,tak se těším..."}, {"66": "Připomíná mi to tento event ve Forge of Empires:[BR][BR]Něco takového bych si dala v Elvenaru. "}, {"31": "Na bete sa dnes začína zimná udalosť.. [BR]Zimní kouzlo[BR][BR]Spoiler: Zimní kouzlo[IMG]https://i.ibb.co/GRBKLvf/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-winter2018-wintermagictemp-png.png[/IMG][BR]Predpokladaný termín: 26.11. - 27.12.[BR][BR]V tomto spoileri budem postupne aktualizovať informácie o tejto udalosti.[BR][BR]Príbehom tohtoročnej udalosti budú vianočné trhy. Získavať za úlohy a taktiež nachádzať v okolí nášho mesta budeme snehové vločky, ktoré budeme potrebovať na otváranie vianočných pochutín. Princíp týchto vianočných pochutín by mal byť podobný so systémom rotujících beden. Za každé otvorenie vianočnej pochutiny dostaneme nejaké množstvo vianočných perníkov, ktoré nám budú odomykať hlavné ceny.[BR][BR]Spoiler: ÚlohyKompletný prehľad udalosti nájdete TU.[BR][BR][IMG]https://i.ibb.co/3p9N53Y/https-i-imgur-com-7uju-ETj-png.png[/IMG][BR][IMG]https://i.ibb.co/Lx1b014/https-i-imgur-com-fint8-L2-png.png[/IMG][BR][IMG]https://i.ibb.co/VxpKfB3/https-i-imgur-com-HHKy-QM6-png.png[/IMG][BR][BR]Od verzie 1.47 je možné kopírovať text v hre klasickým spôsobom potiahnutia kurzorom, čo umožňuje jednoduchšie zdieľanie adries.[BR]Ak chcete zdieľať zoznam úloh, môžete tak urobiť kliknutím pravým tlačidlom na jednotlivé tabuľky a zvoliť možnosť Kopírovat adresu obrázka.[BR]K získaniu budú opäť 2 sety, súčasťou jedného z nich budú všetky nové budovy z hlavný cien.[BR][BR][IMG]https://i.ibb.co/4WH36SW/https-image-ibb-co-byu-Eh0-upload-2018-11-19-12-19-54-png.png[/IMG][BR][IMG]https://i.ibb.co/BgZj9nf/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-winter2018-Set1-png.png[/IMG][BR][IMG]https://i.ibb.co/v4KwQCk/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-winter2018-Set2-png.png[/IMG][BR][BR]Jednou z nových denných odmien bude aj nová budova s dočasným efektom - Zimní ruské kolo, ktoré bude každých 24 hodín poskytovať jednu z týchto odmien: 1x déšť mincí (10%), 1x příděl zásob (10%), 1x VB, 1x rozbitý úlomek runy.[BR][BR]V priebehu dnešného alebo zajtrajšieho večera pridám informácie o jednotlivých budovách. Rozhodol som sa trochu pozmeniť doterajší systém tabuliek, informácie o novom systéme sem dám akonáhle to bude aktuálne."}, {"48": "Troufl bych si, vzhledem k zkušenostem z předchozích let, rozporovat to datum... Event vždy začínal až v prosinci (loni 4.12., předloni 5.12.) a končil až po silvestru, takže bych event čekal o týden později, dle tvého odhadu tedy 3.12. - 3.1. "}, {"99": "Také mě překvapilo, že je letos tak brzy, ale na betě opravdu začíná dnes a na live servery se obvykle dostává s týdenním zpožděním, což by odpovídalo tomu, co psal iDavis... Nu, necháme se překvapit "}, {"48": "Tak letní třeba měl 3 týdny, kvuli tomu, že točící truhly byly nové... Ale jak říkáš, necháme se překvapit "}, {"31": "Ten predpokladaný termín vychádza z toho, že drtivá väčšina udalostí sa na live serveroch začína oproti bete s týždenným oneskorením. Samozrejme začlenenie zložitejšej mechaniky (rotujúce pochutiny ) to môže zmeniť, ale keďže to tu už raz bolo, možno to nebudú musieť nejak extra testovať."}]