[{"66": "Tak s novým upgradem prý menší chybka a můžeme hádat, co bude za novou rasu [BR]"}, {"31": "Tak to už je tretíkrát čo sa im tam dostali nové ikonky..  Ale tentokrát správne.."}, {"48": "hmm.. to první je máslo a to druhé jedovatá houba? třetí budou kostky mahjongu, takže... po egypťnech asi něco čínského "}, {"16": "Prošlé houbičky?[BR]Tak nejen otrava houbami, ale rovnou prošlými houbami![BR][BR][BR]ps: To abych po skončení dobrodružství nechal část místa na výrobny do eventu. A zbytek zastavěl těmi prošlými elementy."}, {"48": "taky už počítám se stavbou jedné T3 na které budu mít bonus v další kapitole... veliká radost ))"}, {"16": "@ramaloke To já ještě 2 - T5 a T6, teprve nedávno jsem začal ty prošlé elementy.[BR]Kde na ně vemu místo? To je jasné, bourat svoje T2&T3 nebudu, prostě uberu z místa na rasy. Stejně už se blížím ke konci, tak je jedno, zda pojedu rasu 2 nebo 3 měsíce(tu poslední možná i 4)."}, {"102": "@ramaloke Já to říkal, že to přijde  A stejně tak čekám, že bude T7, T8, T9 a pak udělám delete a čau, protože to už mi můžou víte co s tím místem "}, {"5": "...věřím v nějakou novou ,,dimenzi,, která by řešila místo do budoucna, bud´půjdeme pod zem / Highway to hell AC/DC nebo Půjdeme spolu do nebe -Brutus! / )"}, {"117": "ExplorerFfff napsal/a:@ramaloke Já to říkal, že to přijde  A stejně tak čekám, že bude T7, T8, T9 a pak udělám delete a čau, protože to už mi můžou víte co s tím místem Klikněte zde pro zvětšení...Tak to uz bych jim na to hodila bobek, kdyby bylo jeste T7, T8...  Uz ted je to misty opruz."}, {"16": "@iDavis Je tam nějaká hezká nesetová budova na manu (něco jako festivalový obchodník, ale jen na manu - semínek mám dost)?"}, {"31": "Zimní kouzlo - přehled budov[BR][BR]Spoiler: Zimní kouzlo[IMG]https://i.ibb.co/GRBKLvf/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-winter2018-wintermagictemp-png.png[/IMG][BR]Ako som už spomenul v tomto príspevku, rozhodol som sa zmeniť spôsob tvorby tabuliek s budovami. Všetky nové budovy ktoré táto zimná udalosť prinesie sú už teraz v téme Speciální budovy. "}, {"102": "zatím to vypadá, že budou dva sety[BR][BR]1. půjde získat pomocí všech tří hlavních cen (3 budovy)[BR]2. půjde sehnat jen v rámci denních (zase se zdá, že půjde o T1 surovinový set, asi taky 3 budovy)[BR][BR]Jen jedna věc bych chtěl říct, bohužel to co zde pindali ti kazimírové asi tak pindalo více lidí ve světě a nově budova končí až v jednu ráno! takže už nepůjde to, že získáme double + lepší budovu a můžeme poděkovat určitě těm super lidem, které bych chtěl mít za souseda v baráku  Typičtí koblihožrouti naštěstí hlavní set nechci ale prostě s vědomím toho, co tomuhle předcházelo ty lidi nemám rád [BR][BR]Jinak první den slušná kulturka, ale zatím nic z čeho bych si sedl na zadek, druhý den je tam budova z druhého setu."}, {"43": "iDavis napsal/a:Zimní kouzlo - přehled budov Klikněte zde pro zvětšení...[BR][BR][BR]Děkuji moc iDavis, jako vždy skvělá informativní práce. "}, {"102": "@iDavis Podle čeho vypočítáváš fragment kouzel? To se dá nějak odvodit i když se ten počet podle všeho zvyšuje s úrovní akademie myslím?"}, {"99": "Pokud vím, počet fragmentů se odvíjí od velikosti budovy, čili za každý čtverec dostaneš v základu 60 fragmentů. Předpokládám, že iDavis bere základní hodnoty..."}, {"59": "Já se na Zimní událost moc těším, přeci jen vánoční svátky nabízejí samy o sobě takovou pohodovou atmosféru klidu a pokoje a tak i náš Elvenar přispěje svou událostí k pohodičce. Nemíním se stresovat tím, jaké parametry odměny budou mít, prostě se těším už jen na sbírání hvězdiček  A když se něco pěkného povede, bude to jen bonus. "}, {"31": "@ExplorerFfff ako píše Angedev, závisí to od veľkosti budovy (60 na štvorec), ale aj tak to beriem z prednastavených hodnôt danej budovy, takže ak by sa náhodou niektorá v tom výnimočne líšila, malo by to sedieť aj tak."}, {"48": "Já se přiznám, že mi v přehledu (co jsem koukal včera, pokud bylo doplněno, tak se omlouvám) chybí bonusy spojení u setů. Chystám se udělat opět analýzu výhodnosti obou setů, a bez těhle bonusů to jaksi nejde "}, {"31": "@ramaloke áno setové budovy (teda bonusy spájaní) tam zatiaľ nie sú, ale budú nasledovať. Nie som si ešte istý, či ich dám to tej témy alebo až ako súčasť prehľadu udalosti."}, {"99": "@ramaloke : Zkus tohle http://www.elvenarchitect.com/buildings/sets/ "}]