[{"48": "Dik oběma [smilie--sprite1]"}, {"117": "ExplorerFfff napsal/a:\t\t\tzatím to vypadá, že budou dva sety[BR][BR]1. půjde získat pomocí všech tří hlavních cen (3 budovy)[BR]2. půjde sehnat jen v rámci denních (zase se zdá, že půjde o T1 surovinový set, asi taky 3 budovy)[BR][BR]Jen jedna věc bych chtěl říct, bohužel to co zde pindali ti kazimírové asi tak pindalo více lidí ve světě a nově budova končí až v jednu ráno! takže už nepůjde to, že získáme double + lepší budovu a můžeme poděkovat určitě těm super lidem, které bych chtěl mít za souseda v baráku [smilie--sprite1] Typičtí koblihožrouti naštěstí hlavní set nechci ale prostě s vědomím toho, co tomuhle předcházelo ty lidi nemám rád [smilie--sprite5][BR][BR]Jinak první den slušná kulturka, ale zatím nic z čeho bych si sedl na zadek, druhý den je tam budova z druhého setu.\t\tKlikněte zde pro zvětšení...[BR]Asi vubec nechapu, v cem je nebo byl problem budovy, ktera koncila / konci v jednu. Asi si sedim na vedeni? [smilie--sprite8]"}, {"99": "Když se budova měnila o půlnoci a double končil až ve 2 hodiny ráno, bylo možné v těch 2 hodinách získat při double jinou (dost často výhodnější) budovu, než jaká byla svázaná s \"double day\". Nyní se budova mění v jednu a stejně tak bude předpokládám končit i double, čímž tato výhoda mizí..."}, {"117": "Aha, diky za vysvetleni, ja v techto hodinach spim, takze jsem toto ani nepostrehla [smilie--sprite8]"}, {"72": "iDavis, díky, vím že se snažíš vylepšovat, ale předchozí systém mi přišel lepší. Tady je to krásně přehledné, velké, ale nějak tam chybí kontext."}, {"31": "@athlan jedná sa čisto len o zoznam budov, takže nič viac (ani súvisiace s udalosťou) tam v záujme možnosti rýchleho vyhľadávania dávať nechcem."}, {"102": "Podle všeho bychom se zítra měli dočkat craftingu na live serveru. Jsem celkem zvědavý jak to pojmenují [smilie--sprite8]"}, {"48": "Včera už bylo oznámení - ale to jméno \"Řemeslná výroba\", mně tedy nesedí ;-)"}, {"66": "Já tomu asi pořád budu říkat crafting. Ale hlavně že už to bude.[smilie--sprite8]"}, {"48": "Přesně [smilie--sprite1]"}, {"102": "Jo to vlákno jsem četl, resp otevřel jsem to a říkal si, to je nějaká ptákovina tak to zase někdo neumí něco vyrábět... a ono je to tohle [smilie--sprite8] No taky bych radši crafting, ono to totiž tak nějak odráží spíše ten význam, kdy kutíš. Takže možná Kutilství by bylo lepší."}, {"117": "Jakoby nebylo jedno, jak se to jmenuje"}, {"66": "Dnes ráno na mě na mobilu vyběhlo oznámení, že zítra budou Black Friday slevy (a obrázek diamantů). To bych přesně čekala, když právě zavedou novinku a mluví o tom, jak je důležité upgradovat Akademii kouzel."}, {"43": "Prealiena a ty se divíš.Je spousta hráčů,co mají města skoro celé nebo větší část zaplacené (kouzelné obytky,dílny,největší kultury,atd.),tak tyto lidi s tím nebudou mít problém,tak proč toho nevyužít.Přeci ta hra musí nějak vydělávat nebo ty pracuješ zadarmo...? [smilie--sprite1]"}, {"66": "Vždyť to není hate comment, jenom podotýkám, že to přišlo v pravý čas.[smilie--sprite1]"}, {"72": "Na betě je dneska sněhový strom, čistá kultura, na elvengems.com o něm nebyla zatím zmínka, pokud vím.. takže třeba to bude v reálu kdovíjak [smilie--sprite1]"}, {"128": "Adio.Vi se uz pocet a zneni ukolu na zimni event?Nebo jen tech 30 od IDavise.Predem diky"}, {"97": "@Klimoriz úkolů by mělo být 100,Idavis ještě bude doplňovat [smilie--sprite2]"}, {"129": "ExplorerFfff napsal/a:\t\t\tJen jedna věc bych chtěl říct, bohužel to co zde pindali ti kazimírové asi tak pindalo více lidí ve světě a nově budova končí až v jednu ráno! takže už nepůjde to, že získáme double + lepší budovu a můžeme poděkovat určitě těm super lidem, které bych chtěl mít za souseda v baráku [smilie--sprite1] Typičtí koblihožrouti naštěstí hlavní set nechci ale prostě s vědomím toho, co tomuhle předcházelo ty lidi nemám rád [smilie--sprite5]Klikněte zde pro zvětšení...[BR]a nebude to spíš tím,že máme zimní čas a tím se ten hodinový rozdíl vyrovnal [smilie--sprite1]"}, {"102": "byl dvou hodinový ten rozdíl, takže pokud se u tebe doma v zimě neposouvá čas o dvě hodiny nebo nemigruješ jak stěhovaví ptáci do jiného časového pásma tak to tím nebude [smilie--sprite6]"}]