[{"127": "Ano pravdaze, viem. Ide mi o to ci je mozne ziskanie bonusu z dvoch sad toho isteho setu.[BR][BR]Odstraněna citace. Embla"}, {"31": "@PankerSK myslel som, že označením A a B hovoríš o dvoch rôznych setoch. Každopádne to čo popisuješ možné je, inými slovami, môžeš si v meste postaviť aj viac rovnakých setov a bonusy by sa tiež mali objaviť u všetkých."}, {"127": "To je to co som chcel vediet a dava to nove moznosti, nie ust po celom sete ale len casti z neho. Dakujem[BR][BR]Odstraněna citace. Embla"}, {"113": "iDavis napsal/a:@PankerSK ak postavíš k sebe setové budovy spôsobom A+B, neaktivuje to žiadne bonusy, tie sa aktivujú iba v prípade vzájomného dotyku budov z rovnakého setu, tj. A+A+... alebo B+B+...\t\tKlikněte zde pro zvětšení...Mám za to, že autor mluvil o budovach ze stejného setu tudíž tato kombinace bude vždy fungovat. Dokonce stačí i jedna budova A a k tomu 2 B a všechny budou mít první bonus. Mám to odzkoušeno"}, {"5": "Ahoj, Rami už jsi spočítal ty sety? ...zběžně jsem je projel a nepřijdou mi až tak dobré jako ty podzimní, co na to matematika ? "}, {"99": "Na betě doporučovali vzít 2x ledový vánoční strom ze setu A a k němu doprostřed 2 malé budovy, pokud potřebuješ manu. Jestli si dobře vzpomínám, u Amuni to vycházelo cca na 119k many denně  Další bonusy příliš nerozebírali..."}, {"113": "Nazdar sety ještě spočítat nejdou ne?? Já jsem nikde k tomu nenašel data, pokud máte odkaz pls hoďtě ho sem."}, {"97": "@matrix0007 https://elvengems.com/winter-magic/set-buildings/"}, {"113": "Dikes já jsem vůl, vůbec jsem si nevšíml, že se setové budovy dají rozkliknout a to na to čumím furt :-D"}, {"94": "iDavis napsal/a:\t\t\tNa bete sa dnes začína zimná udalosť.. [BR]Zimní kouzloKlikněte zde pro zvětšení...Diky za informaci, ale prijde mi, ze to trochu prehani s pozadavky na nakup VB [BR]Prece jenom pozadavky na nakup celkem 55VB mi prijde docela dost..."}, {"117": "VB se daji nakupovat i surovinami a 55 VB se da v pohode koupit..."}, {"94": "To sice ano, ale cena bodu pomerne slusne narusta a postupem casu by pri podobnych poctev v ualostech mohla byt neumerna...[BR]Neco jineho by bylo, kdyby se dala cena VB nejak snizit...[BR][BR]Odstraněna citace. Embla"}, {"117": "Pokud kupujes za suroviny, tak ta cena moc rychle nenarusta a stale je to za hubicku. Ja kupuji VB denne za mince, nekdy kupuji i za zboží a porad mi neprijde jako neco nesplnitelneho tech 55bodu...nikde neni psano, ze mas vse nakoupit okamzite a troufam si rict, ze zrovna minci je u kazdeho hrace nadbytek."}, {"45": "cena 1 VB je u mna 3.100.000 a nemam nikdy  problem nakupit dalsie , pretoze minci mam stale nadbytok....tak celkom nechapem Vase pripomienky ohladom ceny VB... staci obehnut susedov na mape a mas minci mraky... a na mobile to mas pomerne rychlo... "}, {"31": "V cene VB za mince alebo suroviny ja veľmi veľký problém nevidím. Áno, síce sa navyšuje, ale rovnako tak aj kapacita mincí, príjem mincí a príjem surovín. Čiže ten pomer medzi nákladmi a príjmami je celý čas približne konštantný."}, {"113": "Tak jak to vidíte ?? Propukne to už dnes, nebo to ještě týden budeme muset vydržet ??"}, {"102": "Týden vydržet, je kravina to čekat tak brzo. Člověk se nesmí držet bety ale historického sledu událostí, pustit to dnes tak by to značilo změny v plánování Inno."}, {"48": "ElfNostradamus napsal/a:\t\t\tAhoj, Rami už jsi spočítal ty sety? ...zběžně jsem je projel a nepřijdou mi až tak dobré jako ty podzimní, co na to matematika ? Klikněte zde pro zvětšení...[BR]Podle mne máme týden do začátku eventu, tak jsem na to nespěchal, ale když se takto hezky ptáte, tak jsem v rychlosti udělal srovnání pro druhý, hůře dostupný set (ten z hlavních odměn) ) - opět pro \"svoje kapitoly\", tj. Amuni a Víly. Předpokládám, že set se vždy spojí tak, že dosáhnou všechny tři budovy max bonusu (první set je v tomto těžší, proto ho dodělám později):[BR][BR]Set 2 - z hlavních odměn - amuni[BR]Lidi    - 1850+1860+2300 = 6010[BR]Kultura - 2500+2500+3000 = 8000[BR]Mince   - 85000+170000   = 255000[BR]VB      - 1+1+1          = 3[BR]Mana    - 6600+13200     = 19800[BR]Semena  - 1230+2460      = 3690[BR]Plocha  - 8+10+12        = 30[BR][BR]Na políčko 200,33 člověka (obytka dá 212,5), 266,66 kultury (café dá 433,33), 27,5 many/h (fontána, v amuni jsem lepší nenašel, 33,31 m/h), 5,125 semínka/h (těžko srovnávat, zlatý palác dáva každopádně víc, u mne 6,38 a možná je z elementálů) a 3body.[BR]V žádné hodnotě nepřekoná srovnatelnou \"úzkoprofilovou\" budovu, ale jako set má svojí hodnotu, zvlášť s 3 body výzkumu denně na \"pouhých\" 30 polích. Manu osobně nepotřebuji, ale když ty hlavní ceny náhodou posbírám, tak ho postavim [BR][BR]Set 2 - z hlavních odměn - víly[BR]Lidi    - 360+370+440         = 1170[BR]Kultura - 480+490+590         = 1560[BR]Mince   - 29000+58000         = 87000[BR]VB      - 1+1+1               = 3[BR]T3 sur  - 1070+2140+1280+2560 = 7050[BR]Plocha  - 8+10+12             = 30[BR][BR]Pro srovnání - na políčko dá set 39 lidí (75 obytka orků, 68,75 vílí), 52 kultury (123 dá jezero, 145 táborák), nějaké mince a 9,79 T3/h (1,61 bez bonus T3 v orcích, 1,19 ve vílách, se 700% bonusem 10,76 T3 v orcích a 9,51 ve vílách, vše při 24h výrobě, víc info na WiKi není).[BR]Na první pohled tedy působí jako solidní náhrada za jednu T3 manufakturu - na ploše o 10 polí větší získám podobnou výrobu a k tomu lidí jak za dvě obytky, trochu kultury plus co ušetřím za stavbu T3 a obytek pro ní... A opět 3 VB. V kapitole víl se mi tedy budova zdá ještě silnější než v Amuni, jediné, kde bych se budově vyhnul je v orcích, neboť změna statů mezi orky a elfy je obecně u všech budov enormní (přechod z čistých kulturek na manové) a zastarání eventových budov je tam velké."}, {"2": "A na kdy to šacujete když ne dnes?"}, {"113": "Nejspíše za týden v pondělí. Jako mi se to jen hodí, alespon dodělám draky a budu mít místo na budovy + vědět 14 dnu dopředu, jaké budou denní odměny je fakt výhoda."}]