[{"133": "A nemáte náhodou už seznam těch denních odměn?? Děkuji"}, {"16": "https://elvengems.com/winter-magic/daily-prizes/[BR][BR]Zatím jsou k dispozici odmězy z prvních 8 dní."}, {"31": "Myslím že minimálne sa už počká na štvrtkovú aktualizáciu hry."}, {"48": "Z principu logiky současného řazení - ve čtvrtek skončilo DS, takže ve čtvrtek začne event... Ale protože všechny zimní začínali první prosincové pondělí, tipuju to až na to pondělí"}, {"114": "když potrvá měsíc, tak aby vyšel konec někdy k silvestru a vyšly turnaje na úkoly se střetama a relikviema by nebylo zas tak špatné [smilie--sprite1]"}, {"97": "@luterina střety bohužel v tomhle eventu nepujdou plnit v turnaji:-( ale na relikvie a kouzla to bude fajn [smilie--sprite1]"}, {"134": "Zdravím, nevíte někdo kdy spustí magic Winter ne jen na betě, ale i na ostatních serverech. [BR][BR]Díky, Alpha Romes"}, {"48": "Neví - až to budem vědět, bude to proto, že vyjde oficiální oznámení... A z něj už to budeš vědět i ty [smilie--sprite1]"}, {"117": "Fragola napsal/a:@luterina střety bohužel v tomhle eventu nepujdou plnit v turnaji:-( ale na relikvie a kouzla to bude fajn [smilie--sprite1]Klikněte zde pro zvětšení...Tak to je na houby zas...."}, {"114": "@donutka co naděláme, nemám teď moc surovin, tak šetřím co to jde abych na zimní událost měla na vyjednávání střetů v provinciích, tento turnaj asi dám jen co dají vojáci, takže asi nedám ani kola na čtvrtou hvězdu.., stále volám ať se smilují a turnajové střety do možnosti plnit jimi úkoly v události zahrnou, v té helloweenské úkolovce co byla nedávno, jak to v ní šlo, to bylo super, někomu to totiž vyloženě umožnilo jí vůbec dohrát do konce..."}, {"117": "mme ani tak nejde o suroviny, ale nechci kvuli tomu neustale zkoumat provincie, kdyz uz jsem davno za limitem... [smilie--sprite3] nehlede na to, ze nekteri jsou ve vilach ci trpaslicich a vyjednavani po nich chce orky... sama jsem kvuli tomuto nemohla 3 eventy dohrát do konce, a rozjodne jsem nebyla jedina... toto je jediny ukol, ktery je nesmyslny podle me"}, {"48": "Přidávám analýzy prvního setu, jak jsem slíbil [smilie--sprite1][BR][BR]Set 1 - z denních odměn - Amuni[BR]Poskládání setu je trochu komplikovanější, nicméně, pokud jsem se nespletl, podařilo se mi poskládat kombinaci, která má kompletní bonusy u všech budov. Není to moc hezké, ale mohlo by být i hůř [smilie--sprite1] [BR][BR]Spoiler: Jak to poskládat[BR]A teď už k číslům:[BR]Kultura - 7200+1580+3500+3100+2300 =  17680[BR]Mince   - 300000                   = 300000[BR]Kladiva - 15000+15000+30000        =  60000[BR]Mana    - 14900+14900+29800        =  59600[BR]T1 sur  - 3400+3400+6800           =  13600[BR]T2 sur  - 4100+4100+8200           =  16400[BR]T3 sur  - 4300+4300+8600           =  17200[BR]VB      - 2                        =      2[BR]Úlomky  - 1                        =      1[BR]Plocha  - 18+6+9+8+6               =     47[BR][BR]Poprvé tu máme set, který není pop/kul hybridem, ale \"čistou\" kulturou s manou, s 376,17 kultury na políčko. V porovnání s Café je to méně (433,33), ale protože set nám dá více než jen kulturu, není to špatné. S manou se dostaneme na 52,83 na hodinu a políčko, což je o velký kus lepší než aktuálně nejlepší běžně dostupná ve hře (fontána z elementů s 33,31m/h), takže už jen jako budova na manu s kulturou set překoná vše dostupné.[BR]Když k tomu připočteme 2 výzkumné body, 1 úlomek a 47200 surovin za den (odpovídá cca 5x3h T3 lvl23 + 3,5x3h T2 lvl27 + 4x3h T1 lvl27), což se blíží po jedné od každé manufaktury. Za mne rozhodně ANO, suroviny se hodí na turnaje a tohle je skoro jedna od každé surkovny \"zdarma\", VB a úlomky jsou taky bonus navíc a po dlouhé době zas budu mít ve městě kulturní budovu na manu, a navíc velmi slušnou [smilie--sprite1] Teď už jen, aby se povedlo posbírat [smilie--sprite1][BR]Pro zajímavost, nejlepší budova na manu za diamanty, Kočičí divadlo, dává 500 kultury na políčko a 61,66 many na hodinu a políčko. Do toho tomuhle setu ještě kousek chybí, ale.. Kočičí divadlo vám nedá VB, úlomky a ani suroviny [smilie--sprite1][BR][BR]Set 1 - z denních odměn - Víly[BR]Kultura - 1410+310+690+610+450          =   3470[BR]Mince   - 104000                        = 104000[BR]Kladiva - 5200+5200+10400               =  20800[BR]T1 sur  - 970+970+1940                  =   3880[BR]T2 sur  - 1150+1150+2300                =   4600[BR]T3 sur  - 2400+2400+4800+1200+1200+2400 =  14400[BR]VB      - 2                             =      2[BR]Úlomky  - 1                             =      1[BR]Plocha  - 18+6+9+8+6                    =     47[BR][BR]V dobách starších nám set trochu mění význam, jelikož neprodukuje manu, ale místo ní více T3 surovin. S kulturou 73,8 na políčko to není žádná sláva (123 dá jezero, 145 táborák v orcích), ale ani ne vyloženě špatné. Oněch 14400 T3 surovin, když porovnám se svou T3 lvl15 manufakturou (elixír - 20 polí velikost, 1213 elixíru/3h) dostávám, že vyrobí set přibližně stejně, jako manufaktury dvě, a to už smysl dává. Když opět připočtu T1 surky, T2 surky, body a úlomek, vychází set celkem dobře, ái když ne tolik, jako u ras kde již dává manu [smilie--sprite1]"}, {"99": "@ramaloke : Díky za analýzu [smilie--sprite1] Ještě doplním pro ty, kteří jdou vyloženě po maně: Při 2 vánočních stromech a 2 dalších budovách ze setu mezi nimi by mělo být v Amuni 119200 many za den [smilie--sprite1]"}, {"16": "A co teprve při třech nebo čtyřech.[BR]Já sám mám v úmyslu vzít na manu minimálně 2 (maximálně 4, pak by to vyžadovalo příliš mnoho dalších budov a to už je moc pokusů, aby to bez problému vyšlo) a dle počtu pak případně dát do háje veškeré ostatní kulturky na manu. A k tomu si nahrabat ještě nějaké suroviny (hlavně T3).[BR]Velkou výhodou je, že nepotřebuju mít všech 5 druhů budov na max. bonus many."}, {"31": "Podľa najnovších informácií by sa zimná udalosť mala začať 3. decembra."}, {"135": "Jojo [smilie--sprite1] píšou to v informačním popisu k aktualizaci mobilní aplikace, která je už připravená v GP"}, {"48": "No, tak to jsem to odhadl dobře [smilie--sprite1]"}, {"2": "Já si to spočítal jinak a vyšli mi taky pěkná čísla[BR]ten set z dvou budov na manu dá:[BR][BR]v elfech má produkci jako 8 vrb[BR]v dracích jako 11 knihoven[BR]v hobitech jako 8 vinic[BR]v elementálech jako 7 fontán[BR]a amuni jako 16 padlích bratrů[BR][BR]Akurát začínám draky, takže jasná volba"}, {"113": "Tak pokud se nic nezmění a chceš hodně many, tak není potřeba posbírat všechny budovy, ale jen 3 druhy a s toho na manu 4 ks a pak zbytek 2 a 1 kus. Jak to dobře poskládáš, tak budeš mít tolik many že jí můžeš rozdávat :-D"}, {"66": "Kdo ještě neviděl...[BR]"}]