[{"136": "Nazdárek,[BR]jsem nováček co se týká setových budov. Rád bych si postavil něco pro kapitolu \"lesní elfové\" do které jsem nedávno vstoupil.[BR]Pročetl jsem tu co se dalo. A celkem mě zaujala varianta z prvního setu.[BR]Dvakrát Frost Carved Christmas Tree a mezi to dva Market Stalls. Vypadá to celkem kompaktně, a má to dávat hodně many. Problém je, že si nejsem příliš jistý výpočtem. Mohl by mi prosím někdo poradit?[BR]Přikládám schéma:\t\t\t\t\t\t\t\t\t\t\t\t"}, {"16": "@Corwin22 Pro plný bonus many potřebuješ mít stromky spojené se 2 různými budovami. Takže budeš potřebovat ještě jeden typ budovy.[BR]Tady je plný bonus na manu se 2 budovami (minimalistická varianta), jak jsem ho navrhl já:[BR][IMG]https://i.ibb.co/0qQ9GtG/https-cz-forum-elvenar-com-index-php-attachments-var1-png-2773.png[/IMG][BR] l - Ledový vánoční strom (Frost Carved Christmas tree) - mana[BR]k - Sáňkový kolotoč (Sled Carousel) - T3[BR]p - Zimní pouť (Winter Fair) - T2"}, {"2": "potřebuješ pro plný zisk, aby ti budova sousedila se dvěma různými budovami[BR][BR]jde to poskládat i když máš jen dve další různé budovy"}, {"65": "mně vyšlo jako nejvhodnější kombinace a pozice tohle : [BR][BR]1) 2x strom + winter fair + market stalls[BR]2) 2x strom + booth + carousel[BR][BR]v 1) dostanu z těch zbylých budov 2x suroviny[BR]v 2) dostanu 1x suroviny a mince+kladiva[BR][BR]tedy volba 2x suroviny mi připadne lepší. kladiv bych měl pro amuni 30k denně, což ve srovnání hlubinou (150k denně) fakt nic moc (a to se mi hlubina ještě zlepší za 3 upgrady hlavního sídla)[BR][BR][BR][IMG]https://i.ibb.co/4JHGYG3/https-cz-forum-elvenar-com-index-php-attachments-winter-set-1-png-2774.png[/IMG]"}, {"136": "V tom případě, to vidím na variantu 1) co jsem postnul druhý Corwin [BR]Z hlediska pro mě dostupného prostoru, i toho co dává kombinace. [BR]A ještě jednu drobnost. T2 T3 znamená výroba z manufaktur střední a vyšší?[BR]Díky moc lidi"}, {"2": "ano, vzácné a magické zboží"}, {"16": "Tak já mám v plánu vzít klidně i více budov, než tu minimální variantu, co jsem sem dal.[BR]Koneckonců mám v plánu nahradit eventové budovy na manu 2 kapitoly staré, které zabírají 18x10 polí. Takže místo mám i na větší kombinace. Teď záleží jen jak to bude padat."}, {"102": "No na to, že to má zítra začít nám nějak chybí oznámení ne ?  trochu to smrdí tím, jestli to zase neodložili "}, {"40": "Možná jen zaneprázdnění, nemalujme hned INNO na zeď  nebo?"}, {"39": "moribundus dobré "}, {"40": "Taky týden čekám zakleknutej ve startovních blokách ale občas to , těšení , je na tom to nejlepší :-*"}, {"99": "Na anglickém, německém i francouzském fóru už oznámení mají, tak snad se také dočkáme "}, {"5": "Oznamujeme vám, že by zítra mohl teoreticky zimní event s největší pravděpodobností a dalších předpokladů půjde-li vše jak si všichni přejeme zkrátka, pokud se konstalace hvězd sejdou innu i ten zimní event dá se říci začne      [BR]PS.při psaní těchto řádků nedošlo k újmě žádné zvířátko a osoby v textu jsou smyšlené jakoukoliv spojitost s jinou os. vylučujeme"}, {"102": "Nebo to lze také takto [BR][BR]"}, {"16": "Oznámení už je, takže zítra to začne.[BR]Včera odpoledne jsem dokončil hlavní úkoly na betě, tak teď budu klikat na live serverech."}, {"5": "Hlavní ceny pokračují odměnami - budovami v tomto pořadí: stánky na trhu, zimní pout´, sán´kový kolotoč, ledový vánoční strom ...prakticky tedy cenami ze setu, cena á 250 cukroví."}, {"102": "U mě je cena mezi 500-700 bohužel. Ale jinak event už mám, zabralo mi to 3 dny necelé. Jo sorry, ty jsi myslel nahoře... já tak nějak spletl cukroví za ty vložky."}, {"5": "Jojo nahoře za celkově nasbírané to ,,cukroví,,"}, {"44": "něco nového ?"}, {"16": "Zimní event s dvoutýdenním předstihem oproti zdejšímu, do konce roku nic nového nečekej."}]