[{"99": "No já doufám, že by do konce roku mohla přijít Královská rekonstrukce, jak slibovali [smilie--sprite1] Na betě se o ní teď trochu mluví a ne všechno se mi úplně líbí, ale vzhledem k tomu, že má angličtina není zrovna nejlepší, nerada bych vypouštěla nějaké fámy, tak to nechám na zkušenějších [smilie--sprite1]"}, {"102": "Já tomu taky moc nerozumím, ale jestli jako nehodlají ten systém udělat 1 RR za 1 level, tak to se můžou jít bodnout. Pak by se to už jako nevyplatilo, ne že by se to nějak zásadně vyplatilo i teď, furt člověk může za jednu rasu táhnout nahoru cca 8 budov a ne víc, protože prostě více jak 8 plánků za průměrně 2  měsíce na rasu nenahrabe, což vzhledem k počtu budov není zrovna zázrak. Tak snad tam jen melou z hladu na betě."}, {"31": "Niekedy minulý týždeň zmenili popis toho kúzla a teraz tam naozaj stojí \"bude treba 1 kúzlo na 1 políčko budovy\". Rovnako tak menili aj jeho vzhľad, ktorý teraz podľa mňa vyzerá omnoho lepšie a bude jednoduchšie ho na prvý pohľad nájsť medzi ostatnými kúzlami. Ale kľud, verím tomu že plánky budú adekvátne prepočítané."}, {"102": "I tak popravdě mě tohle nepřijde moc šťastné, znamená to, že pokud z turnaje získám jeden plánek, nebo N kouzel, vždy za to můžu jednu celou budovu vylepšit a nebo se klidně může stát, že z jednoho turnaje již tu obytku nepůjde zvednout?[BR][BR]Jestli dojde k tomu, že jednu obytku/dílnu zvednu vždy za jeden turnaj, namítat proti tomu nic moc nejde, ale já přesně nevím jak chtějí řešit ten zisk v turnaji, protože obytka má 1, zatím co dílna má 1.5 koeficient, což znamená, že pokud mi dají kouzla na obytku, tak na dílnu budu potřebovat 1,5 turnaje, pokud mi dají na dílnu, tak na obytku mi stačí 0.75 turnaje. Celkově pokud to takhle vymysleli spíše počítám s tím, že nám to výrazně zhorší, dost pochybuji že získáme třeba plácnu vždy 50 kouzel, dost pochybuji, že jich bude 24.[BR][BR]PS. A to avizovali, že nám \"jedno\" každému dají, no v tomhle ohledu to jedno znamená totální prd. [smilie--sprite8]"}, {"16": "No ať už to bude jak chce, tak předpokládám, podobný poměr (v turnaji) k dnešku - jinak můžou očekávat stejně zuřivou reakci jako na jaře, když změnili hodnoty eventovek a půlka hráčů skončila s kulturou a/nebo lidmi v mínusu."}, {"115": "@Lovec Krys  Jsem názoru že měnit hodnoty již získaných budov z eventu je opravdu velký nefér podvod na hráče nejhrubšího zrna. Nicméně pokud jde o to obyvatelstvo tak částečně vzkazuji hráčům dobře vám tak. Já osobně nechci kombinovanou budovu kultura+lidi. Kdo to takto řeší a chce se spoléhat a opírat o obyvatelstvo tak je jasné že na to časem zaslouženě doplatí i bez změny hodnot takových budov. Ono je to asi jako dlouhodobé používání kombinace sprchový gel+ šampon neboli 2v1. [smilie--sprite1][BR][BR]A jinak tá změna hodnot mohla vzniknout asi stejně jak když si zde na foru pár hráčů rozhoduje o návrhu co většině vyhovuje ... No ovšem většině jen na foru. Co na to ostatní co forum registrují jen občas na event,soutěž?"}, {"102": "Mě napadá ještě jedna věc, oni možná udělají to, že kouzlo RR vloží do každé truhly a celkem za všech 10 člověk získá N který bude odpovídat dejme tomu rozumnému počtu. To by do jisté míry odpovídalo totiž celkovému konceptu VB v turnajích. Ale asi se mi to ani tolik popravdě nelíbí, protože to do jisté míry devalvuje tu desítku.[BR][BR]No a Turunene, nevím zda ti to došlo, ale tady a myslím si, všude můžeš navrhovat co chceš a i když se to s trochou štěstí třeba pošle dál, stejně si s tím podle mě víš co..."}, {"5": "...pravděpodobně existuje určité % hráčů, kteří již dlouhé měsíce možná i roky se svým spolkem otevírají i poslední truhlu, tudíž mají na skladě desítky možná stovku plánků a nemajíc kouzelné budovy, popř. pouze minimum....asi se bojí, aby tito hráči za svou trpělivost byli patřičně odměněni."}, {"102": "Takoví hráči jsou, ale bude jich pár stovek na server. reálně se stane sice to, že tihle hráči najednou skokově skočí dopředu, až to použijí, ale jinak se neděje v podstatě nic, minimálně ne pro mě, protože já na body nehraji, nejsem blbej abych se honil v nějaké žebříčku, který lidi jedou penězi nebo jinými způsoby. Takže mě je to celkem na salámu a je asi jasné, že pokud podělají tyhle lidi, mnohem více na to doplatí lidi jako já, co mají jednotky kusů plánků, protože je dost rozdíl mít z 10 plánků, třeba 2, nebo mít ze 100 plánků třeba 20, zatím co my, já, většina s tím budeme v pr... tak oni co? Nikdo si nedrží ve městě hromadu extra starých budov, resp většina to časem musí vyměnit a tak budou mít třeba jen těch 20 budov na level up, zatím co my, většina, já... vylepšíme dvě budovy a budeme nahraný... je to asi jako dát pokutu malému živnostníkovi nebo velkotovárníkovi, koho z nich to asi více bude bolet [smilie--sprite8]"}, {"66": "Stream na facebooku právě skončil a než nám to iDavis sepíše (za což předem děkuji, dobrá práce), tak jenom pár věcí, co jsem pochytila.[BR]Po dosažení všech tří hlavních odměn v zimním eventu budou následovat budovy ze sady winter market pro ty, co je nestihly v denních odměnách.[BR]Dostávají mnoho žádostí na možnost rozčarování již postavených budov. Prý je to u nich velmi diskutované téma. Zatím nedali konkrétní odpověď.[BR]A měli jste vidět jejich reakci na otázku o královské rekonstrukci. Pět minut nervózního blekotání o tom, jak je to komplexní záležitost (prostě letos to nebude [smilie--sprite8]). Proces a konverze plánků na kouzla bude vysvětlen v oficiálním oznámení."}, {"92": "Prealiena napsal/a:\t\t\tDostávají mnoho žádostí na možnost rozčarování již postavených budov. Prý je to u nich velmi diskutované téma. Zatím nedali konkrétní odpověď.\t\tKlikněte zde pro zvětšení...Já bych byl jednoznačně pro - už mnoho \"horších\" - zejména kulturních - budov jsem vyměnil za \"lepší\", tedy bez užitku zboural. Takhle by mohly být aspoň k něčemu dobré, ale hodně pochybuji, že to u Inno projde..."}, {"31": "Poznámky zo živého vysielania 11.12.2018[BR][BR]Spoiler: PoznámkyBude dostupná Studna přání behom zimnej udalosti?[BR]Priamo k studni sa presne nevyjadrili, ale padla zmienka ohľadne novej budovy Ruské kolo, ktorá umožňuje produkovať rozbité úlomky rún, VB, požehnání déšť mincí alebo příděl zásob.[BR][BR]Prečo existuje limitné množstvo rozšírení za provincie?[BR]\"Timon sa k tomuto už niekoľkokrát vyjadroval takže ja vám dám takú super krátku odpoveď - nemôžeme umožniť rozširovanie do nekonečna, chceme aby tam bola nejaká výzva.\"[BR][BR]Ako je to ohľadne setov v udalosti a ako ich môžeme získať?[BR]\"K dispozícii sú 2 sety, z ktorých jeden môzete postaviť z hlavných a druhý z denných odmien. Set z hlavných odmien vám môže produkovať až 3 VB a poskytovať veľké množstvo kultúry a obyvateľstva, druhý set vám bude produkovať veľké množstvo zboží. Navyše, ak sa vám nepodarí získať niektorú z denných setových odmien, tieto sa nachádzajú ešte aj v hlavných odmenách, hneď po odomknutí prvých troch.\"[BR][BR]Kedy príde ďalšia spriatelená rasa do hry?[BR]\"Už máme novú rasu nejaký čas rozpracovanú, takže.. niekedy v budúcom roku.\"[BR][BR]Budeme mať niekedy systém, ktorý nám umožní jednoducho preorganizovať mesto?[BR]\"Zahrávame sa s touto myšlienkou, pozeráme sa na viacero aspektov využitia takejto funkcie a uvidíme čo bude ďalej.\"[BR][BR]Je možné v hre získavať diamanty?[BR]\"Áno, niekoľkými spôsobmi, produkuje ich Studna přání, pri prechode kapitolami spriatelených rás, dokonca i v niektorých truhlách v remeselnej výrobe.\"[BR][BR]Čo si želáte na Vianoce?[BR]\"Fuu, to je ťažká otázka, ale myslím že svetový mier by bol úžasný.\"[BR][BR]Plánujete umožniť rozčarovať už postavené budovy?[BR]\"Preberáme to veľmi často a kto vie, možno to v budúcnosti bude realizovateľné.\"[BR][BR]Dáte nám kúzlo Královská rekonstrukce na Vianoce?[BR]...smiech... \"Toto je náročné.. nie, na Vianoce to nebude, totižto celá funkcia ohľadne tohto kúzla je viac komplexná, ako sme si pôvodne mysleli, keď sme začali túto funkciu vyvíjať. Dobrá správa ale je, že už sme viacmenej dokončili jej testovanie, dúfame, že čoskoro ju budeme môcť začať testovať na bete. Je to veľmi komplexná funkcia, bude vyžadovať veľa času na testovanie. Taktiež si nemyslíme, že je vhodné takúto funkciu zavádzať pred koncom roka, v predvianočnom období.[BR]Zároveň, pôvodne sme plánovali, že toto kúzlo bude vylepšovať jednu budovu (či už magickú obytnú budovu, magickú dielňu alebo eventovú budovu) za jedno toto kúzlo, ale prehodnotili sme to a myslíme si, že by nebolo vhodné vylepšovať budovu o veľkosti napr. 5x5 rovnakými nákladmi ako budovu 1x1. Preto sme to prerobili a teraz budete používať 1 kúzlo na 1 štvorček jej rozlohy. O tom, ako bude prebiehať premena plánkov za tieto kúzla bude vydané oficiálne oznámenie.\"[BR][BR]Plánujete urobiť nejaké zmeny ohľadne úložiska rozbitých úlomkov rún?[BR]\"Vieme o tomto probléme a rozmýšľame nad možnými riešeniami, mali sme už dokonca niekoľko nápadov ale zatiaľ sme nenašli ten pravý. Budeme o tom ale rozmýšľať.\"[BR][BR]Plánujete zaviesť niečo ako denný prihlasovací bonus?[BR]\"Aktuálne nemáme žiadne plány.\"[BR][BR]Môzeme očakávať nejaké zmeny ohľadne preskakovania úloh v dobrodružstvách spoločenstiev?[BR]\"Máme veľa nápadov, určite plánujeme vykonať zmeny behom nadchádzajúceho roku, chcem zdôrazniť že zjednodušené preklikávanie v mobilnej verzii sme vyvíjali s už nazbieranou spätnou väzbou od hráčov, avšak systém v prehliadačovej verzii je odlišný a nie je ľahké vykonať tieto zmeny. Stále sme nenašli to pravé a perfektné riešenie.\"[BR][BR]Bude dostupné posielanie správ v mobilnej aplikácii?[BR]\"Je to v našich plánoch, ale nemôzem zatiaľ povedať kedy.\"[BR][BR]Plánujete nejak zmeniť znevýhodňovanie pokročilých hráčov, ktorí vyskúmali voliteľné technológie \"Zvětšení velikosti oddílu\" v oblasti turnajov?[BR]... pohľady do zákulisia, či môžu niečo prezradiť... \"Zaoberáme sa tým, našli sme niekoľko možných riešení a teraz rozmýšľame ktoré vybrať, takisto sa venujeme aj ďalším zmenám, ktoré ohľadne turnajov máme v pláne. Môžem povedať, že v turnajových odmenách bude veľa kúziel Královská rekonstrukce.\"[BR][BR]Prídu debny za susedskú výpomoc do mobilnej aplikacie?[BR]\"Áno prídu, ale prihladame aj na ine priority.\"[BR][BR]Všetky tu uvedené poznámky vychádzajú z môjho vlastného prekladu a nemusia na 100% sedieť."}, {"102": "Tak co myslíte? Bude ten konverzní poměr 9,14 stejně jako je dle mého zkoumání poměr herní měny?[BR]Kdy 1 plánek by měl být pokud to chápu správně ekvivalentem 320 diamantů, zatím co jedno kouzlo 35 diamantů. Samozřejmě to neznamená, že to bude odpovídat ale jistou souvislost v tom vidím. Buď by to znamenalo, že by došlo ke zdražení vylepšení kouzelných budov za diamanty, protože v případě, že bude 24 velká, vyžadovalo by to poté 840 diamantů místo 320 jako dnes. To možná není ani buď ale asi určitě, otázka je zda tohle předurčuje i onen konverzní poměr plánků. Co myslíte?[BR][BR][IMG]https://i.ibb.co/b7pcbsJ/https-cz-forum-elvenar-com-index-php-attachments-2018-12-17-214604-png-2807.png[/IMG] [IMG]https://i.ibb.co/7KLF14j/https-cz-forum-elvenar-com-index-php-attachments-2018-12-17-214713-png-2808.png[/IMG]"}, {"99": "Tak je to tady, testování královské rekonstrukce začíná [smilie--sprite1] Jestli jsem to dobře pochopila, kouzlo budeš potřebovat jedno na čtvereček i u obytek a dílen, ale cena za dia by měla zůstat stejná.[BR][BR]Co je důležité je, že 1 plánek = 10 kouzel a v turnaji jich bude možné získat až 11, kdy první se objeví ve 3. truhle.[BR][BR]Snad jsem vše dobře pochopila a nevypouštím do světa bludy [smilie--sprite8]"}, {"102": "za tohle si kouzelnou obytku ani dilnu uz v ramci turnaje nevylepsim, v tom pripade cena za tuning stejna asi nebude.[BR][BR]Odstraněn nevhodný výraz. Embla"}, {"102": "Koukám, ze kritika zde nesmí byt upřímná, odstranit polovinu příspěvku kvůli jednomu předem cenzurovanému slovu které dle mě není ani moc sprosté ale naprosto sedí k tomu co tímto dělají? Slušně prostě nejde napsat to co s námi udělali. Ze jeden turnaj devalvuji na dva turnaje pro necelou jednu dílnu? Já jen doufám že jim tohle dají lidi sežrat, klidně slušně ale pořádně, ode mě už ani korunu za dia, a zvažoval jsem ještě pár kouzelných obytek pořídit, s tímhle fakt ne.[BR][BR]Ale jestli někdo čeká, že reakce na to, že budu 1 dílnu vylepšovat tři turnaje bude \"vhodná\", tak tohle vědět, tak jsem si nedávno ty kouzelné budovy nedokupoval. Protože momentálně při rychlosti, jako hru hraji, protože jsem turnajově aktivní, mi vychází, že na jednu rasu je 6 měsíců.[BR][BR]Pokud budeme počítat, máme to 26 turnajových týdnů, tedy 286 kouzel. Do teď za tohle bylo 26 plánků, za to si člověk mohl udržovat až 26 kouzelných budov. Což znamenalo, že některým lidem stačilo získat plánek každý měsíc a přesto měl dostatek. Nově za tohle půjde vylepšit na konci výzkumu průměrně 11 kouzelných budov, obytek více, dílen méně. Větší hráči jsou opět trestání, zatím co menší hráči mají levnější turnaj, budovy mají také menší a celkově produkce města vs náklady turnajů jsou nižší, tak jím jeden 10. turnaj poskytne prostě pokud půjde o diamantové budovy možná lepší poměr jak doposud plánky a zbude jím na eventovky, zatím co větším hráčům se turnaj zdražuje ale odměny tímto znehodnocují.[BR][BR]Takže se ptám, o co jím jde? Turnaje nám nesmyslně zdražují pomocí velikosti oddílu, když už máme turnaje drahé jak trdelníky na staromáku, tak nám gro celého turnaje devalvují na polovinu s tím že časem, budou ty budovy určitě ještě růst a tím pádem se bude ten konverzní poměr zhoršovat. Jde jím o to aby tuhle hru hráli lidi rok a pak se na to vykašlali, protože už to ztrácí smysl? Asi jo, jinak to nevidím.[BR][BR]A tohle je neslušněji, jak to co udělali jde napsat."}, {"137": "Uvidíme jak to dopadne, ale já jako hráč očekávám že zústane zachován vzorec co turnaj (plánek nebo kouzla) tak vylepšení jedné budovy a rozhodně nejsem sama...[BR]Pokud má být plánek - kouzlo převedeno na políčko, tak u eventových budov v tom nevidím problém, budovy jsou pro všechny kapitoly stejné.[BR]Problém bude spíš v kouzelných budovách tam v každé kapitole je budova jinak velká a může se stát, že ziskem plánku nebo kouzel prostě za jeden turnaj budovu nevylepším.[BR]Pokud by to tak bylo  a nevylepším budovu za turnaj tak ztrácím motivaci do hry.[BR]Další věc mám 5 plánku a vylepším za něj teď 5 budov, po přepočtu vylepším cca 2 budovy, takže snaha marná a určitě nejsem sama kdo se ptá bude nějaká kompenzace?"}, {"1": "ExplorerFfff napsal/a:\t\t\tKoukám, ze kritika zde nesmí byt upřímná\t\tKlikněte zde pro zvětšení...[BR]Kritika může být upřímná, ale měla by být trochu slušná. Jsme rádi i za negativní kritiku a věř, že jí posíláme dál. Ale vše jde napsat slušně a to co jsi psal, rozhodně slušné nebylo. Proto jsem ty slova odstranila."}, {"102": "Chápu pozici moderátora, ovšem prostě tohle slušné slovo nevystihuje a já jsem prostě zvyklý používat obsáhlou češtinu se vším všudy.[BR][BR]A jestli něco budete posílat dál, tak prosím aby udělali minimálně jednu věc. Jestli lze zastropovat cenu za dia na 320, tak v tom případě prosím aby zastropovali počet kouzel na 11. Mě nevadí, že bude kouzlo dražší pro jiné velké eventové budovy, s tím se dá nějak žít je to nová věc a tak jí beru, ale dvoj a časem ztrojnásobit cenu kouzelných budov je přece nepřijatelné."}, {"66": "S tím musím souhlasit. Cena za postavení kouzelných obytných budov/dílen v diamantech je cca od 9. kapitoly konstantní. Bylo by vhodné takto zastropovat i cenu v kouzlech.[BR]+ Cena za vylepšení v diamantech je stejná pro všechny kapitoly, tak by se neměla zdražovat ani v kouzlech.[BR][BR]Jinak musím pochválit, že to beta testování spustily ještě letos. Po tom posledním Q&A to vypadalo dost bezútěšně.[smilie--sprite1][BR][BR]Příspěvky sloučeny. Embla"}]