[{"102": "No ten manager je celkem vtipný, zajímalo by mě jestli by byl stejně spokojený, kdyby mu sebrali jeho managerský plat, spočítali průměr příjmů uklízeček a hlídačů v garážích inno a následně by mu řekli, že co si stěžuje, však průměrně berou lidi tolik a to že je jeho práce managera těžší je přece normální, za to mu dát víc nemusí, musí mu stačit že je manager.[BR][BR]https://beta.forum.elvenar.com/index.php?threads/royal-restoration-spell.11971/page-2#post-67680[BR][BR]Pro ty co neumí EN, tak v kostce řekl, že průměrně má kouzelná budova ve hře 10.85 pixelu, takže na co si stěžujeme, však to je výhodné pro všechny [smilie--sprite8] Dochází mu to, že hodně těch kouzelných budov bude smrdět lidem co s hrou sekli v době, kdy se třeba rozdala zdarma a tím to snižuje ten poměr? [smilie--sprite8]"}, {"16": "Proč INNO musí každého půl roku vymyslet něco, čím hráče kardinálně na... naštve?[BR]To jako ti, co o tom rozhodují to dělají schválně nebo jsou tak (výraz pro podprůměrně inteligentní jedince - snad je to dostatečně korektní)?[BR]A přitom stejně jako na jaře stačí celkem málo - chce to jen trošku přemýšlet a případně číst názory hráčů.[BR][BR]Pár sprostých slov na závěr."}, {"102": "No a aby to tedy nebylo vše, tak ještě poplivali práci vedení turnajových spolků, co si dali práci vybudovat turnajově celistvé spolky za účelem těch plánků, tím, že počínaje 2. truhlou začíná po jednom kouzle, 9. truhla má dvě kouzla a 10. tři kouzla. Fakt mám radost, že půl roku pracně budujeme něco, pro něco exkluzivního a teď tu exkluzivitu z poloviny zhorší a aby to nebylo vše, tak ještě to co bylo doposud odměnou pro ty nejschopnější hráče, rozhodí všem. Přitom podle mě dosáhnout 10. truhel není náročné co se měst týče, ale především disciplínou spolku a tohle je plivnutí do tváře těmto spolkům."}, {"2": "Turnaj není jen plánek v desáté bedně.[BR]Lidi, zas nepřehánějte. Podobný výsledek se dal čekat od chvíle kdy začali řešit že se budou budovy zvedat po čtverečku.[BR]Představte si třeba stav, 20 plánků na jeden turnaj.[BR]Nový hráč by je neměl za co utrácet a když by se za rok až dva dostal na naši úroveň, měl by jich tolik, že by si mohl zvednout cokoli, kamkoli.[BR]Mě přijde naprosto pochopitelné, že o něco takového Inno nestojí.[BR]A co se týče nás chudáčků bitých starých účtů.[BR]Mám pár hlavních odměn ze starých eventů, které jsou stále velmi dobré a díky tomuhle jsou ještě lepší a s trochou dobré vůle si je můžu nechat trvale.[BR]Je ve hvězdách, jestli podobné budovy ještě někdy budou.[BR]A stejně tak exkluzivita plánků je částečně zachována tím, že všech jedenáct získají jen ti, co dotáhnou turnaj až do konce.[BR]V poslední bedně jsou tri."}, {"90": "GorGlin napsal/a:\t\t\tV poslední bedně jsou tri.\t\tKlikněte zde pro zvětšení...Přišlo by mi férovější, aby v posledních bednách jich bylo víc, třeba celkově 15 a schéma 0-0-0-1-1-1-1-2-3-6. Tím by se tolik nedevalvovalo úsilí o dosažení 10 bedny."}, {"66": "Souhlasím, chce to větší motivaci dojet až na tu 10. bednu.[BR]Ve vyšších kapitolách se turnaje neúměrně zdražují růstu produkce a navíc kouzelné obytné budovy/dílny zvětšují, takže je potřeba více kouzel na upgrade. Je to mírně demotivující pro pokročilé hráče, když musí doplnit vyšší ztráty a vyplatit více surovin v turnaji, zatímco začátečníci mají turnaje levnější. Jediné co je brzdí, je počet provincií.[BR]Cituji hráče z beta fóra: SoggyShorts[BR]\t\t\tThe current change gives a FS of players who do 3 provinces to 6 stars 5/11 RR rewards.\t\tKlikněte zde pro zvětšení...\"Za současných podmínek společenství hráčů, kteří vyřeší 3 provincie na 6 hvězd (cca 810 bodů na hráče), získá 5 kouzel z 11.\" To je skoro polovina celkového počtu kouzel.[BR]Trochu jim to ztižte a posuňte královské rekonstrukce do vyšších beden s větším odstupem v 10. bedně, ať je o co hrát.[smilie--sprite1]"}, {"16": "@GorGlin Pokud všechny rekonstrukce sežere vylepšování magických budov/dílen, tak žádné vylepšování eventovek nebude. Vylepšování eventovek je tak pouze pro hráče, kteří ve městě nemají kouzelné budovy/dílny."}, {"72": "ExplorerFfff napsal/a:\t\t\tJde jím o to aby tuhle hru hráli lidi rok a pak se na to vykašlali, protože už to ztrácí smysl?\t\tKlikněte zde pro zvětšení...[BR]Zkus se na to podívat z hlediska producenta téhle i všech podobných her. A zjistíš, že si uhodil hřebíček na hlavičku.. bez jakékoliv ironie [smilie--sprite1][BR][BR]No a v rámci hledání pozitivního, pořád si stěžujete, že nejsou v eventech velké kulturní budovy.. to se patrně změní, nastává doba zvětšovací!"}, {"16": "athlan napsal/a:\t\t\tNo a v rámci hledání pozitivního, pořád si stěžujete, že nejsou v eventech velké kulturní budovy.. to se patrně změní, nastává doba zvětšovací!\t\tKlikněte zde pro zvětšení...Což nám INNO zase vrátí tím, že nám neustále snižuje šanci ty budovy dostat, takže to, že tam budou větší budovy nám bude k ..., když je nezískáme."}, {"99": "Mně vadí hlavně převod stávajících plánků na pouhých 10 kouzel. Argumentují tím, že průměrná velikost budovy je něco málo přes 10 polí. Ale jak již někdo zmínil na betě, lvl 1 by se vůbec neměl počítat, protože rozhodující je lvl, na který vylepšuji, tudíž lvl 1 se to nikdy netýká. Čímž se dostáváme aspoň na číslo 11, ale je to pouze pro obytné budovy elfů, u lidí a u všech dílen je to více!![BR][BR]A co víc... Převod plánků na kouzla se týká pouze těch hráčů, kteří už nějaké plánky mají. Kolik z hráčů v prvních kapitolách už má zásoby plánků? Museli by mít hodně velké štěstí nebo známé, aby se dostali do spolku, který pravidelně uhraje 10 truhel a navíc nepostupovat kapitolami. A že by někomu zbyla kouzelná budova lvl 1 i do vyšších kapitol a zároveň měl ve skladu spoustu plánků je také nesmysl, akorát by mu bez užitku zabírala místo. Takže proč započítávat do převodu i velikosti budov, kterých se to vlastně vůbec netýká??!"}, {"90": "Angedev napsal/a:\t\t\takorát by mu bez užitku zabírala místo\t\tKlikněte zde pro zvětšení...Přesně tak. Dokonce jsem některé kouzelné budovy z kdysi rozdávaných \"startovních balíčků\" zboural protože se mi nechtělo za jejich upgrade dávat diamanty a dosáhnout v malém začínajícím společenství v turnaji na 10. bednu je nesmysl. Ani dnes, kdy je naše společenství již po roce hraní hodně daleko máme 10. bednu jen občas po domluvě předem a spolupráci většiny členů."}, {"102": "@GorGlin Správně jsi napsal, turnaj není jen plánek. Ovšem 10. truhla stojí nejvíce bodů a obsahuje jen jednu runu a 30VB plus plánek. Přijde ti, pokud tedy plánky rozhážeš do všech ostatních truhel a nahoře necháš jen 3 aniž by jsi tedy VB nebo runy přehodil do 10. truhly a tím zachoval exkluzivitu odpovídají těch 8 tisícům bodů?[BR][BR]Já samozřejmě tohle předpověděl už dvě strany dopředu, prostě velký špatný jak by řekla jolanda. Ale já z duše nesnáším politiku rovných žaludků a rozházení plánků od druhé truhly je pro mě prostě extrakt tohoto smýšlení a poplivání lidí, kteří jsou schopni pro 10. truhly obětovat trochu životní pohody, protože hrát turnaje na 6 hvězd většinou nejde bez nějakého zásahu do života.[BR][BR]Chápu, ty jsi na konci a již jsi si asi stihl i vyměnit budovy, já jsem taky na konci a taky teoreticky nebudu mít zásadní problém pokud nezačnou rasy vydávat rychleji, ale já nejsem typ člověka co pokud mu někdo dělá nějaké příkoří, tak sklopí ocas a dělá jak se od něj čeká, já si jdu stoupnout na náměstí a následně k prvním volbám tomu příkoří nějak učinit přítrž. A tady nejde jen o mě, tohle poškodí naprostou většinu snaživých hráčů a tím ničí jejich motivaci snažit se.[BR][BR]Získat 7-8 truhel dokáže i labilní spolek, kde to táhne pár lidí, tzn tihle lidi získají polovinu toho, co bylo a je turnajově vybalancováno právě do desáté truhly.A rozdíl mezi 7 a 10 truhlou je 21 000 bodů.[BR][BR]Mě nevadí 11 plánků kdyby byli v poslední truhle, nevadil by mi ani konverzní poměr 1:10 ovšem jen za předpokladu, že stejně jako diamanty budou u kouzelných budov zastropovány na tom konverzním poměru, klidně ať eventové budovy jsou \"exkluzivní\" bez horního limitu, je to nová funkce a její ceně se nebavím. Ovšem devalvovat turnaje a kouzelné budovy je nehorázný podraz na všechny hráče co s tím zatím nesekly.[BR][BR]Proč oni totiž musí ty kouzla tak devalvovat? No jednoduše proto, že je díky tomu, že je rozdají lidem, co neumí strategicky plánovat turnaje. Je to normální řízená inflace herní \"měny\", taková malá plánková reforma, kdy lidé, kteří si spořili v inventáři předem plánky nejen, že budou biti konverzním poměrem ale následně budou ještě biti tím, že se jejich investici věk od věku znehodnocují rostoucími nároky na prostor kouzelných budov a tím se turnaj bude následně již druhou herní metodikou zhoršovat. A pak se někdo diví, že přítelkyně rezignovala na výzkum a prostě se rozhodla hrát na místě, člověk dál s hrou již nic krom bodů k ničemu nezískává."}, {"116": "Souhlas s tim, ze gro turnaje byla 10 bedna a planek. Tudiz pokud planky rozsypou od nizsich beden, tak se 10 bedna drasticky devalvuje a mela by tam byt nejaka kompenzace. V jake podobe netusim, ale moznosti je urco hodne. A s tim, ze se planky ocitnou v nizsich bednach a profituji z toho mene rozvinute spolky ci hraci problem nemam, spis naopak. Meli by mit moznost byt nejak zvyhodneni a mit sanci nas, co to hrajeme dyl, dohnat. To me nevadi vubec a zadnou krivdu necitim, vitam to. Jen je to udelano tak napul a turnaj a 10 bednu to dost degraduje. Nemluve o tom pomeru konverze kouzel, 2.4 turnaje upgade jedne dilny je docela prisny xD . Me na tedle hre bavi to, ze ti porad neco chybi. Misto, lidi, kultura, surky. Proste porad neco. Jinac bych uz ji davno nehral, bo bych sem chodil jak do prace jen sklizet. Trucovat a zastavit kvuliva tomu vyzkum. No nvm, ale proti gustu ... Stejne bych mohl brecet, jakou maji dinosauri teto hry vyhodu, ze si nakoupili rozsireni v dobach, kdy melo zastropovanou cenu a stalo pakatel. A ja do toho proste nenarvu 30 litru abych ty chybejici rozsireni dokoupil a mohl s nema rovnocene soutezit. Proste to tak je a tito hraci jsou trvale zvyhodneni a beru to jako fakt."}, {"16": "Tak jsem jim tam v příslušném vláknu na betě navrhl pár řešení, jestli si z toho něco vezmou nebo to zase nechají dojít nezměněné na live severy jako na jaře (a pak zase na všech fórech vzniknou 20 stránková vlákna) je už na nich. Zpětnou vazbu od hráčů i návrhy jak ji využít tam mají od více hráčů."}, {"102": "Tak naše demostračky byli vyslyšeny a dojde k navrácení stavu na plánky do doby, než najdou řešení, jak nenasrat tolik hráčů. No a lidi na betě na tom prakticky vydělali, jestli utratili jen pár kouzel, tak dostali zpět více. Tak snad jím dojde že nejlépe bude, když udělají strop u kouzelných budov a všechny kouzla nacpou do posledních dvou truhel a budeme všichni v rámci možností spokojení."}, {"48": "A já bych je pochválil za celkem rychlou reakci na zpětnou vazbu! Trochu jsem se obával, že necouvnou (jako obvykle) a prosadí to v tomto stavu na živé servery i přes protesty. Za mne palec nahoru [smilie--sprite1]"}, {"16": "Taky jsem příjemně překvapen, zejména po jarní zkušenosti jsem nedoufal, že by nás vyslyšeli ještě na betě.[BR]Tak uvidíme, s čím na nás přijdou."}, {"102": "Tak já doufám, že pochopili, že tohle už přehnali, protože se spravedlivostí to nemělo nic společného. A nějaký ty breky Biloutte91, že to bylo dostupné pro ty labilní spolky, to jsem nechápal. Já popravdě nechápu co lidem brání jít do nějakého normálního truhlíkového spolku a nebo jako já takový založit, což je tedy mnohem těžší a proto mě to vytočilo o to více, protože vím kolik práce dalo dát dohromady lidi se stejným cílem.[BR][BR]Každému jsem vždy totiž vysvětloval, že tzv svůj k svému, nemá smysl být ve spolku kde na to polovina kašle, když za stejnou námahu může mít mezi svými, co na to nekašlou násobně více odměn, pěkně vyrovnaně jeden za všechny a všichni za jednoho. A oni přijdou a na míru právě těm vykukům, co v turnaji udělá pár bodů a díky tomu jejich spolek má mizerné truhly dají to, pro co pár set hráčů na jednom serveru jeden den v týdnu vstává dřív nebo chodí spát později. [BR][BR]Furt ještě není vyhráno ale tak nějak doufám, že ten turnaj bude odpovídat tomu úsilí, tzn buď ať nám tedy většinu VB posunou do desítky a nebo ať tam nechají kouzla aby v té hře bylo taky něco, pro co má smysl se snažit na rámec stylu života mouchy snězte si mě. Jestli ty kouzla chci, musím se pro to snažit, buď reformovat svůj spolek nebo jít do toho, kam herně zapadnu."}, {"2": "já si nikdy žádné statistiky nedělal, ikdyž je pravda, že když jsem na začátku hry získal Valloriany a Strategy, byl to masakr.[BR]Ani nemám poteřbu držet plánky jako něco tak vzácného.[BR]Kdyby se celkový počet zvedl na15, vůbec bych se nezlobil a klidně ať ty další 4 přidají do poslední, nebo posledních dvou beden.[BR]Na betě je to první týden, kdo ví jak to bude vypadat za měsíc, ale mám dojem, že turnajová aktivita stoupal.[BR]desátá bedna je příliš náročná a tak to lidi vypoustěli, ted je první kouzlo blízko a každý další krok není tak daleko.[BR]přijde mi, že to je dobře[BR]Souhlasím že počítání průmerů a ty průměrovat není nejštastnější argument.[BR]Slyšel jsem pěkné přirovnání , že průměrem z průměrů získáme prd.[BR]Ale spíš než nadávat jak je to na  a že to po, je 15 KK konkrétní návrh o kterém se dá jednat.[BR]Aktuální zásoby plánků zdaní převodam na x10KK což by je mohlo uspokojit a třeba pozdějšímu navíšení nebudou úplně nepřístupní."}, {"84": "Žádnou změnou ve hře se autoři nikdy nezavděčí všem. Vždy se najdou tací, kteří budou remcat a hledat chyby. To platí i o eventech i dobrodružství. Byly časy, kdy jsem při spuštění dobrodružství nadával, jak je to pro mně nespravedlivé, že za mnohem víc námahy získám mnohem méně než hráč, který je na vyšší úrovni. Dnes jsem pokročil a vidím zase vše trošku jinak. Zrovna tak je to i s plánovanou královskou rekonstrukcí, kdy nad touto změnou mohli zajásat všichni menší hráči, kterým by se jinak nedosažitelný plánek v 10truhle mohl formou kouzel přiblížit a i oni by mohli vylepšovat kouzelné budovy a eventovky.Ale zase se ozvali Ti hráči, kteří jsou na vyšším stupni, že to je pro ně nepřijatelné a devalvuje to desátou truhlu v turnaji.. Jejich kritiku však INNo vyslyšelo..[BR]Já myslím, že posun kouzel i do nižších truhel nebyl tak špatný nápad a turnaje by získali na atraktivitě, přesně jak psal GorGlin. Chápu však rozhořčení hráčů, kteří pravidelně dosahují desítky.. Nicméně Ti však měli a mají jiné výhody, které další již nemohou získat - viz. např. to rozšíření v počátku za dia.[BR]Z mého pohledu se mohl udělat takový kompromis, kdy kouzlo královské rekonstrukce mohlo začít skládat třeba od šesté truhly a končit devátou a v desáté truhle mohl zůstat plánek pro vylepšování kouzelných budov.[BR]Tím by se zachovala její exkluzivita, kouzelné budovy by bylo možné vylepšit stejně jako doposud pouze plánkem a to v poměru jeden turnaj - jedna budova.[BR]Kouzlo královská rekonstrukce by se týkala pouze eventovek a byla by jako nový prvek ve hře podle pravidel, které by určilo INNO, třeba tím počtem kouzel na políčko. Nikdo by si nemohl stěžovat na diskriminaci a bylo by po dohadech..[BR]To jen můj pohled."}]