[{"44": "V turnaji dělám 10 kol ..."}, {"2": "No vidíš, to ti samo hodí pár pěkných a jestli je vás dost tak v sobotu ještě 75"}, {"2": "Nibelion napsal/a:\t\t\tNáš dobrý pomocník \"Elvenarchitect\" už se také připravuje na změnu u prvních dvou divů\t\tKlikněte zde pro zvětšení...[BR]Jak jsi ty tabulky získal, mě se zobrazují všechny divy se starými statistikami?[BR][BR]Tak už jsem na to přišel a musím říct, že jsme zklamán.[BR]Uvidíme co co pustí do světa, ale jeslti to nechají tak, žádné \"efekty zůstanou jen se zvednou\" se nekoná.[BR][BR]Některé bonusy nejsou nijak navázané na fázy hry, některé naopak klesly, nebo se bonus z prvního lvl postupně ztrácí."}, {"27": "Pokud se podíváš na betu, už ted známe, jak se všechny známé divy mají měnit a čeká se na \"feedback\" a názory testovacích subjektů.[BR][BR]Divy dostanou tkz nový kabátek a naprosto všechny budou k užitku a abych to popsal slovy , \"budou růst s hráčem\", éru po éře, výzkum po výzkumu, level za levelem a čím větší tvé město a celé tvé dění v elvenaru bude, tím lepší , větší bonusy hráč dostane z každého divu. Byla odstraněna pouze fixní hodnota některých bonusů.[BR][BR]U většiny divů se bude jeden z bonusů měnit v závislosti na nějakém aspektu města a vetšina ostatních bonusů bude pouze graficky změněna a v podstatě by měla zůstat jak byla do teď.[BR][BR]Za mě jakožto vlastníka všech divů je to krok správným směrem a jsem rád , že jsem vydržel a žádný div neboural, nezbývá než je jenom krmit stovkami VB a těšit se z pěkných bonusů. Za mě rozhodně palec nahoru a konečně se zase něco povedlo."}, {"2": "Nibelion napsal/a:\t\t\tZa mě jakožto vlastníka všech divů je to krok správným směrem a jsem rád\t\tKlikněte zde pro zvětšení...Takhle jsme to také pochopil z březnové Inno TV, ale dosavadní postřehy jsou jiné.[BR]Pěkně to podchytili u peněz, zásob a populace, kde se základem staly kapacity hlavního sídla a lidé pracující v budovch.[BR]I když se ti město nezvětší, tak můžeš přes zvyšování efektivity obytek a následné spotřebě dosáhnout zvýšení efektu u divů co dávají populaci a s rostoucím hlavním sídlem divů co dávají peníze a zásoby.[BR]Nemluvě o tom, že je nová verze nastavena tak, že zisky jdou citelně nahoru.[BR]To se týká prvních tří divu, ale hned u čtvrtého jsem narazil. Jehly měli u posílení střelcu napsáno 106%, to byl opravdu šok.[BR]Z lučištníků bude super jednotka, driádám se nemůže postavit žádný těžkooděnec.[BR]Hodil jsem čísla do tabulky a pochopil, že změnili popis, 106% nebyl bonus jako to bylo zapsáno dosud, ale celkový součet.[BR]Ale původní byl jen 5%, takže pořád zisk.[BR]Ale podpora výcviku klesla z 20% na 15%.[BR]Srovnal jsem tabulky z archutekta a ano, nelze popřít že efekt divu se zvednul, ale bonus pro lučištníky je od druhého lvl stejný a zvedne se až od dvanáctého. Přínos této změny je, že zrušili lvl, které nepřinášeli zlepšení.[BR]Zrychlení výcviku se zvedá proti původní verzi již na lvl 15.[BR]Když zvedneš jehly na lvl 20 získáš 4% na dmg střelců a 5% na rychlost výcviku, ale třetí kruh run, jedenáctý lvl, zádný zisk, jen ztráta.[BR]Nevšiml jsem si že by výpočet nějak zohledňoval kapitou výzkumu.[BR]Na to konto jsem začal srovnávat i další divy.[BR]Horské sídlo dává populaci, ta je řešená stejně jako dosud, takže to je lepší než bylo.[BR]Hned první lvl zvedá produkci o 14% víc než ted, ale bonus klesá a až do 12. vlv a pak zase stoupá.[BR]Každopádně je to pořád zlepšení. Žádný vliv vývoje hry jak slibovali, žádné zlepšví z výzkumu.[BR]Co mi vyrazilo dech byl Trpasličí val.[BR]Když bych si koupil runy a postavil je hned co jsem je vyzkoumal dal by mi 100 jednotek do výcviku a každé tři hodiny 200 šermířek.[BR]V nové podobě je bonus vázaný na velikost výcvikového oddílu 22,5% jak pro bonus na výcvik, tak na generované jednotky.[BR]Jestli jsem si informace z architekta vyložil správně, musel bych mít víc jak 7 zbrojnic abych měl odpovýdající bonus na výcvik a dvojnásobný pro generovavé jednotky.[BR]7 zbrojnic je něco co jsem nikdy u nikoho neviděl.[BR]Ano, efekt zbrojnic mezi kapitolami roste, ale neznám nikoho, kdo by jich měl dost aby se současnému příspěvku přiblížil, natož rovnal, nebo ho překonal.[BR]Takže zase spousta řečí, ale výsledek zcela jiný."}, {"27": "Lidé co byly v malé kapitole s vysokým levelem divu to asi nepotěší, jelikož většinou nemají zmiňované aspekty ve svém městě k výslednému mnohem většímu bonusu, kdežto lidé v 10. kapitole s maximální rozlohou města už ten rozdíl poznají citelně, proto sem psal, že se mi tento nápad zamlouvá. Vše je více propojené a roste to s dobou strávenou ve hře a hráčovým postupem ve hře, množstvým jednotlivých budov atd.[BR][BR]V tomhle směru jsem doufám vývojáře pochopil správně, chtějí nám pomoct a rozhodně tebou zmiňované nedostatky vyváží časem mnohem vyšší bonusy. Dej tomu čas. Budovy jsou takovy End Game téhle hry a vyžadují jistý čas a usilí, na oplátku tě ale s novými změnami odmění. [BR][BR]Nesuď pouze tvůj aktualní stav a změnu ale i to co se stane, když se posunes třeba o dvě úrovně divu nebo poskočíš v kapitole a přibyde ti rožšíření a otevřou se ti nové možnosti vylepšení tvých budov."}, {"2": "Tohle mi budeš muset vysvětlil.[BR]Kde soudím jen svuj aktuální stav?"}, {"27": "Víš co, úplně nejlepší bude si počkat na oficiální čísla a vyjádření k updatům 1.27 a 1.28, které na betě obsahují rebalance Divů. Tenhle topik měl mít hlavně informační ráz o tom co nás čeká za změny, které jsou prozatím v beta testování a tudíž nejsou konečné a čeka se na feedback. Tohle dohadování se nemá smysl. Ano máš pravdu vše je špatně a vše se zničí, tak to NEHRAJ!"}, {"2": "Já napsal že je vše špatně?[BR]Mohl by jsi mi ukázat kde?"}, {"44": "někdo nějaké novinky z bety?"}, {"27": "Nic zásadního, jenom úpravy textu ."}, {"31": "Za spomenutie určite stojí tento obrázok v spoileri. [BR]Spoiler"}, {"27": "Tak ten jsem ještě neviděl, copak to asi bude za rasu? "}, {"29": "No, Timon na každým streamu hudruje, že po něm všichni chtějí jednorožce, tak že by se do nich konečně pustil?"}, {"31": "Blíži sa nová akcia - Menhirok's Duty.  Všetky informácie ktoré o nej získam budem postupne dopĺňat do spoileru nižšie, pre pripravu na akciu.[BR][BR]SpoilerPredpokladaný termín: 8.5. - 21.5.[BR][BR][IMG]https://i.ibb.co/pxw0kSB/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-menhirok-menhirok-ann-header-png.png[/IMG][BR][BR]Obsahovať bude pravdepodobne sadu 19tich úloh.[BR][BR]Spoiler: Úlohy1. Získaj malé množstvo mincí[BR]2. Získaj malé množstvo zásob[BR]3. Vyrob 3x nápoje[BR]4. Získaj 40 kultúry[BR]5. Vyrob 5x jednoduché nástroje[BR]6. Vyrob 1x kúzlo Sila zásob[BR]7. Vylepši 3 budovy na level 4 alebo vyšší[BR]8. Získaj stredné množstvo mincí[BR]9. Získaj stredné množstvo zásob[BR]10. Preskúmaj 1 provinciu ALEBO vylepši 1 budovu na level 10 alebo vyšší[BR]11. Vyrob 30x chlieb + vyrob 10x pokročilé nástroje[BR]12. Vyrob 7x pokročilé nástroje + vyrob 3x košík jedla + získaj veľké množstvo zásob[BR]13. Vyrob 10x chlieb + vyrob 5x košík jedla + vyrob 4x sada nástrojov[BR]14. Vyrob 5x produkt základnej bonusovej manufaktury (3-hodinový) + vyrob 5x produkt základnej bonusovej manufaktury (9-hodinový)[BR]15. Vyrob 4x produkt základnej bonusovej manufaktury (3-hodinový) + vyrob 4x produkt základnej bonusovej manufaktury (9-hodinový) + vyrob 4x produkt základnej bonusovej manufaktury (24-hodinový)[BR]16. Vyrob 3x produkt základnej bonusovej manufaktury (9-hodinový) + vyrob 3x produkt základnej bonusovej manufaktury (24-hodinový)[BR]17. Získaj 14 relikvií[BR]Po dokončení všetkých úloh bude k dispozícii hlavná cena Menhirok's Barrow.[BR][BR][IMG]https://i.ibb.co/HhNKY95/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-menhirok-A-Evt-Menhiroks-Barrow-png.png[/IMG][BR][BR][BR]Aktualizácia 2.5.2017 o 9:00 - pridané ďalšie úlohy"}, {"44": "někdo něco nového"}, {"43": "Tak ta budova z toho nového eventu teda nic moc,4x4 a má 1900 kultury v devítce.To spíš budu mýt co dělat,sehnat místo pro budovy z minulého eventu...=D"}, {"49": "@papap a co populace? To není bonus? Kdyby dávala jen kulturu tak OK, možná je to málo, ale s bonusem do populace se mi to zdá v pořádku, navíc vezmu-li v potaz i velikost budovy, která není nijak závratná.... "}, {"37": "meli by zacit přemýšlet o tom, ze budovy z eventu by měli dávat manu. ono jsou pak hracum ve vyšších kapitolách kapku nanic"}, {"49": "Mana je ale zase na nic hráčům do 9. kapitoly. Takže by museli od 9. kapitoly dávat budovy jiné bonusy. Netvrdím, že to není možné, ale třeba to ještě nikoho kromě tebe nenapadlo. Proč to nezkusíš podat jako návrh na vylepšení? "}]