[{"16": "karhol napsal/a:\t\t\tJá myslím, že posun kouzel i do nižších truhel nebyl tak špatný nápad a turnaje by získali na atraktivitě, přesně jak psal GorGlin. Chápu však rozhořčení hráčů, kteří pravidelně dosahují desítky.. Nicméně Ti však měli a mají jiné výhody, které další již nemohou získat - viz. např. to rozšíření v počátku za dia.\t\tKlikněte zde pro zvětšení...Jen malá poznámka, společenství dávající pravidelně 10 truhel a hráči mající levná prémiová rozšíření jsou 2 různé věci.1600 bodů na člena není zase tak moc, na to všechna prémiová rozšíření nepotřebuješ. Nemálo dnešních 10 truhlových společenství má drtivou převahu hráčů, kteří tyto rozšíření nemají (včetně mě a to dávám pravidelně kolem 3k bodů, v pro mne důležitých turnajích i více)."}, {"102": "Získávat 10. truhlu není náročné pokud spolu lidi táhnou za jeden provaz. Náročné je to jen pro ty, kteří si ve spolku drží mrtvolné hráče pro zcela zbytečné body do žebříčku, si asi myslí že si z nich někdo sedne na zadek a nebo prostě jen turnajové příživníky co se živí na těch chudácích, co to táhnou z posledních sil aby tu 10. právě horko těžko zvládli.[BR][BR]A turnajová aktivita stoupla právě proto, že lidi chtěli plánky, to byla ta motivace. Když se totiž chce, jde to. Proč tedy jít naproti lidem \"kterým se nechce\" ?"}, {"84": "To přirovnání s rozšířením nebylo na místě zrovna při turnaji..[BR]Souhlasím s tím, že 1600b na hráče není tolik, já i několik dalších našich členů to dáváme pravidelně. Náš spolek postupně budujeme a pomalu rosteme. Ze začátku jsme měli problém dosáhnout na třetí truhlu, teď pravidelně šest a jednou za čas dáme tu desátou.Věřím, že postupem času to bude pravidelné. Ale i Ty musíš souhlasit, že do určitého bodu rozvoje je 1600B v turnaji nahrát nereálné a když chceš rozvíjet město je to dost dlouho nemožné, aniž bys to dotoval diamanty.[BR]Vžij se do situace tzv. začínajících hráčů, když zjistí, že ani po půl roce aktivní hry nemá šanci získat plánek, má je to motivovat k větší snaze v turnaji? Naopak demotivuje to a jen rozvíjí město bez větší účasti v turnajích... A kdo s velkých společenství si vezme do týmu začátečníka?[BR]Já si nestěžuju, časem s k té pravidelné desítce jistě dopracujeme, ale dal bych šanci i ostatním.[BR]Ne všichni jsou lemplové, kteří se jen vezou a chtěli by vše za nic.[BR]Vždyť plánek může nadále zůstat exkluzivně plánkem v desáté truhle na vylepšení kouzelných budov a královskou rekonstrukci získat jako nový prvek ve hře i v nižších truhlách. Klidně třeba i v páté truhle, ale tak, aby k vylepšení budovy bylo potřeba pátou truhlu otevřít např. 10x.."}, {"16": "@karhol Nejsme ve sporu. Já nemám problém s tím, když se k plánkům nebo rekonstrukci dostanou i hráči z nižších truhel, jen s tím, že prostým rozprostřením do nižších truhel to tu 10. dost devalvovalo, takže by měla být oceněna větším rozdílem než tak jak byla.[BR]Např. tak, jak jsem navrhl na betě pro zvýšený počet královských rekonstrukcí [BR]([BR]pro 15 by to bylo 3.-8. truhla po 1 jako teď, pro 9. 4(+1), pro 10. 6(+3), [BR]pro 20 by to bylo 3.-6. truhla po 1, 7.-8. truhla 2 (+1), 9. truhla 4(+2) a 10. truhla 8(+5)[BR]Tímto rozložením by byla zachována jak motivace pro 10. truhlu, tak i přístup k vylepšení pro méně výkonné spolky.[BR])."}, {"102": "Chtěl jsem tady napsat obsáhlý příspěvek ale pak si říkám, že to je marné. Takže ve stručnosti.[BR][BR]Kdo začne trochu myslet a hrát tuhle hru strategicky tak zjistí, že do 4 levelu nemá smysl řešit lidem plánky ani eventy, ten průchod je tak rychlý, že se to u vás neohřeje, a od 5 levelu už nahrát 1400-1600 bodu je hračka, jestli někdo odmítá hrát strategickou hru logicky tak je to jen jeho chyba a nemusíme za to trpět přeci my co si umíme tu hru strategicky výhodně.[BR][BR]A jak zde píší, pokud hodí pořádný pytel na konec (3/4 všeho), tak taky nemám problém s tím, že něco dostanou i ti co tu hru klikají jen na záchodě a tak logicky město turnaje neutáhne s jednodenní výrobou surovin. Ovšem ten poměr by musel být výrazně větší, pokud zůstane zachován poměr VB. Poslední tři truhly jsou totiž zhruba 3/4 náročnosti celého turnaje. A hlavně zisk z turnaje musí odpovídat stropu za kouzelnou budovu aby se hodnota turnajů nedevalvovala v čase vývoje hry.[BR][BR]Souhlasit se současným řešením nebo ho nějak vítat může dle mě pouze velmi krátkozraký člověk co si neuvědomuje, že jednou bude ve vyšším levelu i on sám a jestli se turnaje nastaví pro ty s prominutím neschopné se zařadit do správného spolku, tak je jasné že nám těch plánků \"zadarmo\" tolik nedají. Kdyby plánek nebyl v 10. truhle asi těžko by dříve stačil jeden na vylepšení budovy. Právě jeho náročnost získání, která ale pro hráče od 5 levelu ve vyrovnaném spolku je brnkačka a složitost následně tkví pouze v disciplíně nám dopřála tu jeho sílu a výhodnost. Tak si uvědomte, že pokud budete podporovat rozházení pro \"většinu\" co odmítá hrát tu hru pořádně musí logicky přijít inflace hodnoty.[BR][BR]V každém případě by ale mělo zůstat nastavení, že maximální zisk kouzel v jednom turnaji = strop za kouzelný upgrade, jinak si na sebe pleteme bič do budoucna."}, {"5": "...já jen si dovolím poznamenat, že je tady určitá množina hráčů, alespon si to myslím, kteří hrají jen a jen pouze pro zábavu, chodí sem jak jim to zrovna časově vyjde a neřeší nějaké plánky a truhly jedou spontánně někdy více či méně a prostě si to jen užívají budování města či příležitostný chat a podobně....přesto já patřím k těm nejvíce aktivnějším a odměny v truhlách by mohly či měly býti odstupnovány náročností nicméně alespon částečně dostupné i pro malé spolky či méně pokročilé a samo za 10. a klidně i 11.-20 truhlu patřičné ocenění odstupnováno a navýšeno! ....jednotný pohled asi nenajdeme je třeba nějaké kompromisy tak jako v mnohém....  necht´ má Inno klidnou hlavu a štastnou ruku a rozhodne ku uspokojivému řešení aspon z části valné většiny ... hezký večer"}, {"84": "\t\t\tA jak zde píší, pokud hodí pořádný pytel na konec (3/4 všeho), tak taky nemám problém s tím, že něco dostanou i ti co tu hru klikají jen na záchodě a tak logicky město turnaje neutáhne s jednodenní výrobou surovin. Ovšem ten poměr by musel být výrazně větší, pokud zůstane zachován poměr VB. Poslední tři truhly jsou totiž zhruba 3/4 náročnosti celého turnaje. A hlavně zisk z turnaje musí odpovídat stropu za kouzelnou budovu aby se hodnota turnajů nedevalvovala v čase vývoje hry.\t\tKlikněte zde pro zvětšení...S tím souhlasím, toto mi připadá férové."}, {"102": "@ElfNostradamus na tohle ti řeknu jednu věc, kdo potřebuje tyhle kouzla? Ti co jedou hru aktivně a mezi velkými eventy nestíhají průběžně měnit vše, když stihnou dvě tři rasy nebo ti co jedou rasu dlouhé měsíce, mají tolik příležitostí vyměnit vše v několika eventech, že pokud budou mít dostupné upgrady levně, přestanou se možná snažit v eventech a časem se vlastně na hru vyprdnou, protože vše bude vlastně pohodička, když si za ty měsíce na vše ušetří bez toho aby museli \"hrát\"?[BR][BR]Mě se líbí, že si dost lidí myslí, jak je to \"must have\" funkce, ale stejně jako crafting je to věc, která má svůj limit. Kdy člověk vymění během pár craftů ty malé budovy a dál prostě šetří, až bude v další rase muset upgradovat pokud tedy nechce craftovat nesmysli jako urychlovače, nebo kouzla. Což je na jedno použití ale těch scriptů je omezené množství tzn není radno s tím plácat.[BR][BR]Jsem zcela přesvědčen, že drtivá většina \"pomalých\" hráčů tohle nedokáže využít zcela smysluplně, pokud tedy už dnes nekašlou na eventy a drží si stoleté budovy, ovšem chceš říct, že je správné podporovat hráče, co hru prakticky nehrají před hráči, co se ke hře na pár minut přihlásí třeba 5x za den? Je to to samé, jako když na ulici dáš peníze bezdomovci, 95% z nich to otočí za chlast - jsou tohle správně vynaložené peníze?[BR][BR]Chápu že moje pragmatické logické myšlení kterému chybí asi více než malé množství empatie není v tomhle populární, ale já prostě logicky vidím v tom hodit to do nižších truhel pouze škodu pro ty, pro které je tohle kouzlo určitá spása z nebes a jen další zlehčení hry pro ty, co to hrají záchodově.[BR][BR]Dej člověku rybu - nasytíš ho na jeden den; Nauč ho chytat ryby - nasytíš jej na celý život[BR][BR]Oznámení o tom, že bude kouzlo naučilo lidi rybařit, proto prudce dle mě u nás stoupla aktivita v turnajích, dát jim kouzla zdarma povede k tomu, že se část z nich spokojí s rybou na týden."}, {"5": "...určité % lidiček není pragmatické, nejedou dle nějakého strategického plánu, něřeší a nebo vůbec nevědí spoustu dalších věcí zde, ale přesto můj pohled je, že i tito mají a mohou míti byt´malou určitou šanci si ,,čichnout,, k odměně a třeba se jejich strategie změní či nakloní pragmatičtějším směrem ...vše by mělo býti řešeno jako koncept a chápu, že jednostranné řešení sype sůl do rány na jedné či druhé straně...proto nutný určitý kompromis když už něco měnit!"}, {"102": "Já si myslím, že se kouzlo objeví časem v craftingu a určitě i v eventech, dle mě tohle násilné cpaní do turnaje \"pro všechny\" jen dost poškodí ty \"potřebné\". [BR][BR]Ale jo, já to vidím prostě logicky, chápu tvůj argument ale z pohledu inna mi přijde nereálné aby to dokázali dát lidem bez snahy + zachovat sílu turnaje v množství. To by bylo proti celému konceptu, co zde tlačí. Takže já osobně vidím jen dvě možnosti. Buď to bude všechny lidi ve vyšších levelech hodně bolet, časem tedy všechny, protože jednou tam budeme všichni a tudíž je to kopání si vlastního hrobu, nebo nás to bolet nebude ale nebude to \"tak snadno dostupné\". Dle mého názoru jak tu hru sleduji nic mezi tím prostě není a kompromis většinou značí, že je to na prd pro všechny. A nevěřím tomu, že někdy dojde ke zlepšení. Tady funguje setrvačnost jako ve státě, jak se to jednou zavede tak to bude dokud nepřijde reforma. Inno už mnohokrát dokázalo, že hodnota toho co nám dávají odpovídá náročnosti na získání což je v pořádku si myslím a právě to podporuje herní zábavu."}, {"73": "karhol napsal/a:\t\t\tZ mého pohledu se mohl udělat takový kompromis, kdy kouzlo královské rekonstrukce mohlo začít skládat třeba od šesté truhly a končit devátou a v desáté truhle mohl zůstat plánek pro vylepšování kouzelných budov.[BR]Tím by se zachovala její exkluzivita, kouzelné budovy by bylo možné vylepšit stejně jako doposud pouze plánkem a to v poměru jeden turnaj - jedna budova.[BR]Kouzlo královská rekonstrukce by se týkala pouze eventovek a byla by jako nový prvek ve hře podle pravidel, které by určilo INNO, třeba tím počtem kouzel na políčko. Nikdo by si nemohl stěžovat na diskriminaci a bylo by po dohadech..\t\tKlikněte zde pro zvětšení...[BR]Toto mi připadá jako nejrozumnější nápad. I když v takovém případě ty kouzla mohou být už od té druhé truhly.[BR][BR]Nechápu proč chtějí plánky vyměnit za nevýhodnější kouzla, tím opravdu jen všechny naštvou, a popravdě, já už bych se na turnaje vyprdla, nevím, proč bych se měla snažit získat něco, co se mi tak nevyplatí (a to jsme konečně dospěli ve společenstvích k tomu, že plánky získáváme častěji). A když kvůli tomuto klesne aktivita v turnajích (u nás) tak mě to naštve ještě víc (asi bych i uvažovala o ukončení hry nadobro), protože se jak blbá snažím naše společenství posunout nahoru (i v turnajích) a tímto by moje usílí přišlo vniveč."}, {"90": "Tak se nám ta diskuse pěkně rozjela. Těžko vyhovět všem, priority jsou různé.[BR]Přitom by možná stačilo jen tak málo - místo poměru 1:10 dát alespoň 1:15 a místo celkem 11 kouzel v turnaji jich dát 15, s tím, že z těch 4 navíc bude 1 navíc v 9. bedně a 3 navíc v 10. bedně. A od věci by nebylo ani zastropování upgradu kouzelných budov na 15 kouzel (= jako dnešní plánek)."}, {"102": "Tak ale tady nejde o nějaké vyhovění všem. Tady od začátku co hraji jsou plánky v 10. truhle a tak k tomu celý rok přistupuji nebo už dva nevím. Tzn je to to samé, jako kdyby někdo přišel a řekl, že za 0-50 hodin práce měsíčně dostanu nově místo 30 000 Kč rovnou 60 000Kč a za 50-150 hodin měsíčně to bude místo 60 000 Kč nově jen 30 000 Kč, celkem tedy stále dostanu 90 000 Kč, ale je to férové? Není a to ani trochu a o nějaké vyhovění tu nemůže být ani řeč, dokud jsou ty turnaje nastaveny tak jak jsou, tak by v posledních třech truhlách mělo být 75% hodnoty všech 10ti. Tohle není nic jiného, než další daň za úspěch, jako bychom jí neměli dost v životě a já vyloženě nesnáším politiku rovných žaludků."}, {"94": "ExplorerFfff napsal/a:\t\t\tTak ale tady nejde o nějaké vyhovění všem. Tady od začátku co hraji jsou plánky v 10. truhle a tak k tomu celý rok přistupuji nebo už dva nevím. Tzn je to to samé, jako kdyby někdo přišel a řekl, že za 0-50 hodin práce měsíčně dostanu nově místo 30 000 Kč rovnou 60 000Kč a za 50-150 hodin měsíčně to bude místo 60 000 Kč nově jen 30 000 Kč, celkem tedy stále dostanu 90 000 Kč, ale je to férové? Není a to ani trochu a o nějaké vyhovění tu nemůže být ani řeč, dokud jsou ty turnaje nastaveny tak jak jsou, tak by v posledních třech truhlách mělo být 75% hodnoty všech 10ti. Tohle není nic jiného, než další daň za úspěch, jako bychom jí neměli dost v životě a já vyloženě nesnáším politiku rovných žaludků.\t\tKlikněte zde pro zvětšení...[BR]Nic proti, ale ten tvuj promer mi prijde ponekut nepresny, nebo ho nechapu. Ty nadavas na to ze lide, kteri nejsou ve velkych spolecestvich budou moc si prubezne vylepsit magicke budovy? A to jako proc? Protoze tim prijdete o exkluzivitu? O nicem jinem to u tebe neni. [BR]Ano devalvuje to desatou bednu, ale to bude motivovat i mensi spolecenstvi do turnaju. Pri dnesnim stavu mi u mensich a strednich spolecenstvi nejak chybi duvod se snazit. Kuli cemu se vyplati objetovat vojaky a zdroje do turnaje. VB, runy, nebo relikvie? VB a runy (presneji receno jejich ulomky) ziskas v setech a relikvie normane v bojich. Takze co zbyva? Aktualne nic. [BR][BR]Ano pisu to ze sveho pohledu, relativne aktivni hrac v relativne neaktivni ali. Ano mohl bych odejit, ale tato ali mi pomohla kdyz jsem zacinal, takze ji zatim opoustet nehodlam..."}, {"102": "No já už to asi nebudu víc řešit, mě tenhle socík co se zde obhajuje spíše zvedá žluč.[BR][BR]Jestli to projde, tak silně zvažuji exit ze hry, já jsem totiž prakticky z nefunkčního spolku jako původně řadový člen udělal 10. truhlový a jestli přijdou nějaký socani, co budou brát snaživým a dávat těm, co se snažit odmítají, tak to už fakt je lepší se vrátit k OTTD a oželet, že můžu klikat na mobilu.[BR][BR]A jestli nechápeš ten poměr, tak doporučuji si několik turnajů, 6 provincií na 6 hvězd a zapisuj si ztráty a výkupy na každou hvězdu, pak zjistíš, že 6-7 truhel je téměř zdarma bez zásadních ztrát a platíš až za 8-10 co se týče bodů, pak pochopíš o čem mluvím. Získat 10. truhel je jen o tom nemít ve spolku mrtvoly, o ničem jiném to není."}, {"90": "Turnaj chce celkem 40000 bodů tj. 1600 na člena. Na to stačí udělat šest provincií (řádků) na šest hvězd (kol, sloupců) nebo osm provincií na pět hvězd - pokud se někomu nechce řešit timing a hrát i večer nebo brzo ráno. Toto by měl zvládnout spolek i s hráči nepříliš vysoko. To vše platí ale jen pokud se zapojí všichni - je to o spolupráci. Dát dohromady dobrou partu ovšem dá trochu práce, proto si myslím, že si za to zaslouží taková parta rozumnou odměnu v těch posledních bednách turnaje. Přitom to nemusí být nic tak exkluzivního jako nynější plánky, které jinde než v 10. bedně turnaje nejsou, ale nemělo by být zase zcela neadekvátní vynaloženému úsilí jako byl tenhle nepříliš podařený návrh.[BR]Prostě lepší vyváženost - alternativy snad nejlíp napsal Lovec krys na beta fóru."}, {"39": "ExplorerFfff - já osobně se za sebe vůbec již nemusím vyjadřovat. Pročetla jsem všechny příspěvky a musím říci že lépe jak ty bych to nepopsala. Ve všem s tebou souhlasím a naše názory co se týká tohoto tématu jsou úplně stejné. Už teď je problém s  hráči ,kteří se při turnaji jen vezou a shrábnou odměny za ty co se hodně snaží. Ve společenstvích se to řeší různými pravidly apd. ,která jsou dodržována opravdu pečlivě , a jen díky tomu tyto spolky  na tu 10 truhlu dosáhnou . Je to o snaze ,motivaci a teamové práci. A hlavně odměny jsou zasloužené. A pokud mají nastat změny , které Inno zase stejně prosadí ,tak by opravdu bylo idealní ,aby to bylo nastavené tak ,jak jsi navrhoval právě ty ExplorerFfff . To si myslím by bylo dost férové."}, {"16": "Jen malá poznámka. 6. truhla není ani tak o tom klikat brzo ráno/večer, ale hlavně mít možnost to jedno kolo naklikat v práci. Pokud tu možnost nemáte, můžete na 6 * zapomenout. A ti, co dělají na směny mnohdy nestíhají ani tu 5*. I na 4 hvězdy se samozřejmě dá nahrát 1600 bodů. A pokud všech 25 členů ve společenství dá 1000+, je velká šance, že několik prvních dokáže vyvážit ty, kteří dají těch 1000-1600 bodů.[BR][BR]A pro ty, co si myslí, že nemá smysl se v turnaji aspoň trošku snažit, zkuste si někdy našetřit suroviny/armádu a vymlátit/vykoupit druhou stránku turnajových provincií na 2.(spousta VB) a 3. hvězdu (spousta run včetně ještě nevyzkoumaných divů)."}, {"102": "Problém je taky v tom, že spoustu spolků vede někdo, kdo není schopný být velitel ale úplně nesmyslně na tom ten člověk lpí. Proto pak ty spolky mají turnaje polomrtvé. Přitom je to snadné, jsou dva druhy spolků, ty co turnaje jedou a ty co ne. Jestli má někdo polovinu hráčů co turnaje jedou v rámci tisíců a polovinu v rámci stovek či desítek a neřeší to, tak tady potom nesmí ti lidi brečet, že mají vedení na baterky co není schopné složit takový spolek co bude táhnout za jeden provaz.[BR][BR]A jinak my byli taky malý spolek a ještě před tím nefunkční, vůbec to není o bodech hráčů, nejtěžší bylo pro mě získat lidi do spolku, který ještě ty plánky nezískával, když máte jen vizi a nikoliv hotový produkt, protože nás bylo po rozštěpení málo a ve 12 lidech šlo získávat pohodlně jen 6-7 truhlu, což je celkem o ničem. Když hraje turnaje už 25 lidí tak často máme hotovo už v pátek a je to proto, že ve spolku jsme lidi, co si uvědomujeme, že díky turnajům se nám hra zefektivňuje, protože to je klasický investiční perpetuem mobile, ze začátku to dotujete ale jak ty desítky máte týdny a měsíce, tak rostou divy a ty se časem solidně podepíšou na produkci města a tím síle města. Jenže tohle je na tom vedení spolku aby lidem vysvětlilo proč to má smysl se snažit a že se jím to v čase mnohem více vyplatí, protože divy jsou jednorázová investice ale zvyšují produkci trvale a relativně k růstů, je to tedy mnohem lepší věc než eventy.[BR][BR]Jestli nemají spolek plný podnikatelů, kteří umí investovat a tohle chápou přirozeně, tak je to na vedení aby vysvětlilo, že aktivitou v turnajích což ze začátku bude pro někoho možná těžší (špatně složené město většinou), časem získají trvale mnohem více než by získali jakkoliv jinak ve hře a turnaje budou pro ně bezztrátová záležitost."}, {"136": "Nechápu proč se tu pořád do kola omílá, že by měl plánek být v poslední truhle. Tohle tu nikdo nerozporuje.[BR]Je tu jen pár jedinců, a já se mezi ně také počítám, kteří si myslí, že by i spolkům které nedosáhnou na 10. truhlu, mělo být dáno něco málo v truhlách nižších.[BR]Opět; nikdo nerozporuje, že jen sehrané společenství, které vybudovat není žádná legrace, by mělo mít \"něco navíc\" - plánek.[BR]Co přinutí hrát turnaje více? To že bude i níž slušná odměna. Chápu, že si začínající spolek řekne:\"Jediné za co stojí hrát, je v poslední truhle. Na to aktuálně nemáme. Hrajeme jen aby se neřeklo.\" A kdyby to bylo rozházeno v nižších truhlách. Mám na mysli 7-9. Tak si řekne:\"Hele, jsme schopní nahrát tu 7./8./9., sice to trochu zabolí, ale půjdeme do toho\". [BR]Z toho se pak následně odvíjí i vylepšení města hráčů ve spolku, a vzrůstající možnosti při dalších turnajích.[BR]Zdá se mi, že se tu dost lidí zaseklo na status quo, a to ideálně navěky.[BR]PS: Socík jsem netahejme. Zvláště když je použit dost nešikovně.(Trochu mi přijde, že ten kdo se tu s ním ohání, tak nemá úplně představu..) Ono i to srovnání s tím platem za ty hodiny je dost úlet.[BR][BR]Tož tak."}]