[{"102": "Podívej se, mě by nevadilo, pokud by se kouzla rozházela po všech truhlách jen tehdy pokud by se tedy VB následně nacpali do poslední, nebo max posledních dvou. To je to co mě vytáčí, protože já si dost pečlivě počítal co se jak vyplatí abych měl argumenty pro lidi hrát turnaje, protože když někoho přesvědčuji hrát turnaje musím vědět proč a není to jen pro plánek. Plánek je ovšem důvod proč se vyplatilo hrát poslední dvě až tři truhly. Samotné VB totiž za tohle až tolik nestáli pokud jde o body z 6/6, ty se vyplatí jen při režimu 10+/2* ovšem to jede méně lidí, protože je to dražší.[BR][BR]Takže já tady řeším, že momentálně byl turnaj dle mě celkem v pohodě co do ceny/odměny, jako popravdě ano, trochu mě mrzelo, když nám utekla 10 jednou, protože 9 truhla bez 10 smysl proste němá. Já to bral tak, že prostě 8 až 10 je \"jeden milník\". Ale vůbec by mě nenapadlo chtít aby ten plánek dali níže, to by nebylo adekvátní úspoře diamantů a \"přínosu\" kouzelných budov, protože já si prostě spočítal ten turnaj dle beden v rámci 23-25 lidí, protože občas si někdo bere volno a já prostě vím, že 1-6 a během lehkého a středního turnaje i 7 truhla, jsou tyhle truhly prakticky pro smích a mě tedy přijde totálně podrazácké do těhle truhel cpát to, co si zaslouží lidi za tu námahu v posledních, které jsou teprve opravdová výzva.[BR][BR]A myslíš si, že já věřím tomu, že by nějak přeházeli VB aby to srovnali? Pochybuji, tzn proto já jsem zásadně proti tomuhle, protože to přesně odpovídá těm hodinám, spočítej si náklady na turnaj dle bodů průměrného hráče a přijdeš na to, že 3/4 zdrojů průměrně spadá na 8-9-10 a tak přece není možné \"Okrást\" tyhle poslední truhly ve prospěch těch prvních, co jsou zdarma pokud nemáte spolek na baterky.[BR][BR]Já nepopírám, že by nebylo fajn mít ty odměny níže, ale dokud já vím kolik co která truhla průměrně stojí s tímhle musím kategoricky nesouhlasit, protože pochybuji, že na základě toho, že z posledních truhel seberou polovinu jejich hodnoty, tak že následně z prvních seberou polovinu VB třeba. Tomu nevěřím a proto jsem si jistý, že pro nás rozházení do nižších truhel znamená jednoduché zdražení turnajů další metodikou.[BR][BR]Já budu souhlasit jen s tím, co bude odpovídat nákladům na jednotlivé turnajové truhly, jestli budou zvýhodněny truhly \"zdarma\" před těma za \"ztráty\" tak to je snad každému jasné, že to je nesmysl tak proč to někdo podporuje nechápu, pokud to tedy není někdo kdo sám chce bez práce koláče.[BR][BR]Spolek má 25 lidí, jestli někdo není schopný přijmout další tak je to naše chyba a my máme mít dražší turnaje abych oni měli kouzla? Ne je to jejich chyba.[BR][BR]Spolek má polovinu lidí co turnaje nahraje, je to naše vina, že nedosáhnout na 10? Ne, je to vina jich, že neumí motivovat a nebo se rozdělit do turnajového a ne-turnajového spolku, vykecávat spolu můžou na facebooku. Snaživý hráči nesmí být přece trestání za snahu zvýšením náročnosti na úkor těch co se neumí minimálně domluvit.[BR][BR]A jestli mi řekneš, že lidi postupně turnajují malé truhly až se vypracují, tak ano, my jsme taky ze začátku získávali jen nízké truhly ovšem tohle je normální, proč sakra musí lidi chtít všechno hned a nic pro to pořádně neudělat? První investuji a pak sklízím! Klidně bych se vsadil, že jestli budou kouzla, polovina v truhlách do 7, tak turnajová aktivita ve spoustě spolků klesne a pochybuji, že by to někoho motivovalo jít dál. Motivovat to bude pouze lidi co nemají kouzelné budovy a z toho pohledu bude těžké spočítat zda došlo k poklesu. Je to to samé jako ekonomika státu, v reálu jsme totálně v zadeli, protože nás ten parazit zadlužuje a rozpouští rezervy v době progrese ale právě díky tomu, že MF vypouští zkreslené statistiky a roste ekonomika se zdá, že se máme líp, i když reálně inflace prudce vyrostla a to znamená, že většina lidí se má právě hůře jen si to neumí spočítat. Stejně to samé se stane s turnaji, ano na první pohled se bude zdát, že se máme líp, najedou spousta lídí dosáhne na ty kouzla ale za cenu, že se prakticky sebere adekvátní odměna za nadprůměrnou snahu. Což se dá například v praxi vysvětlit, že sleva na poplatníka na dani se už snad 10 let nezměnila a proto všichni, co vydělávají více - více se snaží, či snažili ve škole mají tím pádem větší zdanění než dřív ale tohle prostě lidi na první pohled nevidí a to samé se stane s těmi turnaji.[BR][BR]Nevěřím ani tomu že by nám plánky zůstali pospolu s kouzly, jsem vývojář, takže je chápu trochu smysl toho co dělají a jak. Tzn jediné o čem se dle mě bavíme je KAM umístit kouzla a kolik jich tam umístit. Plus správně zastropovat kouzelné budovy, protože jinak je to s postupujícím věkem silně likvidační.[BR][BR]A sorry, za ten sloh no, já jak se dám do psaní o věcech, co mě nějak štvou, tak mi to jde samo. Pokusím se k tomuto tématu už nějak radši nevyjadřovat, protože mám pocit že moje ekonomicko-pragmatické myšlení zde není tak úplně \"doma\"."}, {"3": "proboha nechme už toho. Ty politickoekonomické rozbory jsou opravdu vysoce zjednodušené a pokřivené, až z toho bolí oči. Ano, všichni už jsme pochopili tvé politické smýšlení i absolutní absenci tolerance názoru ostatních (přesvědčenost o vlastní pravdě a touha zabít všechny s opačným názorem - to je dneska moderní).[BR][BR]jinak, každý normálně smýšlející chápe, že odměny (nejen) z turnaje musí být přímo úměrné snaze."}, {"138": "Teda nedá mi to,ale musím se ozvat k téhle diskuzi.[BR]Hraji mnoho her.Jednu jsem hrál několik let.Je tam hromada hráčů a je dost známá a hráči hraná. Udělali tam jednu věc. Začali nastavovat hru podle první topky hráčů a výsledek byl,že 3/4 hráčů to přestalo hrát,když odměny z eventů byly dosažitelné pouze pro topku. Takže milý chlapče, nerad,ale musím tě s tvými požadavky poslat do háje zeleného(musím být slušný,v reálu bych tě s chutí poslal do konce trávícího ústrojí a myslím,že si to zasloužíš). Přestaň laskavě nastavovat hru pro sebe a svoje kamarády.Já a další si chceme taky zahrát. Plánky budou i z menších beden a nejen pro topku. Jestli to tak provozovatel hry neudělá,tak ty kecy kolem upgradů budov jsou pro drtivou většinu hráčů k ničemu,protože se k tomu nedokáží propracovat.[BR]Nazdar."}, {"102": "Nechtěl jsem reagoval na téma, ovšem na případné osobní příspěvky reagovat musím. Pokaždé, když zde někdo zastává názor poškodit snaživé, tak se kouknu na jeho výsledky a jsou zde dva typy oponentů, ti co honí body a pro ty ani tak není podstatné kolik stojí 10. truhla oproti těm dalším, proto tohle neřeší (nejedou na nějakou efektivitu a klid), tzn u nich chápu, že jím to žíly netrhá a prakticky pro ně je vítané, že by se turnaje aktivitou snížili na 7-8 truhel, protože by ubyla konkurence na žebříček a pak ti, co to hrát prostě neumí buď sami nebo jako spolek a vymlouvají se na to, jak to je nemožné místo aby to zkusili. Ty patříš do druhé skupiny a rozbor, proč si to myslím asi ani netřeba, stačí se mrknout do města a historii. A ten váš spolek? 5 neaktivních lidí a turnaj jede ani ne půlka a někteří sotva pár desítek bodů? S tímhle si děláte ambice na plánky a kouzla? Nechcete třeba rovnou aby všechny odměny byli jen v první truhle? To by bylo fajn, však nehoře jsou jen TOP hráči, co si to nezaslouží...[BR][BR]A jeden detail, proč to hraješ, když do teď byli plánky v poslední truhle? Neměl jsi tedy už skončit? Však to bylo nastaveno jen pro 500-700 lidí na CZ1? To je přece strašně nefér ne? Uvědom si, že 10. truhel NEDOSAHUJI TOP hráči, TOP hráči si až na vyjímky syslí body a chlácholí se na žebříčku, drtivá většina lidí co jede aktivně turnaje jsou na podobné úrovni jak ty, jen u té hry více přemýšlí. Hru nijak nenastavuji, naopak jsem jen proti její změně k horšímu.[BR][BR]A provozovatel neudělá nic co zde píši já nebo ty, oni to udělají vždy tak aby to vydělávalo peníze. Ovšem já zde bráním pouze svůj názor a tak nějak trochu doufám, že zpětná vazba funguje v minimální míře, ale fakt si nedělám iluzi, že to bude tak jak si řekneme. Ale pokud něco není v pořádku, tak nemlčím. U nás naopak dost lidí zvažuje skončit pokud by došlo k nějakému zásadnímu perzekvování za snahu. Já jako velitel musím logicky bránit zájmy spolku. Turnaje jsou pro spolky, to prosím pochop a jestli nejste schopní složit funkční spolek, tak to přece není chyba naše ani hry. Jen vaše jako lidí.[BR][BR]Spolek = 25 aktivních hráčů z pohledu nastavení hry. Není to 5 aktivních, 7, 15 ale 25 a tomu je turnaj nastaven."}, {"90": "Moje stanovisko je jednoduché:[BR]1. Jsem pro to, aby bylo možné vylepšovat i eventové budovy, proto vítám změnu plánků na kouzlo RR (Royal Restoration). BTW. Kouzelné budovy nekupuju a tak jsou mi plánky víte k čemu...[BR]2. Chápu, že by bylo nefér vylepšovat za stejnou cenu malé i velké budovy, proto rozumím tomu, že místo 1 plánku bude několik RR. Poměr by měl být ovšem stanoven tak, aby nebyl brutálním znevýhodněním proti současnému stavu.[BR]3. Dokončení turnaje by mělo být dostatečné pro upgrade i kouzelných budov, např. zastropováním ceny jejich upgradu počtem RR v turnaji.[BR]4. Jsem pro to, aby kouzlo RR bylo v MALÉM množství už i v nižších bednách turnaje (třeba od 5..-6. bedny), nejen v desáté, aby přispělo k bylo motivací turnaje hrát.[BR]5. Jsem pro to, aby většina RR byla ale až v 9 a hlavně 10. bedně, aby to byla motivace pro úsilí k jejich dosažení a organizaci spolku.[BR]A proto bych považoval za spravedlivé a pro mne akceptovatelné schéma 15 RR rozdělených jako 0-0-0-0-1-1-1-2-3-7."}, {"125": "Já tam vidim obvyklej problém v Elvenaru, a tou je tvrdá PW plus neuvěřitelnej skrblismus. Kterej dělá třeba z DS nikoli honbu za senzační odměnou, ale akci typu \"my to dokážeme\". Což se ještě nagradovalo řemeslnou výrobou, kde jde vyrobit mnohdy lepší baráci, než jaký jde získat v evntech nedo DS.[BR]Třeba u toho turnaje tam vidím dobrou akci pro majitele modrobaráků, kdežto pro mne jako majitele jedný modrý chajdy jsou vlajky celkem putna, teď co s nima nejde jít mávátkovat do průvodu."}, {"2": "Já v řemeslné výrobě nepotkal barák, který už tu nebyl v nějakém eventu a podobně[BR][BR]Můžeš být konkrétní?"}, {"125": "Příklad: Třeba hned první barák nynějšího eventu ( s (u mne) 800 kultury. V řemeslný třeba fialovej plamen s 840.[BR]To, že se v tom ocitly baráky z eventů a DS mi přijde spíš nešťastný.[BR]Jinak ale třeba ta těžírna na elixíry (u mne) z tohodle eventu nemá vadu. Teda pokud to člověku napadá, pochopitelně."}, {"139": "Ahoj,[BR]jak je to s tou novou narodnosti, vi se kdy bude mozne si za ni zahrat?[BR]co je treba aby clovek mohl zkusit hrat na bete? je nova narodnost uz na bete?[BR][BR]Dekuji"}, {"116": "Nova NARODNOST  [smilie--sprite1]  zatim nejni. Ale dle toho, ze se uz objevuji ikonky na trzisti, tak se qapem blizi[BR][BR]Odstraněna citace. Embla"}, {"16": "@BaluWizova Nová spřátelená rasa(osadníci). Bude nejspíše v únoru tipuji (+-, přesně to ví jen Elvenar tým).[BR]Na betě je možné hrát jednoduše:[BR]zz1.elvenar.com a stejný postup jako na ostatních serverech."}, {"2": "Jarsa napsal/a:\t\t\tPříklad: Třeba hned první barák nynějšího eventu ( s (u mne) 800 kultury. V řemeslný třeba fialovej plamen s 840.\t\tKlikněte zde pro zvětšení...[BR]Ano, jsou tu různé budovy, stejné velikosti a různého přínosu.[BR]Třeba Otcové pralesa, jsou 4 pokud vím a každý dává jinak.[BR]Takže už v řemeslné výrobě nemůžu získat výhodnější budovy než v eventu, ale je špatně že jsou tam budovy z eventů?"}, {"125": "GorGlin No, bere jim to onu jedinečnost, že byly z eventu nebo DS a jinak prdlajs. [BR]Z druhý strany zas řemeslná vyřešila muj problém s haldou nepostavitelnejch budov v inventáři.[BR]Já nevím, jestli Ty nemůžeš získat z ŘS výhodnější budovy, já teda můžu, třeba dnešní paroháč je příkladem, má půlku co jednorožec z řemeslný."}, {"2": "Jarsa napsal/a:\t\t\tJá nevím, jestli Ty nemůžeš získat z ŘS výhodnější budovy, já teda můžu, třeba dnešní paroháč je příkladem, má půlku co jednorožec z řemeslný.\t\tKlikněte zde pro zvětšení...[BR]Já jsem zatím v nabídce měl jen budovy které už jsem potkal i v eventech.[BR]A dávali stejně, nebo jsem si rozdílů nevšiml.[BR]Je pravda, že Rudolf je z dvoučtverečkových kulturek ten slabší, ale věřím, že když ho potkám v řemeslné výrobě tak bude mít stejná čísla jako v eventu.[BR]Půlka to u mě tedy rozhodně není, jestli to máš tak, obrátil bych se na podporu."}, {"99": "Exkluzivní pro crafting by měly být vojenské budovy, tedy jedinečné vylepšení jednotek, osvícená střelnice, velký magický násobitel a myslím, že i výrobny valoriánů a orků stratégů, tyhle budovy už by nemělo být možné v eventech získat..."}, {"2": "Když to tady tak čtu, jak by pro vás byla přijatelná varianta, že turnaj zůstane přesně takový jaký je ted, plánek se změní v kouzlo královská rekonstrukce a bude věc hráče, jestli ho použije na budovu o dvou nebo třiceti polích?"}, {"102": "S touhle variantou jsem předem počítal, malých budov jsem se zbavil / vyměnil a nechal si velké. Tzn problém bych s tím neměl, ale samozřejmě varianta strop na kouzelné + dílky na eventové je výhodnější pro menší a střední budovy. Ale ty já z městě stejně snažím vyhazovat, protože jejich motivace je na prd, tzn z celkového pohledu by fakt mohla být výhledově výhodnější tahle varianta 1 kouzlo, jeden level."}, {"16": "@GorGlin Pro mne osobně by to problém nebyl. Sebralo by to ale možnost vylepšování pro ty, co 10. truhlu nedávají (a kterou při prvním testu na betě dostali)."}, {"2": "To je pravda, to ce se ted děje v cechu na betě mě dost zklamalo.[BR]Ale pokud budeš získávat řekněme tři až čtyři kouzla za týden, tak to bereš jako možnost?"}, {"16": "@GorGlin Pro mne je přijatelná jakákoliv možnost, která[BR] - Mi umožní to, co teď, tedy vylepšit jednu kouzelnou budovu týdně (nejlépe zastropováním ceny, když to zastropování bude platit jak pro kouzelné budovy, tak i pro eventové budovy, vadit mi to rozhodně nebude)[BR]- Nedegraduje 10. bednu (v nižších bednách ať jsou klidně taky královské rekonstukce, ale v nejvyšších bednách by jich mělo být výrazně více)[BR]- Zároveň by měla být zachována možnost získat KR i z nižších beden."}]