[{"140": "Mě prijde jako fajn kompromis dat kouzla do treba od treti truhly, ale pak 5., 7. Od 7. Truhly uz do kazde dalsi... ta usetrena kouzla ze 4. a 6. Truhly dat do te desate... [BR][BR]Tim by se aspon relativne vratila hodnota 10.bedny, ale zároveň by i jiní měli moznost aspoň maličko ochutnat, co to znamená úspěch.[BR][BR]Jen pro pořádek, reaguji na rozdělení kouzel do nižších beden. Osobně jsem vcelku smirena, že planek je pouze v 10.bedynce a věřím, že i my tam brzo dojdeme... ale pravdou je, ze pokud se kouzla daji i do nizsich, pak ten chtic, dojit az na ,,konec,, uz nebude takový [smilie--sprite1] a pujde jen o to, abychom si svorne rekli ,,dokazali jsme to,,."}, {"19": "Už pár dní sleduju diskuzi o KR. Někdo se snaží uhájit exkluzivitu 10. truhly, někdo by je klidně rozdělil do všech ( vážně by pro vás silné spolky byl tak velký problém, kdyby si ty míň aktivní měli možnost nastřádat ekvivalent 1 plánku cca za 3 měsíce?).[BR][BR]Překvapuje mě, že nikdo nezmínil druhou a podstatnější stránku věci. Prvním krokem  k uvední KR bylo přepočítání eventových budov VŠECH hráčů. Podle reakcí na fóru šlo většinou o jejich degradaci. [BR][BR]S toho mi vyplývá, že přístup ke KR by měli mít ve stejné míře VŠICHNI hráči. Od začátku to nebyla věc, která by se týkala pouze spolků, tak jí z toho nedělejme."}, {"102": "Přístup k RR respektive plánkům mají ve stejné míře všichni, všichni můžou založit spolek o 25 lidech a tak mít 10 truhlu při situaci, kdy nahrají 1600 bodů vcelku bez větších obtíží, kdyby jsi byl ty v normálním spolku a nikoliv v mrtvém, tak se svým průměrem 1725 bodů, máš 10 truhlu naprosto s přehledem ale to jak je vidět některým lidem nejde vysvětlit, že si za to můžete sami, že to nemáte.[BR][BR]Pokud nevíš, že to tam u vás chcíplo, mrkni sem https://www.elvenstats.com/fellowship/cz2/9312[BR][BR]Lidi uvědomte si už konečně, že turnaje jsou pro spolky, nastavení náročnosti turnajů je právě na míru 25 lidem, v 25 je to hračka. Dá se to zvládat i v 20 lidech. Ale jestli někdo není schopný složit 25 lidí a nebo vlézt někam, kde to funguje tak by tady vůbec neměl diskutovat o něčem, co je nastaveno jako odměna pro 25 lidí."}, {"65": "@Radvanus : společenství mrtvol se zachránit dá, ale pokud máte mrtvého velitele, uteč a neohlížej se [smilie--sprite1]"}, {"102": "Jinak na betě jsou odložené turnaje na dva týdny, takže evidentně buď chystají něco co by je ovlivnilo a nebo chtějí pustit DS a zjistit, kolik lidí to bude hrát, když nebude turnaj, protože dost lidí tomu dává přednost. Nebo dojde k přepracování turnajů, možná jejich odměn či náročnosti? Stalo se už někdy, že byli turnaje odložené? To je asi otázka na ty co to hrají déle a aktivně na betě. Já tam lezu jen pro info o eventech [smilie--sprite8]"}, {"141": "Dovolím si, promiňte, jen hloupou poznámku: Je mi naprosto jedno, jakým poměrem bude přepočítáno cokoli na jinékoli. Nepovažuji vývojáře INNO za protivníky, jsa starým blbem, by mi to připadlo nevysvětlitelné. Naopak jim děkuji, že si po práci mohu něco postavit, vylepšit...  a zkusit zpomalit alzheimera při mém oblíbeném přestavování města [smilie--sprite8] A možná nejsem sám. Děkuji za pochopení."}, {"119": "@ExplorerFfff Tak to by mne taky zajimalo, proc 2 tydny nebude turnaj....Ale zas kdyby bylo DS, tak je to skoda, protoze veskere relikvie a kouzla jsi mohl diky práve turnajum snadno ziskat pro DS [smilie--sprite1]"}, {"57": "tupecpolni napsal/a:\t\t\tDovolím si, promiňte, jen hloupou poznámku: Je mi naprosto jedno, jakým poměrem bude přepočítáno cokoli na jinékoli. Nepovažuji vývojáře INNO za protivníky, jsa starým blbem, by mi to připadlo nevysvětlitelné. Naopak jim děkuji, že si po práci mohu něco postavit, vylepšit...  a zkusit zpomalit alzheimera při mém oblíbeném přestavování města [smilie--sprite8] A možná nejsem sám. Děkuji za pochopení.\t\tKlikněte zde pro zvětšení...[BR][smilie--sprite1][smilie--sprite1][smilie--sprite1][smilie--sprite2][smilie--sprite8]"}, {"99": "Anglické názvy T6 surovin (z fóra bety, tak snad správné [smilie--sprite8]):[BR]silly soapalloy shroomscosmic bismuthTak na jakou rasu to vidíte? [smilie--sprite1]"}, {"102": "Dle toho prvního asi Zátiší Bikin[BR][BR][BR][BR]A v češtině to bude[BR][BR]Vtipné mýdlo, Slévané houbičky, Kosmický bismut (manufaktura se bude jmenovat \"pukající drahokamy\")"}, {"31": "Ja už ani nepočítam koľkokrát im tam ušli tieto suroviny.. [smilie--sprite11]"}, {"142": "jestlipak se dozvíme, jak to je s tím odložením turnajů? kterých se to týká a proč? [smilie--sprite12][smilie--sprite12][smilie--sprite12]"}, {"31": "@janie26 avizované odloženie turnaju sa týka iba beta serveru, nie je teda dôvod (aspoň zatiaľ) na obavy. [smilie--sprite2] Pokiaľ by sa to malo týkať v budúcnosti aj nášho serveru, určite sa o tom dozvieme viac z oficiálnych zdrojov."}, {"31": "Na obzore nová funkcia.. [smilie--sprite1][BR]Výzvy[BR][BR]Spoiler: Výzvy[IMG]https://i.ibb.co/kGNMLKX/https-image-ibb-co-m-Caevf-EL-sneak-peek-19-10-2018-png.png[/IMG][IMG]https://i.ibb.co/kGNMLKX/https-image-ibb-co-m-Caevf-EL-sneak-peek-19-10-2018-png.png[/IMG][IMG]https://i.ibb.co/kGNMLKX/https-image-ibb-co-m-Caevf-EL-sneak-peek-19-10-2018-png.png[/IMG][BR]Výzvy budú predstavovať nový typ akcií, s ktorým sa budeme v hre pravidelne stretávať. Bude existovať viacero variácií týchto výziev, s obmenenými požiadavkami a odmenami.[BR][BR]Cieľom týchto výziev bude plniť určité úlohy, pre zisk medailí[IMG]https://i.ibb.co/kGNMLKX/https-image-ibb-co-m-Caevf-EL-sneak-peek-19-10-2018-png.png[/IMG]. Za dosiahnutie určitých miľníkov dostaneme príslušné odmeny.[BR][BR][IMG]https://i.ibb.co/qJDQ35b/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-challenges-cratsman-mainscreen-png.jpg[/IMG][BR]Na tomto obrázku je vidieť jednotlivé požiadavky pre získavanie medailí. Tie sa základne delia do 2 kategórií - produkcia a kúzla. Za výrobu jednotlivých produktov z dielní ako aj za použitie jednotlivých kúziel budeme dostávať príslušné množstvo medailí.[BR][BR]Táto novinka je súčasťou bety, zatiaľ nie je známe kedy sa objaví na našom serveri."}, {"99": "@iDavis : Nevíš, co je v těch prvních 4 menších odměnách? [smilie--sprite1] Předpokládám, že budou pokaždé jiné, ale zajímalo by mě, co je tam tentokrát, aspoň pro představu, co se tak dá očekávat [smilie--sprite1]"}, {"31": "@Angedev v tejto výzve to vyzerá nasledovne:[BR][BR]1. 500x úlomky kouzel[BR]2. 1x spojovací činidlo[BR]3. 1000x úlomky kouzel[BR]4. 3x spojovací činidlo[BR]5. 1x Rozvážková knihovna"}, {"99": "Super, moc děkuji [smilie--sprite1] Vypadá to zajímavě [smilie--sprite1]"}, {"109": "Ty výzvy vypadají zajímavě.Má to být snad náhrada za DS?"}, {"116": "Muzes definovat ulomky kouzel pls ?"}, {"99": "@kalicz : to budou ty žluté nesmysly pro crafting z rozčarovaných budov bych řekla..."}]