[{"102": "No já jen doufám, že to nebude znamenat, že vždy přijdeme o jeden turnaj. Protože tuhle výzvu zfouknu mezi rasou na pohodu za jeden den a jako mít za ní jen 100VB na sto dní třeba, je bída, když z turnaje mám skoro 200VB na týden, plánek a hromadu dalšího.[BR][BR]Pokud to bude navíc tak super, parádní způsob jak sehnat scripty, ale jak přijdeme o turnaj tak jako WTF?"}, {"116": "Angedev napsal/a:@kalicz : to budou ty žluté nesmysly pro crafting z rozčarovaných budov bych řekla...\t\tKlikněte zde pro zvětšení...[BR] jasny diky"}, {"99": "@ExplorerFfff : Tentokrát na to dali 3 dny, byla by to zajímavá výplň mezi turnaji, vyšlo by to akorát  Také doufám, že nám turnaje nevezmou..."}, {"31": "Dal som už na túto vec pripomienku, uvidíme ako sa prípadne vyjadria. Ja sa ale snažím veriť tomu, že to ako doplnok k turnajom bude, čo mi zároveň podkladá fakt, že sa to technicky podobá na akcie a dobrodružstvá, ktoré sa bežne s turnajmi kombinujú."}, {"72": "turnaj je na 5dní, tohle na dva, to je celkem týden.. mohlo by se to doplňovat xD"}, {"31": "Tak už máme oficiálne vyjadrenie od Marindora:[BR][BR]\"Výzvy nie sú mienené byť náhradou za turnaje. Už čoskoro budú bežať súčasne.\""}, {"72": "Ne tak zhurta, na betě se to současně pustit zatím nepovedlo, když včera zkoušeli turnaj zapnout, tak mě to vyhazovalo ze hry. Navíc jsou s tím spojené chyby s připojením setu, takže v klidu, nejdříve doladit."}, {"31": "Sneak Peek: Lidé a elfové #1[BR][BR]Spoiler: Sneak PeekNa počátku Elvenaru kdysi dávno,[BR]jen o dvoch rasách bylo známo.[BR]Lidmi a elfy se celý příběh začal,[BR]s mnoha návštěvníky se v městech setkal.[BR][BR][IMG]https://i.ibb.co/PY6fP9P/https-i-ibb-co-6-D6zn-GH-EL-sneak-peek-4-1-2019-1-png.png[/IMG][IMG]https://i.ibb.co/Tbm6wQK/https-i-ibb-co-L5k-BRyt-EL-sneak-peek-4-1-2019-2-png.png[/IMG][BR][BR]>>>​"}, {"66": "Tak jako dorazili příběh o tom, jak Amuni zlikvidovali Elvenar a začínají nanovo?"}, {"40": "přichází Sauron, skřeti .."}, {"5": "naši Hobitci ho srazí na kolena "}, {"2": "Sebedestruktivní rasa, kterou jsme přivedli na pravou cestu byli už Amuni.[BR]Ale je pravda, že ten člověk má jen jedno oko a elfka taky nevypadá zdravě.[BR]Žeby nás naše vlastní chování přivedlo k apokalipse?[BR]Doufám že ne, pořád nemám šest jednotek na třech hvězdách.[BR]Umělé oko toho chlapíka mi asociuje již dávnou diskusi, že nás čekají roboti."}, {"40": "Mě bez toho oka připadá jako Alastor Moody (bystrozor z Harry Potter)zamlada."}, {"72": "Fakt to evokuje nějakej cyberpunk, což ovšem grafik zřejmě v úmyslu neměl "}, {"3": "GorGlin napsal/a:\t\t\tAle je pravda, že ten člověk má jen jedno oko a elfka taky nevypadá zdravě.\t\tKlikněte zde pro zvětšení...[BR]nezdravě? Žeby zombíci?"}, {"17": "iDavis napsal/a:\t\t\tTak už máme oficiálne vyjadrenie od Marindora:[BR][BR]\"Výzvy nie sú mienené byť náhradou za turnaje. Už čoskoro budú bežať súčasne.\"Klikněte zde pro zvětšení...Jelikož jsme dostali pár dalších dotazů ohledně turnajů, rád bych svého kolegu z Bety doplnil: turnaje neběžely na Betě pouze z důvodu technické chyby, rozhodně nešlo o náš záměr. Nemusíte se tedy bát, opravdu neplánujeme vynechávání turnajů. "}, {"31": "Na bete sa zajtra začína ďalšie kolo dobrodružstiev, teda u nás sa začne pravdepodobne 17.1. Áno správne tipujete, bez zmeny systému úloh.. "}, {"16": "Jo, užiju si to 2x po sobě (beta + cz1). Alespoň, že na cz2 na to můžu kašlat.[BR]Ale tak třeba nám jednoho krásného dne nadělí systém úkolů z výzev i do dobrodružství."}, {"72": "Nebo opačně xD"}, {"5": "...beze změny? ...ztrácím pomalu motivaci něco pro DS/v původním znění/ dělat a vůbec kvůli tomu bourat přestavovat město! Pokud na konci nebude za odměnu Aladinova lampa /co splní každé přání  / asi pojedu max. jen se stávajícím městem a stavem a dle chuti  ..."}]