[{"28": "Odměny v dobrodružství, které ode dneška běží na betě:[BR]Spoiler1. kolo: příděl zásob 50% , déšť mincí 50% , zesilovač 8 hod.[BR]2. kolo: prastará vědomost 15, prastará vědomost 30, ledový drak (budova ze zimního eventu)[BR]3. kolo: zesilovač 14 hod., zesilovač 20 hod., zimní ruské kolo (budova ze zimního eventu)"}, {"90": "Prý je to schéma A, to znamená[BR]Spoiler: Schéma A pro Dobrodružství společenství[IMG]https://i.ibb.co/gwYntSH/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-1-9-23-16-34-png-2835.png[/IMG]To by znamenalo jen základních 10 odznaků (dílny a triády manufaktur) a na několika cestách navíc odevzdávání zboží. Pokud to bude takto tak to vůbec hrát nebudeme nebo jen rychle proběhneme pro odměny a sbohem a šáteček [smilie--sprite1]"}, {"16": "Zboží tam je. Já jako chudý ork samozřejmě zbožím nepřispěl[smilie--sprite1] Na to máme ve společenství bohaté mončičáky."}, {"31": "Sneak Peek: Lidé a elfové #2[BR][BR]Spoiler: Sneak Peek<<<[BR][BR]V Elvenaru se nám něco děje,[BR]ke začátku (nebo konci?) příběhu to spěje.[BR]Toulavý měsíc důvěrným obrazem byl,[BR]čtenáře jeho příběhu na tohle důkladně připravil.[BR][BR][IMG]https://i.ibb.co/RHg3JHQ/https-i-ibb-co-Tw-Hv-DJP-EL-sneak-peek-11-1-2019-2-png.png[/IMG][IMG]https://i.ibb.co/4j5n2W2/https-i-ibb-co-h8-VLB2-V-EL-sneak-peek-11-1-2019-3-png.png[/IMG][BR][BR][IMG]https://i.ibb.co/0CFsCvy/https-i-ibb-co-MD5fh-QX-EL-sneak-peek-11-1-2019-1-png.png[/IMG][BR][BR]>>>​"}, {"16": "@iDavis Já se nechám překvapit, jinak tu budeme vymýšlet totální kraviny."}, {"59": "Celkem je mi jedno, co za rasu přijde, jde pouze o to, zda bude vůbec hratelná rozumným způsobem a to hlavně vzhledem k hernímu prostoru. Náročnost na čtverce se docela zvyšuje. Jsem zvědavý a těším se na novou grafiku. Je pravda, že ty zimní sety budou působit mimo zimní období nedobře, ale snad přijdou jiné, lepší a bez zimního vzhledu."}, {"31": "Sneak Peek: Lidé a elfové #3[BR][BR]Spoiler: Sneak Peek<<<[BR][BR]Před nějakou dobou se zde tajemný sneak peek objevil,[BR]víte, co společného s popisem poslední Amuni technologie sdělil? [smilie--sprite2]​"}, {"59": "nevíme, počkáme si, až toho bude víc [smilie--sprite1][BR][BR]Odstraněna citace. Embla"}, {"2": "Připomínám mi to jednu diskusi o RPG hrách.[BR]Pokud někomu chceš předat informaci rozloženou na nápovědy a narážky, tak si sepiš kolik bys jich potřeboval a jejich množství znásob deseti.[BR]Pak to začne fungovat i pro ostatní lidi.[BR]14 v prvním Sneak Peeku je pro mě prosté konstatování faktu, že po 13 je 14.[BR]Ten dovětek se dá vyložit třeba tak, že to nebude jen další číslo v řadě ale poslední kapitola, nebo že nějak vybočí ze standardu.[BR]A to může být cokoly, nepřijde předpokládané živoucí zboží, celá kapitola bude oslavou jak jsme všechny ty zbloudilé rasy přivedli na správnou cestu, nebo se skřížíme s lidmi.[BR]Nebo, ale to už je fakt divočina, dostaneme dvě rozšíření.[BR]A s popisem Amuni divů souvislost nevidím.[BR]Ale pokud tedy mám předpokládat že tam nějaká je[BR]14 je počet ras našeho světa které postupně zařazujeme do naší komunity?[BR]Já osobně jsem tedy zvědav kdy se naše pokroková společnost stane tak morální, že přestaneme používat inteligentní bytosti jako platidlo.[BR]Jsem jediný kdo to vnímá jako otroctví?"}, {"31": "@GorGlin konštatovanie faktu že po 13 je 14 je síce správne, ale opravím ťa vo vykladaní si toho dodatku, neviazal sa na to číslo 14, ale ak si dotyčný pozorne prečítal celý text toho sneak peeku (a áno, ten je dôkazom že podstata môže byť skrytá aj mimo tlačítka Spoiler), tak si určite mohol všimnúť, že možno z gramatického hľadiska sa viaže k niečomu inému. A toho textu je tam tak málo úmyselne, aby sa neodpútavala pozornosť od toho podstatného, pričom to číslo malo slúžiť len na pochopenie, k čomu sa tá podstata vlastne viaže. Fakt nedám do sneak peeku jedno číslo, bez akejkoľvek výpovednej hodnoty, ale rovnako to tam mesiace vopred ani zreteľne nevysypem, aby to tu nedopadlo podobne ako pred časom na napr. nemeckom fóre."}, {"16": "GorGlin napsal/a:\t\t\tNebo, ale to už je fakt divočina, dostaneme dvě rozšíření.\t\tKlikněte zde pro zvětšení...Tak to je fakt divočina, to nám vývojáři nemůžou udělat.[BR][BR]@iDavis můžeš nám vyspoilerovat (jestli to víš), jakou velikost budou mít nové obytky?"}, {"31": "@Lovec Krys[BR][BR]Spoiler5x3[BR][BR]čo je oproti Amuni budovám zmenšenie, ale zas nemôžeme očakávať príliš veľký nárast obyvateľov (menší než pri Amuni)"}, {"66": "@iDavis OK, takže buď má následující rasa něco společného se Zlatým kompasem, nebo má chlápek s páskou přes oko nějaké tzv. vševidoucí oko a je to nějaký bystrozor?[BR]Dostaneme se snad na vyšší evoluční stupeň?"}, {"16": "@iDavis Díky.[BR]Teď je otázka, zda to bude znamenat, že budeme moci zmenšit místo pro obytky, anebo zda budeme zvětšovat jejich počet."}, {"59": "Vzhledem k tomu, co všechno půjde \"nahoru\" bych o zmenšení místa na obytky moc neuvažoval."}, {"2": "budem zvedat manufaktury na magické suroviny takže menší přírustek obyvatel může být opravdu oříšek.[BR][BR]iDavis:[BR]U němců došlo k nějakému zásadnímu úniku informací?"}, {"16": "Tak jestli budeme muset přistavovat, tak osadníci budou jasné oběti - poskytnou potřebné místo (koho stejně zajímají úkoly, že)."}, {"102": "No to je konečně spoiler, co mi je k něčemu a co mě potěšil [smilie--sprite2] Mě jsou ty hádanky k prdu [smilie--sprite5] Z 4 řad budov se mi tedy stanou tři řady. A hlavně mi to nenaruší situaci, kdy chci mít budovy nalevo nahoře, toho jsem se docela bál. Lidi mám sice málo i na dotažení všeho na max, resp mám to těsně, tak uvidíme jaké budou nároky. Jestli dostanu 15tis, z toho mi 3tis sežere sídlo, 25tis sežrou manufaktury, 2tis dílny tak budu 10tis v mínusu, no budu to muset řešit pop-hybrida."}, {"72": "Přijde to 14týho února a bude to nějakej produkt aférky elfky a člověka, no né xD"}, {"31": "@GorGlin nebol som toho priamym svedkom ale viacero postojov kompetencií to dokazuje.[BR][BR]@Prealiena vševidoucí oko tu už mám ja (vľavo pod avatarom [smilie--sprite5])[smilie--sprite8]"}]