[{"31": "Sneak Peek: Konstrukti #1[BR][BR]Spoiler: Sneak PeekSvět po Amuni zůstal smutně pustý,[BR]je již na čase přivítat nové hosty.[BR][BR][IMG]https://i.ibb.co/z43xgxP/https-i-ibb-co-0s75-Tnj-EL-sneak-peek-15-1-2019-1-png.png[/IMG][BR][BR]..:: Konstrukti ::..[BR][BR]Závlaha půdy je nadměrně nutná,[BR]věřím, že se zde opět najde voda pitná.[BR]Vyrobíme elektrické šoky, dešťové medúzy,[BR]spolu se vzduchovými filtry, zbavíme se této hrůzy.[BR][BR][IMG]https://i.ibb.co/vwFxVfq/https-i-ibb-co-x-JQs-Xtc-EL-sneak-peek-15-1-2019-2-png.png[/IMG][BR][BR]Schůzka lidí a elfů bude uprostřed dění,[BR]ostrovy jsou teď připraveny na přistání.[BR][BR][IMG]https://i.ibb.co/LpLtJbT/https-i-ibb-co-v4mb0b-D-EL-sneak-peek-15-1-2019-3-png.png[/IMG][BR][BR]>>>[BR]​"}, {"77": "To vypadá prostě úžasně , už jsem moc zvědavá na nové hosty a jejich obydlí. "}, {"59": "aaa něco na způsob farem z Hvězdných válek   ?"}, {"66": "To mi připomíná film Smrtelné stroje.[BR]ČSFD:[BR]\t\t\tZa pár set let bude svět jen umírající nehostinnou pustinou, křižovanou obřími stroji na kolech, jejichž primární snahou je nacházet zbývající zdroje obživy a surovin. V tato monstra se proměnila původní města. Sídla na kolech jsou plná lidí a největším a nejmocnějším z nich je Londýn. Ten se rozrůstá i díky pohlcování menších strojů, které se objeví v jeho cestě.\t\tKlikněte zde pro zvětšení..."}, {"2": "To se nám ten magický, pohádkový svět trochu zvrhnul[BR]Ale typ na roboty padnul už dávno"}, {"119": "Tak nebyla jsem daleko od pravdy, kdyz si sem tehdy @iDavis  dal sneak peak s cislem 14  a ja jsem si myslela,ze to bude nova rasa  Ted to nedohledam z mobilu...  Ale tesim se, vypada to zajimave"}, {"3": "já bych radši nějaké nemrtvé... [BR]ale to je ještě daleko, zatím jsem u víl"}, {"16": "Borgové jsou tu"}, {"72": "Fakt že jo, roboti na kouli z fable, nebo co to bylo za hru. Jen se toho nebát, patnáctka budou vampíři a šestnáctka kačer donald. Výborně! "}, {"117": "A 17. kapitola budou Youtubeři... děs, jakým směrem hra směřuje..."}, {"5": "...klííííd  , nechme se překvapit třeba i mile "}, {"117": "Jsem v klidu, jen jsem vyjadrila nazor."}, {"15": "Uvidíme , uvidíme - jen co k břehu přirazíme ( jak říkal kapitán Flint ) ! "}, {"72": "Jako, podstatný že se něco děje, to je fajn, většinu onlinovek když dohraješ, ničeho novýho se nedočkáš."}, {"102": "Děje se vždy něco, někde mají nové funkce a někde jsou majitel i vývojáři na pláži. "}, {"31": "Sneak Peek: Konstrukti #2[BR][BR]Spoiler: Sneak Peek<<<[BR][BR]Obytné budovy na velikost 5x3 nám zmenší,[BR]zvětšení manufaktur na 5x5 nás všechny velmi těší.[BR][BR][IMG]https://i.ibb.co/ckdb7Yf/https-i-ibb-co-t-Cxr42-Y-gr9-factorygems-24-png.png[/IMG][BR]Manufaktura na drahokamy, level 24[BR][BR]No efekty těch nejpokročilejších konstrukcí konstruktů,[BR]jsou dobrou zprávou všech turnajových milovníků![BR][BR][IMG]https://i.ibb.co/Jc8SrmH/https-i-ibb-co-hy-Ydjg-G-gr9-aw1-png.png[/IMG][BR]Prastarý div[BR][BR]Zatímco jeden úmorných 16 hodín výrazně sníží,[BR]druhý nám počet jednotek při každé produkci o něco zvýší![BR][BR][IMG]https://i.ibb.co/6WxnrQ7/https-i-ibb-co-St-Pzvq5-EL-sneak-peek-18-1-2019-1-png.png[/IMG][BR][BR]>>>[BR]​"}, {"92": "Připadá mi to tak trochu jako \"od Tolkiena k Lucasovi\", aneb \"z doby Elfů do doby hvězdných válek\", ale pokrok holt nezastavíme... [BR]Na druhou stranu by Konstrukti mohli vynalézt nějakou budovu 1x1, která dává 1000 obyvatel a 2000 kultury, což by nebylo špatný "}, {"117": "Takže lepší turnaje budou mít jen ti, co dokončí kapitolu 14 a postaví nové divy... tak ještě, že na turnaje už peču "}, {"117": "Jinak budovu 1x1 s 1000 lidma a 2000 kultury... už teď mám pořád 30k obyvatel navíc a nevím co s nima  spíš přidat místo "}, {"92": "donutka napsal/a:\t\t\tuž teď mám pořád 30k obyvatel navíc a nevím co s nima Klikněte zde pro zvětšení...Tak to ti upřímně závidím  Ale s tím přidáním místa to není špatný nápad..."}]