[{"105": "iDavisi, děkuji ti za obrázky nadcházející rasy. Nemohu si pomoci, ale ten paňáca mi připomíná mimozemšťany z 5. elementu [IMG]https://i.ibb.co/r2Z1bz6/https-cz-forum-elvenar-com-index-php-attachments-patyelement-png-2867.png[/IMG]"}, {"43": "¨Tak nějaké podoba tam je,ale minimální.mě se líbí... [smilie--sprite1]"}, {"16": "Tak na ty divy jsem opravdu zvědav, jako velký turnajový hráč určitě. Ale ještě si budu muset počkat - ještě tak min. 2 měsíce než dokončím Mončičáky(Amuni). Ještě mám to 25% portálové požehnání, tak ho možná využiju, jestli se před jarním eventem budu blížit k borgům, abych to stihl a měl budovy už z nové kapitoly.[BR][BR]ps:[BR]Zatímco jeden úmorných 16 hodín výrazně sníží,[BR]druhý nám počet jednotek při každé produkci o něco zvýší!Klikněte zde pro zvětšení...Chápu to správně, že jeden div nám bude snižovat prodlevu mezi turnajovými koly (tzn. na lv1 namísto 16h třeba 15 a něco a na dalších levelech postupně méně?)[BR]Ten druhý pak bude zvyšovat množství produkovaných jednotek? Pokud ano, bude se to týkat jen těch zadaných nebo i produkovaných ostatními divy?[BR][BR][BR]ps2:To by mohlo znamenat, že při neustálém rychlejším zdražování výkupů než produkce surovin bude turnajový výsledek záviset čím dál tím více na bojích (a podpoře vojenských divů) - v budoucnu ještě mnohem více než teď.[BR][BR]ps3: Konečně budou moje drahokamárny vypadat zase líp po té půlčíkovské hrůze."}, {"105": "papap napsal/a:\t\t\t¨Tak nějaké podoba tam je,ale minimální.mě se líbí... [smilie--sprite1]Klikněte zde pro zvětšení...Také se mi líbí. [smilie--sprite1][BR][BR]Lovec krys: já to tak chápu, že se sníží doba mezi jednotlivými koly turnaje, třeba po čtvrthodinách. A ano, druhý bude zvyšovat množství jednotek. Jaký ale bude mechanismus u toho druhého divu ještě nevím. Ale už se na ně těším.[BR][BR]Příspěvky sloučeny. Embla"}, {"31": "@Lovec Krys áno, jeden z nových divov bude znižovať 16 hodín na odomknutie ďalších kôl v turnajových provinciách a druhý zvýši produkciu jednotiek, to by sa ale malo viazať iba na vojenské budovy, tj. kasárne, cvičiště a tábor."}, {"16": "@iDavis Škoda. Ale i tak to bude pomoc."}, {"136": "Jestli tohle má být to narovnání obtížnosti turnaje; pokročilý vs. začátečníci. Tak to raději ani nekomentuji..[smilie--sprite5]"}, {"59": "Jsem rád, že se něco děje, hra jde kupředu a to se mi líbí.Nové divy bývají zpravidla až na konci kapitoly a jistě tomu bude tak i v kapitole 14. A tak bude spousta času si vše promyslet, obzvláště, co se prostoru týká. Možná nastane doba, kdy budu muset zbourat méně úžasné divy a toho okamžiku se tak trochu děsím. Novou grafiku ve hře vždy oceňuji, na nějaký čas se stane ten můj shluk budov trochu méně okoukaným, na což se neskutečně těším. [smilie--sprite1]"}, {"43": "Jsem turnajový nadšenec a většinu bojuji,takže každé zvýšení produkce vojska je pro mne plus,kor jestli to nebude stát zásoby.Snížení času nepotřebuji,takže u mne je to jasné...[smilie--sprite1]"}, {"99": "@iDavis : Ta drahokamová manufaktura je super [smilie--sprite1] Nemáš tam obrázek i prachové? Ta aktuální se mi vůbec nelíbí, tak doufám, že si v nové kapitole trochu polepším [smilie--sprite1]"}, {"31": "@Angedev no jediná drahokamová má taký najviac výstižný dizajn konstruktov..[BR][BR]Spoiler[IMG]https://i.ibb.co/pxKdLgR/https-i-ibb-co-NYXjh9r-gr9-factorymagic-24-png.png[/IMG][BR][BR]Manufaktura na kouzelný prach, level 24[BR][BR][IMG]https://i.ibb.co/hHm1rTZ/https-i-ibb-co-t-LZ6-FWg-gr9-factoryelixir-24-png.png[/IMG][BR][BR]Manufaktura na elixíry, level 24"}, {"117": "Prach si bude vždy držet vzhled orků [smilie--sprite1]"}, {"65": "však v každé kapitole co se zvedají manufaktury dostane jenom jedna spešl vzhled dané rasy. orčí prach, tradiční elixíry, takže zbývají konsruktoidní drahokamy [smilie--sprite1] [BR][BR]jinak nebyl by screenshot zbrojnice? s těma elementálskýma se budu těžko loučit, jsou hrozně povedené. snad dostaneme něco aspoň podobně hezkého."}, {"31": "@CorwinOfAmber [BR][BR]Spoiler[IMG]https://i.ibb.co/ynVn3MT/https-i-ibb-co-p-K3n-B2j-gr9-armoryhumans-33-png.png[/IMG][BR][BR]Zbrojnica (ľudia), level 33"}, {"135": "A jak pak se asi změní pulčíkovské větrné mlýny \"elixírovny\"?[BR]Prosím, prosím [smilie--sprite8]"}, {"99": "Jojo, vím, že prach musel zůstat orčí, ale i orkové můžou občas postavit něco hezkého [smilie--sprite8] A řekla bych, že to vypadá lépe, než doposud [smilie--sprite1] Jinak zbrojnice také super, řekla bych, že vzhled nové rasy se mi bude líbit [smilie--sprite1][BR][BR]PS: @iDavis jsi poklad [smilie--sprite1]"}, {"31": "@maxinec pridal som ju k manufakture kouzelného prachu tu. [smilie--sprite2]"}, {"65": "@iDavis : 33 je max? neměli bysme dostat 4 levely?"}, {"102": "A ty divy budou mít jen jednu věc? Nebo co bude ta druhá, většinou div dává nějak dvě věci."}, {"31": "@CorwinOfAmber áno, vyzerá to tak že 33 je max. Možno chcú zjednotiť číslo posledného levelu s číslom hlavných budov (obytné, dielne..).[BR][BR]@ExplorerFfff budú samozrejme 2 bonusy v každom, tie druhé sa budú viazať na živoucí zboží (všetky druhy, jeden zvyšovať jeho produkciu (podobne ako Horské sídlo produkciu standardního zboží) a druhý znižovať jeho rozpad (podobne ako Bludiště manu))."}]