[{"102": "Tak super, na ten rozpad jsem čekal a doufal v něj, to bude fajn  díky"}, {"16": "@iDavis výborná zpráva. Už jenom kvůli těm vojenským bonusům to stojí za to postavit. S tímto je to 100% jisté (rasa, co přijde o konstruktech bude mít méně místa o místo zabrané těmito divy)."}, {"105": "No, já jistojistě zbourám Maják dobrého sousedství. Jako více many při motivaci je sice fajn, ale jak jsem na konci, tak mám many přehršel a mám dost budov z eventtů, co many dávají hafo. Takže budu mít trochu místa navíc. "}, {"102": "Se divím, že jsi ho stavěl, ty divy těch amunů mi totiž od chvíle uvedení přišli jako zcela k ničemu. Trochu dejme tomu pyramida očištění, ale zrovna ten maják - pokud budova navíc musí být okouzlená, tak to je epic fail."}, {"31": "Sneak Peek: Konstrukti #3[BR][BR]Spoiler: Sneak Peek<<<[BR][BR]Významem těchto konstruktů si jistý nejsem,[BR]no fakt, že možná jde o nové jednotky popřít nemůžem.[BR][BR][IMG]https://i.ibb.co/F4rwd2r/https-i-ibb-co-DGgc-N15-EL-sneak-peek-20-1-2019-1-png.png[/IMG][IMG]https://i.ibb.co/J71HM7W/https-i-ibb-co-Nnvn-Kd-D-EL-sneak-peek-20-1-2019-2-png.png[/IMG][IMG]https://i.ibb.co/ZhkxzVn/https-i-ibb-co-VDs-CRR0-EL-sneak-peek-20-1-2019-3-png.png[/IMG][IMG]https://i.ibb.co/pycDw0S/https-i-ibb-co-rt-W4kcw-EL-sneak-peek-20-1-2019-4-png.png[/IMG][BR][BR]Načase připravit se na nové zboží,[BR]jedno rozšíření z výzkumu je na to prostě boží.[BR][BR][IMG]https://i.ibb.co/4KpQnPW/https-i-ibb-co-k-Jj-R6-PR-EL-sneak-peek-20-1-2019-5-png.png[/IMG][IMG]https://i.ibb.co/3cLFpHz/https-i-ibb-co-yhz5z1-G-EL-sneak-peek-20-1-2019-6-png.png[/IMG][IMG]https://i.ibb.co/ZBq2h8k/https-i-ibb-co-MGFjn-KS-EL-sneak-peek-20-1-2019-7-png.png[/IMG][BR][BR]V ostrovech třeba rychle Humanium a Elvarium produkovat,[BR]a zbytek výzkumu Vznešených lidí (elfů) objevovat.[BR][BR][IMG]https://i.ibb.co/SBDcCjs/https-i-ibb-co-fk-HJd-Zw-EL-sneak-peek-20-1-2019-8-png.png[/IMG][BR]​"}, {"119": "jenom jedno rozsirko z vyzkumu?  no budu to tam muset nejak narvat "}, {"65": "@aikomi : plus zmenšení obytek  třeba já mám 40 obytek. tady ušetřím 40 polí. plus cesta, protože okolo budovy už nebudou 4 pole cesty, ale jen 3. jedna cesta mezi 2 budovama, to je plus dalších 20 polí. plus rozšíření = 85 polí v plusu "}, {"16": "@CorwinOfAmber No z toho zmenšení bych se neradoval, dle vyjádření iDavise to přidává dost málo popky, takže je možné, že nakonec ty obytky budou zabírat stejně místa nebo i více než teď, jen jich bude více.[BR][BR]@aikomi Tak zatím se dá ještě zmenšovat místo na osadníky. Problém nastane v okamžiku, kdy už nepůjde získat žádné místo z provincií a zároveň nepůjde zmenšit místo na osadníky (nezbytné minimum i na dlouhý průchod věkem)."}, {"65": "@Lovec Krys : no další obytky přistavovat odmítám, 40 je až až. budou-li chybět lidi, pořád mám ještě několik možností - přidat eventové hybridy, zvednout propast o pár levelů nebo se rozloučit se jednou drahokamovnou. (a začít posilovat vojenské divy ať vykompenzuji ztrátu produkce). ale víc obytek už prostě ne."}, {"66": "@iDavis Nové jednotky? Jako vojenské?[BR]Kasárny, cvičiště i Tábor žoldnéřů už mají plnou lištu pěti jednotek. Snad nebudou chtít postavit novou vojenskou budovu, už tak nestíhám cvičit všechno s jednou výcvikovou frontou. To by mě naštvali."}, {"31": "@Prealiena ohľadne tohto si naozaj nie som istý a nechcem šíriť len nejaké špekulácie, takže bude lepšie počkať až to zavedú do praxe."}, {"65": "no 7 jednotek stále nemá 3. hvězdičku, byl bych raději za tohle. a kdyby se orkové nemuseli cvičit za orky, rád bych je semtam také použil. a souhlasím, čtvrtá výcviková budova už by se fakt dost špatně živila jednou frontou. ale víc front by se zase špatně živilo kladivama, nechci přidávat sedmou dílnu nebu kupovat kouzelnou :-D"}, {"117": "Já už obytky zredukovala pod 40....stále mám přebytek lidí a spíš bych ocenila, aby dali ještě jinou možnost získání relikvií pro živoucí zboží, turnaje mě už stojí neskutečné množství surovin a o provinciích ani nemluvím... jde mi o to, že zpočátku se hlásalo, jak jsou některé relikvie k ničemu a já je všechny vyflákala na kouzla a teď mám živoucí zboží s bonusem nula nula prd... dřív se dalo v eventech získat poměrně slušný počet relikvií u beden (padaly po 15 či 20 ks)"}, {"102": "Z jednoho turnaje jich můžeš mít klidně pár stovek, jako během dvou etap turnajů, máš bonus na 700% ale chce to časem více bojovat, 3/4 turnaje se většinou dát dát bojem."}, {"119": "@CorwinOfAmber @Lovec Krys No ja mam taky kolem 40obytek, mozna o 4 vice a skoro plne mesto narvanych manufak. a divu.Je jasne ze neco budu muset bourat...A bohuzel uz jsem na konci z rozsirek z provi.Pokud nepridaji tak budu doufat ze nekdy bude vice z vyzkumu "}, {"117": "ExplorerFfff napsal/a:\t\t\tZ jednoho turnaje jich můžeš mít klidně pár stovek, jako během dvou etap turnajů, máš bonus na 700% ale chce to časem více bojovat, 3/4 turnaje se většinou dát dát bojem.\t\tKlikněte zde pro zvětšení...Bojovat neumím a tolik jednotek nemám, nehledě na to, ze nemam na turnaje cas, takze nedam vic jak 3 hvězdy"}, {"102": "Automatický boj celkem funguje a dá se zvyknout. Popravdě dlouhodobě ve větším věku je výkup nesmyslný. Jsem se díval na tvé město a jako s tím by mělo jít zvládat turnaje v klidu na 1600 bodů pravidelně, měl jsem to podobně a mnohem méně dílen (5), a ty turnaje se vyplácí je tam hromada VB takže rostou divy, ty pak celkově vše zlepšují. Bez turnajů si tu hru fakt zbytečně zhoršuješ ale ten čas, to chápu. Mě by se taky líbilo více vykupovat, je to pohodlnější ale mě by jeden turnaj stál pak miliony surovin :/"}, {"65": "@donutka : za účelem zjednodušení (a urychlení) bojů jsem dlouho pracoval na turnajovém taháku, který přeposílám všem, co se mě ptají jak bojovat, a ono to funguje  jeho účel je následující :[BR][BR]- aby byla 1 max 2 jednotky na každý turnaj[BR]- aby nad tím člověk musel co nejmíň přemýšlet[BR]- abych izoloval střety, kde může nastat prohra a ty automaticky vykupoval, ani je nezkoušel.[BR][BR]samozřejmě když mám víc času, zkouším různé jiné kombinace a typy jednotek, ale pro základních dejme tomu 500 - 1000 bodů každý týden, při 10ti minutách denně tím bez problémů vybojuješ i předposlední hvězdu. [BR][BR]mrkni do popisu spolku co máme na cz1, je tam zjednodušená verze, třeba ti to pomůže. protože jak píše kolega, turnaje jsou stabilní přísun VB, run, kouzel a hlavně relikvií."}, {"117": "ExplorerFfff napsal/a:\t\t\tAutomatický boj celkem funguje a dá se zvyknout. Popravdě dlouhodobě ve větším věku je výkup nesmyslný. Jsem se díval na tvé město a jako s tím by mělo jít zvládat turnaje v klidu na 1600 bodů pravidelně, měl jsem to podobně a mnohem méně dílen (5), a ty turnaje se vyplácí je tam hromada VB takže rostou divy, ty pak celkově vše zlepšují. Bez turnajů si tu hru fakt zbytečně zhoršuješ ale ten čas, to chápu. Mě by se taky líbilo více vykupovat, je to pohodlnější ale mě by jeden turnaj stál pak miliony surovin :/\t\tKlikněte zde pro zvětšení...Tolik bodů jsem dávala, ale s prací je to už naprosto neslučitelné, někdy se ke hře dostanu 1x za dva dny... [BR][BR]@CorwinOfAmber Díky moc za tahák  příští turnaj zkusím "}, {"43": "jo na to jsem čekal jedno rozšíření a dočkal se,fakt super! "}]