[{"102": "Si myslím, že můžeme být vůbec rádi za jedno rozšíření s tím jejich \"je to výzva\"...[BR][BR]Mám 36 obytek, z toho ale 4 kouzelné, tzn to odpovídá k těm 40 normálním, taky příliš nechci zvyšovat jejich počet :/ Ale uvidíme, třeba ten nárůst nebude zase tak tragický.[BR][BR]to RR nám hezky usnulo, měsíc pryč a nějak žádné zprávy."}, {"5": "...že to odnese vždy ten elixír, slaměná bouda je krokem zpět k vaření lektvarů někde v hrnci nad ohněm "}, {"116": "mcallen napsal/a:\t\t\tiDavisi, děkuji ti za obrázky nadcházející rasy. Nemohu si pomoci, ale ten paňáca mi připomíná mimozemšťany z 5. elementu Zobrazit přílohu uživatele 2867Klikněte zde pro zvětšení...Me spis ty maniky ve filmu Hvezdna brana, jak v te pyramide otevirali klicema cosik ."}, {"117": "ElfNostradamus napsal/a:\t\t\t...že to odnese vždy ten elixír, slaměná bouda je krokem zpět k vaření lektvarů někde v hrnci nad ohněm Klikněte zde pro zvětšení...Vždyť teď v nové kapitole budou elixíry pěkné"}, {"102": "Mě všeobecně nezkutečně více vadí, že ty budovy jsou často nesmyslně vysoké. Dost blbě se na to pak kliká, překrývá to ostatní... k prdu celé "}, {"72": "kalicz napsal/a:\t\t\tMe spis ty maniky ve filmu Hvezdna brana, jak v te pyramide otevirali klicema cosik .\t\tKlikněte zde pro zvětšení...Ano.. to bylo právě ve filmu 5.element "}, {"31": "Komunitná budova[BR][BR]Spoiler: Komunitná budovaDnešným dňom je prvýkrát dostupná nová komunitná budova! [BR][BR]Gravitující hostinec[BR][IMG]https://i.ibb.co/QkFVtwB/https-i-ibb-co-q-Dn-MBRf-img-Gravity-Inn-png.png[/IMG][BR][BR]Budova je dostupná v rámci súťaže na oficiálnej stránke Elvenaru na Instagrame. Jej detailné špecifikácie nájdete už v tejto chvíli v téme Speciální budovy - Gravitující hostinec."}, {"59": "a jak jí lze získat v té  soutěži?"}, {"74": "@iDavis, [BR][BR]Budova je dostupná v rámci súťaže na oficiálnej stránke Elvenaru na Instagrame................ a další podobné budovy získáme tím, že přes webkameru budete provádět online přenos jak hrajete..........nás ty sociální sítě jednou stejně sežerou"}, {"31": "@pes63 je potreba si do svojho profilu pridať príspevok s fotkou, na ktorej je vidno ako daný hráč hrá Elvenar na svojom zariadení, plus v komente uviesť @Elvenar a #Elvenar."}, {"16": "No nikdo vás nenutí (zatím). Můžete na ty sítě jako já kašlat. A ještě abych používal webkameru, ... pche..."}, {"92": "@Lovec Krys Přesně tak, to ať si strčejí někam..."}, {"72": "Musíte si uvědomit, že cílovka (dle vašich reakcí) nejste Vy, ale vaše ratolesti. A ty to tam hodí bez obtíží, tomu věřte "}, {"59": "jde o to, jak dlouho ta soutěž potrvá, video se dá \"namotat\" z mobilu a je po parádě :-D"}, {"31": "Na bete začína.. [BR]Valentínsky príbeh Gaelagil a Burukbrak[BR][BR]Spoiler: Valentínsky príbeh Gaelagil a Burukbrak[IMG]https://i.ibb.co/fGWcX4v/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-valentine2019-Valentine2019-Header-png.png[/IMG][BR]Predpokladaný termín: 31.1. - 8.2.[BR][BR]Tohtoročná valentínska úkolová rada bude pokračovaním príbehu slávnej zamilovanej dvojice orka a lesného elfa, tentokrát obohateného o nové prírastky do rodiny. [BR][BR]Spoiler: ÚlohyVšetky detailné informácie o úkolovej rade nájdete v novej téme Události a úkolové linie - Valentýn 2019.[BR]Odmenou za splnenie úkolovej rady bude budova Domácnost a dva kočárky.[BR][BR][IMG]https://i.ibb.co/64S3xPW/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-valentine2019-Reward01-png.png[/IMG][BR][BR]Jej detailné špecifikácie nájdete už v tejto chvíli v téme Speciální budovy - Domácnost a dva kočárky."}, {"74": "Dobrá budova na rozčarování,,,, jsem zvědav na průběžné odměny, ale tenhle moc \"slaďoučký\" barák mi na pozemek nesmí "}, {"119": "koukam,ze uz se pocita se 14,tou rasou,podle eventove budovy  tak kdypak k nam prijde? "}, {"59": "no kdy... 14. rasa, tak, co třeba 14. února?  "}, {"16": "@aikomi Podle toho, jak nám tu iDavis novou rasu spoileruje, tak brzo (tipuju v řádu týdnů, takže nejspíše v tom únoru, při zpoždění kvůli nějakému problému možná v březnu)."}, {"31": "14. kapitola je tam uvedená kvôli blížiacemu sa kúzlu Královská rekonstrukce, vďaka ktorému bude možné tú budovu vylepšiť aj na takú úroveň. Nie je to tam preto, že by 14. kapitola mala byť súčasťou už tej úkolovej rady."}]