[{"16": "Valentýn nemám rád, ale budova se hodit bude. Vyměním tak jedno z polí, co mám. +900 pop se určitě využije. (+900 pop snadno přebije to, zda se mi budova líbí nebo ne).[BR][BR]@iDavis Že by už dali brzo na betu druhou verzi? Sám jsem zvědav, jak se jim podařilo (a chtělo) poprat se s našimi připomínkami. Alespoň jsem stihl přechod do Amuni, kdyby pro nás byly nepříznivé.[BR][BR]ps: Tak na betě už jsem se sekl v úkolové řadě na úkolu 13, kde mám použít 2 katalyzátory. Jelikož tam nemám a nehodlám stavět Akademii kouzel, je tento úkol pro mne nesplnitelný (a nejsem sám).[BR][BR]Doufám, že k němu přibude alternativa, neboť nechci vyplýtvat 2 katalyzátory na nějaký neužitečný nesmysl jenom kvůli úkolové řadě. Pokud úkol nebude mít alternativu a v intervalu se neobjeví jedna z budov, o které stojím (v podstatě jen jedinečné vylepšení jednotek), na úkolovou řadu se tak nejspíše vykašlu."}, {"72": "Tedy, normálně se snažím design nekomentovat, nebo je to discipléna zcela subjektivní, ale ten startovací obrázek při načítání hry, to je tedy kýč jaksepatří, jak kompozicí, tak zpracováním "}, {"115": "Já jen ohledně těch soutěží na tzv. sociálních sítích atd. [BR][BR]Pokud by to probíhalo jinou formou neměl bych nic proti. Ale připadá mi protože to beru s nadhledem fakt směšné, ubohé, zoufalé. [BR]A nejde jen o Elvenar ale stejně tak ostatní zejména reklamní marketing stejným stylem si fakt směšně, uboze a zoufale tvoří fake promo na sociálních sítích. [BR][BR]To je samé přidejte si nás na facebooku, instagramu atd a něco získáte. Pak dej like příspěvku a můžeš něco získat. Takže postupně se utvoří fake jakože směšně ubohá a zoufalá komunita která se tváří že tá komunita je velká a že je takový zájem a jak se všem moc líbí. Nevidím rozdíl mezi radostnému mávání když ulicí projížděl Gustavo Husák [BR][BR]Kdyby soutěž byla i součástí hry pro všechny hráče bez nutnosti mít facebook nebo instagram, zajímalo by mě kolik reálně by se přidalo lidí a kolik by jich dalo like. [BR][BR]Stejně tak když ve zprávách je jak někdo si něco objednal přes facebook atd a jaký podvod to byl a litujme toho poškozeného. [BR]Já říkám dobře vám tak !!! Je na pováženou a na hranici zdravého rozumu jakou váhu lidi dávají facebooku atd. Stránky na facebooku co se tváří že poskytují produkty na objednávky si může založit opravdu každý. A recenze ostatních zvládne i jeden člověk za týden. A pokud někdo neuvažuje nad tím co vše je potřeba pro takové podnikaní, tak je to hlupák. [BR]Stejně jako normální stránky na netu eshopy. Jistě systém vyhledá produkt který nejdražší varianta sojí 10 500 kč střední cena 8 500 kč a pak se najde za 5 800 kč ... Nejdražší varianta se vyloučí, a pak si člověk říká střední cena na prověřených eshopech známých je za použité zboží což může být i na té stránce co to stojí 5 800 kč. A co je tam psáno to je dáno a nevadí ani že se platí jen předem přes internet. [BR][BR]V podstatě je to to samé jako když překročím rychlost a řeknu že jsem zrovna neregistroval značku o rychlosti i když by byla zrovna špinavá a byla by špatně vidět. Ale mě nikdo litovat nebude, přitom jak já tak ten co zaplatil na pochybném eshopu je chyba z blbosti."}, {"143": "@Lovec Krys Nestačilo by ti si dát craftit cokoliv s potřebným množstvím katalizátorů splnit si tak úkol a výrobu zrušit když už tu ta možnost je? Nebo to musíš vyrobit a sebrat pro splnění úkolu?"}, {"102": "utratit katalyzátory mi nevadí, vadí mi utratit ulomky, když za měsíc zde je nová rasa a já si jako vycraftím něco starého... ble "}, {"16": "@SummerPicka Podle toho, co jsem zatím četl - stačilo. Uvidím, až ta úkolová řada bude tady. Zatím to tak plánují udělat (pokud to bude fungovat a úkol se tím splní). Na betě jsem s eventem skončil (zatím nemám v úmyslu stavět tam akademii a bez ní craftit nelze)."}, {"31": "Chcel by som pripomenúť, že začínajúc Valentínskou úkolovou radou budem využívať nový systém tvorby prehľadov k jednotlivým úkolovým radám. Oproti predošlému systému zmením v podstate len umiestňovanie týchto návodov, ktoré viac nebude na začiatkoch diskusií, ale v samostatnom návode Přehled úkolových linií.[BR][BR]Dôvodom tejto zmeny je moja snaha nájsť variantu, ktorá vyžaduje menšie časové nároky, čo táto v porovnaní so zdĺhavým očakávaním založenia diskusie k úkolovej rade pre možnosť umiestnenia prehľadu na viditeľné miesto (tj. na začiatok diskusie) s nadhľadom spĺňa. Verím taktiež, že to bude zjednodušením aj pre ostatných, keďže všetky návody budú vždy na jednom mieste."}, {"72": "Proč ne, ale uvaž to tam umístit hned jak to budeš mít hotové, případně ve stejném, doplňovacím formátu jako zde. Protože právě ve skutečnosti, že to hráči (co nelezou na betu) vědí dříve a mohou se na event připravit, třeba už před akcí, spočívá největší přínos. To nové téma na mě působí, že to tam budeš chtít dávat, až to bude finální verze  [BR]Díky."}, {"144": "iDavis napsal/a:\t\t\tNa bete začína.. [BR]Valentínsky príbeh Gaelagil a Burukbrak[BR][BR]Spoiler: Valentínsky príbeh Gaelagil a Burukbrak[IMG]https://i.ibb.co/fGWcX4v/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-valentine2019-Valentine2019-Header-png.png[/IMG][BR]Predpokladaný termín: 31.1. - 8.2.[BR][BR]Tohtoročná valentínska úkolová rada bude pokračovaním príbehu slávnej zamilovanej dvojice orka a lesného elfa, tentokrát obohateného o nové prírastky do rodiny. [BR][BR]Spoiler: Úlohy1. Získaj malé množstvo mincí[BR]2. Získaj malé množstvo zásob[BR]3. Začni vyrábať 1x nápoje[BR]4. Utrať 2 VB[BR]5. Získaj 3x ľubovoľné kúzlo ALEBO použi 3x ľubovoľné kúzlo[BR]6. Vyrob 5x obyčajné nástroje[BR]7. Vykonaj 3x susedskú výpomoc[BR]8. Vyrieš 3 strety ALEBO vyrieš 15 turnajových stretov[BR]9. Získaj 7 relikvií[BR]10. Získaj nejaké množstvo mincí + kúp 7 VB[BR]11. Vyrob 7x chlieb[BR]12. Získaj 3x ľubovoľné kúzlo[BR]13. Použi 2x spojovací činidlo[BR]14. Vyrob 9x pokročilé nástroje[BR]15. Získaj nejaké množstvo zásob[BR]16. Získaj malé množstvo mramoru + získaj malé množstvo ocele + získaj malé množstvo dreva[BR]17. Vyrob 9x košík jedla[BR]18. Vyrieš 6 stretov ALEBO vyrieš 30 turnajových stretov[BR]19. Získaj 12 relikvií[BR]20. Trénuj nejaké množstvo jednotiek ALEBO vyskúmaj 1 technológiu[BR]21. Získaj 300x úlomky kouzel[BR]22. Vyrob 9x sada nástrojov[BR]23. Získaj 3x ľubovoľné kúzlo ALEBO použi 3x ľubovoľné kúzlo[BR]24. Získaj 900x úlomky kouzel[BR]25. Vyrieš 9 stretov ALEBO vyrieš 45 turnajových stretov[BR]26. Vyrob 8x produkt základnej bonusovej manufaktury (3-hodinový)[BR]27. Vyrob 1x produkt z každej základnej manufaktury (3-hodinový)[BR]28. Vyrob 8x produkt základnej bonusovej manufaktury (9-hodinový)[BR]29. Vyrieš 12 stretov ALEBO vyrieš 60 turnajových stretov[BR]30. Preskúmaj 1 provinciu ALEBO vylepši 1 budovu na level 16 alebo vyšší[BR]31. Vyrob 8x produkt základnej bonusovej manufaktury (24-hodinový)[BR]32. Vyrob 2x produkt z každej základnej manufaktury (9-hodinový)[BR]33. Vyskúmaj 1 technológiu ALEBO vylepši 1 budovu na level 16 alebo vyšší[BR]Odmenou za splnenie úkolovej rady bude budova Domácnost a dva kočárky.[BR][BR][IMG]https://i.ibb.co/64S3xPW/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-valentine2019-Reward01-png.png[/IMG][BR][BR]Jej detailné špecifikácie nájdete už v tejto chvíli v téme Speciální budovy - Domácnost a dva kočárky.Klikněte zde pro zvětšení...[BR]Co jsou úlomky kouzel?[BR][BR]Příspěvky sloučeny. Embla"}, {"145": "V akademii kouzel díky nim můžeš craftit "}, {"99": "Musíš něco rozčarovat v inventáři (budovu, kouzlo, požehnání...) "}, {"31": "@athlan do novej témy to skutočne chcem dávať až vo finálnej verzii, ale dovtedy to bude ako vždy tu v tejto téme (už len z princípu že sa jedná o správy z beta serveru), takže z tohto pohľadu sa na tom nič nezmení."}, {"74": "Já ten Event raději nekomentuji. Byl bych velice vulgární. Úkoly 30 + 33 zase pakárna. Stavět zase nějakou budovu až na 16 level se mi rozhodně nechce."}, {"59": "To já tedy tu budovu začal stavět.  Postavím obytnou, stejně mám pocit, že jich budu mít na 14. kapitolu málo. Mno a když ne, zbourat jí mohu vždy "}, {"102": "Tak já stavím tu T6 manufakturu, takže jsem si poslední dva levely na to nechal  Ale mám pro tenhle případ ještě pár budov na předposledním levelu.[BR][BR]Do měsíce by tu měla být asi nová rasa, takže to tak nějak myslím vyjde akorát."}, {"65": "už jsme tu dlouho neměli žádný spoiler nové rasy. @iDavis : neměl bys pro nás zase něco? třeba avatary, aspoň ty 4 základní. na nové avatary se vždycky těším a určitě nejsem sám "}, {"31": "@CorwinOfAmber niektoré z nových avatarov sa už objavili v tomto sneak peeku. [BR][BR]A zvyšné dva z tých štyroch základných:[BR][BR]Spoiler[IMG]https://i.ibb.co/jJPmkQ0/https-i-ibb-co-Bc-YCwtf-EL-konstrukti-avatar2-png.png[/IMG][IMG]https://i.ibb.co/FVKhpDs/https-i-ibb-co-c-NZ1-M7q-EL-konstrukti-avatar1-png.png[/IMG]"}, {"102": "Tak to vypadá, že ten event asi začne jako loni až 14.2. co?"}, {"146": "jj minimálně si počkáme týden."}, {"65": "doufám že ne teda, snad to posunuli jen na pondělí"}]