[{"92": "Copak - začátek eventu se nám posouvá?"}, {"31": "Královská rekonstrukce - aktuálne informácie[BR][BR]Spoiler: Královská rekonstrukcePo obdržaní spätnej väzby ktorá sa dostala k vývojárom pri poslednom testovaní nového kúzla Královská rekonstrukce sa rozhodli na funkcii ešte nejaký čas zapracovať a dnes sú dostupné ohľadne tohto nové informácie.[BR][BR]Rozhodli sa zmeniť isté časti týkajúce sa nového kúzla nasledovne:[BR]Turnajové debny č. 4, 6, 8, 9 a 10 budú všetky obsahovať kúzlo Královská rekonstrukce.Pre vylepšovanie budov udalostí zostane pomer ceny k veľkosti rovnaký, tj. 1 kúzlo na 1 políčko rozlohy budovy.Turnajová debna č. 10 bude aj naďalej obsahovať plánek.Plánky budú naďalej potrebné na vylepšovanie Kouzelných budov a Kouzelných dielní."}, {"102": "Celkem cajk myslím. Za mě OK "}, {"59": "@iDavis V takovém případě jsem spokojen "}, {"16": "@iDavis Mi osobně to neublíží - plánky mám primárně na vylepšení kouzelných budov.[BR]Oproti původnímu řešení jsou biti ti, kteří plánky chtěli využít jen na vylepšování eventovek.[BR][BR]Recept na spokojenost všech: Přidat možnost dobrovolné konverze libovolného množství plánků na královskou rekonstrukci (1:10 jako bylo dříve), což pro hráče nehrající s kouzelnými budovami znamená zlepšení (15 namísto 11) a pro hráče s kouzelnými budovami status quo + něco navíc.[BR][BR][BR][BR]Tak ta popka v nových budovách bude přímo luxusní[BR]100 za jednu pro mne znamená strategii, že: Postavím 1 T3  navíc ještě před dosáhnutím kapitoly borgů a abych toho byl schopen, tak přistavím potřebné rezidence navíc tak, aby mi zbyla popka na vylepšení T3 na T6 úroveň. Tím bych měl dostat nový počet potřebných rezidencí. Poté v nové kapitole získám část místa zpět snížením velikosti obytek.[BR]Celkově to tipuji, že ve výsledku budou zabírat více místa než teď.[BR]Takže chudáci borgové se mi po vesnici moc rozpínat nebudou, budou mít zase o kousek místa méně než mají teď mončičáci."}, {"66": "Takže šli s tou variantou zachovat plánky na vylepšování kouzelných budov a využívat královskou rekonstrukci jenom na eventové budovy. Za mě fajn. Vyhli se problému, jak řešit zdražování neustále se zvětšujících kouzelných budov. Teď už jen doladit ty kouzla v turnajových bednách.[BR][BR]@iDavis  A budou řešit konverzi již získaných plánků na KK, nebo budeme sbírat královské rekonstrukce od nuly?"}, {"102": "řekl bych, že budeme sbírat od nuly a leda tak možná bude nějaký způsob je přeměnit, ovšem to ani podle mě není potřeba z toho důvodu, že budeme získávat obojí. Jestli jich získáme 5 je to sice málo, vylepšit jeden set mi bude trvat 18 týdnů, což je dost na pytel ale jako přijde mi to celkem OK z pohledu, že to není žádný podraz ale prostě nová funkce. Lepší jak drátem do oka."}, {"31": "@Prealiena to neviem povedať, každopádne ja si tiež myslím, že budeme zbierať od nuly. Stavím sa ale, že turnaje nebudú jedinou možnosťou ich zbierania, už to že z varianty \"jedno kúzlo na budovu\" spravili \"jedno kúzlo na políčko budovy\" vypadá tak, že majú v pláne ich trúsiť kde tade po akciách. "}, {"3": "beztak půjdou i vyrábět v akademii"}, {"116": "Silversnake napsal/a:\t\t\tJá ten Event raději nekomentuji. Byl bych velice vulgární. Úkoly 30 + 33 zase pakárna. Stavět zase nějakou budovu až na 16 level se mi rozhodně nechce.\t\tKlikněte zde pro zvětšení...Staci vylepsit div ni ?"}, {"16": "@kalicz To platí jen pro některé hráče. Kupříkladu většina mých divů je po roce a půl hraní na levelu 6 (maximum 9)."}, {"102": "To jo, taky jedu divy postupně vyrovnaně. Takže jediné co mám nad 16 levelem je propast zbytek se mi fláká na cestě mezi 6 až 11 levelem a bude trvat ještě hodně měsíců, než se to vše dostane na 11."}, {"31": "Sneak Peek: Šachování s výrobními recepty #1[BR][BR]Spoiler: Sneak PeekKoně, věže, střelci, dostavit se na místa,[BR]po několika výrobách bude nová setová kolekce téměř jistá.[BR][BR][IMG]https://i.ibb.co/qy5sFLd/https-i-ibb-co-DKR6-DTf-EL-sneak-peek-1-2-2019-png.png[/IMG]"}, {"2": "Jako že bude set který bude vyrábět královskou rekonstrukci?"}, {"31": "@GorGlin nie, bude to set ktorý sa bude dať vyrábať v craftingu."}, {"2": "hm, tak na to jsem zvědav"}, {"18": "Tak to já taky, jsem zvědav co to bude umět"}, {"16": "Semínka zřejmě (nevím, zda všechny budovy nebo jen některé ze setu). Na betě je obrázek čistě semínkové budovy ze setu."}, {"102": "Ty bonusy jsou následující, ale hledat všechny ty levely se mi nechce, takže jsem si našel jen pro sebe Amuni[BR][BR]Nižší levely cca[BR]A mana -> boosted_plus_1_quality_3 -> zásoby[BR]B vždy mince[BR]C semínka -> mana -> boosted_plus_1_quality_3 -> zásoby[BR]D vždy zásoby[BR][BR][BR]Amuni[BR]A, čas sběru 1d, mana 3300, kultura 3100[BR]B, čas sběru 1d, mince 71000, kultura 2100[BR]C, čas sběru 1d, semínka 260, kultura 1260[BR]D, čas sběru 1d, zásoby 3800, kultura 1540[BR][BR]Konstrukti [BR]A, čas sběru 1d, mana 4400, kultura 3700[BR]B, čas sběru 1d, mince 82000, kultura 2500[BR]C, čas sběru 1d, semínka 280, kultura 1540[BR]D, čas sběru 1d, zásoby 4400, kultura 1870[BR][BR]kdo si chce najít zbytek, tak xml.balancing.city.Buildings_ a id to má A_Evt_Set_A_Chess[A-D][BR][BR][BR]Ale co jsem našel mě moc nepotěšilo [BR][BR]Vylepšení hlavního sídla na konstrukty už nebude jen za manu, ale už chtějí vše[BR]32 level \"money\":6500000,\"population\":1570,\"culture\":1772,\"mana\":770000,\"seeds\":90000,\"orcs\":45000[BR]33level \"money\":6900000,\"population\":1997,\"culture\":1965,\"mana\":910000,\"seeds\":100000,\"orcs\":50000[BR][BR]Celkem po započítání bonusů z Horského sídla a Zlaté propasti budu na konci v Konstruktech 13100 lidí v mínusu oproti současnému stavu, tzn budu muset doufat, že v eventu bude něco pěkného abych vyměnil popkulturní budovy a trochu potuním asi divy."}, {"73": "Nevíte někdo jak to vypadá s eventem, kdy začne?"}]