[{"31": "@LuciskaCh nie sú momentálne žiadne dostupné informácie o termíne, musíme čakať.."}, {"2": "A podle té zamlžené půlky obrázku to bude v náhodných odměnách za řemeslnou výrobu?[BR]Takže jeslti ho postavím bude věc štěstí a ne práce?"}, {"72": "Už teď je tam tolik věcí, v craftingu, že šance aby ti přišlo něco kloudnýho je malá. Čím víc tam přidají položek, tím to bude horší."}, {"59": "Tak já nevím, ať se na ten set z craftingu dívám jak chci, nic na něm nevidím. Jedině, že by části setu byly 1x1."}, {"147": "LuciskaCh napsal/a:\t\t\tNevíte někdo jak to vypadá s eventem, kdy začne?\t\tKlikněte zde pro zvětšení...Až si soudruzi přepočítají uzlíky v kalendáři a zjistí,že 31.ledna už bylo.Jak slibovali... [smilie--sprite2]"}, {"59": "@greenhornjerry A on někdo z INNO sliboval datum zahájení události?"}, {"28": "@pes63 Jsou 2x3, 1x4, 1x3, 3x1.[BR]Spoiler[IMG]https://i.ibb.co/KmFYy3X/http-ipic-su-7y-Dri-A-png.png[/IMG][BR][IMG]https://i.ibb.co/vB3QWHV/http-ipic-su-7y-Dri-H-png.png[/IMG][BR][IMG]https://i.ibb.co/mTTjJYs/http-ipic-su-7y-Dri-K-png.png[/IMG][BR][IMG]https://i.ibb.co/NtRZTVP/http-ipic-su-7y-Dri-N-png.png[/IMG]Jinak set mě taky neoslovil, a to ani vzhledově [smilie--sprite1][BR][BR]@greenhornjerry To byl pouze odhadovaný termín, který vycházel z toho, že běžně u nás bývají událostí s týdenní zpožděním od bety. Nikdo nic nesliboval. Počítá se s tím, že se to může změnit [smilie--sprite1]"}, {"59": "@Thespia já si na vzhled příliš nepotrpím, ale kdyby alespoň jeden z bonusů toho setu měl významnější přínos, jenže takto mi to alespoň řekněme od Amuni přijde jako čirá ztráta místa."}, {"147": "Ráno jsem byl na betě a nic se tam neděje. Podle starších zpráv na foru v roce 2017 probíhal Valentýn zde již 2.2. Asi se budete divit,ale Valentýn je v kalendáři vždy 14.2."}, {"59": "@greenhornjerry a co jako? Jsem to napsal dřív než Thespia, tedy nechápu. Jinak mám raději takovou tu klasickou oslavu lásky, třeba podle Máchy. [smilie--sprite1] Zavlečené svátky nejsou tím pravým ořechovým. I když zde ve hře plně chápu [smilie--sprite1] a nezáleží mi příliš na tom, kdy bude událost spuštěna."}, {"31": "Všetky detailné špecifikácie jednotlivých budov z nového šachového setu nájdete už v tejto chvíli v téme Speciální budovy - Časti šachového setu. Okrem toho, vytvoril som nový prehľad Setové budovy, v ktorom nájdete detailne popísané všetky produkcie prepojených budov, ktoré sú súčasťou setov. V časti Setové budovy - Magical Chess Set nájdete popísaný už aj nový šachový set. V príspevkoch pred ním som spätne pridal aj sety z poslednej zimnej udalosti, aby sa obsahovo zjednotili prehľady Speciální budovy a Setové budovy."}, {"74": "@ExplorerFfff,[BR][BR]Ale co jsem našel mě moc nepotěšilo [smilie--sprite3][BR][BR]Vylepšení hlavního sídla na konstrukty už nebude jen za manu, ale už chtějí vše[BR]32 level \"money\":6500000,\"population\":1570,\"culture\":1772,\"mana\":770000,\"seeds\":90000,\"orcs\":45000[BR]33level \"money\":6900000,\"population\":1997,\"culture\":1965,\"mana\":910000,\"seeds\":100000,\"orcs\":50000[BR][BR]Já jsem na to připraven [smilie--sprite1]"}, {"102": "Já taky, ale stejně mě to netěší že to za to musím vyhodit [smilie--sprite8]"}, {"2": "Na semeno jim dlabu, ale temi orky me stvou.[BR]Pouzivam je na armadu, 100k je fakt hodne"}, {"5": "...co se čílíte vše se dá v klidu pomalu ,,povyrábět,, něco hned jiné později...nic není zadarmo, hlavně že se něco bude dít a výzkum se hýbat /šourat/  [smilie--sprite1]"}, {"59": "Na mobilní apce je už při logování valentýnský obrázek :-D"}, {"136": "To nic neznamená.[BR]Je tam už několik dní. [smilie--sprite11]"}, {"31": "Môže to znamenať len to, ze sa akcia objaví do dvoch týždňov (keďže update aplikácie je raz za dva týždne a zmena načítavacej obrazovky sa vykonáva iba pri ňom)."}, {"102": "Ví někdo co bude Sada konstruktů ? To přijde asi v jarním eventu, že ? To totiž vypadá, že buď ještě není hotové a nebo to bude úplně něco nového."}, {"31": "@ExplorerFfff osadnícke manufaktury novej rasy budú fungovať na princípe setov, ktoré poznáme z udalostí (tj. jedna pripojená na portál a zvyšné navzájom poprepájané, od čoho bude závisieť výška (možno typ) produkcie). To je sada konstruktů."}]