[{"102": "To mě napadlo, když jsem viděl jen 4 levely, tak to bude zajímavé. Díky "}, {"66": "Ať žijí sety. Musíme je nacpat všude, kam se vejdou."}, {"90": "Na druhou stranu zase nebudou potřeba nějaké ty zváštní cestičky pro spojení s portálem. Což se mi jeví skoro jako výhoda.[BR][BR]Odstraněna citace. Embla"}, {"2": "to se ukáže[BR]v draco byli taky bec cest, ale o to méně variabilní bylo jak to tam napasovat"}, {"65": "no hlavně že to nebude chtít rozházet osadníky do všech koutů města, jako kočičáci. celou kapitolu koukat na ty nepříliš estetické modré obytky a mezi nima naházené kočkoviny se mi úplně nelíbilo. na druhou stranu ta kultura z osadnických cest / kanálů / pyramid se hodí."}, {"16": "@CorwinOfAmber Lv 1 obytka / dílna to řeší. A můžou si zůstat ve svém ghetu (ale stejně se na ně musíš dívat, pokud chceš jet jejich výrobu častěji než jednou za 3h."}, {"102": "No tohle ale bude mít dost vliv na to, jak to složíme. Jako jsou to 4 budovy, všechny mají tři unikátní linky, od každé snad lze mít maximálně 4, takže člověka bude dost limitovat tvar. Jinak celá rasa by měla být okolo 460 čistých dílků plus prázdná místa pokud to nepůjde složit beze zbytku a to je velká neznámá, resp já bych si to klidně uměl složit, jen jsem línej si ty budovy vystřihnout za papíru, nebo bych si klidně mohl v elvenarchitectu zvolit nějaké co odpovídají rozložení ale stejně... lenost no uvidím třeba semi za den bude chtít [BR][BR]Edit, tak mi to nedalo[BR][BR]"}, {"31": "Obrázky budov novej rasy[BR][BR]Spoiler: Animované obrázky[BR]Manufaktura na drahokamy[BR][IMG]https://i.ibb.co/FxZGqj5/http-ipic-su-7y-Ds-X8-png.png[/IMG][BR][IMG]https://i.ibb.co/Lz24Rzq/http-ipic-su-7y-Dt6x-png.png[/IMG][BR][IMG]https://i.ibb.co/xhGcVkc/http-ipic-su-7y-Dt6k-png.png[/IMG][BR]Na tomto obrázku môzeme vidieť novú obytnú budovu, dielňu, vpravo nové tržište (level 5) a dole manufakturu na kouzelný prach (level 27).[BR][IMG]https://i.ibb.co/LYQPZ8z/https-i-imgur-com-w-BRx-NQ5-png.png[/IMG][BR]Hlavní sídlo[BR][IMG]https://i.ibb.co/DpPgCFq/https-i-imgur-com-Ke-Qcab-B-png.png[/IMG][BR]Manufaktura na elixíry[BR][IMG]https://i.ibb.co/QNTxNzq/http-ipic-su-7y-Dt7-G-png.png[/IMG][BR]Manufaktura na kouzelný prach[BR][IMG]https://i.ibb.co/Pj74yFX/http-ipic-su-7y-Dt7-R-png.png[/IMG][BR][IMG]https://i.ibb.co/m9qYf6G/https-www-zupimages-net-up-19-05-ge37-png.png[/IMG][BR]​"}, {"74": "Njn, my \"elixíristi\" máme zase ošklivou budovu s doškovou střechou. Všude samá ekologie a já zase budu muset každé 2 roky volat revizáka na kotel. Podle toho jak to čoudí, tak to nemá vyšší emisní třídu jak 3. Ach jo...."}, {"15": "budovy jsou nádherné ,jsem zvědavá . "}, {"2": "Elixír mi nepřipadá nijak zlý[BR]prach je horší[BR]ted ho budu stavět na živoucí zboží a to mamutí pohřebiště mě nijak netěší"}, {"130": "Ahoj všem [BR]nechci vypadat jako blbec ale to bude jako nová rasa ktera bude nasledovat po Amuni ?"}, {"73": "ano, cca od strany 77 jsou postupně zmínky"}, {"40": "No co? Budeme  bořit, přestavovat,šetřit místem. [BR]Času bude hafo. Další rasa pro nedočkavé bude na podzim?[BR]Spestří to eventy a DS ;-)"}, {"119": "Budovy vypadaji zajimave.Jsem uz nedockava na novou rasu  Budu muset hodne bourat,aby se mi to vse veslo do mesta....ale na to uz jsem si davno zvykla "}, {"65": "mně se manufaktury libí všechny (i když je škoda, že elixír přijde o ten větrný mlýn..) opět mě trochu zklamalo, že obytky/dílny/sídlo jsou zase stejné, jako už 3 kapitoly před tím - na druhou stranu jsou aspoň o poznání hezčí, než ty amunské, takže aspoň tady je zlepšení. [BR][BR]a jak bude vypadat cvičák?  (ten by měl mít asi specifickou robotí architekturu hádám)"}, {"102": "cvičák se myslím nevylepšuje, jen tábor žoldnéřu ne ?"}, {"31": "Tábor nie, ten bol v Amuni, cvičisko sa bude vylepšovať. Obrázok dám ráno.. "}, {"43": "No tak koukám,budovy vypadají pěkně,ale bude sranda to poskládat s minimálními ztráty.Nerad bych moc boural co jsem vytvořil... "}, {"43": "Silversnake napsal/a:\t\t\tNjn, my \"elixíristi\" máme zase ošklivou budovu s doškovou střechou. Všude samá ekologie a já zase budu muset každé 2 roky volat revizáka na kotel. Podle toho jak to čoudí, tak to nemá vyšší emisní třídu jak 3. Ach jo....\t\tKlikněte zde pro zvětšení...Mě se právě budova na elixíry líbí.Mám rád takový ten jakoby starší styl a zeleň,což zde je.  To spíš ten prach se mi nelíbí,ještě že ho nemám..."}]