[{"102": "Já budu mít taky elixír jeden a popravdě vypadá nízký, takže super, ale ty drahokamy vypadají vysoké to bude na prd :/"}, {"31": "Tu je obrázok budovy Cvičiště level 24[BR][BR]Spoiler[IMG]https://i.ibb.co/MGyqZdM/https-i-ibb-co-m9-RVq-Xf-gr9-orcs-barracks-24-png.png[/IMG][BR]+ tu budú ešte nejaké animované prvky"}, {"5": "...animované prvky...já bych tam chtěl krtečka prosím...hele hele [smilie--sprite1]"}, {"102": "Tak na cvičák jsem zapomněl a to mi bude chybět asi více lidí než jsem počítal :/"}, {"16": "Jo, já už na to strategii vymyslel. Postavím tolik domečků navíc, kolik bude potřeba a to vše na úkor budov rasy. O to déle budu kapitolu procházet. Předpokládám, že u Borgů klesne moje místo na rasu někam k 10% rozlohy města (v průběhu kapitoly možná mírně vzroste, ještě mám pár rozšíření z provincií a k tomu máme to 1 luxusní z výzkumu)."}, {"99": "Tak na betu byli právě vypuštěni [smilie--sprite1]"}, {"31": "Na betu prichádzajú.. [smilie--sprite1][BR]Konstrukti[BR][BR]Spoiler: Konstrukti[IMG]https://i.ibb.co/DGWKnY7/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-constructs-Forumann-Constructs-png.png[/IMG][BR]Všetky sneak peeky a predchádzajúce informácie, ktoré sa už k tejto rase objavili:[BR]Sneak Peek 1Sneak Peek 2Sneak Peek 3Lidé a elfové 1Lidé a elfové 2Obrázky 1Obrázky 2Obrázky 3Obrázky + animované obrázkyObrázky 4[BR][IMG]https://i.ibb.co/pLhD8fr/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-constructs-TTIcon-png.png[/IMG][BR]Doposiaľ nezmienenou novinkou je fakt, že produkovať budeme priamo v portáli, v ktorom si údajne budeme môcť zahájiť poradie produkcií. Cieľom produkcie bude vyrábať dve dôležité suroviny Elvarium a Humanium, potrebné na progres v kapitole.[BR][BR][IMG]https://i.ibb.co/WsZHBmk/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-constructs-Timewarp-Res2-png.png[/IMG][IMG]https://i.ibb.co/Pw4TsSk/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-constructs-Simia-Sapiens-Res2-png.png[/IMG][BR]Nové prastaré divy Časový skok a Simia Sapiens (zatiaľ nepresné názvy). Jeden z nich zvýši produkciu všetkých druhov živoucího zboží a skráti prodlevy medzi turnajovými kolami, druhý zvýši produkciu jednotiek vo všetkých vojenských budovách a zníži rozpad živoucího zboží.[BR][BR]Spoiler: Hodnoty prastarých divovHodnoty pre Časový skok - stĺpec vľavo výsledný čas po redukcii prodlevy v turnajoch, stĺpec vpravo výsledné hodnoty po zvýšení produkcie živoucího zboží.[BR][IMG]https://i.ibb.co/gMn3m5R/https-i-ibb-co-NY34-JPb-EL-konstrukti-div-1-hodnoty-5-2-2019-png.png[/IMG][BR][BR]Hodnoty pre Simia Sapiens - stĺpec vľavo zvýšenie produkcie jednotiek, stĺpec vpravo výsledné hodnoty rozpadu po znížení rozpadu živoucího zboží.[BR][IMG]https://i.ibb.co/x3313Bt/https-i-ibb-co-j3dd8-ZF-EL-konstrukti-div-2-hodnoty-5-2-2019-png.png[/IMG][BR]Časť výskumu:[BR][BR][IMG]https://i.ibb.co/MCtmwzv/https-i-ibb-co-St-T0-XWY-EL-konstrukti-v-skum-5-2-2019-png.png[/IMG][BR][BR]Podobne ako vylepšenie hlavního sídla, aj výstavba ciest bude vyžadovať už aj iné zdroje, ako len manu:[BR][BR][IMG]https://i.ibb.co/s6Npv9j/https-i-ibb-co-4-WGk-Frn-EL-konstrukti-cesty-5-2-2019-png.png[/IMG]"}, {"99": "@iDavis : Nevíš prosím, jak přesně bude fungovat zvýšení produkce jednotek? Budeme produkovat více za stejný čas nebo více najednou a tím se nám čas prodlouží?"}, {"16": "@Angedev Logicky by nám to mělo buď zvýšit produkci jednotek za stejný čas nebo při vybírání jednotek dát určité % jednotek navíc (asi podobně jako pyramida očištění vyrábí prošlé zboží při produkci orků, jen v tomhle případě se jedná o stejnou komoditu - vojáky). Jinak by to nebyl žádný bonus navíc, ale prostě další div z řady Val, houbičky."}, {"31": "@Angedev viac za rovnaký čas, doba trvania produkcie jednotiek sa nezmení, akurát dostaneme pri každej nejaké % jednotiek naviac. Do spoileru vyššie som už pridal aj tabuľky s konkrétnymi hodnotami týchto divov pre všetky ich levely."}, {"102": "Lovec Krys napsal/a:\t\t\tJo, já už na to strategii vymyslel. Postavím tolik domečků navíc, kolik bude potřeba a to vše na úkor budov rasy. O to déle budu kapitolu procházet. Předpokládám, že u Borgů klesne moje místo na rasu někam k 10% rozlohy města (v průběhu kapitoly možná mírně vzroste, ještě mám pár rozšíření z provincií a k tomu máme to 1 luxusní z výzkumu).\t\tKlikněte zde pro zvětšení...[BR]To mě čeká taky, ale tak nějak furt doufám, že by mohlo pomoci RR a vylepšení několika eventovek by mi dalo lidi. Ještě uvidím jakou strategii zvolím až budou konstrukci v architektu."}, {"31": "Podľa najnovších informácií sa Valentínska úkolová rada začne 7.2. Všetky detailné informácie k nej nájdete už v tejto chvíli v novej téme Události a úkolové linie - Valentýn 2019."}, {"72": "No herdek, dycky chyběla mana, teď na ní udělali dva eventy, tak už by chybět tolik nemusela.. a oni ji přestanou ve výzkumu vyžadovat..[BR]A jako bonus, všude kde dosud stačila mana, jsou semena a orci.. seřezat na hromádku [smilie--sprite6]"}, {"65": "@athlan : však i amuňáci postupně snižují manovou náročnost - jakmile máš postavenou osadu, tak mana už je jen na 2 vylepšení sídla a prastaré divy."}, {"62": "Budovy se mi po dlouhé době opravdu líbí. Těším se na přetvoření města. Styl Amuni mi moc nesedí."}, {"16": "Borgové přicházejí.[BR]A mají pro lidstvo zprávu:[BR]Odpor je marný...[BR]budete asi milováni."}, {"59": "Opar vidění, aha... no koukal jsem se na Wiki, chvíli jsem nevěděl, co to vlastně je...ale co je tohle? [BR][BR]\"budete potřebovat 3 vstupní zdroje: spojovací činidlo, úlomky kouzel a opar vidění. \" [BR][BR]Opar vidění slouží k získání tajemného objektu, ale té větě výše nerozumím. Bude se používat k nějaké výrobě?"}, {"28": "@pes63 To čím se plní ta truhla (tajemný objekt) v řemeslné výrobě."}, {"59": "@Thespia truhla se plní oparem vidění, chápu.. ale co tedy ta věta ve Wiki.. \"budete potřebovat 3 vstupní zdroje: spojovací činidlo, úlomky kouzel a opar vidění. \" [BR]Vždyť truhla se plní jen oparem vidění.."}, {"28": "@pes63 To je asi myšleno pro řemeslnou výrobu celkově [smilie--sprite1]"}]