[{"99": "Neví někdo, jestli se spojení portu s portálem taky počítá jako bonus ze setu? Nebo i na ten první port musím mít napojené 3 další, abych dosáhla maximálního bonusu?"}, {"74": "No manu bude potřeba stále, asi i na výrobu jednotlivých dlaždiček na plovoucí podlahu....[BR][BR]Ale zase koukám že jsou nové kulturky, např Akvadukt nám dá 20K many/18h + 7100 kultury při rozměru 4x6"}, {"16": "@Silversnake A žere to při stavbě semena. Ještě že mám eventovky, ty se staví bez semen."}, {"99": "Já budu mít problém s lidmi... Zatím jsem si jen cvičně v architectovi vytáhla všechny budovy na maximum a vyhodilo mi to 18k lidí v mínusu  Snad to zachrání kult+pop hybridi "}, {"65": "@Lovec Krys : veškerá kultura žere semínka už od půlčíků  tys zvolil cestu many z eventových budov, takže za tohle ušetříš - ale za cenu nízké kultury, protože většina eventovek na manu dává kultury pramálo. [BR][BR]kočky jsem končil asi s 5k kultury, co jsem postavil sídliště ze sfing a cesty, jsem na 50k. něco umažu, ale ještě dostanu zase 5k za poslední vylepšení strážní věže. takže i v této fázi hry se to dá s kulturním bonusem."}, {"16": "@CorwinOfAmber Jo, to jsem viděl, že to žere semena už u půlčíků. Což, pokud nemá člověk zdroj semínek z kulturek je pak problém, jakmile začne produkovat T4+ (a ještě je používat na výzkum). I já budu potřebovat obnovit semínkové kulturky, jakmile přibude ještě T6, tak nejspíše začnu mít semínek málo.[BR](a až se jednou Inno rozhodne do výkupů v turnaji zamíchat prošlé zboží, to bude teprve veselo - to se kvůli limitu semínek většině pokročilých hráčů výkupy v turnaji prostě zhroutí)[BR][BR]Tak kulturu z eventovek zase tolik nepotřebuju, jakmile obnovím ty staré eventovky z půlčíků/elementálů, tak jí zase bude dost. A do budoucna stejně ještě budu vylepšovat kulturu dávající divy, takže hybridy budou na kulturu bohatě stačit (pokud nebudou stačit jen ty divy).[BR]A já na kulturní bonus nehraju. Pro kritické špičky ve spotřebě mincí mám požehnání. Deficit kladívek mám pořešen kouzly, kterých mám velkou zásobu z turnajů - prostě tak 2-3x týdně okouzlím dílny a je to."}, {"65": "@Lovec Krys : to jsem nejvíc pociťoval na konci elementálů - buď jsem vyráběl živoucí zboží nebo mi manufaktury stály a šetřil jsem semena na výzkum. v amunech už to bylo ale úplně v pohodě. roboti naštěstí žádná semena na výzkum chtít nebudou, takže tu výrobu živoucícho zboží by to snad mohlo pokrýt. no uvidíme, co bude žrát osadnická výroba. [BR][BR]já mám třeba jenom obchoďák a pár semínek navíc denně ze setů. no raději budu levelovat divy, ať zvýším tu nejefektivnější produkci - trh.[BR][BR]co se kultury týče, tak těch 50k tak nějak počítám, že mi i s rezervou pokryje novou kapitolu. víceméně se snažím o to, že když nic nikde nestavím, aby mi denní přísun kladiv pokryl výdaje. kouzel mám sice dost, ale taky s nima musím občas šetřit - když jsem jel celé amuni (asi 1.5 měsíce) dílny permanentně okouzlené, jakože fakt každý den."}, {"102": "Dokáže někdo vymyslet lepší rozložení? Kromě jedné budovy by mělo mít vše max tedy 3 linky. Trochu se jen bojím aby Core nebylo nutné mít uprostřed ve smyslu hierarchie a na to vždy napojit jeden z těch elementů?[BR][BR][IMG]https://i.ibb.co/QmSf83Z/https-cz-forum-elvenar-com-index-php-attachments-2019-02-06-132938-jpg-2913.jpg[/IMG][BR][BR]A jako ta spotřeba té many bude tedy masakr https://www.elvenarchitect.com/buildings/details/b_gr9_portal/"}, {"126": "ExplorerFfff napsal/a:\t\t\tDokáže někdo vymyslet lepší rozložení? Kromě jedné budovy by mělo mít vše max tedy 3 linky. Trochu se jen bojím aby Core nebylo nutné mít uprostřed ve smyslu hierarchie a na to vždy napojit jeden z těch elementů?[BR][BR]Zobrazit přílohu uživatele 2913[BR][BR]A jako ta spotřeba té many bude tedy masakr https://www.elvenarchitect.com/buildings/details/b_gr9_portal/Klikněte zde pro zvětšení...[BR]Zatím jsem sestavil toto, krom 2.budov by to mělo sedět. Ještě zkusím poladit. Ale ušetří to celkem místo takto, možná těch 2x50% navrch oželím [BR][BR]https://www.elvenarchitect.com/city/planner/52635cf4b4844d859c8726bb1aec0bfb/"}, {"59": "@BiggJOEcz tak jestli to dotáhneš, mrskni to sem "}, {"72": "Tak na betě další event, karneval, teď nás teda zásobujou "}, {"102": "To bude podle mě ale až jarní, resp ten co by měl přijít v Březnu ne ?"}, {"72": "Bůhví. je tp na tři týdny, jsou zas překopaný truhly, hlavních odměn je pět (asi set), jsou za vlaječky na šnůře, nebudou dny s dably.. podrobně to sem jistě hodí iDavis. Myslím že ani on to nečekal tak brzo [BR][BR][IMG]https://i.ibb.co/PGCQLbz/http-images-athlan-net-i-1906-1-karneval1-png.png[/IMG]"}, {"16": "A hlavně jsou přímu luxusní ty bedny s 5% šancí na denní budovu. Doufám, že tam jsou i lepší (na betě mám v nabídce 22-5%,46-5%,66-15%).[BR]S takovými šancemi si můžeme o 10 a více budovách nechat jenom zdát."}, {"102": "Víc jak 15% jsem zatím neviděl."}, {"72": "Na druhou stranu jsou ty bedny relativně levnější, takže více točení a šance na drop většího množství bonbonů, tedy pokud samozřejmě neořezali i množství těch bombonů co jde získat v úkolech."}, {"16": "K čemu nám je více šancí, když pak z těch beden dostaneme houby s octem. To pak ty denní odměny jsou v podstatě k ničemu, když se skoro nedají získat..."}, {"127": "A ake tam su sance u dalsich veci v truhlach? A co tam je vlastne ine? Ma niekto obrazky?"}, {"16": "@PankerSK Nemůžu říct všechny, ale já na betě mám:[BR]Truhla za 22 sladkostí:[BR]5% Denní budova[BR]10% 75 sladkostí[BR]40% Déšť mincí 10%[BR]45% 1xRuna[BR][BR]Truhla za 46 sladkostí:[BR]5% Denní budova[BR]10% 100 sladkostí[BR]40% Déšť mincí 10%[BR]45% Portálové požehnání 10%[BR][BR]Truhla za 66 sladkostí:[BR]15% Denní budova[BR]10% 200 sladkostí[BR]35% Portálové požehnání 15%[BR]40% Déšť mincí 33%[BR][BR]Takže jen očekávám, kdy se objeví případy, že hráči použili všechny sladkosti a nedostali z celého eventu ani jedinou denní budovu.."}, {"117": "to je trapas zase"}]