[{"74": "Tak za 12 dní mi skončí s produkcí poslední kupecké základny. Do Konstruktů tedy vstoupím s cca 280 kusy 5% portálový bonus. Tak si myslím, že jsem dobře investoval."}, {"102": "To by jsi možná nemusel ani levelovat portál a celej výzkum zaplatit jen na prvním levelu samotného portálu ne ? [smilie--sprite8]"}, {"31": "Karnevalová udalosť[BR][BR]Spoiler: Karnevalová udalosť[IMG]https://i.ibb.co/kMkXjqD/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-carnival2019-Forum-Banner01-png.png[/IMG][BR]Predpokladaný termín: čoskoro[BR][BR]V tomto príspevku budem ako obvykle postupne dopĺňať jednotlivé informácie o novej udalosti. Prišla teda skôr ako som očakával, ale ešte je pred nami valentínska úkolová rada, takže času dosť.[BR][BR]Spoiler: ÚlohyKompletný prehľad udalosti nájdete v téme Události a úkolové linie - Karneval.[BR]Plnením úloh budeme získavať sladkosti, ktoré budeme potrebovať na otváranie rotujúcich truhiel. Tieto truhly nám budú poskytovať vlajky, ktoré budeme zase potrebovať na odomykanie hlavných cien. K získaniu bude nový set, tentokrát všetky jeho diely súčasťou iba hlavných odmien. Behom tejto udalosti nebudú dvojnásobne dni na získavanie vlajok.[BR][BR][IMG]https://i.ibb.co/8bCsjhq/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-carnival2019-Carnival-Set-png.png[/IMG][BR][BR]Detailné špecifikácie budov[BR]Detailné špecifikácie setu[BR][BR][IMG]https://i.ibb.co/5v5WVXb/https-i-ibb-co-n1-GKYLG-EL-akcia-karneval-2019-zoznam-truhiel-png.png[/IMG][BR][BR]Spoiler: Obrázky[BR][BR][BR][BR]"}, {"16": "@ExplorerFfff Levelovat portál bude muset kvůli kapacitě."}, {"72": "Lovec Krys napsal/a:\t\t\tK čemu nám je více šancí, když pak z těch beden dostaneme houby s octem. To pak ty denní odměny jsou v podstatě k ničemu, když se skoro nedají získat...\t\tKlikněte zde pro zvětšení...No, vždycky jsem točil výhradně nejmenší truhly a zas tak jednoznačnej neúspěch to nebyl. Ani matematická šance nebude tak hrozná. Nicméně praxe ukáže, pořád je to random a budou hrači, co mít štěstí budou a my, co třeba ne [smilie--sprite1][BR][BR]Možná bude paradoxně těžší tzískat ty hlavní, protože to vypadá, že jsou prokládané dalšími budovami."}, {"31": "Všetky budovy dostupné počas karnevalovej udalosti nájdete v téme Speciální budovy - Karneval 2019, rovnako tak setové budovy v téme Setové budovy - Carnival Set. Zatiaľ nie sú k dispozícii české názvy (je možné, že už budú po dnešnej aktualizácii hry) a taktiež niektoré z obrázkov sa ešte nemusia zobrazovať správne (niektoré majú iba placeholder alebo neúplné animované prvky, to budem postupne opravovať).[BR][BR]Zároveň, začínajúc karnevalovou udalosťou som sa rozhodol vykonať nejaké zmeny v systéme tvorby tabuliek k budovám a setom. Z vášho pohľadu sa na tom v podstate nič nezmení (teda nemalo by sa), ide iba o spôsob, akým ich vytváram. Behom poslednej doby som pracoval na vlastnom programe, ktorého cieľom je práve toto vytváranie tabuliek. Používanie tohto programu mi ušetrí veľa času a umožní mnohokrát vkladať hotové tabuľky aj skôr. Toto je prvá udalosť, ktorej všetky tabuľky sú robené cez tento program, bez môjho akéhokoľvek manuálneho zasahovania. Chcel by som vás teda požiadať, v prípade že nájdete v týchto nových tabuľkách nejakú chybu, dajte mi vedieť (najlepšie súkromnou správou), aby som ju mohol čo najskôr opraviť. V budúcnosti budem využívať už len tento program a je teda dôležité, aby bol naozaj bez chýb (program stojí na vedomostiach zo zatiaľ len jediného semestra, takže tak [smilie--sprite8]). Je teda pravdepodobné, že sa v tabuľkách nebudú objavovať nejaké preklepové chyby, skôr sa ale môže jednať o chyby generické, ktoré sa prosto v istých variantoch budov môžu opakovať.[BR][BR]Chyby o ktorých momentálne viem:[BR]nesprávny časový údaj prvého zberu produkcie v budove Jesters Tavern, toto opravím akonáhle zistím správny časový údaj - opravené[BR]nesprávne množstvá produkcie kouzelného prachu a drahokamov v setovej tabuľke budovy Jesters Tavern - opravenéNahlásené chyby:[BR]vymenené údaje dĺžka a šírka budovy - opravené"}, {"16": "@athlan No při 5% šanci pro nejmenší truhly - hodně štěstí.[BR]Matematicky a statisticky to možná vyjde, ale na to potřebuješ dostatečné množství pokusů.[BR]A nikdo z hráčů mít dostatečné množství pokusů nebude.[BR]Dle mě bude spousta zklamaných hráčů, kteří získají méně denních budov než dříve.[BR]A pokud nestojí o set (který stejně nezískají celý), tak je vymalováno.[BR][BR]A nikdo nevíme, zda se počet pokusů zvýšil adekvátně aby vykompenzoval snížené šance, nebo zda je to jenom výmluva jak dát hráčům méně odměn."}, {"56": "A nebo také způsob, jak z hráčů vytáhnout ještě více peněz. [smilie--sprite1]"}, {"119": "@BiggJOEcz to rozlozeni kolem portalu musi navazovat na urcite vyrobny? ja myslela,ze je to jedno jak to poskladam,hlavne kdyz se to bude dotykat [smilie--sprite9]"}, {"99": "@aikomi : Jestli to dobře chápu, tak dotýkat se to musí, aby to vůbec vyrábělo. Pak jde o to, jak velký bonus ze setu budeš mít, a tam už je třeba, aby se to dotýkalo různých budov [smilie--sprite1]"}, {"126": "bude to na stejném principu, jako u setových budov. Každá budova bude vyrábět 100% daného množství. Připojením na další budovy získáš za každou (né stejnou) budovu +50% k výrobě dané budovy, celkem tedy v ideálním případě, kdy by každá budova takto byla napojená ke 3.různým budovám (a pokud jsem dobře pochopil, tak i portálová budova se počítá jako +50% pro tu portovou budovu), tak bude každá ze 16.budov produkovat 250% daného množství pro ten level.[BR][BR]Zatím to takto na 100% má rozvržené právě ExplorerFfff . Ten můj pokus má zisk z 14.budov na 250% a 2.budovy na 200%. Zatím se mi to ale nedaří spojit jak esteticky, tak funkčně dohromady [smilie--sprite8][BR][BR]Ale stejně si myslím, že to šikulové z https://elvengems.com/constructs-preview/ sem během pár dní doplní to rozvržení budov, aby to bylo plně funkční [smilie--sprite2]"}, {"102": "Ano to tvoje rozložení je úspornější, ale mě se do místa na rasu nevejde asi na výšku, takže asi postavím tu svou variantu, kde až na jednu budovu bude mít vše max linků. Viz zde pro lidi Zprávy z beta serveru !!!SPOILERY!!! (jen ta dole vlevo má dva linky)[BR][BR]Třeba na Gems přijdou s lepším řešením, ono já pravděpodobně postavím jen portál a zbytek rasy postavím až po tom karnevalu, protože jinak bych byl cca v polovině rasy, než to přijde což je na prd a do další to máme stejně půl roku, tak není kam spěchat [smilie--sprite1]"}, {"126": "Tam mám finální řešení na všech 16.budov spojených na 250% bonusu [smilie--sprite2][BR]Nefunguje aktuálně  https://www.elvenarchitect.com/city/planner/ , tak pošlu foto :[BR][BR]https://ibb.co/TPnDghW"}, {"16": "By mě zajímalo, kde berete to místo na všech 16 budov."}, {"31": "Ako vidím, nová rasa je už popísaná aj na našej wiki. [smilie--sprite1]"}, {"43": "Silversnake napsal/a:\t\t\tTak za 12 dní mi skončí s produkcí poslední kupecké základny. Do Konstruktů tedy vstoupím s cca 280 kusy 5% portálový bonus. Tak si myslím, že jsem dobře investoval.\t\tKlikněte zde pro zvětšení...Já mám zatím připraveno na novou rasu 3x15%,51x10%,37x5%. [smilie--sprite1][BR][BR]Na Karneval se těším,hraji ho na betě a grafika,postupování a bedny jsou super. [smilie--sprite1][BR][BR]Příspěvky sloučeny. Embla"}, {"2": "ty seper bedny mi budeš muset vysvětlitprotočil jsme dnes přes 600 bobónů a nic."}, {"43": "No myslel jsem tím,že jsou za menší hodnoty,tudíš když se pak nahromadí ty věci co se sbírají,tak bude více protočení a i šancí a mě docela padalo to co jsem chtěl.Tak jsem zvědav jak to bude na ostro.A i tak celkově se mi to líbí,přijde mi to graficky přehlednější,jednodušší a efektnější,tak uvidíme... [smilie--sprite1]"}, {"125": "GorGlin napsal/a:\t\t\tty seper bedny mi budeš muset vysvětlitprotočil jsme dnes přes 600 bobónů a nic.\t\tKlikněte zde pro zvětšení...Neměls točit ty mentolový, neasi..."}, {"102": "Myslíte, že nám sem někdy nasadí aspoň těch 5 RR nebo budeme čekat, než si zase v kolečku zahulí a uvidí? Protože se pod eventovkama již objevila možnost dostupného upgradu, tak jsem si říkal, že stejně jako na betě by to tedy mohli dát před koncem turnaje ale viditelně to bude po a nebo vůbec? Ví se o tom něco více, než je na betě?"}]