[{"15": "Ještě není ani konec února a na Betě už jede Karneval ( nebo jsem to blbě pochopila  ) ?"}, {"16": "@Green Jane Ano, jede 4. den.[BR]Tentokrát bude zpoždění oproti betě více než 1 týden.[BR]Takže výhodou bude, že budeme znát více denních odměn dopředu (ikdyž s těmi šancemi se stejně budeme muset rozhodnout, co nám opravdu stojí za to, zřejmě jich budeme mít méně než dříve (největší bedna je za 66 s 15% šancí na budovu, bedny kolem 20-30 mají 5%))."}, {"43": "Ale i ty patnáctiprocentní mi padají budovy a je zajímavé,že lepší je to po půlnoci... "}, {"5": "Nějak mi uniklo: obytka konstrukti bude 3x5 nebo 5x3 ?? děkuji"}, {"119": "@ElfNostradamus myslim,ze tam bylo 5x3 "}, {"5": "...ajaj ta horší varianta pro mne a děkuji "}, {"74": "Taky jsem si nějak uspořádal město a budu to muset přestavět ....výrobny T3 jsem počítal, že zůstanou 6x4 a ono to přejde na 5x5[BR]3rd Tier Manufactory upgrades4 new levelsSize change – grows to 5×5Residences2 new levelsSeparate technology for each levelSize and Shape change – becomes 5×3Workshops2 new levelsSeparate technology for each levelNo size or shape change; remains 4×6Main Hall2 new levelsSeparate technology for each levelNo new size or shape change"}, {"5": "jojo vylepšení T3 bude i dobrý masakr na lidi"}, {"74": "@ElfNostradamus  to se zvládne, obytky dodají obyvatele a od konce Amunů tlačím přebytné body do HS a ZP. A pokud bude Královská rekonstrukce funkční, tak si upgradnem i Eventové budovy které mají pop/kult."}, {"102": "podle mě ty obytky ta lepší varianta, protože je to umožňuje mít na levé straně, což jez plánovacího a přehledného hlediska nejlepší varianta co lze mít, naopak zlo je nutnost mít je vlevo nebo dole, protože to celkově město znepřehledňuje."}, {"16": "@Silversnake No bez přidávání domečků to může být problém, jelikož na prvním levelu sice mají o políčko méně, ale dávají jen 100 pop navíc...[BR]Já nejspíše zbourám jednu ze 2 T4, co mám a nahradím ji T6 (ani ne tak kvůli populaci jako nárokům na semena)."}, {"126": "Silversnake napsal/a:\t\t\tA pokud bude Královská rekonstrukce funkční, tak si upgradnem i Eventové budovy které mají pop/kult.\t\tKlikněte zde pro zvětšení.....tak na toto čekám už přes 2.roky :-D   Stále si držím Horu ze sněhových vloček (ještě z kapitoly Víl) a Věž Krále Zimy (kapitola orků) Jenom z těchto dvou budov a jejich upgradem na poslední kapitolu získám +11.060 populace, jakmile to RR povolí a dovolí  [BR]Ať už je ta RR tady "}, {"102": "Jestli jí aplikují v tom stavu, v jakém je na betě, tak ti RR nijak nepomůže."}, {"126": "Jsem optimista "}, {"65": "kvůli RR si pořád šetřím ty chatrče na manu, 1 level za 4 kouzla nezni špatně - ale - jak nad tím přemýšlím... mám je na půlčíkovské úrovni, takže cca za 3 týdny vylepším na konstruktoidní úroveň. což nevím, jestli 3 týdny za jednu chatrč stojí - je to snadno získatelná budova, takže asi ty kouzla spíš vyhážu na vylepšení něčeho více exkluzivního. [BR][BR]co se nové kapitoly týče, tak architekt mi hlásí nějakých -10k lidí. pokud smažu jedny drahokamy. ale nové obytky přidávat odmítám, takže maximálně zaplním volné místo eventovýma hybridama, něco vylepším za RR a konečně se pustím do levelování propasti. než bude kapitola další, času dost ten deficit dohnat."}, {"117": "ExplorerFfff napsal/a:\t\t\tJestli jí aplikují v tom stavu, v jakém je na betě, tak ti RR nijak nepomůže.\t\tKlikněte zde pro zvětšení...Jakto? Můžeš to nějak pro nás méně bystré rozvést?? "}, {"102": "Protože z jednoho 10. trunaje jich máš jen 5, no a tedy jen na to aby si člověk převedl dožínkový set potřebuješ 42 kouzel. To ti bude trvat 8 týdnů, to je zhruba doba mezi běžnýma rasama, takže pro lidi co nejsou na konci, jsou RR momentálně naprosto k ničemu. V případě, že na konci jsi, tak reálně lze táhnout stejně jen cca 90 políček, což je tak jeden menší set, či set 4 stromů na manu, nic víc táhnout za 6 měsíců nepůjde. Opět prakticky nepoužitelné, dojdeme tedy k tomu, že RR je fajn, ale bude to asi na úrovni urychlovače 3 min. Kouzel by muselo být alespoň 15-20 za týden aby se dalo na kouzla spolehnout co se produkce a nějaké plánování týče, jinak stále člověk musí plně spoléhat na eventy, kterých za 6 měsíců máš několik a město si tak vyměníš, pro ty na konci tedy až tak \"must have\" není, ale pro lidi co na konci nejsou je dle mého názoru momentálně RR celkem k ničemu.[BR][BR]Já ale samozřejmě počítám, že v nějaké dální výzvě budou tyhle kouzla jako odměna. Nebo je minimálně půjde craftit, to není nijak zaručené ale je to moje domněnka na základě vývoje hry. Jen obojí je už závislé na eventech či akcích, tzn to prakticky moc neřeší situaci, když musíme v eventu hrabat abychom získali výměnu budov."}, {"117": "Tak ono by stačilo  aby to bylo tak, jak se myslelo na úplném prvopočátku,a to 1 kouzlo a vylepší jednu budovu (mělo se to týkat jak event budov tak kouzelných) jenže to jim došlo  že bychom z toho měli více  než se jim líbí, tak to opravili do tohoto hybrida... nako dávat stovky těchto kouzel di 1 budovy, aby byla na mé úrovni.... nedomysleli to, to je pravda"}, {"102": "Ano, já to tam navrhoval, aby udělali možnost 1 BP nebo Nx RR na rozlohu za jeden level. To by mi plně vyhovovalo ale bojím se, že toho se nedočkáme. Radši bych tedy aby jedno kouzlo vylepšovalo jednu budovu, protože s tím jak málo kouzel je a bude, jsou některé sety prakticky předem odsouzeny k záhubě, což je vlastně škoda. [BR][BR]Mohli by ale aspoň nasadit těch 5 RR sem, ať aspoň něco hrabeme, a nečekáme jak jelita až jak se zase vyspí "}, {"117": "Ještě, že já nemám žádné budovy, které by rekonstrukci potřebovaly,  hned je prodávám  když mám náhradu, protože dočkat se něčeho od inna.... nou cement.... stačí se podívat na appku, která je pořád sfušovaná a opravují na ní kraviny, ale zásadní věci tam stále nejdou "}]