[{"66": "@CorwinOfAmber Chatrč na manu bude v příštím karnevalovém eventu, tak si nahrabej nové a ušetři kouzla."}, {"16": "Já je použiju určitě na Zimní hvězdu - bohužel mám v hlavním městě jenom jednu - na betě mám 3 (1 už jsem v sobotu vylepšil z orků na lesní elfy).[BR]Jen škoda, že podobné budovy nejsou i v dalších eventech. Obvykle jsou tam budovy s opačným poměrem kultura/popka."}, {"65": "@Prealiena : jj koukal jsem, ale úplně nejjednodušší asi bude ty chatrče smazat úplně a v eventu zkusit set "}, {"31": "@CorwinOfAmber v karnevalovej udalosti vidím veľké plus v tom, že je možné sa pokúšať o set a zároveň bez ohľadu na to ísť po ľubovoľných denných odmenách. Takže napokon je možné dosiahnuť obe.  (po prepočtoch mi vychádza že získať celý set by nemal byť problém, ak počítam, že hráč splní všetky úlohy a bude mať šťastie na aspoň niekoľkokrát padnuté sladkosti z truhiel, alebo pravidelne ich zbierať okolo mesta)"}, {"66": "Tak nevím, co jsem si předběžně u iDavise počítala manu z karnevalového setu u půlčíků, tak mi vyšlo o chlup méně než vánoční set z čarodějů. To mě moc nemotivuje ty sety vyměnit."}, {"65": "@iDavis : a set bude opět pouze z hlavních odměn? žádné denní? na gemsofknowledge mi ty informace připadají trochu chaotické  protože pokud ano, pak je to super, člověk vlastně může zkoušet otvírat naprosto cokoli a při troše zdravého zamyšlení nad efektivností truhel by to mělo vyjít v klidu. [BR][BR]@Prealiena : ten set z denních nebo hlavních odměn? já mám jen ten z hlavních, a na manu tohle vyjde určitě líp. pro konstrukty mi to vychází na nějakých 87k many. jen škoda, že těch surovin to moc nedává. [BR][BR]na druhou stranu je fajn, že setovky už nejsou kulturně-populační hybridi, ono se s tím pak mnohem hůř operuje pro případnou náhradu."}, {"31": "@CorwinOfAmber áno iba z hlavných, takže stačí si prepočítať ktoré truhle sú najvýhodnejšie z hľadiska počtu vlajok a šancí na dennú odmenu a dá sa ísť po oboch."}, {"66": "@CorwinOfAmber Měl by tam být jen jeden set tvořený pouze z hlavních odměn.[BR][BR]Počítala jsem ho oproti Christmas market setu z minulé kapitoly. S manou celkem stejně, akorát by přibyli semínka a ušetřila bych místo (9x6 oproti 9x9). Tak přemýšlím, že oželím nárůst many z vánočního setu, kdybych ho chtěla vylepšit.[BR][BR]Edit. Tak ono je to to samé 9x6"}, {"16": "No je otázka, zda po přeházení odměn půjde se získat celý (zatím jsem nepátral, zda je někde seznam nového pořadí odměn. Nevýhoda je, že každá budova je jenom jednou. U mne to určitě zimní set nenahradí - moje 4 stromky mi produkují denně 179200 many, to nynější set nemůže vyvážit. Max. doplnit - jestli bude místo. Než se rozhodnu, zda ho postavím nebo rozmlátím na fragmenty, tak si to budu muset ještě nechat projít hlavou - asi bude rozhodovat množství semínek a velikost spolu s velikostí volného místa.[BR][BR]Při posledních změnách byla zvýšena šance na denní odměnu z největší truhly (dříve 66 - 15%, nyní 67 - 30%). Další 2, které mám k dispozici zůstaly nezměněny, což je škoda. Takže jestli byla změněna pouze ta poslední bedna, tak asi půjdu po bednách přednostně 30% a pak dle toho, zda tam bude něco poměrově s 20%, jinak tu nejlevnější na minimalizaci ztrát a protočení na další 30% bednu.[BR][BR]Můj prozatímní osobní cíl v tomto eventu bude asi:[BR]Náhrada současných budov na semínka z dob půlčíků s cílem zvýšit produkci semen.[BR]A dále výměna pop/kulturních hybridů (kromě zimní hvězdy - tu si budu vylepšovat přes královskou rekonstrukci, až přijde sem, ten její poměr lidí/kultury je prostě nej)."}, {"31": "Pokiaľ viem zmenila sa len tá jedna truhla (som rád že vývojárom doplo že aspoň jedna s nejakou normálnou šancou na dennú odmenu by tam mohla byť).[BR][BR]Zo zimnej udalosti mám len časť setu so sovami, aj ten len kvôli mane, tak rozmýšľam, že po získaní karnevalového pôjde preč (keďže ho za nič efektívnejšie nebudem nahrádzať, vidím ho ako dobrú variantu). Inak z denných odmien budú mojim cieľom ako vždy diamantové hybridy (studne), ktoré si spolu s tými 20timi v inventári počkajú na koniec výskumu."}, {"16": "@iDavis já jsem taky rád, i když ta bedna za 46 s 5% vedle té za 67 s 30% působí poněkud komicky. Ale aspoň něco. Snad se bude ta jedna objevovat dostatečně často.[BR][BR]ps: Tak set, pokud půjde získat celý, bude u mne postaven. Jen si pak budu muset trošku pohrát s městem. Až dodělám úkoly a zbourám ty budovy, tak by to mohlo vyjít to tam hodit vedle zimního. A někdy zítra se mi vylepší aktuálně vylepšovaní zlatníci a pastičkáři, tak pak můžu zbourat ty sloupy a zahradu - další zlatníky/pastičkáře už stavět ani vylepšovat nebudu. Ten měsíc a něco to doklepu s tím, co mám."}, {"72": "Kdy je možné očekávat konstrukty na cz serveru? Jak dlouho to zpravidla od bety trvá..?[BR]Začal sem už vyrábět živoucí zboží na první truhlu, ale teď mi docvaklo, že to asi nebude po týdnu jako většina věcí "}, {"11": "příští aktualizací[BR][BR]Odstraněna citace. Embla"}, {"31": "Najbližšia aktualizácia nášho servera by mala byť 21.2., skôr by som to nečakal."}, {"72": "Já si říkal, že sem začal brzo.. díky."}, {"74": "Karneval:[BR][BR]Nejsou „double“. Po dlouhé době je skutečně šance získat všech 5 budov setu.[BR][BR]Jak uvádějí tak za:[BR][BR]- úkolovou řadu je 3380[BR][BR]- denní úkoly 770[BR][BR]- nalezené na herní ploše cca 260[BR][BR]Celkem tedy cca  4410 bonbonů.[BR][BR]Hlavní ceny je 200 vlajek = Modrá truhla dává 2 vlajky ( a 15% šanci na denní odměnu) a náklady jsou 45 bonbonů. Čili jen z modrých je to 4410:45 = 98 „výher“ x 2 vlajky = 196 vlajek. Rezervu tvoří Zelená, Oranžová, Červená po 46 bonbonech a též dvou vlajkách.[BR][BR]Z uvedených 98 „vytočení“ je při 10% šanci na 100 bonbonů vysoká šance. Stačí v podstatě z těch 98 vytočení získat 3 x 100 bonbonů = a investovat je zase do modré truhly = 300:45 = 7 „vytočení“ x 2 vlajky = 14[BR][BR]Celkem tedy 196 + 14 = 210 vlajek = splněno."}, {"74": "[BR]Někdo si pohrál s pravděpodobností  [BR][BR]Za nesprávná čeština se omlouvat, ono se to přeložit přes Google, to nebýt má chyba "}, {"66": "Jo s hlavními cenami to vypadá dobře, mě spíš zneklidňují zprávy z beta fóra, že získat denní odměny je o poznání těžší.[BR][BR]PS. ty truhly jsou staré, na betě změnily pořadí hlavních cen a fialovou truhlu za 66 bonbonů předělali na 67 s 30% na denní odměnu (asi jediná dobrá na denní odměny).[BR][BR]Více info zde: https://tinyurl.com/ycsdl44f (truhly v lepším rozlišení)"}, {"74": "@Prealiena, ano je to o tom, \"že papír snese vše\"....napsat procenta tam můžou jakákoliv, ale já se v zimním Eventu těžce zklamal. Setové budovy mne od jistého okamžiku nezajímají, je s tím postavením víc práce jak užitku. Stačí psychická příprava na Konstrukty jak to zase musí člověk lepit na sebe a ještě řešit set. Proto mne zajímají denní odměny, které člověk nalepí kam se zachce."}, {"73": "úkoly ještě nemáme? :-("}]