[{"31": "@LuciskaCh ďakujem za pripomenutie, boli doplnené do spoileru k udalosti."}, {"43": "Prealiena je to pravda,že denní odměny jdou hůře získat,ale sem tam padají a když mi padli,tak i v jiných truhlách,tudíš bych řekl že na procentech zas tak nesejde,spíše o štěstí.Ale co mi padá dost často je 100 cukrovinek,což pak je paráda točit truhly... [smilie--sprite1]"}, {"73": "iDavis napsal/a:@LuciskaCh ďakujem za pripomenutie, boli doplnené do spoileru k udalosti.\t\tKlikněte zde pro zvětšení...Děkuju [smilie--sprite1] Seš nejlepší ;-)"}, {"91": "Tak pokud denní odměny jdou ještě hůře získat, tak to už abych událost ani nehrál, protože v poslední události mi nepadlo skoro nic, nemám štěstí. Takže pokud to je ještě horší, tak mě to asi nebude ani bavit."}, {"43": "Pauleo,tak ono jde hlavně o štěstí.Ale podle mého,ikdyby se budovy nezískali,tak je tam moc pěkných dalších věcí.A hlavně v těch bednách je to lépe poskládané,že když chceš určitou věc,tak se lépe získá.Pro mne jsou hodně užitečné,urychlovače,zásoby a bonus pro portál.Takže za mně se těším,nějaké místo mám,takže budu určitě hrát. [smilie--sprite1]"}, {"5": "Pauleo, jednou nahoře jednou dole a zkus jíti štěstí trochu naproti [smilie--sprite1]  a neházej flintu do žita, vždyt´..... někdy štěstí i na vola padne /což nemusí zrovna býti tvůj případ/ [smilie--sprite1]"}, {"18": "musím s ElfNostradamus souhlasit. Pauleo můžu ti říct že je to opravdu o štěstí. Ve mu li předchozí tři události, tak halloween ani festival sklizně se mi nedařilo. kdežto v zimní události celkem nad míru. zde co jsem chtěl jsem většinou získal na poprvé.  Tudíš nikdy nevíš jak ti to bude padat. můžeš mít například vele štěstí a vše co budeš chtít získat na poprvé."}, {"84": "Přesně tak, taky mi v eventech nic nepadalo a při zimním eventu jsem získal mnohem víc než jsem chtěl.Dařilo se úplně všechno. Předpokládám, že teď to v tentokrát bude bída, ale rozhodně se nenechám odradit. Nemůže to přece padat pokaždé úplně všem..."}, {"16": "A když jde o štěstí tak jsou právě problémem nízká % šancí (hlavně díky omezenému počtu pokusů, který se vám může vejít do té smůly klidně celý).[BR]Ale vypadá to, že to zaznamenali i vývojáři (ať už z herních dat na betě, nebo našich reakcí na beta fóru) a alespoň u jedné bedny šanci zvýšili z 15 na 30%."}, {"40": "Nemám rád rotující bedny. A v zimním eventu jsem dostal víc než jsem kdy doufal. Očekávej nejhorší, a jakékoliv + je výhra.[BR]Je to vážně o náhodě. ;-)"}, {"31": "Podľa najnovších informácií by k nám mali konstrukti doraziť 18.2.. [smilie--sprite1]"}, {"102": "Takže vážně super 16.8. musím vyzvednout budovu z eventu, aby o tři dny později už byla o jednu rasu starší... to udělali beztak schválně, protože normálně to mělo být naopak."}, {"31": "Taktiež sa môžeme tešiť z toho že karnevalová udalosť príde až po nich.. [smilie--sprite2]"}, {"102": "No jenže to bylo jasné [smilie--sprite8] Jenže dřív byl Valentýnský konzum po rase, viz historie [smilie--sprite1] Tohle mi přijde značně zlomyslné k lidem na konci výzkumu, jím vydat rasu fakt o pár dní po tom, co zde je nějaký event ze kterého je budova do města. Ale co už, tak to bude palivo do craftingu až tam bude něco smysluplného. Jen mi tohle prostě vadí, protože člověk je nuceně na konci a vlastně dostává horší věci zcela neodůvodněně, kdyby k těm věcem dostal rovnou upgrade tak bych nic neříkal, jenže to bych chtěl moc [smilie--sprite8]"}, {"15": "Může mi někdo poradit , na jakém webu najdu přehled tvoření plánů města ? Už jsem to jednou měla , ale teď nevím , kde [BR]to bylo . [smilie--sprite3]"}, {"146": "www.elvenstats.com[BR]momentálně nejde"}, {"102": "Plány spíše myslela tohle http://www.elvenarchitect.com/ (taky nejde [smilie--sprite8])"}, {"146": "přes elvenstat se na architekt dostane také, je to stejný server"}, {"18": "obě stránky momentálně mimo"}, {"92": "Jj, ElvenStats nefunguje už asi 2 dny..."}]