[{"30": "To já se taky těším , kdo by si neliboval v pohodlném životě , v dobrém jídle a hlavně to pokouření z dýmky. Vůně tabáčku se potáhne celým městem ,hm,hm .[BR]Už trénuji ,umím vyfukovat  kroužky a draka . "}, {"43": "Díky za ukázky budov,opravdu vypadají moc pěkně.Samé květiny a zeleně,těšim se."}, {"28": "Jůůů, to vypadá dobře  Jen ta žába jako nová bojová jednotka... no nevím "}, {"29": "To mě spíš trošku udivilo to, že mají půlčíci udělaný rohy, ale stejně se na ně těším. "}, {"44": "a od kdy to má být?"}, {"27": "Sleduj fórum a dozvíš se to , teď je to na betě. Tipnul bych si dva až tři týdny, jako každý update a pokud nenastanou nějaké nechtěné problémy."}, {"38": "Nibelione jako vždy děkujeme za tvoji práci ) za mě Hobiti děs )"}, {"27": "Není zač  tentokrát jsem nemusel pro obrázky nějak daleko ale našel jsem je u našich německých sousedů [BR][BR]Něco pro zvídavé lidišky:[BR]Spoiler: Info o nové permanentní surovině \"Divine Seeds\"Ve výzkumu se objevuje nová permanentní surovina v druhé úrovni Tržiště, \"Divine seeds\".[BR]Od kapitoly Půlčíků se nám otevře tento druhý level, jehož vylepšení stojí následující suroviny:[BR][BR][BR][BR]Samotným vylepšením získáme u Tržiště novou záložku:[BR][BR][BR][BR]Fungovat bude podobně jako mana, automatická produkce s možností dřívějšího výběru a každou noc se hodnota této suroviny sníží o 10%.[BR][BR]Hodnota těchto \"Divine Seeds\" se bude počítat podle urovně Hl. Sídla a počtu dokončených provincií a této surovině byl přidán i bonus za každý dřívější výběr, ke kterému se ještě přičte koeficient podle úrovně Prastarého divu.[BR][BR]\"Divine Seeds\" by měly od této kapitoly sloužit jako měna pro stavbu kulturních budov a pro odemykání výzkumů."}, {"31": "Nová rasa je už detailne popísaná aj na anglickej wiki. "}, {"2": "Zdá se, že Wood Elf byla úspěšná kapitola, Hobiti mi, graficky, přijdou jako volné pokračování. Jen doufám, že kapitola nezačne urážkami.[BR][BR]Ale ty rohy s ušima?[BR]Jako by vzali pana Tumnuse a uřízli mu kopejtka.[BR]Ale když zvládli zavést inteligentní bytost jako směnnou jednotku.[BR][BR]Žába jako poslední dělostřelec je trochu zvláštní volba, ale uvidíme jaké bude mít staty, třeba její kvalita vyváží vzhled.[BR][BR]Zajímá mě ten bonus za výběr semen, zdá se, že budova je schopná kumulovat semena 25 hodin, což je od Inna velmi vstřícné a pro hráče praktické, když každou noc ztratím 10%[BR]ale když budu sedět a klikat dostanu bonus.[BR]Jsem zvědav na konkrétní čísla"}, {"31": "Blíži sa nová akcia - Okúzlujúci strom.  V spoileri nižšie nájdete všetky informácie pre prípravu na túto úkolovú sadu, ktoré budem postupne dopĺňať.[BR][BR]SpoilerPredpokladaný termín: 13.6. - 26.6.[BR][BR][IMG]https://i.ibb.co/JnkK2LG/https-media-innogamescdn-com-com-ONYX-ZZ-announcements-charmingtree-Charming-Tree-Forum-Header-png.png[/IMG][BR][BR]Obsahovať bude pravdepodobne sadu 21 úloh.[BR][BR]Spoiler: Úlohy1. Utrať 1 VB[BR]2. Získaj malé množstvo zásob[BR]3. Kúp 1 VB[BR]4. Získaj 2 relikvie[BR]5. Vyrob 3x jednoduché nástroje[BR]6. Vyrieš 3 strety[BR]7. Získaj malé množstvo mincí[BR]8. Získaj 1x kúzlo Sila zásob[BR]9. Vyrob 30x chlieb[BR]10. Vyrob 5x košík jedla + získaj decentné množstvo zásob[BR]11. Vyrob 10x pokročilé nástroje + získaj decentné množstvo zásob[BR]12. Vyrob 3x sada nástrojov + získaj decentné množstvo zásob[BR]13. Trénuj 100 vojakov[BR]14. Preskúmaj 1 provinciu ALEBO vylepši 1 budovu na level 12 alebo vyšší[BR]15. Utrať 30 VB[BR]16. Vyskúmaj 1 technológiu[BR]17. Získaj 2x kúzlo Sila zásob[BR]18. Získaj veľké množstvo mincí[BR]Po dokončení všetkých úloh bude k dispozícii hlavná cena Okúzlujúci strom.[BR][BR][IMG]https://i.ibb.co/C2q6XpD/https-cz-forum-elvenar-com-index-php-attachments-event-a-charming-tree2017-charming-tree-png-1759.png[/IMG][BR][BR][BR]Aktualizácia 10.6.2017 o 12:14 - úpravy"}, {"27": "iDavisi hodˇ tam prosím aktualní screen, ten co máš byl špatně vyfocený [BR][BR]Odměna vypadá takto:[BR]Spoiler[IMG]https://i.ibb.co/C2q6XpD/https-cz-forum-elvenar-com-index-php-attachments-event-a-charming-tree2017-charming-tree-png-1759.png[/IMG]"}, {"31": "Už je tak, moderátor z bety asi zabudol dokresliť jednu ruku. "}, {"27": "Neboj už ho pokárali i na beta foru, že se neshoduje s tím, co mají ve hře. Obr. by měl být aktuální už i tam "}, {"53": "Pry bude novy event, zhruba 13 dnì na 21 ùkolu, odmena strom co uz znàme z e zimnìho eventu jen v letnì verzi,a to uz tento mesìc.[BR][IMG]https://i.ibb.co/17J0Msw/http-narwain-altervista-org-wp-content-uploads-2017-06-premio-albero-charmante-png.png[/IMG]"}, {"31": "O tom sa už vie, pozri pár príspevkov vyššie. "}, {"53": "Dìky, nejak mi to uteklo, jdu kouknout[BR][BR]//odstraněna zbytečná citace, Iddun"}, {"27": "Zase něco málo z bety, co se připravuje pro nás hráče:[BR][BR]Spoiler- Divům bude navýšen lvl na 25.[BR]- Opravy a doplnění popisků u divů a kouzel.[BR]- Mezi nepřátelé na mapě světa budou přidány nové jednotky z doby půlčíků.[BR]- Do upozornění byla přidána hlaška o přijetí nového člena společenství.[BR]- Vylepšení výkonu hry během turnajů.[BR]- Žebříček dostane vylepšení a od nahrání bude možnost, najetím myši nad hráčovy body, zjistit detailně kolik a za co je má... viz screen:[BR][BR][IMG]https://i.ibb.co/VxVgHPT/https-cz-forum-elvenar-com-index-php-attachments-screenshot-1-png-1794.png[/IMG]"}, {"44": "Dělat divy až do úrovně 25 a možná víc je... no nevím jestli někdo někdy toto dokončí. Všechny divy až na úroveň  25 to tady budu do smrti a možná ještě déle, když jsou neustále nové divy...."}, {"43": "Myslím,že ten level 25 je dobrý nápad.Však záleží na každém,jak hru bude hrát a do čeho bude VB dávat.Podle mne je důležité,aby tu byla ta možnost a hráč se podle sebe zařídí,Já třeba preferuji počet divů max. sedm (zatím jich mám šest) ,ono stejně není místo a pak nějaké divy je zbytečné stavět,a těm divům se na plno věvovat.Ve winyandoru mám propast na max,takže pro mne to bude jen a jen přínos... "}]