[{"90": "voyager-1 napsal/a:\t\t\tkarneval mi nějak nejde dohromady s jarem\t\tKlikněte zde pro zvětšení...Ono Carnival má taky význam Masopust."}, {"11": "však jo, letos je masopust od 28.2 do 6.3. Stále bych to nenazýval jarem.[smilie--sprite1] Ale už řešíme kraviny [smilie--sprite1]"}, {"117": "Ani jarní prázdniny nemají nic společného s jarem, když už jdeme do důsledku."}, {"11": "Tady se ale neřeší jarní prázdniny, ty jsou důležitý možná pro Tebe a až v dubnu jarní event bude tak si vzpomen co sem vkládáš [smilie--sprite1]"}, {"117": "No.. nevím  jestli ve 30 letech jsou pro mě důležité jarní prázdniny, ale budiž[BR]mělo to být jen srovnání,  že někdy označení \"jarní\" nemusí být na jaře,  tak si nech pro sebe takové řeči"}, {"11": "spíš by mě zajímalo proč stále reaguješ, a prosazuješ Tvou myšlenku že Karneval je hlavní jarní event, tak aspoň vím kolik Ti je let  [smilie--sprite1]"}, {"117": "stále?  napsala jsem jen, že je to hlavní event (což podle beden je) a jarní jsem zminíla jako myšlenku na předchozí příspěvky, nikoli na můj"}, {"72": "Tak sem na betě zatočil, začal sem s 1213bombony (moc tam nehraju) a skončil s 1234, z toho mám 5 prasečích povozů a další věci. Ani nevím, co s nima, nejsou moc koukatelný, ale co už.[BR]Takže, samozřejmě na CZ mi nemusí padnout nic, ale trochu do pozitivna.. ono to půjde [smilie--sprite1]"}, {"11": "donutka napsal/a:\t\t\tstále?  napsala jsem jen, že je to hlavní event (což podle beden je) a jarní jsem zminíla jako myšlenku na předchozí příspěvky, nikoli na můj\t\tKlikněte zde pro zvětšení...OK, jestli jsem se Tě něčím dotkl tak se omlouvám, měl jsem včera už trochu vypito, jinak bych ani nereagoval [smilie--sprite1]"}, {"16": "Když uvážíme charakter eventu, tak dle mě to je hlavní čtvrtletní event, pochybuji, že by dali na jaře dva.[BR]Takže buď ho dají dříve, nebo v klasickém termínu a před ním nám ještě něco dají (výzvy, dobrodružství,...)."}, {"66": "No, hlavně že už se dostaneme z toho kultu a nebudeme zase muset uctívat Fénixe.[BR]Svoboda pro Elvenar.[smilie--sprite2]"}, {"31": "Síce zatiaľ o tom nie je veľa informácií, ale vypadá to tak že bude aj veľkonočná udalosť."}, {"74": ".....a konstruujeme [smilie--sprite1]....hurá"}, {"5": "20VB v přihlašovacím emailu jako dárek ke Konstruktům ...složka hromadné [smilie--sprite1]  ...jinak osobně děkuji [smilie--sprite1]"}, {"31": "Vypadá to tak že opäť trochu manipulovali s debnami v karnevalovej udalosti, mierne zmenili (zvýšili) ceny niektorých (zmeny v obsahoch som zatiaľ nepostrehol). Získať celý set je tak o kúsok náročnejšie, stále to ale považujem za celkom reálne (započítavajúc fakt že pred pár dňami vymenili poradie niektorých hlavných cien, čo malo za následok posunutie poslednej setovej budovy z ceny 200 vlajok na 180). Prehľad všetkých debien sa pokúsim dnes večer aktualizovať, objaví sa to v prehľade."}, {"16": "@iDavis Tak to jsem zvědav. Já to na betě ještě netočil, úkoly mám hotové a čekám, až se objeví druhá manová budova (ta větší, co dává od půlčíků semínka). Pak to protočím vše najednou."}, {"102": "Jinak nevím zda to někdo již psal, ale event tedy začne 22., již to je oznámeno na mobilu."}, {"66": "No to mě moc nepotěšilo s těmi bednami. Chci denní odměny, ale zároveň chci dosáhnout i na Studnu přání jako desátou hlavní cenu. Tak nevím, jaké bedny mám točit, aby mi to vyšlo.[smilie--sprite5]"}, {"66": "To nevypadá dobře, 30% truhla, co byla zdražována předtím, už je za 71 bonbonů.[BR]"}, {"133": "Zeptám se, denní odměny ještě nejsou známy?? Děkuji"}]