[{"102": "Třeba to bude podobná budova, jako portálový obchodník či jak se to jmenuje, a bude to produkovat každých N dní nějaké ty RR, odpovídalo by to ikoně i tomu popisku."}, {"66": "Néé, já už nechci žádný náboženský kult.[BR][BR]A ten popis ve spoileru se zřejmě vztahuje ke královské rekonstrukci. Nino naznačil, že to vydají ještě s něčím. A to něco asi bude další kultovní událost."}, {"11": "žádný jarní či velikonoční event nebude ! Několik hráčů mi to vyvracelo když jsem to před týdnem tvrdil a já jim věřím. "}, {"16": "Tak on to nemusí být event, ona to může být úkolová řada, nebo něco nového o velikosti úkolové řady."}, {"31": "Poznámky zo živého vysielania 1.3.2019[BR][BR]Spoiler: Poznámky zo živého vysielania 1.3.2019Ktorá časť vývoja Konstruktov bola najzábavnejšia pre Timona?[BR]Myslím že to bolo písanie príbehu, páči sa mi ako sa po toľkej dobe ešte stále dokáže držať témy a navyše, rasa Konstruktov je akýmsi vyvrcholením toho, čo už mierne naznačili rasy pred tým, konkrétne Elementálové a Amuni. Blížime sa k veľkému odhaleniu minulosti Elvenaru, príbehu ľudí a elfov a ako sa vlastne dostali tieto dve rasy k sebe, a Konstrukti sú vlastne ich zlatým klincom. A som veľmi natešený sledovať, ako bude tento príbeh pokračovať od tohto momentu.[BR][BR]Prečo sa kapitola Konstruktov nezačína výskumom pokročilejších prieskumníkov?[BR]Cieľom je opraviť isté strategické prvky hry, ktoré sa behom posledných kapitol vytrácali. Dávali sme príliš veľa týchto technológií a namiesto toho, aby náklady rástli a náročnosť sa zvyšovala, išlo to práve opačným smerom. Toto neznamená, že sa táto technológia už nikdy neobjaví, ale nateraz sme sa rozhodli \"napraviť\" takto niektoré veci.[BR][BR]Prečo je chat stále v stredoveku a prečo nemáme globálny chat?[BR]Je dobrý dôvod na to, prečo nemáme globálny chat. Vyžaduje si to veľkú úlohu administrácie, bol by to veľký rozdiel oproti chatu s 25 ľudmi. Dúfame že niekedy v budúcnosti budeme môcť pridať nové príkazy ako napríklad šeptanie.[BR][BR]Bude možné zmeniť hernú rasu v priebehu hrania?[BR]Myslím, že by to bolo technicky veľmi náročné, treba si uvedomiť že jednotlivé rasy majú rozdielne budovy s rozdielnymi veľkosťami.. bolo by to naozaj veľmi náročné. Je dobrý spôsob ako si vyskúšať obidve rasy - hrať na dvoch serveroch.[BR][BR]Bude mať mobilná aplikácia rovnaké možnosti ako prehliadačová verzia?[BR]Väčšina funkcií tam už je, čo sa týka správ, pracujeme na tom, zatiaľ nevieme povedať kedy, ale dočkáme sa toho. Podobne aj vkladanie VB do prastarých divov iných hráčov.[BR][BR]Kedy bude zavedené kúzlo Královská reskonstrukce?[BR]Čoskoro. Naozaj čoskoro. Očakávame jeho príchod v niektorej z nadchádzajúcich verzií. Mali sme už nejakú verziu na bete, rozhodli sme sa ju prepracovať, ale čoskoro sa dočkáme výsledku. Môžete očakávať, že čoskoro sa v hre objaví niečo s tým súvisiace.[BR][BR]Zopakujú sa v karnevalovej udalosti niektoré z karnevalových vozov?[BR]Niektoré z nich sa vyskytnú ako denné odmeny viackrát.[BR][BR]Kde je Rika?[BR]Rika je doma, zaisto sa objaví niekedy v budúcich videách.[BR][BR]Prečo ste zaviedli Konstruktov rovno pre karnevalovou udalosťou?[BR]Chceli sme dať pokročilým hráčom možnosť získať budovy karnevalovej udalosti s už zvýšenými hodnotami, teda pre kapitolu Konstruktov.[BR][BR]Máte v pláne spraviť HTML5 verziu viac stabilnú?[BR]Snažíme sa a stále pracujeme na vytvorení HTML5 verzie ktorá bude tak stabilná a funkčná, ako sa len dá. Čím ďalej tým sa viac a viac zaoberáme opravovaním chýb v tejto verzii. Behom poslednej doby sme sa výrazne zameriavali na celkové zrýchlenie načítavacích procesov.[BR][BR]Bolo by možné priniesť nejaký \"efekt oslavy\" pri dokončení úloh?[BR]Asi by som nedával takýto efekt pri dokončení každej úlohy, ale myslím, že pri niektorých miľníkoch by sme mohli nad tým porozmýšľať, ako napríklad dokončenie kapitoly alebo istej skupiny úloh.[BR][BR]Bude behom karnevalovej udalosti deň dvojnásobku?[BR]Nie, tentokrát sme sa rozhodli tieto dni nezačleniť. V minulosti sme chceli týmto vytvoriť isté nadšenie pre hráčov, aby mohli tieto dni očakávať, avšak malo to aj negatívny efekt, keď sa hráči príliš zameriavali na tieto dni a ušlo im tak množstvo iných, zaujímavých denných odmien.[BR][BR]Plánujete zavedenie nejakých nových a permanentných funkcií pre spoločenstvá?[BR]Áno, možno, niekedy v budúcnosti sa môžeme týmto smerom uberať a zaviesť nejaký zaujímavý nový obsah pre spoločenstvá.[BR][BR]Môžeme mať na tržišti filter na zobrazenie ponúk s iba určitým množstvo hviezd?[BR]Je to dobrý nápad, určite sa na to pozrieme.[BR][BR]Bude niekedy v 11. truhla v turnajoch?[BR]Kto vie... Možno niečo budeme plánovať. Uvidíme.[BR][BR]Všetky poznámky vychádzajú z môjho vlastného prekladu, nejaké odchýlky sú možné."}, {"72": "Že se náklady s postupem ras nezvyšujou? No to snad nemyslí vážně. Co s tím prostřednictvím oddílů prováděj je masakr, hrát turnaje u víl, orků byla sranda, co to stojí teď je tak trojnásobek. Oproti pár desítkám procent zvýšení výroby zdrojů."}, {"66": "@athlan Mluví o náročnosti provincií na mapě světa, pokud děláš jen minimální počet na průchod kapitolou.[BR]Což je pravda, dělala jsem nepovinné vylepšení oddílů do orků a do teď mám v nejbližším kruhu jen velmi lehké provincie.[BR]U Elementálů v příští kapitole mě čeká poslední výzkum pokročilejších průzkumníků, takže budu mít slušnou zásobu velmi lehkých provincií v dalším kruhu.[BR][BR]O náročnosti turnajů se tam nikdo nebavil, ty řeší prastaré divy konstruktů."}, {"102": "Neřeší to nic, pokud prostě není možné porazit automatem, tak je celkem jedno kolikrát to zkusím když vyrobím za stejný čas více, stejně to je vždy prohra. A výkup již dávno stojí více, než kolik člověk je schopný normálním tempem vyrobit."}, {"91": "Jenže nouze o místo tě nutí být ve světě s výkupem tak neskutečně napřed, takže je to pak tak drahé, že se to vykupovat nedá."}, {"102": "Výkupy nebo boj na mapě mě vůbec netrápí, i kdyby to bylo 10x tak drahé, tak je mi to fuk, protože to vykoupím jednou a mám klid. Zatím co turnaje musím jet každý týden abych měl dost zdrojů do výzkumu a divů, výkupy na mapě jedu už jen v eventech a čekají mě poslední dva pozemky, než narazím na limit."}, {"2": "Já mám město na betě v hobitech, nejsem napřed v provinciích a místa mám dost."}, {"16": "@GorGlin Tak taky záleží, co v té vesnici je.[BR]Jiné množství místa má hráč se 3 T3 a jiné s 5.[BR]Jiné množství místa má hráč s 5 divy nebo 15 divy.[BR]A tak bych mohl pokračovat.[BR][BR]Taky mám na betě vesnici v lesních elfech, která není popředu v provinciích a má více místa než moje hlavní vesnice. [BR]Taky tam mám méně manufaktur, méně divů, mám tam jenom kasárny a nemám tam akademii kouzel."}, {"102": "No on má asi většinu rozšíření za dia pokud totiž není napřed v provincicih, nemohl by mít tolik rozšíření jen tak, já mám taky nějaké za dia ale jsem taky skoro na max v provinciích tzn jich musí mít za dia o něco více, možná všechny? Já mám místa také \"dost\" ale dost za cenu, že vše postavit nemůžu a více jak 4+4+4 a 1+1+1 manufaktury neuživím."}, {"31": "Podľa najnovších informácií by malo už tento štvrtok, 7.3., prísť kúzlo Královská rekonstrukce na live servery. "}, {"119": "pokud je to tak, a vse bude fungovat jak ma, tak uz se na to moc tesim.....to budou 3 dlouhe dny cekani, nez to spusti  Jsem zvedava v jake konečné verzi to spusti "}, {"90": "aikomi napsal/a:\t\t\tJsem zvedava v jake konečné verzi to spusti Klikněte zde pro zvětšení...Obávám se, že v té poslední co je na betě - tedy fakticky té nejhorší, kdy zůstávají plánky a na kouzlo Královská rekonstrukce se dají měnit jen přes řemeslnou výrobu (tj. jen někdy, náhodně a se spotřebou relikvií a času )"}, {"99": "@iDavis : Znamená to, že bychom dostali RR už ze zítra začínajícího turnaje? "}, {"2": "Tak na první místo s ním nikdy nezískám.[BR]Ale je funkční a hraje se s ním naprosto v pohodě.[BR]Mám dost místa na rasu i malý krcálek na události a dost produkce abych každý týden dal do turnajové kasy aspon těch 1600"}, {"102": "No je fakt, že když už to stojí čas potažmo relikvie, tak by ten konverzní poměr měl pak být aspoň 15-20, ale tak co už, hlavně že už půjde hrabat a snad s tím ještě něco udělají, aby to bylo použitelné. Protože zatím to reálně užitečné není ani pro mě na konci rasy, protože sety člověk snadno nevymění a jsou moc velké. Pro ty co jedou ještě rasy dva měsíce, je to úplně k ničemu.[BR][BR]Malé kulturní budovy si člověk vycraftí, na velké bude šetřit roky..."}, {"31": "@Angedev je to pravdepodobné, ale naisto to zatiaľ neviem."}]