[{"16": "@ExplorerFfff Na betě si s KR vylepšuji své 3 zimní hvězdy (2 již mám vylepšené z orků na elfy). Na cz1 mám jednu, tu plánuji vylepšovat, další použití se zatím uvidí."}, {"65": "no já bych se rád na hlavní odměny zaměřil, ale podle měto prostě nevyjde, ani kdybych se rozkrájel. někteří měli velké štěstí, já zatím vůbec. utracena asi polovina bombónů, co lze za event získat a mám 3 hlavní ceny. potřebuji se dostat na 9.[BR][BR]edit : teď koukám, že jsem odpověděl do špatného vlákna :-D"}, {"102": "Tak jasný, ono něco malého s tím člověk utáhne ale něco malého většinou je věc, co si v pohodě v dalším eventu vyměním. RR pro mě má smysl k setům které se mění těžko a jsou poslední dobou užitečné, kulturky za to při tomhle nastavení asi táhnout nebudu."}, {"72": "Ano, je to v oznámeních:[BR]https://cz.forum.elvenar.com/index.php?threads/verze-1-74.4830/"}, {"133": "Zdravím,chci se zeptat na tu Královskou rekonstrukci,nevíte někdo tom něco?? Hlavně kde získat ty kouzla?"}, {"97": "@nieuska kouzla získáš v turnaji nebo pujdou craftit v řemeslný výrobě."}, {"133": "Díky moc,ale na to si asi ještě pěknou chvilku počkáme,co? [smilie--sprite3][BR][BR]Jsem tele,už koukám že je to aktivní v turnajích...tak ještě jednou díky moc[BR][BR]Příspěvky sloučeny. Embla"}, {"99": "V craftingu to bude dostupné od pondělí, ale na to musíš mít plánek z 10. turnajové truhly."}, {"31": "Sneak Peek: Evoluce Fénixe #2[BR][BR]Spoiler: Sneak Peek<<<​[BR]Velikonoční nádech barvy Fénixů mají,[BR]líhnou se a hezky tady rozjímají.[BR][BR][IMG]https://i.ibb.co/yyJcG99/https-i-ibb-co-NT8-ZG4-Q-EL-sneak-peek-8-3-2019-1-png.png[/IMG][IMG]https://i.ibb.co/dLv74Nb/https-i-ibb-co-0shv7-GR-EL-sneak-peek-8-3-2019-2-png.png[/IMG][IMG]https://i.ibb.co/hYN6zRQ/https-i-ibb-co-fvz-TGGw-EL-sneak-peek-8-3-2019-3-png.png[/IMG][BR][BR]Co bude příběhem není zatím jisté,[BR]poznáváte 2 známé stavby na tomto místě?[BR][BR][IMG]https://i.ibb.co/rdTX6PW/https-i-ibb-co-6n6-Mcv-M-EL-sneak-peek-8-3-2019-4-jpg.jpg[/IMG][BR][BR]>>>​"}, {"40": "Pěkný, ale jak jsou velký, a co umí? [BR]....Stejně pojedu, abych je měl[BR]Dík za info!!"}, {"66": "Hm, a kdo říkal, že velikonoční event nebude?"}, {"90": "Ještě k receptům na výrobu kouzla Královská rekonstrukce, které by mělo být dostupné (nahodile) v Řemeslné výrobě od pondělka.[BR]Obecně zatím je to v řemeslné výrobě postaveno tak, že pokud na nějaký recept chybí zdroje tak to lze vykoupit diamanty. Myslíte, že tomu bude i v tomhle případě a nebo chybějící plánek z 10. bedny \"doplatit\" diamanty nebude možné? Kdo s tím máte zkušenost z beta serveru? Já jsem tam ještě na vhodný recept zatím nenarazil.[BR]BTW: Já bych byl PRO možnost placení - je tomu tak v celém Elvenaru a proč tedy ne v tomto případě."}, {"97": "@ElfMaGorr akorát mám te´d na betě v craftingu recept na 30x kouzlo královské rekonstrukce,chce to 3 plánky a 7 činidel.Plánek mám jen 1 a činidla všechny a chce to po mě doplatit ještě 300 dia"}, {"102": "tak to je to levnější, než plánky samotné [smilie--sprite1] protože jeden plánek je 320 dia podle toho co píšeš, stojí 10 kouzel jen 150dia, tzn to jen dokazuje, že bychom měli dostávat spíše tak 22 kouzel za jeden plánek."}, {"31": "Neviem teda kto mal aké informácie, ale veľkonočná udalosť bude. [smilie--sprite1][BR][BR]@moribundus ich hodnoty sú zatiaľ len vo vývoji, každopádne prinesú isté nové mechaniky, takže sa tentokrát jedná o trochu komplexnejší systém."}, {"16": "@iDavis Klasická, zkrácená, jaká? Bude studna?[BR]Je to poprvé, co budeme mít 2 události v jednom čtvrtletí. Pokud v druhé bude denní odměna studna, klidně jim odpustím, že v karnevalu není."}, {"11": "Jak v jednom čtvrtletí? Karneval je čtvrtletí první a velikonoce už druhé. Vánoční event byl ještě lonský."}, {"31": "@Lovec Krys dĺžku trvania zatiaľ neviem, vypadá to ale na mechanicky veľmi podobnú s karnevalovou (aspoň pokiaľ ide o princíp 20tich vlajočiek (vtáčích pierok) potrebných na ďalšiu hlavnú cenu a pod.). Novinkou je, že asi nebude set, ale niečo, čo bude jeho náhradou."}, {"16": "@voyager-1 Myslel jsem to tak, že doposud jsme měli velké eventy  4 x ročně. Letos to je tedy minimálně 5 (mi to rozhodně nevadí)."}, {"17": "Zatím nemůžeme prozradit více, mohu ale potvrdit slova iDavise, tj. na Velikonoce pro vás rozhodně něco plánujeme! [smilie--sprite2]"}]