[{"148": "Už se těším."}, {"149": "A jistě nejsi sama! 8)"}, {"43": "Také se těším,kor jestli to bude podobné tomuto systému,který je mnohem lepší než starší systém tří hlavních budov. "}, {"2": "já se těším na nesetové hlavní odměny [BR]pár rádských baráků jako bylo dřív, třeba Eldrasily bych bral"}, {"90": "Na beta už je oznámení, že zítra začíná další Dobrodružství společenství. Jak bude zvoleno schéma oznámeno nebylo. Bohužel s tím přitroublým překlikávání prý zase nic neudělali."}, {"99": "Někdo už schéma přidával, tak předávám  Snad to tak opravdu bude...[BR][BR]Spoiler: Schéma dobrodružství [IMG]https://i.ibb.co/z7Gyh5d/https-cz-forum-elvenar-com-index-php-attachments-upload-2019-3-10-14-4-37-png-2987.png[/IMG]"}, {"5": "Královská rekonstrukce...zajímalo by mne jestli při vylepšení budovy ze setu se zvedne množství surovin pouze té základní či i hodnota dalších kumulovaných-vázaných surovin. Př. Krarak dává ve 13.kap. 13884 elixíru, 12200 prach., 18300 drah. = 14.kap. ukazuje pouze 17080 elixíru /ale ostatní nevidím/. ?... děkuji případně za odpověd´[BR][BR][BR]Odpověd´zní = ano vylepší se i ty kumulované bonusy!! "}, {"90": "Angedev napsal/a:\t\t\tNěkdo už schéma přidával, tak předávám  Snad to tak opravdu bude...[BR][BR]Spoiler: Schéma dobrodružství Zobrazit přílohu uživatele 2987Klikněte zde pro zvětšení...Už to začalo a první mapa je opravdu tak jako v tabulce. DSál nevidím a neuvidím, protože náš cech na beta DS ignoruje. (A ani se nedivím)."}, {"102": "Mě ty odměny přijdou docela dobré, ale jen za předpokladu že se celý nebo drtivá většina lidí zúčastní, což ještě nevím pokud jo tak to tak náročné není a tolik scriptů jen tak člověk nevytočí... "}, {"99": "Spoiler: Odměny DS1. požehnání 15VB + požehnání 20VB + 1000 úlomků kouzel[BR]2. požehnání 30VB + 2500 úlomků kouzel + monument prastarých vědomostí[BR]3. 5000 úlomků kouzel + kupecká základna + pole zlata (kult.+pop.)"}, {"5": "DS... zdá se mi to jako September verze.  https://elvengems.com/fellowship-adventures/september-2018-adventure/"}, {"150": "další událost? další dobrodružství společenství? božínku! už se nemůžu dočkat ​"}, {"102": "Já musím.... božínku [BR][BR]"}, {"74": "No pokud bude Velikonoční událost bez \"setů\", bude to opravdový svátek, teď jsem jeden set dostavěl (16 ostrovů) a žádný nechci dlouuuuuho vidět  .... naopak potřebuji hodně malých kulturních budov (2x2) abych ucpal místa na pozemku..... z řemeslné výroby mi to nepadá (lávový kodex)..."}, {"72": "Zatím nevíme čím to bude nahrazeno, tak bych počkal s jásotem.. ale musíme věřit xD"}, {"149": "\"Věř a víra tvá tě uzdraví.\" 8)[BR]Sety jsou poněkud zrádné, jeví se mi. Mám zacpaný trh zbožím ze setů - každý si postavil, a ak jsem hleděl někteří hráči si kvůli tomu i zbourali manufaktury. "}, {"117": "u mě v tržnici žádné změny, nepřijde mi, že by set dával tolik, aby to ovlivnilo celý trh..."}, {"102": "Dožínkový set ho ovlivnil, o zbourání T1 jsem taky pak uvažoval ale s tím jak hloupě je celé RR udělané, k tomu zatím nemám odvahu."}, {"3": "trh ovlivňují hlavně turnaje. Co je třeba ,to obvykle nebývá. Úplně bych to neházel na sety. Byť pravda, prach už prakticky nenakupuju, i když ho nevyrábím ve fabrikách..."}, {"149": "No - vzhledem k tomu, že jsem nakoupil za hedvábí drahokamy v poměru 1:1...v nemalém množství...bych sety tak nepodceňoval. [BR]I když nevylučuji, že potřeba vykupovat provincie v turnaji toho může být příčinou."}]