[{"31": "Sneak Peek: Evoluce Fénixe #3[BR][BR]Spoiler: Sneak Peek<<<​[BR]Cože je to ta evoluce?[BR][BR][IMG]https://i.ibb.co/fC0d1k8/https-i-ibb-co-f-XSLb-YX-EL-sneak-peek-15-3-2019-6-png.png[/IMG][IMG]https://i.ibb.co/8KbgXSB/https-i-ibb-co-0-Z0j-Dyc-EL-sneak-peek-15-3-2019-4-png.png[/IMG][BR][BR]Minulý pátek malý ptáček, dnes již velký pták,[BR]z nového kouzla bude z něj pták ohnivák.[BR][BR][IMG]https://i.ibb.co/qNGzqjd/https-i-ibb-co-88r-FPbn-EL-sneak-peek-15-3-2019-1-png.png[/IMG][IMG]https://i.ibb.co/DL96Kn8/https-i-ibb-co-4pb-Bn8-X-EL-sneak-peek-15-3-2019-3-png.png[/IMG][IMG]https://i.ibb.co/t2fvnqb/https-i-ibb-co-R6v-Mm8-D-EL-sneak-peek-15-3-2019-2-png.png[/IMG][BR][BR]Ba dokonce..[BR][BR][IMG]https://i.ibb.co/zhVcFFh/https-i-ibb-co-Xspgh-Hc-EL-sneak-peek-15-3-2019-5-png.png[/IMG][BR][BR]>>>​"}, {"151": "Netuší někdo, kdy bude zahájeno Dobrodružství na normálních serverech? [smilie--sprite5]"}, {"31": "@Dariunis pravdepodobne v pondelok 18.3."}, {"99": "Už? Já počítám až s 25. březnem [smilie--sprite10]"}, {"102": "Jak na to tak koukám, tak my budeme tedy z nějaké budovy získávat tzv Pet Food, tím budeme krmit v nějaké budově nějakého ptáka, tím ten pták prostě bude růst a dávat více a více něčeho, až do nějakého levelu? - To je čistě moje dedukce ze spoileru a  informace z bety, ale docela to do sebe zapadá. Jako nevím zda chci tamagoči... ale tak uvidíme."}, {"146": "ja doufám že pravdu ma iDavis příští týden [smilie--sprite1]"}, {"102": "Já celkem vážně zvažuji, že si zkusím upravit scripty hry abych při odmítání úkolů nemusel aspoň to okno potvrzovat jak u Chocholoušků, ale jako upravovat ten mega velkej kompilovanej zdroják je fakt za trest."}, {"146": "dobrodružství jedu jen na mobilu, tam to je mnohem lepší, jen to chce si pamatovat kde co se vyrábí"}, {"66": "To asi říkají vývojáři a proto stále zdržují s předěláním systému odmítání úkolů. [smilie--sprite1]"}, {"102": "To nejde, na PC je mnohem rychlejší zadávání výroby pomocí čísle na klávesnici."}, {"3": "ono i to vybírání výroby na tabletu je o nervy, aby člověk gramlavým prstem nešáhl vedle [smilie--sprite8] Navíc, poklud máš ve stejných budovách různé výroby, tak kdo si má pamatovat, co kde je..."}, {"149": "Ale té \"radosti\" když něco šouláš dva dni a pak hrábneš vedle...[smilie--sprite1] 8)"}, {"148": "To je fofr [smilie--sprite1] Skončil Karneval a za rohem je Dobrodružství. Na kdy to vidíte? Už v pondělí 18.3. nebo až později? Jinak na fanwebu  je tabulka dobrodružství pro společenstva. [BR]Docela povedená věcička. U nás hrajeme  dobrodružství na pohodu, ale i tak se hodí."}, {"31": "@Sycorax presný termín začiatku zatiaľ nie je známy, ani oficiálny. Na bete sa začalo posledný pondelok, v prípade dobrodružstiev býva medzera medzi betou a našim serverom obvykle 1 týždeň, avšak nevylučujem, že to tentokrát nemôže byť inak."}, {"15": "Zajímalo by mně , v kolik hodin to obvykle začíná  - v poledne , nebo až večer ?[smilie--sprite11]"}, {"99": "Dobrodružství obvykle začíná v poledne, aspoň myslím, ale vzhledem k tomu, že ještě nebylo žádné oznámení, očekávala bych to opravdu až za týden, případně tento čtvrtek [smilie--sprite1]"}, {"102": "Jak není notifikace o začátku, kde varují o tom že člověk nesmí opouštět spolek, tak to prostě dnes nebude myslím."}, {"149": "Což je v souladu s konstatováním Forsetiho...že dají včas vědět...8)[BR]Stejně mám všechno zapráskaný houbovejma farmičkama, takže mi to může být fuk...[smilie--sprite8][BR][BR]Odstraněna citace. Embla"}, {"15": "Přesně tak . [smilie--sprite8]"}, {"152": "Ahoj,ví už někdo kdy začne dobrodružství?"}]