[{"99": "Až to členové týmu oficiálně oznámí [smilie--sprite11]"}, {"72": "No, oficiální oznámení přichází ve hře zpravidla dva dny po spuštění události, takže to už ho asi nevytrhne [smilie--sprite1]"}, {"99": "Dobře, já se tedy opravím, myslela jsem samozřejmě na fóru..."}, {"149": "Až ho predikují, tak to bude \"za chvilku\". 8)"}, {"17": "athlan napsal/a:\t\t\tNo, oficiální oznámení přichází ve hře zpravidla dva dny po spuštění události, takže to už ho asi nevytrhne [smilie--sprite1]Klikněte zde pro zvětšení...Upozornění na blížící se dobrodružství společenství se snažíme zasílat ještě před tím, než dané dobrodružství začne. A pokud mě paměť neklame, tak nikdy jsme tuto tradici neporušili, upozornění jsme vždy poslali ještě před začátkem události. [smilie--sprite2]"}, {"5": "pouze na apce: inventář - kouzla - krmení [smilie--sprite1][BR]...asi si budeme vykrmovat každý vlastního Fénixe??!!"}, {"102": "jj jmenovalo se to pet food a někde tady je od iDavise taková budova co evokuje to krmení,"}, {"16": "Jo, už si dokonce na betě stavím (v lesních elfech) akademii kouzel, abych si vyzkoušel, zda má cenu se tím zabývat, až to dorazí sem."}, {"72": "Forseti napsal/a:\t\t\tUpozornění na blížící se dobrodružství společenství se snažíme zasílat ještě před tím, než dané dobrodružství začne. A pokud mě paměť neklame, tak nikdy jsme tuto tradici neporušili, upozornění jsme vždy poslali ještě před začátkem události. [smilie--sprite2]Klikněte zde pro zvětšení...Jako u těch oznámení nejsou datumy, takže těžko se soudit, ale obecně taková situace rozhodně nastala. Nevím zda přímo u dobrodružství, ale u eventů obecně se jistě stalo že oznámení přišlo třeba druhý den po začátku. No nic.[BR][BR]Proč je zdvojený počítadlo u výrob?[BR][IMG]https://i.ibb.co/1nhP2xn/http-images-athlan-net-i-1912-1-vyroba-png.png[/IMG]"}, {"150": "athlan napsal/a:\t\t\tProč je zdvojený počítadlo u výrob?\t\tKlikněte zde pro zvětšení...dneska vyšla nová aktualizace, tak třeba proto"}, {"31": "@athlan údajne kvôli príprave nového prehľadu, ktorý bude čoskoro dokončený."}, {"114": "@iDavis, prosím co myslíš konkrétně tím novým přehledem?"}, {"31": "@luterina ten tooltip, ktorý sa zobrazí po podržaní kurzora nad produkujúcou budovou."}, {"114": "@iDavis, aha, díky! ..a je v něm chyba i v textu: Stávající výrob\t\t\t\t\t\t\t\t\t\t\t\t\t[IMG]https://i.ibb.co/7yk9n3h/http-images-athlan-net-i-1912-2-elvenar-tooltip-3-2019-png.png[/IMG]"}, {"31": "Sneak Peek: Evoluce Fénixe #4[BR][BR]Spoiler: Sneak Peek<<<​[BR]A prý každý z nich něco umí?[BR][BR][IMG]https://i.ibb.co/TLFZ3nT/https-i-ibb-co-Cskv7-VB-EL-sneak-peek-22-3-2019-1-png.png[/IMG][BR][BR]K dispozici pouze při častém krmení.[BR][BR][IMG]https://i.ibb.co/BrTcPRZ/https-i-ibb-co-Wy-KJKc-F-EL-sneak-peek-22-3-2019-2-png.png[/IMG][BR][BR]​"}, {"16": "@iDavis, Hádám, že nám zatím ještě neprozradíš ty efekty trošku podrobněji? Nebo si mám počkat až to nasadí na betu, abych zjistil, zda má cenu se vůbec obtěžovat  to krmení craftit?"}, {"66": "Hele, nepřehánějte to s tím kraftěním. Už teď kraftím jenom stromky na turnaje, duhové jednorožce+zamrzlé pařezy jednou za kapitolu a královskou rekonstrukci a stějně jsem věčně dole s úlomky kouzel.[smilie--sprite4]"}, {"2": "tak to se nemusíš bát, krmení žere relikvie"}, {"66": "Které? Už jsem musela změnit hlavní turnaje z bonusových relikvií na T+2, protože výroba spojovacích činidel je žere nejvíc."}, {"31": "@Lovec Krys no, každý z tých 3 efektov bude nejakým spôsobom, okrem iného prínosom aj pre turnaje, takže myslím si, že produkcia krmiva, najmä pre turnajových hráčov (nie len) sa určite oplatí. Nechcem to ale zatiaľ viac konkretizovať, keďže detaily sú ešte stále len vo vývoji a môžu sa zmeniť.[BR][BR]@Prealiena pokiaľ viem tak by malo pribudnúť 9 receptov na krmivo, každý s využitím iného druhu relikvie."}]