[{"31": "Hlavných cien je dokopy 100.  A bolo to rovnako aj v niekoľkých posledných udalostiach."}, {"102": "Bude to stejné jako o minulého eventu dle toho jak to vypadá, tzn já bych získal tak možná 4 vylepšení a s tím to ani stavět nebudu, možná 5 vylepšení i tak by to pak nemělo smysl a jestli bych čekal rok do dalšího fénixe na další tyhle věci... to pak asi moc smysl mít nebude "}, {"16": "Já si to napřed vyzkouším na betě. A když tak to nechám hnít v inventáři, na fozflákání na fragmenty mám další věci.[BR]A na první pohled to vypadalo tak hezky - budova, která pernamentně přidává bonus k útoku jednotek, to už by se vyplatilo. Ale pak jsem zjistil, že to dává jen když je nakrmená, a to už je o něčem jiném."}, {"72": "Well, buď rád. Vem si že rok vylepšuješ svatostánek a i tak máš na konci sotva polovinu toho, co člověk, který se snaží tejden v události. Je dobře když se uvažuje s ohledem na to, protože by postrádalo smysl se o cokoliv snažit, když nějaká novinka bude najednou jednorázově lepší než dlouhodobá snaha. Ve hrách kde se tohle začne dít to jde většinou do kytek."}, {"94": "Jesti jsou informace na gems spravne a pujde se sotna dostat na sednou uroven (predposledni stupen odmen). Tak milej fenix pujde do salamu (na fragmenty)... :-("}, {"94": "ExplorerFfff napsal/a:\t\t\tBude to stejné jako o minulého eventu dle toho jak to vypadá, tzn já bych získal tak možná 4 vylepšení a s tím to ani stavět nebudu, možná 5 vylepšení i tak by to pak nemělo smysl a jestli bych čekal rok do dalšího fénixe na další tyhle věci... to pak asi moc smysl mít nebude Klikněte zde pro zvětšení...Neboj, za rok to kouzlo bude jine, aby prave neslo bouzit na aktualni budovy..."}, {"102": "@athlan Jenže svatostánek nemusím na hodinu krmit 11 relikviemi a vyrábět činidla či craftit, poskytuje především kotel kutury. Tohle bych stavěl jen dostat to vysoko, aby se to vyrovnalo jako popkulturní budově, jinak to je moc velké na \"občasné\" použití.[BR][BR]Si vemte, že musíte na celý turnaj potkat celkem 6 krmení, takže ano, je super, že by vám to poskytlo útok na vše, ale pokud na vše nepotřebujete (což je problém jen pár turnajů) tak je lepší za 600 scriptů vycraftit tu spec budovu pro danou jednotku. Bude to levnější. Prostě jestli ta budova nebude výhodná bez toho efektu, u mě stát nebude, já si odpad pro nějaké \"jiné pocity\" jako ostatní nestavím "}, {"16": "@athlan Pak je otázka, zda ta budova neztrácí význam.[BR]Jinou věcí je, že ty divy by dle mě zasloužily vylepšit, zejména na vyšších úrovních to potřebuje hromadu knih a výsledné vylepšení bonusu je hodně malé."}, {"72": "Řada divů se vyplatí, některé samozřejmě méně, ale v podstatě tam dáváte stejně VB, co jinde nevyužijete, takže je to myslím fajn bonus.[BR]A jo, osvícená střelnice a spol je samozřejmě lepší, ale trend tempa penetrace novýho balastu do craftingu zakládá obavu, zda je půjde ještě nějak solidně získat. Takže do toho ohniváka určitě půjdu, proč nemít alternativu. Navíc u mýho způsobu turnaje, kdy hraju hlavně na VB, tedy hodně provincií na dvě hvězdy mi při 24hodinové působnosti bonusu bude stačit kouzlit za turnaj jednou."}, {"102": "ten bonus ale není na 24 hodin, mě to psalo 1h ne? Nebo to tedy pak po kliku hodí jinou hodnotu? Tak již to čtu, tak pak dejme tomu ale i tak pro mě pokud nezískáme jednoho fenixe na full resp na 9 level aby dával portál, stavět nebudu. Nestojí to za ty hodnoty (pro mě čistě matematicky)"}, {"16": "@ExplorerFfff Ohnivák dává na lv1 při použití krmiva efekt na 24h. Včera večer jsem to na betě zkoušel, takže začátek turnaje to ještě chytne. Moje otázka, zda se to ještě s levelováním prodlouží zůstala zatím nezodpovězena."}, {"72": "Je to na 24hodin, taky jsem to zkoušel. Ta hodnota by měla být trvalá (alespoň na lvl2 je to pořád 24hodin)."}, {"73": "iDavis napsal/a:\t\t\tNa bete sa začína tohtoročná veľkonočná udalosť.. [BR]Evoluce Fénixe[BR][BR]Tentokrát vyskúšam vynechať doplňovací formát prehľadu udalosti a pre účel jednotného umiestnenia nájdete iba jeden prehľad - obvyklý - v téme Události a úkolové linie - Velikonoční událost. V tomto príspevku sa neskôr objaví textová verzia úloh.[BR][BR]...[BR]​[/spoiler][BR][BR]Spoiler: Textová verzia úloh-Klikněte zde pro zvětšení...[BR]Prosím ještě ty úkoly pro kopírování "}, {"31": "@LuciskaCh sú tam [BR][BR]Zároveň, pred chvíľou som pridal zoznam úloh aj do prehľadu."}, {"66": "Tak to jo, už jsem se dočetla, že fénixové se dostanou v prvních třech úkolech. Vyděsilo mě, že bych měla vytočit 54 hlavních cen.[BR]Ale i tak když čtu na gems, že se dá nasbírat esence cca na 12 cen = 6 artefaktů, tak mi to moc chuť do eventu nepřidá.[BR]Jediná odměna, co mě na tom zaujala, je portal profit, co dává ohnivý fénix, ale až na deváté úrovni, na kterou asi stejně nenasbírám artefakty.[BR]A jak mám rozumět tomu 48h/48h, dá to požehnání každých 48 hodin, nebo jenom jednou a dost?"}, {"102": "No jednoduše, jestli nebude během eventu jako denní cena ten ertefakt, tak to jde mimo můj zájem právě proto že ten portál tam ze začátku není a navíc by to dávalo bídné hodnoty popkultury  Tak uvidíme, kdyžtak do craftingu je to 16 polí velká budova, to máte 1920 scriptů, to je fajn zadarmo hned třikrát "}, {"73": "iDavis napsal/a:@LuciskaCh sú tam [BR][BR]Zároveň, pred chvíľou som pridal zoznam úloh aj do prehľadu.\t\tKlikněte zde pro zvětšení...[BR]díky, díky, díky :-*  seš nejlepší "}, {"31": "@Prealiena údaj pred lomkou \"/\" označuje, po akom čase je možné vykonať prvý (čiastočný) zber produkcie a za -  aký je čas kompletnej produkcie. A dve rovnaké čísla jednoducho znamenajú, že je možný iba plný zber. Čo je v prípade tých budov jedno kúzlo (produkcia) na 48 hodín.[BR][BR]@ExplorerFfff údajne sa budú dať artefakty zbierať aj mimo udalosti, takže ja by som s tým craftením počkal. Nepočítam, že nám budovy umožnia bez väčšej námahy (a dotácie) postupne povylepšovať všetky, ale aspoň by som počkal kedy kde sa nejaké objaví, aby potom nenastala situácia, že mám artefakty, ale niet čo s nimi. "}, {"102": "To ano, já craftím od nejstarší po nejnovější a šetřím, protože už byli podmínky \"získej\" v eventech tzn necraftím předem. Ovšem déle jak další rasu ty budovy držet nebudu, RR padá méně než bitcoin, tzn to pak trochu nemá smysl držet starý ale klidně si to prostě půl roku podržím v inventáři  Také počítám že možná bude možné artefakt nějak získat ale jde čistě o to, jak moc budova zestárne než jich bude dost, artefakty asi půjdou totiž taky rozčarovat "}, {"72": "Na betě je nabídka na bonus +1 ke sběru. Stojí to 225kč, když to dali prvně, to je asi dva eventy zpátky, stálo to 125kč. Tak honem kupovat, příště už to tak levný nebude "}]