[{"74": "Evoluci Fénixe vypouštím, nicméně doufám...!, že se mi pak v řemeslné výrobě nebude zobrazovat krmení a zabírat jiné nabídkové sloty.....?"}, {"102": "Podle všeho bude, hned 9x"}, {"16": "No tímhle tempem tak zhruba za rok většina strategicky myslících bude ve stavu, kdy moc craftit nebude, protože bude dostávat jen samý balast, který za craftění nestojí.[BR]Samozřejmě pokud se do té doby nezrychlí rotace receptů."}, {"74": "@Lovec Krys, zrychlení rotace asi nehrozí....když je zpoplatněno za dia."}, {"102": "Jo já za poslední 3 týdny vycraftil 10 RR a jeden pařez na výměnu, kontroluji všechny tři denní časové okna, je to celý k ničemu. Doufal jsem, že by RR byli ve výzvě ale tam dali prozměnu ty slzy herpesu.[BR][BR]Ovšem po přidání RR se častěji zobrazují budovy, které byli na konci, řekl bych, že přidáním toho krmení by se mohli častěji ukázat RR."}, {"74": "@ExplorerFfff, \"kraftím\" pouze lávový kodex......kultura 1125/pole asi nemá konkurenci (z běžně dostupných budov)"}, {"102": "Já taky, stejnou kulturu mají totiž ty pařezy a mají jednu výhodu, lidi ti je nemůžou motivovat tzn je lze cpát i tam, kde chceš upřednostnit motivaci něčeho jiného, protože většina lidí nechápe jak se zdá, že jím podstrkuješ něco k sídlu a stejně brouzdají po městě a hledají snad nejmenší packu [smilie--sprite8][BR][BR]Resp pařezy mají ještě větší kulturu, za dva máš 4600 zatím co za kodex 4500"}, {"16": "@Silversnake By mě zajímalo, kdo na to tlačítko někdy kliká..[BR]Pokud nebude žádný bezdiamantový způsob, jak urychlit rotaci receptů při neustálém růstu jejich počtů, jediný výsledek (pro mne a předpokládám že pro velké množství dalších) bude ten, že se postupně budu vracet do stádia před nasazením řemeslné výroby, tzn. 100% času akademie bude vyrábět jiné kouzlo namísto spojovacího činidla, jen tak jednou měsíčně si ukraftím budovu, když na ni zrovna přijde řada v záplavě spousty neužitečného balastu.[BR][BR]Pro mne je kraftění jakéholiv nevojenské kulturky zbytečné. Kultury mám dost a na kulturní bonus nehraju. Zvedá to jen produkci mincí, kterých mám dost, a kladiv, jejichž produkci mi jistí neustále rostoucí zásoba kouzel a požehnání, tudíž další zvyšování kultury je pro mne jen plýtvání místem. A díky tomu je mi úplně fuk, co - a jestli vůbec - mi lidi motivují."}, {"102": "Já o tom kliknutí na to tlačítko uvažuji, abych si posunul čas tak, aby se mi noční okno otevíralo cca v 23:30 v létě a 22:30 v zimě, tím bych měl dostupné vše pohodlně a nepřekrývalo by se mi to, jen mi furt přijde cena za \"posun\" do dvě hodiny vysoká tak stále tak nějak váhám."}, {"16": "@ExplorerFfff Pokud nespíš 8+ hodin, tak to moc nevadí, nejhorší, co tě potká je to, že se ti vymění jenom 4 recepty z 5, když ten pátý právě vyrábíš."}, {"102": "Já se ke hře dostanu až někdy okolo 10h, dřív spím nebo řeším práci a ta hra prostě moc prioritu nemá. Ale jo zatím to tak dělám, z postele motivuji a kouknu co tam je [smilie--sprite1]"}, {"31": "Vymyslel som nejaký systém uvádzania nových budov z nadchádzajúcej veľkonočnej udalosti - konkrétne ich evolučných bonusov, v téme Speciální budovy. Ideálne by bolo samozrejme vytvoriť akési rekurzívne, alebo vnorené tabuľky, ukazujúce evolučné stupne pre každú kapitolu zvlášť, avšak tým by došlo k presiahnutiu limitu 10000 znakov a 20 obrázkov na príspevok zároveň. Vytvoriť praktickú a prehľadnú tabuľku využitím iba BB kódov na tomto fóre je tak trochu boj, no napriek tomu dúfam, že sú údaje v nej dostatočne prehľadné a pochopiteľné."}, {"40": "iDavis, super práce, sice se mi v mobilu nezobrazuje celá tabulka (zřejmě číňan) nepřelouská.[BR]Ale, kdy to začne ??[BR]Zítra?? Nebo až za týden?[BR]Nestíhám dodělat kapitolu - budu muset bourat ostrovy."}, {"31": "@moribundus termín zatiaľ nie je známy. Čo sa týka tých tabuliek, môžeš si v mobilnom prehliadači zobraziť verziu Web pre počítače (napr. v Chrome cez 3 bodky hore vpravo a následne \"Web pre počítače\"). Tým sa zobrazí celá tabuľka."}, {"104": "Zdarec lidi, když mam vylepšit budovu na lvl 11(nebo13) jde jen postavit budovu ze skladu co je z věku amuni nebo vylešit přes rekonstrukci?  V karnevalu to fungovalo, tak jestli to nechcete zkusit na testu jestli to jde stále. Díky [smilie--sprite1]"}, {"117": "Pak uz to taky nefungovalo, asi to nekdo aktivni nahlasil [smilie--sprite3]"}, {"102": "jo na betě si jeden pomahač stěžoval [smilie--sprite3] přitom to mohlo řešit problém nás na konci výzkumu, pro které jinak eventy můžou skončit jakmile vylepšíme vše co můžeme pokud nechceme stavět a bourat u blbých."}, {"136": "iDavis napsal/a:@LuciskaCh sú tam [smilie--sprite1][BR][BR]Zároveň, pred chvíľou som pridal zoznam úloh aj do prehľadu.\t\tKlikněte zde pro zvětšení...Nazdárek,[BR]jsem asi lempl, ale ty úlohy co jsou ve spoilerech jsou obrázky a nedají se zkopírovat. Nebo mi něco uniká..[BR]Chtěl bych si to hodit na papír, ať si můžu plánovat a škrtat, ale nejde mi to standartně zkopírovat.[BR]Prosím návod [smilie--sprite5]"}, {"102": "textovou máš zde https://cz.forum.elvenar.com/index....beta-serveru-spoilery.2206/page-97#post-92156"}, {"31": "@Corwin22 v poznámkach pod zoznamom úloh je taktiež aj odkaz na túto textovú verziu."}]