[{"1": "Dear Humans and Elves,[BR][BR]Please use this thread to discuss the update to the version Chapter 18 - Team Spirit event.[BR][BR]We're looking forward to your feedback![BR][BR]Kind regards,[BR]Your Elvenar Team"}, {"25": "I got the first quest and was able to gain an expansion from finishing 550 provinces, but there is nothing in the tech tree.  Tomorrow?"}, {"4": "Maillie said:\t\t\tI got the first quest and was able to gain an expansion from finishing 550 provinces, but there is nothing in the tech tree.  Tomorrow?\t\tClick to expand...[BR]Collect 25k seeds, I still dont have the tech tree either.[BR][BR]Someone at Inno @anonglitch forgot to press the \"GO\" button"}, {"12": "It's probably right beside the \"wait\" button"}, {"2": "the expansion you got is for completing 550 provinces, no matter in what chapter you are. I assume that ch.18 is on its way and will land here very soon."}, {"59": "SkyRider99 said:\t\t\tIt's probably right beside the \"wait\" button\t\tClick to expand...[BR]I don't see any \"wait\" button. I don't see any information on having to wait for the research (other than its absence from the tech tree).[BR][BR]Given the in game announcement saying that the new chapter starts now, and I can start the quests, does this mean that some other condition needs to be satisfied before we can access the research? Do we need to complete some quests first? This is different to behavior in previous chapters where we could see and start the research when the chapter is initially released."}, {"4": "WinterLord Byron said:\t\t\tI don't see any \"wait\" button. I don't see any information on having to wait for the research (other than its absence from the tech tree).[BR][BR]Given the in game announcement saying that the new chapter starts now, and I can start the quests, does this mean that some other condition needs to be satisfied before we can access the research? Do we need to complete some quests first? This is different to behavior in previous chapters where we could see and start the research when the chapter is initially released.\t\tClick to expand...[BR]Yes this is puzzling given the ingame announcement.[BR][BR]To add, just had a game update and still no ch18."}, {"25": "They broke it."}, {"4": "It is now there. [smilie--sprite1]"}, {"12": "I thought Ch XVII was huge. Team Spirit is a veritable monster!"}, {"35": "Oh, Drone Riders might actually be useful once the new upgrade is researched!  So much more durable against incoming light ranged damage and a decent reduction against incoming mage damage too now.  They might actually live long enough to be able to hit the enemy now!"}, {"8": "I don't even care about the stats (yet), but the name of the new chapter 'Team spirit'......Are you 'avin a laugh?[BR][BR]Is that it? It sorta sounds like you couldn't be bothered to try. Ugly."}, {"24": "I doubt it will make me want to play chapter 16 and 17 first... So have fun with it if you enjoy such things [smilie--sprite1]"}, {"4": "This is a grind from the start, built the portal but cannot do anything with it until I do a load more techs, so is sat idle, most likely for at least 3 weeks to a month while I do more tech unlocks, Inno we are humans, we don't live forever....  How is that team spirit, so far it is just more waiting so more time away from the game in frustration, so I would call it \"Team Breakup\".[BR][BR]It has been suggested to me that I  \"just delete it\", and that is on my mind."}, {"35": "m4rt1n said:\t\t\tThis is a grind from the start, built the portal but cannot do anything with it until I do a load more techs, so is sat idle, most likely for at least 3 weeks to a month while I do more tech unlocks, Inno we are humans, we don't live forever....[BR][BR]It has been suggested to me that I  \"just delete it\", and that is on my mind.\t\tClick to expand...[BR]Gotta make the most of the tournaments for KP with these long chapters.  I've unlocked my Ascended goods boost and am currently churning them out and have the KP filled in for the Superior trader research, just waiting on the Unurium to unlock it which I'll have in about 12 hours.[BR][BR]Should have the settlement streets, squares and hubs all unlocked by Tuesday evening after the next tournament goes live.[BR][BR]I've not bought any KP and my KP bar was empty the night before research opened up.  Not spent diamonds, not used any time boosters.  Also had no Unurium (well, okay, I had the undecayable 9 units) in stock on Monday, when I switched my trader over from seeds.[BR][BR]It won't take 3 weeks to get your settlement going if you're getting a good amount of KP from each tournament. [smilie--sprite1]"}, {"4": "@Paladestar which tech unlocks the ascended goods boost, I concentrated first on unlocking my boosted goods and upgrading the 2 marble in my case I had prepared ready and can produce but with no boost yet."}, {"35": "m4rt1n said:@Paladestar which tech unlocks the ascended goods boost, I concentrated first on unlocking my boosted goods and upgrading the 2 marble in my case I had prepared ready and can produce but with no boost yet.\t\tClick to expand...[BR]It's the third research down in the column with the \"Superior Trader\" research at the top.  In my case, it's called \"Ignited Ingots production Boost\"."}, {"2": "m4rt1n said:@Paladestar which tech unlocks the ascended goods boost, I concentrated first on unlocking my boosted goods and upgrading the 2 marble in my case I had prepared ready and can produce but with no boost yet.\t\tClick to expand...You don't need 2 manufactories for Ascended goods. In the chapter break I prepared 2 marbles lvl.31, brought back only 1 and at 3h prod. with MM spell I get a bit over 12k Minerals. Considering that we can exchange 1800 or 2000/ Merchant I think 1 it's enough (at least at this stage of the chapter).[BR][BR]I didn't pay much attention to the upgrades' costs since I started to gather the Unurium about a week before the chapter was launched on live servers and I thought I had plenty of everything else [smilie--sprite8]  Well, after  I upgraded 3xT1, the MH and the trader I noticed that my mana it's gone, from +9mil. down to 200k [smilie--sprite8] [smilie--sprite8]"}, {"37": "Does anyone have Chapter 18 questline please?"}, {"2": "@Booff - here you have it.[BR]\t\t\thttps://cavalieridellozombiaco.blogspot.com/p/team-spirit.html\t\t[BR]Question: - Is there any building giving Unurium? I hoped that Festival Merchant will give if it's from ch.18. Unfortunately it still gives seeds. Same for Snow Owl set."}]