[{"4": "So Inno want \"Team Spirit\" then make my trader upgrade 3 days long, so I cannot help my team for 3 days. Seems Inno just want to destroy team spirit, not make it....."}, {"35": "m4rt1n said:\t\t\tSo Inno want \"Team Spirit\" then make my trader upgrade 3 days long, so I cannot help my team for 3 days. Seems Inno just want to destroy team spirit, not make it.....\t\tClick to expand...The trader is too important to not have producing Unurium for three days, so in cases like this you should always use time boosters to instantly complete the upgrade."}, {"60": "m4rt1n said:\t\t\tSo Inno want \"Team Spirit\" then make my trader upgrade 3 days long, so I cannot help my team for 3 days. Seems Inno just want to destroy team spirit, not make it.....\t\tClick to expand...[BR]You get 165 hours of time instants from the spire each week if you complete it. 3 days isnt much."}, {"12": "From one of the other forum threads:[BR][BR]There's a new pop/culture building in ch18 that makes 2500 Unurium every 18 hours - Unur Museum - Takes up a 3x6 space though.[BR]Or if you wanna spend diamonds - Team Spirit Monument - Takes up 4x3, produces 4300 Unurium per day and they cost 2,880 diamonds each![BR]Both give trivial amounts compared to your trader though. [BR][BR]Note that I haven't reached this stage, so cannot confirm. Advanced Trader produces either divine seeds or unurium, as selected."}, {"61": "Regarding city building, I am quite satisfied with Chapter 18, since there are a lot of changes going on and you keep thinking about planing your city almost constantly! So yeay, city building is back over the whole chapter and not just somewhere in between.[BR][BR]The amount of time it takes to build something is reasonable, since that amount has stacked up over the chapters anyway. With the Spire there for your fellowship and the MA, there are enough boosts for the those, like me, lacking patience xD[BR][BR]The amount of Mana from the start seems enormous, but with some planning this can be achieved. I am able to upgrade a manufactory every 2-3 days while working on research or sitting down on elven architect.[BR][BR]Even though I was a bit sceptic about The Merchant, I have to say the amount you can trade there, even with some waiting time, is quite enough for what you actually need. You might just not start stock piling goods, but at least in my city I don't have to worry about not having enough to build either. The cost for those 5 merchants are quite reasonable. Gold is really no issue and the diamonds you can invest extra are easily compensated for by the Spire in those 20 days that those 2 last.[BR][BR]So far I have to say, I have found myself to be enjoying this chapter  [smilie--sprite9] [smilie--sprite1][smilie--sprite8][BR][BR]Regarding Unurium, I am trying to use all the Pop I have so that the output will be maximized. For seeds there are some Amuni Ships about and switching the trader every now and then. Mana is covered by Mana sawmills, Lava eggs and Desert Fortresses. Those will have to leave the map at some point to make place for the Guest race, when some of the huge mana chunks have been dealt with."}, {"37": "Alcaro my thanks"}, {"27": "My trader was producing unurium, but after upgrading it the production was set to seeds. I only found out next morning and therefore lost a significant amount of this highly demanded resource. It’s not a bug per say, so I’m using the feedback thread. In my opinion the trader should remember the production.[BR][BR]I play in the app. Though I suspect it would probably be the same in the browser."}, {"14": "Whoever came up with this trading system must REALLY hate player retention."}, {"25": "FieryArien said:\t\t\tMy trader was producing unurium, but after upgrading it the production was set to seeds. I only found out next morning and therefore lost a significant amount of this highly demanded resource. It’s not a bug per say, so I’m using the feedback thread. In my opinion the trader should remember the production.[BR][BR]I play in the app. Though I suspect it would probably be the same in the browser.\t\tClick to expand...It is, indeed, the same in the browser version.[BR][BR]I am  having no problem, whatsoever, in my main city with the trader system.  I do not have a rare goods and in the regular system of trades I would be subject to sitting on the trades or paying the scalpers' ridiculous zero star trades.  Very seldom are my trades from the Merchant not taken quickly.  Generally, in the time it takes me to set up my city for the next three hours, and maybe do some fighting, the Merchant is back and I have an announcement of my trade(s) being taken.  I then set up more for my away time.  In my case this is much, MUCH, better.  My beta city is far behind and has nothing to report yet.  I'm not a top level player, but I am loving the Merchant.  Set up trades.  Set up city.  Do some fighting.  Trades are taken.  Set up more trades.  Seems to be working pretty smoothly for me."}, {"27": "Maillie said:\t\t\tI am  having no problem, whatsoever, in my main city with the trader system.  I do not have a rare goods and in the regular system of trades I would be subject to sitting on the trades or paying the scalpers' ridiculous zero star trades.  Very seldom are my trades from the Merchant not taken quickly.  Generally, in the time it takes me to set up my city for the next three hours, and maybe do some fighting, the Merchant is back and I have an announcement of my trade(s) being taken.  I then set up more for my away time.  In my case this is much, MUCH, better.  My beta city is far behind and has nothing to report yet.  I'm not a top level player, but I am loving the Merchant.  Set up trades.  Set up city.  Do some fighting.  Trades are taken.  Set up more trades.  Seems to be working pretty smoothly for me.\t\tClick to expand...According to Elvenstats you are on the same server (Winyandor) with the same boost (Planks => Ingots) as I am. That’s not the problematic goods there. Based on the trades available in the trader the most demanded goods are Minerals and not-at-all demanded goods are Sprouts. Our Ingots are quite ok and I suppose they would be ok also in the usual trading system.[BR][BR]You can run the experiment yourself: for one day try posting trades offering sprouts instead of ingots and see how that goes.[BR][BR]The question is whether really no one needs sprouts or whether it’s just the new system of trading what causes the starving. The goods demand is though up well - it’s boost+2 for building Hubs and boost+1 for upgrading portal. Objectively there shouldn’t be a huge imbalance in demand unless there is a huge imbalance in the types of players in the 18th chapter."}, {"4": "The trades are limited to a few players at best, the quest to gain 50k of any ascended goods means players take all the trades as they hit that quest so not seeing them does not mean their is a fair balance of goods, when I check I take everything on Arendyll for example as I have built up about 150k of each good and the max trade seen is for 2200 and that is the players that rushed the chapter possibly with diamonds, most trades are at 1800 or 2000 max limit.[BR][BR]Why can we not trade higher will be a big problem in future, I usually trade around the 20k- 50k mark on everything else.[BR][BR]Another example of the devs, trying to help while having cities themselves back in ch7 or so..."}, {"29": "What is a \"Haunted Talent\" spell ?"}, {"35": "Robbo1894 said:\t\t\tWhat is a \"Haunted Talent\" spell ?\t\tClick to expand...Google translate being unable to properly translate \"incantesimi dote stregata\" into the correct Elvenar terms I'd guess.[BR]Looking at the translation of each word on its own it looks like the Ensorcelled Endowment enchant."}, {"24": "Robbo1894 said:\t\t\tWhat is a \"Haunted Talent\" spell ?\t\tClick to expand...[BR]I am a haunted talent! A talent of what I am not sure, but haunted is certain [smilie--sprite8]"}, {"35": "Gargon667 said:\t\t\tI am a haunted talent! A talent of what I am not sure, but haunted is certain [smilie--sprite8]Click to expand...You misspelled vaunted!"}, {"24": "Paladestar said:\t\t\tYou misspelled vaunted!\t\tClick to expand...[BR]Not a word that exists in an Orcish dictionary. haunting we can do, venting, too, but vaunting??? Must be something for fancy people [smilie--sprite8]"}, {"62": "come on, Orcs are not smart enough to have a dictionary[smilie--sprite7]"}, {"35": "Thagdal said:\t\t\tcome on, Orcs are not smart enough to have a dictionary[smilie--sprite7]Click to expand...Indeed, they don't even have toilet paper, let alone books!"}, {"32": "The enthousiasm for the new chapter can be felt, 2 pages in how many weeks? lol,[BR][BR]Go crappy Tournament/spire formula."}, {"62": "Orcs have now permeated this thread with their unholy stench, and smeared team spirit with dung.[smilie--sprite8] and rightly so..."}]