[{"35": "Thagdal said:\t\t\tOrcs have now permeated this thread with their unholy stench, and smeared team spirit with dung.[smilie--sprite8] and rightly so...\t\tClick to expand...Smells like team spirs*it?"}, {"63": "CrazyWizard said:\t\t\tThe enthousiasm for the new chapter can be felt, 2 pages in how many weeks? lol,\t\tClick to expand...Just means we all know how the game works and haven't any issues, same mechanics as every chapter and some of us are hoping for more than a month in the waiting room when we finish. I like the 4* Archers, easy to train. Initially, the Merchant needed speeding up, seems plenty of people now to get the trades cleared fast. Oh, and I like some of the rewards for the story quests, great idea sprinkling diamonds into some."}, {"24": "Paladestar said:\t\t\tIndeed, they don't even have toilet paper, let alone books!\t\tClick to expand...[BR]We do have the occasional books from looting some fancy peoples libraries (of course after first raiding the pantries), with the obvious lack of toilet paper production in the average Orc town, you can imagine how the two things connect!"}, {"39": "Some notes on ascended trades:[BR][BR]1. 2000-2200 trades are ridiculous in the light of how much is needed for the upgrades.[BR][BR]2. The old trades should be removed straight away as trade has been picked up or the merchant has been reset. Those old trades are easy pickings, not helping anyone, except the person with rare ascended, which is unnecessary, since they don't have any problems of getting what they need. They don't even need to hire merchants, so this is a terrible situation for those of us with abundant goods. At least if the old trades are removed, then the person with rare ascended would be helping others and not just themselves. On EN3 server the situation is especially difficult for those of us boosted in minerals, I'm close to throwing the towel, I have never been so frustrated with any chapter."}, {"64": "Regina8 said:\t\t\tSome notes on ascended trades:[BR][BR]1. 2000-2200 trades are ridiculous in the light of how much is needed for the upgrades.[BR]<snip>[BR]...except the person with rare ascended, which is unnecessary, since they don't have any problems of getting what they need. They don't even need to hire merchants, so this is a terrible situation for those of us with abundant goods.[BR]... On EN3 server the situation is especially difficult for those of us boosted in minerals, I'm close to throwing the towel, I have never been so frustrated with any chapter.\t\tClick to expand...Exactly.  Five pages of players demanding minerals.  Only a handful of trades demanding anything else, and players offering minerals seemed to have figured out they don't have to use the merchant, they just pick up any trades they want from the five pages of trades looking for minerals.[BR][BR]The merchant in theory may be a good solution to this sort of problem - you have someone to trade with for scarce resources - but at only 1800-2200 goods per trade, and a 6-hr cooldown period, it's ridiculously slow.  [BR][BR]The goods per trade needs to be increased, and Inno needs to fix the problem of one type of resource always becoming the one everyone needs."}, {"4": "Skallywag said:\t\t\tExactly.  Five pages of players demanding minerals.  Only a handful of trades demanding anything else, and players offering minerals seemed to have figured out they don't have to use the merchant, they just pick up any trades they want from the five pages of trades looking for minerals.[BR][BR]The merchant in theory may be a good solution to this sort of problem - you have someone to trade with for scarce resources - but at only 1800-2200 goods per trade, and a 6-hr cooldown period, it's ridiculously slow.[BR][BR]The goods per trade needs to be increased, and Inno needs to fix the problem of one type of resource always becoming the one everyone needs.\t\tClick to expand...[BR]The Library Set, especially in EN3, players just deleted cities and restarted if they had a scrolls boost. That is the root of the whole problem in my opinion. Only players who started and knew are now at ch18, so eventually it will even out. Maybe a year or two. If only the devs had at the time made the Library set T2 +1 or +2 there would be no issues but for some reason unknown to anyone they just refused."}, {"11": "Just reached the chapter and wondering if there any quests for deleting the Traders of Unar portal?  Need to know when it’s safe to delete all the Chapter 17 buildings!  [BR][BR]Also is Elvanarin Zero still used in Chapter 18 pls, or just Unurium?[BR][BR]Thanks [smilie--sprite1]"}, {"27": "Susie49 said:\t\t\twondering if there any quests for deleting the Traders of Unar portal?\t\tClick to expand...This I don’t remember. :-([BR]However, the general advice in such a case is to build some old portal - Dwarves or Fairies. Deleting it is supposed to work for such a quest. Some say you don’t even need to finish building it before you delete it. (I’ve never tried it myself, though.)[BR]Susie49 said:\t\t\tAlso is Elvanarin Zero still used in Chapter 18 pls, or just Unurium?\t\tClick to expand...Just Unurium."}, {"11": "Thanks [smilie--sprite1]"}, {"12": "Skallywag said:\t\t\tExactly.  Five pages of players demanding minerals.  Only a handful of trades demanding anything else, and players offering minerals seemed to have figured out they don't have to use the merchant, they just pick up any trades they want from the five pages of trades looking for minerals.[BR][BR]The merchant in theory may be a good solution to this sort of problem - you have someone to trade with for scarce resources - but at only 1800-2200 goods per trade, and a 6-hr cooldown period, it's ridiculously slow.[BR][BR]The goods per trade needs to be increased, and Inno needs to fix the problem of one type of resource always becoming the one everyone needs.\t\tClick to expand...[BR]Even more exactly [smilie--sprite1][BR][BR]Checked my trader tonight and found 30 pages (!) of players asking for primordial minerals. Including myself![BR][BR]Well said @Skallywag. Let's not hold our breath on any fix happening though [smilie--sprite6]"}, {"4": "It's worth checking the trader regularly, I'm on Arendyll and put it lots of merchant offers offering Minerals and they get taken in minutes.[BR][BR]There are pages and pages of players wanting Minerals though so I don't have to use the Merchants, I just do to help others."}, {"64": "SkyRider99 said:\t\t\tChecked my trader tonight and found 30 pages (!) of players asking for primordial minerals. Including myself!\t\tClick to expand...[BR]It's been getting worse over time.  It's at 31 pages right now.  31 pages of players looking for minerals, and no other goods.   I guess Inno is OK with 1/3rd of the players having a distinct advantage over the rest of us.  [BR][BR]I get all my minerals through the Merchant - slowly.  The other perhaps unintended consequence of which is my notification queue is full of merchant trades, so much that I'm missing visits with players outside my FS because they are falling out of the queue.  Every new guest race is a beta test I guess..."}, {"4": "Skallywag said:\t\t\tIt's been getting worse over time.  It's at 31 pages right now.  31 pages of players looking for minerals, and no other goods.   I guess Inno is OK with 1/3rd of the players having a distinct advantage over the rest of us.[BR][BR]I get all my minerals through the Merchant - slowly.  The other perhaps unintended consequence of which is my notification queue is full of merchant trades, so much that I'm missing visits with players outside my FS because they are falling out of the queue.  Every new guest race is a beta test I guess...\t\tClick to expand...[BR]Yes, I meant to mention that, also the handshake in notifications is now useless as merchant fills mine daily. I'm Mineral boost and putting all I can out there, 3 merchants running as I refuse to use hard earned diamonds for trade and spend time some days, and it takes time online for a solid hour to actively use the merchants.[BR][BR]To me it is ridiculous, yes keep the merchant for those stuck, the amounts allowed need to be x10 but also allow free trade, we are all long time players here and know how not to be ripped off by the sharks of the trader, some one in the devs needs to rethink, use the merchant for chapters 1-3 not the guys who have been here years.[BR][BR]Wrapping the players of ch18 in kid gloves to solve a problem caused by the excessive scroll production of the spire that is problematic and crept into sentient production with players thinking it's great to profiteer now, as the game is set that way, hence leaving others not finding trades as they were unfortunate to be scrolls boosted players.[BR][BR]Do the devs play the game or try and solve the scrolls spire issue by making Ascending goods players in ch18 unable to trade properly? @Silmaril and this time not the nonsense reply about scrolls and working 3 ways please?"}, {"4": "Not at all surprized this chapter discussion hasn't been posted in for so long, the latter stages are such a long slow drag, slower than anything previous, as the amounts of Team Spirit badges in the last 3 columns are insanely time consuming to get.[BR][BR]I'm on the last 7 tech now and still need well over 2000 badges, without time boosters and 3 of each building, I am averaging around 30 a day with active play.[BR][BR]Why make it so repetatively boring, no wonder so many players just give up..."}, {"35": "m4rt1n said:\t\t\tNot at all surprized this chapter discussion hasn't been posted in for so long, the latter stages are such a long slow drag, slower than anything previous, as the amounts of Team Spirit badges in the last 3 columns are insanely time consuming to get.[BR][BR]I'm on the last 7 tech now and still need well over 2000 badges, without time boosters and 3 of each building, I am averaging around 30 a day with active play.[BR][BR]Why make it so repetatively boring, no wonder so many players just give up...\t\tClick to expand...The biggest 'FU' was making the full queue on the level 4 portal 2 hours long.  Aside from that, with three of each hub type and the whole settlement at maximum level you create enough medals to make 60 badges per day.  Just do one batch of elementals (8 hours) overnight whilst you sleep and then 4 batches of medals (4 hours) during the day.  The portal being the bottleneck isn't too bad, you don't need to use too many time boosters per day to make up for its idle queue whilst you sleep.[BR][BR]I finished the chapter a couple of weeks ago on this character and a few days ago on my other character.  Just glad this chapter is now behind me!"}, {"25": "I was checking yesterday to see if anything new had been posted or answered.  I'm in the 280 row, next to last one.  I may live long enough to ever finish this.  It's excruciatingly slow to get 5 badges at a time when you need a couple thousand.  No one in either my main city here or in my Beta city are remotely close to where I am.  This was a bad idea.  Very bad.  [BR][BR]The Merchant worked for me and is working for the ones that are in 18 in my fellowships.  The limit of 5 badges is working for no one.  I suppose it would work for the ones in top fellowships that make it to the top of the Spire and have numerous time boosts, but for the majority it isn't working at all."}, {"2": "Paladestar said:\t\t\tThe portal being the bottleneck isn't too bad, you don't need to use too many time boosters per day to make up for its idle queue whilst you sleep. [BR][BR]I finished the chapter a couple of weeks ago on this character and a few days ago on my other character.  Just glad this chapter is now behind me!\t\tClick to expand...[BR]I am very curious how you finished the chapter about 2 weeks ago without using \"too many\" time boosters. I am producing between 50 and 60 badges/ day without time boosters (The damn Spire decided for the last 2 months to give me anything but time instants) and I still have 480 badges to go."}, {"35": "Alcaro said:\t\t\tI am very curious how you finished the chapter about 2 weeks ago without using \"too many\" time boosters. I am producing between 50 and 60 badges/ day without time boosters (The damn Spire decided for the last 2 months to give me anything but time instants) and I still have 480 badges to go.\t\tClick to expand...Well, yeah, all things relative, but 8-10h of boosters per day isn't a lot to me. [smilie--sprite1]"}, {"25": "Alcaro said:\t\t\tI am very curious how you finished the chapter about 2 weeks ago without using \"too many\" time boosters. I am producing between 50 and 60 badges/ day without time boosters (The damn Spire decided for the last 2 months to give me anything but time instants) and I still have 480 badges to go.\t\tClick to expand...[BR]I couldn't get a time booster in the Spire for about 3 weeks.  I was nearly out of them.  There was no way I could have finished this mess several weeks ago.  [BR][BR]My fear is that this chapter is going to have the runaway effect of Chapter 15.  People may want to go a different direction, rather than making 5 of something that they need thousands of.  [BR][BR]The devs are trying to slow down the ones that complain about finishing so fast.  They are not actually complaining, they're bragging, and doing everything they can to be able to do so.  The devs really need to learn the difference.  We all want to finish a chapter so we can play the events and FA's.  It's a big part of our fun.  [BR][BR]The vast majority of players are not going to complain that they finished a chapter before the next one comes out, they're going to rejoice."}, {"4": "Maillie said:\t\t\tI couldn't get a time booster in the Spire for about 3 weeks.  I was nearly out of them.  There was no way I could have finished this mess several weeks ago. [BR][BR]My fear is that this chapter is going to have the runaway effect of Chapter 15.  People may want to go a different direction, rather than making 5 of something that they need thousands of. [BR][BR]The devs are trying to slow down the ones that complain about finishing so fast.  They are not actually complaining, they're bragging, and doing everything they can to be able to do so.  The devs really need to learn the difference.  We all want to finish a chapter so we can play the events and FA's.  It's a big part of our fun. [BR][BR]The vast majority of players are not going to complain that they finished a chapter before the next one comes out, they're going to rejoice.\t\tClick to expand...[BR]Seems the activity now in this thread to me suggests many of us are now on the final 2 or 3 columns of tech, no space or interest in helping the Fellowship with the adventures rings a tune with me, this is just a complete drag. Totally unnecessary and obvious that the devs do not play the game beyond about ch 8 which they finally realized that was a drag (66 days for me) that they introduced the PP then made them completely useless for anyone in the late game.[BR][BR]Why make everyone just sit without space for 6 months, then at the same time make FA's back to after every event. Wonderful for some, more than enough for the rest of us."}]