[{"12": "Alcaro said:\t\t\tQuestion: - Is there any building giving Unurium?\t\tClick to expand...[BR]The Unur Museum gives 2500 per day. And the Superior Trader allows the option of choosing either Divine Seeds or Unurium in continuous production runs, with early collection bonus.  [smilie--sprite6]"}, {"12": "SkyRider99 said:\t\t\tThe Unur Museum gives 2500 per day. And the Superior Trader allows the option of choosing either Divine Seeds or Unurium in continuous production runs, with early collection bonus. [smilie--sprite6]Click to expand...[BR]I just saw from your URL @Alcaro that the Temple of the Spirits AW also gives Unurium. [smilie--sprite1]"}, {"39": "Oh, just an observation: Guess why this thread is so deficient... It's because our \"rocket scientists\", so called experts on everything Elvenar, haven't done the last chapter (some of them a few last chapters). They have been deterring people from posting on this forum for years now, with their attitude, that many advanced players have forgotten their path here. The argument for not completing the last chapter is that it would damage their tourney and spire performances. The real professionals would do it, just to see the impact, as Edeba did. It's a pity I don't have a beta account, I would give him/her 100 likes."}, {"53": "Regina8 said:\t\t\tthis thread is so deficient...\t\tClick to expand...[BR]I've noticed that it is typical of these forums that there is limited discussion in these \"latest chapter\" threads. (It has been the same for the past four or five chapters at least.) Was there a particular aspect of Team Spirit which you wanted to raise ?"}, {"39": "Far Reach said:\t\t\tI've noticed that it is typical of these forums that there is limited discussion in these \"latest chapter\" threads. (It has been the same for the past four or five chapters at least.) Was there a particular aspect of Team Spirit which you wanted to raise ?\t\tClick to expand...Hi Far Reach, indeed I would like to see more discussion on ascended trades (people's experiences with them and ideas of what they would have liked instead), on a lengthy and painful process of going through the chapter with portal productions amounting to 2 hours and producing just 1 badge at a time, when you need 210-300 for the last quarter of the tech tree, and detrimental effect that every completed research has on tournaments and spire. I have lost a few top players because of it in my 2 FSs."}, {"53": "Regina8 said:\t\t\tHi Far Reach, indeed I would like to see more discussion on ascended trades (people's experiences with them and ideas of what they would have liked instead),\t\tClick to expand...[BR]The biggest problem I had with this, was that on every server seemingly there was a slight deficit of one ascended good amongst the C18 players, and this resulted in a huge imbalance in the trades available. The chapter itself didn't require too many ascended goods, but I made a fast start to the chapter and no-one (including in my FW) was then trading what I needed. I managed through a mixture of planning ahead, producing some myself (in un-boosted manufactories) and using time boosts to rush the merchants back. Going forward, I imagine that Fellowship Trading will be very important If we're going need ascended goods for more things. The Ascended good trading is an interesting mechanic, but the jury is still out for me.[BR][BR]Regina8 said:\t\t\ton a lengthy and painful process of going through the chapter with portal productions amounting to 2 hours and producing just 1 badge at a time, when you need 210-300 for the last quarter of the tech tree,\t\tClick to expand...[BR]I had a decent stock of 1 and 2 hour time boosters and used them to keep the portal up to speed. I agree that a more sensibly timed production queue would have been much better though. And (as you imply) I found that last quarter of the tech tree to be very boring. Once the settlement is fully built and upgraded, it still takes a painfully long time to complete the Chapter with very little of interest along the way. [BR][BR]Regina8 said:\t\t\tand detrimental effect that every completed research has on tournaments and spire. I have lost a few top players because of it in my 2 FSs.\t\tClick to expand...[BR]The spire/tourney formula has some significant weaknesses, but I actually don't think that the research element is as big a problem as often portrayed. Completing C18 increases troop replacement costs by somewhere between 10 and 15% (I can't remember the exact number). On the other hand we get upgrades including a 10% increase in production speed in Merc Camp, Barracks and Training Grounds and several improved (4*) troops. According to the devs, each chapter is supposed to provide a meaningful net benefit in tournaments. That certainly isn't true, but I don't think that whether one is at the end of C16, C17 or C18 makes a big difference. (Wonders are another story though !)"}, {"39": "Indeed, both you and I have the same, the most abundant ascended on EN3 server  - minerals. It was very difficult to obtain ingots for portal upgrade, I had to spend some diamonds on that and I usually don't spend them easily.  On EN2 server minerals was the rarest ascended and I am boosted in it there too. The gameplay was a completely different story. Because we have a half of FS doing chapter 18 more or less at the same time, we had an excellent team work there, with all minerals produced distributed amongst our fellows only. However trading limit of 1800 - 2200 goods per merchant is ridiculous, when 100K has to be exchanged. Something must be changed there IMHO. [BR][BR]I had some stock of 1 and 2 hour boosters, but they were gone by the middle of the chapter, then it was a matter of getting them in spire and speeding a little bit productions in the portal. The spire was very stingy on giving them at that time lol. I would like to see at least 5 badges per slot in portal with a longer production time, so that night time is not completely lost. I was completing 1 tech per 5 - 6 days on average towards the end without time boosters. Very boring process. [BR][BR]Before ch 18 I was able to do +9K scores in tournaments, then with one of the first mandatory squad size upgrades, I suddenly couldn't do more than 32 provinces. I must say that I'm not a tourney wiz and I only autofight, but that was a significantly felt change for me. I didn't have big change in AW levels, because I don't hunt and I don't have push accounts, so I can pretty confidently think that it's because of the research. Also on en2 server we were getting 19 chests in tournaments, but since half of the FS started ch 18, our FS's tourney scores decreased. We discussed it extensively and most of players found tournaments and spire much harder since they've started ch 18."}, {"35": "Yes, the merchant design has a big flaw.  People who have the boost for the most scarce ascended-good type don't have to bother spending coin on unlocking merchants, as there's always pages of offers listed for them to just take what they need.  These lucky people not posting merchant trades further increases the supply/demand imbalance.  By not proactively offering their ascended goods for trade and only taking what they need when they need it, they further protect the advantage that they lucked into."}, {"39": "Indeed, the problem is further exacerbated by the fact that old trades are not removed, as soon as merchant rehired after 6 hours, or trades have been picked up, so old trades are just hanging there for days, giving the opportunity for those with rarest goods to get them without helping anyone. Old trades must be removed IMHO."}, {"4": "Regina8 said:\t\t\tOh, just an observation: Guess why this thread is so deficient... It's because our \"rocket scientists\", so called experts on everything Elvenar, haven't done the last chapter (some of them a few last chapters). They have been deterring people from posting on this forum for years now, with their attitude, that many advanced players have forgotten their path here. The argument for not completing the last chapter is that it would damage their tourney and spire performances. The real professionals would do it, just to see the impact, as Edeba did. It's a pity I don't have a beta account, I would give him/her 100 likes.\t\tClick to expand...[BR]Or maybe it's because its the slowest chapter yet and we are all so bored to death of the week's per tech it is taking that we are losing all hope..."}, {"4": "As for the trades, the chapter is so slow, 2 merchants open gives more than enough to do everything, I have 2-3 open and have never run short, so do not worry about collecting others but do on occasion to try and help others.[BR][BR]It's not like having loads of any of the Ascended goods makes anything go any quicker."}, {"27": "m4rt1n said:\t\t\tAs for the trades, the chapter is so slow, 2 merchants open gives more than enough to do everything, I have 2-3 open and have never run short, so do not worry about collecting others but do on occasion to try and help others.[BR][BR]It's not like having loads of any of the Ascended goods makes anything go any quicker.\t\tClick to expand...My experience is different. Settlement development requires huge amounts of the new goods and merchants were the reason it took very long for me. That’s badly designed and plain frustrating. Background:[BR]I was often online. (+)My boost is neither the least wanted nor the most wanted on my server. (+-)Portal upgrades required the least wanted good. (+)All the elemental buildings upgrades required the most wanted good. (-) I refused to spend diamonds for merchants. (-)However yes, at the moment when I have three maxed buildings of each element I indeed don’t have any problems getting enough goods for my production with 2-3 merchants.[BR][BR]The inability to scale the trades based on varying needs is a big flaw in this chapter."}, {"25": "I honestly had no problem with the merchants.  In my live city here I had the most prolific of goods and the trader was full of trades that looked exactly like mine, with nothing to pick from.  I put in my trades and generally had my Ascended Goods trades taken within the next three hours. They were ready when I returned.  There were a couple of occasions when the trades weren't taken until the next day.  That was very unusual.  [BR][BR]In my Beta city I happened to have the rare goods.  In neither city did I need to purchase the diamond traders, so I considered it a great success, in opposition to when Chapter 15 first came out and we sat for days waiting for trades.  [BR][BR]The merchants are the least of the problems in this chapter.  Being able to collect 5 badges every 2 hours is beyond ludicrous when you need 280 or 300 for each tech.  I'm retired and can't make it back to the computer every two hours.  This would take the average player a lifetime to finish this chapter.  There are 2,020 badges required in the last two rows.  Five badges every 2 hours = 404 collections.  If a player worked, or was in some type of school and could only collect 4 times a day, or less, they'd be looking at over 100 days for the last two rows.  [BR][BR]Merchants?  They're a piece of cake in comparison."}, {"43": "Far Reach said:\t\t\tThat certainly isn't true, but I don't think that whether one is at the end of C16, C17 or C18 makes a big difference. (Wonders are another story though !)\t\tClick to expand...just returning after quitting. quit due to tournament changes.[BR]Chapter 16,17,18 ~=99 techs.[BR]1.0045^99 = 1.56 = 56% increase in losses.[BR][BR]And training speed goes up from 450 to 525 = 16.7%[BR][BR]not sure how a big difference is not there, @Far Reach[BR][BR]40% extra troops will be consumed. Where you spend 1000 troops( or squads), you’d be spending 1400[BR][BR]and @Gargon667 people are teching cuz if there’s nothing to chase, there’s no game, not that they don’t understand it’s counter productive."}, {"53": "JollyElf said:\t\t\tnot sure how a big difference is not there, @Far ReachClick to expand...[BR]C17 increases training from 450 to 500[BR]C18 increases training from 500 to 550 (Elven Architect has this, but the wiki has 525, my recollection is they quietly increased the number in beta).[BR]The combined increase in troops from training is 550/450 or 22.2%[BR][BR]I'm unclear where your 99 techs comes from. I count 29 mandatory techs in C17 and 25 in C18 for a total of 54. The increase in losses of 1.0045**54  corresponds to 27.4%. [BR][BR]So that looks like a deterioration of about 5%. On the other hand we get a significant boost in C18 to several troops (+10% health, +10% damage, better stats v favored opponents) and significantly improved supply and coin limits (and therefore instants) in both chapters."}, {"43": "Far Reach said:\t\t\tC17 increases training from 450 to 500[BR]C18 increases training from 500 to 550 (Elven Architect has this, but the wiki has 525, my recollection is they quietly increased the number in beta).[BR]The combined increase in troops from training is 550/450 or 22.2%[BR][BR]I'm unclear where your 99 techs  comes from. I count 29 mandatory techs in C17 and 25 in C18 for a total of 54. The increase in losses of 1.0045**54  corresponds to 27.4%.\t\tClick to expand...[BR]Thanks for that. 550 is better than 525.[BR][BR]and 99 techs (roughly) counting chapter 16 too. So overall doing 3 chapters is 56% excess troops consumed.[BR]PS :[BR]c18 - 42 techs total.[BR]c17 - 37 total.[BR]C16 - 40 techs total.[BR]And people will do optional SS techs, as 5-AWs give more + makes bulwark more useful (for 1 day training time and if you want to use your 20 hour instants for training)[BR][BR]To check : will optional SS upgrade give more or cost more overall ?"}, {"53": "JollyElf said:\t\t\tTo check : will optional SS upgrade give more or cost more overall ?\t\tClick to expand...[BR]Optional SS upgrades are now beneficial. Only mandatory researches count in the formula (as can be verified in various ways - including by simply reading @MinMax Gamer wiki description of the formula). I believe that my figures are correct (or at least approximately correct) and the ones you quote are not relevant. I also don't see why you include a number for C16 researches (since none of the previous discussion has talked about C16, and you haven't included the C16 training boost to compensate.[BR][BR]Far Reach said:\t\t\tThe spire/tourney formula has some significant weaknesses, but I actually don't think that the research element is as big a problem as often portrayed. Completing C18 increases troop replacement costs by somewhere between 10 and 15% (I can't remember the exact number). On the other hand we get upgrades including a 10% increase in production speed in Merc Camp, Barracks and Training Grounds and several improved (4*) troops. According to the devs, each chapter is supposed to provide a meaningful net benefit in tournaments. That certainly isn't true, but I don't think that whether one is at the end of C16, C17 or C18 makes a big difference. (Wonders are another story though !)\t\tClick to expand...[BR]Unless I've missed it. I don't see anything in your posts affecting my above assertion."}, {"43": "Far Reach said:\t\t\tOptional SS upgrades are now beneficial. Only mandatory researches count in the formula (as can be verified in various ways - including by simply reading @MinMax Gamer[BR][BR]Unless I've missed it. I don't see anything in your posts affecting my above assertion.\t\tClick to expand...1. Great to know. So those expansion and optional  SS upgrade tech (or optional culture tech) doesn’t cost you.[BR]2. Not opposing your assertion. Just getting clarification. As I said I’m a long time quitter and need to get some facts straightened.[BR]3. Chapter 16 cuz that’s where I’m starting now. So, relevant to me."}, {"43": "Far Reach said:\t\t\tOnly mandatory researches count in the formula\t\tClick to expand...Awesome. So I can finish those aw techs too. Doubt if I will ever build them."}, {"43": "By the way, any insights on chapter 16,17,18 AWs @Far Reach [BR]Am I correct in thinking they are useless? Or am I missing something ?"}]