[{"53": "JollyElf said:\t\t\tBy the way, any insights on chapter 16,17,18 AWs @Far Reach[BR]Am I correct in thinking they are useless? Or am I missing something ?\t\tClick to expand...[BR]They all have some use. Whether that outweighs the tournament and spire penalty (and is better than investing in the alternative AWs which could be focussed on instead) is down to personal priorities. The C16 and C17 wonders are discussed on the corresponding threads. For me the C18 AW the \"Temple of Spirits\" will be a good source of Unurium. It won't really be needed until C19+ though."}, {"4": "So I followed all the storyline quests and managed to complete them before finishing the chapter as I have 2 tech left to finish.[BR][BR]The final storyline quest that followed the sell the portal quest only paid out 20 diamonds. Every other chapter paid out 200 diamonds."}, {"35": "m4rt1n said:\t\t\tSo I followed all the storyline quests and managed to complete them before finishing the chapter as I have 2 tech left to finish.[BR][BR]The final storyline quest that followed the sell the portal quest only paid out 20 diamonds. Every other chapter paid out 200 diamonds.\t\tClick to expand...When I was progressing this chapter it stood out to me that there were a lot of 20 diamond quests throughout the chapter.  So it seems that they spread the quest reward diamonds out over multiple quests this chapter, instead of having one quest at the end that rewards 200 as they have in the past."}, {"32": "Paladestar said:\t\t\tWhen I was progressing this chapter it stood out to me that there were a lot of 20 diamond quests throughout the chapter.  So it seems that they spread the quest reward diamonds out over multiple quests this chapter, instead of having one quest at the end that rewards 200 as they have in the past.\t\tClick to expand...It would not be the first chapter where that happens, there is another chapter where there are multiple small diamond quests."}, {"4": "It's took so long that I have forgot about the other quests where there were 20 diamonds, I did a lot of those almost 6 months ago now."}, {"24": "Far Reach said:\t\t\tC17 increases training from 450 to 500[BR]C18 increases training from 500 to 550 (Elven Architect has this, but the wiki has 525, my recollection is they quietly increased the number in beta).[BR]The combined increase in troops from training is 550/450 or 22.2%[BR][BR]I'm unclear where your 99 techs comes from. I count 29 mandatory techs in C17 and 25 in C18 for a total of 54. The increase in losses of 1.0045**54  corresponds to 27.4%.[BR][BR]So that looks like a deterioration of about 5%. On the other hand we get a significant boost in C18 to several troops (+10% health, +10% damage, better stats v favored opponents) and significantly improved supply and coin limits (and therefore instants) in both chapters.\t\tClick to expand...[BR]I think all your calculations are in way oversimplified, because you can´t compare the two numbers directly. Both are percenteages, but they work on different bases. [BR][BR]The troop production increase works on your base production and will rather simply give you that amount of troops more than before and work for everybody the same, depending only on the speedup AWs. That part is easy. The gain is an absolute number of troops.[BR][BR]The cost part however is not that easy. It works on whatever you do in the tourneys and is different for every town. A high tourney score town will increase by 50% of something big (which means the cost increase will result in enormous troop losses), while a low tourney town will increase costs by 50% of basically nothing (meaning not much of a total increase). [BR][BR]So really these calculations are rather pointless without specifying if you talk about a high score or a low score town. For low score towns the troop increase will be much bigger than the cost increase, while for high score towns the cost increase will be much bigger than the troop production. Somebody with a real interest in math can try and figure out where the border between winning and losing goes.[BR]Since I figure I am one of the highest tourney averages in our world I am rather certain I will fall into the losing category if I continue research, while people with no interest in tourneys will certainly not stop progress for the sake of tourneys anyway (and be right not to do so!)[BR]The question of the turning point is most interesting for the intermediate tourney scoring towns..."}, {"53": "Gargon667 said:\t\t\tI think all your calculations are in way oversimplified, because you can´t compare the two numbers directly. Both are percenteages, but they work on different bases.\t\tClick to expand...[BR]I disagree. The numbers are both scaling factors (which as you say can be expressed as percentages), and can be combined at the equilibrium (i.e. when we are considering a player using an optimum strategy for their build and playstyle - regardless of how highly they score) as outlined below.[BR][BR]Any player using an efficient strategy will be generating about the same number of troops that they lose on average. (They can't be producing fewer or they would run out, and if they are consistently producing more then they are underperforming in tourneys.) More precisely, I'm supposing that the average number of troops trained in the city per week is equal to the average number of troops killed per week in the tournament and spire. The figures I posted show that the scaling factors for both training and losses are similar in each of C16. C17 and C18. In later chapters the player has higher losses, but also higher troop production by roughly the same proportion and the numbers balance out. The city's optimum tourney score remains what it was before.[BR][BR]The above assumption won't be exactly right of course (because a few troops may be killed in world map encounters, and we also have to account for the scalings on any troop production coming from other sources such as wonders and event buildings), but I think that this is a good approximation for the purpose of our discussion."}, {"24": "Far Reach said:\t\t\tI disagree. The numbers are both scaling factors (which as you say can be expressed as percentages), and can be combined at the equilibrium (i.e. when we are considering a player using an optimum strategy for their build and playstyle - regardless of how highly they score) as outlined below.[BR][BR]Any player using an efficient strategy will be generating about the same number of troops that they lose on average. (They can't be producing fewer or they would run out, and if they are consistently producing more then they are underperforming in tourneys.) More precisely, I'm supposing that the average number of troops trained in the city per week is equal to the average number of troops killed per week in the tournament and spire. The figures I posted show that the scaling factors for both training and losses are similar in each of C16. C17 and C18. In later chapters the player has higher losses, but also higher troop production by roughly the same proportion and the numbers balance out. The city's optimum tourney score remains what it was before.[BR][BR]The above assumption won't be exactly right of course (because a few troops may be killed in world map encounters, and we also have to account for the scalings on any troop production coming from other sources such as wonders and event buildings), but I think that this is a good approximation for the purpose of our discussion.\t\tClick to expand...[BR]OK let me make this a lot more simple (with completely arbitrary numbers):[BR][BR]I score high tourney scores and use 1 million troops every week to achieve my score. An increase by 50% means I need 500k more troops to keep my score the same.[BR][BR]A low score tourney towns uses 10k troops every week, an increase by 50% means they need an additional 5k troops to maintain their score.[BR][BR]Troop production is not based on how many troops I need, it is a fixed number given Camp/FA (or barracks/Needles). At say 100k production a 50% increase will produce an extra 50k, which is more than what small tourney town needs but not enough to cover my needs.[BR]Yes the limits can be pushed with brown bears/time boosts, but not everything scales."}, {"53": "Gargon667 said:\t\t\tTroop production is not based on how many troops I need, it is a fixed number given Camp/FA (or barracks/Needles).\t\tClick to expand...[BR]I understood that this was the concern expressed in your previous post and I attempted to explain my reasoning in my response. Essentially I agree that troop production and losses are fundamentally quite different numbers. Once we are considering optimum strategies we can constrain them to be equal however. (This is a standard technique.)  [BR][BR]In the example you give, your starting production is (presumably) 1 million troops per week. For the smaller city, assuming they are using a good strategy the starting production is 10k. (If they are producing much more than that, they why aren't they using them ? )"}, {"24": "Far Reach said:\t\t\tI understood that this was the concern expressed in your previous post and I attempted to explain my reasoning in my response. Essentially I agree that troop production and losses are fundamentally quite different numbers. Once we are considering optimum strategies we can constrain them to be equal however. (This is a standard technique.)[BR][BR]In the example you give, your starting production is (presumably) 1 million troops per week. For the smaller city, assuming they are using a good strategy the starting production is 10k. (If they are producing much more than that, they why aren't they using them ? )\t\tClick to expand...[BR]Don´t ask me why they aren´t lol, but if they were there wouldn´t be anyone scoring less than 3k every week.[BR][BR]Especially at the low scoring end there is absolutely nothing going according to plan, they certainly aren´t using any good strategies, it´s more random effects, things happen the way they happen, but not by any design.[BR]And a speed increase in the barracks will potentially not have any positive effect since the barracks are zzz-ing half the time anyway. So in a way that would again be an argument for not progressing lol."}, {"25": "I can't speak in terms of the math involved, I can only attest to the reality of this.  I am in the very last tech of 18.  I am facing enemies of massive proportion before I even get to the 20th fight in maybe the 4th or 5th round.  Something like around 20k of my troops against 38k enemies.  By the time the tournament is finished I'm in single digits of troops, some are at zero.[BR][BR]In my big city in Winyandor we've finished 10 chests, usually on a Friday, ever since I filled the membership.  I am just about NEVER the point leader, it's always someone below me.  I overdid it with diamond expansions, I had no warning that it would cripple me, but it won't happen again.[BR][BR]I'm researching both of the Chapter 18 AW's, but now have to decide which ones to remove to put them in.  Absurd!  All of these punishments for the big cities make no sense whatsoever to me.  I have ONE Phoenix.  I have always had ONE Phoenix.  [BR][BR]I'm not sure what it would take to get me to open Chapter 19.  The last three rows of 18 about did me in.  And I don't know who to punish by giving my KP to, for their AW's.  I checked some of the largest cities and they are doing exactly the same thing I am.  They're filling their AW's with KP then letting them sit, not upgrading them.  [BR][BR]This is a sorry state we're in, to be punished for what we should be rewarded for doing."}, {"43": "One more question before I decide to progress in chapters.[BR]4 star troops troops might be motivating, but I don’t see 4* opponents in tourney yet.[BR]are there 4* opponents in tournaments and at what point are they triggered / appear. (Do they appear with tech progress in the chapter)[BR]thanks."}, {"24": "Maillie said:\t\t\tAnd I don't know who to punish by giving my KP to, for their AW's.  I checked some of the largest cities and they are doing exactly the same thing I am.  They're filling their AW's with KP then letting them sit, not upgrading them.\t\tClick to expand...[BR]I know the feeling [smilie--sprite1] I have done the same, all my AWs are full all techs in the tech tree are full, non of those will ever get upgraded or activated [smilie--sprite1] Also nobody can now donate KP to me anymore lol. [BR]I entertain myself occasionally filling up smaller towns AWs for them. The military ones at least help them on their way..."}, {"65": "this is all the result of these changes to the tournament, and it was to be understood at first sight that if development no longer benefits, then one thing that loses value is the KP"}, {"24": "kurgkurg said:\t\t\tthis is all the result of these changes to the tournament, and it was to be understood at first sight that if development no longer benefits, then one thing that loses value is the KP\t\tClick to expand...[BR]It has become another one in the collection of junk resources [smilie--sprite8]"}, {"37": "I didn't see CH 18 research until I logged in on mobile then it was on my comp"}, {"37": "Alcaro said:@Booff - here you have it.[BR]\t\t\thttps://cavalieridellozombiaco.blogspot.com/p/team-spirit.html\t\t[BR]Question: - Is there any building giving Unurium? I hoped that Festival Merchant will give if it's from ch.18. Unfortunately it still gives seeds. Same for Snow Owl set.\t\tClick to expand...Unar Museum is will get unlocked as Culture building and Unar Museum AW at end of chapter"}, {"37": "Booff said:\t\t\tUnar Museum is will get unlocked as Culture building and Unar Museum AW at end of chapter\t\tClick to expand...Sorry Ancient Wonder is Temple of Spirits which provides Unurium with each event Curenncy pickup"}, {"55": "While I am glad that some people don't have to make the badges for the AW researches now that that requirement has been removed, I'm rather upset that I had to endure it.  Guess those of us that finished Chap 18 ahead of the release of chapter 19 get the Chump Award for doing so."}, {"32": "BonnyGwen said:\t\t\tWhile I am glad that some people don't have to make the badges for the AW researches now that that requirement has been removed, I'm rather upset that I had to endure it.  Guess those of us that finished Chap 18 ahead of the release of chapter 19 get the Chump Award for doing so.\t\tClick to expand...It's part of the game, I could be upset that new players have easy KP and PP to sleepwalk trough chapter.[BR][BR]I mean I had to go trough chapters at a pace of 24 kp per day, no tournamaments existed, no crafting and no events[BR]And even more chapters I actually had to do all the work myself, no Portal profits to help me out.[BR][BR]But I am not sour about it. change is part of the game"}]