[{"27": "BonnyGwen said:\t\t\tWhile I am glad that some people don't have to make the badges for the AW researches now that that requirement has been removed, I'm rather upset that I had to endure it.  Guess those of us that finished Chap 18 ahead of the release of chapter 19 get the Chump Award for doing so.\t\tClick to expand...Is it really the first time for you? [smilie--sprite2] Previously there were the optional squad size upgrades (removed guest race specific resources, so whoever cared to produce them for future activation wasted time and resources). There was also some recent (ok, not that recent) chapter with extremely expensive resources in its first quarter or so - they lowered the requirements and it was done long after its release.[BR][BR]This isn’t a critique (of Inno or even of you). Sometimes these adjustments are necessary. And I think it’s good they were done, even though I was hit by all three of them."}, {"48": "FieryArien said:\t\t\tIs it really the first time for you? [smilie--sprite2] Previously there were the optional squad size upgrades (removed guest race specific resources, so whoever cared to produce them for future activation wasted time and resources). There was also some recent (ok, not that recent) chapter with extremely expensive resources in its first quarter or so - they lowered the requirements and it was done long after its release.[BR][BR]This isn’t a critique (of Inno or even of you). Sometimes these adjustments are necessary. And I think it’s good they were done, even though I was hit by all three of them.\t\tClick to expand...[BR]Yep, they can change anything any time, it's one of the challenges to predict what might stay longest and remain useful longest. Especially the things that are really beneficial don't usually stay for long or things that are too specialised might lose it's value."}, {"11": "Alcaro said:\t\t\tQuestion: - Is there any building giving Unurium? I hoped that Festival Merchant will give if it's from ch.18. Unfortunately it still gives seeds. Same for Snow Owl set.\t\tClick to expand...The Botanikum culture building gives unurium to top up what you get from the trader [smilie--sprite1]"}, {"2": "Susie49 said:\t\t\tThe Botanikum culture building gives unurium to top up what you get from the trader [smilie--sprite1]Click to expand...The Botanikum is giving Seeds, Unur Museum is giving Unurium, but since I've posted the question I've built 2 Museums.[BR][BR][IMG]https://i.ibb.co/mqQ9MMH/https-en-forum-elvenar-com-index-php-attachments-en2-unur-prod-jpg-5943.jpg[/IMG]"}, {"11": "Sorry @Alcaro, brain fog, meant the unur museum [smilie--sprite11]"}, {"48": "I'm thinking of focusing only on one way to produce badges to keep it simple - Fire Tornado Trial. This one only needs Fire, Earth and Wind Hubs and doesn't need Water Hub at all. Is it safe to skip building Water Hubs to get through the whole chapter?"}, {"11": "Interesting idea @Silly Bubbles, the only way to find out if it works is (I suspect) to try it and see!  Obviously you’ll get stuck on the quest, but I got stuck fairly early because I only have 10 hubs instead of the 12 needed for quest completion.  Good luck [smilie--sprite1]"}, {"11": "FieryArien said:\t\t\tIs it really the first time for you? [smilie--sprite2] Previously there were the optional squad size upgrades (removed guest race specific resources, so whoever cared to produce them for future activation wasted time and resources). There was also some recent (ok, not that recent) chapter with extremely expensive resources in its first quarter or so - they lowered the requirements and it was done long after its release.[BR][BR]This isn’t a critique (of Inno or even of you). Sometimes these adjustments are necessary. And I think it’s good they were done, even though I was hit by all three of them.\t\tClick to expand...There’s often some new unexpected twist at the end of a chapter.  I was annoyed when I realised today that I’m going to  have to complete the research on the two AWs at the end of chapter 18 before I can progress, even though I’ll never build those two AWs myself.   Grrrrrrrr."}, {"48": "So with this setup the settlement resources are doable in around 70 days if anyone's interested. Shorter time with time instants and can be cut to 60 days with level 2 hubs.[BR][BR][IMG]https://i.ibb.co/jftz4fr/https-en-forum-elvenar-com-index-php-attachments-team-spirit-1-png-6020.png[/IMG]"}, {"66": "I dont think hubs and portal need to be upgraded at all to finish the chapter and it only costs a lot of resources. What do you guys think?"}, {"48": "Portal said:\t\t\tI dont think hubs and portal need to be upgraded at all to finish the chapter and it only costs a lot of resources. What do you guys think?\t\tClick to expand...[BR]I think you'll be fine not upgrading the hubs. It will take a bit shorter time when you do upgrade them right up but the longer you wait the less worth it is. I only upgraded mine to level two early on.[BR]I did fully upgrade the portal to get more out of portal profits and to save space as I didn't have to build many Welcome Squares.[BR][BR]EDIT: Just in case you care about the quests (even though it doesn't look like it but others might), here's the questline: https://idavis-elvenar.com/guestRaces/teamspirit.html#quests."}, {"66": "Thank you very much Silly Bubbles. Does portal produce more than 1 team spirit badge when its upgraded to level4?"}, {"48": "Portal said:\t\t\tThank you very much Silly Bubbles. Does portal produce more than 1 team spirit badge when its upgraded to level4?\t\tClick to expand...[BR]The portal upgrade reduces the time it takes to produce 1 badge so effectively, it will produce more badges if you keep it busy."}]