[{"1": "Zapraszam do dyskusji."}, {"2": ">>Lista zadań<< [smilie--sprite1]"}, {"12": "Ten zmniejszony rozpad 5% jest odejmowany od domyślnych 10%? Innymi słowy, czy przy rozpadzie 10%, z takim budynkiem wartość rozpadu będzie wynosić 5%? Oraz, jak ma się cud związany z rozpadem na 30 poziomie, gdzie wartość rozpadu to 2%; to czy nic nie produkując będzie przybywać danego surowca o te +3% na zasadach prostej matematyki? Czy może to jest zmniejszony procent z zmniejszonego rozpadu, czyli 5% z takich domyślnych 10%? Bo to by wychodziło 9,5% rozpadu. Brakuje mi informacji, jak to jest liczone.[BR]Dla mnie osobiście lepiej byłoby widziane, jakby to był wzrost produkcji danego surowca o jakiś tam procent na te określone dni. Bo w przypadku straty części bonusu, a tak zapewne będzie jak ma się już rozpad na poziomie takich 2%, to jest się po prostu w niekorzystnej sytuacji i ponosi stratę z nie własnej winy. Bo czemu ma być winny gracz, który ma po prostu dobrze rozbudowany cud? Czekam na wyjaśnienie, jak to będzie, jednak wyczuwam niedopracowanie. Mam nadzieję, że się mylę."}, {"6": "Zapytałem się na becie, może coś powiedzą. No raczej \"pozytywnego rozpadu\" nie ma w grze, raczej by tylko obniżyło rozkład o pozostałe 2% do 0%, żebyś przez 60 dni nie miał wcale rozpadu surowca. Myślę, że to ułatwienie głównie myślane o nowszych graczach i jak zwykle przeoczyli użyteczność dla tych, co grają kilka lat.[BR][BR]Edit:  moderator z bety napisał, że sam sobie odpowiedziałem na pytanie, więc masz 2% do 0% rozpad @jakub357"}, {"45": "I tak jest to ciągle lepsze niż zmniejszenie rozpadu o 5% z tych 2% [smilie--sprite8]"}, {"3": "O którym budynku mówicie?"}, {"45": "Ovocko, z ogłoszenia o evencie:[BR]\t\t\tKażda Księga Zamrożonych Towarów  daje ci możliwość wyboru jednego z tych budynków dla Twojego miasta::[BR][BR][BR]KriomanaKrionasionaKriounuryt[IMG]https://i.ibb.co/99z293K/https-media-innogamescdn-com-com-ONYX-GR-Events-A-Evt-December-XXII-Cryomana1-1-0012-png.png[/IMG][IMG]https://i.ibb.co/L53SBjt/https-media-innogamescdn-com-com-ONYX-GR-Events-A-Evt-December-XXII-Cryoseeds1-1-0012-png.png[/IMG][IMG]https://i.ibb.co/4jk67fR/https-media-innogamescdn-com-com-ONYX-GR-Events-A-Evt-December-XXII-Cryonurium1-0012-png.png[/IMG][IMG]https://i.ibb.co/5TRcvr9/https-media-innogamescdn-com-com-ONYX-GR-Events-Mana-Decay-png.png[/IMG][IMG]https://i.ibb.co/VwNMD7d/https-media-innogamescdn-com-com-ONYX-GR-Events-Seed-Decay-png.png[/IMG][IMG]https://i.ibb.co/MfQkttc/https-media-innogamescdn-com-com-ONYX-GR-Events-Unurium-decay-png.png[/IMG]Zmniejsza rozpad Many o 5%Zmniejsza rozpad Boskich ziaren o 5%Zmniejsza rozpad Unurytu o 5%[BR]Budynki te będą miały moc zmniejszania rozkładu określonego zasobu przez 60 dni, więc używaj ich mądrze!\t\tKliknij aby rozwinąć..."}, {"29": "A ja mam pytanko odnośnie nagrody dziennej z 11 dnia: Frozen Orc Vortex i 19 dnia: Frozen Fountain. Na IDavisie nie jest oznaczony jako budynek setowy, ale w tabelkach mają zwiększoną produkcję po połączeniu z większą ilością budynków - czy to oznacza, że chodzi o kilka kopii tego samego budynku połączonych ze sobą?"}, {"2": "Klops napisał:\t\t\tA ja mam pytanko odnośnie nagrody dziennej z 11 dnia: Frozen Orc Vortex i 19 dnia: Frozen Fountain. Na IDavisie nie jest oznaczony jako budynek setowy, ale w tabelkach mają zwiększoną produkcję po połączeniu z większą ilością budynków - czy to oznacza, że chodzi o kilka kopii tego samego budynku połączonych ze sobą?\t\tKliknij aby rozwinąć...To są 2 z 4 elementów zestawu. Jeden element jest w nagrodach głównych za 300 punktów, jeden w nagrodach premium za 240 punktów, a te dwa, o których piszesz są w nagrodach dziennych.[BR]Tu na samym dole strony są statystyki zestawu (trzeba zaznaczyć rozdział)[BR]\t\t\thttps://www.elvenarchitect.com/buildings/sets/\t\t"}, {"29": "Nusion napisał:\t\t\tjeden w nagrodach premium za 240 punktów\t\tKliknij aby rozwinąć...[BR]hmmm, cwaniaczki  [smilie--sprite2]  ktoś tu się zasadził na moje "}, {"8": "A Zyski Portalu za dwa tygodnie w dziennych. We wtorek.[BR]Kto nie widzi dla siebie nic ciekawego w dziennych dla siebie na dzisiaj, to radzę zbierać Zyski Portalu na zaś. Na 20 epokę.[BR]Chyba że np. po 400 sztuk już macie w zapasie."}, {"15": "Z dziennych warte wzmianki Wiedźmy lodowych gigantów, więcej populacji od skał venara III (ale mniej kultury), zwoje wskrzeszenia woja 25% i ewentualnie instanty ze zwiadowcami/żabami (chociaż te ilości bez szału)."}, {"29": "Moje Krabowe Hotele Delux i Bańkowe Kurorty Wodne są \"do tyłu z rozdziałami\", a wyznaję żelazną zasadę: nie marnuj królewskiej renowacji na budynki kulturowe\", więc sliniłem się na Wiedźmy Lodowych Gigantów od momentu pierwszej wzmianki o nagrodach dziennych u iDavis'a. Lekko ponad 1900 waluty (muszę przyznać, że szczęśliwe losowania) i No i się doczekałem[smilie--sprite6]"}, {"6": "[BR][BR]Ogólnie to jest odświeżona wersja problemu o którym już pisano w 2018 roku, a mianowicie ten zestaw nie może mieć wszystkich połączeń dla wszystkich budynków, jeśli macie tylko 4 części. Dziwne, że przez 5 lat nikt tego nie naprawił.[BR][BR]Każda z tych części ma 3 połączenia, a ręka nie łączy się z fontanną w wersji z 4 częściami. Potrzebne by były dodatkowe budynki.[BR]Wstawiam, bo parę osób już u nas ma ten problem i się pyta o co z tym chodzi."}, {"3": "Ten zestaw w ogóle taki... no taki sobie... zwłaszcza biorąc pod uwagę, że dwa budynki są w królewskich nagrodach tylko."}, {"8": "Chodzi pewnie o to żeby sobie dolosować ze dwa Gejzery? I postawić gdzieś po bokach.[BR]Gejzery już były w dziennych."}, {"44": "Koval92 napisał:\t\t\tten zestaw nie może mieć wszystkich połączeń dla wszystkich budynków, jeśli macie tylko 4 części\t\tKliknij aby rozwinąć...Raczej nie bylo zadnego sensu przy tym grzebac, bo tworcy na 100% zdaja sobie sprawe z tego, ze niezaleznie od liczby polaczen, w porownaniu do innych, nowszych zestawow, bonusy tego zestawu sa w dzisiejszych realiach gry wrecz tragiczne... Nie sposob traktowac mozliwosci zdobycia tego zestawu inaczej, niz po prostu jako uklon w strone graczy z zacieciem kolekcjonerskim [smilie--sprite1] Raczej nikt nie postawi go z powodu jego bonusow. Patrzac na to z tej perspektywy, zestaw jest jak najbardziej ok, bo pozostaje \"oryginalny\", czyli jest dokladnie taki, jak 5 lat temu [smilie--sprite1]"}]