[{"55": "Dear Humans and Elves,[BR][BR]Please see the announcement for the Season of Dreams here and let us know what you think about it![BR][BR]Kind regards,[BR]Your Elvenar Team"}, {"125": "VERY GOOD"}, {"29": "Much better than the cauldron [smilie--sprite7][smilie--sprite7][smilie--sprite7][smilie--sprite7][smilie--sprite7]"}, {"33": "Biloutte91 said:\t\t\tMuch better than the cauldron [smilie--sprite7][smilie--sprite7][smilie--sprite7][smilie--sprite7][smilie--sprite7]Click to expand...Not difficult at all..."}, {"45": "First impression: I like!"}, {"113": "Looks very good!"}, {"45": "Second impression: Can I please give back the cauldron... and maybe swap it for a season pass? Pretty please??? [smilie--sprite8]"}, {"76": "I do notice that after completing the daily quests from season....and declining the declinable quest from main screen (left) under quests....there is no New declinable quest generated.....i did refresh and again no New declinable quest.....is this intended ?"}, {"126": "However, the Winter Event quest cannot be completed if you have already completed the daily quest.[BR][BR]Spoiler: Original postDie Winterereignis-Quest kann jedoch nicht abgeschlossen werden, wenn Sie die tägliche Quest bereits abgeschlossen haben.[BR]Edit: Beta is English only, so please comment in every thread on Beta in English!"}, {"55": "GerdyaanB said:\t\t\tI do notice that after completing the daily quests from season....and declining the declinable quest from main screen (left) under quests....there is no New declinable quest generated.....i did refresh and again no New declinable quest.....is this intended ?\t\tClick to expand...We just added information to the announcement, since it is important to clarify that the change is indeed intended:[BR]Vaeri said:(...) As part of the Seasons update, we are replacing the system of repeatable quests. [BR]We believe that by moving this system into the Seasons, we can provide more interesting quest tasks, with more meaningful rewards. Any repeatable quests that are still active can be completed and rewards will be granted, but with the beginning of the Season of Dreams, no new ones will be started anymore. (...)​Click to expand..."}, {"33": "Good change, cyclable quests system was old (and boring) enough.[BR]Season systems should be able to be more meaningful for players in all chapters[BR][BR]A doubt , will Ashen Phoenix bonus work with Season currency (Season petals)?[BR][BR]By the way, some  adjustment with quests selection per chapter may be needed:[BR]In chapter I (not Magic Academy available yet)[BR][IMG]https://i.ibb.co/tpxPsxg/https-beta-forum-elvenar-com-index-php-attachments-1670497282429-png-10561.png[/IMG][IMG]https://i.ibb.co/pKNKh5H/https-beta-forum-elvenar-com-index-php-attachments-1670497318802-png-10562.png[/IMG]"}, {"100": "My impression: I like it[BR][BR]But:[BR][BR]Citation: >>While many waypoints allow you to collect rewards for free, some waypoints include premium rewards which you can unlock after purchasing the Season Pass. .<< - for 2,500 diamonds [BR][BR]That's also an expensive pleasure - or are there users who have sooooo many diamonds and don't know what to do with them?"}, {"22": "2500 diamonds per 75 days and 17 rewards (not bad buildings) is not very much for me (for players which finish spire every week).[BR]Anyway, you can pick just the free ones[BR][BR]N0RDIC said:\t\t\tHowever, the Winter Event quest cannot be completed if you have already completed the daily quest.[BR][BR]Spoiler: Original postDie Winterereignis-Quest kann jedoch nicht abgeschlossen werden, wenn Sie die tägliche Quest bereits abgeschlossen haben.[BR]Edit: Beta is English only, so please comment in every thread on Beta in English!Click to expand...this problem is just today, because the season was activated hours after the daily quest"}, {"127": "There is a refresh button together with the text \"2 refreshes left\" on the weekly quests screen which doesnt seem to be working - is this still in development?"}, {"62": "ayebee said:\t\t\tThere is a refresh button together with the text \"2 refreshes left\" on the weekly quests screen which doesnt seem to be working - is this still in development?\t\tClick to expand...maybe refresh , works for me"}, {"28": "ayebee said:\t\t\tThere is a refresh button together with the text \"2 refreshes left\" on the weekly quests screen which doesnt seem to be working - is this still in development?\t\tClick to expand...if you use it on the task box, then it deducts from the \"2\".[BR]i didn't like \"use portal profits\" and used the refresh on that and the total on the top went down to 1."}, {"55": "Prueba2 said:\t\t\tGood change, cyclable quests system was old (and boring) enough.[BR]Season systems should be able to be more meaningful for players in all chapters[BR][BR]A doubt , will Ashen Phoenix bonus work with Season currency (Season petals)?[BR][BR]By the way, some  adjustment with quests selection per chapter may be needed:[BR]In chapter I (not Magic Academy available yet)[BR]View attachment 10561View attachment 10562Click to expand...Ashen Phoenix bonus doesn't apply to Season Petals. Also, thank you for bringing the MA quest to our attention.[BR]We will apply changes so that the quest won't appear for players without a Magic Academy."}, {"74": "@Ainor \"not bad buldings\"?????"}, {"28": "top left there is a purple bar showing some kind of advance - i'm at 7 now going towards 8.[BR]what does that stand for ?[BR][BR]android.[BR][BR]EDIT could be number of guests done, 7 out of 8. but does it have some other significance ?"}, {"62": "Ainor said:\t\t\t2500 diamonds per 75 days and 17 rewards (not bad buildings) is not very much for me (for players which finish spire every week).[BR]Anyway, you can pick just the free ones[BR][BR][BR]this problem is just today, because the season was activated hours after the daily quest\t\tClick to expand...4 buildings of that season pass are good , others are just from recent events and also a bad price at nr 41  (20% portal profit) , if some of the season pass buildings were a little more unique like the heavy melee shrine (other 2 new ones not added to the prices) it would be worth it paying the 2500 diamonds. (maybe parts of the moonstone library could be added in it so people who can only obtain 1 set could get more like people  who play longer."}]