[{"90": "For low chapters and medium chapters like myself getting pet food in the MA is rare and when you do get them, you have to hold onto them for the polar bear.  Of  course if I had to choose between getting portal profits and petfood in the MA, I would rather go for the portal profits. I dont use them for the other \"pets\" so much except during the FA when we need those troop badges and other badges from tournies/spire.  I do use it for events on the ashen but thats the only exception.  Currently I only have 4 petfoods and no I wont use it on a quest. Its the only one I would reset.  I havent received in the daily yet but then I would probably ignore it until we have the option to reset the daily too.  Again this is an event related quest to my mind and not one we normally would get during normal game play.  Season of dreams shouldnt be like other events but more like the normal game play we find in the tech tree or which we had in the declineable quests especially since the seasons replaced the latter.  I dont mind using kps on my own wonders as I have a lot since I rest between chapters. Reason:  Advanced players had a break between chapters before the next one was opened so no reason why I should rush into the next one just to catch up.  But thats just my game style.  Catalysts are also something I save for the FA so for those kind of quests, I use the catalyst-making buildings and not the MA."}, {"82": "FEEDBACK ONLY - No New Data[BR][BR]@Vaeri @Kersepitje @Amy Steele : I may be wrong here (?) - but if it's true that refreshing a Quest can result in the same Quest reappearing, presumably an infinite number of times (is there a limit on this?) - then how can anyone be sure that they can even complete any given Season? And if one can't even be sure of being able to complete any given Season - no matter with how much dedication and/or strategic manipulation of one's gameplay choices and/or Resources - is it realistic (or fair!) to expect players to spend Premium Currency on Seasons, let alone real cash?[BR][BR]What is the point of playing through an entire Season, only to reach the last day with fewer Petals than are required, only because some of the Quests cannot be completed? It seems that we can't predict in advance which Daily and/or Weekly Quests each of us will be given - which is not the case in many other games, several of which [of my experience] provide a full list of all upcoming Quests at Season start, which are the same for everyone, so players can plan how to complete all of them - while in Elvenar, Season Quests appear instead to be randomly allocated, and some of them, it seems, aren't even feasible, depending upon the player's City/Chapter advancement level, gameplay style (frequency of logins, Combat vs Catering builds etc.), and/or spending Resources which are, in some cases (e.g. Pet Food, and more) also randomly allocated...?[BR][BR]Most games which use the Seasons system (a) have less demanding tasks, many of which can be completed immediately if the player chooses do play more often and/or intensively (Quests don't ask for rare and/or randomly awarded Resources like Pet Food, and they also don't ask for too much of anything which isn't commonplace and/or generated at will, e.g. Units), and (b) don't [randomly] replace discarded Quests with the same Quest. Many of them have more free Quest resets available, too, and/or also allow infinite refreshes using small amounts of Premium Currency.[BR][BR]Why does InnoGames have to make everything they copy from other games be more limited, more expensive, more heavily based upon RNG, more inconvenient, and essentially less player-friendly than these concepts/systems are in other comparable games (or even their own games - I'm thinking of how the Spire in Elvenar is more expensive, more difficult, and less versatile than FoE's Guild Expeditions, for example)...?[BR][BR]I'm not expecting any official answer, of course, but still, I am getting tired of seeing recent new and expensively developed additions to the game which I've at first found welcome at least in concept (the Caudron and Seasons alike, so far) actually turning out to be far more laborious, less rewarding, more expensive, and overall less FUN than these concepts are in many other games in which I've experienced similar systems.[BR][BR]I am speaking here as the type of Live player who broadly welcomes additional options/complexity in any game, and who would be looking forward to these systems going Live, if they really were affordable (NB: I will spend both Resources and Premium Currency where there's a good enough return IMO) fun, strategic, engaging and rewarding (even if only trivially so) additions to the game. Specifically, I'm a slow and patient player who is online very often, who likes to strategically plan to 'do or spend X in order to earn Y', and who knows, as I'm sure many of us do, that the usual way to succeed in any long-term 'Freemium' game is to create, acquire, and carefully ration just about everything, where possible, and then use both acquired Resources (inc. Premium Currency) and in-game functionality/recurring tasks alike in order to meet other in-game functionality/demands and to suit ongoing background frameworks of some kind (e.g. 'managing' FA Badge collections or completing Crafting Recipes in order to meet the demands of Season Quests, or timing building productions so that they occur while Cauldron potions are active).[BR][BR]It certainly seems to me that both the Cauldron and Seasons are attempts to instil/encourage/reward exactly this kind of attitude & gameplay style in Elvenar's userbase - although I also suspect that both of these new additions have also been constructed in the hope that at least some brand-new players, and perhaps others, too, will see these systems as being more significant than they really are, especially when it comes to the nature and useability of their Rewards particularly at lower Chapter levels, when most of the Rewards offered are largely trivial or even less useful than the cost of obtaining them (all things considered), and that these players will therefore rashly spend Premium Currency or even real cash on these systems to no useful avail, and then depart in favour of new incoming players, having exhausted their Cities and enjoyment of the game alike - but naturally while leaving their already-spent money behind.[BR][BR]I know that InnoGames has published real data in the past showing that the large majority of player spending occurs during the first six months of playing, and that they regard players of more than two years' duration only as 'residual' revenue sources; I am not speculating blindly, here.[BR][BR]Inno hardly invented the in-game concept of 'manage X to fulfil Y', so I can't understand why they make it so much more difficult in Elvenar than it is in many other games... although I see more and more credibility in my long-term suspicion (and in some cases, knowledge) that it's because the developers don't [much, or keenly] play the game themselves, so they don't realise what it involves, especially in the long term... :/[BR][BR]Long story short : Seasons, and the Cauldron, could be so much FUN - but as they stand, I find them largely disappointing and unappealing."}, {"95": "I have a complaint! I'm looking at a task that requires the new event to be live before I can accomplish it! I can't because the android update isn't available yet! You could EASILY FIX THIS BY NOT STARTING NEW EVENTS BEFORE THE UPDATE IS AVAILABLE TO ALL!!!!!!!!"}, {"80": "Tomtimmon said:\t\t\tI have a complaint! I'm looking at a task that requires the new event to be live before I can accomplish it! I can't because the android update isn't available yet! You could EASILY FIX THIS BY NOT STARTING NEW EVENTS BEFORE THE UPDATE IS AVAILABLE TO ALL!!!!!!!!\t\tClick to expand...Please @Tomtimmon submit a ticket to support and we'll help you."}, {"55": "Thank you very much for the detailed feedback, @Laurelin-Beta ![BR]It's correct that the quests are given out to the players \"at random\"; but it's more like a pool of quests that tries to take the current chapter of the player into account. It's hard to tell how this system will be refined in the future, but the beta feedback will be taken into account.[BR]Laurelin-Beta said:\t\t\t(b) don't [randomly] replace discarded Quests with the same QuestClick to expand...This actually is a bug - when you sure you got the exact same quest after refresh, please create a bug report and include screenshots."}, {"74": "Vaeri said:\t\t\tThank you very much for the detailed feedback, @Laurelin-Beta ![BR]It's correct that the quests are given out to the players \"at random\"; but it's more like a pool of quests that tries to take the current chapter of the player into account. It's hard to tell how this system will be refined in the future, but the beta feedback will be taken into account.[BR][BR]This actually is a bug - when you sure you got the exact same quest after refresh, please create a bug report and include screenshots.\t\tClick to expand...\"The currrent chapter\" is a problem: if you have just entered it, you cannot do everything related to that chapter! The pool should refer to the player previous chapter ;-)"}, {"55": "spennyit said:\t\t\t\"The currrent chapter\" is a problem: if you have just entered it, you cannot do everything related to that chapter! The pool should refer to the player previous chapter ;-)\t\tClick to expand...Yep! I haven't said it's good this way. [smilie--sprite7]"}, {"95": "Konys said:\t\t\tPlease @Tomtimmon submit a ticket to support and we'll help you.\t\tClick to expand...I don't care about the 5 points I lost! My problem is it should never been allowed to happen! INNO does not care about beta because it is just that beta ... But they damn sure should do better alpha testing. And at least consider not releasing new events until the required game version is available to everyone!"}, {"52": "Lovec Krys said:\t\t\tYes, you'll lose them.[BR]1st case: During 2 weeks you do all 8 week quests. As a result you'll get 70*8=560 petals.[BR]2nd case: During 2 weeks you do one quest during 2 weeks and other 3 from week one and two = 7 quest for 70*7=490 petals.[BR][BR]In the second case you lost 70 petals for the quest you did during 1st & second week (instead of doing 2 quests in that slot).[BR][BR]Edit: Corrected number of quests per week\t\tClick to expand...Not my experience. I have a bunch of queued quests and it goes up by 4 each week. The implication there is, how many you do in a week is irrelevant to the total number you will be offered. So, one could theoretically do the whole Season's weekly quests in the last few weeks of the event and not lose a single petal."}, {"58": "Tomtimmon said:\t\t\tI don't care about the 5 points I lost! My problem is it should never been allowed to happen! INNO does not care about beta because it is just that beta ... But they damn sure should do better alpha testing. And at least consider not releasing new events until the required game version is available to everyone!\t\tClick to expand...This is what I don't get either. The mods and devs have access to test things before even beta gets it. They've told us this several times before. Maybe the devs don't even allow that to happen anymore...so no pre-testing before going to beta, long fix times on beta now and no one to really push the inhouse to correct all of these issues equals what we're dealing with nowadays. It's so frustrating. It's sad for the players and the qa/game mods. Fix your management practices! This game is falling apart."}, {"53": "CiraKelley said:\t\t\tThe mods and devs have access to test things before even beta gets it.\t\tClick to expand...From my prior experience as an \"ALPHA\" tester, I know that it seems like it should get to \"BETA\" more refined. However, that is not how it worked in my prior game experience, a first-person shooter and a Navel Strategy game. In both cases the \"ALPHA\" testing was to assess if it broke the game or caused a \"hard stop\" exploit within the game. 10-15 testers cannot cycle through the entire \"thing\" in the same way several hundred to several million users can. This is where the \"BETA\" testing comes in and why open beta testing happens.[BR][BR]Please note this is my personal experience from other games over the past 20 years and not a reflection of the process here."}, {"95": "Now tonight I get 2 daily quests I can't do because of an update. HOW ABOUT THIS INNO ... YOU ORIGINALLY SAID THAT THE SEASON OF DREAMS QUESTS COULD BE DONE WITH DAILY OPERATIONS!!!!!"}, {"95": "Sorry not sorry about double posting. Just went through my other two BETA cities. Now I have seven guests and three of them are weeklies. I admit I don't spend a lot of money on the game but I do spend some. FOR WHAT????"}, {"74": "Vaeri said:\t\t\tYep! I haven't said it's good this way. [smilie--sprite7]Click to expand...So ask the developers to change it ;-)"}, {"9": "SlyLady said:\t\t\tNot my experience. I have a bunch of queued quests and it goes up by 4 each week. The implication there is, how many you do in a week is irrelevant to the total number you will be offered. So, one could theoretically do the whole Season's weekly quests in the last few weeks of the event and not lose a single petal.\t\tClick to expand...So are you saying that once you finish the weekly quest from last week you immediatelly get new quest?[BR](= if you do 3 of 4 quests in week one, you can do 5 of 4 quests in second week)[BR][BR]If so, then you're right (i have actualy always completed all weekly quests in the week they occured so far (with a little help of refresh button for those i didn't want to do))."}, {"55": "spennyit said:\t\t\tSo ask the developers to change it ;-)\t\tClick to expand...I did many pages of threads ago, no worries! But it needs time to do the necessary work for sure.[BR]You don't want make new design decisions to do them a third time later."}, {"5": "Vaeri said:\t\t\tI did many pages of threads ago, no worries! But it needs time to do the necessary work for sure.[BR]You don't want make new design decisions to do them a third time later.\t\tClick to expand...[BR]After all these years, we are used to the delays. It takes Inno a year to do what other companies would do in a month or a month to do what others do in a couple of days. Sometimes I do not think it was worth joining the Beta server."}, {"90": "Well today's daily and weekly quest has just confirmed my fears:  The season of dreams have turned into a permanent fellowship adventure.  Why?  Two quests:  7 toolboxes and 43 groceries appeared on my weekly on top of the current event which is asking for advanced tools and groceries too.  Now with 4 workshops, how am I to do this?  Normal game play?   At best I can do 28 groceries overnight but then I cant prepare for the current event.   Reset?   Really Inno?"}, {"139": "Lovec Krys said:\t\t\tSo are you saying that once you finish the weekly quest from last week you immediatelly get new quest?[BR](= if you do 3 of 4 quests in week one, you can do 5 of 4 quests in second week)\t\tClick to expand...@Lovec Krys here you can see that:[BR][BR][IMG]https://i.ibb.co/fdZ9gsS/https-i-imgur-com-JHj-YPJ2-gif.gif[/IMG][BR][BR]I had 2 quests in queue, and after claiming the completed one I get a new one and quests in queue went from 2 to 1.[BR]I hope this helps [smilie--sprite1]"}, {"29": "This morning daily quest [smilie--sprite9][smilie--sprite9][smilie--sprite9][smilie--sprite9][smilie--sprite9][BR][BR][IMG]https://i.ibb.co/1rsJ6ww/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-01-11-103820-png-10765.png[/IMG]"}]