[{"55": "Biloutte91 said:\t\t\tThis morning daily quest [smilie--sprite9][smilie--sprite9][smilie--sprite9][smilie--sprite9][smilie--sprite9][BR][BR]View attachment 10765Click to expand...Thank you for the report! I informed the team (apparently, the second \"collect mana\" as well as both \"collect unurium\" quests are affected as well)."}, {"5": "Vaeri said:\t\t\tThank you for the report! I informed the team (apparently, the second \"collect mana\" as well as both \"collect unurium\" quests are affected as well).\t\tClick to expand...[BR]I don't know what chapter that player is in, but my chapter 18 city has had the daily quest ask for 350k mana and I have completed it each time. It did seem like a large amount, but not hard to do for anyone with a lot a mana buildings."}, {"29": "I'm chapter XIX and I think it's way too much. I don't harvest 450K mana in 1 day. I am not connected from 7:00 a.m. to 11:00 p.m....[BR]I don't want to use spells with my AW Dragon Abbey"}, {"73": "question @Biloutte91 do you have an Dragon Abbey?[BR]just use a couple spells to get the mana that way and the quest is solved.[BR][BR][edit][BR]looking at my life account were I am waiting at the end wall.[BR]I produce there 713.420 mana a day plus I get 19.950 mana every time I use a spell.[BR]So yes 450k is a lot but not impossible"}, {"29": "it's write in the message: [smilie--sprite2][smilie--sprite2][smilie--sprite2] I don't want to use spells with my AW Dragon Abbey."}, {"9": "Did someone compare Seasons to pernament FA?:[BR][IMG]https://i.ibb.co/ZgXbT4J/https-cz-forum-elvenar-com-index-php-attachments-1674552970673-png-6560.png[/IMG]"}, {"29": "lol"}, {"100": "I have a problem with a task:[BR][BR][BR][BR]Where can I find this Event? An what are city treasure? I have collected the coins from main hall. It was negativ - no result.[BR][BR]Thank you for your infos"}, {"45": "Neytiri1022 said:\t\t\tWhere can I find this Event?\t\tClick to expand...It is the event currently running on beta.. so open the event screen and use the Sorcerers knowledge (found on the outskirts of your city) to take 10 steps towards the end of the current map"}, {"29": "@Neytiri1022 , you have to do TEN of this.[BR][BR].[IMG]https://i.ibb.co/MZbVZCk/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-01-05-173711-png-10777.png[/IMG]"}, {"55": "@Biloutte91 @Enevhar Aldarion @Bor de Wolf 1965 I got the info that the amount of mana (and unurium) to collect is influenced by chapter scaling. I let the devs know that 450k is quite much mana to ask for in a daily quest."}, {"9": "So if anyone gets this kind of quest during the last week of the event and has less event currency to spend, such quest becomes impossible to solve..."}, {"22": "Lovec Krys said:\t\t\tSo if anyone gets this kind of quest during the last week of the event and has less event currency to spend, such quest becomes impossible to solve...\t\tClick to expand...the same for this one...[BR][IMG]https://i.ibb.co/3SFJdr2/https-beta-forum-elvenar-com-index-php-attachments-1673526107445-png-10778.png[/IMG]"}, {"29": "Yes. but you can switch this quest. @Vaeri , thanks for the answer"}, {"9": "Biloutte91 said:\t\t\tYes. but you can switch this quest. @Vaeri , thanks for the answer\t\tClick to expand...Yes, but you can switch only 2 quests / week.[BR]So if random works in it's typical way, sooner or later you'll get 4 impossible quests at once with only 2 refreshes.[BR]Or both refreshes will replace one impossible quest with another impossible quest.[BR][BR]So like i wrote before, we should have infinite number of refreshes to avoid this scenario."}, {"29": "Yes. it's true"}, {"73": "I got the 7 toolboxes now 2x and they are easy to complete.[BR]All I did what set 4 of my 8 WP on the toolboxes for 2 days and use the other WP's for what I wanted.[BR]and the other 2 \"impossible\" WP quests are easy as well with 8WP[BR]4x8 on 3h = 32 or maybe 5x8 if you are very sharp for 40 of the 77 demanded items. So again 2 days and you are done[BR]and now for the baskets of groceries: 5 nights of sleeping equals 5x8=40 and they are done.[BR][BR]Maybe it is me but I don't see the impossible part as you are pointing out @Lovec Krys"}, {"16": "Impossible is not what on his screenshots, but what other players mentioned after it.[BR]Like \"Solve 10 event quests\" when you are already on the \"daily\" part of quest line and can't do more than 7."}, {"3": "Even when not impossible, how about tedious? Seem to be enough chores already with events, FAs, spire, tourney. Do we really need more things requiring calculated effort?"}, {"5": "Karvest said:\t\t\tImpossible is not what on his screenshots, but what other players mentioned after it.[BR]Like \"Solve 10 event quests\" when you are already on the \"daily\" part of quest line and can't do more than 7.\t\tClick to expand...[BR]That is what the weekly quest queue is for. Only the final week of the season could be trouble. But the season is 10 weeks and 5 days long, so those extra 5 days are likely there so we can catch up."}]