[{"16": "if you get that quest on next week - you won't be able to do it anyway"}, {"33": "Any more info about the additional rewards after waypoint 50?[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/season-of-dreams.18173/#post-111570\t\t"}, {"55": "Prueba2 said:\t\t\tAny more info about the additional rewards after waypoint 50?[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/season-of-dreams.18173/#post-111570\t\tClick to expand...Unfortunately, we don't have more information to share to the current date.[BR]Without going much into details you can already guess why by just hinting at the fact that Season of Dreams hasn't been released on live markets yet."}, {"2": "Vaeri said:\t\t\tUnfortunately, we don't have more information to share to the current date.[BR]Without going much into details you can already guess why by just hinting at the fact that Season of Dreams hasn't been released on live markets yet.\t\tClick to expand...And thank you for withholding it.  This is clearly nearly as broken as Cauldron, and look how that went  [smilie--sprite11] [BR]Live Forums are full of panicked players whose game has been hijacked during the Adventure."}, {"32": "such task shouldn't exist in dailies. My Spire is complete already.[BR][IMG]https://i.ibb.co/W6jJZYm/https-beta-forum-elvenar-com-index-php-attachments-season-task-spire-jpg-10793.jpg[/IMG]"}, {"57": "Alcaro said:\t\t\tsuch task shouldn't exist in dailies. My Spire is complete already.[BR]View attachment 10793Click to expand...Hi Alcaro, if you did not do so already, please contact our support, who can change this task for you"}, {"90": "Today's quest 5 groceries.  I got on at normal times (seeing as the holiday is over and its back to work) but I have 5 hours to do a 9 hour quest. Not possible.   You should give us the option to atleast recycle 1 daily quest"}, {"74": "So I have to Collect a Vision Vapor, but I have no Academy. Mmmm ... how can I do it?"}, {"57": "Hi @spennyit if you are not yet able to craft items, please contact our support via your in game settings menu. They will be able to change this quest for you"}, {"74": "Amy Steele said:\t\t\tHi @spennyit if you are not yet able to craft items, please contact our support via your in game settings menu. They will be able to change this quest for you\t\tClick to expand...I said this just so you can ask the developers to avoid it in the future [smilie--sprite1]"}, {"57": "Thanks @spennyit [BR]As announced by Vaeri, our development team are already working at improving these quests to ensure players don't receive impossible ones[BR]Vaeri said:\t\t\tDear Humans and Elves,[BR][BR]We want to use this thread to inform everyone that the team knows about the issue of quests being impossible to be completed.[BR]The improvements necessary to ensure players only receive quests they can complete at their current progress will be made as soon as possible.\t\tClick to expand..."}, {"22": "Egwene al Vere said:\t\t\tToday's quest 5 groceries.  I got on at normal times (seeing as the holiday is over and its back to work) but I have 5 hours to do a 9 hour quest. Not possible.\t\tClick to expand...ironic mode on[BR]give us directly petals for daily login..."}, {"83": "For the record, I got an impossible daily quest yesterday:[BR]I had just built my first weeping willow in chap 10, that I was requested to collect 20k mana. Problem : one weeping willow only produces 2800 mana/day. In addition, if you log in the game only once in the evening, even 2k would be a problem"}, {"3": "Have been steadily and dutifully doing these Season quests each day, each week, but will admit that boredom is now setting in [smilie--sprite3]"}, {"105": "Verde said:\t\t\tHave been steadily and dutifully doing these Season quests each day, each week, but will admit that boredom is now setting in [smilie--sprite3]Click to expand...To be fair, the quests have always been there. The difference is that we can now work on them in parallel, and the rewards are a bit more useful."}, {"106": "Katwick said:\t\t\tTo be fair, the quests have always been there. The difference is that we can now work on them in parallel, and the rewards are a bit more useful.\t\tClick to expand...No, these quests have not always been there. The quests that were there, were easy. These quests are in no way comparable, nor are the rewards."}, {"62": "2500 diamonds was already to much for what you get for the buildings as top player, now its 3000......what a joke"}, {"81": "2500 diamonds was already to expensive for random buildings… of which most were useless to me … [BR]so I doubt 3000 will make any difference"}, {"22": "is Inno busy to correct impossible (for chapter) quests? noooo, inno is thinking how to force players to use the cauldron even if they don't want, and about his income. It's seem me that inno are in war against his players these last weeks...[BR]very well, I like the season, and the pass to, and I was thinking to buy it on live server, but now I changed mi mind. And not for 500 extra  diamonds"}, {"120": "We will be changing the price for the Season Pass to 3000 Diamonds (current: 2500 Diamonds).Click to expand...A 20% price increase! That is a lot more than the inflation in Germany, which was only 7,9% for 2022. [BR]But thanks for the notification. It was once, but not again."}]