[{"32": "[IMG]https://i.ibb.co/KNvVgYk/http-www-emoticonr-com-design-yahoo-rolling-on-the-floor-laughing-gif.gif[/IMG]   What a joke!!!! Inno became pathetic with its hunger for money \t\t\t\t\t\t\t\t\t\t\t\t\t[IMG]https://i.ibb.co/ZR925Y3/http-www-emoticonr-com-design-yahoo-money-eyes-gif.gif[/IMG][BR]Let me see if I understand it right - we considered that the Season Pass is expensive and unappealing at 2500 diamonds, so, its price was increased at 3000 diamonds???[BR][IMG]https://i.ibb.co/KNvVgYk/http-www-emoticonr-com-design-yahoo-rolling-on-the-floor-laughing-gif.gif[/IMG][IMG]https://i.ibb.co/KNvVgYk/http-www-emoticonr-com-design-yahoo-rolling-on-the-floor-laughing-gif.gif[/IMG][IMG]https://i.ibb.co/KNvVgYk/http-www-emoticonr-com-design-yahoo-rolling-on-the-floor-laughing-gif.gif[/IMG]"}, {"83": "Can’t wait for the « seasons of diamonds »"}, {"51": "Please do not allow the person that was supposed to lower the amount of coins needed for the coin sack to come anywhere near making the milestones easier !"}, {"12": "Season Pass goes from 2500 diamonds to 3000 diamonds.[BR][BR]Good luck with that, I just counted the prizes I would place from the Season Pass, that's only 3[BR][BR]Actually only 2 because I wouldn't spend 1000 diamonds for a tournament booster.[BR]With 1000 diamonds I go to the Magic Academy and I'm guaranteed to get more than one tournament booster, as well as time blessings and pet food... what would I get for 3000 diamonds.[BR]I wouldn't even put up the rest of the buildings from the season pass if it was given to me as a gift.[BR]I can't imagine all other people will pay that, I'm not even sure they would pay 1500.[BR][BR]So good luck with the 3000 [smilie--sprite2][BR]I have no idea who worked out the marketing strategy, but you should bring him back to the funfair, where you won him."}, {"76": "Jammin said:\t\t\tSeason Pass goes from 2500 diamonds to 3000 diamonds.[BR][BR]Good luck with that, I just counted the prizes I would place from the Season Pass, that's only 3[BR][BR]Actually only 2 because I wouldn't spend 1000 diamonds for a tournament booster.[BR]With 1000 diamonds I go to the Magic Academy and I'm guaranteed to get more than one tournament booster, as well as time blessings and pet food... what would I get for 3000 diamonds.[BR]I wouldn't even put up the rest of the buildings from the season pass if it was given to me as a gift.[BR]I can't imagine all other people will pay that, I'm not even sure they would pay 1500.[BR][BR]So good luck with the 3000 [smilie--sprite2][BR]I have no idea who worked out the marketing strategy, but you should bring him back to the funfair, where you won him.\t\tClick to expand...The biggest problem with obtaining more and more buildings without these being more attractive is SPACE.....and extra space is very expensive....events and seasons is throwing more and more not usefull buildings at us...."}, {"64": "I bought the Event Pass only because there are no offers for new expensions at Beta. [BR][BR]Nowadays I recommend not to buy this Event pass, because I am forced to do all possible Quests. So I am forced to log in at Beta at least 2 times a day, better 3 to 4 times. Normally I log in once a day. [BR][BR]And now price increased 20 % to 3.000 diamonds. At live I spare these diamonds for next expension. Its giving me more fun to play this game."}, {"74": "GerdyaanB said:\t\t\tThe biggest problem with obtaining more and more buildings without these being more attractive is SPACE.....and extra space is very expensive....events and seasons is throwing more and more not usefull buildings at us....\t\tClick to expand...Inventory space is free [smilie--sprite6]"}, {"45": "spennyit said:\t\t\tInventory space is free\t\tClick to expand...Are you trolling? Buildings in your inventory are totally useless, unless you break them and then they only give a few fragments (which are abundent in the tower so superfluous) ... space in your city is expensive and only becomes more expensive!"}, {"59": "Alcaro said:[IMG]https://i.ibb.co/KNvVgYk/http-www-emoticonr-com-design-yahoo-rolling-on-the-floor-laughing-gif.gif[/IMG]   What a joke!!!! Inno became pathetic with its hunger for money \t\t\t\t\t\t\t\t\t\t\t\t\t[IMG]https://i.ibb.co/ZR925Y3/http-www-emoticonr-com-design-yahoo-money-eyes-gif.gif[/IMG][BR]Let me see if I understand it right - we considered that the Season Pass is expensive and unappealing at 2500 diamonds, so, its price was increased at 3000 diamonds???[BR][IMG]https://i.ibb.co/KNvVgYk/http-www-emoticonr-com-design-yahoo-rolling-on-the-floor-laughing-gif.gif[/IMG][IMG]https://i.ibb.co/KNvVgYk/http-www-emoticonr-com-design-yahoo-rolling-on-the-floor-laughing-gif.gif[/IMG][IMG]https://i.ibb.co/KNvVgYk/http-www-emoticonr-com-design-yahoo-rolling-on-the-floor-laughing-gif.gif[/IMG]Click to expand...This company is a joke since Coldfail Phoenix release"}, {"74": "Dorfl the Clay said:\t\t\tAre you trolling? Buildings in your inventory are totally useless, unless you break them and then they only give a few fragments (which are abundent in the tower so superfluous) ... space in your city is expensive and only becomes more expensive!\t\tClick to expand...Not trolling: if you don't need a building, you can avoid getting it, you can let it in the inventory, you can break it and put the fragments in the Cauldrron. If you need a building, you will find the space in your village [smilie--sprite1]"}, {"29": "Please, i don't fight and i don't want to see this quest. thank's[BR][BR][IMG]https://i.ibb.co/HPnb3TZ/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-01-23-082905-png-10827.png[/IMG]"}, {"45": "Biloutte91 said:\t\t\tPlease, i don't fight and i don't want to see this quest. thank's\t\tClick to expand...You will have to get in contact with support.. they might be willing to help you?!"}, {"29": "Yes i do this."}, {"129": "Part of the Announcement reads \"The quests of the Seasons can be completed as part of your daily routine of playing the game, over the passing of several events!\"[BR][BR]My daily routine does NOT include 15-min workshop productions, even if a FA is running. Nor is spending Pet Food, or solving Spire Encounters.[BR][BR]Another complaint I have is that with the removal of the declinable quests I spend less time on the game. A quick swipe to collect everything, check chat and messages and I'm off. This means less incentive to stay and engage with other members in chat, and less chance to catch urgent requests for trades or answer other Folks questions. As a result the game is much less friendly than it used to be, and more like a chore."}, {"73": "How much fun can you have with the quests?[BR]I just send a message to support.[BR][BR]I hope they will replace the portal profit quest for me for I don't wish to use them at the end of a chapter.[BR][BR][edit][BR]As someone edited this message I still let you know the basic part of it.[BR][BR]I used 2x the replace a weekly quest on 2 different quests and the 2nd replace gave me the 1st quest back that I don't want to do due to my place in the tech tree.[BR][BR]Now I am told I have to wait 1 week for new replacement options on a quest I tried to get ride of?[BR][/edit]"}, {"32": "Considering what's going on with the Seasons in live servers, developers should add at least 1 refresh also for the daily tasks.[BR]There I have a task asking to complete an event quest, but since the Seasons started way later than the day, all my things for this day were done already, including the daily event quest (yes, I reached the daily quests). Support says \"sorry, no can do\" and refuses to replace that task, although, here, in Beta, when I had such a task, it was replaced without any fuss."}, {"62": "Alcaro said:\t\t\tConsidering what's going on with the Seasons in live servers, developers should add at least 1 refresh also for the daily tasks.[BR]There I have a task asking to complete an event quest, but since the Seasons started way later than the day, all my things for this day were done already, including the daily event quest (yes, I reached the daily quests). Support says \"sorry, no can do\" and refuses to replace that task, although, here, in Beta, when I had such a task, it was replaced without any fuss.\t\tClick to expand...i think also 2 daily refresh tasks , specially since ive seen on beta tasks for tower etc , would be bad if you already completed it."}, {"32": "Skillpowers said:\t\t\ti think also 2 daily refresh tasks , specially since ive seen on beta tasks for tower etc , would be bad if you already completed it.\t\tClick to expand...Yeah, that is what happened to me here. I completed the Spire on Sunday, and then I got a daily task to complete a Spire encounter. [BR]Such tasks belong to weekly tasks."}, {"140": "I'm considering the diamonds for the season pass, but as an early age player, I will hold off until near the end of the season, when I've passed through a few ages, to get the best buildings possible.  Still, as others have said, it will be a lot of building to collect, and how many will I actually plop down in my city?"}, {"86": "I'm actually fairly happy with the season pass. I'm going to play normally most of the season, see if I have enough attractive prices to justify the diamonds... or not.[BR]The regular repetitive quests were awfully stale. They don't present any interest once you're past chapter 7 or so.[BR]Now there's at least the thrill (partly) of discovery.[BR]And let me stress that:[BR][BR][BR]I do like the mechanism that presents you with several quests that you can do in any order.[BR][BR]now that they have that, I hope it's going to get used elsewhere! Imagine how less frustrating the events would be if you had access to a few quests at a glance, instead of doing one quest, and realizing the next quest is more or less the reverse (buy/use KP...)[BR][BR]This is something that could be a serious quality of life improvement in the game."}]