[{"33": "Ok, just one hint.[BR]It seems Seasons rewards are tipped to combat[BR]Considerations: TeamSpirit Chapter, lvl31 Manufactories, lvl21 Merc Camp (sorry the snapshoots I have are from Live server)[BR][BR][IMG]https://i.ibb.co/fHzjWvL/https-beta-forum-elvenar-com-index-php-attachments-1674826997017-png-10878.png[/IMG][BR]a1) 138000 T3 => 138000 * (Prod 9h 53800 tools/ 13440 T3) = 552411 tools[BR]a2) 138000 T3 => 138000 * (Prod 3h 29400 tools/ 7360 T3) = 551250 tools[BR]b) 10 Toad squads => 10 squads * ( 1421 toads/ 1 squad) *(Merc prod 48778 tools / 841 toads) = 824180 tools[BR]option b is like +50% better[BR][BR][IMG]https://i.ibb.co/YNCJRxD/https-beta-forum-elvenar-com-index-php-attachments-1674826947445-png-10877.png[/IMG][BR]a) 34500 T3+2 => 34500 T3+2 * (Trade 3* 105 T3 / 100 T3+2) * (Prod 9h 53800 tools/ 13440 T3) = 145008 tools[BR]b) 10 MercWiz squads => 10 squads * ( 1894 MerWiz/ 1 squad) *(Merc prod 48246 tools / 1122 MercWiz) = 814420 tools[BR]option b is like +460% better[BR][BR][IMG]https://i.ibb.co/9vtBqxb/https-beta-forum-elvenar-com-index-php-attachments-1674828071929-png-10880.png[/IMG][BR]a) 157500 T2+2 => 157500 T2+2 * (Trade 3* 105 T2 / 100 T2+2) * (Prod 9h 13400 tools/ 13440 T2) = 164883 tools[BR]b) 15 MercArcher squads => 15 squads * ( 5682 MerArcher/ 1 squad) *(Merc prod 47124 tools / 3366 MercArcher) = 1193220 tools[BR]option b is like +625% better[BR][BR][IMG]https://i.ibb.co/rFSk0FG/https-beta-forum-elvenar-com-index-php-attachments-1674827928733-png-10879.png[/IMG][BR]a) 138000 T3+1 => 138000 T3+1 * (Trade 3* 105 T3 / 100 T3+1) * (Prod 9h 53800 tools/ 13440 T3) = 580031 tools[BR]b) 15 Toad squads => 15 squads * ( 1421 toads/ 1 squad) *(Merc prod 48778 tools / 841 toads) = 1236270 tools[BR]option b is like +115% better[BR][BR]EDIT: To include 3h production option, result is similar"}, {"19": "Beta: 2500 diamonds for the season pass. [BR]Live: 3000 diamonds for the season pass.[BR]Looking at the extra rewards one gets for that I have to ask myself what Inno was thinking. The 2500 diamonds is already rather much for those rewards, the 3000 makes it absolutely overpaid and uninteresting. [BR][BR]That aside I like this system of quests much better than the 2 cycling quests."}, {"5": "Dhurrin said:\t\t\tBeta: 2500 diamonds for the season pass. [BR]Live: 3000 diamonds for the season pass.[BR]Looking at the extra rewards one gets for that I have to ask myself what Inno was thinking. The 2500 diamonds is already rather much for those rewards, the 3000 makes it absolutely overpaid and uninteresting. [BR][BR]That aside I like this system of quests much better than the 2 cycling quests.\t\tClick to expand...[BR]They increased the cost on Beta to 3000 also, on the 26th, to match the cost on the Live servers."}, {"3": "Some indication that there are no open quests would be helpful ... save needing to open it to check.[BR]The days and quests become a bit blurred after a while."}, {"82": "Enevhar Aldarion said:\t\t\tThey increased the cost on Beta to 3000 also, on the 26th, to match the cost on the Live servers.\t\tClick to expand...... and Beta players don't even get the same Diamond discounts and sale offers as Live players, either. If anyone ever needed proof (which is unlikely) that Elvenar's Beta Server resembles the rest of the world's Beta Servers in name only, this would probably fit the bill! Charging the Live game price for content which on any normal Beta Server would be given away for free, so that players could actually TEST it properly, is beyond cynical, IMO - and of course demonstrates, if nothing else does, that Inno sees Beta merely as a Live Server with a different (and meaningless) name.[BR][BR]No wonder the Beta Forum is usually quiet... most Beta players are busy just playing a perfectly standard game of Elvenar, and who can blame them!"}, {"5": "Verde said:\t\t\tSome indication that there are no open quests would be helpful ... save needing to open it to check.[BR]The days and quests become a bit blurred after a while.\t\tClick to expand...[BR]I just hover my mouse over the season quest box and it shows if any are open and also the timer to when more will be available."}, {"5": "Laurelin-Beta said:\t\t\t... and Beta players don't even get the same Diamond discounts and sale offers as Live players, either. If anyone ever needed proof (which is unlikely) that Elvenar's Beta Server resembles the rest of the world's Beta Servers in name only, this would probably fit the bill! Charging the Live game price for content which on any normal Beta Server would be given away for free, so that players could actually TEST it properly, is beyond cynical, IMO - and of course demonstrates, if nothing else does, that Inno sees Beta merely as a Live Server with a different (and meaningless) name.[BR][BR]No wonder the Beta Forum is usually quiet... most Beta players are busy just playing a perfectly standard game of Elvenar, and who can blame them!\t\tClick to expand...[BR]I have never bought diamonds on the Beta server and I get more than enough free ones over the months and years to buy the royal pass in every event since it started and to buy the pass for the current season, and still have about 3000 saved up after that."}, {"3": "Enevhar Aldarion said:\t\t\tI just hover my mouse over the season quest box and it shows if any are open and also the timer to when more will be available.\t\tClick to expand...Must be on the browser version. Not available on App."}, {"5": "It looks like the amount of mana needed for a daily quest has been reduced. The last time I posted about this, I needed 350k in chapter 18, but I got the quest for the first time since then and it is now down to 291k."}, {"33": "I think I would prefer all missions based on events (Tournament, Spire, Events...) to be moved to Weekly missions (quantities would need to be adjusted) this way it would be easier to organize, avoid lockdowns..."}, {"32": "Prueba2 said:\t\t\tI think I would prefer all missions based on events (Tournament, Spire, Events...) to be moved to Weekly missions (quantities would need to be adjusted) this way it would be easier to organize, avoid lockdowns...\t\tClick to expand...^^^ and even so, you can get an impossible mission. In live server, today I got \"complete 10 event quests\" but I reached the dailies, so, not a chance to complete 10 quests in 7 days."}, {"57": "Alcaro said:\t\t\t^^^ and even so, you can get an impossible mission. In live server, today I got \"complete 10 event quests\" but I reached the dailies, so, not a chance to complete 10 quests in 7 days.\t\tClick to expand...@Alcaro please contact your live server support if you did not do so already. They will hopefully change that quest for you"}, {"33": "Alcaro said:\t\t\t^^^ and even so, you can get an impossible mission. In live server, today I got \"complete 10 event quests\" but I reached the dailies, so, not a chance to complete 10 quests in 7 days.\t\tClick to expand...If it were in the weekly mission, at least we could reroll it..."}, {"32": "Amy Steele said:@Alcaro please contact your live server support if you did not do so already. They will hopefully change that quest for you\t\tClick to expand...I didn't think that far at that moment [smilie--sprite8], I re-rolled it and got another task but if it will appear again, then I will contact Support, not so much for changing the task as more to let them know that THAT task is not a doable one.[BR][BR]Prueba2 said:\t\t\tIf it were in the weekly mission, at least we could reroll it...\t\tClick to expand...I did and I hope will not appear again!"}, {"57": "Alcaro said:\t\t\tif it will appear again, then I will contact Support, not so much for changing the task as more to let them know that THAT task is not a doable one.\t\tClick to expand...Hopefully it will not reappear! If it does, please do contact your support. I have also alerted the team here that this quest still exists, so it should get passed on from here, but it's still a good idea to let your support know"}, {"45": "Amy Steele said:\t\t\tHopefully it will not reappear! If it does, please do contact your support.\t\tClick to expand...It is highly irritating that on 'live' worlds these bugs/mistakes occur as well, but support these doesn't want to know about them and repetitely and stubbornly refuse to help players out... even after extensive explanations that on beta they are assisted. What gives, INNO???"}, {"29": "hello here. I have this quest in season of dreams...[BR][BR][IMG]https://i.ibb.co/d0zBg1t/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-02-02-171957-png-10905.png[/IMG]....[IMG]https://i.ibb.co/kqm2RkZ/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-02-02-172525-png-10906.png[/IMG][BR][BR]For your information, to validate this quest,  you have to buy digging equipment ten times with \"provisions\" [IMG]https://i.ibb.co/jv5dcN6/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-02-02-174616-png-10911.png[/IMG][BR][BR][IMG]https://i.ibb.co/Hx26HN7/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-02-02-174159-png-10910.png[/IMG][BR][IMG]https://i.ibb.co/KjNwcK2/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-02-02-173019-png-10907.png[/IMG]... [IMG]https://i.ibb.co/47fBRQ7/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-02-02-173035-png-10908.png[/IMG]"}, {"14": "Dorfl the Clay said:\t\t\tsupport these doesn't want to know about them and repetitely and stubbornly refuse to help players out\t\tClick to expand...[BR]Which live server are you on? Just out of curiosity..."}, {"29": "This quest of the 10 quests of the current event on lives is achievable... there are 12 days left and therefore with one quest per day you validate this quest of the season of dreams... But it is true that it should be deleted."}, {"82": "Having read the very useful Seasons Quest List on the @iDavis website (many thanks indeed for providing all of the site's excellent content, iDavis!), I'm interested in the Weekly Season Quests which require players either to complete 10 x Event Quests or to advance 10 x steps along an Event Grand Prize route/Map (open 10 x Chests/Beacons/etc.). I'm also interested in the other less-demanding but still potentially time-gated and/or Event Currency-limited Event-related Weekly Quests which require multiple lesser in-Event actions to be done (e.g. 'Generate 30 x Game Pieces in Dwarven Event'). ETA : I assume that this Quest essentially duplicates (requirements-wise) the Weekly Season Quest mentioned above by @Biloutte91 ('Use Provisions to purchase Digging Equipment'); therefore (@Amy Steele), if one particular type of these time/Event-Currency-gated Quests, relating to one named/type of Event, is removed/revised, then I would hope that ALL similar Quests in the Seasons list will likewise be removed/revised?[BR][BR]I'm wondering whether there are any conditions attached to the generation of these Quests other than '[name/type of] Event is running'?[BR][BR]@iDavis @Karvest (or @ anyone else who can read the game files) - specifically, is there any (visible to us) sub-condition in operation which prevents a Weekly Quest which requires 10 x Event actions (as above) and/or several days'-worth of lesser Event actions from being generated later than Day One of the final 10 days of the Event in question; perhaps even on the final day, assuming that the Event/Seasons schedule allows that to happen? If so, then needing to 'save up' either 10 x Event Quests and/or enough Event Currency to open 10 x Grand Prize route steps/Chests, on the final (or even during the previous up to six) days seems a very inconvenient possibility...?[BR][BR]It would obviously be somewhat helpful if more than one type of these Event-dependent Weekly Season Quests can [theoretically/randomly] appear within a single Weekly Quest selection, but even if so, this would still be (a) only a minor mitigation of the problem, if it exists, and (b) a random occurrence, relying upon which is IMO not a legitimate solution.[BR][BR]Finally : is there any way to tell whether some/any/all of the Season Daily OR Weekly Quests has any greater/lesser weighting within the RNG?[BR][BR]Any/all info on any of the above points will be much appreciated, as always![BR][BR][BR]PS : I am increasingly tempted to learn how to read the game files myself, although the time involved (I don't have that much) will be extensive, since my last real experience with code was DOS 5.0 (and AmigaBasic, before that!) and mid-90s HTML... and I've never even investigated Java[script]! Hmm.[BR][BR]Meanwhile, may I just say once again that I'm always very grateful to those who both can and do analyse the game files on behalf of the rest of us... [smilie--sprite1]"}]