[{"45": "PrimroseSylvia said:\t\t\tWhich live server are you on? Just out of curiosity...\t\tClick to expand...Dutch server, both worlds = Arendyll and Winyandor"}, {"141": "Всем Привет! Purchase Exploration Equipment -Приобрести разведочное оборудование - что означает это в действии?[BR]Ежедневный квест сезона мечтаний - по русски может кто объяснить? Заранее, спасибо.[BR][BR]P.S. Оказывается купить лопатку в ивенте)) увидел постом выше. [BR][BR]Hello everyone! Buy exploration equipment -Purchase exploration equipment - what does it mean in action?[BR]The daily quest of the season of dreams - in Russian, can anyone explain? Thanks in advance.[BR][BR]P.S. It turns out to buy a shovel in the event)) I saw the post above."}, {"82": "PS : If these time-Event Currency-gated Quests can appear in Cities below, say, Ch.VIII O&G, IMO they will be near-impossible for most casual players.[BR]ETA : Context :[BR]Laurelin-Beta said:[...see above...]Click to expand..."}, {"45": "Mandalorian said:\t\t\tВсем Привет! Purchase Exploration Equipment -Приобрести разведочное оборудование - что означает это в действии?[BR]Ежедневный квест сезона мечтаний - по русски может кто объяснить? Заранее, спасибо.[BR][BR]P.S. Оказывается купить лопатку в ивенте)) увидел постом выше. Click to expand...On the betaforum, English is mandatory.. please use Google Translate!"}, {"141": "Dorfl the Clay said:\t\t\tOn the betaforum, English is mandatory.. please use Google Translate!\t\tClick to expand...I corrected the entries"}, {"16": "Laurelin-Beta said:\t\t\t@iDavis @Karvest (or @ anyone else who can read the game files) - specifically, is there any (visible to us) sub-condition in operation which prevents a Weekly Quest which requires 10 x Event actions (as above) and/or several days'-worth of lesser Event actions from being generated later than Day One of the final 10 days of the Event in question; perhaps even on the final day, assuming that the Event/Seasons schedule allows that to happen? If so, then needing to 'save up' either 10 x Event Quests and/or enough Event Currency to open 10 x Grand Prize route steps/Chests, on the final (or even during the previous up to six) days seems a very inconvenient possibility...?\t\tClick to expand...Such conditions can be found only in server side code, which can be seen only by Inno internals."}, {"14": "Dorfl the Clay said:\t\t\tDutch server, both worlds = Arendyll and Winyandor\t\tClick to expand...Try submitting another ticket, asking to be delegated to community management; maybe your CM can talk with others and see that they're wrong... We're lucky enough that our live mods posted directly on forum to submit a ticket if we got one of these impossible quests  but we benefit from having a beta mod in our support and it can make a big difference"}, {"45": "PrimroseSylvia said:\t\t\tasking to be delegated to community management;\t\tClick to expand...Tha is not possible for reason I can not comment on in this forum..."}, {"5": "Well, from the original values for quests, then through the changes that were done here, with the fresh batch of weekly quests tonight completed, I have finished all 50 stages and received the final prize. There is no sign of anything extra after stage 50, even though it was hinted at by the previous CM. So, 12 more days of daily quests and one more round of weekly quests, and now there is no reason to go out of my way to complete any of them and that is disappointing."}, {"11": "I see this weekly quest:[BR][IMG]https://i.ibb.co/hcfpm8b/https-beta-forum-elvenar-com-index-php-attachments-season-weekly-quest-jpg-10947.jpg[/IMG][BR][BR]This is not possible within 7 days.[BR][BR]I know i can 2x refresh (who knows what i get then), but i think this should not be there by default. Maximum of 6 would be reasonable."}, {"5": "Droopy said:\t\t\tI see this weekly quest:[BR]View attachment 10947[BR][BR]This is not possible within 7 days.[BR][BR]I know i can 2x refresh (who knows what i get then), but i think this should not be there by default. Maximum of 6 would be reasonable.\t\tClick to expand...[BR]You don't have to finish it in 7 days because it will not go away until you finish it. The next quest for that spot will go into a queue and wait to show once there is a spot for it. As long as there are still at least 10 quests left, it can be done."}, {"3": "Enevhar Aldarion said:\t\t\tYou don't have to finish it in 7 days because it will not go away until you finish it. The next quest for that spot will go into a queue and wait to show once there is a spot for it. As long as there are still at least 10 quests left, it can be done.\t\tClick to expand...And presumably an event active and also at least 10 days left in the Season itself.[BR]Wonder how quests like this will be handled in the last days of the Season."}, {"9": "@Enevhar Aldarion 11 days left. If you get the same quest next week...[BR][BR]But we have pointed out about impossible and nearly impossible quests many times...[BR]Well, now the question is, do i still care about seasons anyway?"}, {"129": "[IMG]https://i.ibb.co/fnS5zFW/https-beta-forum-elvenar-com-index-php-attachments-forum-season-of-dreams-01-jpg-10950.jpg[/IMG][BR][BR]Now all I need is 'Produce Advanced Tools' and I'd have no life left for the rest of the week. [smilie--sprite4]"}, {"82": "@Agvar : The new Tech Tree is KP-light but Coins/Supplies-heavy, and the new [main] Chapter Quests also give fewer Coins/Supplies; almost every new City I see now asks for MH/Coins in their City Name (for NH), and there is also a LOT more 0*/1* and cross-Tier Trading, too, done by genuinely new players (not only Spire farms, as one would expect). New Cities also grow much more slowly now, if not abandoned. I feel this indicates a shortage of the two most basic Resources, even though the new Chapter Quests award more types of Resources than previously.[BR][BR]On top of this, and because Seasons have replaced the old repeating/cycling Chapter Quests, new players can no longer 'farm' Coins/Supplies from those, either - so those players will probably find the Toolbox and Groceries Season Quests just as tiresome, but for different reasons : (a) longer vs shorter productions provide far fewer Supplies, and (b) the early game is now more limited overall because FS membership, Tourney, and Spire have been moved forward in the Tech Tree, so I'd imagine that there's now really not much to do in the early game other than collect & reset Resource productions (and go through the Build Menu waiting to be able to afford the Coins/Supplies to build things) - without having enough CCs/Spell Frags to Craft to pass the time, for example, or enough Time-boosters to speed up longer Season-demanded production runs.[BR][BR]That said, the short Workshop runs (and Toolboxes) are a nuisance to me, too. I've started logging in as close to 12.01 am as possible and then rushing through the Daily Season Quests (+Event Quest(s), where possible) as fast as I can, and I find myself generally irritated and not even in the mood to log in throughout the next 24 hours because I end up trying to juggle my usual gameplay choices around Seasons (and Events, now that they & Seasons inter-relate). IF Inno was trying to create/increase engagement and/or add interest to the game for established [not newbie] players, it seems that in my own case, at least, the opposite effect has occurred.[BR][BR]This attempt to railroad us into playing by Inno's time schedule rather than our own is NOT working for this player; I'm playing less, not more."}, {"45": "Laurelin-Beta said:\t\t\tI find myself generally irritated and not even in the mood\t\tClick to expand...As they say: Don't get mad... get even! And definitely don't get annoyed, it's not worth it.. after all, it is just a game! [smilie--sprite6]"}, {"129": "I have defininately noticed a tail-off in the activity levels of other players, both here in Beta and on the Live Servers since Seasons started. We no longer seem to get as much Spire or Tourney done, and sometimes struggle with trades being taken too. Not good for Fellowship unity or the game in general. I wonder if Inno's management will notice a drop-off in revenue and do something about it (not holding my breath though)."}, {"45": "I have just reached gemstone/waypoint 52 but no extra chest or reward... ????[BR][BR][IMG]https://i.ibb.co/Kyy08t2/https-beta-forum-elvenar-com-index-php-attachments-knipsel-png-11002.png[/IMG] 52"}, {"142": "There are additional prizes after waypoint 50, but be careful, even though all boxes say claim, you can only open one and then the others are gone."}, {"11": "I cannot choose the middle chest, but it unclear for me what the exact reason is?[BR]I assume not enough points, but it is not made clear how to activate the middle one:[BR][BR][IMG]https://i.ibb.co/Mf8pKLw/https-beta-forum-elvenar-com-index-php-attachments-season-end-rewards-jpg-11006.jpg[/IMG]"}]