[{"5": "Droopy said:\t\t\tI cannot choose the middle chest, but it unclear for me what the exact reason is?[BR]I assume not enough points, but it is not made clear how to activate the middle one:[BR][BR]View attachment 11006Click to expand...[BR]It is because you did not buy the season pass."}, {"29": "I have this in my city[BR][BR][IMG]https://i.ibb.co/cbTrcfQ/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-02-16-111711-png-11007.png[/IMG]"}, {"129": "So Purple chests are Season Pass only, the others are regular chests. Shame this isn't made clear somehow."}, {"29": "Yes. but it is here ^^[BR][BR]https://beta.forum.elvenar.com/index.php?threads/season-of-dreams.18173/post-112991[BR][BR]Dear Humans and Elves,[BR][BR]Starting from February 16th, after completing all 50 Season milestones, earn a Season Blessing for every 500 Season Petals you collect. The Season Blessings will let you choose between 3 chests, one of the chests is free and the other two are unlocked with the Season Pass. No progress can be made on a Season Blessing before the previous 50 milestones are completed."}, {"11": "Biloutte91 said:\t\t\tYes. but it is here ^^[BR][BR]https://beta.forum.elvenar.com/index.php?threads/season-of-dreams.18173/post-112991[BR][BR]Dear Humans and Elves,[BR][BR]Starting from February 16th, after completing all 50 Season milestones, earn a Season Blessing for every 500 Season Petals you collect. The Season Blessings will let you choose between 3 chests, one of the chests is free and the other two are unlocked with the Season Pass. No progress can be made on a Season Blessing before the previous 50 milestones are completed.\t\tClick to expand...That's not correct, i could choose between two chests and the middle one was not available."}, {"29": "A bug [smilie--sprite7][smilie--sprite7][smilie--sprite7]"}, {"29": "And it is not 500 Season petals but 130. [BR][BR][IMG]https://i.ibb.co/t2GhWr0/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-02-16-192531-png-11008.png[/IMG]"}, {"1": "Droopy said:\t\t\tThat's not correct, i could choose between two chests and the middle one was not available.\t\tClick to expand...If this is still happening to you, you just need to re-login and the issue will be solved. [BR]Biloutte91 said:\t\t\tAnd it is not 500 Season petals but 130.[BR][BR]View attachment 11008Click to expand...Thank you for the correction, it is much appreciated."}, {"83": "I rushed my chapter to be able to collect some season of dreams buildings with the next chapter characteristics.[BR]What a disappointment . It turns out that the amuniship I was looking forward to collect has now been replaced by some rubbish.[BR]What a turn down![BR]Season of dreams —> season of garbage. Tyvm to the person in charge at inno. You made it"}, {"5": "@Fastandfurious the Amuni Ships is either a daily in the current event, or was a daily in the previous event, which is likely why they switched it for something else. [BR][BR]Edit: Also, are you looking at the right spot? It is the prize for stage 26 and still shows correctly in both my Beta and Live cities."}, {"29": "Season Pass price[BR][BR][IMG]https://i.ibb.co/hBC7Y0V/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-02-17-090629-png-11010.png[/IMG]"}, {"83": "I’m 90% sure it was a free price some weeks ago. [BR]I saved all the milestones buildings to collect when I would be in the next chapter. [BR]I am there now. I think there were more real buildings to be won at first. Today I ended up collecting mostly unit instants, which I don’t really care of. I don’t recall that there were so many unit instants either when the season was launched"}, {"29": "I answer in relation to the increase in the duration of the seasons by 10 days. It would have been nice to have other prizes... than those chests that don't contain much."}, {"5": "Biloutte91 said:\t\t\tI answer in relation to the increase in the duration of the seasons by 10 days. It would have been nice to have other prizes... than those chests that don't contain much.\t\tClick to expand...[BR]No, increased to 10 days, not by 10 days. They only added one more week and we still had 3 days left."}, {"64": "Now I know more after reading the Forum. I was very disappointed by getting my first price after milestone 50. I took the middle chest and got only a 100 % supply windfall. [BR][BR]This is not worth the effort [smilie--sprite3][BR][BR]maybe tooking one of the other chests would bring a more appriciated price, but how should I know? This little butterfly for seasons pass is not very good visibly."}, {"45": "salandrine said:\t\t\tone of the other chests would bring a more appriciated price,\t\tClick to expand...Hardly worth speaking of.. same order"}, {"14": "Fastandfurious said:\t\t\tI’m 90% sure it was a free price some weeks ago.\t\tClick to expand...I'm sorry, but you are wrong; here is the first version of season, and Amuni Ship has never been free[BR][BR][IMG]https://i.ibb.co/xGwzHpC/https-i-imgur-com-Esb6-Ov8-png.png[/IMG]"}, {"83": "Ah ok. My mistake then. Thank you for the correction. So I rushed my chapter for nothing. [BR]Unless you fight , which I don’t on beta as it takes too much time, there is really not much to win then for players who negotiate, which I guess is the vast majority. [BR]At least the daily prices have somewhat been improved a bit, otherwise I would not bother anymore with the seasons."}, {"45": "Fastandfurious said:\t\t\twhich I guess is the vast majority\t\tClick to expand...Don't know why you guess that or what you base that on, but I think you are wrong.. most players either fight or do both"}, {"6": "Biloutte91 said:\t\t\tStarting from February 16th, after completing all 50 Season milestones, earn a Season Blessing for every 500 Season Petals you collect. The Season Blessings will let you choose between 3 chests, one of the chests is free and the other two are unlocked with the Season Pass. No progress can be made on a Season Blessing before the previous 50 milestones are completed.\t\tClick to expand...it would be helpful and clearer if there was a padlock on locked chests, thanks"}]