[{"29": "You can't open the chest if you have not the Seasons pass. so, for me a padlock is not necessary.[BR][BR][IMG]https://i.ibb.co/cbTrcfQ/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-02-16-111711-png-11007.png[/IMG]"}, {"57": "Oh! It's subtle, but looking at your image @Biloutte91 it seems the purple chests do have padlocks... look closely at the difference between the lock for the middle chest and the other two"}, {"29": "And yes indeed, the purple chests have their lock at the bottom and the green chest has its lock at the top.[BR][BR]But, i think that the player should be talking about padlocks like these[BR][BR][IMG]https://i.ibb.co/TcKm8wX/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-01-27-173854-png-11024.png[/IMG][IMG]https://i.ibb.co/mSV75TM/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-01-27-173908-png-11025.png[/IMG][IMG]https://i.ibb.co/6Wd2wbg/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-01-27-173927-png-11026.png[/IMG][BR]but"}, {"57": "Biloutte91 said:\t\t\tBut, i think that the player should be talking about padlocks like these\t\tClick to expand...Indeed that would be more obvious"}, {"29": "the problem is that anyway, we can only choose one if we don't have the premium. [BR][BR]But it would actually be possible to add padlocks like here.[BR][BR][IMG]https://i.ibb.co/Z8vgqxX/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-02-23-161239-png-11027.png[/IMG]"}, {"11": "Just wondering, i can choose a chest without having reached the 130. Intended?[BR][BR][IMG]https://i.ibb.co/gV33ypq/https-beta-forum-elvenar-com-index-php-attachments-elvenar-beta-seanons-endgame-20230224-jpg-11031.jpg[/IMG]"}, {"29": "Yes this is your level 53 chest. Now you are at 90/130 of level 54 ..same thing for me[BR][BR][IMG]https://i.ibb.co/cxqbq7g/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-02-24-113139-png-11032.png[/IMG]"}, {"11": "Biloutte91 said:\t\t\tYes this is your level 53 chest. Now you are at 90/130 of level 54 ..same thing for me[BR][BR]View attachment 11032Click to expand...[BR]Ah yes ofcourse. I understand, i already passed the 130 today and start over again."}, {"29": "Yes."}, {"33": "Prueba2 said:\t\t\tOk, just my two cents.[BR][BR]Cyclable quests were boring...[BR]Season seemed a more dynamic and entertainment replacement.[BR][BR]It is not.[BR]It is just an excuse to give lame rewards? and charge with an outrageous amount of diamonds for some mediocre buildings.[BR]Most players have provided their feedback, if Inno believes the feature is ok, let them carry it to Live.[BR]I suppose someone will count at the end of the month the revenue of the \"Season Pass\" and decisions wil be taken accordingly.[BR][BR]Some points that need improvement:[BR]No only-premium rewards milestones, give something to every player.[BR]I agree that premium pass should have better rewards, but that should not mean no rewards for everyone else.[BR]Make it additional.In other games , the premium pass provides premium currency so pushers can recover all or mostly all cost.[BR]You can get a LOT for 2500 diamonds, is ALL that Season Pass offers worth it?[BR]Easier way , put additional premium rewards every 2 milestones, gift small quantities of diamonds as sweeteners.No 100% doable quests inside chapter must be avoided. Period.A daily quest refresh (or two) should mitigate potential issues (Spire, Tournament, ...)[BR]Code should take into account refreshed quest and avoid giving the same quest or same category...For small players, make the prizes relevant for them.[BR]Remember how much tight gold and supplies are at the beggining (*).[BR]One single 5h instant is not relevant, neither some troops.[BR]Some multiple smaller instants and small windfalls are.For big players, make the prizes relevant for them.[BR]One good point is the option of choosing among different rewards (time, wares,...) some time ago some Tome that provided orcs, mana, seeds was given if I remember correctly, that maybe one good way to go.[BR]Make all milestones 2-3 options, with premium being 1 less por regular players.Building rewards. Make them better than regular buildings, if Devs are not excited about it , we will no be either...[BR]Or give just Lava codex, Orcs Nests, Mana Sawmills, Festival Merchants... they are always good and are replaced every chapter.Make it funny, not a cumbersome chore.EDIT: Still writing... Done[BR][BR](*) As Homework, try to start now a trial city, from beginning, to refresh the feeling of scarcity, 2-3 chapters are enough, but a good exercise of self-reflection. If it is HARD for veteran players that know the game , just imagine for new players... and if it is not interesting and entertaining they will not keep playing...[BR]EDIT2: Yes, lucky coincidence, but appropiate pun nonetheless = beginning+beggingClick to expand...Just two months ago...[BR]I would add moving all Spire and Tournament related missions to Weekly instead of Daily.[BR][BR]Are there any changes foreseen for the next \"Season of ___\" ?"}, {"87": "[IMG]https://i.ibb.co/mbz6gdK/https-beta-forum-elvenar-com-index-php-attachments-1677499308475-png-11062.png[/IMG][BR][BR]need luck tomorow with the 4 daily quests to get the remaining 20 points for 53 reward and liitle bit dispointed by last reward  7 ancien knowledge or 10% PP is not much[BR][IMG]https://i.ibb.co/ck7X8SP/https-beta-forum-elvenar-com-index-php-attachments-1677499572367-png-11063.png[/IMG]"}, {"64": "I am also at chest 55 and I got this chest two times, so I took the left and also the right chest, because I got a season pass."}, {"5": "After finishing off the final daily quests tonight, I finished with 57 prize stages complete and 80/130 toward prize 58. I completed every single daily and weekly quest, but since numbers were shifted and changed at least a couple of times for Beta, and we got any extra week that Live will not get, I do not know how the max total for the Live servers will compare to this."}, {"120": "Since last Sunday, the Season of Dreams quests are gone.. [BR]Is that intentional? Or is it a bug? [BR][IMG]https://i.ibb.co/fkbfg0g/https-beta-forum-elvenar-com-index-php-attachments-season-quests-gone-2023-02-28-102452-jpg-11065.jpg[/IMG]"}, {"64": "Earwen1 said:\t\t\tSince last Sunday, the Season of Dreams quests are gone..[BR]Is that intentional? Or is it a bug?[BR]View attachment 11065Click to expand...This happens some times to me also, its always when I finished both quests in total. But with next log in the quests will still be there.[BR][BR]What about new quests? When will they start? The timer statet start will be as soon as the timeline will be fullfilled? I read something about 20 min. or so. But nothing happened right now. [BR][BR]Will the seasons start tomorrow with beginning of spring? snow will be gone then and maybe it is time for the new season? @Amy Steele"}, {"16": "For now next season is scheduled at the late april. But may be that's for live servers (~2 weeks after season of dreams ends there)."}, {"57": "Earwen1 said:\t\t\tSince last Sunday, the Season of Dreams quests are gone..[BR]Is that intentional? Or is it a bug?\t\tClick to expand...[BR]@Earwen1 @salandrine[BR]Season of Dreams finished earlier today, having originally been due to finish more than a week ago, but having been extended as announced here[BR]Deadeye Jerry said:\t\t\tWe will extend the Season of Dreams for 1 more week, this will allow us to do further testing of the feature and as result you can receive Blessings for another week.[BR][BR]The Season will be active until the 28th of February.\t\tClick to expand...[BR]salandrine said:\t\t\tWhat about new quests? When will they start? The timer statet start will be as soon as the timeline will be fullfilled? I read something about 20 min. or so. But nothing happened right now.[BR][BR]Will the seasons start tomorrow with beginning of spring? snow will be gone then and maybe it is time for the new season?\t\tClick to expand...So far we have no start date for another Season... as soon as we do, this will be announced, so keep an eye on our announcements![BR][BR]For now, the next thing is a new Fellowship Adventure, which will start in a little under 2 days. This is the timer you currently see in your city"}, {"64": "Thanks for the info.[BR][BR]Maybe the seasons should be aligned with the live servers. Or Inno will finally take the time to revise the quests and then set them correctly. That would be nice.[BR][BR]I just thought seasons were one season each, i.e. winter, spring, summer, autumn.[BR][BR]So I will wait."}, {"16": "Next would be \"Season of Joy\", so they are not related to nature seasons."}, {"9": "So after Season of Nightmares comes Season of Drugs [smilie--sprite8]"}]