[{"22": "spennyit said:@Ainor \"not bad buldings\"?????\t\tClick to expand...not all, but ludibria ventis, manta ray, heavy melee shrine, amuni ship, monumnt of ancient knowdlege, savory bites, tender tag team and unleashed unit upgrade  are very good; plus training dojo, bumblebee stable, azure stable and desert watch tower can be usefull.[BR][BR]Skillpowers said:\t\t\t4 buildings of that season pass are good\t\tClick to expand...I have another opinion[BR]Who think that is not much for 2500 diamonds, don't buy it [smilie--sprite2][BR](I suppose that rewards change every season)[BR][BR]however, better buildings are always welcome [smilie--sprite8]"}, {"64": "[smilie--sprite2] there must be something left for next season pass. [smilie--sprite7][BR][BR]At first sight it looks funny and very refreshing to me, because daily quests were very old and not above chapter 8 or 9. It was really time to replace to dailiy quests.[BR][BR]And 2.500 diamonds are a nice price for the buildings you will get for. Better, very much better, than 1500 dias for the Royal Pricepass, which is really to high.[BR][BR]Remember, burning fountain was at 800 dias in last offer to buy"}, {"43": "I like the new[BR]I have Update APP, after upgrate, it slow and sometime I push and notting happen in 10 sec. Every thing is frozen (yes it is Winther ;-)"}, {"2": "This might sound like a dumb question, but how do I open this rewards chest?  I have been poking it but nothing happens.[BR][IMG]https://i.ibb.co/GP81P60/https-beta-forum-elvenar-com-index-php-attachments-screenshot-2022-12-08-063336-jpg-10563.jpg[/IMG]"}, {"45": "Ainor said:\t\t\thowever, better buildings are always welcome\t\tClick to expand...Maybe a bit premature... after all the season continues another 75 days..."}, {"37": "@Lelanya you need to collect all keys first (complete all daily quests).[BR][BR]Details about the final Somnial Pool building are available here."}, {"45": "Lelanya said:\t\t\tdo I open this rewards chest?\t\tClick to expand...Maybe you need to finish the last daily quest first?"}, {"67": "so the buildings only unlock if i buy the pass?"}, {"32": "ayebee said:\t\t\tThere is a refresh button together with the text \"2 refreshes left\" on the weekly quests screen which doesnt seem to be working - is this still in development?\t\tClick to expand...[BR]There are other refresh buttons, for each quest, right near the bar. See pic.[BR][BR][IMG]https://i.ibb.co/TP2QcyM/https-beta-forum-elvenar-com-index-php-attachments-season-week-jpg-10564.jpg[/IMG]"}, {"128": "Nice idea, but, if the daily quests are the same every day, they cannot be solved by small players. The wholesaler is too expensive for being used every day by small players with little productions in workshops and manufacturies."}, {"60": "The removable of cyclable quests will be hard on some smaller players. The more savvy of those in very early chapters make heavy use of them to help with gold and supplies. [BR][BR]For those in the chapters where those quests lose their usefulness, it's a fun addition."}, {"60": "Will the quests be (or are they) modified for chapter level ? For example I have a \"collect seeds\" quest which of course would be impossible for anyone before Halflings."}, {"51": "So I do all of the daily quests and this is my reward ? All of a sudden this feels like a nerf to the old questline. I utilized the quests to build supplies and coin back up via 2 of the quests - 1) collect 16,000 supplies - reward was 100,000 coin and 2) collect 2 advanced tools and 200,000 coin - reward there was 13,000 supplies - and the only limit to these was your coin and supply cap. Now I do not have that option and I wonder how this SINGLE 10 min boost is going to help me regenerate my supplies nd coins ??"}, {"51": "now I have completed both the daily and 1 weekly task - the weekly task being to collect 75 advanced tools - that would have neeted me 960,000 coin which was needed to build my coins back up from the spire - instead I got this"}, {"16": "some math (corrected ):[BR]to get last prize you need 4885 petals[BR]completing all daily quests gives you 1500 petals[BR]completing all weekly quests gives you 3080 petals[BR]so even if you complete all quests and buy season pass that gives you additional 150 petals you won't have enough of them to get last prize."}, {"33": "Karvest said:\t\t\tsome math:[BR]to get last prize you need 4775 petals[BR]completing all daily quests give you 6000 petals[BR]completing all weekly quests give you 3080 petals[BR]so you can skip almost half of the quests and still get the last prize.\t\tClick to expand...After those 4775 petals, will players get anything more?"}, {"16": "daily chests, I guess."}, {"129": "Lelanya said:\t\t\tThis might sound like a dumb question, but how do I open this rewards chest?  I have been poking it but nothing happens.[BR]View attachment 10563Click to expand...When you have completed all four daily quests the chest willunlock."}, {"2": "Yup thanks"}, {"85": "eltina said:\t\t\tI like the new[BR]I have Update APP, after upgrate, it slow and sometime I push and notting happen in 10 sec. Every thing is frozen (yes it is Winther ;-)\t\tClick to expand...I‘ve got the same issue. After the update, the App slowed down a lot. Sometimes I click on something, nothing happens so that I think it’s crashed, but after a while it works again (extremely slow). Bad performance now, not much fun to play.[BR][BR]Please don’t let this go live until the issue has been fixed."}]