[{"12": "I really like the season and design, this purple tree is beautiful.[BR]Unfortunately, the Season Pass is not for me (first of all, it is far too expensive and too few things in it that I really want) but I also like the prices without the pass quite a lot.[BR]I've also never bought the Royal Pass in the events, it's never been interesting either.[BR][BR]All in all a very good feature, I like that you can refuse a quest up to 2 times, because I don't like waste (I had a quest where I was supposed to use 10x culture spells, I don't like that kind of thing, using something even though I don't need it )[BR][BR]Thank you very much, I'm looking forward to it going live [smilie--sprite1]"}, {"51": "?? #3 is locked ??"}, {"65": "Willie B. Gone said:\t\t\t?? #3 is locked ??\t\tClick to expand...This is a premium prize. You can unlock it by paying here [smilie--sprite1][BR][BR][IMG]https://i.ibb.co/W0GPcMZ/https-beta-forum-elvenar-com-index-php-attachments-1670544141772-png-10570.png[/IMG]"}, {"5": "Willie B. Gone said:\t\t\t?? #3 is locked ??\t\tClick to expand...[BR]Pay 2500 diamonds and you can have that prize, and all the rest of the premium prizes."}, {"2": "Willie B. Gone said:\t\t\t?? #3 is locked ??\t\tClick to expand...To be fair, this could be a wee bit clearer than it actually is."}, {"28": "”weekly” as within a calender week ?[BR]or[BR]start of season was thursday, from thursday to thursday next week ?"}, {"5": "Heffernan said:\t\t\t”weekly” as within a calender week ?[BR]or[BR]start of season was thursday, from thursday to thursday next week ?\t\tClick to expand...[BR]Could be either, and since the season is 75 days long, which is not evenly divisible by 7, it will be odd at the end."}, {"87": "some weekly quest need to use 5 coin rain ... never used one (except during adventure) , only have to trade gold in excess with wholesaler , but it's possible to refresh this weekly quest [BR]but more anoying for daily quest , should be kp in any wonder for those who have no wonder  or no avaliable (under construction)  , and also as it is, it's not possible to use kp from perk[BR][IMG]https://i.ibb.co/wLGhVSZ/https-beta-forum-elvenar-com-index-php-attachments-1670567767844-png-10571.png[/IMG]"}, {"97": "Refreshing will give One New Task only? [BR]Or all remaining get refreshed? [BR]And if you have completed all of the weekly tasks, does it give new, extra ones?[BR][BR]Heffernan said:\t\t\t”weekly” as within a calender week ?[BR]or[BR]start of season was thursday, from thursday to thursday next week ?.\t\tClick to expand...This is very important to clarify please, Inno. Is this Sunday to Saturday week? Monday to Sunday or Thursday to Wednesday thing.... this should definitely be worded somewhere."}, {"18": "TomatoeHu said:\t\t\tRefreshing will give One New Task only?[BR]Or all remaining get refreshed?[BR]And if you have completed all of the weekly tasks, does it give new, extra ones?\t\tClick to expand...Refresh replaces one task only - you refresh the specific task you do not want to do. [BR]No extra tasks when you complete all the daily or weekly ones, until the next day or week."}, {"80": "TomatoeHu said:\t\t\tRefreshing will give One New Task only?[BR]Or all remaining get refreshed?[BR]And if you have completed all of the weekly tasks, does it give new, extra ones?[BR][BR][BR]This is very important to clarify please, Inno. Is this Sunday to Saturday week? Monday to Sunday or Thursday to Wednesday thing.... this should definitely be worded somewhere.\t\tClick to expand...Hi @TomatoeHu![BR]About refreshing:[BR]- yes, it replaces 1 quest per refresh[BR]About \"weekly\":[BR]- I've asked for a clarification and I'll let you all know as soon as I get informed [smilie--sprite1]"}, {"18": "TomatoeHu said:\t\t\tThis is very important to clarify please, Inno. Is this Sunday to Saturday week? Monday to Sunday or Thursday to Wednesday thing.... this should definitely be worded somewhere.\t\tClick to expand...There is a countdown timer on the weekly tasks that currently says I will get new ones in 5d 16h. So that is a Thursday to Wednesday week."}, {"80": "Oh my, thanks a lot @owl76, I totally miss that timer!"}, {"28": "Konys said:\t\t\tOh my, thanks a lot @owl76, I totally miss that timer!\t\tClick to expand...me too o/[BR]my theory is that i'm not blind it was enabled later, it's so obvious now. hmmm! yeah, i like that theory ;9"}, {"29": "[IMG]https://i.ibb.co/WWm8k3h/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-08-101326-png-10574.png[/IMG][BR][BR]The Timer tomorrow was at 10H15 o clock: 6d 14h so the weekly quests are to thursday to wednesday..."}, {"55": "tradescantia said:\t\t\tWill the quests be (or are they) modified for chapter level ? For example I have a \"collect seeds\" quest which of course would be impossible for anyone before Halflings.\t\tClick to expand...Yes, the selection of quests is influenced by the chapter level"}, {"130": "tradescantia said:\t\t\tThe removable of cyclable quests will be hard on some smaller players. The more savvy of those in very early chapters make heavy use of them to help with gold and supplies.[BR][BR]For those in the chapters where those quests lose their usefulness, it's a fun addition.\t\tClick to expand...[BR]I disagree. Here on Beta I am a small player and have had no problems completing the quests. In the live worlds I am in Chapter 17 so maybe I am used to the game more than a real new player. It is really up to the player. I cannot wait for this to come to the live worlds"}, {"59": "Some of these rewards make absolutely no sense in \"pay to get\" pass, like Manta or Pond of Autumn.[BR][BR]I would expect super strong booster-buildings or dailies like Tower of the Winter King to pay 2500.[BR][BR]Actually useful buildings like dailies that produce units are \"pay to get\" every 2 levels at some points, and in between are absolutely-trash buildings like Fairy Inn.[BR][BR]I would give at least KP instants  at \"premium levels\" for f2p players, these holes in rewards every 2 levels if you don't pay, are not looking very good.[BR][BR]Also: Final Reward should be worth effort, Somnial Pool is a little bit stronger than regular \"Burning Pool\" but \"Mana Hut\" beats it in mana comparison. This would be perfect occasion to introduce \"smaller in size\" evolving buildings with like 5 levels (FOE-like) and artifact every 10 levels of the season, but well, someone didn't think (again)."}, {"16": "Karvest said:\t\t\tsome math:[BR]to get last prize you need 4775 petals[BR]completing all daily quests gives you 6000 petals[BR]completing all weekly quests gives you 3080 petals[BR]so you can skip almost half of the quests and still get the last prize.\t\tClick to expand...idk where I got 6000 petals from daily quests (some formula copy-paste magic), actually dailies give way less:[BR][BR]to get last prize you need 4885 petals (yes, error here too, accidentally counted 1st checkpoint as 45 petals, but not counted last 155 one).[BR]completing all daily quests gives you 1500 petals[BR]completing all weekly quests gives you 3080 petals[BR]so even if you complete all quests and buy season pass that gives you additional 150 petals (4730 total), you won't be able to get last reward."}, {"33": "Vaeri said:\t\t\tAshen Phoenix bonus doesn't apply to Season Petals. Also, thank you for bringing the MA quest to our attention.[BR]We will apply changes so that the quest won't appear for players without a Magic Academy.\t\tClick to expand...Ok, I see it has not been changed yet...[BR][IMG]https://i.ibb.co/s5kZh9X/https-beta-forum-elvenar-com-index-php-attachments-1670608265415-png-10582.png[/IMG]"}]