[{"131": "Willie B. Gone said:\t\t\t?? #3 is locked ??\t\tClick to expand...Why does inno insist on making things more complicated? Every time they release a new style of event they cause confusion by changing how things work.  We have never had rewards locked out of the list of available regular rewards and made into pay to play rewards with diamonds.  It is not clear on screen this is a pay to play reward.  It is not $ but diamonds.[BR][BR]Does anyone know if you decide late in the 75 days to pay 2500 diamonds if you can get all season rewards even if you decide on the premium package later on? And if so does it go back and automatically get all these premium rewards or you have to scroll through and select each one?  [BR][BR]as Usual the lack of instructions is frustrating to say the least."}, {"12": "tpasewing said:\t\t\tWhy does inno insist on making things more complicated? Every time they release a new style of event they cause confusion by changing how things work.  We have never had rewards locked out of the list of available regular rewards and made into pay to play rewards with diamonds.  It is not clear on screen this is a pay to play reward.  It is not $ but diamonds.[BR][BR]Does anyone know if you decide late in the 75 days to pay 2500 diamonds if you can get all season rewards even if you decide on the premium package later on? And if so does it go back and automatically get all these premium rewards or you have to scroll through and select each one? [BR][BR]as Usual the lack of instructions is frustrating to say the least.\t\tClick to expand...If you decide to pay the 2500 diamonds, you'll have to go back and pick them all up one by one... if you missed any, you might get them automatically at the end of the season.[BR][BR]The premium prizes are actually pretty obvious, they all have the premium symbol above them (looks like a hat) so if hat = 2500 diamonds pass price"}, {"87": "[IMG]https://i.ibb.co/fnPsf1N/https-beta-forum-elvenar-com-index-php-attachments-1670623889775-png-10588.png[/IMG]"}, {"127": "How about some pet food in the rewards please?"}, {"33": "And Spectral Stone, please?"}, {"12": "guivou said:\t\t\tsome weekly quest need to use 5 coin rain ... never used one (except during adventure) , only have to trade gold in excess with wholesaler , but it's possible to refresh this weekly quest[BR]but more anoying for daily quest , should be kp in any wonder for those who have no wonder  or no avaliable (under construction)  , and also as it is, it's not possible to use kp from perk[BR]View attachment 10571Click to expand...The problem I have with this quest is, that it says \"Invest KP in one of your Ancient Wonders\" it should be \"Invest KP in one Ancient Wonder\" [BR]I have all my Wonders full, outside of beta there are many players who also have all Wonders full and cannot solve these tasks, even if there are only 5 petals for it."}, {"5": "Jammin said:\t\t\tThe problem I have with this quest is, that it says \"Invest KP in one of your Ancient Wonders\" it should be \"Invest KP in one Ancient Wonder\"[BR]I have all my Wonders full, outside of beta there are many players who also have all Wonders full and cannot solve these tasks, even if there are only 5 petals for it.\t\tClick to expand...[BR]Build a new Wonder at level 1. Stick 5 KP into it, then sell it. Everyone has plenty of Wonders with full rune shards that they never planned on building."}, {"12": "Yes I could do that but it sounds like unnecessary effort and waste for 5 petals.[BR]That's not the point I'm getting at either, what should the players do who have already leveled up all wonders? [BR]Delete and rebuild a lvl 35 wonder to solve these tasks?"}, {"10": "I'm really frustrated by Inno's rigid response to bugs that disadvantage players. Their firm \"we don't reimburse for losses on beta\" lacks nuance. [BR]I got that stupid 'complete a winter event quest' on the first day and couldn't complete it and now I'm permanently disadvantaged by 5 petals. Tough says Inno. [BR][BR]The purpose of beta is to test new features, I get it. I know I'm going to experience issues - I went for weeks and weeks with no access to neighbours on my map but there's a clear difference between being reimbursed for losses and actually fixing a bug that leaves players permanently disadvantaged."}, {"45": "mythandry said:\t\t\tI went for weeks and weeks with no access to neighbours\t\tClick to expand...mythandry said:\t\t\tthere's a clear difference between being reimbursed for losses and actually fixing a bug that leaves players permanently disadvantaged.\t\tClick to expand...I understand it must have been frustrating... but truely? Was it really \"weeks and weeks\"... and \"permanently disadvantaged\"?[BR]mythandry said:\t\t\tThe purpose of beta is to test new features, I get it. I know I'm going to experience issues\t\tClick to expand...You claim you 'get it', but you also expect compensation when you experience issues. Maybe beta isn't 'your thing' ...?"}, {"28": "ok, so this is something that you can (almost) get done when you just go about business that usual.[BR][BR]however as some have pointed out i don't really see it being as usefull in early game as the second guestgiver thereby making it work against their claim of trying to make the early game more fluent (or whatever the expression used was). unless ofc you think that instead of wading in the swamp crawling in there is more streamlined (and fun).[BR][BR]also the prizes aren't that special, which should be expected as the effort isn't either. but wait, if there should be any building or such you might find usefull there's \"the tag\" - you get access to those for bargain prize of 2500 dias.[BR][BR]so is it just me who sees this as seemingly neverending, lame event with old buildings which you actually have to buy.[BR]...and i look in amazement when people go whopee, can't wait this go live."}, {"132": "Vaeri said:\t\t\tWe just added information to the announcement, since it is important to clarify that the change is indeed intended:\t\tClick to expand...[BR]Vaeri said:\t\t\tAs part of the Seasons update, we are replacing the system of repeatable quests. [BR][BR]We believe that by moving this system into the Seasons, we can provide more interesting quest tasks, with more meaningful rewards. Any repeatable quests that are still active can be completed and rewards will be granted, but with the beginning of the Season of Dreams, no new ones will be started anymore. (...)\t\tClick to expand...[BR]I am not happy at all about  the removal of the repeatable quests. It’s not at all moved into the dreams imo. In the dreams the number of quests is limited to 4 a day and 4 a week. There is no choice in the daily quests / rewards, you have to do them all. Maybe an improvement for players in later chapters, but definitely  a setback for players of the earlier and mid chapters because they miss out on a lot of possible additional resources."}, {"18": "Heffernan said:\t\t\thowever as some have pointed out i don't really see it being as usefull in early game as the second guestgiver thereby making it work against their claim of trying to make the early game more fluent (or whatever the expression used was). unless ofc you think that instead of wading in the swamp crawling in there is more streamlined (and fun).\t\tClick to expand...I have a chapter 3 city and the most useful item I am getting from this is troops that I cannot currently train, such as the Faineant Frog and Orc Warrior."}, {"133": "i like it, it is interesting and way more better than old quest system [smilie--sprite1] but... you shd offer something better to lure me spend my precious diamonds[smilie--sprite7]"}, {"134": "Bad change! They traded simple missions, which yielded money and supplies, for nothing. We have to do 4 missions to get a 10 minute boost... Only those who spend diamonds win buildings... Horrible!"}, {"87": "in fact for small cities old system was better , for big cities that have no used of cycling quest , a small gain is better than nothing"}, {"121": "I like it, quests are doable and you get free stuff,  i am always up for anything that will give me sentient goods without having to spend seeds for it.   I like this much better than cauldron"}, {"12": "Heffernan said:\t\t\t...and i look in amazement when people go whopee, can't wait this go live.\t\tClick to expand...I think I was the only one who wrote this so far, well I'm quite happy with the season, because I get troop blessings for doing next to nothing and regularly for all eternity.[BR][BR]As for the premium pass, I don't really need it, especially when it costs 2500 diamonds.[BR][BR]If you expect more, then that is your right, feel free to make suggestions for improvement, but remember that you will certainly not be showered with gifts by solving simple tasks, whereas in the cauldron you have to waste your resources to get a meaningless effect ... you see this is out of proportion.[BR][BR]So let's be realistic."}, {"58": "To me, this seems like something that will eventually get ignored for the most part, as time goes on (sure, it's a little fun to try out at first...I'm already bored with it, myself), just as the old side quests were ignored by folks who didn't need supplies/coins as they progressed. [BR][BR]Except in this case with the new \"Seasons of Dreams\", it is yet another new frustrating feature where buildings are offered for diamonds (these buildings seems completely randomly chosen by the development team...why not let us decide what we'd like to pay for, eh?)[BR]... and the grand chest is also another frustration with the RNG...maybe you can win a 20% coin rain but then again, maybe you can win a whopping 10 minute time reducer for breaking those four locks, and working hard to complete those daily quests. [BR]No, thank you. [BR]**The old side quests were becoming important to use again during Fellowship Adventures, since the devs decided to increase the Sack of Coin badge requirements. Now, let's hope we get lucky with those RNG's and gain some, somewhere with all these new features!![smilie--sprite11][BR][BR]It would be nice to keep giving early chapter players the ability to gain coins/supplies with side quests. [BR]Put the Seasons bar to the right of our avatars and let the side quests resume. [BR]No need to take away something that was needed for beginners. [BR][BR]>>It's another no, thank you, from me<<"}, {"10": "Dorfl the Clay said:\t\t\tI understand it must have been frustrating... but truely? Was it really \"weeks and weeks\"... and \"permanently disadvantaged\"?[BR][BR]You claim you 'get it', but you also expect compensation when you experience issues. Maybe beta isn't 'your thing' ...?\t\tClick to expand...Yes, it was really weeks and weeks. When the map bug first appeared I checked the forum here and saw it had been reported. I checked back a couple of times for an update on a fix but nothing. I went thru a FA without access to my neighbours. When a fix was available there was no notification straight away. I eventually saw a notice about contacting support to have the patch applied to my city. [BR][BR]I don't expect compensation when things go wrong and have played beta cities (other than my current ones) for years. My comment was not to advocate for compensation but rather the lack of nuance that prevents permanent disadvantage. [BR][BR]I am, and will always be, 5 petals behind other cities who didn't get that quest. Its not like the balance resets each week. It's not a huge deal, just tiresome."}]