[{"16": "Got another possibly \"undoable\" quest today - negotiate in spire. But there is a good chance that spire is already done (In our FS there was already a player on the top at the moment of daily quest reset). Is the system smart enough to check if player can actually do the quest when tossing them up?"}, {"32": "While I find this \"event\" sort of amusing I can't stop thinking how useless is for players in first chapters. Yesterday I got a 10 min. instant ... now tell me how this instant is useful for little cities which are dying for extra coins and tools!?!?! I remember how I endlessly cycled those quests to get tools and coins. I got plenty of good trades from my fellows but nobody could actually help with coins and especially tools."}, {"72": "Karvest said:\t\t\tGot another possibly \"undoable\" quest today - negotiate in spire.\t\tClick to expand...I would hate having to negotiate spire in my chapter 19 city. I don't want to spend a lot a decaying resources when I can easily fight [smilie--sprite3]"}, {"9": "For me (ch20, lots of wonder levels & expansions), negotiating in Spire would mean: Not enough mana & seeds in the 3rd floor to negotiate."}, {"50": "For chapter 2 players it is not possible to gain combining Catalyst as this research is available in chapter 3 and the spire too.[BR]Either the quests are worked over or there should be added a refresh button too for unsolvable quests.[BR][BR][IMG]https://i.ibb.co/JpqdsYX/https-beta-forum-elvenar-com-index-php-attachments-combining-catalyst-jpg-10602.jpg[/IMG]"}, {"89": "\"Check back again next week for more weekly missions\". But when do they reappear? all blocked, only the daily ones have reappeared.... Updateleft doesn't work .[BR][BR][BR][IMG]https://i.ibb.co/ZBBwkTj/https-beta-forum-elvenar-com-index-php-attachments-1670853315966-png-10604.png[/IMG]"}, {"16": "58:16 till new quests on your screenshot"}, {"45": "graziame said:\t\t\t\"Check back again next week for more weekly missions\". But when do they reappear?\t\tClick to expand...Apparantly a week has 7 days and doesn't necesserally coincid with a calenderweek..."}, {"60": "bkbajb said:\t\t\tI disagree. Here on Beta I am a small player and have had no problems completing the quests. In the live worlds I am in Chapter 17 so maybe I am used to the game more than a real new player. It is really up to the player. I cannot wait for this to come to the live worlds\t\tClick to expand...I didn't say they'd have trouble completing the new quests. My point was that many smaller players make strategic use of the old, cycling quests to help with growth (for example I have one such player in my H world FS) and that they would miss that opportunity. Winning a 15 minute time boost does not replace thousands worth of gold and supplies several times a day."}, {"135": "When the changes were made for chapters 1-5 the old cycling quests were discontinued. The updated quests instead explain/ have you explore the various features of the game.  Anyone who's gotten the new tech tree since at least this fall (I started a live city with the new tech tree at the end of August) won't be missing the quests you are referring to because those quests never existed for them."}, {"9": "Yeah, today i got the Spire daily quest.[BR]My Spire is - of course - cleared.[BR]But since i have completed all dailies twice and got 10min instant twice, i simply don't care. So most of the time i will simply not bother to finish all dailies.[BR]Could we also get refresh button for dailies like we have for weekly quests?"}, {"71": "I like the Season of Dreams, much better than the Cauldron. I like the rewards. My weekly refresh didn't seem to be working. and now my Season tab has disappeared. ???"}, {"45": "meira said:\t\t\tMy weekly refresh didn't seem to be working. and now my Season tab has disappeared. ???\t\tClick to expand...Sounds a bit like the bug already reported by @Trinculo.. see his bug report at:[BR][BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/42728-daily-reward-chest-open-despite-no-daily-quest-done-for-today.18194/\t\t[BR]... and add your findings, that way the moderators get all the info available, which will help solving the issue!"}, {"2": "I have already gotten bored with this and stopped looking at it.  It's like being stuck in an endless quest cycle with no time off whatsoever.  I do not use spells every day, nor the Wholesaler. [smilie--sprite9] [BR][BR]This whole gimmick makes me feel like I have been pigeonholed into a play style that doesn't suit me at all.   I have no intention of wasting my city resources on this feature.[BR][BR]We need more control over the quests,  these should be grouped into categories where we can select a type."}, {"60": "Honu nani said:\t\t\tWhen the changes were made for chapters 1-5 the old cycling quests were discontinued. The updated quests instead explain/ have you explore the various features of the game.  Anyone who's gotten the new tech tree since at least this fall (I started a live city with the new tech tree at the end of August) won't be missing the quests you are referring to because those quests never existed for them.\t\tClick to expand...But that applies only to brand new players. Those who have an account and start a new small city in another world do not get the new research tree. Existing players who started their cities before the new tree came in will definitely be affected."}, {"51": "To me this is a net decrease in the amount of rewards that any player can pursue, I used the cycling quests every day to rebuild my coin and supplies after I finished playing the spire. There were 3 quests that helped me there -1) collect 16000 supplies,2) collect 6 advanced tools and 3) collect 2 advanced tools and 200000 coins. With  the amount of visitors that I had I could easily clear 500000 coin and 50000 supplies each and every day. I also used 3 other cycling quests when I was completing provinces - 1) solve 4 encounters, 2) complete a province and 3)  gain 4 relics. Today I set out to pick up 5 expansions in my city - and while it went a lot quicker without having all of the incessant clicking - I did not get any of the rewards that would have been available with the cycling quests. Now with those rewards I usually bought goods from the trader but now it is going to take longer to accrue the inventory that I am trying to build.[BR]Now under the new system that we have we get 4 weekly quests ?? Those I finished the first day - so now I must wait till the next ones come out. And the daily quests are  joke - one tells me to use a spell and another to disenchant one - seems like there is no cohesiveness in them - they certainly are not helping me to \" build\" a city, rather they seem to be just random ideas that somebody has designed to strip the individual incentives from the game."}, {"136": "For me the weekly timer reset but did not get any new weekly quests. This happen for anyone else?"}, {"5": "Scuttlebutt said:\t\t\tFor me the weekly timer reset but did not get any new weekly quests. This happen for anyone else?\t\tClick to expand...[BR]The weekly quests are not supposed to reset for another 20 hours."}, {"28": "Scuttlebutt said:\t\t\tFor me the weekly timer reset but did not get any new weekly quests. This happen for anyone else?\t\tClick to expand...just checked… more weekly quests in 7 days 19 hrs, but no new quests appearing after the first set."}, {"51": "no new quests here at all -but it shows 7  days AND 19 hours?"}]