[{"58": "Scuttlebutt said:\t\t\tFor me the weekly timer reset but did not get any new weekly quests. This happen for anyone else?\t\tClick to expand...@Scuttlebutt  You should make a Bug Report so that you get the diamonds credit for reporting it here first. [smilie--sprite2]"}, {"62": "CiraKelley said:@Scuttlebutt  You should make a Bug Report so that you get the diamonds credit for reporting it here first. [smilie--sprite2]Click to expand...yeah its a bug clearly , same problem here"}, {"3": "Also New (weekly) requests in 7 days 14 hours.[BR]On Android. Seems to be common problem."}, {"62": "seems its fixed now with the update  , says 14 hrs 16 min now"}, {"29": "13H 46 at this moment for me ... you must have a problem...[BR][BR][IMG]https://i.ibb.co/y8XcQbf/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-14-111322-png-10614.png[/IMG]"}, {"57": "This issue was indeed fixed with this morning's update"}, {"33": "Lovec Krys said:\t\t\tCould we also get refresh button for dailies like we have for weekly quests?\t\tClick to expand...1-2 daily refreshes would reduce the impact of bad luck quests on beginners, and all players also...[BR]Ideally, Devs should review the Daily quests for all chapters and check feasibility, but with at least 1 daily refresh, if someone has bad luck, they could take a snapshot to report the bug and reroll hoping for something better (bad luck happens , but it would be better than 0% to reroll...)[BR][BR]EDIT: minor corrections"}, {"50": "Is it correct, that unfinished weekly quests are taken to the next week?"}, {"80": "Yes, it is @Koboldina; if you click on the \"i\" you'll see this message:[BR][BR][IMG]https://i.ibb.co/c8rQXy0/https-i-imgur-com-V1-Xe6n-X-png.png[/IMG]"}, {"97": "I don't yet make Unurium except by trader, and my daily asks for it - i would have to switch my trader to making it first and still wouldn't make it in time for the daily quest. And should i choose to not make it during chapter 17, it would then disrupt my advancements needing seeds if switching between the two. Not an ideal chapter 17 Daily Quest and no refresh option to bump it.[IMG]https://i.ibb.co/0nMW4Cb/https-beta-forum-elvenar-com-index-php-attachments-unurium-daily-png-10654.png[/IMG][IMG]https://i.ibb.co/tZ1b6rw/https-beta-forum-elvenar-com-index-php-attachments-unurium-daily2-png-10655.png[/IMG]"}, {"16": "there is early collect with collection bonus after 3h, no need to wait for 24h."}, {"132": "Alcaro said:\t\t\tWhile I find this \"event\" sort of amusing I can't stop thinking how useless is for players in first chapters. Yesterday I got a 10 min. instant ... now tell me how this instant is useful for little cities which are dying for extra coins and tools!?!?! I remember how I endlessly cycled those quests to get tools and coins. I got plenty of good trades from my fellows but nobody could actually help with coins and especially tools.\t\tClick to expand...It is a useless event. I get 10 minutes booster almost every day instead of unlimited  changeable quests for additional resources. And costs loads of resources. Much more than you get back in the silly rewards.  I really miss the quests. Please put them back and take these broken dreams somewhere else."}, {"2": "Agreed.   When are the terrible weekly quests going to clear,  never?"}, {"29": "[IMG]https://i.ibb.co/r3PbV4J/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-16-192835-png-10666.png[/IMG]"}, {"5": "Wow, I have a daily quest today to make two Fellowship Adventure badges. Good thing I am both in a fellowship and participating in the adventure."}, {"58": "Lelanya said:\t\t\tAgreed.   When are the terrible weekly quests going to clear,  never?\t\tClick to expand...That's a good question. What happens after the 75 days are over? Does it go right into another 75 days of seasonal daily/weekly quests?"}, {"97": "Karvest said:\t\t\tthere is early collect with collection bonus after 3h, no need to wait for 24h.\t\tClick to expand...I wont be back online in time due to my time zone."}, {"113": "I can not open my daily quest chest, after finishing all 4 Quest of course. Got it when the time is up for the Day next log in. Is this reported yet?"}, {"137": "Prueba2 said:\t\t\t1-2 daily refreshes would reduce the impact of bad luck quests on beginners, and all players also...[BR]Ideally, Devs should review the Daily quests for all chapters and check feasibility, but with at least 1 daily refresh, if someone has bad luck, they could take a snapshot to report the bug and reroll hoping for something better (bad luck happens , but it would be better than 0% to reroll...)[BR][BR]EDIT: minor corrections\t\tClick to expand...How does the refresh work?  It is not clickable for me, even tho it says I have 2.   (chrome on macos, latest version both)[BR]Is this only if you haven't completed any quests for that day?  [BR]-signed, confused (more because the cauldron is confusing af)"}, {"113": "Elle said:\t\t\tHow does the refresh work?  It is not clickable for me, even tho it says I have 2.   (chrome on macos, latest version both)[BR]Is this only if you haven't completed any quests for that day?  [BR]-signed, confused (more because the cauldron is confusing af)\t\tClick to expand...[BR]You can refresh 2 weekly quests. Not all quests. You can click in the weekly Quest on the small circle arrow. I have complete this week, so cannt make print screen at the moment..."}]