[{"18": "See the circled refreshes on the individual tasks in the image https://beta.forum.elvenar.com/index.php?threads/season-of-dreams.18174/page-2#post-110946[BR][BR]Based on several people being confused by this, I do wonder if it would make sense to remove the refresh icon by the number of refreshes information."}, {"5": "Alright, I have a complaint about another daily quest in today's batch. It is asking for Ascended goods production, but I am only in chapter 18, so needing to complete the first Ascended research and build an Ascended goods factory. Every other place in the game that asks for a new resource, orcs, mana, seeds, and so on, do not ask for them until the chapter after they are unlocked, so this needs to be fixed to not show up as a daily quest until a player is in chapter 19+. @Vaeri or @Konys or @Kersepitje does this need a bug report or screenshots or anything or is this enough for you to pass on to the devs to be fixed? I also hope this Season stuff gives more points than are needed to get to the end of the prize path or it will be very, very disappointing to get to the end and be 5 points short of getting the final prize because of this bad quest."}, {"57": "Enevhar Aldarion said:\t\t\tAlright, I have a complaint about another daily quest in today's batch. It is asking for Ascended goods production, but I am only in chapter 18, so needing to complete the first Ascended research and build an Ascended goods factory.\t\tClick to expand...Thanks @Enevhar Aldarion - we're currently compiling a list of such 'difficult or impossible to complete' daily quests, and will add this to it!"}, {"13": "@Amy Steele[BR]Well... (I lost myself, I don't know if it's already in the difficult/impossible list) another one daily quest in the list should be the one asking for trading one time in spire. I don't think there's the need to explain why it should not.  [smilie--sprite1]"}, {"57": "Thanks @Uffauffa (and everyone else!) for your feedback on these 'impossible to fulfil' daily quests in this thread. We have compiled a list and will forward it to the development team for their attention. Of course we will also add any further such quests as you inform us of them!"}, {"55": "Thank you very much for your feedback, everyone! The team will make an effort to improve the conditions of many Season quests in order to ensure that players will always be able to complete the quests they receive daily/weekly."}, {"126": "Has something changed when picking up the daily prices?[BR]Or has an error crept in?[BR][BR]After completing the daily task, I can no longer manually collect the prize from the chest.[BR][BR]The \"claim\" button is no longer displayed.[BR]I get the daily price automatically, booked by the system, the next day.[BR][BR][IMG]https://i.ibb.co/5x0kc5b/https-beta-forum-elvenar-com-index-php-attachments-1671472215790-png-10680.png[/IMG][BR][BR][IMG]https://i.ibb.co/Sfq0NsJ/https-beta-forum-elvenar-com-index-php-attachments-1671472256291-jpeg-10681.jpg[/IMG]"}, {"132": "N0RDIC said:\t\t\tAfter completing the daily task, I can no longer manually collect the prize from the chest.[BR][BR]The \"claim\" button is no longer displayed.[BR]I get the daily price automatically, booked by the system, the next day.\t\tClick to expand...[BR]Similar experience. I did not see the reward or the reward button after completing the daily quests and have no way of knowing if I even got a reward."}, {"87": "on monday , as daily quest , to get relics is not the easiest (but doable with magic academy for ex )"}, {"126": "fixie said:\t\t\tSimilar experience. I did not see the reward or the reward button after completing the daily quests and have no way of knowing if I even got a reward.\t\tClick to expand...[BR][BR]Click the bell below your profile picture.[BR]In the Neighborhood Helplist there should be a message (Mentor Tanavar) from the system that you opened a chest.[BR][BR]The message appears when you log in, for the first time the next day."}, {"57": "N0RDIC said:\t\t\tHas something changed when picking up the daily prices?[BR]Or has an error crept in?[BR][BR]After completing the daily task, I can no longer manually collect the prize from the chest.[BR][BR]The \"claim\" button is no longer displayed.[BR]I get the daily price automatically, booked by the system, the next day.[BR][BR]View attachment 10680[BR][BR]View attachment 10681Click to expand...[BR]fixie said:\t\t\tSimilar experience. I did not see the reward or the reward button after completing the daily quests and have no way of knowing if I even got a reward.\t\tClick to expand...[BR]@N0RDIC @fixie sounds like the bug reported here https://beta.forum.elvenar.com/inde...-despite-no-daily-quest-done-for-today.18194/"}, {"30": "Spire already completed - NO chance to solve this quest[smilie--sprite4][BR][BR][IMG]https://i.ibb.co/HV18Ctk/https-beta-forum-elvenar-com-index-php-attachments-1671520939971-png-10685.png[/IMG][BR]From Announcement:[BR][BR]The quests of the Seasons can be completed as part of your daily routine of playing the game, over the passing of several events![BR]This means that the Season enables you to gain a lot of rewards by simply playing Elvenar regularly[BR][BR][smilie--sprite3]"}, {"30": "Issue solved by Support Team, thanks"}, {"11": "I'm not happy with this quest:[BR][IMG]https://i.ibb.co/DbHbF6q/https-beta-forum-elvenar-com-index-php-attachments-1671539905539-png-10688.png[/IMG][BR][BR]I completed the Spire already some days ago"}, {"132": "Amy Steele said:@N0RDIC @fixie sounds like the bug reported here https://beta.forum.elvenar.com/inde...-despite-no-daily-quest-done-for-today.18194/Click to expand...Hi, I read the bug report. I saw the notice that I opened the chest and that the reward was added to my inventory the next time I logged in. Does not say what the reward was. How do I know what that reward was? In the earlier version the reward was shown on screen after finishing the last quest."}, {"57": "Droopy said:\t\t\tI'm not happy with this quest:[BR]View attachment 10688[BR][BR]I completed the Spire already some days ago\t\tClick to expand...Hi @Droopy if you did not do so already please submit a ticket to our support team who will be able to help you"}, {"57": "fixie said:\t\t\tI saw the notice that I opened the chest and that the reward was added to my inventory the next time I logged in. Does not say what the reward was. How do I know what that reward was?\t\tClick to expand...Please submit a ticket to our support team. They will be able to advise you which reward you received. You can do this from within the game by clicking in the cog icon at the lower right of your city screen, choosing 'help' and then 'support', or there is a link on the main index page of this forum"}, {"11": "Amy Steele said:\t\t\tHi @Droopy if you did not do so already please submit a ticket to our support team who will be able to help you\t\tClick to expand...I didn't, but i'll do now. Thank you."}, {"43": "I always swap KP with other in my FS.[BR]Then I do not like when I need to give my own AW KP ;-([BR]just now all my AW is in Rune level."}, {"33": "Vaeri said:\t\t\tAfter reaching waypoint 50 of the Season Pass, you can expect additional rewards, apart from the Somnial Pit!\t\tClick to expand...Any insights?"}]