[{"85": "I got a weekly quest “Use 2 portal profits”. It does not make any sense to me because I’m at the end of a chapter and don’t need any guest race resources. Using portal profits at this stage would be a complete waste."}, {"132": "I got a daily quest to produce 500 orcs. I have not unlocked this in my armories or training grounds.  I get them as a price sometimes. So I can not complete the quests today."}, {"57": "Hi @fixie please send a ticket to our support team who will be able to help you with this impossible quest"}, {"83": "Alcaro said:\t\t\tWhile I find this \"event\" sort of amusing I can't stop thinking how useless is for players in first chapters. Yesterday I got a 10 min. instant ... now tell me how this instant is useful for little cities which are dying for extra coins and tools!?!?! I remember how I endlessly cycled those quests to get tools and coins. I got plenty of good trades from my fellows but nobody could actually help with coins and especially tools.\t\tClick to expand...it's my third 10 min instant so far. I got a 15 min one, some days ago. [BR]if we knew in advance the daily price to be earned, I think we wouldn't bother most of the time. [BR]Is there a list of daily prices to be won or has someone made one ?"}, {"16": "you can see the list in tooltip when hovering mouse over daily chest."}, {"132": "Karvest said:\t\t\tyou can see the list in tooltip when hovering mouse over daily chest.\t\tClick to expand...No tooltip with a pricelist if you hover over the chest in the mobile app! There is also no way to see what dailyprice you got in the app. In the browserversion you can only see a list with the chance % for the different rewards if you hover. According to this list the quests cost alway  more than you gain by these rewards as far as I can see."}, {"90": "So far I \"won\" quite a few 10min instants and a 15min instant and then suddenly orcs.  Unfortunately today's quest I cannot do as it asks advanced tools and groceries while I\"m busy making toolboxes for the FA and its going to reset long before I can do these quests so no reward as the daily cannot be reset [smilie--sprite3]  Other than the disappearance of the season of dreams a few times, I've not had an impossible quest yet. I'm on holiday currently so the daily quests work out well for me but when I'm at work I wont be able to do both advance and groceries so many times within the period as I only have a 3 to 5 hour window to play in the evening between 5pm and 11pm.   [BR][BR]Also why do we get 70 petals per quest - weekly - which translates to 280 and 5 petals so 20 for the daily but we only get a few points e.g. 5 half petals? as a reward?  Will that 20 or 280 petals eventually give us access to the season pass?  I dont buy diamonds so my only source is the spire and MA."}, {"138": "I really like it[smilie--sprite1]"}, {"55": "Egwene al Vere said:\t\t\tSo far I \"won\" quite a few 10min instants and a 15min instant and then suddenly orcs.  Unfortunately today's quest I cannot do as it asks advanced tools and groceries while I\"m busy making toolboxes for the FA and its going to reset long before I can do these quests so no reward as the daily cannot be reset [smilie--sprite3]  Other than the disappearance of the season of dreams a few times, I've not had an impossible quest yet. I'm on holiday currently so the daily quests work out well for me but when I'm at work I wont be able to do both advance and groceries so many times within the period as I only have a 3 to 5 hour window to play in the evening between 5pm and 11pm.  [BR][BR]Also why do we get 70 petals per quest - weekly - which translates to 280 and 5 petals so 20 for the daily but we only get a few points e.g. 5 half petals? as a reward?  Will that 20 or 280 petals eventually give us access to the season pass?  I dont buy diamonds so my only source is the spire and MA.\t\tClick to expand...There is no option to unlock the premium rewards of the Season reward lane with Season Petals.[BR]Instead, the idea is here to collect as many petals as possible over the 75 days of the Season. You can get the Season Pass right at the start, but you may wait when you have collected all petals to reach waypoint 50 and then decide if you want to unlock the Season Pass for the premium rewards. The Seasons are not supposed to be played \"competitively\". They are meant to be an extra for players who like to go after daily and weekly quests, or for people who missed the chance to get certain buildings.[BR]If you're not one of them, just collect the rewards you can get in your daily routine during the Season. Players won't miss anything new (except the level 50 reward)."}, {"90": "unfortunately I have missed some of those buildings due to my studies for exams so would like to have them.  I can see the season is like a replacement of the declinable quests - i liked that - but it also means the way it was set up was meant to make money - understandable but unfair.  So as I see it you miss out on not only reward 50 but also the ones you need the season pass for when you cant afford to buy diamonds."}, {"33": "Ok, just my two cents.[BR][BR]Cyclable quests were boring...[BR]Season seemed a more dynamic and entertainment replacement.[BR][BR]It is not.[BR]It is just an excuse to give lame rewards? and charge with an outrageous amount of diamonds for some mediocre buildings.[BR]Most players have provided their feedback, if Inno believes the feature is ok, let them carry it to Live.[BR]I suppose someone will count at the end of the month the revenue of the \"Season Pass\" and decisions wil be taken accordingly.[BR][BR]Some points that need improvement:[BR]No only-premium rewards milestones, give something to every player.[BR]I agree that premium pass should have better rewards, but that should not mean no rewards for everyone else.[BR]Make it additional.In other games , the premium pass provides premium currency so pushers can recover all or mostly all cost.[BR]You can get a LOT for 2500 diamonds, is ALL that Season Pass offers worth it?[BR]Easier way , put additional premium rewards every 2 milestones, gift small quantities of diamonds as sweeteners.No 100% doable quests inside chapter must be avoided. Period.A daily quest refresh (or two) should mitigate potential issues (Spire, Tournament, ...)[BR]Code should take into account refreshed quest and avoid giving the same quest or same category...For small players, make the prizes relevant for them.[BR]Remember how much tight gold and supplies are at the beggining (*).[BR]One single 5h instant is not relevant, neither some troops.[BR]Some multiple smaller instants and small windfalls are.For big players, make the prizes relevant for them.[BR]One good point is the option of choosing among different rewards (time, wares,...) some time ago some Tome that provided orcs, mana, seeds was given if I remember correctly, that maybe one good way to go.[BR]Make all milestones 2-3 options, with premium being 1 less por regular players.Building rewards. Make them better than regular buildings, if Devs are not excited about it , we will no be either...[BR]Or give just Lava codex, Orcs Nests, Mana Sawmills, Festival Merchants... they are always good and are replaced every chapter.Make it funny, not a cumbersome chore.EDIT: Still writing... Done[BR][BR](*) As Homework, try to start now a trial city, from beginning, to refresh the feeling of scarcity, 2-3 chapters are enough, but a good exercise of self-reflection. If it is HARD for veteran players that know the game , just imagine for new players... and if it is not interesting and entertaining they will not keep playing...[BR]EDIT2: Yes, lucky coincidence, but appropiate pun nonetheless = beginning+begging"}, {"37": "I have created a new page on my website - Seasons.[BR][BR]Some parts of this page are still work in progress, but its content that is intended as the main one is now fully implemented and is available under the Season Pass tab (that can be found within the left bar on the site).[BR]The primary purpose is to show all the available rewards of the Season Pass (including goods (and their exact amounts), instants, units and also buildings with links leading to their respective details pages). At the top of the page you can find the Effort calculator. This is supposed to show you how much effort you need to put into the season in order to receive the final Season prize (50th).[BR][BR]Your input is required, so that the website holds correct data to calculate with:[BR]Select your server (live or beta - they only differ in start dates and end dates, but this is an important aspects in the calculation process)Mark as \"Finished\" all the rewards you have received so farInsert amount of petals you have obtained since unlocking your last reward (using the text box displayed under your first \"Unfinished\" reward)Select how many weekly quests are currently waiting in your queueCheck if you have already completed today's daily quests and/or current weekly questsAfter setting your data properly, you will see the remaining petals for completing the Season Pass, as well as how many of the remaining Daily Quests you can miss in order to still receive the final prize. In case you have already missed too many Daily Quests, you will see which one is the final prize you can receive.[BR][BR]For live servers the calculator will work as soon as they have the Seasons running.[BR][BR]This is the very first version of this feature so I expect that some bugs or imperfections may appear here and there. I will be most happy if you leave me a private message (either here or using my Contact Page) if you find one.[BR][BR]The advantage is that the most of this content is auto-generated (as always on the website), so it can be easily and quickly adjusted for any future season."}, {"90": "If the season replaced the declinable quests, why are we getting quests such as obtain spell fragments  which are event related and not something you normally would do (according to the video) so adding this quest is a bit cheeky I would think.  Not everyone has items to disenchant nor will necessarily be able to get that amount of spell fragments in spire (if they have even gotten that far) or have the library set for that matter.  [BR][BR]Also for a daily quest in which you dont have the option of a reset button for, I found it sneaky to have a quest like this with no option to choose another possible quest especially since some items' values such as the enchantments have been decreased from 60 to less and is now different per chapter - items which one preferably shouldnt be disenchanting as you need them for events/FA - which some do as a last resort.  [BR][BR]Though this quest may be possible, it is also not possible for some.  In this case I would then assume that Inno would not provide a different quest or even complete the quests automatically (assuming this is how its done) when there would be items in the inventory that could be disenchanted but the person would not want to as they are required for later and may not be an item one would get back very soon."}, {"73": "As for the quests items they want you to collect, I like it that they finally ask you to get event items that you normally would pickup anyway.[BR]Or that they demand from you to do a couple tournament province.[BR]Those are things I asked for some years ago when we still had the circular quests.[BR]The only sad thing is: you need to do 4 quests to get a random prize from the daily chest and that prize is over al a little bit lower as compared to the 4 separate quests prizes you got before.[BR]Now you get some points that can give you a prize as well, but still the total prize you can get for doing all the quests compared to the circular quests we had before, I still feel it to be just a little less to what we had before."}, {"131": "Today I got a weekly quest for using 4 pet food.   I don’t even get 4 pet foods offered a week so this is not sustainable. I know there is a reset possible in weekly quests but how about a realistic amount in the first place.  ."}, {"2": "tpasewing said:\t\t\tToday I got a weekly quest for using 4 pet food.   I don’t even get 4 pet foods offered a week so this is not sustainable. I know there is a reset possible in weekly quests but how about a realistic amount in the first place.  .\t\tClick to expand...Ridiculous!  [BR]I'm going looking for the Q&A re pet food now, as I mentioned in the Ideas and Suggestions just a few days ago.  I am sure we were told that pet food is intentionally rare, and we have to pick the use carefully.   [BR]This is a highly irresponsible quest, can you get a screenshot @tpasewing?"}, {"16": "As far as I understand, despite of being called \"weekly\" you actually can do them longer than a week, as new quests would be added to queue if you won't complete old ones in time. + you have 2 weekly quest rerolls for the quests you ultimately hate."}, {"62": "this weekly quest and any other similar should change to \"anyone\" ancient wonder just like quests similar to events.[BR][BR][IMG]https://i.ibb.co/3zvx1r1/https-beta-forum-elvenar-com-index-php-attachments-1672308485516-png-10712.png[/IMG]"}, {"16": "there is a quest with \"neighbors\" as well. got both of them this week, discarded this one.=)"}, {"132": "Skillpowers said:\t\t\tthis weekly quest and any other similar should change to \"anyone\" ancient wonder just like quests similar to events.[BR][BR]View attachment 10712Click to expand...I agree! I discarded this one. I don’t put KP’s in my own wonders. I exchange them with other players!"}]