[{"9": "I also think that those two quests should be one: Invest KPs into Ancient Wonder (either yours or someone else). That might save some refreshes."}, {"2": "tpasewing said:\t\t\tToday I got a weekly quest for using 4 pet food.   I don’t even get 4 pet foods offered a week so this is not sustainable. I know there is a reset possible in weekly quests but how about a realistic amount in the first place.  .\t\tClick to expand...Aha I found it!  The most recent request was in Mischievous Therapy live live Q&A, 30 minutes 30 seconds in, a fellow of mine actually asked [smilie--sprite11] \"We would love to get more pet food as it's used not only in tournaments but also goods productions bonuses\" ( I make a face because I always wonder why didn't they ask me, I would tell them the answer).  In this case it was Timon, who said: \"We get this request a lot.  Yeah, we are very careful with pet food, that is true.  We think we do give out a decent amount but it is also, we know, one of those spells in the inventory that does not pile up as much as other spells and we are actually very happy with that.  Every time you get pet food you are still happy to get it, right? And this is also something we hold dear.  So and also we like the challenge that you have to really decide when to use pet food you cannot just enchant everything and everyone's happy.   You have to, make smart decisions to make the most out of the pet food you have, and we think that's a nice strategic part of the game.\"[BR]Thiago went on to mention Savory Bites that was offered this past year that makes a bit extra, and is typically also offered during events as well.[BR]\"There is always a steady supply but it will always be limited\", Timon sums up. \"It will never be easy to get it, I will make sure.\" he assured us, with that little smile of his.[BR]Sorry hon"}, {"21": "Lelanya said:\t\t\tYou have to, make smart decisions to make the most out of the pet food you have, and we think that's a nice strategic part of the game.\t\tClick to expand...True! ;-)"}, {"132": "Got a weekly quest “use ‘Coin rain’ 5 times”. I do not need coins at the moment, besides, that is big spending for a small player. Also: I want to keep  them for a rainy day. So I discarded it but I got “use Pet food” 4 times instead. No way that I am going to do that quest.[BR]Can not discard this Pet food quest because I already discarded “putting 50 KP’s in your own wonders”. These quests don’t make sense to me, they are outrages. I really had it with these dreams. I want the changeable quests back. Maybe boring for big players but much more useful for me as a small player."}, {"2": "As I have mentioned, but clearly we are not being heard!!, we need more control over these quests.[BR][BR]It is ridiculous,  we are being forced into an extreme play style if we pay any attention to these quests.[BR][BR]The Seasons is broken, is an utter waste of time and resources,  and needs to be scrapped."}, {"21": "I guess that nobody is forced to do anything, or am I wrong?[BR][BR]I like the Season of Dreams. Solving the quests was quite easy to me until now.[BR][BR][IMG]https://i.ibb.co/6BfXtVx/https-beta-forum-elvenar-com-index-php-attachments-1672407494488-jpeg-10714.jpg[/IMG][BR][BR][IMG]https://i.ibb.co/Gs5MH6c/https-beta-forum-elvenar-com-index-php-attachments-1672407521743-jpeg-10715.jpg[/IMG]"}, {"73": "The \"use pet food 4 times\" would be a week quest so that one would be easy to complete for a lower chapter player.[BR]pet food 1) sunday/monday for the tower[BR]pet food 2) teusday/wednesday for the tournament and tower[BR]pet food 3) thursday for the tournament and tower[BR]pet food 4) friday/saterday for the tournament and tower if needed[BR][BR]it would be a hard quest for a high chapter player with a high level of the D111-a \"Timewarp\" wonder[BR]in my own case on my life server I would start feeding the fire chicken, ash chicken and polar bear and do all the tournament rounds in just 4 hours and in the mean time I run up the tower as well.[BR]So I would have a problem with the use of 1 pet food."}, {"57": "Bor de Wolf 1965 said:\t\t\tThe \"use pet food 4 times\" would be a week quest so that one would be easy to complete for a lower chapter player.\t\tClick to expand...[BR]Bor de Wolf 1965 said:\t\t\tit would be a hard quest for a high chapter player with a high level of the D111-a \"Timewarp\" wonder\t\tClick to expand...[BR]Don't forget, weekly quests don't expire, so a high chapter player could easily complete this one in 4 weeks without wasting any pet food (provided only of course they receive the quest 4 weeks or more before the end of the Season)"}, {"58": "I refuse to use any of my precious pet food inventory for a side weekly quest in something like the Season of Dreams. These side quests do not help my regular game play or progression in the game. It hinders it, in some cases. [BR]I refreshed my option when that particular quest to use 4 pet food came up for me. [BR]I will not be told or pressured to use anything in my town that I am not comfortable with spending... especially to complete some side quest that will eventually lead to a reward later that is less desirable than the pet food I already have. [BR]No, thanks."}, {"14": "Bor de Wolf 1965 said:\t\t\tpet food 1) sunday/monday for the tower[BR]pet food 2) teusday/wednesday for the tournament and tower[BR]pet food 3) thursday for the tournament and tower[BR]pet food 4) friday/saterday for the tournament and tower if needed\t\tClick to expand...Did you forget that with new tech tree newbies can unlock tournament on chapter 4 and spire on chapter 5? And yes, they can use Magic Academy's Crating, that is unlocked... on chapter 3.[BR]These quests are very badly balanced."}, {"48": "We need more pet food - really ?[BR]What do you do with the pet food ?[BR][BR]Sometimes - I use pet food for the goods[BR]Every week - I use pet food for the tournaments[BR][BR]I still have enough of it  [smilie--sprite6][BR]And .... [BR]In my spells  inventory - there are 2 Savory Bites [BR][BR][IMG]https://i.ibb.co/whTB2kw/https-beta-forum-elvenar-com-index-php-attachments-pet-food-jpg-10716.jpg[/IMG]"}, {"16": "I use 6.5 pet foods weekly (2xfire phoenix, 2x twilight phoenix, 2xbrown bear, 0.5 polar bear) and my stash of pet food stays at ~same level."}, {"12": "Admittedly, for new players it can be difficult at first to find out what you need and when... I can only recommend looking for a decent community and asking as many questions as possible in the chat.[BR][BR]Players who already have a Big City and are starting a new one may see things differently.[BR]For example, I can save a lot of important resources for my late game, hundreds of time blessings or hundreds of tournament boosters and Dwarven Armorers.[BR]The ones from Chapter 3 are going to almost 150[BR]For example, there are Evos that produce orcs, Evos that produce mana, there are suitable buildings for each chapter, you don't have to shit your city full of garbage that doesn't yield anything.[BR]You can play very efficiently and also get by with little space, I have 23 unplaced extensions.[BR]When I started in August 2017, I had placed all extensions and still didn't have enough space.[BR][BR][IMG]https://i.ibb.co/VwTYRDj/https-beta-forum-elvenar-com-index-php-attachments-screenshot-45-png-10717.png[/IMG] [IMG]https://i.ibb.co/TcBC7w9/https-beta-forum-elvenar-com-index-php-attachments-screenshot-46-png-10718.png[/IMG] [IMG]https://i.ibb.co/BPqSsGy/https-beta-forum-elvenar-com-index-php-attachments-screenshot-47-png-10719.png[/IMG]"}, {"9": "fixie said:\t\t\tMaybe boring for big players but much more useful for me as a small player.\t\tClick to expand...Many big players don't bother with quest they don't like. They either use the refresh button or wait for next chance to use refresh button. The rewards are not worth to do the extra work required (or use resources which are more worth than the rewards for doing these quests).[BR][BR]Amy Steele said:\t\t\tDon't forget, weekly quests don't expire, so a high chapter player could easily complete this one in 4 weeks without wasting any pet food (provided only of course they receive the quest 4 weeks or more before the end of the Season)\t\tClick to expand...Yes, we can at the expense of losing the 70 petals (doing one quest in 2 weeks instead of 2 quests).[BR]The solution for this is simple - to have infinite number of refreshes (like we had with repeatable quests)."}, {"131": "Lelanya said:\t\t\tRidiculous![BR]I'm going looking for the Q&A re pet food now, as I mentioned in the Ideas and Suggestions just a few days ago.  I am sure we were told that pet food is intentionally rare, and we have to pick the use carefully. [BR]This is a highly irresponsible quest, can you get a screenshot @tpasewing?\t\tClick to expand...[IMG]https://i.ibb.co/hcsDL3y/https-beta-forum-elvenar-com-index-php-attachments-1672497014873-png-10720.png[/IMG]"}, {"131": "Karvest said:\t\t\tAs far as I understand, despite of being called \"weekly\" you actually can do them longer than a week, as new quests would be added to queue if you won't complete old ones in time. + you have 2 weekly quest rerolls for the quests you ultimately hate.\t\tClick to expand...I dont know about you but the rerolls are not working for me .   I click on them and nothing happens.  As far as carrying over quests to the following week or weeks, you still have an unreasonable quest that keeps looming til done if the rerolls are not working"}, {"137": "Unicorn88 said:\t\t\tYou can refresh 2 weekly quests. Not all quests. You can click in the weekly Quest on the small circle arrow. I have complete this week, so cannt make print screen at the moment...\t\tClick to expand...Ah, thank you Unicorn."}, {"52": "Lovec Krys said:\t\t\tYes, we can at the expense of losing the 70 petals (doing one quest in 2 weeks instead of 2 quests).[BR]The solution for this is simple - to have infinite number of refreshes (like we had with repeatable quests).\t\tClick to expand...I don't think you will lose any petals. The weekly quests don't expire at the end of the week. They sit there until completed. I thought they would expire and roll off, too, but no. The new week's quests go into a queue behind the four you can see. Even if you use the refresh option, it doesn't diminish the queued up quests. Only completing a quest causes the next one to roll in from the queue. So, as long as you have a few weeks where you do more than the four quests, you can afford to have some weeks where you don't complete all four without any overall penalty. And you can always see how many are queued up, so you can gauge that against how much time is left in a season."}, {"9": "Yes, you'll lose them.[BR]1st case: During 2 weeks you do all 8 week quests. As a result you'll get 70*8=560 petals.[BR]2nd case: During 2 weeks you do one quest during 2 weeks and other 3 from week one and two = 7 quest for 70*7=490 petals.[BR][BR]In the second case you lost 70 petals for the quest you did during 1st & second week (instead of doing 2 quests in that slot).[BR][BR]Edit: Corrected number of quests per week"}, {"16": "There are only 4 quests/week. No clue about how quests are queued as I have all of them done."}]