[{"1": "Počínaje 26. lednem, budete mít na dlouho v rámci Sezóny snů šanci získat odměny za to, že splníte denní nebo týdenní úkoly! Těšíte se? Napište nám vaše názory a postřehy. [smilie--sprite1]"}, {"142": "Co jsem si přečetl na Wiki, jeví se Sezóna snů jako promyšlená koncepce jak oživit hru - na rozdíl od Kotlíku, který mě zatím neoslovil.[BR][BR]Nákup sezonní vstupenky na 2500 Dia je pěkná částka, zatím nevím, jestli se vzhledem k nabízeným odměnám vyplatí. Sice platí celou sezónu, ale nikde není délka sezóny definovaná - z screenshotů příslušných obrázků lze dovodit, že sezóna minimálně trvá 75 d a 6 h. [smilie--sprite1]"}, {"20": "Sezóna snů se mi na betě líbí, zavedení této novinky je fajn. Určitě se to povedlo lépe než Kotlík, který mi přijde v mnohém nedotažený."}, {"124": "Mám rád eventy a stále se opakující úkoly jsou prostě na prd takže na tuhle novinku se opravdu těším"}, {"16": "Jestli už neodstranili (a já myslím, že neodstranili) různé lahůdkové, zejména denní úkoly, tak z toho podpora bude mít radost.[BR]Například kolegovi na betě už druhý den po sobě vyskočil denní úkol na vyřešení střetu ve věži, který nemůže splnit, jelikož věž už má dokončenou. A takových úkolů tam je více.[BR]Naštěstí odměny za denní úkoly jsou tak nízké, že málokdy se obtěžuji dělat ty, které mi nevyhovují.[BR][BR]Taky vám náhoda může vygenerovat týdenní úkoly připomanjící DS - viz. moje nedávné:[BR][IMG]https://i.ibb.co/ZgXbT4J/https-cz-forum-elvenar-com-index-php-attachments-1674552970673-png-6560.png[/IMG]"}, {"3": "Dotaz: je možné získat hlavní odměnu aniž bys splnil prakticky všechny denní úkoly?"}, {"16": "Je tam nějaká rezerva, ale nevím, jak velká. Sám jsem na stránce odměn 8/10 (cca 75%). Všechny týdenní úkoly splněny(70*4, 2x se dají vyměnit za náhodný jiný), spousta denních (po 5) vynechána. Do konce zbývá 27 dní.[BR]Takže asi na finální odměnu dosáhnu.[BR]Na druhé straně je mi to jedno, jestli tuhle budovu dostanu nebo ne:[BR][IMG]https://i.ibb.co/51tFHR4/https-cz-forum-elvenar-com-index-php-attachments-1674560379352-png-6561.png[/IMG]"}, {"136": "podľa iDavis-a - na poslednu 50 tu odmenu potrebuješ 4200 lístkov(pedals)[BR]to máme 11 týždňov po 4 úlohy 70 lístkov za každú = 3080[BR]75 dní po 4 úlohy po 5 lístkov = 1500[BR]dokopy 4580 , takže máš voľno na 380 lístkov[BR]ak si vezmeme že všetky týždenne splníš tak to máš 19 dní nemusíš splniť ani jednu dennú  ulohu"}, {"24": "Netreba očakávať, že sa sezóna stane nejakým významným zdrojom pre naše mestá, keďže síce obsahuje až 50 jednotlivých odmien, no tie budeme zbierať postupne behom 75tich dní (s postupne spomaľujúcim sa tempom). Niektoré odmeny sú navyše dostupné iba pri zakúpenej sezónnej vstupenke (ktorej cena bude 3000 diamantov namiesto tých 2500, ktoré sú avizované vo videu). Napriek tomu sa avšak z môjho pohľadu jedná o perfektné spestrenie hry, keďže, obzvlášť denné úlohy, nám dávajú dôvod sa dennodenne do hry vracať a zúčastňovať sa malých, interaktívnych úloh zasahujúcich do viac menej všetkých častí hry. Denné úlohy navyše taktiež poskytnú špeciálnu dennú truhlu po tom, čo ich splníme všetky 4.[BR][BR]Týždenné úlohy sú určite jednoduchšie (v prepočte na jeden získaný lupienok) a tak sa zrejme najobmedzujúcejším faktorom stanú práve tie denné úlohy. K tým sa vrátiť späť nedá, a tak je dôležité nezmeškať príliš veľa úloh, inak už nebude možné získať všetky ceny z radu hlavných odmien. Pre toto som pripravil na svojej stránke novú kalkulačku, do ktorej môžete zadať váš aktuálny stav v sezóne a vypočíta vám, koľko denných úloh môžete ešte zmeškať, aby ste získali všetky odmeny. Táto kalkulačka sa aktivuje v deň začiatku sezóny na našom serveri. Okrem toho slúži tiež ako prehľad jednotlivých odmien tejto sezóny."}, {"7": "Embla napsal/a:\t\t\tPočínaje 26. lednem, budete mít na dlouho v rámci Sezóny snů šanci získat odměny za to, že splníte denní nebo týdenní úkoly! Těšíte se? Napište nám vaše názory a postřehy. [smilie--sprite1]Klikněte zde pro zvětšení...Těším!"}, {"6": "V podstatě by mě z cen mohl zajímat jen rejnok. Ale vydat za něj 3000 mantů?"}, {"138": "Uvidím, ale to nucené každodenní hraní je to, proč jsem přestala hrát jinou hru a začala s touhle, protože byla méně svazující..."}, {"16": "Nechť žije soukromé DSko (cz1 i 2):[BR][IMG]https://i.ibb.co/nLBQ2bt/https-cz-forum-elvenar-com-index-php-attachments-1674727768353-png-6563.png[/IMG][BR][IMG]https://i.ibb.co/5RwVr0R/https-cz-forum-elvenar-com-index-php-attachments-1674727966080-png-6564.png[/IMG]"}, {"20": "@Lovec Krys já mám jiné úkoly, takže to asi generuje náhodně. Výhoda je, že když odmítnete poslední úkol ve staré úkolové řadě, tak zmizí obě. Tedy pokud máte dokončené úkoly z minulé kapitoly, jinak zmizí jen jedna. Úkoly nejsou nijak těžké a pokud je někdo nechce plnit, tak nemusí. Takže za mě dobrý."}, {"7": "Jen se ujišťuji: Tyx normální, krásné )koly (co je tady většina nesnášela) zmizí definitivně, nebo se někdy vrátí?"}, {"30": "zdravím, zajímá mě úkol - prozkoumej nové vesnice v čarodějnické události? Nevím, kde. Díky za odpověď"}, {"20": "@Waso To nevím, ale myslím si, že ta druhá nesmyslná řada už nebude. Pravděpodobně až začne nová kapitola, tak zase dostaneme jednu řadu úkolů pro kapitolu. [BR]@abraham musíš popojet na mapě eventu"}, {"20": "@abraham splnit úkol nestačí, musíš popojet na mapě."}, {"30": "díky - už jsem na to došla  [smilie--sprite1] [smilie--sprite1][BR][BR]Odstraněna citace. Embla"}, {"16": "@Ludi Ano, generuje to náhodně. Což znamená, že někteří můžou dostávat pohodové úkoly a jiní těžko splnitelné lahůdky (či v případě denních úkolů i nesplnitelné - viz např. střety ve věži, když máte věž hotovou apod.)[BR][BR]@Waso Sezóny nahrazují právě ty opakovatelné úkoly, takže ty už se nikdy nevrátí. My na ně ani tak nenadávali, spíše jsme je ignorovali. Plnit 15 kapitol staré úkoly má asi takový smysl, jako vyrábět jednotky v 15 kapitol nevylepšovaných kasárnách.[BR][BR]@abraham Takový úkol u mne přesně patří do kategorie \"Neplním\", neboť já si chci utratit měnu události kdy chci já a ne kdy mi to určí nějaký úkol. Denní úkoly na betě neplním celkem běžně, takže očekávám, že to stejné budu dělat i na cz1/2."}]