[{"30": "Lovec Krys napsal/a:\t\t\tje to nové, tak to zkouším [smilie--sprite1], ty odměny se zámečkem - budovy - ty jsou patrně jen pro ty, co si koupí tu sezónní vstupenku za dia, že?  Je toho všeho už nějak moc, dobro, event za eventem, teď tohle...  V práci - mmt, prosím, musím si tu posbírat úrodu [smilie--sprite1] [smilie--sprite1] , pak můžu pracovat [smilie--sprite1][BR][BR]@abraham Takový úkol u mne přesně patří do kategorie \"Neplním\", neboť já si chci utratit měnu události kdy chci já a ne kdy mi to určí nějaký úkol. Denní úkoly na betě neplním celkem běžně, takže očekávám, že to stejné budu dělat i na cz1/2.\t\tKlikněte zde pro zvětšení..."}, {"22": "Ukazuje se mi to půl na půl v angličtině [smilie--sprite8][BR][IMG]https://i.ibb.co/c1K8nck/https-cz-forum-elvenar-com-index-php-attachments-screenshot-2023-01-26-14-20-05-50-7f7cb4ea03f89ed00.jpg[/IMG]"}, {"20": "@Jasnost to je divné, mě se to zobrazuje normálně.[BR]@Lovec Krys i na betě k Sezóně přistupuju v klídku. Většinou úkoly splním, ale když ne, tak si z toho hlavu nedělám. Prostě není to nic proti ničemu.[BR]Jednotlivé úkoly se dají odmítnout tou kulatou šipkou, jen zatím nevím, jaký je v tom limit (1x denně?)"}, {"129": "Ahoj, Ldibria Ventis budova v sezone z odmien. Ona se odemkne když nahraju tech 150 lupenu anebo je to jenom premko a treba na to 3000 DIA ? Diky za info"}, {"16": "@Ludi Týdenní můžes odmítnout 2x. Tedy můžeš vyměnit polovinu týdenních úkolů, nicméně ti nikdo nezaručí, že místo nich dostaneš lepší.[BR]Denní úkoly odmítnout nejdou. Nicméně odměny za ně jsou natolik nízké, že všechny 4 splním tak každý 3.-4. den.[BR][BR]@Marian24 [BR][IMG]https://i.ibb.co/sqzNqGS/https-cz-forum-elvenar-com-index-php-attachments-1674744233159-png-6567.png[/IMG][BR]Pokud vypadá jako odměna vlevo, získáš ji. Pokud jako odměna vpravo, tak jen za dia."}, {"7": "Co myslíte, je možné, že když úkol napíše:[BR]\"Těžkooděnci ze cvičiště\" myslí tím vlastně[BR]\"Těžkooděnec z kasáren\" ???"}, {"24": "Zjednodušil som kalkulačku pre sezóny na svojej stránke a zároveň mierne upravil jej funkcionalitu. Tu je malý návod, ako kalkulačku používať:[BR]Najprv do kalkulačky preniesiete váš aktuálny pokrok v sezóne. Pre toto je potrebné vyplniť niekoľko políčok - prvým z nich je server (buď live alebo beta - väčšina z vás zrejme zvolí live (tento je nastavený aj automaticky, keď kalkulačku prvýkrát navštívite))Napíšete váš aktuálny počet splnených týždenných úloh. Číslo, ktoré uvediete je totožné s číslom zobrazeným v hre:\t\t\t\t\t\t\t\t\t\t\t\t\t[IMG]https://i.ibb.co/y4MfJL8/https-i-ibb-co-HBTb-BLJ-season-completed-weekly-quests-png.png[/IMG]Označíte, či ste splnili dnešné denné úlohy (označíte iba ak ste splnili všetky 4).Zadáte váš aktuálny pokrok v rade odmien. Pod kalkulačkou je zobrazený zoznam všetkých odmien dostupných počas sezóny a každá má vpravo (v stĺpci Finished) políčko, ktorého zaškrtnutím definujete, že ste túto odmenu už získali. Označte všetky odmeny, ktoré ste v sezóne získali (aspoň odomkli dosiahnutím potrebného počtu lupienkov).Aby bol výpočet presnejší, pod poslednou odmenou označenou ako \"získaná\" sa zobrazí políčko, v ktorom môžete definovať presný počet lupienkov, ktoré ste od odomknutia poslednej odmeny získali. Uvediete tam teda túto hodnotu:[BR][IMG]https://i.ibb.co/WHGkwKX/https-i-ibb-co-1-Tgr-DBj-season-remaining-petals-png.png[/IMG]Z tohto obrázka je zrejmé, že budem mať na stránke označených prvých 5 odmien ako získané a pod nasledujúcou uvediem do políčka hodnotu 20.Po vykonaní týchto krokov vám bude kalkulačka zobrazovať presný počet denných úloh, ktoré môžete behom sezóny vymeškať na to, aby ste získali všetky odmeny. Pokiaľ by sa stalo, že ste ich doteraz zmeškali už príliš veľa a nemáte viac šancu získať všetky odmeny, kalkulačka zobrazí poslednú odmenu, ktorú ešte získať stihnete (za predpokladu, že splníte všetky zvyšné denné úlohy).[BR][BR]Kalkulačka zároveň predpokladá, že splníte všetky týždenné úlohy (sú síce náročnejšie, ale je na ne podstatne viac času a mnohé z nich sa plnia samé, takže predpokladám, že limitujúcim faktorom sa stanú práve denné úlohy)."}, {"6": "Konečně zase jednou něco přehledného. Díky @iDavis.[BR]Všechno zatím splněno. Brnkačka. Myslím, že to má stejně většina s kapitolou 15+.[BR]Ceny jsou milé, i když nemusím obětovat 3000 mantů. Už mi 2x bezprostředně pomohly ve hře. Hlavně pro spodní kapitoláky to musí být velmi dobrá posila.[BR]Nedávno jsem koupil 3 chatrče na manu za 1400 mantů, takže pro někoho nabídka rejnoka a dalších pár pro spodní kapitoly zajímavých věcí může být přijatelná.[BR]Oproti kotlíku je to celkem povedená věc."}, {"142": "Tam, kde milníky  nabízí několik dostupných odměn mě těší, že mi hra umožní vybrat si tu nejlepší pro mě. Nejsem tedy nucen přijmout odměnu, kterou mi systém na základě pravděpodobnosti vybral, ač se mi vůbec nehodí - kdyby toto řešení bylo i eventech, byl bych velmi rád."}, {"148": "Emhyr var Emreis II napsal/a:\t\t\tDotaz: je možné získat hlavní odměnu aniž bys splnil prakticky všechny denní úkoly?\t\tKlikněte zde pro zvětšení...Též by mě to zajímalo. Protože jsem nemohl jeden úkol dokonči, protože to bylo splnit úkol tajemství alchymie, který se mi splnil náhodně automaticky tím že jsem vyráběl zboží. Bylo mi řečeno, že když neotevřu sezónu snů, tak se úkoly neodepíšou."}, {"22": "Pořád to mám půl na půl v angličtině [smilie--sprite2] Appka v Androidu[BR][BR][IMG]https://i.ibb.co/qxSjnq5/https-cz-forum-elvenar-com-index-php-attachments-screenshot-2023-01-28-09-27-06-69-7f7cb4ea03f89ed00.jpg[/IMG]"}, {"7": "Tak zítra....    Těším se !!"}, {"22": "Co je zítra?"}, {"15": "čtvrtek  ! [BR][smilie--sprite6]"}, {"136": "BMC George napsal/a:\t\t\tTéž by mě to zajímalo. Protože jsem nemohl jeden úkol dokonči, protože to bylo splnit úkol tajemství alchymie, který se mi splnil náhodně automaticky tím že jsem vyráběl zboží. Bylo mi řečeno, že když neotevřu sezónu snů, tak se úkoly neodepíšou.\t\tKlikněte zde pro zvětšení...[BR]pokiaľ nezmenili to koľko potrebuješ lístkov na 50-tu odmenu tak máš 380 bodov(lístkov) voľnosť[BR]takže napr nemusíš splniť 76 denných úloh  (19 dni *4 ulohy *5 lístkov  = 380)[BR][BR]- a ano, aj ked sa ti úkol splní, musíš otvoriť sezónu a odkliknúť jeho splnenie a tým získať body"}, {"129": "Keď nazbieram 50 tku , ktorá sa skladá z tých lupenov ,  za to je cena jezírko snu ,  tu mi je vše jasné ...ale všimli ste si, že je za tu 50 tku v odmenách  ešte odmena sezone požehnanie ? Je to keď nazbierate tu 50 tku a lupene naviac .Je tam akoby prazdenej mesic a tu by ma zajimalo , čo to vlastne to sezonne požehnanie je za odmenu ? (je to podstranka 11/11 v sezonnych odmenach )[BR]Sezonu som hral poctivo , ta hlavná budova sa mi vizuálne hodne páči a neni špatná ani ohladne many.Som zvedavý na ceny v ďalšej sezone.[BR]Poniektore odmeny vojáku boli fakt moc fajn v sezone ."}, {"21": "Hraju na pohodu vybírám je kvůli tomu že mě to svítí, jen budovy na rozčarování"}, {"31": "Jak to funguje s těmi sezónními požehnáními?[BR]Píše vyber, ale jenom na jednu ze zobrazených truhel se dá kliknout, ty zbylé dvě se zpřístupní po nahrání dalších 130 a 160 bodů?[BR]A co mám jako vybrat?[BR]"}, {"14": "od 2. března budete moci po splnění všech 50 sezónních milníků získávat Sezónní požehnání za každých nashromážděných 130 okvětních lístků. V rámci Sezónního požehnání si vždy budete moci vybrat jednu ze tří truhel. Zbylé dvě lze odemknout, máte-li pořízenou Sezónní vstupenku. K celé možnosti Sezónního požehnání se nedostanete, pokud nemáte dokončenou předchozí řadu 50 milníků.[BR][BR]Otevřít můžete pouze 1 truhlu za každé Požehnání a celkový počet požehnání není nijak omezen."}, {"31": "Aha, takže zase nic[BR] mi scusi"}]