[{"36": "Liebe Menschen und Elfen,[BR][BR]Teamgeist kommt nach Elvenar und gerne wollen wir eure Meinungen zum neuen Kapitel \"Teamgeist\" hören![BR][BR]Viele Grüße[BR]Euer Elvenar Team"}, {"21": "Öhhmmm - bin ich blind oder steht kein Datum in der Ankündigung? Oder kommts heute noch mit dem update ?[smilie--sprite1]"}, {"37": "das frag ich mich auch grad"}, {"36": "Wer weiß, wer weiß, wir machen's eben gerne spannend [smilie--sprite7] [BR]Vermutlich wird es aber bald soweit sein, dass der Teamgeist in den Städten einzieht.... [smilie--sprite1]"}, {"21": "OK, update [smilie--sprite8][smilie--sprite8]"}, {"38": "Das heißt, bis dato war noch kein Teamgeist in den Städten [smilie--sprite7][smilie--sprite8][smilie--sprite8][smilie--sprite8][smilie--sprite8]"}, {"36": "Indianaking schrieb:\t\t\tOK, update [smilie--sprite8][smilie--sprite8]Zum Vergrößern anklicken....[BR]Möglich [smilie--sprite2][BR][BR]Bertram von Traunstein schrieb:\t\t\tDas heißt, bis dato war noch kein Teamgeist in den Städten [smilie--sprite7][smilie--sprite8][smilie--sprite8][smilie--sprite8][smilie--sprite8]Zum Vergrößern anklicken....[BR]Genau, alle verfeindet und bald wird alles besser [smilie--sprite8]"}, {"38": "V.E.N.U.S schrieb:\t\t\tGenau, alle verfeindet und bald wird alles besser\t\tZum Vergrößern anklicken....das nehm ich dir nicht ab![BR]Bei mir in der Stadt gibts keine Feinde, sonst zerfällt rein logisch die Stadt.[BR]Mehr Sinn hat die Aussage, wenn ich sage, dass die Händler von Unur mit ihren Dingen rund um die Forschungsforderungen und deren Features Unruhe gestiftet haben und nun der Stadt-Teamgeist wieder verbessert werden muss -> Feedback zu den Unurhändlern[BR][smilie--sprite8][smilie--sprite8][smilie--sprite8]"}, {"36": "Bertram von Traunstein schrieb:\t\t\t... dass die Händler von Unur mit ihren Dingen rund um die Forschungsforderungen und deren Features Unruhe gestiftet haben und nun der Stadt-Teamgeist wieder verbessert werden muss ...\t\tZum Vergrößern anklicken....[BR]Akzeptiert^^ [smilie--sprite1]"}, {"38": "\t\t\tDer Bedarf an elfischen, menschlichen und elvarischen Freiwilligen innerhalb deiner Siedlung ändert sich ständig, so dass du dies berücksichtigen und die Produktionen häufig wechseln musst.\t\tZum Vergrößern anklicken....Also, warum das hier so gemacht wird, versteh ich echt nicht, da schreckt sich ja jeder vor dem Kapitel! [smilie--sprite10]"}, {"36": "Wir haben jetzt noch ein wenig an der Ankündigung gebastelt und ein Datum hinzugefügt [smilie--sprite2] [smilie--sprite1]"}, {"2": "Auch wenn die neuen Güterklassen (erweckte Güter, erleuchtete Güter) global gehandelt werden können, kommt es leider immer wieder vor, daß man ein bestimmtes Gut nur zu ungünstigen Preisen oder auch gar nicht auf dem Markt erhandeln kann.[BR][BR]Als kleine Abhilfe können sich hilfsbereite Spieler in den Tauschbörsen eintragen, die bereit sind, ihre Güter bei Bedarf gezielt zur Verfügung zu stellen, falls jemand dringend ein bestimmtes Gut benötigt.[BR][BR]Zu den Tauschbörsen geht es hier....[BR][BR]Arendyll: https://de.forum.elvenar.com/index....neue-güterklassen-erweckte-erleuchtete.22078/[BR]Winyandor: https://de.forum.elvenar.com/index....neue-güterklassen-erweckte-erleuchtete.22077/[BR]Felyndral: https://de.forum.elvenar.com/index....neue-güterklassen-erweckte-erleuchtete.22076/[BR]Khelonaar: https://de.forum.elvenar.com/index....neue-güterklassen-erweckte-erleuchtete.22075/[BR]Elcysandir: https://de.forum.elvenar.com/index....neue-güterklassen-erweckte-erleuchtete.22074/[BR]Sinya Arda: https://de.forum.elvenar.com/index....neue-güterklassen-erweckte-erleuchtete.22072/[BR]Ceravyn: https://de.forum.elvenar.com/index....neue-güterklassen-erweckte-erleuchtete.22070/"}, {"39": "morgen schon? hoffentlich noch keine 4-sterne-einheiten im turnier"}, {"40": "Ich finde vor allem das Beispielvideo toll: Die Stadt ist erstmal mit 14700 Bevölkerung in den Miesen. Geiles Beispiel für einen gelungenen und effizienten Stadtaufbau... [smilie--sprite7]"}, {"21": "Dominus00 schrieb:Ich finde vor allem das Beispielvideo toll: Die Stadt ist erstmal mit 14700 Bevölkerung in den Miesen. Geiles Beispiel für einen gelungenen und effizienten Stadtaufbau... [smilie--sprite7]Zum Vergrößern anklicken....[BR]....... was im Testaccount wahrscheinlich ziemlich wumpe ist- hat ja auch fast 1000 K Dias auf der hohen Kante [smilie--sprite6]"}, {"41": "Dominus00 schrieb:Ich finde vor allem das Beispielvideo toll: Die Stadt ist erstmal mit 14700 Bevölkerung in den Miesen. Geiles Beispiel für einen gelungenen und effizienten Stadtaufbau... [smilie--sprite7]Zum Vergrößern anklicken....Die Stadt ist wirklich schlecht als Beispiel ^^[BR]Sie hat unendlich Platz und 958k Dias auf dem Konto.[BR]Wie viele echte bespielte Städte sehen wohl so aus?[BR]Bleibt zu hoffen, dass irgendwo noch irgendwer bei INNO tatsächlich eine echte Stadt spielt..."}, {"40": "Och, die knapp eine Million Dias sind mir gar nicht aufgefallen. Sooo besonders wird das wohl nicht sein...  [smilie--sprite2]"}, {"6": "xafio schrieb:\t\t\tSie hat unendlich Platz und 958k Dias auf dem Konto.\t\tZum Vergrößern anklicken....Ist vielleicht als Tipp für die Spieler gedacht:[BR]Kauf 900k Dias und Du kannst Dich durch das ganze Kapitel kaufen. [smilie--sprite8][smilie--sprite8]"}, {"24": "Für 900k Dias kauft man fast einen Kleinwagen..."}, {"42": "Erschreckend [smilie--sprite10]"}]