[{"73": "ustoni schrieb:\t\t\tMan stellt sie nicht ein, sondern tauscht direkt. Sobald sie von anderen Spielern angenommen wurden oder spätestens nach 6 Stunden kann man erneut tauschen, der Kaufmann ist also ein Zwischenhändler.[BR][BR][BR]Sind bei mir ca. 30% der Tageseinnahmen. In Kapitel 18 sollte das kein Problem sein. Falls doch, machst Du irgendwas falsch. Bei mir laufen problemlos 3 Kaufleute. Die vollen 6 Stunden musste ich bisher noch bei keinem Kaufmann abwarten, obwohl ich nur mit Brennenden Barren handle.[BR][BR]Bisher bin ich mit diesem Kapitel sehr zufrieden. Hier sieht man Fortschritte, ganz im Gegenteil zu Kapitel 17.\t\tZum Vergrößern anklicken.... [BR]Ich habe einen Kaufmann und der kommt nach 7 von 10 Einsätzen nach 6 Stunden unverrichteter Dinge zurück.​Vielleicht wird es besser, wenn mehr Spieler so weit sind, mit erleuteten Gütern zu Handeln.​"}, {"73": "ustoni schrieb:\t\t\tMan stellt sie nicht ein, sondern tauscht direkt. Sobald sie von anderen Spielern angenommen wurden oder spätestens nach 6 Stunden kann man erneut tauschen, der Kaufmann ist also ein Zwischenhändler.[BR][BR][BR]Sind bei mir ca. 30% der Tageseinnahmen. In Kapitel 18 sollte das kein Problem sein. Falls doch, machst Du irgendwas falsch. Bei mir laufen problemlos 3 Kaufleute. Die vollen 6 Stunden musste ich bisher noch bei keinem Kaufmann abwarten, obwohl ich nur mit Brennenden Barren handle.[BR][BR]Bisher bin ich mit diesem Kapitel sehr zufrieden. Hier sieht man Fortschritte, ganz im Gegenteil zu Kapitel 17.\t\tZum Vergrößern anklicken....Ustoni, wo spielst Du? In Felyndral sind Brennenden Barren ein Riesenproblem, wie in den vorherigen Kapitel das Bismut."}, {"6": "Sananani schrieb:\t\t\tUstoni, wo spielst Du?\t\tZum Vergrößern anklicken....Arendyll.[BR]Der Barrenüberschuss macht sich dort dadurch bemerkbar, dass man extrem selten Gesuche nach Barren findet. Die Angebote meiner Kaufleute werden aber recht schnell angenommen. Seit gestern morgen hab ich so mit meinen 3 Kaufleuten rund 100k Barren gegen 100k Mineralien tauschen können."}, {"74": "Wenn ich das lese vergeht mir jetzt schon die Lust daran. (Bin aktuell Ende Kapitel 15).[BR]Gehöre auch zu den absoluten pechvögeln mit Holz/schriftrolle/Staub. [BR]als ich allerdings mit Elvenar angefangen habe (im Frühjahr 2018). Gabs dieses Problem noch nicht, da keine Bibliothek im Spiel war. Hab dannnach einem Jahr Spielzeit (in der Mitte von Kapitel 9) ne Spielpause von ca. 1,5 Jahren eingelegt und letzten Herbst wieder gestartet. Schriftollen tauschen und bismut loswerden ist ne absolute Katastrophe (nur dank meiner gilde überhaupt möglich), und scheinbar bin ich im neuen Kapitel dann gleich wieder der angeschmiert.[BR]Echt schade das man nicht einfach einmalig (von mir aus auch für 5k Dias oder so), seine bohnusgüter tauschen kann, den so macht es echt keinen Spaß mehr.[BR]Und neu anfangen in ner anderen Welt tu ich sicher nicht, dafür hab ich zu viel Zeit und auch Geld investiert"}, {"6": "Clarissa Pramheda schrieb:\t\t\tWenn ich das lese vergeht mir jetzt schon die Lust daran. (Bin aktuell Ende Kapitel 15).\t\tZum Vergrößern anklicken....Und damit brauchst Du noch ein knappes Jahr bis Kapitel 18. Bis dahin hat sich das mit Sicherheit eingespielt.[BR]Viel mehr Respekt solltest Du vor Kapitel 17 haben. Da wünsche ich Dir jetzt schon viel Spaß.  [smilie--sprite1]"}, {"73": "Clarissa Pramheda schrieb:\t\t\tWenn ich das lese vergeht mir jetzt schon die Lust daran. (Bin aktuell Ende Kapitel 15).[BR]Gehöre auch zu den absoluten pechvögeln mit Holz/schriftrolle/Staub.[BR]als ich allerdings mit Elvenar angefangen habe (im Frühjahr 2018). Gabs dieses Problem noch nicht, da keine Bibliothek im Spiel war. Hab dannnach einem Jahr Spielzeit (in der Mitte von Kapitel 9) ne Spielpause von ca. 1,5 Jahren eingelegt und letzten Herbst wieder gestartet. Schriftollen tauschen und bismut loswerden ist ne absolute Katastrophe (nur dank meiner gilde überhaupt möglich), und scheinbar bin ich im neuen Kapitel dann gleich wieder der angeschmiert.[BR]Echt schade das man nicht einfach einmalig (von mir aus auch für 5k Dias oder so), seine bohnusgüter tauschen kann, den so macht es echt keinen Spaß mehr.[BR]Und neu anfangen in ner anderen Welt tu ich sicher nicht, dafür hab ich zu viel Zeit und auch Geld investiert\t\tZum Vergrößern anklicken.... [BR]Hallo Clarissa​Ich habe auch Holz/schriftrollen/Staub, in Kapitel 17 wird das einfacher mit den Basis-Gütern.​Das Herstellen der Gastrassen-Güter dauert lange, dableibt Zeit für die Basics.​Ich habe 4 Holz-, 3 Schriftrollen- und 2 Staub-Manufakturen behalten.​5 Holz wären besser gewesen. Baue sie aber nicht höher als Level 23, sonst kannst Du keine 24-Std.-Produktionen mehr starten.​"}, {"75": "Hallo,[BR]Nach der Flotte an Schiffen im Kapitel 17 hatte ich dann genug Zeit und Platz um große Gärten anzulegen und schöne Gebäude aus dem Fundus zu holen [smilie--sprite2][BR]Trotzdem konnte ich es kaum erwarten dann in das neue Kapitel zu starten.[BR]Und es gefällt mir ganz gut [smilie--sprite1][BR][BR]Irgendwie kommt wieder diese Magie ins Spiel, wundervolle Naturelemente und eine gewisse Verspieltheit. Das ist es was ich an Elvenar liebe.[BR]Gut möglich dass es anfangs noch einige bugs gibt die dann hoffentlich bald behoben werden, dennoch sehe ich momentan nichts zu kritisieren.[BR]Es ist wie eine Art back to the roots, als ob sich die allgemeine Stimmung dadurch vielleicht auch weiter zum positiven lenken lässt.[BR]Teamspirit ist auch ein guter Name, alle als Team, eine Gemeinschaft von Reisenden die dieses schöne Spiel weiter voranbringen möchte.[BR]Oder auch das Team der 4 Elemente [smilie--sprite2][BR]... oder auch Menschen, Elfen und Elvenars als Team [smilie--sprite2][BR][BR]Erzählungen aus Elvenar... ja, es war einmal...[BR][BR]Zu viel Schönfärberei? Für mich bleibt es ein entspannendes Spiel mit Geduld, Planung und Teamgeist [smilie--sprite1][BR]Mit vielen phantastischen Gebäuden und eben einiges an Magie.[BR][BR]In diesem Sinne: ich lass mich weiter überraschen [smilie--sprite1]"}, {"76": "Ich habe eine Quest: Verdiene 100 Aktivitätsmedaillen.  WAS ist das?"}, {"57": "Wahrscheinlich Abzeichen aus den verschiedenen Zentren, wie Gärtnern, Segeln usw. Da gibts nohc so ne ähnliche Quest, da wollen sie dann Abzeichen vom Tor. Musst bisserl gucken, dann kommt man sofort drauf welche Abzeichen die wollen.[BR]Viel Erfolg und schönes Pfingstwe[BR]Silver"}, {"76": "Vielen Dank, dann warte ich mal ab....[BR]Gibt es eigentlich irgendwo eine deutsche Questliste?[BR]Ich hab mal irgendwo eine gesehen, finde sie aber nicht wieder. Ich meine nicht die italienische"}, {"50": "Du kannst in den Zentren in der ersten Position die entsprechenden Elementchen (8h-Produktionszeit) und dann ab Position 2 Medaillen (4h-Produktionen) produzieren.[BR]Bei der Aufgabe heisst es für dich auszusuchen, welche Medaillen Du in deinen Zentren herstellst, denn Achtung, siehe zu, dass Du die unterschiedlichen Medaillen ausgewogen produzierst, da diese wiederum im Portal dann für die Teamgeist-Abzeichen benötigt werden.[BR][BR]Z.B. kannst Du \"Kochen\" sowohl im Wasser-, als auch Feuer-Zentrum, Segeln geht im Wasser- und Wind-Zentrum usw. Daher eben aufpassen, dass Du nicht einseitig von einer der 6 verschiedenen Medaillen-Arten die Produktionen laufen lässt.[BR]Daher schau Dir genau an, was Du im Portal an Mengen für die Abzeichen benötigst und passe anhand dessen deine Produktion in den Zentren für die Medaillen an.[BR][BR]Ausgehend von der jetzigen Aufgabe, die Du machen sollst kommen dann:[BR]31. Verdiene 100 Aktivitätsmedaillen -> 2x Splitter[BR]32. Züchte 100 Baby-Elementare -> 18.000 göttliche Saat[BR]33. Schliesse 10 Prüfungen ab -> 8.000 Orks[BR][BR]weiter bin ich derzeit noch nicht."}, {"76": "Vielen Dank!"}, {"66": "OMcErnie schrieb:\t\t\tDu kannst in den Zentren in der ersten Position die entsprechenden Elementchen (8h-Produktionszeit) und dann ab Position 2 Medaillen (4h-Produktionen) produzieren.[BR]Bei der Aufgabe heisst es für dich auszusuchen, welche Medaillen Du in deinen Zentren herstellst, denn Achtung, siehe zu, dass Du die unterschiedlichen Medaillen ausgewogen produzierst, da diese wiederum im Portal dann für die Teamgeist-Abzeichen benötigt werden.[BR][BR]Z.B. kannst Du \"Kochen\" sowohl im Wasser-, als auch Feuer-Zentrum, Segeln geht im Wasser- und Wind-Zentrum usw. Daher eben aufpassen, dass Du nicht einseitig von einer der 6 verschiedenen Medaillen-Arten die Produktionen laufen lässt.[BR]Daher schau Dir genau an, was Du im Portal an Mengen für die Abzeichen benötigst und passe anhand dessen deine Produktion in den Zentren für die Medaillen an.[BR][BR]Ausgehend von der jetzigen Aufgabe, die Du machen sollst kommen dann:[BR]31. Verdiene 100 Aktivitätsmedaillen -> 2x Splitter[BR]32. Züchte 100 Baby-Elementare -> 18.000 göttliche Saat[BR]33. Schliesse 10 Prüfungen ab -> 8.000 Orks[BR][BR]weiter bin ich derzeit noch nicht.\t\tZum Vergrößern anklicken....[BR][BR]Am einfachsten ist es, immer \"im Kreis\" zu produzieren. Also Nachts die Elementare auf Position 1 mit 8h (Babyelementare für die Quest). Tagsüber dann zunächst Position 2 in allen, dann 3 und dann 4. Wenn man es so macht, hat man automatisch die gleiche Anzahl an Medaillen um im Dimensionstor genauso zu verfahren. Der Reihe nach Position 1-5 und wieder von vorne. So hat man eine ausgewogene Produktion ohne immer zuerst schauen zu müssen, welche Medaillen fehlen.[BR]Edit: Vorausgesetzt natürlich, man hat die gleiche Anzahl von jedem Zentrum gebaut.[BR]Anfangs muss man manchmal etwas warten bis man die 4. Produktion in den Zentren abgeschlossen hat, um dann im Dimensionstor auch der Reihe nach die Teamabzeichen herstellen zu können. Aber spätestens wenn man sein Dimensionstor auf Stufe 3/4 ausbaut hat man fast 4 Tage, in denen man die Aktivitätsabzeichen vorproduzieren kann ohne sie verwerten zu können und somit volle Lager. Wenn man dann weiter so verfährt, kann man bestens durchproduzieren und hat immer die benötigten Medaillen parat im richtigen Verhältnis zueinander."}, {"77": "Ich kann dem Team und somit auch dem Team Geist nur ein gutes Zeugnis ausstellen, Weil sich um alle Belange die ich bis jetzt hatte sehr gut und Kompetent gekümmert wurde.[BR][BR]daher von mir Danke an das Team"}, {"2": "Due89 schrieb:\t\t\tIch kann dem Team und somit auch dem Team Geist nur ein gutes Zeugnis ausstellen, Weil sich um alle Belange die ich bis jetzt hatte sehr gut und Kompetent gekümmert wurde.[BR][BR]daher von mir Danke an das Team\t\tZum Vergrößern anklicken.......Teamgeist ist der Titel von Kapitel 18 - das hat nix mit dem Elvenar-Team hier im Forum oder dem Support zu tun ^^ - aber sie werden sich trotzdem freuen  [smilie--sprite2] ..."}, {"60": "tangora schrieb:\t\t\tAm einfachsten ist es, immer \"im Kreis\" zu produzieren. Also Nachts die Elementare auf Position 1 mit 8h (Babyelementare für die Quest). Tagsüber dann zunächst Position 2 in allen, dann 3 und dann 4. Wenn man es so macht, hat man automatisch die gleiche Anzahl an Medaillen um im Dimensionstor genauso zu verfahren. Der Reihe nach Position 1-5 und wieder von vorne. So hat man eine ausgewogene Produktion ohne immer zuerst schauen zu müssen, welche Medaillen fehlen.[BR]Edit: Vorausgesetzt natürlich, man hat die gleiche Anzahl von jedem Zentrum gebaut.[BR]Anfangs muss man manchmal etwas warten bis man die 4. Produktion in den Zentren abgeschlossen hat, um dann im Dimensionstor auch der Reihe nach die Teamabzeichen herstellen zu können. Aber spätestens wenn man sein Dimensionstor auf Stufe 3/4 ausbaut hat man fast 4 Tage, in denen man die Aktivitätsabzeichen vorproduzieren kann ohne sie verwerten zu können und somit volle Lager. Wenn man dann weiter so verfährt, kann man bestens durchproduzieren und hat immer die benötigten Medaillen parat im richtigen Verhältnis zueinander.\t\tZum Vergrößern anklicken....Ein dickes Dankeschön für deinen Post - das ist ein super Tipp! [smilie--sprite1][BR]War gerade dabei rauszufinden, wie ich ausgewogen produzieren kann und hatte noch keine wirkliche Idee - dabei ist es eigentlich super einfach, wenn man (Frau) keine Blockade im Kopf gehabt hätte. [smilie--sprite8]"}, {"58": "Zuerst mal vielen Dank für die guten Tipps, haben mir teilweise sehr geholfen.[BR]Die Gestaltung der neuen Gastrasse find ich auch gut, klar geht es bei mir nicht super-schnell aber im Vergleich zu den Händlern von Unur deutlich besser, ich brauch mir nicht die halbe Stadt mit Händlerschiffen zustellen und dann klicken wie Weltmeister um vorwärts zu kommen.[BR]Ich geh das alles im Moment also sehr entspannt an.[BR]Ein deutlich dicker Minuspunkt ist die Sache mit dem Handel, bei mir in Felyndral werden auf 127 Seiten Urwelt-Mineralien gesucht, auf immerhin noch 16 Seiten Allwissende Allraunen und natürlich mein Handelsgut brennende Barren gleich NULL.[BR]Ich weiß dass sich hier einige Spieler sehr mit Tauschbörsen bemühen um anderen zu helfen aber das kann doch nicht die Lösung sein. Ich hab drei Händler frei geschalten, Dias sind mir dann doch zu schade, und bekomme damit täglich 12.000 Mineralien z.B. [BR]Mir geht es hier ganz einfach um das Ungleichgewicht, ich fühle mich einfach benachteiligt!!![BR]Soviel zu meinem derzeitigen Feedback, schade eigentlich...."}, {"73": "Hallo, Vorschlag an INNO:​In Arendyll und Felyndral gibt es ja einen großen Überschuss an „Brennenden Barren“.​Dafür kann INNO nichts, wahrscheinlich sind außergewöhnlich viele Spieler mit Holz als Bonusgut dabei geblieben.​Trotzdem könnte man etwas dagegen tun, um den Spaß am Spiel zu erhalten.​Das einfachste wäre beim nächsten Event das Hauptgebäude​oder/und am Ende der Questreihe als Abschlussgewinn ein Gebäude zu setzen,​dass in Kapitel 18 \"Brennenden Barren“, oder damit keiner bevorzugt wird,​wahlweise \"Urwelt-Mineralien“ oder \"Allwissende Alraunen“ herstellt.​MfG  Sananani​P.S.: Überdenkt mal Grundsätzlich die Größe der Gebäude.​In Kapitel 18 braucht man Manufakturen Level 32 vom neuen Bonusgut.​Für eine nicht ablehnbare Quest sogar mindesten drei, und es kommen noch 2 Güterklassen dazu.​9 neue Manufakturen Level 32 und dann noch die Bauwerke der Gastrassen....​Baut in Zukunft kleiner oder vergrößert das Gelände und schenkt uns zum Kapitel 20 zehn Erweiterungen.​"}, {"39": "@Sananani [BR]es gibt zuviel brennende barren und deine lösung dafür wäre ein gebäude, das brennende barren herstellt, habe ich das richtig verstanden?[BR]evtl solltest du dich bei inno bewerben und mit dem schriftrollenproblem betraut werden. [smilie--sprite8]"}, {"17": "die ja komischerweise wieder kleiner werden 6x4 statt 5x5 von daher hat wohl einer mitgedacht, und keiner hat was von gleichen Manus gefragt.[BR]Aber so 2-4 Manus hat doch eh jeder pro Bonusgut stehen. Jetzt halt mehr von den neuen dafür kommt halt eine von T1-T9 weg. Gäbs keine Teleporter wäre das echt ärgerlich.[BR]Wofür mehr Land um noch mehr zu bauen was man nicht braucht?"}]