[{"2": "Sananani schrieb:\t\t\tIn Kapitel 18 braucht man Manufakturen Level 32 vom neuen Bonusgut.Für eine nicht ablehnbare Quest sogar mindesten drei, und es kommen noch 2 Güterklassen dazu.\t\tZum Vergrößern anklicken.......du brauchst 3 Manufakturen in Level 32 - das stimmt - das muss aber nicht das \"Neue\" Bonusgut sein - du kannst auch mischen normale/erweckte/erleuchtete...."}, {"73": "Ich hatte eine Quest: \"Besitze 3 Stahlmanufakturen Level 32\". Die T1-T9 kann ich nicht wegbeamen, da man Grundgüter braucht, um die erleuchteten Güter herzustellen. Jetzt brauche ich noch zusätzliche Häuser, weil mir die Bewohner ausgehen. Ein Teufelskreis. Da muss ich wohl Gebäude abreißen, die mir nur Mana und Saat bringen. Schade."}, {"48": "Lass doch diese blöde Quest einfach weg?[BR]Dann machst du die ganzen Quests, die dir gefallen eben erst, wenn du im Kapitel 19 bist.[BR]Mache ich schon seit mindestens 10 Kapiteln so. Meist bei bescheuerten: \"Baue irgendwelche nutzlosen Gebäude\" Quests.[BR]Dann klicke ich halt Quests, die mir nicht gefallen nach Beginn des nächsten Kapitels weg und die anderen habe ich schon gelöst, oder löse ich dann."}, {"50": "Es gibt bei der Stoy-Questline keine Aufgabe in der es heisst besitze 3 Manus identische Art (in deinem Fall 3x Stahl) der Stufe 32[BR][BR]Hierbei handelte es sich um Aufgabe 13 und die Original-Aufgabenstellung lautet:[BR][BR]13. Sammle 1.000 erleuchtete Güter ein UND Besitze mindestens 3 Basismanufakturen der Stufe 32 oder höher -> 4x 10% Münzsegen[BR][BR]Basis-Manus sind Marmor, Stahl und/oder Holz und somit habe ich meine 2 Marmor-Manus für erw. BGs auf Stufe 32 ausgebaut und meine eine Stahl-Manu für mein erl. BG war ja bereits bedingt durch Aufgabe 12 auf Stufe 32 und damit war Aufgabe 13 erledigt.[BR][BR]Ich dokumentiere für meine GM sämtliche Aufgaben zur Gastrasse Teamgeist im Originalwortlaut.[BR]Bei Aufgabe 37 habe ich momentan einen Stopp einlegen müssen, da ich mein Unurium vorerst nicht für den Ausbau der WGs auf Stufe 40 verpulvern will und ich 3 normale WGs dazu ausbauen müsste.[BR][BR]Hier sind die von mir zur Zeit gelösten Story-Quest-Aufgaben der Teamgeister inkl. der zugehörigen Belohnungen im Originalwortlaut zu finden:[BR]\t\t\thttps://de.forum.elvenar.com/index.php?threads/spoiler-gastrassen-story-questliste.7410/page-8\t\t"}, {"2": "OMcErnie schrieb:\t\t\t13. Sammle 1.000 erleuchtete Güter ein UND Besitze mindestens 3 Basismanufakturen der Stufe 32 oder höher -> 4x 10% MünzsegenZum Vergrößern anklicken.......ich hab diese Quest gerade offen - bisher hab ich je 1x Stahl und 1x Marmor auf 32 - wurde beides gezählt (die 3. baut gerade)...[BR][IMG]https://i.ibb.co/rvqZKLb/https-de-forum-elvenar-com-index-php-attachments-manuquest-png-24670.png[/IMG][IMG]https://i.ibb.co/8zpY5Vq/https-de-forum-elvenar-com-index-php-attachments-manuquest2-png-24671.png[/IMG][BR][BR]...uff - bei der WG-Quest werd ich wohl auch hängenbleiben, sofern ich bis dahin nicht noch 3 magische Wohngebäude gewinne [smilie--sprite3]"}, {"60": "@OMcErnie falls du das mit einbauen möchtest, das ist die Aufgabe 38.[BR][IMG]https://i.ibb.co/7jygCGb/https-de-forum-elvenar-com-index-php-attachments-1622138071482-png-24681.png[/IMG]"}, {"67": "#206@OMcErnie falls du das mit einbauen möchtest, das ist die Aufgabe 38.[BR][BR][IMG]https://i.ibb.co/7jygCGb/https-de-forum-elvenar-com-index-php-attachments-1622138071482-png-24681.png[/IMG][BR][BR][BR]Da hier gerade eine dieser ablehnbaren \"Doppelquests\" auf taucht, möchte ich an dieser Stelle auch noch mal vor einem Problem warnen.[BR]In der Storryquest kommen 3 solche Aufgaben vor, und danach je eine Quest (auch ablehnbar) mit einem 20 Diagewinn.[BR][BR]Lehnt man jetzt aber eine dieser ersten Quests für Manufakturen ab, kommt ein Popupfenster, wo man gewarnt wird, das der Schritt nicht rückgängig gemacht werden kann. Das ist aber klar soweit, nur das Problem was entsteht, die wertvollere Folgequest erscheint nach dem ab lehnen der ersten Quest gar nicht, Die wird einfach mit überschrieben und es geht direkt mit der übernächsten Quest dann weiter. Seit also gewarnt, falls Ihr euch dazu entschließt, eine Quest aus welchen Gründen auch immer mal ab zu lehnen. Die Diaquest danach fällt dann ohne Hinweis aus.[BR][BR]Dazu gibt es auch seit 10 Tagen eine Fehlermeldung, auf Die bisher kein Moderator reagiert hat leider."}, {"9": "Fargonia schrieb:\t\t\tLehnt man jetzt aber eine dieser ersten Quests für Manufakturen ab, kommt ein Popupfenster, wo man gewarnt wird, das der Schritt nicht rückgängig gemacht werden kann. Das ist aber klar soweit, nur das Problem was entsteht, die wertvollere Folgequest erscheint nach dem ab lehnen der ersten Quest gar nicht, Die wird einfach mit überschrieben und es geht direkt mit der übernächsten Quest dann weiter. Seit also gewarnt, falls Ihr euch dazu entschließt, eine Quest aus welchen Gründen auch immer mal ab zu lehnen. Die Diaquest danach fällt dann ohne Hinweis aus.[BR][BR]Dazu gibt es auch seit 10 Tagen eine Fehlermeldung, auf Die bisher kein Moderator reagiert hat leider.\t\tZum Vergrößern anklicken....Das würde das hier erklären:[BR]\t\t\thttps://de.forum.elvenar.com/index.php?threads/spoiler-gastrassen-story-questliste.7410/post-344863\t\t[BR]Denn die ganze Storyline-Reihenfolge stimmt bei @OMcErnie nicht, da ist alles durcheinander gewürfelt (siehe Link). Er lehnte also welche ab."}, {"17": "Nö was auch immer du für eine Storyline hast bis Aufgabe 16 kann ich den Baum von  @OMcErnie  genau nach vollziehen."}, {"78": "V.E.N.U.S schrieb:\t\t\tLiebe Menschen und Elfen,[BR][BR]Teamgeist kommt nach Elvenar und gerne wollen wir eure Meinungen zum neuen Kapitel \"Teamgeist\" hören![BR][BR]Viele Grüße[BR]Euer Elvenar Team\t\tZum Vergrößern anklicken....[BR]Ich bin jetzt bei Aufgabe `Besitze 12 Elementarzentren`, ich kann auch sagen: ich bin bei der \"letzten\" Aufgabe.[BR][BR]Ein Satz Elementarzentren (ohne Straßen, Begrüßung und Dimensionstor) belegt 116 Felder, jetzt sollen weitere 232 Felder (zuzüglich Straßen) belegt werden. Ich habe schon die Hälfte der Rüstkammern abgebaut, um die Aufgabe zu erfüllen müsste ich z. B. 4 Werkstätten (120 Felder) und die letzten drei Rüstkammer (84 Felder) löschen. Da das noch nicht reicht muss noch ... gelöscht oder eingepackt werden.[BR][BR]Kurz: das Spiel ist dann nicht mehr spielbar (keine Soldaten, keine Werkzeuge..). Also muss ich ab jetzt auf das nächste Kapitel warten bis ich die Aufgabe löschen kann.[BR][BR]Platzmangel ist Kern des Spiels, eine Herausforderung, die Spaß macht. Es muss aber auch berücksichtigt werden dass der geforderte Platzbedarf für die Erfüllung der Aufgaben nicht uns jeder Spielfreude beraubt."}, {"17": "Piratschko schrieb:\t\t\tIch bin jetzt bei Aufgabe `Besitze 12 Elementarzentren`, ich kann auch sagen: ich bin bei der \"letzten\" Aufgabe.[BR][BR]Ein Satz Elementarzentren (ohne Straßen, Begrüßung und Dimensionstor) belegt 116 Felder, jetzt sollen weitere 232 Felder (zuzüglich Straßen) belegt werden. Ich habe schon die Hälfte der Rüstkammern abgebaut, um die Aufgabe zu erfüllen müsste ich z. B. 4 Werkstätten (120 Felder) und die letzten drei Rüstkammer (84 Felder) löschen. Da das noch nicht reicht muss noch ... gelöscht oder eingepackt werden.[BR][BR]Kurz: das Spiel ist dann nicht mehr spielbar (keine Soldaten, keine Werkzeuge..). Also muss ich ab jetzt auf das nächste Kapitel warten bis ich die Aufgabe löschen kann.[BR][BR]Platzmangel ist Kern des Spiels, eine Herausforderung, die Spaß macht. Es muss aber auch berücksichtigt werden dass der geforderte Platzbedarf für die Erfüllung der Aufgaben nicht uns jeder Spielfreude beraubt.\t\tZum Vergrößern anklicken....Ganz ehrlich? Das Zauberwort hießt Prioritäten setzen. Wenn ich mir deine Stadt so anschaue müsste aber eigentlich unheimlich Potenzial im Verbannen von Wohnhäusern bestehen."}, {"6": "Piratschko schrieb:\t\t\tEin Satz Elementarzentren (ohne Straßen, Begrüßung und Dimensionstor) belegt 116 Felder, jetzt sollen weitere 232 Felder (zuzüglich Straßen) belegt werden.\t\tZum Vergrößern anklicken....Piratschko schrieb:\t\t\tPlatzmangel ist Kern des Spiels, eine Herausforderung, die Spaß macht. Es muss aber auch berücksichtigt werden dass der geforderte Platzbedarf für die Erfüllung der Aufgaben nicht uns jeder Spielfreude beraubt.\t\tZum Vergrößern anklicken....Sorry, aber wie hast Du denn dann Kapitel 17 geschafft?[BR]Ich hab 16 Elementarzentren stehen und brauche damit bei weitem nicht soviel Platz wie bei Kapitel 17."}, {"78": "stone2345 schrieb:\t\t\tGanz ehrlich? Das Zauberwort hießt Prioritäten setzen. Wenn ich mir deine Stadt so anschaue müsste aber eigentlich unheimlich Potenzial im Verbannen von Wohnhäusern bestehen.\t\tZum Vergrößern anklicken....[BR]1 Wohnhaus = 20 Felder und 10.000 Bewohner, also 12 Wohnhäuser und 120.000 Bewohner löschen ... ohhhh dann habe ich minus 85.000 Bewohner[BR][BR]und ustoni: beim letzten Kapitel musste man nicht alle Schiffe gleichzeitig aufstellen, nur die, die man gerade benötigt hatte. Außerdem brauchte man im Portal nichts zu produzieren, mit Portalgewinnen konnte man alle Stufen freischalten.[BR][BR]Natürlich kann man Platz schaffen. Alle Manufakturen, die gerade nicht benötigt werden in den Keller und ständig austauschen. Alle mühsam erworbenen Kulturgebäude löschen (aber warum soll man sich noch an den Events beteiligen, wenn die Stufengebäude immer bald ersatzlos gelöscht werden müssen usw.).[BR][BR]Ich sagte nicht unmöglich, ich sagte, dass der jetzt geforderte Platzbedarf jegliche Spielfreude vernichtet."}, {"12": "Sonderbar, ich hab die 12 Elementarzentren locker untergebracht und nur eine Zweit-Manu für aufgestiegenes Gut3 eingelagert.[BR]Viel mehr fordert mich diesmal der unglaubliche Mana-Verbrauch. Ich kann's nur lösen, indem ich tagelang die Elementarproduktion stillstehen lasse, wenn ich Mana im Forschungsbaum brauche. Oder was ist diesbezüglich Eure Lösung?"}, {"6": "Ayla Ayla schrieb:\t\t\tOder was ist diesbezüglich Eure Lösung?\t\tZum Vergrößern anklicken....Hierbei hilft es, ausreichend Verzauberte Vorräte und Magische Mitgift gesammelt zu haben. Das Mana produziere ich damit im Drachenkloster.[BR]Meine Werkstätten laufen z.B. bereits jetzt für 76 Tage auf 300%. Bis ich mit dem Kapitel durch bin, werden die Werkstätten wohl mindestens bis Ende des Jahres auf 300% laufen."}, {"12": "ustoni schrieb:\t\t\tHierbei hilft es, ausreichend Verzauberte Vorräte und Magische Mitgift gesammelt zu haben. Das Mana produziere ich damit im Drachenkloster.[BR]Meine Werkstätten laufen z.B. bereits jetzt für 76 Tage auf 300%. Bis ich mit dem Kapitel durch bin, werden die Werkstätten wohl mindestens bis Ende des Jahres auf 300% laufen.\t\tZum Vergrößern anklicken....Gute Idee, danke. Dann stell ich mal das Wunder auf und lager ein Wohnhaus ein. [smilie--sprite6]"}, {"6": "Ayla Ayla schrieb:\t\t\tDann stell ich mal das Wunder auf und lager ein Wohnhaus ein.\t\tZum Vergrößern anklicken....Am besten direkt so weit wie möglich ausbauen.[BR]Meins bringt bei Stufe 18 je Verzauberung 17420 Mana.[BR]Ich schätze, dass ich für Kapitel 18 ca. 2000 Verzauberungen verbrauchen werde."}, {"25": "Hi, ich habe eine Quest : Schliesse eine Prüfung ab, weiß jmd,was damit gemeint ist ?"}, {"2": "whighlander schrieb:\t\t\tHi, ich habe eine Quest : Schliesse eine Prüfung ab, weiß jmd,was damit gemeint ist ?\t\tZum Vergrößern anklicken.......das sind die \"Produktionen\" in deinem Portal..."}, {"25": "danke, erledigt..."}]