[{"79": "In Khelonaar gibt es einen riesigen Überschuss von Urwelt-Mineralien. Jetzt gerade z.B. auf 52 Seiten Angebote, und keinerlei Nachfrage. Das ist praktisch immer so. Wenn ich mal nicht 6 Stunden auf meine Händler warten muss ist das ein Glücksfall. Das neue Handelssystem bietet hier keinen Ausgleich, ganz im Gegenteil sogar. Ich bekomme zwar meine Güter getauscht, aber nur in festen, kleinen Häppchen und ohne Möglichkeit, selbst steuernd über Menge und Preis einzugreifen. (Dias und Zeitbooster mal nicht betrachtet). Sehr demotivierend. Ich will nicht von \"unfair\" reden; bislang bin ich mit Ungleichgewichten zu meinen Nachteil immer gut klargekommen, aber hier leidet doch der Spielspaß sehr. Das mal so als Feedback"}, {"12": "Ich hatte eine Quest abgelehnt und nicht gewußt, daß damit auch die Folgeaufgabe verschwindet.[BR]Kann mir jemand sagen, was die Aufgabe gewesen wäre, damit ich sie meiner Gemeinschaft hinterlassen kann (siehe im Spoiler)?[BR][BR]Spoiler: Spoiler21.  Sammele 40.000.000 Münzen ein22.  Produziere 1 Kessel von Haugur (ablehnbar)23.  Produziere 1 Samowar von Heropi (ablehnbar)24.  ??25.  Schalte die Teampark-Straße frei & Besitze mindestens 12 Felder der Teampark-Straße26.  Schalte das Authentische Hauptgebäude frei[BR][BR]"}, {"2": "Ayla Ayla schrieb:\t\t\tIch hatte eine Quest abgelehnt und nicht gewußt, daß damit auch die Folgeaufgabe verschwindet.[BR]Kann mir jemand sagen, was die Aufgabe gewesen wäre, damit ich sie meiner Gemeinschaft hinterlassen kann (siehe im Spoiler)?[BR][BR]Spoiler: Spoiler21.  Sammele 40.000.000 Münzen ein22.  Produziere 1 Kessel von Haugur (ablehnbar)23.  Produziere 1 Samowar von Heropi (ablehnbar)24.  ??25.  Schalte die Teampark-Straße frei & Besitze mindestens 12 Felder der Teampark-Straße26.  Schalte das Authentische Hauptgebäude frei[BR][BR]Zum Vergrößern anklicken.......kuck mal hier... https://de.forum.elvenar.com/index.php?threads/spoiler-gastrassen-story-questliste.7410/post-345210"}, {"21": "Warum gibts es eigentlich bei den Kaufleuten keine Dia- Nachfrage ??? [smilie--sprite4] Sonst kommt doch erst immer ne Nachfrage. Eben passiert - jetzt hab ich einen Die-Kaufmann an der Backe den ich gar nicht brauche weil ich irrtümlich über den button gefahren bin - was für ein Mist. Bei den Münzbuttons passiert das übrigens auch ratzfatz. Bei den Kaufleuten sollte in jedem Fall eine Nachfrage VOR dem Kauf kommen."}, {"1": "Indianaking schrieb:\t\t\tWarum gibts es eigentlich bei den Kaufleuten keine Dia- Nachfrage ??? [smilie--sprite4] Sonst kommt doch erst immer ne Nachfrage. Eben passiert - jetzt hab ich einen Die-Kaufmann an der Backe den ich gar nicht brauche weil ich irrtümlich über den button gefahren bin - was für ein Mist. Bei den Münzbuttons passiert das übrigens auch ratzfatz. Bei den Kaufleuten sollte in jedem Fall eine Nachfrage VOR dem Kauf kommen.\t\tZum Vergrößern anklicken....Hast du die Bestätigungsabfrage aktiviert?"}, {"80": "aaaaax schrieb:\t\t\tIn Khelonaar gibt es einen riesigen Überschuss von Urwelt-Mineralien. Jetzt gerade z.B. auf 52 Seiten Angebote, und keinerlei Nachfrage. Das ist praktisch immer so. Wenn ich mal nicht 6 Stunden auf meine Händler warten muss ist das ein Glücksfall. Das neue Handelssystem bietet hier keinen Ausgleich, ganz im Gegenteil sogar. Ich bekomme zwar meine Güter getauscht, aber nur in festen, kleinen Häppchen und ohne Möglichkeit, selbst steuernd über Menge und Preis einzugreifen. (Dias und Zeitbooster mal nicht betrachtet). Sehr demotivierend. Ich will nicht von \"unfair\" reden; bislang bin ich mit Ungleichgewichten zu meinen Nachteil immer gut klargekommen, aber hier leidet doch der Spielspaß sehr. Das mal so als Feedback\t\tZum Vergrößern anklicken....[BR]Das System der Kaufleute hat genau das zur Folge - sobald es in einer Welt einen Mangel an einem Gut gibt, kippt dieses, und es gibt zu diesem sofort unendlich viele Nachfrage und keine Angebote mehr. Die Spieler mit diesem Bonusgut haben ja keinen Grund, was einzustellen - sie können ihre Bedürfnisse immer mit Annehmen von Angeboten auf dem Markt befriedigen.[BR][BR]Wichtig wäre, dass möglichst alle Spieler nur Angebote annehmen, die einen Hut haben, und die anderen stehen lassen. Denn dann bleiben Mangelgüter im Markt, die niemand produzieren musste (die Kaufleute nehmen die ja aus dem Nirgendwo, und der Spieler, der neben dem Angebot in der Liste steht, hat nichts mehr davon, wenn man \"sein\" Angebot später noch annimmt). Die Kaufleute geben also Kredite, die man nicht zurückzahlen muss. Über dieses System gibt es durchaus einen Ausgleich im Markt, was aber nichts daran ändert, dass wir, die wir ein Überflussgut produzieren, Nachteile gegenüber den Spielern mit den Mangelgütern haben."}, {"21": "Tacheless schrieb:\t\t\tHast du die Bestätigungsabfrage aktiviert?\t\tZum Vergrößern anklicken....[BR]Ja klar, immer. Aber bei den Kaufleuten langt ja ein kleiner Klacks daneben und schon ist es passiert, auch bei den Münz-Kaufleuten."}, {"12": "Francesco Borromini schrieb:\t\t\tWichtig wäre, dass möglichst alle Spieler nur Angebote annehmen, die einen Hut haben, und die anderen stehen lassen. Denn dann bleiben Mangelgüter im Markt, die niemand produzieren musste (die Kaufleute nehmen die ja aus dem Nirgendwo, und der Spieler, der neben dem Angebot in der Liste steht, hat nichts mehr davon, wenn man \"sein\" Angebot später noch annimmt).\t\tZum Vergrößern anklicken....Nach meiner Erfahrung tun das die Spieler auch, allerdings profitierst Du davon nur, wenn Du Dein Hauptgebäude möglichst schnell ausbaust, denn es gibt bereits bei den 2000er (u. 2200) Zylinder-Angeboten ein Übermaß, und die 1800er erscheinen viel zu weit hinten, daß darauf noch jemand zurückgreifen würde. Zumindest in Arendyll ist es so, und im Schnitt wird am Vormittag 1x ein 2000er Angebot von mir angenommen (früher war's 2x); aber morgen kann ich eh bereits 2200er Angebote einstellen [smilie--sprite6]"}, {"60": "Ich muss jetzt mal ganz doof fragen, wie kann man den Handel für die erleuchteten Güter ohne die Kaufleute einstellen? Oder warum haben manche Angebote keinen Zylinder?"}, {"12": "Kamajo schrieb:\t\t\tIch muss jetzt mal ganz doof fragen, wie kann man den Handel für die erleuchteten Güter ohne die Kaufleute einstellen? Oder warum haben manche Angebote keinen Zylinder?\t\tZum Vergrößern anklicken....Die ohne Zylinder hatten ursprünglich mal einen, der ist aber nach 6 Std. verschwunden (wenn der Kaufleut wieder verfügbar wird)"}, {"50": "[IMG]https://i.ibb.co/KwRjyVt/https-de-forum-elvenar-com-index-php-attachments-1623573700846-png-24968.png[/IMG][BR]Der Zylinder zeigt an, dass von dem entsprechenden Spieler sich der/die Kaufleute momentan in dem 6-stündigen Countdown befindet. Die anderen Angebote des Spielers ohne Zylinder wurden zwar bereits durch den/die Kaufleute abgewickelt inkl. der abgelaufenen 6-stündigen Wartezeit, aber noch auf dem Markt unbearbeitet verweilen. Daher kommt es schon vor, dass mehr als die durch das Maximum von 5 Kaufleuten definierten Angebote von Spielern am Markt vorzufinden sind."}, {"79": "Ich glaube, das Problem würde sich deutlich entschärfen, wenn man die Angebote nach Ablauf der 6 Stunden Frist nicht mehr so lange im Markt belassen würde. Dann müssten sich die Spieler mit Nachfrage an den Angeboten mit Zylinder bedienen, bzw. selbst Angebote einstellen. Momentan ist die \"Nachlaufzeit\" - glaube ich - bei 7 Tagen, wenn ich mich nicht recht erinnere. Mir kommt das sehr lang vor. Warum gibt es das überhaupt? Und wenn, dann sollte 1 Tag doch auch reichen?!"}, {"60": "Danke für die Antworten [smilie--sprite1]"}, {"37": "also auf Winyandor hat man es als Alraunenprodder echt schwer, 86 Seiten Angebote im Markt, keine Gesuche, d.h. ich muss immer Kaufleute zukaufen, da ich mit nur 1 Kaufman einfach nicht genug Material ran bekomme. Das ist wirklich schlecht und sehr ungerecht umgesetzt"}, {"60": "Ist denn schon jemand mit dem Kapitel durch? Mich würde interessieren, ob es noch eine Quest gibt, die was mit dem \"Platz der Begegnung\" zu tun hat. Baue 6 Stück davon habe ich schon lange hinter mir gelassen und würde jetzt gern wissen, ob ich die alle abreißen kann."}, {"81": "Kamajo schrieb:\t\t\tIst denn schon jemand mit dem Kapitel durch? Mich würde interessieren, ob es noch eine Quest gibt, die was mit dem \"Platz der Begegnung\" zu tun hat. Baue 6 Stück davon habe ich schon lange hinter mir gelassen und würde jetzt gern wissen, ob ich die alle abreißen kann.\t\tZum Vergrößern anklicken....=> https://cavalieridellozombiaco.blogspot.com/p/team-spirit.html#paragrafo6[BR][BR]Machst auf klickst auf English[BR]Sonst kann ich dir leider nicht weiter helfen da ich im 16er noch herum hänge [smilie--sprite3]"}, {"60": "Dann ist die italienische nach wie vor die einzige Questline? Ok, die kenne ich - gehe ich davon aus, dass diese vollständig ist (da fehlen ja die ablehnbaren \"Zwischenquest\"), dann habe ich jetzt Aufgabe 47 erledigt. Bei mir ist jetzt eine dieser ablehnbaren Quest dran, die da heißt: schalte die Seidenmanu frei und sammele 100k Seide ein\". Ich gehe denn mal davon aus, dass ich die Plätze abreißen kann.  [smilie--sprite2] [smilie--sprite1]"}, {"12": "Kamajo schrieb:\t\t\tIst denn schon jemand mit dem Kapitel durch? Mich würde interessieren, ob es noch eine Quest gibt, die was mit dem \"Platz der Begegnung\" zu tun hat. Baue 6 Stück davon habe ich schon lange hinter mir gelassen und würde jetzt gern wissen, ob ich die alle abreißen kann.\t\tZum Vergrößern anklicken....Es kommen noch einige quests \"heiße xxx Mensch/Elv. im Park willkommen\". Ob es Deinen Segen auch zählt, wenn Du gar keinen Park mehr hast, kann ich Dir nicht sagen.[BR]Bin grad bei quest 71 (also noch nicht fertig), beim Italiener fehlt wohl einiges..."}, {"25": "Kannste abreissen, wenn du genug Portalsegen hast..."}, {"60": "Portalsegen habe reichlich und einige der Aufgaben mit \"Heiße willkommen ...\" habe ich auch schon hinter mir. Ich reiße erst mal drei weg und lasse drei noch ein bisschen stehen. Ich danke euch für eure Antworten  [smilie--sprite1]"}]