[{"2": "Kamajo schrieb:\t\t\tPortalsegen habe reichlich und einige der Aufgaben mit \"Heiße willkommen ...\" habe ich auch schon hinter mir. Ich reiße erst mal drei weg und lasse drei noch ein bisschen stehen. Ich danke euch für eure Antworten  [smilie--sprite1]Zum Vergrößern anklicken.......du kannst die auch teleportieren..."}, {"12": "Für Interessierte stell ich mal die Aufgaben ein, soweit ich bin.[BR]Wohlgemerkt, wenn man Aufgaben ablehnt verschwinden oft einige Folgeaufgaben, die gern Dias als Belohnung haben.[BR]Spoiler: quests bis 70Sammle 25.000 Göttliche Saaten einKaufe 8 WissenspunkteSammle 30.000 Unurium einGib 30 WP ausSchalte das Dimensionstor freiBaue das DimensionstorBesitze eine (Gut1++)Manufaktur & Sammle 200.000 Erweckte Güter einBesitze eine (Gut1++)Manufaktur der Stufe 16 oder höher & Schalte die Erleuchtete Marmormanufaktur der Elemente freiBesitze eine (Gut1++)Manufaktur der Stufe 24 oder höher & Schalte die Erleuchtete Stahlmanufaktur der Zwerge freiBesitze eine (Gut1++)Manufaktur der Stufe 28 oder höher & Schalte die Erleuchtete Manufaktur der gedeihenden Hölzer freiBesitze eine (Gut1++)Manufaktur der Stufe 30 oder höher & Verwende 10 ZaubersprücheBesitze eine (Gut1++)Manufaktur der Stufe 32 oder höher & Verwende 10 SegenSammle 1.000 Erleuchtete Güter ein & Besitze mindestens 3 Basismanufakturen der Stufe 32 oder höherSpende 1.000 Urwelt-MineralienSchalte den Überragenden Verkäufer freiNimm 6 Handelsangebote anHandle 4x mit dem Händler & Erkunde eine ProvinzBesitze einen Händler der Stufe 7Schalte den Produktionsbonus für Erleuchtete Güter freiHeuere einen Kaufmann an oder nutze ihn 10xSammele 40.000.000 Münzen einProduziere 1 Kessel von Haugur (ablehnbar)Produziere 1 Samowar von Heropi (ablehnbar)Produziere 1 Kräuterkorb von Gaelagil (ablehnbar)Produziere 1 Heiße Wanne von Aelrindel (ablehnbar)Produziere 1 Luftreiniger von Aeon (ablehnbar)Produziere 1 Karaffe von Calma (ablehnbar)Schalte die Teampark-Straße frei & Besitze mindestens 12 Felder der Teampark-StraßeSchalte das Authentische Hauptgebäude freiSchalte den Platz der Begrüßung freiBesitze 3 Plätze der Begrüßung & Heiße 2.000 Elvenar im Park willkommenBesitze 1 Wasserzentrum & Besitze 1 FeuerzentrumBesitze 1 Windzentrum & Besitze 1 ErdzentrumVerdiene 100 AktivitätsmedaillenZüchte 100 Baby-ElementareSchließe 10 Prüfungen ab (Abzeichen des Teamgeists produzieren)Schalte die Authentischen Wohngebäude freiBenutze den Kaufmann 5x & Sammle 50.000 Erleuchtete Güter einNimm 6 Handelsangebote an & Leiste 30x NachbarschaftshilfeBesitze mindestens 10 Wohngebäude der Stufe 40Schalte die Verbesserungen der Dünenkristall-Manufaktur frei & Sammle 100.000 Kristalle oder Obsidian ein (ablehnbar)Spende 20.000 UnuriumBesitze 12 ElementarzentrenBesitze 6 Plätze der BegrüßungBesitze ein Dimensionstor der Stufe 2Verdiene 50 Abzeichen des TeamgeistsSchalte Elementarzentren 2 freiBesitze mindestens 4 Elementarzentren der Stufe 2Baue dein Hauptgebäude auf Stufe 41 aus (ablehnbar)Verwende 10 SegenHeiße 5.000 Elfen im Park willkommenSchalte die Verbesserungen der Schriftmanufaktur der Drachen frei & Sammle 100.000 Schriftrollen oder Zaubertinte ein (ablehnbar)Besitze mindestens 1 Veredelte Manufaktur der Stufe 32 oder höher (ablehnbar)Besitze ein Dimensionstor der Stufe 3Verdiene 100 Abzeichen des Teamgeists & Heiße 10.000 Leute im Park willkommenLeiste 50x NachbarschaftshilfeVerdiene 400 Aktivitätsmedaillen mit dem Element Feuer & Züchte 100 FeuerelementareVerdiene 400 Aktivitätsmedaillen mit dem Element Wasser & Züchte 100 WasserelementareVerdiene 400 Aktivitätsmedaillen mit dem Element Erde & Züchte 100 ErdelementareVerdiene 400 Aktivitätsmedaillen mit dem Element Wind & Züchte 100 WindelementareSammle 80.000 Erleuchtete Güter einHeiße 6.000 Elvenar im Park willkommen & Verdiene 150 Abzeichen des TeamgeistsSchalte die Verbesserungen der Seidenmanufaktur der Feen frei & Sammle 100.000 Seide oder Königlichen Samt ein (ablehnbar)Besitze mindestens 2 Veredelte Manufakturen der Stufe 32 oder höher (ablehnbar)Besitze ein Dimensionstor der Stufe 4 & Hab 540 Provinzen abgeschlossenSchalte Elementarzentren 3 freiBesitze mindestens 12 Elementarzentren der Stufe 3 & Heiße 10.000 Menschen im Park willkommenSchließe 1 Prüfung ab (ablehnbar)Sammle 20 Visionsschwaden (ablehnbar)Besitze mindestens 50 Felder der Zusammenhalt-Straße in deiner Stadt"}, {"60": "Romilly schrieb:\t\t\t...du kannst die auch teleportieren...\t\tZum Vergrößern anklicken....Da sind mir meine Teleporter zu schade für  [smilie--sprite2]"}, {"66": "Kamajo schrieb:\t\t\tIst denn schon jemand mit dem Kapitel durch? Mich würde interessieren, ob es noch eine Quest gibt, die was mit dem \"Platz der Begegnung\" zu tun hat. Baue 6 Stück davon habe ich schon lange hinter mir gelassen und würde jetzt gern wissen, ob ich die alle abreißen kann.\t\tZum Vergrößern anklicken....[BR]Ich bin fertig mit K18 - wenn du die Quest mit den 6 Plätzen hinter dir hast, kannst du die Plätze definitiv abreißen. Die Quests, in denen man irgendwelche Menschen oder Elvenarer oder was auch immer \"willkommen heißen\" soll, kannst du mit Portalsegen erfüllen.[BR][BR]Ich hatte drei gebaut, nach der ersten Quest ins Inventar. Bei der zweiten wieder raus und drei dazu gebaut  - und danach alle sofort abgerissen. Den Platz kann man sich sparen und für nützliche Dinge verwenden. Ich habe diese Menschen etc. komplett mit Portalsegen gemacht und jetzt nach Ende des Kapitels mehr Portalsegen im Inventar wie vorher [smilie--sprite1]"}, {"69": "Das Kapitel 18 hat irgendwie spannend begonnen, und Freude gemacht.[BR][BR]Jetzt, im Endstadium, ist es nur mehr langweilig. Abzeichen, Abzeichen, Abzeichen.... Nicht einmal mehr Quests zur GR. Da ist den Entwicklern offenbar mitten drin der Faden gerissen. Oder es ist eine Anweisung der Inno-Leitung gekommen, Dias-Käufe zu produzieren ![BR]Schade .."}, {"46": "achilles7453 schrieb:\t\t\tDas Kapitel 18 hat irgendwie spannend begonnen, und Freude gemacht.[BR][BR]Jetzt, im Endstadium, ist es nur mehr langweilig. Abzeichen, Abzeichen, Abzeichen.... Nicht einmal mehr Quests zur GR. Da ist den Entwicklern offenbar mitten drin der Faden gerissen. Oder es ist eine Anweisung der Inno-Leitung gekommen, Dias-Käufe zu produzieren ![BR]Schade ..\t\tZum Vergrößern anklicken....[BR]Die Unterhaltung haben wir gestern in der Gemeinschaft auch geführt...Wir waren wirklich angetan von Kapitel 18 und auch der Story ... und dann wird es plötzlich tot langweilig.... es fehlen noch 2000 Abzeichen... Quest sind auch nur noch ein paar da  und so wird Kapitel 18 leider auch nur noch eintönig und einen bitteren Nachgeschmack behalten... Man hätte doch noch reichlich Möglichkeiten für Quest gehabt... Oder dürfen es wegen der Drachenarche nicht mehr so viele Hauptquests sein?  [BR]Wirklich schade, denn ich habe meine Gildies immer angespornt weiter zu machen, weil Kapitel 18 so lohnenswert ist. Jetzt bin ich froh, dass da GA läuft und man wenigstens etwas Ablenkung hat [smilie--sprite3](("}, {"69": "Das Ende der GR18 schläfert mich so ein, dass ich zu nichts mehr Lust habe. Es geht auch den anderen Gildis so. Deshalb wird das Ga einfach links liegen gelassen."}, {"57": "der Schluss ist wirklich zäh und zieht sich endlos, so langsam und so viele Abzeichen am Schluss hätten es wirklich nicht sein müssen. Nur damit man diese Gastrasse künstlich in die Länge zieht. [BR]Urwelt-Mineralien gibts auf Wynandor noch immer nicht im Überfluss, nichtmal 1 Seite im Angebot, aber mittlerweile gibts nette Helfer in der Gilde und irgendwie wurstelt sich jeder mit gegenseitiger Hilfe durch. [BR]Das einzig gute am Schluss ist der Tempel der Geister, dadurch löst sich wenigstens das Unurium-Problem von anfangs auf."}, {"69": "LuxuriantSilver schrieb:\t\t\tDas einzig gute am Schluss ist der Tempel der Geister, dadurch löst sich wenigstens das Unurium-Problem von anfangs auf.\t\tZum Vergrößern anklicken....Hast du schon einmal nachgerechnet, wie viele Stufen der Tempel braucht, um was Brauchbares zu liefern? Den werden wieder nur die Akks oben haben, die Wunder wirken können. Siehe Wikiner, der hat ihn auf 31 ( einen Tag nach der Erforschung auf 25 !!?? ). Im unteren Bereich ist sogar das Unur-Museum gut dagegen. Außerdem: Wozu brauchen wir noch Unurium, wenn die Ausbauten der Manus erledigt sind?"}, {"17": "achilles7453 schrieb:\t\t\tAußerdem: Wozu brauchen wir noch Unurium, wenn die Ausbauten der Manus erledigt sind?\t\tZum Vergrößern anklicken....weil es auch ein Kapitel 19 geben wird, wo es noch mehr braucht^^ das ist der neue Rohstoff nach Mana und Saat."}, {"4": "[IMG]https://i.ibb.co/k89HNxR/https-de-forum-elvenar-com-index-php-attachments-team-jpg-25701.jpg[/IMG][BR][BR]Teamgeist Portal[BR][BR]Produziert werden können diese Dinge. Allerdings ist mir absolut nicht klar, wofür sie überhaupt gebraucht werden. Ich kann sie weder in der Forschung noch in den einzelnen Manufakturen bei Erde, Wasser, Feuer oder Luft finden.[BR][BR]Wofür werden sie also benötigt?"}, {"1": "Das sind die Abzeichen des Teamgeists wo du da herstellst. Du brauchst sie in der Forschung. [smilie--sprite1] [BR][IMG]https://i.ibb.co/30PCGz8/https-de-forum-elvenar-com-index-php-attachments-teamgeist-jpg-25702-hash-3cbdc27c14414d556ed8ec04b4.jpg[/IMG]"}, {"4": "Danke erst mal für die schnelle Antwort.[BR][BR]das bedeutet, ich produziere diese Abzeichen und erhalte dann dafür das Abzeichen des Teamgeistes, das ich in der Forschung brauche? Steht aber nirgends?"}, {"2": "....kleiner Tipp - es ist zwar egal, welche Prüfung du abschließt - du bekommst für jede genau 1 Abzeichen - aber wenn du alle 5 gleichmäßig produzierst, verbrauchst du von jeder Teammedaille (die Produktion aus den Elementarzentren) genau 30 Stück für einen Durchlauf - für eine ausgeglichene Produktion der Medaillen klickst du in allen 4 Zentren immer die gleiche Position (also z.B. oben rechts) an...(klappt natürlich nur, wenn du von allen 4 Zentren immer die gleiche Anzahl hast)...wenn das Portal mal auf Stufe 4 ist, dauert ein Durchlauf (mit 5 Slots) 2 Stunden..."}, {"4": "danke schön, dann guck ich mir das nochmals an, derzeit hab ich nämlich noch nichts produziert davon."}, {"11": "achilles7453 schrieb:\t\t\tDas Kapitel 18 hat irgendwie spannend begonnen, und Freude gemacht.[BR][BR]Jetzt, im Endstadium, ist es nur mehr langweilig. Abzeichen, Abzeichen, Abzeichen.... Nicht einmal mehr Quests zur GR. Da ist den Entwicklern offenbar mitten drin der Faden gerissen. Oder es ist eine Anweisung der Inno-Leitung gekommen, Dias-Käufe zu produzieren ![BR]Schade ..\t\tZum Vergrößern anklicken....Das Problem ist, wenn man kein Turmspieler ist, bekommt man keine zeit Booster und ohne dauert es Jahre.[BR][BR]alle 2 Std 5 Abzeichen, das zieht sich über Jahre wenn man nicht sehr oft online ist.[BR][BR]Inno könnte ja Zeitbooster im Event als preis geben, aber die gibt es nur noch im Turm."}, {"6": "Schnalle 04 schrieb:\t\t\tDas Problem ist, wenn man kein Turmspieler ist, bekommt man keine zeit Booster und ohne dauert es Jahre.\t\tZum Vergrößern anklicken....Oder man nimmt alle entsprechenden Rezepte im Handwerk an, also 4x 2h, 7x 1h und auch alle kleineren. So habe ich meinen Vorrat an Zeitboostern angelegt und bin dadurch relativ schnell durch die Endphase der Forschung gekommen.[BR]Das gleiche mache ich bereits jetzt für Kapitel 19."}, {"11": "salandrine schrieb:\t\t\tdanke schön, dann guck ich mir das nochmals an, derzeit hab ich nämlich noch nichts produziert davon.\t\tZum Vergrößern anklicken....Im Wind,Feuer , Wasser und Erdzentrum machst du die zutaten, wo du im Dimensionentor die Abzeichen für die Forschungen machst, du brauchst dann zwischen 200 und 300 Abzeichen pro Forschung, und bei 5 Abzeichen alle 2 stunden, fang früh an zu produzieren[BR][BR]und wenn du dann Alraunen als Bonusgut hat, braucht du sehr sehr viel Geduld, in meiner Welt will das fast niemand"}, {"12": "Nach dem heutigen update sind ja alle questgeber auf den grünen Haken gesprungen.[BR]Ich hoffe, daß dadurch nicht auch quests im Nirvana verschwunden sind wie bei Ablehnungen.[BR]Kann jemand bestätigen, ob meine Folge normal ist oder ob dazwischen etwas fehlt ?[BR][BR]Spoiler: quests72 - Schalte die Giftigen Wespenreiter II frei & Kämpfe und siege in 8 Provinzbegegnungen (ablehnbar)[BR]73 - Besitze mindestens 3 Werkstätten der Stufe 41 oder höher"}, {"1": "@Ayla Ayla Schaust du hier: Zur Fehlermeldung"}]