[{"12": "Tacheless schrieb:@Ayla Ayla Schaust du hier: Zur FehlermeldungZum Vergrößern anklicken....Danke Tacheless,[BR]aber das beantwortet nicht meine Frage, ob zwischen meiner 72. und 73. Aufgabe prinzipiell noch andere lägen.[BR]Als ich mal eine Aufgabe abgelehnt hatte, hatte der Questgeber einige Aufgaben übersprungen (was ich damals noch nicht wußte), und da die 72. Aufgabe ablehnbar war, könnte das durch den Fehler wieder geschehen sein.[BR]Ich will ja schließlich meinen Gemeinschaftsmitgliedern eine vollständige Aufgabenliste hinterlassen und nicht eine mit Lücken.[BR]Oder wäre eine vollständige Aufgabenliste irgendwo zu finden (zum Vergleichen) ?"}, {"1": "Durch den Fehler sollten keine Quests übersprungen sein. Du kannst halt einfach nur die aktuelle Quest auf erledigt setzen, also die Belohnung abholen, obwohl du die Voraussetzungen gar nicht erfüllt hast."}, {"2": "Ayla Ayla schrieb:\t\t\tDanke Tacheless,[BR]aber das beantwortet nicht meine Frage, ob zwischen meiner 72. und 73. Aufgabe prinzipiell noch andere lägen.[BR]Als ich mal eine Aufgabe abgelehnt hatte, hatte der Questgeber einige Aufgaben übersprungen (was ich damals noch nicht wußte), und da die 72. Aufgabe ablehnbar war, könnte das durch den Fehler wieder geschehen sein.[BR]Ich will ja schließlich meinen Gemeinschaftsmitgliedern eine vollständige Aufgabenliste hinterlassen und nicht eine mit Lücken.[BR]Oder wäre eine vollständige Aufgabenliste irgendwo zu finden (zum Vergleichen) ?\t\tZum Vergrößern anklicken......ich hatte auch 2 ablehnbare Quests offen und nachdem ich die nun \"erfüllt\" habe sind ganz normal die Folge-Nebenquests erschienen...nach diesen müsste es mit der Hauptquestreihe (nicht ablehnbar) weitergehen...[BR][BR][IMG]https://i.ibb.co/km7CzRz/https-de-forum-elvenar-com-index-php-attachments-k18am-png-25728.png[/IMG]...darauf folgte...[IMG]https://i.ibb.co/4J9W1T5/https-de-forum-elvenar-com-index-php-attachments-k18aq-png-25731.png[/IMG][BR][BR][IMG]https://i.ibb.co/9gDQdT7/https-de-forum-elvenar-com-index-php-attachments-k18ao-png-25729.png[/IMG]...darauf folgte..[IMG]https://i.ibb.co/JmrvPFc/https-de-forum-elvenar-com-index-php-attachments-k18ap-png-25730.png[/IMG]"}, {"82": "Warum heissen die Portalsegen eigentlich noch Portalsegen wenn sie nichts aus dem Portal bringen ?Da hat Inno sich wohl selbst nicht verstanden ? Mit diesen blöden Abzeichen die Rasse ins unendliche zu ziehen! Kein Wunder wenn die Leute vor langer Weile aufhören."}, {"4": "Elvarius schrieb:\t\t\tWarum heissen die Portalsegen eigentlich noch Portalsegen wenn sie nichts aus dem Portal bringen ?Da hat Inno sich wohl selbst nicht verstanden ? Mit diesen blöden Abzeichen die Rasse ins unendliche zu ziehen! Kein Wunder wenn die Leute vor langer Weile aufhören.\t\tZum Vergrößern anklicken....ist das eine rein rhetorische Frage? Wenn du in Kapitel 18 bist, müßtest du es ja eigentlich wissen.[BR][BR]Bei Einführung und noch ne Weile danach haben die Portalsegen auch die Portalsachen geboostet."}, {"82": "salandrine schrieb:\t\t\tist das eine rein rhetorische Frage? Wenn du in Kapitel 18 bist, müßtest du es ja eigentlich wissen.[BR][BR]Bei Einführung und noch ne Weile danach haben die Portalsegen auch die Portalsachen geboostet.\t\tZum Vergrößern anklicken....Ja genau aber nun leider nicht mehr ! also haben sie den Namen Portalsegen nicht mehr verdient und warum gibt es die dann noch so oft ! gerade im Turm beim Endboss ! da würde ich dann lieber ne schmiede nehmen denn die hat noch einen nutzen gegenüber dem angeblichen Portalsegen !"}, {"6": "Hmm, also mir haben die Portalsegen bei Kapitel 18 sehr geholfen. [BR]Menschen, Elfen und Elvenar bei Bedarf abrufbar und viel Platz gespart, weil keine Platz der Begrüßung erforderlich waren.[BR]Aber wahrscheinlich hast Du einfach eine andere Spielweise. [smilie--sprite2]"}, {"40": "So etwas ist doch immer eine Frage der Spielweise![BR][BR]Aber grundsätzlich: Ganz viele Spieler freuen sich über die Portalsegen aus dem Turm. Ihnen helfen diese Dinger wirklich, gut durch die Gastrasse zu kommen. Wem sie nicht helfen, der sollte trotzdem Verständnis dafür aufbringen, dass die Preise im Turm so sind, wie sie sind.[BR][BR]Und nun meine persönliche Meinung:[BR]Ich denke nicht, dass der Turm dafür prädestiniert ist, jede Woche immer komplett bis ganz nach oben zu gehen. Das ist viel zu rohstoff- und/oder einheitenintensiv. Ich denke man hat Freude an ihm, wenn man sich manche Woche auch mal nur mit der untersten Ebene zufriedengibt."}, {"6": "Dominus00 schrieb:\t\t\tIch denke nicht, dass der Turm dafür prädestiniert ist, jede Woche immer komplett bis ganz nach oben zu gehen. Das ist viel zu rohstoff- und/oder einheitenintensiv.\t\tZum Vergrößern anklicken....Das sehe ich nicht so. Ich setze am Dienstag um 19 Uhr +75% Lebenspunkte und je +100 bis 150% Kampfkraft für leichte Fern und magische. Im Turnier reicht das (je nach Turniertyp) für 25 bis 35 Provinzen. Den Turm erledige ich dann sonntags mit ein paar Zeitboostern ganz leicht und ohne übermäßige Verluste komplett im Autokampf.[BR][BR]Dazu muss man natürlich alle Features von Elvenar nutzen - alles ist miteinander verzahnt."}, {"2": "...ihr seid hier übrigens im Feedbackthread zu Kapitel 18  [smilie--sprite2] ..."}, {"6": "Hast ja recht, so ein Abdriften passiert schon mal. [smilie--sprite1][BR][BR]Edit:[BR]Da aber ja alles miteinander verzahnt ist:[BR]Die gelegentlichen Dschinns aus dem Turm sammle ich immer bis zum Beginn der nächsten Gastrasse. Mit etwas Glück konnte ich 6 Dschinns zu Beginn von Kapitel 18 setzen. Saat und Mana aus den Dschinns waren eine große Hilfe beim Kapitel 18. Speziell die Saat, da man ja gezwungen ist, den Händler zwischendurch auf Unurium umzustellen."}, {"2": "ustoni schrieb:\t\t\tSaat und Mana aus den Dschinns waren eine große Hilfe beim Kapitel 18. Speziell die Saat, da man ja gezwungen ist, den Händler zwischendurch auf Unurium umzustellen.\t\tZum Vergrößern anklicken.......ja - und das aktuelle Event hat auch sehr geholfen - hab gestern über 300.000 Saat erdreht [smilie--sprite1]...."}, {"83": "ustoni schrieb:\t\t\tDas sehe ich nicht so. Ich setze am Dienstag um 19 Uhr +75% Lebenspunkte und je +100 bis 150% Kampfkraft für leichte Fern und magische. Im Turnier reicht das (je nach Turniertyp) für 25 bis 35 Provinzen. Den Turm erledige ich dann sonntags mit ein paar Zeitboostern ganz leicht und ohne übermäßige Verluste komplett im Autokampf.[BR][BR]Dazu muss man natürlich alle Features von Elvenar nutzen - alles ist miteinander verzahnt.\t\tZum Vergrößern anklicken.... [BR]wo nimmst du die + 75 % Lebenspunkte und +100- 150% für leichte Fernkampf und Magier her??[BR]Klar Kloster und Nadeln geben ein paar % (bei mir Kloster auf 23 \"satte\" + 24 % und Nadeln auf 24 immerhin +33 %. Waffenschmieden hab ich schon seit Wochen nicht mehr gesehen, obwohl ich regelmäßig bis oben geh (bzw. gegangen bin),  mit den Kampfboostern in der Aka ist inno dermaßen geizig, dass ich schon froh bin, wenn ich wöchentlich 1x alle drei aufstellen kann......[BR]gibts da irgendeinen Trick, um an mehr zu kommen, den ich nicht kenn."}, {"6": "Klappt bei mir eigentlich ganz gut im Handwerk. Nur die Lebenspunkte machen sich etwas rar. Deshalb setze ich normalerweise 1x Waffenschmiede und 1x Lebenspunkte. Bei 28x Rezepte je Woche sollte eigentlich immer was dabei sein.[BR]Wenns mal eine längere Durststrecke gibt, setze ich eben entsprechend weniger Booster und mach nur 20 Provinzen.[BR]+50% Lebenspunkte sind aber absolutes Minimum für den Turm.[BR][BR]Werte aus den Wundern kommen natürlich noch hinzu."}, {"83": "du sagst es: \" sollte\"[BR]ist aber nicht, trotz den 28 Rezepten die Woche. Hab mir mal wieder ne Tabelle gemacht, in die ich ALLE  Rezepte der Aka sortiert nach Datum und 1-4 eintrag..... innerhalb von 2 Wochen grad 1 x Magie und 1 x Lebenspunkt, dafür 5 x Verkaufsstand, 8 mal diverse reisende Händler,  7 x irgendwelche komischen Kodices... usw......Waffenschmiede- Fehlanzeige. Schieb grad mal wieder ordentlichen Frust....[smilie--sprite4]"}, {"6": "Der Zufallsgenerator ....[BR]Hoffe nur, dass mir so eine Strecke erspart bleibt.[BR][BR]Hab gerade nochmal nachgesehen (plotte den Turm seit 4 Wochen mit). In den letzten 4 Türmen 6 Waffenschmieden, davon 2 aus goldenen Truhen.[BR]Hatte früher aber auch schon nicht eine in mehreren Wochen."}, {"2": "...huhu - es geht eigentlich hier immer noch um Kapitel 18 - verlagert das doch mal in eine PN oder in den passenden Thread..."}, {"82": "Romilly schrieb:\t\t\t...ja - und das aktuelle Event hat auch sehr geholfen - hab gestern über 300.000 Saat erdreht [smilie--sprite1]....\t\tZum Vergrößern anklicken....ist das Kapitel 18?    bist du jetzt die Forumspolizei?[BR][BR]@ustoni [BR]\"Hmm, also mir haben die Portalsegen bei Kapitel 18 sehr geholfen.[BR]Menschen, Elfen und Elvenar bei Bedarf abrufbar und viel Platz gespart, weil keine Platz der Begrüßung erforderlich waren.[BR]Aber wahrscheinlich hast Du einfach eine andere Spielweise. [smilie--sprite2]\"[BR][BR]ja klar haben sie geholfen aber nicht was die Portalpoduktion angeht denn da hätten sich viele ne menge zeit (Wochen) ersparen können anstatt alle  2 std ans Portal gehen zu müssen um wieder nur 5 Abzeichen abzuholen."}, {"1": "@Elvarius Was ist daran verkehrt, wenn auch Forenmitglieder daran erinnern, beim eigentlichen Thema zu bleiben?[BR][BR]Generell: Was ist so schwer daran, wenn man merkt, es wird Offtopic, einen geeigneten Thread zu suchen oder gar einen neuen Thread genau für das Thema zu eröffnen?"}, {"82": "Tacheless schrieb:@Elvarius Was ist daran verkehrt, wenn auch Forenmitglieder daran erinnern, beim eigentlichen Thema zu bleiben?[BR][BR]Generell: Was ist so schwer daran, wenn man merkt, es wird Offtopic, einen geeigneten Thread zu suchen oder gar einen neuen Thread genau für das Thema zu eröffnen?\t\tZum Vergrößern anklicken....wahrscheinlich nichts aber wenn man selber was schreibt das nicht dazu gehört ?  bei uns heisst es immer \"erst mal an die eigene Nase fassen \"[BR][BR]Ich habe mich ja auf das Kapitel 18 bezogen mit der aussage das die Portalsegen nicht das machen wozu sie da sind ,oder ist der Platz der Begrüßung das Portal?!"}]