[{"6": "Um das Thema Portalsegen mal abzuschließen:[BR][BR]Im Portal werden alle Artikel gelagert, die mit der Gastrasse zu tun haben. Damit ist der Bezug schon mal gegeben.[BR]Wenn Du mal ein Mouseover über einem Portalsegen machst, findest Du auch die Definition des Portalsegens:[BR][IMG]https://i.ibb.co/HVCFj6M/https-de-forum-elvenar-com-index-php-attachments-portal-jpg-25778.jpg[/IMG][BR]\"Füllt x% aller aktuell begrenzten Güter des Gastvolkes auf.\"[BR]Es sind nun mal nicht immer die Endprodukte des Portals, die begrenzt sind (also eine maximale Kapazität haben).[BR]Damit macht der Portalsegen genau das, was er soll."}, {"2": "Elvarius schrieb:\t\t\twahrscheinlich nichts aber wenn man selber was schreibt das nicht dazu gehört ? bei uns heisst es immer \"erst mal an die eigene Nase fassen \"\t\tZum Vergrößern anklicken........schön, daß du dazu meinen Satz mit der Saat zitiert hast - JAAA, Saatmangel ist ein wichtiges Thema in Kapitel 18 und Hinweise, wie man Saat bekommen kann (Event) sind da hilfreich... [smilie--sprite2]"}, {"62": "Auch wenn es hier um Kapitel 18 geht:[BR]Nach Hinweis von einem Gemeinschaftsmitglied hier schon das Logo/Wappen von Kapitel 19 (sichtbar im Hauptgebäude auf den \"Liveservern\" im Browser):[BR][IMG]https://i.ibb.co/s2b05wp/https-de-forum-elvenar-com-index-php-attachments-1628505316382-png-25780.png[/IMG]"}, {"4": "Sreafin schrieb:\t\t\tAuch wenn es hier um Kapitel 18 geht:[BR]Nach Hinweis von einem Gemeinschaftsmitglied hier schon das Logo/Wappen von Kapitel 19 (sichtbar im Hauptgebäude auf den \"Liveservern\" im Browser):[BR]Anhang 25780 ansehenZum Vergrößern anklicken....und die Anordnung der normalen güter, erweckten und erleuchteten Güter in getrennten Reitern zum umschalten ist doch auch neu"}, {"54": "Ich hab mich ja zuletzt mal zur Gastrasse \"Die Händler von Unur\" ziemlich negativ geäußert (wozu ich auch immer noch stehe), nun hab ich das neue Kapitel \"Teamgeist\" abgeschlossen und möchte daher hier mal ein Lob loswerden:[BR][BR]Ich habe sofort gemerkt, dass sich Inno die (berechtigte) Kritik an den Unur-Händlern doch zu Herzen genommen hat ![BR][BR]GR-Gebäude können auf Stufen ausgebaut werden und in der Erfüllung der Produktionen kann man wirklich mal sein \"Gehirn einschalten\" und mit cleverer Taktik die eine oder andere Zeiteinheit ersparen.[BR]Wirklich schön durchdacht und gemacht ![BR][BR]Ich hatte nie das Gefühl, dass es wirklich lange dauert, kam gut vorwärts und hatte Spass an den \"Figuren\" der Zentren, die auch durch ihre Optik etwas Spielspass vermittelten.[BR][BR]Im Gegensatz zur \"immensen Langeweile\" der Unurs, das ewigen Kleinkram sammeln und doch nie Vorwärtskommens ohne das sich optisch etwas änderte, wirklich eine \"Erholung\" - gerne weiter so ![BR][BR]Kurz zum Thema Portalsegen: finde ich sehr gut gelöst: erstens Ersparnis von Zeit und Recourcen-Produzieren wie immer, zweitens sollen ja die Portalsegen nicht eine ganze Gastrasse ersetzen wie in früheren Kapiteln, sondern eben nur \"hilfreich zur Seite stehen\".[BR]Und das ist gelungen, finde ich.[BR][BR]HdW"}, {"2": "salandrine schrieb:\t\t\tund die Anordnung der normalen güter, erweckten und erleuchteten Güter in getrennten Reitern zum umschalten ist doch auch neu\t\tZum Vergrößern anklicken.......das ist schon seit Einführung von Kapitel 18 bzw. der erleuchteten Güter so...(vermutlich aus Platzmangel)..."}, {"11": "Ich habe 2 Platz der Begrüßung und brauche  Portalsegen sehr selten.[BR][BR]Durch die Spaßbremse alle 2 std 5 Abzeichen, zieht sich das sehr in die länge.[BR][BR]Wer nicht Turm ohne ende spielt und wenig Zeitbooster hat, braucht nicht 3 Monte , auch nicht 4 Monate , sondern Jahre"}, {"54": "Schnalle 04 schrieb:\t\t\tIch habe 2 Platz der Begrüßung und brauche  Portalsegen sehr selten.[BR][BR]Durch die Spaßbremse alle 2 std 5 Abzeichen, zieht sich das sehr in die länge.[BR][BR]Wer nicht Turm ohne ende spielt und wenig Zeitbooster hat, braucht nicht 3 Monte , auch nicht 4 Monate , sondern Jahre\t\tZum Vergrößern anklicken....[BR]der braucht  mit Recht \"Jahre\" ...[BR][BR]Ein Spiel hat viele Spiel-Features, die alle ineinander greifen und auch daher alle gespielt werden müssen, um gut vorwärts zu kommen.[BR]Dazu zählt das Turnier (Relikte) genauso wie der Turm (Zeitbooster, Dschinns, Dias und andere), die Akademie (viele Zeitbooster) oder die Events.[BR][BR]Wer nun das eine oder andere glaubt weglassen zu können und trotzdem schnell vorwärts zu kommen, der hat dann eben falsch gedacht.[BR][BR]Der Turm wirft mit der Aka zusammen genug 1h oder 2h Booster ab, um auch dieses \"Hindernis\" schnell erledigen zu können.[BR][BR]Wer eben keine Zeitbooster erspielt oder erspielen will, der braucht dann eben viel länger.[BR]Aber man weiß ja immer, was man tun muss , um schneller vorwärts zu kommen (mit spielerischen Mitteln).[BR][BR]HdW[BR][BR]ps kleiner Tip noch: [BR]wenn man in der Aka erspielte Zeitbooster abholt, bevor das nächste Set aufgeblättert wird, erhält man jedes mal wieder Zeitbooster im neuen Set. Lässt man die stehen, werden im neuen Set nie neue Zeitbooster angeboten"}, {"84": "HerrderWelten; vielen herzlichen Dank für diesen sehr guten Rat, ich stelle in der AKA fast nur Zeitpooster her, da ich sie auch mal gerne für schnelleres ausbauen von verschiedene Gebäude verwende, und so kann ich doch gezielter herstellen, [BR]Danke nochmals,[BR]lg Marzena"}, {"11": "Im Events gibt es keine Zeitbooster mehr, man hat die abgeschafft weil es die ja im super Turm gibt"}, {"54": "Schnalle 04 schrieb:\t\t\tIm Events gibt es keine Zeitbooster mehr, man hat die abgeschafft weil es die ja im super Turm gibt\t\tZum Vergrößern anklicken....warum schreibst du das hier ?[BR]Wir hatten nur von Turm und Aka geschrieben, nicht von den Events, hat ja auch nichts mehr mit der GR \"Teamgeist\" zu tun.[BR][BR]HdW"}, {"11": "HerrderWelten schrieb:\t\t\twarum schreibst du das hier ?[BR]Wir hatten nur von Turm und Aka geschrieben, nicht von den Events, hat ja auch nichts mehr mit der GR \"Teamgeist\" zu tun.[BR][BR]HdW\t\tZum Vergrößern anklicken....Turm ist super weiter so^^"}, {"85": "Ist es gewollt oder ein Fehler, dass in einer Quest der Ausbau von Manufakturen auf Stufe 32 oder höher gefordert wird, wobei die Stufe 32 doch die maximal mögliche ist?"}, {"2": "Fuenarb schrieb:\t\t\tIst es gewollt oder ein Fehler, dass in einer Quest der Ausbau von Manufakturen auf Stufe 32 oder höher gefordert wird, wobei die Stufe 32 doch die maximal mögliche ist?\t\tZum Vergrößern anklicken.......ist bestimmt so gewollt - es gibt in Kapitel 18 nur jeweils einen Ausbau (von 31 auf 32)..."}, {"85": "Wenn es gewollt ist, dann ist es ziemlich schwachsinnig.  Die Aufgabe müsste dann lauten, baue auf Stufe 32 auf. Höher geht ja nicht. Für mich ist dies eher ein Fehler in der Questbeschreibung."}, {"86": "Fuenarb schrieb:\t\t\tWenn es gewollt ist, dann ist es ziemlich schwachsinnig. Die Aufgabe müsste dann lauten, baue auf Stufe 32 auf. Höher geht ja nicht. Für mich ist dies eher ein Fehler in der Questbeschreibung.\t\tZum Vergrößern anklicken....Bitte vergiss nicht, dass sich das Spiel immer weiter entwickelt. Irgendwann gibt es Kapitel 19, 20, 21,... und es wird weitere Ausbauten dieser Gebäude geben. Man müsste dann jedes Mal rückwirkend alle Questtexte anpassen, weil es dann ja ein höher gibt. Die Texte also jetzt anzupassen und beim nächsten Kapitel wieder zu ändern halte ich nicht für sinnvoll. Von daher kann ich damit leben, wenn sie gleich und höher schreiben, auch wenn es wahrscheinlich eher durch copy und paste, als durch mitdenken, entstanden ist. [smilie--sprite1]"}, {"85": "Supernico schrieb:\t\t\tBitte vergiss nicht, dass sich das Spiel immer weiter entwickelt. Irgendwann gibt es Kapitel 19, 20, 21,... und es wird weitere Ausbauten dieser Gebäude geben. Man müsste dann jedes Mal rückwirkend alle Questtexte anpassen, weil es dann ja ein höher gibt. Die Texte also jetzt anzupassen und beim nächsten Kapitel wieder zu ändern halte ich nicht für sinnvoll. Von daher kann ich damit leben, wenn sie gleich und höher schreiben, auch wenn es wahrscheinlich eher durch copy und paste, als durch mitdenken, entstanden ist. [smilie--sprite1]Zum Vergrößern anklicken....[BR]Das vergesse ich nicht. Nur wer arbeitet eine Aufgabe aus einem vorhergehenden Kapitel später noch ab? Ich finde schon, dass die Quests eindeutig sein sollten. Die Mühe dafür ist überschaubar."}, {"2": "...jetzt ist der Groschen gefallen - du beziehst dich nur auf das \"oder höher\" - ja, das könnte durchaus weg [smilie--sprite2] - ist eher so ein Copy&Paste - es stört aber auch nicht wirklich...."}, {"87": "Fuenarb schrieb:\t\t\tNur wer arbeitet eine Aufgabe aus einem vorhergehenden Kapitel später noch ab?\t\tZum Vergrößern anklicken....Es geht um die, die die Quest erhalten, wenn es dann die weiteren Kapitel gibt und somit auch ein \"oder höher\"."}, {"54": "ihr habt Probleme ...  (sorry)"}]