[{"30": "So, dann gebe ich mal mein abschliessendes Feedback ab (bin zwar noch nicht ganz durch, aber da tut sich jetzt nicht mehr viel [smilie--sprite1] )[BR][BR]Mir gefällt die neue Gastrasse, die Produktionsvarianten finde ich tatsächlich gut. Aber wenn man der Questline folgt, verdirbt es den Spass. Hier sollte definitiv nachgebessert werden um einen Frustfaktor zu verringern. Auch wenn viele die Questline gar nicht mehr machen: ich bin bei sowas stur [smilie--sprite1] -nach dem Motto, das muss ja zu schaffen sein . Aber bei so vielen Unsinnigkeiten ist das echt nicht spassfördernd.[BR][BR]Mir ist klar, das es schwierig ist, für jede Onlinezeit die passenden Produktionszeiten zu finden. Wenn ich normal arbeite, kann ich lediglich morgens, kurz in der Mittagspause und dann abends im Spiel sein. Bei einer maximalen Produktionszeit für 5 Abzeichen von 2 Stunden generiere ich mit diesen Zeiten je Tag gerade mal 20 - 25 Abzeichen.  Somit dauern die Freischaltungen im oberen Teil des Forschungsbaumes je Forschung 2 - 3 Wochen.  Wenn man dann auch noch Sprünge in der Questline hat, die 2-3 Forschungen bedingen, um sie zu erfüllen und man sich somit für eine Questerledigung  bereits im Monatsbereich befindet, ist das echt blöd. Bitte hier nicht auf die Möglichkeit von Zeitboostern hinweisen - das sind Hilfstools, die jeder nach seinen Möglichkeiten und bevorzugten Einsatzmöglichkeiten verwenden sollte. Selbstverständlich habe ich sie auch benutzt.[BR]Ich „jammere“ nicht über die Dauer der Forschungen an sich, lediglich über die Anforderungen bzw. den Zeitaufwand der Questline zu folgen.[BR][BR]Ich hatte bei den Teamparkstrassen beschlossen, die Questline vorerst zu ignorieren. Ich habe meine aus dem  Inventar aufgestellten Manus und die Mana und Saat produzierenden Eventgebäude auf meiner Gastrassenfläche belassen und zunächst die Anzahl der von mir gewünschten Manus auf Kapitel 18 ausgebaut. Da sie kleiner werden, gewinnt man etwas Platz und generiert mehr Unurium. Das Unurium wurde erst mal für den Forschungsbaum genutzt und wenn die Zentren freigeschaltet sind, für den Bau der Gastrassen Gebäude.  Ich habe es bis zu diesem Zeitpunkt auch nicht für die Produktion von erleuchteten Gütern genutzt, die ja zerfallen und sie bringen zu diesem Zeitpunkt keinen Nutzen.[BR][BR]Es gab auch bei den anderen Gastrassen mal die eine oder andere Unstimmigkeit, aber die waren zu verschmerzen. Wenn ich das hier aber bereits zu Beginn so viele Aufgaben als völlig unsinnig empfinde, läuft meiner Ansicht nach etwas falsch.[BR]Eine Aufstellung der unsinnigen Questabfolge mache ich in einem neuen Thread, sonst geht das hier völlig unter.[BR][BR]Forschungsbaum:[BR]Der Produktionsboost für die erleuchteten Güter hätte analog zu den Konstrukten zusammen mit den Manuerweiterungen in einem erfolgen sollen  jetzt muss man erst alle Manuausbauten freischalten, bevor man den Boost freischalten kann.[BR][BR]Da für den Forschungsbaum und die Ausbauten immense Mengen an Unurium und auch Mana benötigt werden, hängt man hier automatisch fest, weil die Produktion gar nicht so schnell erfolgen kann, wie man die WPs erhält. Bei den Händlern hatte man immer irgendwo einen „freien“ Ast, um WPs einwerfen zu können. Das ist beim Teamgeist nicht gut gelöst.[BR]Hat man die Manus nach Questreihe ausgebaut, ist das Unurium wieder knapp - dann kommt ein Quest, bei dem man einen Verkäufer buchen soll oder 10 x mit ihm handeln soll. Mit welchen Gütern? Das dauert noch, bis man welche produzieren kann, da hierfür ja wieder Unurium benötigt wird.[BR]Ab etwa der Mitte des Forschungsbaumes ist Unuriummangel plötzlich überhaupt kein Problem mehr ... Ein anderer Aufbau - erst weniger Unurium im späteren Forschungsstadium mehr - wäre deutlich sinnvoller. Es reicht doch hin, das Zeug für den Bau bzw. die Produktionen zu benötigen.[BR][BR]Was mir  grundsätzlich nicht gefällt, ist, das in dieser Gastrasse die Manus aller Güter für höhere Stufen freigeschaltet werden. Die schrittweise Höherstufung der Güter bei jeder neuen Gastrasse fand ich entspannter.[BR][BR]Diskussion Verkäufer / Güter[BR][BR]Ich sehe die zu Beginn des Threads aufgeführte Problematik nicht wirklich. Ja, der Händler kostet Geld, wenn man ihn anmietet , ja er ist dann 6 Stunden unterwegs und ich kann  ihn nicht so schnell, wie gewünscht erneut buchen.  Und es gibt genügend Threads, das viele Spieler an Münzen überquellen, also was solls, wenn der Händler „gekauft“ werden muss.[BR][BR]Grundsätzlich bietet die Händleroption aber die Möglichkeit, sofort gewünschte Güter zu erhalten (eventuell sollte hier die Begrenzung der Mengen überdacht werden) und dann ist es egal, ob ein Gut Mangelware ist oder nicht. Die Händleroption bedeutet für Spieler, welche eine Gastrasse schnell hinter sich bringen möchten, oder auch gerne mal völlig unfaire Angebote einstellen, sicherlich ein Hemmnis.  Bei meiner Spielweise emfinde ich es nicht als bremsend - bin eh immer sehr langsam [smilie--sprite1][BR][BR][BR]Gut finde ich das  Portalsegen so gut wie gar nicht helfen, war ich nie ein Freund von [smilie--sprite1]  -hier wäre zu überlegen, ob die Flut an Portalsegen in der gegebenen Form noch Sinn macht, ähnlich wie die Überproduktion an Fragmenten (hier war der positive Sinn ja mal, das man „altes“ überflüssiges Inventar in Fragmente tauschen kann, braucht man doch gar nicht, die Fragmente stapeln sich inzwischen).[BR][BR]Die Dauer, die hier häufig bemängelt wurde, ist für mich nicht relevant. Vom Grundgedanken gehe ich bei jeder Gastrasse von 6 + Monaten aus. Als ich mal mit Elvenar begonnen habe, gab es noch keine Zeit- oder Portalsegen. Diese Dauer war da eigentlich normal. Einige der letzten Gastrassen sind so zügig „durchgeflutscht“, das ich kaum noch Erinnerung daran habe. Das finde ich viel schlechter - dann lieber langwierige Gastrassen aber mit abwechslungsreichen, sinnvollen Quests.[BR][BR]Die Grundidee der Gastrasse gefällt mir in jedem Fall gut, auch die Gebäude gefallen mir sehr - aber durch diese Unstimmigkeiten in Questline und Forschungsbaumfiel es mir t doch etwas schwer, mich daran zu erfreuen."}, {"30": "Und hier noch meine \"Unstimmigkeiten in der Questline\" :[BR][BR]Wenn man bereit am Anfrang der Questline das Dimensionstor aufbauen mussund diese dann tage- oder wochenlang unproduktiv Platz wegnimmt und vor sich hinschläft, ist das recht unsinnig. Es hätte die Freischaltung ausgereicht, nicht der Bau[BR][BR]Das gleiche gilt für die Produktion der erleuchteten Güter, welche noch vor dem Produktionsboost kommt - man muss hier viel Unurium in eine Produktion stecken und erhält nur einen Bruchteil der Güter. Zudem ist zu diesem Zeitpunkt auch der Händler noch nicht ausgebaut, produzierte Güter können dadurch nicht einmal getauscht werden.[BR]Auch hier ist die Reihenfolge der Quests - erst den Verkäufer, dann der Prodboost nicht glücklich. Was soll man denn das Unurium für die mauen Produktionen einsetzen, wenn man es vorerst für die Freischaltung des Boosts benötigt?[BR][BR]Ich soll Brennende Barren herstellen? Mein Bonigut sind die Alraunen, wieso soll ich jetzt mein Unurium in die Produktion eines anderen erleuchteten Gutes stecken?Ein zeitlich weiterer deplatzierter Quest, bei dem man einen Verkäufer mieten soll oder 10 x mit ihm handeln soll, folgt. Mit welchen Gütern? Das dauert noch, bis man welche produzieren kann, da hierfür ja wieder Unurium benötigt wird., was erstmal in die Forschung bzw. die Ausbautern gesteckt wurde. Dann der Quest, bei dem eine 9 Stunden Produktion eines erleuchteten Gutes folgt, welcher glücklicherweise ablehnbar ist. Wozu soll ich Unurium in eine 9 Std Produktion stecken, wenn dies nicht einmal mein Bonigut ist?  Beim ersten Quest war das relativ egal, als ich Mineralien produzieren sollte, da war der Prod Boost ohnehin noch nicht freigeschaltet. Aber nach der Freischaltung des Bonigutes ein anderes Gut produzieren? Wenn ich schon vorher einen Händler mieten sollte, wäre eine Produktion meines Bonigutes (Alraunen) und anschliessend vielleicht ein Quest „Erwirtschafte Brennende Barren oder Mineralien“ ok gewesen - aber die Produktion mit der geringen Menge macht keinen Sinn.[BR][BR]Nächster Quest: Teamparkstrasse freischalten und 12 Strassen bauen. Wohin? ich brauche doch noch gar keine Verbindungen - die Zentren und der Platz sind erst jetzt zum Befüllen im Forschungsbaum freigeschaltet. Nach Questline habe ich jetzt für einige Tage (Wochen?) ein nicht produzierendes Dimensionstor und 12 Strassen gebaut, die ich noch gar nicht benötige.[BR][BR]Durch die Händlerfreischaltung und die Anforderung erleuchtete Güter herzustellen, habe ich bereits vor Freischaltung der Zentren ausreichend Güter, damit ich diese bauen kann. Aber bis ich wieder das Unurium zusammen habe, um die Forschung freizuschalten, verfällt das Zeug langsam vor sich hin.[BR][BR]Dann gleich 12 (!) Erlebniszentren bauen... Bei der noch geringen Produktion der Güter dauert auch dieser Quest ewig und die Dinger brauchen Platz. Ich hatte nach dem Quest dann nur noch 8 auf Stufe 2 stehen, reichte mir völlig aus. Ansonsten hätte ich zusätzlich für das „schnelle“ Weiterkommen 3 Kaufleute in Dauerschleife laufen lassen müssen und um dies zu können auch mindestens 2, besser noch 3 Manus mit  meinem erleuchteten Bonigut. Ich hetze nie durch Gastrassen, aber wenn ich durch mein gemächliches Spielen wochenlang an einem Quest hänge, macht das keinen Spass. Und dann stellt man fest, das die Folgequests gleich ratz fatz mit erledigt waren, weil man in der Zeit des Ausbaus ja weitergekommen ist. So oft wie bei dieser Gastrasse hatte ich Folgequests noch nie im Vorfeld erledigt - ein Zeichen, das hier irgenetwas falsch läuft? Oder habe ich \"falsch\" gespielt (was eigentlich ja nicht geht [smilie--sprite1] )[BR][BR]Nach dem Sammeln von 150 Abzeichen erfolgt die Freischaltung der Zentren auf Stufe 3. Zu diesem Zeitpunkt konnte ich in diese Forschung noch gar keine WPs einwerfen, weil ja vorher HG (auch ein Quest, der automatisch schon erledigt war) und das Trainingsgelände mit insgesamt 200 Abzeichen freigeschaltet werden muss.[BR]Vorher will man auch erstmal das Dimensionstor auf 2 (auch 100 Abzeichen) stehen haben, damit die Produktion mal so langsam anläuft. Wieder tagelanger Hänger in der Questline. Und dann kommt allen Ernstes: 12 Zentren auf Stufe 3!! Hier hätten durchaus auch 8 ausgereicht.[BR][BR]Die Freischaltung kostet wieder 150 Abzeichen - es dauerte ohnehin gefühlt ewig, alle auf Stufe 2 hochzuziehen. Jetzt geht es wieder wochenlang in der Questline nicht weiter, denn der Ausbau dauert.[BR][BR]Und kurz darauf 50(!) Zusammenhaltstrassen. Für die müssen neben den Elementarzentren erst noch die Wohngebäude freigeschaltet werden. Jetzt wieder warten auf fast 500 Abzeichen.  Also erstmal die untere Reihe mit den Manufakturen Forschungen weglassen. Doch danach kommen auch noch 3 Werkstätten  ausgebaut - bis das wieder mit Abzeichen freizuschalten ist ....(ok, war wegen der vorhanden magischen erledigt), Parallel kam dann der ablehnbare Dia Quest, die Wespenreiter freizuschalten. Um dort einwerfen zu können, müssen zuvor mit 210 Abzeichen erst die Rüstkammern freigeschaltet sein und - welche Unsinnigkeit: bei mir ploppte dann gleichzeitig der Quest auf, 2 „wertvolle Manus“ ausgebaut zu besitzen. Da ich jetzt unten den Forschungsbaum erstmal zurückgestellt habe, sind das mindesttens weitere 300 Abzeichen. Klar irgendwann füllt man die, aber das es in der Questline wochenlang nicht weitergeht - muss das sein? Ich hatte zu diesem Punkt charmanterweise den Fehler mit den automatisch erledigten Quests [smilie--sprite1] - was aber auch nicht so toll ist, wenn dann nach einigen automatisch erledigten Quests die letzten 2 Forschungen im Baum gefordert werden. Und um die überhaupt befüllen zu können, müssen alle 4 Forschungen zuvor (je 280 Abzeichen) erledigt sein.[BR][BR]Hier sollte definitiv nachgearbeitet werden. Vielleicht als Idee für Quests „zwischendurch“: einfach mal eine Anzahl X an bestimmten Abzeichen abfordern - also X Tornados, X Sumpfmonster , etc. Das wirbelt die Produktionen durcheinander und stellt eine gewisse Herausforderung dar. Man kann nicht einfach mit „glatten“ Produktionen arbeiten, sondern ist gezwungen den „normalen“ Produktionspfad zu verlassen. Erschwert zwar die Questline, macht es aber interessanter, diese zu erfüllen. Und eventuell massive Sprünge für die erforderlichen Forschungsquests vermeiden.[BR][BR]Analog zu meinem allgemeinen Feedback - es geht mir nicht um die Dauer, die hier alles dauert, sondern um den Frust, einer völlig langweiligen Questline zu folgen. Ich kann zum erstenmal nachvollziehen, warum Spieler die Quests ignorieren - ich habe sie immer als Teil des Spiels und somit einer Herausforderung angesehen."}, {"2": "@Marloy - ein paar von den aufgezählten Quests waren nur Nebenquests (ablehnbar - z.B. die mit den Nicht-Bonus-Gütern) - wenn du deine derzeitige Schleifenquest abgelehnt hättest, dann wäre hier eine neue Hauptquest erschienen....(die Nebenquests lassen sich so aufschieben)..."}, {"30": "@Romilly - wenn man ablehnbare Quests ablehnt (davon ab, das einige davon die Dia Quests waren) erscheint in dem Questfenster erst einmal wieder der \"normale\" Schleifenquestgeber. Der Hauptquest steht noch immer da, bis er erfüllt ist. Ändert daher nichts an meiner Betrachtung .... Ja, ich habe auch den einen oder anderen Nebenquest abgelehnt. Aber auch das finde ich nicht erfreulich - mich persönlich ärgert so etwas halt."}, {"2": "Marloy schrieb:@Romilly - wenn man ablehnbare Quests ablehnt (davon ab, das einige davon die Dia Quests waren) erscheint in dem Questfenster erst einmal wieder der \"normale\" Schleifenquestgeber. Der Hauptquest steht noch immer da, bis er erfüllt ist. Ändert daher nichts an meiner Betrachtung .... Ja, ich habe auch den einen oder anderen Nebenquest abgelehnt. Aber auch das finde ich nicht erfreulich - mich persönlich ärgert so etwas halt.\t\tZum Vergrößern anklicken.......nein - so rum hab ich das nicht gemeint - wenn eine Nebenquest an der Reihe ist, wechseln die Questgeber die Positionen - eine Hauptquest gibt es dann nicht - die Schleifenquest steht oben, die Nebenquest unten - die Schleife musst du ablehnen und dann hast du eine neue Hauptquest neben der Nebenquest - du kannst dann die Hauptreihe weitermachen und die Nebenquest auf später verschieben (wenn du die Nebenquest aber ablehnst, dann verschwinden die zugehörigen Folge-Nebenquests mit den Diamanten und die normale Schleife erscheint wieder)...[BR][BR]...im Moment hab ich 2 Nebenquests stehen - da muss ich jetzt wohl oder übel mal eine erfüllen..."}, {"30": "@Romilly - die Diskussion mit den Questgebern und den Dia Quests, die dann nicht mehr auftauchen sollten, hat mich hier bereits verwirrt. Ich habe definitiv einige der ablehnbaren Quests abgelehnt, es sind dennoch alle Dia Quest erschienen und ich hatte mehrfach 2 Questgeber mit den GR Quests. Der 2. mit dem ablehnbaren Quest tauchte immer nach irgendwelchen erfüllten Hauptquests auf. War der erledigt oder abgeleht, gab es erst wieder die normale Schleife. [BR]Sorry, ich notiere mir die einzelnen Quests nicht, habe lediglich fortlaufend aufgeschrieben, wenn ich einen Quest von der Reihenfolge oder der endlosen Wartezeit unsinnig fand. Dies ist in meinem Feedback zusammengefasst. Es ist also für meine Einschätzung völlig irrelevant, ob ich einen Quest ablehnen kann oder nicht. Das ändert nichts an meiner Aufzählung - egal, ob dort Nebenquests oder Hauptquest aufgeführt wurden."}, {"12": "Bin heute mit dem Kapitel fertig geworden.[BR]Das letzte Viertel hat sich zwar ziemlich gezogen, aber im Großen und Ganzen war's angenehm zu spielen.[BR]Beim Mana hatte ich öfter Probleme, all die Erfordernisse zusammenzukratzen; bei den Orks ging ich mit einem genügend großen Vorrat ins Kapitel.[BR]Und schön, daß man mit einem der Wunder Unurium gewinnt; aber ich erwarte auch eins, mit dem man den Verfall mindert, hoffentlich im nächsten Kapitel.[BR]Jetzt hab ich mal Bibliotheken, Riesenräder, etc. aufgestellt mit der Hoffnung, daß das nächste Kapitel noch 100 Tage auf sich warten läßt. (Dabei hätte ich auch noch immer 25 Wunschbrunnen im Inventar - bitte nicht neidisch werden - aber man hat halt beschränktes Platzangebot.)[BR]Etwas unangenehm war, daß mich die Quest-line in der Forschung in eine andere Richtung treiben wollte als mein eigener Wunsch war, was dann wochenlange Pausen verursachte, und dann mehrere erfüllte hintereinander.[BR]Das mit den Kaufleuten ist ein noch bewältigbares System, solange die Erfordernisse nicht größer werden. Als Erzeuger von Überschuß-Gütern (besonders bei Schriftrollen) hat man halt immer das Nachsehen, so auch bei den erleuchteten, da hat man beim Tausch über die Kaufleute eine Tagesgrenze, die weeeiiit unterhalb der erzeugten Menge liegt."}, {"6": "Ayla Ayla schrieb:\t\t\t...mit der Hoffnung, daß das nächste Kapitel noch 100 Tage auf sich warten läßt.\t\tZum Vergrößern anklicken....Ich rechne mal eher Anfang November mit Kapitel 19."}, {"88": "ist eigentlich immer so, Start ist meist Ende April und Ende Oktober, [BR]also 2 Kapitel pro Jahr"}, {"11": "Alle 2 Std einsammeln finde ich schon krass, Das ist nur was für Arbeitslose, Rentner oder H4, oder R...^^[BR][BR]Wenn man das Kapitel abgeschlossen  hat, braucht man dann noch Erleuchtete Güter??"}, {"6": "Schnalle 04 schrieb:\t\t\tWenn man das Kapitel abgeschlossen hat, braucht man dann noch Erleuchtete Güter??\t\tZum Vergrößern anklicken....Nein."}, {"11": "ustoni schrieb:\t\t\tNein.\t\tZum Vergrößern anklicken....Danke"}, {"6": "Gerne![BR]Aber nicht falsch verstehen! Bei Kapitel 19 werden die T8-Güter mit Sicherheit wieder gefordert, zusätzlich dann auch T9. Wäre also sinnvoll, eine entsprechende Manufaktur vorzubereiten.[BR]Infos zu Kapitel 19 habe ich leider noch nicht gefunden, diesmal wird man wohl auf Infos vom Beta-Server warten müssen.[BR][BR]Vorbereiten kann man sich aber schon:[BR]1h und 2h-Booster in der Akademie herstellen etc.[BR]Ich werde z.B. auch ab Anfang Oktober die WP aus Turnieren sammeln um direkt einsteigen zu können."}, {"24": "Nach langen Jahren an Spiel bin ich nun seid ca. einer Woche auch in die Riege der Spieler vorgedrungen, die im Endkapitel spielen... Das heisst, bis es ein neues gibt *hust*. Ich nehme an die Orks werden bei mir mangeln, aber das ist eigentlich nichts neues, die sind knapp seid ich sie damals in ihrem eigenen Kapitel aufgegabelt habe. Überrascht hat mich allerdings de rimmense Manabedarf. Ich dachte eigentlich den mit meinem Drachenkloster locker befriedigen zu können ,dazu hab ich ja noch ein paar schöne Setgebäude... Pustekuchen.[BR][BR]Mich würde mal interessieren wie ihr entsprechend blaues Gold generiert habt ? Einfach alles an Manaeventgebäuden aufstellen was euch in die Finger kommt/noch im Inventar dümpelt und erstmal soweit wie möglich ausforschen und aufbauen, ehe man mit der Forschung weitermacht und die eigentliche Gastrasse aufstellt (und den Großteil der Managebäude wieder abreisst) ? Das ist zumindest aktuell mein Gedanke... Also im Prinzip wie letztes Kapitel mit den Saatgebäuden damit Unurium in Dauerschleife laufen kann. [smilie--sprite8]"}, {"17": "Feytala1986 schrieb:\t\t\tMich würde mal interessieren wie ihr entsprechend blaues Gold generiert habt ?\t\tZum Vergrößern anklicken....4 Winterweihnachtsbäume und eine Schneeeule geben genug Mana"}, {"12": "Feytala1986 schrieb:\t\t\tMich würde mal interessieren wie ihr entsprechend blaues Gold generiert habt\t\tZum Vergrößern anklicken....Das Drachenkloster mußte ich mir erst aufstellen und ausbauen.[BR]Aber die Eventgebäude und Evos gaben ca. 360K bzw. 500K her (je nachdem ob die 2-tägigen dran waren), allein der Partygängerbrunnen bringt 130K.[BR]Dazu Wagen m.Blasen und 2 Lava-Eier (sind jetzt ersetzt durch das Pilger-Set).[BR]und 13 Mana-Hütten, die man auch zwischendrin mal ernten kann.[BR]Das alles reichte für den Tagesbedarf, und für Forschung bzw. Ausbau mußte das Drachenkloster aufbessern.[BR](Als es den Weihnachtsbaum gab war ich in Urlaub, aber ich hab ja guten Ersatz.)"}, {"24": "stone2345 schrieb:\t\t\t4 Winterweihnachtsbäume und eine Schneeeule geben genug Mana\t\tZum Vergrößern anklicken....[BR][BR][smilie--sprite12] Aber das sind nur ca. 150k am Tag...?"}, {"24": "Ayla Ayla schrieb:\t\t\tDas Drachenkloster mußte ich mir erst aufstellen und ausbauen.[BR]Aber die Eventgebäude und Evos gaben ca. 360K bzw. 500K her (je nachdem ob die 2-tägigen dran waren), allein der Partygängerbrunnen bringt 130K.[BR]Dazu Wagen m.Blasen und 2 Lava-Eier (sind jetzt ersetzt durch das Pilger-Set).[BR]und 13 Mana-Hütten, die man auch zwischendrin mal ernten kann.[BR]Das alles reichte für den Tagesbedarf, und für Forschung bzw. Ausbau mußte das Drachenkloster aufbessern.[BR](Als es den Weihnachtsbaum gab war ich in Urlaub, aber ich hab ja guten Ersatz.)\t\tZum Vergrößern anklicken....[BR]Ja, das klingt eher nach dem was ich im Kopf hatte. [smilie--sprite8]"}, {"17": "Feytala1986 schrieb:[smilie--sprite12] Aber das sind nur ca. 150k am Tag...?\t\tZum Vergrößern anklicken....??? nö [BR]Setbonus pro Baum macht 108100 pro Baum plus Bonus durchs polieren[BR]Eule sind 39000[BR]Partygängerbrunnen sind 130500[BR]es ist soviel das mehr als 6mio trotz Verfall ansammelt"}, {"24": "Du schriebst von einer Schneeeule und 4 Bäumen. Du schriebst nichts von Setboni. Gut, das ist ein Ausnahmefall - Ich hab das Set auch - Einmal. Aber ich gebe zu, ich bin gar nicht auf die Idee gekommen, da an ein Set zu denken... Zu derlei alten Gebäuden zu raten, die man sich damals dann noch viermal am Stück geholt hat geht mir etwas an meiner Frage vorbei. Aber ich entschuldige mich - Ich hätte mich auch klarer ausdrücken können."}]