[{"89": "Hallo an alle[BR]ich bin im Kapitel Teamgeist[BR]bei mir wird der Produktionsbonus für erleuchtete Güter nicht freigeschaltet ( Holz )[BR]woran kann das liegen"}, {"90": "Dir fehlen die Güter dafür?"}, {"2": "Platin schrieb:\t\t\tHallo an alle[BR]ich bin im Kapitel Teamgeist[BR]bei mir wird der Produktionsbonus für erleuchtete Güter nicht freigeschaltet ( Holz )[BR]woran kann das liegen\t\tZum Vergrößern anklicken.......hast du den denn auch schon erforscht?..."}, {"89": "hab alle erleuchten güter erforscht"}, {"6": "Das reicht nicht. Den Produktionsbonus muss man auch freischalten:[BR][IMG]https://i.ibb.co/QfvcYh3/https-de-forum-elvenar-com-index-php-attachments-bonus-jpg-26267.jpg[/IMG][BR]Müsste bei Dir dann Allwissende Alraunen-Produktionsbonus heißen."}, {"89": "danke ustoni genau richtig habs gefunden"}, {"6": "Frage an die Mods:[BR][BR]Im Beta-Forum wurde für die Forschungsfelder der AW am Ende des Forschungsbaums folgendes angekündigt:[BR]\t\t\tAs @Kersepitje already said, we have discussed these with our game team and it has been decided that the requirement for Chapter 18 AW technologies will stay in place, but that we will remove the Settlement Resource requirements to unlock these for now, so researching them will not mean you'll have to completely build up your settlement again.\t\tZum Vergrößern anklicken....[BR]Übersetzt:[BR]\t\t\tWie @Kersepitje bereits sagte, haben wir dies mit unserem Spielteam besprochen und es wurde entschieden, dass das Erfordernis für AW-Technologien aus Kapitel 18 bestehen bleibt, aber dass wir die Anforderungen für Siedlungsressourcen, um diese freizuschalten, vorerst entfernen werden, so dass die Erforschung dieser Technologien nicht bedeutet, dass ihr eure Siedlung komplett neu aufbauen müsst.\t\tZum Vergrößern anklicken....[BR]Ist das auch für die Live-Server geplant? Wäre sicher interessant für alle, die den Forschungsbaum noch nicht abgeschlossen haben. Die Siedlungsresourcen für diese Forschungsfelder zusammen zu bekommen dauert ja eine halbe Ewigkeit."}, {"50": "Die Änderung im Forschungsbaum auf Beta findet mittlerweile Kritik, da es auch Spieler gab und gibt, die sich mit der Erforschung der beiden AWs auseinander gesetzt und teilweise Unmengen an Ressourcen, Zeitbooster sowie teilweise Dias dafür eingesetzt haben.[BR][BR]Man kann auch nicht davon ausgehen, dass nur weil in Kapitel XVI und XVII die beiden zugehörigen AWs am Ende dieser Forschungen nicht für den Abschluss der beiden Kapitel benötigt wurden, dass es dann auch so im unliebsamen Kapitel XVIII so sein wird.[BR]Gerade für Kapitel XVII waren für die beiden redundanten AW-Forschungen noch nicht einmal gastrassenspezifische Ressourcen erforderlich und ausgehend von diesem Aspekt, hätte INNO auch im Vorfeld diese beiden AW-Forschungen im Kapitel XVIII besser einplanen sollen oder eben diese beiden Forschungen nicht für den Kapitelabschluss einbeziehen dürfen.[BR][BR]Somit kann damit gerechnet werden, dass sowohl auf Beta als auch später bei den Live-Welten durch diese Änderung hier 2 Lager entstehen werden und die Spieler, die sich mit der Erforschung nach aktuellen Anforderungen auseinander gesetzt haben in diesem Fall \"unfair\" behandelt werden.[BR][BR]Ob sich INNO dieser Tatsache bewusst ist, könnte man fast anzweifeln.[BR][BR]Nichts desto Trotz gönnen ich es jedem, auch denen, die sich das Leben im Kapitel XVIII durch Auslassen der beiden AW-Forschungen leicht gemacht haben.[BR][BR]Der fade Beigeschmack bleibt aber dann trotzdem bestehen."}, {"2": "...naja - das wär ja nicht das 1. Mal, daß man hier rückwirkend benachteiligt wird - find ich aber auch nicht so schlimm - die, die schon längst fertig sind mit Kapitel 18 (so wie ich heute Abend  [smilie--sprite2] ) - einschließlich der Wunder, hatten ja anscheinend genügend Zeit(Booster) das Zeugs zu sammeln und für alle anderen wird es - eventuell - leichter....ich wäre generell eh dafür, daß die Gastrassen-Produktions-Anforderungen ab Kapitel 15 gesenkt werden, damit wieder mehr Spieler bereit sind, aufzurücken..."}, {"91": "Aber gilt es jetzt als beschlossen, dass zur Erforschung der AW in Kapitel18 keine Gastrassengüter mehr benötigt werden?[BR]Ich stehe am Kapitelende und das macht einen erheblichen Unterschied [smilie--sprite8]"}, {"92": "Sers, [BR]ich habe davon auch im beta Forum gelesen und muss sagen.. die Spieler sollten alle die gleichen Anforderungen meistern, das Spiel ist doch sowieso pille palle einfach.. verstehe auch nicht wie man mit den paar Anforderungen so lange braucht ein Kapitel zu spielen.[BR]ich habe seit fast 4 Monaten das Kapitel 18 komplett fertig und ärgere mich jeden Tag darüber das Kapitel 19 nicht schon längst da ist. Dadurch holen alle auf und irgendwann hocken wir im gleichen Kapitel, wo bleibt da der Spaß am schnellen fertigstellen der Kapitel? [BR]Statt dessen werden die Perks wochenlang diskutiert und in der App sind sie nichtmal fehlerfrei nutzbar.[BR]ich denke 6 Monate sind genug Wartezeit damit alle die möchten mit einem Kapitel fertig werden.. mir würden drei Monate reichen, da hätte man eine Herausforderung.. [BR]wenn die Spieler vorn ein paar Kapitel Vorsprung haben ist das doch nicht schlimm. Im Gegenteil, es würde inno richtig viel Geld in die Kassen spülen."}, {"1": "@Drastor Wann ein Kapitel veröffentlicht wird, hängt nicht davon ab, wie viele Spieler schon mit dem letzten Kapitel fertig sind, sondern davon, wann ein neues Kapitel zu Ende erstellt wurde. Vielleicht sieht es für dich einfach so aus, als müsste man ein bissel was nett zeichnen, ein paar Anforderungen beschließen und ab damit...Aber in Wirklichkeit steckt da viel viel mehr Arbeit dahinter."}, {"61": "Drastor schrieb:\t\t\tverstehe auch nicht wie man mit den paar Anforderungen so lange braucht ein Kapitel zu spielen\t\tZum Vergrößern anklicken....Die meisten handeln halt fair ihre Güter und kaufen nicht alles was der Markt hergibt billig auf und verkaufen dann anschließend zu Wucherpreisen.[BR]Drastor schrieb:\t\t\twenn die Spieler vorn ein paar Kapitel Vorsprung haben ist das doch nicht schlimm\t\tZum Vergrößern anklicken....Damit das Monopol nicht gebrochen werden kann? Lass mal ruhig die anderen aufholen. Ist sicher sehr positiv für den Markt, wenn da mal paar mehr Gilden/Spieler gleichzeitig starten. [smilie--sprite1]"}, {"92": "@ZeNSiErT [BR]ich habe zwei Spieler in der Gilde die 3 Wochen nach mir fertig waren.. die spielen „normal“ und langweilen sich auch langsam zu Tode.. hat wohl nur mit der richtigen Strategie zu tun wie man ein Kapitel angeht..[BR]lieben Gruß[smilie--sprite1]"}, {"61": "Wenn man sich wünscht, dass man mehr Geld ausgeben muss um vorne mitzuspielen, hat das möglicher Weise gar nicht so viel mit der richtigen Taktik zu tun?"}, {"2": "Drastor schrieb:\t\t\twenn die Spieler vorn ein paar Kapitel Vorsprung haben ist das doch nicht schlimm. Im Gegenteil, es würde inno richtig viel Geld in die Kassen spülen.\t\tZum Vergrößern anklicken......du hast erst 3 Jahre nach mir mit Elvenar angefangen und warst 4 Monate vor mir mit Kapitel 18 fertig - na, so eine Frechheit - dagegen muss INNO dringend etwas tun!...(Sarkasmus off)"}, {"93": "Drastor schrieb:  verstehe auch nicht wie man mit den paar Anforderungen so lange braucht ein Kapitel zu spielen        [BR][BR]Gratulation für soviel Erfolg [smilie--sprite11] gibt für so ein rasantes Spiel von INNO Prämie ? (verzeiht meine Unwissenheit [smilie--sprite5])"}, {"91": "Entschuldigt, wenn ich nerve, aber kann jemand meine Frage #331 eindeutig beantworten? Dann reise ich jetzt nämlich alles ab! [smilie--sprite8]"}, {"91": "Minimaxe schrieb:@BlackLabelSociety[BR]Im Beta Forum heißt es diese Woche:[BR]erstens ist das Kapitel 19 noch nicht so weit konzipiert und daher unbekannt, ob die Wunder erforscht werden müssen und ob dazu GR-Güter verlangt werden.[BR]zweitens hat das Entwicklerteam seinen Willen bekundet, es so zu gestalten, dass bei bereits abgerissenem Portal die Gastrasse nicht komplett neu durchgespielt werden muss, falls die Wunder halt eben doch mit GR-Gütern erforscht werden müssen und das Portal dazu nochmals auf 4 gebraucht wird.[BR]Mehr ist nicht bekannt.\t\tZum Vergrößern anklicken....Ich danke dir. Da wäre dann die Frage, zu welchem Preis das nacjträgliche Erforschen geliefert werden wird. Ich muss wohl eine Münze werfen ^^"}, {"6": "BlackLabelSociety schrieb:\t\t\tEntschuldigt, wenn ich nerve, aber kann jemand meine Frage #331 eindeutig beantworten?\t\tZum Vergrößern anklicken....Warum sollte es Dir besser gehen als mir? Meine Frage #328 wurde ja auch nicht beantwortet. Ist im deutschen Team anscheinend so üblich. (Ironie off)"}]