[{"1": "@ustoni Wenn man Mods direkt markiert, bekommen diese mit, dass das Wort an sie gerichtet wurde. Nicht immer werden alle Threads täglich gelesen. [BR][BR]Zu deiner Frage: Bis es hierzu keine offizielle Ankündigung/Aussage von uns kommt, sagen wir dazu nichts. Warum? Weil es eben noch nicht fest steht und es nichts gibt, was wir dazu sagen können."}, {"94": "BlackLabelSociety schrieb:\t\t\tAber gilt es jetzt als beschlossen, dass zur Erforschung der AW in Kapitel18 keine Gastrassengüter mehr benötigt werden?[BR]Ich stehe am Kapitelende und das macht einen erheblichen Unterschied [smilie--sprite8]Zum Vergrößern anklicken....Der CM Marindor aus Beta schrieb[BR][BR]\"wir haben dies mit unserem @Spielteam besprochen und es wurde beschlossen, dass die Anforderungen für Kapitel 18 AW-Technologien bestehen bleiben, wir jedoch die Anforderungen an Siedlungsressourcen entfernen, um diese vorerst freizuschalten, also recherchiere sie bedeutet nicht, dass Sie Ihre Siedlung komplett neu aufbauen müssen\"[BR][BR]weiter[BR][BR]\"Ich weiß nicht, wann genau die Änderung im Spiel umgesetzt wird. Vielleicht mit der Veröffentlichung des nächsten Kapitels, vielleicht schon etwas früher.\""}, {"6": "Tacheless schrieb:\t\t\tWeil es eben noch nicht fest steht und es nichts gibt, was wir dazu sagen können.\t\tZum Vergrößern anklicken....Auch das wäre eine Antwort gewesen.  [smilie--sprite2] [BR]Dass es auf der Beta (mit unbekanntem Zeitpunkt) implementiert wird, steht laut Marindor ja bereits fest. Die offene Frage ist ja nur, ob dies auch auf den Live-Servern passiert.[BR]Geht dabei ja immerhin um 600 \"Abzeichen des Teamgeists\", dafür hab ich im Juli eine Unmenge an Zeitsegen verbraucht.[BR]Eine Spielerin meiner Gilde steht zur Zeit an genau dieser Stelle."}, {"91": "Jammin schrieb:\t\t\tDer CM Marindor aus Beta schrieb[BR][BR]\"wir haben dies mit unserem @Spielteam besprochen und es wurde beschlossen, dass die Anforderungen für Kapitel 18 AW-Technologien bestehen bleiben, wir jedoch die Anforderungen an Siedlungsressourcen entfernen, um diese vorerst freizuschalten, also recherchiere sie bedeutet nicht, dass Sie Ihre Siedlung komplett neu aufbauen müssen\"[BR][BR]weiter[BR][BR]\"Ich weiß nicht, wann genau die Änderung im Spiel umgesetzt wird. Vielleicht mit der Veröffentlichung des nächsten Kapitels, vielleicht schon etwas früher.\"\t\tZum Vergrößern anklicken....Das ist schon recht konkret und eindeutig, danke dir.[BR]Dann reise ich definitiv die Woche eher ab und warte etwas länger auf die Wunder, habe ja noch andere zum leveln [smilie--sprite2]"}, {"2": "BlackLabelSociety schrieb:\t\t\tDas ist schon recht konkret und eindeutig, danke dir.[BR]Dann reise ich definitiv die Woche eher ab und warte etwas länger auf die Wunder, habe ja noch andere zum leveln [smilie--sprite2]Zum Vergrößern anklicken.......also zumindest mit dem Geistertempel würd ich nicht so lange warten (der ist bei mir schon auf Stufe 6)...."}, {"91": "Romilly schrieb:\t\t\t...also zumindest mit dem Geistertempel würd ich nicht so lange warten (der ist bei mir schon auf Stufe 6)....\t\tZum Vergrößern anklicken....Ich bin recht kampfaffin und frage mich, ob ich die WP/Wunderstufen wirklich investieren sollte, schließlich bekomme ich Unurium auch aus dem Markt. Habe auch keine Türme des Sonnenuntergangs und fahre sehr gut . Saat reicht außer zu Spitzenzeiten immer, weil ich kaum Erweckte Güter brauche ... kämpfe im Turm, habe nur 2% Verfall und bekomme welche übers Glücksorakel. Ich gehe mal davon aus, dass sich bei den Erleuchreten Gütern ähnliche Sekundärquellen anzapfen lassen werden und sich Unurium sparen lässt.[BR]Ich schätze dein Urteil aber mehr als das eigene. Siehst du es anders @Romilly ?"}, {"50": "Ich wäre auch vorsichtig, da Marindors Aussage kam, bevor es erste Kritik im Beta-Forum gab und was auf dem Beta-Server passiert, muss noch lange nicht heissen, dass es auch auf den Live-Servern kommt. Schliesslich haben wir noch bis ca. Mitte Dezember, wenn nicht sogar etwas länger Zeit, bis die neue Gastrasse auf die Live-Welten losgelassen werden (ausgehend von das Aussage, dass auf Beta vlt. Ende November mit Kapitel XIX zu rechnen sein könnte)."}, {"2": "BlackLabelSociety schrieb:\t\t\tIch bin recht kampfaffin und frage mich, ob ich die WP/Wunderstufen wirklich investieren sollte, schließlich bekomme ich Unurium auch aus dem Markt. Habe auch keine Türme des Sonnenuntergangs und fahre sehr gut . Saat reicht außer zu Spitzenzeiten immer, weil ich kaum Erweckte Güter brauche ... kämpfe im Turm, habe nur 2% Verfall und bekomme welche übers Glücksorakel. Ich gehe mal davon aus, dass sich bei den Erleuchreten Gütern ähnliche Sekundärquellen anzapfen lassen werden und sich Unurium sparen lässt.[BR]Ich schätze dein Urteil aber mehr als das eigene. Siehst du es anders @Romilly ?\t\tZum Vergrößern anklicken.......also ich hatte in Kapitel 18 ständig sowohl Unurium- als auch Saatmangel, was natürlich auch daran liegt, daß ich sehr wenig normale Gebäude, aber dafür einen recht teuren Turm/Turnier habe (ich verhandle im Turm), da ich nun schon bei 438 Wunderleveln und allen Erweiterungen bin...[BR]...für die Produktion der erleuchteten Güter hatte ich recht wenig Unurium gebraucht - aber ich vermute, daß der Bedarf hier in Kapitel 19 steigen wird (Inno gibt uns kein solches Wunder, wenn es nicht nötig wäre) - man weiß auch nie, ab wann oder wofür Unurium in Zukunft noch benötigt wird....[BR][BR]...und bitte drandenken: 1-2 neue Manus für Gut8 auf Level 32 herrichten (verschlingt auch einiges an Saat/Unurium)..."}, {"94": "Obwohl die meisten Wunder eh nur Luxusprobleme verbessern, frage ich mich warum von vielen jedes Wunder immer auf Krampf bis zum Anschlag gelevelt wird, egal ob Kämpfer, Händler oder Ranglistenspieler. Gerade bei den Ranglistenspielern ist es richtig zwanghaft, aus meiner Sicht aber auch kontraproduktiv... was bringt einem Ranglistenspieler ein lvl 30 - 35 Wunder das Maximal vielleicht 25k Punkte auf großer Fläche bietet?[BR][BR]Ja ich weiß, es gibt Throne der Hohen Wesen, dennoch insgesamt ist es Platzverschwendung.[BR]Produktionsgebäude werden immer mehr Punkte geben als Wunder, der Trent ist deutlich sichtbar mit weiteren Kapiteln.[BR]Somit ist eine Anhäufung von Max Wundern ineffizient bei Punkt pro Fläche für Ranglistenspieler."}, {"2": "...gut, daß ich kein Ranglistenspieler bin ^^ - meine höchsten Wunder sind auf Stufe 21 - ich hab aber einfach sehr viele (und das soll auch so bleiben)..."}, {"8": "Naja Wunder geben schon krasse Vorteile. Ein Stufe 30 Wunder kann ein wahres Gütermonster/Kampfmonster sein...[BR]Simia sapiens ist ne Mischung aus beidem[BR]Aber auch das Kloster der Kampfkünste bringt auf Stufe 30 mal eben 30% mehr Leben... Lebensbooster aus der Aka sind echt selten![BR]Mit dem Teil haste praktisch einen unendlich haltbaren... und Kultur gibt das Ding auch krass viel.[BR][BR]Die Ranglistenpunkte wären mir beim Wundereffekt tatsächlich wumpe... Was hat man denn von den Punkten?[BR]Ich seh da für mich keinen Vorteil.[BR]Aber auf ganz wenig Platz viel Bevölkerung zu haben?[BR]Oder mit einem Wunder mal eben meine Truppenproduktion verdoppeln... also damit Zeitbooster sparen...[BR]Oder mit ein paar Wundern mal eben das zig-fache beim Händler tauschen zu können... Wann immer ich will?[BR][BR]Das sind für mich echte Spielvorteile! ...die machen Elvenar entspannter und belohnen Fortschritt"}, {"94": "gergerw schrieb:\t\t\tNaja Wunder geben schon krasse Vorteile. Ein Stufe 30 Wunder kann ein wahres Gütermonster/Kampfmonster sein...[BR]Simia sapiens ist ne Mischung aus beidem[BR]Aber auch das Kloster der Kampfkünste bringt auf Stufe 30 mal eben 30% mehr Leben... Lebensbooster aus der Aka sind echt selten![BR]Mit dem Teil haste praktisch einen unendlich haltbaren... und Kultur gibt das Ding auch krass viel.[BR][BR]Die Ranglistenpunkte wären mir beim Wundereffekt tatsächlich wumpe... Was hat man denn von den Punkten?[BR]Ich seh da für mich keinen Vorteil.[BR]Aber auf ganz wenig Platz viel Bevölkerung zu haben?[BR]Oder mit einem Wunder mal eben meine Truppenproduktion verdoppeln... also damit Zeitbooster sparen...[BR]Oder mit ein paar Wundern mal eben das zig-fache beim Händler tauschen zu können... Wann immer ich will?[BR][BR]Das sind für mich echte Spielvorteile! ...die machen Elvenar entspannter und belohnen Fortschritt\t\tZum Vergrößern anklicken....Was du da schreibst ist mir schon klar, es gibt essentielle Wunder für einen Spielstil auf die man nicht verzichten und es auch nicht versäumen sollte sie auf Max zu leveln. Jedoch leveln Ranglistenspieler alle Wunder weil sie wohl meinen es sei essentiell für ihren Spielstil viele Punkte zu haben.[BR][BR]Die eigentliche Frage ist jedoch, ob es tatsächlich darauf hinausläuft, dass sie dadurch auch zukünftig mehr Punkte haben werden oder ob es sich ab einem gewissen Kapitel als Platzverschwendung herausstellt. (Punkt pro Fläche Auslastung)[BR][BR]Von der unnötigen Erschwerung im Turm und Turnier wollen wir erst gar nicht sprächen."}, {"1": "Ich grätsche mal dazwischen: Bitte eure Diskussion, welche und wie viele und welche Stufe und überhaupt bei Wundern für euch sinnvoll sind, nicht in diesem Thread diskutieren. Hier geht es um das Kapitel \"Teamgeist\". Ihr könnte jedoch gerne einen eigene Thread für eure Wunderdiskussion eröffnen."}, {"9": "ustoni schrieb:\t\t\tGeht dabei ja immerhin um 600 \"Abzeichen des Teamgeists\", dafür hab ich im Juli eine Unmenge an Zeitsegen verbraucht.[BR]Eine Spielerin meiner Gilde steht zur Zeit an genau dieser Stelle.\t\tZum Vergrößern anklicken....Wie lange sich das zieht, davon muss man gar nicht reden (die 600 Abzeichen) und von den Zeitis die viele reingesteckt haben auch nicht. [BR]Das wäre dann bereits das dritte Mal das man im nachhinein zum positiven für Nachkömmlinge und zum negativen für jene die bereits spielten, abgeändert hat. Kein Wunder das dann auch so viele stehen bleiben. [BR]Es ist ja so, dass man genau wegen den 3 letzten Forschungen a`300 Abzeichen enorm wartet. Na ja, so kann man auch verärgern. Hoffe das kommt nicht so, denn warum sollen Nachzügler leichtere Bedingungen haben (weil es einigen wieder mal nicht passte)?"}, {"6": "Bei Kapitel 16 und 17 wurden die Antiken Wunder auf einmal auf 2 Forschungsfelder verteilt, gab also auf einmal statt nur einem Forschungsfeld in der letzten Spalte deren drei. Allerdings hat wohl jemand dabei übersehen, die 3 Felder als Bedingung für das nächste Kapitel zusammenzuführen. Dadurch waren die Wunder-Forschungen optional.[BR]Jetzt ist das wohl jemandem bei Inno aufgefallen und die AW in Kapitel 18 müssen fürs nächste Kapitel erforscht werden, sind also nicht mehr optional.  [smilie--sprite8] [BR][BR]Dummerweise sind wohl zumindest auf Beta einige Spieler davon ausgegangen, dass die AW wie inzwischen gewohnt auch optional sind und haben die Gastrassengebäude bereits abgerissen. Dumm gelaufen. Man sollte sich eben nie auf Inno verlassen - irgendwas läuft immer anders als erwartet. [smilie--sprite1][smilie--sprite2]"}, {"95": "Also ich bin ja noch mit Mrs. Sniffles komischer Käseplatte befasst. Frage aber trotzdem mal: Selbst wenn die beiden 18er Wunder optional bleiben (und das kann ja gut sein), warum sollte ich das Risiko eingehen wollen, auf die beiden Wunder komplett zu verzichten, ohne eine Schlangenakrobaten-Ausbildung, die es mir in Kapitel 22 oder so ermöglicht, mich dann gegebenenfalls in den Hintern zu beißen.[BR]Was genau findet ihr an den beiden Wundern \"für immer und ewig\" unnütz?"}, {"6": "Minimaxe schrieb:\t\t\tSelbst wenn die beiden 18er Wunder optional bleiben\t\tZum Vergrößern anklicken....Bleiben sie laut der CMs des Beta-Forums ja eben nicht. Deshalb ja die Vereinfachung auf Beta.[BR][BR]Minimaxe schrieb:\t\t\tWas genau findet ihr an den beiden Wundern \"für immer und ewig\" unnütz?\t\tZum Vergrößern anklicken....Hab ich davon irgendwo was geschrieben? Natürlich habe ich die beiden AW erforscht, genau wie in Kapitel 16 und 17."}, {"50": "So sehen aktuell die Änderungen bei den beiden AW-Forschungen aus.[BR][IMG]https://i.ibb.co/qddMQBM/https-de-forum-elvenar-com-index-php-attachments-1636370833068-png-26817.png[/IMG][BR]Ob das aber in dieser Form so bleibt, muss noch abgewartet werden.[BR]Bisher gibt es zu diesen Änderungen kein Feedback und es wird sowohl Befürworter aber auch Kritiker geben.[BR]Unterm Strich ist es auch eine Farce, da hier ausgehend von Kapitel XVI und XVII seitens der Spieler spekuliert wurde und sich offenbart hatte, dass die beiden AW-Forschungen doch benötigt werden.[BR][BR]Sinnvoller wäre es gewesen, die beiden AW-Forschungen wie in den beiden vorherigen Kapitel für das Erreichen von Kapitel XIX zu streichen, so dass wer die beiden AWs nach alten Ansprüchen erforscht hat, diese bauen kann und wer es nicht gemacht hat, trägt selbst die Verantwortung.[BR][BR]Und wieder einmal hat INNO es versäumt über den eigenen Tellerrand in ihrer Planung zu schauen und sorgt so bei einem Teil der Spielerschaft für Unmut, während der andere Teil sich nun ins Fäustchen lacht.[BR][BR]Dann sollte INNO z.B. statt der jeweils 300 Team-Abzeichen je 300k Unurium dafür abverlangen, damit es nicht so ein lächerlich einfacher Spaziergang für die beiden AW-Forschungen wird."}, {"6": "300 Abzeichen streichen und durch 40k Saat ersetzen? Das ist allerdings ein schlechter Witz! [smilie--sprite4][BR]40k Saat hab ich innerhalb von 6 Stunden zusammen, 300 Abzeichen brauchen mindestens 1 Woche.[BR]Nichts gegen das Streichen der Abzeichen, aber der Ersatz sollte wenigstens annähernd der ursprünglichen Anforderung entsprechen.[BR][BR]Da muss man ja den Eindruck kriegen, dass es den Verantwortlichen extrem schwer fällt auch nur halbwegs logisch zu denken. Ist wohl eher so: Hauptsache die Kasse klingelt - egal wie."}, {"85": "Hallo in die Runde. Ich habe eine Frage zum Glücksorakel, also einem Wunder vom vorherigen Kapitel. Das dürften aber nur SpielerInnen hier schon haben oder auch nicht. Es soll pro Handwerk erw. Güter liefern. Sind das nur die eigenen Bonus-Güter oder auch andere? Ich habe das Wunder bisher nicht aufgestellt, da ich es für die 3 Bonusgüter nicht für nötig halte."}]