[{"12": "Fuenarb schrieb:\t\t\tHallo in die Runde. Ich habe eine Frage zum Glücksorakel, also einem Wunder vom vorherigen Kapitel. Das dürften aber nur SpielerInnen hier schon haben oder auch nicht. Es soll pro Handwerk erw. Güter liefern. Sind das nur die eigenen Bonus-Güter oder auch andere? Ich habe das Wunder bisher nicht aufgestellt, da ich es für die 3 Bonusgüter nicht für nötig halte.\t\tZum Vergrößern anklicken....Ich bekomme nur die eigenen erweckten Bonusgüter"}, {"87": "Fuenarb schrieb:\t\t\tSind das nur die eigenen Bonus-Güter oder auch andere?\t\tZum Vergrößern anklicken....Laut wiki - AW Glücksorakel nur die Erweckten Bonusgüter:[BR]Nutzen:[BR]Geförderte Erweckte Güter - Belohnt dich jedesmal mit einer Menge an zufälligen Geförderten Erweckten Gütern, wenn du etwas im Handwerk herstellst."}, {"85": "Danke für die Infos. Dann spare ich mir weiterhin den Bau."}, {"4": "Ich habs sehr schnell auf 11 aufgebaut und erhalte jetzt bei jedem Handwerk 4.806 erweckte Güter. Da das Handwerk bei mir rund um die Uhr läuft, lohnt sich das für mich schon. Ich stelle täglich zwischen 3 und 5 Sachen in der Aka her. Und während eines GA mit vielen abgekürzten Rezepten um so mehr. [BR][BR]Man darf ja auch nicht vergessen, dass für diese Produktion nichts eingesetzt werden muss. Außerdem gibts alle 7 Tage noch 5 RR zusätzlich. Nicht die Welt, aber man freut sich. ^^"}, {"96": "salandrine schrieb:\t\t\tIch habs sehr schnell auf 11 aufgebaut und erhalte jetzt bei jedem Handwerk 4.806 erweckte Güter. Da das Handwerk bei mir rund um die Uhr läuft, lohnt sich das für mich schon. Ich stelle täglich zwischen 3 und 5 Sachen in der Aka her. Und während eines GA mit vielen abgekürzten Rezepten um so mehr.[BR][BR]Man darf ja auch nicht vergessen, dass für diese Produktion nichts eingesetzt werden muss. Außerdem gibts alle 7 Tage noch 5 RR zusätzlich. Nicht die Welt, aber man freut sich. ^^\t\tZum Vergrößern anklicken....also ,wenn ich 5 Werkstätten habe ,diese tagsüber im 3h Rythmus laufen habe. bekomme ich alle 3h 5x die erweckten Güter ?[BR].... auch bei zusätzlichen lvl 1 Werkstätten ? (o. ist da die Menge kleiner)"}, {"2": "Pangond schrieb:\t\t\talso ,wenn ich 5 Werkstätten habe ,diese tagsüber im 3h Rythmus laufen habe. bekomme ich alle 3h 5x die erweckten Güter ?[BR].... auch bei zusätzlichen lvl 1 Werkstätten ? (o. ist da die Menge kleiner)\t\tZum Vergrößern anklicken.......wir reden vom Handwerk in der magischen Akademie - also das mit den Rezepten - du bekommst pro hergestellten Rezept eine gewisse Menge an erweckten Gütern...mit den Werkstätten hat das nichts zu tun...[BR][BR][IMG]https://i.ibb.co/WNC87Mb/https-de-forum-elvenar-com-index-php-attachments-orakel2-png-26932.png[/IMG][IMG]https://i.ibb.co/cDn5gjc/https-de-forum-elvenar-com-index-php-attachments-orakel-png-26931.png[/IMG]"}, {"85": "salandrine schrieb:\t\t\tIch habs sehr schnell auf 11 aufgebaut und erhalte jetzt bei jedem Handwerk 4.806 erweckte Güter. Da das Handwerk bei mir rund um die Uhr läuft, lohnt sich das für mich schon. Ich stelle täglich zwischen 3 und 5 Sachen in der Aka her. Und während eines GA mit vielen abgekürzten Rezepten um so mehr.[BR][BR]Man darf ja auch nicht vergessen, dass für diese Produktion nichts eingesetzt werden muss. Außerdem gibts alle 7 Tage noch 5 RR zusätzlich. Nicht die Welt, aber man freut sich. ^^\t\tZum Vergrößern anklicken....[BR]Einerseits habe ich die gleichen Überlegungen, hatte bisher gezögert. Da jetzt die Infos zu Kapitel 19 raus sind, zeigt sich ein deutlicher Platzmehrbedarf. Da das Wunder ja auch zusätzlich Platz braucht und die erweckten Güter vermutlich eine weniger wichtige Rolle spielen werden, spielt die Menge für mich eine geringere Rolle. Bei Mengel hilft da schnell das verzaubern der Manus."}, {"6": "Fuenarb schrieb:\t\t\tund die erweckten Güter vermutlich eine weniger wichtige Rolle spielen werden, spielt die Menge für mich eine geringere Rolle.\t\tZum Vergrößern anklicken....Mondstein bis Harz werden für die Forschung je ca. 2000k, vom Rest zwischen 840k und 1400k benötigt.[BR]Dabei helfen die homöopathischen Mengen aus dem Wunder aber nicht."}, {"2": "...ich mag mein Orakel auch wegen den Restaurierungszaubern (die Event-Ligen mag ich deshalb übrigens auch) - die gibt es zwar bloß einmal in der Woche, aber wer so viele Eventgebäude hat wie ich, freut sich da über jeden einzelnen - trotz guter Turniererfolge und nur 2 Kapiteln im Jahr..."}, {"6": "Für Kapitel 19 dürfte der Tempel der Geister wichtiger sein. In Stufe 6 bringt der mir bereits rund 120k Unurium je Turm und während einem Event zusätzlich rund 20k Unurium täglich für eingesammelte Eventwährung.[BR]Für die Forschung werden allein schon 1000k benötigt, hinzu kommt natürlich noch der Bedarf für erleuchtete Güter."}, {"85": "ustoni schrieb:\t\t\tMondstein bis Harz werden für die Forschung je ca. 2000k, vom Rest zwischen 840k und 1400k benötigt.[BR]Dabei helfen die homöopathischen Mengen aus dem Wunder aber nicht.\t\tZum Vergrößern anklicken....[BR]Ich habe von jedem erw. Gut so ca. 1000K rumliegen und halte durch Handel die Balance aufrecht. Durch die lange Pause bis zum neuen Kapitel wurden die Güter ja auch nicht gebraucht. Selbst Produktionspausen haben sich kaum ausgewirkt. Mit Simia auf Stufe  31 verschwinden ja auch nur wenige. Auch über die Rüstkammern kommen regelmäßig zusätzliche erw. Güter. Da sehe ich es auch so, dass das Wunder nicht nötig ist."}, {"96": "Romilly schrieb:\t\t\t...wir reden vom Handwerk in der magischen Akademie - also das mit den Rezepten - du bekommst pro hergestellten Rezept eine gewisse Menge an erweckten Gütern...mit den Werkstätten hat das nichts zu tun...[BR][BR]Anhang 26932 ansehenAnhang 26931 ansehenZum Vergrößern anklicken....vielen Dank für die Erklärung, da hatte  ich das ja völlig falsch verstanden ...[BR]im Handwerk der Aka produzier ich meist nur die Booster fürs Turnier und Vogelfutter , da kann ich auf das Orakel vorläufig verzichten"}, {"97": "Hat sich heute mit Start des Kapitel 19 die Ressourcen fürs Freischalten von Technologien im Forschungsbaum geändert? Speziell hier im Kapitel 18 der \"Schrein der Champions\": Bis gestern wurde neben Obsidian (250.000) 300 Abzeichen des Teamgeistes und 80.000 göttliche Saat gefordert. Jetzt sind die Abzeichen verschwunden - dafür benötigt man auf einmal 120.000 göttliche Saat."}, {"1": "Ja, das wurde geändert, so wie zuvor auch schon auf dem Beta-Server."}, {"4": "hab jetzt nur die letzten ca. 10 Seiten durchgelesen und fand meine Frage nicht beantwortet.[BR][BR]Ich hab gestern die Planung und den Umbau für Kapitel 18 beendet und heute stehen jetzt von jeder Manu 3 Stück. Reicht das oder sollte ich doch versuchen, von jedem 4 stehen zu haben?[BR][BR]Was macht Sinn und wenn möglich, warum?[BR][BR]Danke dafür"}, {"9": "salandrine schrieb:\t\t\thab jetzt nur die letzten ca. 10 Seiten durchgelesen und fand meine Frage nicht beantwortet.[BR][BR]Ich hab gestern die Planung und den Umbau für Kapitel 18 beendet und heute stehen jetzt von jeder Manu 3 Stück. Reicht das oder sollte ich doch versuchen, von jedem 4 stehen zu haben?[BR][BR]Was macht Sinn und wenn möglich, warum?[BR][BR]Danke dafür\t\tZum Vergrößern anklicken....Es langen jeweils 3,  bezogen auf die Storyline.[BR][IMG]https://i.ibb.co/rpfQKch/https-de-forum-elvenar-com-index-php-attachments-1640789113105-png-27460.png[/IMG]"}, {"88": "Falls du mit Manus die Zentren meinst dann reichen je 3, mit 4 gehts natürlich schneller, aber nur wenn du auch das Portal boosten willst, da die Produktion der 3x4 Zentren ausreicht um das Portal am Laufen zu halten. zumindest mit normalen onlinezeiten deinerseits, ist halt doof das das Portal auf höchster Ausbaustufe nur 2h läuft und man dann abholen und neu starten muß."}, {"4": "super danke @AngelOfDead und @Questor Thews [BR][BR]Klasse, sogar mit Lageplan,mal gucken, ob ich nicht doch nicht wieder umgestalte, mein Ansatz ist so zerrissen.[BR][BR]Dann lass ich es jetzt erst mal dabei, hab schon einiges eingelagert, vor allem bei den Rüstkammern schmerzt es mich."}, {"80": "salandrine schrieb:\t\t\tDann lass ich es jetzt erst mal dabei, hab schon einiges eingelagert, vor allem bei den Rüstkammern schmerzt es mich.\t\tZum Vergrößern anklicken....[BR]Die kleine Plätze kannst du entfernen nach der Quest, die 6 davon verlangt, und deren Produktion mit Portalsegen erledigen.[BR]Auch kannst du dynamisch spielen und die Anzahl der einen herunter-, die von anderen hochfahren, je nach Bedarf im Spiel. So kannst du ganz schön Platz sparen, wenn er knapp ist.[BR][BR]Optimiere unbedingt die benötigten Straßen. Die kosten unendlich viel Unurium..."}, {"4": "Bin ja schon lange in Teamgeist und hab entsprechend schon vorgesorgt. So habe ich ich rund 2,5 Mio Orks und 10 Mio Mana, Unurium lag bei über 600.000 und Saat bei über 700.000. Jetzt ist die Menge natürlich bereits reduziert, jedoch hab ich von allen schon 3 Zentren und von den Plätzen allerdings bisher nur 1. Allerdings muss noch ne Rüstkammer dran glauben. [BR][BR]Hatte die ganze Zeit andere Prioritäten und nicht die Muße für dieses Kapitel. Insofern konnte ich gut vorsammeln."}]