[{"43": "Viel schöner ist es dann nach der Erforschung der Verhundertfachung, kann man dann als Einzelspieler 25 Spieler Gleichzeit spielen und so eine volle Gemeinschaft generieren lol."}, {"21": "Das ist doch völlig normal für Testaccounts, irgendwie muß doch vorher mal alles durchgespielt werden- sozusagen die Beta von der Beta . Muß man aber tatsächlich auch noch solche Details wie zB den Diabestand, die BV etc. schwärzen/ausblenden um so unsinnigen Spekulationen vorzubeugen daß hier \"echte\" Spieler am Werk wären ?"}, {"44": "Indianaking schrieb:\t\t\tDas ist doch völlig normal für Testaccounts, irgendwie muß doch vorher mal alles durchgespielt werden- sozusagen die Beta von der Beta .\t\tZum Vergrößern anklicken....Heist das jetzt, dass \"normale\" Städte sich an diesem Beispiel orientieren sollten? Also dass das \"normale\" Spiel nur funktioniert wenn es, wie die (unrealistisch) Vorbete-Beta-Version (mit Minus-Bevölkerung und Dias in 100.000er Höhe), bespielbar ist?[BR]Einen Vorbeta-Beta-Test unter realen Bedingungen würde ich eher als einen Test ansehen."}, {"45": "Schon mal darüber nachgedacht, dass diese Stadt nur dazu diente, die Gebäude hinzustellen, damit man sie sich ANGUCKEN kann? In einer bespielten Stadt stehen die wohl kaum so locker flockig auf freiem Feld, dass man einen guten Blick darauf hat.[BR]Man kann sich auch zwanghaft was zum klugsch...ähm meckern suchen"}, {"19": "Im Kapitel der Unur, da hatte ich teilweise sogar ein Minus von 50k Einwohnern[BR]Alle Wohngebäude wurden teleportiert - ich brauchte Platz für die Schiffe[BR]Da standen dann auch eine Menge davon - was für mich wichtiger war  [smilie--sprite6]"}, {"46": "Mir gefällt die Geschichte von Kapitel 18 [smilie--sprite8] Es ist eine Stadt wo es doch nur um die Vorstellung des Kapitels und der Gebäude geht... warum muss da kritisiert werden.  Ich wünschte mir für die reale Welt auch mehr Teamgeist und mehr Positives![BR][BR]Geschichte und Design= Daumen hoch [smilie--sprite8]"}, {"44": "Brosin schrieb:\t\t\tMan kann sich auch zwanghaft was zum klugsch...ähm meckern suchen\t\tZum Vergrößern anklicken....SO antwortest du nur, weil du weißt, dass ICH NIE melde. Bei dir (wenn ich dir so antworten würde) hätte ich sicherlich schon mindestens 2 Medungen [smilie--sprite2]"}, {"47": "Schade, daß das Video auf englisch mit englischen Untertiteln ist... [smilie--sprite4]"}, {"19": "Englisch mit Deutschem Untertitel möglich !"}, {"21": "Irren ist menschlich - ich weiß [smilie--sprite2][BR][BR]Daß wir jetzt aber Siedlinge bauen sollen- darauf bin ich schon sehr gespannt [smilie--sprite7][BR][BR]"}, {"48": "Wann kommt denn nun das Update? Kurz vor Feierabend?[BR]Ich warte auf das neue Kapitel und nix passiert."}, {"21": "j.fili schrieb:\t\t\tWann kommt denn nun das Update? Kurz vor Feierabend?[BR]Ich warte auf das neue Kapitel und nix passiert.\t\tZum Vergrößern anklicken....[BR]Beim letzten Kapitel wars 14.00 Uhr ......."}, {"6": "j.fili schrieb:\t\t\tWann kommt denn nun das Update?[BR]Ich warte auf das neue Kapitel und nix passiert.\t\tZum Vergrößern anklicken....Ist doch laut Meldung im Posthorn längst gestartet: \"Ein neues Kapitel startet jetzt in Elvenar!\"[BR][BR]Liest sich eigentlich irgendein Mitarbeiter von Inno solche unsinnigen Meldungen mal durch, bevor sie an die Spieler geschickt werden?[BR]Unglaublich!"}, {"4": "Ich wollte mich auch orientieren, aber leider ist das neue Kapitel, trotz der anderslautenden Mitteilung, noch nicht sichtbar. Dumm gelaufen - wieder mal."}, {"21": "Anscheinend wird der Kapitelstart verschoben..... oder findet keiner den Startknopf ? [smilie--sprite6]"}, {"49": "Hmmm..."}, {"50": "Ich sehe dem entspannt entgegen auch wenn es schon paradox ist die neue Gastrasse via Ingame-Meldung als angekommen zu deklarieren.[BR][BR]Sobald sie denn da sind, habe ich auch gleich die erste Forschung was die WP s angeht bereits beisammen -> [IMG]https://i.ibb.co/CPYYJ6z/https-de-forum-elvenar-com-index-php-attachments-1619701836101-png-24119.png[/IMG]"}, {"21": "OMcErnie schrieb:\t\t\tIch sehe dem entspannt entgegen auch wenn es schon paradox ist die neue Gastrasse via Ingame-Meldung als angekommen zu deklarieren.[BR][BR]Sobald sie denn da sind, habe ich auch gleich die erste Forschung was die WP s angeht bereits beisammen -> Anhang 24119 ansehenZum Vergrößern anklicken....[BR]Ich mach gleich paar Forschungen mehr [smilie--sprite2][BR][BR]"}, {"51": "die Neuankömmlinge müssen bestimmt noch erst in Quarantäne"}, {"52": "Ihr spielt schon so lange und jedesmal müssen wir sagen, erst wenn das Update bei allen Sprachen durch ist (DE ist nicht allein^^) , dann wird das neue Kapitel aktiviert. [smilie--sprite2]"}]