[{"4": "Wo finde ich denn bitte[BR][BR]Heiße Wanne von Aelrindel[BR][BR]Ich hab Stahl als Bonusgut und auch auf 32 ausgebaut, dort allerdings ist es nicht zu finden. und im Wiki leider auch nicht. [BR][BR]Marmor ist ebenalls auf 32, alle anderen Proddis sind noch 31, Platzmangel und teilweise noch nicht erforschbar."}, {"2": "salandrine schrieb:\t\t\tWo finde ich denn bitte[BR][BR]Heiße Wanne von Aelrindel[BR][BR]Ich hab Stahl als Bonusgut und auch auf 32 ausgebaut, dort allerdings ist es nicht zu finden. und im Wiki leider auch nicht.[BR][BR]Marmor ist ebenalls auf 32, alle anderen Proddis sind noch 31, Platzmangel und teilweise noch nicht erforschbar.\t\tZum Vergrößern anklicken.......ich weiß jetzt nicht genau, wo die hingehört - aber das sind die Diamanten-Nebenquests - da musst du in allen 3 Manus jeweils die 3- und die 9-Std.-Prod machen - also alle 3 ausbauen und dann das erleuchtete Gut produzieren - auch wenn es keinen Bonus hat...[BR]...wenn du die ablehnst, kommen die anderen dieser Nebenquests (sind 6 aus dieser Reihe) aber nicht mehr...bei mir war erst Stahl, dann Holz und dann Marmor dran - hab Marmor als erleuchtetes Gut (bzw. Mineralien)[BR][BR]...habs gefunden - die heiße Wanne müsste eine Produktion in der Holzmanu sein (Alraunen) - da gibt es den Kräuterkorb von Gaelagil und die Wanne"}, {"4": "Romilly schrieb:\t\t\t...[BR]...habs gefunden - die heiße Wanne müsste eine Produktion in der Holzmanu sein (Alraunen) - da gibt es den Kräuterkorb von Gaelagil und die Wanne\t\tZum Vergrößern anklicken....Danke schön, dann muss ich erst auf den Ausbau warten, den könnte ich zwar, aber hab den Platz im augenblick da gerade nicht für."}, {"98": "Dieser Kommentar hier war vom Mai 2021:[BR][BR]LuxuriantSilver schrieb:\t\t\tich hoffe ihr macht bei den Kaufleuten für erleuchtete Güter noch hinzu:[BR]1. das man sieht welche Güter man eingestellt hatte, statt nur Bild von einem Händler der läuft.[BR]2. einen Button zum Abbrechen, falls man zb falsch eingestellt hat.[BR]3. eine Übersicht seiner eigenen erleuchteten Güter im Handelsfenster sonst muss man immer umständlich raus und erstmal in der gesamten Übersicht gucken wieviele man noch hat bzw noch braucht.[BR]4. Änderbare Mengen zb auch wenn man nur zb weniger hat als erforderlich, das man es reinstellen darf, zb 1500 statt 1800.[BR]5. Erhöhung der Mengen auf 20k mindestens. Bei den Mengen die später erforderlich werden, einfach besser wie diese Tröpfchenmengen aufn heissen Stein.\t\tZum Vergrößern anklicken....[BR][BR]aaaaax schrieb:\t\t\tIn Khelonaar gibt es einen riesigen Überschuss von Urwelt-Mineralien. Jetzt gerade z.B. auf 52 Seiten Angebote, und keinerlei Nachfrage. Das ist praktisch immer so. Wenn ich mal nicht 6 Stunden auf meine Händler warten muss ist das ein Glücksfall. Das neue Handelssystem bietet hier keinen Ausgleich, ganz im Gegenteil sogar. Ich bekomme zwar meine Güter getauscht, aber nur in festen, kleinen Häppchen und ohne Möglichkeit, selbst steuernd über Menge und Preis einzugreifen. (Dias und Zeitbooster mal nicht betrachtet). Sehr demotivierend. Ich will nicht von \"unfair\" reden; bislang bin ich mit Ungleichgewichten zu meinen Nachteil immer gut klargekommen, aber hier leidet doch der Spielspaß sehr. Das mal so als Feedback\t\tZum Vergrößern anklicken....[BR]Ist es nur mein Eindruck, oder interessiert sich Inno mal so gar nicht für die Handelsprobleme und die damit verbundenen Ungerechtigkeiten?[BR][BR]Auf Khelo fehlt es momentan sehr an Barren, Alraunen gibt es gelegentlich, mit Mineralien kann man die Welt geradezu fluten. Wenn der Verfall nicht wäre, könnte man einfach auf längere Dauer setzen, mit Verfall geht das nicht, weil die von einem Händler in 6 Stunden errungenen Barren ja bald schon wieder weniger werden, und wenn man etliche Tage braucht, um eine bestimmte Menge zusammen zu bekommen, unterwegs aber ständig wieder ein großer Teil verfällt, tja, dann funktioniert es einfach nicht. [BR][BR]So, wie es jetzt läuft, macht es schlicht und ergreifend keinen Sinn, das Kapitel überhaupt zu spielen. Der Frust ist hier kein Faktor, sondern ein Exponent."}, {"8": "Cailin schrieb:\t\t\tAuf Khelo fehlt es momentan sehr an Barren\t\tZum Vergrößern anklicken....Entschuldige! Bin dran! [smilie--sprite2][BR][BR]Der Doppelausbau vom Orakel verschlang sämtliches Unurium...[BR]Morgen nach Ausbau werf ich die Barrenproduktion wieder für euch an![BR]Cailin schrieb:\t\t\tIst es nur mein Eindruck, oder interessiert sich Inno mal so gar nicht für die Handelsprobleme und die damit verbundenen Ungerechtigkeiten?\t\tZum Vergrößern anklicken....Ich denke, diesen Eindruck teilt wohl Jeder mit dir.[BR]Es ist eine besondere Crux dieses Händlers, dass man Hochfrequenzhandel betreiben muss.[BR][BR]Tatsächlich war es ein feature vor dem ich mich besonders fürchtete. Nun schein ich vom Glück gesegnet?[BR]Ich brauch überhaupt keine Halblingshändler. Alles was ich brauch, kann ich einfach kaufen.[BR]Und nutzen tut das auch Allen![BR]Wenn ich die Hüte wegklicke, können die Leutz wieder neue Handel einstellen.[BR][BR]Diese Minitrades einstellen ist wirklich so nervig wie ich dachte[BR][BR]Allerdings macht mir das Kapitel bisher große Freude.[BR]Irgendwie läd es mich ein, länger zu verweilen?[BR]Nach dem Thread zu urteilen wird das ohnehin passieren [smilie--sprite8][BR][BR]Gleich zu Anfang Stufe 4 Schützen und Kasernenausbau.[BR]Selbst meine Lieblingseinheit - Orkstratege 4 - gleich um die Ecke? Cool [smilie--sprite1][BR][BR]AngelOfDead schrieb:\t\t\tEs langen jeweils 3, bezogen auf die Storyline.\t\tZum Vergrößern anklicken....Vielen Dank für den Tipp! [smilie--sprite1][BR]werde es gegen Ende so in etwa bauen...[BR][BR]Erstmal werde ich mit 1 Zentrum jeweils forschen gehen...[BR]Zu toll sind die Wunder der Händler Unurs![BR]Da ich noch keinen Tempel der Geister oder vallorianischen Siegelturm besitze, muss ich mich entscheiden:[BR]Forschung oder Orakel/Archenausbau? für mehr reicht das Unurium noch nicht.[BR]Ganz klar gewinnen die wohl genialsten Wunder![BR][BR]Vielen Dank für ein weiteres schönes Kapitel [smilie--sprite1][BR]Teamgeist - den werden wir beweisen!"}, {"4": "Geschafft![BR][BR]Angefangen kurz vor Sylvester, heute beendet. Allerdings habe ich eine sehr große Menge an Zeitboostern eingesetzt, aber das war es wert. Keine Dias eingesetzt, aber alle Aufbauten und Ausbauten halt mit Zeitboostern, da sind meine gesamten 20 Std. Booster draufgegangen.[BR][BR]Ich wollte unbedingt fertig werden, damit ich meine Eventwährung im neuen Kapitel ausgeben kann. Werkstätten sind umgebaut, für die Wohnhäuser brauche ich noch Wochen an Blaupausen. [BR][BR]Jetzt ist erst mal wieder sammeln und ausbauen angesagt, bevor ich im nächsten Kapitel starte. Das werde ich dann auch wieder versuchen, relativ schnell zu beenden. Ich mag es einfach nicht, wenn  mein Platz derart okkupiert wird und fremdbestimmt."}, {"41": "Hallo zusammen, [BR]ich spiele nicht mehr sehr viel und habe nun nach einer möglichst bequemen Art gesucht, um dieses Kapitel durchzubekommen. Ohne, dass ich immer wieder nachdenken muss beim einloggen. Es liegt teilweise einfach zu viel Zeit dazwischen für die grauen Hirnzellen ^^[BR][BR]Spontan würde ich nun folgendes sehen, um Teamgeist-Abzeichen zu prodden:[BR][BR]Dimensionstor: Nur Prüfung des Feuertornados prodden.[BR]Gebäude: je 4x Luft, Erde und Feuer (kein Wasser, habe Platzmangel ^^)[BR]- Feuer: 3x Pilot + 1x Feuerelement[BR]- Erde: 3x Camper + 1x Erdelement[BR]- Luft: 3x Dirigent + 1 x Luftelement[BR]Plätze zum Hallo sagen: Nur Elfen prodden.[BR][BR]Mir ist klar, dass ich für den Ausbau der Gebäude und ggf. für die Quests auch Wasserelemente und andere Aktivitäten haben muss. Dafür habe ich 3 Wasserpärke im Inventar. [BR][BR]Hat das jemand ausprobiert?[BR]Oder habt ihr immer konsequent alle Elementpärke gestellt und mit den Aktivtäten sowei Prüfungen abgewechselt?[BR]Andere Ideen, wie man möglichst ohne viel nachzudenken bequem an die Teamgeist-Abzeichen gelangt?"}, {"2": "xafio schrieb:\t\t\tHallo zusammen,[BR]ich spiele nicht mehr sehr viel und habe nun nach einer möglichst bequemen Art gesucht, um dieses Kapitel durchzubekommen. Ohne, dass ich immer wieder nachdenken muss beim einloggen. Es liegt teilweise einfach zu viel Zeit dazwischen für die grauen Hirnzellen ^^[BR][BR]Spontan würde ich nun folgendes sehen, um Teamgeist-Abzeichen zu prodden:[BR][BR]Dimensionstor: Nur Prüfung des Feuertornados prodden.[BR]Gebäude: je 4x Luft, Erde und Feuer (kein Wasser, habe Platzmangel ^^)[BR]- Feuer: 3x Pilot + 1x Feuerelement[BR]- Erde: 3x Camper + 1x Erdelement[BR]- Luft: 3x Dirigent + 1 x Luftelement[BR]Plätze zum Hallo sagen: Nur Elfen prodden.[BR][BR]Mir ist klar, dass ich für den Ausbau der Gebäude und ggf. für die Quests auch Wasserelemente und andere Aktivitäten haben muss. Dafür habe ich 3 Wasserpärke im Inventar.[BR][BR]Hat das jemand ausprobiert?[BR]Oder habt ihr immer konsequent alle Elementpärke gestellt und mit den Aktivtäten sowei Prüfungen abgewechselt?[BR]Andere Ideen, wie man möglichst ohne viel nachzudenken bequem an die Teamgeist-Abzeichen gelangt?\t\tZum Vergrößern anklicken.......hmmh - also ich hatte von jedem Zentrum 3 stehen und hab damit dann abwechselnd gleichmäßig die 3 Produktionen/Medaillen durchlaufen lassen (und bei Bedarf neue Elemente produziert) - also immer alles auf das gleiche eingestellt (oben rechts, unten links, unten rechts, dann wieder von vorne) - nach jedem Durchlauf hab ich dann schön jedes der 5 Abzeichen/Prüfungen nacheinander herstellen können (dazu brauchst du pro Durchlauf von jeder Medaille 30 Stück)...Plätze hatte ich eigentlich gar nicht stehen - da hab ich die Portalsegen genutzt (und hatte dann natürlich immer alle 3 Rassen)....ist viel weniger Denkarbeit, wenn man einfach überall immer \"das Gleiche\" macht, bis genügend Abzeichen da sind..."}, {"41": "Ich bin vor einigen Tagen fertig geworden. Die Strategie, auf Wasserzentren zu verzichten und mich nur auf die Feuerprobe zu konzentrieren, hat sich für mich gut ausgezahlt. Es war sehr bequem und ich musste nie darüber nachdenken, was ich als letztes produziert habe ^^[BR][BR]Ich hatte weder mit den neuen Gütern noch mit Saat/Unurium irgendwelche Probleme. Ich fand es ein eher angenehmes Kapitel unter den letzten Kapiteln. Auch von den Gebäuden her war es schön anzusehen.[BR][BR]Mit gut 2+ Monate Laufzeit war das Kapitel durchaus ein Durchatmen nach dem verflixten Schiffsfriedhof. Danke dafür!"}, {"84": "Hallo zusammen,[BR]ich stehe kurz vor Kapitel 18 \"Teamgeist\". Ich hätte eine große Bitte, kann jemand der mit dem Kapitel fertig ist, alle Quest auf einmal reinstellen. Am Anfang sind da ein paar und dort ein paar, aber es wäre wirklich nett alle auf einmal zu habe.[BR]Bedanke mich schon mal im Voraus für eurer Bemühen,[BR]liebe Grüße Marzena"}, {"9": "Marzena schrieb:\t\t\tIch hätte eine große Bitte, kann jemand der mit dem Kapitel fertig ist, alle Quest auf einmal reinstellen.\t\tZum Vergrößern anklicken....[BR][BR]Storyline - Kapitel XVIII - Teamgeist​[IMG]https://i.ibb.co/8zjhgKx/https-de-forum-elvenar-com-index-php-attachments-1688807510793-png-37412.png[/IMG]!! WICHTIGER HINWEIS !!​Lehnt man eine dieser ersten Ablehnbaren - Quests für Manufakturen ab, kommt ein Popupfenster wo man gewarnt wird, das der Schritt nicht rückgängig gemacht werden kann. Das ist klar soweit, nur das Problem was dann entsteht ist,[BR]die wertvollere Folgequest erscheint nach dem ablehnen der ersten Quest gar nicht mehr. Diese wird einfach mit überschrieben und es geht dann direkt mit der übernächsten Quest weiter.[BR]Seit also gewarnt falls Ihr euch dazu entschließt eine Quest, aus welchen Gründen auch immer, mal abzulehnen.[BR]Die Diamanten-Quest nach dem ablehnen der ersten Ablehnbaren Quest fällt dann ohne Hinweis aus und die ganze Reihenfolge stimmt dann nicht mehr, denn man bekommt gewisse Quest’s aus der Original Storyline gar nicht mehr![BR][BR]Dazu gibt es auch seit ewiger Zeit eine Fehlermeldung, auf die bisher kein INNO-Mitarbeiter reagiert hat - leider.[BR]Tipps beim Spielen der Gast-Rasse:​Es langen jeweils a' 3 Zentren, aber den Platz der Begrüßung braucht man 6 Mal, denn das wird gefordert.[BR]Dennoch ist der Gesamtplatzbedarf gegenüber den Kapitel 17 um längen weniger.[BR]Spielt man die Storyline, so langen 23 x 22 Felder, dass entspricht wiederum 20,24 Erweiterungen.[BR]Wenn du nicht nach der Storyline spielst, dann brauchst du von den 3x3 Gebäude - Platz der Begrüßung eigentlich keines, denn die Elfen und Menschen bekommt man, sofern man genug Portalsegen hat, darüber.[BR]Kleinster Aufbau - Storyline bezogen:[BR][BR][IMG]https://i.ibb.co/Fkrr3p2/https-de-forum-elvenar-com-index-php-attachments-1688807613583-png-37413.png[/IMG][BR][BR]01. Sammle 25.000 Göttliche Saaten ein[BR][BR]02. Kaufe 8 Wissenspunkte[BR][BR]03. Sammle 30.000 Unurium ein[BR][BR]04. Gib 30 WP aus[BR][BR]05. Schalte das Dimensionstor frei[BR][BR]06. Baue das Dimensionstor[BR][BR]07. Besitze eine (Gut 1++) Manufaktur[BR]& Sammle 200.000 Erweckte Güter ein[BR][BR]08. Besitze eine (Gut 1++) Manufaktur der Stufe 16 oder höher[BR]& Schalte die Erleuchtete Marmormanufaktur der Elemente frei[BR][BR]09. Besitze eine (Gut 1++) Manufaktur der Stufe 24 oder höher[BR]& Schalte die Erleuchtete Stahlmanufaktur der Zwerge frei[BR][BR]10. Besitze eine (Gut 1++) Manufaktur der Stufe 28 oder höher[BR]& Schalte die Erleuchtete Manufaktur der gedeihenden Hölzer frei[BR][BR]11.Besitze eine (Gut 1++) Manufaktur der Stufe 30 oder höher[BR]& Verwende 10 Zaubersprüche[BR][BR]12.Besitze eine (Gut 1++) Manufaktur der Stufe 32 oder höher[BR]& Verwende 10 Segen[BR][BR]13. Sammle 1.000 Erleuchtete Güter ein[BR]& Besitze mindestens 3 Basismanufakturen der Stufe 32 oder höher[BR][BR]14. Spende 1.000 Urwelt-Mineralien[BR][BR]15. Schalte den Überragenden Verkäufer frei[BR][BR]16. Nimm 6 Handelsangebote an[BR][BR]17. Handle 4 x mit dem Händler & Erkunde eine Provinz[BR][BR]18. Besitze einen Händler der Stufe 7[BR][BR]19. Schalte den Produktionsbonus für Erleuchtete Güter frei[BR][BR]20. Heuere einen Kaufmann an oder nutze ihn 10 x[BR][BR]21. Sammele 40.000.000 Münzen ein[BR][BR]22. Produziere 1 Kessel von Haugur (ablehnbar)[BR][BR]23. Produziere 1 Samowar von Heropi (ablehnbar)[BR][BR]24. Produziere 1 Kräuterkorb von Gaelagil (ablehnbar)[BR][BR]25. Produziere 1 Heiße Wanne von Aelrindel (ablehnbar)[BR][BR]26. Produziere 1 Luftreiniger von Aeon (ablehnbar)[BR][BR]27. Produziere 1 Karaffe von Calma (ablehnbar)[BR][BR]28. Schalte die Teampark-Straße frei[BR]& Besitze mindestens 12 Felder der Teampark-Straße[BR][BR]29. Schalte das Authentische Hauptgebäude frei[BR][BR]30. Schalte den Platz der Begrüßung frei[BR][BR]31. Besitze 3 Plätze der Begrüßung[BR]& Heiße 2.000 Elvenar im Park willkommen[BR][BR]32. Besitze 1 Wasserzentrum[BR]& Besitze 1 Feuerzentrum[BR][BR]33. Besitze 1 Windzentrum[BR]& Besitze 1 Erdzentrum[BR][BR]34. Verdiene 100 Aktivitätsmedaillen[BR][BR]35. Züchte 100 Baby-Elementare[BR][BR]36. Schließe 10 Prüfungen ab (Abzeichen des Teamgeists produzieren)[BR][BR]37. Schalte die Authentischen Wohngebäude frei[BR][BR]38. Benutze den Kaufmann 5 x[BR]& Sammle 50.000 Erleuchtete Güter ein[BR][BR]39. Nimm 6 Handelsangebote an[BR]& Leiste 30 x Nachbarschaftshilfe[BR][BR]40. Besitze mindestens 10 Wohngebäude der Stufe 40[BR][BR]41. Schalte die Verbesserungen der Dünenkristall-Manufaktur frei[BR]& Sammle 100.000 Kristalle oder Obsidian ein (ablehnbar)[BR][BR]42. Spende 20.000 Unurium[BR][BR]43. Besitze 12 Elementarzentren[BR][BR]44. Besitze 6 Plätze der Begrüßung[BR][BR]45. Besitze ein Dimensionstor der Stufe 2[BR][BR]46. Verdiene 50 Abzeichen des Teamgeists[BR][BR]47. Schalte Elementarzentren 2 frei[BR][BR]48. Besitze mindestens 4 Elementarzentren der Stufe 2[BR][BR]49. Baue dein Hauptgebäude auf Stufe 41 aus (ablehnbar)[BR][BR]50. Verwende 10 Segen[BR][BR]51. Heiße 5.000 Elfen im Park willkommen[BR][BR]52. die Verbesserungen der Schriftmanufaktur der Drachen frei[BR]& Sammle 100.000 Schriftrollen oder Zaubertinte ein (ablehnbar)[BR][BR]53. Besitze mindestens 1 Veredelte Manufaktur der Stufe 32 oder höher (ablehnbar)[BR][BR]54. Besitze ein Dimensionstor der Stufe 3[BR][BR]55. Verdiene 100 Abzeichen des Teamgeists[BR]& Heiße 10.000 Leute im Park willkommen[BR][BR]56. Leiste 50 x Nachbarschaftshilfe[BR][BR]57. Verdiene 400 Aktivitätsmedaillen mit dem Element Feuer[BR]& Züchte 100 Feuerelementare[BR][BR]58. Verdiene 400 Aktivitätsmedaillen mit dem Element Wasser[BR]& Züchte 100 Wasserelementare[BR][BR]59. Verdiene 400 Aktivitätsmedaillen mit dem Element Erde[BR]& Züchte 100 Erdelementare[BR][BR]60. Verdiene 400 Aktivitätsmedaillen mit dem Element Wind[BR]& Züchte 100 Windelementare[BR][BR]61. Sammle 80.000 Erleuchtete Güter ein[BR][BR]62. Heiße 6.000 Elvenar im Park willkommen[BR]& Verdiene 150 Abzeichen des Teamgeists[BR][BR]63. Schalte die Verbesserungen der Seidenmanufaktur der Feen frei[BR]& Sammle 100.000 Seide oder Königlichen Samt ein (ablehnbar)[BR][BR]64. Besitze mindestens 2 Veredelte Manufakturen der Stufe 32 oder höher (ablehnbar)[BR][BR]65. Besitze ein Dimensionstor der Stufe 4[BR]& Hab 540 Provinzen abgeschlossen[BR][BR]66. Schalte Elementarzentren 3 frei[BR][BR]67. Besitze mindestens 12 Elementarzentren der Stufe 3[BR]& Heiße 10.000 Menschen im Park willkommen[BR][BR]68. Schließe 1 Prüfung ab (ablehnbar)[BR][BR]69. Sammle 20 Visionsschwaden (ablehnbar)[BR][BR]70. Besitze mindestens 50 Felder der Zusammenhalt-Straße in deiner Stadt[BR][BR]71. Bilde 20.000 Elite-Bogenschützen aus[BR]& Bilde 5.000 leitende Ork-Strategen aus (ablehnbar)[BR][BR]72. Besitze mindestens 3 Werkstätten der Stufe 41 oder höher[BR][BR]73. Schalte den Schrein der Champions oder den Tempel der Geister frei[BR][BR]74. Verkaufe das Dimensionstor[BR][BR]75. Verwende 9 Zaubersprüche[BR]& Verwende 6 Segen[BR][BR]76. Produziere 20 Getränke[BR]& Produziere 10 x Brot[BR]& Produziere 10 x Gemüsekörbe[BR][BR]-- -- -- -- -- -- -- E N D E -- -- -- -- -- --[BR](Ohne Garantie, da INNO GAMES gern im nachhinein abändert)"}, {"12": "ACHTUNG - wenn man eine Quest ablehnt verschwinden gleichzeitig auch Folge-Quests[BR]Spoiler: AufgabenSammle 25.000 Göttliche Saaten einKaufe 8 WissenspunkteSammle 30.000 Unurium einGib 30 WP ausSchalte das Dimensionstor freiBaue das DimensionstorBesitze eine (Gut1++)Manufaktur & Sammle 200.000 Erweckte Güter einBesitze eine (Gut1++)Manufaktur der Stufe 16 oder höher & Schalte die Erleuchtete Marmormanufaktur der Elemente freiBesitze eine (Gut1++)Manufaktur der Stufe 24 oder höher & Schalte die Erleuchtete Stahlmanufaktur der Zwerge freiBesitze eine (Gut1++)Manufaktur der Stufe 28 oder höher & Schalte die Erleuchtete Manufaktur der gedeihenden Hölzer freiBesitze eine (Gut1++)Manufaktur der Stufe 30 oder höher & Verwende 10 ZaubersprücheBesitze eine (Gut1++)Manufaktur der Stufe 32 oder höher & Verwende 10 SegenSammle 1.000 Erleuchtete Güter ein & Besitze mindestens 3 Basismanufakturen der Stufe 32 oder höherSpende 1.000 Urwelt-MineralienSchalte den Überragenden Verkäufer freiNimm 6 Handelsangebote anHandle 4x mit dem Händler & Erkunde eine ProvinzBesitze einen Händler der Stufe 7Schalte den Produktionsbonus für Erleuchtete Güter freiHeuere einen Kaufmann an oder nutze ihn 10xSammele 40.000.000 Münzen einProduziere 1 Kessel von Haugur (ablehnbar)Produziere 1 Samowar von Heropi (ablehnbar)Produziere 1 Kräuterkorb von Gaelagil (ablehnbar)Produziere 1 Heiße Wanne von Aelrindel (ablehnbar)Produziere 1 Luftreiniger von Aeon (ablehnbar)Produziere 1 Karaffe von Calma (ablehnbar)Schalte die Teampark-Straße frei & Besitze mindestens 12 Felder der Teampark-StraßeSchalte das Authentische Hauptgebäude freiSchalte den Platz der Begrüßung freiBesitze 3 Plätze der Begrüßung & Heiße 2.000 Elvenar im Park willkommenBesitze 1 Wasserzentrum & Besitze 1 FeuerzentrumBesitze 1 Windzentrum & Besitze 1 ErdzentrumVerdiene 100 AktivitätsmedaillenZüchte 100 Baby-ElementareSchließe 10 Prüfungen ab (Abzeichen des Teamgeists produzieren)Schalte die Authentischen Wohngebäude freiBenutze den Kaufmann 5x & Sammle 50.000 Erleuchtete Güter einNimm 6 Handelsangebote an & Leiste 30x NachbarschaftshilfeBesitze mindestens 10 Wohngebäude der Stufe 40Schalte die Verbesserungen der Dünenkristall-Manufaktur frei & Sammle 100.000 Kristalle oder Obsidian ein (ablehnbar)Spende 20.000 UnuriumBesitze 12 ElementarzentrenBesitze 6 Plätze der BegrüßungBesitze ein Dimensionstor der Stufe 2Verdiene 50 Abzeichen des TeamgeistsSchalte Elementarzentren 2 freiBesitze mindestens 4 Elementarzentren der Stufe 2Baue dein Hauptgebäude auf Stufe 41 aus (ablehnbar)Verwende 10 SegenHeiße 5.000 Elfen im Park willkommenSchalte die Verbesserungen der Schriftmanufaktur der Drachen frei & Sammle 100.000 Schriftrollen oder Zaubertinte ein (ablehnbar)Besitze mindestens 1 Veredelte Manufaktur der Stufe 32 oder höher (ablehnbar)Besitze ein Dimensionstor der Stufe 3Verdiene 100 Abzeichen des Teamgeists & Heiße 10.000 Leute im Park willkommenLeiste 50x NachbarschaftshilfeVerdiene 400 Aktivitätsmedaillen mit dem Element Feuer & Züchte 100 FeuerelementareVerdiene 400 Aktivitätsmedaillen mit dem Element Wasser & Züchte 100 WasserelementareVerdiene 400 Aktivitätsmedaillen mit dem Element Erde & Züchte 100 ErdelementareVerdiene 400 Aktivitätsmedaillen mit dem Element Wind & Züchte 100 WindelementareSammle 80.000 Erleuchtete Güter einHeiße 6.000 Elvenar im Park willkommen & Verdiene 150 Abzeichen des TeamgeistsSchalte die Verbesserungen der Seidenmanufaktur der Feen frei & Sammle 100.000 Seide oder Königlichen Samt ein (ablehnbar)Besitze mindestens 2 Veredelte Manufakturen der Stufe 32 oder höher (ablehnbar)Besitze ein Dimensionstor der Stufe 4 & Hab 540 Provinzen abgeschlossenSchalte Elementarzentren 3 freiBesitze mindestens 12 Elementarzentren der Stufe 3 & Heiße 10.000 Menschen im Park willkommenSchließe 1 Prüfung ab (ablehnbar)Sammle 20 Visionsschwaden (ablehnbar)Besitze mindestens 50 Felder der Zusammenhalt-Straße in deiner StadtBilde 20.000 Elite-Bogenschützen aus & Bilde 5.000 leitende Ork-Strategen aus (ablehnbar)Schalte die Giftigen Wespenreiter II frei & Kämpfe und siege in 8 Provinzbegegnungen (ablehnbar)Besitze mindestens 3 Werkstätten der Stufe 41 oder höherBesitze mindestens 3 Basismanufakturen der Stufe 32 oder höher & Besitze mindestens 2 Veredelte Manufakturen der Stufe 32 oder höher & Besitze mindestens 2 Wertvolle Manufakturen der Stufe 32 oder höherSchalte den Schrein der Champions oder den Tempel der Geister freiVerkaufe das DimensionstorVerwende 9 Zaubersprüche & Verwende 6 SegenProduziere 20x Getränke & 10x Brot & 10 Gemüsekörbe"}, {"84": "AngelOfDead und Ayla Ayla; vielen herzlichen Dank, ihr habt mir sehr geholfen, wünsche euch einen schönen Abend, [BR]liebe Grüße Marzena"}, {"3": "Ich finde das Kapitel \"Teamgeist\" sehr angenehm.[BR]Vom Platzbedarf ist es überraschend sparsam und es geht auch ganz zügig voran gemessen an einigen der vorigen.[BR]Mir macht es Spaß und es sieht auch hübsch aus.[BR]Meist produziere ich über Nacht die kleinen Elementare und tagsüber die Abzeichen. Damit komme ich gut und stetig voran.[BR][BR]Und danke für eure Hinweise bezüglich der ablehnbaren Quests!"}, {"99": "So, Teamgeist geht dem Ende zu.[BR]Ich bin jetzt im \"geistlosen\" Teil, der hier schon bemängelt wurde.[BR]Einzige was ich noch tue: Teamabzeichen herstellen.[BR]Bis zu den letzten ca. 10 bis 12 Forschungspunkten fand ich das Kapitel auch ganz lustig.[BR]Allerdings mach ich auch drei Kreuze dafür, dass ich immer mal wieder tagsüber in Elvenar rein kann.[BR]Ich möchte mir nicht mall ansatzweise ausmalen, wie mich dieses Kapitel zur Verzweiflung bringen würde, wenn ich das nicht könnte.[BR]Soll ja Leute geben, die auf der Arbeit nicht die Möglichkeit haben, mal eben kurz rein zu huschen und neue Teamabzeichen in die Prod zu geben.[BR]Da finde ich 25 Min/ Abzeichen und eine Warteschlange von gerade mal 5 Abzeichen extrem wenig.[BR]Da zieht sich das mit Sicherheit noch mal elendig in die Länge."}, {"84": "Bin jetzt bei der 8ten Quest, und fühle mich eigentlich noch nicht im Kapitel, das einzige was ich wirklich für dieses Kapitel erledigen konnte ist die Stahlmanu  aufzubauen für die Barrenproduktion, den das Dimensionstor ist ja noch fürn Hugo, kann ja einstweilen nichts produzieren, da mir alle Zutaten dafür fehlen, oder ich übersehe etwas entscheidendes. Ich weiß das ich auch ohne Dimensionstorspielen könnte, aber ich spiele gerne nach der Story Quest und da wird es benötigt. Muss mal abwarten, wird schon werden. [BR]Liebe Grüße Marzena"}, {"4": "Marzena schrieb:\t\t\t----. Ich weiß das ich auch ohne Dimensionstorspielen könnte, aber ich spiele gerne nach der Story Quest und da wird es benötigt. Muss mal abwarten, wird schon werden.[BR]Liebe Grüße Marzena\t\tZum Vergrößern anklicken....Das Dimensionstor ist doch das Portal und ohne Portal ist eine Gastrasse nicht spielbar. Dieses Kapitel braucht die Gastrassengebäude und ist nicht mit Portalos alleine spielbar."}, {"84": "Danke, hab mich verschaut , man kann ohne den \"Platz der Begrüßung spielen, [BR]lg"}, {"99": "Marzena schrieb:\t\t\tBin jetzt bei der 8ten Quest, und fühle mich eigentlich noch nicht im Kapitel, das einzige was ich wirklich für dieses Kapitel erledigen konnte ist die Stahlmanu  aufzubauen für die Barrenproduktion, den das Dimensionstor ist ja noch fürn Hugo, kann ja einstweilen nichts produzieren, da mir alle Zutaten dafür fehlen, oder ich übersehe etwas entscheidendes. Ich weiß das ich auch ohne Dimensionstorspielen könnte, aber ich spiele gerne nach der Story Quest und da wird es benötigt. Muss mal abwarten, wird schon werden.[BR]Liebe Grüße Marzena\t\tZum Vergrößern anklicken....[BR]Die benötigten Nasen (Elvenar, Elfen, Menschen) produzier ich immer mit Portalsegen.[BR]Für den Quest - erst drei, dann irgendwann sechs - Platz der Begrüßung habe ich immer einen hergestellt, eingelagert und dann für den Quest alle auf einmal aufgestellt. Danach hab ich die wieder eingelagert zum Schreddern oder einfach gleich abreißen.[BR]War so ein Tipp hier aus dem Forum. Funktioniert natürlich nur, wenn man genügend Transportzauber aus dem Turm hat. Aber so ging das prima und hat mir nicht viel Platz geraubt."}, {"84": "Danke, für die Info, muss zuerst einmal die 1rsten Manus freischalten, da haperst aber mit den Mengen an Mana Bedarf, Portalsegen denke ich habe ich genug und bezüglich Platz, werde ich mal schauen, wie es sich bei mir am besten zum Aufbauen geht, lg"}]