[{"99": "Marzena schrieb:\t\t\tDanke, für die Info, muss zuerst einmal die 1rsten Manus freischalten, da haperst aber mit den Mengen an Mana Bedarf, Portalsegen denke ich habe ich genug und bezüglich Platz, werde ich mal schauen, wie es sich bei mir am besten zum Aufbauen geht, lg\t\tZum Vergrößern anklicken....[BR]Ich habe gerade mal bei dir nachgesehen. Dein Drachenkloster hinkt ein wenig hinterher. Den akuten Riesenmanabedarf erschlag ich eigentlich immer damit und mit der magischen Mitgift, sonst sieht das wirklich finster aus.[BR]Und eines hab ich schon mitbekommen. Das wird in Kapitel 19 nochmals drastischer mit dem Manabedarf.[BR][BR]Deswegen hatte ich mich schon relative früh auf das Drachenkloster konzentriert, sodass ich jetzt gerade gestern den Ausbau nach 30 starten konnte."}, {"87": "Was habt ihr mit der Magierin Tandriel gemacht? [smilie--sprite12][BR]So sah sie eigentlich aus - die hübsche Tandriel:[BR][IMG]https://i.ibb.co/SdTmhCb/https-de-forum-elvenar-com-index-php-attachments-elvenar-name-elfen-magierin-tandriel-1-jpg-30042.jpg[/IMG][BR]So sieht sie im Kapitel Teamgeist aus:[BR][IMG]https://i.ibb.co/VYHtVzx/https-de-forum-elvenar-com-index-php-attachments-elvenar-name-elfen-magierin-tandriel-2-jpg-30043.jpg[/IMG] [smilie--sprite9] [BR]Fehlt ihr ein Zahn? Und ihre Gesichtsfarbe? Oder ist das die neueste \"Make-Up-Linie\" bei den Elfen. [smilie--sprite2] Scheint mit etwas übertrieben zu sein. [BR][BR][smilie--sprite1] Könnten wir bitte die hübsche Tandriel wieder haben? Neu ist ja nicht grundsätzlich verkehrt, aber hier, finde ich, ist was schiefgelaufen."}, {"8": "Das Ende ist nah.[BR]...noch 280 Medaillen und ich kann endlich meinen lang ersehnten Schrein bauen! [smilie--sprite1][BR][BR]Das ganze Kapitel war sehr stimmig, entspannt und hat Spaß gemacht.[BR]...ein wenig ärgern mich die quests zur Manuforschung und Ausbau.[BR]Meine Hummel schimpft immer über den verschwendeten kostbaren Bauplatz![BR][BR]Sehr große Freude hatte ich beim Ausbau der Rüstkammern[BR]Die sehen einfach nur genial aus! und so schön klein...[BR]martialisch, einfach... Schöne braune Baumstämme...[BR]Der Orkmuezzin, der da oben, wild mit Äxten gestikulierend, die Orks anfeuert, ist einfach ein saugeiles Gimmick![BR]Vor lauter Inbrunst und Kampfeslust schwebt er über dem Boden [smilie--sprite8][BR]Großes Lob an die Kreativabteilung![BR]ein wenig werde ich der tollen Grafik hinterher trauern wenn ich sie nachher wieder ausbaue... die werden mir einfach zu blau![BR][BR]HiHi in Kap.20 werden sie zu orkischen CenterParks... darauf freu ich mich schon [smilie--sprite1]"}, {"9": "gergerw schrieb:\t\t\t...noch 280 Medaillen und ich kann endlich meinen lang ersehnten Schrein bauen! [smilie--sprite1]Zum Vergrößern anklicken....Na hast du aber ein Glück und die Freude sei dir gegönnt, doch zuvor musste man beide Wunderforschungen mit vielen Hunderten von Abzeichen füllen. Dies hat Inno im nachhinein geändert. Tja des einen Freud war des anderen Leid, denn alle anderen haben allein für diese 2 Forschungen ewig gebraucht. Da es weit über 100 Abzeichen pro Forschung gewesen sind, war es damals eine Hausnummer und es zog sich wie Kaugummi. [BR]Klar das es nun recht entspannt ist, wenn man vieles im nachhinein abänderte, indem man weniger verlangt oder gar ganz entnahm, wie bei diesen 2 Forschungen.  [smilie--sprite2] Das was du nun dafür bezahlst ist Pille Pale und nicht annähernd der Rede wert. [smilie--sprite7]"}, {"8": "Ich glaubs dir schon:[BR]Vermutlich 400 Medaillen oder so? [BR]Also hätte ich nochmal 2 Wochen pro Wunder forschen müssen...[BR][BR]Zugegeben: Momentan ist meine Vorfreude extrem schmerzhaft![BR]Viel länger darfs jetzt nicht dauern oder ich beiß in die Tastatur [smilie--sprite8][BR][BR]Schrein, Rüka... Kaserne +25%...gleich um die Ecke geht sogar das Trainingslager +25%[BR][BR]Fühlt sich an wie:[BR]Nach einer langen durchzechten Nacht im Casino endlich... der JACKPOT !!!! [smilie--sprite6]"}, {"9": "gergerw schrieb:\t\t\tIch glaubs dir schon:[BR]Vermutlich 400 Medaillen oder so?[BR]Also hätte ich nochmal 2 Wochen pro Wunder forschen müssen...\t\tZum Vergrößern anklicken....Ich weiß es nicht mehr ganz genau, aber kannst du hier im Thread ja nachlesen und die Änderung kam irgendwann letztes Jahr zu Gunsten der Nachzügler. Aber waren über Hundert pro Forschung auf alle Fälle und heute gibt es eben die 2 Forschungen für ein Apfel und ein Ei. Vielleicht weiß es @ustoni noch, denn er war damals genauso angefressen. [BR][BR]gergerw schrieb:\t\t\tZugegeben: Momentan ist meine Vorfreude extrem schmerzhaft![BR]Viel länger darfs jetzt nicht dauern oder ich beiß in die Tastatur [smilie--sprite8]Zum Vergrößern anklicken....Na dann freu dich auf das nächste Kapitel, dass toppt dann alles und bisher gab es da keine Änderung, welche dann auch mehr als ärgerlich wäre und irgendwo die Glaubwürdigkeit an INNO nehmen würde. Denn wie schonmal erwähnt, es gab gar Spieler die investieren gut und gerne Mal um eine doch so verflixte Forschung freizuschalten. [BR][BR]gergerw schrieb:\t\t\tSchrein, Rüka... Kaserne +25%...gleich um die Ecke geht sogar das Trainingslager +25%\t\tZum Vergrößern anklicken....Ich habe den Schrein nie gebaut, denn mir sagt er nicht zu. Orks bekommt man zu Genüge nachgeschmissen und die Ork-Krieger na ja ist Geschmacksache, ich brauch die fast nie. Arbeite und mach überwiegend alles mit Ranger und meiner lieben Blütenprinzessin. ^^[BR][BR]gergerw schrieb:\t\t\tFühlt sich an wie:[BR]Nach einer langen durchzechten Nacht im Casino endlich... der JACKPOT !!!! [smilie--sprite6]Zum Vergrößern anklicken....LOL ... .. .. na so abgedreht ist das gar nicht bei dem ganzen Glücksspiel in Elvenar. ^^"}, {"6": "AngelOfDead schrieb:\t\t\tVielleicht weiß es @ustoni noch, ...\t\tZum Vergrößern anklicken....Nein, sowas versuche ich immer möglichst schnell zu vergessen. Ist besser für den Blutdruck. [BR]War so wie immer: müssen nur genügend Spieler laut genug jammern, dann wirds vereinfacht. Soll ja jeder Anfänger möglichst schnell nach oben nachfolgen, das ist gut für den Dia-Umsatz."}, {"3": "Cruller schrieb:\t\t\tWas habt ihr mit der Magierin Tandriel gemacht? [smilie--sprite12][BR]So sah sie eigentlich aus - die hübsche Tandriel\t\tZum Vergrößern anklicken....Da kann ich dir nur zustimmen, @Cruller .[BR]Die neue sieht irgendwie gar nicht wie eine Magierin aus, sondern irgendwie ungesund und billig.[BR]Ich mag sie auch nicht!"}, {"100": "[IMG]https://i.ibb.co/ZfPHkz1/https-de-forum-elvenar-com-index-php-attachments-1665500698336-png-31599.png[/IMG][BR]Dies ist ein Erdzentrum  stufe 2   im teamgeist . [BR]Die normale Produktion  ist wie auch im Wiki erwähnt   15 . [BR]Portalbonus  +60 %    (mein Portal ist auf 4 )    +9 passt . [BR]Hummelchen   macht +40 %  Portalproduktion  ( ich denk das die das ist )    +6   passt. [BR][BR]Aber was bewirken die  300 % Produktion ??? [BR][BR]Die komplette Produktion  entsteht durch  andere  Kriterien .  Grundproduktion  , portal und wunder."}, {"101": "Die 300 % bilden nur das Verhältnis zur ursprünglichen Produktion wider. Ein Zentrum liefert in Stufe 1 ohne Bonus 10 Gärtner. Durch deinen Portal- und Hummelausbau bekommst du 30 Gärtner, also 300 %."}, {"35": "Ich bin neu eingetreten in Teamgeist und wurde von der Änderung der Shortcuts in den Manufakturen etwas überrascht. Mich jetzt an \"4\" anstelle \"2\" gewöhnen und \"5\" anstelle \"4\" ... wird mir schon gelingen.[BR]Meine Anregung ist, die Shortcuts auch im Wiki etc. mit aufzuführen. Auch für Events, z.B. den Nebelwald.[BR]Ich arbeite gern damit, aber woher soll man sie erahnen? Ein Mouseover verrät sie nicht.[BR]BTW, ich hatte mit \"5\" und \"6\" für die neuen Güter gerechnet. Wären die Warenklassen weiterhin untereinander angeordnet worden, hätte das auch geklappt."}, {"4": "hobbitrose schrieb:\t\t\tIch bin neu eingetreten in Teamgeist und wurde von der Änderung der Shortcuts in den Manufakturen etwas überrascht. Mich jetzt an \"4\" anstelle \"2\" gewöhnen und \"5\" anstelle \"4\" ... wird mir schon gelingen.[BR]Meine Anregung ist, die Shortcuts auch im Wiki etc. mit aufzuführen. Auch für Events, z.B. den Nebelwald.[BR]Ich arbeite gern damit, aber woher soll man sie erahnen? Ein Mouseover verrät sie nicht.[BR]BTW, ich hatte mit \"5\" und \"6\" für die neuen Güter gerechnet. Wären die Warenklassen weiterhin untereinander angeordnet worden, hätte das auch geklappt.\t\tZum Vergrößern anklicken....Schwierig war und ist es für mich, dann die unterschiedlichen normalen, erweckten und erleuchteten Güter richtig zu treffen. Denn die benötigen dann andere Ziffern und ich freue mich jeden Morgen, wenn ich abends das richtige angestellt habe."}, {"87": "hobbitrose schrieb:\t\t\tMeine Anregung ist, die Shortcuts auch im Wiki etc. mit aufzuführen.\t\tZum Vergrößern anklicken....Es gibt sie hier im Forum: Verfügbare Hotkeys und im Elvenar-Wiki: Interface - Hotkeys"}, {"35": "@Cruller danke,[BR]Num. 1-4​Startet die Produktion in Manufakturen. (1 ist die kürzeste Produktion, 4 die längste) Zum Vergrößern anklicken....Scheint mir unkomplett? 5 und 6 sehe ich nicht und für Platin stimmt es auch nicht.[BR][BR]Dass eine Umgewöhnung nötig ist, finde ich zusätzlich etwas lästig."}, {"100": "die erweckten Güter  gab es 2016  ( Forumsbeitrag , datum ) . [BR][BR]Im Forum ist es leider nicht ergänzt worden  , du kannst dies aber im Forum anregen . [BR][BR]Und Klick mal  unten auf meinen link  [smilie--sprite1]"}, {"35": "@schwatzwurzel  mein Zitat stammt aus dem Wiki. [BR]Es sieht so aus, als sei es weder im Forum noch im Wiki ergänzt worden."}, {"35": "[IMG]https://i.ibb.co/5LhkPFr/https-de-forum-elvenar-com-index-php-attachments-1674302622408-png-33639.png[/IMG][BR][BR]Bei dieser Quest dachte ich, dass man zuvor das Dimensionstor Stufe 2 erforschen muss. [BR]Doch man kann auch ohne diese Forschung ein Tor der Stufe 2 bauen. Habe ich da etwas verpaßt?[BR][IMG]https://i.ibb.co/bbs599c/https-de-forum-elvenar-com-index-php-attachments-1674302788173-png-33640.png[/IMG][BR][BR]Der Bau ist im Gange, auch OHNE die Forschung oben abgeschlossen zu haben.[BR][IMG]https://i.ibb.co/vvMzN3f/https-de-forum-elvenar-com-index-php-attachments-1674302876555-png-33641.png[/IMG][BR][BR]Sollte es so gewollt sein, wäre meiner Ansicht nach der Text ziemlich irreführend. [BR]Oder ist es ein Bug?"}, {"102": "Wenn ich mich richtig erinnere, konnte man mit der ersten Forschung \"Dimensionstor\" das Tor nur bis Stufe 2 ausbauen. Mit der Forschung \"Dimensionstor 2\" kommen dann Stufen 3-4 dazu. Die Angabe 2 bezieht sich hier nur auf den 2. Teil der Forschung zum Dimensionstor und nicht auf die Ausbaustufe."}, {"35": "@Anoli2 danke für die Antwort.[BR]Das ist jetzt auch meine Vermutung. [BR][BR]Ich finde es etwas unglücklich, dass man nirgends sehen kann, auch nicht mit Mouseover, dass ein Dimensionstor Stufe 3 (und 4?) mit der Forschung \"Dimensionstor 2\" gemeint ist. Wie schon geschrieben, ich bin da voll reingefallen."}, {"102": "Ja - leider fehlen in den Forschungen die Angaben zu den Ausbaustufen - ist mir jetzt auch bei den Manufakturen und anderen Gebäuden sehr aufgefallen - man sieht nicht mehr, welche Stufen mit Erledigung der Forschung zum Ausbau freigeschaltet werden. Man muss jetzt immer erst im Wiki nachschauen - finde das eine negative Entwicklung. Früher standen die Ausbaustufen immer mit im Forschungsbaum."}]