[{"103": "in der App ist es zu sehen, leider nur in der App"}, {"14": "wenn die Forschung in der Warteschleife ist, kann man eigentlich sehen, was sie freischaltet, wenn man draufklickt:[BR]das sollte hier bei allen \"gelben\" Forschungen gehen:[BR][BR][IMG]https://i.ibb.co/bbs599c/https-de-forum-elvenar-com-index-php-attachments-1674302788173-png-33640.png[/IMG][BR]ich hab leider kein gutes Beispiel, aber hier z.B.:[BR][BR][IMG]https://i.ibb.co/37QJ1m5/https-de-forum-elvenar-com-index-php-attachments-screenshot-354-png-33665.png[/IMG][BR][BR]die Wohngebäude sind in der Warteschleife, noch nicht erforscht (egal, ob nun schon WP drin sind oder nicht)[BR][BR]klicke ich darauf, kann ich unten sehen, was man damit freischaltet:[BR][BR][IMG]https://i.ibb.co/RjtWprx/https-de-forum-elvenar-com-index-php-attachments-screenshot-355-png-33666.png[/IMG][BR][BR]und klicke ich da wiederum drauf, kommen detaillierte Infos:[BR][BR][IMG]https://i.ibb.co/vYWfQxr/https-de-forum-elvenar-com-index-php-attachments-screenshot-356-png-33667.png[/IMG][BR][BR]was am Pc nicht gut ist: das man das nur dann sieht, nicht, wenn man weiter von der Forschung entfernt ist: man kann theoretisch also nicht den Weg, den man forschen will, vorplanen[BR][BR]warum kann man das eigentlich nicht immer abrufen ?"}, {"35": "@Neris[BR][IMG]https://i.ibb.co/2K70HLF/https-de-forum-elvenar-com-index-php-attachments-1674424254850-png-33683.png[/IMG][BR][BR]jep - funzt.[BR]DANKE. da muss man erst mal drauf kommen.[BR][BR]ABER - wie Du schon schriebst, man muss die Forschung mit WP gefüllt haben um das zu sehen. Wenn sie erforscht ist, sieht man es leider nicht mehr.[BR][IMG]https://i.ibb.co/R90qV2f/https-de-forum-elvenar-com-index-php-attachments-1674424522198-png-33684.png[/IMG][BR][BR]Bei mir war es so, dass ich an der Forschung davor ewig hängen geblieben bin. Mit Dimensionstor Stufe 2 wäre es vermutlich besser gegangen."}, {"104": "Bin auch gerade an der Stelle. Bei Ausbau Portal schaut man (naja ich) eigentlich immer auch so öfters vorbei, was es sonst braucht, wieviel es grob zu beurteilen bringt.. Dabei halbwegs erkennbar dass schon Ausbau möglich.[BR][BR]Sonst: Der Forschungstext[BR][IMG]https://i.ibb.co/V2sYcrm/https-de-forum-elvenar-com-index-php-attachments-1674425784949-png-33685.png[/IMG][BR]nennt nicht nur die Stufen nicht, sondern klingt noch zusätzlich explizt nach zweite Stufe nach 'erster Version'..[BR]Dazu Forschungen Elementarzentrum 2+3. [BR]Wenn Modaratoren hier lesen, jederzeit nur wenige Klicks, Verbesserung in die Wege zu leiten..[BR][BR][BR]------[BR][BR]Forscher Themenwechsel:[BR]Teamgeist ist erstes Kapitel mit Erleuchteten Gütern. Leicht überraschend, dass diese aus normalen Gütern + Unurium herzustellen sind.[BR]So schwer wie sonst alles, hätte man hier ja Erweckte Güter + Unurium nehmen können. War das schon größer diskutiert worden, Gründe pro/ contra?[BR]Zerfall in Erweckte Güter wäre noch eine Möglichkeit dazu, etwas Ausgleich. Wohl keine große Missbrauchsgefahr, darüber gesuchte Erweckte Güter leichter zu bekommen."}, {"105": "Muss man alle 12 Elementedings behalten?? Mußte meine Stadt ganz schön fleddern und mag gar nicht an die Livewelten denken, bei denen ich noch bei den Händlern bin"}, {"104": "Eine Quest 12 Gebäude auf Level 3 ist das Maximum in Quest-Reihe. Danach theoretisch wieder auf 4x ein Gebäude runter möglich, dauert halt nur entsprechend.[BR]Mit nach und nach 12 Gebäuden auf Level 3 + bisschen Level 1 dazu + kräftig Zeitbooster dazu habe ich es geradeso zwischen letzten Gemeinschaftsabenteuer Mitte Januar und aktuellem geschafft.."}, {"105": "Ok danke. Dann ist es ja gut, dasß ich die zwei nicht verkauft hab, die den platz für die 6 Plätze wegnahmen.[BR]Mal schauen, ob ich zwischendurch ein bißchen aufräumen kann. so ecken und kanten weg"}, {"35": "@Tha Loaharge nur als Idee: so schaut es bei mir aus (ohne viel Ecken und Kanten)[BR][IMG]https://i.ibb.co/dpj5PMg/https-de-forum-elvenar-com-index-php-attachments-1679948069066-png-35092.png[/IMG][BR][IMG]https://i.ibb.co/wMzjWzL/https-de-forum-elvenar-com-index-php-attachments-1679948219278-png-35093.png[/IMG]"}, {"106": "Da ich unter akuten Platzmangel leide, 40 Erkundungen a 95 + Stunden für eine einzige lächerliche Provinzerweiterung, ist eine Erweiterung nur mit Diamantkauf möglich. Hier nochmals herzlichen Dank an die Entwickler für ihre unermessliche Geldgier.[BR][BR]Nun zu meinem Problem, ist es zwingend notwendig alle Gebäude, Wasser-, Feuer-, Wind-, Erdzentrum zu erstellen, um die benötigten Abzeichen herzustellen? Oder kann man sich Gebäude einsparen?"}, {"9": "BENGEL-007 schrieb:\t\t\tNun zu meinem Problem, ist es zwingend notwendig alle Gebäude, Wasser-, Feuer-, Wind-, Erdzentrum zu erstellen, um die benötigten Abzeichen herzustellen? Oder kann man sich Gebäude einsparen?\t\tZum Vergrößern anklicken....Ja die sind nötig, sonst geht nichts mehr in der Forschung. Lediglich den Platz der Begrüßung kannst dir sparen, wenn du genug Portal-Segen hast.[BR][BR][IMG]https://i.ibb.co/Fkrr3p2/https-de-forum-elvenar-com-index-php-attachments-1688807613583-png-37413.png[/IMG]"}, {"99": "Ich meine mich allerdings zu erinnern, dass hier in diesem Thread jemand ohne - ich glaube, es war das Wasserzentrum - ausgekommen ist.[BR]Über die Questlinie reden wir jetzt ja nicht.[BR][BR]Dann kann man eben nur aus bestimmten Zentren die Abzeichen erstellen. Eine mögliche Produktion mit diesem bestimmten Abzeichen fällt dann weg. Aber die lässt man dann eben aus. Abzeichen ist ja Abzeichen.[BR][BR]Ist aber nur so ein rudimentäres Erinnern. Die Hand für ins Feuer würde ich nicht legen, denn ich kann mich partout nicht mehr dran erinnern, inwieweit die Zentrumsprod. in der Forschung direkt benötigt werden. Nicht nur die Teamabzeichen."}, {"35": "@BENGEL-007 in Deiner Stadt sind sehr viele freie Flächen.[BR]\t\t\thttps://www.elvenarchitect.com/city/planner/5f48201124eb4fa092791b51f79c452a/\t\tDa ließe sich bestimmt noch einiges optimieren. auch bei den Straßen.[BR][IMG]https://i.ibb.co/ZJdHYzQ/https-de-forum-elvenar-com-index-php-attachments-1686660173828-png-36956.png[/IMG]"}, {"8": "FrauRossi schrieb:\t\t\tIch meine mich allerdings zu erinnern, dass hier in diesem Thread jemand ohne - ich glaube, es war das Wasserzentrum - ausgekommen ist.[BR]Über die Questlinie reden wir jetzt ja nicht.[BR][BR]Dann kann man eben nur aus bestimmten Zentren die Abzeichen erstellen. Eine mögliche Produktion mit diesem bestimmten Abzeichen fällt dann weg. Aber die lässt man dann eben aus. Abzeichen ist ja Abzeichen.[BR][BR]Ist aber nur so ein rudimentäres Erinnern. Die Hand für ins Feuer würde ich nicht legen, denn ich kann mich partout nicht mehr dran erinnern, inwieweit die Zentrumsprod. in der Forschung direkt benötigt werden. Nicht nur die Teamabzeichen.\t\tZum Vergrößern anklicken....[BR]Jop, schaust du hier oder 2 Seiten zurück [smilie--sprite2][BR][BR]xafio schrieb:\t\t\tHallo zusammen,[BR]ich spiele nicht mehr sehr viel und habe nun nach einer möglichst bequemen Art gesucht, um dieses Kapitel durchzubekommen. Ohne, dass ich immer wieder nachdenken muss beim einloggen. Es liegt teilweise einfach zu viel Zeit dazwischen für die grauen Hirnzellen ^^[BR][BR]Spontan würde ich nun folgendes sehen, um Teamgeist-Abzeichen zu prodden:[BR][BR]Dimensionstor: Nur Prüfung des Feuertornados prodden.[BR]Gebäude: je 4x Luft, Erde und Feuer (kein Wasser, habe Platzmangel ^^)[BR]- Feuer: 3x Pilot + 1x Feuerelement[BR]- Erde: 3x Camper + 1x Erdelement[BR]- Luft: 3x Dirigent + 1 x Luftelement[BR]Plätze zum Hallo sagen: Nur Elfen prodden.[BR][BR]Mir ist klar, dass ich für den Ausbau der Gebäude und ggf. für die Quests auch Wasserelemente und andere Aktivitäten haben muss. Dafür habe ich 3 Wasserpärke im Inventar.[BR][BR]Hat das jemand ausprobiert?[BR]Oder habt ihr immer konsequent alle Elementpärke gestellt und mit den Aktivtäten sowei Prüfungen abgewechselt?[BR]Andere Ideen, wie man möglichst ohne viel nachzudenken bequem an die Teamgeist-Abzeichen gelangt?\t\tZum Vergrößern anklicken....[BR]funktioniert perfekt![BR][BR]...es funktioniert auch mit viel weniger Elementarzentren... Hängt von deiner Geduld ab"}, {"35": "Ob 3 Wasserelemente (3 x 6x5 = 90 Fliesen) oder je 1 Feuer-, Erde-, Luftelement (4x7 + 7x4 + 5x6 = 86) sollte vom Flächenverbrauch her eigentlich fast egal sein.[BR]Von jedem 3 Elemente zu besitzen hat den Vorteil, dass man ohne großes Nachdenken bei allen nacheinander Produktion 2, 3, 4 immer reihum starten kann, ab und zu Produktion 1 einschiebt. Teamabzeichen immer in der Reihenfolge 1 2 3 4 5 bauen.[BR]Dann wird alles gleichmäßig produziert und verbraucht und man muss nicht über Engpässe nachdenken.[BR]Ich bin gerade bei diesem Kapitel. Ich habe 4 Plätze der Begegnung (1 Menschen, 1 Elfen, 2 Elvenar) und je 3 Wasser-, Feuer-, Erde-, Luftelemente. Das funktioniert auch gut.[BR]Was lästig ist, sind die Team-Abzeichen. Man müßte dazu alle 1,5h in der Stadt neue Abzeichen ansetzen. Das bekomme ich leider mit meinem RL nicht zusammen. 2 Dimensionstore oder besser 10 wären echt hilfreich [smilie--sprite2][BR][BR]Und was noch lästig ist, dass die Menschen, Elfen, Elvenar manchmal die Flucht  ergreifen und das Dimensionstor dann auf den Letzten vergeblich wartet und der Begegnungsplatz aber leer ist."}, {"106": "Vielen lieben Dank an alle, die mit ihren Beiträgen eine Hilfeleistung beigetragen haben.[BR]Leider ist die Stadt komplett verbaut, da durch unzählige Kulturgebäude verunstaltet.[BR]Um Platz zu schaffen, müßte ich Kulturgebäude oder Gütergebäude ins Inventar verschieben. Entweder geht dann die Kultur komplett in den Keller, oder es fehlen Güter für Turnierverhandlungen. Muß mir einfach ein paar Gedanken machen, ob weitere Forschung überhaupt noch lohnt.[BR]LG Bengel"}, {"28": "BENGEL-007 schrieb:\t\t\tLeider ist die Stadt komplett verbaut, da durch unzählige Kulturgebäude verunstaltet.[BR]Um Platz zu schaffen, müßte ich Kulturgebäude oder Gütergebäude ins Inventar verschieben\t\tZum Vergrößern anklicken....Die Kultur zumindest vorübergehend nahezu komplett zu eliminieren hat mir bei den Gastvölkern immer ganz gut geholfen.[BR]Wenn man sich anschließend sogar noch zeitweise von 1-2 Manufakturen trennt, kann man meist auch noch 2-3 Wohngebäude ins Inventar teleportieren und trotzdem noch einigermaßen turnieren. Dann sollte schon ganz ordentlich Freifläche vorhanden sein.[BR]Bei mir braucht sowas immer sehr viel Zeit. da mir ja auch die Komposition der Gebäude optisch zusagen muss.[BR][BR]Viel Erfolg beim Grübeln und beim Stadtumbau! [smilie--sprite2]"}, {"100": "@hobbitrose [BR][BR]Mit 3 elementarzentren  produziert man nur noch das mittlere   Abzeichen des Teamgeistes . [BR]Aber das über Wochen .   [BR][IMG]https://i.ibb.co/xYHc6CC/https-de-forum-elvenar-com-index-php-attachments-1686688452752-png-36965.png[/IMG][BR]Es benötigt 3 gleiche Mengen an  Medaillien . Man produziert also wochenlang den gleichen  Kram . [BR]Jeden Tag  und jede Woche   und Jahre  ......"}, {"106": "Nach gründlicher Überlegung, werde ich mir diesen Abzeichen Horror nicht mehr antun. Letztes Kapitel mit über 7 Monaten Forschung trotz Einsatz von Zeit Boostern von weit über 1000 Stunden hat mir schon die Spielfreude gründlich verdorben. [BR]Nennt mir einfach die Minimalanforderung um ca. 300 Abzeichen herzustellen. Reicht für 2x Truppenerweiterung und Hauptgebäude. Danach entscheide ich, wie es sinnvoll weitergeht."}, {"100": "\t\t\thttps://www.elvenarchitect.com/calculators/research/\t\t[BR][IMG]https://i.ibb.co/st9y7qH/https-de-forum-elvenar-com-index-php-attachments-1686762593656-png-36986.png[/IMG][BR]Alle gebäude die keine strassen benötigen kannst du in eine ecke schieben . [BR]Dr. Frankenspleen ,  ballons ,  etc . dann gibt es schon platz"}, {"107": "BENGEL-007 schrieb:\t\t\tNach gründlicher Überlegung, werde ich mir diesen Abzeichen Horror nicht mehr antun.\t\tZum Vergrößern anklicken....Ich kann Dich wirklich verstehen, alle Kapitel mit den dazugehörigen Gastrassen haben mir Soaß gemacht (bis auf die Zauberer irgendwie), aber das hier finde ich sowas von elendig und langweilig, dass ich nicht mal mehr Lust hatte die Gebäude auszubauen. Ist echt nix für mich, aber irgendwann ist eben auch der Quark zu Ende und es wird (hoffentlich) wieder etwas spassiger...[BR][BR]Also heißt es  Zähne zusammen beißen und eben ein paar Abzeichen mal machen, dauert dann eben entsprechend, aber was solls schon [smilie--sprite1]"}]