[{"9": "BENGEL-007 schrieb:\t\t\tNennt mir einfach die Minimalanforderung um ca. 300 Abzeichen herzustellen.\t\tZum Vergrößern anklicken....Hehe .. .. .. und dabei waren es sogar 600 Abzeichen mehr, die man ja bereits rausgenommen hat, wo andere die \"dummen\" waren.[BR]Denn viele mussten die 2. Pflicht-Antike-Wunder-Forschung zusätzlich noch mit a' 300 Abzeichen belegen. ^^[BR]Nun noch mal 300 Abzeichen weniger und ich würde sagen, \"Volltreffer das Kapitel und all die vorangegangenen Feedback's, sprechen eine deutliche Sprache\". Willkommen im Club des ganz normalen Klick-Wahnsinns. [smilie--sprite1][BR]Charly1566 schrieb:\t\t\tIch kann Dich wirklich verstehen, alle Kapitel mit den dazugehörigen Gastrassen haben mir Soaß gemacht (bis auf die Zauberer irgendwie), aber das hier finde ich sowas von elendig und langweilig, dass ich nicht mal mehr Lust hatte die Gebäude auszubauen. Ist echt nix für mich, aber irgendwann ist eben auch der Quark zu Ende und es wird (hoffentlich) wieder etwas spassiger...\t\tZum Vergrößern anklicken....Warum sollte es anderen anders ergehen. ^^ Die denken sich das was sie hier schrieben ja nicht aus.[BR]Charly1566 schrieb:\t\t\tAlso heißt es Zähne zusammen beißen und eben ein paar Abzeichen mal machen, dauert dann eben entsprechend, aber was solls schon [smilie--sprite1]Zum Vergrößern anklicken....Hehe .... da musst du durch als Lurch, wenn du Frosch werden willst. ^^"}, {"8": "och kommt schon![BR]AngelOfDead schrieb:\t\t\tund dabei waren es sogar 600 Abzeichen mehr\t\tZum Vergrößern anklicken....dat ist nix![BR][BR]alles ist ein Kindergartengeburtstag Im Vergleich zu:[BR]\t\t\thttps://de.forum.elvenar.com/index.php?threads/kapitel-19-die-rache-des-verbannten.23768/\t\t[BR]Gab es jemals ein härteres Kapitel???[BR][BR]Mich würde echt interessieren, Wieviele in Kap.19 wahnsinnig werden???"}, {"55": "gergerw schrieb:\t\t\toch kommt schon![BR][BR]dat ist nix![BR][BR]alles ist ein Kindergartengeburtstag Im Vergleich zu:[BR]\t\t\thttps://de.forum.elvenar.com/index.php?threads/kapitel-19-die-rache-des-verbannten.23768/\t\t[BR]Gab es jemals ein härteres Kapitel???[BR][BR]Mich würde echt interessieren, Wieviele in Kap.19 wahnsinnig werden???\t\tZum Vergrößern anklicken....nur die die keine Geduld haben, um das Kapitel auszusitzen"}, {"32": "gergerw schrieb:\t\t\tMich würde echt interessieren, Wieviele in Kap.19 wahnsinnig werden???\t\tZum Vergrößern anklicken....ich würde eher meinen das war das gechillteste Kapitel seit langem - 2 bzw.3 sachen produzieren; kaum nachdenken/-rechnen.. kap.18 dagegen war ........kompliziert."}, {"100": "TischFlasche schrieb:\t\t\t2 bzw.3 sachen produzieren\t\tZum Vergrößern anklicken....In  19 ist es ein monatelanger Krampf  um an die verstrahlten Güter zu kommen .[BR]Das macht es für mich besonders nervig . [BR]Einfach die Gastrasse aufbauen  geht nicht .[BR]Ich brauch nur noch 10 Forschungen im Kapitel 19  [smilie--sprite1] , nur noch 2  Drittel der  benötigten Gastrassengüter  [smilie--sprite3][BR]Und meine Gastrassengebäude sind noch nicht fertigausgebaut  . So wie es mal geplant war . [smilie--sprite1][BR]Es fehlt immer noch Wunderwachs . [BR][BR]Im kapitel 18 hab ich nur den feurigen Wirbel im Dimensionstor produziert .[BR]Dort gibt es kein rechnen  [smilie--sprite1][BR][BR]Das fand ich wesentlich gechillter als crazy   Kapitel 19 (    feinstes Flugpulver und  Urwelt- Mineralien in Arendyll )"}, {"35": "TischFlasche schrieb:\t\t\tkap.18 dagegen war ........kompliziert.\t\tZum Vergrößern anklicken....Nicht wirklich.[BR][BR]Ich hatte mich mal kurz hingesetzt und gerechnet.[BR][BR]Herstellung und Verbrauch im Dimensionstor:[BR][IMG]https://i.ibb.co/S5LwRnd/https-de-forum-elvenar-com-index-php-attachments-1686863295908-png-37023.png[/IMG][BR][BR]Herstellung und Verbrauch in den Elementarzentren[BR][IMG]https://i.ibb.co/PGpwc0x/https-de-forum-elvenar-com-index-php-attachments-1686863767896-png-37024.png[/IMG][BR][BR]Man sieht, es sieht zwar einzeln verwirrend aus, aber wenn man immer alles schön gleichmäßig produziert, geht es am Ende auf.[BR]Siehe die Summenzeilen.[BR][BR]Aber es ziiiiiiiieht sich. Wenn die Verdammten hier noch schlimmer sind, \"freue\" ich mich schon darauf [smilie--sprite2]"}, {"4": "Ich weiß nicht, wo es hakt bei euch. Ich war in knapp 3 Monaten durch, hatte aber auch 4 bzw. 5 jedes Gutes stehen. Und dadurch genügend, um immer mal wieder zwischendurch zu boostern. Wenn man nur jeweils 3 pro Gut stehen hat, ist es nicht ausreichend, um mal was zu boostern."}, {"100": "Ich kann  die Beiträge  378 und  389      empfehlen .[BR]Und das einmal auszuprobieren .[BR]Bei der Storyquests etwas hakelig ,   wenn man sie spielen möchte  . [BR]In der späteren Gastrasse aber  bequem hirnbefreit . [smilie--sprite1]"}, {"35": "Das Problem ist bei diesem Kapitel m.E. nicht, die Waren für die Abzeichen zu bekommen, sondern dass man ständig online sein muss oder die Abzeichen-Produktion \"boostern\" muss um in vernünftiger Zeit voran zu kommen."}, {"32": "hobbitrose schrieb:\t\t\tIch hatte mich mal kurz hingesetzt und gerechnet.\t\tZum Vergrößern anklicken....so eine tabelle ist schon praktisch xD[BR]für mich bestand die komplexität darin die richtigen ..Dinger Abzeichen zu produzieren / zwischen den verschiedenen optionen die man hatte. bei jeder produktion nachkucken und rechnen obs passt [smilie--sprite12] ne! K19 gibts 1&2, und mit genügend Brutstätten (und Portalsegen) sehr simpel."}, {"108": "Frage: Woher krieg ich den Kessel von Haugur? Ich finde weder im Wiki noch im Forum dazu etwas."}, {"4": "Sumana schrieb:\t\t\tFrage: Woher krieg ich den Kessel von Haugur? Ich finde weder im Wiki noch im Forum dazu etwas.\t\tZum Vergrößern anklicken....Ja, ich hatte auch meine Probleme mit diesen Quests.[BR][BR]Das ist eine Produktion in den Stahlmanus, mind. auf 34 ausgebaut."}, {"108": "salandrine schrieb:\t\t\tJa, ich hatte auch meine Probleme mit diesen Quests.[BR][BR]Das ist eine Produktion in den Stahlmanus, mind. auf 34 ausgebaut.\t\tZum Vergrößern anklicken....Danke! Ging mir schon oft so, dass ich Infos zu Gebäuden oder Sets suchte und nichts fand.[BR][BR]LG Sumana"}, {"109": "Ist es möglich im Spiel, die Gebäude auszubauen, dann alle Wohngebäude und Kulturgebäude ins Inventar zu verschieben. Das ich möglichst viel Platz für die Gastrassen bekomme. Die Bewohner wären dann im minus, aber mit mehr Manufakturen könnte ich mehr Urunium generieren."}, {"9": "Arwen Galadriel schrieb:\t\t\tIst es möglich im Spiel, die Gebäude auszubauen, dann alle Wohngebäude und Kulturgebäude ins Inventar zu verschieben. Das ich möglichst viel Platz für die Gastrassen bekomme. Die Bewohner wären dann im minus, aber mit mehr Manufakturen könnte ich mehr Urunium generieren.\t\tZum Vergrößern anklicken....Sofern ich dich richtig verstehe, ist das hier die Antwort:[BR][BR][IMG]https://i.ibb.co/1T5NNPG/https-de-forum-elvenar-com-index-php-attachments-1691243288109-png-37968.png[/IMG][BR]Man kann mit Minus-Bevölkerung spielen, jedoch nichts mehr ausbauen, was Bevölkerung kostet![BR][BR]Ich mache das nur so, aber wie erwähnt, kannst du dann nur Event-Gebäude oder Wohngebäude ausbauen, aber nichts was Bevölkerung kostet!"}, {"21": "AngelOfDead schrieb:\t\t\tSofern ich dich richtig verstehe, ist das hier die Antwort:[BR][BR]Anhang 37968 ansehen[BR]Man kann mit Minus-Bevölkerung spielen, jedoch nichts mehr ausbauen, was Bevölkerung kostet![BR][BR]Ich mache das nur so, aber wie erwähnt, kannst du dann nur Event-Gebäude oder Wohngebäude ausbauen, aber nichts was Bevölkerung kostet!\t\tZum Vergrößern anklicken....In Kapitel 21 geht das nicht, denn die Wohnhäuser liefern eine neue Ressource die benötigt wird (umschaltbar in jedem Haus) In den vorangegangenen Kapiteln habe ich das stellenweise auch so gemacht, allerdings eben ohne bauen zu können."}, {"109": "Genau so meinte ich das. Zuerst alles ausbauen was gefordert wird, dann ins Inventar da man ja alles bis zum Ende der Gastrasse nicht mehr braucht. Habe mehrere Wohngebäude und Manufakturen im Inventar. Je mehr Manufakturen, desto mehr Unurium produziert der Händler. Hängen diese Werte mit den Bewohnern zusammen, das er dann weniger produziert, oder spielt dies keine Rolle.           Danke für die schnelle Antwort"}, {"109": "Beginne erst mit Kapitel Teamgeist, dies sind die Vorbereitungen und Fragen"}, {"9": "Indianaking schrieb:\t\t\tIn Kapitel 21 geht das nicht, denn die Wohnhäuser liefern eine neue Ressource die benötigt wird (umschaltbar in jedem Haus) In den vorangegangenen Kapiteln habe ich das stellenweise auch so gemacht, allerdings eben ohne bauen zu können.\t\tZum Vergrößern anklicken....Ich mache das auch jedes mal nur nach Beendigung einer Gast-Rasse. Mitten in einer Gast-Rasse, macht das keinen Sinn, zumindest nicht, wenn man so wie ich die Story lesen möchte und folglich die Storyline spielt.[BR]Nach Beendigung einer Gast-Rasse, gehe ich stets und gern ins Minus, mit der Begründung, weil ich dann keine Bevölkerung brauche.[BR][BR]Arwen Galadriel schrieb:\t\t\tGenau so meinte ich das. Zuerst alles ausbauen was gefordert wird, dann ins Inventar da man ja alles bis zum Ende der Gastrasse nicht mehr braucht.\t\tZum Vergrößern anklicken....Ja das geht und machte ich im Kapitel Orks und den Händlern von Unur so.[BR][BR]Arwen Galadriel schrieb:\t\t\tUnurium produziert der Händler. Hängen diese Werte mit den Bewohnern zusammen, das er dann weniger produziert, oder spielt dies keine Rolle. Danke für die schnelle Antwort\t\tZum Vergrößern anklicken....Unurium hängt an 2 Faktoren und bei mir war es stets ausreichend, was der Händler abwirft.[BR][BR]Ergo. die normale Sammlung (24 Std.) ist Bevölkerungsabhängig.[BR]Das heißt, um so mehr bei dir Arbeiten, also Bevölkerung du benötigst, um so besser.[BR][BR][IMG]https://i.ibb.co/JKksW5M/https-de-forum-elvenar-com-index-php-attachments-1691244617190-png-37970.png[/IMG][BR][BR].. ... und der Sammelbonus ist abhängig von dem Kulturwert, denn du in deiner Stadt benötigst, also auch hier, um so mehr, um so besser.[BR][BR][IMG]https://i.ibb.co/fpbwbnm/https-de-forum-elvenar-com-index-php-attachments-1691245055507-png-37972.png[/IMG][BR][BR]Um so häufiger du also einsammelst (frühestens alle 3 Std.), um so mehr bekommst du auch.[BR]Setzt du nun die 2 Faktoren so Hoch wie du kannst, dann langte bei mir der Händler immer aus.[BR][BR]Ausrechnen kannst du dir ja so auch im Vorfeld, was du am Tag so einnimmst (je nach dem, wie oft du eben Online kommst)."}, {"109": "Vielen Dank für die Tipps, wenn die Quest stimmt, wäre ich bereits bei 33. Dann folgt kein Ausbau mehr."}]