[{"9": "Arwen Galadriel schrieb:\t\t\tVielen Dank für die Tipps, wenn die Quest stimmt, wäre ich bereits bei 33. Dann folgt kein Ausbau mehr.\t\tZum Vergrößern anklicken....Wenn du nach dieser Storyline spielst, kannst du alles so machen wie du dir vorgenommen hast, denn diese Storyline wurde bislang noch nicht abgeändert: [BR]\t\t\thttps://de.forum.elvenar.com/index.php?threads/kapitel-18-teamgeist.22057/post-396530\t\t"}, {"109": "Spiele nach dieser. Mehr Bevölkerung und mehr Kultur ist mehr Unurium."}, {"110": "Also finde das mehr als merkwürdig, dass ein Questgeber erscheint, der mich auffordert, ein Nichtbonus-Erleuchtetes Gut zu produzieren. Ist zwar ablehnbar, habe aber gelesen, man sollte die nicht ablehnen, weil sonst andere Quests verloren gehen. Trotzdem - auch wenn ablehnbar ... merkwürdig."}, {"35": "Steht da produzieren? Wenn ich mich recht erinnere, funktioniert auch erhandeln."}, {"110": "es steht \"produziere\" ... wenn auch erhandeln möglich ist, ist das nicht ersichtlich (obwohl du schon recht hast ... manchmal hilft das trotzdem) - jetzt hab ich die Produktion aber mal eingestellt - wird mich schon nicht arm machen [smilie--sprite2]"}, {"2": "...die ablehnbaren sind Story-Unterquests - da kommen manchmal mehrere infolge - lehnst du die 1. ab, bekommst du die Folgequests nicht (und diese geben ein paar Diamanten ab)...ich versuche es mal richtig zu sortieren - bei iDavis ( https://idavis-elvenar.com/guestRaces/teamspirit.html#quests ) findet man nur die Storyquests - die Unterquests wurden vermutlich abgelehnt und sind bis auf 1 nicht gelistet...[BR][BR]...zwischen Storyquest 21 und 22 - diese da..[BR][BR][IMG]https://i.ibb.co/QM67Wkv/https-de-forum-elvenar-com-index-php-attachments-k18j-png-39106.png[/IMG][IMG]https://i.ibb.co/FWT5zpD/https-de-forum-elvenar-com-index-php-attachments-k18o-png-39107.png[/IMG][BR]...werden diese 4 eingeschoben...lehnt man die 1. ab, kommen die anderen nicht...[BR][IMG]https://i.ibb.co/W5CN4sP/https-de-forum-elvenar-com-index-php-attachments-k18l-png-39095.png[/IMG][IMG]https://i.ibb.co/LtCF2F3/https-de-forum-elvenar-com-index-php-attachments-k18n-png-39096.png[/IMG][IMG]https://i.ibb.co/CKtg3gb/https-de-forum-elvenar-com-index-php-attachments-k18p-png-39097.png[/IMG][IMG]https://i.ibb.co/XbxkFT7/https-de-forum-elvenar-com-index-php-attachments-k18q-png-39098.png[/IMG][BR][BR]...bei der 4. dieser Quests könnte es sein, daß man hier die 9-Std.-Produktion seines Bonusgutes erfüllen muss (ich hab Urweltmineralien) - die 3 Aufgaben zuvor waren die 3-Std.-Prods aller 3 Standard-Manus..."}, {"2": "...dann werden zwischen Quest 31 und 33...[BR][IMG]https://i.ibb.co/WgkFmw6/https-de-forum-elvenar-com-index-php-attachments-k18z-png-39108.png[/IMG][IMG]https://i.ibb.co/zscvQMv/https-de-forum-elvenar-com-index-php-attachments-k18ab-png-39109.png[/IMG][BR][IMG]https://i.ibb.co/rvd9mQz/https-de-forum-elvenar-com-index-php-attachments-k18af-png-39110.png[/IMG]...wieder 4 Unterquests eingeschoben...[BR][IMG]https://i.ibb.co/FD6KPj9/https-de-forum-elvenar-com-index-php-attachments-k18aa-png-39111.png[/IMG][IMG]https://i.ibb.co/Kxg9hrT/https-de-forum-elvenar-com-index-php-attachments-k18ad-png-39112.png[/IMG][IMG]https://i.ibb.co/1qPDY2d/https-de-forum-elvenar-com-index-php-attachments-k18ae-png-39113.png[/IMG][IMG]https://i.ibb.co/Kb7ThQr/https-de-forum-elvenar-com-index-php-attachments-k18ag-png-39114.png[/IMG][BR][BR]...ich denke 2 zwischen 31 und 32 und dann nochmal 2 zwischen 32 und 33 - lehnt man die jeweils 1. ab, kommt die 2. mit den Diamanten nicht..."}, {"2": "...dasselbe Spiel zwischen Quest 38 und 40...[BR][IMG]https://i.ibb.co/PDdJWBm/https-de-forum-elvenar-com-index-php-attachments-k18al-png-39115.png[/IMG][IMG]https://i.ibb.co/XS1BFjL/https-de-forum-elvenar-com-index-php-attachments-k18an-png-39116.png[/IMG][IMG]https://i.ibb.co/GtHC2GZ/https-de-forum-elvenar-com-index-php-attachments-k18ar-png-39117.png[/IMG][BR]...hier die eingeschobenen...[BR][IMG]https://i.ibb.co/xG1myS6/https-de-forum-elvenar-com-index-php-attachments-k18am-png-39118.png[/IMG][IMG]https://i.ibb.co/ypXdrB4/https-de-forum-elvenar-com-index-php-attachments-k18ao-png-39119.png[/IMG][BR][IMG]https://i.ibb.co/dt6W6Q0/https-de-forum-elvenar-com-index-php-attachments-k18ap-png-39120.png[/IMG][IMG]https://i.ibb.co/72Z1DKR/https-de-forum-elvenar-com-index-php-attachments-k18aq-png-39121.png[/IMG][BR][BR]...das ist die Reihenfolge, in der ich die Screenshots gemacht habe - aber ich denke, daß die anders miteinander verknüpft sind (gleicher Questgeber)..."}, {"2": "...zwischen 48 und 49...[BR][IMG]https://i.ibb.co/RCKT5FK/https-de-forum-elvenar-com-index-php-attachments-k18az-png-39123.png[/IMG][IMG]https://i.ibb.co/JsZhbgh/https-de-forum-elvenar-com-index-php-attachments-k18bc-png-39124.png[/IMG][BR]...werden diese beiden eingeschoben...[BR][IMG]https://i.ibb.co/jJCw5Hk/https-de-forum-elvenar-com-index-php-attachments-k18ba-png-39125.png[/IMG][IMG]https://i.ibb.co/YT3tvc9/https-de-forum-elvenar-com-index-php-attachments-k18bb-png-39126.png[/IMG][BR][BR]...und dann sind es zwischen 51 und 53...[BR][IMG]https://i.ibb.co/6syvmPH/https-de-forum-elvenar-com-index-php-attachments-k18be-png-39127.png[/IMG][IMG]https://i.ibb.co/dBm4Hvb/https-de-forum-elvenar-com-index-php-attachments-k18bh-png-39128.png[/IMG][BR]...nochmal 4 Unterquests, wobei iDavis die 1. davon als NR. 52 zählt...[BR][IMG]https://i.ibb.co/gWTTMyx/https-de-forum-elvenar-com-index-php-attachments-k18bf-png-39129.png[/IMG][IMG]https://i.ibb.co/5sMZD60/https-de-forum-elvenar-com-index-php-attachments-k18bg-png-39130.png[/IMG][IMG]https://i.ibb.co/86HBpLw/https-de-forum-elvenar-com-index-php-attachments-k18bi-png-39131.png[/IMG][IMG]https://i.ibb.co/Wv9g9MX/https-de-forum-elvenar-com-index-php-attachments-k18bj-png-39132.png[/IMG][BR][BR]...man erkennt die Unterquests daran, daß hier ein weiterer Questgeber am linken Rand erscheint - man kann die Unterquests stehen lassen und mit den normalen Quests weitermachen..."}, {"110": "Ja, das mit dem Stehen lassen dachte ich mir schon - aber dann hängt der Kerl da ewig rum und da hängen schon so viele [smilie--sprite6] [smilie--sprite2]"}, {"2": "Lorinar schrieb:\t\t\tJa, das mit dem Stehen lassen dachte ich mir schon - aber dann hängt der Kerl da ewig rum und da hängen schon so viele [smilie--sprite6] [smilie--sprite2]Zum Vergrößern anklicken.......generell gibt es auch in anderen Kapiteln Unterquests, die dann als extra-Questgeber erscheinen - früher wurden dafür die Schleifenquests unterbrochen - wie das jetzt ist, kann ich dir nicht so genau sagen - Kapitel 18 war aber das Einzige mir bekannte, bei dem nach einer Ablehnung weitere Quests \"verschwunden\" sind - Kapitel 18 ist bei mir aber schon lange her...[BR][BR]...bevor ich es vergesse: Handeln geht bei diesen Quests nicht, da du ja eine ganz bestimmte Produktion durchführen sollst und nicht einfach nur Güter sammeln...[BR][BR]...Nicht-Bonus-Güter wirst du auch in den nächsten Kapiteln herstellen müssen, da sich die Story öfters mal auf eine ganz bestimmte Produktion bezieht (man braucht halt storytechnisch genau diesen Gegenstand und keinen anderen, auf den es den Bonus geben würde)..."}, {"110": "ah ... danke, @Romilly - na, wie gesagt - die 1 Produktion wird mich nicht umbringen, aber trotzdem - Nichtbonus zu produzieren, widerstrebt mir im Innersten meiner Seele ... und ... wieso auf Dias verzichten"}, {"110": "Die Gastrasse an sich ist sehr schön anzusehen und spielt sich auch recht komfortabel, manchmal ein wenig unausgewogen, weil immer wieder \"was\" fehlt, aber das ist vernachlässigbar. Der Platzanspruch ist einigermaßen human. Was ich aber ganz schlimm finde, ist dieser komische Händler, der nur betrieben kann, wenn man ihn anmietet und - trotz steigender Mietpreise pro Händler - immer nur Minimalmengen (im Vergleich zu den Anforderungen) und zwar immer die gleichen, egal, was man für den Händler an sich bezahlt hat (ich glaube, die Mengen des ersten haben sich irgendwann minimal erhöht) herantragen kann, aber mehr als 2000 Erleuchtete pro Handel wurden es bisher pro Händler bei mir nicht. Nach Ablauf der Mietzeit muss ich wieder ablöhnen. Jedenfalls klickt man sich hier wirklich einen Wolf und wenn ich für den Ausbau des Dimensionstors auf Stufe 3 86k Erleuchtete Güter brauche, muss ich entweder den ganzen Tag klicken (und dann warten, bis ich wieder klicken kann, weil jemand erst kaufen muss) oder ich renne ganz automatisch in die nächtliche 10%-Abschlagsfalle. Die Spieler der \"ersten Stunde\" tun mir nachträglich leid, ich profitiere zumindest (in Arendyll, wo anders kann ich's noch nicht beurteilen) von einem funktionierenden Markt - hab aber eigentlich auch keine Lust, mich den ganzen Tag mit dem Händler zu beschäftigen. Die Gastrasse ist schön (Daumen hoch), der Händler nicht."}, {"111": "Den Händler miete ich garnicht an, ich hab bisher alles an Gütern bekommen indem ich die Angebote der anderen angenommen habe. Bei mir reicht das Mana nicht ganz aus. Also entweder kann ich die Produktion bedienen oder für Ausbauten/Forschung sammeln. Aber das ist nicht wirklich ein Problem, ich will meine Wunder so wie so ausbauen, dann passt das. Ansonsten stimme ich dir zu."}, {"13": "@Lorinar - da schließ' ich mich CMDWS an >[BR]CMDWS schrieb:\t\t\tDen Händler miete ich gar nicht an, ich hab bisher alles an Gütern bekommen indem ich die Angebote der anderen angenommen habe. [...]\t\tZum Vergrößern anklicken....Wenn du ein Auge auf dem regulären Handel hast, kannst du bei entsprechenden Angeboten im Verhältnis zum Kaufmann in kürzester Zeit ein Vielfaches der 'Erleuchteten Güter' erstehen und nebenbei ersparst du dir die Kaufmann-Klickerei komplett. [smilie--sprite1]"}, {"110": "hab ich schon ... aber da ist leider nicht immer was drinnen, wenn ich das brauche ... meistens muss ich selber einstellen, aber ja ... ist ne Alternative."}, {"112": "ich mach dann oft mal sowas wie \" ich brauch zwar Alraunen und habe Barren, aber das gibts nicht, also kaufe ich erstmal Mineralien und dann kauf ich die Alraunen für die Minerale. genau so mache ich das bei den anderen erleuchteten gütern. meist klappt das"}, {"35": "Als ich soweit war, war auf dem Markt in Arendyll krass Barrenmangel. Da haben mich meine drei Händler gerettet. Es dauerte aber auch ewig, bis ich alles zusammen hatte. Dank Gilde war es erträglich.[BR]Mit Ausbau des Hauptgebäudes erhöhen sich auch die Mengen des Händlers.[BR]Durch die erste \"Durststrecke\" muss man leider durch [smilie--sprite3] Doch das kennt man ja, irgendwo klemmt es immer mal.[BR][BR]Meine erleuchteten Manufakturen sind übrigens mit FF dauerverzaubert. Die \"Hummel-Strategie\" hilft auch hier beim vorankommen.[BR]Viel Erfolg @Lorinar  und immer einstellen, was du suchst. Über die Nachricht der angenommenen Angebote kannst Du dann sogar Leute kennenlernen, die das haben was du brauchst und das suchen, was Du hast."}, {"2": "Lorinar schrieb:\t\t\tich glaube, die Mengen des ersten haben sich irgendwann minimal erhöht\t\tZum Vergrößern anklicken.......die Mengen, die du selbst mit dem Kaufmann tauschen kannst, hängen von der Ausbaustufe deines HG ab - und das startet glaub ich bei 1800 - da aber die Kaptitel21-Spieler mittlerweile schon für 11.000 einstellen können, empfiehlt es sich, so einen Spieler, der das gewünschte Gut hat, anzuschreiben und den zu bitten, daß er dir mehrfach hintereinander entsprechende Angebote einstellt - so kannst du auch mal 100.000 \"am Stück\" tauschen - um genügend Tauschmaterial zu haben, kannst du, wenn du eine Forschung abschließen möchtest, falls vorhanden den Sturmphönix füttern und dann mit Zeitboostern mehrfach von der verzauberten Manu absammeln (damit nicht auch noch was davon zerfällt) - ein gut ausgebautes Handelszentrum hilft hier auch gut weiter..."}, {"110": "okay, danke, @Romilly. Guter Tip  [smilie--sprite1]"}]