[{"53": "Die Story-Questline ist bei mir zumindest schon mal verfügbar."}, {"21": "jens333 schrieb:\t\t\tIhr spielt schon so lange und jedesmal müssen wir sagen, erst wenn das Update bei allen Sprachen durch ist (DE ist nicht allein^^) , dann wird das neue Kapitel aktiviert. [smilie--sprite2]Zum Vergrößern anklicken....[BR]Ich dachte ja bis jetzt auch immer daß DE als letzter dran ist mit update ^^.... und wieder was gelernt."}, {"6": "jens333 schrieb:\t\t\thr spielt schon so lange und jedesmal müssen wir sagen, erst wenn das Update bei allen Sprachen durch ist (DE ist nicht allein^^) , dann wird das neue Kapitel aktiviert. [smilie--sprite2]Zum Vergrößern anklicken....Dann solltet ihr mal ernsthaft darüber nachdenken, welche Meldungen ihr übers Posthorn rausgebt.  [smilie--sprite2]"}, {"50": "Was ich nicht verstehe.... warum bekommen die englischen Spieler das Update 2 Tage vor uns?[BR][IMG]https://i.ibb.co/1qqSrJz/https-de-forum-elvenar-com-index-php-attachments-1619702621713-png-24121.png[/IMG][BR][BR]Weil es sich bei INNO eingebürgert hat, das die englischen Spieler die Beta-2-Tester sind oder gibt es einen tatsächlichen Grund?"}, {"21": "Beim nächsten Mal wirds dann so wie auf dem beta sein- keine Vorankündigungen mehr sondern eines Tages einloggen und patsch - das neue Kapitel ist da. [smilie--sprite11]"}, {"1": "@OMcErnie Um das Verhalten einiger Dinge mit noch mehr Spielern zu \"testen\" als auf der Beta. Läuft etwas schief, ist nur eine Sprachversion betroffen und nicht alle.[BR][BR]Bezüglich der Mitteilung zur neuen Gastrasse im Posthorn: Da scheint es noch viel mehr Zwist zwischen einigen Rassen zu geben als gedacht. Es wird aber fieberhaft daran gearbeitet, diese Spannungen zu beseitigen und das neue Kapitel starten zu lassen. Diese Spannungen waren so nicht vorgesehen und deswegen wurde die Nachricht, die schon vor ein paar Tagen eingepflegt wurde), eben auch zu/so früh versendet. Um sich das leichter vorzustellen: Montags wird diese Ankündigung eingepflegt und die Startzeit eingetragen. Donnerstags kommt sie dann also zu der gespeicherten Startzeit. Leider weiß die Meldung nicht, dass sie vielleicht hätte doch noch warten sollen, hat ihr ja keiner was gesagt. [smilie--sprite2]"}, {"21": "Tacheless schrieb:@OMcErnie Um das Verhalten einiger Dinge mit noch mehr Spielern zu \"testen\" als auf der Beta. Läuft etwas schief, ist nur eine Sprachversion betroffen und nicht alle.[BR][BR]Bezüglich der Mitteilung zur neuen Gastrasse im Posthorn: Da scheint es noch viel mehr Zwist zwischen einigen Rassen zu geben als gedacht. Es wird aber fieberhaft daran gearbeitet, diese Spannungen zu beseitigen und das neue Kapitel starten zu lassen. Diese Spannungen waren so nicht vorgesehen und deswegen wurde die Nachricht, die schon vor ein paar Tagen eingepflegt wurde), eben auch zu/so früh versendet. Um sich das leichter vorzustellen: Montags wird diese Ankündigung eingepflegt und die Startzeit eingetragen. Donnerstags kommt sie dann also zu der gespeicherten Startzeit. Leider weiß die Meldung nicht, dass sie vielleicht hätte doch noch warten sollen, hat ihr ja keiner was gesagt. [smilie--sprite2]Zum Vergrößern anklicken....[BR]Gebt es doch einfach zu: ihr habt den Startknopf verbummelt."}, {"1": "Indianaking schrieb:\t\t\tGebt es doch einfach zu: ihr habt den Startknopf verbummelt.\t\tZum Vergrößern anklicken....Den hab ich immer noch bei mir zu Hause (vom letzten GA noch). Hatte noch keine Zeit in nach Hamburg zurück zu bringen und um euch zu ärgern, drücke ich nicht selbst drauf. [smilie--sprite7]"}, {"54": "ist es wirklich wichtig, ob die neue GR heute, morgen oder nächste Woche online geht ????"}, {"6": "Tacheless schrieb:\t\t\tLeider weiß die Meldung nicht, dass sie vielleicht hätte doch noch warten sollen, hat ihr ja keiner was gesagt. [smilie--sprite2]Zum Vergrößern anklicken....Dass die Meldung gekommen ist, ist ja nicht tragisch. Genau genommen ist es auch völlig egal, zu welcher Uhrzeit die Gastrasse startet.[BR][BR]Allerdings solltet ihr beim nächsten mal auf die Formulierung etwas mehr achten. Statt[BR]\"Ein neues Kapitel startet jetzt in Elvenar!\" [BR]einfach [BR]\"Ein neues Kapitel startet heute in Elvenar!\"[BR]schreiben. Dann gibts auch keine Missverständnisse.[BR][BR]Erste Reaktion von mir als die Meldung kam: Forschungsbaum öffnen. [smilie--sprite1]"}, {"44": "ist es wirklich wichtig, ob die neue GR überhaupt angekündigt wird (jetzt vom Werbeeffekt mal abgesehen)?"}, {"21": "Kleiner Auszug aus dem US Forum : (übersetzt)[BR][BR][BR][BR]HerrderWelten schrieb:\t\t\tist es wirklich wichtig, ob die neue GR heute, morgen oder nächste Woche online geht ????\t\tZum Vergrößern anklicken....[BR]Für manche Spieler ja [smilie--sprite7]"}, {"6": "Jirutsu schrieb:\t\t\tist es wirklich wichtig, ob die neue GR überhaupt angekündigt wird (jetzt vom Werbeeffekt mal abgesehen)?\t\tZum Vergrößern anklicken....Für Dich doch ohnehin nicht mehr, oder?  [smilie--sprite2]"}, {"54": "ustoni schrieb:\t\t\tDass die Meldung gekommen ist, ist ja nicht tragisch. Genau genommen ist es auch völlig egal, zu welcher Uhrzeit die Gastrasse startet.[BR][BR]Allerdings solltet ihr beim nächsten mal auf die Formulierung etwas mehr achten. Statt[BR]\"Ein neues Kapitel startet jetzt in Elvenar!\"[BR]einfach[BR]\"Ein neues Kapitel startet heute in Elvenar!\"[BR]schreiben. Dann gibts auch keine Missverständnisse.[BR][BR]Erste Reaktion von mir als die Meldung kam: Forschungsbaum öffnen. [smilie--sprite1]Zum Vergrößern anklicken....die Misverständnisse gäb es schon ...[BR][BR]nämlich dann, wenn die erst morgen eingespielt wird - oder übermorgen ?[BR][BR]is mir sowas von egal [smilie--sprite1][BR][BR][BR]Indianaking schrieb:\t\t\tKleiner Auszug aus dem US Forum : (übersetzt)[BR][BR]Anhang 24122 ansehen[BR][BR][BR][BR]Für manche Spieler ja [smilie--sprite7]Zum Vergrößern anklicken....die armen [smilie--sprite1]"}, {"1": "Das neue Kapitel wird schon noch starten...ich tippe sogar ganz feste auf heute. [smilie--sprite2] *sucht hektisch den roten Button*"}, {"54": "grins ..."}, {"11": "ohne worte[smilie--sprite1]"}, {"6": "Tacheless schrieb:\t\t\tDas neue Kapitel wird schon noch starten...ich tippe sogar ganz feste auf heute. [smilie--sprite2] *sucht hektisch den roten Button*\t\tZum Vergrößern anklicken....Du sollst nicht auf heute tippen, Du sollst auf den roten Button tippen.  [smilie--sprite8][BR][BR]Edit: ganz feste!  [smilie--sprite2]"}, {"51": "gleich hat er ihn gefunden, den roten knopf, und was is passiert? Batterie leer [smilie--sprite2]"}, {"1": "ustoni schrieb:\t\t\tDu sollst nicht auf heute tippen, Du sollst auf den roten Button tippen.  [smilie--sprite8][BR][BR]Edit: ganz feste!  [smilie--sprite2]Zum Vergrößern anklicken....Vielleicht habe ich ihn verloren? Vielleicht hat ihn einer meiner Kinder in die Untiefen seines Kinderzimmers mitgenommen und dort vergessen? Da haben wir wohl leider Pech gehabt... [smilie--sprite3]"}]