[{"54": "da sollte man mal mit irgendjemand tacheless reden [smilie--sprite1]))))"}, {"1": "HerrderWelten schrieb:\t\t\tda sollte man mal mit irgendjemand tacheless reden [smilie--sprite1]))))\t\tZum Vergrößern anklicken....Ich hab aber keine Lust gegen motzende Orks und arrogante Elvaren anzutreten. Wer will, kann gerne sein Glück versuchen! [smilie--sprite2][BR][BR]Nee, es wird tatsächlich gerade daran gearbeitet, das neue Kapitel freizuschalten. Leider steckt da noch viel mehr als ein roter Button dahinter."}, {"54": "Tacheless schrieb:\t\t\tIch hab aber keine Lust gegen motzende Orks und arrogante Elvaren anzutreten. Wer will, kann gerne sein Glück versuchen! [smilie--sprite2][BR][BR]Nee, es wird tatsächlich gerade daran gearbeitet, das neue Kapitel freizuschalten. Leider steckt da noch viel mehr als ein roter Button dahinter.\t\tZum Vergrößern anklicken....[BR]ja, die Freiheit is ned immer leicht [smilie--sprite1]"}, {"49": "jens333 schrieb:\t\t\tIhr spielt schon so lange und jedesmal müssen wir sagen, erst wenn das Update bei allen Sprachen durch ist (DE ist nicht allein^^) , dann wird das neue Kapitel aktiviert. [smilie--sprite2]Zum Vergrößern anklicken....die Unruhe habt aber Ihr selbst in Gange gesetzt"}, {"2": "Tacheless schrieb:\t\t\tVielleicht hat ihn einer meiner Kinder in die Untiefen seines Kinderzimmers mitgenommen und dort vergessen?\t\tZum Vergrößern anklicken.......meine Tochter sagte dann immer: \"Hab i schlampt\"...und hat mit den Achseln gezuckt (mit 2 Jahren)....oder sie sagte: \"Einfach fort\"..."}, {"55": "Der 29.04. dauert ja noch 8 Std.[BR]Und eine Minute vor Mitternacht wird das neue Kapitel dann starten."}, {"48": "Nu isses da"}, {"1": "Romilly schrieb:\t\t\t...meine Tochter sagte dann immer: \"Hab i schlampt\"...und hat mit den Achseln gezuckt (mit 2 Jahren)....oder sie sagte: \"Einfach fort\"...\t\tZum Vergrößern anklicken....Was ich schon überall an Orten gefunden habe, die total unmöglich waren...[BR][BR]Um zum Topic zurück zu kehren: Das neue Kapitel ist nun auf den Live-Servern angekommen. [smilie--sprite1]"}, {"24": "Ich geb ja zu, ich hab den Button mit dem Herz und den Hörnern total fehlinterpretiert... Ich hatte soooo gehofft es wird ein Succubuskapitel... ^^"}, {"54": "Tacheless schrieb:\t\t\tWas ich schon überall an Orten gefunden habe, die total unmöglich waren...[BR][BR]Um zum Topic zurück zu kehren: Das neue Kapitel ist nun auf den Live-Servern angekommen. [smilie--sprite1]Zum Vergrößern anklicken....schade ..."}, {"44": "ustoni schrieb:\t\t\tFür Dich doch ohnehin nicht mehr, oder?\t\tZum Vergrößern anklicken....Wo bitte sehr liest du das \"für mich\" in meinem Beitrag? Aber um deine Frage trotzdem zu beantworten: Nein für mich (vorher) nicht und jetzt erst recht nicht. [BR]Und nun bitte ich dich, mich nicht immer persönlich \"anzugehen\" [smilie--sprite2] (Auch wenn's dir Spass zu machen scheint [smilie--sprite8] Such dir bitte ein neues Hobby )"}, {"9": "Jirutsu schrieb:\t\t\tWo bitte sehr liest du das \"für mich\" in meinem Beitrag? Aber um deine Frage trotzdem zu beantworten: Nein für mich (vorher) nicht und jetzt erst recht nicht.[BR]Und nun bitte ich dich, mich nicht immer persönlich \"anzugehen\" [smilie--sprite2] (Auch wenn's dir Spass zu machen scheint [smilie--sprite8] Such dir bitte ein neues Hobby )\t\tZum Vergrößern anklicken....OT: Dein eigener Abschieds-Thread und dein ständiges ich gehe was du auch überall betonst. Hat nichts mit Hobby zu tun sondern was mit Tatsachen. [smilie--sprite2][BR]T:[BR]Tacheless schrieb:\t\t\tUm zum Topic zurück zu kehren: Das neue Kapitel ist nun auf den Live-Servern angekommen. [smilie--sprite1]Zum Vergrößern anklicken....Festgestellt und Danke auch wenn das Wort \"jetzt\" im Posthorn beim nächsten mal mit \"heute\" ausgetauscht werden sollte. Vielleicht fürs nächste Mal, dann gibt es weniger Verwirrung. [smilie--sprite2]"}, {"44": "AngelOfDead schrieb:\t\t\tOT: Dein eigener Abschieds-Thread und dein ständiges ich gehe was du auch überall betonst. Hat nichts mit Hobby zu tun sondern was mit Tatsachen.\t\tZum Vergrößern anklicken....OT, wie du richtig feststellst"}, {"24": "Hey, jetzt hört auf euch gegenseitig zu ärgern. Jirutsu ist jemand der zumindest immer für (oft sogar konstruktiven [smilie--sprite2] ) Gesprächsstoff sorgt und je länger er in der Tür stehen bleibt umso länger haben wir noch was von ihm. Also nicht zanken, schmunzeln [smilie--sprite1] Und wenn doch zanken, besser im Dampfthread. [smilie--sprite2]"}, {"21": "Das mit den Kaufleuten ist tatsächlich bissl dämlich daß man die eigenen Angebote nicht sehen kann. Ich habe jetzt 4 Kaufleute unterwegs und weiß jetzt noch was ich als Angebote reingesetzt hab. Später, wenn die Auswahl größer ist weiß ich das ev. nicht mehr so ganz[smilie--sprite6] [BR][BR][BR][BR]Es wäre in der Tat gut zu sehen was meine Kaufleute an Waren anbieten solange sie unterwegs sind."}, {"56": "ICH bin nach Sichtung des neuen Kapitels tief enttäuscht.. (Ein trauriges Emoji gibts leider nicht)[BR][BR]Bis Kapitel 15 \"Die Elvenar\" war ELVENAR ein wunderschönes Spiel! [smilie--sprite1] Man konnte eine schöne Stadt bauen.[BR]Bereits Kapitel 16 wird jetzt bei mir nur noch nebenbei bedient mit vielen bewussten Stopps (baue lieber meine Wunder aus), denn ich sehe durch nichts den Anreiz diesem Kapitel viel Platz in meiner Stadt einzuräumen. Dadurch werde ich sehr viel Zeit dafür brauchen, denn Kapitel 17 gibt noch weniger Anreiz, weil ich für diese Schiffe nicht bereit bin meine halbe Stadt abzureißen, um ein sinnbefreites Sammeln anzufangen.[BR][BR]Ich hatte so sehr gehofft, dass Kapitel 18 den fehlenden Anreiz geben würde, doch wenigstens auf dieses Kapitel hinzuarbeiten, aber wenn man die vielen zusätzlichen Gebäude dieses Kapitels in dem Video sieht, dann kann man eine „schöne“ Stadt komplett vergessen, weil man erneut unendlich viel Platz dafür brauchen wird und das bedeutet am Ende, der Rest der Stadt ist nur noch ein Sammelsurium nutzbringender Gebäude und ist dann wohl kaum noch eine \"schöne\" Stadt. Schade![BR][BR]Das Video geht zudem komplett an der Realität hinsichtlich des Aufbaus vorbei. Diese großzügige Platzverteilung - die eigentlich ja ganz nett aussieht - ist leider völlig realitätsfremd. Lässt sich in einer Testumgebung ja immer hübsch darstellen. Ich hätte im Video lieber mal den Einbau in einer \"fertigen Stadt\" gesehen. Das würde bestimmt ganz anders aussehen!"}, {"21": "Athaneia schrieb:ICH bin nach Sichtung des neuen Kapitels tief enttäuscht.. (Ein trauriges Emoji gibts leider nicht)[BR][BR]Bis Kapitel 15 \"Die Elvenar\" war ELVENAR ein wunderschönes Spiel! [smilie--sprite1] Man konnte eine schöne Stadt bauen.[BR]Bereits Kapitel 16 wird jetzt bei mir nur noch nebenbei bedient mit vielen bewussten Stopps (baue lieber meine Wunder aus), denn ich sehe durch nichts den Anreiz diesem Kapitel viel Platz in meiner Stadt einzuräumen. Dadurch werde ich sehr viel Zeit dafür brauchen, denn Kapitel 17 gibt noch weniger Anreiz, weil ich für diese Schiffe nicht bereit bin meine halbe Stadt abzureißen, um ein sinnbefreites Sammeln anzufangen.[BR][BR]Ich hatte so sehr gehofft, dass Kapitel 18 den fehlenden Anreiz geben würde, doch wenigstens auf dieses Kapitel hinzuarbeiten, aber wenn man die vielen zusätzlichen Gebäude dieses Kapitels in dem Video sieht, dann kann man eine „schöne“ Stadt komplett vergessen, weil man erneut unendlich viel Platz dafür brauchen wird und das bedeutet am Ende, der Rest der Stadt ist nur noch ein Sammelsurium nutzbringender Gebäude und ist dann wohl kaum noch eine \"schöne\" Stadt. Schade![BR][BR]Das Video geht zudem komplett an der Realität hinsichtlich des Aufbaus vorbei. Diese großzügige Platzverteilung - die eigentlich ja ganz nett aussieht - ist leider völlig realitätsfremd. Lässt sich in einer Testumgebung ja immer hübsch darstellen. Ich hätte im Video lieber mal den Einbau in einer \"fertigen Stadt\" gesehen. Das würde bestimmt ganz anders aussehen!\t\tZum Vergrößern anklicken....[BR]Falls Du die Möglichkeit hast in W2 bei mir zu schauen - Kapitel 18 gefällt mir wesentlich besser als die letzten Kapitel , die Gebäude sind top und der benötigte Platz für die Gastrassengebäude hält sich echt in Grenzen [smilie--sprite1]"}, {"57": "gibts wo ne Questliste für die neuen?"}, {"21": "LuxuriantSilver schrieb:\t\t\tgibts wo ne Questliste für die neuen?\t\tZum Vergrößern anklicken....[BR]Die einzige die ich bisher gefunden habe ist wie üblich bei den Italienern:[BR][BR]\t\t\thttps://cavalieridellozombiaco.blogspot.com/p/team-spirit.html#paragrafo6\t\t[BR]Mußt halt übersetzen lassen. Nicht perfekt, aber ne Orientierungshilfe."}, {"57": "dankeschön !"}]