[{"58": "also ich hab das Dimensionstor aufgestellt aber bisher keinen Questgeber gesehen, ist das okay so?"}, {"56": "Indianaking schrieb:\t\t\tFalls Du die Möglichkeit hast in W2 bei mir zu schauen - Kapitel 18 gefällt mir wesentlich besser als die letzten Kapitel , die Gebäude sind top und der benötigte Platz für die Gastrassengebäude hält sich echt in Grenzen [smilie--sprite1]Zum Vergrößern anklicken....Leider bin ich nicht auf Winyandor... sonst würde ich echt gern schauen!"}, {"21": "Haseli schrieb:also ich hab das Dimensionstor aufgestellt aber bisher keinen Questgeber gesehen, ist das okay so?Zum Vergrößern anklicken....[BR]Hast Du die alten Quests schon durchgeklickt? Falls ja dann ausloggen, und komplett neu einloggen, hilft manchmal."}, {"58": "@Indianaking danke, hat geklappt"}, {"59": "Indianaking schrieb:\t\t\tDas mit den Kaufleuten ist tatsächlich bissl dämlich daß man die eigenen Angebote nicht sehen kann. Ich habe jetzt 4 Kaufleute unterwegs und weiß jetzt noch was ich als Angebote reingesetzt hab. Später, wenn die Auswahl größer ist weiß ich das ev. nicht mehr so ganz[smilie--sprite6]Zum Vergrößern anklicken....Du schließt doch den Handel sofort mit dem Kaufmann ab, kriegst also deine Rohstoffe sofort... danach interessiert nur noch DASS er unterwegs ist - was er früher mal mit dir gehandelt hat ist doch wurscht, das hast du längst im Lager. Wenn er zurück kommt, dann ohne Waren."}, {"21": "Turbina schrieb:\t\t\tDu schließt doch den Handel sofort mit dem Kaufmann ab, kriegst also deine Rohstoffe sofort... danach interessiert nur noch DASS er unterwegs ist - was er früher mal mit dir gehandelt hat ist doch wurscht, das hast du längst im Lager. Wenn er zurück kommt, dann ohne Waren.\t\tZum Vergrößern anklicken....[BR]Schon klar, ich handel ja schon die ganze Zeit. Trotzdem würde ich gerne wissen womit er grad unterwegs ist [smilie--sprite6] bzw. wie viele von meinen an den Händler verkaufte Waren insgesamt noch im Markt stehen."}, {"60": "Danke für den italienischen Link - leider ist mein Übersetzer nicht so bombig [smilie--sprite2] Das meiste kann ich mir irgendwie denken, aber was ich nicht wirklich rauslesen kann, ist die Anzahl der einzelnen Gastrassen-Gebäude, die die Quest verlangt. Kann mir da schon jemand helfen? Auch wenn ich noch nicht beginnen möchte mit dem Kapitel, würde ich es doch gern schon mal in etwa im \"Architekten\" planen. [smilie--sprite8]"}, {"21": "Kamajo schrieb:\t\t\tDanke für den italienischen Link - leider ist mein Übersetzer nicht so bombig [smilie--sprite2] Das meiste kann ich mir irgendwie denken, aber was ich nicht wirklich rauslesen kann, ist die Anzahl der einzelnen Gastrassen-Gebäude, die die Quest verlangt. Kann mir da schon jemand helfen? Auch wenn ich noch nicht beginnen möchte mit dem Kapitel, würde ich es doch gern schon mal in etwa im \"Architekten\" planen. [smilie--sprite8]Zum Vergrößern anklicken....[BR]Ich lese da insgesamt 12 Zentren der Elemente und 6 x Platz der Begrüßung heraus. Wenn man bedenkt daß man sämtliche Leute, die dort produziert werden mit den Portalboostern erzeugen kann würde ich mich fragen warum ich 6 Begrüßungsplätze bauen soll [smilie--sprite6]  Bin aber eh kein Maßstab weil ich nie die Questline spiele."}, {"60": "Danke für deine Antwort @Indianaking [smilie--sprite1] [BR]Würde evtl. heißen, dass es von jedem Zentrum (da vier verschiedene) drei sein müssen (lt. Questline und wenn man diese so spielen möchte) ...[BR]So wie ich dich bisher kenne, teilst du sicher wieder mit uns am Ende deine Erfahrungen und Vorgehensweise? Darauf freue ich mich schon. [smilie--sprite1]"}, {"21": "Kamajo schrieb:\t\t\tDanke für deine Antwort @Indianaking [smilie--sprite1][BR]Würde evtl. heißen, dass es von jedem Zentrum (da vier verschiedene) drei sein müssen (lt. Questline und wenn man diese so spielen möchte) ...[BR]So wie ich dich bisher kenne, teilst du sicher wieder mit uns am Ende deine Erfahrungen und Vorgehensweise? Darauf freue ich mich schon. [smilie--sprite1]Zum Vergrößern anklicken....[BR]So isses [smilie--sprite6] Im Augenblick teste ich aus ob ich nicht mit 3/3/2/2  bzw später mit 4/4/3/3 besser fahre. Wenn man sich nur auf ein bestimmtes Abzeichen konzentriert und dementsprechend nur die dafür benötigten Medaillen macht kommt man ev besser hin- aber ich teste das wie gesagt noch."}, {"60": "Wenn man das Kapitel ganz gemütlich nebenbei spielen möchte, dann könnte man wahrscheinlich die Anforderung der Questline nehmen und gut ist? Du bist ja ehr der \"rasante\" Typ ... [smilie--sprite8]"}, {"21": "Kamajo schrieb:\t\t\tWenn man das Kapitel ganz gemütlich nebenbei spielen möchte, dann könnte man wahrscheinlich die Anforderung der Questline nehmen und gut ist? Du bist ja ehr der \"rasante\" Typ ... [smilie--sprite8]Zum Vergrößern anklicken....[BR]Klar kann man das - wenn mans gemütlich angehen will [smilie--sprite7]"}, {"61": "Dann möchte ich auch mal ein \"Vorab-Feedback\" geben. Ich freu mich richtig auf das Kapitel. Bin mit den Händlern von Unur noch nicht ganz fertig, aber jetzt lohnt es sich, noch ein bisschen Gas zu geben. [smilie--sprite1][BR][BR]Was mir am meisten gefällt: Als ich mit Elvenar angefangen habe, fand ich es total doof, dass man von den 9 Manufakturen nur 3 wirklich sinnvoll nutzen konnte und die übrigen 6 höchstens zur Verschönerung der Städte dienen konnten. Die ganzen Gildenbeschreibungen, wo drin stand \"Wir bauen nur unsere Bonusgüter aus\", die den Spielern vorschreiben wollten, welche Gebäude sie aufstellen dürfen und welche nicht, waren mir schon immer unsympathisch. Nun Endlich werden auch die letzten Manufakturen zu \"Erleuchteten Güter-Manufakturen\" und ich freu mich darauf, dass dann in den folgenden 2 Kapiteln auch die letzten Gut 2 und 3 Manufakturen einen Sinn bekommen. Das wird die Städte bunter und schöner machen. Glücklich sind die, die schon immer alle Manus hatten und sich keine Vorschriften haben machen lassen, welche Gebäude sie aufstellen dürfen.[BR][BR]Was mir auch gefällt, sind die Gebäude der neuen Gastrasse. Niedrig und verstellen nicht wieder die Sicht auf die dahinter liegenden Gebäude. Danke @Indianaking sieht toll aus. Auch die neuen Level der regulären Gebäude sehen toll aus. Die Manufakturen werden 1 Feld kleiner, auch super.[BR][BR]Dann ein neues Militär-Wunder mit Orks [smilie--sprite1] Prima! Das andere mit Unurium, auch toll![BR][BR]Die Forschung scheint dann mal wieder in einer angemessenen Zeit durchzuspielen sein. Eine Menge Mana wird zwar gebraucht, aber mit genug Wundern und Eventgebäuden kein Problem, auch das macht Städte bunter und gefällt mir.[BR][BR]Was ich von dem neuen Markplatz halten soll, kann ich noch nicht sagen. Hab da im Video nur die Diamanten beim letzten Händler gesehen und hoffe mal, dass die ersten Händler keine Dias brauchen, um aktiviert zu werden und wenn doch, dann hoffentlich analog zum Baumeister nur einmalig. ?????[BR][BR]Also alles in allem tolles Kapitel, Danke an die Entwickler! Habt ihr gut gemacht [smilie--sprite1] Ausgewogen und toll für alle, die gerne alle Spieloptionen nutzen möchten, die Elvenar zu bieten hat."}, {"50": "Ich bin noch nicht zu 100% durch mit der Planung, aber im groben würde es bei mir so aussehen.[BR][IMG]https://i.ibb.co/k4cxMBm/https-de-forum-elvenar-com-index-php-attachments-1619853989849-png-24216.png[/IMG][BR]Ich berücksichtige aber bei der Planung nicht die Story-Quest-Reihe, sondern behalte mir vor 2 Manus für die erleuchtenden Güter zu bauen und auch Platz für kommende Events und GAs parat zu haben.[BR][BR]Pro forma platziere ich, obwohl mehr als genug Portalsegen im Inventar schlummern, auch 3x (unnötige) Platz der Begrüssung. Man kann nie wissen, ob es vlt. doch sinnvoll sein könnte.[BR][BR]Wie bereits in vorherigen Posts erwähnt wurde, kann man die Portalsegen nur für die Arbeitskräfte Menschen, Elfen und Elvenars nutzen.[BR][IMG]https://i.ibb.co/0Jc0gcb/https-de-forum-elvenar-com-index-php-attachments-1619854577087-png-24218.png[/IMG][BR][BR]Das Hauptaugenmerk bei der Planung liegt aber auf den Teampark-Strassen, da diese unabdingbar benötigt werden, um alle aufgebauten Gebäude direkt mit dem Portal zu verbinden.[BR]Hierbei gilt es mit so wenigen dieser Strassen so viel Gastrassen-Gebäude  mit dem Portal zu verbinden, da die Kosten dafür unter anderem Unurium abverlangen und das würde in der Summer bei unbedarfter Planung recht teuer werden.[BR][IMG]https://i.ibb.co/1ZcGx0W/https-de-forum-elvenar-com-index-php-attachments-1619854395178-png-24217.png[/IMG]"}, {"62": "Zur Sicherheit die Nachfrage: Bewirkt der Zauber \"Fabelhafte Fabrikation\" auch eine Steigerung der Produktion der Erleuchteten Güter?"}, {"21": "Sreafin schrieb:\t\t\tZur Sicherheit die Nachfrage: Bewirkt der Zauber \"Fabelhafte Fabrikation\" auch eine Steigerung der Produktion der Erleuchteten Güter?\t\tZum Vergrößern anklicken....[BR]Ja- ich hab deshalb extra noch den Sturmphönix hochgezogen [smilie--sprite2]"}, {"63": "Moin, [BR]Der Handel geht gar nicht,  es macht überhaupt kein Spaß wenn man seine güter nicht getauscht bekommt. [BR]Der Kaufmann der lächerlich 1800 mit nimmt und 6 std später zurück kommt es  nur traurig.  Aber mit Dias geht alles schneller, zum Glück. [BR]Dann noch der Verfall,  ein Traum  gut das man nur 68.000 für den ersten Ausbau braucht,  wer hat sich das bitte ausgedacht. [BR]Ein Schlag ins Gesicht für Spieler die nicht in einer top 10 Gemeinschaft spielen. [BR]Mehr davon kann ich nur sagen."}, {"21": "DerEisbaer schrieb:\t\t\tMoin,[BR]Der Handel geht gar nicht,  es macht überhaupt kein Spaß wenn man seine güter nicht getauscht bekommt.[BR]Der Kaufmann der lächerlich 1800 mit nimmt und 6 std später zurück kommt es  nur traurig.  Aber mit Dias geht alles schneller, zum Glück.[BR]Dann noch der Verfall,  ein Traum  gut das man nur 68.000 für den ersten Ausbau braucht,  wer hat sich das bitte ausgedacht.[BR]Ein Schlag ins Gesicht für Spieler die nicht in einer top 10 Gemeinschaft spielen.[BR]Mehr davon kann ich nur sagen.\t\tZum Vergrößern anklicken....[BR]Das passiert aber in Top 10 Gemeinschaften genauso [smilie--sprite2] -in W2 zB (wie Du weißt) gibt es einen Riesenmangel an Mineralienspielern, bzw kaum welche die schon soweit sind in den Forschungen. Wie schon anfangs bei den erweckten Gütern muß man halt warten bis es sich einpendelt und mehr Spieler produzieren können. Hier ist es eben grad so daß einige sehr große Spieler dieselben Bonusgüter haben und ausserdem schon sehr weit sind. Die Häppchen im Markt sind zwar lästig, aber immerhin bekommt man die Waren -wenn auch langsam- wenigstens getauscht ."}, {"57": "auf Wynandor kriegt man derzeit nichtmal die Häppchen Urwelt-Mineralien. [BR]Wieso müssen mal wieder alle Arten Zentren dieselben erleuchteten Güter haben??? Dann schickt doch von mir aus anfangs einen Bot los um die Mineralienanforderungen zu decken, aber so macht das doch keinen Spass, wenn man nichtmal die erforderten 13900 für ein Zentrum bekommt <.<. [smilie--sprite5]"}, {"2": "LuxuriantSilver schrieb:\t\t\tauf Wynandor kriegt man derzeit nichtmal die Häppchen Urwelt-Mineralien.\t\tZum Vergrößern anklicken........das wird noch dauern - du kannst dich aber schon mal hier eintragen, vielleicht findet sich dann auch jemand mit Mineralien...[BR][BR]Romilly schrieb:\t\t\tAuch wenn die neuen Güterklassen (erweckte Güter, erleuchtete Güter) global gehandelt werden können, kommt es leider immer wieder vor, daß man ein bestimmtes Gut nur zu ungünstigen Preisen oder auch gar nicht auf dem Markt erhandeln kann.[BR][BR]Als kleine Abhilfe können sich hilfsbereite Spieler in den Tauschbörsen eintragen, die bereit sind, ihre Güter bei Bedarf gezielt zur Verfügung zu stellen, falls jemand dringend ein bestimmtes Gut benötigt.[BR][BR]Zu den Tauschbörsen geht es hier....[BR][BR]Arendyll: https://de.forum.elvenar.com/index.php?threads/tauschbÖrse-für-neue-güterklassen-erweckte-erleuchtete.22078/[BR]Winyandor: https://de.forum.elvenar.com/index.php?threads/tauschbÖrse-für-neue-güterklassen-erweckte-erleuchtete.22077/[BR]Felyndral: https://de.forum.elvenar.com/index.php?threads/tauschbÖrse-für-neue-güterklassen-erweckte-erleuchtete.22076/[BR]Khelonaar: https://de.forum.elvenar.com/index.php?threads/tauschbÖrse-für-neue-güterklassen-erweckte-erleuchtete.22075/[BR]Elcysandir: https://de.forum.elvenar.com/index.php?threads/tauschbÖrse-für-neue-güterklassen-erweckte-erleuchtete.22074/[BR]Sinya Arda: https://de.forum.elvenar.com/index.php?threads/tauschbÖrse-für-neue-güterklassen-erweckte-erleuchtete.22072/[BR]Ceravyn: https://de.forum.elvenar.com/index.php?threads/tauschbÖrse-für-neue-güterklassen-erweckte-erleuchtete.22070/Zum Vergrößern anklicken...."}]