[{"21": "LuxuriantSilver schrieb:\t\t\tauf Wynandor kriegt man derzeit nichtmal die Häppchen Urwelt-Mineralien.[BR]Wieso müssen mal wieder alle Arten Zentren dieselben erleuchteten Güter haben??? Dann schickt doch von mir aus anfangs einen Bot los um die Mineralienanforderungen zu decken, aber so macht das doch keinen Spass, wenn man nichtmal die erforderten 13900 für ein Zentrum bekommt <.<. [smilie--sprite5]Zum Vergrößern anklicken....[BR]Das trifft im Augenblick die Spieler mit T1 Bonusgut Holz am meisten, weil wir brauchen für die Zentren (und natürlich auch zum Produzieren) die Mineralien.  Bei solch einem (anfänglichen) Mangel muß man halt erstmal viele Händler haben um an genügend Material zu kommen. Ich hoffe daß sich das nach den ersten 20 Händlertagen halbwegs eingependelt hat und man danach mit wenigen Händlern auskommt."}, {"37": "34 Seiten Urweltmineraliengesuche, sonst nix, nur Urweltmineralien, da passt doch was nicht."}, {"57": "jep, genau das gleiche wollt ich auch grad als Update von Wynandor schreiben und wie da Innos Hilfe aussieht, wie das weitergehen soll?[BR]34 Seiten Mineraliensuche, Kaufleute auf Dauerschleife mindestens 10x losgeschickt, gibt nichtmal kleine Häppchen. Kommt da irgendeine Hilfe oder lässt man die Spieler allein vor sich hindümpeln?"}, {"21": "LuxuriantSilver schrieb:\t\t\tjep, genau das gleiche wollt ich auch grad als Update von Wynandor schreiben und wie da Innos Hilfe aussieht, wie das weitergehen soll?[BR]34 Seiten Mineraliensuche, Kaufleute auf Dauerschleife mindestens 10x losgeschickt, gibt nichtmal kleine Häppchen. Kommt da irgendeine Hilfe oder lässt man die Spieler allein vor sich hindümpeln?\t\tZum Vergrößern anklicken....[BR]Das ist echt ein sehr breiter Weg [smilie--sprite5] Ich brauche zB noch rund 650 K Mineralien um meine Zentren komplett auszubauen, und zum Produzieren auch noch. Hoffentlich tut sich da tatsächlich bald mal was....."}, {"64": "hat mal jemand einen tipp für mich, wie ich den vollen produktionsbonus für meine urwelt-mineralien bekomme und trotzdem noch kombinationsauslöser in der akademie herstellen kann? sonst kann ich nur noch die spärlichen rezepte ohne kombinationsauslöser im handwerk herstellen ... oder ich spare 8 wochen lang die truppen und schlage dann im marmorturnier voll zu??? dann fehlen mir aber 8 wochen lang wissenspunkte und zauber ... schon mal danke im voraus [smilie--sprite2]"}, {"21": "AngelOfPhoeniX schrieb:\t\t\that mal jemand einen tipp für mich, wie ich den vollen produktionsbonus für meine urwelt-mineralien bekomme und trotzdem noch kombinationsauslöser in der akademie herstellen kann? sonst kann ich nur noch die spärlichen rezepte ohne kombinationsauslöser im handwerk herstellen ... oder ich spare 8 wochen lang die truppen und schlage dann im marmorturnier voll zu??? dann fehlen mir aber 8 wochen lang wissenspunkte und zauber ... schon mal danke im voraus [smilie--sprite2]Zum Vergrößern anklicken....[BR]OK, daraus schließe ich daß Du weniger als 500 Marmorrelikte im Lager hast ?? Kommt wahrscheinlich daher daß Du erst seit einem halben Jahr regelmäßig richtig turnierst, das hängt einem dann natürlich nach wenn man die Aka 24/7 betreiben will. Da hilft nur sparen, ev. mit dem Start des Kapitels warten, und regelmäßig mehr Turnier spielen."}, {"64": "herzlichen dank Indianaking ..."}, {"12": "Sunwind schrieb:\t\t\t34 Seiten Urweltmineraliengesuche, sonst nix, nur Urweltmineralien, da passt doch was nicht.\t\tZum Vergrößern anklicken....Es werden tatsächlich Urweltmineralien gesucht? Kaum zu glauben, daß ich mal nicht beim Überschußgut mit dabei bin (vor allem da zuviel Elfenharz am Markt ist).[BR]Allerdings brauch ich noch mindestens eine Woche (vermutlich eher zwei) bis ich soweit bin effektiv zu produzieren. Und ich denke mal, daß viele andere auch noch nicht soweit sind. Bin eben kein Schnellläufer sondern ein Gemütlichgeher [smilie--sprite8][BR]Weiß eigentlich jemand, ob dann beim Händler die neuesten Angebote zuvorderst oder zuhinterst aufscheinen bei z.B. 1800:1800 ?"}, {"65": "Seit dem Beginn bei Evlvenar habe ich die Arschkarte gezogen.[BR]Marmor-Seide-Edelsteine auf Winyard.[BR][BR]Und jetzt geht es weiter mit 6h unterschied.[BR]Idee recht gut von Inno, nur die Ausführung echter Mist.[BR]Nehme ich dauernd Zeitboni für erleuchtete Güter, ist alles vermüllt.[BR]Eine Lösung wie Indianking schreibt, wäre sinnvoll![BR][BR][BR]LG, MasterLu"}, {"37": "update, nun sind es 44 Seiten und alles Gesuche nach Urweltmineralien"}, {"30": "Ich mache mal etwas, was ich gar nicht gerne in einem so frühen Stadium einer Gastrasse tue: ich muss schon jetzt Feedback geben ....[BR]Zu den ganzen Händlerproblemen kann ich mich noch nicht äussern, da ich noch gar nicht soweit bin. Und da es vermutlich noch vielen Spielern, die genauso gemütlich vor sich hin produzieren, so geht, hoffe ich einfach, das sich das noch einpegelt. Das war eigentlich bei allen neuen Gütern anfangs der Fall (zumindest die extremen Mängel an einigen Gütern).[BR]Aber jetzt zu meinem eigentlichen Problem bereits zu Beginn der neuen Gastrasse:[BR][BR]Questline: ist unsinnig aufgebaut. Wenn man bereit am Anfrang das Dimensionstor aufbauen muss laut QL und dieses dann tage- oder wochenlang unproduktiv Platz wegnimmt und vor sich hinschläft. Es hätte in der QL die Freischaltung ausgereicht, nicht der Bau.[BR]Das gleiche gilt für die Produktion der erleuchteten Güter, welche noch vor dem Produktionsboost kommt - man muss hier viel Unurium in eine Produktion stecken und erhält nur einen Bruchteil der Güter. Zudem ist zu diesem Zeitpunkt auch der Händler noch nicht ausgebaut, produzierte Güter können dadurch nicht einmal getauscht werden.[BR]Auch hier ist die Reihenfolge der Quests - erst den Verkäufer, dann der Prodboost nicht glücklich. Was soll man denn das Unurium für die mauen Produktionen einsetzen, wenn man es vorerst für die Freischaltung des Boosts benötigt?[BR][BR]Auch wenn die vielen Kommentare darauf hindeuten, das einige Spieler  die Questline nicht spielen, ich tue es und sicher auch viele andere Spieler. Es gab auch bei den anderen Gastrassen mal die eine oder andere Unstimmigkeit, aber die waren zu verschmerzen. Wenn ich hier aber bereits zu Beginn so viele Aufgaben als völlig unsinnig empfinde, läuft meiner Ansicht nach etwas falsch.[BR][BR][BR]Forschungsbaum:[BR]Der Produktionsboost für die erleuchteten Güter hätte analog zu den Konstrukten zusammen mit den Manuerweiterungen in einem erfolgen sollen - jetzt muss man erst alle Manuausbauten freischalten, bevor man den Boost freischalten kann.[BR]Da für den Forschungsbaum und die Ausbauten immense Mengen an Unurium und auch Mana benötigt werden, hängt man hier automatisch fest, weil die Produktion gar nicht so schnell erfolgen kann, wie man die WPs erhält. Bei den Händlern hatte man immer irgendwo einen „freien“ Ast, um WPs einwerfen zu können. Das ist beim Teamgeist nicht gut gelöst.[BR]Was mir  grundsätzlich nicht gefällt, ist, das in dieser Gastrasse die Manus aller Güter für höhere Stufen freigeschaltet werden. Ich habe die QL nicht gespoilert, aber ich gehe davon aus, das auch der Ausbau noch gefordert wird. Wofür??[BR][BR]Gut finde ich das  Portalsegen so gut wie gar nicht helfen, war ich nie ein Freund von [smilie--sprite1]  -hier wäre zu überlegen, ob die Flut an Portalsegen in der gegebenen Form noch Sinn macht, ähnlich wie die Überproduktion an Fragmenten (hier war der positive Sinn ja mal, das man „altes“ überflüssiges Inventar in Fragmente tauschen kann).[BR]Die Grundidee der Gastrasse gefällt mir trotzdem gut, auch die Gebäude gefallen mir sehr - aber durch diese Unstimmigkeiten in Questline und Forschungsbaum fällt es mir zum jetzigen Zeitpunkt doch etwas schwer, mich daran zu erfreuen. Aber wie immer, werde ich mich auch da „durchwurschteln“."}, {"21": "Ayla Ayla schrieb:\t\t\tEs werden tatsächlich Urweltmineralien gesucht? Kaum zu glauben, daß ich mal nicht beim Überschußgut mit dabei bin (vor allem da zuviel Elfenharz am Markt ist).[BR]Allerdings brauch ich noch mindestens eine Woche (vermutlich eher zwei) bis ich soweit bin effektiv zu produzieren. Und ich denke mal, daß viele andere auch noch nicht soweit sind. Bin eben kein Schnellläufer sondern ein Gemütlichgeher [smilie--sprite8][BR]Weiß eigentlich jemand, ob dann beim Händler die neuesten Angebote zuvorderst oder zuhinterst aufscheinen bei z.B. 1800:1800 ?\t\tZum Vergrößern anklicken....[BR]Die neuesten Angebote - also die mit dem Zylinder- stehen vorne ABER: einige habe das HG schon auf 40, d.h. wir können mittlerweile 2000 einstellen, da muß man aufpassen. Die neuen 2000 er stehen ganz oben, dann kommen die alten 2000er, und dann kommen die neuen 1800 er usw.[BR]Beim HG auf 41 kommen dann die neuen 2200er ganz vorne usw......  [BR][BR]Dazu kommt daß die Sortierung auch noch nach Spielern vorgenommen wird: also stehen zB 5 Zylinderangebote des Spielers X oben, dann alte Angebote desselben Spielers, und nach erst 2-3 Seiten kommen die nächsten Zylinderangebote - also die neuen- eines anderen Spielers.[BR]Wenn man bedenkt daß nur bei Annahme der Zylinderangebote die Händler sofort zu ihren Spielern zurückkehren ist das ganz schön dämlich gelöst  [smilie--sprite5] und sollte dringend nachgebessert werden.[BR][BR]Was ich auch suboptimal finde: wenn man mit einem Gildi/Spieler eine Schleife machen möchte, also mehrere Gesuche hintereinder abarbeiten will- muß man jedes Mal den Händler neu öffnen und suchen. Bei zB 2 Kaufleuten und einem Bedarf von 60 K ist das echt mühsam.[BR]Ausserdem würde ich NOCH EINMAL vorschlagen daß man die Laufzeit der im Markt stehenden erleuchteten  Güter verkürzt auf max. 2 Tage.  Sonst stehen in einer Woche 200 Seiten Müll drinnen , und ausserdem fliegen die Überschußgüter schneller raus."}, {"12": "Ist mir nachher eingefallen - auf welcher Welt werden die Urweltmineralien gesucht?[BR]Ich bin ja nur auf Arendyll vertreten, und wenn diese Gesuche auf einer anderen Welt sind wird's nicht unbedingt auf Arendyll auch so sein.[BR]Es sei denn, diese Zwischenhändler wandern auch zwischen den Welten (sind ja schließlich wandernde Händler) und bieten ihre Waren weltenübergreifend an ??"}, {"2": "Ayla Ayla schrieb:\t\t\tIst mir nachher eingefallen - auf welcher Welt werden die Urweltmineralien gesucht?[BR]Ich bin ja nur auf Arendyll vertreten, und wenn diese Gesuche auf einer anderen Welt sind wird's nicht unbedingt auf Arendyll auch so sein.[BR]Es sei denn, diese Zwischenhändler wandern auch zwischen den Welten (sind ja schließlich wandernde Händler) und bieten ihre Waren weltenübergreifend an ??\t\tZum Vergrößern anklicken........nein - die Händler reisen nur auf jeweils 1 Welt herum - das sind keine Astronauten ^^...."}, {"66": "Der Handel mit erleuchteten Gütern ist in Arendyl mittlerweile angelaufen. Anfangs fehlten auch hier die Mineralien, jetzt scheint es sich auszugleichen.  INNO hat ja Gott sei Dank dazu gelernt - die erleuchteten und erweckten Güter, die zum Ausbau des Dimensionstores und zum Bau der Elementarzentren benötigt werden sind Bonusgut-abhängig. So benötigen also nicht alle das Gleiche und jeder muss Handeln. Mal sehen, wie es sich entwickelt, viele Spieler sind ja noch gar nicht so weit.[BR][BR]Was mich allerdings gewaltig stört: Nachbarschaftshilfe mit den erkundeten Nachbarn auf der Weltkarte gibt es jetzt keine mehr. Denn das Benachrichtigungsfach läuft über mit den Meldungen für angenommene Handel der erleuchteten Güter. Bei den MINI-Mengen, die hier gehandelt werden können, wird sich das auch so schnell nicht ändern. Die NBH-Meldungen meiner Nachbarn sind schlicht nicht mehr da. Zur Zeit gehe ich abends über die Weltkarte und mache zumindest die Hälfte. der Weltkarte. Da dies aber auch mit der app eine ätzende Angelegenheit ist da alles in Zeitlupe läuft, werde ich das nicht auf Dauer machen. Hier wird es spätestens jetzt absolut Zeit, das INNO den schon vielfach geäußerten Wunsch der Spielerschaft nach getrennten Benachrichtigungen für Handel und NBH endlich nachkommt."}, {"41": "Indianaking schrieb:\t\t\tDazu kommt daß die Sortierung auch noch nach Spielern vorgenommen wird: also stehen zB 5 Zylinderangebote des Spielers X oben, dann alte Angebote desselben Spielers, und nach erst 2-3 Seiten kommen die nächsten Zylinderangebote - also die neuen- eines anderen Spielers.[BR]Wenn man bedenkt daß nur bei Annahme der Zylinderangebote die Händler sofort zu ihren Spielern zurückkehren ist das ganz schön dämlich gelöst  [smilie--sprite5] und sollte dringend nachgebessert werden.\t\tZum Vergrößern anklicken....Nein, die Angebote werden weder nach Spieler noch nach Alphabet geordnet. Sie werden nach Zeit und Zylinder angeordnet.[BR][BR]Schau mal in den Beta Spoiler hier im Forum. Dort hab ich es aufgezeigt."}, {"6": "Bin mal gespannt, wann in Arendyll die ersten Mineralien-Angebote auftauchen."}, {"12": "ustoni schrieb:\t\t\tBin mal gespannt, wann in Arendyll die ersten Mineralien-Angebote auftauchen.\t\tZum Vergrößern anklicken....Seh leider noch nicht was an den neuen Gütern beim Händler ist, aber nach ca. 500 WP u. 3,5 Mio Mana (also mind. 1 Wo) bin ich soweit. [smilie--sprite2][BR]Würde aber vorzugsweise Handel annehmen statt reinzustellen."}, {"2": "...ich mag das neue Stadtbild auf der Weltkarte  [smilie--sprite1]...[IMG]https://i.ibb.co/NLFXK21/https-de-forum-elvenar-com-index-php-attachments-kapitel-18-png-24310.png[/IMG]"}, {"11": "Ich habe Holz, Schriftrollen und Magiestaub als Bonusgut. und es Läuft sehr sehr schlecht in Welt 2.[BR][BR]Und jetzt kommt noch zusätzlich der Händler der meine Brennenden Barren auch nicht will. [BR][BR]ps das ist kein meckern, das sind Tatsachen[smilie--sprite4]"}]