[{"67": "Die neue Gastrasse hat schöne neue Ansätze, Die mich erst mal zuversichtlich stimmten. Jetzt erkenne ich aber immer mehr, die Verzögerungstaktik, Die dazu führt, das wieder Langeweile auf kommt, ähnlich der letzten Gastrasse. Erst muss man lange Forschungen mit Unmengen an Unurium bedienen, ohne auch nur ansatzweise mit den neuen Gastrassengebäuden an zu fangen. Das Portal kommt gleich zu Anfang der Questreihe, man kann es sogar auf Level 2 bringen. Dennoch ist das Dimensionstor auf lange Zeit nutzlos. Man kann nicht damit an fangen, bevor man nicht wenigstens ein Elementargebäude besitzt.[BR][BR]Die Idee mit den Kaufmännern ist nett, aber warum bitte diese Minnimengen? Das steht doch in keinem Verhältnis mit der Produktion selbst von nur einer Manufaktur der erleuchteten Bonusgüter. [BR]Erstes großes Problem ist die Tatsache, das wenn man das Glück hat, das die Kaufmannsangebote am Markt frühzeitig bedient werden, die Glocke völlig zu gespammt wird. So sind alle NBH Nachbarn weg, Die ich über diese Funktion jeden Tag schnell und zuverlässig finden konnte. Ich entschuldige mich schon mal auf diesem Wege bei allen Nachbarn, Die ich jetzt nicht mehr finden und polieren kann.[BR][BR]Das Hauptproblem bleibt aber wieder einmal die Ungerechtigkeit der Verteilung an Bonusgütern. Wer das Glück hat auf Winyandor (Welt 2) eine Stahlmanufaktur als Bonusgut bei den erleuchteten Gütern sein Eigen zu nennen, ist fein raus. Die gefühlt 10 % brauchen keinen Kaufmann an zu werben, erst recht keine 5 für viel Gold und Dias mit 20 Tagen Laufzeit. Sie bedienen sich einfach am Markt bei den über 60 Seiten mit Gesuchen von Urwelt-Mineralien.[BR]Alle Anderen dürfen bei Vollauslastung der 5 Kaufleute maximal 15 mal am Tag mit den Kaufmann handeln. \"Ja, man bekommt je nach Ausbaustufe des HG's eine unglaubliche Summe sofort getauscht, Je 1,8-2 K Güter. (Sarkassmus)\" Dann wartet man ganze 6 Stunden auf die Rückkehr des Händlers. Die Mineralienproduzenten stellen zur Zeit gar keine Gebote ein, warum auch? Sie brauchen die Kaufleute nicht, es herrscht ja eine Marktschwemme an Gesuchen. Sollte sich ein solcher Spieler doch mal erbarmen, einen Kaufmann zu erwerben für lau, und dann was ein zu stellen, kommt Er mit neuen Angeboten nicht mehr nach. In Sekundentakt würden das alle anderen Spieler weg saugen.[BR][BR]Nun mein Fazit für den Moment. So macht es keinen Spaß und auch keinen Sinn. Bitte ändert wenigstens den Kernpunkt des Handelns ab."}, {"2": "...dem kann ich nur (erneut) zustimmen...[BR][BR]Romilly schrieb:@Melios - ja, das ist richtig und deshalb finde ich auch, daß der Zwischenhändler großes Potential hat - FÜR ALLE GÜTERKLASSEN - wenn dies aber die einzige Möglichkeit ist, aufgestiegene Güter zu handeln (einzustellen), dann werden Spieler mit dem Massengut gegenüber den anderen beiden Gruppen trotzdem massiv benachteiligt (und ebenso Spieler, die keine geeigneten Tauschpartner in der Gilde haben - im Moment gibt es etliche Gilden, die einige Spieler haben, die sofort mit Kapitel 18 beginnen können - aber es gibt ebenso dutzende Gilden, die noch keine Mitglieder in diesem Bereich haben, aber auch da wird dann irgendwann jemand vorrücken - und der ist dann erst einmal auf sich alleine gestellt (und seine Angebote verschwinden dann im Meer zahlreicher anderer Angebote, die zudem fast identisch sind. Und wenn niemand diese Angebote aus dem ganzen Pool heraus fischt, dann können diese \"Pechvögel\" evtl. nur 2x am Tag ein paar kleine Angebote absetzen und das war es dann, während die \"Glückspilze\" (bzw. die mit Tauschpartner in der Gilde) Angebote im Minutentakt einstellen können.[BR]....außerdem kann eine große Gilde dieses System auch leicht ausnutzen: mal angenommen es sind 11 Spieler in Kapitel 18, die Gilde hat aber einen Mangel an (Bananen)Sprossen - dann können 10 Spieler immer wieder ihr Bonusgut gegen die raren Sprossen einstellen und die Angebote ablaufen lassen (falls es nicht doch jemand annimmt) und der 11. Spieler (ein sehr aktiver) stellt die anderen beiden Güter immer wieder im Wechsel ein und die anderen brauchen sich dann nur bedienen (und keine weiteren Händler kaufen) - Idealerweise hat der Aktive auch noch den Bonus auf dem Mangelgut, dann kann er alle 3 Güter tauschen.\t\tZum Vergrößern anklicken...."}, {"46": "Mal ein ganz anderer Gedanke kann es auch sein das der Urwelt Mineralien Mangel auf Welt 2 dadurch entstanden ist, dass die Kapitel Raser, einfach proportional zu viel davon benötigen.  Und einfach alle unbedingt einen Fortschritt sehen wollen.  Ich finde Inno geht den richtigen Weg, man muss mehr überlegen und eben mal auch ein bisschen mit anderen spielen, kommunizieren und vllt auch mal warten. Dazu gehört auf das die Höhe der Gebote begrenzt sind. Toll, ok für die Raser etwas mehr Klickerei...wer aber rasen will, braucht eben auch mehr \"Energie\".  [BR][BR]G E D U L D  [smilie--sprite1])))))))"}, {"11": "LuxuriantSilver schrieb:\t\t\tjep, genau das gleiche wollt ich auch grad als Update von Wynandor schreiben und wie da Innos Hilfe aussieht, wie das weitergehen soll?[BR]34 Seiten Mineraliensuche, Kaufleute auf Dauerschleife mindestens 10x losgeschickt, gibt nichtmal kleine Häppchen. Kommt da irgendeine Hilfe oder lässt man die Spieler allein vor sich hindümpeln?\t\tZum Vergrößern anklicken....Wer Holz, Schriftrollen und Magiestab als Bonus gut in Welt Wynandor hat ist am A....[BR][BR]Und das Problem gibt es schon ewig, aber Inno ist das scheinbar Egal."}, {"67": "Schnalle 04 schrieb:\t\t\tWer Holz, Schriftrollen und Magiestab als Bonus gut in Welt Wynandor hat ist am A....[BR][BR]Und das Problem gibt es schon ewig, aber Inno ist das scheinbar Egal.\t\tZum Vergrößern anklicken....Da hat Schnalle absolut Recht. Mir geht es genau so, habe exakt die gleichen Bonusgüter, wie gefühlt 70 % auf Server 2. Das Ungleichgewicht zieht sich wie ein roter Faden durch die Gastrassen. Bereits in der letzten Gastrasse und erst Recht danach, wenn man aus bauen wollte, waren einfach keine Faulpilze zu bekommen. Dagegen war Bismut und Seife der Ladenhüter. Niemand wollte das freiwillig haben, weil es ja nicht benötigt wurde zum Ausbau. Auch jetzt sind nur Pilzangebote am Markt, mit \"kleinem Wucherzugewinn\" von bis zu 1 zu 4. Wäre ich nicht in einer so starken Gilde, hätte ich bereits während der letzten Gastrasse mit dem spielen von Elvenar auf gehört. So kann und darf es nicht weiter gehen. Das hat gar nichts mit schnellerem Voran kommen zu tun, wohl aber mit verloren gehendem Spielspaß bei Ungleichgewichten und Unfairnis am Weltmarkt.[BR]Man selbst bietet \"4 Sterne Angebote\" an, um überhaupt noch gewisse Güter getauscht zu bekommen, bei den Erweckten, und dann geht das mit den erleuchteten genau so übel weiter."}, {"11": "Für Pilze gibt es mittlerweile 5 Seiten 1* Angebote mein freund    j... ist natürlich dabei[BR][BR]Es wird zeit das die Abzocker mal bestraft werden, das wird lächerlich"}, {"57": "Muttertagsupdate: 74 Seiten Mineraliengesuche, .... das ist nur noch traurig auf Wynandor."}, {"62": "Wartet doch etwas, bis die Leute bei anderen Forschungen/Ausbauten sind, dann sind das ganz schnell eher 74 Seiten Brennende Barren Gesuche bzw. die Situation ist recht bald so wie bei den Faulpilzen, wo es zu Beginn auch erst nicht Anfang war (und da gab es gar keine andere Möglichkeit an Faulpilze zu kommen).[BR]Ich denke, Inno/die Entwickler haben selbst gemerkt, dass hier ein Problem aufgetreten ist und werden selbst sich öfters die Märkte auf den verschiedenen Servern (nicht nur den deutschen) anschauen, um hier Erfahrungswerte für das nächste Kapitel zu sammeln, denn dort wird das Problem sonst wieder auftreten. Ständig hier das ganze wieder aufzuwärmen wird aber leider nichts ändern und eine kurzfristige Änderung schließe ich einmal aus."}, {"6": "Sreafin schrieb:\t\t\tIch denke, Inno/die Entwickler haben selbst gemerkt, dass hier ein Problem aufgetreten ist und werden selbst sich öfters die Märkte auf den verschiedenen Servern (nicht nur den deutschen) anschauen, um hier Erfahrungswerte für das nächste Kapitel zu sammeln,...\t\tZum Vergrößern anklicken....Die Hoffnung stirbt zuletzt .....  [smilie--sprite2]"}, {"11": "ustoni schrieb:\t\t\tDie Hoffnung stirbt zuletzt .....  [smilie--sprite2]Zum Vergrößern anklicken....oder die spielen alle [BR]Forge of Empires und machen Elvenar so zwischendurch.[BR][BR]Ich glaube wenn die selber spielen würden, hätten die schon längst was geändert[smilie--sprite11]"}, {"56": "Schnalle 04 schrieb:\t\t\toder die spielen alle[BR]Forge of Empires und machen Elvenar so zwischendurch.[BR][BR]Ich glaube wenn die selber spielen würden, hätten die schon längst was geändert[smilie--sprite11]Zum Vergrößern anklicken....Gehe getrost davon aus, dass es dort bestimmt einige \"Tester\" gibt - das ist in der EDV-Branche eigentlich so üblich.[BR]Die Frage ist eher, ob man vielleicht vermeiden möchte, dass wieder alle durchs Kapitel \"hetzen\"! [smilie--sprite8] [smilie--sprite8][smilie--sprite2]"}, {"21": "Sreafin schrieb:\t\t\tWartet doch etwas, bis die Leute bei anderen Forschungen/Ausbauten sind, dann sind das ganz schnell eher 74 Seiten Brennende Barren Gesuche bzw. die Situation ist recht bald so wie bei den Faulpilzen, wo es zu Beginn auch erst nicht Anfang war (und da gab es gar keine andere Möglichkeit an Faulpilze zu kommen).[BR]Ich denke, Inno/die Entwickler haben selbst gemerkt, dass hier ein Problem aufgetreten ist und werden selbst sich öfters die Märkte auf den verschiedenen Servern (nicht nur den deutschen) anschauen, um hier Erfahrungswerte für das nächste Kapitel zu sammeln, denn dort wird das Problem sonst wieder auftreten. Ständig hier das ganze wieder aufzuwärmen wird aber leider nichts ändern und eine kurzfristige Änderung schließe ich einmal aus.\t\tZum Vergrößern anklicken....[BR]Nein, das Problem liegt unter anderem auch daran daß die Ressourcen, die für die Ausbauten der Portale bzw Zentren benötigt werden nicht rotieren sondern für alle gleich sind, soll heißen: wenn man (wie ich als Beispiel) 14 Zentren baut benötige ich für ALLE 14 für ALLE Bau.- und Ausbaustufen dieselben Güter, und zwar Mineralien. Jetzt mal abgesehen davon daß dies ein  Mangelgut ist: warum kann es für verschiedene Zentren bzw verschiedenen Ausbaustufen nicht auch verschiedene Güterbedarfe geben? Die Bedarfe würden sich besser verteilen und entzerren und wesentlich effizienter funktionieren. Langsam sollte selbst Inno begriffen haben: je mehr Abwechslung im Bedarf der Güter desto besser der Spielfluss - und damit auch die Zufriedenheit der Spieler. Selbes Problem übrigens auch beim Portal, nur werden da insgesamt geringere Mengen verlangt, aber dennoch vom selben Gut.[BR][BR]Ausserdem denke ich nicht nur, sondern weiß mittlerweile daß die Entwickler aus den letzten Kapiteln punkto ausgewogener Ressourcenverteilung nichts gelernt haben, deshalb erübrigt sich auch das Sammeln von Erfahrungswerten für das nächste Kapitel."}, {"12": "Indianaking schrieb:\t\t\tNein, das Problem liegt unter anderem auch daran daß die Ressourcen, die für die Ausbauten der Portale bzw Zentren benötigt werden nicht rotieren sondern für alle gleich sind, soll heißen: wenn man (wie ich als Beispiel) 14 Zentren baut benötige ich für ALLE 14 für ALLE Bau.- und Ausbaustufen dieselben Güter, und zwar Mineralien.\t\tZum Vergrößern anklicken....Nein, das ist nicht so.[BR]Ich z.B. hab Bonusgut Stahl, und erwecktes Gut Mineralien; gefordert zum (Aus-)Bau der Elementatzentruen werden Alraunen.[BR]Ich schätze mal, Du hast Bonusgut Holz und erwecktes Gut br.Barren.[BR]Es hängt vom eigenen Bonusgut ab, was gefordert wird, damit auch jeder zum Handeln gezwungen wird und es nicht selbst herstellen kann (außer mit Unmengen Ruinium) [smilie--sprite2][BR](bin davon ausgegangen, daß Du mit \"für alle gleich\" alle Spieler meintest.)"}, {"21": "Ayla Ayla schrieb:\t\t\tNein, das ist nicht so.[BR]Ich z.B. hab Bonusgut Stahl, und erwecktes Gut Mineralien; gefordert zum (Aus-)Bau der Elementatzentruen werden Alraunen.[BR]Ich schätze mal, Du hast Bonusgut Holz und erwecktes Gut br.Barren.[BR]Es hängt vom eigenen Bonusgut ab, was gefordert wird, damit auch jeder zum Handeln gezwungen wird und es nicht selbst herstellen kann (außer mit Unmengen Ruinium) [smilie--sprite2][BR](bin davon ausgegangen, daß Du mit \"für alle gleich\" alle Spieler meintest.)\t\tZum Vergrößern anklicken....[BR]Das ist doch klar daß es für verschiedene Bonusgüter auch verschiedene Bedarfe gibt [smilie--sprite11] Ich meine daß die benötigten Güter pro Zentrum und pro Ausbaustufe rotieren sollten, also als Beispiel zum Aufbau der Zentren Mineralien, dann für die nächste Stufe Alraunen und für die letzte Stufe Barren. So würden die Materialien besser rotieren und entzerrt werden.[BR][BR]Und was ich mit für alle gleich meine habe ich auch erklärt \"...  sondern für alle gleich sind, soll heißen:  wenn man (wie ich als Beispiel) 14 Zentren baut benötige ich für ALLE 14 für ALLE Bau.- und Ausbaustufen ....[BR][BR]Richtig zu lesen ist meist hilfreich ^^"}, {"17": "Ja aber eben nicht dein Bonusgut wie bei allen anderen auch demzufolge sind alle gezwungen zu handeln. Macht doch keinen Sinn bei dir das rotieren zu lassen. So ist es besser gelöst jeder muss zum Ausbau sich was erhandeln.[BR]Inno kann nix dafür das es eine ungleiche Verteilung der Bonusgüter unter den Spieler im Kapitel 18 gibt."}, {"47": "so?...."}, {"44": "stone2345 schrieb:\t\t\t... Inno kann nix dafür das es eine ungleiche Verteilung der Bonusgüter unter den Spieler im Kapitel 18 gibt.\t\tZum Vergrößern anklicken....Nein. INNO sicherlich nicht. Und die Spieler wahrscheinlich auch nicht (Oder vielleicht ist es doch die Schuld der Spieler, da viele einige Spieler aufgehört haben, weil sie das \"falsche\" - übrigends von INNO zugeteilte - Bonusgut erhalten haben?) [BR]Sehr wahrscheinlich ist es einfach nur \"Schiksal\" (Glück). Aber das ändert ja nichts am Ergebnis. Oder doch? Und sich darüber Gedanken zu machen sollte - normalerweise - nicht die Aufgabe der Spieler sein, ihnen aber auch nicht verwehrt werden. Denn SIE sind ja jene, die es betrifft. (INNO betrifft das ja nur über den Umweg des Diamantenkaufs = ihrer Einnahmen)"}, {"11": "Jirutsu schrieb:\t\t\tNein. INNO sicherlich nicht. Und die Spieler wahrscheinlich auch nicht (Oder vielleicht ist es doch die Schuld der Spieler, da viele einige Spieler aufgehört haben, weil sie das \"falsche\" - übrigends von INNO zugeteilte - Bonusgut erhalten haben?)[BR]Sehr wahrscheinlich ist es einfach nur \"Schiksal\" (Glück). Aber das ändert ja nichts am Ergebnis. Oder doch? Und sich darüber Gedanken zu machen sollte - normalerweise - nicht die Aufgabe der Spieler sein, ihnen aber auch nicht verwehrt werden. Denn SIE sind ja jene, die es betrifft. (INNO betrifft das ja nur über den Umweg des Diamantenkaufs = ihrer Einnahmen)\t\tZum Vergrößern anklicken....Ich glaube viele Spieler die anfangen und zb Schriftrollen als Bonusgut haben, machen direkt einen neuen Account"}, {"68": "Schnalle 04 schrieb:\t\t\tIch glaube viele Spieler die anfangen und zb Schriftrollen als Bonusgut haben, machen direkt einen neuen Account\t\tZum Vergrößern anklicken....[BR]Das stimmt in Khelonaar zumindest nicht, da ich da schon mehrmals die Anfrage von Kapitel 1-2 bekam die auch Schriftrollen als BG hatten, glaube das waren sogar über 50%.[BR][BR]Aber die wissen es wahrscheinlich nicht und probieren es halt mal aus.[BR][BR]Eventuell sollte man Inno mal fragen ob noch daran gearbeitet wird, denn das steht ja schon seit längerer Zeit im Raum und ist eigentlich noch als offen zu betrachten. Aber wahrscheinlich wird gehofft das es in Vergessenheit gerät und man sich nicht weiter in Ausflüchte stürzen braucht. Ich frag mal im richtigen Beitrag nach."}, {"11": "Moonlady70 schrieb:\t\t\tDas stimmt in Khelonaar zumindest nicht, da ich da schon mehrmals die Anfrage von Kapitel 1-2 bekam die auch Schriftrollen als BG hatten, glaube das waren sogar über 50%.[BR][BR]Aber die wissen es wahrscheinlich nicht und probieren es halt mal aus.[BR][BR]Eventuell sollte man Inno mal fragen ob noch daran gearbeitet wird, denn das steht ja schon seit längerer Zeit im Raum und ist eigentlich noch als offen zu betrachten. Aber wahrscheinlich wird gehofft das es in Vergessenheit gerät und man sich nicht weiter in Ausflüchte stürzen braucht. Ich frag mal im richtigen Beitrag nach.\t\tZum Vergrößern anklicken....Ich glaube das kommt auch auf die Welt an, Welt 2 sind Schriftrollen nicht viel  wert"}]