[{"6": "Was bitte schön haben denn jetzt Schriftrollen mit dem Thema \"Teamgeist\" zu tun? [smilie--sprite4][BR][BR]Ich rufe neue Beiträge in diesem Thread auf, um Informationen zum Kapitel 18 zu erhalten!"}, {"1": "ustoni schrieb:\t\t\tIch rufe neue Beiträge in diesem Thread auf, um Informationen zum Kapitel 18 zu erhalten!\t\tZum Vergrößern anklicken....Und genau deswegen, wäre es toll, wenn der Ausflug zu den Schriftrollen nun beendet wird und zum Kapitel Teamgeist zurück gekehrt wird. Dankeschön."}, {"69": "Gibt es wirklich noch immer keine deutsche Questliste, die man kopieren kann? Ich kenne die italienische Liste, aber die ist nicht für eine Tabelle kopierfähig."}, {"2": "achilles7453 schrieb:\t\t\tGibt es wirklich noch immer keine deutsche Questliste, die man kopieren kann? Ich kenne die italienische Liste, aber die ist nicht für eine Tabelle kopierfähig.\t\tZum Vergrößern anklicken.......es gibt zumindest einen Anfang...[BR]OMcErnie schrieb:\t\t\tHier die von mir bisher verifizierten Aufgaben zu Kapitel XVIII inkl. Belohnungen:[BR][BR]Spoiler: Kapitel XVIII - Teamgeist01. Sammel 25.000 göttliche Saat ein -> 20.000 Unurium02. Kaufe 8 WP -> 2 Kombinationsauslöser03. Sammel 30.000 Unurium ein -> 15.000 göttliche Saat04. Gib 30 WP aus -> 150.000 Mana05. Schalte das Dimensionstor frei -> 3 WP06. Baue das Dimensionstor -> 1x Rune Drachenarche07. Besitze eine BG-1 +2-Manu (später für erleuchtende Güter) UND Sammel 200.000 erweckte Güter -> 5x 2h-Zeitbooster08. Besitze eine BG-1 +2-Manu Stufe 16 oder höher UND Schalte die Erleuchtete Marmormanufaktur der Elementare frei -> 3x 5h-Zeitbooster09. Besitze eine BG-1 +2-Manu Stufe 24 oder höher UND Schalte die Erleuchtete Stahlmanufaktur der Zwerge frei -> 2x 8h-Zeitbooster10. Besitze eine BG-1 +2-Manu Stufe 28 oder höher UND Schalte die Erleuchtete Manufaktur der gedeihenden Hölzer frei -> 1x 14h-Zeitbooster11. Besitze eine BG-1 +2-Manu Stufe 30 oder höher UND Verwende 10 Zaubersprüche -> 1x 20h Zeitbooster12. Besitze eine BG-1 +2-Manu Stufe 32 UND Verwende 10 Segen -> 3x 5 Altes WissenZum Vergrößern anklicken...."}, {"12": "und 13.  SpoilerSammle 1.000 Erleuchtete Güter ein & Besitze mindestens 3 Basismanufakturen der Stufe 32 oder höher"}, {"69": "Romilly schrieb:\t\t\t...es gibt zumindest einen Anfang...\t\tZum Vergrößern anklicken....Danke Romilly"}, {"70": "Ich bin leider bereits mit Spaßseife und Obsidian gestraft, die zig-Seiten Faulpilz-Gesuche von früher sind mir noch bestens in Erinnerung. Ich musste deutlich mehr für Forschung zahlen als andere, da ich Faulpilze trotz 3-Stern-Angeboten nicht erhandeln konnte, und sie mir in der Zwischenzeit verfallen sind. Und das trotz Unterstützung in der Gemeinschaft, aber es haben eben alle dasselbe gebraucht. Das war einfach nur frustrierend.[BR][BR]Für das neue Kapitel habe ich mir vorgenommen, erstmal abzuwarten und auf alle Fälle keine Diamanten mehr zu kaufen, falls ich mit meinem Holz als T1 wieder nur aufgrund von unfairem Design schlechter gestellt bin als andere Spieler, die bei den Bonsugütern das Glückslos gezogen haben. Ich muss nicht alles sofort haben, ich kann gern warten. Ich möchte nur nicht schon wieder einen unfairen Nachteil haben.[BR][BR]PS: Schriftrollen wurden nur als Beispiel für das miserable Design in Bezug auf Ressourcenbedarf genannt, ein Problem das beim Teamgeist schon wieder auftritt. (Ich habe mir die Mühe gemacht, die letzten Posts zu lesen)."}, {"71": "... und es geht weiter ...[BR]Spoiler: Fortsetzung Questreihe Kapitel Teamwork14. Spende 1000 Urmineralien ( 15 k Unurium )[BR]15. 6 Handelsangebote annehmen ( 1 Tierfutter )[BR]16. Handel 4 x mit dem Händler (Großhändler) + Provinz erkunden ( 15 k Seed )[BR]17. Besitze einen Händler Stufe 7 ( 1 Rune Glücksorakel)[BR]18. Produktionsbonus Erleuchtete Güter freischalten ( 2 Königliche Restaurierung )[BR]19. Heuere einen Kaufmann an oder nutze ihn 10 x ( 4 x Fabelhafte Fabrikation )[BR]20. Sammel 40 Mio. Münzen ( 5 x Magische Mitgift )( Segen möglich )"}, {"11": "Mal eine Frage zur neuen Forschung, was kann den die Authentische Werkstatt??"}, {"71": "... was soll sie denn können ?[BR]Wkz produzieren wie jede andere Werki, sonst nix ^^[BR]Optik und Ausrichtung ändern sich, das wars ..."}, {"6": "Für mich ist damit das Ende der Questreihe erreicht:[BR][BR]- Besitze 3 Plätze der Begrüßung[BR]- Heiße 2000 Elvenar im Park willkommen[BR][BR]Die Plätze brauch ich nicht (noch rund 7000% Portalsegen vorhanden), den Platz spar ich mir folglich.[BR]Abschluss der Questreihe also dann bei Kapitel 19.  [smilie--sprite1]"}, {"11": "-willi- schrieb:\t\t\t... was soll sie denn können ?[BR]Wkz produzieren wie jede andere Werki, sonst nix ^^[BR]Optik und Ausrichtung ändern sich, das wars ...\t\tZum Vergrößern anklicken....Super Antwort das hilft mir[smilie--sprite4]"}, {"71": "Größe bleibt gleich, nur die Ausrichtung ändert sich von 6x5 auf 5x6 ... besser ? [smilie--sprite2]"}, {"11": "-willi- schrieb:\t\t\tGröße bleibt gleich, nur die Ausrichtung ändert sich von 6x5 auf 5x6 ... besser ? [smilie--sprite2]Zum Vergrößern anklicken....5x6 sind die jetzt schon, egal in ein paar Tage, Wochen sehe Ich es ja"}, {"6": "Steht doch alles im Wiki:[BR][IMG]https://i.ibb.co/dtRTRHC/https-de-forum-elvenar-com-index-php-attachments-werkstatt-0-jpg-24396.jpg[/IMG][BR][IMG]https://i.ibb.co/SwqQ94n/https-de-forum-elvenar-com-index-php-attachments-werkstatt-1-jpg-24397.jpg[/IMG][BR]Stufen 38+39 = Kapitel 17[BR]Stufen 40+41 = Kapitel 18"}, {"2": "...ich hab noch nicht vor das Portal zu errichten, bevor ich den Markt ausgebaut hab - aber diese Quest lässt mich ein wenig schmunzeln...[BR][BR][IMG]https://i.ibb.co/41R6Y84/https-de-forum-elvenar-com-index-php-attachments-konstrukt-png-24398.png[/IMG]...also nach diesem Kapitel sind wir keine Endgamer mehr, sondern Rentner?!?"}, {"4": "Klingt das etwa danach, dass keine weiteren Kapitel mehr kommen sollten? Kann ich eigentlich nicht so glauben, da noch die beiden weiteren super-erweckten (oder sie auch immer heißen mögen) Güter kommen sollten."}, {"2": "nee - sie haben ja gerade erst mit den 4-Sterne-Einheiten angefangen - da kommt schon noch mehr...(außerdem haben Rentner doch viel Zeit zum Zocken - duck-und-weg)..."}, {"45": "Yay, beim nächsten Kapitel sind dann die Stadtbewohner alle mit Rollator unterwegs [smilie--sprite1] Sähe bestimmt lustig aus [smilie--sprite8]"}, {"12": "Wollte gerade meinen Restbestand an Mineralien handeln - geht nicht - ich kann die 1800 beim Händler nicht auf 1300 erniedrigen. Find ich gar nicht spaßig [smilie--sprite4]"}]