[{"38": "Brosin schrieb:\t\t\tYay, beim nächsten Kapitel sind dann die Stadtbewohner alle mit Rollator unterwegs [smilie--sprite1] Sähe bestimmt lustig aus [smilie--sprite8]Zum Vergrößern anklicken....zum Schluss kommen dann wieder die Ägypter zurück -> gehen dann die Mumien durch die Stadt[BR]Alter nein, noch besser, dass is dann eine tote Megacity![BR][smilie--sprite8][smilie--sprite8]"}, {"57": "ich hoffe ihr macht bei den Kaufleuten für erleuchtete Güter noch hinzu:[BR]1. das man sieht welche Güter man eingestellt hatte, statt nur Bild von einem Händler der läuft.[BR]2. einen Button zum Abbrechen, falls man zb falsch eingestellt hat.[BR]3. eine Übersicht seiner eigenen erleuchteten Güter im Handelsfenster sonst muss man immer umständlich raus und erstmal in der gesamten Übersicht gucken wieviele man noch hat bzw noch braucht.[BR]4. Änderbare Mengen zb auch wenn man nur zb weniger hat als erforderlich, das man es reinstellen darf, zb 1500 statt 1800. [BR]5. Erhöhung der Mengen auf 20k mindestens. Bei den Mengen die später erforderlich werden, einfach besser wie diese Tröpfchenmengen aufn heissen Stein.[BR]Bitte um Kenntnisnahme wäre nett.[BR]LG am Morgen^^[BR]Silver"}, {"2": "...bevor die nächste Fehlermeldung erstellt wird, weil man die Zusammenhaltstraße nicht bauen kann, möchte ich hier darauf hinweisen, daß es in Kapitel 18 2 Forschungen mit Straßen gibt....[BR][BR]Romilly schrieb:\t\t\t....das ist ja echt verwirrend - aber @stone2345 hat Recht - man kann/muss in Kapitel 18 zwei verschiedene Straßen erforschen...[BR][BR]Anhang 24373 ansehenAnhang 24374 ansehen[BR][BR]...die \"Teampark-Straße\" ist eine Gastrassen-Straße und hat deshalb ein kleines Gastrassensymbol\t\tZum Vergrößern anklicken....[BR]....in dieser Quest...[IMG]https://i.ibb.co/HVNmzZt/https-de-forum-elvenar-com-index-php-attachments-teamquest-png-24412.png[/IMG][BR]....muß man demnach die Gastrassen-Straße bauen aus dem Bau-Menü \"Siedlungen\"....."}, {"9": "Romilly schrieb:\t\t\t2 Forschungen\t\tZum Vergrößern anklicken....Welche es bei den Zwergen, Feen, Orks, Waldelfen und Halblingen doch auch gab.[BR]Andere GR wurden via Set zusammengebaut. Sollte der Elvenar-Ball für GR eigentlich symbolisieren, denn dies war zuvor eben auch so.[BR][IMG]https://i.ibb.co/SKsS7fJ/https-de-forum-elvenar-com-index-php-attachments-1620976038019-png-24413.png[/IMG][BR]Wieso Fehlermeldung?"}, {"2": "AngelOfDead schrieb:\t\t\tWieso Fehlermeldung?[BR][BR]Edit: Ah weil die Quest falsch formuliert ist.\t\tZum Vergrößern anklicken....nein - die Quest ist schon richtig - aber es gibt bereits 2 Fehlermeldungen deswegen, daher wollt ich hier darauf hinweisen (wo es mMn hin gehört)..."}, {"9": "Romilly schrieb:\t\t\tdaher wollt ich hier darauf hinweisen (wo es mMn hin gehört)...\t\tZum Vergrößern anklicken....Ok aber man kannte das doch eigentlich von[BR]AngelOfDead schrieb:\t\t\tden Zwergen, Feen, Orks, Waldelfen und Halblingen\t\tZum Vergrößern anklicken....Na ja egal"}, {"50": "Es ist doch eindeutig formuliert, dass die GR-Straße (Teampark-Straße) erforscht und dann auch gleich 12 Stück davon für die Story-Quest gebaut werden sollen.[BR][BR]Man kann auch anhand des Forschungsbaums sehen, dass die Teampark-Straße für die GR benötigt wird, da bei dieser Forschung das GR-Symbol hinterlegt ist (s. Screenshot rot eingerahmt).[BR][IMG]https://i.ibb.co/YZgDRZv/https-de-forum-elvenar-com-index-php-attachments-1620978073234-png-24414.png[/IMG][BR]Weiterhin wäre es völlig unlogisch 2 verschiedene Straßen (Teampark-Straße und Zusammenhalt-Straße), die an völlig unterschiedlichen Positionen im Forschungsbaum zu finden sind in eine noch relativ frühe Aufgabe zu knüpfen.[BR][BR]Die Teampark-Straße kommt relativ früh in der Forschung, da sie generell für alles weitere bezgl. der Gastrasse von Bedeutung ist und die Zusammenhalt-Straße kommt erst sehr spät in der Forschung zu einem Zeitpunkt, wo man sich am Ende der GR, sprich des Kapitels befindet.[BR][BR]Warum daraus nun Fehlermeldungen resultieren, kann ich nicht nachvollziehen, aber vlt. wurde der Story-Quest-Text nur flüchtig überflogen.[BR][BR]Nachtrag: Nur zur Info bzw. Kalkulation, man benötigt für die 12 Teampark-Straßen  127.200 Unurium"}, {"72": "kann jemand mir sagen was die Quest 28 will:  Züchte 100 Baby Elementare  ??"}, {"9": "angie455 schrieb:\t\t\tkann jemand mir sagen was die Quest 28 will: Züchte 100 Baby Elementare ??\t\tZum Vergrößern anklicken....[IMG]https://i.ibb.co/HxgQqP6/https-de-forum-elvenar-com-index-php-attachments-1621093274458-png-24435.png[/IMG]"}, {"72": "danke"}, {"38": "angie455 schrieb:\t\t\tBaby Elementare\t\tZum Vergrößern anklicken....süß! [smilie--sprite1]"}, {"73": "LuxuriantSilver schrieb:\t\t\tich hoffe ihr macht bei den Kaufleuten für erleuchtete Güter noch hinzu:[BR]1. das man sieht welche Güter man eingestellt hatte, statt nur Bild von einem Händler der läuft.[BR]2. einen Button zum Abbrechen, falls man zb falsch eingestellt hat.[BR]3. eine Übersicht seiner eigenen erleuchteten Güter im Handelsfenster sonst muss man immer umständlich raus und erstmal in der gesamten Übersicht gucken wieviele man noch hat bzw noch braucht.[BR]4. Änderbare Mengen zb auch wenn man nur zb weniger hat als erforderlich, das man es reinstellen darf, zb 1500 statt 1800.[BR]5. Erhöhung der Mengen auf 20k mindestens. Bei den Mengen die später erforderlich werden, einfach besser wie diese Tröpfchenmengen aufn heissen Stein.[BR]Bitte um Kenntnisnahme wäre nett.[BR]LG am Morgen^^[BR]Silver\t\tZum Vergrößern anklicken.... [BR]Der Handel mit erleuchteten Gütern ist gründlich misslungen. Man kann maximal 2.000 Stück für 6 Stunden einstellen und die Kosten für den 2. Verkäufer sind wahnsinnig hoch, 40 Millionen für 20 Tage? Der verlangt ja mehr als der unverschämteste Bänker.​"}, {"6": "Sananani schrieb:\t\t\tMan kann maximal 2.000 Stück für 6 Stunden einstellen\t\tZum Vergrößern anklicken....Man stellt sie nicht ein, sondern tauscht direkt. Sobald sie von anderen Spielern angenommen wurden oder spätestens nach 6 Stunden kann man erneut tauschen, der Kaufmann ist also ein Zwischenhändler.[BR][BR]Sananani schrieb:\t\t\tdie Kosten für den 2. Verkäufer sind wahnsinnig hoch, 40 Millionen für 20 Tage?\t\tZum Vergrößern anklicken....Sind bei mir ca. 30% der Tageseinnahmen. In Kapitel 18 sollte das kein Problem sein. Falls doch, machst Du irgendwas falsch. Bei mir laufen problemlos 3 Kaufleute. Die vollen 6 Stunden musste ich bisher noch bei keinem Kaufmann abwarten, obwohl ich nur mit Brennenden Barren handle.[BR][BR]Bisher bin ich mit diesem Kapitel sehr zufrieden. Hier sieht man Fortschritte, ganz im Gegenteil zu Kapitel 17."}, {"50": "Der 3. Verkäufer kostet dann weitere 90 Millionen Münzen. Trotz dieser Preise sehe ich es nicht als das spürbare Problem an, da die Münzen auch wieder schnell auch ohne Münzsegen eingespielt sind und man hat für 20 Tage wenigstens 3 Verkäufer zur Verfügung.[BR][IMG]https://i.ibb.co/0hyhHYf/https-de-forum-elvenar-com-index-php-attachments-1621169300132-png-24455.png[/IMG][BR]Auch die 100+200 Dias für Verkäufer 4+5 kann man sich hin-und wieder ans Bein binden. Schliesslich hat man dann diese auch für 20 Tage bereit und kann in dieser Zeit schon ganz gut Güter ansammeln.[BR][BR]Das Schlimme an dem Handel via Verkäufer bzw. generell den Handel mit den erleuchteten Gütern ist der einseitige Bedarf.[BR][BR]Für den Ausbau des Portals (Dimensionstor) benötigt man ausschliesslich Allwissende Alraunen, für die 4 elementaren Zentren, um diese überhaupt bauen zu können, werden wiederum nur Urwelt-Mineralien benötigt.[BR][BR]Dadurch suchen derzeit sehr viele Spieler in dem Kapitel Alraunen, nicht ganz so viele Spieler, aber eine mittlerweile ansteigende Anzahl,  Mineralien und niemand die Barren (Welt 1 - Arendyll).[BR][BR]Für 2-3 Tage Handel mit erleuchteten Güter, inkl. der 68.000 Alraunen für den Ausbau des Portals auf Stufe 2, bin ich ganz gut beim Handel voran gekommen.[BR][IMG]https://i.ibb.co/MCkqX6j/https-de-forum-elvenar-com-index-php-attachments-1621169962055-png-24456.png[/IMG][BR][BR]Für mich heisst es nun erst einmal Mineralien für ausreichend Zentren zu erhandeln und anzusammeln, da diese bei mir als nächstes in der Forschung fällig sind.[BR][BR]Ich bin gespannt, wann und für was dann die Barren (mein erl. BG) benötigt werden.[BR][BR]Bisher bin ich recht stressfrei und ohne Stillstand ganz ordentlich vorangekommen und finde das Kapitel XVIII nicht so schrecklich, wie es teils aus dem Beta-Forum übermittelt wurde."}, {"6": "OMcErnie schrieb:\t\t\tIch bin gespannt, wann und für was dann die Barren (mein erl. BG) benötigt werden.\t\tZum Vergrößern anklicken....Was ich bisher dazu sagen kann (hab auch Barren als BG):[BR]Bei der Produktion der Elementare in den Zentren werden u.a. die Barren benötigt. Allerdings in so geringen Mengen, dass man es fast vernachlässigen kann (Stufe 1: 270 Barren je Zentrum).[BR][BR]Nachtrag: hab je 4 Zentren gesetzt. Weniger würde den Fortschritt unerträglich langsam machen (meine Meinung)."}, {"19": "OMcErnie schrieb:\t\t\tDer 3. Verkäufer kostet dann weitere 90 Millionen Münzen. Trotz dieser Preise sehe ich es nicht als das spürbare Problem an, da die Münzen auch wieder schnell auch ohne Münzsegen eingespielt sind und man hat für 20 Tage wenigstens 3 Verkäufer zur Verfügung.[BR]Anhang 24455 ansehen[BR]Auch die 100+200 Dias für Verkäufer 4+5 kann man sich hin-und wieder ans Bein binden. Schliesslich hat man dann diese auch für 20 Tage bereit und kann in dieser Zeit schon ganz gut Güter ansammeln.[BR][BR]Das Schlimme an dem Handel via Verkäufer bzw. generell den Handel mit den erleuchteten Gütern ist der einseitige Bedarf.[BR][BR]Für den Ausbau des Portals (Dimensionstor) benötigt man ausschliesslich Allwissende Alraunen, für die 4 elementaren Zentren, um diese überhaupt bauen zu können, werden wiederum nur Urwelt-Mineralien benötigt.[BR][BR]Dadurch suchen derzeit sehr viele Spieler in dem Kapitel Alraunen, nicht ganz so viele Spieler, aber eine mittlerweile ansteigende Anzahl,  Mineralien und niemand die Barren (Welt 1 - Arendyll).[BR][BR]Für 2-3 Tage Handel mit erleuchteten Güter, inkl. der 68.000 Alraunen für den Ausbau des Portals auf Stufe 2, bin ich ganz gut beim Handel voran gekommen.[BR]Anhang 24456 ansehen[BR][BR]Für mich heisst es nun erst einmal Mineralien für ausreichend Zentren zu erhandeln und anzusammeln, da diese bei mir als nächstes in der Forschung fällig sind.[BR][BR]Ich bin gespannt, wann und für was dann die Barren (mein erl. BG) benötigt werden.[BR][BR]Bisher bin ich recht stressfrei und ohne Stillstand ganz ordentlich vorangekommen und finde das Kapitel XVIII nicht so schrecklich, wie es teils aus dem Beta-Forum übermittelt wurde.\t\tZum Vergrößern anklicken....[BR][BR]Ich bin auch ein \"Barren-Produzent\" [smilie--sprite1] [BR][BR][BR][BR]Wofür brauchen wir die Barren ? [BR]Zum Tauschen !!![BR][BR]Wer Allwissende Alraunen als Bonusgut hat,[BR]der braucht die Barren um seine Elementarzentren[BR]bauen und ausbauen zu können ![BR][BR]Zum Glück habe ich da gerade zwei in der Gilde [smilie--sprite6] [BR][BR]Somit bekomme ich meine Barren weg[BR]Gleichzeitig bekomme ich Alraunen rein [BR]Und die kann ich sehr gut gegen Mineralien tauschen, [BR]die ich für meine Ausbauten brauche  [BR]Passt alles perfekt [smilie--sprite1] [BR][BR]Die Gastrasse läuft sehr gut [BR]Bin da auch ganz entspannt"}, {"2": "...also ich erforsche gerade den Produktionsbonus und werde voraussichtlich Ende der Woche dann Mineralien tauschen können (auf Fely) - vielleicht findet sich ja noch jemand, der sich in die Tauschbörsen eintragen möchte, um dem Handel etwas auf die Sprünge zu helfen - in den anderen Welten spiele ich das Kapitel nicht..."}, {"46": "Finde Kapitel 18 sehr gut gelungen. Das Design liebe ich, man kommt zwar langsam aber immer voran. Der neue Händler ist toll. Zwar haben wir in der GM erst 2 die im Kapitel 18 sind, aber einer davon hat Mineralien und hat somit freie Auswahl. Da er sowohl für den Ausbau als auch für die Zentren andere Gütern braucht kommen wir super klar. Vllt. könnten die Gebote etwas höher sein, aber man kommt auch so klar. Habe schon lange nicht mehr mit soviel Elan Elvenar gespielt [smilie--sprite8][BR]Habe nur einen Kaufmann und der wird auch ohne Gildentausch sehr schnell wieder nach Hause geschickt. ok, ich kann aber auch immer mal wieder ins Spiel schauen."}, {"50": "Auch wenn es an anderer Stelle bereits angesprochen wurde aber eigentlich in den Thread \"Teamgeist\" gehört, hier nur die ersten 3 Seiten der \"Meldungen\" um aufzuzeigen, dass erfolgte Handel mit den erleuchteten Gütern nichts in den eigentlichen Meldungen verloren haben.[BR][IMG]https://i.ibb.co/cJwPSVv/https-de-forum-elvenar-com-index-php-attachments-1621235986793-png-24466.png[/IMG][BR]11 von 18 möglichen Meldungen sind erfolgter Handel mit erleuchteten Gütern.[BR][BR]Es gehen sehr viele von den NBHs, die von der Weltkarte kommen in dieser Übersicht verloren. Dadurch resultiert, dass die NBH mit den NBs auf lange Sicht nicht mehr wirklich erfolgen wird, denn wer hat schon Lust bei 100ten von NBs die vlt. aktiven )ein sehr hoher Prozentsatz ist ja nunmal inaktiv), die einem immer wieder mal NBH geleistet haben, zu suchen.[BR][BR]Nachfolgen nur ein Teilausschnitt meiner NBs bereits stark in der Brwoseransicht verkleinert[BR][IMG]https://i.ibb.co/GPthBtn/https-de-forum-elvenar-com-index-php-attachments-1621236378648-png-24467.png[/IMG][BR]Würde ich jetzt auch noch auf Suche nach bekannten NBs gehen, würde das Ewigkeiten dauern und dazu dann noch die Ladezeiten pro Stadt.[BR][BR]Hier ist es dringend erforderlich, dass INNO bezgl. Handel mit erl. Gütern, der mit der Zeit ja auch zunehmen wird, die zugehörigen Meldungen dafür separiert und in ein eigenen TAB verlagert."}, {"6": "OMcErnie schrieb:\t\t\tWürde ich jetzt auch noch auf Suche nach bekannten NBs gehen, würde das Ewigkeiten dauern und dazu dann noch die Ladezeiten pro Stadt.\t\tZum Vergrößern anklicken....Ich gebe jeden Tag NBH in der kompletten Nachbarschaft. Über die App mit dem Smartphone dauert das ca. 20 Minuten und bringt mir rund 75 Millionen Münzen."}]