[{"143": "Dear all,[BR][BR]Should you wish to leave any reaction to my resignation announcement here, please feel free to do so in this thread.[BR][BR]Kind regards,[BR]Marindor"}, {"80": "Dear Marindor, our beloved Community Manager ...[BR]It's with death in our hearts that we heard this news, it was an out of the blue that devastated all of us.[BR]You have always been a guide for me, a light in the dark, a certainty.[BR]Your kindness and your strength have helped me so many times to smooth out the harsh corners of my character.[BR]Nobody here cannot even imagine how immense your dedication has been: to the game, to the forum, to us moderators and to the players themselves; you always treated us like a big family.[BR]I have always admired you a lot, first as a player and then as a staff member, especially when I was able to see for myself how much love you put into everything you did.[BR]I've been crying bitter tears for days now, and I can't imagine this place without you, you are its soul.[BR]I was lucky enough to know you personally, and your big and contagious smile only confirmed the idea I had of you: you bring light, and joy, and serenity.[BR]Please, forgive my grammar mistakes; I am using a translator because at this moment I am not able to express what I feel.[BR]I've got no more words to say, just a big, deep pain.[BR]You'll always be my Big M."}, {"143": "<3"}, {"14": "Ok, stop kidding, it's not april's fool.[BR]And it's not fun. [BR]Not.[BR]Fun.[BR]At.[BR]All.[BR]You'll always been there since I start playing, who dares to imagine to be your replacement? Marindor IS Beta server. You create this community.[BR]This is a big, heavy loss for beta server.[BR]Is there nothing we players can do? A petition, a boycott, going to Hamburg to slap someone until they realise the dumbest thing are doing???[BR]I'm really speachless,, I really can't comprehend what benefits can provide get along without you.[BR]You know all the mechanics, all the interactions and it's totally non sense to me.[BR]Unbelievable.[BR]I didn't think this day would come.[BR]I always see you as a backbone of beta server, and knowing that you won't be around here... it leaves a great emptiness.[BR]To you, and to the team, my deepest appreciation.[BR]This place won't be the same without you."}, {"144": "Dear Marindor and the Community,[BR][BR]I would like to send my deepest appreciation and sorrow, equally. Our Support Team is devastated with the news that Marindor will no longer be leading the Beta Community.[BR][BR]“Big M” or “M” as we moderators call him, has been the very best boss I’ve ever had the pleasure of working with.[BR][BR]His patience, kindness, convictions, knowledge and willingness to stand up for players and his staff has been a huge asset to Elvenar, and an example of how a healthy and prosperous gaming community should be. He has taught us all so many valuable skills and attributes over the years.[BR][BR]He has created a supportive and comfortable atmosphere for the Beta market: in-game, on the Forum and with his moderation team. That is a rare and admirable skill to have. We will all miss his gentle and friendly guidance.[BR][BR]I, too, will be leaving the Beta Team by October 15th and would like to thank Marindor for reaching out to me a few years ago to “give it a try” as a game moderator. I’ve answered countless tickets over the years, all with the priority and passion to help each player as best as I possibly could. I will miss talking with the community through tickets and on the Forum. Your dedication to this game is incredible and I have loved being here to see it. I will miss you all and this market’s wonderful moderation team. [BR][BR]Thank you for all that you have done for Beta, Marindor! You’re exactly what this world needs more of and Beta will miss you greatly. All the very best wishes to you!!!     [BR][BR]~SyreArca"}, {"14": "SyreArca said:\t\t\tI, too, will be leaving the Beta Team by October 15th\t\tClick to expand...Oh my, and what's next? Locusts?[BR]Unbelievable.[BR]Absurd.[BR]Inno, look what you have done."}, {"145": "I haven't been here for long, but I will miss you guys too <3"}, {"3": "Wish you all the very best, Marindor and SyreArca ... thank you so much for everything!"}, {"73": "It is sad to hear you both are leaving the team.[BR]And what ever you both are going to do in the future, I wish you both all the best."}, {"120": "Noooo... This cannot be true![BR]But,.. why? [BR][BR]Anyhow, thank you both @Marindor and @SyreArca for your time, energy and support. [BR]And for simply being you! [BR][BR]What ever lays ahead next, I hope you will be doing well and enjoy what you do! [BR][BR][IMG]https://i.ibb.co/7WQhNWc/https-i-ibb-co-Kwzg-Z9-S-thank-you-jpg.jpg[/IMG]"}, {"146": "Thank you Marindor."}, {"30": "Dear @Marindor and @SyreArca, thanks for supporting us for this long time. You will leave a big hole.[BR]Best wishes for your future way.[BR]Brummi"}, {"13": "To be honest, it is funny… inno is asking for more money vs diamonds and let leave a most appreciated CM vs… what? Volunteers? Hope not.[BR]An old saying is “if you want something good, pay for it”.[BR]Marindor and Sire, from my part, thanks a lot for all, it’s been a real pleasure to cooperate with you, having someone so near to the forumers/players and not themself."}, {"147": "Wishing you both all the best - and thanks for the hours of dedicated service that you have spent on making the game better for all who play![BR]We will miss you."}, {"148": "Absolutely gutted that the mainstay of Beta is leaving. Your patience and dedication to providing assistance and information to the community is exemplary. Your shoes are massive ones and it will be impossible to fill them. Thank you for all the many hours you have dedicated to this community. You will be greatly missed. [smilie--sprite3]"}, {"7": "Best wishes to you for all your future endeavours Marindor and thank you for all your help and support.   Also to you Syre I hope you are both going on to brighter things.   We will miss you"}, {"149": "[IMG]https://i.ibb.co/ZLccPS0/https-beta-forum-elvenar-com-index-php-attachments-thank-you-sooo-much-51835-52-jpg-10356.jpg[/IMG]"}, {"150": "this forum will never be the same again without you"}, {"2": "Marindor [BR]What can I say?  What a dark day this is, to know that you are leaving.   You have guided me in my early steps in the game.  I have a Support ticket that you answered,  back on the International server, remember when you switched places with Muf-Muf.  I feel so, lost, now, and I genuinely worry about who could possibly step into your role.  (Fingers crossed for Helya.  Please please be Helya).   But even so, you worked with Timon, understood game balance,  advocated tirelessly.   The QoL improvements made in this game likely came about due to your work.  This server will not be the same without you. [BR][BR][BR]Best of luck in the future hon."}, {"11": "@Marindor and @SyreArca thank you for all the big support, info and help.[BR][BR]Wish you both the best and good luck with all other things that come along on your path."}]