[{"32": "@Marindor and @SyreArca  - thank you for everything. [BR]My heart skipped a beat reading the title of the thread. I can't believe this is happening![BR]I can't even imagine this place without you, Marindor! [BR][BR]Beta forum = Marindor![BR][BR][IMG]https://i.ibb.co/Y87zyfM/https-beta-forum-elvenar-com-index-php-attachments-please-dont-go-gif-10357.gif[/IMG]"}, {"2": "Syre Arca [BR]I wanted to write to you separately.   Thank you for your time and energy,  for your efforts to help make Beta a better place for all.  [BR]Best of luck to you."}, {"58": "This is very sad news. [smilie--sprite3] [BR]Just like everyone else says, Marindor IS beta!! I wonder what is going on with so many good people leaving support lately. I've noticed a change in the game and management over the last couple of years...and I gotta say, it's not great and a little worrying. I don't want to hurt any feelings so all I'll say is that I'd have fought to keep someone as professional and friendly as Marindor around.[BR]His staff and the whole system on beta seems to just work over here. There isn't much drama and although there will always be those players out there who aren't very friendly to other players, this team has been great at balancing everything and letting us know right away when something isn't working.[BR]It's been awesome playing on beta over the last several years because you could always come to the forum to see what's going on... or write in a ticket and get a nice reply right away! I don't see that happening as smoothly after the mod(s) and manager team leaves. And I feel bad for any mods staying during whatever is going on behind the scenes too. This is so sad to see happening to something that already worked so well.[BR]Anyway, thank you very much for all you guys have done over the years!!! This forum will never be the same without Marindor and his team."}, {"88": "I feel really sad to see you go @Marindor, you are one of the rare few who MADE A REAL DIFFERENCE for us players.  Thank you so much for your dedication, hard work, comprehension and all the good things you did for us.  I wish you all the best!  Is there anything you can share with us on your career plan?[BR]Take care[BR]Ange"}, {"57": "Oh Marindor, I am saddened almost beyond words by this news! I can still remember when you joined the Elvenar beta team as a moderator, way back when! [BR][BR]For all these years it has been a pleasure and a privilege to work together, whether with you, alongside you or for you. We may not always see eye to eye, but over the years, in our varying roles, I feel we have become good friends, and you've been one of the very best of the many CMs I have had the pleasure to work for both here and elsewhere. [BR][BR]A CM makes a community, and you have made the Elvenar ZZ commmunity a great one to be part of, whether as a player or a mod. As others have said, you will be missed."}, {"151": "Following Marindor ans SyreArca i have decided to leave the team as well, I can only reapeat the message from Marindor an SireArca.[BR]It was a pleasure serving all the players on the Beta server."}, {"5": "Marindor, you were a lot of help over the years, so you will be missed. Though I do have to say that you have had such a lower presence here after your wedding and honeymoon, that I was thinking you were still on that honeymoon.   [smilie--sprite2][BR][BR]But if that new family life is in any way part of your decision to leave Innogames, that is completely understandable, as happiness in your private life should come first."}, {"143": "Thanks everyone for all the heartwarming reactions, that really means a lot to me! And let me please once again emphasize that not all praise should go to me. A lot of all the things we have accomplished over the last years has been because of our awesome support team. Without them, a Community Manager isn't that much on their own [smilie--sprite2][BR][BR]@Angeduciel For my career path fortunately it won't make much of a difference. In general Community Managers for InnoGames are freelancers who do this as a side job, not as fulltime employees. I'm in the lucky position that I don't have to work for my money anymore. I've worked very hard (80-100 hours a week) for about 20 years and invested the money I earned in various projects, so my main income comes from my investments now. I do still work, but I only do the things I really enjoy doing. I'm a freelance subtitler and I have my own company in nutritional supplements, so I'll have even more time for that now, haha. But I'm sure this will leave quite an empty hole for me, as I spent a lot of time doing this (most of it behind the scenes), and I enjoyed my work here very much, so I don't know yet if I'll look for other Community Management challenges. I'm not one to sit still, so who knows! [smilie--sprite1]"}, {"2": "dimitryb said:\t\t\tFollowing Marindor ans SyreArca i have decided to leave the team as well, I can only reapeat the message from Marindor an SireArca.[BR]It was a pleasure serving all the players on the Beta server.\t\tClick to expand...Another one.  Wow.  Sorry to hear [smilie--sprite3]"}, {"32": "Marindor said:\t\t\tso I don't know yet if I'll look for other Community Management challenges. I'm not one to sit still, so who knows! [smilie--sprite1]Click to expand...if will be a game, just let us know, we might follow you there [smilie--sprite8]"}, {"45": "Thank you for everything you did for the game and its players.. you will be sorely missed!"}, {"56": "I took a break from Beta for a little while and came back to find this awful news.  Oh No.  You were the best of the best.  I'm so sad about this.  I'm also sad to see others following suit.  To me, Marindor, you WERE the Beta Forum.  I hope you enjoy some free time, and we'll all be thinking about you and wishing you the very best, because that's what you were, the very best.  Thank you very much for the years you put in for us.  You will not be forgotten."}, {"139": "Just dusted my forum account to jump here and say a sad goodbye to you, @Marindor, @SyreArca and @dimitryb.[BR]Your presence, your help and your dedication through the years has been very appreciated and you will not forgotten; you're such a big loss for beta server.[BR]Wishing you all the best, it would be fantastic if our paths will really cross again!"}, {"22": "[smilie--sprite3]"}, {"58": "Super sad to see Marindor, SyreArca, pinksunset and dimitryb all as ex members now! I feel awful for them, whatever happened and sad that the glue to this server is now gone. *cries*  It already feels different over here...and not in a good way. [smilie--sprite3][BR]Edit to say: Thanks to the qa team for all they are trying to do to keep everything together! I feel really bad for them, too. This looks bad that even they don't know what to do now, with no community manager. What is inno thinking?[BR]What a mess. :-/"}, {"29": "[BR][IMG]https://i.ibb.co/Zd901hv/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-10-19-182143-png-10369.png[/IMG]"}, {"60": "Thank you, Marindor, for all your work. You will be truly missed."}, {"32": "I just saw on FB that Helya (also CM) from US forum has quit as well. Now this is fishy already. [smilie--sprite5]"}, {"58": "I wish we could get them all to come back. [smilie--sprite3]"}, {"97": "Makes you wonder what is in store for us if so many leave, what is Inno up too? Fingers crossed this doen't turn into the EN forums.[BR][BR]Wishing you, @ThaMartin @SyreArca  , Success in any new beginnings, where ever life takes you ♥ and all our thanks from @SoggyShorts  and I,  for your support and leadership. It has been a wonderful experience these past 6 and half years, it won't be the same without you, You will be missed, but hopefully this is not goodbye!!"}]