[{"143": "Dear Humans and Elves,[BR][BR]Today we've launched the latest chapter in our Elvenar story, Chapter 20 - The Power of Music![BR][BR]Please see the full announcement here and let us know what you think about it![BR][BR]Kind regards,[BR]Your Elvenar Team"}, {"35": "so.... do we have a quest list yet? [smilie--sprite2]"}, {"11": "Little typo: I assume this \"At the end of Chapter 19...\" should be Chapter 20"}, {"143": "Droopy said:\t\t\tLittle typo: I assume this \"At the end of Chapter 19...\" should be Chapter 20\t\tClick to expand...Thanks, corrected!"}, {"16": "@Marindor [BR]AW effects are messed up in announcement."}, {"143": "Karvest said:@Marindor[BR]AW effects are messed up in announcement.\t\tClick to expand...How do you mean exactly? On my screen they show correctly."}, {"16": "scouts tavern reduce scouting time and give additional chests[BR]resting place produce banshee and reduce decay"}, {"62": "Marindor said:\t\t\tHow do you mean exactly? On my screen they show correctly.\t\tClick to expand...i think he means that the arrow is \"up\" instead of down on the timer for the effect"}, {"143": "Karvest said:\t\t\tscouts tavern reduce scouting time and give additional chests[BR]resting place produce banshee and reduce decay\t\tClick to expand...Thanks, changed now!"}, {"152": "Marindor said:\t\t\tThanks, changed now!\t\tClick to expand...[BR]Is this correct now?[BR][BR]Scout's Tavern (5x3)[BR]Reduces scouting times[BR]and produces Ghastly Banshees[BR][BR]Ancestral Resting Place (4x7)[BR]Reduces decay of Ascended Goods[BR]and increases the amount of Neighborly Help chests"}, {"32": "[IMG]https://i.ibb.co/MfwGvQ2/https-beta-forum-elvenar-com-index-php-attachments-ch-20-ancestral-wonder-jpg-10252.jpg[/IMG] [IMG]https://i.ibb.co/jJ1zBDk/https-beta-forum-elvenar-com-index-php-attachments-ch-20-scouts-tavern-jpg-10253.jpg[/IMG]"}, {"152": "Alcaro said:View attachment 10252 View attachment 10253Click to expand...@Marindor[BR]Then the announcement is still switched.[BR][BR]Never mind.  Now it's fixed."}, {"37": "Event buildings have been regenerated so that they contain values for chapter 20. The new chapter can now also be selected in the top-right menu to help you filter / sort the buildings accordingly and see the correct values in the events' chests."}, {"32": "I know I seem shallow [smilie--sprite11], but does anyone have the avatars for this new chapter?"}, {"16": "[BR]"}, {"14": "Alcaro said:\t\t\tI know I seem shallow [smilie--sprite11], but does anyone have the avatars for this new chapter?\t\tClick to expand...\t\t\t\t\t\tAvatar e sfondi\t\t\t\t\tFan-Blog dei Cavalieri dello Zombiaco, dedicato al gioco Elvenar.  In nessuno modo collegato ad InnoGames Gmbh, proprietaria delle immagini.\t\t\t\t\tcavalieridellozombiaco.blogspot.com\t\t\t\t"}, {"32": "[smilie--sprite8] so ... we have 3 goats, 2 elves and 1 tree.[BR]TY Karvest and PrimroseSylvia [smilie--sprite1][BR][BR]EDIT:[BR]those ugly goats seem to belong to Halflings but in the story appear only the Woodelves and Sorcerers. Why those goats here?"}, {"61": "Alcaro said:[smilie--sprite8] so ... we have 3 goats, 2 elves and 1 tree.[BR]TY Karvest and PrimroseSylvia [smilie--sprite1][BR][BR]EDIT:[BR]those ugly goats seem to belong to Halflings but in the story appear only the Woodelves and Sorcerers. Why those goats here?\t\tClick to expand...They look more line fauns"}, {"2": "Seems like Inno used the same artists as they did for Traders chapter."}, {"73": "I just made a copy of the tech tree in my own excel sheet and I am wondering.[BR]Is it on purpus they don't use any tier 6 goods in this chapter for the tech tree?"}]