[{"88": "Finally something more interesting to do, chapter 20 is around!  I can't wait to review the details of it and get to redesign my city [smilie--sprite8][smilie--sprite8][smilie--sprite8]"}, {"153": "wonder if lvl 1 fabrics are going tot work...."}, {"37": "@tadaaa yes they do. Similarly to workshops and residential buildings in Amuni."}, {"153": "iDavis said:@tadaaa yes they do. Similarly to workshops and residential buildings in Amuni.\t\tClick to expand...Nice thanks! That was my first impression when i read the  description lol, amuni 2.0 [smilie--sprite2]"}, {"153": "Is there a new province expansion added with this chap or did it only come with the expansion update?"}, {"9": "The province expansion for this chapter was added during expansion update."}, {"154": "Good morning, may I ask when will arrive in the real world?"}, {"73": "Beta is always 3 weeks ahead of life so expect the new chapter in 3 weeks on your life server."}, {"32": "Are the goods (ascended) from the very first tech the same for everybody or are they related to our boosted production?[BR]I have 150k ingots (my boosted) and 100k powder (non-boosted).[BR]Same question for the Grove tech.[BR]ty"}, {"153": "Lovec Krys said:\t\t\tThe province expansion for this chapter was added during expansion update.\t\tClick to expand...thnx Lovec"}, {"16": "Alcaro said:\t\t\tAre the goods (ascended) from the very first tech the same for everybody or are they related to our boosted production?[BR]I have 150k ingots (my boosted) and 100k powder (non-boosted).[BR]Same question for the Grove tech.\t\tClick to expand...They are the same for everybody, valid for the whole ch20."}, {"32": "Karvest said:\t\t\tThey are the same for everybody, valid for the whole ch20.\t\tClick to expand...tyvm [smilie--sprite1]"}, {"155": "Chapter 20 can someone show a picture of portal profit[BR]Thank you"}, {"88": "kedvesem said:\t\t\tChapter 20 can someone show a picture of portal profit[BR]Thank you\t\tClick to expand...[IMG]https://i.ibb.co/gtQMCLz/https-beta-forum-elvenar-com-index-php-attachments-1660826459849-png-10262.png[/IMG][BR][BR]the Bars are the only item with a portal storage capacity limitation:[BR][IMG]https://i.ibb.co/PZB88F9/https-beta-forum-elvenar-com-index-php-attachments-1660826559531-png-10263.png[/IMG]"}, {"5": "Bor de Wolf 1965 said:\t\t\tBeta is always 3 weeks ahead of life so expect the new chapter in 3 weeks on your life server.\t\tClick to expand...[BR]Usually 2 weeks, not 3, but if there are a lot of bugs, it could be 3 weeks."}, {"73": "Enevhar Aldarion said:\t\t\tUsually 2 weeks, not 3, but if there are a lot of bugs, it could be 3 weeks.\t\tClick to expand...On the life server is still running the \"gate to the past\" event and that stops Tuesday august 8 (next week)[BR]1 week later we get the challenge, when that stops we are again 1 week further.[BR]Then again it will go up to Thursdays until we get the next event and that will be 3 weeks after it starts here."}, {"153": "Alcaro said:\t\t\tAre the goods (ascended) from the very first tech the same for everybody or are they related to our boosted production?[BR]I have 150k ingots (my boosted) and 100k powder (non-boosted).[BR]Same question for the Grove tech.\t\tClick to expand...[BR]Angeduciel said:View attachment 10262[BR][BR]the Bars are the only item with a portal storage capacity limitation:[BR]View attachment 10263Click to expand...right, so  same as usual [smilie--sprite2]"}, {"5": "Bor de Wolf 1965 said:\t\t\tOn the life server is still running the \"gate to the past\" event and that stops Tuesday august 8 (next week)[BR]1 week later we get the challenge, when that stops we are again 1 week further.[BR]Then again it will go up to Thursdays until we get the next event and that will be 3 weeks after it starts here.\t\tClick to expand...[BR]Nope. I looked back at the announcements for the chapters on both Beta and Live, starting with chapter 13, and every chapter from 13 to 19 has had about a two-week gap between Beta and Live. Chapter 15 had almost a full month gap, but that was a buggy chapter that delayed the Live release. The actual spread for the other chapters from 13-19 was actually from as little as 12 days to as much as 18 days, but all less than 3 weeks. So everyone needs to be ready, in case it is another short gap again."}, {"153": "Enevhar Aldarion said:\t\t\tNope. I looked back at the announcements for the chapters on both Beta and Live, starting with chapter 13, and every chapter from 13 to 19 has had about a two-week gap between Beta and Live. Chapter 15 had almost a full month gap, but that was a buggy chapter that delayed the Live release. The actual spread for the other chapters from 13-19 was actually from as little as 12 days to as much as 18 days, but all less than 3 weeks. So everyone needs to be ready, in case it is another short gap again.\t\tClick to expand...that used to be like that for all content, but time between seems to get a bit longer over time....Owell, let's hope you're right though [smilie--sprite2]"}, {"73": "Personally, I hope they keep the same schedule as with the autumn event.[BR]That way we have the room to do the challenge with the current state of our towns.[BR]Also important, the gamefiles for chapter 20 and the event can be the same as we will heven them here.[BR]And it gives them just 1 week more to create the English wiki for chapter 20 and I hope @Konniver has updated the architect by then."}]