[{"9": "Personaly i expect the chapter to be on live before Autumn event. But only Inno devs (and maybe CMs) knows the schedule."}, {"16": "Bor de Wolf 1965 said:\t\t\tAlso important, the gamefiles for chapter 20 and the event can be the same as we will heven them here.\t\tClick to expand...ch20 feature can be enabled whenever they want after it is ready, it's not linked to any event.[BR]There are no technical reasons to start it along with event, pure marketing."}, {"156": "Can anybody tell me please how big magic dust manufactoty gets (Lev. 34 and higher)?  Thank u"}, {"101": "Level 34 dust will remain at 5x7.[BR]Elixir goes to 7x5[BR]gems remains 5x7"}, {"33": "Scout's Tavern (5x3)  [BR]Reduces scouting times[BR]and increases the amount of Neighborly Help chestsClick to expand...[BR]This was already requested in ES server in order to have another viable type of city[BR]\t\t\tI would like a city based on Neighborhood Aid to be possible...[BR]- Evos: Moon Bear (KPs), Hell Owl (Goods),[BR]- Wonders: Lighthouse/Bell Tower (Goods), Sunset Towers (DSeeds), Lighthouse of Good Neighborhood? (Mana?, +gold/tools), ... Ruins? (culture?)[BR][BR]Maybe some building to provide some extra daily chest (I'm looking at you Throne of the High Men, +1 chest/5 levels instead of ranking points)\t\tClick to expand...[BR]The additional NH chests at the end of chapter 20, is a bit too late...[BR][BR]EDIT: sorry GoogleTranslated, there maybe some typos..."}, {"2": "Prueba2 said:This was already requested in ES server in order to have another viable type of city[BR][BR][BR]The additional NH chests at the end of chapter 20, is a bit too late...[BR][BR]EDIT: sorry GoogleTranslated, there maybe some typos...\t\tClick to expand...There are many Forums who have requested something similar."}, {"153": "Prueba2 said:This was already requested in ES server in order to have another viable type of city[BR][BR][BR]The additional NH chests at the end of chapter 20, is a bit too late...[BR][BR]EDIT: sorry GoogleTranslated, there maybe some typos...\t\tClick to expand...what's NH?"}, {"73": "NH = Neighbour Help I believe"}, {"23": "@tadaaa [BR]Neighborly Help"}, {"9": "Ok, ending with quests sooner than anticipated.[BR]If someone things that i donate milion mana to the quest, then, ............."}, {"32": "Lovec Krys said:\t\t\tOk, ending with quests sooner than anticipated.[BR]If someone things that i donate milion mana to the quest, then, .............\t\tClick to expand...^^ that, when one upgrade of a manufactory needs 1.8 million mana."}, {"157": "Is there a limitation on the number of settlementbuildings or is it a construction something like the settlementbuildings in Unur?"}, {"9": "@Alcaro Yes, when mana is consumed in big amounts the best devs can do is to make a quest when you donate mana."}, {"158": "What are the Ascended Precious goods? (I'm nowhere near Ch. 20 and didn't see in in the Wiki yet.)"}, {"73": "The normal Precious goods are Elixer, Magic dust and Gems.[BR]The Ascended Precious goods are made in the same factories but require Unurium to be made.[BR]Some people refer to them as the tier 9 goods or T9"}, {"9": "@Hueanthar [BR][IMG]https://i.ibb.co/d5XJtC4/https-beta-forum-elvenar-com-index-php-attachments-1661150685849-png-10279.png[/IMG]"}, {"159": "The amount of seeds needed is staggering. And mana, if you don't have the portal instants needed (and we need really a lot if the pattern for the first researches is maintained)."}, {"101": "I want to tell people on my live worlds what they should be looking forward to in Chapter 20.[BR]1 - Increased Main Hall capacity[BR]2 - Heavy Melee unit upgrades[BR]What else do you see as significant?"}, {"34": "Surprised to see that some quests of the new chapter are still under construction ... [smilie--sprite2][BR][BR]Was just done with the quests related to T9 manufactories / boost [BR]and expected to get a series of quests about the ensemble buildings.[BR][BR]I guess I will have to wait a little bit [smilie--sprite1][BR]or may be there is no other quest until the very end of the chapter ... but I doubt it. [BR][BR][IMG]https://i.ibb.co/grmzCm7/https-beta-forum-elvenar-com-index-php-attachments-1661175678212-png-10282.png[/IMG]"}, {"88": "Does anyone has information about the production rate of the settlement buildings per level please (violin, drum and flute maker & ensemble)?"}]