[{"160": "Thank you for your answer."}, {"161": "pilousd said:\t\t\tSurprised to see that some quests of the new chapter are still under construction ... [smilie--sprite2][BR][BR]Was just done with the quests related to T9 manufactories / boost[BR]and expected to get a series of quests about the ensemble buildings.[BR][BR]I guess I will have to wait a little bit [smilie--sprite1][BR]or may be there is no other quest until the very end of the chapter ... but I doubt it.[BR][BR]View attachment 10282Click to expand...I'm stuck on the quest to reach 150% bonus culture.  I have removed culture to go down to 100% culture, then went back to 150% culture.  Not working for me, any suggestions?"}, {"144": "Solace Seeker said:\t\t\tI'm stuck on the quest to reach 150% bonus culture.  I have removed culture to go down to 100% culture, then went back to 150% culture.  Not working for me, any suggestions?\t\tClick to expand...Hi @Solace Seeker [BR]Please contact Support, if you haven't done so already, so we can look into this for you. Thanks! [smilie--sprite1]"}, {"98": "Does anyone have how the settlement of the portal and its set would look like? Approximately how many squares could it occupy? any spoilers or help to make the chapter as optimal as possible? on the Spanish server it arrives on September 1, two days! Please help! Thank you!"}, {"73": "@LOKINHO you can try to make a setup for your self.[BR]Elven architect works with the chapter 20 buildings but you need to click on the flag in the upper right corner and select beta first before you are able to.[BR][BR]I can manage to do it in an area of 5x5/5x6 city expansions.[BR]But I have made the decision to put down 4x any of the 3 maker buildings, store 3 of them and make the final upgrade (6 of every ensemble) and sell some of the ensemble buildings as soon as my portal is at max level, so I can bring back the maker buildings.[BR]But if I have all the violins, flutes and drums I need for the rest of the chapter or am very close to it, I will shred what ever I have still im bij inventory."}, {"74": "Bor de Wolf 1965 said:@LOKINHO you can try to make a setup for your self.[BR]Elven architect works with the chapter 20 buildings but you need to click on the flag in the upper right corner and select beta first before you are able to.[BR][BR]I can manage to do it in an area of 5x5/5x6 city expansions.[BR]But I have made the decision to put down 4x any of the 3 maker buildings, store 3 of them and make the final upgrade (6 of every ensemble) and sell some of the ensemble buildings as soon as my portal is at max level, so I can bring back the maker buildings.[BR]But if I have all the violins, flutes and drums I need for the rest of the chapter or am very close to it, I will shred what ever I have still im bij inventory.\t\tClick to expand...Are you sure that you need 6 of every ensemble to be available at the same time? It seems that 6 is the total, but 3 is the maximum at the same time."}, {"9": "Wiki says:[BR]lv2 1-1-1[BR]lv3 2-2-2[BR]lv4 3-3-3[BR]Now we just need to know if this is cummulative (6+6+6) or not (3+3+3).[BR]If we need 3+3+3, then it's total 219 squares (8,76 expansions).[BR]If we need 6+6+6, then it's total 438 squares (17,52 expansions).[BR]I personaly think that it should be 3+3+3, otherwise whole settlement would just be crazy big (apart from Ensembles we still need makers)."}, {"5": "Lovec Krys said:\t\t\tWiki says:[BR]lv2 1-1-1[BR]lv3 2-2-2[BR]lv4 3-3-3[BR]Now we just need to know if this is cummulative (6+6+6) or not (3+3+3).[BR]If we need 3+3+3, then it's total 219 squares (8,76 expansions).[BR]If we need 6+6+6, then it's total 438 squares (17,52 expansions).[BR]I personaly think that it should be 3+3+3, otherwise whole settlement would just be crazy big (apart from Ensembles we still need makers).\t\tClick to expand...[BR]There is a post earlier in this thread from a CM or similar person who said they are cumulative."}, {"74": "Enevhar Aldarion said:\t\t\tThere is a post earlier in this thread from a CM or similar person who said they are cumulative.\t\tClick to expand...If you mean post #73, I don't understand that they are to be present at the same time since the old ones don't count.[BR]@Kersepitje, can you clarify, please [smilie--sprite1]"}, {"16": "Spoiler: game files\t\tJSON:\t  \"requirements\": {    \"__class__\": \"CityEntityRequirementsVO\",    \"resources\": {      \"__class__\": \"CityResourceVO\",      \"resources\": {        \"__class__\": \"Dictionary\",        \"mana\": 3300000,        \"ch20_songs\": 20,        \"ch20_melody\": 6,        \"ch20_accompaniment\": 6,        \"ch20_rhythm\": 6      }    },"}, {"26": "spennyit said:\t\t\tIf you mean post #73, I don't understand that they are to be present at the same time since the old ones don't count.[BR]@Kersepitje, can you clarify, please [smilie--sprite1]Click to expand...not sure how I can clarify, if I would just repeat what I said there [smilie--sprite1]"}, {"9": "@Karvest Thx. Teleports in stand by mode."}, {"73": "As Kersepitje told us before, you need 6 of every ensemble to upgrade your portal to level 4.[BR]As I said, just before I will have 4 of every maker and only during the final upgrade I put them in my inventory, place the extra needed ensembles, upgrade the portal and remove some of the ensembles to have room again for the makers.[BR]That way I can keep the needed space for the guest people down.[BR][BR]Second thing you could do is calculate how many violins, flutes and drums you need for the entire chapter.[BR]Focus on making them at the beginning of the chapter and then remove them. [BR]I believe you could upgrade the portal to level 2 and 3 before you get out of room. That way you will have some use of the portal boost as well."}, {"9": "Bor de Wolf 1965 said:\t\t\tSecond thing you could do is calculate how many violins, flutes and drums you need for the entire chapter.[BR]Focus on making them at the beginning of the chapter and then remove them.\t\tClick to expand...By my opinion it is better to upgrade portal and then make the instruments for the rest of the chapter.[BR]Making instruments with portal lv1 for whole chapter might be problematic even for players with large stock of PPs.[BR][BR]I certainly am planning to first research only all i need to upgrade portal, then focus on portal upgrade and then go back to research."}, {"74": "Kersepitje said:\t\t\tnot sure how I can clarify, if I would just repeat what I said there [smilie--sprite1]Click to expand...Please, clarify if 6 ensembles per type should be at the same time in the village or if they can be sold when used. For example, to upgrade portal at lv 2 you need 1 ensemble per type and then they are considered used and cannot be used again to uprade portal at lv 3: can they be sold?"}, {"16": "You need all of them at the moment you press upgrade to lvl4."}, {"26": "spennyit said:\t\t\tPlease, clarify if 6 ensembles per type should be at the same time in the village or if they can be sold when used. For example, to upgrade portal at lv 2 you need 1 ensemble per type and then they are considered used and cannot be used again to uprade portal at lv 3: can the be sold?\t\tClick to expand...Kersepitje said:\t\t\tlet me correct you on this (and probably dissapoint you), for upgrade of portal from level 1 to 2, you need 1 of every ensemble available, this is correct.[BR]to upgrade portal from level 2 to 3, you need 2 of each ensemble available, but you used up the first ones for the upgrade to level 2.[BR]In other words, you need a total 3 of each ensemble for level 3.[BR]and finally, to upgrade from level 3 to 4 you need another 3 available of each. so in total you need 6 of each.\t\tClick to expand...[BR]well you can always sell something after you used it, but that doesn't mean it will help you in the end, why consider selling it after upgrade? if you would just have to rebuild it anyway if you want to upgrade further? Once you have max level portal, then it makes sense, but not before?[BR][BR]my statement remains the same: if you want to upgrade your portal from level 2 to 3 you will need 2 of each ensemble available. so in total 3 since the first one is used up for portal level 2."}, {"74": "Kersepitje said:\t\t\twell you can always sell something after you used it, but that doesn't mean it will help you in the end, why consider selling it after upgrade? if you would just have to rebuild it anyway if you want to upgrade further? Once you have max level portal, then it makes sense, but not before?[BR][BR]my statement remains the same: if you want to upgrade your portal from level 2 to 3 you will need 2 of each ensemble available. so in total 3 since the first one is used up for portal level 2.\t\tClick to expand...And this continues to be unclear and in contraddiction with the sentence \"cannot be used to uprade to lv 3\". Let's try another question: I have 3 ensebles and uprade portal to lv 2. I sell the 3 ensebles: does the portal stay at lv 2? Then I build 2 ensembles per type and uprade portal to lv 3 and then sell the ensemble. what happens?"}, {"16": "You won't be able to upgrade to lvl3 having only 2 ensembles per type.[BR]It works the same way as upgrading main hall, it has some tiny amount of additional pop required, but if you sell your residences and go to negative pop, it won't be enough to rebuild residences for just what it asks for upgrade, you need to get out of negative pop first."}, {"26": "spennyit said:\t\t\tAnd this continues to be unclear and in contraddiction with the sentence \"cannot be used to uprade to lv 3\". Let's try another question: I have 3 ensebles and uprade portal to lv 2. I sell the 3 ensebles: does the portal stay at lv 2? Then I build 2 ensembles per type and uprade portal to lv 3 and then sell the ensemble. what happens?\t\tClick to expand...then you are still 1 available ensemble short to be able to upgrade to level 3. why would you expect anything different?[BR][BR]Say you are a family of 4 and you have a car (portal level 1), your social status upgrades when you have an extra car, and its one max status when all of your family members have a car. So you buy a car for your wife, your social status upgrades, but then you sell the wifes car, and buy 2 cars for your kids. You wouldnt be on the highest social status then, even tought you bought a car for everyone at some point in time."}]