[{"74": "Karvest said:\t\t\tYou won't be able to upgrade to lvl3 having only 2 ensembles per type.[BR]It works the same way as upgrading main hall, it has some tiny amount of additional pop required, but if you sell your residences and go to negative pop, it won't be enough to rebuild residences for just what it asks for upgrade, you need to get out of negative pop first.\t\tClick to expand...This is not what it is written in the wiki.[BR]Note: Requirements are not stackable, this means that when you use the Requirements to upgrade the Harmony Grove, they \"get lost\" and you have to build more Requirements Buildings to continue upgrading your Harmony Grove![BR]As for the Main Hall, I don't need residences, I need population ;-)"}, {"74": "Kersepitje said:\t\t\tthen you are still 1 available ensemble short to be able to upgrade to level 3. why would you expect anything different?[BR][BR]Say you are a family of 4 and you have a car (portal level 1), your social status upgrades when you have an extra car, and its one max status when all of your family members have a car. So you buy a car for your wife, your social status upgrades, but then you sell the wifes car, and buy 2 cars for your kids. You wouldnt be on the highest social status then, even tought you bought a car for everyone at some point in time.\t\tClick to expand...This is not what it is written in the wiki[BR]Note: Requirements are not stackable, this means that when you use the Requirements to upgrade the Harmony Grove, they \"get lost\" and you have to build more Requirements Buildings to continue upgrading your Harmony Grove![BR]Nowhere it says that you should \"save\" the previous ones: if they are \"lost\", they don't need to be in the village[BR]LevelRequirementsCostsBenefits[BR]Capacity[BR]Production[BR]4hPortal Production Boost15x548:00h2000K----1500100%--326x660:00h2400K111-3000120%1150%437x772:00h2800K222106000140%1200%448x884:00h3300K3332010000140%1250%5"}, {"73": "spennyit said:LevelRequirementsCostsBenefits[BR]Capacity[BR]Production[BR]4hPortal Production Boost15x548:00h2000K----1500100%--326x660:00h2400K111-3000120%1150%437x772:00h2800Kprevious level+2previous level+2previous level+2106000140%1200%448x884:00h3300Kprevious level+3previous level+3previous level+32010000140%1250%5Click to expand...it could be so easy to change the wiki to this.[BR]now it wil be clear.[BR]you want to go level 1 -> level 2 : you need 1 of every ensemble[BR]you want to go level 2 -> level 3 : you need level 2 + 2 of every ensemble[BR]you want to go level 3 -> level 4 : you need level 3 + 3 of every ensemble"}, {"74": "Bor de Wolf 1965 said:\t\t\tit could be so easy to change the wiki to this.[BR]now it wil be clear.[BR]you want to go level 1 -> level 2 : you need 1 of every ensemble[BR]you want to go level 2 -> level 3 : you need level 2 + 2 of every ensemble[BR]you want to go level 3 -> level 4 : you need level 3 + 3 of every ensemble\t\tClick to expand...I would change the wiki as: Note: Requirements are not stackable, this means that when you use the Requirements to upgrade the Harmony Grove, they \"get lost\", but to continue upgrading your Harmony Grove you should still have them in the village and you have to build more Requirements Buildings !"}, {"16": "spennyit said:\t\t\tAs for the Main Hall, I don't need residences, I need population ;-)\t\tClick to expand...For ch20 portal you don't need ensembles, you need melodies/accompaniments/rhythms they give, same as pop/culture for main hall."}, {"74": "Karvest said:\t\t\tFor ch20 portal you don't need ensembles, you need melodies/accompaniments/rhythms they give, same as pop/culture for main hall.\t\tClick to expand...Right Karvest, as in the table you need 1 for level 2, 2  for level 3 and 3 fo level 4. When they get lost and you sell/put in the inventory them, the portal should decrease level or the wiki should say that they should be in the village to further upgrade the portal [smilie--sprite1] I am just saying that the wiki is unclear/incomplete [smilie--sprite1]"}, {"16": "You can see the same issue for main hall in wiki, it shows only additional pop in requirements, not full pop needed.[BR][BR]I guess when you upgrade to lvl2, you'll see 0 here again:[IMG]https://i.ibb.co/q1n9yNJ/https-beta-forum-elvenar-com-index-php-attachments-1661871206001-png-10297.png[/IMG][BR]If you sell some - you will see \"-1\", so it would be clear that you need more ensembles for further upgrades."}, {"73": "I agree with @Karvest on all buildings, the wiki only tells you what you need extra.[BR]But the confusion was introduced by Inno when they started talking about the ensemble buildings get lost.[BR]Remove that part in the wiki and just say you need x violin, y flute and z drum ensembles in your town to upgrade the portal.[BR][BR]Keep in mind, there will always be people that if they can read something wrong, they will read it wrong.[BR]And the wiki should not leave any room for discussion open about these things."}, {"74": "Karvest said:\t\t\tYou can see the same issue for main hall in wiki, it shows only additional pop in requirements, not full pop needed.[BR][BR]I guess when you upgrade to lvl2, you'll see 0 here again:View attachment 10297[BR]If you sell some - you will see \"-1\", so it would be clear that you need more ensembles for further upgrades.\t\tClick to expand...It could be interesting (with a lv 2 portal) to see what happens if you put 1 enseble in the inventory (can you use the teleport spell on them?) and then you reinstall it"}, {"9": "I think that it would be best then to update wiki with a note for portal upgrades:[BR](you will need 1 of each ensemble in your city to upgrade portal to lv2, add another 2 of each for lv 3 (so 3 in total) and another 3 of each for lv4 (so 6 of each ensembles total for lv 4)[BR]Otherwise there will always be confused players."}, {"64": "If I got it right now:[BR][BR]I always have to have the old \"used\" ensembles and the new builded ones together for an upgrade? Am I able to teleport the \"used\" ensembles as long as I cannot upgrade the Portal due to missing other things? So, als Bor said? And when I am able to upgrade I have to teleport i.e. manufacturing Buildings or else, bring back my used ensembles, upgrade my Portal and then throw away all these ensembles?[BR][BR]So I dont run out of space?"}, {"26": "I'm not sure why you all try to keep negotiating the facts. Let me repeat one last time, since its fairly simple and other players keep repeating it as well.[BR][BR]To have a portal level 1 you need no ensembles (of course)[BR]to upgrade to level 2 you need to have one of each ensemble.[BR]to upgrade to level 3 you need to have 3 of each ensemble.[BR]to upgrade to level 4 you need to have 6 of each ensemble.[BR][BR]This is just like the Amuni chapter, except the prestige is now split into the 3 different ensemble types."}, {"73": "You are correct @Kersepitje but Inno it self is introducing the confusion.[BR]Note: Requirements are not stackable, this means that when you use the Requirements to upgrade the Harmony Grove, they \"get lost\" and you have to build more Requirements Buildings to continue upgrading your Harmony Grove!\t\tClick to expand...Replace the wiki part with this so it would be clear to everyone else.[BR]Note: Requirements are not stackable, which means that when using the Requirements to upgrade the Harmony Grove, you will need to build the additional required Requirements buildings to continue upgrading your Harmony Grove!\t\tClick to expand...That is a simple way to correct the confusion.[BR]Think about it and talk it over with other CMs and DEVs.[BR][BR]Keep in mind you are talking about 2 different things that for the none English players looks the same[BR]Requirements and Requirements Buildings"}, {"5": "I think helya, the CM on the US forum, is also in charge of making sure the wiki is up to date, so once the chapter is on Live everywhere tomorrow, we can bring it to her attention there as well."}, {"152": "Kersepitje said:\t\t\tI'm not sure why you all try to keep negotiating the facts. Let me repeat one last time, since its fairly simple and other players keep repeating it as well.[BR][BR]To have a portal level 1 you need no ensembles (of course)[BR]to upgrade to level 2 you need to have one of each ensemble.[BR]to upgrade to level 3 you need to have 3 of each ensemble.[BR]to upgrade to level 4 you need to have 6 of each ensemble.[BR][BR]This is just like the Amuni chapter, except the prestige is now split into the 3 different ensemble types.\t\tClick to expand...@Kersepitje For me, the confusion is that you and the wiki are using very different ways of explaining it.  The wiki says you don't need any ensembles -- just melody, harmony, and rhythm.  You get these from building the ensembles.[BR][BR]For me, the concrete questions are:[BR]1) Does upgrading consume melody, harmony, and rhythm?[BR]2) Does upgrading delete the building?[BR]3) Does deleting the building cause you to lose melody/harmony/rhythm?[BR][BR]To me, what the wiki seems to be saying is:[BR]1) Yes[BR]2) No[BR]3) No (not like Amuni, but more like how deleting towers in Revenge of the Exile gave you white and black matter)[BR][BR]To me, it sounds like you are saying:[BR]1) Yes[BR]2) Yes?[BR]3) Yes (like Amuni)[BR][BR]I'm not sure how 1) Yes 2) No and 3) Yes would work.  What if you deleted an ensemble after upgrading and the melody was consumed?"}, {"14": "ekarat said:\t\t\tFor me, the concrete questions are:[BR]1) Does upgrading consume melody, harmony, and rhythm?[BR]2) Does upgrading delete the building?[BR]3) Does deleting the building cause you to lose melody/harmony/rhythm?\t\tClick to expand...1) yes[BR]2) no[BR]2) yes[BR]1) As @Karvest already said, you just need the resources that these buildings produce to upgrade the Harmony Grove. [BR]3) f you have already upgraded it and you sell/store with teleports some ensembles, nothing happens because those resources were \"consumed\" while upgrading.[BR]If you have a level 3 Harmony Grove you have \"consumed\" 4 melody+harmony+rhythm; if you delete/store some ensembles, to upgrade it to level 4 you'll have to rebuilt until all 6 resourses (and producing buildings in consequence) are still present in your city at the same time."}, {"74": "Kersepitje said:\t\t\tI'm not sure why you all try to keep negotiating the facts. Let me repeat one last time, since its fairly simple and other players keep repeating it as well.[BR][BR]To have a portal level 1 you need no ensembles (of course)[BR]to upgrade to level 2 you need to have one of each ensemble.[BR]to upgrade to level 3 you need to have 3 of each ensemble.[BR]to upgrade to level 4 you need to have 6 of each ensemble.[BR][BR]This is just like the Amuni chapter, except the prestige is now split into the 3 different ensemble types.\t\tClick to expand...It is really simple: what you say is NOT what is written in the wiki!!!! Either you are wrong or the wiki is wrong ;-)[BR]You can change the wiki:[BR]\"Note: Requirements are not stackable, this means that when you use the Requirements to upgrade the Harmony Grove, they \"get USED\" and you have to build more Requirements Buildings to continue upgrading your Harmony Grove!\"[BR]where USED can be explained as: they are needed for next upgrade, but do not count towards new upgrading requirements.[BR]\"lost\" is really ... confusing at a bare minimum [smilie--sprite1][BR]It is still not clear if you can temporarily teleport 1 or more ensembles and then deploy them again before next uprade."}, {"152": "PrimroseSylvia said:\t\t\t1) yes[BR]2) no[BR]2) yes[BR]1) As @Karvest already said, you just need the resources that these buildings produce to upgrade the Harmony Grove.[BR]3) f you have already upgraded it and you sell/store with teleports some ensembles, nothing happens because those resources were \"consumed\" while upgrading.[BR]If you have a level 3 Harmony Grove you have \"consumed\" 4 melody+harmony+rhythm; if you delete/store some ensembles, to upgrade it to level 4 you'll have to rebuilt until all 6 resourses (and producing buildings in consequence) are still present in your city at the same time.\t\tClick to expand...Can you please edit your response slightly?  You have both no and yes to #2.[BR]If I had to guess, I would guess you mean 1) yes 2) no 3) yes, which is the combination that makes no sense to me.[BR][BR]I'll give this another stab.[BR]Is it the following accurate?[BR]\"Melody/Harmony/Rhythm is the number of the relevant ensemble buildings currently in your city minus the amounts already required by your current portal level, with a display minimum of 0.\"  (By \"display minimum\" I mean the maximum of 0 and x, where x is the formula mentioned.)[BR][BR]That is, if you delete ensembles that were already required, you will effectively have negative melody/harmony/rhythm, though it might still display as 0?  That is, your melody/harmony/rhythm will be stuck displaying at zero and the next few you build will not increase anything.[BR](I really find it easier to think of it as being negative in that case, even if the screen technically says 0, because you will have a debt that has to be paid back before it increases again.  That is what I mean by effectively negative.)"}, {"144": "Hi everyone![BR][BR]Please be respectful towards each player and our moderators. Respectful communication and constructive feedback are key to helping improve and gain clarification with Beta’s new features. [smilie--sprite1][BR][BR]As Kersepitje says, there is a specific number of Ensembles you will need to place in your town. Their Resources are needed to be able to upgrade the Harmony Grove portal. (Requirement Resources being: Rhythm, Accompaniment and Melody)[BR][BR]Regarding the Wiki site, for some clarification, when it says, “Note: Requirements are not stackable, this means that when you use the Requirements to upgrade the Harmony Grove, they \"get lost\" and you have to build more Requirements Buildings to continue upgrading your Harmony Grove!”, where it is saying the Requirements (Rhythm, Melody and Accompaniment) “get lost”, it is not saying that the Ensemble building is now useless. It is saying that those Resources in the Ensemble building have been used for the current portal upgrade.[BR]Once those Required Resources have been used for a Harmony Grove portal upgrade, the Ensemble buildings themselves will still need to be in your town, as they are now basically a part (extension) of the upgrade to your portal.[BR][BR]Should you teleport or sell these used Ensembles, you will need to build/place them back into your town to upgrade your Harmony Grove further.[BR][BR]The Wiki also says that Requirement buildings can be sold and rebuilt. This is a true statement in and of itself. It is not saying to sell your Ensembles. It is stating that should you choose to sell them for any reason, you can rebuild again, at any time.[BR]You will need to use Ascended Goods and other resources to build your Ensemble settlement buildings, so keep this in mind when planning out your layout for this chapter.[BR][BR]It is similar to the Amuni chapter with the Violin Maker, Flute Maker and Drum Maker buildings needing to be placed next to your Goods buildings. Added to that, it is also similar to the Constructs chapter’s settlement layout for your Violin Ensemble, Flute Ensemble and Drum Ensemble buildings connecting to your Harmony Grove portal. In this case, you will need to build all of the Ensembles and keep them after their resources have been used for each upgrade, up to a level 4.[BR][BR]Side Notes:[BR][BR]~If you remove any used Ensembles before your next portal upgrade, your Harmony Grove portal will subtract the building from your “Total:” (Rhythm, Accompaniment or Melody) and your “Available:” count in the Upgrade tab of your Harmony Grove overview (yes, it will show as -1, if applicable, etc.).[BR][BR]~You can see how many of each Melody, Accompaniment and Rhythm are needed for the next portal upgrade in the first tab of your Portal’s pop up window.[BR][BR]Hope this helps a bit more! Thanks for everyone’s feedback and please continue to do so! [smilie--sprite1] [smilie--sprite1] [smilie--sprite1]"}, {"152": "SyreArca said:\t\t\tHi everyone![BR][BR]Please be respectful towards each player and our moderators. Respectful communication and constructive feedback are key to helping improve and gain clarification with Beta’s new features. [smilie--sprite1][BR][BR]As Kersepitje says, there is a specific number of Ensembles you will need to place in your town. Their Resources are needed to be able to upgrade the Harmony Grove portal. (Requirement Resources being: Rhythm, Accompaniment and Melody)[BR][BR]Regarding the Wiki site, for some clarification, when it says, “Note: Requirements are not stackable, this means that when you use the Requirements to upgrade the Harmony Grove, they \"get lost\" and you have to build more Requirements Buildings to continue upgrading your Harmony Grove!”, where it is saying the Requirements (Rhythm, Melody and Accompaniment) “get lost”, it is not saying that the Ensemble building is now useless. It is saying that those Resource in the Ensemble building have been used for the current portal upgrade.[BR]Once those Required Resources have been used for a Harmony Grove portal upgrade, the Ensemble buildings themselves will still need to be in your town, as they are now basically a part (extension) of the upgrade to your portal.[BR][BR]Should you teleport or sell these used Ensembles, you will need to build/place them back into your town to upgrade your Harmony Grove further.[BR][BR]The Wiki also says that Requirement buildings can be sold and rebuilt. This is a true statement in and of itself. It is not saying to sell your Ensembles. It is stating that should you choose to sell them for any reason, you can rebuild again, at any time.[BR]You will need to use Ascended Goods and other resources to build your Ensemble settlement buildings, so keep this in mind when planning out your layout for this chapter.[BR][BR]It is similar to the Amuni chapter with the Violin Maker, Flute Maker and Drum Maker buildings needing to be placed next to your Goods buildings. Added to that, it is also similar to the Constructs chapter’s settlement layout for your Violin Ensemble, Flute Ensemble and Drum Ensemble buildings connecting to your Harmony Grove portal. In this case, you will need to build all of the Ensembles and keep them after their resources have been used for each upgrade, up to a level 4.[BR][BR]Side Notes:[BR][BR]~If you remove any used Ensembles before your next portal upgrade, your Harmony Grove portal will subtract the building from your “Total:” (Rhythm, Accompaniment or Melody) and your “Available:” count in the Upgrade tab of your Harmony Grove overview (yes, it will show as -1, if applicable, etc.).[BR][BR]~You can see how many of each Melody, Accompaniment and Rhythm are needed for the next portal upgrade in the first tab of your Portal’s pop up window.[BR][BR]Hope this helps a bit more! Thanks for everyone’s feedback and please continue to do so! [smilie--sprite1] [smilie--sprite1] [smilie--sprite1]Click to expand...Thank you for the clear reply.[BR][BR]I am now thinking of melody/harmony/rhythm as similar to available culture or available population, which is the total amount minus the required amount.  And thank you for clarifying that it can go negative!"}]