[{"74": "@SyreArca , still the wiki is \"unclear\" and will create a lot of problems to players not participating to this forum. If you are happy with that ...[BR]BTW, \"get lost\" does NOT mean \"get used\" ;-)"}, {"73": "I have a request about some information from the Wiki.[BR]Is the portal boost at level 4 correct?[BR]I would believe it should be 160% as it always has been.[BR]15x548:00h2000K----1500100%--326x660:00h2400K111-3000120%1150%437x772:00h2800K222106000140%1200%448x884:00h3300K3332010000140%1250%5"}, {"16": "it's 140% in game files as well"}, {"73": "This could be considered as a bug.[BR]In every chapter we have played the portal goes from level 1=100% to level 2=120% to level 3=140% and level 4=160%[BR]even in chapter 19 you could say portal boost was 160%, but 1,6*0=0[BR]As far as I can see, there is no reason for not having max portal boost at level 4 = 160%"}, {"26": "Bor de Wolf 1965 said:\t\t\tThis could be considered as a bug.[BR]In every chapter we have played the portal goes from level 1=100% to level 2=120% to level 3=140% and level 4=160%[BR]even in chapter 19 you could say portal boost was 160%, but 1,6*0=0[BR]As far as I can see, there is no reason for not having max portal boost at level 4 = 160%\t\tClick to expand...well I wouldn't consider this a bug at all. But its very valid feedback though [smilie--sprite1]"}, {"82": "@SyreArca @Kersepitje : In English, if something can \"get lost\", the immediate common-sense understanding is that it is lost by someone or something (which is often themselves - e.g. \"I went to London and got lost in Mayfair\" - we don't say \"I lost myself\", as would be said in French, for example) with the strong implication that the thing in question can/could be found again. This grammatical construction refers almost always to physical entities [which in Elvenar = buildings]. The Wiki states that some things \"get lost\", but (?) appears to actually mean that those things \"are lost\" - and this grammatical construction [adjective] means that the thing or things have become permanently lost and therefore may never be found again.[BR][BR]A common way to say, for example, that someone has died is to say that they \"are lost\" - never that they \"got lost\". There is a major difference.[BR][BR]Or in other words : in English, to \"get lost\" means that \"being found again\" is the immediate assumption. To \"be lost\" means \"permanently gone\".[BR][BR]Grammatically speaking - the diffference is that one version uses an adjective (the thing [itself] has become lost - its inherent status is now \"that of having been lost\") and the other uses the object form of a verb (the thing was lost [by someone or something else] and may be found again).[BR][BR]In English, the verb \"to lose\" is very complex, with several different meanings and constructions, and best avoided if certainty of meaning is not ensured. Alternatively, using \"consumed\" instead of \"lost\" has ONE meaning and would be readily understood - if that is the intended Wiki meaning?[BR][BR]Perhaps this helps?"}, {"144": "Thanks for the valuable feedback regarding the Wiki site's wording for the Ensemble buildings. We appreciate your thoughts![BR]We are in no way dismissing your concerns, rather giving some clarification, for the time being. [smilie--sprite1] [BR]Please always feel free to share your constructive concerns and feedback. [BR]It takes the whole community to make our beloved Elvenar successful! "}, {"74": "As a constructive feedback: https://www.merriam-webster.com/dictionary/get lost[BR]Yes, for me English is not the main language, as probably for the majority of the players in beta.[BR]Why don't you want to substitute \"get lost\" with \"get used\" as this can help in not confusing players?[BR]I cannot imagine which will be the translation in other languages (as wiki is not available)"}, {"82": "spennyit said:\t\t\tAs a constructive feedback: https://www.merriam-webster.com/dictionary/get lostClick to expand...This is a further complication of using \"get lost\"... and in Britain at least, it's a very common phrase indeed.[BR][BR]spennyit said:\t\t\tWhy don't you want to substitute \"get lost\" with \"get used\" as this can help in not confusing players?\t\tClick to expand...[my bold emphasis] That's what I also don't understand. There are at least two common, easy, and clearer options - why prefer to use \"get lost\"...?[BR][BR]spennyit said:\t\t\tI cannot imagine which will be the translation in other languages (as wiki is not available)\t\tClick to expand...... Another good point. Does Inno use in-house staff [who are employed primarily to do something else] for translation purposes, or dedicated [in-house or external] translators? I'm asking because most professional translators [of English] would just avoid using the term \"lost\" completely in this situation, for the sake of precision and clarity, and would instead opt for \"used\", \"consumed\", or a similar equally common term instead."}, {"159": "Anyone knows what this treant ballad is? Is it only accessible with a lvl3 portal?[BR][BR][IMG]https://i.ibb.co/YfnnJby/https-beta-forum-elvenar-com-index-php-attachments-screenshot-at-sep-05-21-42-17-png-10308.png[/IMG]"}, {"16": "Treant Ballade is second production option starting from lvl2 portal."}, {"159": "Karvest said:\t\t\tTreant Ballade is second production option starting from lvl2 portal.\t\tClick to expand...Thanx, composing it now [smilie--sprite1]"}, {"162": "Where I Produce an Eternal Trade Agreement??"}, {"88": "RCR2018 said:\t\t\tWhere I Produce an Eternal Trade Agreement??\t\tClick to expand...In the Scrolls manufactory, ascendant good, 3h [BR][IMG]https://i.ibb.co/SX99LHx/https-beta-forum-elvenar-com-index-php-attachments-1662518324545-png-10310.png[/IMG]"}, {"162": "Angeduciel said:\t\t\tIn the Scrolls manufactory, ascendant good, 3h[BR]View attachment 10310Click to expand...Thank you very much!"}, {"9": "Ok, so i decided to waste my milion mana on a quest on beta server only to get to this:[BR][IMG]https://i.ibb.co/LvH4v3H/https-beta-forum-elvenar-com-index-php-attachments-1662902400502-png-10314.png[/IMG] [IMG]https://i.ibb.co/Rzvn8jd/https-beta-forum-elvenar-com-index-php-attachments-1662902376668-png-10313.png[/IMG][BR][BR]Which <autocensored very rude expression> wants me to use unboosted ascended option?[BR]I'm certainly not wasting mana on live just to get such a stupid quest."}, {"73": "On life I don't use mana for the portal, I use the portal profit instance so I don't care about that part and I don't waist unurium.[BR]Later on in the quest line you need to make 1x calma's karaf (marmer factory) and 1x a bubble bath (wood factory).[BR]You get some other quests to slow you down like collect 2,5 million mana.[BR]Or you are forced to build a cultural building you need to research.[BR]These things are done just to slow you down in time or resources."}, {"73": "And now to help others with some good tips.[BR]This chapter can be a disaster with mana, seeds and Unurium in mind. Mana can be controlled by not using it but using portal power instead.[BR]Also it is important to have your blooming traders gild wonder as high as possible, on life I have it at 28, so some of my calculations are based on that.[BR][BR]First the music sheets / notes: don't waist mana and unurium on them, use portal power instead. I use a simple formula for it.[BR]( MaxMusic - HaveMusic ) / MaxMusic * 100 = RoomLeft percentile[BR]I fill up the portal with increments of 5% until I get a waist. So I am always filled up between 95.01% and 100%[BR]This will be very useful when you have the instrument makers.[BR][BR]The instruments:[BR]I know this chapter needs 2068 violins, 2480 flutes and 1650 drums.[BR]If you have only 3 of every maker you can create them in just under 15 days if you only make the 3 hour productions back to back.[BR]Don't use the 9h productions for they only produce 2x the 3h production for a higher price.[BR]When you are making the instruments please hold for a moment with 363 violins, 555 flutes and 390 drums.[BR]This is the time to upgrade your portal for the first time so you get 20% bonus.[BR]now make 401 violins, 480 flutes and 320 drums and upgrade the portal again. (level 3)[BR]After this just keep producing the final instruments and stop when you have the final needed items.[BR]At this point you can store the makers or sell them and do the final portal upgrade.[BR]from this point on it is an easy walk to the finish line.[BR][BR]Keep in mind, portal 4 have no benefits for us with the portal boost in mind. It is limeted on 140% and nothing more."}, {"9": "Bor de Wolf 1965 said:\t\t\tThese things are done just to slow you down in time or resources.\t\tClick to expand...Yes, that's exactly why i never finish the quests.[BR][BR][BR]Bor de Wolf 1965 said:\t\t\tKeep in mind, portal 4 have no benefits for us with the portal boost in mind. It is limeted on 140% and nothing more.\t\tClick to expand...So do we actualy need to level up the portal to 4, or can we finish the chapter with lv 3?[BR][BR]Edit: Well, PP bonus. But if someone has realy extreme PP stock, maybe he can ignore lv 4?"}, {"16": "No, you need more than lvl3 capacity for last techs. But you can close this gap by Vortex of Storage."}]