[{"35": "Karvest said:\t\t\tNo, you need more than lvl3 capacity for last techs. But you can close this gap by Vortex of Storage.\t\tClick to expand...Ooh you make a very good point, I kinda assumed this couldnt be done since one tech would ask 10k bars, but the max that is being asked is 7500.[BR]So with 25% portal capacity (lvl 14 vortex) and only a lvl 3 portal, you could actually skip the upgrade of portal to lvl 4[BR]that could be a big timesaver and space saver if you do it this way."}, {"73": "I have just been informed at the Dutch forum, to make songs you also need a lot of violins, flutes and drums.[BR]I don't have those base numbers so I can't take that in to my calculations.[BR][BR]And what the Vortex can do for the last 2500 storage is only done when it is at level 19 and gives you 33,5% boost,[BR]2500 is only 33,333% of 7500 and not 25%[BR]But 58% bonus on basic sentient goods production is also nice to have then."}, {"30": "[IMG]https://i.ibb.co/XtSfL36/https-beta-forum-elvenar-com-index-php-attachments-1662928598093-png-10316.png[/IMG][BR][IMG]https://i.ibb.co/KW2VBwn/https-beta-forum-elvenar-com-index-php-attachments-1662928616278-png-10317.png[/IMG][BR][IMG]https://i.ibb.co/PGmMqpK/https-beta-forum-elvenar-com-index-php-attachments-1662928631852-png-10318.png[/IMG]"}, {"35": "Bor de Wolf 1965 said:\t\t\tI have just been informed at the Dutch forum, to make songs you also need a lot of violins, flutes and drums.[BR]I don't have those base numbers so I can't take that in to my calculations.[BR][BR]And what the Vortex can do for the last 2500 storage is only done when it is at level 19 and gives you 33,5% boost,[BR]2500 is only 33,333% of 7500 and not 25%[BR]But 58% bonus on basic sentient goods production is also nice to have then.\t\tClick to expand...6000 capacity + 25% is in my math, still 7500? not sure how you get to 33,5%"}, {"73": "Sorry, I switched 2 numbers.[BR]I had 10k portal max and needed for the 2 final techs in my head and thought portal 3 was at 7500[BR][BR]And Thank you @Brummbaer for the final numbers on the songs.[BR]I will try to put them in to my calculations as well"}, {"75": "Karvest said:\t\t\tNo, you need more than lvl3 capacity for last techs. But you can close this gap by Vortex of Storage.\t\tClick to expand...So basically we can skip building half of the ensembles, for the price of being stuck on quests until chapter 21 comes, and building that Vortex to level 14?"}, {"35": "Turbina said:\t\t\tSo basically we can skip building half of the ensembles, for the price of being stuck on quests until chapter 21 comes, and building that Vortex to level 14?\t\tClick to expand...yes [smilie--sprite1]"}, {"73": "Technically it is not a bug but it is an unwanted situation.[BR]Quest 38) Train 4.000 Vallorian guards.[BR]Player that don't have the Mercenary camp can't do that quest and can't skip it as well.[BR]This is an unwanted situation towards the pacifists among us.[BR]I hope Inno will make this quest shippable."}, {"5": "Turbina said:\t\t\tSo basically we can skip building half of the ensembles, for the price of being stuck on quests until chapter 21 comes, and building that Vortex to level 14?\t\tClick to expand...[BR]Since there are people who hate doing the quests, even on Beta, where they are supposed to be doing all this stuff for testing purposes, yes. Though why these people are even on Beta, if they are not going to do the work, I don't understand.[BR][BR]@Bor de Wolf 1965 craft and build some Vallorian Valor buildings. Or collect them from the event buildings that make them, as anyone in chapter 20 likely already has in their city, or in their inventory. One of the buildings in the Dwarven Citadel set makes them. With the full set, and that one building at chapter 20,  it will take 7 days to collect 4000, if it is your only source."}, {"73": "I just have been informed on the Dutch server were this question comes from: in update 1.160 there will be an option to donate the soldiers but you need to have 1 of the military soldiers making buildings.[BR]That way Pacifists can make the troupes and get ride of them is a way that works for them.[BR][BR]O, and if you are on that quest, just contact support to reset the quest so you get the option if you like."}, {"9": "[smilie--sprite8] That's a true pacifism - instead of fighting, they send their soldiers to slavery."}, {"43": "How many off each ensamble do I nead to upgrade harmony grove to lvl 4?"}, {"9": "@eltina 6 of each (1 for lv2, 3(1+2 additional) for lv3 and 6(3+3 additional) for lv4)."}, {"9": "Btw, merchant capacity is again far from enough.[BR]In case someone wonders why there is so much T9>T7 merchant offers in the market, these are two main reasons:[BR][BR]Low merchant capacity - With 1 T7-T9, players produce more goods than they can trade and max. 1/3 can be lucky enough to produce goods which are needed in the market.[BR][BR]Less needs of higher grades goods despite producing similar amount for all three of them. (just compare the production of T7 to T9 and price of Drum(173k T9) and Flute(380k T7)  Ensembles) [BR][BR]Then you have an option to trade 8k T7 for 8k T7 or 8k T9 for 18k T7 during the same period.[BR]Now anyone still wonder why there are so many T9>T7 offers? (especialy if both will not be taken during the 6 hours)."}, {"162": "Where I compose 1 Enar's Blues?"}, {"73": "you do that in the portal but it is 1 of the 3 specific songs you get when the portal is at level 2+"}, {"26": "RCR2018 said:\t\t\tWhere I compose 1 Enar's Blues?\t\tClick to expand...you can compose that in a lvl 4 portal. Its the cheaper and faster song that you can make only when your portal is lvl 4"}, {"5": "The confusion over how many of each ensemble for each portal upgrade is growing on both the forums and the Facebook group. Is this information ever going to be clarified either in-game or on the Wiki page? Everything still reads as needing per ensemble of one total for level 2, two total for level 3, and three total for level 4. not 1 and 3 and 6 per ensemble."}, {"9": "Should be clarified on wiki, everyone who reads forum has it clear now."}, {"159": "I have the portal at level 4 both in beta and live and needed 6 each ensemble for the upgrade."}]