[{"163": "palmira, can you start to sell the ensembles as soon as you have upgraded the portal to lvl4? Thank you."}, {"26": "Krita said:palmira, can you start to sell the ensembles as soon as you have upgraded the portal to lvl4? Thank you.Click to expand...of course you can"}, {"73": "I can understand why people get confused on the amount of ensembles you need for every upgrade.[BR]I had a very slow refresh bug on life.[BR]I got my Portal to level 2 and it showed that I only needed 1 of the 3 ensembles more until it corrected it self after about 15 to 24 hours.[BR]Now it shows me I need 2 of every ensemble."}, {"32": "I don't understand why some quests are non-declinable. [BR]For example, there is one asking to have 12 Ensembles. If I have to build 18 anyway if I want to upgrade the Grove (and I have to, not much about wanting or not) why such a quest is non-declinable???? [BR]In my live city this stupid quest came too late, I already had 18 Ensembles and upgraded the Grove and of course, I sold them all. Now I find myself stuck in the story line quests because no way in hell I'm going to build all Ensembles again. It pisses me off because I actually like to complete those quests and now I have to wait for ch.21 to decline the rest of them???? .... like 2023????"}, {"73": "I understand @Alcaro but having all 18 ensambles to just do the final upgrade for the final development is not needed.[BR]If you have an Vortex of storage at level 14+ you can do all the developments without a portal level 4.[BR]I think that is the only reason why they don't want you to skip quests until you are 100% sure out of that chapter and in to the next one."}, {"9": "@Alcaro Bacause you are supposed to do exactly as quests tell you, not doing it in much more efficient way as many experienced players do.[BR]You will always be welcomed in the group \"We don't bother with the storyline quests, let's decline them in next chapter\" (i myself  have been a member since the Wood Elves chapter)."}, {"5": "Lovec Krys said:@Alcaro Bacause you are supposed to do exactly as quests tell you, not doing it in much more efficient way as many experienced players do.[BR]You will always be welcomed in the group \"We don't bother with the storyline quests, let's decline them in next chapter\" (i myself  have been a member since the Wood Elves chapter).\t\tClick to expand...[BR]That is fine for the Live servers, but doing that on Beta sort of makes your Beta city pointless, if you are not testing everything for bugs."}, {"9": "@Enevhar Aldarion That would be true for true beta server, but this is Elvenar beta - pre release server. It's primary purpose is obviously not testing everything for bugs, otherwise it would be a completely different server."}, {"32": "I still believe that that quests can be changed or added a second option. Since 12 Ensembles are needed for upgrading the Grove to lvl.3, that quest could be like < Build 12 Ensembles OR  Have The Grove at level 3 >[BR][BR][IMG]https://i.ibb.co/1QNsQCY/https-beta-forum-elvenar-com-index-php-attachments-ch-20-12-ensembles-jpg-10363.jpg[/IMG]"}, {"73": "You need 3 ensembles to get the portal to level 2.[BR]You need 9 ensembles to get the portal to level 3[BR]And only if you don't have the Vortex of storage at level 14+ you need 18 ensembles to get the portal on level 4 to finish all the researches and be able to do all the quests."}, {"35": "Alcaro said:\t\t\tI still believe that that quests can be changed or added a second option. Since 12 Ensembles are needed for upgrading the Grove to lvl.3, that quest could be like < Build 12 Ensembles OR  Have The Grove at level 3 >[BR][BR]View attachment 10363Click to expand...every quest could then be changed then, no? for example id rather have the marble manuf requirement replaced by any factory. But if you generalise every quest, you just end up with 20 times the same quest?[BR][BR]To be honest the questlist has been put up on fanwebsites from almost day 1, you should prepare for quests like this instead of complaining afterwards.[BR][BR]The quests are pretty much the only thing that are hard in this chapter. And you can just skip them when next chapter comes, if you don't feel like it."}, {"73": "I knew this quest was coming and I don't have a vortex level 14+ so I need the 18 ensembles on my life account.[BR]Unfortunately I didn't keep an eye on my orcses and did to many wonder upgrades that demanded for them as well.[BR]Now I pay the prize to only be able to make 1 ensemble every 2 or 3 days.[BR]I was hoping to finish this chapter in about 2 to 3 weeks but now I will finish this close or in December."}, {"9": "Seeds are bigger issue than orcs for ensembles (unless you run on very low count of armories of course).[BR]But for weaker cities with low production of both seeds and orcs, ensembles can be an issue for quite a long time."}, {"32": "Heymrdiedier said:\t\t\tTo be honest the questlist has been put up on fanwebsites from almost day 1, you should prepare for quests like this instead of complaining afterwards.\t\tClick to expand...To be honest, I don't care what you think about my post. If I feel like complaining, I will do so.[BR]I said it before, I will say it again, I do not think it's OK to use any external program or site to be updated about news or things related to the game."}, {"73": "I am close to quests 81, 82 and 83 on my life account and I start wondering who came uk with these quests.[BR]All 3 involves the plank factory.[BR]If you have a Plank factory as your T1 you are screwed for you don't get any bonus production on these quests.[BR]If you have a plank factory as your T7 you are a little less screwed for you have 1 3h quest that needs Unurium.[BR]If you have a plank factory as your T4 you are lucky for you get a 9h and a 3h quest that needs seeds.[BR][BR]It would have been fair to all players if they asked something from the Marble, steel and wood factory that needs only seeds or unurium"}, {"101": "I recently got my Grove up to level 2 and things are going much better.[BR]I determined that there was no way that I was going to fit in 18 ensembles so I have abandoned trying to complete the chapter quests. First time I have done that. But the rewards for doing them are insignificant. I'd like the 200 diamonds but it is not worth it.[BR][BR]I have stopped working on research and and am focused on getting to level 3 on the grove. Once there things will go even faster and I will resume doing research. Each ensemble boosts my production of bars so I am not burning through Portal profits like I was.[BR][BR]The chapter is not proving to be too bad since I did have portal profits to use while getting to level 2. But the requirements to reach level 4 are just not something that I can do in a city without lots of premium expansions.[BR][BR]I am still resisting the temptation to put up the Vortex. When it came out I saw it as primarily a way to speed up chapters. Since they are now adding chapters more than 6 months apart I see no need to go faster. Why rush? So I can add more levels to wonders? [BR][BR]Not much else to do in this game anymore. Finish new chapter, sell guest race building, use space to reorganize and upgrade wonders."}, {"73": "You are lucky @Jaxom [BR]There are only 2 quests that give 100 diamonds each and you can do them when a new chapter starts[BR][BR]quest 78: Collect 150000 Unurium + Have at least 10 Residences Level 45 + Have at least 4 Workshops Level 45[BR]quest 87: Research the Scouts' Tavern[BR][BR]2 of the 3 requirements of quest 78 you will have finished by the time you start chapter 21 and for the 150k unurium, I think you only need +/- 2 days to collect them and that would be a bargain.[BR]And quest 87 you will have finished or else you can't start chapter 21"}, {"101": "Glad to hear that you think I will be able to pick up the diamonds![BR]I have never aborted the chapter quests before so it will be interesting to see what happens when Chapter 21 arrives and I am still sitting on quest 68 (12 ensembles). [BR][BR]Really wish they would offer Beta the 10% off on expansions. I have enough diamonds from Spire to get a couple. But that still would not let me add 9 more Ensembles. Ridiculous amount of space needed for this chapter."}, {"9": "Jaxom said:\t\t\tit will be interesting to see what happens when Chapter 21 arrives and I am still sitting on quest 68 (12 ensembles).\t\tClick to expand...The same way as we notorious decliners do.[BR]You will decline all quests you don't want (or can't) finish before hiting ch21 quests."}, {"73": "Looking at your town at his moment @Jaxom , there is only one way for you to get past the last 2  developments.[BR]make all the songs you need to do all the researches for the chapter plus the portal to level 3.make all the violins, flutes and drums after that to cover all the researches as well plus to make the right number of ensembles you need to get to portal level 3remove only at this point all your instrument makers.use elven architect to remodel your town so you will get the 12 ensembles in and also to get your portal to level 3 and the vortex of storage.upgrade your newly placed vortex of storage to level 14 or higher.only at this point you are able to get enough music notes with portal power spells to get the last 2 researches doneI would love to help you reshape your town so you would be able to get things done in a more relaxed way, but that means I would be playing your game and I don't want to do that."}]