[{"128": "Co říkáte na novou herní kapitolu Síla hudby? Co vás na ní zaujalo? Jste na ni zvědaví? Máte nějaká očekávání? Jaká?"}, {"16": "Jo, banda zhulených elfů zhulí orky a spolu uspořádají velký Woodstock [smilie--sprite8]"}, {"24": "Budovy, ktoré sa umiestňujú okolo portálu, sú v prvom rade nutné kvôli surovinám, ktoré sú potrebné na jeho vylepšovanie (fungujú podobne ako prestíž v amuni). Zároveň navyšujú produkciu taktov v portáli, no tieto sú nahraditeľné portálovými bonusmi, takže ak mi nič neuniká, po vylepšení portálu na 4. úroveň by mohlo byť možné všetky tieto budovy zbúrať (a nechať si iba tie na produkciu nástrojov (z ktorých sa v portáli vyrábajú piesne)). Teória, no podľa môjho osadníckeho rozloženia na bete by to mohlo fungovať.[BR][BR]Inak doporučujem zapnúť si v tejto kapitole zvuky - tie vchody do jednotlivých osadníckych budov majú veľmi sympatické zvukové efekty (najmä to, ako sa pri každej ďalšej úrovni portálu zväčšuje orchester, ktorý zaznie pri jeho otvorení). [smilie--sprite1][BR][BR]Zoznam úloh ku tejto kapitole je spisovaný tu."}, {"7": "Teď mi to možná konečně došlo. (Po třetím přečtení) Nová kapitola = to znamená, že kdo se plácá někde kolem[BR]VII[BR]tak má smolíka a tohle si nezahraje ???"}, {"2": "Je to zpráva jen pro lidi na konci výzkumu[BR]Ale neboj, bude to tam na tebe cekat"}, {"21": "Za mě je mě to fuk zvuky mám ztlumene,hudba není pro mě"}, {"16": "@Waso[BR]Z tohohle:[BR][IMG]https://i.ibb.co/DRs8BL6/https-cz-forum-elvenar-com-index-php-attachments-1661771225504-png-6200.png[/IMG][BR]se stane tohle:[BR][IMG]https://i.ibb.co/89ps6sW/https-cz-forum-elvenar-com-index-php-attachments-1661771237290-png-6201.png[/IMG][BR][BR]Takže jestli jsi někde u víl/orků, tak Sílu hudby máš ještě za dlouho (v závislosti na rychlosti tak 2-4 roky hrubým odhadem)."}, {"5": "[IMG]https://i.ibb.co/31jxFNT/https-cz-forum-elvenar-com-index-php-attachments-1661779560565-jpeg-6202.jpg[/IMG] 17.08.1969[BR]WOODSTOCK jupííí [smilie--sprite1][BR]trochu live historie: wiki:[BR]Woodstock (Celým názvem Woodstock Music & Art Fair s podtitulem An Aquarian Exposition: 3 Days of Peace & Music) byl hudební festival konající se ve Spojených státech amerických jihozápadně od stejnojmenného městečka. Jeho první ročník proběhl od pátku 15. srpna do pondělí 18. srpna 1969. První ročník festivalu byl považován za jeden z největších a klíčových okamžiků v historii populární hudby. Časopis Rolling Stone jej zařadil mezi 50 momentů, které změnily historii Rock and rollu.[1] Za zakladatele festivalu jsou považováni Michael Lang, John P. Roberts, Joel Rosenman a Artie Kornfeld. Festivalu se zúčastnilo mnoho legendárních umělců a kapel jako Jimi Hendrix, Janis Joplin, Jefferson Airplane, The Who, Carlos Santana nebo Country Joe and the Fish....[BR]Organizátoři původně odhadli počet účastníků na šedesát tisíc, ale v předprodeji se prodalo více než 180 000 vstupenek po osmnácti dolarech a na místo konání festivalu vyrazilo okolo milionu lidí. Silnice v okruhu 20 km od festivalové louky byly zcela ucpány, mnoho návštěvníků uposlechlo výzev policie a vrátilo se domů. Nakonec se na festival dostalo podle oficiálních zdrojů přes 400 000 lidí (různé odhady kolísají mezi 150 000 a 700 000).[2] Vzhledem k nečekané záplavě diváků pořadatelé rezignovali na kontrolu vstupenek a vyhlásili volný vstup na festival....[BR]Hlavní ideou hnutí „květinových dětí“ hippies, jež tvořily značnou část účastníků festivalu, byly mír, láska a porozumění. Proto se Woodstock zapsal jako protest hippies proti válce ve Vietnamu a proti konzervativním hodnotám.[BR][BR][BR]...moc se těším [smilie--sprite1]"}, {"3": "Waso napsal/a:\t\t\tTeď mi to možná konečně došlo. (Po třetím přečtení) Nová kapitola = to znamená, že kdo se plácá někde kolem[BR]VII[BR]tak má smolíka a tohle si nezahraje ???\t\tKlikněte zde pro zvětšení...Když jsem začínal hrát, byla poslední kapitola Elementalove. Sice jsem se výzkumem zbytečně nehnal, ale ani to neflakal a až před měsícem jsem se dostal na konec. Čeká tě ještě robota ... [smilie--sprite1]"}, {"2": "@iDavis [BR]Prošel jsem info a úkoly co máš na stránkách.[BR]Orchestry udeme satvět kvůli max 15 kusům surovin které každý vyrobí[BR]Jasně, celé je to vykoumané aby s tím nic nepomáhalo a vyráběli jsme je po jednom[BR]Ale fakt je v úkolech že musíme postavit 6 orchestrů[BR]Opravdu?"}, {"5": "GG, máš tam úkol i na 15 souborů...[BR]Dále na 9 výrobců nástrojů...[BR]Hezký je i 9 mnf na 34lv, kde jsem čekal, že právě tudy povede cesta k místu ve městě... No uvidíme [smilie--sprite1]"}, {"16": "Cesta k místu ve městě vede tak, že si kapitolu pořešíš po svém a na úkoly se vykašleš."}, {"20": "Já se na tuhle kapitolu těším, celkově téma vypadá pozitivně, a když už mám stavět výrobu osadníků, tak radši koukám na hezké budovy. V minulé kapitole to bylo takové depresivní a fádní. [BR][BR]Na Elvenarchitek si můžete načíst město, pak přehodit nahoře na betu a už tam jsou všechny budovy z 20. kapitoly. [BR]Změny velikostí a směru postavení budov jsou přijatelné, celkem mi to do sebe klaplo."}, {"5": "LK: ...a právě že poslední asi 3 kapitoly jedu i úkoly, slušný přísun živého a i ty odměny se zvedly a některé se hodí, navíc většina budov se otáčí, takže raději nějak vymyslím to místo [smilie--sprite1]"}, {"16": "Budovy budu vylepšovat (až na kouzelné) až po nebo na konci kapitoly. Budu mít na to dost času. V tomhle máme výhodu my, kteří máme na kapitolu celý čas mezi přidáváním kapitol oproti hráčům, kteří po dokončení této kapitoly budou mít několik dalších na projetí.[BR]Jedinou výjimku tvoří samozřejmě T9 manufaktura, bez jejíhož vylepšení nebudu moci vyrábět t9 suroviny.[BR]Já mám pořešené živoucí Simií (2% rozpad a zásoby v milionech) a kouzly (když budu potřebovat vyrábět více než vyrábím).[BR][BR]Úkol, který je krátce po začátku a na kterém nejspíše skončím:[BR][IMG]https://i.ibb.co/J7vB738/https-cz-forum-elvenar-com-index-php-attachments-1661852774298-png-6206.png[/IMG][BR](prostě jim ten milion many nedám)"}, {"2": "Tak to já s klidem, milion už není žádné šílené cislo"}, {"5": "s majákem Ds je běžná denní sklizen many v pohodě přes milion..."}, {"2": "Uvidíme kolik přidají na vylepšených budovach"}, {"6": "Nepodceňoval bych hráče na spodních patrech. Z 0 na 19 kapitolu jsem to dal za 2 roky a 2 měsíce. A tu bych měl  stihnout do konce roku. To hlavně díky tomu, že jsem pečlivě studoval návody a zkušenosti hráčů přede mnou.[BR]Takže není nutno hned úpět nad časem, ale prostě to hrát s chutí a přehledem.[BR]No a já si mezitím budu hodně pozorně pročítat zkušenosti \"dvacítek\" a těšit se, až se do té kapitoly zakousnu také."}, {"5": "Portál půjde postupně z 5x5 na 8x8 /4lv/ neopomenout místo ... a trochu té many [smilie--sprite1][BR][BR]LevelRequirementsCostsBenefits[BR]Capacity[BR]Production[BR]4hPortal Production Boost15x548:00h2000K----1500100%--326x660:00h2400K111-3000120%1150%437x772:00h2800K222106000140%1200%448x884:00h3300K3332010000140%1250%5"}]