[{"6": "Už to jede, už to pálí."}, {"6": "Do pr...[BR]To si s snad vymyslel ten, co občas programuje poňukaná patra ve Věži nebo v Turnaji.[BR]Jeden se zbaví otročení six ve Vyhnancích, a ten dobrodinec ho hned obdaří další péčí, tentokráte startovní pozicí v Hudlařích.[BR]Šest hodin plnění je příšerná herní rakovina."}, {"6": "Zatím jedu i úkoly.[BR]V úlohách 13-15 se má vyrobit  nějaké zboží v manufakturách, kde byl ukončen výzkum. Je to zavádějící. Stačí si to nabrnkat na tržišti (třeba i u obchodníka) a je to."}, {"6": "Sakra, je to nějké moc rychlé. Za týden začnu si mrskat producenty. [BR]Co je?[BR]Poslední kapitoly byly, jako když jeden spadl do bažiny, a teď tahle rychlovka?"}, {"8": "tak tak.. staci mit zasobu PB a hraje to jak na masle [smilie--sprite1]"}, {"16": "Ono se neboj, nejpomalejší je vylepšit portál - zejména pokud nemáš Uskladňovací vír a budeš stavět všech 18 orchestrů. Ale celkově je to rychlejší kapitola než ta předešlá."}, {"3": "řekl bych, že výrazně [smilie--sprite1]"}, {"6": "Mám vír 16, PB 6560%, naplánováno 9 orchestrů, 12 dílen a portál 3."}, {"6": "Tak mám první housle a zjistil jsem, kolik mne to bude stát osnov a živoucího. U osnov víceméně jde o manu, urychlovače nebo PB. Všeho dost. Ale dost toho taky mám.[BR]Je to kapitola vysávání zásob."}, {"6": "Úzké hrdlo - výzkum sídla  - hotovo.[BR]Chválím autory. To je skutečně logisticky a strategicky dobře vymyšleno. Takhle jsem se naposledy zpotil v Unurech.[BR]Zařekl jsem se, že to musím dát bez nutnosti \"ulití\" VB do divů. Povedlo se. Nezbytná podmínka - nechat si v záloze nevyplněný oddíl 72.[BR]Shodou okolností jsem to ani nepotřeboval, neboť to řešil ex post zařazený 30 VB Kotlík.[BR]Teď už to zřejmě bude jenom výše rozebraná nuda.[BR]Ještě poznámka. Pětku před sídlem je potřeba zaplňovat od výrobců. Aby byl čas na výrobu potřebných nástrojů pro ukončení výzkumu sídla.[BR]Udělal jsem to obráceně a stálo mně to hafo urychlovačů a PB."}, {"6": "Takhle po ránu, a hned jsem se málem vytočil.[BR]Dodělal se mi druhý houslosbor a koukám - dvojka červená:[BR][IMG]https://i.ibb.co/vx1VjdT/https-cz-forum-elvenar-com-index-php-attachments-1675408302100-png-6588.png[/IMG][BR]I najel jsem si na tu dvojku a tam:[BR][IMG]https://i.ibb.co/M56N81S/https-cz-forum-elvenar-com-index-php-attachments-1675408560905-png-6589.png[/IMG][BR]Koukám na to jako z jara, a tak jsem zkusil flétnosbor, kde mám jenom jeden kus:[BR][IMG]https://i.ibb.co/YR29NLb/https-cz-forum-elvenar-com-index-php-attachments-1675408786216-png-6590.png[/IMG][BR]Čumím, čumím, nerozumím.[BR]A pak jsem to pochopil, proč se proboha všude nahoře píše o třech nutných sborech od každého.[BR]Zajel jsem do architekta a začal překopávat celou skladbu plochy. Přitom jsem klel jako pohan.[BR]Je tam totiž zase jednou \"drobná\" chybička.[BR]Místo aby bylo uvedeno: Vyžadováno - 2, tak je tam prostě fláknuta neměnná jednička. Ať děláš, co děláš. Že se ve výsledku objevuje po splnění druhého sboru, že je k dispozici přesně to, co se vyžaduje, a nic se neděje, to je asi všem zodpovědným činitelům jedno.[BR]Jednička nebo dvojka - vsjo ravnó, jak se onehdá říkalo.[BR]Nadělá mi to pěkný logistický zmatek, ale nějak to už zvládnu. Jenom dodělání kapitoly jsem pro jistotu přesunul na březen.[BR]Takže bacha na to, co se v požadavcích píše. Červená není prostě ve hře vždy červená, ale někdy modrá, zelená..."}, {"7": "Tak doufejme, že to časem opraví.... (hlavně dříve, než tam doklopýám!!!)  [smilie--sprite7]"}, {"16": "Anebo si prostě pamatuj: Na lv3 po 3 orchestrech z každého druhu, na lv4 pak po 6 orchestrech z každého druhu.[BR](lv3 stačí na projetí kapitoly (bez splnění úkolů), pokud máš Uskladňovací vír 16+ a hodně PPček)"}, {"2": "To už je tak dávno co jsem tuhle jejich matematiku objevil.[BR]Žádná chyba, vybabrali s tebou."}, {"6": "Tady ani tak nejde o to, jestli to bude 6, 9, nebo 12 orchestrů. Tady jde o to, že je to zavádějící informace.[BR]Hra, na rozdíl od reálného života, má mít jasná pravidla, závazná pro všechny. Ta pravidla a ty podmínky k plnění mají být psány dostatečně podrobně, jasně a přesně, aby je pochopil každý, kdo si je dokáže přečíst a zapamatovat.[BR]Mám ve zvyku logisticky stavět postup ve hře na základě podrobného studia těchto pravidel a podmínek. Každá nepřesnost stojí čas a peníze (herní i případně skutečné).[BR]Mne to stojí změnu v herním plánu a časové zdržení, které mi finále posune až do března. A na březen jsem si naplánoval už něco jiného. Tuhle hru jsem měl potom až do května jenom tak nějak šolíchat. [BR]Od května mám už pro jistotu rezervu pro další očekávanou kapitolu.[BR]Ale nepoprdím se z toho. Je to jenom hra."}, {"30": "zdravím, chci se zeptat, mám v úkolu - postav - postav další sbory - tj. celkem jich mám mít 6 - otázka - je nutné mít od každého 2 nebo můžou být třeba 3 stejné? Má to vliv na další průběh, že musí být vždy od jednoho druhu třeba 2x... - díky za odpověď[BR]A další dotaz [smilie--sprite1], mám hudební háj na 2 a když kliknu na vylepšit - tak tam mám všechny sbory červeně - i když houslový sbor mám už 2x - takže ten by neměl svítit červeně..."}, {"134": "abraham napsal/a:\t\t\tA další dotaz [smilie--sprite1], mám hudební háj na 2 a když kliknu na vylepšit - tak tam mám všechny sbory červeně - i když houslový sbor mám už 2x - takže ten by neměl svítit červeně...\t\tKlikněte zde pro zvětšení...Proč by neměl?[BR][BR]Citace z wiki:[BR]Poznámka: Podpůrné zdroje nelze využít opakovaně. To znamená, že pokud je využijete k vylepšení Hudebního háje, budou „ztraceny“ a musíte postavit další podpůrné budovy, abyste mohli Hudební háj dále vylepšovat![BR][BR]Takže na druhou úroveň portálu jsou potřeba 1 sbor od každého, na třetí 3 a na čtvrtou 6 sborů od každého. Jednoduché. [smilie--sprite2]"}, {"30": "aha, takže jestli jsem tomu dobře porozuměla, tak mám hudební háj na 2  a mám od každého sboru 1, ale 2 houslové. Ale když se už použili na vylepšení na 2 - tak teď - musím postavit 2 - slovy dva [smilie--sprite1] nové, tedy musím mít od každého 3 - jsem si to musela takto sesumírovat [smilie--sprite1] - díky[BR][BR]Odstraněna citace. Embla"}, {"6": "@abraham [BR]To je právě ten problém, na který poukazuji o něco výše.[BR]Prostě jsi další z nás hráčů,  kterou nachytala zvádějící informace.[BR]Vítej v klubu."}, {"135": "Jo řekla bych že u většiny to je stejné, tohle nelogické zapisování do stavu nachytá skoro každého, jen ty, co si předem toto přečetli na diskuzi ne, já to tedy zjistila při pokusu vylepšit na lvl 3,takže to bylo pro mě ještě celkem včas, než jsem si rozpočítala postavení staveb po dokončení kapitoly, ale pár nepublikovatelných slov padalo z mých úst  ;-)"}]