[{"30": "jsem si myslela, že největší problém při stavbě těch sborů budou semínka, ale větší problém mám s osvíceným zbožím - teď zrovna ty geniální granule, kdy na trhu je výměna tak na 99% jen za pravěké minerály, což je málo za hooooodně [smilie--sprite1]  Taky budu muset dát do skladu nějaké budovy, aby se mi tam pak celý ten orchestr vlezl [smilie--sprite1]"}, {"6": "Jo, jo. T8 prach a T9 kuličky. A jsem v hajzlíku jako Baťa s cvičkami. Urychlovače pro ty přiťáplé pseudoobchodníky jenom létají z okna ven.[BR]Kdo má T8 vosk nebo T9 pomazánku, tomu je hej.[BR]Heslo: Přežít!"}, {"8": "jestli chces pomaznaku a jsi z Arendylu [smilie--sprite1] tak napis a mzuem udelat velkou vymenu... u zsi prirpavuju osvicene zbozi na stavu 600k+ od kazdeho.[BR]on tim jak jsou nastaveni kupci se vyplati vyrabet jen nejvyssi zbozi a \"mnozit ho\" smenou za nizsi. tim ze je vyber automaticky... a je malo hracu na stejnem stupni vyvoje.. tj vetsina uz to ma za sebou (to byla napriklad pomazanka uplne k prdu) a ted dojizdi postupne ten zbytekl [smilie--sprite8]"}, {"6": "Dík za nabídku. Teď honím smrady za koule. [BR]Zítra budu potřebovat májku (173K) za koule na poslední orchestr, tak se ozvu."}, {"109": "Jen poznámka. Pokud někdo plníte i úkoly, tak pokud máte úkol na 6 sborů, tak pro úkol je jedno, jestli máte 1+1+4 nebo 2+2+2 nebo 3+2+1. [BR][BR]Ps: já splnil všechny úkoly a hra mi žádné nenabízí, dokonce ani ty rotační. [smilie--sprite1]"}, {"2": "@prchlik [BR]rotační úkoly jsou nahrazeny sezónou snů"}, {"109": "GorGlin díky za vysvětlení. Sezonu snů jsem takto nevnímal."}, {"19": "@prchlik [BR]pokud jde o ty sbory, možná ti to splní úkol, ale složení 1+1+4 ti určitě nepomůže s portálem"}, {"16": "Když už bych se obtěžoval s úkoly, tak bych určitě stavěl vyrovnaně (tzn. 1+1+1,3+3+3,6+6+6), ale to bych se nejprve musel obtěžovat dělat úkoly (i když zrovna v téhle kapitole jsem těch 6+6+6 postavil, ale rozhodně ne kvůli úkolům)."}, {"2": "@Lovec Krys [BR]Enaruv blues?"}, {"6": "Na vířivku č. 24 kašlu. Nebudu, kvůli tomu dohánět prkna, které teď vůbec nepotřebuju. Dodělám  za chvíli třetí portál a víc ani ťuk. Ke slovu příjdou urychlovače a portálovky a nehodlám se s tím dál nějak cicmat. Howgh."}, {"129": "[smilie--sprite8][smilie--sprite8][smilie--sprite8][smilie--sprite8]:[smilie--sprite8]  presne tak ,Howgh."}, {"6": "Kýžený stav s třídenním zdržením dosažen - sbory 3x3, dílny 3x4 a portál 3. Zbytek chci mít do tří neděl z krku."}, {"109": "@Radvanus já jsem nepsal, že to pomůže s portálem. Jen to, že pro úkoly je to jedno.[BR][BR]@Lovec Krys už nevím jak mi to vycházelo, ale z důvodu místa a postupného přeskupování jsem měl chvilku víc jednoho sboru, ale jinak jsem jel samozřejmě max. rovnoměrně.  A celkem to vycházelo i do úkolů."}, {"6": "Tak dodělávám poslední \"zapomenutý \" výzkum, ale nechce se mi vyplácat další portálovky na chybějících 13 písní a pár tisíc osnov. Takže si to asi v klidu docmrndám do soboty, neděle. [BR]Cíl - stihnout to od 21. prosince do konce února - je v pohodě splněn, tak co."}, {"30": "zdravím, mám portál na 4, můžu už teď zbourat ty sbory, abych si tam mohla dát znovu výrobu - ty výrobce nástrojů všechny, popřípadě jich ještě několik postavit? díky za odpověď [smilie--sprite1]"}, {"6": "Portálu 4 jsem se elegantně vyhnul nasazením kvanta portálovek a urychlovačů. Obecně ale platí, že orchestry navyšují každý o 40 % výrobu not, což je pozitivní, ale vzhledem k zabranému území to zase až tak dobré není. Nástrojárny jsou důležité pro konečnou produkci hitů. A když je nemáš, tak čumíš a čekáš.[BR]Asi když už máš portál 4, tak se nic moc nestane, když si odebereš nějaké orchestry. Ale vyzkouším to na portálu 3 zítra nebo pozítří, až zapíchnu tohle kolo.[BR]Jinak ti čtyřka určitě bude spořit portálovky, které budeš muset používat."}, {"30": "Tak aspoň nějaký musím dát pryč, protože toho místa to zabírá moc a výrobu potřebuju, díky"}, {"16": "Pokud jsi schopen naklikat zbývající výrobu portálu přes požehnání, tak po vylepšení portálu na lv4 (nebo lv3 s Uskladňovacím vírem 16+) je možné sbory zbourat."}, {"6": "Anketa.[BR]Tak nevím, mám to tápení ukončit hned anebo pozdě zítra?[BR]Já vím, je to blbost, ale prostě si užívám konce téměř tříleté honičky.[BR]Zatím. Jak doufám."}]