[{"31": "Vychutnej si to, nespěchej [smilie--sprite1]"}, {"6": "Jo, jo @Prealiena  děkuji. Ještě 5 písní a 2772 not.[BR]Je to takové sladkobolné."}, {"6": "Hotovo, dvacet. Není co dělat. Snad mě něco napadne."}, {"124": "tý jo na 3kapitolách o kapitolu gratulka @Schoenfeld"}, {"6": "Už mě něco napadá. Nechám to dozrát. Fungování bez honičky je naprd."}, {"8": "[smilie--sprite8] ted v mezicase se muzes hnat za maxovanim divu [smilie--sprite2]"}, {"20": "@Schoenfeld když jsem poprvé před několika lety čekala na novou kapitolu, byla jsem z toho ze začátku nervózní, ale teď už mám tohle období nejradši. Ve hře je pořád dost akcí, pěkně se vylepšují divy a je to fajn."}, {"124": "Novou kapitolu až tak nejdřív v květnu prosím [smilie--sprite1])"}, {"6": "Teď řeším, jak zlikvidovat úkolovou řadu, páč mi nedořešená leze silně na nervy."}, {"2": "Proto já jí dělám, nehotová mi děsně pije krev.[BR]Po dokončení ten ksichtík zmizne a je klid"}, {"6": "@GorGlin  Aha, na to jsem čekal. Vnuknul jsi mi myšlenku. Zakládám proto vlákno: \"Co dělat po poslední kapitole\"."}, {"7": "Líbí se mi výraz \"ksichtík\" a také nové vlákno založené @Schoenfeld"}, {"16": "Schoenfeld napsal/a:\t\t\tTeď řeším, jak zlikvidovat úkolovou řadu, páč mi nedořešená leze silně na nervy.\t\tKlikněte zde pro zvětšení...Na to si zvykneš. Já nedokončil úkoly kapitoly už od dob Lesních elfů."}, {"6": "Nezvykneš. Mně to prostě ve hře vadí. Není to domyšlené."}, {"16": "Po mně chce úkolový šašek už od podzimu darovat milion many a já mu ji pořád odmítám dát[smilie--sprite1][BR]Není to o nic těžší než ignorovat ikonku sezón na betě (tam už skončila, ale předpokládám, že ta další nebude lepší).[BR][BR]Edit: @Boobika Odpovídám takhle, jelikož nechci zaplevelovat diskuzi ke kapitole diskuzí k sezónám: Odměny sezón mi na betě nestojí za tu námahu."}, {"8": "no a prave proto mam sezoni tydeni ukoly hotove nejpozdeji do druheo dne a denni do v obedove pauze ..."}, {"34": "Lovec Krys napsal/a:\t\t\tPo mně chce úkolový šašek už od podzimu darovat milion many a já mu ji pořád odmítám dát[smilie--sprite1]Klikněte zde pro zvětšení...Lovče -  a proč, je to jen z principu? Jsem na konci výzkumu, nevím co s manou, skladem je jí 18 mega. Každou noc se jí cca 1,6 mega rozloží, neboť Bludiště temné hmoty mám jen na základním 1. levelu, takže rozpad 8,8%. Ovšem stejné množství many denně seberu, takže je to fuk.[BR]Nebuď skrblík a dej hře manu! [smilie--sprite1]))"}, {"16": "I kdybych mu je dal, tak pak přijde další úkol, který stejně plnit nebudu.[BR]Navíc raději použiji manu na vylepšení divů (běžně 1M+).[BR]Základ mojí produkce many tvoří 2 Ledové vánoční stromy (dohromady 400k many denně) + nějaká produkce z Manovců, mezikapitolových evo budov a bludiště 35 (takže rozpad 2%).[BR]Můžu si to samozřejmě naklikat přes Opatství (lv 35 a v zásobě tisíce kouzel), ale proč to klikat, když stejně o pár úkolů dál narazím na něco co stejně plnit nebudu.[BR](Ano, teď koukám na betu, kde jsem mu ten milion many dal, jenom aby po mně chtěl neposílenou produkci T2/5/8, na což mu prostě dlabu)."}, {"6": "Tak jsem si na podnět @Lovec Krys dal tu práci a anylyzoval úkolovou řadu. Vyplynulo z toho to, že jsem se hned zastavil na dvou kulturních budovách (úkol 25), páč to nemá racionální smysl dál pokračovat. [BR]Až spustí další kapitolu, dotlačím jenom splnitelné úkoly na manty a na osatní kašlu. Jdu bourat orchestry a montovny.[BR]Pohled na \"nesplněno\" si prostě na čas zakážu."}, {"7": "Miluji úkoly od systému - heč !!! [smilie--sprite7][smilie--sprite8][smilie--sprite7]"}]