[{"2": "Co to je?"}, {"6": "@Waso Miluj si, co chceš[BR]Na dvacítce zamrzneš"}, {"8": "nezamrzne. ukoly se daji bez problemu plnil prubezne. prote ten 1M many ziskas druhy den (nebo par kouzlama hned), nebo ukoncis kapitolu o tyden pozdeji.[BR]Porad si myslim ze by  bylo moc fajn kdyby plneni/odmitani ukolu melo vetsi vliv na hru - moznost podle toho jinou technologii atp..."}, {"16": "@Boobika Myslíš jako např. v jiné mobilní Inno hře (myslím, že se jmenuje Rise of Cultures nebo tak nějak), kterou jsem přestal hrát poté, co mě nepustila do další kapitoly bez dokončení úkolové řady?[BR](a v kombinaci požadavků a možného místa ve městě to vlastně vylučovalo jet jinak než striktně podle diktátů úkolů).[BR](takže něco ve smyslu, nejprve postav nějaké kulturní budovy v určitém počtu a pak je o půl kapitoly zase zbourej (nebo zbourej něco jiného, co pak zase budeš stavět znovu), aby jsi mohl splnit úkol na dokončení kapitoly postavením budovy(ekvivalent dílen), kterou nepotřebuješ, protože jich máš ve městě dost a nemáš místo na další a rozšíření můžeš získat až v další kapitole, jelikož tvoje stávající jednotky již neporazí nepřítele na mapě)[BR]To já jsem rád, že v Elvenaru můžu na úkoly bez následků kašlat."}, {"7": "Unurium[BR]je až ve dvacítce ?? [smilie--sprite9]"}, {"16": "Unurium jako surovina přibylo v kapitole 17 - Obchodníci z Unuru (odtud název Unurium).[BR]V kapitolách 18-20 přibyly suroviny z Unuria vyráběné (obdobně jako suroviny vyráběné ze semen o pár kapitol dříve)."}, {"6": "@Boobika Nemám nic proti úkolům, které vyplývají z postupu hry. Ale proč bych měl stavět něco (kulturní budovy), když mi stačí ty, které dostávám třeba v Události nebo coby Tajemný objekt? Naposledy jsem nějakou použil tak 5.-7. kapitole. [BR]Až do 19. kapitoly jsem je přesto jakš takš plnil, ale ve dvacáté to všechno postavili na hlavu, tak jsem se na to přes počáteční snahu vykašlal.[BR]Logické propojení kapitoly a úkolů naprosto haprovalo tak, že ani ex post mi nedává smysl je dojet ke zdárnému konci. [BR]Raději počkám na další kapitolu a klidně oželím i jinak cenné manty."}, {"133": "Ahojte. Dodělal jsem poslední kapitolu a dodělávám úkoly.  Postavil jsem 12 sborů a objevil se mi úkol postav další nástrojaře a měj manu na ocel na l.34. Manufakturu mám a 7 nástrojářů z 9. Ale vůbec nevím co to je. Marně hledám ve městě postavených 7 budov. Nevíte někdo, co to teda po mně chce? Díky."}, {"6": "Nástrojáři - výrobci tří sad nástrojů (bubny, flétny, smyčce).[BR]Ale upřímně radím, vykašli se na to (viz výše). Za tu námahu to nestojí. Raději si vylepšuj faktury a divy.[BR]A užívej si času bez honičky. Je to fajn, fajn, fajn, je to fajnový."}, {"30": "Zdravim, chci se zeptat, mam hotovy posledni vyzkum, ukoly nemam splnene a nechci v nich pokracovat, ze bych mela postavit dalsi sbory. Muzu uz vsechno zbourat? Ale kdyz ted vsechno zbouram, prijdu o odmeny z ukolu, ktere se mi meli zobrazit jako, ze je uz po skonceni kapitoly pak muzu dat odmitnout a nejaky uz se mi pak dalsi zobrazi, ze je splneny a odmenu dostanu  diky za odpoved"}, {"136": "A víte že @iDavis má krásny zoznam príbehových úloh,  čo tak si najpr pozrieť kde ste  a či ostatné úlohy sú zvládnuteľné a vyžadujú velkú námahu? napríklad úloha na ktorú sa pýtal @OrickJ je  70 z 88 ,a tých zvyšných 18 úloh vyzerá proveditelne[BR][IMG]https://i.ibb.co/r7WkYQj/https-cz-forum-elvenar-com-index-php-attachments-1678886815566-png-6658.png[/IMG]"}, {"30": "Diky za info, tak to skoro vsechny odmeny ozelim"}, {"6": "No vidíš to. Do 19. kapitoly je lepší si jenom počíhat na manty. A ty dostaneš s následující kapitolou, kdy můžeš odpiknout všechny ostatní zbytečné úlohy."}, {"9": "zdarek lidi tak uz jsem konecne na 20 teda teoreticky mam polovicku vyzkumu hotoveho ale prakticky je jeste vetsina kapitoly predmnou a resim ted kolik mit tech nastrojaru to jsem tady tak uplne nenasla jestli budou stacit 3 od kazdeho a nebo je lepsi nejaky jiny pomer ci mnozstvi"}, {"11": "myslím, že po 4 byl takový standard."}, {"6": "Možná pomůže výřez z mého excelového architekta:[BR][IMG]https://i.ibb.co/0KNg2NW/https-cz-forum-elvenar-com-index-php-attachments-1693303874032-png-7043.png[/IMG]"}, {"9": "diky panove a moc pekny obrazek, konecne zacal event a moje obri nouze o unurium snad uz nebude tak velka"}]