[{"20": "@Schoenfeld - nová kapitola přijde vždy po dlouhé pauze, takže postupně přibývá hráčů, co jsou na konci výzkumu. Nepochybuju, že nás doženeš, už jsem viděla víc hráčů, kteří začali hrát pár let po mě a teď budou začínat 20. kapitolu. Takže do toho [smilie--sprite6]."}, {"129": "Schoenfeld je proste mašina a válec a jede jak gula [smilie--sprite8][smilie--sprite8][smilie--sprite8]  Myslím , že za chvili bude psát vývojarum , že sou desne pomaly s pridavaním novych kapitol ,a že se tu na Elve nudí [smilie--sprite8][smilie--sprite8][smilie--sprite8][smilie--sprite8][smilie--sprite8][smilie--sprite8][BR][BR]Jak ste se tu bavili o tom plneni ukolu v kapitolach , obdivuju hrače které je delaji , vím že je to každého individualni pristup k tomu , ale pro mne sou nezmyselné kdybych se mnel nema ridit a tak je pak vždy odklikam na konci .[BR]Treba (a to taka mala rada pro Schoenfelda [smilie--sprite8][smilie--sprite8][smilie--sprite8]) v 19 kapitole sem začal stavet a bourat bile a černe veže spočital sem si kolik je ich treba na vylepšeni portalu ...to sem udelal a pak sem vubec nemusel je resit  a tedy i místo v meste a venoval se jenom lihnim a jejich vylepšovani .[BR]Pak prišel ukol zbourej tolik a tolik bilych a černych veží [smilie--sprite8][smilie--sprite8][smilie--sprite8][smilie--sprite8] co sem už davno samozrejmne udelal  a venoval se jenom lihnim, od te doby sem na tymto ukolu zaseknutej nezmyselne.Kdybych to jel na ukoly tak se placam s mistem ve meste kvuli blaznivym bilym a černym vežim jen abych splnil ukol.[BR]Takovej návrh pro vylepšeni hry bych mnel ,at si to hra pamatuje co majitel mesta v dane kapitole udelal , tak jak to je teď v DS kde ta zmena probehla, že se odznaky započitavaj za vyrobu ,a že se nemusej plnit presne protože si to hra pamatuje a to navic se započitava.[BR]Jako když sem už neco v kapitole udelal a pak pride ten ukol mnel by se odfajknout jako splnenej predse ne ? Jinak to fakt nema zmysel muj nazor ...."}, {"8": "No ono to treba ted melo hezky naslapnuto odmenit ty co jedou podle ukolu jinak, nez ty co jedou nejdrive vyvoj a pak odklikaji ukoly [smilie--sprite8][BR]Ale tipuju, ze to byla spis nahoda nez umysl. me zatim tim jak postupne jedu vyvoj az na par drobnych \"zaseku\" jedou i ukoly.[BR]Ale ja se nezenu za tim byt o kazdou minutu rychleji na \"konci\" nez \"souperi\" [smilie--sprite8]"}, {"129": "To ja taky ne ,nekoukam na soupere jak sou daleko  , ale když sem nad kapitolou 19 premyšlel jak ji pojedu tak z hlediska mista mi tohle prišlo strašne vyhodne udelat hned na začatku kapitoly a mit od staveni a bourani bilych a černych veži klid.[BR]Mne co žene dopredu je všechny knižky a VB hrnout v klidu do divu ,zvedat je ešte vic , a ne do vyzkumu a konečne na uvolnenem mistu po osadnicich postavit z archivu všechny te nasporene džiny,studny,pojezdne knihovny atd a sbirat odmeny ,dia a pak kupovat za ne rozšireni  [smilie--sprite8][smilie--sprite8][smilie--sprite8]:[smilie--sprite8][BR]Mam je za ta leta fakt spousty , proste si užit takhle ten pul rok s klidem od osadniku to bude parada pak .[BR][BR]To bude pak v Elvenari ma osobni kapitola X  [smilie--sprite8][smilie--sprite8][smilie--sprite8]"}, {"2": "Já jsem zažil dobu kdy byli povinné úkoly na stavbu manufaktur bez bonusů.[BR]A pokud si to správné pamatuji, tak za jejich splnění byla odměna méně než bylo potřeba na stavbu.[BR]Prostě bomba.[BR]Teď když známé úkoly dopředu a můžu si hru naplánovat tak je to snadné.[BR]Konec minulé kapitolu jsem jen vyráběl v portálu ultrahnusy a líhně už jsem měl zbourané a tak nebyl problém dodělat potřebné bourání věží, protože na to bylo spousta místa."}, {"26": "Nový prastarý div - Hostinec zvědů:[BR]a) snižuje dobu průzkumu provincie - je známo o kolik sníží dobu průzkumu?[BR]b) navyšuje počet truhel ze sousedské - tzn. že nabývá na významu krmení měsíčního medvěda, který dává 3VB z každé \"sousedské truhly\" - ví se kolik truhel bude navíc?"}, {"2": "@karhol [BR]zkrácení průzkumu je v porcentech, takže čísla můžeš jen teoreticky počítat[BR]Co se týče truhel, tak by každý runový kruh by měl dát jednu, takže lvl 31 dá sedm truhel navíc[BR]moje doměnky"}, {"31": "Čekáme, až nám updatují wiki sekci s divy. Ale předpokládám, že s tou sousedskou to bude jako s knihovnou tajemství atd. (1.-5. lvl. +1, 6.-10. lvl. +2 ...).[BR]A čas průzkumu bude v procentech ala časový skok."}, {"19": "dle anglické wiki je to na 35% a 7 truhel"}, {"26": "Díky.."}, {"5": "to karhol:[BR]Scouts' Tavern Overview​Scouts' Tavern Information OverviewLevelRequirementsCostsBenefitsAmount15x322:00h9 -60000[BR]68000[BR]68000[BR]68000[BR][BR][BR]94%125x324:00h-400 18800 K[BR]1880 K[BR]550 K[BR]79000[BR][BR][BR]91%1 Scouts' Tavern Overview​[IMG]https://i.ibb.co/7XFLtbJ/https-cz-forum-elvenar-com-index-php-attachments-div-png-6212.png[/IMG][BR]přičemž % jsou snížení doby výzkumu, 4 pak počet dalších nových beden za sousedskou...tj až 7 celkem"}, {"2": "Tedy, přísahal bych že ještě včera tam bylo 7.[BR]Tak co, už to někomu začalo?"}, {"20": "Sílo hudby, kde se couráš? [smilie--sprite8]"}, {"8": "jeste musi na obed [smilie--sprite5]"}, {"5": "GG 7 je to v součtu s těmi současnými...[BR]Tak ve 12:00 by to mělo býti [smilie--sprite1]"}, {"24": "Kedysi ten div pridával 7, ale potom to zredukovali na súčasných 4. Rovnako tak kedysi redukoval prieskum o 80%, no po vybalansovaní redukuje o 65% (pre mňa osobne stále viac než dostačujúci dôvod aby som ho postavil)."}, {"2": "U me každá truhla dobrá, uz teď mám tři produkce navázané na truhly z výpomoci, takže tenhle div mi to víc jak zdvojnásobí.[BR][BR]Tak, všem vám přeji aby se ten festak vydařil."}, {"11": "Tak jak jsem předpokládal, po výzkumu průzkumníků se zlehčily nevyzkoumané provincie ale ty vyzkoumané zůstaly na stejně obtížnosti. I když mi tady LK někde tvrdil, že se sníží i obtížnost vyzkoumaných."}, {"16": "Obtížnost vyzkoumaných provincií sníží výzkum zvětšení oddílu (=větší vlastní armáda, stejná armáda nepřítele).[BR]Výzkum průzkumníků ovlivňuje jen doposud nevyzkoumané provincie. A nejsem si vědom, že bych někdy tvrdil něco jiného - nespletl sis to?"}, {"11": "to už je jedno[BR]Třeba jsem to blbě pochopil.[BR]Nebo je to tak, že vylepšení průzkumníků na ně nemá vliv ale vylepšení velikosti oddílu ano ?"}]