[{"2": "@voyager-1[BR]Ano, tak to je.[BR]Vylepšení velikosti oddílu zvedne velikost tvoji armády, zatímco soupeřova je stále stejna"}, {"11": "no, nechám se překvapit [smilie--sprite1]"}, {"6": "Snažte se borci, přeji hodně úspěchů.[BR]Vytyčujte trasu, popisujte a raďte. My za vámi vám budeme velice vděčni.[BR]Předem díky."}, {"11": "Tak ano, po vylepšení oddílu se vyzkoumané provincie zjednodušily. Na neprozkoumané to nestačilo, tam bude třeba další zvětšení."}, {"28": "Kolik tak plánujete stavět těch výrobců? Nějak vůbec nemám představu, kolik se jich tam mám snažit nacpat [smilie--sprite8]"}, {"5": "Angedev napsal/a:\t\t\tKolik tak plánujete stavět těch výrobců? Nějak vůbec nemám představu, kolik se jich tam mám snažit nacpat [smilie--sprite8]Klikněte zde pro zvětšení...Zatím po 4 tj 3x4....uvidíme kolik to ponese vs požadavky plynulého průchodu a také místo na orchestry...a myslím že tam bude úkol dokonce na celkových 15!"}, {"2": "@voyager-1 [BR]Celá rasa přidá do oddílu 882 hlav, to by mělo stačit na zlevěnní hodně provicií.[BR][BR]@Angedev [BR]Já mám naplánováno taky dílny po 4."}, {"2": "Onehda jsem tu založil téma kde jsem ventiloval svou frustraci z úkolů, které podle mě nedávají smysl.[BR]Mno.[BR]Dohledal jsem ho, ale i přes to, že jsem ho založil, do něj menůžu psát.[BR]A tak mi to odpusťte, ale napíšu to sem.[BR]Při plánování rasy jsem pročítal i úkoly a dočetl se tam věci kdy mi zůstává rozum stát.[BR]S ohledem na to jak je koncipovaná rasovka, mi naprosto hlava nebere, proč bych měl stavět víc než jeden od každého orchestru.[BR]Ale, světe div se, 73. úkol chce 15 orchestrů, takže budovum, se kterou si myslím že vystačím s jednou mám postavit 5x.[BR]Je to odrb, nebo mi neco uniká?[BR]Ale co, držím hubu, protože už párkrát jsem tu reagoval zbrkle a udělal ze sebe blbce.[BR]Ale ted jsem splnil úkol a vyskočil mi nový.[BR]Na výrobu polétavého prachu.[BR]Mám bonus na aerosil a tím pádem výroba polétavého prachu v mém městě nedává žádný smysl.[BR]Ale podívejme se na to příběhově.[BR]Luaina je sice bájo hejkal, ale nebrání se zlepšení.[BR]možná by nějaká spešl maska z ještě víc spešl dřeva, mohl pomoci jejímu hlasu[BR]nebo nějaká super moderní ladička[BR]ale ne, ona chce kabát, elegantní plášť.[BR]jako jo, sám jsem se něco nazpíval, a nachlazení je velký problém, ale pokud můj speciální kožich má vlastně řešit celou záchranou akci, přijde mi ta fladěra za to jako další odrb.[BR]Já respektuji, že má autor nějakou představu jak bych měl hrát a to že jsem objevil možnost hrát jinak ho nezajímá.[BR]Úkolová linie tu není aby mi pomohla, ale naopak jen další páka, která mě má dostat do očekávané linie.[BR]Ale pokud chci dát úkol, který město bude blokovat několik dní, tak zadat \"udělej 3 elegantní pece\" dává větší smysl než tohle."}, {"4": "@GorGlin - podle diskuse na betě budeš muset na vylepšení portálu na level 4 mít těch orchestrů od každého 6 - tedy 18 dohromady [smilie--sprite2]"}, {"11": "aha [smilie--sprite1]"}, {"2": "Zažil jsem tu selicoz, ale tohle je fakt zvevole"}, {"20": "@pavelb díky za info, teď jsem se na to podívala na beta fórum. Já si říkala, že ta kapitola zatím vypadá nějak podezřele snadně. Tak už vím, kde je ten zakopaný pes ... Ale zase dobrý je, že to postavíme asi jen na vylepšení portálu. Doufám, že se nepletu.[BR][BR]Jen mě mate wiki - tady to vypadá, že na 4. lv. stačí 3 sbory od každého:[BR][IMG]https://i.ibb.co/FBsytbc/https-cz-forum-elvenar-com-index-php-attachments-snimek-jpg-6214.jpg[/IMG][BR][BR]Jenže Kersepitje (moderátor fora) na beta fóru píše:[BR]To have a portal level 1 you need no ensembles (of course)[BR]to upgrade to level 2 you need to have one of each ensemble.[BR]to upgrade to level 3 you need to have 3 of each ensemble.[BR]to upgrade to level 4 you need to have 6 of each ensemble.[BR][BR]Takže kdo má skutečně pravdu?"}, {"16": "Wiki je v tomhle zavádějící, resp. z popisu na wiki je možný dvojí výklad.[BR]Správný je ten horší:[BR]lv 1+1+1[BR]lv2 3+3+3 (1+2, 1+2,1+2)[BR]lv3 6+6+6 (3+3, 3+3,3+3)"}, {"20": "@Lovec Krys moc ti děkuji, takže je to konečně jasné. Tak už vím, kdy budu luxovat město  [smilie--sprite6]."}, {"44": "Ano a opět jako pokaždé je trh  zasekaný , čert vem obchodníka do pekel . 244 stránek na bloky [smilie--sprite1]"}, {"8": "a z toho 150 stranek na nevyhodny pomer vymeny [smilie--sprite8]"}, {"11": "nevýhodný poměr u obchodníka nejde, myslíš T7 za T8, ale to je normální nabídka"}, {"8": "kdyby to byly \"normlani\" nabidky tak tam nehnijou vecnost. clovek je pouzije jen v pripade nejvyssi nouze"}, {"28": "@ElfNostradamus @GorGlin Díky, to jste mě potěšili [smilie--sprite1] Čekala jsem daleko větší čísla [smilie--sprite8]"}, {"2": "Dílny jsou v pohodě, to co ti zbourá město budou orchestry a jak se zdá, udělat se to musí, a s dokončením kapitoly ti to nepomuze"}]