[{"5": "Angedev napsal/a:@ElfNostradamus @GorGlin Díky, to jste mě potěšili [smilie--sprite1] Čekala jsem daleko větší čísla [smilie--sprite8]Klikněte zde pro zvětšení...Daleko větčš čísla teprve přijdou následně u orchestrů a náročnost na místo, kdy na vylepčení portálu na level 4 bude potřeba od každého orchetru kusů 6 tj dohromady 18...zde tedy asi kvůli místu lze jít cestou, že se vše potřebné vyrobí u výrobců následně se výrobci mohou zbourat a pak teprve jít řekněme z levelu 3 na 4. u portálu tj postavit komplet 18 orchestrů, kdo by vůbec nepospíchal a udělal předvýrobu výrobců dostatečnou na vše/veškerý výzkum a požadavky stavby/ může jít klidně asi už z levelu 2 portálu pak na 3. a 4.[BR]Toto zatím taky možnost a můj úsudek dle nastudování wiki a stromu výzkumu...doufám, že tam není jiná mnou opomenutá zákeřnost."}, {"130": "ElfNostradamus napsal/a:\t\t\tDaleko větčš čísla teprve přijdou následně u orchestrů a náročnost na místo, kdy na vylepčení portálu na level 4 bude potřeba od každého orchetru kusů 6 tj dohromady 18...zde tedy asi kvůli místu lze jít cestou, že se vše potřebné vyrobí u výrobců následně se výrobci mohou zbourat a pak teprve jít řekněme z levelu 3 na 4. u portálu tj postavit komplet 18 orchestrů, kdo by vůbec nepospíchal a udělal předvýrobu výrobců dostatečnou na vše/veškerý výzkum a požadavky stavby/ může jít klidně asi už z levelu 2 portálu pak na 3. a 4.[BR]Toto zatím taky možnost a můj úsudek dle nastudování wiki a stromu výzkumu...doufám, že tam není jiná mnou opomenutá zákeřnost.\t\tKlikněte zde pro zvětšení...Můžu se zeptat jak jsi přišel na 18 orchestrů najednou? co tak koukám na wiki tak na 4. úroveň to chce 3 orchestry od každého, pokud vezmu v úvahu předchozí úrovně hudebního háje tak ano, je potřeba dohromady 6 kusů od každého, ale lze to dělat postupně ne? nejdříve vylepším na úroveň 2 kde to chce 1 od každého, pak jelikož se to spotřebuje to můžu zbourat a postavit nové nebo ten mechanismus: \"Podpůrné zdroje nelze využít opakovaně. To znamená, že pokud je využijete k vylepšení Hudebního háje, budou „ztraceny“ a musíte postavit další podpůrné budovy, abyste mohli Hudební háj dále vylepšovat!\" chápu špatně?"}, {"20": "@Modyara prosím, přečti si na str. 3 můj příspěvek a odpověď Lovce Krys. Wiki má poněkud zavádějící vyjádření, řešilo se to hodně na fóru bety. Po vylepšení Hudebního háje budou sice Sbory \"ztraceny\" (což je nešťastný výraz), ale to neznamená, že jsou nefunkční. Pokud se teleportují nebo vymažou, tak v Hudebním háji se objeví -1 atd. Takže na další vylepšení je třeba všechny již použité + nové. A wiki v tabulce vylepšení Hudebního háje uvádí jen co je třeba přistavět k tomu, co už je postaveno z minula.[BR][BR]Forum bety k tématu: https://beta.forum.elvenar.com/index.php?threads/chapter-20-the-power-of-music.17890/page-6"}, {"131": "CÍsařův Pekař-Hopsa hejsa do Brandejsa.”a máme konec kapitoly."}, {"130": "Ludi napsal/a:@Modyara prosím, přečti si na str. 3 můj příspěvek a odpověď Lovce Krys. Wiki má poněkud zavádějící vyjádření, řešilo se to hodně na fóru bety. Po vylepšení Hudebního háje budou sice Sbory \"ztraceny\" (což je nešťastný výraz), ale to neznamená, že jsou nefunkční. Pokud se teleportují nebo vymažou, tak v Hudebním háji se objeví -1 atd. Takže na další vylepšení je třeba všechny již použité + nové. A wiki v tabulce vylepšení Hudebního háje uvádí jen co je třeba přistavět k tomu, co už je postaveno z minula.[BR][BR]Forum bety k tématu: https://beta.forum.elvenar.com/index.php?threads/chapter-20-the-power-of-music.17890/page-6Klikněte zde pro zvětšení...jo už to čtu, děkuji, no tak to bude zajímavé... a můžu se ještě zeptat, když ten háj vylepším a pak ty orchestry odteleportuju bude ten háj fungovat? nebude to vadit produkci toho háje?"}, {"20": "@Modyara asi bude fungovat, ale nejsem si tím jistá. Spíš bych to řešila takto:  dát na začátku víc výroben nástrojů. Až do portálu na 3 lv. + 3 Sbory od každého, se toho dá nacapat do města celkem dost. Vyrobit na výrobnách nástrojů maximum a pak jejich počet výrazně snížit a dát 18 sborů a vylepšit Háj na 4 lv. Sice jsem si spočítala, kolik nástrojů budu celkem potřebovat do konce výzkumu, ale ještě jsou tam melodie a na jejich výrobu jsou také potřeba nástroje a podrobně se mi to počítat nechce. Takže si myslím, že po vylepšení Háje na 4 lv. ještě pár nástrojů budu potřebovat. Ale je možné, že časem ještě trochu změním názor  [smilie--sprite6] .[BR]Ještě dodávám, že hodně nástrojů je třeba na výrobu Sborů."}, {"28": "Ano, s orchestry počítám [smilie--sprite1] Ale zatím mám takovou možná trochu naivní představu, že s tím by mi mohly pomoci teleporty [smilie--sprite1] Pokud jsou potřeba jen k vylepšení portálu, tak by teoreticky mohlo stačit střídat ve městě výrobce a orchestry, pokud mi něco neuniklo... Tedy samozřejmě jen do doby, než dojdou teleporty [smilie--sprite8]"}, {"20": "@Angedev taky doufám, že to půjde. Ale nejsem si úplně jistá, jestli teleportace Sborů neovlivní funkci portálu. To ukáže až praxe."}, {"5": "Z Bety... Žel 18 orchestrů...[BR]Tudíž budu volit cestu, jak již popisuji výše, max 2.-3.lv vše z vyroben predvyrobit do zásoby a pak je vklidu smazat, aby bylo místo na finále = oněch 18 orchestrů, což je nutnost na poslední dva výzkumy = divy nové 20. kapitoly"}, {"20": "Tohle téma se tu vyřešilo včera ... [smilie--sprite8]"}, {"11": "já nevím co furt řešíte, no tak bude třeba 18 orchestrů , teleportuju přechodně část města jako v každý kapitole a je to ne? Nebo mi něco uniká ?"}, {"8": "nejak si vubec nedokazu predstavit tu kapitolu hrat bez portalovych svitku... 10 dnu generovat osnovy na jeden upgrade [smilie--sprite8] samozrejmne za predpokaldu ze se noticky nepouzijou jinde [smilie--sprite8]"}, {"3": "Stejně, jako bez teleportu. Ale na druhou stranu, najde se hráč v kapitole 20, který nemá obojího zásobu?"}, {"16": "Jenom k té naznačené strategii - vyrobit všechny potřebné nástroje a pak teprve řešit vylepšení portálu - mám pocit, že s takovou strategií budete muset vyrábět osnovy v portálu, protože vám dojdou PPčka bez ohledu na velikost zásoby.[BR]Např. moje zásoby PPček na betě klesly za poslední týden z 46 portálů na 32 portálů (4655% >3245%) a to mám vyzkoumaný první orchestr (ale ještě nepostavený).[BR][BR]Já osobně se chystám vyzkoušet jinou strategii - vyzkoumat orchestry, vylepšit portál na max., odteleportovat orchestry a pak se vrátit k výzkumu (jestli taková strategie bude možná, ale zatím jsem nenašel překážku, na které by ta strategie ztroskotala)."}, {"20": "@Lovec Krys tahle věc mě taky napadla, ale přesně se rozhodnu, až vylepším portál na 2lv. a uklidím nějaký Sbor do skladu a pak uvidím, jak se Hudební háj bude chovat. Prostě mám obavu, že když portál nebude mít všechny Sbory, tak to může mít vliv na jeho funkci.[BR]Stejně musím vyrábět nástroje a než postavím sbory a vylepším Háj na 3 lv. (3x3 Sbory není zase tak moc místa), tak to bude chvíli trvat. A než dojde k momentu vylepšení na 4. lv., tak může být na nástrojích hodně vyrobeno. Ale jak už jsem psala, ještě uvidím, jak to bude v praxi. Možné jsou pro mě zatím obě cesty."}, {"16": "Podle wiki:[BR]Součástí této kapitoly jsou 3 zdroje, které využijete pouze k navýšení produkce osnov  a vylepšení Hudebního háje.[BR][BR] Melodie – Získáte postavením Houslového sboru. Doprovod - Získáte postavením Flétnového sboru. Rytmus - Získáte postavením Bubnového sboru.Tedy pokud vylepšíme portál a osnovy pro zbytek kapitoly budeme i nadále klikat přes PPčka, posílení produkce osnov v portálu nám může být ukradené.[BR]Ale s jistotou to budu vědět v okamžiku, kdy bude portál na lv4 (zejména, zda produkce písní bude na lv4 se všemi podpůrnými budovami stejná jako bez nich)"}, {"5": "Produkce osnov se v portálu zvýšila /o40% za každý orchestr/ již při stavbě orchrestrů...melodie, doprovod a rytmus se objeví 1 až po dostavbě daného orchestru"}, {"20": "@Lovec Krys přesně o to mi jde: Jak je to s produkcí písní a zvýšenou výrobou v nástrojích. Pokud tohle po odstranění Sborů po vylepšení Hudebního háje zůstane nedotčeno, tak je to všechno trochu jiný příběh  [smilie--sprite6]."}, {"2": "Když pominu, že by uklízení orchestru portál úplně zneschopnili, tak na kapacitu portálu by neměli mít vliv a tak kdo jede přes požehnání, tak je nepotrebuje.[BR]Za předpokladu, že to nemají spočítané aby ani hráči co čekají mezi řadou jich nebudou mít dost."}, {"20": "@GorGlin v portálu od 2. lv. se také vyrábí písně (nejen osnovy) a má vliv na zvýšenou výrobu osadníků. Takže o tom je řeč."}]