[{"5": "Orchestr lze odteleportovat do skladu bez vlivu na výrobu, na levelovaní portálu nutno vyndat. Vyzkoušeno."}, {"16": "ok, takže jediná produkce, na kterou orchestry mají vliv jsou osnovy:[BR][IMG]https://i.ibb.co/H4N8zQ2/https-cz-forum-elvenar-com-index-php-attachments-1662614115803-png-6224.png[/IMG][BR]Ale pokud to dokážeme naklikat přes PP (dříve než nám dojdou), tak nás to nemusí zajímat."}, {"5": "Ano počítáno s tím že valná většina hráčů má PP... Zbytek hold pojede pomaleji."}, {"20": "Dobrá zpráva. Pro jistotu už osnovy zároveň vyrábím doplňkově i v portálu, i když PB mám ještě dost.[BR]Pár sborů ve městě může klidně zůstat,  jen těch 18 je prostě moc, a je fajn, že po vylepšení portálu na 4lv.  některé můžeme dát do skladu. Hned to vypadá radostněji a mění to výhled na strategii hry.[BR]Oceňuji, že osadnická výroba nástrojů je časově stejná, jako u manufaktur a dílen, takže se to dá sladit. To už dlouho nebylo. Jen ty ikonky, které označují ukončenou výrobu, by mohly být barevně výraznější.[BR]Navíc, tahle zvýšená spotřeba PB z nich dělá vítanou odměnu ve věži  [smilie--sprite8] , kdo by to byl ještě před měsícem řekl, že?"}, {"8": "jo jo.. uz zadna vymena PB za... neco jineho [smilie--sprite8] po tehle kapitole nejspis PB uz nebudou a bude uziti pro obchodni stanice [smilie--sprite7]"}, {"20": "@Boobika před časem jsem dala návrh, aby se portálovky daly vyměnit za něco užitečnějšího, ne jen za zlomky. I když 20. kapitola opět vrátila částečně PB jejich význam, tak si myslím, že pro hráče v nižších kapitolách by bylo dobré, kdyby se mohly portálovky výhodněji prodat.[BR]P.S: Jednu obchodní stanici už jsem postavila [smilie--sprite2]. Jistota je jistota ..."}, {"11": "už někdo počítal kolik bude třeba vyrobit? Vidím je ve výzkumu, a na stavbu sborů. Když řeknu např. 3000 bubnů. odpovídá to zhruba?"}, {"20": "Do výzkumu: housle 1240, flétny 1490, bubny 990[BR]+ na 18 sborů housle 828, flétny 990, bubny 660.[BR]K tomu je třeba připočítat něco na výrobu melodií, ale to už jsem neměla trpělivost počítat."}, {"11": "jo, já vlastně počítal počet na sbor krát 18 místo krát 6 a ve výzkumu jsem narychlo taky napočítal trochu víc. No to se mi nezdá nějak moc.[BR]Záleží kolik k tomu na ty melodie"}, {"20": "Řekla bych, že do 2500 od každého bychom se asi zhruba mohli vejít, možná trochu víc. Ta čísla nevypadají až tak strašně."}, {"8": "tak podle elvenarchitekta pokud uz mas vyzkoumanou halvni budovu tak dal[BR][BR]noticek: 33 200 v mem pripade (lvl 1 a sklad 1845, 18 plnych skaldu)[BR]a predpokaldam ze noticky nejsou zapocteny do vyroby housli [smilie--sprite1] [BR]housli: 2 018[BR]fleten: 2 420[BR]bubnu: 1 610"}, {"20": "Měla jsem v počtech malou chybu, přehlédla jsem jednu položku ve výzkumu. Čísla jsem opravila a teď to sedí. I na Elvenarchitekt to mají stejně. [BR]@Boobika asi to máš špatně opsané."}, {"5": "Je fajn ten nárůst kapacity portálu s každým levelem, kdy potom stačí PP méně...lv3 aktuálně 8190 kapacita osnov /dle levelu Uskladnovacího víru/ a na tom už se dá dojed klidněji celá kapitola, s tím že platí výše omýlené - jde si pomoci teleporty, takže náročné na místo ve městě to bude až na konci jednorázově a využiji té cesty předvýroby všeho nutného, aby šlo zbourat nástroje a uvolnilo se místo na oněch 18 orchestrů... necht´se všem daří a kupci chodí častěji a včas domů [smilie--sprite1][BR]PS: nebolí ani tak mana jako čekání na semena, ale tržiště slušně zásobuje á 3h..."}, {"11": "Jo, kde jsou časy kapitoly lodí kde bylo pořád o něčem diskutovat a navrch tam byl prográmek pro výrobu. V téhle kapitole je úkol jasný, připravit hráče o PP, sami jsme si o to říkali, a pokud má někdo smůlu tak mu ani nevystačí. Dále je rozhodující kolik si hráč koupí VB. A nakonec udělat vyčištění města pro finále. Na jednu stránku zajímavá a myslím nenáročná kapitola."}, {"20": "@voyager-1 tak zrovna po lodích se mi nestýská, to byla pro mě nepříjemná kapitola. Ale souhlas, že 20. kapitola vypadá pohodově.[BR][BR]Po vyřešení situace se Sbory, jak jsme tu o ní již dříve diskutovali, je vše v klidu. Po dlouhé době nejsou nároky na místo nijak velké. Ani na Háj + 18 sborů to není nijak strašné, když můžeme teleportovat ostatní výrobu. 4 výrobny nástrojů od každého jsou až dost. Osnovy je třeba vyrábět i v Háji, ale bez portálových bonusů to nejde. Myslím, že nám vystačí, navíc stále získáváme nové, takže to vidím pozitivně."}, {"31": "Tak jsem si s hrůzou plánovala rozložení manufaktur po vylepšení a s údivem jsem zjistila, že se celková zastavěná plocha zmenší. Takže se mi tam vejdou i ty výrobci.[smilie--sprite1]"}, {"2": "Jak zmenší?[BR]Manuchy zůstávají stejné jen se některým změnila orientace"}, {"31": "Asi to bylo tím, že jsem přesunula zbrojnice na jinou část mapy. Ale i tak mě překvapilo, jak to šlo hladce. Když se mění mramorárna z 4x6 na 6x4 a prkenárna z 6x4 na 4x6 tak je stačí akorát prohodit. Teď už mě děsí jen operace najít místo na 18 sborů."}, {"11": "tak tohle mě zrovna neděsí, předpokládám, že máš dost teleportů.[BR]Jinak na slovo děsí jsem poslední dobou už alergickej. [smilie--sprite1][BR]Každý den v médiích čtu jak se někdo něčeho děsí, zuří, běsní  apod. a bývají to kraviny.[BR]Děsit se člověk může z války, rakoviny apod. ale ne z nedostatku místa v Elvenaru. [smilie--sprite1]  Sranda."}, {"31": "Válka mě neděsí, akorát deprimuje."}]