[{"5": "Nestrašte, neděste, nedeprimujte se [smilie--sprite1]... jste ve XX. kap.,tudíž jste prošli úspěšně již 19 předchozích a myslím, že některé byly rozhodně náročnější, tak klid pohoda, někdo rychleji jiní pomaleji, ale přeci...návody zde jsou. msf"}, {"5": "Znovu jsem studoval výzkum a vychází mi, že kdo má Uskladnovací vír aspon lv 14 +26% kapacity portálu, dostane se na požadovanou kapacitu portálu 7500 na dokončení kapitoly /posledních dvou výzkumů na nové divy/ již na úrovni 3.lv portálu, tj by nemusel stavět 3x6 orchestrů nýbrž pouze 3x3 [smilie--sprite1][BR]+ neplnit úkoly samo[BR]jiný zásek tam nevidím"}, {"8": "takovy veci nepis, nebo priste budou externi sklady, na kterenema vliv uskaldnovaci vir (a na plneni ani PB [smilie--sprite2] )..."}, {"5": "Píši jen realitu, kterou výzkum v tomto případě nabídl, nevím zdali nějaké opomenutí ze strany tvůrců či naopak donutit některé si postavit a vylevelovat div Vír....viditelně tuto možnost dosud neřešili ani na Betě /nebo jsem přehédl/...[BR]PS. trochu zklamání co, že se to dá takto jednodušeji zrychlit /ulehčit/...sice se neplní úkoly, ale zde mnozí již tak dělají automaticky, takže si myslím, že tuto cestu někteří zcela jistě využijí již jen kvůli místu, surkám, požehnání, teleportům apod. GL"}, {"16": "Když si vezmu, kolik jeden orchestr stojí (jak místa, tak surovin), tak teď trošku závidím hráčům s dostatečnou úrovní Víru - já jej nemám a nezbývá mi než postavit všech 18 oblud (a pak je odteleportovat nebo smazat).[BR]Viděl bych to jako opomenutí, pochybuji, že je byť jen jediný vývojář v tak vysoké kapitole, aby ho to vůbec napadlo(*). Na beta fóru ta informace již je, takže je úplně jedno, co napíšeme tady.[BR][BR](* - u nás hráčů v aktuálně poslední kapitole je poměrně velký podíl zkušených hráčů, kteří často hledají cesty, jak si kapitoly ulehčit, takže když nějaká skulinka existuje, dříve nebo později na ni jeden nebo více hráčů přijde)"}, {"5": "Jojo máš pravdu, už jsem to našel i na Betě.[BR]Každopádně je to velké zjednodušení koncovky výzkumu XX.kap...přesto, že mám vír na potřebném levelu, sám zvažuji, že kapitolu dojedu i s úkoly tj těch 18orchestrů...uvidím, jak na tom budu až se bude blížit DS, i když asi se to dá částečně skloubit něco vymyslím. hezký den [smilie--sprite1]"}, {"3": "vzhledem k tomu, že do další kapitoly zbývá cca 350 dní, tak pravděpodobně pojedu všechny úkoly, přestože potřebný vír mám a bude mě to stát pár dnů osady ve městě navíc. Ono ostatně, co taky na konci hry dělat, že? pak si to hezky v klídku pouklízím, popřestavuju, pak přijdou prázdniny a dovolené a pak zase ten kolotoč začne nanovo [smilie--sprite1]"}, {"32": "Zdravím,píše se,že sbory mohou být propojeny s hájem přímo i nepřímo.V osadnících žádné nové cesty nejsou a na klasických ulicích které mám propojené s hájem sbory nefungují?"}, {"8": "sbor se musi dotykat primo haje nebo dalsiho sboru (predpokaldm ze stejneho typu."}, {"32": "Tak už mě to docvaklo,nepřímé spojení znamená,že se musí dotýkat alespoň sbory.[BR][BR]Díky je to tak a nemusí být ani stejný typ."}, {"2": "To je dobrá zpráva"}, {"132": "Ahojte, vie mi niekto poradiť ? snažím sa v XX kapitole priebežne plniť úlohy ,ale zasekol som sa na \"Vyrob pero dekana Durcuse\" [BR]Aj keď som to urobil ,nezarátalo mi to . Môže byť problém v tom že tú manufaktúru mám len na 31 Úrovni ?"}, {"2": "To by nemělo, péro je péro, zkus napsat na podporu"}, {"2": "Mám otázku na úkoly.[BR]Úkol 25 Build any of the new Culture Buildings.[BR]Stačí jí mít postavenou, nebo s tímto úkolem musím dokončit stavbu nové kultůrky?"}, {"20": "@GorGlin - musí být hotová"}, {"2": "Cože?[BR]Musím jí postavit než ten úkol dostanu?"}, {"20": "@GorGlin to ne, prostě až úkol dostaneš postavíš ji, ale musí dokončená."}, {"8": "tak tady bych predpokladal asi stejny postup jako u ostatnich budov. pokud ji mas postavenou tak bude splneno. ja ji stavel az kdyz me k tomu vyzval ukol takze na 100% se to rict neda, jestli jim nejde o ten proces \"dokonceni\"."}, {"2": "Muže se mi vyjádřit někdo z podpory?[BR]Když při tomto úkolu napíšu na podporu že už jí mám postavenou aukol je nesplněný.[BR]Ukol mi odkliknou, nebo mi poradí abych postavil další?"}, {"11": "tak úkol zní \"postav\" a ne \"měj\"  Dle mého názoru"}]