[{"2": "@voyager-1 [BR]souhlasím, ale logiku sem nepleť"}, {"5": "GG...taky jsem stavěl až s úkolem, ale asi vklidu postav, pokud máš místo, max ji pak vyměníš za druhou...chce to jen kladiva a mince /a čas/..."}, {"8": "to je pravda, s logikou to nema co delat. tyhle budovy si nikdo dobrovolne nepostavi a uz vubec ne predem, aby blokovaly misto."}, {"2": "Zvedla se mi produkce portálu.[BR]Víte o tom někdo něco?"}, {"11": "to dělají sbory, ne?"}, {"2": "No jo, já už postavil sbor vlastně.[BR]Tak nic.[BR]Díky za info"}, {"32": "Mám dotaz,když schovám do skladu sbory,sníží se pouze výroba osnov a lvl hudebního háje zůstane stejný?"}, {"8": "jo. lvl zustane. jen v pozadavcichn a dalsi upgrade uvidis \"zaporne\" hodnoty na srovnani stavu[BR][IMG]https://i.ibb.co/JkdKvQR/https-cz-forum-elvenar-com-index-php-attachments-1663674468989-png-6228.png[/IMG]"}, {"32": "OK,děkuji"}, {"5": "Mám hotovo /tedy ještě poslední výzkum/: Cesta - co nejdříve portál na 3lv /nutno vír min. 14lv-pak není nutný lv4 portálu/, sbory pak uklidit do skladu a dát co nejvíce nástrojů a na tom již vklidu dojet.....žere to PB, ale pokročilý hráči zvládnou ostatní mohou vyrábět písně v portálu, tím pádem nechat nějaké sbory ve městě, at´je vyšší výroba písní...necht´se vám všem daří [smilie--sprite1][BR]VB do výzkumu z turnaje, případně za mince či suroviny, + nějaké časovače na výrobu v portálu. [BR]Samo lze vše i poklidu, ale mám nějaké ,,povinnosti,, ted na podzim, tak jsem to vzal rychleji...msf"}, {"8": "rad bych rekl jsem ti v patach [smilie--sprite8]  ale tech poslednich 9 vyzkumu pujde pomaleji a patrim do te skupiny co plni ukoly ( a prubezne k tomu)"}, {"20": "Jelikož jsem neměla Vír, tak jsem raději pozastavila VB do výzkumu. Vír už mám nyní na 14 lv. , takže můžu zase pokračovat. Bez Víru je 20. kapitola o dost těžší. Několik posledních kapitol jsem poctivě plnila úkoly, ale v této si nejsem jistá, jestli budu stavět všechny sbory a vylepšovat portál, jen proto, abych splnila úkoly, protože pro hru samotnou to už nepotřebuji. Každopádně teď v klídku dojedu kapitolu.[BR]PS.: Abych urychlila stavbu Víru, tak jsem přes kolečko postupně vyplácala skoro všechny runy v ostatních divech  [smilie--sprite6]. Ale to neva, hraju slušný turnaj, takže runy za chvíli zase budou."}, {"8": "zivouci v odmenach za ukoly je prijemny bonus a kazdopadne lvl4 jeste navysuje rychlost produkce pisni (a zvetsenim kapacity samozrejmne uspori par portalovek na dalsi rok [smilie--sprite8] takze jestli mas jeste udelat 100 pisni mas to nasledne usporu casu na vyrobe nejakych 100h (nebo usporu v urcyhlovacich)[BR]edit: -70h ci kolik je ten upgrade [smilie--sprite8]"}, {"20": "@Boobika díky Arše ty odměny živoucího mám taky, ale jelikož běžně vyrobím dostatek a zásob hafo, tak tato odměna pro mě není nic zásadního. Ohledně zvýšení rychlosti výroby v portálu 4 lv. a porovnáním s náklady na jeho stavbu, jasně pro mě vítězí nechat portál na 3 lv.[BR]Díky věži se mi portálovky slušně doplňují, takže není co řešit. Samozřejmě je rozdíl, jestli spolek hraje Zlatou věž každý týden nebo ne, protože portálovky jsou, krom jiného, i ve společných odměnách."}, {"21": "Ludi napsal/a:\t\t\tSamozřejmě je rozdíl, jestli spolek hraje Zlatou věž každý týden nebo ne, protože portálovky jsou, krom jiného, i ve společných odměnách.\t\tKlikněte zde pro zvětšení...Nezáleží portalovek mám plno a věž kvůli tomu hrát až nahoru nebudu"}, {"3": "Věž až nahoru se přece hraje pro dia... Vyměnit kladívka (cti vojáky) za dia, to je vždycky dobrý nápad [smilie--sprite1])"}, {"2": "@Boobika [BR]zrychlí se produkce písní?"}, {"8": "@GorGlin  prida se pisen, ktera je za 3h/ks + je tam plnych 5 poli."}, {"20": "@indian068 ve 20. kapitole se vztah k portálovým bonusům zásadně změní. Do teď jsme je považovali téměř za odpad, ale 20. kapitola má mega spotřebu.[BR]@Emhyr var Emreis II samozřejmě jsem nikdy nehrála věž kvůli zisku portálovek  [smilie--sprite8], naopak jsem byla naštvaná, jak mi ve věži často padají. Ale v mém příspěvku výše píšu, že krom jiného, jsou u Zlaté věže portálovky i ve společných odměnách. Takže kdo hraje pravidelně věž až nahoru a je ve spolku, který hraje Zlatou věž, tak má pravidelný přísun portálovek zaručen.[BR][BR]@GorGlin  Co se týče rychlosti výroby v portálu: když se podívám, kolik urychlovačů bych spotřebovala na vylepšení na 4 lv., tak když to dám na urychlení výroby v portálu 3lv., tak asi není co řešit. Nehledě k tomu, že na vylepšení portálu na 4 lv. potřebuju vyrobit dalších 20 písní."}, {"21": "Ludi napsal/a:\t\t\tve 20. kapitole se vztah k portálovým bonusům zásadně změní. Do teď jsme je považovali téměř za odpad, ale 20. kapitola má mega spotřebu.\t\tKlikněte zde pro zvětšení...Mě 20 kapitola nezajímá jen opakuji kvůli Pb hrát věž na horu hrát nebudu,hru si dokážu přizpůsobit dle svého"}]