[{"20": "@indian068 - když tě 20. kapitola nezajímá, tak proč přispíváš do vlákna, kde si sdělujeme zkušenosti ze hry ve 20. kapitole? [BR]Hraj si jak chceš, to je tvoje věc. Ale tady se bavíme k určitému konkrétnímu tématu, takže se pak nediv."}, {"21": "Ludi napsal/a:\t\t\tve 20. kapitole se vztah k portálovým bonusům zásadně změní. Do teď jsme je považovali téměř za odpad, ale 20. kapitola má mega spotřebu.\t\tKlikněte zde pro zvětšení...Reagoval sem na tvou odpověď,jinak váš nedostatek pb je spusoben vasima navrhama[BR][BR]Odstraněna citace. Embla"}, {"20": "@indian068 nestěžovala jsem si na nedostatek portálovek [smilie--sprite8]. Ale je fakt, že spotřeba ve 20. kapitole je úplně diametrálně jiná, než v nižších kapitolách. S tím ještě nemáš zkušenost [smilie--sprite6]."}, {"21": "To taky netvrdím že sis stěžovala,tvůrci jen vyřešili problém s přebytkem portalovek,jestli mam nebo nemám zkušenosti tě nemusí zajímat mám  jinej styl hrani než ty[BR][BR]Odstraněna citace. Embla"}, {"5": "Nikdo věž nehraje nahoru kvůli portálovkám /ale možná i někdo do budoucna začne/ [smilie--sprite1][BR]Věž nabízí jedny z nejlepších odměn hry, takže ji hrát až nahoru je značný bonus jak pro samotného hráče, tak brát celkové zlato pro spolek.[BR]PB se léta hromadila ve skladu, osobně jsem tisíce % rozcraftil na ulomky, ale ta doba končí, pokud se budeme pohybovat stejným směrem jako ve XX.kap. tj ano kapitola žere mraky PB a bud´se kapitola pojede extrémně pomalu /na můj vkus ne/ nebo bude člověk cíleně ,,vyhledávat zisk,, PB tj v eventech, akademii a samo i ve věži atd.[BR]Návrh /asi Voyager?/ na rušení PB ve věži padl v době, kdy se hromadila PB ve skladech / a tudíž smysl tehdy měl/, a dokonce myslím následně s poslední kapitolou i padlo, že ten návrh by se měl zrušit...[BR]Každý hraje pochopitelně svůj styl, ale mnohdy scénář a možnosti hry stejně vedou jen jednou cestou případně pouze dvěmi [smilie--sprite1] jako nyní... nehledě na další vylepšení a změny ve hře, která opětovně nutí ke změnám dřívějších zaběhlých strategií jednotlivých hráčů-což je i dobře, proto je hra pestrá, zábavnější -i když může působit určitým typům měst jisté komplikace, je to vývoj.[BR]A stále nezapomínejme: je to jen hra [smilie--sprite1] co by měla přinášet pobavení a relax od live života.[BR]Tak si hezky hrajte lidičky....kdo si hraje nezlobí [smilie--sprite1] msf"}, {"20": "Jednu věc bych tu chtěla zmínit: Po delší době mi připadá 20. kapitola hodně povedená, budovy jsou moc krásné. Téma velmi pozitivní.[BR]Určité nepříjemnosti ze začátku udělal popis vylepšování portálu na Wiki, protože umožňuje dvojí výklad. Ale díky společné diskuzi na betě a následně i zde, se podařilo vše brzo vyjasnit. Takže díky všem spoluhráčům na fóru, kteří pomáhali se správným řešením.[BR]Hodně pomohla i připomínka, že při Víru minimálně na 14. lv., je možné dohrát kapitolu s portálem na 3 lv. Myslím, že teď už kapitolu všichni dojedeme v klídku, každý svým tempem."}, {"2": "Já jsem teď hlavně zvědav na tu píseň s tříhodinovou výrobou"}, {"11": "@ElfNostradamus  Já jsem nevinej [smilie--sprite1], já žádný vlákno o rušení PB nezakládal. Já jen ze srandy do jednoho, ale to vlákno nebylo vyloženě o rušení PB, napsal, že jsem s vývojáři domluvil, že půjdou měnit za diamanty. A kdyby mě poslechli, byla by alespoň sranda. Hamouni by všechny PB za ty diamanty vyměnili a teď by kapitolu hráli dva roky [smilie--sprite1]"}, {"8": "taak hotovo! i vcetne ukolu [smilie--sprite1]"}, {"11": "jo, nakonec to bude kapitola na 6 týdnů jak za starých časů [smilie--sprite1]  Mě ještě 6-7 výzkumů chybí."}, {"5": "Zatím aktuálně vše šlape...občas je dobré kolečka promazat a vypsat znovu, když je tam hodně zpráv ve vlákně, tak se to časem může ,,sekat,,..."}, {"20": "Včera jsem ukončila výrobu písní i nástrojů, teď už jen čekám na začátek DS, abych odehrála turnaj a tím i získala potřebné VB ke kompletnímu ukončení 20. kapitoly. Úkoly jsem nakonec splnila všechny, takže portál na 4lv. jsem zvedla.[BR][BR]Moje shrnutí kapitoly:[BR]1. Grafika opět velmi povedená.[BR]2. Téma kapitoly je pozitivní, rozhodně lepší než minulá kapitola, která působila poněkud depresivně.[BR]3. Výroba Nástrojů i Písní jde celkem dobře, vyšší náklady na stavbu Sborů jsou náročné, ale dá se to dobře zvládnout.[BR]4. Jak už tu uváděli i jiní hráči, tak kapitola se dá v klidu dohrát s portálem 3l. + div Vír minimálně na 14. lv. Samozřejmě se tak nedají splnit všechny úkoly, ale komu to nevadí, tak je to možnost. Vír je nyní důležitý, dá se očekávat, že spotřeba portálových bonusů bude i v další kapitole velká, takže význam tohoto divu stoupl.[BR]5. V minulé kapitole hráči přidávali Bludiště nebo Maják, aby posílili výrobu many, což díky tomu v této kapitole již není velký problém. Teď hoří semínka, ale kdo má Soumračné věže, tak to není zase takové drama. No a kdo neměl před začátkem 20. kapitoly Vír, tak ho honem postavil (jako já) a dobrý [smilie--sprite2].[BR]6. Portál na 4 lv. vyrábí stejné písně jako portál 3 lv., všechny po 4 hod., ale přibude Enarovo blues (obrázek jednorožce), který trvá jen 3 hod. a také požaduje méně nástrojů na výrobu. Váhala jsem, jestli zvednout portál na 4 lv., jelikož to chtělo spoustu teleportů a urychlovačů, ale nakonec jsem to udělala a průchod kapitolou to v konečném důsledku urychlilo tak minimálně o 2 týdny.[BR]7. Celkově svižná kapitola a po vyjasnění výkladu počtu Sborů na vylepšení portálu, je vše v klídku. Už dávno se mi nestalo, abych v kapitole měla výrobu rychlejší, než počet VB do výzkumu a to hraji turnaj v průměru nad 10K.[BR]8. Období klidu při čekání na další kapitolu je fajn, vylepšují se divy a pohodička, takže pokud bude teď delší pauza před příchodem 21. kapitoly, tak to vítám."}, {"2": "@Ludi [BR]Kolik ti za den dá město VB?"}, {"20": "@GorGlin - 34 \"živých\" VB z kultury + 24 co běžně padne po hodinách. Výjimečně něco padlo ze Slávy hbitosti, ale málo, za kapitolu asi 2x. Poměrně často jsem dostala 35 VB v odměnách Tajemného objektu v Akademii. Placku na VB do divů tu nezapočítávám, těch mám samozřejmě z kultury také poměrně dost + máme už bonus na 10 VB. Ale výnos VB se samozřejmě mění, jak některé kulturky uklízím kvůli místu."}, {"11": "Koukám, že nejenom mi mizí vlákna ze zpráv ale zmizelo i tady mnoho příspěvků ohledně aktuálního problému. Nebo byly přesunuty jinam ? Nic jsem nenašel Pravda měl jsem to napsat do vlákna chyb ale problém přetrvává."}, {"20": "@voyager-1 diskuse o chybách ve hře byla přesunuta sem: https://cz.forum.elvenar.com/index.php?threads/verze-1-160.8212/"}, {"3": "Tak hotovo. Kapitola se tak nějak ukončila sama, takže na zbytek úkolů holt kašlu[smilie--sprite1]"}, {"11": "já zvedl portál když jsem už měl kapitolu prakticky hotovou a dodělal úkoly."}, {"16": "Já ještě 3 technologie, úkoly neřeším, otravuje mne tam úkol zaplať manu, který spolu s těmi za ním zase odklikám v nové kapitole.[BR]Na betě jsem stále seknutý u vylepšování portálu (lv3) a už vyrábím osnovy v portálu, neboť mi tam prakticky došla PPčka. Takže tam kapitola ještě chvíli potrvá, zatímco na cz1 už si budu užívat mezikapitolový klid."}, {"8": "na co tu manu syslite? stejnak se ve skaldu rozpadne... a vyprodukovano je to za par dni.."}]