[{"2": "já to chápu, ber to jako když ti ex navrhne, že umyješ auto, uklidíš garáž, vymaluješ kuchyň a postavíš pergolu.[BR]A za to všechno se můžeš celý víkend starat o děti.[BR]Ty věci je potřeba udělat a já svoje dcery miluji.[BR]Ale když to neudělám, tak budu mít spoustu volného času kdy se můžu těšit na víkend s dcerami.[BR]Nedám nic a výsledek stejný."}, {"16": "Protože na betě jsem ten úkol nakonec udělal jenom abych téměř vzápětí dostal úkol na výrobu neposíleného zboží (a hráči, kteří musí vyrábět osnovy v portálu rozhodně nebudou mít manu nazbyt). [BR]Takže podle mne nemá smysl dělat úkoly, dokud jen zdržují a otravují namísto aby pomáhaly."}, {"133": "Mám dotaz,[BR] když je nutné bubnový, flétnový a houslový sbor spojit s hudebním hájem, přímo, nebo nepřímo, co myslí tím nepřímo?[BR]Díky"}, {"11": "sbor se nemusí dotýkat přímo háje ale stačí  dotýkat se jiného sboru."}, {"16": "Znamená to něco takového (Portálu se přímo dotýká jen jeden sbor, všechny sbory jsou funkční):[BR][IMG]https://i.ibb.co/4fFR5Zz/https-cz-forum-elvenar-com-index-php-attachments-1665916132787-png-6294.png[/IMG]"}, {"3": "voyager-1 napsal/a:\t\t\tjá zvedl portál když jsem už měl kapitolu prakticky hotovou a dodělal úkoly.\t\tKlikněte zde pro zvětšení...taky jsem to chtěl dorazit. Měl jsem už i všechny sbory po 4. Jenže pak mi došlo unurium. Nebyla zrovna věž ani event a na tržnici ho nevyrábím. Navíc přišlo DS, no a tak nějak jsem mezi tím téměř dojel kapitolu a v rámci uklízení DS jsem to zbořil rovnou všechno a je [smilie--sprite8]"}, {"6": "Ale koukám, že rychlíci už kapitolu dodělali. Dva měsíce. Pro mne dobrá zpráva.[BR]Takže, když cca za měsíc dodělám ty ucourané vyhnance, tak bych mohl mít někdy v únoru lážo plážo.[BR]To by šlo."}, {"16": "Pokud máš dostatek všeho, tak ano, nicméně tahle kapitola je náročná na mnoho věcí, od PPček, přes semena/unurium až po prošlé (živoucí) zboží, jehož produkce může být omezující pro počet výroben nástrojů (zejména pro hráče nemající dostatečnou produkci semen/unuria).[BR]Dalším aspektem je přítomnost nebo absence Uskladňovacího víru, který na 14+ (za dostatku PPček) může ušetřit stavbu 9 z 18 orchestrů (dohrání kapitoly s portálem lv3).[BR]Jsou i případy, kdy je pro některé hráče levnější vylepšit Uskladňovací vír z 0 na 14 namísto stavby 9 orchestrů navíc.[BR][BR]Ideální pro tuhle kapitolu je mít na vysoké úrovni Valoriánskou věž a Chrám duchů, jejichž kombinace umožní hráči trvale vyrábět v tržišti jen semena (o unurium se postarají divy (Chrám je nejúčinější pro hráče dělající celou věž a poctivě sbírající balíčky událostí kolem vesnice a Val. věž je nejúčinější s hodně magickými obytkami, ale zejména svým 2% rozpadem unuria na 30+))."}, {"11": "Podle mě kapitola na 4-5 týdnů, i s portálem na lvl. 4.  Val. věž nemám vůbec, chrám duchů přes 30. Rozhodující jsou podle mě spíš soumračný věže. Bez nich je to tak na dva měsíce nebo více. Záleží jestli hráč chce postavit 18 sborů. Stačí mít po 4. výrobnách, kvůli semínkům  a do dvou měsíců se to dá zvládnout."}, {"16": "Ano, samotný Chrám na vysoké úrovni to může dokázat uživit, nicméně v kombinaci s Val. věží je to ještě lepší (zejména díky akumulaci mezi kapitolami)[BR]Takže pro dostatek unuria je Chrám základ(*) a Věž příjemný bonus (nicméně jako u všeho rozpadajícího 2% a 10% rozpad je dost velký rozdíl).[BR][BR]Soumračné věže - ano, 2% rozpad je prostě znát.[BR][BR]Na cz1 jsem taky jel se 4 výrobnami nástrojů (z každého druhu).[BR]Na betě jich mám méně, dlouho nestíhala produkce semen - 127k semen za jednoho výrobce není málo, zvlášť, když tam ještě musím sdílet tržiště pro semena i unurium a výroba v nich spotřebovává zboží, které se zase vyrábí ze semen(**). [BR]A s nižší produkcí semen se člověk snadno může dostat do situace (zvláště, když staví sbory), kdy prostě přestane vyrábět prošlé(živoucí) zboží a tím i nástroje, aby vůbec dokázal našetřit semena na postavení sborů.[BR](a obchodníci na betě jsou vyloženě samostatnou kapitolou (často bývá nejrychlejší strategie za pomocí urychlovačů měnit T9>T7, než měnit T7>T7 a stejně čekat 6 hodin))[BR][BR](*) - Počítá se samozřejmě aktivita na úrovni zlaté věže, hráči, co nehrají věž a sbírání měny událostí kolem vesnice jim nic neříká jej ani nemusí stavět, jelikož jeho produkce je navázána na aktivitu hráče právě v těchto dvou věcech (věž silněji než sbírání měny).[BR][BR](**) - Jinak řečeno, pro města s nižší výrobou semen/unuria tahle kapitola může být noční můrou a značně se protáhnout, jelikož stíhat vyrábět T4-T9 a ještě u toho utrácet statisíce semen za osadnické budovy může být pro slabší města prostě moc náročné."}, {"2": "@iDavis [BR]Ahoj, Inno upravilo úkol 79 ted chce 2 písně.[BR]Tomu kdo to udělal bych popřál něco nepěkného."}, {"6": "Dospěl jsem k závěru, že úkoly víceméně pouze zdržují a jsou v posledku na dvě věci. Howgh."}, {"16": "@Schoenfeld Vítej do klubu."}, {"29": "GorGlin​ 79 úkol: jestli je tam teď daruj 2 písně, je přeci skoro jedno. Raději 5 zkomponuji než 2 daruji [smilie--sprite2] (přece nezahodím 6 hodin času)"}, {"8": "ti co jdou ukoly prubezne tenhle ukol zaznamenaji jen tim ze si ho prectou. protoze pisne vyrabi porad [smilie--sprite2]"}, {"2": "Neměl jsem dost otevřených provincií a než jsem je prozkoumal byla kapitola hotová.[BR]Takže jsem se nachystal na dodělání a krom portálu už je všechno uklizené.[BR]Takže musím vytáhnout dílnu a vyrobit abych mohl vyrobit ještě tu druhou píseň."}, {"6": "@Lovec Krys  Zdrávi došli.[BR]11 líhní 4, další v pořadí.[BR]Ale jde to jako když kálí a čmárá."}, {"6": "Tak jsme tady, tak jsme tu.[BR]Je tu s námi Vinetou.[BR]A jedeme do plných.[BR]Než se z toho..."}, {"11": "tak gratulace a do další kapitoly jdeš s námi [smilie--sprite1]  času dost."}, {"8": "presne tak. tohle mas za par tydnu sfouknuto [smilie--sprite1] priprav PB a rozpal kotel [smilie--sprite8]"}]