[{"21": "Dear Humans and Elves,[BR][BR]Please use this thread to discuss the upcoming new chapter, the Traders of Unur, which will become available later today.[BR][BR]We're looking forward to your feedback![BR][BR]Kind regards,[BR]Your Elvenar Team"}, {"22": "I'll start this off by saying that Chapter 17 is the worst chapter created. I'm not sure whether the devs really don't understand the mutiplicative impact of completing these researches compared to tournament difficulty, or whether they are just happy to make things more and more difficult for late game players.[BR][BR]The small increase in training speed gained from the barracks upgrade will not compete with the increased difficulty in using those troops when having completed the research. With no other useful military gains offered they have provided no reason at all for wanting to play this chapter.[BR][BR]To compound things further they are also putting pressure on players to have as many chapter level residences as possible compared to event buildings that provide population. This does not fit with my play style as I don't wish to create an ugly city with rows of big residences that all look the same. For this reason alone I can say right now that I will never play through this chapter - The only thing that might change my mind is if and when they launched a future chapter which looks so good that I have to go through Chapter 17 to get there.[BR][BR]You could say that one positive is the extra province expansion that we will all get. That's no longer particularly exciting though, as I won't consider placing it unless I had a desperate need for that extra space."}, {"23": "Pauly7 said:\t\t\tmany chapter level residences as possible\t\tClick to expand...For a long time I have been playing with only 16 residences - 8 magical and 8 conventional.[BR]And they are enough for me.[BR]It is true that there was a time when I played in more than 30 residences.[BR]Regarding Chapter 17, I couldn't find out enough from the beta forum to have any serious opinion. In the wiki, I saw that the main buildings were rotating, which required new city planning - something I always enjoy doing."}, {"1": "The mechanics for Chapter XVII's settlement it is interesting [smilie--sprite1] The graphics are wonderful too. Especially one of the AW is very nice too!"}, {"22": "Viskyar said:\t\t\tFor a long time I have been playing with only 16 residences - 8 magical and 8 conventional.[BR]And they are enough for me.[BR]It is true that there was a time when I played in more than 30 residences.\t\tClick to expand...In chapter 17 the amount of Unurium you can produce is based on required culture and working population, so they've made it that you will need many top level residences, instead of culture/pop buildings, in order to progress."}, {"24": "I haven´t played chapter 16 because it was an entirely useless chapter and this chapter 17 looks nearly as bad as the previous one, no reason whatsoever to play either of the 2 until the tourneys are fixed."}, {"25": "The buildings in this are so massive.  9x4, 4x9, and 6x6 all attach to a huge portal, then more attach to those 3.  Also, I just now noticed that when I set up my Training Grounds my troops now take 14:38 hours.  Was there a change in the training time?"}, {"24": "Maillie said:\t\t\tThe buildings in this are so massive.  9x4, 4x9, and 6x6 all attach to a huge portal, then more attach to those 3.  Also, I just now noticed that when I set up my Training Grounds my troops now take 14:38 hours.  Was there a change in the training time?\t\tClick to expand...[BR]Not that I know of... If it went up, did you build/upgrade Armories/Dwarven Bulwark/Shrooms since you last checked? If it went down, did you upgrade your VicSprings?"}, {"23": "Pauly7 said:\t\t\tUnurium you can produce is based on required culture and working population, so they've made it that you will need many top level residences\t\tClick to expand...The working population is not determined by the number of residences.[BR]The high number of working population is formed mainly by the number and level of manufactories. I have never had the most developed manufactories - this burdens my city with high requirements for culture and number of residences, and the additional extraction of resources is of dubious benefit - the more developed a manufactory is, the less efficient it is.[BR]I am not convinced that even if I buy all possible expansions with diamonds, I will have a high enough yield of unurium to pass Chapter 17 quickly."}, {"23": "I am pleasantly surprised by the technological tree - two expansions at the very beginning of the head is excellent. Optional combat technology is also a good solution.[BR]I am unpleasantly surprised that magical residences and workshops must first be studied in the technical tree and only then developed.[BR]Question: @Muf-Muf[BR]Will there be trophy buildings from the events that will produce unurium? Will they be new buildings or will some of the seeds so far in Chapter 17 give unurium?"}, {"6": "\"Antique Artifacts, which are produced in the Esperia, flagship of the Collectors.\"  [BR][BR]We are all being lied to.[BR][BR]The \"Collectors\" are producing \"Antiques\"."}, {"22": "Viskyar said:\t\t\tThe working population is not determined by the number of residences.\t\tClick to expand...Yes, but the important part is that production is determined by required culture.[BR]Viskyar said:\t\t\tI am not convinced that even if I buy all possible expansions with diamonds, I will have a high enough yield of unurium to pass Chapter 17 quickly.\t\tClick to expand...And if you did do that you can expect tournament performance to be hit even harder, if that concerns you."}, {"6": "I really wish people would quantify what \"quickly\" means to them..."}, {"14": "anonglitch said:\t\t\tThe mechanics for Chapter XVII's settlement it is interesting [smilie--sprite1] The graphics are wonderful too. Especially one of the AW is very nice too!\t\tClick to expand...[BR]The graphics, yes.[BR]In all other regards, these AW are a waste of your space. You are better off with some extra libraries, as these do not make your tournament overly difficult."}, {"26": "So the main question is: are the devs unaware of the research impact on the tournament requirements or are devs thinking that the players are unaware of it? The military building upgrades are not enough to even compensate for doing this chapter, not to mention chapter 16. Who decided that it will be a good idea to design the game where not playing is the best strategy? [BR][BR]Most of the production increases in the event buildings are making me laugh. I get that with the buildings that are now considered too powerful, like Jesters Tavern, the devs are trying to indirectly nerf them. But the increase from 310 to 320 for the Valorian Valor and from 370 to 380 for the Groungs of the Orc Strategist? Seriously, what? After the tournament revamp they got much less useful as it is and are loosing value with each city upgrade, because their production doesn't scale. So maybe it could be a good idea to buff them by at least 14% which will be the added cost of completing this chapter, without placing any expansions or upgrading any AWs.[BR][BR]Do you have two separate teams, which are unaware of each other? One that did the tournament revamp and the other that designed the chapter? Otherwise I see no reasonable explanation for what I'm seeing here."}, {"22": "Errandil said:\t\t\tWho decided that it will be a good idea to design the game where not playing is the best strategy?\t\tClick to expand...And therein lies the question."}, {"23": "Pauly7 said:\t\t\ttournament\t\tClick to expand...The only thing that makes sense to take from the tournament is the Blue Print.[BR]Under the new rules of the tournament, this is more than easy.[BR]Anyway, to complete a task from the events. The tournament is no longer as interesting and useful as before the change of rules."}, {"23": "Errandil said:\t\t\tGroungs of the Orc Strategist\t\tClick to expand...This building in the big chapters is absolutely useless - I recently looked at the numbers: The orc strategists I get in 12 hours from 81 space tiles in my city, including street tiles, I can get in about 1.5 hours from the barracks. 81 tiles are more than 3 wasted space expansions."}, {"27": "Viskyar said:\t\t\tThis building in the big chapters is absolutely useless - I recently looked at the numbers: The orc strategists I get in 12 hours from 81 space tiles in my city, including street tiles, I can get in about 1.5 hours from the barracks. 81 tiles are more than 3 wasted space expansions.\t\tClick to expand...Shouldn’t also orcs be considered? Grounds of Orc Strategist requires nothing for its production. Training Grounds require one orc for each Orc Strategist (or less if you consider Simia wonder). Where do you get them? Doesn’t your source also require some space?[BR]EDIT: And orcs are not the only thing. The building has some requirements just to exist/be built."}, {"6": "Errandil said:\t\t\tWho decided that it will be a good idea to design the game where not playing is the best strategy?\t\tClick to expand...Obviously, INNO is about to launch an MMORP Chess game.  [BR][BR]5 points to your Elvenar House if you get the reference..."}]