[{"6": "FieryArien said:\t\t\tShouldn’t also orcs be considered? Grounds of Orc Strategist requires nothing for its production. Training Grounds require one orc for each Orc Strategist (or less if you consider Simia wonder). Where do you get them? Doesn’t your source also require some space?[BR]EDIT: And orcs are not the only thing. The building has some requirements just to exist/be built.\t\tClick to expand...And Orcs require Tools."}, {"28": "Sir Derf said:\t\t\tI really wish people would quantify what \"quickly\" means to them...\t\tClick to expand...Based on guest race production and unurium, I'd expect that this chapter will take about 3 months to complete. That's with pretty sizable settlement (1+3+3 or 1+0+7 each)."}, {"29": "Has anyone worked out space required for full settlement please ?"}, {"23": "FieryArien said:\t\t\tGrounds of Orc Strategist requires nothing for its production\t\tClick to expand...If you think so, you probably have 1234567890 expansions won with a game?[BR]The territory of the city is the main stopping resource in the game - as much as 25% of the possible area must be paid with real money. All other resources you can win with a game.[BR]Orc Strategist from this building only seemingly demand nothing. In fact, they demand too much for what they give.[BR]Grounds of Orc Strategist is only useful in small chapters while fighting a weak enemy army with one star."}, {"23": "Robbo1894 said:\t\t\tHas anyone worked out space required for full settlement please ?\t\tClick to expand...I can only offer the pirates only this:[BR][IMG]https://i.ibb.co/61YPb7p/https-en-forum-elvenar-com-index-php-attachments-unuri-jpg-4901.jpg[/IMG]"}, {"6": "Viskyar said:\t\t\tIf you think so, you probably have 1234567890 expansions won with a game?[BR]The territory of the city is the main stopping resource in the game - as much as 25% of the possible area must be paid with real money. All other resources you can win with a game.[BR]Orc Strategist from this building only seemingly demand nothing. In fact, they demand too much for what they give.[BR]Grounds of Orc Strategist is only useful in small chapters while fighting a weak enemy army with one star.\t\tClick to expand... Diamonds can be gotten without paying real money.  I personally have 9 Premium Expansions without ever having paid money.  Of course, it's harder to do now, without Wishing Wells, but still, you can win at least some of this resource with the game as well.I wouldn't say it is a stopping resource, but a limiting or slowing resource.  Having said that I have Premium Expansions, I'm not able to say this out of personal experience, but I believe it is possible to continue without them.  Slower, but still possible."}, {"23": "Sir Derf said:\t\t\tI personally have 9 Premium Expansions\t\tClick to expand...I'm 28. But that doesn't change the essence of things - I think I only have a modest economy and relative comfort.[BR]I looked at your city - I would be interested to read your opinion on the area and comfort of the game when you enter the next chapter. For this chapter, it is clear that you have a reserve, depriving yourself of many trophy buildings received from the events.[BR]The first 4-5 paid expansions can be taken with the diamonds for completed chapters in the game. If you limit yourself to 2-3 builders and 3-4 level Magic Academy. For the 29th expansion alone, I have to play actively in the tower for at least a year, and I am not convinced that my economy will be enough for that purpose. I wouldn't call it good gameplay."}, {"24": "In my case i have 13 premium expansions and they are completely unnecessary, I have tons of empty space that I plaster with fun stuff in between FAs for the entertainment value, like a lvl 1 embasssies settlement or lots of event buildings or factories that produce goods which I have far more of than I need...[BR][BR]The only reason I have them are FAs, which are my favorite event. But for anyone less interested in FAs Premium expansions are not necessary to play. [BR]The only other 2 reasons to have them that I can see is a) interest in ranking and b) laziness/inability (or another reason) that leads to running an inefficient city..."}, {"22": "Gargon667 said:\t\t\tThe only other 2 reasons to have them that I can see is a) interest in ranking and b) laziness/inability (or another reason) that leads to running an inefficient city...\t\tClick to expand...Or the new reason is that people may decide to place premium expansions instead of regular ones, as they impact the tournament less."}, {"6": "Viskyar said:\t\t\tThe territory of the city is the main stopping resource in the game - as much as 25% of the possible area must be paid with real money. All other resources you can win with a game.\t\tClick to expand...Sir Derf said:\t\t\tDiamonds can be gotten without paying real money.  I personally have 9 Premium Expansions without ever having paid money.  Of course, it's harder to do now, without Wishing Wells, but still, you can win at least some of this resource with the game as well.\t\tClick to expand...Viskyar said:\t\t\tI'm 28. But that doesn't change the essence of things. I think I only have a modest economy and relative comfort.\t\tClick to expand...[BR]The essence of things...[BR][BR]You said as much as 25% of the main stopping resource must be paid with real money.[BR][BR]I gave myself as a case study of one who has acquired 9 of the 39 possible Premium Expansions without spending real money.  That's 23% of your 25%, or 5.9% of available Expansions.  I prove that your \"must\" is more of a may.[BR][BR]And your response to that is to say you have 28?  It is unclear from your statement if you acquired them by paying or not, so I don't know if you're negating your own original argument.  And that you have a modest economy and relative comfort.  Is that supporting or refuting the \"main stopping resource\" part of your original argument."}, {"6": "Also, as to my current city layout, you don't know what my current situation and plan is...[BR][BR]Irrelevant as it is, I'll say that I'm in a pre-chapter holding pattern, finishing my upgrades, preparing my production capability for what I project are my needs for the upcoming chapter, using some of my inventory store, building my stockpile, and looking towards the next FA before working in earnest on the new chapter."}, {"2": "Am I wrong or the first tech is asking the same sentient, no matter what your boosted is? Mine are Gum and Velvet and the requirement was for Moonstone and Ink. I asked a fellow who has different boosted sentient and had the same requirement.[BR]This is insane and totally wrong. Already the \"sharks\" are asking 0* for those 2 particular sentient. [smilie--sprite4]"}, {"28": "Alcaro said:\t\t\tAm I wrong or the first tech is asking the same sentient, no matter what your boosted is? Mine are Gum and Velvet and the requirement was for Moonstone and Ink. I asked a fellow who has different boosted sentient and had the same requirement.[BR]This is insane and totally wrong. Already the \"sharks\" are asking 0* for those 2 particular sentient. [smilie--sprite4]Click to expand...I don't think research costs were ever tied to your boosts. These are exactly the same for everyone (races differ early on)."}, {"23": "Sir Derf said:\t\t\tI gave myself as a case study\t\tClick to expand...You give yourself as an example of a person who likes to write and read himself - what is incomprehensible about the fact that any resource can be won with a game, but part of the territory must be paid with money?[BR]Even diamonds can win a game. But what amount?[BR]It is ridiculous to discuss WW - the game since the introduction of the tower and in the foreseeable future does not imply their presence, even in single pieces.[BR]I will paraphrase so that there are no accusations of sexism: Who ate and drank - ate and drank, the wedding is over and the tables with food and drink are cleaned.[BR]I will help you a little:[BR]A player who reaches the 17th chapter, if he does not spend diamonds for a builder/s and a magic academy, can win with a game only 4 premium expansions. If we add the diamonds from the tower and the Gins, a player at the end of the game - in a few years, will probably succeed in two or three more."}, {"30": "Pauly7 said:\t\t\tIn chapter 17 the amount of Unurium you can produce is based on required culture and working population, so they've made it that you will need many top level residences, instead of culture/pop buildings, in order to progress.\t\tClick to expand...Isn't the working population is the population requirement irrespective of from where they are coming from?"}, {"22": "skelve said:\t\t\tIsn't the working population is the population requirement irrespective of from where they are coming from?\t\tClick to expand...Yes, but 'required culture' does not increase by having event culture/pop buildings. If your city has too many of those then your required culture will be too low to produce significant amounts of Unurium."}, {"27": "skelve said:\t\t\tIsn't the working population is the population requirement irrespective of from where they are coming from?\t\tClick to expand...Pauly7 said:\t\t\tYes, but 'required culture' does not increase by having event culture/pop buildings. If your city has too many of those then your required culture will be too low to produce significant amounts of Unurium.\t\tClick to expand...Problem with culture is straightforward, as Pauly7 wrote. However, the problem with population is also there. It comes mainly from the event buildings that are able to replace factories. Hypothetical example: if I get all my needed T2 production from special buildings and don’t have any T2 manufactory, my working population (and used culture) will be lower than if I used the manufactories instead. There is also some bonus space gained (not that much), but what I place in such space certainly won’t consume the same amount of population (and culture).[BR][BR]In other words using non-standard (event) buildings to optimize the city used to have only positive effects on the city.*) However, in the newest chapter it has also negative effect: on Unurium production.[BR][BR]*) Said by a player who doesn’t pursue high ranking score. City that is optimized using event buildings tends to have lower ranking than similarly developed city that mainly uses standard buildings. The reasons are exactly the same as the reasons for lower Unurium production."}, {"4": "I just got an email for ch17 giving 1 teleport spell."}, {"30": "m4rt1n said:\t\t\tI just got an email for ch17 giving 1 teleport spell.\t\tClick to expand...Thanks for the info. Found that in my email."}, {"6": "Emphasis mine...[BR]Viskyar said:\t\t\tYou give yourself as an example of a person who likes to write and read himself - what is incomprehensible about the fact that any resource can be won with a game, but part of the territory must be paid with money?\t\tClick to expand...[BR]My issue has been with your assertion that the Premium Expansions must be bought with money. [BR][BR]Viskyar said:\t\t\tThe territory of the city is the main stopping resource in the game - as much as 25% of the possible area must be paid with real money. All other resources you can win with a game.\t\tClick to expand...[BR]This is not true.  Premium Expansions do not have to be bought with money.  Premium Expansions are paid for with Diamonds, and Diamonds can be gotten without paying money.[BR][BR]I can only work off the words you wrote.  Your wording started with, and at least partially continues with, the absolute assertion that all Premium Expansions are obtainable only with real money.  I am pointing our that that is not true.  The game gives Diamonds in multiple ways that do not cost money, and you can use those Diamonds to buy Premium Expansions without IRL payments.  I know this is possible, because I have done it.  True, you probably can't be expected to gain all the Premium Expansions this way, but that is not my position.  I'm simply stating that some Premium Expansions can be gotten without opening your wallet.[BR][BR](Also, don't forget the Mystical Object.  30% chance at 500 Diamonds every 200 Vision Vapors will pay off a lot in those \"few years\" you are projecting out in.  I know it has for me)"}]