[{"24": "FieryArien said:\t\t\tProblem with culture is straightforward, as Pauly7 wrote. However, the problem with population is also there. It comes mainly from the event buildings that are able to replace factories. Hypothetical example: if I get all my needed T2 production from special buildings and don’t have any T2 manufactory, my working population (and used culture) will be lower than if I used the manufactories instead. There is also some bonus space gained (not that much), but what I place in such space certainly won’t consume the same amount of population (and culture).[BR][BR]In other words using non-standard (event) buildings to optimize the city used to have only positive effects on the city.*) However, in the newest chapter it has also negative effect: on Unurium production.[BR][BR]*) Said by a player who doesn’t pursue high ranking score. City that is optimized using event buildings tends to have lower ranking than similarly developed city that mainly uses standard buildings. The reasons are exactly the same as the reasons for lower Unurium production.\t\tClick to expand...[BR]Just to offer a different point of view: This change may just make those entirely useless buildings called residences (or in your example T2 factories) a tiny little bit more useful. A residence (or T2 factory) has absolutely no right to exist before this change, now one can say, yes it is a crap building but compared to pop/culture Hybrid buildings (or spire sets) it at least helps with unurium production. I find it actually a good idea to give standard buildings a boost. Just like pre chapter 15 WS they badly need boosting. Inno acknowledged the fact for WS in chapter 15. Now in chapter 17 they go at boosting other useless buildings. Btw just another analogy: chapter 16 made culture a thing again (a resources that is entire useless before chapter 16).[BR]Magic Residences on the other hand have always been better than pop/cult event hybrids and will be even more so now. So no real change there.[BR][BR][BR]Said by a player who does not intend to ever play this chapter..."}, {"11": "You can indeed get lots of diamonds without spending £££, especially if you do the spire.  I think new chapter will definitely need at least one premium expansion. How often do the 10% off premium expansions appear?"}, {"6": "Not as often as I would like..."}, {"31": "How production (ship trading) works at Chapter 17 - in single image[BR][IMG]https://i.ibb.co/KVZFqbT/http-Advisory-Leverage-com-Production-Ch17-png.png[/IMG]Advisory Leverage"}, {"1": "Thank you, @Adelinn , that helps a lot [smilie--sprite1][BR][BR]It is an exciting mechanic. [smilie--sprite1][BR][BR]Neither be afraid of selling part of your \"fleet\" if you need more room for Red Pearl, for example. For this chapter, your settlement will most likely be changing and evolving as you progress through it.[BR][BR]I suggest for you who do not like this chapter to give it a try. It gives a challenge, but you will overcome it and upgrade your city a lot![BR][BR]By the way, don't forget that we are sending all of your feedback to the developers, to keep it in mind for the future and future chapters."}, {"32": "Sir Derf said:\t\t\tEmphasis mine...[BR][BR][BR]My issue has been with your assertion that the Premium Expansions must be bought with money.[BR][BR][BR][BR]This is not true.  Premium Expansions do not have to be bought with money.  Premium Expansions are paid for with Diamonds, and Diamonds can be gotten without paying money.[BR][BR]I can only work off the words you wrote.  Your wording started with, and at least partially continues with, the absolute assertion that all Premium Expansions are obtainable only with real money.  I am pointing our that that is not true.  The game gives Diamonds in multiple ways that do not cost money, and you can use those Diamonds to buy Premium Expansions without IRL payments.  I know this is possible, because I have done it.  True, you probably can't be expected to gain all the Premium Expansions this way, but that is not my position.  I'm simply stating that some Premium Expansions can be gotten without opening your wallet.[BR][BR](Also, don't forget the Mystical Object.  30% chance at 500 Diamonds every 200 Vision Vapors will pay off a lot in those \"few years\" you are projecting out in.  I know it has for me)\t\tClick to expand...[BR]Yup I am managing between 1000-2000 diamonds a week, more 2000 than 1000 on average without spending a single penny.[BR]I do go to the top of the tower each week on 2 worlds, have currently 5 genies running and 2 on stock? and a handfull of wishing wells.[BR][BR]I also craft multiple mystery chests a week.[BR][IMG]https://i.ibb.co/L5hGNCS/https-en-forum-elvenar-com-index-php-attachments-1604664262675-png-4923.png[/IMG][BR]And not a single penny spend in years now.[BR]and my current expansion cost is:[BR][IMG]https://i.ibb.co/WgWR9Wx/https-en-forum-elvenar-com-index-php-attachments-1604664314812-png-4924.png[/IMG][BR][BR]As long as you are willing to spend the effort you can go f2p more then you should be if you ask me.[BR]I'll bet that if you wanted you can unlock every premium option on a US city in about a year without spending a single penny ever."}, {"32": "Pauly7 said:\t\t\tIn chapter 17 the amount of Unurium you can produce is based on required culture and working population, so they've made it that you will need many top level residences, instead of culture/pop buildings, in order to progress.\t\tClick to expand...You need factories instead of mermaids paradises.[BR]Pop/cult buildings have a limited effect, residences have  a limited effect.[BR][BR]But like you I have been ignoring this chapter as well, I do not know anything about the mechanics. as I do not even care when I will not play the chapter.[BR][BR]I just looked over the research tree and noticed nothing interesting there, the wonders too are about as exiting as enars embassy. and that one is just silly and embarrasing, while like you said this chapter will set you back big time in the tournaments as well, that free expansions is for the same reason still in my inventory.[BR][BR]So there is not 1 compelling reason to consider playing this chapter other than \"because it exists\"[BR]hell I even ignored the chest in the tree as it's still there \"locked\".[BR][BR]So it's on my ignore list for now.[BR]I even placed genies and wishing wells in my city when information about the chapter leaked on beta. that sais enough as you cannot remove them for 100 days after placing while I was aware of the chapter."}, {"24": "anonglitch said:\t\t\tI suggest for you who do not like this chapter to give it a try. It gives a challenge, but you will overcome it and upgrade your city a lot!\t\tClick to expand...[BR]That comment I have very big doubts about: How exactly is it upgrading my city? All I can see is how it kicks me in the teeth if I do the chapter.[BR][BR]Honestly I don´t hate guest races. I am even producing all guest race goods in chapter 16 on a lvl 1 settlement, just for the fun of it. But I am never going to activate another tech in the research tree before the tourney/spire is fixed. And since I doubt that will ever happen, I am producing all those goods just for the fun of it... So no I don´t hate guest races. I would even play them if they did absolutely nothing for me at all, just for the fun of it. But if a chapter is worse than shooting myself in the foot, sorry, not going to happen... I don´t spend tons of resources to make my city worse. And now that is 2 chapters in a row! WHY???"}, {"23": "Susie49 said:\t\t\tYou can indeed get lots of diamonds without spending £££, especially if you do the spire.\t\tClick to expand...Your words have little credibility:[BR][IMG]https://i.ibb.co/YhH4TjP/https-en-forum-elvenar-com-index-php-attachments-exp-jpg-4926.jpg[/IMG]"}, {"23": "I have reached Trading center 2 and am already declaring bankruptcy:[BR]there is no mana[BR]no seeds[BR]no unurium[BR]no elvenarin zero[BR]no sensitive goods[BR]I don't even have losses from decay, because there is nothing to decay - I already sleep peacefully at night.  [smilie--sprite7] [smilie--sprite8][BR]All the reserves I had accumulated for months of play have now been reset."}, {"11": "Thanks PG for listening and offering discounted premium expansions [smilie--sprite1][BR][BR]Sorry to hear you are bankrupt Viskyar, but I hope you are at least enjoying the peaceful sleeps.  You must already have a load of premium expansions if yours cost that much!  I just bought one for 1350 diamonds, without parting with any money.  In fact I just checked my receipts and the last time I spent real money was over a year ago [smilie--sprite1]"}, {"32": "Viskyar said:\t\t\tYour words have little credibility:[BR]View attachment 4926Click to expand...[BR]Why?[BR]I bought 1 today with free diamonds only[BR][IMG]https://i.ibb.co/6b8NhLL/https-en-forum-elvenar-com-index-php-attachments-1604833579729-png-4927.png[/IMG][BR]and I still got a decent amount left[BR][IMG]https://i.ibb.co/56Czt6Y/https-en-forum-elvenar-com-index-php-attachments-1604833629154-png-4928.png[/IMG][BR][BR]I think I have bought a premium expansion each event 4 events in a row now.[BR]So you can see you can get a shitload of free diamonds in a very short time with enough effort."}, {"32": "Susie49 said:\t\t\tYou can indeed get lots of diamonds without spending £££, especially if you do the spire.  I think new chapter will definitely need at least one premium expansion. How often do the 10% off premium expansions appear?\t\tClick to expand...For at least a year now (I never tracked it before) a 10% premium building and a 10% premium expansion offer will be made at each \"big event\"."}, {"24": "CrazyWizard said:\t\t\tFor at least a year now (I never tracked it before) a 10% premium building and a 10% premium expansion offer will be made at each \"big event\".\t\tClick to expand...[BR]I always think of it in terms of the offers coming up before an FA, but I suppose that is exactly the same nowadays lol, I just never thought of it that way..."}, {"2": "Viskyar said:\t\t\tI have reached Trading center 2 and am already declaring bankruptcy:[BR]there is no mana[BR]no seeds[BR]no unurium[BR]no elvenarin zero[BR]no sensitive goods[BR]I don't even have losses from decay, because there is nothing to decay - I already sleep peacefully at night.  [smilie--sprite7] [smilie--sprite8][BR]All the reserves I had accumulated for months of play have now been reset.\t\tClick to expand...I am the 1st column after Trading Center 2, I still have mana, seeds and others you said you don't but sentient goods are low low low [smilie--sprite8] I can produce only so many, using MM spells and that's it. I wasn't wise enough to upgrade more the Simia during the chapter break. It's at lvl.16 but would have been better to be at lvl.21 [smilie--sprite8] [smilie--sprite8] [smilie--sprite8] My major concern are MM spells. Even producing them24/7, getting all which are available in tourny, still ... looking how fast are vanishing is giving me shivers [smilie--sprite8]"}, {"24": "Alcaro said:\t\t\tI am the 1st column after Trading Center 2, I still have mana, seeds and others you said you don't but sentient goods are low low low [smilie--sprite8] I can produce only so many, using MM spells and that's it. I wasn't wise enough to upgrade more the Simia during the chapter break. It's at lvl.16 but would have been better to be at lvl.21 [smilie--sprite8] [smilie--sprite8] [smilie--sprite8] My major concern are MM spells. Even producing them24/7, getting all which are available in tourny, still ... looking how fast are vanishing is giving me shivers [smilie--sprite8]Click to expand...[BR]Simia 16 isn´t bad, but of course this is one of the best AWs in the game so you certainly will benefit from upgrading it higher [smilie--sprite1] Anyway I wonder why you need so many MM enchantments? That might be a point that is easier to work on than the Simia? [BR]Btw do you have a Time Warp? Another AW of similar importance as the Simia and helps just as much or more with sentient goods.[BR]The ETC might help too temporarily (at least lvl 1 if you don´t have it), but with the new tourney I am more likely to sell it than to upgrade it further...[BR][BR]I have my town setup so I never use MMs at all, except for special occasions, like quests or at a time in chapter 15 when the need was greatest. Guess I will be using them for a week on my T1 factories now lol. Things like that."}, {"32": "Gargon667 said:\t\t\tI always think of it in terms of the offers coming up before an FA, but I suppose that is exactly the same nowadays lol, I just never thought of it that way...\t\tClick to expand...[BR]There isn't always an FA after each event."}, {"33": "Viskyar said:\t\t\tno elvenarin zero\t\tClick to expand...[BR]Are you aware that the Portal Profit instants gives you Elvenarian Zero?[BR]I've never actively collected PP but I'm flooded with them anyway. So I assume you should have some to spare that can give you the Elvenarian Zero you need."}, {"34": "Another useless chapter for the fighters like me. I should keep advance to chapter 15 then stop researching. The chapter 16 and 17 are just same, it only has very few squadsize and training facilities upgrades, and NO NEW TROOPS OR TROOP UPGRADES. This is probably the biggest disappointment for all the players who like to fight in elvenar"}, {"25": "CrazyWizard said:\t\t\tWhy?[BR]I bought 1 today with free diamonds only[BR]View attachment 4927[BR]and I still got a decent amount left[BR]View attachment 4928[BR][BR]I think I have bought a premium expansion each event 4 events in a row now.[BR]So you can see you can get a shitload of free diamonds in a very short time with enough effort.\t\tClick to expand...Whenever I see bragging like this I have to shudder.  This is why the devs end up using a giant nerf bat on things that are, or were, so beneficial to the vast majority of players.  We're not all in 10 chest/gold Spire fellowships, nor do we all want to be.  Many of us play for fun and are not interested in joining the army and forever marching in a straight row.  We love to get a few diamonds and accumulate them, which won't be possible when the devs determine that we \"all\" obviously must have WAY too many free diamonds.  They will find a way to fix that, I fear."}]