[{"32": "Maillie said:\t\t\tWhenever I see bragging like this I have to shudder.  This is why the devs end up using a giant nerf bat on things that are, or were, so beneficial to the vast majority of players.  We're not all in 10 chest/gold Spire fellowships, nor do we all want to be.  Many of us play for fun and are not interested in joining the army and forever marching in a straight row.  We love to get a few diamonds and accumulate them, which won't be possible when the devs determine that we \"all\" obviously must have WAY too many free diamonds.  They will find a way to fix that, I fear.\t\tClick to expand...[BR]Lol it's to show it's possible, someone claimed another persons word dit not hold credibility.[BR]btw it's not just the spire, while it's a great source, it's not the only source.[BR][BR]You will not be able to aquire that many free diamonds with just the spire, unless you play at the DE/US server who have too many worlds.[BR][BR]Even if you are in a silver fellowship (which is easy possible as long as nog half the fellowship is ignoring the spire completely you still get very nice rewards, that stack up over time. not ignoring crafting helps as well,. ect.[BR][BR]With enough time you can get anywhere. how much time depends on how \"casual\" or \"die hard\" you are. but even \"casual\" the rewards are not bad.[BR]You just need the discipline not to spend it before you have the numbers you need [smilie--sprite2]"}, {"22": "Maillie said:\t\t\tWe love to get a few diamonds and accumulate them, which won't be possible when the devs determine that we \"all\" obviously must have WAY too many free diamonds. They will find a way to fix that, I fear.\t\tClick to expand...Don't worry, the devs know that CrazyWiz isn't a regular player!"}, {"35": "CrazyWizard said:\t\t\tFor at least a year now (I never tracked it before) a 10% premium building and a 10% premium expansion offer will be made at each \"big event\".\t\tClick to expand...[BR]They gave us 20% off of premium expansions last year on Cyber Monday.[BR]The deal on Black Friday was just the usual 10% off of magic buildings though.[BR][BR]We're just over a couple of weeks away from Black Friday (27 Nov) and Cyber Monday (30 Nov) for this year, so might be worth people saving their diamonds to see if give us a 20% off deal again."}, {"36": "Maillie said:\t\t\tWhenever I see bragging like this I have to shudder.  This is why the devs end up using a giant nerf bat on things that are, or were, so beneficial to the vast majority of players.  We're not all in 10 chest/gold Spire fellowships, nor do we all want to be.  Many of us play for fun and are not interested in joining the army and forever marching in a straight row.  We love to get a few diamonds and accumulate them, which won't be possible when the devs determine that we \"all\" obviously must have WAY too many free diamonds.  They will find a way to fix that, I fear.\t\tClick to expand...[BR]Well said."}, {"32": "Maillie said:\t\t\tWhenever I see bragging like this I have to shudder.  This is why the devs end up using a giant nerf bat on things that are, or were, so beneficial to the vast majority of players.  We're not all in 10 chest/gold Spire fellowships, nor do we all want to be.  Many of us play for fun and are not interested in joining the army and forever marching in a straight row.  We love to get a few diamonds and accumulate them, which won't be possible when the devs determine that we \"all\" obviously must have WAY too many free diamonds.  They will find a way to fix that, I fear.\t\tClick to expand...[BR]Don't worry they can easily see this in there dataset, they don't need to scour the forums for that [smilie--sprite2][BR][BR]It's very simple as long as a limited amount of players aquire insane amounds of free diamonds it's ok, as more and more players aquire a lot of free diamonds and they see it has an impact on sales they nerf it.[BR][BR]It's not unlikely as time progresses and more players accumulate loads of freebees if we see a nerf in both the spire and crafting.[BR]Not because of the forums but because there numbers tell them it hurts there sales.[BR][BR]Just like wishing wells where limited, by changing them into genies as they did notice many many many players only targetting wishing wells at events and build entire farm complexes. there was simply to much free diamons."}, {"32": "Paladestar said:\t\t\tThey gave us 20% off of premium expansions last year on Cyber Monday.[BR]The deal on Black Friday was just the usual 10% off of magic buildings though.[BR][BR]We're just over a couple of weeks away from Black Friday (27 Nov) and Cyber Monday (30 Nov) for this year, so might be worth people saving their diamonds to see if give us a 20% off deal again.\t\tClick to expand...[BR]Black friday did we get a 10% off in premium residences / workshops?[BR]I only remember the 3 phoenix artefact for 75 euro/dollar/pound? lol"}, {"22": "CrazyWizard said:\t\t\tJust like wishing wells where limited, by changing them into genies as they did notice many many many players only targetting wishing wells at events and build entire farm complexes.\t\tClick to expand...Some people are in for a nice surprise in December."}, {"32": "Pauly7 said:\t\t\tSome people are in for a nice surprise in December.\t\tClick to expand...[BR]lol 1 is not a farm [smilie--sprite2]"}, {"22": "CrazyWizard said:\t\t\tlol 1 is not a farm [smilie--sprite2]Click to expand...True, plus the new one is about half as good as a Wishing Well anyway."}, {"32": "Pauly7 said:\t\t\tTrue, plus the new one is about half as good as a Wishing Well anyway.\t\tClick to expand...[BR]it's only half the size [smilie--sprite2] but not half the strength I think. 50 vs 35 (leveled to ~5% rule of the new one)[BR]anyway it's a fun thing. always nice to get something for free [smilie--sprite1]"}, {"31": "Chapter 17 missions[BR][BR]Advisory Leverage"}, {"11": "It’s the balance between Unurium and Seeds that I am having most trouble managing!  Have I missed spotting a way of generating more Unurium?"}, {"28": "Susie49 said:\t\t\tIt’s the balance between Unurium and Seeds that I am having most trouble managing!  Have I missed spotting a way of generating more Unurium?\t\tClick to expand...You can generate all the seeds without using the Trader."}, {"30": "MinMax Gamer said:\t\t\tYou can generate all the seeds without using the Trader.\t\tClick to expand...Is it using a lot of event building? But isn't limited space a big challenge?"}, {"11": "MinMax Gamer said:\t\t\tYou can generate all the seeds without using the Trader.\t\tClick to expand...Yes indeed, luckily I have lots of seed-producing event buildings so I’ve summoned all them, but Unurium still seems to be made very very slowly!"}, {"28": "Skelve said:\t\t\tIs it using a lot of event building? But isn't limited space a big challenge?\t\tClick to expand...I run 20x Festival Merchants (did so even before this chapter) + a few other buildings, and Trader is 100% on unurium right now. The thing is, even that is way more than enough. Sentient requirements are pretty low in this chapter, so the only other usage for seeds/sentients in this chapter is negotiating the Spire. I do it for L1 and L2 (because I still have more than enough resource production), but realistically I could have switched to fighting 100% of the Spire, at least temporarily. This would mean that there is a very, very little need for seeds.[BR][BR]Space is not really an issue that late in the game, it is only the case if you want to way overproduce goods. And for this chapter you can teleport away all your residences, pop and culture buildings for the guest race setup. You can have massive settlement if you really want to play it that way."}, {"28": "Susie49 said:\t\t\tYes indeed, luckily I have lots of seed-producing event buildings so I’ve summoned all them, but Unurium still seems to be made very very slowly!\t\tClick to expand...Well, the only way around that would be to teleport in / build some additional producers - most likely some manufactories and/or armories."}, {"30": "MinMax Gamer said:\t\t\tI run 20x Festival Merchants (did so even before this chapter) + a few other buildings, and Trader is 100% on unurium right now. The thing is, even that is way more than enough. Sentient requirements are pretty low in this chapter, so the only other usage for seeds/sentients in this chapter is negotiating the Spire. I do it for L1 and L2 (because I still have more than enough resource production), but realistically I could have switched to fighting 100% of the Spire, at least temporarily. This would mean that there is a very, very little need for seeds.[BR][BR]Space is not really an issue that late in the game, it is only the case if you want to way overproduce goods. And for this chapter you can teleport away all your residences, pop and culture buildings for the guest race setup. You can have massive settlement if you really want to play it that way.\t\tClick to expand...That's good thinking. Thanks for the tip. [smilie--sprite1]"}, {"37": "Where can I find a questline? Gems is useless."}, {"38": "For the first time ever I can't be bothered with the latest chapter, I haven't even cleared my city from the FA.. no point until I decide what to do. I am hoping January is so boring that I have literally nothing better to do than bore myself to tears and get on with it, how exciting!"}]