[{"25": "MinMax Gamer said:\t\t\tWell, the only way around that would be to teleport in / build some additional producers - most likely some manufactories and/or armories.\t\tClick to expand...There are no other buildings that make Unurium.  The only building that makes it is the upgraded Trader.  It is not produced in anything else and it's very, very slow.  We get a choice whether to make Unurium or to make seeds from the Trader."}, {"28": "Maillie said:\t\t\tThere are no other buildings that make Unurium. The only building that makes it is the upgraded Trader. It is not produced in anything else and it's very, very slow. We get a choice whether to make Unurium or to make seeds from the Trader.\t\tClick to expand...Bringing in additional manufactories and/or armories increases pop and culture consumption, which increases unurium production."}, {"24": "What´s the rationale behind that? Let´s make a chapter that is easiest for the highest ranking towns, because they are the ones hit worst by the tourney debacle? Or because they are the only ones who can still be bothered to play such a chapter, because they have already given up on tourneys?"}, {"28": "Gargon667 said:\t\t\tOr because they are the only ones who can still be bothered to play such a chapter, because they have already given up on tourneys?\t\tClick to expand...That's more like it, because completing this chapter doesn't do anything positive for the tourneys, high rank or not."}, {"6": "What is the lowest ranking Chapter 16 town?  How many Chapter 15 and below towns rank higher?"}, {"32": "Sir Derf said:\t\t\tWhat is the lowest ranking Chapter 16 town?  How many Chapter 15 and below towns rank higher?\t\tClick to expand...[BR]and thats the only reason,[BR][BR]1 issue with the, on the top there is limited space with only 1 top 1 spot.[BR]This means most don't care.[BR][BR]And I still can het 1st place on my own server if I wanted n chapter 16, tho soon enough place 2 might be the highest.[BR]It's a bit of an issue."}, {"6": "@CrazyWizard I really don't follow what you're saying...[BR][BR]I was responding to @Gargon667 suggestion that the newest Chapter \"... is easiest for the highest ranking towns.\" by wondering how much of a difference there is between a city being in Chapter 16 versus a city being high ranking, or alternately how low-ranking could a Chapter 16 city be..."}, {"28": "Sir Derf said:\t\t\talternately how low-ranking could a Chapter 16 city be...\t\tClick to expand...It can be pretty close to zero, in theory. If you remove all the non-mandatory buildings (or simply replace them with event buildings), then you can still be in C16, but your rating will be minimal."}, {"6": "Yeah, you could...  But are there any?"}, {"2": "this chapter is all about grinding. I am already bored to death. I'm past middle tech tree and all I did is to grind 15 min. prod as often as possible. This chapter is no brain teaser, not much to strategize, nothing exciting in the tech tree, everything is reduced to how often you can be online to collect shrimps, pearls and keys. Not funny at all."}, {"39": "Indeed, prawns are off my menu for at least a year now lol, sickening chapter this is [smilie--sprite9]"}, {"14": "Alcaro said:\t\t\tthis chapter is all about grinding. I am already bored to death\t\tClick to expand...[BR]Yes, it is an insane grind. Inno has been making the chapters take longer, simply to slow people down. It didn't well enough work with KP, so now you get massive settlement-goods grinds.[BR][BR]However, I just put everything at 3 hours. It will take longer, but I am not going to stress over it. Only doing what I do always anyway, 3-hour productions and done. Playing MY game [smilie--sprite1]"}, {"40": "Pauly7 said:\t\t\tI'll start this off by saying that Chapter 17 is the worst chapter created.\t\tClick to expand...In my opinion, not only the worst but the worst by some margin. Seems to have been designed deliberately to drain resources and frustrate game play. Having a challenge is one thing but being bored into a near comatose state is another."}, {"24": "EdwardTrunk said:\t\t\tIn my opinion, not only the worst but the worst by some margin. Seems to have been designed deliberately to drain resources and frustrate game play. Having a challenge is one thing but being bored into a near comatose state is another.\t\tClick to expand...[BR]I haven´t played either 16 or 17, I assume 16 is easier to play, but if you look atwhat you get out of it at the end of the day, 17 at least has a few useful upgrades (not worth playing the chapter and especially not worth playing 2 chapters of course), while 16 has absolutely nothing. So my vote for worst chapter ever created goes to 16 [smilie--sprite1]"}, {"28": "Gargon667 said:\t\t\tI haven´t played either 16 or 17, I assume 16 is easier to play, but if you look atwhat you get out of it at the end of the day, 17 at least has a few useful upgrades (not worth playing the chapter and especially not worth playing 2 chapters of course), while 16 has absolutely nothing. So my vote for worst chapter ever created goes to 16 [smilie--sprite1]Click to expand...Yeah, I can tell that you haven't played these chapters. Chapter 16 is nothing comparing to the mind-numbing drudgery of months of 15min productions of Chapter 17..."}, {"24": "MinMax Gamer said:\t\t\tYeah, I can tell that you haven't played these chapters. Chapter 16 is nothing comparing to the mind-numbing drudgery of months of 15min productions of Chapter 17...\t\tClick to expand...[BR]I am just about to finish making all the chapter 16 goods on a lvl 1.5 settlement for  the heck of it lol I have rebuilt the settlement 4 times I think after FAs, can´t even remember when I started this sillyness. But I am pretty sure the drudgery is less of a measure of uselessness than the rewards you get. Once the chapter is finished it´s finished, no matter how boring it was. The upgrades you get stay with you long after. Well unless you get nothing at all to show for once it´s done. So I stick to my opinion 16 is the worst ever devised."}, {"2": "@Gargon667 - we will see if you stick to your opinion once you start grinding in ch.17 [smilie--sprite8] [smilie--sprite8] [smilie--sprite8][BR]The upgrades you get are yours to keep, like in all other chapters, I see no difference about this. Rewards? What rewards are you talking about? We didn't get any improvement for any troop or something beneficial to the city growth. Instead, we get a new head ache - the Unurium [smilie--sprite8] Something new to look after but without any Wonder to help reducing the decay, no (event) buildings giving it. Let's not forget ... eventually we will get 2 totally useless Wonders. Yep, indeed, ch.17 it's easier and funnier than ch.16. (I hope you noticed the invisible quote marks from easier and funnier words, lol)"}, {"24": "Alcaro said:@Gargon667 - we will see if you stick to your opinion once you start grinding in ch.17 [smilie--sprite8] [smilie--sprite8] [smilie--sprite8][BR]The upgrades you get are yours to keep, like in all other chapters, I see no difference about this. Rewards? What rewards are you talking about? We didn't get any improvement for any troop or something beneficial to the city growth. Instead, we get a new head ache - the Unurium [smilie--sprite8] Something new to look after but without any Wonder to help reducing the decay, no (event) buildings giving it. Let's not forget ... eventually we will get 2 totally useless Wonders. Yep, indeed, ch.17 it's easier and funnier than ch.16. (I hope you noticed the invisible quote marks from easier and funnier words, lol)\t\tClick to expand...[BR]That is exactly the point, the upgrades (=rewards) stay with you and in chapter 16 there is not a single useful (for someone like me who likes team events) upgrade that you could keep. In chapter 17 you at least get barrack/merc camp upgrades."}, {"2": "I wish we could have for small ships the same function we have for Workshops. At this moment I have many of them and I try to go for 15 mins prod (damn! I always hated Treants! [smilie--sprite8]) and it's really annoying to select all of them, one by one."}, {"4": "Annoying mandatory quest when I am all but done with this very slow chapter, on to the final 2 techs and only need the kp yet I now have \"collect 80'000 Luxurious Luxuries\" for a payout of 2 CC spells.[BR][BR]I could wait for ch18 then decline it but who knows when that will be."}]