[{"24": "m4rt1n said:\t\t\tAnnoying mandatory quest when I am all but done with this very slow chapter, on to the final 2 techs and only need the kp yet I now have \"collect 80'000 Luxurious Luxuries\" for a payout of 2 CC spells.[BR][BR]I could wait for ch18 then decline it but who knows when that will be.\t\tClick to expand...[BR]How about you keep the quest, build that amazing AW that gives you a bonus for finishing a storyline quest and then do the quest? That surely must make up for any inconvenience???"}, {"4": "Gargon667 said:\t\t\tHow about you keep the quest, build that amazing AW that gives you a bonus for finishing a storyline quest and then do the quest? That surely must make up for any inconvenience???\t\tClick to expand...[BR]I will probably have the AW before I complete it anyway. I was hoping to be done for the upcoming FA.[BR][BR]To me it is obvious that the devs do not play the chapter when making the storyline quests as I have followed the story throughout the chapter and this one near the end seems out of place and should have come several quests earlier."}, {"24": "m4rt1n said:\t\t\tI will probably have the AW before I complete it anyway. I was hoping to be done for the upcoming FA.[BR][BR]To me it is obvious that the devs do not play the chapter when making the storyline quests as I have followed the story throughout the chapter and this one near the end seems out of place and should have come several quests earlier.\t\tClick to expand...[BR]Sorry my previous comment was not actually meant seriously. I was more meant as commiseration from afar."}, {"11": "Lol I gave up on the quests in this chapter some time ago.  My progress thru it makes a snail look like a fast mover [smilie--sprite1]"}, {"14": "The chapter is just a grind tying up more space for a longer period of time, making it a chore really.[BR][BR]Nothing really interesting about it."}, {"4": "I have now completed the chapter tech, just letting things run to complete the storyline now, and doing the upgrades.[BR][BR]It was the slowest most grinding chapter in the game. I hope ch18 is better thought out when it comes."}, {"41": "I am at the middle of the chapter. I calculated that it will take me 16 years, 245 days and 33 minutes to finish the rest of the research.  [smilie--sprite2] [smilie--sprite2][smilie--sprite2]"}, {"4": "Chapter fully completed, the storyline quest had a few twists near the end that should have come earlier. Also had to set off building and delete the dwarven portal for one near the end after the 200 diamond quest at which point I removed everything from the city.[BR][BR]That was a slog, not much fun for the most part and involved quite a bit of use of teleport spells on residences and manu's to get the settlement in to full size as required by the quests.[BR][BR]Here's hoping a bit more fun is put into ch18 when it comes."}, {"42": "I do wish I'd read this earlier, that 80,000 story quest sucks! And so stupid, it comes after the training ground quest. Even if you allow zero time to actually do that quest there is only 1 research after it in the tree and that's for 52,000...[BR]I personally dislike that they went back to the 15min production times, but it does allow players to choose their pace so I guess it's not a bad thing. You could also mostly trade resources one for the other to minimise the total goods you need. I won't complain about the teleports needed, still really glad to have them.[BR][BR]It was quite a long grind though. Whilst it's taken me through to about the start of the next chapter it did feel like a longer slog than any other before it. It demands so many more of the decaying resources, obviously a strategy they went with, but it makes the game less enjoyable. Accumulating 2.5 million mana @ 10% decay. You've got to be producing about 350k a day to make any meaningful progress and that's really hard when you're losing even more space to the chapter buildings. Obviously the wonders are the way around that, but I feel they are assuming a higher wonder level than most players are going to have.[BR][BR]Enjoyed the building designs and I'm very appreciative that we can run the troop buildings simultaneously, I think that's made up for the higher costs of tournaments and spire."}, {"43": "Gargon667 said:\t\t\tuntil the tourneys are fixed.\t\tClick to expand...You still hoping they will be ?"}, {"24": "JollyElf said:\t\t\tYou still hoping they will be ?\t\tClick to expand...[BR]Eventually things will change, they always do, it might be a year or three, but eventually they do. If they get better then is a whole different question of course."}, {"35": "Gargon667 said:\t\t\tEventually things will change, they always do, it might be a year or three, but eventually they do. If they get better then is a whole different question of course.\t\tClick to expand...Oh, my sweet summer child..."}, {"43": "lol  paladester. [BR]Hope they do. but 2-3 years is the span of a game for a large chunk of gamers.[BR]And I got discounted offers for expansion on en1 server. [BR]Inno has made every inch of the game into a tough decision. I’d buy a couple of them if only they didn’t Screw up tourney in the first place."}, {"44": "This chapter is making me think seriously about leaving the game. I've been stuck in the utter tedium for months. It takes weeks to complete a single research item. I've read that the chapter was designed to slow players down...why?? I'm really fed up of it. Worst chapter yet."}, {"4": "Elfclaw the Mighty said:\t\t\tThis chapter is making me think seriously about leaving the game. I've been stuck in the utter tedium for months. It takes weeks to complete a single research item. I've read that the chapter was designed to slow players down...why?? I'm really fed up of it. Worst chapter yet.\t\tClick to expand...[BR]Yes is one of the worst, does get slightly better after this one and so far 20 and 21 have been easier by quite a long way."}]