[{"1": "Dear Humans and Elves,[BR][BR]Please see the announcement for the Theater Zodiac here and let us know what you think about it![BR][BR]Kind regards,[BR]Your Elvenar Team"}, {"19": "From the announcement I gather it will provide CC-spells at the highest evolution. And for players in advanced chapters, who are doing a reasonable amount of provinces in the tourney it will be a substantial number of CC-spells. Is there going to be some way to get rid of those besides crafting?[BR][BR]I have heard the chap 21 AWs will require some for upgrading, but I doubt it will even make a dent in the stock of CC-spells I already have on my main account and I'm crafting 24/7/365, with often using time-instants to craft multiple objects from each set of offerings and using sips of clarity to get more offers."}, {"32": "Disenchant them if you have too many and bothers you. [BR]I also have lots of them, but I will definitely try to get this building to max evolutions.[BR]Let's not forget, this building it's a blessing in disguise for those players who didn't get many Moonstone Library sets (if they got any)."}, {"16": "there are recipes added which require more CCs than old ones + some old recipes now ask for more CCs. + you need 1 more pet food weekly to get those CC from tourney, which can be a limitation too."}, {"19": "Alcaro said:\t\t\tDisenchant them if you have too many and bothers you.[BR]I also have lots of them, but I will definitely try to get this building to max evolutions.[BR]Let's not forget, this building it's a blessing in disguise for those players who didn't get many Moonstone Library sets (if they got any).\t\tClick to expand...Disenchant them? How do you do that? I can disenchant other spells, but not CC's, they are not shown as spells as they are crafting tools.[BR][BR]Does it bother me? It's just that I don't like seeing a kind of resource having no use. I have about 1.200 in stock now. And have another bunch at the ready as I have 35 uncollected chests from the MA stored for the start of chap 21 on live, each of which will give another 12 from the Dragon Ark. [BR][BR]So apart from crafting there is no way of making them useful for anything. I understand the building can be useful for people who only were able to craft 1 Moonstone lib. However, that by itself is no reason to add more ways of generating them without a way of using them."}, {"32": "Hmmm \t\t\t\t\t\t\t\t\t\t\t\t[IMG]https://i.ibb.co/vsc11ws/http-www-emoticonr-com-design-yahoo-thinking-gif.gif[/IMG]  indeed. You are right. In this case, craft every recipe you can and disenchant everything you get and don't need. [smilie--sprite8][BR]I have more CCs than you, but I swear, never thought I have too many [smilie--sprite8] [smilie--sprite8] I guess I am a hoarder."}, {"48": "Thank you iDavis  [smilie--sprite1][BR][BR][BR]\t\t\thttps://idavis-elvenar.com/buildings.html\t\t[BR][BR]On the left side – Introduced in Event …..[BR][BR]Autumn Zodiac[BR][BR]In the middle .... Filter & Generate[BR][BR]We see the Tinlug and some new Buildings"}, {"19": "Alcaro said:\t\t\tHmmm \t\t\t\t\t\t\t\t\t\t\t\t\t[IMG]https://i.ibb.co/vsc11ws/http-www-emoticonr-com-design-yahoo-thinking-gif.gif[/IMG]  indeed. You are right. In this case, craft every recipe you can and disenchant everything you get and don't need. [smilie--sprite8][BR]I have more CCs than you, but I swear, never thought I have too many [smilie--sprite8] [smilie--sprite8] I guess I am a hoarder.\t\tClick to expand...LOL. I consider myself a hoarder. I don't mind having stocks, whether in the game or RL. I have stocks of everything in this game, but basically I can use everything when I choose to do so. Whether to buy KPs, donate to the Cauldron updates, cater encounters, whatever. Except the CCs, there is nothing I can do with them.[BR]THAT is what's bugging me; having crap around that just cannot be used in any sensible way."}, {"9": "Dhurrin said:\t\t\tIs there going to be some way to get rid of those besides crafting?\t\tClick to expand...Mayby craft more?[BR][BR]My main city's CCs:[IMG]https://i.ibb.co/r75YMmX/https-beta-forum-elvenar-com-index-php-attachments-1691211179085-png-11648.png[/IMG][BR]I'm creating them 24/7, but before the week ends i will go again to zero (it has been this way now for several weeks since i got to zero for the first time ever (after always having hundreds in stock)).[BR][BR]The feeding effect plays right for my current CCs stock state. With over 300 pet food in stock, i can withstand pet food income deficit for some time.[BR]And my CCs deficit should be solved by the new wonder.[BR]Or maybe it will be solved sooner with all the garbage recipes we are going to get soon on live servers."}, {"45": "Hmmmm... main building with a Star Serpent.... did Inno run out of bears? [smilie--sprite11][smilie--sprite7][smilie--sprite8]"}, {"19": "Lovec Krys said:\t\t\tMayby craft more?[BR][BR]My main city's CCs:View attachment 11648[BR]I'm creating them 24/7, but before the week ends i will go again to zero (it has been this way now for several weeks since i got to zero for the first time ever (after always having hundreds in stock)).[BR][BR]The feeding effect plays right for my current CCs stock state. With over 300 pet food in stock, i can withstand pet food income deficit for some time.[BR]And my CCs deficit should be solved by the new wonder.[BR]Or maybe it will be solved sooner with all the garbage recipes we are going to get soon on live servers.\t\tClick to expand...I am crafting 24/7/365. Often using time-instants to craft multiple offers out of each batch and often using the sips to get new offers. Unless they expect me to spend all day doing nothing but playing elvenar there is no way for me to do more."}, {"16": "Just imagined if I had Dragon Ark lvl31 and collect all mystical objects available - I'd get more than 6k CCs... But I don't have it and doubt will build it in the future..."}, {"33": "Karvest said:\t\t\tJust imagined if I had Dragon Ark lvl31 and collect all mystical objects available - I'd get more than 6k CCs... But I don't have it and doubt will build it in the future...\t\tClick to expand...[smilie--sprite8][BR]Almost 16k VV in Live...[BR][IMG]https://i.ibb.co/s2Bcdvv/https-beta-forum-elvenar-com-index-php-attachments-1691330419429-png-11654.png[/IMG]"}, {"16": "I mean that's the reason why @Dhurrin has that many CCs. Without that AW I have stable CC income/outcome balance, but with it - I'd have much more CCs than I can use."}, {"11": "I'm happy with a building giving CC's, but i would prefer that the pet food would stay for 5 days [smilie--sprite7]"}, {"9": "What is the reason for having thousands of VV and not getting the rewards from Mystical chests? I personaly don't understand why you would do it."}, {"11": "Lovec Krys said:\t\t\tWhat is the reason for having thousands of VV and not getting the rewards from Mystical chests? I personaly don't understand why you would do it.\t\tClick to expand...Waiting for the new chapter and then using them, so you get the rewards with new chapter values?"}, {"9": "That might be the reason for someone, but this never occured to me to be important, since all the rewards i care about are chapter independent."}, {"16": "I've started collecting it when there was a chance to get event currency. When it was removed, I was just too lazy to click that many times. Then diamond chances were reduced and the reason to overcome my laziness became even smaller, while the number of clicks to do is growing...[BR]Apart from that, rewards contain KP, which can be used in new chapter when you need them."}, {"19": "Droopy said:\t\t\tWaiting for the new chapter and then using them, so you get the rewards with new chapter values?\t\tClick to expand...Exactly. I had close to 80 chests waiting. So I used about 15 first; the chances of getting the 35KP bonus is pretty substantial, so I had enough to just fill the required KPs of the first few techs. After that (and unlocking that first tech so one is considered to be 'in' the next chapter) I used another bunch. Some of the buildings that came along were handy and were already counted as the next chapter's version.[BR]Besides that, not claiming the chests makes it easy during the FSA to instantly gain a crapload of CC-spells from the Ark and thus a bunch of badges. Why would I claim the chests earlier when I don't have a real need for them, or the CC spells?"}]