[{"33": "Lovec Krys said:\t\t\tWhat is the reason for having thousands of VV and not getting the rewards from Mystical chests? I personaly don't understand why you would do it.\t\tClick to expand...[BR]The reason is that after reducing the % of winning diamonds and changing the buildings, there is little less than nothing worth of collecting Mystic Object chests.[BR][BR]EDIT: and removing totally event currency."}, {"28": "Main prize feeding effect: 0/5 tournament encounter progress towards the bonus reward.[BR]Does that mean if the serpent is fed i would get a bonus prize every five tournament encounters, and the bonus prize would be a combining catalyst ? The serpent being fully evolved."}, {"16": "Yes. At least I read it same way..."}, {"10": "The art work in the opening scene on android is breathtakingly beautiful. I've been logging in and out repeatedly just to experience that *wow* moment over and over again!"}, {"11": "According the announcement it should be 1 CC every 5 tournament encounters , but the text is telling 6 at level 10. What is correct?[BR][BR][IMG]https://i.ibb.co/3f3P8mV/https-beta-forum-elvenar-com-index-php-attachments-elvenar-tinlug-lvl10-jpg-11664.jpg[/IMG]"}, {"49": "I was glad to see that the update in the app store was ready to go for the Autumn Zodiac in Beta Land![BR]I hope it’s working for all mobile devices. [BR]It’s so much better when we can all play the event on day one. Thanks for that. [smilie--sprite1]"}, {"37": "Both game files and mobile app say there are 5 encounters required for Combining Catalyst. I would assume that the browser version has some visual error (as it actually still counts only until 5 and then you get the CC)."}, {"1": "Thank you guys for reporting this, I will forward it to the dev team."}, {"50": "The new building may be useful in higher chapters. [BR]Ok. it produces goods and depending of the chapter mana, seed or unurium.[BR]But at the moment I dont see a reason to waste petfood for that, when I get enough CCs from the spire, my other event buildings and the library or in emergency by crafting,[BR]A switchable reward would have been useful."}, {"2": "This quest is not acceptable :[BR][BR][IMG]https://i.ibb.co/vHTV3Z5/https-beta-forum-elvenar-com-index-php-attachments-screenshot-2023-08-09-183828-jpg-11686.jpg[/IMG][BR]This quest has occurred 3 times that I know of, Quests 9, 25 and 40.  Scout a Province is difficult to impossible for late game players, and inadvisable for early game players.  The \"donate to Magic Academy\"  is not available 24/7, nor does every player wish to continue to throw away resources into this feature.  This should not occur even once, as it renders the event unplayable."}, {"9": "Not only for early players. Some of us are using Academy brewing together with their tourney (in my case on FR/TU). And last time it was faster for me to wait 2,5 days for scouting (thx. to Tavern 35) than wait 4 days for donating.[BR]But i know they will copy+paste the same quest to next event - it's faster than actualy listen to the feedback."}, {"2": "*sigh*[BR]I miss Marindor.  He would too, get that fixed for us."}, {"51": "Lelanya said:\t\t\t*sigh*[BR]I miss Marindor.  He would too, get that fixed for us.\t\tClick to expand...Donate to the magic academy ?? I am not using that feature at all - seems like they could come up with a better alternative than scout provinces - or mabe they are thinking about extending the duration of these events - even my cities that are in Halflings takes 80+ hours to scout - so it renders this event as being unattainable for me - but thats ok - since they started going hog wild on buy kp I slowed down on pushing myself to do any events"}, {"1": "All feedback is forward like have always been and changes are being made."}, {"2": "Deadeye Jerry said:\t\t\tAll feedback is forward like have always been and changes are being made.\t\tClick to expand...Thank you.  We here on Beta have the one and only chance, to report difficult if not impossible quests.  If your event arrives in the Live realms as unplayable,  you are going to alienate your base of paying customers."}, {"1": "The quests with \"scout a province\" will be taken out from the event (3 of them), I am creating the announcement right now."}, {"10": "I have always said that Inno gives with one hand whilst taking with the other and it seems this event building (beautiful though it is) proves me right once again. Crafting a pet food that once cost 1650 spell frags now costs 1650 SF and one cc. Unfed it offers a pittance in goods. [BR]What would be good is if we could collect the cc from tinlug ourselves rather than have them mysteriously appear in the MA cc pool. It would make the awarding of cc clearer because many folk won't think to check their cc balance before playing."}, {"28": "collecting from building would be clearest option, at the very least it should be shown amongst the prizes when they appear on the screen when the encounter is finished. i haven't tried feeding it yet so don't actually know if it does."}, {"19": "Deadeye Jerry said:\t\t\tThe quests with \"scout a province\" will be taken out from the event (3 of them), I am creating the announcement right now.\t\tClick to expand...That is appreciated.[BR]As far as I'm concerned the scouting would not have to be removed completely, but should always have a reasonable alternative so players can weigh their options. The alternative @Lelanya showed was absolutely not reasonable; both can force players to overextend which will hurt them in their game."}, {"5": "Heffernan said:\t\t\tat the very least it should be shown amongst the prizes when they appear on the screen when the encounter is finished. i haven't tried feeding it yet so don't actually know if it does.\t\tClick to expand...[BR]It does."}]