[{"10": "Enevhar Aldarion said:\t\t\tIt does.\t\tClick to expand...I didn't even notice that! Thanks for pointing that out"}, {"29": "@Deadeye Jerry Please also remove items related to the cauldron. Many players don't use this feature. These items force the player to use the cauldron... Which many players don't want !!!!"}, {"30": "I completely agree with Biloutte91. A mandatory donation to the Magic Academy is cruel. It implies that this feature is used by many players, but I personally know that a lot of players do not like this feature."}, {"16": "For those who actually use it it's even more annoying, as they use it at specific timeframe making these quests impossible most of the time + they have already donated everything they wanted and forcing to donate is forcing to waste resources without anything in return."}, {"52": "Biloutte91 said:\t\t\tPlease also remove items related to the cauldron. Many players don't use this feature. These items force the player to use the cauldron... Which many players don't want !!!!\t\tClick to expand...Since the quests make us buy KP and many other activities that individual players choose not to otherwise do, I doubt they will remove quests involving using the Cauldron. It seems one of the purposes is to get players to explore aspects of the game they would not otherwise utilize. However, I would say this particular quest would be VASTLY improved if it were possible to donate to the Magic Academy without having to brew first. That would make the feature more useful, too, IMO. Currently, donating to the academy is blocked more than it is accessible because either I haven't brewed yet or the Cauldron is closed for the week. I wish it were possible to access donating without being dependent on brewing."}, {"53": "As a Player that does not use the Cauldron and it is only active because the migration auto-completed it. Because it is an OPTIONAL feature just as the spire and Tournament are, it should have an option as we see with Quests that ask Complete x number of Spire or Tourney. Just saying"}, {"13": "Today’s daily mission, #57[BR][IMG]https://i.ibb.co/qCt7k10/https-beta-forum-elvenar-com-index-php-attachments-img-0572-jpeg-11708.jpg[/IMG][BR]Really? Buy 27 (twenyseven) kp? Seriously?"}, {"9": "Seems like some random generator.[BR]How many KPs should we put there? Random generator: 27.[BR][BR]How about scout 27 provinces? [smilie--sprite8]"}, {"54": "Uffauffa said:\t\t\tToday’s daily mission, #57[BR]View attachment 11708[BR]Really? Buy 27 (twenyseven) kp? Seriously?\t\tClick to expand...talk about a mind-numbing, resource draining task that may be virtually impossible for small cities... Hey Inno, what's the reasoning behind this?  Typo?  Slowing players way down? Just being cruel and not caring if anyone otherwise likes playing?  smh"}, {"14": "Thanks for changing \"scout 1 province\" task, but honestly, having (mandatory or not) tasks asking to buy 208 KP in a single event... It's too much."}, {"2": "Right.  The image of a brick wall springs to mind.  I'd like to test with my small city but really cannot afford to - too many 'Buy x KP' quests when I have a couple dozen provinces to solve."}, {"21": "I like that portrait of Tinlug, which can be won in gold league, very much. I kickstarted this event and just arrived at 188 points.[BR][BR]I hope I will be able to catch it in the end, this time I would even spend some diamonds on it. [smilie--sprite1]"}, {"6": "27 KP in a single quest is really too much, players' suggestions are not being listened to and in fact quests have been added asking to buy KP, I don't know what to think."}, {"2": "Observatory for the daily prize.  Hmm, was that 2016....These just keep getting more and more ridiculous."}, {"45": "kkk3 said:\t\t\t27 KP in a single quest is really too much, players' suggestions are not being listened to and in fact quests have been added asking to buy KP, I don't know what to think.\t\tClick to expand...Totally agree.. several times 20 KP was already too much... 27 KP? Really, Inno???"}, {"11": "Buy x KP is really too much IMO for this event.[BR]87 KP which is mandatory (no choice) until now."}, {"14": "Droopy said:\t\t\t87 KP which is mandatory (no choice) until now.\t\tClick to expand...107 mandatory, 101 non mandatory. Really really too much for a single event."}, {"2": "Oh boy, sounds like there's another one we haven't seen yet  [smilie--sprite11]"}, {"5": "Made it to 260 with 6 quests and daily rewards to go, and all with just luck for winning extra currency. Yes, the KP quests were a lot, but I also recently moved into chapter 19, so I needed lots of KP anyway."}, {"19": "Enevhar Aldarion said:\t\t\tMade it to 260 with 6 quests and daily rewards to go, and all with just luck for winning extra currency. Yes, the KP quests were a lot, but I also recently moved into chapter 19, so I needed lots of KP anyway.\t\tClick to expand...So for you it worked out at this particular time, but that hardly can be considered normal.[BR][BR]107 mandatory KPs to buy is utterly ridiculous. Say this goes live and I get that on my main account. Sure, I could afford it, but why would I even want to? I already am drowning in KP, so much so I hardly know what to do with them anymore.[BR]And for smaller cities 107 KPs in 1 event can be way too much to afford, meaning they are going to be stumped. And it will be worse if the non-mandatory ones may have options with quests that may be too hard for small cities as well, like scouting provinces when overschouting can be a problem."}]