[{"5": "Dhurrin said:\t\t\t107 mandatory KPs to buy is utterly ridiculous. Say this goes live and I get that on my main account. Sure, I could afford it, but why would I even want to? I already am drowning in KP, so much so I hardly know what to do with them anymore.\t\tClick to expand...[BR]"}, {"19": "Enevhar Aldarion said:\t\t\tIn my chapter 21 US city, I only have one AW even at level 31. Everything else is lower, so always somewhere to put KP, even before chapter 21 went live and we needed thousands of KP for research. I also collect enough coins per day in that city to buy 15-20 KP daily. I will never understand people who just sit around with unspent KP.\t\tClick to expand...The regular KPs I spend. But I'm in chap 21 and I have 17 AWs maxed out and another bunch pretty close, with a total of 1074 levels of AWs so far (making the Spire a nasty experience) and one ready to be upped but no builder free.[BR][BR]24/day from the hourly KPs.[BR]7/day from the Tome[BR]7/day from the Spire lib[BR]24/day from several evolving buildings (I already have teleported a lot of them to make room, mostly the ones that give 3kp instants, so these are the ones left standing now)[BR]Right now 16 carting libs out, (saved them for the new chap) but I still have a whole bunch of Ferris Wheels in my inventory.[BR][BR]So that already is 78 KPs per day, not counting the weekly tourney rewards yet (a bit over 300/week, plus instants at the end of course), nor what I craft and since I craft constantly I do craft the things like 15 KPs as well when I see them. Or the occasional chest I harvest from the MA (especially during the FSA) which tends to drop 35 KPs about 10% of the time.[BR]With over 20.000 KPs in instants in stock, KP's are just not an issue. My main concern is that at some point I'll probably have to put up some AWs I skipped so far, just to have something that can be filled using swaps."}, {"46": "Deadeye Jerry said:\t\t\tThe quests with \"scout a province\" will be taken out from the event (3 of them), I am creating the announcement right now.\t\tClick to expand...This is not true on live. Quest 9 is still the choice between scout a province and 3 witches points.[BR][BR][IMG]https://i.ibb.co/HhmScwG/https-beta-forum-elvenar-com-index-php-attachments-quest-9-jpg-11734.jpg[/IMG]"}, {"14": "Aeva said:\t\t\tThis is not true on live. Quest 9 is still the choice between scout a province and 3 witches points.\t\tClick to expand...It is, true: he has specified 3 of them, and 3 quests have been changed."}, {"2": "I have 'Buy 14 KPs' on EN server for quest 9, and 'Scout a Province ' on US.  Seeing as it's an update week I am guessing that it will be changed on Thursday."}, {"19": "Aeva said:\t\t\tThis is not true on live. Quest 9 is still the choice between scout a province and 3 witches points.[BR][BR]View attachment 11734Click to expand...This one is optional. You can choose which part of the quest to fulfill, which already is better than having it be mandatory"}]