[{"1": "Dear Humans and Elves,[BR][BR]Please use this thread to discuss the upcoming Winter Magic Event.[BR][BR]We're looking forward to your feedback![BR][BR]Kind regards,[BR]Your Elvenar Team"}, {"56": "All the event information is here:[BR]https://tinyurl.com/yxheu977[BR][BR][IMG]https://i.ibb.co/1G5pLZg/https-en-forum-elvenar-com-index-php-attachments-winter-magic-2022-jpg-6841.jpg[/IMG][BR][BR]Please feel free to share my event note with friends. It does not need Facebook to open.[BR]Note that this info was recorded in Beta actual play; there may be minor differences in the Live Version.[BR]The event will run until after New Year.[BR][BR]This is my last Elvenar event note, which I will hang around to complete as new quests arrive in Beta.[BR]I thought I may as well finish it, having done most of it already when I retired![BR][smilie--sprite1] [smilie--sprite7][BR][BR]Thanks for all the good times![BR][smilie--sprite1] [smilie--sprite1] [smilie--sprite1][BR]PS - having a great, long-overdue holiday!!"}, {"48": "Yay, I can't wait to create another Winter Wonderland to keep me at least feeling cooler during heat waves here. It might take a while, maybe after next FA. And it might even be better than last year's. It's a shame that the picture doesn't show animations, it would look so much better.[BR][BR][IMG]https://i.ibb.co/QNsvF9q/https-en-forum-elvenar-com-index-php-attachments-winter-wonderland-small-png-6842.png[/IMG]"}, {"57": "Hi Jack / others.[BR]Can I ask if the 'or' on quest 73 is correct, 'Research 1 technology or Scout 1 province'?[BR]Seems a bit excessive."}, {"9": "@Stucon according to idavis....[BR][IMG]https://i.ibb.co/xCQ4ZC8/https-en-forum-elvenar-com-index-php-attachments-screenshot-1-png-6843.png[/IMG]"}, {"56": "Stucon said:\t\t\tHi Jack / others.[BR]Can I ask if the 'or' on quest 73 is correct, 'Research 1 technology or Scout 1 province'?[BR]Seems a bit excessive.\t\tClick to expand...i agree it sounds excessive - but that is what we recorded in Beta.[BR]They have been known to spot and change 'impossible' quests before Live version.[BR][smilie--sprite1]"}, {"43": "Stucon said:\t\t\tHi Jack / others.[BR]Can I ask if the 'or' on quest 73 is correct, 'Research 1 technology or Scout 1 province'?[BR]Seems a bit excessive.\t\tClick to expand...That’s why a few of us kept optional quests open. And hence so many feedbacks in cauldron diploma thingy stuff…[BR]A also complete a province/ world map quests."}, {"57": "Ta @kimkimkim[BR]Do you have the link to the idavis site please"}, {"58": "@Stucon  Here's the link to Idavis' Event Page"}, {"15": "It looks like among the daily prizes we have pieces of the 3 Glacier Giants set. I see 2 pieces so far, the 2 others will presumably be offered soon too. It wasn't one of the best sets we had, IIRC, but it's good to see it back, maybe we get some more of the old sets offered like that [smilie--sprite1]"}, {"9": "ty @RainbowElvira"}, {"8": "Hekata said:\t\t\tIt looks like among the daily prizes we have pieces of the 3 Glacier Giants set. I see 2 pieces so far, the 2 others will presumably be offered soon too. It wasn't one of the best sets we had, IIRC, but it's good to see it back, maybe we get some more of the old sets offered like that [smilie--sprite1]Click to expand...or even a Gingerbread Tome for the base building. I deleted mine as it was early chapter. I was under the impression from what I had read on the forums it was better to delete and wait for it to appear in the MA then to upgrade it many chapters.  I've lost count of how long ago I deleted that as a test, before I did the same to other event base buildings, turns out that was b******s there's been no sign of it anywhere since."}, {"57": "Thank you @RainbowElvira"}, {"46": "Hekata said:\t\t\tIt looks like among the daily prizes we have pieces of the 3 Glacier Giants set. [...] maybe we get some more of the old sets offered like that\t\tClick to expand...I'd say that you can be sure of it. That usually happens when mature games like this realise that recycling old content is cheaper than designing new (the Event Characters also spring to mind - not that I'm objecting; just observing)... and most current players weren't here back then, so they often think it IS new... [smilie--sprite2] Unfortunately Inno has apparently also realised that nerfing old Event Buildings is a possible option, too - e.g. the Wonky Walter's Circus Tent (not badly nerfed, but it was) - I haven't heard anyone on Beta saying the same of the Winter Set pieces, though... [smilie--sprite1][BR][BR]Oh, and Wonky Walter's is now a standard Mandatory Chapter Quest reward for early Cities, too. Interesting... some small Cities have two now![BR][BR]OldHag said:\t\t\tor even a Gingerbread Tome for the base building. I deleted mine as it was early chapter. I was under the impression [...] it was better to delete and wait for it to appear in the MA [..] there's been no sign of it anywhere since.\t\tClick to expand...The Crafting Rotation is changed more often than anyone knows, but it's significantly altered since MinMax Gamer crowd-sourced its contents, some time ago now (I always feel awkward talking about someone who's not here any longer - but I can't @ tag him  because his ID has been deleted - but then again, I also feel dishonest if I don't name-credit players who have done, well, anything for the community, really! Oh well).[BR][BR]I myself have noticed that UUUs are now about 60-70% less frequent in appearance [for some six months now] than MMMs (most common) or ELRs (about 20% fewer than MMMs) - nothing to do with encouraging us to do more Spire and try to win DAs, of course - and Rainbow Unicorns are rarer now than Mana Sawmills by a factor of at least 1:3 (annoying for me personally - I heavily use the former and don't have any use for the latter)... while Rainbow Flower Cages, with their amazing 1x1 high-stats versatility in my ever-more-crowded City, are becoming a collector's item - maybe 5 x fewer than a year ago? Of course, I get plenty of chances to [expensively!] Craft PPs, although I'd rather see more Supply Windfalls (growing rarer) - and Coin Rains, too, nowadays - after the huge hike in FA Coin Sacks & Event Coins Quests demands (they're now even rarer than Supplies, but were once much more common - it interests me, actually, in light of the increased Coins demands - but this is already long enough!).[BR][BR]And I really don't buy the 'its all totally random!' argument. No, it's not. I see almost all Crafting Rotations, and if that's Inno's RNG - it's broken.[BR][BR]My own experience of seeing (or not) Evolving Buildings in particular [over the last year or so] is that most of the bases apparently never appear, while a few others are over-represented, and it seems to have little, if anything, to do with whatever Artifact is currently in the Spire. Both 2019 Phoenix bases & Artifacts are [relatively] frequent, though, and I've seen Gingerbread Mansion within the last year (base only, no Artifacts)... I'm also currently seeing a few May Tree Artifacts (no base)... and although these really ARE rare, the 2019 Bear bases & Artifacts do also appear, too. Plus a few strangely random Artifacts here and there - not enough for anyone to make use of, though. I do feel sorry for the tiny new Cities I see with sad Stage 1 or max. Stage 2 bases - near-useless and HUGE as they are in Ch.1-3, just sitting pointlessly in their Cities... making fewer Supplies and/or Goods than a couple of extra Workshops/Manus would also provide, and no doubt having cost them scarce Crafting Resources to build, too. That's pretty unfair IMO - it's hard enough to get started in Elvenar.[BR][BR]A cynic would almost think that they're in Crafting at least partly for that reason, especially because excluding them from (say) pre-Ch.V Cities would be a much fairer (and hardly difficult) thing to do, IMO... using up valuable early space while those tempting Premium Expansions don't look TOO expensive, or might still even be on discounted offer? no idea, now! - after all, it's a widespread belief that ALL Evolving Buildings are fab, with Facebook comments in particular often making little distinction between excellent Event Grand Prizes and ones which - aren't.[BR][BR]Good thing I'm not a cynic, isn't it? [smilie--sprite8][BR][BR]PS : I have no reason, either, not to believe that some of us see different Crafting Rotations from others. Inno do a lot of silent A/B Testing now. And on top of this, I've heard - and to some extent have seen this myself, through experience - that the Crafting Rotation now adapts, to some extent, according to what each player chooses most often to Craft. O the joys of minimalistic in-game data provision & Patch/Version Notes, hm?[BR][BR]PPS : It would be entirely possible for Inno to offer in Crafting, post-Events, those Set pieces which players didn't win. But noooo... bah, humbug!"}, {"12": "Laurelin said:\t\t\tGood thing I'm not a cynic, isn't it? [smilie--sprite8]Click to expand...Good thing you are still adept in the skilful use of sarcasm then.  [smilie--sprite1][BR][BR](Is there such a thing as too many cynics?)  [smilie--sprite7]"}, {"48": "SkyRider99 said:\t\t\t(Is there such a thing as too many cynics?)  [smilie--sprite7]Click to expand...[BR]Now I imagined a world where everyone's a cynic. Where would happiness go? [smilie--sprite9]"}, {"6": "What would be a good aggregate noun for a cynics?  A flout of cynics?"}, {"15": "OldHag said:\t\t\tor even a Gingerbread Tome for the base building. I deleted mine as it was early chapter. I was under the impression from what I had read on the forums it was better to delete and wait for it to appear in the MA then to upgrade it many chapters.  I've lost count of how long ago I deleted that as a test, before I did the same to other event base buildings, turns out that was b******s there's been no sign of it anywhere since.\t\tClick to expand...I'm not sure if it's still in crafting since it's in my inventory so it wouldn't show up for me but they might offer it as a Tome of... something during this winter event, the one that usually comes after all 9 artifacts ofc, so no easy to get. People from beta might now, I haven't bothered to check all the prizes this time as winter events are my least favourite ones."}, {"15": "Laurelin said:\t\t\tI'd say that you can be sure of it. That usually happens when mature games like this realise that recycling old content is cheaper than designing new (the Event Characters also spring to mind - not that I'm objecting; just observing)... and most current players weren't here back then, so they often think it IS new... [smilie--sprite2] Unfortunately Inno has apparently also realised that nerfing old Event Buildings is a possible option, too - e.g. the Wonky Walter's Circus Tent (not badly nerfed, but it was) - I haven't heard anyone on Beta saying the same of the Winter Set pieces, though... [smilie--sprite1][BR][BR]Oh, and Wonky Walter's is now a standard Mandatory Chapter Quest reward for early Cities, too. Interesting... some small Cities have two now!\t\tClick to expand...I don't mind recycling since I often like some of the old buildings more than the new ones and I have deleted quite a few before we got RR spells. It can also save some RRs  [smilie--sprite1] [BR]I'm not sure they will offer all the old sets like this. The 3 Glacier Giants is a weak set compared to some other we had. For instance I've been hopping 'n' praying to see the Kirit and Krarak set back because it's a great set and I'm missing one piece but they have offered it for Black Friday for something like 80 euros so I'm no holding my breath to see it offered as daily prize [smilie--sprite3][BR][BR]I didn't know about Wonky W. but I have noticed that they have the tendency to take an old building that was a bit exclusive and hard to get (especially to have more than 1) and make it easily available in multiple copies to everyone (as daily prizes or crafting, thinking of the Windmill for instance and a few other). I might be weird but I like having a few unique buildings in my city and now that's harder to achieve [smilie--sprite1]"}, {"12": "Silly Bubbles said:\t\t\tNow I imagined a world where everyone's a cynic. Where would happiness go? [smilie--sprite9]Click to expand...The longest journey begins with a single step.  [smilie--sprite7]"}]