[{"46": "Aha! - I spy the tiniest excuse to go on about matters philosophical! Anyone who values their sanity should probably skip ahead, post haste... [smilie--sprite2][BR][BR]If anyone IS still here, though? ...[BR][BR]Silly Bubbles said:\t\t\tNow I imagined a world where everyone's a cynic. Where would happiness go? [smilie--sprite9]Click to expand...@Silly Bubbles : But why would it need to go anywhere... assuming one even had it in the first place?[BR][BR]I often make jokes (well, they amuse me?) about myself on the Forums - but the reality is that I'm far more of a Cynic than a cynic (see below).[BR][BR]Be that as it may, 'cynical' in any of its meanings =/= unhappy, per se, and closer to the reverse, in fact, in its Classical sense.[BR][BR]Most of us aren't actually happy, as such, very often, but just as is true of cynicism, 'happiness' is a word with more than one meaning, especially nowadays. In my understanding, happiness is the direct opposite, and necessary complement, of sadness or misery - and we will all experience both of those, albeit not consistently, at least some of the time - rather than a state of being which any of us is likely to be experiencing ALL the time, or even for very long at any given time, since both terms usually imply a [changeable] cause of some kind - and nothing is permanent but change.[BR][BR]When people describe themselves as 'happy', they usually mean something more like 'contented', in most cases - and that makes sense to me.[BR][BR]And since I AM talking about me, I'm very fortunate to be able to say that I am more consistently contented than many of my acquaintance and knowledge alike - a state which I regard as being quite distinct from the 'moments of happiness' (or, again, of misery)... and in my opinion, this is not only the ideal 'default state' of Humanity, if we even have such a state, but is also, in and of itself, actually far more to be desired as a continual state of existence than outright happiness. However - there's usually a 'however'! - contentment does need to be both recognised and valued before it can be fostered... and there, it seems to me, is where the desire to start chasing [far more fleeting] happiness instead often begins.[BR][BR]And no matter what one's understanding of happiness (or indeed misery) may be, it's still not true that either of those two conditions and cynicism - and especially not Cynicism - have ever been (or been seen as) mutually exclusive. I often why it's even considered that they would be?... not least because IMO, one of the unhappiest places where one could ever live is in a Fool's Paradise, where Cynics/cynics typically very rarely reside...![BR][BR]NB : As it happens, Diogenes - see also below - is my No.1 hero amongst the Classical philosophers. I would genuinely emulate him, as best I could, within reason (Britain is colder & wetter than Greece, and pneumonia is a thing!), if I wouldn't get carted off to the Funny Farm (again) as a result! ^_^[BR][BR]Sir Derf said:\t\t\tWhat would be a good aggregate noun for a cynics?  A flout of cynics?\t\tClick to expand...@Sir Derf : But why 'flout', though? What do cynics flout? The usual target of flouting is something like 'rules' - although I suppose one can also flout social mores, conventional wisdom, etc. - so maybe that's what you meant...? I mostly enjoy your anagrams & wordplays, but this time I think I really don't get it? Probably just my brain taking another step towards marshmallowdom, and it's actually obvious, but just thought I'd ask! [smilie--sprite1][BR][BR]So, if anyone's interested? - see below the definitions of a cynic - and a Cynic - as per my favourite online Dictionary. Incidentally, I was using the word in its modern implied meaning in my earlier post... but as always, English is a veritable maelstrom of multiple meanings - that's one of the reasons I love it so much! - and I rarely use 'cynic/al' without having at least one eye on its original meaning, too.[BR][BR]And yes, I AM just as annoying as this IRL - if not more so, believe it or not...!![BR][BR]PS : @SkyRider99 - It takes far fewer words to agree that, yes, I love me a bit of sarcasm - even more than the average Brit! Blame Laurelin's Mum... [smilie--sprite2][BR][BR]cyn·ic​n.[BR]1. A person who believes all people are motivated by selfishness.[BR]2. A person whose outlook is scornfully and habitually negative.[BR]3. Cynic A member of a sect of ancient Greek philosophers who believed virtue to be the only good and self-control to be the only means of achieving virtue.[BR][BR]adj.[BR]1. Cynical.[BR]2. Cynic Of or relating to the Cynics or their beliefs.[BR][BR][Latin cynicus, Cynic philosopher, from Greek kunikos, from kuōn, kun-, dog; see kwon- in Indo-European roots.][BR][BR]Word History :[BR][BR]The Greek word kunikos, from which cynic comes, was originally an adjective meaning \"doglike,\" from kuōn, \"dog.\" The use of the word kunikos to designate the Cynic philosophers may make reference to the Kunosarges, an athletic training area where Antisthenes, a pupil of Socrates, is said to have taught the foundations of Cynic philosophy: that virtue, rather than pleasure, is the only good, and that virtue can be attained only through rigorous self-control.[BR][BR]Alternatively, the designation kunikos may make reference to Antisthenes' most famous student, Diogenes of Sinope, whom the people of Athens nicknamed ho kuōn, \"the dog.\" Diogenes himself seems to have accepted this nickname as an apt description of the life he tried to lead, stripped of all elements of civilization and social convention that he considered superfluous and detrimental to virtue. Diogenes lived without shame out of an old wine jar in the public spaces of Athens and went barefoot in the snow to inure himself to cold, all the while reproaching the citizens of Athens for their addiction to worthless pleasures and luxuries.[BR][BR]Even Alexander the Great admired Diogenes' determination and powers of self-denial in the pursuit of virtue. Once, when Diogenes was sunning himself outside, Alexander came up and stood over him. \"Ask me any favor you wish,\" Alexander said. \"Stand out of the sun,\" Diogenes replied. According to another anecdote, diners made fun of Diogenes at a banquet by throwing bones at him like a dog, and he responded by urinating on them.[BR][BR]Tales like these have undoubtedly influenced the development of the meaning of the word cynic in English. When Cynic first appeared in English in the 1500s, it referred to the Cynic philosophers, but cynic and cynical were soon applied to anyone who finds fault in others in a contemptuous or sneering way. Eventually, cynic came to mean \"one who believes selfishness determines human behavior\"—very far from an accurate description of the ancient Cynic philosophers practicing asceticism and poverty and occasionally trying to shock their fellow citizens into virtue."}, {"46": "Meanwhile - and actually ON-TOPIC for once! - how about this latest piece of, er, interestingly baffling Event content from the Mind of Inno...?[BR][BR]As I often reiterate, I am no mathematician, but even my numerically incompetent mind can spy a slight problem with the 'OR' illustrated below![BR][BR]OK, I know, this may well not also be true of a City in some other Chapter, or with some other Main Hall level - or it's just a typo?! - but it did make me smile... even though it's still my opinion that GUARD YOUR COIN RAINS is good advice at this particular time in this particular game![BR][BR][smilie--sprite1][BR][BR]Spoiler: [A bit of] Event Quest Info Ahead![BR][IMG]https://i.ibb.co/rxpSsD6/https-en-forum-elvenar-com-index-php-attachments-winter-magic-event-2022-q-49-coins-coin-rains-insta.jpg[/IMG][BR][BR][IMG]https://i.ibb.co/TvwrsLW/https-en-forum-elvenar-com-index-php-attachments-winter-magic-event-2022-q-49-coins-coin-rains-insta.jpg[/IMG]​[Edited to add Spoiler tag... doh!]"}, {"8": "Hekata said:\t\t\tI'm not sure if it's still in crafting since it's in my inventory so it wouldn't show up for me but they might offer it as a Tome of... something during this winter event, the one that usually comes after all 9 artifacts ofc, so no easy to get. People from beta might now, I haven't bothered to check all the prizes this time as winter events are my least favourite ones.\t\tClick to expand...I have Gingerbread artefacts in my MA for a cost of 3bp and 10k spell fragments. I already have 15 Artefacts but nowhere to use them No sign of a tome for the base in the winter event (Ha). The Tomes they have as rewards for this event are not very impressive compared to previous tomes in past events."}, {"12": "Laurelin said:\t\t\tIMO, one of the unhappiest places where one could ever live is in a Fool's Paradise, where Cynics/cynics typically very rarely reside...!\t\tClick to expand...You and I will never be in danger of inhabiting such climes @Laurelin.  Sadly the growing membership of those living in a Fool's Paradise are shielded by the cosmic law of 'ignorance is bliss'.  [smilie--sprite10][BR][BR]I enjoyed your short dissertation on the origin of the Cynics."}, {"48": "SkyRider99 said:\t\t\tSadly the growing membership of those living in a Fool's Paradise are shielded by the cosmic law of 'ignorance is bliss'. [smilie--sprite10]Click to expand...[BR]There's surely a lot of people that live in imaginary world ignoring reality or twist it to their needs. We can’t get anything real ignoring reality. Focusing only on bad and ignoring the good is as bad as focusing only on good and ignoring the bad. Like everything, it’s about balance. Either way, reality is what we have, we might as well enjoy it. And there’s always ways to improve things when we put an effort into it.[BR][BR]Ps. Is there such a thing as Fool's Hell?"}, {"6": "@Laurelin [BR][BR]Thesaurus.com listed \"flouter\" as a synonym of \"cynic\", and I deemed that the best word from which to suggest a mass noun from."}, {"12": "On a less positive note. How miserable can it get? 21 days until the end of the Event, and we are locked to only one quest per day! Is this some sort of conspiracy?!  For those so inclined it seems reasonable to allow us to get to at least the last 7 days before kicking us in the nether regions.  [smilie--sprite5]"}, {"20": "Well, one way to avoid the frustration of 1 quest per day is to not progress so fast through what was available.  Calculate how many quests you have to do to do the same number of quests every day and stick to it.  Guess there are not many that play it like this."}, {"43": "SkyRider99 said:\t\t\tOn a less positive note. How miserable can it get? 21 days until the end of the Event, and we are locked to only one quest per day! Is this some sort of conspiracy?!  For those so inclined it seems reasonable to allow us to get to at least the last 7 days before kicking us in the nether regions.  [smilie--sprite5]Click to expand...A good fraction of the players login twice a day. [BR]I guess this kind of design, is apt for that kind of clientele… (people who travel a lot, people who are very occupied by their jobs etc)"}]