[{"1": "Bis dato bin ich noch im Forum angemeldet, bevor ich meine Löschung im Forum beantrage, hätte ich , ich gern eine offizielle Antwort, die für mich richtungsweisend ist hinsichtlich meines weiteren Vorgehens.[BR][BR]Korrekt/ unstrittig ist, dass der Foren-Username ( = Name des Spielers)  bei einer Löschung annonymisiert wird, man wird als gelöschtes Mitglied + Nr weitergeführt.[BR]Meine Frage bezieht sich auf zitierte Beiträge eines gelöschten Forumsmitglieds :[BR]bei solchen Wortmeldungen  ist immer noch erkennbar, dass ein SpielerXYZ Teil der Forum-Community war.[BR]Das ist m.E. rechtlich nicht ganz unbedenklich,  gerade wenn besagter SpielerXYZ noch aktiver Spieler ist.[BR][BR]Ich weiß, dass ein gelöschtes  Community-Mitglied kein Recht auf Tilgung seiner Beiträge hat, wohl aber auf Anonymisierung der Beiträge. Diese ist nicht gegeben bei Zitaten.[BR]Gelöschte Mitglieder mit Aktivität im Spiel werden quasi mittels Zitaten als ehemalige Forumsmitglieder öffentlich geoutet,[BR]denn[BR]das Forum ist öffentlich ohne Anmeldung lesbar.[BR][BR]Ich hätte gern eine verbindliche Auskunft von offiziellen Mitarbeitern ( z.B  @Tacheless oder @V.E.N.U.S  )   ob diese oben angesproche Nicht-Annonymisierung durch Zitate  lege artis ist hinsichtlich  DSVGO .[BR][BR]Ich bitte die Mitglieder des Forums, die etwas zu diesem Thread beitragen wollen, um sachdienliche Wortmeldungen der konstruktiven Art.[BR][BR]Ich bedanke mich vorab."}, {"2": "Ich kann das gerne erfragen. Es wird aber ein paar Tage dauern, bis ich hierauf eine Antwort erhalten werde."}, {"1": "Danke, @Tacheless .[BR]Kein Thema, dass die Abklärung dauert. Soll ja auch bitte eine verbindliche Antwort werden, die Hand und Fuß hat, zudem ist Wochenende."}, {"1": "Ergänzung:[BR]Gleiche Anfrage gilt auch für verlinkte Namen, welche noch ersichtlich machen, dass ein gelöschter User Mitglied des Forums war"}, {"3": "So weit ich weiß, sind die Beiträge selbst nicht Kundenbezogen im Sinne der GDPR, aber so sicher bin ich mir da nicht.[BR][BR]Spätestens nicht, wenn jemand etwas zitiert, wäre es dann auch Inhalt des anderen Spieler.[BR]Du kannst vmtl. auch eine Löschung beantragen, bei der alle deine Beiträge gelöscht werden.[BR]Aber joa wenn man soviel Angst hat, bedenke das jeder heute einen komplett Abzug vom Forum machen könnte und so alle Daten hätte egal ob sie gelöscht werden. Das Internet vergisst (normalerweise) nichts.[BR]Für alle anderen die umbedingt wissen wollen, welche Beiträge vom grandiosen Piepom verfasst werden merkt euch:[BR]Piepom: Gelöschtes Mitglied 27735"}]