[{"1": "Bis dato bin ich noch im Forum angemeldet, bevor ich meine Löschung im Forum beantrage, hätte ich gern eine offizielle Antwort, die für mich richtungsweisend ist hinsichtlich meines weiteren Vorgehens.[BR][BR]Korrekt/ unstrittig ist, dass der Foren-Username ( = Name des Spielers)  bei einer Löschung annonymisiert wird, man wird als gelöschtes Mitglied + Nr weitergeführt.[BR]Meine Frage bezieht sich auf zitierte Beiträge eines gelöschten Forumsmitglieds :[BR]bei solchen Wortmeldungen  ist immer noch erkennbar, dass ein SpielerXYZ Teil der Forum-Community war.[BR]Das ist m.E. rechtlich nicht ganz unbedenklich,  gerade wenn besagter SpielerXYZ noch aktiver Spieler ist.[BR][BR]Ich weiß, dass ein gelöschtes  Community-Mitglied kein Recht auf Tilgung seiner Beiträge hat, wohl aber auf Anonymisierung der Beiträge. Diese ist nicht gegeben bei Zitaten.[BR]Gelöschte Mitglieder mit Aktivität im Spiel werden quasi mittels Zitaten als ehemalige Forumsmitglieder öffentlich geoutet,[BR]denn[BR]das Forum ist öffentlich ohne Anmeldung lesbar.[BR][BR]Ich hätte gern eine verbindliche Auskunft von offiziellen Mitarbeitern ( z.B  @Tacheless oder @V.E.N.U.S  )   ob diese oben angesproche Nicht-Annonymisierung durch Zitate  lege artis ist hinsichtlich  DSVGO .[BR][BR]Ich bitte die Mitglieder des Forums, die etwas zu diesem Thread beitragen wollen, um sachdienliche Wortmeldungen der konstruktiven Art.[BR][BR]Ich bedanke mich vorab."}, {"2": "Ich kann das gerne erfragen. Es wird aber ein paar Tage dauern, bis ich hierauf eine Antwort erhalten werde."}, {"1": "Danke, @Tacheless .[BR]Kein Thema, dass die Abklärung dauert. Soll ja auch bitte eine verbindliche Antwort werden, die Hand und Fuß hat, zudem ist Wochenende."}, {"1": "Ergänzung:[BR]Gleiche Anfrage gilt auch für verlinkte Namen ohne jegl Zitat, welche noch ersichtlich machen, dass ein gelöschter User Mitglied des Forums war"}, {"1": "Ergänzung[BR]siehe folg. Thread / Spieler-Guide:[BR]\t\t\thttps://de.forum.elvenar.com/index.php?threads/brans-zusammengew%C3%BCrfelter-guide.5879/\t\t[BR]Ersteller ist ein gelöschtes Mitglied ((Deleted User)  im Kommentarbereich, aber Username noch beim Erstelldatum des Guides ersichtlichebenso div. Verlinkungen des NamensAuch hier hätte ich gern eine verbindliche Auskunft von offiziellen Mitarbeitern ( z.B @Tacheless oder @V.E.N.U.S ) ob diese oben angesproche Nicht-Annonymisierung lege artis ist hinsichtlich DSVGO ."}, {"2": "Was soll denn daran gegen irgendwas verstoßen? Ich habe dir bereits gesagt, was in unseren AGB´s steht und diese sind DSVGO-Konform.[BR]Wenn du meinst, weil man auf einen alten Accountnamen daraus schließen kann: Bitte erkläre mir, welche Daten du oder andere aus einem alten Accountnamen ziehen könnt.[BR][BR]Wir CM´s sind keine Juristen und führen auch keine juristischen Gespräche oder beraten Spieler in diesem Sinne. Bitte berücksichtige dies! Sollte etwas gegen irgendeine geltende Verordnung/Gesetz verstoßen, werden wir sicherlich was dagegen unternehmen. Wir werden aber nicht anfangen, hier über das Forum juristischen Beistand zu geben oder juristische Fragen zu beantworten. Hierfür kann man gerne einen entsprechenden Anwalt aufsuchen."}, {"1": "Mir ist klar, dass CMs keine Juristen sind, [BR]darum sollte dies von euch  vllt. mit INNOs Rechtsabteilung abgesprochen werden.[BR]Ich möchte dann nur ein Feedback, dass es rechtskonform ist."}, {"2": "Es ist rechtskonform, dass wir von Inno Guides und dergleichen, auf unseren offiziellen Plattformen nutzen können und auch, dass man sieht, dass dies von xyz geschrieben wurde vor x Jahren. Mehr muss ich dazu auch nicht sagen."}, {"1": "Danke @Tacheless  für die Auskunft, die ich nun als verbindlich betrachten darf. Mehr brauche ich erst mal nicht."}, {"2": "Um die ursprüngliche Frage zu beantworten: Wir müssen den Namen in Zitaten nicht löschen/unkenntlich machen. Wir können dies tun, wenn man uns darauf aufmerksam macht und den Link zum Zitat schickt (vom Ersteller des zitierten Beitrag), aber verpflichtet sind wir nicht."}]