[{"1": "Již brzy se tu objeví nová událost Podzimní zvířetník 2023. Těšíte se? Který typ událostí máte nejraději? "}, {"2": "Podzimní zvířetník patří mezi mé oblíbené."}, {"3": "Já už se spis těším na temný les "}, {"4": "Netěším se, hraji to na betě, nicméně hlavní cena může být velmi zajímavá, zvláště pak pro ty, kteří nemají knihovny."}, {"2": "VB není nikdy dost, já knihovny mám a barák 3x3 co dá každý den 3 VB je skvělá možnost. [BR]Každý den tak severu nějakých 70 bodů[BR]Ve výzkumu je to super pomoc."}, {"5": "Do temného lesa nabít baterky a koupit svíčky [BR]Budova opět disajnově krásná....už jen kvůli tomu najde své místo ve městě."}, {"6": "Vyměním kaligrafie z loňska a pro hada se také nějaké to místo najde."}, {"3": "Pokud dá barák katalyzátor za každých 5 střetu (opravdu střetů a ne provincií?), pak je dost dobře možné, že knihovny poletí do inventáře... za týden mi dají 42 cinidel a zasoby rostou, ale to by turnaje mohly cca taky..."}, {"7": "Veteráni: V nadcházejícím eventu,[BR]který barák si mám nechat, respektive bez čeho se už v Elvenaru neobejdu?[BR]"}, {"8": "krmeni je vyrazne mene nez cinidel, take palit krmeni za cinidla urcite nebudu. ale VB se hodi vzdy."}, {"4": "@Emhyr var Emreis II - činidlo je opravdu za střety - 20 provincií x 6 kol = 24 činidel ( had level 10 )[BR][BR]@Boobika - krmení je teď pomalu v každé otočce receptů a navíc spotřeba hada je 1 x týdně, pokud tedy máš časový skok na 30 a polárku k tomu"}, {"8": "spotrebu mam tak 3-5 tydne. krmim i jina zvirata  ohnivak/polarka/soumrak/mistr panda (a skok na 30)[BR]V mych nabidkach ve vyrobe se otaci krmeni hodne malo a to vyrabim pomerne intenzivne "}, {"9": "no rekla bych ze opravdu zvedli cetnost potravy takze nebudu-li mit extreme moc cinidel klidne hada jednou tydne nakrmim, funkcnost jsem testovala hned na zakladne a funguje dobre[BR]jinak zase naky runy nebo tak urvu a nebo druhy den nejake strelce tedy dojo[BR]jedine co mi nesedi je had s nozkama ikdyz je pekny"}, {"6": "V podstatě je to fuk, kam co dáváš výměnou za něco jiného. Důležité je, abys měl stálý přísun toho, co tam dáváš, jinak za čas nemáš, co kam dávat a čumíš."}, {"3": "Tohle je tak metafyzicke... a dvojsmyslne "}, {"5": "Waso napsal/a:\t\t\tVeteráni: V nadcházejícím eventu,[BR]který barák si mám nechat, respektive bez čeho se už v Elvenaru neobejdu?[BR]Klikněte zde pro zvětšení......z budov snad jen pro někoho Magický louskáček - velikost 3x3 na pole sice v TOP20, ale se slušnou kulturou, takže se sousedkou motivací a případným bonusem to již zajímavé je... / jsou samo lepší budovy na manu, ale některé nemají dostatečnou kulturu, takže se často bonusu vyhnou/.[BR]PS: XXI.kap bude chtít hodně many [BR][BR]+ pro zájemce:[BR]\t\t\thttps://sciencemag.cz/astronomove-objevili-hvezdneho-hada-netypicky-prilivovy-ocas-v-orionu/\t\t"}, {"7": "První odpověď na jednoduchý dotaz.: Dík a dík a taky díky !!  "}, {"9": "ty jo tak to ja bych se bez nej i obesla je to celkem vec nazoru, muze byt efektivni ale kdyz nesbiras prubezne tedy do 9h tak uz efektivita klesa[BR]takze zase zalezi na hernim stylu"}, {"10": "medvědi, to je moje mám to rád"}, {"8": "jak funguje vyziva tohdole medveda?[BR]nakrmil jsem ho... odehral 12 turnaju pro test... a nic. V nahledu pise 2/10. pripisuje se to automaticky? nebo po vyrpseni krmeni se nabidnou cinidla ke sberu?"}]