[{"1": "Zapraszam do dyskusji."}, {"2": "Troszkę informacji o 19 rozdziale TUTAJ [smilie--sprite1]"}, {"11": "Dodaje informacje o budynkach osady[BR]Portal - Fortress of Revenge[BR][BR]Wieża Światła+ Mroku  Tower of light ( 2 poziom to mroczna)[BR][BR]Breeding Facility [BR][BR]Droga portalu Magical Warpath ( łączy portal z Breeding Facility)[BR]"}, {"6": "A co z usunięciem z badań cudów z 18 rozdziału 300 odznak? Na becie zostało to zrobione, Marindor mówiła, że powinno przejść na live"}, {"2": "Koval92 napisał:\t\t\tA co z usunięciem z badań cudów z 18 rozdziału 300 odznak? Na becie zostało to zrobione, Marindor mówiła, że powinno przejść na live\t\tKliknij aby rozwinąć...Pewnie wejdzie wraz z nowym rozdziałem. Raczej nie ma opcji, żeby beta miała inne drzewko badań niż reszta."}, {"9": "Będzie dziś ten nowy rozdział? Aktualizacja była o 14 a nowej rasy brak"}, {"2": "Póki co mamy już odblokowaną ekspansję z prowincji [smilie--sprite1][BR]I usunęli rasowe surowce z badań cudów"}, {"9": "Amerykanie piszą że idzie 4 próba, na razie bez sukcesu"}, {"11": "Nie wiem o co chodzi, ale u mnie się już wyświetla na apce."}, {"2": "Charlene napisał:\t\t\tNie wiem o co chodzi, ale u mnie się już wyświetla na apce.\t\tKliknij aby rozwinąć...Na przeglądarce też już jest [smilie--sprite1]"}, {"11": "@jarq może by tak ktoś dodał nową rasę do Wiki?"}, {"1": "Tak b[BR]Charlene napisał:@jarq może by tak ktoś dodał nową rasę do Wiki?\t\tKliknij aby rozwinąć...Tak będzie przygotowana, już pracujemy nad tym, ale dajcie nam jeszcze kilka dni."}, {"3": "Na razie widzę spore inspiracje filmem Mucha z 1986 roku [smilie--sprite2]"}, {"31": "U mnie produkcja unurytu z kupca nie starcza na produkcję w 2  manufakturach wzniosłych  ( po 1 z każdej grupy) bo mam 11k na 3h."}, {"9": "Maksymalnie wykorzystaj wolnych ludzi stawiając manufaktury. Mi starcza na 2 wyrafinowane plus 1 podstawowa ~25k"}, {"8": "11k na 3h (licząc już z bonusem oczywiście) to słaby wynik. Rzeczywiście musisz mieć zbyt niską pracującą populację.[BR]Ale masz przecież Świątynię Duchów!?"}, {"11": "Wewe1 napisał:\t\t\tU mnie produkcja unurytu z kupca nie starcza na produkcję w 2  manufakturach wzniosłych  ( po 1 z każdej grupy) bo mam 11k na 3h.\t\tKliknij aby rozwinąć...Chce Ci podziękować za ten post, ponieważ moim planem było ograniczenie ilości manufaktur na mieście i jeśli bym się zatrzymała, to by to wypaliło, ale jak chce iść dalej w rasy to absolutnie nie, bo bym nie miała wystarczającej ilości unurytu. Widziałam Twoje miasta na rzucie i faktycznie masz za mało manufaktur( najwięcej popki zużywają manufaktury) które dają jakieś 400k pracującej (jedno miasto poniżej a dwa troszkę więcej) a z tego co widziałam u innych graczy, ten poziom powinien oscylować 600-700k w górę"}, {"8": "Na szybko można wytargać z inwentarza jakiś Magiczny Warsztat. Też podniesie pracującą populację."}, {"2": "Taka fajna wskazówka do rasy [smilie--sprite1][BR]Jeśli postawimy Wieżę Światła, to nie trzeba czekać, aż się skończy budować, można sprzedać od razu taką w trakcie budowy i też dostaniemy Białą Materię [smilie--sprite8] Sprawdziłam, działa.[BR][BR]A więc prawdopodobnie wystarczy też wystartować rozbudowę na 2 poziom i od razu sprzedać, żeby dostać Czarną Materię, ale tego nie sprawdziłam, nie mam jak na razie. Jak ktoś sprawdzi, to dajcie znać.[BR][BR]Edit: z Czarną Materią też działa [smilie--sprite1]"}, {"3": "blazius1 napisał:\t\t\tNa szybko można wytargać z inwentarza jakiś Magiczny Warsztat. Też podniesie pracującą populację.\t\tKliknij aby rozwinąć...[BR]Albo dostawić kilka manufaktur żywych jeśli kto ma. I tak się przydadzą do badań[BR]W XVIII rozdziale praktycznie wszystkie manufaktury pochowałem, teraz mam wyciągnięte 5 żywych i 3 wzniosłych i to na razie daje radę, tylko ziaren nie starcza by skończyć rozbudowy zbrojowni.[BR]Czekam na event, to powinno więcej unurytu wpadać ze świątyni duchów."}]