[{"52": "czy może mi ktoś podpowiedzieć, do czego służy biała materia i czarna materia ... biała materia służy do rozbudowy wież a poza tym? ... do czego  będzie przydatna czarna materia po zburzeniu wieży? ... czy gromadzić bo będzie później potrzebne, czy nie marnować zasobów?"}, {"2": "nonpix napisał:\t\t\tczy może mi ktoś podpowiedzieć, do czego służy biała materia i czarna materia ... biała materia służy do rozbudowy wież a poza tym? ... do czego  będzie przydatna czarna materia po zburzeniu wieży? ... czy gromadzić bo będzie później potrzebne, czy nie marnować zasobów?\t\tKliknij aby rozwinąć...[BR]Nusion napisał:\t\t\tBiała Materia jest potrzebna do rozbudowy Wieży Światła na 2 poziom - koszt 1 Biała Materia, natomiast Czarna Materia posłuży do rozbudowy Portalu - koszt każdego poziomu to 24 Czarnej Materii.[BR]Białej i Czarnej Materii nie uzyskamy przy pomocy zysków portalu, a więc Wieże trzeba będzie stawiać i sprzedawać.[BR]Żeby sprzedać Więżę Światła lub Ciemności nie trzeba czekać 7 dni do wygaśnięcia, można je sprzedać w dowolnym momencie.[BR]Nie trzeba czekać, aż budynki skończą się budować, wystarczy postawić w mieście/ włączyć rozbudowę i od razu można sprzedać, by otrzymać Białą/Czarną Materię.[BR]Wieża buduje się 2h, rozbudowa do 2 poziomu to też 2h. Nie zmienia rozmiaru.[BR]Do przejścia rozdziału będzie trzeba postawić w sumie 144 Wieże, 72 sprzedać na 1 poziomie, a kolejne 72 rozbudować i sprzedać na 2 poziomie.\t\tKliknij aby rozwinąć..."}, {"52": "Dziękuję ... czyli budowanie i sprzedawanie"}, {"6": "Jak zawsze \"zbalansowany\" rynek, ofert nowych towarów: Proszku lotniczego na Felyndralu prawie nie ma, Aerozoli 46 stron ofert z czego 44.5 strony \"chce proszku\", wosku 6 stron z czego 6/6 \"chce proszku\". [BR][BR]Na wielu serwerach innych opcji językowych to samo. Dobrze, że kupcy dają co 6h te towary bez względu na to, czy ktoś zdejmie oferte czy nie..."}, {"3": "Koval92 napisał:\t\t\tDobrze, że kupcy dają co 6h te towary bez względu na to, czy ktoś zdejmie oferte czy nie...\t\tKliknij aby rozwinąć...[BR]Taaa, tylko zebranie wystarczającej ilości by postawić wylęgarnię w tym tempie to 2 dni i kupiec zajęty tylko na to"}, {"15": "Ovocko lepszy rydz niż nic. Tak to ofki by Ci wisiały i wisiały i nic z tego, jak cały serwer chce tylko proszku.... A trochę ich poniosło z wymaganiami do budynków/badań to powoli ale nawet jak 3x dziennie nastawisz tych kupców to zawsze coś wpadnie."}, {"3": "@Steefann - nie no, patrząc w ten sposób to tak. [BR]Co nie zmienia tego, że zapowiada się długi rozdział. Przynajmniej A1 (minerały/sztabki/sadzonki) schodzą w miarę bez problemu"}, {"8": "Koval92 napisał:\t\t\tJak zawsze \"zbalansowany\" rynek, ofert nowych towarów: Proszku lotniczego na Felyndralu prawie nie ma, Aerozoli 46 stron ofert z czego 44.5 strony \"chce proszku\", wosku 6 stron z czego 6/6 \"chce proszku\".[BR][BR]Na wielu serwerach innych opcji językowych to samo. Dobrze, że kupcy dają co 6h te towary bez względu na to, czy ktoś zdejmie ofertę czy nie...\t\tKliknij aby rozwinąć...[BR]To oznacza dwie rzeczy:[BR][BR]1. Że wszystkie zabiegi w celu balansowania rynków towarów, jakie śledzimy od circa dwóch lat, są bezskuteczne.[BR]I te działania teoretycznie znaczące, jak masowe przenosiny miast do centrum mapy. I wszelakie rebalanse, typu na przykład rebalans w obrębie produkcji Zestawów Bibliotecznych. Oraz tym podobne punktowe działania. One są pozorne.[BR]Z tym manewrem w Zestawie to była już tylko zwykła żonglerka parametrami. Bez znaczenia dla rynków towarów T2.[BR][BR]Te zabawy nadal balansu rynków nie przynoszą. Prawdopodobnie dlatego, że one oparte zostały o jedno główne założenie: że po ich wprowadzeniu, z czasem, napływ nowych graczy i ich szybki rozwój w końcu przywróci te balanse.[BR][BR]Ale tak się nadal nie dzieje, ponieważ ani napływ nowych graczy nie jest wystarczająco duży, ani rozwój tych miast i ich wpływ na ogólną produkcję poszczególnych towarów nie rośnie wg założeń. I o balansach rynków (ich braku) decydują nadal starzy gracze. Zgaduję, że w FoE jest odmienny układ, ale pomimo tego zaserwowano nam kilka zmian, jakby w Elvenarze działały zasady takie same jak w FoE. Bo że mechaniki są kopiowane to wiemy na pewno. Wiemy także, że nader często bezrefleksyjnie.[BR][BR][BR]2. Że trzeba zwiększyć efektywność zakładki Kupcy, lub wprowadzić drugie, podobne w charakterze rozwiązanie.[BR][BR]Najlepiej to drugie, ponieważ kontrolowanie zakładki Kupcy to zwyczajna mitręga dla graczy, a główną zaletą tej zakładki jest wyeliminowanie zjawiska spekulacji towarami najnowszych sortów i ograniczenie spekulacji na rynku T3. Ale skuteczna walka ze spekulacją nie miała przecież wpływu na balanse rynków. Nie mogła mieć.[BR][BR]Czyli ponownie należałoby pomyśleć o kolejnym rozwiązaniu podobnym do tej zakładki ale bardziej efektywnym, uwzględniającym istniejącą rolę w grze starych graczy. A nie nowych.[BR][BR]A jak nie, to będziemy epokę nr 19 trzepać średnio po prostu po półtora roku. [BR]....I gra się nie zawali."}, {"3": "Ja bym jednak nie oceniał tak szybko. [BR]Na razie nie wiadomo jeszcze do końca na ile sytuacja spowodowana jest tym, że XIX rozdział dopiero co wszedł a co za tym idzie wszyscy są z grubsza w tym samym momencie zadań i wszyscy potrzebują tych samych towarów.[BR]Widać to było też na samym początku, gdy widać było wzost zapotrzebowania na niektóre rodzaje żywych. Teraz wszyscy utknęli na zadaniach/rozbudowach zwywiązanych z wzniesionymi i rynek żywych się unormował.[BR]Jest więc szansa, że za jakiś czas, gdy przejdzie \"fala\" tych, którzy wskoczyli w XIX rozdział w tym samym momencie, sytuacja się unormuje.[BR][BR]Tylko że w takim przypadku balansowanie rynku nic nie pomoże, ani nie ma nawet za bardzo nic do rzeczy, bo jedyne co by pomogło to owszem, balansowanie, ale badań/kosztów budowy budynków osady (czyli dla różnych graczy badania/budynki musiałyby wymagać różnych towarów do ukończenia/(roz)budowy)."}, {"2": "Ovocko napisał:\t\t\t(czyli dla różnych graczy badania/budynki musiałyby wymagać różnych towarów do ukończenia/(roz)budowy).\t\tKliknij aby rozwinąć...[BR]Badania nie, ale portal, wieże i zakłady hodowlane wymagają różnych towarów do budowy/rozbudowy zależnie od bonusu gracza"}, {"3": "Nusion napisał:\t\t\tBadania nie, ale portal, wieże i zakłady hodowlane wymagają różnych towarów do budowy/rozbudowy zależnie od bonusu gracza\t\tKliknij aby rozwinąć...[BR]No to kicha..."}, {"15": "Tylko badania NIE wymagają wzniosłych. Wzniosłe są potrzebne do budynków a  skoro każdy gracz potrzebuje innych, zależnie od bonusu to teoretycznie wszystkie 3 wzniosłe powinny być potrzebne. A sytuację mamy taką, na s3 przynajmiej, że jest 60 stron ofert aerozoli za pył, 8 stron ofert wosku za pył i 0 ofert pyłu za cokolwiek [smilie--sprite1]"}, {"11": "Przypomnijcie jak wyglądała sytuacja ze wzniosłymi przy 18 rozdziale? Bo mi się coś kojarzy, że też było marudzenie, że jest masa stron ze sztabkami a brakuje minerałów czy tam sadzonek albo odwrotnie. Zawsze będą braki i wynika to raczej z tego, że nawet jakby każdy serwer miał równomiernie rozłożone bonusy wśród graczy, to do tego 18-19 rozdziału dotrze tylko połowa, bo to nie jest gra dla każdego i dużo osób się wykrusza, więc nici z równomierności. Uważam, że wręcz Twórcy wzięli to pod uwagę i dali nowego Kupca, żeby gracze totalnie nie stali z postępami w rozdziale, bo jednak dostanie się te surowce. Moim zdaniem od Elvenarów zaczyna się robić bardzo trudno( proszę bez haseł, że są portalówki- robię teraz 15 rozdział normalnie i nie ma opcji, żeby wyrobić się z produkcją do badań wg PW) i raczej wszyscy powinni to przyjąć już dawno do wiadomości, że to wolne rozdziały."}, {"3": "Nie kojarzę, by w XVIII rozdziale był jakiś istotny problem z równowagą towarów.[BR]Natomiast bardzo dobrze kojarzę rozmowy o nadmiarze graczy mających w bonusie stal/zwoje/pył, a to są bonusy tych, co mają teraz areozole.[BR][BR]Jest jeszcze opcja że problem akurat z A2 wynika z tego, że (przynajmniej na początku rozdziału) nie trzeba ich zbyt wielu a ograniczona ilość kupców sprawia, że ludzie wolą skupić się na handlowaniu A1 potrzebnymi do budowy wież i portalu[BR]Bo A1 schodzą mi zazwyczaj od ręki, czasem nawet w ciągu kilku minut od wystawienia."}, {"8": "Schodzą ci od ręki bo szczęśliwie trafiłeś z profilem bonusów."}, {"3": "blazius1 napisał:\t\t\tSchodzą ci od ręki bo szczęśliwie trafiłeś z profilem bonusów.\t\tKliknij aby rozwinąć...[BR]Może, ale wtedy też z A2 powinno być lepiej?"}, {"2": "W naszej WIKI są już informacje o 19 rozdziale [smilie--sprite1][BR]Koszty rozbudowy i cała reszta"}, {"11": "Nusion napisał:\t\t\tW naszej WIKI są już informacje o 19 rozdziale [smilie--sprite1][BR]Koszty rozbudowy i cała reszta\t\tKliknij aby rozwinąć...Niestety nie wszystko :/ nie ma informacji o manufakturach oraz o cudach z tego rozdziału."}, {"2": "Charlene napisał:\t\t\tNiestety nie wszystko :/ nie ma informacji o manufakturach oraz o cudach z tego rozdziału.\t\tKliknij aby rozwinąć...A no bo to jest dział z Rasami gościnnymi [smilie--sprite1][BR]Pewnie został uzupełniony w pierwszej kolejności, na pozostałe musimy jeszcze poczekać"}, {"31": "Co do ofert wzniosłych to dostaje się towar w momencie wystawienia oferty,tak więc powoli ale jednak do przodu się idzie."}]