[{"2": "czarnuszka napisał:\t\t\tMam pytanie ile trzeba postawić zespołów każdego rodzaju do podniesienia gaju na 4 lvl ?\t\tKliknij aby rozwinąć...po 6 sztuk z każdego[BR]"}, {"7": "Korzystając z tego, że wystarczy podnieść Gaj Harmonii na 3lvl przy Wirze na 14 poziomie, można zaoszczędzić sobie drastycznej przebudowy miasta. Wystarczy używać portalówek i mieć lekki zapas teleportów [smilie--sprite1][BR]Stawiamy zespoły i po budowie chowamy je do magazynu. Robimy to tak długo aż nazbieramy ich tyle co pozwoli nam podnieść Gaj Harmonii na 3 poziom. Jak już je nazbieramy chowamy do magazynu wszystkich wytwórców robiąc sobie miejsce na wystawienie nazbieranych zespołów, Po rozbudowie gaju usuwamy zespoły. Używając portalówek nie będziemy ich potrzebować a, że mamy wir na 14lvl to nie musimy gaju podnosić już na 4 poziom [smilie--sprite1] wtedy wracają wytwórcy i kończymy rasę [smilie--sprite8]"}, {"11": "Tajniakos napisał:\t\t\tKorzystając z tego, że wystarczy podnieść Gaj Harmonii na 3lvl przy Wirze na 14 poziomie, można zaoszczędzić sobie drastycznej przebudowy miasta. Wystarczy używać portalówek i mieć lekki zapas teleportów [smilie--sprite1][BR]Stawiamy zespoły i po budowie chowamy je do magazynu. Robimy to tak długo aż nazbieramy ich tyle co pozwoli nam podnieść Gaj Harmonii na 3 poziom. Jak już je nazbieramy chowamy do magazynu wszystkich wytwórców robiąc sobie miejsce na wystawienie nazbieranych zespołów, Po rozbudowie gaju usuwamy zespoły. Używając portalówek nie będziemy ich potrzebować a, że mamy wir na 14lvl to nie musimy gaju podnosić już na 4 poziom [smilie--sprite1] wtedy wracają wytwórcy i kończymy rasę [smilie--sprite8]Kliknij aby rozwinąć...Serio chce się komuś marnować 7100 AW na nie potrzebnego cudaka, tylko po to, żeby skończyć rasę? Poza tym o jakiej drastycznej przebudowie mowa? Osada zajmuje mniej więcej tyle, ile w innych zaawansowanych rozdziałach.[BR]"}, {"7": "@Charlene coś co dla Ciebie jest niepotrzebne nie oznacza, że dla kogoś innego potrzebne nie będzie, to po pierwsze.[BR]Po drugie na grafice przedstawiłaś tylko budynki rasowe które muszą bezpośrednio lub pośrednio stykać się z portalem. Skrzętnie przy tym pominęłaś budynki rasowe produkcyjne... też trzeba mieć ich najmniej po 3szt + manufaktury do, których muszą przylegać...one miejsca w mieście nie potrzebują?"}, {"11": "Tajniakos napisał:@Charlene coś co dla Ciebie jest niepotrzebne nie oznacza, że dla kogoś innego potrzebne nie będzie to po pierwsze.[BR]Po drugie na grafice przedstawiłaś tylko budynki rasowe które muszą bezpośrednio lub pośrednio stykać się z portalem. Skrzętnie przy tym pominęłaś budynki rasowe produkcyjne... też trzeba mieć ich najmniej po 3szt + manufaktury do, których muszą przylegać...one miejsca w mieście nie potrzebują?\t\tKliknij aby rozwinąć...Przecież produkcyjne nie mają niczego wspólnego z portalem, więc po co miałam je tu ładować? Wystarczy je zestawić z 1 poziomem manufaktury. Nie mają też nic wspólnego z Wirem, bo rozchodzi się o te zespoły, których trzeba trochę postawić i Wir miałby być jakąś tam alternatywą dla ich budowania."}, {"7": "Proste 2 pytania...retoryczne [smilie--sprite1] Są to budynki rasowe? Zajmują miejsce w mieście? Więc co starasz się zanegować z mojego postu?[BR]Charlene napisał:\t\t\tPrzecież produkcyjne nie mają niczego wspólnego z portalem, więc po co miałam je tu ładować?\t\tKliknij aby rozwinąć...Mają i to wiele... Bez nich nie rozbudujesz portalu."}, {"11": "Tajniakos napisał:\t\t\tProste 2 pytania...retoryczne [smilie--sprite1] Są to budynki rasowe? Zajmują miejsce w mieście? Więc co starasz się zanegować z mojego postu?[BR][BR]Mają i to wiele... Bez nich nie rozbudujesz portalu.\t\tKliknij aby rozwinąć...Twierdzisz, że trzeba robić drastyczną przebudowę miasta a tak wcale nie jest. Proponujesz rozwiązanie, które pożera AW, ziarna, surowce, czas na rozbudowę i nie wnosi nic innego niż przejście rasy i moim zdaniem nie jest to jakiś game changer. Budynki produkcyjne to nie zespoły… To zespoły są potrzebne do ulepszeń a nie produkcyjne, które muszą się stykać z manufakturą."}, {"4": "Tak sobie czytam Wasze wypowiedzi i zastanawiam się co u Was znaczy skrót \"AW\" , bo dla mnie to antyczna wiedza i do czego tej antycznej wiedzy potrzeba w rozbudowie budynków portalowych i dlaczego nie można tego zamienić na punkty wiedzy z paska postępu [smilie--sprite1]"}, {"7": "Charlene napisał:\t\t\tTwierdzisz, że trzeba robić drastyczną przebudowę miasta a tak wcale nie jest. Proponujesz rozwiązanie, które pożera AW, ziarna, surowce, czas na rozbudowę i nie wnosi nic innego niż przejście rasy i moim zdaniem nie jest to jakiś game changer. Budynki produkcyjne to nie zespoły… To zespoły są potrzebne do ulepszeń a nie produkcyjne, które muszą się stykać z manufakturą.\t\tKliknij aby rozwinąć...@Charlene Zaczynasz mnie irytować swoją postawą bo nie jesteś laikiem w tej grze a delikatnie mówiąc piszesz teraz bzdury i wprowadzasz innych w błąd [smilie--sprite2] Nie mi i nie Tobie jest decydować czy i postawienie jakiego cudaka jest opłacalne i dla kogo. Z uporem maniaka starasz się tu teraz udowadniać nieopłacalność stawiania i rozbudowy Wiru. Nie uważasz, że jest to indywidualna sprawa każdego gracza?, co stawia u siebie w mieście i do jakiego poziomu sobie to podnosi? Strategię zostaw każdemu do indywidualnej oceny.[BR]Ja swoim postem wskazałem możliwość obejścia konieczności usuwania z miasta budynków, które na tym etapie gry mają bardzo duży wpływ na ilość zbieranego co 3h unurytu u kupca. Wskazałem sposób z użyciem Wiru ale można to zrobić i bez niego... wystarczy uzbierać tylko kilka Zespołów więcej. Nikogo nie wprowadziłem w błąd w przeciwieństwie do Ciebie... W XX rozdziale mamy 6 rodzajów budynków rasowych a nie 3 co starasz się tu udowadniać! Trzy rodzaje budynków produkcyjnych (Wytwórcy), które mają wpływ na rozbudowę portalu o której wspomniałem w swoim poście oraz trzy rodzaje zestawów, które muszą stykać się bezpośrednio bądź pośrednio z portalem o których też wspomniałem. Moja metoda polega na chwilowej podmianie budynków. Obojętnym jest czy będzie to rozbudowa portalu na 3lvl z Wirem czy na 4lvl bez wiru. Metoda ta ma na celu zyskanie miejsca nie kosztem budynków mających wpływ na produkcję kupca, której wysokość zależna jest od ilości pracującej populacji.[BR]Jednocześnie podkreślam, że budynki produkcyjne są częścią budynków rasy i w mieście nie lewitują [smilie--sprite2] Zajmują fizycznie sporo w nim miejsca co starasz się cały czas zakłamywać, minimalizując ich rolę w mieście. Bez ich produkcji zapomnij o ulepszeniu portalu.[BR][BR][BR] i choć byś zaklinała tu rzeczywistość to tego tu nie zmienisz a twierdząc inaczej tkwisz uparcie w błędzie jednocześnie wprowadzając w błąd innych... Nie prościej przyznać się do błędu? Czy lepiej jest uparcie w nim tkwić?"}, {"12": "Dziękuję za wyliczenia w poprzednich wpisach co do opłacalności Zbrojowni, dzięki temu przestrzegłem się przed ich rozbudową w tym rozdziale.[BR]Wiru nie mam, więc będę przechodził rasę w tradycyjny sposób - chociaż muszę przyznać, że sprytnie pomyślane.[BR]Faktycznie jest tak, że badania pochłaniają ogromne ilości surowców. [BR]To co mnie najbardziej ogranicza aktualnie, to brak wzniosłych T1. I to nie jakiegoś konkretnego, ale w ogóle tych ofert mało. Myślę, że wiążę się to też z wymienianiem t2 na t1. Czy są takie miasta, które w ogóle nie mają wzniosłej manufaktury bonusowej t1, bo tylko produkują t2 i potem wymieniają?"}, {"11": "Tajniakos napisał:@Charlene Zaczynasz mnie irytować swoją postawą bo nie jesteś laikiem w tej grze a delikatnie mówiąc piszesz teraz bzdury i wprowadzasz innych w błąd [smilie--sprite2] Nie mi i nie Tobie jest decydować czy i postawienie jakiego cudaka jest opłacalne i dla kogo. Z uporem maniaka starasz się tu teraz udowadniać nieopłacalność stawiania i rozbudowy Wiru. Nie uważasz, że jest to indywidualna sprawa każdego gracza?, co stawia u siebie w mieście i do jakiego poziomu sobie to podnosi? Strategię zostaw każdemu do indywidualnej oceny.[BR]Ja swoim postem wskazałem możliwość obejścia konieczności usuwania z miasta budynków, które na tym etapie gry mają bardzo duży wpływ na ilość zbieranego co 3h unurytu u kupca. Wskazałem sposób z użyciem Wiru ale można to zrobić i bez niego... wystarczy uzbierać tylko kilka Zespołów więcej. Nikogo nie wprowadziłem w błąd w przeciwieństwie do Ciebie... W XX rozdziale mamy 6 rodzajów budynków rasowych a nie 3 co starasz się tu udowadniać! Trzy rodzaje budynków produkcyjnych (Wytwórcy), które mają wpływ na rozbudowę portalu o której wspomniałem w swoim poście oraz trzy rodzaje zestawów, które muszą stykać się bezpośrednio bądź pośrednio z portalem o których też wspomniałem. Moja metoda polega na chwilowej podmianie budynków. Obojętnym jest czy będzie to rozbudowa portalu na 3lvl z Wirem czy na 4lvl bez wiru. Metoda ta ma na celu zyskanie miejsca nie kosztem budynków mających wpływ na produkcję kupca, której wysokość zależna jest od ilości pracującej populacji.[BR]Jednocześnie podkreślam, że budynki produkcyjne są częścią budynków rasy i w mieście nie lewitują [smilie--sprite2] Zajmują fizycznie sporo w nim miejsca co starasz się cały czas zakłamywać, minimalizując ich rolę w mieście. Bez ich produkcji zapomnij o ulepszeniu portalu.[BR][BR]View attachment 5473[BR] i choć byś zaklinała tu rzeczywistość to tego tu nie zmienisz a twierdząc inaczej tkwisz uparcie w błędzie jednocześnie wprowadzając w błąd innych... Nie prościej przyznać się do błędu? Czy lepiej jest uparcie w nim tkwić?\t\tKliknij aby rozwinąć...Zważaj na słowa, dobrze? Nie napisałam żadnej bzdury i nie wyżywaj się na mnie, tylko dlatego, że mam swoje zdanie odnośnie Twojego sposobu, bo jakimś super odkryciem nie jest. Tak w ogóle to nie jest Twój sposób, tylko go tu wkleiłeś na forum a w grze już dawno ta informacja poszła do wiadomości i została wyliczona przez wiadomo kogo [smilie--sprite2] . Sposób z Wirem dotyczy ominięcia postawienia Zespołów i na tym się skupiłam, bo twierdziłeś, że to wymaga drastycznej przebudowy miasta. Nie wspomniałeś nic o budynkach produkcyjnych, dopiero potem o tym dopisałeś a i tak to nie jest problem z ich ustawieniem. Ciekawe, że inni gracze jakoś potrafią je ustawić. Nie mi oceniać czy warto stawiać jakiś cud? Śmieszny jesteś, bo nie raz były na forum tematy gdzie każdy wyrażał zdanie odnośnie tego co warto budować a co nie a teraz twierdzisz, że nie mam prawa głosu? Naucz się wymiany zdań, bo to u Ciebie mocno kuleje. Koniec tematu z mojej strony."}, {"9": "[BR]//[BR]Przejście z LVL 3 na LVL 4 zajęło mi 9 dni. Według wyliczeń Rozdział skończę za 18dni. Warto sie o to rozbijać z Wirem?[BR]Główny problem to dojscie do LVL 3 ( Poszło mi 40x100% portalówek, dalej do końca rozdziału pojdzie z 500% a reszte sobie do produkuje ( przy takim układzie to mam 800 melodi co 2h a zuzywam 973/3h ). PW Pójda w Zwiad i Miejsce spoczynku po 8600PW do 16lvl[BR][BR]połączono//Urdur"}, {"7": "Charlene napisał:\t\t\tZważaj na słowa, dobrze? Nie napisałam żadnej bzdury i nie wyżywaj się na mnie, tylko dlatego, że mam swoje zdanie odnośnie Twojego sposobu, bo jakimś super odkryciem nie jest. Tak w ogóle to nie jest Twój sposób, tylko go tu wkleiłeś na forum a w grze już dawno ta informacja poszła do wiadomości i została wyliczona przez wiadomo kogo [smilie--sprite2] . Sposób z Wirem dotyczy ominięcia postawienia Zespołów i na tym się skupiłam, bo twierdziłeś, że to wymaga drastycznej przebudowy miasta. Nie wspomniałeś nic o budynkach produkcyjnych, dopiero potem o tym dopisałeś a i tak to nie jest problem z ich ustawieniem. Ciekawe, że inni gracze jakoś potrafią je ustawić. Nie mi oceniać czy warto stawiać jakiś cud? Śmieszny jesteś, bo nie raz były na forum tematy gdzie każdy wyrażał zdanie odnośnie tego co warto budować a co nie a teraz twierdzisz, że nie mam prawa głosu? Naucz się wymiany zdań, bo to u Ciebie mocno kuleje. Koniec tematu z mojej strony.\t\tKliknij aby rozwinąć...@Charlene od kiedy Ty jesteś taka delikatna? Ty potrafisz nie owijając w bawełnę ostro wyrażać swoje zdanie i jakoś na słowa nie zważasz [smilie--sprite2][BR]Ja z tym sposobem się wcześniej nie spotkałem ani na forum ani w grze dlatego podzieliłem się nim tu na forum. Gdybym się spotkał to chyba bym go tu nie zamieścił prawda?.[BR]Czytaj proszę posty ze zrozumieniem i nie tylko te jego fragmenty, które są Tobie wygodne.[BR]O budynkach produkcyjnych pisałem od pierwszego swojego postu więc może się cofnij i sobie doczytaj.[BR]Problem z wymianą zdań kuleje raczej u Ciebie a nie u mnie bo co innego jest wyrazić swoje zdanie, opinię i opisać opłacalność jakiegokolwiek budynku i pozostawienie decyzji o ich postawieniu bądź nie graczom, a co innego jest negowanie jego postawienia i to w prześmiewczym tonie zakłamując na dodatek po drodze rzeczywistość nie uważasz? To, że Ty czegoś nie zrobisz nie oznacza, że nie zrobią tego inni.[BR]To że inni gracze potrafią sobie wszystko poukładać nie oznacza też, że potrafią i mogą to zrobić inni i to z różnych powodów... Nie mi to oceniać.[BR]Zadziwiające jest to, że tyle złych emocji obudził w Tobie mój post. Jak widać po Twoich reakcjach nie jesteś typem człowieka ,który potrafi przyznać się do błędu, bo jego musi być na wierzchu [smilie--sprite2] No to niech jest, bo dyskusja z Tobą niestety jest z lekka bezsensowna i szkoda jest mi i czasu i energii na domawianie się tu z Tobą..."}, {"13": "Zawsze byłam \"obrońcą\" antycznych cudów. Lubie je i mam sporo w mieście. I szczerze powiem, że dla mnie różnica w postawieniu 9 dodatkowych budynków w mieście to spora różnica. [BR]Co do przebudowy miasta to wychodzę z założenia, że po to mamy rasy, żeby móc przestawić miasto ;P  ale ja to po prostu lubię.[BR]Wracając do tematu... Moje miasto produkuje wystarczająco unurytu i ziaren, żeby postawić jeden budynek dziennie. (i to w trakcie trwania eventu i oczywiście zawsze złoto w iglicy, które zapewniają dodatkowy dochód). Praktycznie wstrzymałam rozbudowy do końca rasy, żeby nie zużywać ziarna, żywe produkuje \"jak coś zostanie\". Trzeba wziąć pod uwagę, że od zakończenia poprzedniej rasy właściwie sobie stałam w miejscu, i surówce zużywałam jedynie na rozbudowę cudaków. Jakoś bardzo się do rasy nie przygotowywałam, ale po ok. 1 m każdego żywego miałam, i właściwie tak do połowy badań nie musiałam ich produkować. [BR]Nie muszę wydawać pw, bo wirek to cudak bodajże z elvenarów i już dawno pw na niego wydane miałam. Ale nawet gdybym miała go stawiać od 0 na tą rasę to ja bym go postawiła (podkreślam - JA ), nie tylko 9 zaoszczędzonych dni, i sporo wzniesionych i unurytu i ziaren, bo to jeden aspektów większej pojemności magazynu portalowego. Drugi aspekt to portalówki. Większa pojemność magazynu = więcej produktu za daną portalówkę. A portalówek w tej rasie idzie....  [BR]I to wszystko z perspektywy konta, które miało czas odpocząć i zrobić jakie takie zapasy. Z perspektywy konta, które właśnie kończy wygnańca i wchodzi w te orkiestrę, wirek, wydaje mi się, byłby jeszcze bardziej przydatny.[BR][BR]Wniosek: punkt widzenia zależy od punktu siedzenia ;P[BR][BR]nie ma \"jednego, najlepszego\" sposobu na tą grę, bo każdy w nią gra inaczej."}, {"3": "skuter napisał:\t\t\tPrzejście z LVL 3 na LVL 4 zajęło mi 9 dni. Według wyliczeń Rozdział skończę za 18dni. Warto sie o to rozbijać z Wirem?\t\tKliknij aby rozwinąć...[BR]Gdybyś miał teraz stawiać wir pod ten rozdział, to pewnie nie, ale jeśli go już masz, to być może warto podciągnąć o parę poziomów.[BR]Warto pamiętać, że dużo zależy od tego jaka jest konfiguracja miasta oraz potrzeby. Do rozbudowy portalu na 6 poziom potrzebujesz po dwa zespoły (w sumie 6), tymczasem do rozbudowy na 4 jak rozumiem po 6 (razem 18).[BR]Każdy zestaw zespołów to w sumie prawie 3 ekspansje, zatem posiadacz wiru nie musi szukać 9 ekspansji miejsca, a i wzniesionych musi wyprodukować dużo, dużo mniej.[BR][BR]Dla mnie te 9 ekspansji to wystarczająco dużo, by zaburzyć cały system powiązań: w zasadzie jedyne co mogę schować, to zbrojownie (mam ich ponad 40). Jak schowam zbrojownie, istotnie zmniejszy się przychód żywych (które mam dzięki piramidzie), a stawianie w ich miejsce manufaktur w ogóle mija się z celem. Zbrojowni mam tyle, ponieważ dzięki temu utrzymuję dość wygodny cykl produkcji wojska akurat taki by koniec produkcji cyklu zawsze wypadał wtedy, gdy robię turniej, a jednocześnie dość mocno optymalizuje zużycie karmy (którą mam dograną tak, by zużycie bilansowało się z produkcją i nie wymagało do tego np. kręcenia recepturami w akademii).  Jak mi się to rozjedzie, to mi się rozjedzie przychód fantów z turnieju, i tak dalej i tak dalej...[BR][BR]Mogę oczywiście to wszystko zrobić, ale jeśli zamiast tego mogę również wykorzystać 1 budynek zajmujący 18 pól i oszczędzić sobie sporo czasu i kłopotu, to czemu by nie? Te 18 pól raptem o 3 pola więcej niż to, co się oszczędza na nierozbudowywaniu portalu, więc znaleźć je będzie raczej nietrudno[BR][BR]Autopoprawka: bez wiru trzeba wykombinować nie 9, ale niemal 12 dodatkowych ekspansji, oczywiście. (12 dodatkowych budynków, o rozmiarach 25 lub 24 pól).[BR]Autopoprawka do autopoprawki - jednak 9 ekspansji, w wymaganiach jest niejasno opisane - portal na 2 lvl twierdzi, że wymaga do rozbudowy po dwóch zestawów instrumentów, podczas gdy naprawdę potrzeba po trzy[BR][BR]Gdyby jeszcze ta rozbudowa wpływała istotnie na produkcję fletów/bębnów/skrzypiec, to bym się zastanawiał. Ale rozbudowa portalu o 1 poziom daje raptem przyrost o 1 na cykl (z wyjątkiem fletów, gdzie w 9h cyklu masz wzrost o 2, ale 3h skacze tylko o 1), a i to pod warunkiem, że masz gildię, bo bez gildii np. 3h produkcja bębnów pozostaje bez zmian.[BR][BR]No i wir pozwala efektywniej wykorzystać portalówki, a tych idzie sporo (już wiem po co były te portalówki w bossach w iglicy [smilie--sprite2] )[BR][BR]Dla posiadaczy wiru właściwie jedynym argumentem za rozbudową portalu do 4 poziomu jest zaliczenie zadań rasy (w sumie 6 przyśpieszaczy 1h, 3 renowacje, 2 przyśpieszacze 8h i 1 karma, przy założeniu że sprzedamy portal przed nadejściem 21 rozdziału)[BR]No chyba że ktoś naprawdę ma problem z odpowiednią ilością portalówek (acz nie wątpię, że większość ma odpowiednio dużo placówek czy innych tego typu budynków w inwentarzu, nawet gdby portalówek z bossów zabrakło)[BR][BR]BTW, do rozbudowy portalu wystarczy że zespoły będą w mieście, mogą nie być podłączone do portalu i też zaliczy (oczywiście nie będą dawać efektu zwiększenia produkcji)"}, {"14": "Charlene napisał:\t\t\t...Tak w ogóle to nie jest Twój sposób, tylko go tu wkleiłeś na forum a w grze już dawno ta informacja poszła do wiadomości i została wyliczona przez wiadomo kogo [smilie--sprite2] ...\t\tKliknij aby rozwinąć...hmm... jak to przeczytałem to przyszła mi na myśl tylko jedna osoba o której wszyscy wiedza ale o której się nie mówi...\"lord voldemort\", ale nie widziałem takiego na żadnym serwerze chyba że jest na becie to przepraszam.[BR]Co do opłacalnośi wiru to moim zdaniem pomaga on przy kazdej epoce, wiadomo w jednej bardziej w drugiej mniej ale jest przydatny, dodatkowo wpływa na produkcję żywych czyli przyczynia się do mniejszego zużycia ziaren do wyprodukowania w przeliczeniu jednej jednostki gotowego produktu"}, {"15": "Mam podobnie jak Ovocko tzn. dużą ilość zbrojek, których nie uśmiecha mi się chować i wypstrykać się z karmy moment, bo miśki bym odpalał codziennie wtedy a nie co 2 dni. Cudaków też mam sporo więc jedyne co mogę chować to praktycznie rezydki i budynki pop kul i wtedy zjechać na minus z populacją jak w poprzednich rasach żeby mieć miejsca na rozbudowę portalu na 4 poziom. Dodatkowo żeby portal na 4 zrobić to trzeba masę wzniosłych na 9 dodatkowych zespołów a jak się produkuje same bezużyteczne (których na rynku jest ponad 40 stron) i nikt ich nie zbiera tylko trzeba 6h czekać to się można pochlastać żeby zebrać 200k czy ile... A do badań też trzeba ich sporo. Także ja zostanę z wirem i portalem na 3 poziomie. [BR][BR]A jeszcze na marginesie, to zadanie co mamy osiągnąć 150% kultury dalej jest niezmienione i nie zalicza jak się ma więcej? Jak dalej trzeba dokładnie 150% to ja na nim zakończę zadanka w tym rozdziale [smilie--sprite1]"}, {"15": "gural92 napisał:\t\t\tZgadza się też to liczyłem i pod grupę szkoleniową zdecydowanie się nie opłaca ich podnosić. Przy wymaxowanych grzybkach halach i otchłani grupa szkoleniowa powinna wynosić 1500 zamiast 1040 żeby nowe zbrojownie były minimalnie bardziej opłacalne... Najgorsze jest to że różnica jest tak duża, że jeśli rozmiar zbrojowni się nie zmieni w 21 rozdziale to te na 41lvl nadal będą najlepsze. Dla uzmysłowienia jak duża jest różnica to potrzeba aż 6 ekspansji więcej żeby osiągnąć tą samą grupę szkoleniową nowymi zbrojowniami zakładając że źródłem populacji są magiczne rezydki z 20 rozdziału. Jeśli chodzi o zapotrzebowanie na kulturę to wychodzi około 30% więcej a produkcja orków jest tylko o kilka % większa więc dla nich też się nie opłaca ich podnosić. Ogólnie jak chwale nowy rozdział tak zbrojownie są zdecydowanie jego najgorszym elementem.\t\tKliknij aby rozwinąć... [BR]Zastanawia mnie jak to policzyłeś, mi też wyszło w sumie, że nie opłaca się rozbudowywać zbrojek ale różnice nie były tak drastyczne.[BR]Ja sobie porównałem tak:[BR]5 starych zbrojek to obszar 125 pól, rozmiar grupy 4150 i łącznie wymaga 148 090 kul i 69 275 pop.[BR]4 nowe zbrojki to obszar 120 pól, rozmiar grupy 4160 i łącznie wymaga 172 000 kul i 78 800 pop.[BR]Rozmiar grupy prawie taki sam, zajmują o 5 pól mniej i wymagają 9525 populacji i 23910 kul więcej.[BR]Te 5 pól to 1/4 skały venara (jeden z lepszych budynków pod populację i kulturę) a venar w tym rozdziale daje 24k pop i kultury, czyli 1200 na pole. Więc 5 pól to 6k kultury i populacji. Odejmując to od tego co wymagają zbrojki wychodzi, że wymagają wtedy 3525pop i 17910kul.[BR]U siebie w mieście mam ponad milion wolnej kultury, więc takie ilości to dla mnie nie problem, biorę tylko pod uwagę ludki i tu wychodzi, że te 3525 pop to u mnie jakieś 3 pola (a i niecałe jeżeli wziąłbym pod uwage gobliny lub magiczne rezydki). Czyli 3 pola na każde 4 rozbudowy zbrojek, a więc 3 pola na każde 120.  Oczywiście jak komuś brakuje kultury no to te różnice będą zdecydowanie większe, bo będzie musiał coś pod kulturę dobudować."}, {"5": "Ja liczyłem z grzybkami na 35 lvl bo inaczej za bardzo nie ma sensu (każdy komu zależy na jak największej grupie ma grzybki na maxa). Zbrojek w 19 rozdziale miałem postawionych 32 więc sprawdziłem ile muszę postawić tych na 42lvl żeby grupa szkoleniowa była porównywalna i ile łącznie będzie to zajmowało miejsca łącznie z rezydkami. Wyszło że 32 zbrojownie na 41 i 9 rezydek zajmuje około 41 ekspansji a 29 zbrojowni na 42lvl (bo tyle potrzeba żeby grupy szkoleniowe były podobne przy wymaxowanych grzybkach) i 12 rezydek zajmuje około 47 ekspansji. Oczywiście otchłań i hale na 30lvl też uwzględniłem bo one też robią zauważalną różnicę. Kultury też mam nadmiar i ona na pewno nie jest dla mnie wyznacznikiem więc ja liczyłem tylko bardziej z ciekawości."}, {"3": "To będzie wychodziło różnie, zależnie od konfiguracji cudów oraz dostępnych budynków[BR]Ja liczyłem wydajność na kratkę przy założeniu, że populację bierzemy z goblina/kaligrafii, a kulturę z kodeksu lawy (te budynki można dostać w grze, w przeciwieństwie np. do Venara, który bywa, ale baaaardzo rzadko). Dlaczego Goblin a nie rezydencja? Bo do rezydencji potrzeba kultury, a co za tym idzie o ile nie mamy źródła młodości, to goblin wypada lepiej.[BR]Liczyłem z kulturą, bo jednak zbrojownie jej wymagają. Jeśli nawet ją mamy w nadmiarze, nic nie szkodzi na przeszkodzie by trochę jej przyciąć i zrobić miejsce na inne budynki, a tak to musimy trzymać budynki pod zbrojownie.[BR][BR]Uwzględniając grzyby na maks, hale i otchłań na 30 lvl oraz ruiny i klasztor (rabat na zapotrzebowaniu na kulturę) wychodzi że zbrojownia 41 daje 75,6 jednostek na kratkę, a na 42 już tylko 66,7 jednostek na kratkę (12% mniej).[BR][BR]Jakbym nie liczył kultury, to wartości te wynosiłyby odpowiednio 78,9 oraz 70,2 (11% mniej), czyli bardzo podobnie jeśli idzie o spadek.[BR]Aby wyjść na to samo, uwzględniając kulturę zbrojownia musiałaby mieć powiększenie dokładnie 1435 jednostek (Przy moich parametrach klasztoru i ruin), a licząc to bez kultury - 1409 jednostek. Trochę mniej niż wychodzi to Guralowi, ale blisko.[BR][BR]Ale mówię, tu dużo zależy od tego jakie budynki weźmiemy jako bazę do liczenia kultury i populacji i jakie mamy cuda. Wystarczy, że nie mamy np. hal ani odchłani i już wyniki się zmieniają, choć nadal proporcje pozostają zbliżone."}]