[{"3": "@jarq - taki wniosek racjonalizatorski - portal na 2 poziomie twierdzi, że do rozbudowy na 3 potrzeba mu po dwie sztuki każdego typu zespołów. Tak naprawdę są to po 3 sztuki (bo to jest 2 ponad to, co było potrzebne do rozbudowy na 2 poziom). [BR]To jest mylące, ja się np. nieco zdziwiłem, że mając po dwie sztuki każdego nie spełniam wymagań.  Może by to zmienić?"}, {"8": "Wygląda na to że wadą Wira jest tylko to, że wprowadzono go do gry lekko za wcześnie. Był za słaby u zarania , więc wielu nie postawiło.[BR]Teraz będzie mocny."}, {"9": "Bez Wiru rozdział zrobiłem w 1,5 miesiaca o 2m szybicej niz XIX - to kwestia nacisku na jakies elementy rasy. Fakt ze poszło 15x100% portalowek wiecej ale zapas pozostał. Wyglada ze Rasy beda teraz co 40-50 tyg wiec nazbiera sie Portalowek. Zamiast Wiru wole Wieze Pieczeci(Unuryt) ale Miejsce Spoczynku bedzie znacznie lepsze.  Choc tak czy inaczej Wir albo Pieczeć sie przyda ( na 3h produkcje) ale z przewaga na Pieczeć"}, {"16": "[BR]Jak zdobyć do rozbudowy Gaju Harmonii melodię, akompaniament, rytm?"}, {"2": "miramorska napisał:\t\t\tJak zdobyć do rozbudowy Gaju Harmonii melodię, akompaniament, rytm?\t\tKliknij aby rozwinąć...Musisz postawić Zespoły skrzypiec, fletów i bębnów. [BR]One tego nie produkują, działają na zasadzie budynków kulturowych, tylko zamiast kultury dają melodię, akompaniament i rytm potrzebne do rozbudowy portalu. Każdy budynek daje 1 sztukę."}, {"16": "Mam już po 2 zespoły z każdego. Czyli muszę dostawić jeszcze po jednym.[BR]Dzięki"}, {"17": "Niech mi ktoś \"mądrze\" wytłumaczy jak zmieścić budyneczki/Zespoły/ żeby rozbudować portal Gaj Harmonii na poziom 4 ? Jeżeli logicznie myślę to potrzeba tych zespołów na drugi poziom każdego po 1-ej szt , na trzeci 3 x po 3 szt/w opisie jest po 2 szt /  , a na czwarty poziom  3 x po 3 czy 4 szt ? . jakby nie liczyć to mi wychodzi do trzeciego poziomu Gaju 12 szt , a gdzie pozstawić kolejne żeby rozbudować na czwarty poziom ?"}, {"2": "miriella napisał:\t\t\tNiech mi ktoś \"mądrze\" wytłumaczy jak zmieścić budyneczki/Zespoły/ żeby rozbudować portal Gaj Harmonii na poziom 4 ? Jeżeli logicznie myślę to potrzeba tych zespołów na drugi poziom każdego po 1-ej szt , na trzeci 3 x po 3 szt/w opisie jest po 2 szt /  , a na czwarty poziom  3 x po 3 czy 4 szt ? . jakby nie liczyć to mi wychodzi do trzeciego poziomu Gaju 12 szt , a gdzie pozstawić kolejne żeby rozbudować na czwarty poziom ?\t\tKliknij aby rozwinąć...[BR]Do rozbudowy na 2 poziom trzeba mieć w mieście po 1 sztuce z każdego zespołu  - razem 3[BR]Na 3 poziom po 3 sztuki z każdego - razem 9[BR]Na 4 poziom po 6 sztuk z każdego - razem 18[BR]A gdzie postawić? Pomiędzy rozbudowami można zespoły schować do inwentarza i w to miejsce stawiać kolejne aż będziemy mieć w sumie po 6 z każdego.[BR]Przed ostatnią rozbudową portalu można dosłownie na chwilę schować jakieś budynki z miasta (czym większe, tym mniej teleportów zużyjesz by zyskać miejsce), wystawić wszystkie 18 zespołów, włączyć rozbudowę i wtedy można zespoły usunąć, nawet nie trzeba czekać do końca rozbudowy portalu. Do rozbudowy zespoły nie muszą być połączone z portalem, mogą stać gdziekolwiek. Stykać się muszą tylko wtedy, gdy chcemy w portalu uzyskać bonus do produkcji nut.[BR][BR]Jeśli ktoś ma Wir Magazynujący na 14+ poziomie, to portal wystarczy rozbudować do 3 poziomu, będzie miał wystarczającą pojemność, żeby ukończyć badania. Wtedy wystarczą po 3 sztuki z każdego zespołu."}, {"12": "Czy opłaca się stawiać Tawernę Zwiadowców w kontekście turniejów/ iglicy? Proszę, niech ktoś przypomni jak to się ma z ilością podbitych prowincji a wzrostem wymagań turniejowych..."}, {"9": "Tawerna o 66% przyspiesza zwiad prowincji przez to możesz zdobyć wiecej pkt turniejowych"}, {"11": "jakub357 napisał:\t\t\tCzy opłaca się stawiać Tawernę Zwiadowców w kontekście turniejów/ iglicy? Proszę, niech ktoś przypomni jak to się ma z ilością podbitych prowincji a wzrostem wymagań turniejowych...\t\tKliknij aby rozwinąć...Tawerna jest pod turniej, więc jeśli zależy Ci na wysokim wyniku turniejowym a masz długi czas zwiadu, to będzie przydatna, żeby ten czas skrócić. Jest też inna sytuacja, gdzie masz długi czas zwiadu a potrzebujesz prowincji do wykonywania zadań eventowych( można zrobić alternatywne). Ilość podbitych prowincji nie wpływa na wzrost wymagań turniejowych( tylko te obowiązkowe prowincje przed każdą rasą, które świadczą o rozwoju miasta na to wpływają), ale poziomy cudaka już tak. Jak Ci odpowiada Twój obecny wynik turniejowy, to nie stawiaj a jak chcesz uzyskać więcej i zbyt wolno zdobywasz prowincje, to stawiaj."}]