[{"1": "Zapraszamy do dyskusji."}, {"3": "Zacząłem liczyć i trochę rozjeżdza się produkcja wojska z tego co widzę. Pierwszy budynek mamy dostępny na samym początku badań, ostatni dopiero na samym końcu, tymczasem kolejka przyśpiesza na tyle, że między najszybszym a najwolniejszym budynkiem zrobi mi się ponad 8h dziury na jednym cyklu produkcji [smilie--sprite9][BR][BR]Ciekawoskta: mając ponad 50 zbrojowni, większość na poziomie z XX rozdziału ale mniej więcej 1/4 jeszcze na poziomie z XIX rozdziału, nawet jeśli rozbuduję je wszystkie do poziomu z XXI rozdziału, nie uda mi się wyjść na ten sam czas produkcji/slot co teraz. musiałbym dostawić co najmniej jedną zbrojownię więcej. Nawet uwzględnienie bastionu i powiększeń oddziału nie pozwala wyjsć z czasem produkcji na te same wartości.[BR][BR]Z jednej strony to dobrze, bo im szybsza produkcja, tym więcej wojska zdążymy wyprodukować. Z drugiej strony, albo się trzeba liczyć z nieco większym zużyciem karmy, albo wykombinować miejsce na dodatkowe budynki."}, {"34": "Charlene napisał:\t\t\tPoza tym jest wymagane 10 rezydek i 10 warsztatów na 47 lvl- lepiej mieć, bo za to zadanie można zgarnąć 100 diaxów.\t\tKliknij aby rozwinąć...Chyba się to zmieniło, przynajmniej według listy zadań od iDavis, teraz pokazuje \"Posiadaj 10 rezydencji na 47 poziomie i 4 warsztaty na 47 poziomie\" za to zadanie za 100 diaksów [smilie--sprite1]"}, {"3": "Wojtek90 napisał:\t\t\tChyba się to zmieniło, przynajmniej według listy zadań od iDavis, teraz pokazuje \"Posiadaj 10 rezydencji na 47 poziomie i 4 warsztaty na 47 poziomie\" za to zadanie za 100 diaksów [smilie--sprite1]Kliknij aby rozwinąć...[BR]Jeśli dobrze pamiętam, to magiczne budynki zalicza w tego typu x2, czyli było by 5 rezydencji i 2 warsztaty[BR][BR]Zmienia się skok powiększenia oddziału, przynajmniej na początku - do tej pory formuła była [nr powięszenia] * 3, teraz mnożnik wynosi niecałe 7 (o ile nie są to arbitralne ilości)"}, {"17": "no i mamy nowy rozdział , to teraz zobaczymy co i jak i gdzie"}, {"15": "Liczył ktoś już czy opłaca się zbrojki podnosić w nowym rozdziale czy dalej czekać na 41?"}, {"3": "Steefann napisał:\t\t\tLiczył ktoś już czy opłaca się zbrojki podnosić w nowym rozdziale czy dalej czekać na 41?\t\tKliknij aby rozwinąć...Liczył. [BR]\"Wskaźnikowo\" wychodzi odpowiednik poziomu między 39 a 40, natomiast obawiam się, że i tak trzeba je będzie podnieść, ze względu na przyspieszenie produkcji w budynkach koszarowych.[BR][BR]Jakby zostawić zbrojownie na poziomie 41, to po rozbudowie koszarów trzeba by dostawić circa 6 nowych żeby wyjść na ten sam czas produkcji, tymczasem przy zbrojowniach na poziomie 43 wystarczy o 2 mniej (liczyłem dla swojego miasta, czyli wyjściowo 51 zbrojowni)[BR][BR]Rozbudowa budynków koszarowych, przy 51 zbrojowniach, skraca kolejkę o prawie 2h/slot  [smilie--sprite9]"}, {"11": "Ja mam Koszary na 43 poziomie, 16 zbrojowni na 42 poziomie( podniosłam z 41 dopiero teraz, bo wcześniej nie miałam tyle popki) i mam czas 4:43 na slot ( Grzybki 35 lvl).[BR]Dobrobyt na szczęście wzrasta tylko o 27, 53 i 80 przy rozbudowach portalu, więc luzik. Niestety Wir Magazynujący nie działa na pojemność portalu- zgłosiłam już błąd do obsługi i liczę, że to faktycznie jest błąd a nie celowe działanie. [BR]Szkoła Czarodziejstwa skraca tylko czas produkcji a nie tworzenia, a że nie produkuję niczego innego poza katalizatorami, to nie ma to sensu( zaraz wejdzie Tinlug) a z kociołka w ogóle nie korzystam. Sklep z Antykami - po rasie postawie sobie Miejsce spoczynku przodków zamiast niego.[BR]Zdecydowanie przy tej rasie muszę mocniej się skupiać na pomocy sąsiedzkiej, ze względu na prace społeczne + monety. Produkcje w osadzie ruszyły, więc na razie jest ok."}, {"3": "Na razie trochę nie jasne jest dla mnie ile będzie potrzebnych budynków rasowych.[BR]Poprzestawiałem miasto pod rozbudowy (czekam, aż mi się produkcja wojska skończy by je zrobić), w sumie, jeśli nie będzie trzeba wyciągać manufaktur wzniesionych do produkcji towarów osady, to powinno się udać bez większej demolki"}, {"9": "Po 9 na 4lvl"}, {"3": "skuter napisał:\t\t\tPo 9 na 4lvl\t\tKliknij aby rozwinąć...Z czego wynika ta ilość?[BR][BR]Tak jak patrzę, to prawie połowę badań (17 z 40) można zrobić w zasadzie z marszu - do odblokowania wymagają jedynie pułapek i prac społecznych (pierwsze można zdobyć portalówkami i pojemność portalu jest do nich wystarczająca już na 1 poziomie, drugie są bonusowane premią kultury, więc przy dużej premii zbiera je się dość szybko).[BR][BR]Do produkcji w warsztatach wymagane są wzniesione, więc pewnie przynajmniej część manufaktur trzeba będzie wyciągnąć z inwentarza.[BR]Natomiast jak ktoś nie ma ciśnienia by ten rozdział przechodzić jakoś bardzo szybko, to jest szansa, że da się go ogarnąć przy minimum budynków osady, zwłaszcza że większość istotnych (przynajmniej dla mnie) badań jest wśród tych 17 \"łatwych\" lub tuż za nimi (jedyna skucha to tereny treningowe, które są na samym końcu)[BR][BR]Zastanawiam się nad źródłem młodości, do tej pory w ogóle nie miałem rezydencji, przy 1-2 to się zabardzo nie opłaca, ale przy 3 już dość szybko zaczyna procentować (bilansuje się w okolicy 9-10 poziomu źródeł) mógłbym wtedy schować budynki pop/kultura i zamienić je kulturowymi, by jeszcze trochę podciągnąć bonus z kultury"}, {"34": "skuter napisał:\t\t\tPo 9 na 4lvl\t\tKliknij aby rozwinąć...Ovocko napisał:\t\t\tZ czego wynika ta ilość?\t\tKliknij aby rozwinąć...1. Ta ilość wynika z zadań (jeżeli ktoś robi) bo tyle jest wymagane żeby wszystkie zadania zrobić.[BR]2. Jest to też dobra ilość ponieważ można puszczać produkcję \"trójkami\", czyli mając 9 Warsztatów Hordy puszczamy 3x Pogruchotane Kości, 3x Zniszczone meble i 3x Rozbite szkło a w Valloryjskich Warsztatach: 3x Łuski, 3x Skorupy i 3x Smocze szkło - dzięki temu produkcja się ładnie zazębia, przynajmniej póki co..."}, {"3": "Wojtek90 napisał:\t\t\t1. Ta ilość wynika z zadań (jeżeli ktoś robi) bo tyle jest wymagane żeby wszystkie zadania zrobić.\t\tKliknij aby rozwinąć...[BR]A, ok. [BR][BR]Co do produkcji - a czwarte towary z warsztatów? W Valloryjskich można pominąć, bo jest do zdobycia z portalówek, ale w hordzie trzeba go chyba będzie robić?[BR]W sumie on ma dłuższy czas produkcji, więc można na noc nastawiać we wszystkich warsztatach"}, {"34": "Ovocko napisał:\t\t\tW sumie on ma dłuższy czas produkcji, więc można na noc nastawiać we wszystkich warsztatach\t\tKliknij aby rozwinąć...Dokładnie tak, ten czwarty towar \"Sztuka Orków\" najlepiej nastawiać na noc (bo czas produkcji 12h) i ja tak właśnie robię [smilie--sprite1]"}, {"3": "OK, dzięki.[BR]Wieczorem będę odblokowywał warsztaty hordy to popatrzę [smilie--sprite1]"}, {"35": "Charlene napisał:\t\t\tWir Magazynujący nie działa na pojemność portalu\t\tKliknij aby rozwinąć...Czy masz już może odpowiedź od obsługi gry?"}, {"11": "KociMord napisał:\t\t\tCzy masz już może odpowiedź od obsługi gry?\t\tKliknij aby rozwinąć...Tak, dostałam, mają to ogarnąć, ale póki co ściągnęłam aktualizację na appkę i nadal Wir nie działa na pojemność portalu [smilie--sprite3][BR][BR]EDIT: po aktualizacji już działa."}, {"3": "Na razie poprawili tylko wyświetlanie parametrów we wszystkich cudach, ale jeśli docelowo wir ma działać na portal jak zwykle, to dobra wiadomość.[BR]Przynajmniej nie trzeba się zastanawiać czy go kasować czy nie.[BR][BR]Edit: wir już działa poprawnie"}, {"11": "Wrzucam przykłady ustawienia osady, która zakłada po 9 budynków każdego rodzaju ( zaczerpnięte od graczy z Bety), może komuś się przyda:[BR][BR][BR][BR][BR]W tym rozdziale bonus portalu do produkcji surowców osady jest uzależniony od ilości budynków osady i stopnia ich rozbudowy( dobrobyt).[BR]Przykład dla 9 budynków na 4lvl i portalu 4 lvl:[BR]Ilość dobrobytu potrzebna dla takiej osady: 995 ( postawienie portalu -600, rozbudowa portalu na II,III i IV poziom- 80, warsztaty valloryjskie i Diabhala- razem 315)[BR]Z tego bonus do produkcji wyniesie jakieś 65-66%[BR][BR]Dla 6 budynków ten bonus będzie wynosić jakieś 48%, dla 12 budynków jakieś 83%.[BR][BR]Za co i ile można dostać dobrobytu:[BR]Rozbudowa Ratusza na 46 poziom - 300[BR]Rozbudowa Koszar na 43 poziom - 170[BR]Magiczna rezydencja 21 poziom - 54[BR]Zwykła rezydencja  46 poziom- 27[BR]Magiczny warsztat 21 poziom- 120[BR]Zwykły warsztat 46 poziom- 58"}, {"13": "Charlene napisał:\t\t\tWrzucam przykłady ustawienia osady, która zakłada po 9 budynków każdego rodzaju ( zaczerpnięte od graczy z Bety), może komuś się przyda:\t\tKliknij aby rozwinąć...[BR]To ja dołożę swój planik [smilie--sprite1][BR][BR]"}]