[{"6": "[BR]Może nim dacie wymagania wszystkich towarów w rozdziale to naprawcie od kilku lat beznadziejny balans towarów, albo w rozdziale 22 dajcie nam bonusy do każdego z 9 towarów bo to już nie jest śmieszne tylko żałosne. Gracze nie powinni być jedni faworyzowani a drudzy do tyłu, bo jednym daliście najbardziej pożądane towary a innym takie, których nikt nigdy nie chce + jeszcze nie spytaliście się o zdanie na starcie gry."}, {"11": "Koval92 napisał:View attachment 6040[BR]Może nim dacie wymagania wszystkich towarów w rozdziale to naprawcie od kilku lat beznadziejny balans towarów, albo w rozdziale 22 dajcie nam bonusy do każdego z 9 towarów bo to już nie jest śmieszne tylko żałosne. Gracze nie powinni być jedni faworyzowani a drudzy do tyłu, bo jednym daliście najbardziej pożądane towary a innym takie, których nikt nigdy nie chce + jeszcze nie spytaliście się o zdanie na starcie gry.\t\tKliknij aby rozwinąć...Przesadzasz. Kupiec i tak Ci daje towar od razu i tak, więc Twórcy specjalnie stworzyli taki mechanizm, żeby sytuacja była lepsza niż w przypadku zwykłych ofert, które mogą wisieć dużo dłużej. Z tego co widzę na każdym świecie gracze są ogarnięci i wymieniają towary w lepszych przelicznikach a nie 1:1. Ja sama mam na S2 odwrotnie niż Ty, bo moim bonusem są granulki a kulek nie widać, ale wysyłam kupca i mam odpowiednią ilość, więc nie wiem z czym Ty masz problem."}, {"36": "Mam zadanie wyprodukować Zapieczętowany Traktat Pokojowy. [BR]Gdzie to znaleźć ??"}, {"34": "Lolek00 napisał:\t\t\tMam zadanie wyprodukować Zapieczętowany Traktat Pokojowy.[BR]Gdzie to znaleźć ??\t\tKliknij aby rozwinąć...W manufakturze zwojów, w opcji produkcji na 9h (zdjęcie z wiki po angielskiemu ale wierze, że załapiesz):[BR][BR]"}, {"6": "Charlene napisał:\t\t\tPrzesadzasz. Kupiec i tak Ci daje towar od razu i tak, więc Twórcy specjalnie stworzyli taki mechanizm, żeby sytuacja była lepsza niż w przypadku zwykłych ofert, które mogą wisieć dużo dłużej. Z tego co widzę na każdym świecie gracze są ogarnięci i wymieniają towary w lepszych przelicznikach a nie 1:1. Ja sama mam na S2 odwrotnie niż Ty, bo moim bonusem są granulki a kulek nie widać, ale wysyłam kupca i mam odpowiednią ilość, więc nie wiem z czym Ty masz problem.\t\tKliknij aby rozwinąć...[BR]Po to mamy opinie, żeby dawać feedback i żeby twórcy szukali złotego środka. Nie ma po co się denerwować bo pewnie nikogo z nas nie słuchają [smilie--sprite7] [smilie--sprite2]"}, {"7": "Koval92 napisał:\t\t\tGracze nie powinni być jedni faworyzowani a drudzy do tyłu, bo jednym daliście najbardziej pożądane towary a innym takie, których nikt nigdy nie chce + jeszcze nie spytaliście się o zdanie na starcie gry.Kliknij aby rozwinąć...Myślę, że każdy ogarnięty gracz znajdzie sobie na ten problem złoty środek [smilie--sprite1] Wystarczy w bractwie umówić się z twórcą towarów, których nie robisz i w ciągu 5 minut masz surowców po kokardkę. Nie wydaje mi się aby gracz na starcie gry był świadomy jaki surowiec w grze jest deficytowy a który nie, więc takie pytanie na początku gry uważam za co najmniej zbyteczne [smilie--sprite1]"}, {"36": "Wojtek90 napisał:\t\t\tW manufakturze zwojów, w opcji produkcji na 9h (zdjęcie z wiki po angielskiemu ale wierze, że załapiesz):[BR][BR]View attachment 6047Kliknij aby rozwinąć...Dziękuję bardzo , co ślepemu po oczach , szukałem ,-ale nie widziałem [smilie--sprite1]"}, {"3": "Tajniakos napisał:\t\t\tMyślę, że każdy ogarnięty gracz znajdzie sobie na ten problem złoty środek [smilie--sprite1] Wystarczy w bractwie umówić się z twórcą towarów, których nie robisz i w ciągu 5 minut masz surowców po kokardkę. Nie wydaje mi się aby gracz na starcie gry był świadomy jaki surowiec w grze jest deficytowy a który nie, więc takie pytanie na początku gry uważam za co najmniej zbyteczne [smilie--sprite1]Kliknij aby rozwinąć...[BR]To nie do końca tak, bo różne budynki (np. biblioteki), czy cuda (gildia, połączaona z cudami dającymi wysoki bonus kultury) sprawiły, że producenci surowców niejednokrotnie wcale ich nie produkują, bo im się to zwyczajnie nie opłaca [smilie--sprite1][BR][BR]Jakoś dosyć niedawno nowoprzybyła do bractwa dziewczyna dziwiła się, że w ekipie, która ma dużo producentów zwojów (sprawdziła przed przyjściem i liczyła na łatwy dostęp) jest ich jak na lekarstwo. No ale tak jest, ja sam też ich nie produkuję, bo jak mam wybrać co postawić, to w zestawieniu manufaktura vs warsztat (i wymiana młotków w kupcu) vs zbrojownia (i bonus żywych) to manufaktura wypada najgorzej...[BR]Efekt jest taki, że zwojów mam w magazynie mniej niż kryształu czy jedwabiu, podobnie ze stalą czy pyłem, których też jestem producentem.[BR][BR]I z całym szacunkiem, ale opcja przestawienia znacznej części miasta, by okazjonalnie wepchnąć bonusową manufakturę to nie jest rozwiązanie.[BR][BR]To nie jest tak, że nie można sobie z tym poradzić, ale też nie jest tak, że to nie jest problem.[BR]Bo jest, i to spory, ciągnący się w grze już miesiącami, jeśli nie latami."}, {"7": "Ovocko napisał:\t\t\tI z całym szacunkiem, ale opcja przestawienia znacznej części miasta, by okazjonalnie wepchnąć bonusową manufakturę to nie jest rozwiązanie.\t\tKliknij aby rozwinąć...[BR]Inaczej funkcjonują miasta nastawione na duże zyski wojskowe bo mając np 40 zbrojowni plus to wiele innych aspektów gry może rodzić problem.[BR]Ciężko jest handlować czymkolwiek nie mając w mieście budynków produkcyjnych [smilie--sprite1] No ale jak to się mówi coś za coś.[BR]Ovocko napisał:\t\t\tTo nie jest tak, że nie można sobie z tym poradzić, ale też nie jest tak, że to nie jest problem.\t\tKliknij aby rozwinąć...To raczej nie jest problem a świadomy strategiczny wybór [smilie--sprite1]"}, {"3": "Tajniakos napisał:\t\t\tInaczej funkcjonują miasta nastawione na duże zyski wojskowe bo mając np 40 zbrojowni plus to wiele innych aspektów gry może rodzić problem.\t\tKliknij aby rozwinąć...[BR]To nie jest kwestia zysków wojskowych. I bez nich jesteś w stanie utrzymać premię kultury na poziomie 700+, przy której (a nawet niższej) znacznie bardziej opłacalne jest produkować młotki i złoto (a następnie wymieniać u hurtownika) niż utrzymywać jakąkolwiek produkcję towarów.[BR][BR][BR]Tajniakos napisał:\t\t\tTo raczej nie jest problem a świadomy strategiczny wybór [smilie--sprite1]Kliknij aby rozwinąć...[BR]No jednak nie, chyba że dziwnym trafem dokładnie tego samego wyboru dokonuje większość (wszyscy?) graczy (inaczej trudno jest teorią \"świadomego strategicznego wyboru\" wyjaśnić niedostępność niektórych towarów na rynku).[BR]A jeśli ów \"wybór\" jest tak skonstruowany, że gros graczy podejmuje identyczne decyzje, to czy możemy tu mówić o rzeczywistym \"wyborze\"?[BR][BR]Nie jestem też pewien, czy aby na pewno kwestia wyboru miała tutaj istotny wpływ. Owszem, w zależności od strategii możesz np. produkować swoje towary bonusowe albo nie, ale też nie powinno być tak, że decyzję o NIEprodukowaniu swoich bonusowych towarów podejmują w większości (wyłącznie?) gracze z określonym zestawem bonusów (stal-zwoje-pył).[BR]Przecież gdby rozkład bonusów był proporcjonalny, to niezależnie od przyjętych strategii powinno się to jakoś bilansować, nawet jeśli jeden typ strategii stanie się bardzo popularny wśród graczy.[BR]Bo przecież jeśli mnie się opłaca nie produkować zwojów i zamiast tego kupować kryształy i jedwab u hurtownika, to komuś innemu w podobnej sytuacji będzie się opłacało np. zamiast produkcji kryształu kupować w to miejsce zwoje i jedwab - itd.  W ten sposób podaż i popyt wszystkich towarów powinny się jakoś bilansować.[BR][BR]Tymczasem z jakiegoś dziwnego powodu istnieją towary, na które jest stały deficyt, oraz takie, których jest stały nadmiar. I to niezależnie od serwera. [BR]Jak to wytłumaczysz?"}, {"7": "Ovocko napisał:\t\t\tTo nie jest kwestia zysków wojskowych. I bez nich jesteś w stanie utrzymać premię kultury na poziomie 700+, przy której (a nawet niższej) znacznie bardziej opłacalne jest produkować młotki i złoto (a następnie wymieniać u hurtownika) niż utrzymywać jakąkolwiek produkcję towarów.\t\tKliknij aby rozwinąć...Czyli znalzłeś sposób na pozyskiwanie surowców, których brakuje na rynku.[BR]Ja też go znalazłem i uwierz, że nie mam z tym większych problemów, choć nie twierdzę, że problem jako taki nie istnieje... Ale lepiej znaleźć na niego sposób niż stanąć w miejscu gdy go napotkamy.[BR]Temat ten już nie raz był wałkowany w wielu miejscach, tu na forum i rozwiązania jak nie było tak nie ma więc trzeba sobie jakoś z tym radzić i się da jak widać. Żeby nie było że nie wiem o czym piszę, bo akurat ja jestem wspomnianym przez Ciebie producentem stali, zwoi i pyłu tak samo jak i Ty. Patrząc na statsy to widać, że masz zbalansowane bractwo pod względem surowcowym, to tym bardziej problemu z wymianą mieć nie powinieneś. To czego nie daje Wam rynek wymiany po za bractwem zawsze można zrekompensować w wymianach w bractwie bo chyba po to ono jest aby i w takich przypadkach się wspierać.[BR]Ovocko napisał:\t\t\tTymczasem z jakiegoś dziwnego powodu istnieją towary, na które jest stały deficyt, oraz takie, których jest stały nadmiar. I to niezależnie od serwera.[BR]Jak to wytłumaczysz?\t\tKliknij aby rozwinąć...Chyba oboje znamy odpowiedz [smilie--sprite2]"}, {"3": "Tajniakos napisał:\t\t\tCzyli znalzłeś sposób na pozyskiwanie surowców, których brakuje na rynku.\t\tKliknij aby rozwinąć...[BR]Wręcz przeciwnie. Ze względu niekorzystny przelicznik manufaktura ~ warsztat+zakupy u kupca NIE produkuję bonusowych towarów, a mam w bonusie te, których brakuje na rynku.[BR][BR]Tajniakos napisał:\t\t\tJa też go znalazłem i uwierz, że nie mam z tym większych problemów, choć nie twierdzę, że problem jako taki nie istnieje... Ale lepiej znaleźć na niego sposób niż stanąć w miejscu gdy go napotkamy.\t\tKliknij aby rozwinąć...[BR]Odróżnijmy tu dwie rzeczy:[BR]Dostrzeganie, że określony problem istnieje\"Radzenie sobie\" z nimNie widzę powodu aby nie mówić o tym, że problem jest i jest jak najbardziej realny (patrz pkt. 1) tylko dlatego, że są sposoby \"obejściowe\" by sobie z nim poradzić (patrz pkt. 2).[BR]Wiesz, jak Ci się zepsuje zamek w samochodzie w drzwiach od strony kierowcy, to można znaleźć \"rozwiązania obejściowe\" pozwalające się z tym uporać - można wchodzić przez okno, drzwiami od strony pasażera itp. I pewnie można się do tego przyzwyczaić na tyle, by nie postrzegać tego jako jakąś istotną niedogodność.[BR]Ale samo istnienie takich rozwiązań nie zmienia tego, że na dłuższą metę warto się zająć naprawą zamka, nie sądzisz?[BR][BR]Tajniakos napisał:\t\t\tTemat ten już nie raz był wałkowany w wielu miejscach, tu na forum i rozwiązania jak nie było tak nie ma więc trzeba sobie jakoś z tym radzić i się da jak widać. Żeby nie było że nie wiem o czym piszę, bo akurat ja jestem wspomnianym przez Ciebie producentem stali, zwoi i pyłu tak samo jak i Ty. Patrząc na statsy to widać, że masz zbalansowane bractwo pod względem surowcowym, to tym bardziej problemu z wymianą mieć nie powinieneś. To czego nie daje Wam rynek wymiany po za bractwem zawsze można zrekompensować w wymianach w bractwie bo chyba po to ono jest aby i w takich przypadkach się wspierać.\t\tKliknij aby rozwinąć...[BR]Już Ci pisałem powyżej - statsy statsami, a realia realiami. Ponieważ, jak to ładnie zauważyłeś, ludzie nauczyli się \"sobie radzić\", statsy w bractwie w ogóle nie odzwierciedlają tego kto co produkuje. Albo u jednych oddają, a u drugich nie. Dodajmy do tego, że ludzie są na różnych poziomach rozwoju i choćby z tego powodu mają zupełnie różne możliwości produkcji i zbytu, i statsy możesz sobie..., ten tego [smilie--sprite2][BR]O czym zresztą pisałem powyżej, wspominając nowo przybyłą do bractwa graczkę, która się nieco zdziwiła rozdźwiękiem między statsami a reczywistością. [smilie--sprite6][BR][BR][BR]Tajniakos napisał:\t\t\tChyba oboje znamy odpowiedz [smilie--sprite2]Kliknij aby rozwinąć...[BR]Obaj.[BR]Przy czym ja nie znam, ewentualnie ta którą znam jest mocno nieefektywna (dość powiedzieć, że w inwentarzu dysproporcja między towarami kupowanymi u hurtownika a tymi kupowanymi z rynku wynosi u mnie - w zależności od towaru - pomiędzy 2:1 a 3:1 na niekorzyść tych, które kupuję z rynku.[BR]I to wcale nie dlatego, że zużywam ich jakoś mniej, a nawet wręcz przeciwnie - np. to właśnie za te od hurtownika kupuję wiedźmowe punkty w kotle.[BR][BR]Owszem, wszystkich mam wystarczające ilości, żeby nie martwić się, że mi ich zabraknie, niemniej brak balansu widać bardzo wyraźnie.[BR][BR]Dopisek: jest jeszcze jeden negatywny efekt braku balansu towarów, o którym nie rozmawialiśmy: otóż niedobór niektórych towarów sprawia, że \"silni\" gracze (czytaj: tacy, którzy mają duże zasoby towarów) skupują deficytowe towary z rynku, nie dlatego, że ich w danej chwili potrzebują, ale \"na wszelki wypadek\", by nie zabrakło ich kiedy będą potrzebne. Zdarzało mi się, że widząc w kupcu oferty towaru, którego mam deficyt, kupowałem jak leci wszystkie dwu i trzygwiazdkowe oferty, choć teoretycznie nie miałem jakiegoś dużego zapotrzebowania na ten towar.[BR]W ten sposób \"silni\" sobie radzą ale \"słabi\" są jeszcze bardziej odcinani od potrzebnych im surowców."}, {"6": "Stoję czwarty dzień bo na proszek lotniczy w ogóle ofert nie ma na Felyndralu, padaka jakaś z projektem tego rozdziału.[BR][BR]Tajniakos to idź grać z ogarniętymi, nie każdy musi sobie ogarnać na własny rachunek bo twórcy czegoś nie przemyśleli"}, {"2": "Koval92 napisał:\t\t\tStoję czwarty dzień bo na proszek lotniczy w ogóle ofert nie ma na Felyndralu, padaka jakaś z projektem tego rozdziału.\t\tKliknij aby rozwinąć...Rozdział jest zaprojektowany na posiadanie po 9 warsztatów, Ty postawiłeś po 16-17 i narzekasz, że Ci surowców brakuje [smilie--sprite1][BR]Ja też jestem na Felyndralu, też potrzebuję proszku i różnych rzeczy mi tam już zabrakło, ale nie surowców. Wysyłam kupców i mam więcej niż potrzeba."}, {"7": "Koval92 napisał:\t\t\tTajniakos to idź grać z ogarniętymi, nie każdy musi sobie ogarnać na własny rachunek bo twórcy czegoś nie przemyśleli\t\tKliknij aby rozwinąć...@Koval92 i tak właśnie robię [smilie--sprite1] Jak brakuje mi jakiegoś surowca to szukam rozwiązania a nie czekam \"4dni\" aż mi ktoś proszek lotniczy do miasta sam przyniesie. Wystarczy momentami w ekstremalnych przypadkach wesprzeć kupca czasówkami \"na własny rachunek\" bo niby na czyj?[BR]Ja jak i każdy z graczy miewam trudniejsze momenty w grze ale staram się je rozwiązywać na różne możliwe sposoby a nie demonizować na forum problemy. Czy nie na tym polega strategia?"}, {"25": "niestety sam tez niekiedy cierpie na brak wznioslych towarów [BR]na rynku ich brak niestety"}, {"3": "Tajniakos napisał:\t\t\tWystarczy momentami w ekstremalnych przypadkach wesprzeć kupca czasówkami \"na własny rachunek\" bo niby na czyj?\t\tKliknij aby rozwinąć...[BR]No dobrze, ale dlaczego jedni muszą co chwila \"wspierać kupca czasówkami\", a innym wiatr ten proszek, (czy inny towar sam przynosi)?[BR]Wiesz, może to nie na moje głowę, ale czy aby nie na tym polega balans w grze, że gracze o różnych profilach produkcji się wzajemnie uzupełniają? Przecież po to ludzie mają różne profile towarów bonusowych, a ich budynki ewolucyjne czy zestawy produkują różne towary w zależności od tych bonusów, żeby tak było, nieprawdaż?[BR][BR]Rozumiem okazjonalne niedobory lub nadmiary danego towaru, ale tu mamy problem z długoterminową sytuacją gdy brakuje lub jest nadmiar tych samych typów towarów.[BR][BR]Co do \"rozwiązywania na różne możliwe sposoby a nie demonizowania na forum problemów\" - dlaczego zakładasz, że to jest albo-albo?[BR]Chcesz porozmawiać o sytuacji, czy poutyskiwać sobie na innych graczy, że się nie znajo?  [smilie--sprite2]"}, {"7": "Ovocko napisał:\t\t\tNo dobrze, ale dlaczego jedni muszą co chwila \"wspierać kupca czasówkami\", a innym wiatr ten proszek, (czy inny towar sam przynosi)?[BR]Wiesz, może to nie na moje głowę, ale czy aby nie na tym polega balans w grze, że gracze o różnych profilach produkcji się wzajemnie uzupełniają? Przecież po to ludzie mają różne profile towarów bonusowych, a ich budynki ewolucyjne czy zestawy produkują różne towary w zależności od tych bonusów, żeby tak było, nieprawdaż?[BR][BR]Rozumiem okazjonalne niedobory lub nadmiary danego towaru, ale tu mamy problem z długoterminową sytuacją gdy brakuje lub jest nadmiar tych samych typów towarów.[BR][BR]Co do \"rozwiązywania na różne możliwe sposoby a nie demonizowania na forum problemów\" - dlaczego zakładasz, że to jest albo-albo?[BR]Chcesz porozmawiać o sytuacji, czy poutyskiwać sobie na innych graczy, że się nie zNie ma coo dyskutować\t\tKliknij aby rozwinąć...@Ovocko jak byś wyżej doczytał to Ci napisałem producentem jakich towarów jestem i mogło by sie wydawać, że mam problem... ale go nie mam. To co lepiej szukać rozwiązania czy stękać? Zamiast mielić językiem po próżnicy proponuję w dziale pomysły i propozycje wstawić post z jakimś rozwiązaniem to przy tak pręźnie działającym dziale z pewnością twórcy się pochylą... a do tego czasu mamy to co mamy i bicie tutaj piany na wiele się nie zda."}, {"4": "Ja w omawianym temacie wymiany towarów mam pewien sposób , a mianowicie patrzę wcześniej co potrzebuję i zanim jeszcze będzie potrzebny mi deficytowy towar to już zaczynam wstawiać wymiany , co daje mi już pewną ilość potrzebnego towaru (albo całość) z wymian w momencie jak jest potrzebny[BR]Oczywiście rozumiem , że mój sposób może wydawać się nierozsądny , lub idiotyczny , ale u mnie działa [smilie--sprite1][BR]Nie namawiam nikogo do takiego działania - stwierdzam , tylko , że osobiście wolę wcześniej zadbać o potrzebne towary , niż narzekać , że mi ich brakuje , a jak się zagapię , to mówi się trudno i żyje się dalej , bo wtedy jestem zły na siebie za gapiostwo , a nie na system , tym bardziej , że taki stan żeczy z towarami jest już od kilku lat"}, {"11": "Andrzej M napisał:\t\t\tJa w omawianym temacie wymiany towarów mam pewien sposób , a mianowicie patrzę wcześniej co potrzebuję i zanim jeszcze będzie potrzebny mi deficytowy towar to już zaczynam wstawiać wymiany , co daje mi już pewną ilość potrzebnego towaru (albo całość) z wymian w momencie jak jest potrzebny[BR]Oczywiście rozumiem , że mój sposób może wydawać się nierozsądny , lub idiotyczny , ale u mnie działa [smilie--sprite1]Kliknij aby rozwinąć...To nie jest idiotyczne, to jest normalne- robię tak samo. Wcześniej spojrzałam jakie towary są mi potrzebne do produkcji i zaczęłam je zbierać.[BR]Koval92 napisał:\t\t\tStoję czwarty dzień bo na proszek lotniczy w ogóle ofert nie ma na Felyndralu, padaka jakaś z projektem tego rozdziału.\t\tKliknij aby rozwinąć...Nusion napisał:\t\t\tRozdział jest zaprojektowany na posiadanie po 9 warsztatów, Ty postawiłeś po 16-17 i narzekasz, że Ci surowców brakuje [smilie--sprite1]Kliknij aby rozwinąć...@Koval92 matma:[BR]Masz 16 valloryjskich warsztatów, które na produkcje 4h wymagają wzniosłych towarów wszystkich sortów.[BR]I sort 7200[BR]II sort 4500[BR]III sort 3000[BR]Zakładając, że nastawi się wszystkie na dany surowiec, to trzeba mieć co 4h:[BR]I sort 115k[BR]II sort 72k[BR]III sort 48k[BR]Wysyłając 5 kupców po 1 sort dostaniesz 112,5k towaru na 6h, po 2 sort 75k a po 3 sort 50k. Od razu widać, że to nie ma prawa się udać, bo nawet jakbyś nastawiał valloryjskie warsztaty co 6h a nie 4h, to i tak nie masz towaru na ich produkcje.[BR]Może zakładałeś, że ktoś będzie Ci szybciej ściągał te oferty albo Ty je zbierać, ale to oczywiste, że większość graczy nie będzie marnowała kupców na przelicznik 1:1, dlatego przekalkulowałeś swoje możliwości produkcyjne."}]