[{"3": "Tajniakos napisał:@Ovocko jak byś wyżej doczytał to Ci napisałem producentem jakich towarów jestem i mogło by sie wydawać, że mam problem... ale go nie mam. To co lepiej szukać rozwiązania czy stękać?\t\tKliknij aby rozwinąć...[BR]No to dlaczego się tym rozwiązaniem nie podzielisz w takim razie, zamiast stękać że inni sobie nie radzą?[BR]Dla kolegi pytam [smilie--sprite2][BR][BR]Przypomnę tylko, że \"wymienić w bractwie\" lub \"używać przyspieszaczy\" to nie jest rozwiązanie.[BR][BR]Tajniakos napisał:\t\t\tZamiast mielić językiem po próżnicy proponuję w dziale pomysły i propozycje wstawić post z jakimś rozwiązaniem to przy tak pręźnie działającym dziale z pewnością twórcy się pochylą... a do tego czasu mamy to co mamy i bicie tutaj piany na wiele się nie zda.\t\tKliknij aby rozwinąć...[BR]Ale zdajesz sobie sprawę, że widzieć problem, a wymyślić jego rozwiązanie to - podobnie jak wskazywać problem a \"radzić sobie\" - dwie różne sprawy?[BR][BR]Jak Ci się w łazience zatka rura, to wzywasz hydraulika i od razu na dzień dobry tonem fachowca mówisz mu: \"Leć pan po holajzę, bo tu ferszlus trzeba roztrajbować a trychter jest krajcowany więc na sam abszperwentyl się nie da\", czy raczej jednak: \"wie pan, się zepsuło i nie działa\"?[BR][BR]Przywołując znów przykład z samochodem - mogę wiedzieć, że mam problem z hamulcami (czy wspomnianym wyżej zamkiem w drzwiach), ale niekoniecznie wiedzieć, jak się te hamulce naprawia. Od tego jest mechanik by pochylić się nad tematem i ustalić co jest nie tak.[BR]W przypadku gry sprawy do \"mechanika\"  zgłasza się m.in. na forum. Również i na tym ogólnym - bo nie zawsze zgłaszający ma pomysł na rozwiązanie. W końcu nie musi się znać na niuansach mechanizmu gry, podobnie jak właściciel samochodu nie musi się znać na budowie silnika.[BR]Im więcej będzie się mówiło o problemie tym większa szansa, że nasz \"mechanik\" w końcu się nad nim pochyli.[BR]Poza tym, jeśli gracze będą się wymieniać uwagami, to nawet jeśli osobno nie są w stanie wymyślić jakiegoś rozwiązania, to już z tego typu dyskusji może coś ciekawego wyniknąć. To są podstawy podstaw metod rozwiązywania problemów (np. technika zwana \"burzą mózgów\"), i utyskiwanie na to, że ktoś chce o tym na forum pozrozmawiać, wydaje mi się, hmm... niezbyt rozsądne.[BR][BR]Powtórzę pytanie - udzielasz się tu by wymienić się wiedzą, czy po to by sobie ponarzekać (tyle że zamiast na grę to na graczy) i - jak sam to ująłeś - pobić pianę?[BR][BR]Andrzej M napisał:\t\t\tOczywiście rozumiem , że mój sposób może wydawać się nierozsądny , lub idiotyczny , ale u mnie działa [smilie--sprite1]Kliknij aby rozwinąć...[BR]\"Jak coś jest głupie, ale działa, to nie jest głupie\" [smilie--sprite2][BR][BR]To jest rozwiązanie, aczkolwiek znowu \"obejściowe\". Sam staram się trzymać zbilansowany poziom towarów i nigdy nie schodzić poniżej pewnej granicy, traktowanej jako \"rezerwa\" na wypadek nieprzewidzianych okoliczności.[BR]Problem z tym, że to nie zawsze działa, zwłaszcza gdy chcesz się rozwijać szybko.[BR]Sam XXI rozdział przechodzę sobie powoli (postawiłem na razie tylko po dwa warsztaty), więc problemu z towarami nie mam żadnego (wystarcza mi jedna manufaktura wzniesionych).[BR]Tylko że to nie zmienia nic a nic tego, że sytuacja, w której niedobór określonych towarów trwa latami, wskazuje na to, że nasz elvenarowy \"wielki mechanik\" (hydraulik? [smilie--sprite2] ) czegoś tu nie przemyślał."}, {"7": "Ovocko napisał:\t\t\tPowtórzę pytanie - udzielasz się tu by wymienić się wiedzą, czy po to by sobie ponarzekać (tyle że zamiast na grę to na graczy) i - jak sam to ująłeś - pobić pianę?\t\tKliknij aby rozwinąć...[BR]@Ovocko no prosze Cię bądzmy powazni [smilie--sprite1]) Jak wystawię sobie 50 zbrojowni lub po 30 warsztatów z XXI rozdiału powystawiam ofki z trzeciej grupy surówców na pierwszą  i wejdę tu ponarzekać na grę jaka to ona zła i ma problemy z balansem, że gracze nie wystawiaja ofert itd,itp. Twoim zdaniem to coś zmieni i wtedy będę cacy bo idę Twoim tokiem myślenia?[BR]Wczoraj wszedłem w kupca i o dziwo zdjęłem ponad 30 ofert innych graczy z surowcami, których nie produkuję i choć może sytuacja nie jest codzienna to się takie wymiany trafiają, tylko może trzeba czesciej zaglądac do kupca?[BR]Ovocko napisał:\t\t\tJak Ci się w łazience zatka rura, to wzywasz hydraulika i od razu na dzień dobry tonem fachowca mówisz mu: \"Leć pan po holajzę, bo tu ferszlus trzeba roztrajbować a trychter jest krajcowany więc na sam abszperwentyl się nie da\", czy raczej jednak: \"wie pan, się zepsuło i nie działa\"?\t\tKliknij aby rozwinąć...Jak mi się w łazience zatka rura to najpierw zanim wezwę fachowca to sprawdzam czy sam nie jestem w stanie jej odetkać a dopiero go wzywam jak nie dam rady bądz nie potrafię tego zrobić [smilie--sprite2][BR]Ovocko napisał:\t\t\tNo to dlaczego się tym rozwiązaniem nie podzielisz w takim razie, zamiast stękać że inni sobie nie radzą?[BR]Dla kolegi pytam [smilie--sprite2]Kliknij aby rozwinąć...Bo ja choć problem istnieje nie mam z tym problemów boooo....[BR]Ovocko napisał:\t\t\tPrzypomnę tylko, że \"wymienić w bractwie\" lub \"używać przyspieszaczy\" to nie jest rozwiązanie.\t\tKliknij aby rozwinąć...Owszem jest to rozwiązanie bo problem przynajmniej z surowcami wzniesionymi znika i jest lepszy od ciągłego stękania tutaj że się nie da i akurat nie mam tu Ciebie na myśli.[BR]Ovocko napisał:\t\t\tOd tego jest mechanik by pochylić się nad tematem i ustalić co jest nie tak.[BR]W przypadku gry sprawy do \"mechanika\" zgłasza się m.in. na forum.\t\tKliknij aby rozwinąć...To jak nie chcesz zgłosić pomysłu bądz propozycji to może osobny watek chciaż? Nie uważasz że to globalny problem a tymi wpisami troszkę się rozjechaliśmy w temacie?[BR]Ovocko napisał:\t\t\tNo to dlaczego się tym rozwiązaniem nie podzielisz w takim razie, zamiast stękać że inni sobie nie radzą?[BR]Dla kolegi pytam [smilie--sprite2]Kliknij aby rozwinąć...Właśnie się nim dzielę ale jak widać po Twoich wpisach nie do końca Ci się to podoba więc chyba nie chcesz słuchać a wolisz atakować kogoś kto ma odmienne zdanie [smilie--sprite1] Dlatego może będzie lepiej jak powrócimy do myśli przewodniej wątku i skupimy sie tutaj nad XXI rozdziałem bo dalsza dyskusja na temat złego balansu surowcowego w grze jest problemem bardziej złozonym i dotyczy nie tylko tego rozdziału."}, {"3": "Tajniakos napisał:@Ovocko no prosze Cię bądzmy powazni [smilie--sprite1]) Jak wystawię sobie 50 zbrojowni lub po 30 warsztatów z XXI rozdiału powystawiam ofki z trzeciej grupy surówców na pierwszą  i wejdę tu ponarzekać na grę jaka to ona zła i ma problemy z balansem, że gracze nie wystawiaja ofert itd,itp. Twoim zdaniem to coś zmieni i wtedy będę cacy bo idę Twoim tokiem myślenia?\t\tKliknij aby rozwinąć...[BR]Wiesz, ja nie sprawdzam co kto wystawia, bo nie mam zwyczaju plotkowania o innych.[BR]Natomiast są towary, których ofert, 1:1, w ramach tej samej kategorii jest jak na lekarstwo, bo akurat to widzę.[BR]Akurat u mnie te 50 zbrojowni pozwala prawie całkowicie uniezależnić się od wymiany u kupca w zakresie żywych (codzienna wymiana u hurtownika 1:1 wystarcza - ot jeden z elementów \"radzenia sobie\"), natomiast powtórzę jak zdarta płyta: to nie zmienia tego, że problem jako taki jak najbardziej jest.[BR][BR]I mówić o nim trzeba - bo inaczej będzie sytuacja jak z dowcipu o gościu, który modlił się o wygraną w totka; w końcu usłyszał z góry głos: \"daj mi szansę i kup wreszcie los!\".[BR]Uważasz, że jak nikt nie będzie tu pisał, że coś jest nie halo, to będzie cacy i na programistów z Inno w którymś momencie po prostu spłynie jakaś łaska z nieba i nagle ich oświeci, że z towarami jest jakiś problem - jeśli dobrze rozumiem Twój tok myślenia? [smilie--sprite2][BR][BR][BR]Tajniakos napisał:\t\t\tWczoraj wszedłem w kupca i o dziwo zdjęłem ponad 30 ofert innych graczy z surowcami, których nie produkuję i choć może sytuacja nie jest codzienna to się takie wymiany trafiają, tylko może trzeba czesciej zaglądac do kupca?\t\tKliknij aby rozwinąć...[BR]Myślisz, że od częstszego zaglądania przybędzie towarów?[BR]Wiesz, ciągle mam wrażenie, że operujesz tu skrajnościami. Nikt nie mówi, że deficytowe towary NIGDY się nie pojawiają. Owszem, pojawiają się, ale rzadko i w niewielkich ilościach.[BR]Wchodzę do kupca teraz i co widzę:[BR]Stal - 7 ofert 1:1 za drewno (wszystkie zdjąłem), na ilości homeopatyczne (typu 1000 sztuk)[BR]Zwoje - 5 ofert dwugwiazdkowych, wszystkie w ilościach typu 150 szt.[BR]Pył, - tu jest lepiej, kilkadziesiąt ofert, ale w tym raptem kilkanaście za towary tej samej grupy, wszystkie w ilościach typu kilaset sztuk.[BR][BR]Moje oferty wiszą już od kilku dni, wszystkie w ramach grupy i wszystkie 1:1.[BR][BR]Podobnie ma się sytuacja z żywymi i wzniosłymi.[BR]Żeby nie było, od rana zaglądałem już ze dwa razy, tylko wtedy nie było nic.[BR][BR][BR]Tajniakos napisał:\t\t\tTo jak nie chcesz zgłosić pomysłu bądz propozycji to może osobny watek chciaż? Nie uważasz że to globalny problem a tymi wpisami troszkę się rozjechaliśmy w temacie?\t\tKliknij aby rozwinąć...[BR]Można, @Urdur, pozwolisz, że poproszę o wydzielenie?[BR][BR]Tajniakos napisał:\t\t\tWłaśnie się nim dzielę ale jak widać po Twoich wpisach nie do końca Ci się to podoba więc chyba nie chcesz słuchać a wolisz atakować kogoś kto ma odmienne zdanie [smilie--sprite1]Kliknij aby rozwinąć...[BR]Wiesz, samą odmienność zdania szanuję, ale pisania w każdym poście w duchu, że ktoś jest \"sam sobie winny\" już niekoniecznie [smilie--sprite2][BR]W sumie wystarczyło napisać, że nie widzisz problemu i zająć się swoimi sprawami, po diabła zająłeś się sprawdzaniem co kto wystawia u kupca itp. itd.? To mógłbyś, zamiast mu przygadywać że se nie radzi i marudzi, chociaż dać feedback jak @Charlene , że Koval zbyt optymistycznie podszedł do wymian u kupca, to by chłop miał szansę wyciągnąć wnioski, że musi nieco zmodyfikować strategię.[BR]Na marginesie - to, że jest problem z towarami wiedzą i potwierdzają tu bodaj wszyscy łącznie z Tobą samym, odsyłam więc do uwagi powyżej - tak, moim zdaniem warto męczyć i marudzić, bo jak będziemy siedzieli cicho to nikt z Inno nie będzie miał motywacji żeby to zmienić.[BR]Temat braku balansu między towarami powraca jak bumerang zawsze kiedy pojawia się nowy rozdział, i nie tylko jeden i ten sam gracz go podnosi  [smilie--sprite2][BR][BR]Tajniakos napisał:\t\t\tDlatego może będzie lepiej jak powrócimy do myśli przewodniej wątku i skupimy sie tutaj nad XXI rozdziałem bo dalsza dyskusja na temat złego balansu surowcowego w grze jest problemem bardziej złozonym i dotyczy nie tylko tego rozdziału.\t\tKliknij aby rozwinąć...[BR]O, to to!"}, {"37": "Wojtek90 napisał:\t\t\tDokładnie tak, ten czwarty towar \"Sztuka Orków\" najlepiej nastawiać na noc (bo czas produkcji 12h) i ja tak właśnie robię [smilie--sprite1]Kliknij aby rozwinąć...a gdzie się produkuje łuski, skorupy, szkło?[smilie--sprite1] Sorki, że w tym wątku, ale przez 8 lat nie polubiłem tego lupanaru na forum, nic nie mogę znaleźć.[BR]//[BR]PasRatunkowy napisał:\t\t\ttzn wiem gdzie, ale jak podnieść budynki by produkować?\t\tKliknij aby rozwinąć...dobra, już wiem....[BR][BR]połączono//Urdur"}, {"3": "Jakby ktoś chciał sobie policzyć o ile mu wzrośnie produkcja osady w zależności od postawionych budynków, to przelicznik między wymaganym dobrobytem a bonusem produkcji z dobrobytu wynosi 6:1, czyli na każdy wzrost wymaganego dobrobytu o 6 pkt dostajemy +1% bonusa produkcji.[BR]Przy 600 (podstawowe wymaganie) mamy bonus 100% (czyli neutralny), przy wymaganym dobrobycie 660 będzie 110%, przy 720 będzie 120% itd. [BR]Nie wiem jak zaokrągla ogonki, przypuszczam, że jak zazwyczaj, czyli w górę"}, {"34": "Wracając stricte do dyskusji o rozdziale, ale w pewien sposób zahaczając o temat surowców, chciałbym wyrazić moje subiektywne odczucie lekkiego niezadowolenia z kolejnego pod rząd złego balansu ilości potrzebnej many do przejścia rozdziału...[BR]Do produkcji 'Niechlujnych Ofiar\" - potrzeba 11000 ziaren.[BR]Do produkcji \"Niebezpiecznych Ofiar\" - potrzeba 28000 unurytu.[BR]Do produkcji \"Dzikich ofiar\" - potrzeba 930000 many.  [smilie--sprite12] Czy przez przypadek twórcy nie pomylili się tutaj o jedno 'zero'?[BR]W celu przejścia całego rozdziału potrzeba 1970 'Dzikich ofiar', u mnie produkuje się 21 sztuk. Czyli 1970/21 = w przybliżeniu 94 razy muszę puścić produkcję: 94 x 930000 = około 90 milionów many [smilie--sprite11] [BR]Natomiast z pozostałych surowców do tworzenia 'Ofiar' potrzebne jest tylko 1 milion ziaren i niecałe 3 miliony unurytu.[BR]I już nawet nie chce wspominać, że do badań potrzebne jest jeszcze 32 miliony many...[BR]Generalnie rozumiem chęci twórców na próbę zatrzymania graczy dłużej w rozdziale. Być może dużo osób nie widzi problemu mając tysiące zaklęć do przerobienia dzięki Opactwu. Ja sam po krótkiej przerwie po 20 rozdziale wiem, że sobie poradzę szybciej lub troszkę wolniej bo w sumie to nigdzie mi się nie śpieszy, ale: wydaje mi się, że przyszłe pokolenia graczy, którzy będą robić rozdział po rozdziale bez przerw, po prostu się zapłaczą albo zrezygnują w tym momencie (mówię to jako osoba która poprzednie rozdziały robiła jeden za drugim, to mój pierwszy rozdział na który czekałem). [BR]Zostało mi jeszcze 14 badań do końca, może po zakończeniu będę miał lekko inne refleksje na ten temat, ale póki co moim zdaniem ilości many są nieproporcjonalnie zawyżone."}, {"3": "Wojtek90 napisał:\t\t\tWracając stricte do dyskusji o rozdziale, ale w pewien sposób zahaczając o temat surowców, chciałbym wyrazić moje subiektywne odczucie lekkiego niezadowolenia z kolejnego pod rząd złego balansu ilości potrzebnej many do przejścia rozdziału... (...)  Być może dużo osób nie widzi problemu mając tysiące zaklęć do przerobienia dzięki Opactwu.\t\tKliknij aby rozwinąć...[BR]Też zauważyłem ten problem, choć na razie się jeszcze nad nim nie pochylałem, dopiero teraz sobie zrobiłem parę szybkich obliczeń na podstawie tego co napisałeś. I wychodzi z nich, że nawet posiadacze tysięcy zaklęć będą mieli z przejściem rozdziału niejaki kłopot.[BR][BR]Moje opactwo (30 lvl) daje nieco ponad 30 tys. many z każdego zaklęcia. przyjmując ilości potrzebnej many z Twojego posta (94 x 9300000 = niecałe 87,5 mln many) wychodzi na to, że aby uzbierać potrzebną ilość wyłącznie z opactwa potrzeba, bagatela, prawie 2,9 tys. zaklęć). [BR][BR]No sporo.[BR][BR]Jakbym rozbudował opactwo do 35 lvl (do czego, swoją drogą, też trzeba kilkunastu mln many), to zredukowałbym tę liczbę do około 2,5 tys. zaklęć.[BR]No to może zabrać sie za kończenie prowincji (mam trochę odkrytych i nie skończonych w zapasie na eventy itp.)?[BR]Zakładając, że ukończył o 100 prowincji więcej niż mam obecnie, wychodzę wtedy na trochę powyżej 2,5 tys zaklęć przy obecnym poziomie opactwa, i około 2,2 tys. przy założeniu, że rozbudowałem je na 35 poziom.[BR][BR]Niby nie są to ilości, których nie można ogarnąć, ale jednak będą w stanie mocno nadszarpnąć zapasy.[BR][BR]W praktyce pewnie będzie trochę lepiej, bo są inne źródła many, itp. itd (ale trzeba też pamiętać, że conoc część nam się rozpadnie), natomiast również mam poczucie, że twórcy co nieco przesadzili z tym spowalniaczem."}, {"9": "Koledzy jak pamiętam XIX to też mi poszlo z 2k no i miałem 60% (12 kulturek) wzmocnionych chyba na 300 dni akurat do kolejnej rasy. Obecnie posiadam podobna ilość i x2 czaru zasobow"}, {"15": "Wy na serio tak z tym narzekaniem na wymogi many? Dziwne, że będąc tak daleko w grze można mieć jeszcze problem czy z maną, ziarnami czy z unurytem.... Tak to wygląda u mnie a czaruję sobie tylko 6 warsztatów i budynki kulturowe żeby mieć 600-700% bonus cały czas.[BR][BR][BR][BR][BR][BR]A co do żwych Kowal. W 20 rozdział wszedłem praktycznie goły w żywe i stwierdziłem, że ostatni raz zrobiłem taką gafę, teraz już 2msce wcześniej postawiłem po 2 manu żywych (każdych) poczarowałem i sobie zbierałem codziennie, 3 kupców wziąłem i wymieniałem też codziennie jak sobie akurat o nich przypomniałem, po miesiącu jak miałem ok. 400k każdego nie mojego towaru a swoich ponad bańkę to pochowałem t1 i t2 a zostawiłem sobie tylko t3 (kulki) i przez miesiąc dalej tylko kulki robiłem i wymieniałem je na resztę, efekt końcowy był taki, że w rozdział wszedłem mając po ok. 500k wszystkich niebonusowych, swoich dwóch po ok 1,5m i kulek 3bańki, dalej trzymam tylko manu kulek i za nie cały czas wymieniam na inne towary. Mam 9 valoryjskich i 20 warsztatów i jakoś nie mam przestojów, kupcy co 6h dają radę. A sam produkuję najgorszy szajs bo minerały, eteryczne i kulki. Więc to jest kwestia przygotowania a nie tylko przyjść na forum i narzekać...."}, {"3": "Steefann napisał:\t\t\tWy na serio tak z tym narzekaniem na wymogi many? Dziwne, że będąc tak daleko w grze można mieć jeszcze problem czy z maną, ziarnami czy z unurytem.... Tak to wygląda u mnie a czaruję sobie tylko 6 warsztatów i budynki kulturowe żeby mieć 600-700% bonus cały czas.\t\tKliknij aby rozwinąć...[BR]Wiesz tutaj znowu mamy trochę dwie sprawy - inna rzecz to to co kto ma w magazynie (bo to u każdego gracza będzie inaczej, zależnie od bardzo wielu czynników), a inna rzecz zbalansowanie wymogów produkcyjnych.[BR][BR]Co do magazynu - np. rozbudowy cudów powyżej pewnego poziomu (zazwyczaj 31lvl), a tych z ostatnich rodziałów nawet wcześniej, wymagają po kilka mln many do każdej rozbudowy. Wystarczy, że robisz rozbudowy dość szybko, by się zużyło. Z warsztatami podobnie, np. sam bardzo długo miałem tylko jeden magiczny warsztat, więc w ogóle nie rzucałem na niego zaklęć (i tak był zaczarowany na kilka lat do przodu). Dopiero niedawno dostawiłem drugi, a zupełnie ostatnio trzeci (bardziej dla dobrobytu niż z potrzeby). Inny inwentarz zaklęć będzie miał ktoś, kto robi 20 prowincji, a inny ktoś kto robi 40, 60, czy więcej. Itd, itp.[BR][BR]Natomiast co do  wymogów, to policzyłem jeszcze, ile czasu zajęłoby mi zdobycie każdego z surowców, gdybym startował z zerowym magazynem. [BR]Ziarna - wyłącznie tym co dostaję z kupca - musiałbym zbierać około 6 dni (zakładam 4 zbiory dziennie)Unuryt - wyłącznie ze bonusa duchów ze skrzynek z iglicy - zbierałbym przez dwie iglice (czyli około tygodnia)Manę, przy założeniu, że robię 50 prowincji co turniej - zbierałbym około 27 turniejów (czyli circa 6 miesięcy); gdybym robił 100 prowincji to zajęłoby to kwartał.Oczywiście to wyliczenia na podstawie mojego miasta, i każdy gracz będzie miał inaczej (bonus kupca czy duchów zależy od czynników, które u każdego są różne), natomiast dysproporcję widać wyraźnie."}, {"34": "Steefann napisał:\t\t\tTak to wygląda u mnie\t\tKliknij aby rozwinąć...Dobra, to już teraz wiem na podstawie jakich graczy twórcy ustalają tak patologiczne poziomy many, dzięki Ci wielkie [smilie--sprite7][smilie--sprite8][BR]Oczywiście mówię to z przymrużeniem oka bez żadnych złośliwości [smilie--sprite2][BR]Zacząłeś grę ponad dwa lata wcześniej niż ja i w sumie nie dziwię się że masz takie stany magazynowe skoro masz wszystkie postawione cuda i długo stałeś po każdym rozdziale. Natomiast w moim przypadku gdy przechodziłem rozdział za rozdziałem nie było łatwo nadążyć i prowadziło to do lekkiej irytacji i zniechęcenia gdy potrzeba jest aż tylu surowców na osady i tak jak wspomniał @Ovocko na rozbudowy cudów które pożerają ogromne ilości many i w sumie nie tylko...[BR]Ale już nie rozpisując się, dzięki za ten post @Steefann i przedstawienie Twojej perspektywy, dobrze czasem usłyszeć głos z drugiej strony żeby móc spojrzeć na wszystko szerzej, bo chyba nie byłem do końca świadomy że takie stany magazynowe są możliwe i myślałem, że problem dotyczy wszystkich bez wyjątków. Fajnie, że niektórzy nie mają takich problemów jak ja [smilie--sprite11][smilie--sprite7] [BR]Teraz mogę zastanowić się nad poprawą taktyki przed kolejnymi rozdziałami [smilie--sprite2]"}, {"3": "@Wojtek90 , pamiętajmy, że takich graczy jak @Steefann, czy nawet ja (choć mnie się nie chce śrubować aż tak wyników w turniejach) jest zdecydowana mniejszość. [BR]Większość stuka turniej o tyle o ile, do tego strategia polegająca na odcinaniu kuponów od premii kultury też wymaga pewnych inwestycji i czasu. Na pobocznych światach jestem w Elvenarach, mam tam premię kultury poniżej 300%, a turniej robię na 15 prowincji - i zaklęć (a co za tym idzie many) wcale nie mam jakoś dużo. Nie na tyle, by swobodnie nimi gospodarować."}, {"7": "Wojtek90 napisał:\t\t\tWracając stricte do dyskusji o rozdziale, ale w pewien sposób zahaczając o temat surowców, chciałbym wyrazić moje subiektywne odczucie lekkiego niezadowolenia z kolejnego pod rząd złego balansu ilości potrzebnej many do przejścia rozdziału...[BR]Do produkcji 'Niechlujnych Ofiar\" - potrzeba 11000 ziaren.[BR]Do produkcji \"Niebezpiecznych Ofiar\" - potrzeba 28000 unurytu.[BR]Do produkcji \"Dzikich ofiar\" - potrzeba 930000 many.  [smilie--sprite12] Czy przez przypadek twórcy nie pomylili się tutaj o jedno 'zero'?[BR]W celu przejścia całego rozdziału potrzeba 1970 'Dzikich ofiar', u mnie produkuje się 21 sztuk. Czyli 1970/21 = w przybliżeniu 94 razy muszę puścić produkcję: 94 x 930000 = około 90 milionów many [smilie--sprite11][BR]Natomiast z pozostałych surowców do tworzenia 'Ofiar' potrzebne jest tylko 1 milion ziaren i niecałe 3 miliony unurytu.[BR]I już nawet nie chce wspominać, że do badań potrzebne jest jeszcze 32 miliony many...[BR]Generalnie rozumiem chęci twórców na próbę zatrzymania graczy dłużej w rozdziale. Być może dużo osób nie widzi problemu mając tysiące zaklęć do przerobienia dzięki Opactwu. Ja sam po krótkiej przerwie po 20 rozdziale wiem, że sobie poradzę szybciej lub troszkę wolniej bo w sumie to nigdzie mi się nie śpieszy, ale: wydaje mi się, że przyszłe pokolenia graczy, którzy będą robić rozdział po rozdziale bez przerw, po prostu się zapłaczą albo zrezygnują w tym momencie (mówię to jako osoba która poprzednie rozdziały robiła jeden za drugim, to mój pierwszy rozdział na który czekałem).[BR]Zostało mi jeszcze 14 badań do końca, może po zakończeniu będę miał lekko inne refleksje na ten temat, ale póki co moim zdaniem ilości many są nieproporcjonalnie zawyżone.\t\tKliknij aby rozwinąć...@jarq czy mógł byś zasięgnąć języka czy te ilości z powyższego postu są dobrze wyliczone i ustawione.? W moim odczuciu albo to jest błąd gry albo kogoś bez wyobraźni z lekka poniosło z tymi ilościami many na rozdział."}, {"38": "Tajniakos napisał:@jarq czy mógł byś zasięgnąć języka czy te ilości z powyższego postu są dobrze wyliczone i ustawione.? W moim odczuciu albo to jest błąd gry albo kogoś bez wyobraźni z lekka poniosło z tymi ilościami many na rozdział.\t\tKliknij aby rozwinąć...Ja bym obstawiała, że to celowe działanie mające na celu spowolnienie graczy i uciszenie powtarzającego się mękolenia \"kiedy następny rozdział?\", żeby developerzy mogli sobie nad nim spokojnie popracować [smilie--sprite7]"}, {"7": "Serengeti napisał:\t\t\tJa bym obstawiała, że to celowe działanie mające na celu spowolnienie graczy i uciszenie powtarzającego się mękolenia \"kiedy następny rozdział?\", żeby developerzy mogli sobie nad nim spokojnie popracować [smilie--sprite7]Kliknij aby rozwinąć...Taką ewentualność też biorę pod uwagę ponieważ teoretycznie a często i praktycznie po wejściu nowego rozdziału ilości surowców w poprzednim rozdziale są zmniejszane dla reszty graczy. Jak dla mnie, choć  już napisałem w jednym z moich wcześniejszych postów, niech inni gracze mają lżej ale... w stosunku do nas są to nieuczciwe posunięcia. Nam te surowce z nieba nie kapią i aby przetrzeć szlak musimy wydać jak widać kosmiczne wręcz ilości tych surowców i to nie tylko many. Przykład z maną pokazuje tylko dobitnie jak wysokie to wymagania. Nie może być tak, że starym graczom funduje się większe wymagania, zmniejszając je po czasie  tylko dlatego, że gramy dłużej a IG nie nadąża z tworzeniem nowych rozdziałów [smilie--sprite1]"}, {"38": "Tajniakos napisał:\t\t\tTaką ewentualność też biorę pod uwagę ponieważ teoretycznie a często i praktycznie po wejściu nowego rozdziału ilości surowców w poprzednim rozdziale są zmniejszane dla reszty graczy. Jak dla mnie, choć  już napisałem w jednym z moich wcześniejszych postów, niech inni gracze mają lżej ale... w stosunku do nas są to nieuczciwe posunięcia. Nam te surowce z nieba nie kapią i aby przetrzeć szlak musimy wydać jak widać kosmiczne wręcz ilości tych surowców i to nie tylko many. Przykład z maną pokazuje tylko dobitnie jak wysokie to wymagania. Nie może być tak, że starym graczom funduje się większe wymagania, zmniejszając je po czasie  tylko dlatego, że gramy dłużej a IG nie nadąża z tworzeniem nowych rozdziałów [smilie--sprite1]Kliknij aby rozwinąć...Ale co innego będziecie z tymi napływającymi surowcami robić, stojąc potem w ostatnim rozdziale miesiącami? [smilie--sprite7][BR]Z drugiej strony nic nie stoi na przeszkodzie, żeby ci bardziej zaawansowani gracze, którzy są w ostatnim rozdziale poczekali chwilę i tak się ustawili, żeby zawsze być w rozdziale przedostatnim [smilie--sprite2] Będą mieli taniej [smilie--sprite1][BR][BR]Mi jeszcze długo ta sytuacja nie grozi, więc łatwo mi się wymądrzać, dlatego trochę sobie żartuję, oczywiście [smilie--sprite8][BR]#styl_ślimaka"}, {"3": "Serengeti napisał:\t\t\tZ drugiej strony nic nie stoi na przeszkodzie, żeby ci bardziej zaawansowani gracze, którzy są w ostatnim rozdziale poczekali chwilę i tak się ustawili, żeby zawsze być w rozdziale przedostatnim\t\tKliknij aby rozwinąć...[BR]No wiesz, tym tokiem rozumowania to najlepiej siedzieć w pierwszym rozdziale, wtedy wszystko jest taniutkie [smilie--sprite2][BR][BR]A bardziej serio, to już sensowniej by było poczekać aż pierwsi przetrą szlak i wtedy dopiero robić rodział. Tylko z drugiej strony... odstępy między rodziałami są na tyle długie (nie narzekam, rozumiem, że przygotowanie rodziału zajmuje czas), że w pewnym momencie zdążysz się grą już znudzić, czekając na kolejny. Jakbym miał czekać z robieniem XXI rozdziału aż wejdzie XXII, to nie wiem czy bym dotrwał do tego momentu [smilie--sprite1][BR][BR]Przy czym mnie np. mniej bolą ilości (akurat mam worek z zylionem zaklęć, więc mogę ich trochę zużyć), ale takie kompletne niezbalansowanie tego. Bo dlaczego akurat mana jest towarem, którego potrzeba gigantyczne ilośći, a nie jest to rozłożone mniej więcej po równo między unuryt, ziarna i manę? Nie pierwszy raz mam wrażene, że faworyzowany jest tutaj jeden profil gracza, do tego taki, który wcale nie jest najbardziej typowy. [BR]Nie wiem, może twórcom zależy na promowaniu monokultury w grze?[BR][BR]Nieco offtopic: @jarq , może by tak wysłać grafika na kurs kadrowania portretu? Rozumiem, że jednostki wojskowe są różnego wzrostu, ale najpierw w XX rodziale trentowi wystawały rogi poza ramkę (nadal trochę wystają, choć mam wrażenie, że była jakaś poprawka po drodze), a teraz z żaby zrobiliście, za przeproszeniem, kurdupla."}, {"34": "Co do tej many, to każdemu polecam (oczywiście kto ma) postawić budynek: Runa Many, która zwiększa o 70% produkcję many we wszystkich budynkach, bo ten rozdział to idealny moment na ten budyneczek. Ja dzięki temu zbieram teraz prawie 2 miliony many dziennie, dzięki czemu mogę sobie aż dwa razy dziennie puścić \"Dzikie Ofiary\" jupi [smilie--sprite11] xD"}, {"34": "Uwaga na zadanie 83: \"Udziel darowizny Akademii Magii + Utwórz zaklęcia 10szt + Użyj zaklęć 10szt\" [BR]- przy zabiorze kilku zaklęć z Akademii zalicza je jako jedną sztukę, dlatego trzeba zebrać 10 razy pojedynczo po jednej sztuce. [BR]Przed chwilą dopiero zobaczyłem, że problem jest już zgłoszony na forum bety, więc tutaj nie zgłaszam jako błąd aby informuję żebyście uważali - chociaż może naprawią niebawem  [smilie--sprite11]"}, {"3": "Tak jeszcze w kwestii many vs. ziarna i unuryt:[BR][BR]W przypadku rozbudów manufaktur mamy podobny brak balansu:[BR]rozbudowa manufaktury  eliksirów pochłania 250 000 unurytu[BR]rozbudowa manufaktury kryształu pochłania 125 000 ziaren[BR]rozbudowa manufaktury marmuru pochłania 2 300 000 many[BR][BR]Mamy więc stosunek rzędu 1:9 w przypadku unurytu i 1:18 w przypadku ziaren. Jednocześnie rozbudowy manufaktur T1 zazwyczaj były tańsze niż manufaktur T2 i T3.[BR][BR]Co do zbierania many, jest jeszcze taki budyneczek jak \"kriomana\", który był do zdobycia (jako księga, z krionasionami i kriounurytem) w którymś z poprzednich eventów. Teraz jest dobry moment by go użyć [smilie--sprite6]"}]