[{"128": "9. 1. bude spuštěn nový herní prvek Kotlík. Podělte se o své postřehy, nápady a názory. [smilie--sprite6]"}, {"16": "Takže bez úprav. Ať žije loterie efektů a ohromné plýtvání surovinami."}, {"26": "Jakého efektu nakonec dosáhnete, zjistíte až ve chvíli, kdy lektvar vypijete.[BR]Co je tohle za nesmysl -neměl bych znát efekt lektvaru před použitím??[BR]já si složitě namíchám nějaký lektvar na určitým účelem a když ho nakonec použiju, efekt bude náhodně úplně jiný?"}, {"116": "tak bezny hrac ma k dispozici 4 pohary za turnaj takze pak kdyz to poskladas dobre ty suroviny na vareni dockas se efektu ktery jsi chtel - je to dost velka sance.[BR]ta studijni cast bude sranda tam me zklamalo to ze ceny za ty carodejnicke body se neresetuji, ale pokrok zustava zachovany tak snad budiz[BR]myslim ze potrva nez kotlik ocenime, ale ze nam uzitecny bude ikdyz na prvy pohled vypada jako nic moc"}, {"77": "řekla bych, že to bude chvilku trvat, než se s funkcí kotlíku trochu víc sžijeme, ale jak se naučíme vařit jako mistři, určitě bude ve hře cenným zpestřením [smilie--sprite1]"}, {"6": "Nevím, nevím. Mám své suroviny nesmírně rád. Nechci je vyhazovat oknem za nevím co."}, {"77": "tak za \"nevím co\" to asi není, jestli jsem to správně pochopila, tak si můžu vybrat ingredienci, která přidává konkrétní bonus ve finálním lektvaru, tedy to, jaký bonus získám, si mohu navolit cíleně a ne že to možné nebude[BR][BR]já mám třeba obrovský nadbytek zlatých úlomků, které neprotočím v řemeslné v Akademii ani náhodou, a v kotlíku se za ně bude moct měnit, ty já užiju ráda"}, {"137": "Věž mi ze začátku taky připadala jako plýtvání vojskem (nebo surovinami - podle toho, jak to kdo hraje). Teď si to už nemyslím. Kotlík je třeba vyzkoušet a pak se uvidí. Nějaká platforma na výměnu nápadů by se hodila, ale Facebook (jak to zmiňují ve videu) tedy opravdu ne."}, {"116": "@luterina tak to mas velke stesti ja uz marne cekam kdy neco pridaji i na ulomky kouzel jelikoz me uz davno hra nuti setrit a vyrabet jen to uzitecnejsi a ne cokoli me napadne jako jsem to delala drive[BR][BR]a jinak k tomu kotliku myslim ze nez si hrac vytuni nejaky ten efekt tak staci varit slabe lektvary a cpat to na tu studijni fazi a kdyz bude mit pocit ze nastal cas poradne vyuzit kotlik tak naopak nahazet co se da, na bete jsem to taky nejak halabala klikala a pochopila to jen malo ted uz asi rozumim trosku vic ale porad to chce dlouhodobejsi zkusenost"}, {"26": "Ještě věta na WIKI : [BR]Pokud vítězný pohár neaktivuje efekt lektvaru, pro který jste úlomky kouzel použili, část úlomků vám bude vrácena! [BR]To mne pouze utvrzuje v přesvědčení, že ať smíchám co smíchám, výsledný efekt lektvaru mi náhodně vyplivne hra.[BR]A pokud efekt nebude takový, pro který jsem obětoval suroviny a zřejmě cennější úlomky - tak mi milostivě nějakou část úlomků vrátí, ale suroviny budou ztraceny..[BR]No nevím, nejsem o tom přesvědčený, vyzkouším a uvidím."}, {"28": "Jak to chápu já, těmi \"surovinami\" jsou v části vaření pouze čarodějnické body, které by ti na konci týdne stejně propadly, takže vlastně o nic nepřijdeš (kromě části úlomků, které můžeš ale nemusíš použít). Svoje suroviny cpeš až do fáze studia a tam ten pokrok zůstává."}, {"6": "Pořád nevím, protože na rozdíl od @luterina, ale stejně (ne-li více) jako @Hexik, šetřím úlomky pro výrobu v akádě. A to jezdím teploměr pravidelně nahoru už od čarodraků. Takže úlomky budou asi tím hlavním omezujícím úzkým profilem, jak se s oblibou říkalo za komunistů."}, {"116": "[IMG]https://i.ibb.co/XCNhrkW/https-cz-forum-elvenar-com-index-php-attachments-kotel6-jpg-6491.jpg[/IMG][BR]@Schoenfeld myslim ze te zajima toto nahazela jsem tam sice plny kotel, ale uz to nebylo za co uvarit kazdopadne tech ulomku se tam da vyhazet docela ranec"}, {"31": "Ta success rate znamená 100% šanci, že uvaříš recept, který chceš (ten s nejvyšší pravděpodobností)?"}, {"116": "to jen znamena ze jsi dala maximum surovin kostka pak ukazuje sanci jaky efekt a s jakou pravdepodobnosti muzes pri napiti ziskat, toto se meni prave surovinami a jejich poradim zvysovani kritiku (max 50%) pak zvysujes sanci na kvalitnejsi efekt[BR][IMG]https://i.ibb.co/vLt4Qtq/https-cz-forum-elvenar-com-index-php-attachments-kotel4-jpg-6493.jpg[/IMG][IMG]https://i.ibb.co/4fD7SkF/https-cz-forum-elvenar-com-index-php-attachments-kotel5-jpg-6494.jpg[/IMG][BR]pri dalsim napiti pak muzes ziskat bud lepsiho efektu ktery uz jsi mela a nebo nejaky jiny[BR][BR]taky uz se tesim ze si ozkousim zde na cz kde tomu budu snad lepe rozumet"}, {"7": "Od jaké úrovně ten Kotlík je?"}, {"116": "5. ale musis to vyzkoumat jen co to tam bude"}, {"15": "Tak to jsem teda zvědavá . Jenom doufám , že mi z toho pití lektvarů nebude \" blujno \" .[BR][smilie--sprite6]"}, {"7": "Hexik napsal/a:\t\t\t5. ale musis to vyzkoumat jen co to tam bude\t\tKlikněte zde pro zvětšení...No to jsem zvědav, jak to bude fungovat, když mám pětku hotovou![smilie--sprite9][BR]A má to fungovat od devátého.... [BR]....tak to schválně zůstanu vzhůru, abych to minutu po půlnoci spustil?!!![BR][smilie--sprite8][smilie--sprite7][smilie--sprite8]"}, {"3": "Spíš tak kolem 11 nebo 12 dopo"}]