[{"21": "Schoenfeld napsal/a:\t\t\tV Turnaji, ve Věži a v provincii válčím. Jinak by už skoro nebylo proč hrát. A o Kotlíku marno hovořit.[BR]Takže mi sklad bobtná.\t\tKlikněte zde pro zvětšení...Turnaj a věž dávám bojem, vyzkoumanych provincii mám jen 660 ale bojem to už nedám moc těžké, radši vyjednavam kotlík nahazu bez surek,úlomků, dia"}, {"124": "@Schoenfeld také většinu turnajových provincií válčím ručně,ale když jedeš na víc provincií tak pak už kolikrát nic jiného nezbývá,věž vybojuji klidně jen s očarovaným ohnivákem takže také vojskem a provincie na mapě většinou vyjednávám"}, {"6": "Provincii čistím nadvakrát. Sestavy protivníka 5+ řeším s využitím 3 podpor z akády (nebo místo vylepšení jednotek používám občas zbrojíře) + fénix. Sestavy 4- potom jenom s fénixem. A hraju to převážně při začátku Události proti požadavkům vítězných střetů a hlavně relíkvií. [BR]Samozřejmě při vůbec žádných nebo minimálních ztrátách vojska.[BR]Uplácení je zbytečné a navíc neetické."}, {"2": "@Danber7777[BR]Já když jsem koukal na ceny výkupu v turnaji, tak mi pride, že než bych utratil suroviny, zastaví mě zásoby, orci, nebo mana.[BR]Řešíš to někdy?[BR]@Schoenfeld [BR]A nahnat tam vojsko je etické?"}, {"129": "Nechapu jak mužete srovnavat kdo jak hra , kto jak vykupuje , atd atd . Tohle sou debaty o ničem protože neřešej podstatu.[BR]Schoenfeld pokud nedela v turnaji 10 000 a vice bodu je jasne že vykupovat nebude protože uhrat 6 K bodu jde v poho iba s armadu , Danber777 je jasne že mu stači iba očarovany Fenix na pruchod veži . Hraju to s hračem co ma pořadne vyhnane hore divy a vež bez komb jenom s armou by nedal když nema zbrojire a pod. , ale pomaha si kotlikem, kde ma nastavene bonusy na 80 %. Gorgline, ano i ja si nedovedu predstavit když jedu turnaj na 10 K a vice bodu ,  že by sem neco v turnaji nevykoupil to proste jenom s armou nejde , zmasakroval bych ji , a take od toho mame div jako treba čmelak , svatyni šampionu na orky a pod. tak  proč to tak nedelat a ušetrit armu za neco co mne stoji kladiva za nakup surek od obchodnika.Každy hrač to hraje jinak vim jak je na tom Gorglin  ,Schoenfeld a bavit se o jedne a te iste veci jak delate je nezmysel.Ste uplne jiny hrači, protože Vaše mesta sou totiž uplne odlišna."}, {"6": "@Marian24 má pravdu. Právě proto jsem to uváděl jako příklad.[BR]Jinak diskusi o tom ze své strany končím."}, {"3": "Jen doplním, že turnaj okolo 20.000 bodu sežere krom množství vojáků, domečků stromečků a uzdravovacich kouzel i  nejmíň 10 Mega od všech surovin. Za manu a orky se snažím nevykupovat."}, {"16": "Ono to ani za tu manu moc nejde. Kolikrát si asi může kdokoliv dovolit vykupovat jeden výkup za 2M many."}, {"2": "Nejednou jsem tu četl že má někdo draka a naklika si kolik libo"}, {"21": "Marian24 napsal/a:\t\t\tSte uplne jiny hrači, protože Vaše mesta sou totiž uplne odlišna.\t\tKlikněte zde pro zvětšení...Nejen města a hráči, hodně záleží na zkušenosti a styl hraní"}, {"124": "@jjj na orkách to většinou končí i u mne(nebo u mého bonusového) Jde o to kolik dokážu ušetřit naverbovat armády abych měl dost vojska na tyto střety,zásoby pokud myslíš kladívka tak ty jsou skoro všude akademka.denní odměny v sezoně,věž Manu dostaneš pokud máš dračí zase z kouzel dobré je k tomu i bludiště které zabranuje rozpadu Samozřejmě hodně pomůže i společenství nebo dobří sousedé kteří ti vezmou obchod pokud nemáš dostatek většinou v mém případě svého bonusového Zas na druhou stranu já jsem hráč který si v turnaji nedrží stálou linii třeba 9tis jako někteří Já spíš v turnaji lítám nahoru dolů Samozřejmě souhlas s tím co psal Marian Howgh"}, {"16": "@GorGlin Pokud by někdo chtěl vykupovat po 2M/výkup, tak by i zásoby tisíců kouzel s opatstvím došly docela rychle."}, {"124": "@GorGlin on drak +bludiště také není vše manu ti to udělá,ale potřebuješ hromadu kouzel aby ti jí to mělo z čeho udělat Já o tom psal také,ale ve většině případech kde je mana či orkové se snažíš tyto turnaje vybojovat Já nemám zatím svatyni,ale vím,že pokud chci hrát v turnaji víc bodů postavit jí prostě budu muset páč většinou končím na orkách"}, {"2": "Já jedu turnaj s věží najednou během několika hodin a úplně si nedokážu představit výkup i za mince a zásoby.[BR]Protože těch střetu je hodně když tam pak začnou lítat miliony, to bych byl po pár turnajích bez instantu"}, {"124": "@ GorGlin [BR]to je to o čem psal Marian máme každý jiná města,jiné sousedy.... Já když pravidelně chodím po mapě k sousedům na kávičku zvládnu zajít i třeba 3x za den nakoupit ke zlodějovi surky jak za kladívka tak za mince Když jedu turnaj na víc bodů a používám požehnání tak se divím,že pro mne má vůbec ještě zboží[smilie--sprite1]"}, {"16": "@GorGlin Myslíš jako když v těch opravdu vysokých provinciích to kromě 2M many sežere i 1/3 kapacity mincí na výkup? Jo, zlaté časy, kdy výkup v turnaji žral jen suroviny."}, {"129": "Zbožný přání - Dufam , že do výkupu v turnaji časom nenasoli INNO aj živouci a pak po letech i osvicene zboži ... To by byl u mne peknej maler [smilie--sprite8][smilie--sprite8][smilie--sprite8] Asi by to problém nebyl pro INNO udelat to a zavest do hry , tu vež podle vylepšenych divu hráču , už dokázali stežit ... pak by i kotlik zas o neco nabral na váze a jeho bonusy na zvýšenu výrobu živouciho a osviceného zboží ... no snad se tak nestane , ale ja by sem se už tomu vubec nedivil , kdyby ano."}, {"3": "Tvrdili, že to neudělají. Proto je ve věži [BR][BR]Lovec Krys napsal/a:@GorGlin Myslíš jako když v těch opravdu vysokých provinciích to kromě 2M many sežere i 1/3 kapacity mincí na výkup? Jo, zlaté časy, kdy výkup v turnaji žral jen suroviny.\t\tKlikněte zde pro zvětšení...I tak u větších turnaju mince a kladiva několikrát prikouzluju. Lepší, než pak urychlivat výrobu jednotek... i když..."}, {"16": "Marian24 napsal/a:\t\t\ta jeho bonusy na zvýšenu výrobu živouciho a osviceného zboží\t\tKlikněte zde pro zvětšení...I na lv100 ti budou ty bonusy k ničemu. (nemluvě o tom, že dva efekty na 100 nedáš ani náhodou)"}, {"2": "Hlavně je náhoda co ti padne, takže s tím nejde programové pracovat."}]