[{"129": "Mam je na 60 až 70 procent jak ktere , vic do toho nebudu davat ani nahodou , je to drahe jak satan , znam ale hrače  ktery je vytunej na tu 100 vku.[BR]Jako proć by byl efekt 100% na osvicene nebo živouci zboži k  ničemu z kotliku pri trvani priklad 20 hodin ? To nechapu ... pri 3 hodinove vyrobe když očaruješ manifaktury z toho už neco vypadne ne ?"}, {"136": "ono s tým levelom 100 je to trošku ošemetné[BR]na level 1-75 potrebuješ 1,270,895  witch points (+- stratené pri zaokrúhľovaní)[BR]na level 1-100 to robí   13,779,612 ....[BR][BR]takže dilema,  spraviť 10 bonusov na level 75 alebo len jeden na 100 ku[BR][BR]a teraz cena toho všetkého, povedzme že mincea zásoby šli ako cena drasticky hore, mana semiačka unuri a orkovia sa až tak nevyrábajú tak som ako cenu použil len tovar manufaktúr, takže :[BR]na lvl 75 - je treba spraviť 175 nákupov z každého z deviatich tovarov   - po tom bude nadalej cena jedneho nákupu 5994 +-[BR]na lvl 100 - to robí 584 nákupov, atu to je zaujimave[BR]                      pri 200 nákupoch je cena - 12,551[BR]                      pri 300 - 241,212[BR]                      pri 400 - 4,635,757   (4 Mega)[BR]                      pri 500 - 89,092,916  (89 Mega)[BR]                           584 - 1,067,013,827  (1,067 Mega)[BR][BR]celková suma vykúpeného jedného tovaru : 36,634,140,241[BR]( cena pri nákupe sa násobí 1,03 (približne)  pre kapitolu 17 ( hádam máme všetci rovnaké ceny)[BR][BR]@Marian24  stym posilnenim na tovar to až také nie je [BR]100% základ[BR]700% posilennie relikvii[BR]xxx% divy[BR]350% očarovanie kúzlom (50% magická výroba)[BR]240% kotlík  na leveli 100  (140% na leveli 50)[BR][BR]posilnenie súboja na leveli 100 robí +24%[BR]pre orkov to je +60%[BR]mana +60 %[BR]semiačka +60%[BR]tovar spriatelenych rás 24%"}, {"16": "@Marian24 Protože týden má 7 dní, tzn. 168 hodin. Z toho je nějakých 20 hodin bonusu k výrobě celkem nic.[BR]A hlavní brzda u osvíceného jsou kupci, tam je úplně jedno, kolik toho vyrobíš, když to měníš po troškách."}, {"129": "Ješte mi neni jasna jedna vec . Priklad.[BR]Když trafim bonus z kotliku  na zboži - (ted je jedno jestli je to osvicne,živouci, standartni) priklad tech 240%.[BR]Techto 240% se počita jenom ze 100 % zakladu , alebo se to počita z  100% zakladu + 700% relikvie ?"}, {"2": "jen ze základu, když mi padl bonus na zboží tak jsem vyráběl nějakých 1500 na každé manufaktuře"}, {"6": "Tak jsem si zase dobře početl, prostudoval a shrnul to - kotlík je pořád masarakš."}, {"136": "co já vim,  20 % na rasu je celkom dost , aj ked len na 10-15 hodin, raz za týžden"}, {"6": "Průměrný týden má 168 hodin. Tato hra se hraje furt - 168 hodin. Poměr posil/neposil je tristní. Prostě k logické nepoužitelnosti."}, {"77": "já nevím jak vy, asi jsem to nějak nevychytala, ale nevím kdy - v jakém čase, je nejlíp ten lektvar vypít a užívat si dostatečně plně jeho účinků? - mám pocit, že se mi nedaří ho vypít v ten správný čas tak, aby byl plně využitý, máte prosím nějaké k tomuto dobré rady? předem děkuji  [smilie--sprite1]"}, {"2": "Je to podobné jako s kouzly[BR]Nejlepší je použit lektvar krátce před velkou sklizni a pak jedeš co nejvíc krátkých.[BR]Ale, pokud se snažíš o bonus na urinu a budeš sbírat produkci z kulturek v osm večer, musíš počítat aby ti bonus vydržel.[BR]On ti pak nepadne a ty budeš mít kopu jiných nevyužitých[BR]A to se vyplatí."}, {"3": "A pokud posiluje vojsko, tak před bojem ;-)"}, {"129": "Ja varim a snažim sa dostať z neho vojenske bonusy keď idem 5 a 6 kolo turnaja . Ne vždy mi bonus na armu padne no .. keď ano ,tak tie dve zaverečna kola odohravam s arma bonusmy z kotlika.Skok nemam na full a mam neake rozpetie medzi kolami turnaja okolo 5 hodin so zapnutou polarkou .Na surky kotlik nepouživam vubec ani na manu ani unurium.Nesnažim sa o tieto bonusy z neho , iba o tie vojenske."}, {"22": "Ten kotlík je fakt totálně random a to mě nebaví. Často na něj zapomínám, takže těsně před koncem než zmizí tam hodím jednu přísadu, aby mi nepropadly body a aspoň za zbytek těch bodů vylepším účinky. Většinou za tu jedinou přísadu dostanu víc lektvarů, než když pracně koumám kombinace a využiju všechny body co mám a prd z toho"}]