[{"16": "On je hlavně jeden pokus týdně, takže je potřeba si rozmyslet, kdy vlastně chci tu loterii efektů zkoušet."}, {"136": "ako dlho je vlastne ten kotlík otvorený? [BR]nikde to nepísalo[BR]ja neviem, napr. je prístupný 4 dni ,a a uvariť elixír môžem aj hodinu pred koncom, potom môžem tú hodinu zlepšovať efekty a potom , čakať kým bude zase aktívny ?"}, {"16": "24/7. Reset je tuším v pátek (myslím, že večer s věží, ale jistý si tím nejsem)."}, {"6": "Natahovat to, to by jim pro začátek šlo..."}, {"7": "Tak doufám, že daj hodní admini hlášku (echo), že už to na normálním servru funguje.... "}, {"138": "tak co je s tím kotlíkem? kdy už bude?"}, {"16": "Tipuji nejpozději odpoledne.[BR]Nejspíše provedou update, kde kotlík zapnou."}, {"20": "Tak jak Kotlík vypadá na betě, je pro mě zatím nevýhodný. Ale možná, že přijde nějaký vývoj a jeho funkce se časem vylepší. Takže dám tomu čas a uvidím."}, {"128": "Kotlík je ve stromu výzkumu uprostřed 5. kapitoly."}, {"138": "tak už je, ještě se naučit vařit  [smilie--sprite11] [smilie--sprite1]"}, {"7": "jj[BR]chytře to udělali = jak to narvali do té slepé větve v 5ce!"}, {"6": "Aha roztáčí to emoce. Tak to bude po čase zase správná řacha.[BR]Jenom si dovolím poznamenat, že u hráčů, jako v mém případě, co zrovna plní kapitolní výzkum skrzevá VB na plné pecky, je požadavek 30 VB za pozdní výzkum poněkud mrzký. Jedu podle striktního itineráře, takže si hodlám ten výzkumek plnit až při Turnaji ze stanů.[BR]Nějak mne také napadá, jestli to dodatečné zařazení do starých kapitol nebude zkusmá vlaštovka pro příští vývoj zatím logicky ukončených kapitol.[BR]Uvidíme."}, {"8": "takze.. spalim milion many (a 200000x u tohjo kliknu abych ziskal nejake ty carodejne body) tak ten pozadavek na mnozstvi zdroje (a v ylepseni) je trvaly nebo se neco z toho bude taky tydne resetovat?[BR]to jak je ultra neprehledny ty vlastnosti ingredienci a jen to ze to zjistim pridanim (a odebranim) do kotliku to proste musel delat nejaky sadista. nebo proste vzhledem k tomu ze to je stejnak tak nejak loterie tak mi to ma byt jako jedno?[BR](to ze je to cesko anglicky radeji ani nezminuju) [BR]efektu teda muze byt spusteno soucasne vice, pokud se loterii zadari? ted mi napriklad skocili 3 efekty najednou ...[BR]Proc si nemuzu lektvar umichat a vypit az bude treba ale efekt se spousti okamzite [smilie--sprite3] ano ted mam cas to michat tak si to pripravim, ale vzhledem k delce efektu by se mi hodili \"rano/pred soubojem/....\" a tam zase nemm cas hodinu zkoumat co a jak jde nakombinovat aby z toho byla sance na \"alespon enco\" [smilie--sprite3]"}, {"136": "úplný random to nie je, záleží na aký bonus cieliš[BR]Spoiler: tabulka[IMG]https://i.ibb.co/km81b5K/https-cz-forum-elvenar-com-index-php-attachments-1673285465370-png-6508.png[/IMG]Spoiler: príkladak skombinuješ 1 a 2 prisadu , najväčšiu šancu máš na mince[BR][IMG]https://i.ibb.co/HFQXSZD/https-cz-forum-elvenar-com-index-php-attachments-1673285637438-png-6509.png[/IMG][BR]zvyšok je už len o hladani vhodnej kombinacie medzi štyrmi surovinami podla toho aky bonus chceš"}, {"17": "Omlouváme se za chybějící české překlady. Bohužel jde o globální chybu hry, která způsobila, že na některých jazykových verzích Elvenaru se místo připraveného překladu zobrazuje pouze anglický originál. Na odstranění chyby již usilovně pracujeme, prosíme vás o trpělivost!"}, {"11": "naskočilo mi na pár hodin navýšení many a semínek, přestože už dneska žádný vybírat nebudu. To se vyplatí."}, {"8": "tak jako minimalne tlacitko  \"chci transformaovat 10M many na carodejne body tam byt mohlo....\" jako chapu ze po 15 minutach klinai to tam bude... ale i tak."}, {"24": "Je dôležité naplánovať si varenie tak, aby z neho prípadné efekty dokázal hráč čo najlepšie využiť. Momentálne sa zameriavam na bojové efekty (konkrétne poškodenie jednotiek z tábora žoldnierov) a preto teraz čakám s varením, kým sa začne turnaj a ja budem pripravený ho ísť odohrať.[BR]Po prvom varení zároveň počítam, že jednotlivé efekty dostatočne vylepším čím sa predĺži aj ich čas, takže v ďalších kolách kotlíka budem mať menšiu časovú tieseň."}, {"11": "tak jasně, člověk s do toho nejdřív musí dostat, zatím je to takový tápání, já např. myslel, že se efekt uloží do inventáře"}, {"22": "Jsem zklamaná, taky jsem myslela, že to bude vyrábět kouzla, která si aktivuji, až bude potřeba"}]