[{"139": "Mě se ten potenciál líbí. Na jaký účinek v %  jste se dostali u lektvaru co chcete vytvořit?  Ja zatím generálova mela 76,6% . Kolik jde udělat maximálně?"}, {"16": "A počítáš úspěšnost anebo % u kostky u efektu, který chceš?[BR]Protože, k čemu je mi vyšší celková úspěšnost, když mi to sníží šanci na efekt, který chci?[BR][IMG]https://i.ibb.co/1J06mgY/https-cz-forum-elvenar-com-index-php-attachments-1673323138149-png-6513.png[/IMG][BR][IMG]https://i.ibb.co/jZNCpd4/https-cz-forum-elvenar-com-index-php-attachments-1673323148248-png-6514.png[/IMG]"}, {"29": "Proč ty čísla tam nejdou zadat ručně, ale musí se klikat?[BR]To rovnou místo \"Kotlík\" pojmenujte \"Klikačka\" [smilie--sprite1]"}, {"140": "Já jsem spokojený, vždy je třeba přemýšlet dopředu, kdy a jak které využít. Např. jsem chtěl manu a živoucí a to mne také padlo a uvařil jsem to těsně před vyzvednutím, následně jsem hodil výrobu na 3 hodiny a šup získal jsem navíc, tak jak jsem potřeboval. Teď v rámci studia jsem hodil do many a živoucího a další týden budu mít šanci na velmi slušné lektvary. Palec nahoru. Navíc měl jsem 3 lektvary které měly nejvyšší úspěšnost na vyrobení,  takže velká spokojenost."}, {"45": "@Lovec Krys, na chaos zoldierov som namiesal najlepsie toto:[BR][IMG]https://i.ibb.co/kKJ4gm5/https-cz-forum-elvenar-com-index-php-attachments-1673350013033-png-6517.png[/IMG][BR]ak by pouzilo aj 150 DIA, tak toto:[BR][IMG]https://i.ibb.co/5LyQV0k/https-cz-forum-elvenar-com-index-php-attachments-1673350070241-png-6518.png[/IMG][BR][BR]...namiesal som aj podobny na chaos priser, ale tento tyzden su tam prisady za DIA..."}, {"136": "kotlík je okrem nedele aktívny celí čas takže ho vlastne môžeš použiť kedy chceš,  akurát nikto nedával pozor alebo nečítal popis že efekt je aktivny hned ako kotlik uvaríš"}, {"20": "Jedna věc, která se mi na kotlíku nelíbí, že v turnaji můžeme získat max. 4 poháry. Přeci jen by se mohlo zohlednit, když hráč hraje turnaj nad 5K, mohl by dostat další pohár.[BR]Je možné se tu dohadovat, která směs je nejlepší, ale je to individuální. Rozhodně nepotřebuji vylepšovat produkci unuria a semínek, ale mám jiné priority. Každý to máme jinak, navíc v průběhu hry se to mění.[BR]Dá se udělat nezávisle jeden kotlík, ale chce to velkou opatrnost při zadávání.[BR]Jak už tu zaznělo, bylo by lepší, kdyby zadáním vzniklo jakési kouzlo, které použijeme později.[BR]Je to zajímavá novinka, ale jak už jsem psala výše, doufám v její následné vylepšování. V tomto stavu se s tím dá žít, ale původně jsem od toho čekala podstatně víc."}, {"141": "Mně se to nelíbí nejradši bych byl aby se to vrátilo do starých kolejí je to nepřehledné bez výdělků snad jen se mi líbí ty ingredience"}, {"142": "Za 5. pohár např. za 5k v turnaji bych se přimlouval také."}, {"143": "Už teď byla hra časově náročná a je tu nový žrout času. Asi to hrát (kotlík) nebudu. Zatím se mi nezdá že by to pro mne mělo nějaký pozitivní efekt. Ale uvidíme, třeba časem svůj názor přehodnotím."}, {"28": "Uvítala bych, kdyby ve studijní fázi byl dostupný přehled surovin, které mám na skladě (mince, zboží, mana...). Nevím, jestli je to na PC, ale v appce jsem to nenašla. Nebo jsem slepá? [smilie--sprite8] Když chci přeměnit na čarodějnické body pouze část, docela špatně se to hlídá..."}, {"144": "Na každém televizním kanálu někdo vaří, úspěšně se sledování vyhýbám a oni mi to nacpou do hry. Ještě že to nemusím používat pro běžné hraní."}, {"16": "@citellus Díky. Teď to vypadá s tou šancí o něco lépe.[BR][BR]ps: Myslím, že tomuhle[BR][IMG]https://i.ibb.co/K9LbwkR/https-cz-forum-elvenar-com-index-php-attachments-1673378199395-png-6519.png[/IMG][BR]se říká genocida."}, {"8": "[smilie--sprite8] a dalsi kapitola zacne za mesic a bude postavena na orcich.... [smilie--sprite8]"}, {"6": "@Lovec Krys, to ti vážně zbylo jen tohle? Co to je za šílenou mezihru?"}, {"16": "Já ty orky obětoval (spolu se spoustou dalších surovin) na tohle:[BR][IMG]https://i.ibb.co/MZLC5tK/https-cz-forum-elvenar-com-index-php-attachments-1673418030885-png-6520.png[/IMG] [BR]A tohle mne to stálo:[BR][IMG]https://i.ibb.co/7G2hhqH/https-cz-forum-elvenar-com-index-php-attachments-1673418191719-png-6521.png[/IMG][BR][BR]@Boobika O to bych se nebál. Se svými 18 zbrojnicemi je zase namnožím.[BR]A jelikož žádné spoilery zatím nejsou, tak tipuji, že máme nejméně 2 měsíce čas (klidně i více)."}, {"3": "Lovec Krys napsal/a:Zobrazit přílohu uživatele 6521Klikněte zde pro zvětšení...tohle jsou tvé náklady nebo sklad ex Post?"}, {"29": "řekl bych, že to jsou náklady na další nákup.[BR] O kousek výše píše, že v orcích měl 21,7M a nyní má 181K[BR][BR]Odstraněna citace. Embla"}, {"4": "Já na betě pravidelně zapomínám vařit, asi tak mě ten kotel baví. Za mě naprosto k ničemu, ty efekty jsou mizerie. Myslím, že třeba @Lovec Krys , těch 22% navíc v turnaji ani nepozná a stálo ho to celý sklad, který jistě na konci výzkumu nebyl malý [smilie--sprite2]"}, {"137": "Momentálně je pro mne Kotlík při přípravě elixírů totálně nepřehledný. Nechám to uležet."}]