[{"6": "Tak jsem si ho taky vyzkoušel.[BR]Jsou to taková binga v bingu s nesrozumitelným výsledkem. Jako snesitelné bingo mi připadá ještě tak džin s bohyní a tajemným objektem navrch.[BR]Možná někdo za čas příjde se smysluplným využitím tohoto kotlíku nebo ho upraví do \"lidštější\" podoby. Do té doby si raději počkám."}, {"16": "@Emhyr var Emreis II Náklady"}, {"6": "Tvůj názor - stálo to za to?[BR]To nemyslím ironicky, ale jako věcný dotaz."}, {"8": "ja to vidim takhle, spotrebujes neco ze zdrou kterych ti lezi nepouzite na skaldu miiliony abys dostal sanci na nejaky bonus. takze pokud se vyzivas v koukani se na to jak ti lezou cisla zdroju, ktere na konci kapitoly nemas k cemu pouzivat tak to za to nestoji [smilie--sprite8][BR]A pokud vis ze za chvili budes mit zdroje zpet (mana seminka urina, orci a vlastne cokoliv) tak proste proc nemit treba 20% do utoku vsech jednotek? nebo dalsich 10-15% do jejich hp [smilie--sprite1] a tech par hodin co bonus bezi na projeti turnaje i veze staci. pro hrace co nejsou na konci to smysl nema, pro ostatni sance na \"neco\" za \"nic\". (ale mohlo to byt zajiamvejsi.)"}, {"6": "Časově omezené výhody jsou zajímavé. Ale od učitého množství nepřehledné. Tudíž vlastně nezajímavé."}, {"15": "No uvidíme, každý začátek je těžký. Zatím  se  v tom moc nevyznám , ale ono se to vyšmoulí . [BR][smilie--sprite6]"}, {"7": "Tak až to zmákneš na modrou, tak sem dej prosím vědět... ...já u toho zatím jen zelenám! [BR][BR]Odstraněna citace. Embla"}, {"137": "Vytvořené recepty se asi nikam do hry neukládají.... nebo jsem si nevšimnul???"}, {"6": "Kotlík mě už definitivně nezajímá. Nasazuju systém mrtvý brouk. Raději se budu, fuj, šťourat v nose. Pak se uvidí.[BR][BR]No, definitivně..."}, {"22": "Zkusila jsem to jednou a to jen kvůli úkolům, co mě do toho nutili. Nezaujalo mě to, takže ho hodlám taky ignorovat. Vůbec tomu nerozumím a hlavně k čemu mi je, že aktivuji nějaké kouzlo na pár hodin, když se mi momentálně nehodí?"}, {"7": "Ale říkám si, že třeba někdo časem napíše skvělý polopatický návod...  [smilie--sprite6][BR][BR]Odstraněna zbytečná citace. Embla"}, {"116": "kotlik asi jednoduchy navod mit nebude jednak je rada moznosti navic kazdy tyden mas jine suroviny za diamanty a pak je tam ta nahodna sance ziskat nejaky efekt[BR]nebo jestli jako jednoduchy navod postaci ve studijni fazi vylepsuj efekty ktere se ti libi a ve fazi vareni sestav suroviny tak aby pozadovane efekty byli v horni casti moznosti a hlavne nezapomen ze po fazi uvareni nasleduje piti takze uvar az budes chtit pit"}, {"142": "Hlavně si je potřeba uvědomit, že po fázi vaření přímo (bezodkladně) navazuje piti lektvaru, takže lektvar je třeba uvařit až bude potřeba jej vypít.[BR][BR]Vyzkouším popohnat produkci orků... bohužel jsem nepřišel na to, jestli je možné ve fázi vaření nějak přikoupit čarodějné body, čímž jsem dost omezený a nikdy se nedostanu na úspěšnost lektvaru blízkou nebo rovnou 100%.[BR]"}, {"8": "kdyby vlastnosti tech bylin byli alespon videt pri mouseover ... a byl videt seznam vlozenych ingredienci... to je fakt opruz[BR][BR]zajimal by me vzorec na prepocet uspesnoti, jak se tam ty procenta prepocitaji pri 2+ bylinkach"}, {"20": "Hráč je nucen naplnit všechny poháry, které jsou na skladě, najednou. To je hodně špatně vymyšleno."}, {"2": "Když jsem ve městě poprvé vařil a dal jsem do kotle jednu manovou ulitu, tak mi naskočila 10% šance na generálovu melu.[BR]ted mám bonusy trochu vylepšené a při jedné utitě mi naskočí generálova mela jen se šancí 5,5%.[BR]Takže čím víc do kotle nasypu zdrojů na vylepšení bonusů, tak si tím snižuji šanci že ten bonus dostanu?[BR][BR]Někde jsem se myslím dozvěděl, že pořadí skládání ingrediencí ovlivnuje výsledek.[BR]Zkusil jsem pár kombinací a výsledek byl stejný.[BR]Mám hledat dál, nebo to tak není?[BR][BR]A na wiki se píše, že když piju lektvar, můžu dostat otázku, jeslti chci tu nebo onu verzi jednoho bonusu.[BR]Jak můžu dostat různou úroveň bonusu na jednu věc.[BR]Když si vylevlím bonus na T1 na 150% a paden mi, tak bych měl dostat kolik jsme si vylevlil, ne?[BR][BR]Není tu nějaký protřelý kuchtič?"}, {"136": "GorGlin napsal/a:\t\t\tA na wiki se píše, že když piju lektvar, můžu dostat otázku, jeslti chci tu nebo onu verzi jednoho bonusu.[BR]Jak můžu dostat různou úroveň bonusu na jednu věc.[BR]Když si vylevlím bonus na T1 na 150% a paden mi, tak bych měl dostat kolik jsme si vylevlil, ne?[BR][BR]Není tu nějaký protřelý kuchtič?\t\tKlikněte zde pro zvětšení...vezmi si ako podklad ten obrázok od mescala [BR]má vylepšenú zvýšenú výrobu orkov,[BR]šanca že pri uvarení získa bonus pre orkov je 45 %,[BR]a ked ho získa tak jeho zvýšena produkcia nebude 35,3 %, ale bude maximálne 82,5% z toho ( podľa úspešnosti)[BR]- lenže nie pri každom pokuse mu dá 82,5%,  môže získať 80%, 75% .. atd[BR][BR]čo sa týka kominácii moje zistenia sú tiež také že nezáleží v akom poradí ich dáš, ale ktoré a koľko"}, {"109": "Tak jsem vyzkoušel kotlík. Naklikal jsem si, aby byla produkce unuria vyšší.[BR]Super to vyšlo, dostal jsem bonus na dva dny zvýšení cca o 82%. Jaké bylo moje překvapení, že nic takového se nerealizovalo. Ve hře je napsáno \"Zvýší veškerou produkci Unuria\", na wiki je napsáno \"Zvýší veškerou produkci Unuria\" a když kliknu na obchodníka, tak z něho vypadne standardní suma. Jediné navýšení je u Boblinovy expresní služby.\"  Pak se ptám k čemu ten kotlík je? a hlavně, jak si mám vykládat ten text na veškerou produkci. Kdybych věděl, že to bude fungovat jenom na Boblina, tak jsme to vůbec nedělal."}, {"145": "Jaký je rozdíl mezi levlem 1 nebo levlem 100? Když mám dejme tomu zvýšení na 50%."}, {"2": "@prchlik [BR]Mě se někdy stává, že když seberu bodovu tak to vypadá normálně, ale když se potom podívám do zásobníku, tak se mi přičetlo i s bonusem.[BR]Zkoušel jsi to?"}]