[{"22": "Vypadá to, že je na ty šance v kotlíku potřeba trojčlenka :-D Moc složité na moje závity mozkové"}, {"2": "@Ezran SVK [BR]Ty motáš spoustu procent do hromady.[BR]82,5% je šance, že jsi dobře uvařil.[BR]Pokud ne, tak je konec a další blbinky budou až přístí týden.[BR]Pokud uvaříš, máš 45% žanci že vyfásneš bonus na orky, to je vrchdáb, který si hodíš tolikrát kolik máš pohárů.[BR]A v tuhle chvíli přichází moment na který se ptám.[BR]padne mi šance u prvního poháru, že dostanu 35,3% na orky a u třetího mi řekne...[BR]co vlastně?[BR]že mi dá 20% protože chce vyzkoušet jeslti umím počítat.[BR]nebo třeba 45% že se dobře vyspal?[BR]co to má znamenat?"}, {"136": "môžme len hádať , ale podla mna to funguje takto :[BR]uvaríš elixír v kotlíku[BR]- vezmeš si čašu, a kedže šanca nie je 100 % tak sa môže stať že nezískaš žiadny bonus, aj viackrát,[BR]- a ked už nejaký náhodou získaš tak maximálne dostanš 0,825 násobok (82,5%) toho čo ti ukazuje v základe, ale nie vždy ti dá maximum[BR][BR]- teraz prečo sa ťa pýta či chceš použiť inú uroven rovnakeho bonusu, podľa mňa to je tým že sa netvárajú všetky pravdepodobnosti naraz, čo znamená že efekt sa generuje po jednom,  a preto nechali možnosť, že ak ti dá druhá čaša lepší efekt rovnakého bonusu ako prvá, tak ho môžeš využiť[BR]-ťažko povedať či sa môže stať že môže mať večší bonus ale kratší čas, a preto ti to nenahradí automaticky, lebo ľudia majú radi keď si môžu vybrať miesto toho aby pc vyberal za nich[BR][BR]- to prečo nemáš vždy maximum toho bonusu, to neviem, mal by sa ozvať niekto kto varil kotlík so 100 % úspešnosťou, či mu uvarilo dvakrát rovnaký bonus s inou veľkosťou efektu"}, {"140": "Ahoj, je zde druhý týden výroby lektvarů a maximální spokojenost, vždy co si namíchám s nejvyšším % šance na uvaření, opět padlo. [BR]Tak jsem si uvařil lektvary a tento týden mne vyšly 4. použil jsem 30k úlomků, vrátily mne 3k. [BR]Lektvary: remeslná standartní zboží 69,9%-7,5h, základní živoucí zboží 130,2%-18:50h, mana 57,2%-28,47h, vzácné živoucí zboží 210,2% na 29,55.[BR]Naprostá spokojenost, ve studiích jsem vylepšoval všechny 4 druhy lektvarů a vyplatilo se."}, {"136": "je vážne škoda že bonus produkcie božskej úrody a unuria sa neaplikuje na trhovisko"}, {"31": "Dle příkladu od Mescala: Mám tomu rozumět, že mám šanci 45% na zvýšení produkce orků a efekt bude minimálně 35,5% navíc (uvedeno v přehledu možných efektů) a maximálně 82,5% navíc (v sekci úšpěšnost)?[BR][BR]Také mohl by někdo potvrdit, co říkal @GorGlin, že šance na získání efektu se snižuje jeho vylepšováním?[BR]\t\t\tKdyž jsem ve městě poprvé vařil a dal jsem do kotle jednu manovou ulitu, tak mi naskočila 10% šance na generálovu melu.[BR]ted mám bonusy trochu vylepšené a při jedné utitě mi naskočí generálova mela jen se šancí 5,5%.[BR]Takže čím víc do kotle nasypu zdrojů na vylepšení bonusů, tak si tím snižuji šanci že ten bonus dostanu?[BR][BR]Někde jsem se myslím dozvěděl, že pořadí skládání ingrediencí ovlivnuje výsledek.[BR]Zkusil jsem pár kombinací a výsledek byl stejný.\t\tKlikněte zde pro zvětšení..."}, {"26": "Za mně je kotlík velké zklamání, ale ještě tomu dám šanci.[BR]Minule jsem připravil generálovu melu, jenže jsem si nevšimnul, že hned po uvaření se aktivuje, čímž jsem ho vlastně vyhodil. Alespoň jsem si tedy ve studovně zlepšil vlastnosti.[BR]Po páteční obnově surovin bohužel generálovu melu nemůžu namíchat, neboť všechny potřebné suroviny jsou za tentokrát za DIA - divná to náhoda..[BR]Ohledně efektů zatím neumím posoudit, první lektvar jsem \"zahodil\" a druhý zatím nevím co namíchat... Generálovu melu zkusím vyzjistit příští týden, jestli mi studium pomohlo k lepším vlastnostem při vaření.[BR]Teď jsem asi hodinu zkoušel míchání a mám pocit že pořadí vložených surovin určitý vliv na výsledek má, ale ještě to musím vyzkoušet až budu mít zase trochu času.[BR][BR]Co by se ale mohlo a mělo změnit - když si připravím přísady na vaření, vyskočím z kuchyně tak po návratu jsou přísady pryč. Čarodějnice by si měla pamatovat co jsem vložil, aby bylo možné si suroviny postupně míchat a v případě potřeby (např. turnaj) jen uvařit a ne míchat celý znovu.."}, {"3": "celé to působí poměrně nedotaženě... to, že efekty na první pohled nic moc se časem dotáhne, ale ta nepřehlednost! Co která surovina dělá, co mám hozené v kotlíku? Proč nemůžu zobrazit obsah kotle a vyhodit jen libovolnou věc? atd. a přitom by to nemělo být nic těžkého... snad brzy"}, {"134": "prchlik napsal/a:\t\t\tTak jsem vyzkoušel kotlík. Naklikal jsem si, aby byla produkce unuria vyšší.[BR]Super to vyšlo, dostal jsem bonus na dva dny zvýšení cca o 82%. Jaké bylo moje překvapení, že nic takového se nerealizovalo. Ve hře je napsáno \"Zvýší veškerou produkci Unuria\", na wiki je napsáno \"Zvýší veškerou produkci Unuria\" a když kliknu na obchodníka, tak z něho vypadne standardní suma. Jediné navýšení je u Boblinovy expresní služby.\"  Pak se ptám k čemu ten kotlík je? a hlavně, jak si mám vykládat ten text na veškerou produkci. Kdybych věděl, že to bude fungovat jenom na Boblina, tak jsme to vůbec nedělal.\t\tKlikněte zde pro zvětšení...Osobně se divím, že se to neřeší více. Informace z wiki jsou naprosto chybné. Nevím jak vy, ale já si pod pojmem \"veškerou\" představím skutečně všechnu, ze všech zdrojů všemi způsoby. Ve skutečnosti ale platí anglický text, který správně popisuje výjimky a zvláštnosti.[BR]Třeba u mincí a kladiv je vcelku pochopitelné, že se ten bonus nevztahuje na požehnání, protože se v popisku mluví o \"produkci\". Ale ignoruje to třeba i setovou produkci, kterou jsem schválně vyzkoušel a ano, nezvýší se. Stejně tak se nezvýší kladiva z věží prosperity.[BR]Semínka mají anglicky uvedena, že se bonus vztahuje pouze na eventové budovy. A pokud platí ten anglický popis (stejně jako u kladiv) tak se bonus aplikuje jen u EVENTOVÝCH budov, ne obchodníka nebo divů. Vzhledem k tomu, že unurium je semenu hodně podobné, předpokládám že je na tom stejně. A fakt, že ten bonus neovlivňuje tržiště, mi přijde jako DOCELA podstatný.[BR]Za tohle nemůžou moderátoři, schválně jsem se kouknul na anglickou wiki a mají tam úplně stejné informace, takže chaos pochází z vyšších míst.[BR]Osobně bych s kotlíkem počkal až bude vyřešen překlad (ano, vím že se na něm pracuje) a budeme mít možnost se nějak konkrétněji dozvědět, který bonus vlastně ovlivňuje co a za jakých podmínek."}, {"8": "hm... tak koukam to jsou vylozene vyhozene \"zdroje\" na bonus pro navyseni produkce unuria a semen..."}, {"136": "- bonus na semena platí aj pre budovu z akademie - Festivalový obchodník - odskúšané,  bohužial na unurium su len eventove budovy aj to od 18 tej kapitoly[BR][BR]- čo sa týka toho ktorá kombinácia ti čo prinesie, vyskúšal som všetky kombinácie až po kombináciu 4-roch surovin,  s počtom 6 kusov pre každu surovinu, a je to 783 kombinácii,  nehovoriac o 5,6,7 ... kusovych kombinaciach to už robiť nebudem( 5 kombinácia s prvou surovinou fixnou je 332 kombinacii)[BR][BR]taktiež tu je další problém, ktorý až tak nevidno a to ten že ten kto má napr 10 kapitol hotových, nemá rovnaké percentá ako ten kto má 15 kapitol hotových,   čo je logické pretože čim viac kapitol hotovych tym viac bonusov dáva jedna prísada,  napriek tomu si myslím že by bolo možné sa podľa tých kombinácii orientovať,   [BR][BR]- lenže by to vyžadovalo jednu vec, vytvoriť nejakú platvormu kde by mohli hráči vkladať kombinácie a aj možnosti ktoré prinesú,,  nie obrázky pretože v nich sa nedá vyhľadávať, ale nejaká tabulka do ktorej vieme vložiť kombináie a potom vnich hľadať, spôsobom že naprikad si označíš že chceš hlavne bonus na orkov tak ti vypíše 10-20 kombinácií pri ktorých máš največšie percento orkov[BR][BR]Prealiena napsal/a:\t\t\tDle příkladu od Mescala: Mám tomu rozumět, že mám šanci 45% na zvýšení produkce orků a efekt bude minimálně 35,5% navíc (uvedeno v přehledu možných efektů) a maximálně 82,5% navíc (v sekci úšpěšnost)?[BR][BR]Také mohl by někdo potvrdit, co říkal @GorGlin, že šance na získání efektu se snižuje jeho vylepšováním?Klikněte zde pro zvětšení...ja mám tento týždeň pre rovnaké kombinácie, rovnaké percentá šance získania efektu, a to som vylepšil všetky efekty o 10  levelov ,[BR]-ale , nespravil som žiadny výskum,[BR]ako som písal vyšie, je treba vziať do úvahy či sa tie percentá nemenia s každým spraveným výskumom, pretože ked ja som minuli tyžden vložil jednu manovu ulitu, mal som 6,7% na ziskanie generalovej mely, rovnako aj tento týždeň,[BR]- môžem skontrolovať ešte ked kupim technologiu v strome ale to bude za 2 týždne,"}, {"16": "@karhol Zkus takovouhle (nebo podobnou) kombinaci:[BR][IMG]https://i.ibb.co/0yrwbZt/https-cz-forum-elvenar-com-index-php-attachments-1673932740927-png-6539.png[/IMG][BR]Bohužel obě hlavní přísady jsou tento týden blokovány, takže to asi o moc výš než kolem 12% na cz1 nevytáhneme."}, {"8": "budou tu asi dobre tipu na recepty [smilie--sprite1] vecer na turnaj umicham neco  takoveho a snad se zadari[BR][IMG]https://i.ibb.co/xDxhQxq/https-cz-forum-elvenar-com-index-php-attachments-1673944127887-png-6540.png[/IMG]"}, {"6": "Tak koukám, že je to jenom pár dní (9. 1.) od spuštění a už je v tom zmatek, jako když blbí volí předsedu.[BR]Asi to nebylo moc dobře vymyšleno, aby to pochopil hned každý, anebo to naopak bylo vymyšleno dobře, aby to každý hned nepochopil.[BR]V každém případě všechna čest těm, kteří se tím snaží prokousat, páč jednomu na bolení hlavy už stačí jenom pročítat, s čím se potýkají.[BR]Největší výzva je to pro ty, co už absolvovali 20. kolo, a v podstatě zatím nemají co dělat. Tam už ovšem za cca měsíc skončím i já. No a jestli nezačne briskně 21. kolo, jako že asi ne, tak se v tom začnu hňácat také.[BR]To bude tedy růžo žůžo![BR]Už se nemůžu dočkat..."}, {"7": "Na hlavu si vem Ibuprofen a[BR]a[BR]sem hoď nějaký polopatický návod, jak postupovat..."}, {"6": "Dočkej času jako Bureš klasu.[BR]Můj zatímní návod?[BR]Zatím to tam naflákákat, jak to vyjde, a souvztažnosti raději nevnímat. Možná to zatím nějak \"zlidští\", páč nejsme, co tu hrajeme, nutně všichni ajnštajni, že? nebo - dosaď si tam, co chceš."}, {"7": "Něco jsem naflákal a jsem pyšný, respektive naparuji se jako Pávek. Uvidíme za týden - po turnaji - zda se ten flákanec podaří lépe!"}, {"6": "Zdrávi došli."}, {"101": "Já to furt nechápu co a proč dělat potřeboval bych to vysvětlit po lopatě..... Jsem nemehlo"}, {"6": "Nejsi nemehlo, také se necítím být nemehlem. Stejně jako ostatní mehla, která jsou na tom stejně, prostě budeme čekat, jak se to vyvrbí nebo případně rovnou jak to vyhnije. Howgh."}]