[{"2": "@zralok73 [BR]Já ti tu můžu popsat co jsem udělal já a co z toho vypadlo.[BR]První týden jsem uvařil jedno ucho a vrhnul se na vylepčování, páč ty efekty na začátku jsou o ničem.[BR]Nejdřív jsem mockrát kliknul na darovat.[BR]Stálo to bambilion všeho možného.[BR]Pentagramy jsem nasypal do jednotlivých bonusů.[BR]To byla taky pekelná klikačka, ten kdo to takhle udělal by to měl klikat sám.[BR]No a včera odpo, než jsem šel klikat jsem naházel 3ks od každé nediamantové surky do kotle, pětrát to do sebe otočil a získal tři bonusy na vojáky jeden na mince a jeden na urinu.[BR]zbylé pentagramy uložil na vylepšení nějakého efektu a bylo.[BR]Jediné co jsem zatím ignoroval je bonus na rasu, jsem na konci výzkumu a tak mi to přišlo jako ještě větší plýtvání než to ostatní.[BR][BR]Jaký to mělo praktický dopad netuším.[BR]Až mi padne bonus na produkci zboží, tam vím kolik mi to běžně dává, ale jeslti jsem ty procenta armádě dostal já nebo soupeř, jeslti náhodou k \"Bonus na produkci unuria\" nezapoměli napsat \"pokud ho budeš sbírat olověnýma hráběma se zlatou násadou a budou tě při tom šmírovat tři elfové v koruně sosny, každý musí mít vlastní, a jeden musí chctít čůrat druhý kýchnout a třetí pšouknout.[BR]V tonhle pořadí jinak to nepla\"[BR] To budou muset vyšpiónit jinčí chachaři."}, {"6": "Úplně jednoduchá otázka @GorGlin : Da se v kotlíku vyrobit něco s trvalou platností? A když ano, tak jak?[BR]Jinak mne to moc nezajímá."}, {"134": "GorGlin napsal/a:\t\t\tTo budou muset vyšpiónit jinčí chachaři.\t\tKlikněte zde pro zvětšení...To není potřeba špiónit, to si jde snadno zjistit. Ve fázi výzkumu najet myší vlevo na příslušný efekt a vyskočí okénko s anglickým textem. Pokud někdo nefandí english, jde to snadno přecvakat do translatoru.[BR]Schoenfeld napsal/a:\t\t\tDa se v kotlíku vyrobit něco s trvalou platností?\t\tKlikněte zde pro zvětšení...Nedá. Od toho je Řemeslná výroba. Kotlík poskytuje dočasné bonusy."}, {"142": "@zralok73 Stránku na wiki o Kotlíku jsi četl? Tam jsou základy vysvětleny celkem dobře.[BR]\t\t\thttps://cz.wiki.elvenar.com/index.php?title=Kotl%C3%ADk\t\t"}, {"2": "@Schoenfeld [BR]Vylepšení efektu je trvalé, ale samotný bonus je vždy dočasný."}, {"137": "Druhý dojem z kotlíku( první byl, že je to potřeba nechat uležet: [smilie--sprite6] ):  - Je to další způsob, jak se zbavit zásob (pokud nějaké jsou) a výhledově získat nějaký bonus z lektvarů, byť časově omezený. Momentálně mám přebytky many a unuria, které by šly do kytek, tak vylepšuju účinky."}, {"146": ".Nemusí to být lehké,ale mělo by to být srozumitelné..Hra-něco pomačkám a pak ani nezjistím co to udělalo,co mi to vzalo a co dalo.Udělala jsem někde chybu? neva poučím se..jenže já vůbec netuším zda a kde jsem chybu udělala a v čem se poučit.Vůbec nevím co s tím,nikdo ve spolku ani na fóru mi do toho vlastně není schopen nějaké světlo vnést,protože sám přesně neví.Ráda bych se na kotlík vykašlala,ale jsou tu zprávy o tom,že to dost dobře nepůjde.Docela by mě zajímalo,zda alespoň ten co to vymyslel,s tím umí a má s tím nějaké výsledky,nebo prostě něco navrhl,dal tam možnosti kombinací a ono si to tak nějak žije svým životem.."}, {"141": "Jaký je max level obchodníkovy základní prosby ?[BR][BR]Abych pravdu řekl už jsem to pochopil a líbí se mi to jen bych ocenil aby bylo vytvořené kouzlo použitelné až ve chvíli kdy se to hodí a ne hned"}, {"31": "Všechny kotlíkové bonusy prý mají max level 100"}, {"2": "to je od nich hezké, ale dát několik milionů pentagramů, které mě budou stát mnohem víc milionů něčeho jiného, za to abych si snížil šanci na získání nějakého bonusu je asi trochu[BR][BR]nedokončím to, stejně by to smazali"}, {"77": "no a nebyl by nějaký dobrý recept? já nacvakala přísady za pentagramy + jednu za 25dia, tak aby to stálo co nejméně pentagramů, a v tomto přadí: 6 x jazyk, 5 x Hořký list, 3 x limetka, 2 x broučí ořech, 1 x noční květ, 1 x (za 25dia) Kosatec a dostala jsem navýšení zdraví pro vojáky ze cvičiště a posílení many, místo které jsem ale chtěla to posílení T2 a k tomu ještě i to navýšení síly pro vojáky ze cvičiště, ale nějak mi to nevyšlo [smilie--sprite3] ..taky jsem nepřišla na to, jak navýšit ten kritický efekt až na 100%, víc jak dát ho na 50% se mi nepodařilo... [IMG]https://i.ibb.co/7Xmtyb3/https-cz-forum-elvenar-com-index-php-attachments-1kotl-k-bonus-cvi-i-t-t2-png-6556.png[/IMG]"}, {"116": "no jo recept ja tam vzdy neco poklikam a porad koukam abych mela co chci nahore, problem je ze se na to neda moc spolehnout a ne kazdy ma dost ulomku na zvyseni kritiku a ano 50% je od sameho zacatku a myslim ze to je zamer ono i tech 50% ... 165k ulomku je fakt ranec to si kazdy hodne rozmysli jestli to tam hodi do jednoho kotliku sice se ti muze neco vratit ale tezko rict kolik[BR]dalsi vec co nechapu ja trebas ze neni dost carodejnickychj ulomku na to by dal clovek plny kotlik a pak varil tim by bylo zaruceno ze kazde napiti aktivuje nejaky efekt, sice se daji kupovat ale az ve fazi po uvareni a piti[BR]pokud nebudu mit aspon vysokou sanci ze napiti za to stoji dia do toho nedam"}, {"77": "mám teď zlatých úlomků mraky, jezdím (a nejen) na ně Věž vcelku pravidelně až nahoru a mám i 2 měsíční knihovny s nekonečnýma svitkama, které je produkují velmi slušně - a když tak můžu ještě nějaké v případě potřeby přistavit -, teď se mi hodí, že ty jejich nastřádané přebytky můžu v Kotlíku uplatnit, jen Kotlík mi víc jak těch 165K vložit nedovolí a tím ten efekt navýšit víc jak na 50% a nic dalšího co by s tím pohlo jsem neobjevila, jedině, že by se objevilo nějaké dodatečně na to třeba kouzlo v události?[BR][BR]předpokládám, že nějaká možnost vyhnat kritický efekt až na 100% existuje, nevíte prosím někdo, jak se to dělá? [smilie--sprite1]"}, {"109": "Pochopit kotlík mi nepřijde až tak složité, ale co mi vadí je, že[BR]1. Bonus na unurium se nevztahuje na tržiště, ačkoliv se píše, že je to na vše. Z toho důvodu jsem natřískal spoustu surovin do tohoto vylepšení. A pokud to je pouze na eventove budovy, tak je to zoufale málo, protože těch na unurium je taky zoufale málo.[BR]2. Musím vychlemtat všechny poháry najednou.[BR]3. Nemohu si pro každý pohár namíchat jiný lektvar."}, {"8": "asi tak, tech zbytecne vyplytvanych surovin na boost uriny me taky stve., ted predpokladam tam bude tenhle \"bonus\" spis prekazet a kazit jina procenta svou vahou"}, {"7": "Jen tak na okraj, kolik \"normálních\" surovin je potřeba na maximální kotlíkový bonus???"}, {"16": "@Waso Hodně. Viz. můj obrázek nákladů po vylepšení Mely žoldnéřů na lv93 na straně 3. Doslova jsou to desítky milionů.[BR]On ani není tak problém vylepšit něco na lv50, ale každých 10 navíc je výrazně nákladnější než předcházejících deset úrovní.[BR]Myslím, že těch 642 000 čarodějných bodů pro vylepšení 93>94 hovoří samo za sebe."}, {"116": "@luterina no musim rict ze me zlata vez a 2 knihovny s par svitkama navic proste nestaci a musim brzdit vyrobu v akademce takze na kotlik mi zbyde max na bete kde ho stejne moc nevyuziju[BR][BR]@Waso tohle by me taky zajimalo kazdopadne uz jsem nainvestovala hodne hodne ale vylepsovala jsem nekolik moznosti s tim ze mam 4x 50lvl[BR]3x 80 a jednou 73[BR][IMG]https://i.ibb.co/Kbr53JT/https-cz-forum-elvenar-com-index-php-attachments-ceny-jpg-6557.jpg[/IMG][BR]a dalsi nakupy uz jsou docela narocne padlo na to asi +-70mil zbozi a pak naky dalsi veci, fakt jsem zvedava jestli si nekdy reknu ze se to fakt vyplatilo"}, {"6": "Čtu pozorně, přemýšlím, něco málo zkusím, vyhodnocuju... Ale fakt pořád nemůžu přijít na to, k čemu pro hráče podstatnému ten kotlík vlastně je."}, {"116": "taky stale ctu a jeste porad nevim jak moc se to vyplati co jsem investovala jsem mela jako navic, proste vyuzijes prebytky, vetsina hracu nejake prebytky ma, ale ta vyuzitelnost asi vrta vice lidem v hlave, proste tomu dam cas no je to slozitejsi jak lecktera nova kapitola"}]