[{"6": "Jediná logická odpověď je zatím ta, že se gamekeepers snaží dát možnost snížit, třeba u mne už děsivou, zásobu surek  T1-T3. Zatím mi to ale nepřipadá nijak smysluplné ani hráčsky přívětivé.[BR]Pokud by tam ovšem byla možnost odloženého využití krátkodobých vylepšení (třeba i s nějakou sankcí za časovou prodlevu), pak by se, myslím, celá situace rozjasnila a rozhodně by to začalo být zajímavější."}, {"2": "K podstatnému tady asi není nikdy nic. Krom Havrana, ale to se znovu nestane.[BR]K podstatnému tu vede vždy asi jen kombinace mnoha věcí.[BR]Když jsem si prohlédl čísla a dvakrát si něco uvařil, tak si o kotlíku myslím toto:[BR]Uvahy o bonusech lvl 100 které se dají věštit, jako že voják dopředu bude mít 25% a bonus na surky trvání 24 hodin, ale proč?[BR]Zatím to vypadá, že vylevlit bonus tak vysoko, je cesta jak ho nikdy nedostat.[BR]Bavme se tedy o všech bonusech na lvl 50 a poslední kapitole, protože nemám křištálovou kouli a rozepisovat víc možností se mi nechce.[BR]V kombinaci, aktivní hráč, každodenní aktivita, řeší všechny 4 nabídky ŘV, 5 pohárů, věž až nahoru a blé, blé, blé...[BR]Takový hráč vyfasuje nějakách cca 7500 pentagramů za které možná něco.[BR]Je to dost na uvaření lektvaru na 100%, ale to je jediná jistota, o ty pentagramy přijdeš.[BR]Pak něco uvaříš, 5x to vypiješ, možná dostaneš 5 bonusů.[BR]Na lvl 50 to stálo mrtě a sem tam ti padne bonus, který ti je může vrátit.[BR]Ale, všechno vaříš najednou, nastavení bonusů je náhodné, takže nějaké plánování, muhehe.[BR]Nasypal jsem do toho miliony, když budu aktivně klikat a každý týden uvařím, tak to za pár let dostanu zpět.[BR]Suroviny, zásoby, peníze, tam to celkem funguje.[BR]Urinu?[BR]No, to je jiná, ale co chceš, dyk by se ti to rozpadlo, takže vlastně není co ti vracet.[BR][BR]Vojáci?[BR]Máš 30% dozadu z kláštera 50% dopředu z Havrana, k tomu řekněme 2x+50% dopředu pro máky a luky a +50% dozadu pro všechny ze stromů, nebo zbrojíře.[BR]To si aktivní hráč může jednou týdně dovolit.[BR]Když má voják 80% bonus dozadu, tak dělších 10% je hezkých, ale že bych se z toho...[BR]Pokud to vezmu do extremu, pes, který má jen 50% dopředu z havrana a já mu přidám 25% navíc, wow.[BR]Ale šance že se to stane?[BR]Meh[BR]Šance že se to stane když to zrovna potřebuju?[BR]Meh, meh[BR][BR]Jako, mám z toho, tak nějak, balanční pocit, jako že jak rosteš, tak ti klesají šance, ale zvedá se bonus.[BR]Jak ti roste počet pentagramů, tak můžeš do receptu nasypat víc věcí a tím si udržet šanci, kterou jsi měl dřív, jen to je ted dražší.[BR][BR]Ale celkově?[BR]Narval jsem do toho miliony surovin a když to budu pečlivě každý týden používat, možná je za pár let dostanu zpět."}, {"26": "Drobný postřeh k míchání lektvarů:[BR]a) pořadí přidávání přísad do kotlíku nemá vliv na výsledné hodnoty bonusů lektvaru[BR]b) pořadí přidávání přísad do kotlíku má významný vliv na spotřebu čarodějnických bodů - stejný lektvar jsem nakombinoval za 5900bodů, ale také za 8100bodů"}, {"6": "Věru, neradostné to čtení..."}, {"2": "Souhlasím, že pořadí neovlivnuje efekt ale cenu.[BR]Můj postřeh je, pokud dávám ruzné počty různých ingrediencí.[BR]První dám všechny nejčetnější,  třeba 6, pak všechny co dávám 4 , 3  a 1.[BR]rozdíl v pentagramech je značný.[BR][BR]Ani ne, neradostné.[BR]Naopak.[BR]Nemusíš to řešit když čas nemáš a když ano, tak se pobavíš.[BR]Skládání receptu ja fakt mazec, budeš do toho čučet hodiny než najdeš kombinaci co ti dá aspoň 40%, takže méně jež půlku, šanci na to co cheš.[BR][BR]Možná je to příprava na příští kapitolu, bude tam div, ktery s těmi procenty zahýbá.[BR]To by bylo pro nováčky jistě motivující.[BR]Máme tu funkci na kterou se budeš tři roky připravovat, ale potom...[BR]Bude furt na nic, ale děláme to abychom udrželi rovnováhu, tak jistě chápeš."}, {"77": "taky souhlasím, že pořadí receptů ovlivňuje jen cenu lektvaru a nejméně to stojí, když to tam nasázím od toho co je tam nejvíckrát, postupně až po ty, co jsou tam nejmíňkrát[BR][BR]no a nevíte náhodou někdo, jak ten kritický efekt vyhnat z těch 50% až na 100%? [smilie--sprite8]"}, {"26": "Myslím že není možné šanci zvýšit na víc než 50%, protože když to nejde za reálné peníze (DIA), nemůže to jít ani jiným způsobem ze hry..[BR][BR]A ještě se mi s kotlíkem objevila krátká nepovinná úkolová řada, která se dala splnit prakticky automaticky. Odměny úlomky a myslím že i pár činidel.."}, {"124": "hmm přemýšlím jestli má vůbec do toho cpát surky Těch se celkem obstojně zbavím v turnaji[smilie--sprite1])"}, {"2": "Někdo mi poraďte jak to děláte z úlomky kouzel že je můžete sypat do kotlíku.[BR]Občas jsem při DS delal vylomeniny, ale jinak zadávám výrobu jen na pár veci a spořádaně čekám na automatické obměny receptu.[BR]Všechny neuzitecne budovy mám rozčarované.[BR]To máte všichni armádu knihoven?"}, {"16": "Ono je to přejde, až jim ty úlomky kouzel dojdou. To si snad dlouhodobě nemohou dovolit ani hráči s 15 knihovnami (a těch moc není)."}, {"129": "Na Arendylle sem to začal hrát dávno mam 1,7 Mega ulomku (10 komplet knihoven), na Winyandore sem to začal hrát ,když už pricházela zmena a ve veži se knihovny nedali nahrát ,jenom jeden set mám komplet na W.[BR]Tam mám ulomku od veže do dalši veže, zásoby ulomku žádne, protože v řemeselné se pořád da neco zajimavého nahrát.[BR]I kyž mám na Arendylle takovou zásobu ulomku z poučení na Winyandore je nikam necpu a sem rád , že je mám na Aren.[BR]Proto do kotlíka žádne ulomky nedávam, maj pro mne vetši cenu a recepty v remeselné, než tunit a vylepšovat neaký dočasný efekt neakého efektu, který mi hra ješte k tomu náhodne prideli .[BR]Proto Gorgline jestli novší hrači Elvenaru sypou ulomky do kotlika , tak to nechapu ....Nemužou je mít dostatek a to delám vež pravidelne už dlouho na oboch svetech až nahoru.To porovnani hraní z obou svetu mám z vlastní skušenosti , proto vím jak si hrou procházej a jakými uskalími  jedou nový i starý hráči.[BR]Možna za čas budou tady na fore požadavky na budovy ,které práve ulomky dávaj, protože tech maj dostatek jenom Dinosaury Elvenaru , aktívni hráč který nehraje Elvenar zas tak dlouho je proste nemuže mít, jedine, že by nejel řemeselnou vyrobu pravidelne a jenom občas by v ni neco zadal."}, {"26": "Já mám jednu knihovnu, věž jezdím pravidelně až na vrchol a stav úlomků se mi pohybuje mezi 360 a 390K. [BR]Starší a nepotřebné budovy mi zatím hnijí v adresáři, rozčaruju víceméně jen při úkolu z eventu.[BR]V řemeslné vyrábím tři věci: Krmení, stromkové budovy a VB jak přímé, tak prastaré vědomosti.  Občas když není co, udělám si nějaký urychlovač. Odměny netočím (pouze někdy při DS).[BR]Řemeslná jede tak, že v průměru každý den udělám 4 výrobky.."}, {"6": "Jednu knihovnu mám ve skladě a zůstane tam. Je pro mne prostorově a upgradově nezajímavá.[BR]V řemesle jedu v podstatě to, co @karhol. [BR]Úlomky mám tak akorát a nehodlám je zakotlíkovat.[BR]Kolem měsíce mi ještě bude trvat dvacítka, a pak budu do další kapitoly vylepšovat, co se dá.[BR]Stále méně si myslím, že budu mít chuť se trápit s kotlíkem."}, {"7": "POzor: Nové slovo![BR]\"zakotlíkovat\" !!!"}, {"147": "Obávám se, že pokud kotlík zůstane ve stávající implementaci (tedy že za absurdní množství zdrojů a skrz únavné množství rng bude nejlepším možným výsledkem miniaturní bonus na hranici irelevantnosti), tak to docela rychle všichni hráči začnou ignorovat.[BR]Přitom nápad to zajímavý je a úplně snadno by to mohlo fungovat lépe. Například:[BR]- každý pohárek s 1 efektem zvlášť[BR]- možnost si vypít každý pohárek až se to bude hráči hodit (s nějakou formou degradace v čase či omezením trvanlivosti)[BR]- uvědomit si, že pokud lektvar nefunguje na tržiště, tak to působí jako velmi cynický výsměch hráčům, zvlášť když se tvůrci zjevně nechtějí namáhat srozumitelným popisem kdy to funguje a kdy ne"}, {"134": "da040926 napsal/a:\t\t\tObávám se, že pokud kotlík zůstane ve stávající implementaci (tedy že za absurdní množství zdrojů a skrz únavné množství rng bude nejlepším možným výsledkem miniaturní bonus na hranici irelevantnosti), tak to docela rychle všichni hráči začnou ignorovat.\t\tKlikněte zde pro zvětšení...Nezačnou.[BR]Na Betě se Kotlík stal povinným výzkumem a bylo oznámeno že se do budoucna objeví úkoly s ním spojené. Toto bylo později odstraněno, když lidé začali spekulovat o jaké úkoly se jedná (události, sezona snů atd.) a jak to asi bude vypadat.[BR]Ať už to bude jakkoliv, toto je to samé jako se změnou turnajů. Někomu na úspěchu té věci visí prémie, takže se nám to prostě BUDE líbit. [BR]Max se dočkáme poladění procent aby to vypadalo že se jako že naslouchá, ale zásadní koncepční změny nehrozí."}, {"6": "@Waso děkuji za ocenění mé slovotvorby. Jinak slovanské jazyky si v odvozování vyžívají a já také.[BR]@da040926 dobře jsi rozvinul můj návrh o věci, které neznám. Jenom doufám, že si těch připomínek někdo všimne.[BR]@Tydlibum  nezačnou, páč už začali."}, {"22": "Vždycky si na existenci kotlíku vzpomenu, až když všechno poklikám, takže jsou mi ty jejich pidi výhry úplně k prdu. Nemám po ránu čas ani buňky trápit se s kotlíkem a vymýšlet nějaké kombinace, abych teprve potom sklidila město... Teď jsem vyhrála jakýsi bonus zvýšení výroby v manufakturách a ať koukám jak koukám, nepřijde mi, že by vyráběla víc, takže se cítím podvedená [smilie--sprite8]"}, {"3": "Jediné, o co mi jde, je mít alespoň nějaký bonus pro vez a turnaj. Takže pripadne jiné bonusy budou zřejmě pravidelně propadat..."}, {"2": "Kotlíková úkolová řada, ukol odemkni technologie.[BR]Co to je?"}]