[{"124": "@GorGlin klasicky otevřít něco ve výzkumu další pole(technologii) Myslím,že jsem kvůli tomu dodělával meditační kruh i když jsem už dlouho zatím"}, {"20": "Vzhledem k tomu, jak Kotlík vypadá, ho sice občas uvařím, ale nebudu to přehánět. Nacpat do toho mraky zdrojů a pak dostanu zpět výhodu, která mi to nevynahradí? Takže všeho s mírou, vaření bude dietní. Na nějakou super specialitku si počkám, až se Kotlík dočká nějaké inovace. Například, aby se jednotlivé poháry mohly vařit každý zvlášť."}, {"2": "Jestli jsem pochopil správně nápovědu v aplikaci, tak tím myslí získání dalšího bonusů,  ten dostanu za svitek a ten získám při dokončení kapitoly.[BR]Opravdu je tam úkol dokončí kapitolu?"}, {"142": "Můj závěr zkoumání kotlíku tak, jak je aktuálně nastaven.... u kotlíku je špatně nastaven herní princip tak, že je kotlík smysluplně nepoužitelný.[BR]Z  mého pohledu jsou zde dvě zásadní vady funkce:[BR]poháry se nedají pít samostatně, tedy časově odděleněnesmyslně velké množství možností lektvaru, který může v kotlíku uvařen - přes smysluplnou (ne veškerou) snahu navýšit pravděpodobnost požadovaného lektvaru, stále převládá možnost, že v kotlíku vznikne lektvar na něco úplně jiného, pro mě v daný čas absolutně nepoužitelného"}, {"8": "@GorGlin pochopil jsem uplne stejne. pro nove hrace to smysl ma, pro ty na konci vyzkumu ne [smilie--sprite1] a pul roku na doknceni nove kapitoly nebudu [smilie--sprite8]"}, {"6": "Jsem v druhé půlce hudebníků a až na maličkosti mi kotlík není k ničemu. A při následující čekačce na další kapitolu už vůbec netuším, na co ho budu používat."}, {"2": "@Schoenfeld [BR]dej vědet, jeslti ti padne efekt na rasu a ovlivní to písně.[BR]Pokud ne, tak mi to přijde taková Babišovina.[BR]Mám tu věc explicitně pro letité hráče, aby využili své mocné zásoby.[BR]Když pošlou desítky milionů surek, tak mají možnost uvařit lektvar, který jim při pravidelném používání tu investici vrátí za...[BR]roky...[BR]Ale pokud by efekt na rasu opravdu ovlivnovat rasu![BR]Wow, z toho bychom byli v kolenou.[BR]Samo, že dát hráčům možnost vybudovat nějaký bonus a pak ho prostě nezapočítat (zážitky, písně), je to nejnižší co znám.[BR]Ale tady, kdyby dali hráči šanci...[BR]Na těch pár hodin v týdnu.[BR]Že ten bonus vůbec dostane, by mohlo znamenat že lidi budou svá měsat likvidovat a záměrně poškozovat s myšlenkou že získá naprosto unikátní výhodu proti ostatním.[BR]Já věřím, že by se našla skupina, která bo se tím nechala zničit.[BR]Zkuste to podsunout Inno."}, {"142": "Tak mi to nedalo a ještě jsem se šťoural v kotlíku... možná moje postřehy někomu pomůžou, těm ostatním se omlouvám za zbytečný text.[BR]Hodně mi vadí v podstatě náhodné klikání na jednotlivé suroviny a hledání vhodné kombinace... proto jsem si opsal do tabulky všechny přísady i s informacemi o jejich použitelnosti - viz výřez screenshotu SeznamPrisad.png (jen prosím, dejte si pozor, některé údaje nesedí se základním nastavením, protože jsem je již vylepšil).[BR]A pak to již šlo celkem snadno, stačilo zapnout filtr a vybrat si ty správné přísady na ten správný efekt ( viz screenshoty FiltrMelaZoldneru.png FiltrObchodRemeslProsba.png FiltrPovstaniDavu.png) nebo je možné několk efektů vyfiltrovat společně, seřadit je dle jejich efektivity (sloupek Pozice) a pokoušet náhodu (viz screenshot Nasobny3xFiltrObchodProsby.png). [smilie--sprite1]"}, {"136": "elixír na rasu má rovnaký efekt ako - Kvitnúci cech obchodníkov, teda zvyšuje vyrobu rovnakym spôsbom , teda na tych pár hodin je zvýšená výroba všetkého, (som v kap 17 a tam to tak je tak by to tak malo byť aj v 20ke)[BR][BR]len tak ma zaujíma koľko tých čarodejníckych bodov týždenne dostávaju hráči v 20 tej kapitole?? ( v 17 ke mam 4400 aj dačo)[BR][BR]Jasnost napsal/a:\t\t\tVždycky si na existenci kotlíku vzpomenu, až když všechno poklikám, takže jsou mi ty jejich pidi výhry úplně k prdu. Nemám po ránu čas ani buňky trápit se s kotlíkem a vymýšlet nějaké kombinace, abych teprve potom sklidila město... Teď jsem vyhrála jakýsi bonus zvýšení výroby v manufakturách a ať koukám jak koukám, nepřijde mi, že by vyráběla víc, takže se cítím podvedená [smilie--sprite8]Klikněte zde pro zvětšení...noo to nepostrehneš[BR]uvediem príklad,[BR]moje zvitky na lvl 31[BR]bežna vyroba       - 100%  -920[BR]posilnenie relikvii- 700 %- 6440[BR]posilnenie divov-  100%-  920[BR]čo je                                  8280[BR][BR]a ked ktomu pridáš 50% z elixíru = 460  tak  máš 8740, to si skoro nevšimneš"}, {"6": "Když to půjde, do konce měsíce 3x použiju kotlík na pár hodin zvýšení produkce unuria, kterého je značná spotřeba v závěru hudebníků.[BR]Jinak, jak píše @Ezran SVK, ta vylepšeníčka téměř nestojí za povšimnutí."}, {"16": "Ezran SVK napsal/a:\t\t\tlen tak ma zaujíma koľko tých čarodejníckych bodov týždenne dostávaju hráči v 20 tej kapitole?? ( v 17 ke mam 4400 aj dačo)\t\tKlikněte zde pro zvětšení...Přes 7000, ale přesné číslo závisí na počtu diplomů - čím více diplomů, tím více čarodějných bodů - ale tím také více efektů a nižší šance na jeden vybraný efekt.[BR]Takže pro nás, kteří se soustředíme na jeden efekt je to nová motivace, proč vynechávat alespoň jeden nepovinný výzkum v každé nové kapitole (pokud nějaké nepovinné výzkumy má)."}, {"136": "Lovec Krys napsal/a:\t\t\tPřes 7000, ale přesné číslo závisí na počtu diplomů - čím více diplomů, tím více čarodějných bodů - ale tím také více efektů a nižší šance na jeden vybraný efekt.[BR]Takže pro nás, kteří se soustředíme na jeden efekt je to nová motivace, proč vynechávat alespoň jeden nepovinný výzkum v každé nové kapitole (pokud nějaké nepovinné výzkumy má).\t\tKlikněte zde pro zvětšení...neviem či práve diplomy na to majú vpliv lebo som nezmenil počet diplomov, ale rozhodne každá jedná vyskúmaná technológia na to má vpliv lebo niekoľko technologii som už vyskumal a ten počet čaro. bodov sa mi zvýšil o trošku"}, {"7": "jj[BR]ten zapráskaný kotlík má fakt svoje čaro ![BR][smilie--sprite2]"}, {"2": "Já mám 7431 nebo tak nějak ve 20 kapitole se 20 komplet výzkumy.[BR]S tím už se dá něco počít.[BR]Tenhle týden mi to vychází jako bonus na semeno, tak uvidíme."}, {"2": "Včera jsem uklohnil další kolo.[BR]Nasypal jsem do kotle po třech kusech od každé nediamantove ingredience a nechal to na náhodě.[BR]Napadal mi bonus na základní, standartní zboží, manu, peníze a semeno. [BR]Bylo fajn zjištění, že třeba semeno má bonus i z trhu.[BR]Naopak zklamání, že bonus na který se efekt lektvarů nevztahuje není jen věc setů za propojení budov, ale i levlovacich eventovych budov.[BR]Obecně se dá říct že budova vyrábí tu nejméně hodnotnou věc, většinou tedy peníze nebo zásoby, na to lektvar funguje, všechno ostatní je bonus.[BR]Odrb, co?[BR]Jinak už jsem pochopil různé podoby stejného bonusu.[BR]Když mi padne stejný bonus znovu, hra mi ho nabídne slabší, ale na delší dobu.[BR]Takže když se budu snažit najít recept který mi dá co nejvíc toho či onoho zvedám si tím i možnost že dostanu stále tu stejnou věc.[BR]Ale, protože výsledek je o náhodě, spolehnout se na nej nemůžu nikdy."}, {"6": "Na to, aby byl kotlík úspěšný a prospěšný, je příliš komplikovaný, neúplný,  jednoduše nepochopitelný a nedomyšlený. Je přešně takový, jako by žádná hra neměla být."}, {"7": "ano, ano, složitě ANO (!!) , víceméně ano...[BR][BR]Odstraněna zbytečná citace. Embla"}, {"136": "neviem či to niekto postrehol ale na beta.fóre vo vlákne venovanom kotlíku, bol zverejnený Excel súbor, ktorý  vyhľadá kombináciu surovín podľa toho čo kto chce [BR]zadáva sa tam počet čarodejníckych bodov,, počet diplomov, ktoré suroviny su za diamanty a chceš ich vynechať a tiež priradiť prioritu, jednemu alebo viacerym bonusom a podľa toho vyhľadá tu správnu kombináciu[BR][BR]- ešte som to neskúšal  lebo je to na poslednu verziu Excelu a ja mám staršiu a nechcelo sa mi sťahovať add-in[BR][BR]https://beta.forum.elvenar.com/index.php?threads/the-cauldron.18155/post-112433"}, {"22": "Já ten Kotlík asi pořád nechápu. K čemu je to studování účinků? Zvýšila jsem si Melu divokých stvoření na 40 hvězd. Mělo by to zvyšovat sílu jednotek o 12% na 6 hodin, ale to je evidentně jen maximální možnost, co můžu dostat? Umíchala jsem lektvar mely a dostala jsem +9,4% na 4 hodiny 20 minut. Co to je za počty :/"}, {"124": "@Jasnost Podle mne si to hází ty kouzla nebo jak to nazvat jak chce Vylepšení zvýšení toho či onoho je dle mne jen maximum které v tom můžeš dostat řekl bych,že do určité míry v tom také rozhodují ty úlomky kouzel čím jich dáš víc tím větší pravděpodobnost na větší efekt Za mne je zatím celej kotlík jen velká loterie v kterém utápím mrtě surek,kladívek,many,mincí i unury snad z toho jednou něco bude[smilie--sprite1])"}]