[{"8": "pokud chces maximum, musis jeste nasyapt do lektvaru hodne ulomku a doufat [smilie--sprite1] proste loterie"}, {"142": "Kotlík, tak jak je aktuálně nastaven, je jedna velká promrhaná příležitost. Bohužel."}, {"6": "Tak ho jdu po třech týdnech zase zkusit. Stejně není co dělat."}, {"22": "To klikání ve vylepšení účinků je teda pěkně nepraktické. A jak nevidíš, kolik čeho máš, tak i nedomyšlené"}, {"6": "Taky pořádně nevím, čeho jsem vlastně dosáhl. Masarakš."}, {"2": "Tomuhle nerozumím, mě to přijde snadné.[BR]Mám nějaké bonusy.[BR]Podle toho co nahazim do kotlíku vytvořím sérii možných bonusů.[BR]Pak zachresti kostky a já se dozvím jestli se lektvar povedl a jaké bonusy mě oblaží.[BR]Jejich síla a trvání je podle toho kolik jsem si vytunil.[BR]Akurat když mi padne znovu stejný efekt mám možnost si vzít slabší na delší dobu.[BR][BR]Je to tak, nebo jsem zase naivní?"}, {"8": "vetsina resi jen tu cast \"pak zachresti kostky\" tj proc ty kostky tak chresti, kdyz se do toho nasypalo miliony zdroju [smilie--sprite8] a v podstate k nicemu, jen pro posunuti hranice kousek nekam.. a aby efekt misto hodiny trval treba 5. takze nekdy stihnes treba i druhy sber suroviny (ale urcite ne druhy turnaj [smilie--sprite2] nebo proc si silnejsi lektvar nedat ted, a slabsi pri druhem turnaji.. atp same proc a wtf momenty [smilie--sprite8] na druhou stranu, jednorazovy odliv surovin to splnilo, ale tim to skoncilo a dalsi odliv uz nebude."}, {"2": "Kostky protože náhoda"}, {"124": "@GorGlin  celkem bych s tebou i souhlasil s tím co jsi psal o 2komenty vejš a celkem bych i souhlasil,že se to dá ohlídat podle tabulky co ti skáče na pravé straně při mixování kotlíku,ale bohužel nemůžu Tento týden jsem vařil pro zvýšení výroby surovin a bylo mi jedno páč jsem měl sklad total vyprázdněnej Dopadlo to tak že zvýšení výroby jsem měl na 3kotlíkách,posílení zdraví bylo na nepravděpodobných %,že by padlo a stejně se objevilo na 4kotlíku a 5 kotlík byl náhrada za 1kotlík Takže se dá říct ano dá se podle surek co tam házíš to do určité míry ovlivnit,ale stejně podle vojska které tam též padlo je to loterie kdy nevíš co ti padne[smilie--sprite1]"}, {"106": "Kotlík mě zklamal. Navýšil jsem požadované kouzlo na maximum a nakonec byl výsledek úplně jiný než jsem požadoval. Nejsem pro loterie a náhody. Ale alespoň nějaká jistota by zde měla být. Je to plýtvání surovinami a bez efektu. Úplně zbytečná věc, která rujnuje a nepomáhá! Autoři kotlíku to jednoznačně nezvládi :-("}, {"9": "no myslim ze zklamal hodne lidi, ty co od nej nic necekali tak asi ne, ja doufala ze bude aspon castecne uzitecny ale ta nahodna cast z toho dela nebyvalou loterii[BR]doufala jsem ze ho aspon nejak vyuziju ale netusim jak kdyz si da bonus ktery ho napadne a cim dal jsi tim vic bonusu tam muzes mit a tim se opet loterka rozsiruje[BR]ze to ma nahodnou soucast je v poradku i tak myslim ze by to meli prepracovat aby to bylo vyuzitelnejsi a to kolik to chce ulomku ... nikdo nema bezedne zasoby (ja je na to nemam vubec)"}, {"2": "Náhodnou složku beru.[BR]Každý den vyberu odměnu v obchodě a dostanu, něco.[BR]Není toho moc, ale je to za to že jsem se přihlásil, tak nemůžu čekat žádný poklady.[BR]Že budu skládat recepty, nasypu do toho miliony surovin a dostanu bonus na rasu, ve které nejsem a když jo, tak ten bonus záhadně nefunguje.[BR]To je fakt zklamání."}, {"6": "Na kotlík v podstatě kašlu. Raději jdu dělat na zahradu."}, {"7": "Kotlík? Kříšťál plus 96% na víc než 10 hodin.... ...co víc si může mírně pokročilý přát?!!! [smilie--sprite6]"}, {"6": "Tak toho mám 17M ve skladu."}, {"21": "Schoenfeld napsal/a:\t\t\tTak toho mám 17M ve skladu.\t\tKlikněte zde pro zvětšení...Já 25 M není to moje posílena výroba,základní zboží ani nevymenuju na tržišti"}, {"124": "@indian068 tady je někdo pěknej šetřílek [smilie--sprite1] Já když mám něčeho víc než 3M jde to téměř okamžitě ze skladu [smilie--sprite1]"}, {"2": "A kam?"}, {"124": "@GorGlin spousta možností Turnaj,kotlík..."}, {"6": "V Turnaji, ve Věži a v provincii válčím. Jinak by už skoro nebylo proč hrát. A o Kotlíku marno hovořit. [BR]Takže mi sklad bobtná."}]