[{"163": "Naše města navštíví již dnes 29. dubna 2021 nová herní kapitola Týmový duch! Jak se na něj těšíte?[BR][BR]Jako vždy budeme rádi za vaše připomínky a názory, které nám pomáhají hru neustále vylepšovat! Takže vkládejte komentáře a diskutujte!"}, {"16": "Jo, vyloženě se na výměnu radioaktivního (jak jinak nazvat osvícené rozpadající se zboží) zboží těším.[BR]V podstatě jsou u něj 2 možnosti:[BR][BR]1) hráč má někoho s kým může dané zboží směnit:[BR]Pak takové množství 50K rozdělí na 25 nabídek po 2k(lv40 Hl. budova) a tedy při 3 kupcích 9x zadá nabídky, počká až mu je druhý hráč vezme a pak je znovu zadá (asi něco ve stylu, když jsme měli rotační úkoly na dobrodružství a hráč musel projet 20 úkolů 5x aby vysbíral 25 dílen na 5 kovářů).[BR]Taková výměna se stává pouze otravným klikáním.[BR][BR]2) Hráč nemá někoho s kým může dané zboží směnit:[BR]Je odkázán na trh a pokud nenabízí žádané zboží (a nepřijme tak nabídky jiných hráčů), tak musí zadat svoje:[BR]Zadá 3x2000 (úplně na začátku kapitoly s Hl.sídlem 39 to bude 1800) a čeká, zda to někdo vezme.[BR]Pokud nevezme, čeká 6 hodin, než může zadat dalších 3x2000.[BR]Takže se taky může stát, zejména teď na začátku, že těch 50K zboží bude měnit něco přes 2 dny.[BR](ano vím, že hráč může plýtvat urychlovači a diamanty a za dia si najmout 4. a 5. kupce (taky ale jen na 20 dnů))."}, {"2": "Já jsem to studoval a říkám mu neobchodovatelné[BR]Ta námezdní síla na směnu funguje jako pašerák."}, {"31": "Tedy už dříve si tu začínající hráči stěžovali, že jim pokročilí nevracejí sousedskou výpomoc, což bylo vysvětleno tím, že mají upozornění plné obchodů a oznámení o sousedské výpomoci jsou odsunuta na konec a mizí po deseti stránkách. 25 nabídek po 2k znamená čtyři stránky v čudu.[BR]Vnímám to jako znevýhodnění pro začínající hráče. Jakoby nám Inno dávalo najevo, že zabývat se sousedskou mimo společenství už nemá smysl.[BR]Pokud to chtějí udělat takhle, tak by alespoň mohly rozdělit upozornění na obchodní a jiná, jak už tady bylo dříve navrhováno. Do té doby: sbohem sousedé, ráda jsem si s vámi pomáhala."}, {"24": "Som jeden z tých, čo unurov dokončili relatívne rýchlo, takže ak dobre počítam, sú to už 4 mesiace čo sa hrám len s džinmi a knihovnami, teda osvieženie v podobe novej rasy príde určite vhod. Keďže som avšak len prednedávnom umiestnil do mesta nový set dočasných budov, zrejme zvážim využiť rovnakú taktiku ako v minulej kapitole - osadnícke budovy dať namiesto obytných a nejaký čas prežiť v záporných číslach obyvateľstva.."}, {"2": "Ale nesmíš to přehnat aby ti stačila urina"}, {"2": "Kde je ta oznámena kapitola?"}, {"20": "Už jsem to tu psala v jiné sekci: co jsem zatím viděla na betě, tak grafika 18. kapitoly je moc povedená. Je tam hodně změn najednou, vylepšování a změna velikosti všech manufaktur dá zabrat, ale na to už plán mám. Jako při 17. kapitole zvolím střední rychlost. Nebudu teleportovat většinu města, jen něco. Tentokrát se mi velmi líbí i budovy na osadnickou výrobu. Jsem na to zvědavá."}, {"24": "Aktualizácia už prebehla, ale počítam, že kapitola bude spustená samostatne."}, {"20": "Už je to tady  [smilie--sprite2]"}, {"11": "nevíte proč se mi nenabízí rozšíření z provincií? Jsem myslel že další je k dispozici  po odemknutí kapitoly."}, {"2": "protože bylo před týdnem"}, {"11": "jako už před zahájením kapitoly jo?"}, {"129": "Ano"}, {"11": "asi jo, vzpomínám si, že jsem tam nějaký měl, týden by zhruba odpovídal."}, {"2": "to nebyl jéžiši, to innu ujela ruka"}, {"20": "Musím ocenit, že se zahájením 18. kapitoly už jsou také informace na české wiki. Dřív to bývalo u nových kapitol o dost později. Takže díky!"}, {"2": "a podle toho co je na betě mám dojem, že jsme první[BR][BR]jako na celém světě[BR][BR]jen je škoda, že nám nemohli přeložit i nějakou dobrou zprávu[BR][BR]tedy, abych nebyl neuznalý, to posílení kušijníků vypadá celkem dobře[BR]ale já su ušák, takže smůla"}, {"20": "@GorGlin zase proti nám začnou bojovat silnější jednotky, takže nula od nuly pojde  [smilie--sprite2], ale nějak se s tím nakonec popereme."}, {"164": "Ludi napsal/a:\t\t\tMusím ocenit, že se zahájením 18. kapitoly už jsou také informace na české wiki. Dřív to bývalo u nových kapitol o dost později. Takže díky!\t\tKlikněte zde pro zvětšení...Nemůžu s Tebou souhlasit. Nová rasa je na Wiki poslední roky vždycky dříve, než je spuštěna ve hře a převážně ještě dříve, než je na českém fóru oficiální oznámení o nové rase. Vše lze krásně dohledat, viz například 17. kapitola. Ta byla na Wiki o týden dříve, než bylo na fóru oficiální oznámení (oznámení na fóru vs. wiki), 16. kapitola byla na wiki o dva dny dříve, než oznámení na fóru, a tak bych mohl pokračovat..."}]