[{"3": "@Ludi te´d jsi mi komentářem udělala radost. Ambasády mě rozčilovaly a teď stojím před branama obchodníků a vůbec se mi do nich nechce. Navíc mě ještě čeká jeden level manufaktur a tuším cvičiště, nicméně permanentně nemám semena a orky, takže to trvá. Když už pošetřím, sežerou mi to divy (a to nemluvím o výrobě T4-T6, která mi už snad měsíc stojí)... jenže na dřívější vylepšování nebyli lidi. S těma jsem pořád o kapitolu jaksi pozadu a nevím, jak to udělám na konci výzkumu [smilie--sprite8] asi bude třeba pár kouzelných obytek navíc.[BR][BR]takže pokud půjde kapitolu projekt stylem lážo plážo, budu šťastný"}, {"20": "@Emhyr var Emreis II - opravdu není kam spěchat. Při obchodnících jsem rozbombardovala město a nasadila co nejvíc malých lodí, které jsou na výrobu efektivnější než velké. Ze začátku jsem nechtěla, ale nakonec jsem byla netrpělivá a tak obytky šly do skladu. Vylepšování většiny věcí jsem dělala až po skončení výzkumu. Upřímně - skončila jsem se vším zhruba podobně jako ti, kdo nepřeháněli výrobu osadníků, hráli pomaleji, ale stihli vylepšovat manufaktury a pod. Jen jsem byla dlouho otrávená, jak mám město vzhůru nohama.  Prostě je třeba najít nějaký kompromis, aby to všechno nějak fungovalo.[BR]Doporučuji vylepšovat Čmeláka, vyplatí se. Pomůže výrazně při osadnické výrobě a na vyšším lv. je skvělý na doplňování surek přes obchodníka. Teď už se mi vyplatí i první nákup živoucího. Za zlato a kladívka nakoupím všechno kromě toho, na co mám bonus. Po Zlaté propasti je to podle mě nejužitečnější div.[BR][BR]Emhyre, teď koukám, že máš Čmeláka o fous lepšího než já, takže to je v pohodě. V obchodnících je to fakt znát  [smilie--sprite2]. Manufaktur máš opravdu hodně, tak to vylepšování je náročnější."}, {"3": "jo, po zkušenostech z ambasád jsem se do čmeláka pustil všemi prostředky a utratil nasyslené VB instanty. Naštěstí je celkem malý a vylepšování není až tak drahé. Ten obchodník, to je takový drobný bonus k té úspoře osadnických surovin. Nicméně mezi top divy bych ho neřadil. Pro mě jsou topky všechno na lidi a potom konstruktí divy. Ty pomohly opravdu hodně. Hlavně D111. ještě mi chybí poslední level polárky a spolu s D111 na 30. úrovni projedu celý turnaj bez čekání [smilie--sprite1]"}, {"20": "Tak jasně, to jsou všechno skvělé divy. Já připomínám Čmeláka, který je tu občas podceňovaný div a přitom je to velký pomocník, který se vyplatí. Ty nestarší divy jsou nejlepší. Mezi novějšími se dají taky najít slušné věci, ale kde brát pořád místo, a taky divy zhoršují formuli na boj ve věži i turnaji, takže hodně zvažuju, co postavím a co ne. Především vylepšuji to, co už mám. Ale přemýšlím o každém novém lv., jestli se to vyplatí nebo ne. Ale když stojím ve výzkumu nebo dostanu nášup VB z turnaje, tak to použiju, no ne?  [smilie--sprite6][BR]No, ale divy už jsou jiné téma. Prostě v rámci hry nové kapitoly jsem jen opět připomněla význam Čmeláka."}, {"89": "Z trochu jiného soudku - nemáte pocit, že se nějak zastavil trh s osvíceným zbožím? Asi už ti co se do téhle kapitoly pustili mají hlavní část výstavby osadnických budov hotovou a \"cizí\" zboží už tolik nepotřebujou."}, {"20": "@OldMaGorr - je to tak."}, {"89": "@Ludi - opravdu nemilé, ale naštěstí už je u nás ve spolku máme dostatečnou výrobu všech tří druhů osvíceného zboží a tak se dá domluvit. Jenže toho klikání než se přenese potřebné množství, no fuj. Skutečně \"účelně\" ztrávený čas u počítače. Hra by měla lidi podle mé naivní představy i bavit, ale INNO má zřejmě jiný názor."}, {"20": "@OldMaGorr je fakt, že než se vylepší osadníci, je to shánění radioaktivního zboží hodně špatně vymyšleno. Procedit to přes kupce je otřesný. Ale pak už stačí zboží doplňovat jenom trochu a je to v klídku. Jenže v další kapitole bude nový druh zboží a to si podobné obchody nějak nedovedu představit. Kupec po každém vylepšení hl. sídla zdražuje a cedit to po takových troškách je fakt na hlavu. Tohle se vývojářům nepovedlo."}, {"16": "Jo, kdo už vylepšovat nebude - ať už proto, že je má na maximu, anebo proto, že by jinak stejně nevyšel s manou - tak ten už tolik nemění. Až většina z nás kapitolu dokončí, bude to ještě horší. Těžko říci, kolik z nás se nakonec rozhodne svoje T7 manufaktury prostě odteleportovat do inventáře a vytáhnout je až před další kapitolou.[BR]A hráčů, kteří budou kapitolu projíždět průběžně bude méně, než kolik nás hraje nové kapitoly najednou, jak přicházejí."}, {"26": "Taky pozoruju změnu na trhu, už není kritický nedostatek palmiček jako na začátku, začíná být nedostatek hořích bloků, ale minerálů, které bohužel mám jako hlavní je pořád silný nadbytek. Vyměnit minerály za něco jiného je pořád dost složité. Takže teprve zítra vylepším poslední centrum na úroveň 3 a pak už bude pohodička."}, {"5": "Hráči budou muset řešit výměnu přes kupce a čekat nebo utrácet časovače /nebo i dia/..."}, {"26": "Jenže kupec je jen o hodně málo rychlejší než výroba v nebonusové manufaktuře.. [BR]Dokud máš sídlo na 39 kupec zvládne 1800/6hodin, manufaktura bez zvýšené výroby 1760/6hodin.[BR]Ale jak říkám, časem se to srovná, tento problém vyvstává vždy s příchodem nové kapitoly a každý je jednou za tři kapitoly ve výhodě s bonusovou výrobou a 2x v té skupině, která trpí nedostatkem.."}, {"11": "ale sežere to dost unuria."}, {"2": "Dnes jsem na trhu vyměnil 1600 palem za krystaly.[BR]S ohledem na to že jsem už dnes trh kontroloval a nic tam nebylo, tak to musela být cerstva nabídka.[BR]Napadá vás zpusob jak dostat na trh jiné množství než je nastaveno hlavním sídlem?"}, {"26": "Možná neměl hlavní sídlo na lvl. 39 ale jen na 38, pak by těch 1600 bylo nastavené hlavním sídlem, jinak nevím.. [BR][BR]Když mám na skladě méně zboží (např. 1000) než je nastavené jde udělat nabídka přes kupce?  Mám ale pocit že nelze, pokud si pamatuju ze začátku kapitoly.."}, {"89": "@karhol - nikde jsem nenašel . Asi bohužel obchod jen přes kupce a  jen fixní množství podle hl. města lvl 38 - 1600, lvl 39 - 1800,  lvl 40 - 2000.  Vybrat to pak už jde normálně, jen zadat ne a ne."}, {"11": "nějak nechápu co řešíte, však to už se probíralo, že každej lvl sídla přidává 200. A nabídka jinak vytvořit nejde.[BR]No, ale tahle kapitola je na foru hodně slabá, tak zaspon něco [smilie--sprite1]"}, {"16": "@voyager-1 Platí jen do lv41. Dle Karvestovy tabulky vytáhnuté z game files, pokud to mezitím neupravili, je to:[BR]38-1600[BR]39-1800[BR]40-2000[BR]41-2200[BR]42-4600[BR]43-5000[BR]44-8000[BR]45-9000[BR]46-10000[BR]47-11000[BR]48-12000[BR]49-13000[BR]50-15000[BR]Skoky v lv 42 a 44 připadají na kap. 19 a 20 a jejich T8 a T9.[BR][BR][BR]ps: Tahle kapitola mě štve ze dvou důvodů:[BR]1) 2 hodinový strop produkce portálu[BR]2) Kupci a jejich nesmyslné omezení výměny zboží (dá se obejít naprosto magorským klikáním, když s někým vyměňujete 100k zboží po nabídkách o velikosti 2000)"}, {"11": "ted momentálně na W. ani jedna nabídka osvíceného zboží na trhu. To jsem zaregistroval poprvé."}, {"89": "Ani se moc nedivím. My co hrajeme u nás ve spolku tuhle kapitolu jsme se domluvili na tom \"magorském klikání\" - pořád je to rychlejší a operativnější než čekat na kupce."}]