[{"2": "Mě čekají ještě dva týdny a uklidím manufakturu do skladu"}, {"16": "@GorGlin Tak to gratuluji, mě čeká ještě min. 40 dnů (1793 odznaků) při rychlosti 45 odznaků/den (za předpokladu, že se vykašlu na zkoumání divů a budu doufat, že zůstanou nepovinné, jinak 13 dní navrch. Ale asi to risknu)."}, {"20": "@Lovec Krys zbývá mi i s divy 1177 odznaků, ale divy radši vyzkoumám. Odznaky jsou jen z výroby osadníků a tak to nebudu riskovat. V minulé kapitole to chtělo jen unurium, ale teď to je jiné."}, {"11": "aktivoval jsem ted dílny a schází přesně 600 odznaků (divy)[BR]Bude to kapitola na tři měsíce, tak dlouho jsem žádnou nehrál, i lodě jsem měl za dva.[BR]Čmelák chyběl, mohl jsem už skončit před týdnem nebo dřív."}, {"26": "Mně chybí ještě 2200 odznaků do konce."}, {"2": "Do konce rasy mi chybí víc, ale za dva týdny budu mít dost elementalu.[BR]Takže je přestanu vyrábět, uklidím manufakturu na ozářené zboží, zásoba many začne utěšeně růst.[BR]Nějakou dobu pak budu vyrábět jen medajle, ale bez problemu uhlidam 5 produkci za den a nakonec zůstane jen brána, která bude na poslední výzkumy ze zásob dělat odznaky.[BR]Ale to už zase budu mít ve městě místo a přestavba pojede na plné obrátky.[BR]Vytáhnu vsechny dočasně budovy a budu si užívat zaslouženého klidu."}, {"11": "já to hrál tak, že jednou za 3-4 dny nebylo třeba nasadit elementály a místo toho jsem dal pátý kolo výroby. A ušetřený manu jsem použil, ještě pomocí opatství, na zvednutí nějaký budovy nebo spodní výzkum."}, {"20": "Mám po 3 centrech na 3lv. + Čmeláka a navíc jedno centrum na vzduch 1 lv., kde jedu jenom elementy vzduchu, těch potřebuju nejvíc. Výroba jede dobře, Brána jede nonstop kromě noci. Zaměřuji se na užší výběr medailí a odznaků a tím je výroba efektivnější.[BR]Tím, že nemám tak velkou osadnickou výrobu, měla jsem ze začátku i budovy na manu, které teď už nepotřebuji. Mám vylepšené všechny budovy kromě Tábora, na ten právě dokončuji výzkum. Takže sice ještě budu nějaký čas vyrábět odznaky, ale celé město mám kompletně hotové.[BR]Na začátku kapitoly jsem váhala, jestli mám udělat víc místa na osadnickou výrobu, nebo jet středním tempem, postavit toho méně a raději průběžně vylepšovat město. Zvolila jsem druhou možnost, protože mě vadí, když mám ve městě dlouho binec. Prostě mi to tak vyhovuje."}, {"2": "Na vylepšení vsech budov jsem zatím neschratil místo, ani zdroje, něco mám i uklizené.[BR]Finální podobu dostane mesto az zbouram centra[BR]Co šlo, nebo bylo potřeba jsem taky zvednul okamžitě, případně bylo v úkolů, teď zrovna vylepsuju dílny.[BR]Standardně mám jen dvě, protože mi to stačí, ale úkol vyžaduje tři, tak musím jen kvuli úkolu řešit extra dílnu.[BR]Někdy si připadám jak ufon, nikdy nikoho nenapadlo, že by to šlo treba takhle.[BR]Ten brajgl ve meste mi desne pije krev, proto se hrozně těším až se toho zbavim.[BR]Bohužel tentokrat jen částečně, protože zakladni manufaktury se budou další rok nahazovat jinak než magicke"}, {"16": "@GorGlin Vývojáři nedělají úkoly podle toho, jak hráči hrají, ale podle toho, jak si myslí, že by měli hrát (anebo je tam prostě flákají, jak jim to vyjde a co je prostě napadne).[BR]Já jedu s 5 kouzelnými dílnami. A stejně stojím na úkolu na vylepšení 3xT1 32lv - stojí to manu, takže ty se budou vylepšovat poslední (nechce se mi plýtvat kouzly)."}, {"2": "Pokud si to správně pamatuji, tak ten byl hned v začátku, to jsem ještě jel ze zásob.[BR]Teď stojím na produkci elementálů, jakmile se toho zbavim mám po problemu. Mana, semeno, urina, všeho dost na ty jejich vejmysly."}, {"168": "Nová kapitola už nějaký čas běží a tak je možno ji trochu zhodnotit. Vývojáři občas vymyslí něco nového, zajímavého. Tu novou mechaniku s kupci nakonec hodnotím docela kladně. S centrálním zdáváním výrob hráčům je také velmi uleveno. Ale co se týče výzkumu, tak jim kreativita zatím vždy došla. Pokud si hráč dokázal nějakým způsobem ulevit, např. pomocí portálových bonusů, tak jejich působnost upravili tak, že se staly téměř bezcennými. Je jich plný inventář a skoro k ničemu nepomohou. Výzkum urychlit s jejich pomocí nelze.  To samé urychlovače. Těch krátkých, co bys potřeboval je k dispozici maloučko. Kdyby ses do toho pustil/a ve velkém, tak by si s nimi skončil/a ten samý den. Takže jakákoli přípomoc byla účinně potlačena a zůstala pouze bezmezná úmornost. A  nechci slyšet, že je správné, že hra je těžká. Pojem těžká se zásadně liší od pojmu úmorná. Těžká rozhodně není, jenom úmorná !!!!"}, {"20": "@ogog máš pravdu. Na nové kapitole se mi moc líbí grafika, ale to, že portálové bonusy byly v podstatě znehodnoceny, je velká škoda. A přitom ve věži mi jich padá spoustu. Dokonce jsem kvůli tomu Polárního medvěda nechala jen na 9 lv. protože tam produkuje malé kouzlo na kladívka, které je pro mě pořád lepší, než další portálový bonus."}, {"11": "no abyste se nedivili jak dlouho byste ty výrobny bez PB stavěli. Nějak jsem to nepočítal [smilie--sprite1] Navíc několik náměstí zabere další místo.[BR]\" Těch krátkých, co bys potřeboval je k dispozici maloučko \" To je věc názoru a jak u koho. Stále mám k dispozici přes 600 1 hod a kolem 350 2hod. Neslouží mi k tomu abych urychloval jak ... , ale abych dal každý den min. 4 kola výroby. A k urychlování brány."}, {"2": "V minulé rase instanty šetřili manu, teď místo A vlastně i čas, nechci si ani predstavovat jak ty tisíce ksichtu co bylo potřeba na vylepseni budov pomalu skudlim s tech parčíku[BR]Ale to pořád nemění nic na tom, že takhle to ono nastavilo a co se týče ziskani surovin pro výzkum, jsou mi instanty na nic.[BR]Rasa je principem velmi podobná drakům, jen je k tomu přidán dalsi krok, který fikane odpojili od čmeláka."}, {"20": "Jasně, že můžeme být rádi, že PB fungují alespoň na něco a Gorglin má pravdu, že i Čmelák byl ve své funkci tentokrát omezen, i když bez něj si to nedovedu představit. S kapitolou jsem v celku spokojená, ale tyhle dvě věci, tedy omezení funkce PB i Čmeláka je prostě fakt a v takové míře to ještě nebylo."}, {"11": "Já budu muset nakonec toho čmeláka taky postavit, kdoví co bude příště, [smilie--sprite1]"}, {"44": "tahle rasa skončila po par tydnech , od vylepseni produkcnich budov je to jen tupe 2h klikani a nekonecne cekani . kdo vymyslel ty pocty odznaku je asi pritel S/M salonu . Kdyby aspon daly vyrobu po trech hodinach aby clovek porad nemusel lezt do mesta ale to neeee ."}, {"5": "Rasa minulý víkend hotova, zůstal jen portál na dodělání medailí...o víkendu taky již zbouran... Po dlouhé době jsem plnil i všechny úkoly, pro slušnou odměnu ve formě T6 pokud máte ovšem i potřebný div...začala poklidná přestavba města, postavil jsem i svatyni šampionů na válečné orky, vojsko se vždy hodí a na skladě se může povalovat až do nějakého upotrebeni nebo jeho navýšení levelu a tudíž použitelnosti...na některé střety ať již ve věži nebo turnaji lze použít i pouze tezkoodence již nyní ... PS, urychlovače jsou od toho aby se vhodně používaly a se po stovkách válely ve skladu a v této rase svůj smysl především ty 2hod a 1hod mají právě na sklizeň portálu, aby zde člověk nemusel trávit tolik vzácného času nebo mít v hlavě či narizeneho budíka a 2hod. Všem přeji úspěšné pohodové dokončení a krásný zbytek léta již bez tornád a podobných průšvihů [smilie--sprite1]"}, {"16": "@ElfNostradamus Taky možnost použití urychlovačů (pokud je ovšem hráč nemá rezervované na jiné činnosti, než je urychlování produkce portálu).[BR]Pohodové dokončení by to bylo, kdybych mohl celou osadu osadníků zbourat a doklikat to požehnáními jen s portálem, ale holt budu muset ještě přes měsíc protrpět ty jejich neustálé výlety za dobrodružstvím spotřebovávajících spoustu zdrojů, co by se daly využít mnohem lépe než na zábavu lenivých osadníků."}]