[{"11": "taky hotovo. Bez čmeláka. 3 měsíce klid..."}, {"2": "Gratulace![BR]Jak moc jsi urychloval bránu?[BR]Centra ti vyráběla mnohem víc než dokázala brána spotrebovat, ne?"}, {"16": "Já ještě 1414, takže při cca 45 denně ještě 31 dní. Čmeláka nemám a urychlovat nic nehodlám.[BR]A to do toho nepočítám 600 za divy, protože počítám s tím, že zůstanou nepovinné.[BR]V případě povinosti budu muset před další kapitolou narychlo ještě stavět znovu portál (jejich výrobny odteleportuji) a novou kapitolu začnu se zpožděním."}, {"11": "o tom pochybuju že se ty divy stanou povinnými.[BR]Gorglin, bránu jsem samozřejmě urychloval, ale kolik nevím, nebylo to tak hrozný bez čmeláka.[BR]Zůstalo mi 600 1hod a 330 2hod urychlovačů. Nevím kolik jsem použil. Možná 300-400.[BR]Párkrát jsem urychlil i výrobny pokud by byl problém s čtvrtou sérií"}, {"20": "I já mám hotovo, zbývá jen výzkum divů. No, už jsem splnila všechny úkoly a tak splním i úkol právě na výzkum divů, to už mi nic neudělá, i když nové divy stavět nehodlám. Všechny budovy mám vylepšené, takže v klídku doklikám výzkum na divy, což bude cca 12 dní."}, {"31": "Už se mi u relikvií v hlavním sídle objevil banner další rasy. Za jak dlouho s nimi mám počítat?"}, {"2": "Desis mě.[BR]Já doufám že budu mít aspoň 100 dní klidu.[BR]Relativniho"}, {"8": "me prekvapilo, ze mi to uspesne ukoncilo ukol na zboreni portalu (portal stel stoji a produkuje) a zadnou jiny portal jsem neboril"}, {"16": "@Boobika Viz. aktualizace na v. 135[BR]@Prealiena Kdo ví. Baner znamená, že na tom pracují, ale nikdo z nás neví, kolik toho mají. Snad to ještě potrvá, taky si chci užít pauzu, která mě čeká až za necelý měsíc, kdy dokončím výzkum (bez divů). Navíc kapitolu zatím má hotovou jen malá menšina hráčů v poslední kapitole. A nasbírat tisíce odznaků při maximech kolem 45 denně chvíli trvá (a pro ty, co nemají možnost je každé 2h vybírat klidně i jen 20-25 denně), pokud člověk nezačne plýtvat urychlovači (za předpokladu, že má dostatečnou produkci vstupních surovin na udržení výroby s urychlovači)."}, {"24": "Toto je asi prvýkrát čo dúfam, že sa nová kapitola ešte čo najviac zdrží. Odznakov mi chýba ešte veľa (celé tri posledné stĺpce technológií), keďže som to tentokrát z viacerých (najmä časových) dôvodov poslednú dobu dosť zanedbával. Zesilovačmi zatiaľ nejak nutne plytvať nepotrebujem, ale verím, že do jesene by som mohol byť hotový (a optimisticky zatiaľ nepredpokladám, že by nová kapitola prišla skôr)."}, {"2": "Tak já už taky zboural, přestavba v plném proudu.[BR]Sbohem a díky za ryby."}, {"121": "...tahle kapitola je docela zákeřná v těch dvouhodinových intervalech sběru odznaku a přijde mně dosti nefér si takhle vynucovat aktivitu hráčů...ty dvě hodiny jsou fakt opruz, za mě se tohle fakt moc nepovedlo [smilie--sprite3]"}, {"8": "pro vlastni klid jsem provetral sklady s 1,2 a dokoncei i 5h urychlovaci a poslednich 150 odznaku doslova odpalil [smilie--sprite1] a s radosti zbytky tymoveho ducha zboril abych mohl zase v klidu ve meste \"solovat\" a reorganizovat †"}, {"89": "Pomalu taky končím. Stačily mi 3 náměstí, občas jem si pomohl portálovými požehnáními. Nyní jsem narazil na úkol mít šest (6) náměstí. [BR]Přátelé, mám dotaz na ty kdo se dostali taky až tam - myslíte, že má smysl ty (pro mne už zbytečné) tři náměstí dostavět a úkol splnit, abych v úkolech mohl pokračovat, nebo dál už není nic zajímavého a mám to tak nechat a počkat až to v další kapitole budu moct odmítnout?"}, {"31": "@OldMaGorr Máš tam pak ještě několik úkolů na výrobu urč. množství medailí a elementálů, to už se ti asi nebude chtít plnit.[BR]Ale bacha, pletou se tam i odmítnutelné úkoly za dia, které nejsou ani na seznamu. Nevím, jestli je už máš splněné."}, {"2": "Mezi odmitnutelnymi úkoly jsou dia a jednou i 25 odznaků[BR]Já ty zbylé parčíky postavil a pak zboural všech šest.[BR]Mám tolik portálu, že nevím co s nimi."}, {"89": "Rozumná rada, už jsem to tak dokonce i udělal - tak budu mít trochu víc místa na DS  [smilie--sprite1]"}, {"4": "Ahoj, stačila vám na kapitolu 1 manucha na T7 ?"}, {"2": "Ano, víc jsem si musel hlídat směnu než produkci."}, {"89": "@pavelb - já měl dvě, ale ukázalo se během hry, že jedna by plně stačila. Přesně jak píše @GorGlin - zoufalost je to \"kupčení\". Naštěstí jsme byli ve společenství na to tři a každý měl jiné zboží a tak po troše domluvy to šlo, sice pomalu a otravně, ale šlo. Nemuseli jsme nikdy dlouho čekat na směnu. Jen nechápu kdo vymyslel tenhle opruz, že to chce opakovat a opakovat po cca 2000 kouscíh až jich je dost. Asi INNO doufalo, že si dost nedočkavců koupí ty další kupce za diamanty."}]