[{"20": "Taky jsem měla dvě, ale jedna by bohatě stačila. Navíc pokud je ve městě Elvenarské obchodní centrum, které zesiluje produkční kouzlo, tak jedna manufaktura na osvícené zboží opravdu bohatě stačí. Do další kapitoly postavím už jen jednu novou manufakturu. Ono jde taky o produkci unuria, uživit víc manufaktur nebude snadné."}, {"8": "Uzivit 2 manufaktury jde s klidem ve chvili, kdy mas div a bojujes vezi nebo postavenou dalsi budovu (muzem unuru), proste dalsi zdroj uranu. Kazdoapdne na tuhle kapitolu mi stacila s prehledem jedna. Druha zustala vytazena jen pro navyseni bonusu u tezby uranu.[BR]Nekde jsem tu videl, ze by se mely vyrazne navysit pocty, ktere se daji obchodovat, takze cekam ze se zvysi i pozadavky na mnozsti ozareneho zbozi. A kdyz v kapitole pribyde dalsi uroven zbozi, tak kdo uz ted neuzivi manufaktury dve, verim ze bude mit problem."}, {"2": "Snad se s novým lvl tržiště také zevdne produkce uriny."}, {"20": "@Boobika já měla v 18. kapitole celou dobu 2 manufaktury na osvícené zboží a uživila jsem je v pohodě, ale ve svém předchozím příspěvku jsem psala výhledově o další kapitole. Jak bude manufaktur tohoto typu přibývat, bude to s unuriem opět náročnější. Muzeum stavět nebudu, zatím není potřeba. Jistě, produkce se zvedne díky novým aktualizacím, ale očekávám, že celkové požadavky na unurium i semínka opět porostou."}, {"109": "končím obchodníky a přemýšlím, co bude platit na odznaky. můžete mi dát tip, do čeho se pustit nejdřív a kolik čeho postavit, aby průchod kapitolou byl nebyl úmorný. rád bych to dal tak do 3 měsíců.[BR]děkuji za rady."}, {"2": "Čmelák naplno a minimálně tři budovy od každého elementů."}, {"16": "@prchlik Jestli to chceš dát do 3 měsíců, tak po 3-4 budovách a urychlovat portál.[BR]Bez urychlení portálu s výběrem každé 2h máš šanci to dát za 4 měsíce.[BR]Portál lv4 vyprodukuje 5 odznaků za 2 hodiny. Po 2 hodinách musíš zadat novou výrobu. [BR]Takže buď vybírat a zadávat každé 2h s prodlevou jen během spánku (za předpokladu, že nejsi velký spáč, co spí přes 8 denně) anebo používat urychlovače, ty jsou jediné, které ti mohou průchod kapitolou urychlit."}, {"2": "Neznám tvoje město, ale jestli právě končíš kapitolu, možná by ti pomohlo si dát chvilku a doresit všechno za manu a podobne zdroje, v rase se toho moc neušetří."}, {"109": "@GorGlin a @Lovec Krys díky za rady. Uvidím jak to půjde. Unury jsem dělal cca. 3 měsíce. [BR]Nad tím \"zastavením se na chvíli\" uvažuji, protože zatím jsem spíš tlačil na pilu dostat se co nejdál ve výzkumu. Vypadá to, že jak dokončím poslední produkci perel, tak budu mít chvilku ve městě volno, než se mi otevře další kapitola a budu moct tak se pověnovat budovám, co mám pozadu. Čmeláka bych rád tunil, ale nejsou body do něj. Mám ho zatím na 13, což dává 20% bonus. A další s čím se nyní musím poprat, je že moje město bylo hodně nastaveno na pop/kult budovy a už nyní v unurech to bylo fest cítit."}, {"109": "Tak nyní už je jasné, že 3 měsíce o nebudou....[smilie--sprite1]...budu rád za 4. Ale zase jsem za běhu překopal město a celkově ho zvednul.[BR]Můj dotaz nyní směřuje k tomu, jestli jste někdo vylepšoval centra živlů na úroveň 3 a jestli se to vyplatí. Bránu dimenzí na úroveň 4 beru jako samozřejmost, nyní jsem na 3 a škudlím na 4. Jde mi o to, jestli mám cílit na co nejrychlejší výzkum živlů a následně je zvednout, nebo se za tímto nehonit. Díky za tip"}, {"2": "@prchlik[BR]konkrétní čísla si už nepamatuji, ale v základu jde o to co chceš.[BR]Tři budovy každého typu je základní počet, takže moc velkou nadprodukci mít nebudeš.[BR]Já to všechno zvedl na max a pak vyráběl co to dalo.[BR]Vyráběl jsem víc, než dokázal portál zpracovat, ale na konci rasy jsme prostě shodil rasu krom portálu a poslední odznaky vyráběl za probíhající přestavby."}, {"3": "mám všechny na max - 4 vody a země, 5 ohňů a větru. Víc se mi pohodlně nevešlo a i tak je to náročné na manu... ale docela to odsýpá. Už chybí jen asi 800 odznaků a hotovo"}, {"109": "lze s dostatečně vysokým levelem čmeláka dělat dva odznaky? mám čmeláka lvl.21, doufal jsem, že od tohoto levelu se to zvedne na dva, ale nic. jinak portál je lvl.4. navýšení produkce mi to hlásí 190%."}, {"31": "Taky mám čmeláka lvl. 21 a navýšení produkce portálu je jen 130%"}, {"109": "Prealiena to je součet 60% portál a 30% čmelák"}, {"16": "@prchlik Ne. Produkce je vždy 1 odznak bez ohledu na úroveň Čmeláka (tzn. ani lv 35 ti v této kapitole nepomůže. Ale v té další se zase hodí (dokonce i takový odpůrce čmeláka jako já si jej nejspíše brzo postaví))."}, {"10": "Čmelák lv31 má 202% v portálu, 409% v jednotlivých živlech, což je 41.[BR]kapitolu jedu od 12/10/21 a 4 měsíce nestihnu (všechny elementy po třech kusech) asi o týden až dva.[BR]Posledních 14 dní jsem i něco urychloval, ale pak zas čekám na manu, protože zároveň vylepšuji manufaktury, které jsem předtím pozastavil na lvl29.[BR]Pak zase chybí další věci, chtělo by to 4 elementy, ale zase není dost místa.[BR]Už mi chybí jen nějakých 560 odznaků a to můžeme být rádi, že už nejsou odznaky v prozkoumání divů, jinak bych to lámal další měsíc.[BR]Denně dám tak 40, při urychlování 120 odznaků, moc to neutíká."}, {"11": "ještě lepší je 5 elementů [smilie--sprite1] S čmelákem na 26-30 lvl. se dá kapitola udělat za tři měsíce. A urychlovačů zas nemusí být kvanta."}, {"5": "čmelák hlavně srovná nabídky u obchodníka, které se dají velmi slušně využívat a plnit sklady....!! bonus v portálu je už jen bonusový doplněk..."}, {"16": "@ElfNostradamus No jak pro koho. U mne dává smysl jen ten bonus k osadnické výrobě. V dřívejších 3-měsíčních kapitolách mě to netrápilo, teď převážila potřeba urychlit si pomalý průchod kapitolou.[BR]Obchodníka využívám prakticky jenom když na něj mám v událostech úkol. Za mince nakupuji VBčka a kladiv mám přebytek jenom když okouzlím příliš mnoho dílen."}]