[{"2": "Poznamenal bych, že pro lidi s předstihem byl čmelák výjímečný div při řešení zaváděných nových surovuin.[BR]Živoucí zboží se dá směnovat jednou za den v poměru 1:1[BR]to je proti původnímu pměru 1:5 dechberoucí.[BR]to je v současné době už irelevantví, ale v poslední kapitole proti ustáleným zvyklostem autoři oslabili portál, takže po poklesu vlivu čmeláka příchodem pašeráka jeho důležítot zvedá myšlenka že příště bonus od portálu nemusíme dostat vůbec.[BR]doufejme že vyřazení čmeláka v týmovém duchu nás znovu nepotká"}, {"129": "Ahoj, pročitavam si tuhle kapitolu pozorne ,pretože ju prave hraju.Vim kolik osadnickych budov živlu postavit , ale poprosil bych o radu nenašel sem to .S kolika namestimi uvitani ste tuhle kapitolu prošli , kolik je ich treba  ? Dekuji moc za info"}, {"2": "Postavil jsem jich jen pár.[BR]Na úkoly a do začátku.[BR]Pak jsem všechny bytosti na výrobu i výstavbu kouzlil.[BR]Myslím že jsem jich na začátku postavil asi šest."}, {"16": "@Marian24 To záleží, kolik máš portálových požehnání a zda máš v úmyslu plnit úkoly. Kapitolu je možné projít za pomoci PPček a ignorace úkolů i s 0 náměstími."}, {"10": "pro splnění úkolu je potřeb šest, pak se dají zbořit a používat PB"}, {"129": "Ahoj , [BR]Chci se optat, proč když dam ve stejny čas obchodovat , obchodnici odejdou ve stejny ćas ,ale jejich návrat není v stejny čas ,nektery se vráti, dřiv jinej až ten stanoveny čas, po ktery trva jeho odchod z mího mesta .[BR]Čim to je a co to spusobuje  ?Diky moc ."}, {"11": "když se Ti nějaký vrátí dřív, znamená to že někdo přijal Tvou nabídku. Po 6 hod. je máš opět k dispozici asutomaticky."}, {"2": "@Marian24 [BR]I ty sám když prohlížís nabídky máš některé s cilindrem a jiné bez.[BR]Ty s cílindrem značí obchod ktery právě danému hráči tika.[BR]Když ho přijmeš, zadavatel má okamžitě volného zamestnance."}, {"129": "Ešte jedna otazka ... Mam obchodnikoch na ceste a  na trhu je ponuka osviceneho zboži , ktere chci.[BR][BR]Jakto , že to seberu z trhu i když mam obchodniky na ceste ? [BR]Jak dam ponuku na trh osviceneho zboži ? [BR][BR]Ja takovouto možnost na tržišti  nemam ,tak nerozumim jak tam hrači osvicene zboži zadavaj.Ja mužu jen cez ty obchodniky.[BR]Diky moc"}, {"2": "Ano, brát nabídky ostatních můžeš i když nemáš volného obchodníka.[BR]Na to aby jsi mohl poptávku dát, tak jim musíš zaplatit. Nájem na 20 dní.[BR]Ozářené zboží může dostat na trh jen obchodník.[BR]Když máš dost ochotne kamarády, můžou ti pomocí s příchodem kapitolou, když ti dají nějaké živoucí zboží navic. Myslím že hlavně v elvenarech s tim dost měst bojuje. S ozarenym zbožím to nejde. Jsi v tom sám, i když by ti někdo stokrát chtěl pomoci, tak směnu řídí hra a získat víc nez vyrobis někde."}, {"129": "Tak som povylepšoval manifaktury na začiatku kapitoly a rozestaval osadnikov, zatím to skusím z každého po 3 živloch , až vylepším bránu na 3 level, chcel by som mať z každého 4 až 5 živlov ,záleži ako vyjdem s miestom po vylepšení brany .[BR]Finalny rozmer brány je 7x7.[BR]Musím tu kapitolu okomentovať, pretože mi to nedá, je neskutočné ,ako hráči ,keď prišla táto kapitola do sveta, museli byť omezený na hoříci bloky ktorých treba strašne moc na stavbu osadníkov a k tomu ešte ty kupci po 6 HOD.[BR]Musela to byť krv a pot a naopak hráči, ktorý mali vylepšenie osvícenej na hoříci bloky museli byť na koni a v obrovskej výhode v hre.[BR]Myslím, že by na to vývojari hry mali myslieť ,pretože byť takto eliminovaný ,alebo mať v hre obrovsku výhodu rozdeluje hráčov na dve kategorie zvýhodnený a znevyhodnený ,to mi nepríde teda fér.[BR]Je rozdiel byť znevýhodnený v kapitole, kde je prvý krát živoucí zboží a meniť si ho na volnom trhu ,nedá sa to srovnať s nevyhodnením v tejto pokročilej  kapitole.Takže hrači, čo ste to hrali, keď kapitola vyšla a urputné menili hoříci bloky cez obchodnikov čumim jak ste to dali teda."}, {"16": "Ti znevýhodnění se buď s někým domluvili - pokud měli s kým - anebo používali urychlovače anebo prostě čekali."}, {"2": "Oni na to mysleli, každý potřebuje něco jineho.[BR]Všimni si, že jednu surovinu vyrabis a zbylé dvě nejvíc potřebuješ, takhle to má každý.[BR]V pomstě to je stejné.[BR]Vyrábíme aerosol, takze výrobu zvedám na střídačku voskem a prachem"}, {"11": "No je ale fakt že na A. je 70 stran požadavků na bloky a sehnat je, je problém"}, {"2": "to je ale problém postavený na nerovné produkci[BR]na CZ2 je taky na trhu velká poptávka, ale řada těch poptávek už není aktuální.[BR]i když do hry suroviny nepotřebuji, vyrábím bonusové minerály a každý den beru na trhu několik nabídek[BR]Města nemají důvod ozářené zboží produkovat mimo rasu a tím se nedostatek udržuje i rok po zavedení[BR]můžeme pomoci to řešit když budeme chtít"}, {"11": "to mi je jasný ale přesto je fakt, jak píše i Marian, že někteří hráči mají se sháněním surovin velký problém a někteří co mají ty \"správný\" suroviny jsou vysmátí a nemusejí nic řešit. A nejhorší je to, že to osvícené co bylo problém v minulé kapitole je problém i v téhle. A to už by mohla být i trochu chyba vývojářů."}, {"2": "máš pravdu, pokud to není záměr[BR]pašeráci mi přijdou jako krok k izolacionismu[BR]cech ti nemůže pomoci jako u živoucího zboží, jsme ted mnohem víc odkázáni na sílu vlastního města[BR]S ohledem na pokorčilost hry to ale neberu jako tak hrozné a nelogické[BR]už nemůžeš jen honit body, nebo si ve městě držet staré portály protože jsou hezké[BR]tedy, můžeš, ale zaplatíš za to"}, {"11": "jaký starý portály?[BR][BR]edit: bavili jsme se o bonusovkách, ne o místě ve městě. Já si místo vždycky udělám, u lodí jsem velkou část města vyházel, i ted mám 19. líhní. Nebo jsem Tě nepochopil."}, {"2": "někdo tu kdysi psal, že si nechává ve městě portály ruzných ras, že se mu líbí.[BR]nepíšu o tobě"}, {"16": "Myslím, že jakýkoliv hráč mající ve městě všechny portály se k poslední kapitole ani nepřiblíží (buď to prostě vzdá anebo bude jednu kapitolu projíždět několik let).[BR]Ano, vždy bude nějaké suroviny (ne)dostatek. To by musela být distribuce hráčů v posledních 2 kapitolách rovnoměrná a to nikdy nebude.[BR]Navíc, jak už napsali výše, potřeba T7+ je omezená jen na kapitolu (a to ještě nemusí být na celou).[BR]Já mám například všechny potřebné suroviny na finální vylepšení portálu i všechny líhně na maximum, takže T7 ani T8 už nevyrábím (což asi zabolí všechny, co shánějí cihly, neboť je mám bonusové)."}]