[{"8": "S timhle proste musi pomoct cech, musi v nem byt lidi co maji kapacity vyrabet a smenovat mezi sebou. jen to proste nejde \"darem\" s nerovnym pomerem, ale zakladni surovinu jako takovou si clovek musi vyrobit sam. Na truhu prednostne vybiram poptavky z cechu a kdyz vidim ze schani neco extra, tak klidne smenim svoji surovinu, za to co potrebuji a pak to smenim jim. tohle samozrejmne neplatilo na zacatku kapitoly, tam proste clovek jede a bere co akutbne potrebuje [smilie--sprite1][BR]Co se tyka cihel tak na zacatku kapitoly po tom byla poptavkana taky kolem 60 stranek [smilie--sprite8] ale to mam obecne podezreni ze lidi s konkretnima surovinama jsou ve hre nejdal a pak se timhle sami vyblokuji [smilie--sprite8][BR][BR]Jak zivouci tak osvicene vyrabim v podsate porad i kdyz uz takrka nepotrebuju. vyzkum trva tak dlouho ze tech par dni pred dokoncenim se stihne s klidem natezit. A hlavne proto, abych si udrzoval nejake sklady jak surovin na vymenu v cechu, tak seminek/uranu na vylepseni budov."}, {"109": "Trh s těmito surovinami je na cz2 zhroucený. Když jsem tuto kapitolu začal, tak šla směna v pohodě. Dá se říct, že na vše byl nějaký kšeft. Nyní všichni chtějí hořící bloky a nikdo to nebere. Já dělám výhonky učení a v cechu jsme dva v této kapitole. Bohužel můj cechař dělá to samé a potřebuje to samé. Takže čekám 6 hodin než mohu nahodit znovu. Tohle je fakt na palici a ne na hraní.[BR][BR]Naprosto mě to zastavilo v posunu v kapitole."}, {"129": "Ja mam obrovske štesti , že od nas máme velitela , ktory ma zvýšenu na hořici bloky a je už v poslednej kapitole.[BR]Som sa teda dosť hodne posunul po jeho smenovani s výstavbou osadníkoch, inak som na tom bol teda hodne mizerne.[BR]Ten trh na hořici bloky je na Arendylle uplne ale uplne mrtvy .[BR][BR]Pozeral som , čo potrebuju osadnici na vylepšenie na level 2 a čuduj sa svete ZASAAAA BLOOKY cca 20 000 na 2 level [smilie--sprite8][smilie--sprite8][smilie--sprite8][smilie--sprite8]"}, {"2": "U nás jsme na konci výzkumu tři, bohužel dva máme identické bonusy.[BR]Začátky jsou tedy závislé na situaci ve světě.[BR]Naštěstí je v tomhle počtu větsi aktivita na trhu a při vzájemné spolupráci je šance z trhu dostat aspoň to málo co tam je.[BR]V poslední kapitole mi pomohlo že znam hráče který byl ve vývoji zamnou a měl přesně ten chybějící bonus a na trhu mi pomohl.[BR]Za pár měsíců nás čeká T9, už teď jsem z toho celý nakřivo."}, {"3": "Ono se to časem uklidní. Kdo si pamatujete, jak se naříkalo, že není platina..."}, {"28": "U nás je platina pořád nedostatkové zboží [smilie--sprite8] Sice už to není až tak katastrofické, ale pořád se shání nejhůř... Každopádně výhoda kupce je v tom, že je možné použít urychlovače, takže člověk není čistě jenom závislý na ostatních [smilie--sprite1]"}, {"2": "Stačí kouknout na trh a hned vidíš čeho je nedostatek[BR]Držím si zásobu 500-600 k, až postavím div na podporu tak to trochu stoupne[BR]Uvidíme kolik to bude v poměru k požadavkům."}, {"129": "Ahoj ,[BR][BR]Chci se optat .... Jedu z požehnani takže namesti uvitani vubec nestavim. A ma otazka je .[BR]Když takhle jedu je zbytečne vylepšovat živli na 3 uroven a branu na max ?[BR]Ostava mi poslednych 9 vyzkumu a moc se mi do toho vylepšovani teda nechce .[BR]Mam živli na 2 druhem levlu z každeho po 4 kusy a branu na 3 levlu[BR]Jakej mate nazor co ste si tou kapitolou prošli ? Diky za info"}, {"31": "Obecně co pozoruji, tak ta poslední hrstka výzkumů bývá nejnáročnější, každý posun trvá dvakrát i více tak dlouho, jako předchozí sloupce. Takže, pokud mám možnost, vždy vylepšuji, alespoň ten portál."}, {"11": "t. duch je dost zdlouhavá kapitola a musíš vědět sám jestli ji chceš hrát  půl roku nebo ne. Neznám nikoho kdo by živly nenavýšil, zahrát se to dá samozřejmě i bez toho."}, {"129": "No ,hraje se mi dobře tahle kapitola ,hraju ji od ledna a mam pred sebou jak sem psal poslednich 9 vyzkumu .[BR]Pro mne neporovnatelne s Obchodnikama z Unuru tych sem hral strašne dlouho .[BR]Ta ma otazka smerovala spiš na to ,že brana a jeji vylepšeni zvyšuje počet vyrobenych obyvatel v namesti uvitani a te ja nestavim .Jedu z požehnani .Jestli to tak skutečne je , tak tohle predse nema vubec vliv na to jestli budu hrat tu kapitolu pul roku nebo ne .[BR]Proto ma otazka jestli vylepšeni brany na full level neni zbytečne ? Brana pořad jestli se nepletu vyrabi jenom po jednom odznaku. [BR]Neni sem si jist jestli full level brany nema zas neaky vliv na vyzkum nebo neco jinyho ješte , proto se ptam .A živli mam navyšene na 2 levly a po štyrech živlech  z každeho."}, {"6": "Ten Týmoduch mi jaksi výchází podezřele pohodový oproti Unurům. Nebo  se pletu a je tu zase nějaká minela?"}, {"16": "@Schoenfeld Největší brzdou je portál - jeho vylepšení nezvyšuje jeho produkci, pouze zkracuje čas.[BR]Takže na lv4 trvá produkce 5 odznaků 2 hodiny - pak už se stačí jenom kouknout, kolik odznaků technologie ke konci stojí.[BR]A pokud nehodláš používat 2h urychlovače po stovkách/tisících, tak tě bude brzdit právě toto bez ohledu na to, kolik osadnických výroben si ve městě postavíš."}, {"129": "Jo Tymovej duch je pohoda oproti Obchodnikom z Unuru , ze začatku kapitoly kym postaviš živli a vylepšiš , bude to chcieť Unurium na vyrobu osviceneho zboži z ktoreho budeš stavat živly, až si je postaviš a vylepšiš  na full (mal som od každeho 4 živly) pak ti na vyrobu unuria postači Goblin a tržište som mal pak prepnute celu kapitolu na semena.Mne sa hral Tymovy duch hodne dobre a graficky sa mi ta kapitola aj hodne pačila.Jak si psal v Obchodnikoch si vyberal osadnikov čo 15 minut tak si myslim že z 2 hodinovou produkciou portalu v Tymovom Duchu nebudeš mať žadny problem.A odpoveď na Tvoju otazku , ne v Tymovom duchu neni žadna minela ....Mnej se a myslim že do 4 mesiacov to daš mozna dřiv .(doporučujem aspoň 4 živly z každeho ) Posledne 3 stlpce vyzkumu použi urychlovače na portalovu vyrobu.Tie posledne vyzkumy su vopruz množstvom odznakov.. Jo a ešte jedna vec nestaval som namestia , celu kapitolu som šel z požehnani zbytečne pro toho stavať namestia ,kto neplni ukoly a ja ich neplnim su len prekažkou pri prechadzani tych poslednych kapitol."}, {"16": "@Marian24 Já jsem na cz1 (a na betě) na konci výzkumu, takže s týmovým duchem mám zkušenosti z první ruky více než jednou.[BR]To, že já se můžu logovat co 2 hodiny (teda kromě noci, kdy spím) nic nemění na tom, že by bylo mnohem rozumnější zvýšit s úrovní portálu produkci, namísto zkracování času, ani na tom, že právě portál je největší brzda překonatelná pouze častým logováním a/nebo urychlovači (ne každý může nebo chce používat urychlovače právě na toto).[BR]Počkej na poslední výzkumy Pomsty vyhnanců, to je ještě větší(delší) lahůdka (i s velkým množstvím líhní se to dost táhne)."}, {"6": "Dvouhodinový klik je oproti patnáctiminutovému nehorázný luxus. takže to nebudu hrotit. 4 měsíce jsou pro mne stačák. Když to bude dřív, taky dobře."}, {"11": "Týmový duch byla kapitola kterou jsem hrál nejdéle ze všech kapitol. 3 měsíce a měl jsem po pěti výroben. Lodě jsem dal o tři týdny rychleji."}, {"129": "Ono každy hrač hraje inak ....Keď poviem že Tymovy duch je pohoda nemusi platit pre každeho ,všetko je individualne , je to hra  .Ja dal Tymoveho Ducha za 4 mesiace a mal som tam pauzu asi 2 tyždne .[BR]Vidiš z Obchodnikoch z Unuru som bol važne zufali a ty mi trvali okolo 6 mesiacov ( poniektori z Vas to tu zmastili za 3 mesiace  ) a to keby mi neporadil Lovec Krys tu na fore tak bych tam bol ješte dele.[BR][BR]S tym štylom ako hraje Schoenfeld si myslim  , že si na Tymovom Duchu zmlsne ako s malinou a moj odhad je, že to da pod 4 mesiace .[BR]Pači sa mi jeho agresivny štyl hry a rychlosť.[BR][BR]Lovec Krys - Jo už skumam lihne ....[smilie--sprite8][smilie--sprite8][smilie--sprite8][smilie--sprite8] rozhodne to bude drina aktualne posledna kapitola a pod 4 mesiace to nedam ako Tymoveho Ducha brzdi ma hrozne Unurium[smilie--sprite8][smilie--sprite8][smilie--sprite8][smilie--sprite8] zatím teda iba unurium, myslim, že ešte neake dalši brzdy pridou,19 lihni do mesta dam len zatim neviem ,ako to bude s vyrobou , či je uživim atd ešte jen delam vyzkum lihni"}, {"2": "Když jsem končil obchodníky, tak jsem měl nataženého budíka a klikal šmelinu po 15ti minutách.[BR]Ale jak sjet rychleji ducha?[BR]asi by to šlo narvat hromadou urychlovačů nebo diamantů."}, {"129": "Tak časovačov padlo hodne a vela ludi nema normalny pravidelny spanok smenuje denni, poobedni, nočni v praci .[BR]Počas nočnych nebol duvod sa neprihlasovať , ani počas dennich a poobednich[smilie--sprite8][smilie--sprite8][smilie--sprite8][BR]Dia nepadli žadne... večši opruz je teda sa tam prihlasovať čo 15 minut [smilie--sprite8][smilie--sprite8][smilie--sprite8] to už ja považujem za otroctvo hry a ne zabavu , to je mimo mne a zabavy a i proto jeden z mojich duvodu odporu ku kapitole   Obchodnici z Unuru včetne grafiky a inych veci ......"}]