[{"6": "Marian24​Děkuji za pochvalu, ale bez \"krysích\" a dalších rad bych  ještě čučel někde v Čarodracích.[BR]Jinak konec zahálky. Rozkošná šutrová Nessie. Začínám vyrábět osvícené minerály. Už tu je zase ta správná jízda.[BR]Marian24​Mimo zábavu je na této úrovni spíše Turnaj a Věž. Žádná podpora v předchozích kapitolách je docela slušně odrazující.[BR]Jsem počítačový kašpar, takže znovu jet (alespoň částečně) 15 min na jedné z obrazovek mi nevadí. U těch, kdo tuhle možnost nemají, souhlasím s Marianem.[BR][BR]Nuda."}, {"6": "Vyrobil jsem první odznak. Už mi jich zbývá vyrobit \"jenom\" 3389. Kdybych už teď vyráběl na plný plyn ve čtyřech soupravách po 8 šaržích v bráně denně, tak to dělá 85 dní. To je pěkný vopruz. Na Marianovo doporučení si nechám urychlovače na konec, takže to zkrátím asi o cca 1,5 měsíce. I tak to bude asi pěkná soda. Ale 2 hodiny jsou proti minulé čtvrthodině v podstatě v poho. Od čeho je budík v mobilu, že?"}, {"6": "No a jsem u šesti náměstí. Prostě jsem se zařekl, že ty zatracené úkoly projedu jako pendolino Českem. (I když mě napadá, že to asi není ten nejlepší příměr.) [BR]Nechám vyřádit dílny a faktury na začátku ploutvičkové události, odhákuju náměstí (chybí 3), dodělám čtvrtou soupravu center, a pak teprve nastane vážení zase ta správná jízda."}, {"6": "Portál č. 4 bych měl, ale pokrok se táhne jako smrad z výfuku. Centra 4x4 1.-2. úrovně nedodávají ovšem dost matroše a jejich vylepšování jde tak 1-2 denně. [BR]Kdo tohle návrhově zmotal, tak věděl, jak pořádně zkomplikovat hru. Žádné prvoplánové \"hurá na to\", ale pečlivě plánovaný postup."}, {"129": "Koukam na Tve mesto maš to pekne rozjete . Chci se Te optat, nemaš nadbytek many ? Možna kdyby si uklidil do inventare neco z tech manovek a budov na orky človeče tak to odehraš i s 5 až 6 źivlamy od každeho .Ale nemaš kam spechat ,nepotešim Te , hram aktualne posledni kapitolu a tam neexistuje predpoved za jak dlouho se da projit .Jestli nebudeš mit zvyšenu vyrobu horicich bloku a aerosoli (čo ja nemam) tak budeš plne zavisli jenom na kupcech ,čo je muj pripad a povim Ti, že to je desne unavny . Nijak to neovplivniš nejde to ...hrač je tu 100 zavisli na smenovani .Pritem mam vyrobeno po 250 000 osviceneho z T1 i T2  vyhonku a prachu , ale stojim a stojim na kupcech ...Šilene.A to už mam i nasbirane 72 temnych hmot ktere se ziskavaj stavenim a vylepšenim bilych veži na temne a jejich prodavanim .Tehle 72 temnych hmot budeš potrebovat na portal level 4 . Ale nijak se neda pomoct v postupu kapitolou jedine mit 15 kupcu co nejde [smilie--sprite8][smilie--sprite8][smilie--sprite8][smilie--sprite8]:"}, {"28": "Pokud máš zesilovače, můžeš kupce urychlit. To je výhoda oproti živoucímu, kdy to opravdu musel někdo koupit [smilie--sprite1]"}, {"6": "Marian24​Angedev​Nad manovkami jsem taky chvilku přemýšlel, ale kupodivu zatím jsou tak na hraně pohodovosti - neobtěžují. Asi je to kvůli tomu, že mám pořád co  vylepšovat.[BR]To jako nemám  2 h a 1 h vymlátit do mrtě, a naopak si je sakra šetřit?[BR]A co takhle zase vyhodit pár paneláků? A hodit pátou lajnu center. Musím to propočítat.[BR]Systém skřetů stratégů mám pro to, abych měl dost obyč skřetů pro jiné účely. V celém průběhu herní kampaně se mi to osvědčilo."}, {"129": "Angedev -   To by bylo teda časovaču [smilie--sprite8][smilie--sprite8][smilie--sprite8][smilie--sprite8][smilie--sprite8] ne tolik časovaču zdaleka nemam a jedu na 5 kupcu[BR][BR]Schoenfeld - otazka , kolik Ti hodej skřeti strat. za jeden den ze všech domku ? A kolik bych Ti je to hodilo z dvou oken vyroby z  Cvičišťa ? a jakej čas ?[BR]Kdysi sem tyhle domky taky mnel asi sem to jel s 12 tima ,ale pak je dal pryč, až dohraju posledni kapitolu ,nastavam si nove nahrane z akademky  z posledni kapitoly, až bude misto v meste a ukončenej Elvenar."}, {"6": "Konečně jedu do plných 4x4x3.[BR]Omezený jsem zcela jasně tím, že bych musel postavit pátou řadu. Ale to se nevyplatí, protože než bych je vylepšil, sebralo by mi to zdroje pro závěrečnou produkci.[BR]Takhle mám jasno, že to nedodělám dříve než za 35 dní. I kdybych se zbláznil.[BR]Taky dobře.[BR]Prostě pojedu dvouhodinovou pohodu (vzhledem ke čtvrthodinovému děsu v předcházející kapitole) a na noc osmihodinový blok elementů.[BR]Stačák, šmytec, poho."}, {"6": "Po jistých propočtech jsem v mírném zoufalství došel k tomu, že kapitolu zvládnu v intervalu 33,78 až 60,1 dní s přihlédnutím ke zprůměrovaným denním výkonům.[BR]A vyrovnat se s tím můžu pouze cimrmanovským způsobem.[BR]Jsem docela zvědav, jak to nakonec vyjde."}, {"6": "21. srpna, mi píše můj kalkulátor, bych mohl mít šmytec. Kdo ví...[BR][BR]Poslední propočty hovoří o konci v intervalu 16. - 22. srpna v závislosti na mé chuti dodržovat čtyřhodinový interval sklizně center, což se ovšem vážně tříská s tříhodinovou sklizní z faktur. Potřeboval bych asi zavést sytém \"Dr. Jekyll a pan Hyde\"."}, {"6": "Takže, vážení přátelé,[BR]svou misi splním 20. 8. někdy v odpoledních hodinách, což považuji za  svůj malý úspěch, bať jednadvacátý srpen je pro mě trvale černý.[BR]Ještě na začátku měsíce to na něj ukazovalo, takže jsem párkrát porušil spánkový režim, abych se mu vyhnul. [BR]Zatím se daří. Jenom vydržať.[BR]Pamatuju si totiž tank před naší zahradou. S bílým pruhem. S hvězdou, kterou nás učili milovat.[BR]Svinky jsou stejné, i kdyby eóny uběhly.[BR]Právě proto jednadvcátého ne!"}, {"6": "Pořád držím dvacátého, i když den byl krušný."}, {"124": "@Schoenfeld  to jedeš hodně slušně Já jsem teprv u sloupce za 210odznaků Vidím to ještě tak min na měsíc"}, {"3": "Tak to ti vyjde tak akorát [smilie--sprite1]"}, {"6": "Danber7777 pokud máš centra 4x4, tak to můžeš do měsíce stihnout.[BR]Chybí mi 103 odznaků a do zítřka večera to ve zrychleném časováckém režimu v pohodě dám.[BR]Už mě to vůbec nebaví. Je to pořád dokolečka: mentálové - medaile - odznaky."}, {"6": "Tak a je to v háji.[BR]Skrzevá honičku za odznaky jsem si nevšimnul, že vylepšování dvou faktur na hedvábí (potažmo na létající prach) přeskočilo do fáze velkopapkání semen, a tím pádem mi zlikvidovalo jejich velkou zásobu. A teď jen zírám.[BR]Odznaky mám u konce a na svatyni za 120 K semen jich mám jenom něco kolem 15 K. Dodělání tím pádem nejdříve zítra.[BR]Takže se tomu zatracenému datu nevyhnu.[BR]............................................................................................................................... (Pěkně šťavnatá nadávka.)"}, {"8": "tak zase na druhou stranu muzes to zitra na znameni vzdoru neukoncit [smilie--sprite8] a odlozit to na dalsi den [smilie--sprite2]"}, {"124": "@Schoenfeld jjj centra 4x4 z výroby center přes 300odznaků od každého jen portál pracuje pomalu i když je na maxu No snad se zadaří"}, {"6": "Boobika dobrý nápad. Zařídím se podle toho.[BR]Místo vztekání naložím pár švestek."}]