[{"165": "Ahoj. Mám postavenou bránu dimenzí ale nevím jak má vyrábět když nechvi za dia kdo poradí jak dál postupovat Dík."}, {"20": "@krix Dodělat ve výzkumu vylepšení manufaktur, vylepšit tržiště a vyrábět osvícené zboží. Dále vyzkoumat ostatní výrobu osadníků a pak už to pomalu půjde.[BR][BR]@Odin pokud si pamatuji, tak dříve na wiki sice základní informace byla, ale podrobnosti např. kolem manufaktur a pod. se objevovaly postupně. Ale třeba se pletu.[BR]Každopádně díky za to, že jsou tam všechny potřebné informace."}, {"165": "Děkuji."}, {"2": "Tak jsem si poskládal co jsem kde našel, youtube, wiki, beta.[BR]Po grafické stránce jsem nadšený z ukončení podobnosti obytek a hlavního sídla v posledních kapitolách, tohle je pro mě nové a moc pěkné.[BR]Sjednocení vojenských budov se taky povedlo, po zbrojinicích se mi bude stýskat, ale po kasárnách zase vůbec.[BR]Rasa je velká lumpáreň.[BR]Po počátečním utrpení s urinou a pašerákama se zastavím na kapacitě portálu.[BR]Portálové instatnty můžu využít jen jako náhradu parků, ale i kdybych zboural půlku města, tak si tím nepomůžu, protože veškerou produkci musím protlačit přes portál a ten půjde nastavit na dve hodiny.[BR]Na druhou stranu když posatvím tři parky snad půjde každý nastavit na jinou rasu a budu mít pokoj od toho přehazování produkce.[BR]A vypadá to, že v produkci Hub je určitá provázanost, takže pro mě půjde sladit rasu s ostatní produkcí.[BR]Jsem rád že dám hodně na divy, protože dříve zajímaví uskladňovací vír je tentokrát druhej a zase přišel do kurzu čmelák.[BR][BR]GG"}, {"20": "@GorGlin než se proklikáme k samotné výrobě, tak to bude ještě chvíli trvat. A na Čmeláka už dlouho nedám dopustit."}, {"2": "chtělo by to rasové úkoly, ten překlad ze španělštiny co tu byl na obchodníky mě moc pomohl, nevíte někdo o něčem?"}, {"121": "Tak jsem si konečně udělala čas a prostudovala novou kapitolu, myslím, že vývojáři zvolili hodně trefný název kapitoly ,,Týmový duch\"...jestli jsem to dobře pochopila vše je provázané se vším a tentokrát půjde hodně i o spolupráci hráčů ve společenství, takže sólisté a závodníci tentokrát nevystačí jenom sami se sebou [smilie--sprite1]"}, {"2": "Sama to zvládneš bez problémů.[BR]Když budeš mít dva spolupracovníky, každého se surovinou kterou potřebuješ, bude to lehčí.[BR]Ale stejně tak si vystačís s diamanty a urychlovači."}, {"16": "@klapa Jsou i případy, kdy ostatní spoluhráči ve společenství jsou 1 nebo více kapitol pozadu, na betě jsem plně odkázán na trh, jelikož další 4 hráči za mnou jsou uprostřed Unurů, s těmi prostě radioaktivní zboží nevyměním."}, {"121": "...no u nás je v 18 kapitole zatím jen 1/3 společenství a navíc máme dosti nevyvážený poměr výroby toho osvíceného zboží, samé hořící bloky [smilie--sprite1], takže budeme taky odkázáni na trh a jak jsem se tak dívala, tak lukrativní, alespoň ze začátku budou minerály a to nám vyrábí zatím jeden člověk....no bude to zajímavé..."}, {"2": "Jsem na to zvědav.[BR]My máme krystaly, ale chybí nám palmicky.[BR]Uvidíme jak se podaří rozjet výrobu, mě to zabere ještě asi týden, pak se uvidí."}, {"121": "Dost nešťastné je, že nevidím co jsem kupci zadala (už se mi stalo, že jsem hodila špatnou nabídku) a nejde nabídku zrušit [smilie--sprite3]"}, {"16": "@klapa Jelikož výměna surovin probíhá ihned, tak nabídka zpět vzít nelze.[BR]Tzn. Ty zadáš výměnu ingot>výhonky.[BR]Kupec ti dá ihned výhonky a na trhu se objeví nabídka ingot>výhonky."}, {"121": "no to jsem si všimla, ale tak když mně jí dá hned, tak při zrušení nabídky si jí zase může vzít zpět [smilie--sprite1][smilie--sprite1]...no já jen, že jsem se už spletla a pak byla naštvaná no...musím si prostě dávat majzla při zadávání"}, {"165": "mám nedostatek urunia--co musím zvednout abych měl větší produkci? mám jenom 8000 volných obyvatel"}, {"16": "[IMG]https://i.ibb.co/wcwcMNy/https-cz-forum-elvenar-com-index-php-attachments-1620040193341-png-5450.png[/IMG] + [IMG]https://i.ibb.co/GpGb39m/https-cz-forum-elvenar-com-index-php-attachments-1620040221779-png-5451.png[/IMG][BR]Takže mít co nejvíce manufaktur, dílen, zbrojnic a obytek a vybírat co nejčastěji.[BR]Hráči produkující výhradně z eventovek a mající výhradně pop/kult hybridy budou mít produkci unuria nízkou."}, {"20": "Myslím, že vzhledem k produkci unuria a také zvýšené potřebě tohoto produktu v 18. kapitole, nedává tentokrát moc smysl teleportovat obytky atd. z města, kvůli většímu prostoru na výrobu osadníků. Většina hráčů to udělalo v 17. kapitole, tam to pomohlo. V 18. kapitole se to už nevyplatí. Prostě vývojáři nás zase dostali [smilie--sprite2]. Spoléhám na Čmeláka."}, {"17": "Ludi napsal/a:\t\t\tMusím ocenit, že se zahájením 18. kapitoly už jsou také informace na české wiki. Dřív to bývalo u nových kapitol o dost později. Takže díky!\t\tKlikněte zde pro zvětšení...Za naši skvělou Wiki vděčíme našemu úžasnému Ódinovi, který ji pro nás má vždy připravenou již dlouho před tím, než se daná novinka objeví ve hře. Rád bych se tedy ke tvému poděkování přidal, protože o Wiki se nám stará už od doby, co byl český Elvenar spuštěn, takže dle mého si takové poděkování určitě zaslouží. Bez něj bychom tak výbornou Wiki určitě neměli! [smilie--sprite1]"}, {"145": "Úkoly pro novou rasu ( italština )[BR]\t\t\t\t\t\tTeam Spirit - Spirito di Squadra\t\t\t\t\tFan-Blog dei Cavalieri dello Zombiaco, dedicato al gioco Elvenar.  In nessuno modo collegato ad InnoGames Gmbh, proprietaria delle immagini.\t\t\t\t\tcavalieridellozombiaco.blogspot.com\t\t\t\t"}, {"16": "@Ludi Nějaké teleportovat můžeš, ale není nutné zacházet do extrémů jako v minulé kapitole.[BR]Viz. např. rozložení hráče pilousd z bety:[BR][IMG]https://i.ibb.co/RpbHLLg/https-cz-forum-elvenar-com-index-php-attachments-1620099165397-png-5456.png[/IMG]"}]