[{"20": "@Lovec Krys mám podobný plán na 3 kousky od každého elementu. Nějaká kultura na teleport bude stačit."}, {"121": "postavila jsem dle rad od každé výrobny 3 ks a zatím jsem trochu zmatená...je nějaký fígl jak nejlépe vyrábět? [smilie--sprite1]"}, {"2": "Postihuje čmelák produkci odznaků v portálu?[BR]Nebo tam děláme jen jeden?"}, {"121": "odznak 1"}, {"2": "@klapa [BR]Když budeš vyrábět vždy v každé budově něco jiného, tím všeho stejně, v portálu pak dáš od každé z možností jednu."}, {"121": "@GorGlin...no ono to zase tak nevychází v každé něco, nejdříve vyrábíš ten vítr, oheň, vodu a vzduch a pak teprve z toho ty medaile a z těch pak v portrálu ty odznaky a každý odznak je sestaven z různých druhů medailí, které se různě prolínají a zatím mám teda z toho hlavu jako rohovej barák [smilie--sprite8] [smilie--sprite8] [smilie--sprite8]"}, {"2": "Na začátku to tak nevychází, ale až budeš mít dost velký bonus z portálu, tak přes noc dáš 8 hodin a to ti uzivy 3 až 4 kola po 4 hodinách přes den"}, {"20": "Nějak mi to připomíná výrobu u Draků e Elementálů  [smilie--sprite2]"}, {"2": "Jenže u draků jsi vzal studenta a udělal z něj profesora tady vezmeš člověka, elfe nebo elvenar a uděláš z něj odznacek[BR]O plánovaných ztrátách pri výstavbě ani nemluvim"}, {"20": "@GorGlin no to je ten globální pokrok [smilie--sprite8]"}, {"2": "no jasně to jsem onehda počítal.[BR]Na začátku, když jsi postavil manufakturu na ocel, tak tamní zaměstnanci za tři hodiny zvládli vyprodukovat jeden ingont v šesti chlapech.[BR]A po všech těch zlepšovácích jich na lvl 32 potřebuju na stejný ingot 19[BR]prostě paráda"}, {"2": "Děkuji za úkoly nevíte jak ten text z těch stránek dostat?[BR]Co jsem si to pročítal tak dost úkolů je za urunium, což mi pomůže[BR]Ale z komentářů či o tu padli to chápu tak, že produkci v portálu neovlivňuje čmelák ani portál?[BR]Žádný bonus?"}, {"16": "@GorGlin No moje beta stojí na úkolu postav 3 náměstí uvítání, která jsou poměrně drahá a jejichž produkci nahrazují PPčka(jejich jediné využití v této kapitole), takže nemá smysl je stavět jenom kvůli úkolu."}, {"2": "Já je postavím, živoucí zboží mě nijak nepálí, oproti tomu uruniu"}, {"3": "a je třeba mít 3 postavené nebo je možné postavit, zbořit, postavit, zbořit, postavit?"}, {"2": "Nevím, ale po zkušenosti s draky bych si myslel že musí stát najednou."}, {"16": "mít alespoň 12 elementárních center úrovně 3 + přivítat 10 000 lidí v parku - 20 diamantů  [BR][BR]Hm, tak minimálně 20 dia v čoudu, těch 12 center nejspíše mít budu, ale ne v době, kdy ten úkol budu plnit (v další kapitole)."}, {"166": "Musím uznat, že se budovy velmi povedly ... [smilie--sprite2] [BR]Baví mě to ... [BR][IMG]https://i.ibb.co/RTttYLP/http-www-webelite-cz-elvenar-Screen-Shot-05-06-21-jpg.jpg[/IMG]Přeji všem hodně pozitivních zážitků ze hry ..."}, {"16": "A ty osadnické budovy Amuni a portál víl a trpaslíků tam máš aby ta hra nebyla moc lehká?[BR]Jako sbírejte si ve vesnicích, co chcete, ale pak se nedivte, že nemáte na nic místo."}, {"166": "Já se nedivim, že nemám místo ... [smilie--sprite2] ... stavím si město, aby se líbilo mě ! Neženu se na přední příčky, proč taky. [BR]btw, a vypadá to, že i s portálama trpaslíků, víl, orků a s Radnicí jsem v žebříčku pořád nad váma ... [smilie--sprite1]"}]