[{"16": "O žebříčku můj příspěvek nebyl, ale o tom, že s těmi portály nemáš místo ani na osadníky. [BR]Pokud nemáš v plánu je každou kapitolu bourat a pak zase znovu stavět.[BR]Ale očividně si s tím dokážeš nějak poradit, jinak by to s tebou dopadlo jako s několika dalšími hráči, které mám stále ještě kousek od sebe na mapě, a kteří si také stavěli ve městě hezké budovy, a to tak moc, že jim došlo místo a skončili se hrou ještě před osadníky."}, {"20": "@webelite - s tím pořadím se pleteš. Nesmíš srovnávat, když má někdo menší město ve světě, kdy ty máš větší. Lovec Krys má hlavní město na cz1 a např. já na cz2. Přechovávání starých portálů je brzda ve hře, protože to jen zaplácne spoustu místa a nic to nepřináší. Sice tvoje věc, jak hraješ, ale tvoje poznámka a umístění nedává smysl.[BR][BR]V této hře je nesmírně důležité stavět, ale i bourat. Měnit méně kvalitní budovy za lepší. I já sice přechovávám několik budov, které se mi líbí, i když produkce je mizerná (např. modrý Fénix), ale takových věcí si člověk nemůže dovolit moc. A když půjde do tuhého, vymažu je.[BR][BR]V 18. kapitole se konečně vyplatí vylepšit starší budovy na manu: např.  fontána 130500 many, Sova 42000, Stáj sněžné sovy 39000, atd. Poslední dvě kapitoly k nárůstu many po vylepšení nedocházelo, ale nyní je to o dost lepší."}, {"11": "jak je to teda s tím kupcem, když mi běží jeden, spoluhráči vidí těch nabídek ode mě víc. A já vidím od jednoho hráče 15 nabídek, přitom je jen 5 kupců."}, {"16": "@voyager-1 Najmeš kupce na 20 dnů.[BR]Zadáš nabídku:[BR]Dostaneš ihned suroviny.[BR]Kupec je na příštích 6 hodin zaneprázdněn nabízením toho zboží na tržišti (nabídky s kloboukem).[BR]Po uplynutí 6 hodin se ti kupec vrátí (nabídka zůstane na tržišti pro ostatní hráče).[BR]Pokud tvou nabídku někdo vezme dříve, kupec se ti vrátí a můžeš zadat další nabídku (pokud máš někoho s kým se můžeš domluvit, můžeš tak naházet na trh klidně třeba 20 nabídek s 1 kupcem během 5 minut)[BR]Dalšími možnostmi, jak si vrátit kupce dříve než za 6 hodin, je plýtvání urychlovači anebo diamanty."}, {"3": "@Lovec Krys on ten mechanismus je poměrně jasný, ale jak tam může v jednu chvíli od jednoho hráče tedy viset tolik nabídek? Přece když tu nabídku někdo přijme a tím se kupec vrátí dřív, tak ta nabídka z tržiště zmizí, ne?"}, {"31": "Pokud tam má 15 nabídek naráz, tak tam musí mít minimálně 5 nabídek starších než 12 hodin. Poslal 5 kupců, nikdo mu nic nevzal, tak za 6 hodin poslal dalších 5 a pak zase. Jak dlouho tam může nabídka viset, když ji nikdo nevezme? Je to nějak omezené?"}, {"3": "takže kupec se vrací, ale nabídka zůstává viset? zajímavé, ne úplně logické, ale vysvětlovalo by to situaci"}, {"11": "a ty nabídky poté co se kupec vrátil tam zůstávají po určitou dobu nebo dokud nebudou přiřazený pro jiného hráče?[BR]A seznam vlastních nabídek asi nejde zobrazit jako u jiného zboží, že ?"}, {"16": "@Emhyr var Emreis II Spíše to můžeš chápat tak, že má na nabídnutí nabídky 6 hodin, a když mu to nikdo do té doby nevezme, tak se tam fláká (má výmluvu, aby nemusel zpět).[BR]Když mu ji někdo vezme, tak výmluvu nemá a maže rychle zpátky, aby ho nájemce neseřval, že se tam fláká."}, {"44": "Tak to vypadá, že kdo vyrábí výhonky tak vyhrál a kdo je potřebuje je v pytli [smilie--sprite1] snad se trh ještě rozjede pač jestli se ty nůžky ještě rozevřou tak to bude opět strašná zábava pro hodně lidí spoléhat jen na kupce ."}, {"2": "trh je výhonků plný"}, {"11": "je, ale poptávek [smilie--sprite1][BR]já ještě nabídku výhonků neviděl a ani nevidím, ale zatím stačí kupci"}, {"26": "Úkoly z té italštiny, co hodil odkaz palni - přes google překladač..:[BR]Sice nic moc, ale při troše dobré vůle to lze pochopit.[BR][BR][BR]Spoiler: úkoly přes google překladačNasbírejte 25 000 božských semen - 20000 unuria koupit[BR]8 znalostních bodů - 2 kombinující katalyzátory[BR]Sbírejte 30 000 unuria - 15 000 božských semen[BR]utratit 30 znalostních bodů - 15 000 many[BR]odemkne portál dimenzí - 3 znalostní body[BR]Postavte portál dimenzí - 1 Unur Wonder Rune[BR]vlastnit manufakturní éru druhého dobra po vašem bonusu + sbírat 200 000 vnímajícího zboží - 5 okamžiků času 2 h[BR]vlastnit produkční éru druhého dobra po vašem bonusu alespoň na úrovni 16 + odemknout manufakturu Marble - 3 okamžiky čas 5h[BR]vlastnit éru výroby druhého dobra po vašem bonusu alespoň na úrovni 24 + odemknout Steel Manufactory - 2 okamžiky čas 8h[BR]vlastnit éru Manufaktury I druhého dobra po bonusu alespoň na úrovni 28 + odemknout Manufakturní sekery - 1 okamžitý čas 14h[BR]vlastnit výrobu Byl jsem druhým dobrým po vašem bonusu alespoň na úrovni 30 + použijte 10 kouzel - 1 okamžitý čas 20h[BR]vlastnit manufakturní éru druhého dobra po vašem bonusu alespoň na úrovni 32 + použít 10 okamžiků - 3 okamžiky starověké znalosti 5ks[BR]získejte 1000 Vzestupného zboží + vlastníte alespoň 3 Základní manufaktury lv. 32 nebo vyšší - 4 okamžité mince 10%[BR]daruje 1 000 prvotních minerálů - 15 000 unuria[BR]přijímá 6 nabídek - 1 krmivo pro domácí mazlíčky[BR]obchodujte s velkoobchodníkem 4krát + prozkoumejte 1 provincii - 18 000 božských semen[BR]máte obchodníka na úrovni 7 - 1 Unur Wonder Rune[BR]odemkne upgrade vzestupného zboží - 2 Royal Restoration[BR]pronajměte nebo použijte 10krát obchodníka - 4 kouzla Magical Fabrication[BR]sbírá 40 000 000 mincí - 5 kouzel Haunted Dowry[BR]odemkněte Park Road + umístěte alespoň 12 Park Roads - 2 kombinující katalyzátory[BR]odemkne autentickou radnici - 3 znalostní body[BR]odemkne Welcome Square - 2 Royal Restoration[BR]vlastní 3 Welcome Plaza + obdrží 2 000 elvenarů v parku - 2 instantní starověké znalosti 10ks[BR]mít 1 vodní centrum + 1 ohnivé centrum - 200 000 many[BR]mít 1 střed vzduchu + 1 střed Země - 4 kouzla Magical Fabrication[BR]Získejte 100 medailí za aktivitu - 2 střepy run[BR]krmí 100 malých prvků - 18 000 božských semen[BR]udělejte 10 pokusů - 8000 skřetů[BR]odemkne autentická rezidence - 1 teleportér[BR]mít alespoň 10 rezidencí lv. 40 - 25 000 unuria[BR]vlastní 12 Element Center - 2 Royal Restoration[BR]vlastní 6 uvítacích čtverců - 4 kouzla pro kouzelnou výrobu[BR]vlastní brána dimenzí 2. úrovně - 15 000 žoldáckého tábora na blízko[BR]získejte 50 odznaků Team Spirit - 2 okamžité mince 33%[BR]odemkne Centra Elementů na úrovni 2 - 5 okamžiků za 1 hodinu[BR]mít alespoň 4 živelná centra úrovně 2 - 2 krmivo pro zvířata[BR]vítejte v parku 5 000 elfů - 4 kouzla Magical Fabrication[BR]máte úroveň 3 brány dimenzí - 2 kombinující katalyzátory[BR]získejte 100 odznaků Team Spirit + přivítejte 10 000 lidí v parku - 2 Royal Restoration[BR]Poskytněte sousedské pomoci 50krát - 5 kouzel Haunted Talent[BR]získejte 400 medailí Aktivity zahrnující ohnivý prvek + krmení 100 Ohnivých prvků - 100 požárního zboží[BR]získejte 400 medailí Aktivity zahrnující vodní prvek + krmení 100 Vodní prvky - 100 vodního zboží[BR]Získejte 400 medailí za aktivitu zahrnujících prvek Země + krmte 100 prvků Země - 100 zboží Země[BR]získejte 400 medailí za aktivitu zahrnujících větrný prvek + krmte 100 větrných prvků - 100 větrných statků[BR]získejte 80 000 Vzestupného zboží - 1 okamžitá starodávná znalost 15 ks[BR]vítejte v parku 6000 elvenarů + získejte 150 odznaků skupinového ducha - 2 úlomky run[BR]máte úroveň 4 brány dimenzí - 200 000 many[BR]odemkne Elementární centra úrovně 3 - 3 okamžité 15% coiny[BR]mít alespoň 12 elementárních center úrovně 3 + přivítat 10 000 lidí v parku - 20 diamantů[BR]mít ve svém městě alespoň 50 skupinových ulic - 1 okamžitý 50% coin[BR]mít minimálně 3 laboratoře úrovně 41 nebo vyšší - 2 teleportéry[BR]vlastnit alespoň 3 základní výrobce lv. 32 nebo vyšší + minimálně 3 řemeslné výroby živ. 32 nebo vyšší + mají alespoň 3 magické výroby úrovně lv. 32 nebo vyšší - 3 znalostní body[BR]odemkne Oltář šampionů nebo Chrám duchů - 1 okamžitá starodávná znalost 20ks[BR]prodat bránu prvků - 6 okamžiků čas 30 m[BR]použijte 9 kouzel + použijte 6 instancí - 2 fragmenty run[BR]Vyrobte 20 nápojů + 10 chlebů + 10 košík na jídlo - 20 diamantů"}, {"20": "Grafika je nádherná, ale způsob hry a obchodu je poněkud depresivní [smilie--sprite5]. A to jsem přednostně vylepšila hl. sídlo, aby měla kupce trošinku vlídnějšího. Je to hnusnej skrblík [smilie--sprite4]. Podle trhu asi všichni vyrábíme hořící bloky ... Jak jen to bylo v Pelíšcích?"}, {"2": "@Ludi [BR]Kde udělali soudruzi z NDR chybu?[BR][BR]Já mám na trhu 31 stran poptávek po palmách nabízeno oboje.[BR]Kdo vyrábí palmy je na CZ2 úplně vyzívanej.[BR]Ostatní mají smůlu."}, {"121": "...výhonkáři kupce zatím nepotřebují, stačí jim vysbírat trh, takže jejich nabídku snad ani neuvidíme...jen doufám, že se to časem změní[BR][BR]...jinak kvetoucí obchodní cech od 21lvl přidá medaili"}, {"2": "Tak to mám smolíka, vytáhl jsem ho jen na16[BR][BR]Ale pokusy na trhu mi ukázaly, že si nemám na co stěžovat, pašerák s krystaly se často vrací dřív, zatímco s cihlou se poflakuje celých 6h[BR]takže jako producent krystalů si nemám na co stěžovat."}, {"129": "klapa napsal/a:\t\t\t...výhonkáři kupce zatím nepotřebují, stačí jim vysbírat trh, takže jejich nabídku snad ani neuvidíme...jen doufám, že se to časem změní[BR][BR]...jinak kvetoucí obchodní cech od 21lvl přidá medaili\t\tKlikněte zde pro zvětšení...Som iba v ambasadach a vylepšujem Svatostanek a Ruiny kvoli kulture.Chcem sa opytať oplati sa investovať do kvetouciho obcchodniho cechu a vytahnuť ho zo 6 levelu na 21 kvoli tej medaily ktory dava potom v levly 21 ? Je to velka pomoc v tej poslednej kapitole ?Diky za radu"}, {"20": "@Marian24 já považuju Kvetoucí obchodní cech za jeden z nejužitečnějších divů. Kromě zlepšení výroby osadníků, se každým vylepšením zlepšuji i nabídky obchodníka a u standartního zboží si v pohodě naklikám spoustu za zlaťáky i kladívka. Na CZ1 mám bonus na svitky a tam mě Čmelák vyloženě zachraňuje."}, {"11": "u obchodníků z Unuru se Ti bude taky hodit. Myslím lvl.14 prakticky přidá jeden level portálu. A u těch lodí se to bude hodit."}]