[{"121": "@Marian24, určitě se vyplatí obchodní cech vylepšit, jak už bylo zmíněno i u obchodníka na trhu budeš mít lepší nabídky a v poslední kapitole je opravdu každá medaile navíc vítaná [BR]@GorGlin, já jsem producent hořících bloků, takže přesně vím o čem píšeš [smilie--sprite8] [smilie--sprite8]....já jenom tiše doufám, že přijde čas, kdy ty naše cihly budete taky nutně potřebovat"}, {"129": "Ok Diky za nazory, tak ja ten cech začnem levlovat."}, {"4": "Cech ti pomůže i v Ambasádách"}, {"11": "Lovec Krys napsal/a:@Ludi Nějaké teleportovat můžeš, ale není nutné zacházet do extrémů jako v minulé kapitole.[BR]Viz. např. rozložení hráče pilousd z bety:[BR]Zobrazit přílohu uživatele 5456Klikněte zde pro zvětšení...ale těch center živlů jde postavit víc, ne?"}, {"16": "@voyager-1 Postavit jich můžeš, kolik chceš. Otázka je, kolik jich uživíš.[BR]Já mám místa dost na 4 kusy z každé, ale zatím netuším, zda jich tolik uživím."}, {"2": "Já mám v plánu postavit 3 od každého.[BR]Vychází mi to tak z potřeb brány, aby mi zbytečně nestala.[BR]Nejsem si ale jistý jestli to do konce stihnu, systém který je zavedeny me dost brzdí.[BR]Získat 68k cihel byla zivacka.[BR]Ale nějaký ten pulmilion palem který potřebuju na elementaly si teď nedokážu predstavit"}, {"16": "@GorGlin Brána ti stejně bude stát, přinejmenším v noci, s tím hloupým zkracováním času."}, {"2": "To jistě,ale rád bych dosáhl stavu že jen přes noc.[BR]Ted mám první sadu elementálů a ta mi za den bez obtíží dá produkci na 1 cyklus zážitků, tedy 5 odznaků[BR]což je s ohledem na požadavky výzkumu dost smutné[BR]Na druhou sadu potřebuju ještě 20k palem a ted to nevypadá že by někdo měl zájem, takže na třetí ani nemyslím.[BR]S roztoucím lvl rostou i ceny takže co bude potřeba abych měl všechno pozvedané nechci ani pomyslet.[BR]Každopádně tři sady jsou 15 hodin provozu brány na prvním lvl, jak porotste produkce zatím jen věštím, ale potřebuju dělat víc jak dvojnásobek když čas klesne z hodiny na 25 minut."}, {"11": "dnes jsem měl takovej frmol na tržišt,i že jsem prodal všechny cihly, asi 100k, ted nemám ani cihly ani unurium a potřebuju ještě 5. cest. [smilie--sprite1]"}, {"121": "@GorGlin, tak prý od 3lvl brány už nám čmelda taky přinese medaili, pokud je minimálně na 6lvl, tak i nám to něco hodí [smilie--sprite1]"}, {"2": "Díky za info, takže nejkratší cestou na bránu 2"}, {"31": "Vy, co plníte úkoly, je tam úkol vlastnit 6 Náměstí uvítání a dá se odmítnout?"}, {"11": "pokud je to úkol s vykřičníkem tak až v další kapitole."}, {"31": "To nevidim, beru to podle toho italského seznamu úkolů tady od Karhola."}, {"11": "tak jestli je to úkol z hlavní úkolové řady tak to jsou úkoly s vykřičníkem."}, {"16": "To bude 100% neodmítnutelné.[BR]Přeci si nemyslíte, že by nám vývojáři dali takový úkol jako odmítnutelný..."}, {"20": "V posledních dvou kapitolách jsem úkoly plnila, ale tady se na to vykašlu. Stavět Náměstí uvítání jen kvůli úkolům se mi nechce, jelikož sklad mám plný placek na portál, tak proč plýtvat surky i místo? Alespoň nějakou výhodu z těch placek chci mít ...[BR]Unurium, unurium, kde jsi? [smilie--sprite7]"}, {"50": "Mám dotaz k úkolu :  vychovej 100 dětských elementálů......, co to prosím znamená, nějak se mi nedaří úkol splnit"}, {"2": "Rasovka v hubech na 8 hodin[BR]bych si myslel"}, {"11": "já ted dělám deset zkoušet, jsou to takový hlavolamy ale už mám 4 tak to bude něco za čtyři hodiny."}]