[{"2": "Zkoušky jsou to z portálu, ne?"}, {"11": "jj, ted jsem jeden odklikl"}, {"20": "Výroba po 3 elementech + 37% Čmelák, zatím spokojenost. Tahle kapitola má výhodu, že město nemám tak přeházené jako v 17. kapitole, takže ani tolik nevadí, když budu hrát o něco pomaleji. Víc věcí teleportovat nechci, abych si nesnížila výrobu unuria. Výroba osadníků je na pohled moc hezká, takže dobrý. Už i ten kupec celkem běhá. Jen to přehazování semínek a unuria mi nevyhovuje, ale zvykám si  [smilie--sprite2]."}, {"44": "máte opravdu potvrzené že portál se čmelákem vyrábí dva odznaky ? popřípadě portál lvl 4 ? Pár lidí mě psalo že to není pravda."}, {"2": "Já to jen četl.[BR]Potvrzené to budu mít nejdřív za deset dní.[BR]Jestli ne, bude to velké zklamání."}, {"44": "aha , takže podle všeho portál lvl 2 + čmelák na vysokém levelu žádný odznak nepřidává , takže pochybuju že s portálem lvl 3-4  se to změní ."}, {"2": "@Anthalas [BR]co to je podle všeno?[BR]máš portál 2 a čemláka 21+?"}, {"121": "čmelák přidává medaile a elementály v centrech, ne odznaky v bráně"}, {"2": "Tak to mě inno zklamalo"}, {"20": "@GorGlin v konečném důsledku toho i v bráně vyrobíme působením Čmeláka víc, protože máme víc zdrojů k výrobě. Brána vyrábí celkem svižně, takže i tady má Čmelák vliv, i když nepřímo."}, {"11": "já čmeláka nemám a tak mě to netrápí [smilie--sprite1]"}, {"11": "co preferujete, zvednout nejprve portál na lvl.3 nebo centra na lvl.2 ?"}, {"20": "@voyager-1 - řekla bych, že je to jedno - já začínám elementy."}, {"2": "@voyager-1 [BR]Já na chvíli přerušil produkci odznaků a vyrobil si malé elementaly abych mohl zvedat huby jak mi bude chodit surovina.[BR]Tuhle kapitolu podřizují hodně pašerákům.[BR]Produkce je nestabilní, plánovat se nedá, takže chci být připraven a stavět když to půjde."}, {"20": "@GorGlin - taky jsem pozastavila výrobu odznaků a jedu elementy. Prostě je jedno, co \"vyčekám\" dřív."}, {"11": "po dvou sériích center mi nezbylo moc potřebného zboží tak to bude asi na střídačku. Záleží ted na kupcích. To T2 taky není zanedbatelný [smilie--sprite1]"}, {"2": "To si držím vysoko, takže živouci T2 mě netrápí. Teď už ani urina.[BR]Teď stojím jen na palmách.[BR]Všeho ostatního je dost.[BR]Teď potřebuju ještě asi 130k na dokončení prvního vylepšování a pak dalších skoro 300k na dokončení.[BR]Nepředstavitelné množství při tak omezeném zdroji."}, {"32": "Opět nevyvážený trh snad horší než z houbičkami v minulé kapitole,tam jsem mohl aspoň nabídnout více zboží i s prodělkem."}, {"3": "daň za rychlost, víc bych v tom nehledal. Já jak jedu o něco pozadu (brzo konečně doklepu ambasády - cca 700VB do konce), tak můžu potvrdit, že jde jen o problém hráčů, kteří s novou kapitolou jsou ve velkém počtu ve stejné fázi výzkumu. Tomu se předejít asi nedá"}, {"20": "@Emhyr var Emreis II  -  tak jasně. Nepříjemné je, že ti kupci nás silně omezují v množství, které můžeme dát na trh. Ale oproti prvním dnům po spuštění kapitoly, už kupec běhá o něco líp. A to vyrábím hořící bloky, kterých je všude přebytek. Určitě je tahle kapitola příjemnější, než ta minulá."}]