[{"32": "Je trochu deprimující,když kouknu na trh a nenajdu jedinou nabídku standartního,živoucího ani osvíceného zboží z mé výroby.Možná by pomohlo,když je možnost změny pozice tak udělat změnu zboží a srovnat trochu trh."}, {"3": "no, změna pozice, to je taky výhra. Poté, co mi INNO ve velkém vyklidilo sousedy jsem se po dlouhých letech rozhodl, že zkusím přesun. Po pár dnech od zaškrtnutí mě přestěhovali a i když sousedů mám víc (nejsem už na kraji mapy), tak nade mnou jsou taky solidní lysiny a trh je mnohem tragičtější, než jsem měl předtím. Katastrofa. Já nechápu, kde hráči ty suroviny shánějí, když ne přes trh. A nebo je fakt aktivních hráčů sotva pár jednotek procent a zbytek je prachsprostý odpad [smilie--sprite3]"}, {"16": "Změna pozice nezmění bonusové suroviny. A trhu s prošlým zbožím a radioaktivním zbožím taky moc nepomůže - ty trhy jsou buď mnohem větší kruhy anebo rovnou globální, takže změna pozice na ně nebude mít vliv."}, {"11": "od mého včerejšího příspěvku v 11:29 jsem prodal kolem 160k cihel a za chvíli zvednu 4. sérii center, takže ten trh určitě není tragédie."}, {"134": "160k za den a půl? To vůbec není špatné. Mimochodem, kolik z toho bylo na volném trhu a kolik v rámci společenství?"}, {"11": "ono je to víc, ale nechtěl jsem tu házet čísly, se spolkem jsem nic neřešil ,všechno naslepo přes kupce. A dnes jsem našel i dost poptávek cihel na tržišti, možná tak 30-40k. Nějakej Miropp či jak, tam byl opakovaně, holt to chce být na tom tržišti trochu aktivní, jít tam dvakrát za den nestačí."}, {"2": "Je to určitě lepší, než před dvěma týdny, ale pořád mi to připadá jako hrozná loterie.[BR]Někdy vyhraješ, dnes ráno jsem chytil na trhu nabídku palem.[BR]Vůbec nechápu proč to tam kdo dal, ale moc děkuji.[BR]Nebo jsem vyslal pašeráky a než jsem nahodil výrobu, byl jeden zpět.[BR]Ale taky často chodím jen marně kontrolovat ubíhající časomíru, nebo zjistím že jsou už dvě hodiny zpět, ale já zrovna nebyl ve městě.[BR]Kdybych tím měl shánět těch pár stovek na výrobu tak neřeknu, ale přesouvat sto tisíc suroviny touhle cestou je opruz."}, {"20": "@GorGlin už si na Kupce pomalu zvykám, teď běhá líp. Má výhodu, že neexistují lichvářské nabídky."}, {"16": "A pro výměnu 100k surovin musí člověk dávat nabídky po 2000/1800"}, {"89": "Trh se už konečně docela rozjíždí. Já na cz2/W mám palmičky takže zatím ani nemusím najímat kupce. A každá z mých dvou manufaktur mi na 32. úrovni vyrobí 7040 palmiček za 3h."}, {"31": "Hádám, že tohle uzavírá naši diskuzi o tom, jak je možné, že nabídky zůstávají viset i po návratu kupce. Takhle se z toho Inno vykecalo.[BR]"}, {"20": "@Prealiena upřímně, ono je jedno, když to tam leží dlouho. Zboží dostaneš hned a pak to tam leží pro případné zájemce. Při přímém nákupu je dobré, pokud to jde, dávat přednost nabídkám, u kterých je klobouk, protože tím se druhému hráči uvolní kupec a může zadat nový obchod.  Ale když někdo vyrábí hořící bloky jako já, tak na trhu bere to co se zrovna nabízí [smilie--sprite1]."}, {"5": "Zdravím, po prvotním shlédnutí nové rasy, to vypadalo na Nekonečný příběh [smilie--sprite1][BR]Přesto vše obstojně schůdné. Není návodem, nicméně se dá na něčem z těchto poznatků stavět: [BR]1.logicky co nejvíce místa pro co největší počet živlů /mám od každého 5, přesto postačí 3 na plnění úkolů /- použity teleporatce a šel cestou vyházení zbrojnic /zde je ovšem dobré míti zásoby orků/, někdo šel cestou snížení počtu obytek, což nese menší přísun mincí, ale ty se dají jednodušeji doplnit požehnáními, pokud ovšem jsou [smilie--sprite1][BR]2. cz2, ano obrovský nedostatek výhonků a převis poptávky, postavit-povýšit aspon dvě manuf i nebonus na T7 s výhonky /tj. prkna T1/ a pernamentně okouzlené magickou výrobou /pouze částečný přínos, přesto k nezaplacení/[BR]3. urunium po počátečným [BR]náporu/kdo neměl předem naskladněno/ již taky lze utáhnout běžnou sklizní a 3hod ...zde doporučuji do města naopak budovy na semínka a opětovně tak částečně kompenzovat požadavky na ně /případně přehazovat výrobu semeno vs urunia - ranní moč [smilie--sprite1] /[BR]4. ano náměstí to chce v úkolu, ale pouze 4[BR]5. další body doplnění postupem, všem krásný pobyt v nové rase [smilie--sprite1]"}, {"11": "ty stránky upozornění jsou dobře zahlceny hláškami o kupcích. Na deseti stránkách jsem nenašel ani deset lidí pro motivaci."}, {"2": "Jo, je to děs.[BR]Naštěstí po dostavění rasové produkce můžeš přestat s výrobou i obchodem."}, {"77": "takže v tom kupci nelze dávat nefér nabídky? ..tedy můžeme se těšit že trh bude více narovnán?"}, {"11": "svým způsobem nemůžeš vůbec dávat nabídky. Nasadíš kupce a množství je pevně dáno."}, {"16": "@luterina No narovnán. Zatím vždy bývá jedna surovina, kterou málokdo chce a jedna, která je nedostatková. Např. já na betě, když směňuji ingoty za minerály, tak skoro vždy to trvá mým kupcům 6 hodin, než se vrátí. Takže za 6h můžu vyměnit jen 6k surovin...[BR][BR]A i když máš někoho, kdo to s tebou smění, tak klikat 100k surovin na výměnu je pěkná pakárna. Podle rychlosti reakce druhé strany klikáš po 2k(1,8k s lv 39 Hl. Sídlem) 10 - 30 minut namísto jedné 100k nabídky."}, {"20": "Kupec je prazvláštní nápad. Pokud nedojde k výrazné změně, tak v další kapitole vůbec netuším, jak přes něj budu cedit další nové suroviny. Kdyby šlo dávat alespoň po 5000, nebo lépe po 10000, ale takhle je to na hlavu [smilie--sprite3]. A pro toho, kdo vyrábí hořící bloky je to fakt hrůza. Klidně bych je dala pod cenou, ale to mi kupec nedovolí. Kdyby alespoň požadavky ve hře byly přizpůsobeny bonusovým surkám, hned by se obchod narovnal. Ale takhle ... ten kdo dělá palmy, tak kupce vůbec nepotřebuje, takže je to mega zvýhodnění a my s hořícími bloky máme mega smůlu."}, {"16": "@Ludi Asi tak jako já na betě - dneska jsem si jednoho kupce vracel přes urychlovače, abych nemusel čekat na výměnu surovin na vylepšení osadnických budov několik dnů."}]