[{"20": "@Lovec Krys - urychlovač a za to 2000 surek ... no bezva ...  [smilie--sprite2]"}, {"2": "@Ludi [BR]Já měním krystaly za ingoty a ty pak vcelku snadno měním za palmy[BR]Dát na trh přímo krystaly a chtít palmy je moc smutná pohadka"}, {"38": "Troška zpřehlednění výrob z Center a potřeby medailí pro Portál:[BR]Spoiler: Přehled výrob medailí[IMG]https://i.ibb.co/cF2wTjM/https-cz-forum-elvenar-com-index-php-attachments-ch18-tabulka-v-rob-png-5537.png[/IMG]"}, {"167": "ElfNostradamus napsal/a:\t\t\tZdravím, po prvotním shlédnutí nové rasy, to vypadalo na Nekonečný příběh [smilie--sprite1][BR]Přesto vše obstojně schůdné. Není návodem, nicméně se dá na něčem z těchto poznatků stavět:[BR]1.logicky co nejvíce místa pro co největší počet živlů /mám od každého 5, přesto postačí 3 na plnění úkolů /- použity teleporatce a šel cestou vyházení zbrojnic /zde je ovšem dobré míti zásoby orků/, někdo šel cestou snížení počtu obytek, což nese menší přísun mincí, ale ty se dají jednodušeji doplnit požehnáními, pokud ovšem jsou [smilie--sprite1][BR]2. cz2, ano obrovský nedostatek výhonků a převis poptávky, postavit-povýšit aspon dvě manuf i nebonus na T7 s výhonky /tj. prkna T1/ a pernamentně okouzlené magickou výrobou /pouze částečný přínos, přesto k nezaplacení/[BR]3. urunium po počátečným[BR]náporu/kdo neměl předem naskladněno/ již taky lze utáhnout běžnou sklizní a 3hod ...zde doporučuji do města naopak budovy na semínka a opětovně tak částečně kompenzovat požadavky na ně /případně přehazovat výrobu semeno vs urunia - ranní moč [smilie--sprite1] /[BR]4. ano náměstí to chce v úkolu, ale pouze 4[BR]5. další body doplnění postupem, všem krásný pobyt v nové rase [smilie--sprite1]Klikněte zde pro zvětšení...[BR]k bodu 4 - náměstí to chce ve dvou úkolech, v prvním 3 a ve druhém 6 (počet 4 jsem nikde neviděl)"}, {"5": "petr.wp99 ...děkuji a správně 6 náměstí...gratuluji a dávám jedničku s hvězdičkou, byl to test je hezké, že jsi všimnul [smilie--sprite1] [BR][BR]Odstraněn nevhodný text. Embla"}, {"2": "Ty pašeráci s lvl sídla zdražují, první mě stojí o dva miliony vic.[BR]Tady si někdo stěžoval že má moc peněz?"}, {"16": "No přeci bys nechtěl, aby chodili v hadrech z Tesca, holt to značkové nejjemnější hedvábí a šperky z pravých diamantů /rubínů apod. něco stojí. [BR](v překladu ta cena je evidentně % z kapacity)"}, {"2": "Na to kolik jim platím služby nic moc. [BR]Možná kdybychom měli policii a soudy, tak by cena hned klesla."}, {"11": "Tak tři sady center na lvl. 3 jak bude žádat úkol a k tomu zatím po dvou sadách na lvl 2. Začíná se to rozjíždět. Zvýšily se nároky na manu, pro výrobu elementálů asi 800-900k denně ale protože elementály nasazuju na noc, nehrozí rozpad."}, {"2": "Taky jsem včera dokončil centra.[BR]Sebralo mi to dost urychlovačů i many.[BR]Teď jsem bez zásob, ale spokojený.[BR]Uživit provoz nebude tak složité, ale jak nadporuju na výzkumy manufaktur, nebo stavbu sídla, to už je horší.[BR]To bude zase nakouzlino do konce roku."}, {"12": "To je zase nějak nedomyšlené to nové zboží.Proč si někdo může vyrobit to co potřebuje a jiný to musí pracně směnit,jak tady někdo psal\"minerály za bloky,bloky pak za výhonky\"."}, {"11": "nikdo nevyrábí co potřebuje, jenom se něco lépe shání."}, {"12": "Jo dík za upozornění,tak to bylo myšleno,proč se tedy něco -ne že lépe shání,ale jde vyměnit bez čekání?To je jako kdyby v hokeji jedni neměli branku!"}, {"2": "protože se zoufalství sahneš po řešení za diamanty"}, {"32": "Tato hra se začíná stávat nudnou,pouze sledovat kupce při jejich pochodu není nic moc.Pro někoho kdo si jednou,dvakrát otevře hru je i nereálné sehnat větší množství osvíceného zboží s 10% rozpadem.Toto se netýká těch kteří vyrábějí výhonky."}, {"44": "no a co teprve po 1 ks vyrabet tisice odznaku , to je teprve zabava [smilie--sprite1] osvicene prestanes temer potrebovat po dokonceni lvl 3 center"}, {"2": "Jo, chodit na trh akždou volnou chvilku jen abych zjistil že nic.[BR]Ale já myslím, že cílem je abychom se na to vykašlali a patlali se v rase rok, nebo to zatáhly přes diamanty.[BR]Suroviny, které se rozpadají se množí, požadavky na ně rostou.[BR]v obchodnících bylo možné spotřebu many do rasy řešit přes instanty[BR]tentokrát mi rasa bere nějaký ten půlmilion many za den a omezit to nejde[BR]instanty tentokrát zaskakují za náměstí.[BR]ted jsem dělal úkol na 6 náměsti[BR]jeslti to chceš brát vážně, musíš jich mít aspon 6[BR]pokud bych byl odkázaný na náměstí, potřeboval bych jich tak tucet, kdo si myslí že 6 je dost to nikdy nepočítal ani teoreticky na palíře[BR]Instanty jsou použitelné jen na lidi elvenary a elfi tedy, jak to také řada hráčů udělala, náměstí je budova do počtu, úkoly s nimi spojené jen nesmyslné tahání surovin z měst a ukolovníci kteží žvatlají o jejich důležitosti banda pozerů co neví o čem mluví"}, {"11": "já mám teď perfektní úkol \"uvítejte v parku 6000 elvenarů + získejte 150 odznaků\" Jelikož mi jima portál samozřejmě přetejkal tak to dělám ted po troškách a je to na tejden. Ale odměna jsou pěkný dva runové úlomky [smilie--sprite1]"}, {"2": "no neber to[BR]já dělám 5000 elfů[BR]s ohledem na to, že vylepšení center na lvl 3 chtěl všude jen lidi, vyrábím výhradně lidi a ještě dlouho budu"}, {"16": "A pak se mi někdo může divit, když na úkoly kašlu a pravidelně je odklikávám v další kapitole.[BR]Já alespoň tady na cz1 mám s kým měnit, takže to jde, ale je to hrozný vopruz, když se to mění po 2000.[BR]A úplně nejlepší je příjem - to se tržiště neobnovuje, takže neustále dokola jak magor zapnu tržiště, nastavím filtr, vezmu 3 nabídky, vypnu tržiště a za chvíli zkouším znovu. A do toho samozřejmě vstupuje i to, že druhý hráč nemusí reagovat stejně rychle anebo jeho nabídky může vzít někdo jiný, takže to je pak neustálé vypínání a zapínání tržiště totálně na palici.[BR]Na betě to mám tak, že výhonky si kdykoliv přijmu z tržiště, ale na minerály dávám nabídky a obvykle čekám celých 6h na návrat, takže výměna  rychlostí 6000/6h."}]