[{"20": "Já úkoly plním spíš příležitostně. Hraju si to svoje a občas dojde i na splnění úkolu. Sem tam mi úkoly jdou celkem přirozeně se způsobem hry. [BR]Kupec je protivnej skrblík. Ale jinak výroba osadníků je hezká, zadání á 4 hod mi vyhovuje. Mám po 3 kusech + div, takže to celkem jde. Portál i centra mám povýšené na max. Vyhovuje mi, že nemám rozbouraný celý město jako v 17. kapitole, tak to hraju v klídku a až to bude, tak to bude."}, {"2": "Úkoly jsou tajemná věc, je to první téma, které jsem na fóru otevřel, protože jsem naprosto nechápal, k čemu je stavět manufakturu na surovinu bez bonusu.[BR][BR]Z kraje jsem si myslel, že úkoly jsou takový průvodce hrou, ale časem jsem to přehodnotil.[BR]rotující úkoly naprosto ignorují vývoj města a jsou už řadu ras stejné a to jak požadavky tak odměny.[BR]40000 mincí a 7000 zásob město, které účtuje v milionech a statisících, fakt nevytrhne a mana, semeno a urina tam není.[BR]Naopak v úkolech s rasou se sem tam něco užitečného najde, nejsou to věci které by mi s průchodem pomohly, doba kdy jsem za rasový úkol dostal suroviny potřebné do výzkumu jsou dávno pryč, ale urunium za zvednuté obytky mi ušetřilo jeden den čekání na stavbu sídla a elementálové zase umožní chvilku šetřit manu.[BR]dostat se k užitečnému úkolu je cesta zaplacená desítkami milionů promrhaných peněz, miliony zásob a všelikých surovin, ale od toho je dobrý hospodář aby počítal s možností, že ho bude chtít někdo zlikvidovat.[BR]Podřizovat hru úkolům je nesmysl, průchod rasou to nezjednoduší a zpomalí.[BR]Ano, na konci pak často vyrábím něco, co nepotřebuju, abych dodělal úkol, ale v mém případě se jedná o obsesi.[BR]Kdybych pak musel půl roku koukat na úkol postav 6 náměstí, tak to nakonec udělám."}, {"5": "V této kapitole se úkoly vyplatí dělat z důvodu slušného přínosu živého T6 za každý jednotlivý úkol...mimo jiné ano některý úkol dá 2ulomky - směšné, jiný 25 odznaků - potěšitelné....věc osobního rozhodnutí. 3 předešlé kapitoly jsem úkoly neplnil nyní ano, jdou včelku ruku v ruku s výzkumem něco se musí uspíšit či naopak trpělivě vysedět, ale všechny úkoly zatím postupně plněny...chybí přibližně asi posledních deset.[BR]Jinak kapitola chce dost many, bud´te připraveni [smilie--sprite1][BR]Mana, mana ...[BR]"}, {"20": "To jsou chybné informace. Odměnu živoucího za splněný úkol v hlavní úkolové řadě má jen ten, kdo postavil div Dračí archa, což třeba já nejsem."}, {"2": "@ElfNostradamus [BR]Má pravdu, náčelníku.[BR]Dokonce je možné, že aby odměny nebyli pro vlastníky divu příliš atraktivní, tak pro nevlastníky budo vyloženě neatraktivní."}, {"5": "Kdo nemá div má smůlu. Pro vlastníky divu jsou odměny dostatečně atraktivní, i proto tuto ukolovou řadu poctivě plním. Věc demokratického názoru a váš nesouhlasny pohled plně respektuji. [smilie--sprite1]"}, {"31": "@ElfNostradamus Já si vždycky vzpomenu na Abbu - Money, money, money[BR]Jinak úkoly plním jen kvůli Dračí arše, někdy mě štvou, ale pár úkolů docela naplní sklady. Stavěla jsem ji hlavně kvůli činidlům, s těmi teď pořád zápasím."}, {"5": "Taky jí mám hlavně kvůli činidlům, toto je malý - slušný bonus k tomu, poslední kapitoly jsem úkoly vynechával, ted´ i s radostí a hlavně klidně i s přehledem plním  [smilie--sprite1]    hodně zdaru s Dračí archou přeji"}, {"16": "@Ludi 3h by byly lepší - aby se to sladilo s výrobou v manu/dílnách.[BR][BR]A s tou manou - myslím, že ani nebudu vylepšovat osadnické budovy na lv3, i s lv2 musím kouzlit, protože mi to sežere více many, než denně produkuji, natož abych ještě něco za manu vylepšoval.[BR][BR]V úkolech stojím na vylepši 3 manufaktury na 32 - nějak se mi nechce spálit 100 kouzel jenom kvůli úkolům. A další vylepšení manufaktur mám v plánu až po dokončení kapitoly, pak můžu vyndat z inventáře budovy na manu na uvolněné místo po osadnících."}, {"20": "@Lovec Krys souhlas, výroba po 3 hodinách by byla pohodlnější. Ale nemůžeme mít všechno [smilie--sprite2].[BR]Osadnické budovy mám po 3 kusech na 3 lv. Jednak nechci rozbourat celé město, ale také mi to tak vyhovuje kvůli zdrojům, zvláště s manou jsem v pohodě. Pomáhá mi Čmelák, takže ve výsledku to je, jako bych měla 3 osadnické a necelou 4.[BR]Osadníci se mi moc líbí a tak mi případná delší hra kapitoly nevadí a celkem si to užívám. Grafika všeho je moc hezká a po 17. kapitole to cítím jako úlevu. Tam jsem byla celkově nespokojená. Začátek 18. kapitoly byl náročný, ale teď už to tak nějak jede v klidu. Věž teď hraju celou bojem, abych šetřila suroviny, a zatím dobrý. V žebříčku jsem dočasně celkem vysoko (na moje poměry), protože jsem teleportovala jen 3 domy. Ale to se změní, až okolní hráči dojedou kapitolu a vrátí všechny budovy zpět, a já zase klesnu [smilie--sprite8]. No, počítám s tím [smilie--sprite2]."}, {"11": "odměna 25 odznaků, kdo by to řekl [smilie--sprite1]"}, {"2": "To je pulden klikání, jsem mile prekvapen"}, {"11": "je to nepovinej úkol tak pozor na odmítnutí, pak je další dobrovolnej za 20 dia ale nikde tentokrát nevidím odměnu 200 dia"}, {"2": "shrábnout 200 za zbourání portálu by bylo moc easy"}, {"20": "Mám hotovou první manufakturu na prach 32 lv. Po dlouhé době se mi vzhledově moc líbí. Jinak skoro ve všech předchozích verzích se mi nelíbila. Manufaktury lv. 32 na ocel, dřevo, mramor, hedvábí i křišťál jsou moc krásné. I když nejkrásnější manufakturu na hedvábí s modrým motýlem to asi netrumfne. Každopádně zatím grafika 18. kapitoly je nádherná. Kasárna a cvičiště taky moc pěkný. Hlavní sídlo elfů je úžasný, stejně i domy a dílny elfů.[BR][BR]Jen než vyrobím všechny odznaky, tak to bude ještě trvat dlouho. Nebudu přistavovat další centra, vyrobím tolik medailí, aby portál měl stále z čeho vyrábět. Než se to procedí přes portál, tak to je věčnost. A dávat pořád urychlovače nechci."}, {"2": "Když jsem to naposledy počítal, vyšlo mi že potřebuju asi 16k od každé medaile.[BR]Chvíli to ještě zabere."}, {"89": "@GorGlin : Stejně není kam spěchat"}, {"2": "@OldMaGorr[BR]Na jednu stranu máš pravdu, do přístí rasy by mělo být dost času abych našpóroval dost limitovaných surovin na zvednutí všech manufaktur, nebo nových divů, ty to žerou taky dost.[BR]Ale[BR]Na druhou starnu jsou tu věci jako DSko a já chci co nejdřív svoje volnočasové náměstíčko a nemít všechny budovy na event rozstrkané po celém městě, pak při sbírání chodím po městě jak v kýblu střepů, protože tu je dílna s košíkem a támhle manucha s truhlou[BR]je to voprus a ten by neměl trvat moc dlouho"}, {"16": "Na druhou stranu budoucí hráči nebudou mít ten luxus čekat na další kapitolu a mezitím si vylepšit budovy, těm se může stát, že se budou muset zastavit a vylepšovat, jelikož jejich několik kapitol staré budovy už prostě nebudou stíhat (anebo jim nebude stačit kapacita Hl. sídla na výzkum další technologie - typické pro poslední 2 kapitoly, kde bez max. úrovně sídla nejste schopni do kapitoly vstoupit nebo dále v ní postoupit)."}, {"20": "To, jak jsou poslední kapitoly dlouhé, mě vedlo tentokrát k rozhodnutí nepřehánět to s výrobou osadníků a radši si nechat prostor, abych při hře mohla vylepšovat manufaktury i vše ostatní. Však ono to vylepšování zabere taky spoustu času. Tentokrát moje rozhodnutí posílila slabá výroba v Bráně dimenzí. Než tam přecedím medaile z center, tak je to věčnost. Až skončím výzkum kapitoly, budu mít hotové všechny manufaktury (většinu už mám), sídlo mám hotové i kasárna a cvičiště. Výzkum zbrojnic ještě nemám dodělaný. Ty si možná nechám na vylepšení až skončím kapitolu. Ještě uvidím. Musím kvůli tomu trochu přestavět část města a to se mi bude líp dělat, až zbourám výrobu. Ale dá se to udělat i za provozu  [smilie--sprite2]. Naštěstí všechny manufaktury se daly postavit tak, abych měla dost místa na jejich zvětšování. Prostě to tentokrát všechno nějak dobře do sebe zapadlo. Po delší době kapitola, která mě baví, grafika nádherná a po nepříjemném začátku je to teď pohoda."}]