[{"55": "Dear Humans and Elves,[BR][BR]Please see the announcement of our newest feature added to the game here: The Cauldron![BR]We are of course very curious for your feedback so please let us know what you think about it in this thread![BR][BR]Kind regards,[BR]Your Elvenar Team"}, {"33": "Seeing the effects are similar to Ancient Wonders.[BR]Does the new Cauldron feature increase the difficulty of either the Spire or Tournament?"}, {"29": "Be carefull with the diam's [smilie--sprite9][smilie--sprite9][smilie--sprite9][smilie--sprite9][smilie--sprite9][smilie--sprite9][smilie--sprite9][smilie--sprite9][BR][BR][IMG]https://i.ibb.co/nMdc23T/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-140045-png-10448.png[/IMG]"}, {"56": "When I clicked on some odd shaped thing It told me I have 6060 of something.   I have no idea what.  Is it taking something that I'm going to be short on and need in about 2 minutes from now?[BR][BR]By the way, in order to start this, if you are in the later chapters you need to go all the way back to Chapter 5 and research the Cauldron tech."}, {"29": "in announcement:[BR][IMG]https://i.ibb.co/N7sgCGt/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-141801-png-10450.png[/IMG]"}, {"37": "@Biloutte91 clicking a diamond ingredient won't cost you anything, it only inserts the ingredient to cauldron and adds diamonds to its total price. You pay all costs (witch points, diamonds and spell fragments) once you start brewing the potion."}, {"57": "iDavis said:\t\t\t@Biloutte91 clicking a diamond ingredient won't cost you anything, it only inserts the ingredient to cauldron and adds diamonds to its total price. You pay all costs (witch points, diamonds and spell fragments) once you start brewing the potion.\t\tClick to expand...To add to that, if you added a Diamond ingredient to the Cauldron without meaning to, you can remove it before you brew, by clicking the '-' by the ingredient in the Cauldron. If you added ingredients after the Diamond one, you can remove them to get back to the Diamond one, remove it, then add back the other ingredients. The trick is remembering which other ingredients you need to add back in![BR][BR]Edit: on browser 'x' is shown, not '-', and in both cases it's within the cauldron itself, just to the top right of the ingredient."}, {"17": "And to build on that, once you click on brew, you have to confirm.  Plenty of time to make sure you really wanted to spend diamonds."}, {"29": "I'm always wary of these boxes...a mistake came so quickly"}, {"29": "Where is the '-' ? sorry i don't see this [smilie--sprite3][BR][BR][IMG]https://i.ibb.co/zVNkWWB/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-144057-png-10451.png[/IMG]"}, {"32": "@Biloutte91 - in the middle of the screen, right in the cauldron above Brew button."}, {"32": "@iDavis - do we have a chance to see a video made by you, explaining this feature? I would be deeply grateful!"}, {"29": "so here[BR][BR][IMG]https://i.ibb.co/5ctx4Hn/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-145646-png-10452.png[/IMG][BR]or here[BR][BR][IMG]https://i.ibb.co/MZvB9Sy/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-145720-png-10453.png[/IMG][BR][BR][BR]but i have dont't see this '-' ^^"}, {"57": "@Biloutte91 ah! My bad! In the browser version at least it's not '-', it's 'x'[BR]The white 'x' on the red background just above the ingredient to remove it."}, {"32": "I can't tell you if I had an X or a - because once you brewed a potion then you have \"Improved Effects\" screen only.[BR]I saw the minus in the announcement capture and also, from cauldron I removed the diamonds I accidentally put them in [smilie--sprite8]"}, {"2": "The research for Cauldron is optional now.  I am wondering if this become mandatory at some point in the future.  Research kickbacks are wildly unpopular with the player base."}, {"33": "Please, could we get a small overview of the different effects (base bonus and duration)?"}, {"32": "Prueba2 said:\t\t\tPlease, could we get a small overview of the different effects (base bonus and duration)?\t\tClick to expand...I am sure this we will have it only if a player who really understands this feature is willing to do it. I do not expect to see it from Inno, just as it was with the tourny formula."}, {"3": "Incorrect word usage in announcement, in Studying section:[BR]In the same vain[BR]Should be [BR]In the same vein"}, {"9": "Lelanya said:\t\t\tThe research for Cauldron is optional now.  I am wondering if this become mandatory at some point in the future.  Research kickbacks are wildly unpopular with the player base.\t\tClick to expand...I you want more spells available, you need to research those optional too.[BR]You get diplomas for each fully researched chapter: (fully means including all optional researches)[BR][IMG]https://i.ibb.co/TkBRKCx/https-beta-forum-elvenar-com-index-php-attachments-1669732043548-png-10455.png[/IMG]"}]