[{"29": "You can remove ingrédients with a clic here:[BR][BR]For the last[BR][IMG]https://i.ibb.co/MZvB9Sy/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-145720-png-10453.png[/IMG][BR]for all:[BR][IMG]https://i.ibb.co/5ctx4Hn/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-145646-png-10452.png[/IMG]"}, {"29": "Same thing for the diam's[BR][BR]if you have clic by mistake in a premium ingredient, you can remove with the same \"red cross\"[BR][BR][IMG]https://i.ibb.co/kQb0pNK/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-05-150003-png-10536.png[/IMG][IMG]https://i.ibb.co/559M6W6/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-05-150028-png-10537.png[/IMG][IMG]https://i.ibb.co/6YTjPGJ/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-05-150303-png-10538.png[/IMG][BR][BR]the better if you want to \"invest\" diam's is to enter a number here[BR][BR][IMG]https://i.ibb.co/L94sv88/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-05-150439-png-10539.png[/IMG][BR] After you can clic on - for délète this... (but many, many clics ^^)"}, {"87": "lot of resources spend last week to improve 1 boost (several 100% coins and  supply , and more resources than i will get back in 1 year with this feature) and 2000 points in tournament for 4 goblets for that !!!![BR][BR]too much (bad)  luck , result far from max expected 130% and 16h15[IMG]https://i.ibb.co/L6yHQc7/https-beta-forum-elvenar-com-index-php-attachments-result-png-10540.png[/IMG][BR][BR][BR][BR](in any case max  value is not much as not cumulative with relics boost value , advantage at 130% can give an increase of 16.5% of t1 production for 1 day per week , this week + 6% for a few hours  )"}, {"86": "One other thing that's really annoying is the \"same old, same old\" effect.[BR][BR]\"The cauldron\" thingies are effects we've already seen, or variations on these.[BR][BR][BR]There is NOTHING unique about any of those effects. And they do not last long enough to be worthwhile.[BR][BR]100% lackluster. 100% not looking toward the future.[BR][BR]Yeah, of course new effects would take some more programming to take effect.[BR][BR]But, come on Inno. When was the last time something really new hit elvenar ?[BR][BR]I gather it was the spire. I'll admit, the tourney renewal was nice. But something new ? not really.[BR][BR]I'm not enough of an old-timer to know elvenar before the ancient wonders. Now, that must have been something ![BR][BR]Any change we get recently are either stuff that is very little, very late, or just mind-numbingly annoying (like the adventure gold sack change).[BR][BR]I'm sorry Inno, but that game is getting stale. I think you actually lack the balls to disrupt the status quo.[BR][BR]Heck, elvenar isn't even your cash cow any more.  And judging by the demographics, most elvenar players don't like to be disturbed too much, ssssshhhh !"}, {"2": "Lol @ayvinul[BR]What about when they introduced the Magic Academy to burn up relics, but we didn't have tournament to renew them."}, {"88": "I like the new feature mechanics. It is not obvious at first but we can figure it out pretty quickly. But… the potion effects are very high in costs for \"not much improvement\" and they only provide effects for a very short duration!!![BR][BR]I am so disappointed! It is not appealing at all for advanced players. I am forcing myself to test this new feature to try to convince me I have missed something and so far, I am not even interested in using it on Live worlds.[BR][BR]Here some more detailed feedback where there is lots of room for improvement:[BR][BR]- Why having a probability of success in brewing a potion AND a probability of critical effect? Just one probability of brewing a potion is more then enough gambling for me. Give us the full effects we “studied for”![BR][BR]- It is not interesting to get multiple potion effects ALL AT THE SAME TIME + for a very short time duration. I’d like to be able to chose when I can use a potion… i.e. during events, FA. Tourney, spire whatever I prefer![BR][BR]- The goods production bonus only applies to the regular production quantity of our manufactories?! This is ridiculous.[BR][BR]- Unurium production comes mainly from trader and bonus from Wonders. I am at the end of chapter 20 and did not use much of the cultural buildings producing unurium. Why restrict the potion effect to those cultural buildings we barely use? You want to make things more appealing to us, put the bonus on what counts![BR][BR]- Seeds bonus has the same issue then unurium, to less of a degree but still, we have Wonder producing seeds (Elvenar Trade Center) and the potion does not improve its production. Same for the Trader seeds production![BR][BR]- It would have been more interesting to reset the costs of improving potion effects for each study phase, like we have for the trader costs. If not, this system is a total waste of resources just to get insignificant improvements here and there. [BR][BR]If I was doing a customer review, I would give 1 star and a DO NOT BUY recommendation."}, {"16": "If costs are not reset weekly - there is no real way to improve more than 1-2 effects up to a decent level. Can't check it myself yet, waiting for friday to brew the potion... [smilie--sprite9]"}, {"58": "Angeduciel said:\t\t\tI like the new feature mechanics. It is not obvious at first but we can figure it out pretty quickly. But… the potion effects are very high in costs for \"not much improvement\" and they only provide effects for a very short duration!!![BR][BR]I am so disappointed! It is not appealing at all for advanced players. I am forcing myself to test this new feature to try to convince me I have missed something and so far, I am not even interested in using it on Live worlds.[BR][BR]Here some more detailed feedback where there is lots of room for improvement:[BR][BR]- Why having a probability of success in brewing a potion AND a probability of critical effect? Just one probability of brewing a potion is more then enough gambling for me. Give us the full effects we “studied for”![BR][BR]- It is not interesting to get multiple potion effects ALL AT THE SAME TIME + for a very short time duration. I’d like to be able to chose when I can use a potion… i.e. during events, FA. Tourney, spire whatever I prefer![BR][BR]- The goods production bonus only applies to the regular production quantity of our manufactories?! This is ridiculous.[BR][BR]- Unurium production comes mainly from trader and bonus from Wonders. I am at the end of chapter 20 and did not use much of the cultural buildings producing unurium. Why restrict the potion effect to those cultural buildings we barely use? You want to make things more appealing to us, put the bonus on what counts![BR][BR]- Seeds bonus has the same issue then unurium, to less of a degree but still, we have Wonder producing seeds (Elvenar Trade Center) and the potion does not improve its production. Same for the Trader seeds production![BR][BR]- It would have been more interesting to reset the costs of improving potion effects for each study phase, like we have for the trader costs. If not, this system is a total waste of resources just to get insignificant improvements here and there.[BR][BR]If I was doing a customer review, I would give 1 star and a DO NOT BUY recommendation.Click to expand...[BR]This is a very well written out explanation of how I and other players I know on Beta are feeling about the new Cauldron, as well. Thank you for the great explanation @Angeduciel !!![BR]This new feature that we were all so looking forward to has way too much confusion, gambling and RNG... like, way more than the usual annoying RNG we see during events. On top of that, you get to drain your resources into studying for very little worth in the end (in my opinion). [BR]No, thank you. [BR]I'll stick with what already works well for my game-play style. The ancient wonders, event buildings and regular chapter buildings work fine already for the tourney and spire, etc.. Nerf those (again) and I'm out of this game, for sure. [BR]As @ayvinul stated above, you're pushing your luck and testing our patience more and more, INNO. [BR]Your players and staff are being pushed too far and look how many have left over the last couple of years, as a result. [BR]I'm pretty sure Elvenar was intended to be enjoyable...not a rip off, cash grabbing cow that causes constant let down and frustration from those you're trying to sell to. This isn't some flashy, fake gambling app game, but seems like that may be where this poor game is headed. [BR]Be careful."}, {"12": "I read on the German Forum of someone claiming that the cost of the learning phase went down by about 10% over the next week.[BR]Can anybody confirm this?[BR]I wouldn't be able to check this myself until the end of the week because it doesn't make sense for me to brew the potion I want to use yet.[BR][BR]it would actually make sense if the cost would drop by a certain % from week to week.[BR]Beyond that, no idea if it makes any sense to level up several potions at all. There's so much randomness in the whole feature.[BR][BR]Can someone confirm if there are more than 100 levels?[BR]What is the maximum possible damage and duration of a damage potion?"}, {"16": "If my google translate is good enough, it's not 10% over next week, but 10% every night. And I guess it's not true, but a bug which display previous values of costs when you reopen studying UI. It get back to actual numbers after few reopenings (may be with some resource income/spent in between). But actually even if it shows numbers from previous run and even appropriate numbers flying over the HUD, these are only clientside, on the server you spend correct (increased) amount of resources. Wanted to make bug report about that, but need more tests to determine how  exactly it is bugged, and I probably won't have time to do it this week due to learning stage would be available for me max for a few hours.[BR]btw, another thing to check, would potion effects stay active after Sorceress would start her walk to the woods, if activated just before that."}, {"5": "Jammin said:\t\t\tI read on the German Forum of someone claiming that the cost of the learning phase went down by about 10% over the next week.[BR]Can anybody confirm this?[BR]I wouldn't be able to check this myself until the end of the week because it doesn't make sense for me to brew the potion I want to use yet.[BR][BR]it would actually make sense if the cost would drop by a certain % from week to week.[BR]Beyond that, no idea if it makes any sense to level up several potions at all. There's so much randomness in the whole feature.[BR][BR]Can someone confirm if there are more than 100 levels?[BR]What is the maximum possible damage and duration of a damage potion?\t\tClick to expand...[BR]No changes at all from where I leveled the boosts last week. And all the costs for witch points are at the same point where I left off also."}, {"82": "@Angeduciel @Karvest @CiraKelley @InnoGames : Yes - I write too much, and try to be too diplomatic - I agree 100% with these views.[BR][BR]The Cauldron seems to be a FAR too random - and Diamond-costly - way for players to gamble, without realising (in many cases) that they are.[BR][BR]Why do the potions have a random degree of basic success as well as a random chance of Critical success? This alone is very off-putting for me.[BR][BR]The lack of control over when we can use potions will probably discourage me from using the Cauldron at all, beyond trivial tinkering if I'm bored.[BR][BR]I agree that Inno is pushing its players, who play this game in almost all cases because they want a predictable building game, into a category where they don't and won't ever fit. There are enough mobile games out there which are built around gambling, but without Elvenar's slow grind. [BR][BR]There is still cheerful anticipation on Live, but it's already obvious from following the posted comments that the initial excitement is giving way to doubt - already. Again : the Cauldron could be a real boost to the game. As it is, it's a missed opportunity at best - a major mistake at worst.[BR][BR]Why, Inno? Players will pay for more reliable entertainment than gambling - and in Elvenar, the widespread RNG is already too much for many of us."}, {"88": "Jammin said:\t\t\tI read on the German Forum of someone claiming that the cost of the learning phase went down by about 10% over the next week.[BR]Can anybody confirm this?[BR]I wouldn't be able to check this myself until the end of the week because it doesn't make sense for me to brew the potion I want to use yet.[BR][BR]it would actually make sense if the cost would drop by a certain % from week to week.[BR]Beyond that, no idea if it makes any sense to level up several potions at all. There's so much randomness in the whole feature.[BR][BR]Can someone confirm if there are more than 100 levels?[BR]What is the maximum possible damage and duration of a damage potion?\t\tClick to expand...You may be right on the study cost reduction, they may have reduced but I am not sure by how much. Sorry about that.[BR][BR]For the potion improving my goods, I got 37.4% which make you believe that is not bad... but when you look at 3h production run, here how it looks like:[BR][IMG]https://i.ibb.co/mNdxTyt/https-beta-forum-elvenar-com-index-php-attachments-1670284432728-png-10541.png[/IMG][BR]nothing to celebrate about![BR][BR]It looks even worst when you apply a magical manufacturing spell: You get 465 goods as a potion bonus on a 26K production  [smilie--sprite12][BR][BR][IMG]https://i.ibb.co/RhNSMYB/https-beta-forum-elvenar-com-index-php-attachments-1670284708288-png-10542.png[/IMG]"}, {"48": "I \"loved\" the Spire from the first day[BR]And - I like the Cauldron  [smilie--sprite6]"}, {"2": "Wait did someone just imply that the German server is also testing this feature?"}, {"14": "Lelanya said:\t\t\tWait did someone just imply that the German server is also testing this feature?\t\tClick to expand...No, but I'm pretty sure that a lot of beta players are germans, and they're trying to calculate/figure out how cauldron exactly works."}, {"87": "i have leveled up the perk and now cost are so high , with 100% coin rain (4.4M ) i can't level more than 1%[BR][IMG]https://i.ibb.co/prZLgd6/https-beta-forum-elvenar-com-index-php-attachments-1670310969247-png-10543.png[/IMG][BR]and if i use marble it will cost more than 50 k ressource for 2 % more[BR][IMG]https://i.ibb.co/2ZTQfKq/https-beta-forum-elvenar-com-index-php-attachments-1670311173997-png-10544.png[/IMG][BR][BR]and my base production is only 100 / in 3 hours  , with +2% of the cauldron , it will give me 2 or 4 more marble per week / manuf[BR][BR]need 25  years !?!?!   for my 10 T1 manufacture  to cover the expanse [BR][BR][IMG]https://i.ibb.co/kcgKs5K/https-beta-forum-elvenar-com-index-php-attachments-boost-jpg-10545.jpg[/IMG][BR][BR][BR]for coin bonus my perk is less developed[BR][IMG]https://i.ibb.co/RjHd2Cv/https-beta-forum-elvenar-com-index-php-attachments-1670311891022-png-10546.png[/IMG][BR][BR]on level of perk give me +0.5% of production  ,one magic residence will give me 4200 coin per hour ==> 21 coin per hour[BR]with my 444 k expanse giving 1% 42 coin / h  with 10 magic residence , a few hours / week  perhaps need 100 week but as i have other perk , small chance that luck give me this effect , and as it's only a % of max value and % of max duration , it will take more likely 500 weeks to reimburse ...[BR][BR][BR][BR]CONCLUSION : don't level your perk !"}, {"89": "I do not like I find it useless, I will not play"}, {"9": "Leveling effects should also increase the chance for that skill. It's a shame when you level effect to very high level and still get something completely different (and useless) or nothing at all.[BR]What is the point of leveling any effect, when you can even never actualy get that effect active at all if unlucky enough in this gambling madness?"}, {"90": "Skillpowers said:\t\t\tthe effects are pretty nice already on high levels[BR][BR]View attachment 10485Click to expand...Hi Skillpowers, how come the amount you need to donate is so low?  I need to donate e.g. 259 marble just to get it from level 1 to 2 and I'm in woodelves chapter. Is it a matter of the higher you are or the further you are in the chapters, the less it costs?[BR][BR][IMG]https://i.ibb.co/YbRxY2b/https-beta-forum-elvenar-com-index-php-attachments-1670355984306-png-10553.png[/IMG]"}]