[{"90": "how does the trophy goblets work:   How many can you get in the tourny and after how many points?  Also the coin potion, why dont we see the effect is active in the houses or main hall for instance? The same with the others, eg. training increase. It would be nice to know its active and to what extent in the barracks, training grounds and mercernary camp when you put trains on"}, {"14": "Egwene al Vere said:\t\t\tHow many can you get in the tourny and after how many points?\t\tClick to expand...4: 200, 600, 1200, 1600[BR]plus 1 for free, so you can sure brew 1 potion"}, {"62": "Egwene al Vere said:\t\t\tHi Skillpowers, how come the amount you need to donate is so low?  I need to donate e.g. 259 marble just to get it from level 1 to 2 and I'm in woodelves chapter. Is it a matter of the higher you are or the further you are in the chapters, the less it costs?[BR][BR]View attachment 10553Click to expand...you can donate different resources , the witch points go up per resource you donate but you can switch between the resources so  if ur coins are lets say at 2m already for new witch points you can just switch to another resource that still are at low costs to get witch points."}, {"33": "Does the donation costs increases after each donation?[BR]Does the donation costs reset weekly?"}, {"5": "Prueba2 said:\t\t\tDoes the donation costs increases after each donation?[BR]Does the donation costs reset weekly?\t\tClick to expand...[BR]Each individual good goes up separately as you use it. Using one does not make all of them increase.[BR][BR]Nothing resets. The number you have for each type of good at the end of the week is the same number you start for each good the next week. This works like buying KP, not like using the wholesaler.[BR][BR]The amount of witch points you get per donation also does not reset and only goes higher as you donate goods."}, {"29": "For everyone. Small reminder: the boost always applies to the régular production ...[BR][BR]So if you have a boost 94,7 % it's 94,7 of the Regular Production. Regular prod 880: Boost 94,7 % => +834 [BR][BR][IMG]https://i.ibb.co/fQcrVJB/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-160001-png-10469.png[/IMG][IMG]https://i.ibb.co/R44NtPy/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-160617-png-10472.png[/IMG][BR][BR]Same thing here[BR][BR][IMG]https://i.ibb.co/7gpVzq7/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-155933-png-10468.png[/IMG] [IMG]https://i.ibb.co/NFM5dfk/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-160542-png-10471.png[/IMG]"}, {"12": "As for usefulness, everyone has their own opinion, but I find it rather impractical, costly, and strategically awkward to max out all military potions and then hope to trigger as many as possible while brewing.[BR]Hope isn't a strategy, if you're primarily fighting with mercenary units you want the damage and health boost and not the Barracks or the Training Ground.[BR][BR]Only if you can decide for yourself what is triggered when brewing does it make sense to level up all potions that are somehow useful."}, {"5": "Since I don't plan on doing much else with this, and I am at a slow point in chapter 18, I focused on just one boost, to see how high I could get it. I hope you all enjoy these ridiculous numbers:[BR][BR][IMG]https://i.ibb.co/ckG9cQj/https-beta-forum-elvenar-com-index-php-attachments-screenshot-118-png-10559.png[/IMG]"}, {"2": "I miss Marindor.  He would have had a convo with the Dev team, and given us feedback by now."}, {"87": "Enevhar Aldarion said:\t\t\tSince I don't plan on doing much else with this, and I am at a slow point in chapter 18, I focused on just one boost, to see how high I could get it. I hope you all enjoy these ridiculous numbers:\t\tClick to expand...more than 53 M marble or 50 supply windfall 100%  to maximize range for 0.2%  , big joke !"}, {"35": "guivou said:\t\t\tmore than 53 M marble or 50 supply windfall 100%  to maximize range for 0.2%  , big joke !\t\tClick to expand...i think thats the point? This feature won't go away fast, so take your time in levelling it. The point isnt to get it all to max in week 1..."}, {"33": "Heymrdiedier said:\t\t\ti think thats the point? This feature won't go away fast, so take your time in levelling it. The point isnt to get it all to max in week 1...\t\tClick to expand...Doing some math, at enough level all problemas could be lessened.[BR]General's Mayheim could last for enough to do both Tournament and Spire, (aroung 3.5 days, 84 hours)[BR]Only level 820 is needed, also bonus effect would be 168%.[BR][BR]Provided there is no maximum level...[BR]Provided potions does succeed...[BR]Provided General' Mayhem effect is selected...[BR]Provided maximum effect is rolled...[BR][BR]Provided all that, all the cons could be overcome...[BR][BR]EDIT: Not sure how to calculate how many years would be needed though..."}, {"45": "Prueba2 said:\t\t\tNot sure how to calculate how many years would be needed though...\t\tClick to expand...Ask @Bor de Wolf 1965???"}, {"91": "Skillpowers said:\t\t\tyou can donate different resources , the witch points go up per resource you donate but you can switch between the resources so  if ur coins are lets say at 2m already for new witch points you can just switch to another resource that still are at low costs to get witch points.\t\tClick to expand...This is very important information, and I did not fully understand that when reading it the first time.[BR]I want to highlight this again, especially since this is something I did not expect at all Oo.[BR]That is completely counter-intuitive for me.[BR][BR]The number of witch points you get is disconnected from the resource selection.[BR]In contrast to for example how trading with the wholesaler works.[BR]When you (for example) donate Gold, the number of witch points you get goes up to for example 300.[BR]Then when you change to stone, you will also get the same 300 witch points (for the current amount you need to pay stone)[BR][BR]So when you use one type of resource, the number of witch points per certain amount of that resource sinks.[BR]For example when you donate gold, you might need 395 gold per witch point, while after that donation you need 407 gold per witch point. (122k for 300 witch points)[BR]However, when you also donate one time from all the other resources, you can need approximately 394 gold again per witch point.[BR]Meaning: if you do that all \"very evenly\", then the price per witch point might not increase, just the amount you need to spend in one donation.[BR]You might reach a point where you need to donate more gold than you can store though.[BR]Similarly, you might need to gather resources for a week to make a donation, but you get lots of witch points.[BR]Short: Witch points don't get more expensive, just the size of the donation does get bigger. (if these numbers make it into production)[BR][BR]Using gold donations whenever you have some to spare seems to be a good strategy (same for supplies, if you don't use all for training).[BR]You can only hold a certain amount of gold and supplies anyways.[BR]This way your resource donations stay \"effective\"."}, {"91": "Jonerian said:\t\t\tThis is very important information, and I did not fully understand that when reading it the first time.[BR]I want to highlight this again, especially since this is something I did not expect at all Oo.[BR]That is completely counter-intuitive for me.[BR][BR]The number of witch points you get is disconnected from the resource selection.[BR]In contrast to for example how trading with the wholesaler works.[BR]When you (for example) donate Gold, the number of witch points you get goes up to for example 300.[BR]Then when you change to stone, you will also get the same 300 witch points (for the current amount you need to pay stone)[BR][BR]So when you use one type of resource, the number of witch points per certain amount of that resource sinks.[BR]For example when you donate gold, you might need 395 gold per witch point, while after that donation you need 407 gold per witch point. (122k for 300 witch points)[BR]However, when you also donate one time from all the other resources, you can need approximately 394 gold again per witch point.[BR]Meaning: if you do that all \"very evenly\", then the price per witch point might not increase, just the amount you need to spend in one donation.[BR]You might reach a point where you need to donate more gold than you can store though.[BR]Similarly, you might need to gather resources for a week to make a donation, but you get lots of witch points.[BR]Short: Witch points don't get more expensive, just the size of the donation does get bigger. (if these numbers make it into production)[BR][BR]Using gold donations whenever you have some to spare seems to be a good strategy (same for supplies, if you don't use all for training).[BR]You can only hold a certain amount of gold and supplies anyways.[BR]This way your resource donations stay \"effective\".\t\tClick to expand...Having then an effect that is determined by chance and lasts only for 5 hours is still not that useful though.[BR]So it is lots of investment for very short effects.[BR]I would only dump leftover coins in it."}, {"16": "Even distribution of resources just move the point were costs are too high a bit further. Costs increase is exponential while witch points increase is linear."}, {"91": "Karvest said:\t\t\tEven distribution of resources just move the point were costs are too high a bit further. Costs increase is exponential while witch points increase is linear.\t\tClick to expand...Indeed. The resource price increases by ca. 3 %, while the witch points increase by 1 (1 witch point, not %)[BR]And the level cost seem to increase by 10 %.[BR][BR]Well, now I did more calculations than I wanted to, for something that is overall not that useful."}, {"84": "So, double exponential increase in the costs? No matter what, the effect will never get close to a dwarven armorer or a fire chicken? Not even to the level of the production bonus of the mountain halls (which isn't great)? Oh boy.."}, {"33": "Vaeri said:\t\t\tYour potion will have different effects depending on what ingredients you choose in which order - so if you find a good one, be sure to pass it on to your friends and find out together how to create the best possible potion for your needs!\t\tClick to expand...Hi,[BR]as Devs cheered us to try to understand how different ingredients affect the different potions effects I would like to try to gather some info.[BR][BR]Please, I would need:[BR]* some (9) snapshoots of the first three ingredients (100, 010, 001, 200, 020, 002, 110, 101, 011)[BR]* indicate number of owned diplomas ( to relate it with available effects)[BR][BR]Thanks"}, {"82": "I didn't spot that line in the original Announcment, @Prueba2 - thanks for pointing it out! - so does this mean that if we DO discover which Ingredients and (?) which order of usage will (definitely? good chance? random chance?) create the Potion(s) we want, will those particular Ingredients remain identical, for that Potion, every time it's Brewed... and also, will those Ingredients randomly cost different Resources/Diamonds, week-to-week?[BR][BR]Or am I not understanding exactly how it works? I can't test on Beta as stated, earlier... many thanks if you, or anyone, can answer this?"}]