[{"87": "[IMG]https://i.ibb.co/BgqjhLM/https-beta-forum-elvenar-com-index-php-attachments-1670589515054-png-10581.png[/IMG][BR]on a forum i have seen some screnshot starting at 32 ressources , for my level 6 city it start at 750 ???? do we have all same starting value and same increase rate or it depend of level of the city ?"}, {"16": "Start value depends on amount of researched diplomas you have.[BR]From 1000 for 4 (or less) diplomas to 10 for 20 diplomas.[BR]For now exact formula is DonationCost =1000 * (1,03^howManyTimesYou'veAlreadyDonatedThisResource)*(0,75^(Max(0,howManyResearchDiplomasYouHave-4)))[BR]1000, 1.03, 075, 4 - are variables that can be changed for balancing."}, {"91": "Karvest said:\t\t\tStart value depends on amount of researched diplomas you have.[BR]From 1000 for 4 (or less) diplomas to 10 for 20 diplomas.[BR]For now exact formula is DonationCost =1000 * (1,03^howManyTimesYou'veAlreadyDonatedThisResource)*(0,75^(Max(0,howManyResearchDiplomasYouHave-4)))[BR]1000, 1.03, 075, 4 - are variables that can be changed for balancing.\t\tClick to expand...Thanks. That means the costs are lower the more diplomas you have.[BR](usually things get more difficult/expensive the further you progress in Elvenar)"}, {"84": "You can buy more points in total (for the same price), if you have more diplomas then? That's kinda wierd. You could blow up your costs in early chapters without getting much out of it and then that's that?"}, {"16": "You can buy more points, but at the same time you have more effects to level up and more trash which lowers your chances to get desired effects.[BR]Background thoughts of that formula are understandable - you receive additional effect => you need more points to level it up => you get some discount. But not sure if this discount is enough to level up even those 2-3 effects to a decent level."}, {"84": "Yeah, maybe... but at the point you catch up with the chapters, you have all that trash and you have gotten way less points..."}, {"29": "Chapter V and 4 diplomas, chapter VIII and 5 diplomas et chapter XIX and 16 diplomas[BR][BR][IMG]https://i.ibb.co/8gwhNP2/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-09-145507-png-10584.png[/IMG]........[IMG]https://i.ibb.co/g7V9Fv9/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-09-142238-png-10585.png[/IMG]..........[IMG]https://i.ibb.co/ySFc4MD/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-09-142118-png-10586.png[/IMG][BR][BR]So stupid for me"}, {"12": "Laurelin-Beta said:\t\t\tI didn't spot that line in the original Announcment, @Prueba2 - thanks for pointing it out! - so does this mean that if we DO discover which Ingredients and (?) which order of usage will (definitely? good chance? random chance?) create the Potion(s) we want, will those particular Ingredients remain identical, for that Potion, every time it's Brewed... and also, will those Ingredients randomly cost different Resources/Diamonds, week-to-week?[BR][BR]Or am I not understanding exactly how it works? I can't test on Beta as stated, earlier... many thanks if you, or anyone, can answer this?\t\tClick to expand...The ingredients always have the same effect on the potions, there are ingredients that have a particularly good effect on a certain potion and some that only have a little effect on this potion, but are particularly good on another.[BR][BR]It's always best to start with the ingredient that works best for your favorite potion (4 or 5-6 times) until it's too expensive and you're better off reaching for second best. But never the third or fourth best, because that leaves too much garbage in the cauldron, which gets a chance be brewed."}, {"87": "incredible and unfair that small player with a poor production( so very poor gain) , have to pay incredibly more ....[BR][BR]1000 marble ere 5 : production 173 marble / day ==> 5.7 day[BR]750 marble ere 8 : production 373 marble / day ==> 2 day[BR]32 marble ere 16 : production 750 marble 3h => 8 minutes !!!![BR][BR][BR]and starting coin and tools at the same value  is idiot , capacity of main hall is 10 time higher for coin"}, {"82": "@Jammin : Thank you! I can't 'see' maths (wrong type of brain) and it helps greatly whenever you put it into words like this. I'm very grateful.[BR][BR]@guivou : It looks like a Resource and Diamond (for the unwary) sink aimed primarily at small new Cities... a slow and constant one. Interesting."}, {"16": "At least effects are still active after Sorceress has gone to the wood.[BR]Spoiler: screenshot[IMG]https://i.ibb.co/PYDXPdZ/https-beta-forum-elvenar-com-index-php-attachments-1670627743703-png-10589.png[/IMG]"}, {"85": "Laurelin-Beta said:\t\t\tIt looks like a Resource and Diamond (for the unwary) sink aimed primarily at small new Cities... a slow and constant one. Interesting.\t\tClick to expand...As has been stated in Inno‘s official video promoting the Cauldron, it’s supposed to be a kind of present for the long-term players. [BR]I‘ve been wondering if it is intended to alleviate the effects of the tournament formula on late-chapter cities. It’s certainly intended to reward progressing through the chapters.[BR][BR]To prevent young cities from wasting a lot of resources on the Cauldron, it should be expressed very clearly that the costs for studying effects will decrease with each completed chapter and that in the beginning, it may be wise to only invest the free witch points you get every week. The quest givers who could have explained this have now been disabled by the season feature. It may however be possible to incorporate this in the chapter-specific quests (or to find another way how to communicate this - not hidden behind some “?”)."}, {"24": "Hazel Caballus said:\t\t\tAs has been stated in Inno‘s official video promoting the Cauldron, it’s supposed to be a kind of present for the long-term players.[BR]I‘ve been wondering if it is intended to alleviate the effects of the tournament formula on late-chapter cities. It’s certainly intended to reward progressing through the chapters.\t\tClick to expand...[BR]It is aimed more for longer term players or parked town. The whole point is to be a sink to drop the excess resources, which takes time to accumulate. So people with 1million spell fragments or 30 pages of inventory, or 100 million goods, etc have somewhere to drop those resources. Also gives end tech players something other than wonders to play with while waiting."}, {"92": "Karvest said:\t\t\tAt least effects are still active after Sorceress has gone to the wood.\t\tClick to expand...I wonder if it would be possible to stack effects by leveling effect duration to >24h and then doing one cauldron shortly before she goes to the woods and another shortly after she comes back."}, {"19": "Ainor said:\t\t\tyou obtain max bonus if success rate is 100% (using 25 ingredients), I think\t\tClick to expand...Yes with 25 ingredients you are certain of getting effects. But my problem is that at near the end of Woodelves, I only have enough witchpoints to use 11 ingredients max, not 25. Less than 11 if I want to use the same ingredient more often than others to increase the chances of a certain effect. MUCH less if I wanted to use 2 of the same ingredients more often than other ingredients for the same reason.[BR]Using 25 sounds nice, but since the amount of witchpoints is based on the amount of techs one has completed that again is something for end-game players, not mid-game players. And definitely not for players in earlier chapters. I have one testcity on beta which is chapter 6; that one can hardly do anything with this set-up since the chances of succes are abysmally low."}, {"19": "Jammin said:\t\t\tI'm almost with you, late-game players benefit more from the potions, but not really much more.[BR]These effects are very weak and very short, even if they have a high level and when brewing a potion, the random generator ensures that you don't always get the maximum out of the potion, no matter how high its lvl is. (Similar to e.g. tournaments, the min and maximum damage of troops is drawn randomly before attack.)[BR][BR]I actually only see a meaningful use if there is no hardcap for the level of the potions, then you could actually level a pretty good potion at some point. Or as you write when the potions become stackable.[BR][BR]I'm also surprised that two diplomas aren't currently implemented in the cauldron, which could be pretty good without a hardcap or stackable.[BR][BR]Troop Production Bonus & Troop Revival\t\tClick to expand...I disagree.[BR]Let's take the bonuses on troops; health and damage.[BR]For someone in lower chapters, the reset time for the tourney is 16 hours. MAYBE if someone is lucky (or very dedicated) he can craft a Polar Bear and up it to stage 10, taking 20% of that reset time off, but that's it. So the reset time at best will be a bit over 12 hours. WAY longer than any potion effect, so at best one can get that bonus (or multiple ones) for 1 round of tourney in a week, plus the entire Spire if one uses a lot of timeboosters.[BR]A late-game player with a high lvl Timewarp will be much more likely to already have the Polar Bear, and if not will find it way easier to craft it and craft the artifacts to bring it to stage 10, so can basically do the entire tourney (thinking about 25-30 provinces here for instance) in say, an hour. Maybe 2 if one wants to do some more of the battles manually, 3 hours perhaps if you want to do most manually. [BR]So a late game player will find it easier to get more effects, since he can use more ingredients, as he obviously has more finished techs. That late game player will then be able to have the bonuses for those effects work in all 6 rounds of the Tourney and can use the timeboosters to do the Spire too. So if we strike the Spire of each player against each other, it means the late game player will have 6x as much use of the effects, will have more effects and will find it easier to upgrade them to the max.[BR][BR]This addition is -in the way it has been implemented now- something that has no discernable effect for anyone but late-game players.[BR]In beta, I don't have much use for it. On live servers I'm at the end of the techtree, and expect this to be a ridiculously nice addition which will greatly reduce my losses in troops."}, {"72": "Dhurrin said:\t\t\tI have one testcity on beta which is chapter 6; that one can hardly do anything with this set-up since the chances of succes are abysmally low.\t\tClick to expand...My beta city is in start chapter 6, and I think the cauldron is useful. The first week I spent some coins and supplies to level up the barracks strength effect to level 35. This week I experimented with the different ingredients and found a way to get the barracks strength effect with 41.2% probability:[BR][IMG]https://i.ibb.co/nmt6DJc/https-lh4-googleusercontent-com-3tl-LCbc-F-x-BSH5-HVXZCGQz6z-UYe-VKy-RMBZNyx8-VW-Az-FSl-Jem-Lu-PYFTO.png[/IMG][BR]I had been lazy in tourney (I am not that active in beta...), so I only had 3 goblets, but could have had 5. With 5 goblets I expect I would be able to get the barracks strength effect 93% of all weeks. (The probability to not get the effect a week with 5 attempts is (1-0.412)^5 = 0.07).[BR]With my 3 goblets I got it once:[BR][IMG]https://i.ibb.co/c1LsCtV/https-lh6-googleusercontent-com-7sj-vjh-V87-Rcbngl-Fo-Q-M-4me10s-JYSz7pkld-Ess-N0w-TNI49-Doe4dc-Tj-L.png[/IMG][BR]And yes, it only helps for one tourney round. But I usually time boost my way up through the spire, so by doing that it would help for a full spire and 1 tourney round. 6.5% may not sound of much compared to 50% from a level 10 fire phoenix. But compared to a level 10 twilight phoenix who revives 5% of the troops when fed I think it is ok - the cauldron doesn't need pet food, and the twilight phoenix only lasts 12 hours per pet food, so that is also only 1 spire and 1 tourney round. And over time I expect the effect to improve if I keep leveling it up in the study phase."}, {"16": "The problem is once you get more potion effects, same ingredients layout will give you way less probability of desired effect."}, {"85": "That’s the best recipe I found for my end-of-constructs city:[BR][IMG]https://i.ibb.co/gPzpRc5/https-beta-forum-elvenar-com-index-php-attachments-9b254efa-f059-4f9c-8d5b-fca6250703df-jpeg-10593.jpg[/IMG][BR]Edit: Best in terms of highest probability for General’s Mayhem effect and highest overall success rate.[BR]I had 5 goblets and received 4 different effects, but not the one with the highest probability."}, {"19": "The Fairy said:\t\t\tMy beta city is in start chapter 6, and I think the cauldron is useful. The first week I spent some coins and supplies to level up the barracks strength effect to level 35. This week I experimented with the different ingredients and found a way to get the barracks strength effect with 41.2% probability:[BR][IMG]https://i.ibb.co/nmt6DJc/https-lh4-googleusercontent-com-3tl-LCbc-F-x-BSH5-HVXZCGQz6z-UYe-VKy-RMBZNyx8-VW-Az-FSl-Jem-Lu-PYFTO.png[/IMG][BR]I had been lazy in tourney (I am not that active in beta...), so I only had 3 goblets, but could have had 5. With 5 goblets I expect I would be able to get the barracks strength effect 93% of all weeks. (The probability to not get the effect a week with 5 attempts is (1-0.412)^5 = 0.07).[BR]With my 3 goblets I got it once:[BR][IMG]https://i.ibb.co/c1LsCtV/https-lh6-googleusercontent-com-7sj-vjh-V87-Rcbngl-Fo-Q-M-4me10s-JYSz7pkld-Ess-N0w-TNI49-Doe4dc-Tj-L.png[/IMG][BR]And yes, it only helps for one tourney round. But I usually time boost my way up through the spire, so by doing that it would help for a full spire and 1 tourney round. 6.5% may not sound of much compared to 50% from a level 10 fire phoenix. But compared to a level 10 twilight phoenix who revives 5% of the troops when fed I think it is ok - the cauldron doesn't need pet food, and the twilight phoenix only lasts 12 hours per pet food, so that is also only 1 spire and 1 tourney round. And over time I expect the effect to improve if I keep leveling it up in the study phase.\t\tClick to expand...That may be fair enough, everything helps. But it hardly compares to an UUU, or ELR, or MMM, or a DA from the Spire.[BR]My point was to show that it is an end-game feature as those players will have far more, more powerful and longer lasting effects from the cauldron AND a higher chance of success.[BR]As I stated in another post; with 4 goblets I had 2x 'no effect' and 1 effect 2x, which means only one effect. And the chances of getting effects increase with the amount of ingredients one can use, which is directly linked to the amount of techs one has completed. So players at mid-level have a much lower chance of even getting effects."}]