[{"16": "There is no reason to maximize overall success rate if you need only 1-2-3 effects from there, better maximize their probability and don't care about overall success (getting not desired effect is not success, it's failure, especially if you've donated some spell fragments to increase effects power, better get some fragments back)."}, {"12": "Dhurrin said:\t\t\tI disagree.[BR]Let's take the bonuses on troops; health and damage.[BR]For someone in lower chapters, the reset time for the tourney is 16 hours. MAYBE if someone is lucky (or very dedicated) he can craft a Polar Bear and up it to stage 10, taking 20% of that reset time off, but that's it. So the reset time at best will be a bit over 12 hours. WAY longer than any potion effect, so at best one can get that bonus (or multiple ones) for 1 round of tourney in a week, plus the entire Spire if one uses a lot of timeboosters.[BR]A late-game player with a high lvl Timewarp will be much more likely to already have the Polar Bear, and if not will find it way easier to craft it and craft the artifacts to bring it to stage 10, so can basically do the entire tourney (thinking about 25-30 provinces here for instance) in say, an hour. Maybe 2 if one wants to do some more of the battles manually, 3 hours perhaps if you want to do most manually.[BR]So a late game player will find it easier to get more effects, since he can use more ingredients, as he obviously has more finished techs. That late game player will then be able to have the bonuses for those effects work in all 6 rounds of the Tourney and can use the timeboosters to do the Spire too. So if we strike the Spire of each player against each other, it means the late game player will have 6x as much use of the effects, will have more effects and will find it easier to upgrade them to the max.[BR][BR]This addition is -in the way it has been implemented now- something that has no discernable effect for anyone but late-game players.[BR]In beta, I don't have much use for it. On live servers I'm at the end of the techtree, and expect this to be a ridiculously nice addition which will greatly reduce my losses in troops.\t\tClick to expand...Everything you write is correct, but I see it from a different perspective, let me explain... a late-game player needs at least 290% bonus damage and at least 105% health for his 70+ tournament provinces, insofar he fights manually.  If he fight everything automatically, you can easily multiply these numbers by 3.[BR][BR]Such a potion gives how much bonus damage 10-15% ? 20%?[BR]What difference does it make when you need at least 290%?[BR][BR]Additionally, due to the short lifespan of the potion, using time buffs (e.g. in the Spire) is a disaster in my eyes. With all these wasted timebuffs, could be produced troops and thereby outperform the potion's usefulness by a factor of 1000.[BR][BR]A small player is as little dependent on this potion as the late-game player, the small player does not have so many available tournament provinces that it would even be worth feeding a phoenix or providing tournament boosters.[BR][BR]I'm in chapter 8 on beta, I'm making a little over 4K tournament points every week with no support. Yes, I brew the potion because I can, but mostly because I can afford to level it up. [BR]But what this potion offers me, I could do without.[BR]I would never consider wasting time buffs for 10% bonus damage to maximize the benefit."}, {"5": "Jammin said:\t\t\tEverything you write is correct, but I see it from a different perspective, let me explain... a late-game player needs at least 290% bonus damage and at least 105% health for his 70+ tournament provinces, insofar he fights manually.  If he fight everything automatically, you can easily multiply these numbers by 3.\t\tClick to expand...[BR]So the whole 1%, maybe, of all players on all servers? How about for the 80-90% of players who never go past the 20th province? I think Inno pays more attention to them, than to some tiny, tiny minority of the player-base."}, {"12": "Enevhar Aldarion said:\t\t\tSo the whole 1%, maybe, of all players on all servers? How about for the 80-90% of players who never go past the 20th province? I think Inno pays more attention to them, than to some tiny, tiny minority of the player-base.\t\tClick to expand...Jammin said:\t\t\tA small player is as little dependent on this potion as the late-game player, the small player does not have so many available tournament provinces that it would even be worth feeding a phoenix or providing tournament boosters.[BR][BR]I'm in chapter 8 on beta, I'm making a little over 4K tournament points every week with no support. Yes, I brew the potion because I can, but mostly because I can afford to level it up.[BR]But what this potion offers me, I could do without.[BR]I would never consider wasting time buffs for 10% bonus damage to maximize the benefit.\t\tClick to expand...Players who only make 20 tournament provinces can ignore all combat support in the game.[BR]Seriously, why would anyone need a phoenix, tournament boosters or the cauldron with their military potions for 20 tournament provinces?[BR]You don't even have to keep your eyes open for that."}, {"5": "Jammin said:\t\t\tPlayers who only make 20 tournament provinces can ignore all combat support in the game.[BR]Seriously, why would anyone need a phoenix, tournament boosters or the cauldron with their military potions for 20 tournament provinces?[BR]You don't even have to keep your eyes open for that.\t\tClick to expand...[BR]I have all that and still lose auto-fights in the first 20 provinces. Don't push your manual fighting view on people who hate playing that way."}, {"12": "Enevhar Aldarion said:\t\t\tI have all that and still lose auto-fights in the first 20 provinces. Don't push your manual fighting view on people who hate playing that way.\t\tClick to expand...I'm sorry, I'll try to explain this but first, it's not my intention to offend anyone.[BR]I won't deny that this hasn't happened to me before.[BR]But I understand why this is happening, it will continue to happen and extra bonus damage won't change that.[BR][BR]There are provinces that have such crappy terrain that even if you pick the perfect troop setup, you can have a total failure because your troops just can't get out... meaning the troops are surrounded by obstacles and are literally sniped away.[BR][BR]Therefore, as a small player, I always proceed in such a way that I orientate myself on the stars of my and the enemy troops when it is appropriate to negotiate one or the other province in the back section.[BR]Once you have 2 star troops and face 3 star troops, unfavorable terrain can cause a total failure.[BR][BR]If your own troops already have 3 stars, the decision to negotiate or fight is based on the enemy formation if the force ratio is about the same, your own troops can usually deal with one enemy counter unit, but with two it could be problematic.[BR][BR]For example, the enemies have a Stoneling and 4 Mages[BR]You take 5 archers and most likely win[BR][BR]There are 2 Stonelings and 3 Mages with the enemies[BR]if you take 5 archers you will most likely lose, it would be better to negotiate .[BR][BR]That's exactly my view of things, as a small player you don't have that many provinces and then you already negotiate the unfavorable ones anyway, so I wrote in the above posts that it's not worth setting up combat support for 20 provinces because you have very little benefit from it.[BR][BR]Only with access to 3 star mercenary units do you get the initiative, mobility and range to play extensive strategic tournaments and fully benefit from the tournament supporters.[BR]At least as an elf[BR][BR]However, from then on you have to bring a lot of damage and life bonus with you, otherwise it won't work.[BR][BR]And here comes the usefulness of the cauldron, which in my eyes does not bring enough to dance naked for.[BR][BR]Edit: I forgot to mention that if I don't negotiate, I've only fought automatically on Beta so far."}, {"93": "I also want to note @Dhurrin , that as a chapter 15 player with Zero Tournament Cool down, I still cannot play the whole tournament with one brewing effect, because I have to earn the goblets in the tournament first (5 goblets cost me 30 Provinces to 6 Stars, if I remember it correctly) and whatever I do in tournament AFTER that, profits from the tiny brewing effect of 10-15%.  In my case, 5 cauldrons yielded NO general mayhem, in spite of brewing it to a 34% probability for the mayhem effect and 88% success chance."}, {"16": "5 goblets is less than 10 provinces up to 5 stars"}, {"93": "PrimroseSylvia said:\t\t\t4: 200, 600, 1200, 1600[BR]plus 1 for free, so you can sure brew 1 potion\t\tClick to expand...Oh, I posted too hastily. Seems like a maximum of 5 goblets can be obtained and this already after doing 1600 tournament points."}, {"16": "200, 600, 1200, and 2000, according to announcement and what I see in FS tournament tab"}, {"91": "Karvest said:\t\t\tStart value depends on amount of researched diplomas you have.[BR]From 1000 for 4 (or less) diplomas to 10 for 20 diplomas.[BR]For now exact formula is DonationCost =1000 * (1,03^howManyTimesYou'veAlreadyDonatedThisResource)*(0,75^(Min(0,howManyResearchDiplomasYouHave-4)))[BR]1000, 1.03, 075, 4 - are variables that can be changed for balancing.\t\tClick to expand...@Karvest:[BR]You meant Max(0,howManyResearchDiplomasYouHave-4), right?[BR]That is how I read it, but re-checking I see the Min(), which wouldn't make much sense."}, {"16": "Min() here is to stop from going negative. You get the same 0 for 1-4 diplomas and it starts growing for more diplomas."}, {"91": "How can Min() stop from getting negative?[BR]Max() stops from getting negative.[BR]Or did you mean Abs(Min(..))?[BR][BR]For d = 0 diplomas:[BR]Min(0, 0-4) = Min(0, -4) = -4[BR]However: Max(0, -4) = 0[BR][BR]And for 20 diplomas:[BR]Min(0, 20-4) = Min(0, 16) = 0[BR]Max(0, 16) = 16[BR][BR]Anyways, with Min that would be: 3000 for no diplomas and 1000 for >= 4 diplomas.[BR]With Max that would be the 1000 for 4 or less and 10 for 20 diplomas, like mentioned before.[BR]That is why I though Max() might be what you meant."}, {"16": "oh, was sleeping while writing. Of course, max()..."}, {"91": "Happens. I also didn't read it correctly before :-D[BR][BR]EDIT:[BR]Also thanks for deriving that formula."}, {"59": "Could we expect cauldron on live before Christmas? Or rather January 2023?"}, {"64": "Arthus said:\t\t\tCould we expect cauldron on live before Christmas? Or rather January 2023?\t\tClick to expand...I expect cauldron on live for eastern, not earlier. It has to be testet on beta and now christmas is coming and all work will be layed down for about three weeks."}, {"94": "Arthus said:\t\t\tCould we expect cauldron on live before Christmas? Or rather January 2023?\t\tClick to expand...They said on their live q&a last week that the cauldron and seasons would start next year for the live servers. [smilie--sprite1]"}, {"19": "Jammin said:\t\t\tEverything you write is correct, but I see it from a different perspective, let me explain... a late-game player needs at least 290% bonus damage and at least 105% health for his 70+ tournament provinces, insofar he fights manually.  If he fight everything automatically, you can easily multiply these numbers by 3.[BR][BR]Such a potion gives how much bonus damage 10-15% ? 20%?[BR]What difference does it make when you need at least 290%?[BR][BR]Additionally, due to the short lifespan of the potion, using time buffs (e.g. in the Spire) is a disaster in my eyes. With all these wasted timebuffs, could be produced troops and thereby outperform the potion's usefulness by a factor of 1000.[BR][BR]A small player is as little dependent on this potion as the late-game player, the small player does not have so many available tournament provinces that it would even be worth feeding a phoenix or providing tournament boosters.[BR][BR]I'm in chapter 8 on beta, I'm making a little over 4K tournament points every week with no support. Yes, I brew the potion because I can, but mostly because I can afford to level it up.[BR]But what this potion offers me, I could do without.[BR]I would never consider wasting time buffs for 10% bonus damage to maximize the benefit.\t\tClick to expand...You are not talking about end-game players, you are talking about heavy tourney players, which is not exactly the same. Those groups overlap, but are very different.[BR][BR]I have been in a tourney-focused FS for a while, but those were not all end-game players.[BR][BR]And now I'm in a FS with many end-game players, but none of them even attempts to do 60-70 or more provinces on a weekly basis, even though my FS is the 4th in rank.[BR]I may be at the end of the techtree, but I'm more than happy with 30-35 provinces each week as I don't have the time, nor any desire to spend on trying to do 60+ every week.[BR][BR]Your combinations of end-game AND heavy tourney players is just a tiny fraction of 1% of all the players.[BR]The end-game players is already a (much) larger group. For those in late-game who are not tourney obsessed the Cauldron will make a pretty large impact as I said, because they can enjoy the effect over multiple rounds.[BR]The vast, vast majority of players is neither end-game nor tourney obsessed and for them the Cauldron is almost worthless.[BR]The mathematical impact of say 10% bonus over 1 round vs 10% over 5-6 rounds is absolutely huge, which is why I say this feature has almost no benefit for most players.[BR][BR]IF (and it is a big IF) a low-mid game player gets the combat bonus from the Cauldron it will be for 1 round, we have establised that. But their chances of getting those effects are way lower too. Both weeks so far I have not gotten any of those effects.[BR][BR]-[BR][BR]As for wasted timebuffs in the Spire; that would be so if it would be only Cauldron related. But for me it is standard practice because it is tied to the duration of the boosterbuildings and the feeding of the bird."}, {"19": "Avocado said:\t\t\tI also want to note @Dhurrin , that as a chapter 15 player with Zero Tournament Cool down, I still cannot play the whole tournament with one brewing effect, because I have to earn the goblets in the tournament first (5 goblets cost me 30 Provinces to 6 Stars, if I remember it correctly) and whatever I do in tournament AFTER that, profits from the tiny brewing effect of 10-15%.  In my case, 5 cauldrons yielded NO general mayhem, in spite of brewing it to a 34% probability for the mayhem effect and 88% success chance.\t\tClick to expand...Exactly one of my problems. The rate of success is abysmally low. Both weeks I have brewed so far I have not had any of the military booster effects. [BR]But goblets I earn this week will be available next week, so one would have to shift.[BR]All in all I like the concept, but the execution is...well...let me call it 'rather less than optimal' to avoid words people don't like seeing on a forum."}]