[{"12": "@Dhurrin, after reading your post, I had to think about what I was actually arguing against [smilie--sprite1][BR][BR]Ok I see that I was judging the utility from a tournament junkie's point of view, I can't imagine how useful such a potion is to others or how much use they see in it.[BR][BR]I certainly don't see much for myself.[BR][BR]I'm aware that little players get little or nothing from it, I'm totally with you on that, as I said I'm in Chapter 8 and I know that all too well.[BR]The same applies to Twilight Phoenix and Fire Phoenix, if you don't have a time loop yet, you can see the benefits differently."}, {"19": "Jammin said:\t\t\t@Dhurrin, after reading your post, I had to think about what I was actually arguing against [smilie--sprite1][BR][BR]Ok I see that I was judging the utility from a tournament junkie's point of view, I can't imagine how useful such a potion is to others or how much use they see in it.[BR][BR]I certainly don't see much for myself.[BR][BR]I'm aware that little players get little or nothing from it, I'm totally with you on that, as I said I'm in Chapter 8 and I know that all too well.[BR]The same applies to Twilight Phoenix and Fire Phoenix, if you don't have a time loop yet, you can see the benefits differently.\t\tClick to expand...*LOL*...I forget sometimes how much effort some people put into the tourney. I had some friends in an Eastern-European group at one time who all did at least 40 provinces for 6 rounds each week and already thought that was insane, especially since they were doing that before the Timewarp came around.[BR]But for me it's a game. When it becomes a chore it's no longer fun and spending that much time and resources on it is a chore for me.[BR][BR]As I said, on the live server I usually do about 30 provinces for 6 rounds each week, or a few more. During events sometime a bit less as I keep some for quests and then forget about them, but 30-35*6  rounds is the norm.[BR]Since I do them all in 1 sitting, the potion effects will be nice (1 UUU, 1 ELR, 1 MMM in use each week (or rather,1 of each/ 2 weeks as I place them on Thursday night and still enjoy the effect on Tuesday night) the birds fed of course. For that 1 sitting each week on this amount of provinces the potion effects will probably be noticeble. Or at least should be.[BR]Once it goes live I'll be keeping track of the difference in losses in Spire and tourney for an 18 week cycle, one week with brewing, 1 week without, for 2 complete cycles to compare and calculate.[BR][BR]I would love to do the same in beta, with fewer provinces of course, but so far haven't even gotten one of the military effects. That alone makes it really hard to make any kind of serious comparison on the overall effect, more so since it only affects 1 round if I ever get one. [BR]The bird at least one can chose to feed (or could, don't have it on beta), boosterbuildings one can place, but this is going to be too much chance for me on beta to be able to count of getting data to compare, where the chances of getting at least 1 of those effects on live will be much, much greater and thus a good comparison can be made.[BR][BR]The problem with comparing is that 2, or even a handful of times, won't give me enough data to really compare, I'll need a longer stretch to be able to give a more accurate reflection of the real effects, which I will compare by the numbers of squads of each type lost vs the average of numbers of squads of each type lost during each week (which I have been tracking for myself for a pretty good time now, so I know what to expect and what the regular standard-deviation is for each week).[BR][BR]The firebird, btw at least has a 24 hour effect, meaning that everyone who has that up can get at least 2 tourney rounds of effect out of 1 feeding, and if planned well say...the last part of the 1st floor and the entire 2nd floor with just some minimal timebuffs.. Probably 3 tourney rounds if one has the Polar bear fed.[BR]So compared to that the Cauldron seems really puny, especially with so much depending on chance.[BR][BR]And yes, for tourney junkies the effect is going to be minimal. But at that level EVERYTHING in itself is going to be minimal, it just is going to be an additional bit to gain an edge.[BR]For the not-tourney junkies like me I think it will be making a serious impact in late game, but almost nothing for cities before that. I guess I'll have to wait and see until it goes live and my cycle of testing is complete what the effect is going to be for me and whether it is something I'll incorporate in regular play or not."}, {"12": "Dhurrin said:\t\t\tOnce it goes live I'll be keeping track of the difference in losses in Spire and tourney for an 18 week cycle, one week with brewing, 1 week without, for 2 complete cycles to compare and calculate.\t\tClick to expand...I don't want to curb your enthusiasm for calculating the benefit, but I think that you will put a lot of work into it without getting a clear result.[BR]There are just too many variables to draw a definitive conclusion... just a small error in troop deployment can cause devastating casualties without the additional potion damage being involved.[BR][BR]I can't judge how useful this will be in auto combat, but if you fight manually you will certainly be able to save a few more troops, but the difference won't be that big, because a small mistake can upset everything again."}, {"5": "I posted earlier in the thread the image of what I was able to do with millions of goods and resources, just trying to get a single effect up to a good level. That is in a city early in chapter 18 with all research done in 15 of the previous 17 chapters, so my costs did not start quite as low as they could have. I looked at the different ingredients this week, to see how best to get the Barracks damage boost to have a good chance to occur. Using only this week's non-diamond ingredients, I got it to a 40% chance to get and about 80% chance to get any effect at all. That is the limit for only having 15 chapters worth of witch points to use each week for the ingredients, without also spending diamonds.[BR][BR]Now, when this goes to the Live servers, where I have my city that has completed all 20 chapters, including all research, and has 10x the amount of goods saved up that I had here, I am not even sure I will bother with the Cauldron at all there, after experimenting with it here."}, {"9": "Well, i will bother with Cauldron on live, there is still a chance i can get the effect i want once or twice per year.[BR][BR]OT: I'm actualy surprised that anyone can do 70 provinces regularly. I myself can afford to do it once per 9 week cycle - if i would do it more often i would run out of time instants as well as boosting buildings. Does the manual fighting make so much difference? Or does it require also stopping research, having small wonder levels & so little expansions as possible?[BR](my expansions & wonder levels made my tourney squad size so big that going to 70+ provinces wipes out thousands hours of time instats in army training (and that is with the bonus of lv 35 Simia & 2 brown bears))."}, {"19": "Jammin said:\t\t\tI don't want to curb your enthusiasm for calculating the benefit, but I think that you will put a lot of work into it without getting a clear result.[BR]There are just too many variables to draw a definitive conclusion... just a small error in troop deployment can cause devastating casualties without the additional potion damage being involved.[BR][BR]I can't judge how useful this will be in auto combat, but if you fight manually you will certainly be able to save a few more troops, but the difference won't be that big, because a small mistake can upset everything again.\t\tClick to expand...True enough, but those extremes should be balanced in an 18 week cycle to give a reasonable estimate of the effect.[BR][BR]Besides, for someone who is kinda obsessed with data it's something I would be doing anyway"}, {"12": "Lovec Krys said:\t\t\tWell, i will bother with Cauldron on live, there is still a chance i can get the effect i want once or twice per year.[BR][BR]OT: I'm actualy surprised that anyone can do 70 provinces regularly. I myself can afford to do it once per 9 week cycle - if i would do it more often i would run out of time instants as well as boosting buildings. Does the manual fighting make so much difference? Or does it require also stopping research, having small wonder levels & so little expansions as possible?[BR](my expansions & wonder levels made my tourney squad size so big that going to 70+ provinces wipes out thousands hours of time instats in army training (and that is with the bonus of lv 35 Simia & 2 brown bears)).\t\tClick to expand...Huhu, I know that doesn't quite fit here, please forgive me.[BR]I can translate here with Google Chrome and right click on German if necessary.[BR]I have a link to posts dealing with this topic but it's all in German.[BR][BR]Chapters 18 and 19 are primarily worthwhile for fighters?[BR]I don't know how much this will help you in translating to English but with the right strategy you can always go a long way.[BR][BR]Of course, with one tournament-focused city that's actually a military base is faring much better.[BR]Also, manual combat makes a huge difference, but it's time consuming and often exhausting."}, {"9": "Sorry for OT:[BR]@Jammin I do only autofights, manual fights takes simply too much time.[BR]Before the tournament formula change my average was over 10k (and rising). Now i just do regularly 30-31 provinces.[BR]But thx. to the tournament formula my squad size is simply too big at the end of the ch20 (& wonder levels 700+ and expansions at 170). Basicaly the only reason i do the 70+ provinces once per cycle is to get some points out of the tournament and to prove i can still go all way in (with enough supporting temp. buildings).[BR](i have enough resources (time instants & temp. buildings) to do it several times before running out of them, but going all out in all tournaments is simply not sustainable for my tmie instants & temp. buildings income. But my next all-in tournament is closing, so i  can post some squad sizes and negotiating costs from it (i remember only 2 milion mana for a single 70+ province encounter negotiation)).[BR][BR]ps: For the Cauldron, without effect levels affecting chance, it's just a gabmle with low chances to get any usefull effect."}, {"48": "The cauldron after 2 weeks[BR][BR]Every week - I got the desired effect for the troops [smilie--sprite1][BR][BR]And some other effects [BR]These effects were also - a little - good for my city [BR][BR]I increased the ingredients for the troops [BR]I do that every week[BR][BR]The effect for the troop-ingredients shows me the maximum possibility[BR]It could come - not, it comes[BR][BR]The cauldron:[BR]There is something for every city[BR]Better Troops[BR]Better Productions (Goods, Tools, Divine Seed, Mana)[BR][BR]A benefit here – a benefit there[BR]This is better than nothing[BR][BR]I like the cauldron  [smilie--sprite6]"}, {"12": "Lovec Krys said:\t\t\tmy squad size is simply too big at the end of the ch20\t\tClick to expand...Jup, I am very well aware of that, so I started this topic to get confirmation from players in these chapters to show INNO that the chapters contribute too few advantages to encourage players who enjoy tournaments to do research again.[BR][BR]Honestly, it backfired because most players who were already in those chapters don't want to admit that they're already disqualified from the tournament.[BR][BR]Basically, this is normal human behavior.[BR]Then of course there is the great argument that only 1% of players are interested in the tournament and that it doesn't matter what these players want.[BR]It always makes me laugh, if that were the case there wouldn't have been such an apocalyptic scream when the tournament changes were introduced...remember over how many sides players cried and how many players left the game in disgust.[BR][BR]To say that only 1% are interested in the tournament is a fars, the fact is that everyone is interested in the tournament but now only 1% can handle the tournament as it is now.[BR][BR]With the cauldron, INNO had a chance to shine, but they're going to screw it up."}, {"84": "Well, there is although the argument for a higher increase in troop production in chapters 17 to 20 compared to the higher troop needs (through completed research). [smilie--sprite7]"}, {"95": "I bought one of each ingredient Including the diamond ones today. Kept getting the same boost but at a higher %[BR][BR]Cauldron is useless![BR][BR]Now if it was added to our instants so we could use them when we choose .................."}, {"19": "Jammin said:\t\t\tThen of course there is the great argument that only 1% of players are interested in the tournament and that it doesn't matter what these players want.[BR]It always makes me laugh, if that were the case there wouldn't have been such an apocalyptic scream when the tournament changes were introduced...remember over how many sides players cried and how many players left the game in disgust.[BR][BR]To say that only 1% are interested in the tournament is a fars, the fact is that everyone is interested in the tournament but now only 1% can handle the tournament as it is now.[BR][BR]With the cauldron, INNO had a chance to shine, but they're going to screw it up.\t\tClick to expand...I think you either misunderstand or failed to read correctly.[BR]It is not that only 1% is interested in the tournament, I think most players are. But it is only a very small group that is interested in AND able to do 50+ provinces each week.[BR][BR]By far the most players do NOT do more than 30 provinces per week. In fact, I am perfectly confident saying most players don't even do 20 each week, let alone 20 for all 6 rounds. Something easily checked by looking at the scores on Saturday evening.[BR]In order to do 50+ each week one has to be far enough along to have that many provinces unlocked which rules out 90% of the players already, then be willing to spend huge amounts of time and effort in the city set-up and the tourney itself, which rules out another huge part of the players.[BR]-[BR]As for players leaving the game, INNO has consistantly been making choices that harmed the base of end-game, loyal, long-time players. Each of those choices drove some of them to leave. Personally I think that's on purpose; players at the end have far better chances in the Spire, meaning better chances of diamonds and genies which provide some diamonds. And by that time have less need for them since they already have their magical workshops and residences. Newer players, especially those who hang around after the first few chapters, are more likely to keep buying diamonds and eventcurrency etc."}, {"19": "Tomtimmon said:\t\t\tI bought one of each ingredient Including the diamond ones today. Kept getting the same boost but at a higher %[BR][BR]Cauldron is useless![BR][BR]Now if it was added to our instants so we could use them when we choose ..................\t\tClick to expand...Or the ready made potions were shown on that cauldron page and could be used when we choose to do so...."}, {"12": "Dhurrin said:\t\t\tI think you either misunderstand or failed to read correctly.[BR]It is not that only 1% is interested in the tournament, I think most players are. But it is only a very small group that is interested in AND able to do 50+ provinces each week.\t\tClick to expand...Jammin said:\t\t\tfact is that everyone is interested in the tournament but now only 1% can handle the tournament as it is now.\t\tClick to expand...I don't particularly like it when someone says I don't understand or don't read something correctly, especially when the person doesn't do it themselves."}, {"16": "got 59% chance of useful effects this week, 2 of them triggered, 29.3% MC and 15.7% TG strength, got 1000SF back, not bad for this tourney.[BR]Spoiler: screenshot[IMG]https://i.ibb.co/fS1CptG/https-beta-forum-elvenar-com-index-php-attachments-59-png-10617.png[/IMG]"}, {"76": "I do have 40% effect on seed production which is still active......although i can see the effect on various productions i dont see any effect on the trader production if seeds is choosen in trader...is that intentional ?"}, {"16": "Another cons of cauldron - if there was no cauldron last week, I'd place expiring buildings on saturday evening and would still have them active tomorrow after FA start. Or if the announcement appeared a week earlier - then I could just skip brewing and place my expiring buildings as usual... Now I won't have most of tournament-related badges, good thing that half of our FS have tournament schedule shifted a week over my and we will have enough of them anyway."}, {"87": "[IMG]https://i.ibb.co/QMQWxx7/https-beta-forum-elvenar-com-index-php-attachments-1671098577272-png-10629.png[/IMG][BR][BR]very lucky at the first try , critical effect : max effect +50% duration[BR][IMG]https://i.ibb.co/v4bmnRw/https-beta-forum-elvenar-com-index-php-attachments-1671098682487-png-10630.png[/IMG][BR][IMG]https://i.ibb.co/stLSbhv/https-beta-forum-elvenar-com-index-php-attachments-1671098727499-png-10631.png[/IMG][IMG]https://i.ibb.co/H4BPn4H/https-beta-forum-elvenar-com-index-php-attachments-1671098760301-png-10632.png[/IMG][IMG]https://i.ibb.co/3ShVjjz/https-beta-forum-elvenar-com-index-php-attachments-1671098802169-png-10633.png[/IMG][IMG]https://i.ibb.co/x1FW5MB/https-beta-forum-elvenar-com-index-php-attachments-1671098829062-png-10634.png[/IMG][BR]but despite the maximum effect , it's not much compared to enchantment bonus[BR][IMG]https://i.ibb.co/tpQXDp6/https-beta-forum-elvenar-com-index-php-attachments-1671099081688-png-10635.png[/IMG]"}, {"87": "i have prepared to rise that specific effect for today's FA , and with the big fail of single collection, it was absolutely for nothing 1 bracelets bagde only collected  , i am disgusted ..."}]