[{"9": "Always gettig what i didn't wanted. Why i even bother with this...[BR]I'm starting to thinking that maybe my 20 mil. orcs on live will be spared. I kind of feel that they deserve to be sacrificed for something better than Cauldron gambling machine."}, {"26": "Lovec Krys said:\t\t\tAlways gettig what i didn't wanted. Why i even bother with this...[BR]I'm starting to thinking that maybe my 20 mil. orcs on live will be spared. I kind of feel that they deserve to be sacrificed for something better than Cauldron gambling machine.\t\tClick to expand...Yes I totally agree, don't sacrifice the orcs! They might not look very beautiful to a human eye and they might have a strange way of living, but that doesn't mean they don't have a right to exist![BR]If you make a petition to prevent orcs from going in the kettle and have them replaced with something not living like relics for example, I will surely sign it!"}, {"9": "I don't have problem with sacrificing the orcs (or anybody else), i have problem with not getting anything in return for the sacrifice."}, {"87": "new week[BR][IMG]https://i.ibb.co/KrNtvSK/https-beta-forum-elvenar-com-index-php-attachments-1671355602572-png-10668.png[/IMG][BR][IMG]https://i.ibb.co/gSwD6wv/https-beta-forum-elvenar-com-index-php-attachments-1671355632056-png-10669.png[/IMG][IMG]https://i.ibb.co/WgTQycK/https-beta-forum-elvenar-com-index-php-attachments-1671355666207-png-10670.png[/IMG][IMG]https://i.ibb.co/7vFn83R/https-beta-forum-elvenar-com-index-php-attachments-1671355691686-png-10671.png[/IMG][IMG]https://i.ibb.co/fDPcJhs/https-beta-forum-elvenar-com-index-php-attachments-1671355720080-png-10672.png[/IMG][IMG]https://i.ibb.co/MpJcvK5/https-beta-forum-elvenar-com-index-php-attachments-1671355737028-png-10673.png[/IMG][BR]not too bad with luck , one potion is near maximum possible , but the other tries were not good"}, {"33": "Great @guivou, that type of snapshots will be very hepful to unravel the ingredients effect on probabilities...[BR]Please, temember to indicate number of diplomas to know for sure which effects do they affect"}, {"12": "Huhu, I brewed a Generals Mayhem yesterday, I have it at lvl 51 in my chapter 8 city, max value at this level is 14%[BR][BR]I got 4.2% when brewing, you can't be serious.[BR][BR]4% gives a lvl 1 potion, how can there be a 10% discrepancy when you have the potion at level 51.[BR][BR]I'd like to know if there's anything else going on with this feature in terms of usefulness or if we're going to get this junk live the way it's going here?"}, {"54": "I've been tracking my efforts in the Cauldron and am not very impressed.  Out of 4 weeks, once have I gotten what showed as the highest 'chance to trigger\" and by other posts that's doing well. idk if that's enough to want to play the Cauldron in live world.[BR]I have noticed that with weekly improvements the effect time is slowly extending, making the brew more useable. However, unless a player is willing to see this as a long-term investment, it's unlikely they'll continue past the first or second week of use.[BR] I do have a personal goodgledoc spreadsheet (work in progress) with tab for Effects of ingredients to help me choose which ones to focus , up to the Sentient tier 1 level ( Embassies in Beta). I also have a tab to display my efforts (the ingredients & results). EDIT: Note:  *** sharing links outside your own fellowship is disallowed in-game.  Any email from a private server, or in a country that restricts web access, may block you from seeing it. CauldronInfo-zodi"}, {"82": "@ZodiBeta : That's a really excellent and very useful spreadsheet - thanks so much for taking the time & trouble to put it all together! [smilie--sprite1]"}, {"16": "another week, perfect combo:[BR]Spoiler: screenshot[IMG]https://i.ibb.co/v1YvN5q/https-beta-forum-elvenar-com-index-php-attachments-1671833549938-png-10701.png[/IMG][BR]3x useful effects (27.2%, 17.3% , 23.2%)+ 2x refundBtw, ingredients are counted in a more complex way than shown on linked spreadsheet. Every ingredient affects chances of every potion effect, some in positive way, some in negative. And both ways consists of two separately counted parts, pure value and factor. Total chance formula for specific effect is[BR]chance=Max(0,sum_of_all_values_of_every_used_ingredients*1.1^sum_of_all_factors_of_every_used_ingredients)[BR]After calculating chances for all effects, they are normalized to a total success chance value.[BR]You can't see factor part of if value part is <=0, so the only things listed on the sheet above are positive values and even them are not clear as they are showing normalized chance which is different for different number of diplomas you have and different number of ingredients used.[BR]those who are familiar with browser dev tools can see exact values and factors for desired effects there[BR]Spoiler: dev tools[IMG]https://i.ibb.co/Ydt87bj/https-beta-forum-elvenar-com-index-php-attachments-1671834901917-png-10702.png[/IMG]"}, {"33": "Thanks you very much @Karvest , that makes everything much easier.[BR]Just 2 quick question , I understand that for both sum_of_all_values_of_every_used_ingredients and sum_of_all_factors_of_every_used_ingredients, only factor for the unblocked effects are taken into account , right?[BR]So, sum_of_all_values_of_every_used_ingredients_for_specific_effect and sum_of_all_factors_of_every_used_ingredients_for_all_unblocked_effects.[BR]And sum_of_all_factors_of_every_used_ingredients_for_all_unblocked_effects considers both positive an negtives values, right?[BR][BR]I got for Ingredient 1[BR]Spoiler: Ingredient1 factors3 ? ? 1 ? ? ? ? ? ? 1 2 3 ? 1 ? ? ? 1 2 ...but was much stuck with other ingredients and when mixing them... and of course the 1.1 factor and potential was not in my considerations for a lot.."}, {"16": "Each effect chance is counted separately.[BR]Like if you invest ing_11*5 and ing_6*3 you'll get 15*1.77=26 chance for mc_strength. [BR]Then you calculate chances for all other unblocked effects in the same way, sum their chances and normalize by overall success chance to get actual probabilities."}, {"9": "@Karvest So is there a chance to get Mercenary Mayhem chance above 15% (without using diamonds of course)?[BR]Because whenever i try to include more than one ingredient the chance for MM goes lower."}, {"16": "I've got 17-18% chance for each strength effect this week (numbers under screenshot on my post are effect values)."}, {"5": "When I try to up my chance of getting the barracks damage boost, it seems there are four ingredients that increase the chance, four that reduce it, and the rest have little or no effect on the percent chance. I am doing my testing with 15 of the effects unlocked, so I don't know if that works the same with fewer or more unlocked."}, {"82": "@Karvest : Many thanks to you, too, for providing the functional data which IMO (@Vaeri) Inno should have provided, if not in detail then at least in summary - it's generally interesting and conceptually fair to give players an acceptably simple, logical, acceptably low-cost, and universally useful [for non-mathematicians!] new system to 'discover' for themselves how it works, but it's NOT fair, IMO, to expect players to invest what will be, for most of us, a LOT of Resources (and ? unnecessary Research), and a lot of time, too, trying to decipher a system as exceedingly complex and random as the Cauldron appears to be. I'm thinking that there must be casinos which use less convoluted strategies than the Cauldron involves...!![BR][BR]Anyway.[BR][BR]I can't understand non-basic maths - so if I may ask you, and @Prueba2, as well - if either/both of you are willing to help me with the following:[BR][BR]Assuming enough invested time & Resources (and ? Diplomas, unless it's better to have fewer Diplomas, to get specific effects?) - are there maximum values which can be reached for each potion strength/duration - and how much RNG (known/unknown?) is involved in actually activating those effects? Is there even a maximum potion strength/duration chance at all, or is there theoretically no limit to one or both aspects?[BR][BR]Also, is there any way to limit or even improve the random chance of activating any given potion effect, or is that impossible to influence?[BR][BR]In other words : for those of us who would be hoping to maximise only a few effects (in my case, primarily the Merc Camp boosts), is the Cauldron even capable [given investment] of offering more than [low, moderate, good?] CHANCES of achieving desired effects, or is there so much RNG involved that it will always be more of a gambling system than the kind of semi-reliable 'Crafting-style' system which I hoped it might be...?[BR][BR]As I say, I can't actually do the maths myself (I wish I could!) - but seeing as you [Karvest] have already achieved the results you want more than once, there's obviously a major advantage in understanding how the maths works... so if it's possible to answer the above question(s) - more in words than in maths? - I'd be really grateful. My Live City has enough Resources to invest in the Cauldron, if it's an investment worth making, but not enough to repeatedly gamble on potion effects if they're (always) going to be too weak [and/or unreliable, including failure chances] than the cost & time can justify, and I would imagine that quite a few other players will be in the same situation as me, too, whether or not the Cauldron can also offer a bit of added fun/interest on the side-lines of the game.[BR][BR]Many thanks in advance for any advice you (anyone?) can offer - to non-maths people like me - on how to actually make the Cauldron useful...! [smilie--sprite1]"}, {"16": "My results is almost maximum that can be achieved at my state, I see no way to level up even one of my 3 desired effects to lvl100. I can lower the conversion costs by getting more diplomas (I have 11 now), but that would also decrease my chances to get desired effects. Adding spell fragments to the potion increase both chances to get critical effect and max value of the effects. That way I get bigger numbers than I've researched (27.2% instead of 18.2% and 23.2% instead of 21% this week).[BR]Talking about chances to get effect - the more diplomas you have - the more effects get their chances to appear when you add ingredient, lowering the chances of desired effects. In my case with 11 diplomas (minimum for mc_strength) and ~3400 witch points I get 50-60% total chance of getting one of 3 *_strength effects, depending on which ingredients are blocked by diamonds. But chances that I will get all of them are not that big."}, {"12": "Karvest said:\t\t\tI see no way to level up even one of my 3 desired effects to lvl100.\t\tClick to expand...Why not, continue with tools by enchanting magic workshops, do that when you have time to play long so you can get the most out of the spells and workshops... if you don't research, you don't need seeds or even Mana, (Unurium) you can also level with it.[BR][BR]If the witch points needed to level up become astronomical, you can only level up with tools."}, {"16": "my tools price is already more than 3/4 of my MH storage."}, {"12": "Karvest said:\t\t\tmy tools price is already more than 3/4 of my MH storage.\t\tClick to expand...This is the only resource where it doesn't matter what the price is and will be."}, {"16": "it does, soon I won't be able to use it at all."}]