[{"82": "Thanks for the reply, @Karvest, and for that really helpful explanation - I understand it much better now - your help is very much appreciated! [smilie--sprite1]"}, {"33": "New Wiki page for The Cauldron[BR]Still blank"}, {"80": "Thanks for pointing that @Prueba2; usually wiki pages are updated at the same time (more or less) that relative feature is released on live server [smilie--sprite1]"}, {"35": "my feedback: I kinda miss the option to donate relics, and ascending goods (and maybe sentient as well).[BR][BR]Let me explain the ascending, when you are between chapters, theres not a single use of those ascending goods, so basically its a waste to produce them and you should stick to collecting and donating unurium instead. If we were able to donate those asending goods, maybe some people would start trading their goods again (and thus help other players who arent end tech yet). Right now the trade for ascending goods just dies as more and more people reach end tech. [BR][BR]Maybe its just my own personal view tho, since i have the 3 boosts nobody seem to want, so threes never a trade asking for my boost, so i stopped looking for them in trader.[BR][BR]I can see a use to donate sentient goods as well, but i wont be using it if it was added, I kinda like to use my sentient in spire."}, {"9": "@Heymrdiedier In my main city i have teleported T7-T9 into inventory and placed few more T1s (when negotiating in high provinces during 2 of 9 weeks i'm running out of T1 goods, so this will help me a little bit).[BR]So i'm not producing any of ascended goods currently (with exception of production of some recent evos which i have for kps)."}, {"35": "Lovec Krys said:@Heymrdiedier In my main city i have teleported T7-T9 into inventory and placed few more T1s (when negotiating in high provinces during 2 of 9 weeks i'm running out of T1 goods, so this will help me a little bit).[BR]So i'm not producing any of ascended goods currently (with exception of production of some recent evos which i have for kps).\t\tClick to expand...exactly, theres is no point to keep ascending goods running between chapters, so they should give us a use for it."}, {"73": "On my life server I am scratching at the end wall for a couple month now but I am still making all the goods.[BR]Reason: just to help my fellow players from the same fellowship first and then some other players.[BR]and even having almost 2 of every factory (1 missing) would be enough for me."}, {"96": "My feedback is simple.  I don’t like the fact that when I brew I must use at the same time and that the time frames are way to short to be practical for someone playing several cities.  A waste of time, resources much too complicated to get a decent return on investment."}, {"97": "Throws a match in mine and walks away, never looking back[BR][BR][IMG]https://i.ibb.co/pQsC7d2/https-beta-forum-elvenar-com-index-php-attachments-1672554418907-png-10721.png[/IMG]"}, {"90": "TomatoeHu said:\t\t\tThrows a match in mine and walks away, never looking back[BR][BR]View attachment 10721Click to expand...Did the same. I find its too expensive and it gets more expensive every week.  I dont like the fact that you have to use up your goblets with no option to save them for when you really need it.    Its a gimmick that benefits the advanced chapters only.  I am not recommending the cauldron for live."}, {"71": "Vaeri said:\t\t\tDear Humans and Elves,[BR][BR]Please see the announcement of our newest feature added to the game here: The Cauldron![BR]We are of course very curious for your feedback so please let us know what you think about it in this thread![BR][BR]Kind regards,[BR]Your Elvenar Team\t\tClick to expand...Hi, I like the concept of the cauldron, but yet to understand it fully when putting in ingredients. I did notice how our play score in the tournament got us goblets. Hopefully that will be an incentive for players to participate more fully in the tournament. But some more info on the functioning of the cauldron itself would help. Maybe a recipe book would help."}, {"87": "definitely a big failure , 2 weeks in a row with 47% of luck  x  max goblet , no effect at all"}, {"33": "Updated ES Wiki La Puchera[BR][BR]EDIT: The point being it is probably going Live in short."}, {"29": "I definitely don't care about this thing anymore..."}, {"3": "See that The Cauldron has now been announced for January 9 on Live (EN anyway). I guess with no changes from the beta experience? Interesting"}, {"67": "i really don't like it as it stands...not using it."}, {"45": "On live I am not even going to bother unlocking it either and will advice all my fellows to do the same. I can only hope a lot of players will follow suit, maybe that will bring Inno dev's to their senses?"}, {"29": "Still nothing in the wiki?????[BR][BR][IMG]https://i.ibb.co/w4T0hXv/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-01-06-141846-png-10749.png[/IMG]"}, {"33": "@Biloutte91 I am also keeping refreshing it...[BR][BR]EDIT: By the way just read in the ES wiki[BR]\t\t\t¡Todos los Efectos tienen 100 niveles de mejora! ¡Cuando mejoras un Efecto, su Beneficio se utilizará la semana siguiente si consigues que tus Cálices Trofeo activen de nuevo ese Efecto! Si no lo consigues, no temas, el progreso de mejora no se pierde, ¡esto significa que en la semana siguiente los Efectos estarán al mismo nivel que los dejaste!\t\tClick to expand...Google Translated: All Effects have 100 levels of improvement! When you upgrade an Effect, its Buff will be used the following week if you get your Trophy Chalices to trigger that Effect again! If you don't, have no fear, the upgrade progress is not lost, this means that in the following week the Effects will be at the same level as you left them![BR][BR]\t\t\tLa duración, la potencia y el nivel del Efecto de la Poción dependen del nivel de mejora en el que se encuentren. Acuérdate de utilizar los Puntos de Brujería que no hayas usado en una semana para seguir mejorando tus Efectos favoritos la semana que viene. Todos los Efectos tienen 100 niveles de evolución.\t\tClick to expand...Google Translated: The duration, power, and level of the Potion Effect depend on the level of enhancement they are at. Remember to use any Sorcery Points you haven't used in a week to continue upgrading your favorite Effects next week. All Effects have 100 levels of evolution.[BR][BR]I do not remember reading anything regarding this...[BR]Only 100 levels is too little... maximum duration for 2h effects would be 11.9h ...[BR][BR]Also:[BR]Ten en cuenta: Todos los efectos activos tienen acción sobre todas las producciones de tu ciudad a excepción de los Sets de Edificios.\t\tClick to expand...Google Translated: Please note: All active effects have an action on all productions in your city except Building Sets.[BR][BR]EDIT: Updated table with level 100 effects: Potion effects table"}, {"9": "With the current chance to get the desired effect we would need one month duration."}]