[{"16": "Doubt you can get even 2-3 desired effects to that \"too little\" level 100 in current mechanic."}, {"33": "I was aiming for just one single effect, level it up to 830 and get 3.5days maximum duration, hopefully, if RNG agrees...[BR]Probably would take years...[BR][BR]EDIT: Also at level 830 bonus would be +170%, a bit more than 3 Fire Phoenix, but without need of using 3 Pet Foods every week...[BR][BR]EDIT2: Ok, just for 1/3 of troops..."}, {"16": "Now you should balance between high level of desired effect and high chance to get it, as the more effects you know - the less it costs but the less the chance to get it while drinking.[BR]I have 1 effect at level 86 and 2 effects at  level 73. Probably same amount of points would be enough to get 1 up to lvl 100, not sure. But 2 additional useful effects at good level are better than few more % for one best effect.[BR]Even if effects won't be limited to level 100 the costs rising up so quickly that you won't get it much higher anyway."}, {"26": "Biloutte91 said:\t\t\tStill nothing in the wiki?????[BR][BR]View attachment 10749Click to expand...Ooh no that is terrible![BR]I will contact my colleague mods and tell them they should stop enjoying their holidays and finish this right now!"}, {"26": "Kersepitje said:\t\t\tOoh no that is terrible![BR]I will contact my colleague mods and tell them they should stop enjoying their holidays and finish this right now!\t\tClick to expand...and already got word back from them, the page was finished long ago, but there seems to have gone something wrong in the last update.[BR]You can access the previous version here https://en.wiki.elvenar.com/index.php?title=The_Cauldron&direction=prev&oldid=12572 and they will get the page working as intended again asap."}, {"29": "Kersepitje said:\t\t\tOoh no that is terrible![BR]I will contact my colleague mods and tell them they should stop enjoying their holidays and finish this right now!\t\tClick to expand...[BR]The cauldron is still there since November 29...a month and a half holidays ? cool [smilie--sprite7][smilie--sprite7][smilie--sprite7][smilie--sprite7][smilie--sprite7][smilie--sprite7][smilie--sprite7]"}, {"26": "Biloutte91 said:\t\t\tThe cauldron is still there since November 29...a month and a half holidays ? cool [smilie--sprite7][smilie--sprite7][smilie--sprite7][smilie--sprite7][smilie--sprite7][smilie--sprite7][smilie--sprite7]Click to expand...Actually it's not live yet, that's only planned for next week. And the wiki's are always only updated just before it goes live. (Usually because all the languages need their time to translate everything in time)[BR][BR]As I've stated before the work on those pages has been done long ago, who and when those pages are then given to the players is a decision that isn't in my control."}, {"29": "Thank's it was for take informations for the French lives."}, {"14": "Biloutte91 said:\t\t\tThank's it was for take informations for the French lives.\t\tClick to expand...Yushi already posted about it yesterday morning [smilie--sprite2]"}, {"29": "I speak about the wiki ..."}, {"74": "Karvest said:\t\t\tYes, you should select ingredients giving you max chance of triggering that effects, brew the potion, and keep fingers crossed while drinking it using goblets. That should be done just before you do your tourney/spire so that effects won't expire before you are done with fighting.\t\tClick to expand...@Karvest is there a way to \"select ingredients giving you max chance of triggering that effects\"? Can you help me? Thank you [smilie--sprite1]"}, {"16": "If we are talking about strength effects this week - there is almost no way to trigger them, as most of ways are blocked by diamonds (especially mc_strength one)."}, {"33": "One quick doubt, according to the table shown in the Wiki Potion Effects Overview, it seems players could choose to make available some effects by researching all Technologies of the desired Chapter, while keeping others unavailable by leaving some unresearched of the undesired chapters.[BR]For example, if I wanted Monsters' Mayhem and Mercenaries' Strength effects, I would research all Technolgies of Fairies and Halflings chapters, while leaving at least one Technology unresearched of Dwarves, Orcs, WoodElves, Sorcerers&Dragons and later chapters.[BR][BR]Could somebody confirm this, please?[BR]Otherwise, maybe the Wiki should be updated and instead of chapters it should indicate number of Research Diplomas associated to which effect...[BR][BR]EDIT: Maybe available effects are related to number of Research Diplomas...[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/the-cauldron.18155/page-3#post-110634\t\t[BR]\t\t\thttps://beta.forum.elvenar.com/index.php?threads/the-cauldron.18155/page-4#post-110640\t\t"}, {"45": "Prueba2 said:\t\t\twhile keeping others unavailable by leaving some unresearched of the undesired chapters.\t\tClick to expand...This doesn't make any sense and - if true - would be another reason to ignore the Cauldron altogether, since most players completed all technologies while doing their chapters.. and there is no way to 'undo' them. If only, because then I would 'undo' the cauldron immidiately!"}, {"84": "Yes, it is related to the number of diplomas and it does not matter from which chapters they are."}, {"33": "Then the Wiki is confussing as it seems to imply that it is related to Chapter.[BR][IMG]https://i.ibb.co/ZGnp7sX/https-beta-forum-elvenar-com-index-php-attachments-1673436262120-png-10766.png[/IMG][BR][BR]Chapters just need to be removed and quantity of Research Diploma added."}, {"29": "Yes the effects are linked to the chapters... and no, not all players have validated all the research of all their chapters (me first)"}, {"16": "The only link to the chapter is the fact that you can't get specific effect before you've done specific chapter. But you can be at chapter 20 with 11 diplomas unlocked (doesn't matter from which chapters) and have access only to first 11 potion effects. And this seems to be the best setup for tournaments/spire."}, {"29": "Yes. What I mean is that for example, you can't have \"effects\" unurium or ascended if you are chapter X[BR][BR][IMG]https://i.ibb.co/0FBwQ6Z/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-01-11-152716-png-10767.png[/IMG]"}, {"45": "Prueba2 said:\t\t\tplayers could choose to make available some effects by researching all Technologies of the desired Chapter, while keeping others unavailable by leaving some unresearched of the undesired chapters.\t\tClick to expand...With this comment, it appears @Prueba2 is suggesting that there are undesired technologies and/or chapters.. which gives the impression it would create a problem for players that already have researched those technologies and/or chapters.. but maybe it is just the way it was phrased?"}]