[{"33": "I am thinking that one simple way of mending the Cauldron is changing how % are calculated.[BR][BR]Instead of distributing the success % between all effects depending on each effect \"weight\", make the maximum \"weight\" effect equal to the success % and then the rest of effects would have proportional % depending on their \"weight\" to the maximum \"weight\".[BR]This way if the potion is sucessfull the desired effect would be granted for sure plus there is probability some additional effects would be activated at the same time, thus making interesting for all players to research more diplomas as more effects would be activated each time.[BR][BR]Please, somebody review it and comment if there is some disadvantage I am missing."}, {"16": "Will work only if there would be no limit of one goblet=one effect, and dices for all effects would be rolled separately."}, {"33": "Karvest said:\t\t\tWill work only if there would be no limit of one goblet=one effect, and dices for all effects would be rolled separately.\t\tClick to expand...One roll would only be required, 01 rolled would gain all effects , success rate rolled will give only main effect...[BR]And of course limit of one goblet => one effect should be removed...[BR]EDIT: Example: 60% of success[BR]- Effect A 60%[BR]- Effect B 32%[BR]- Effect C 17%[BR]- Effect D 9%[BR]Roll:[BR]- 9 or less: all effects (A+B+C+D)[BR]- 17 or less: A+B+C[BR]- 32 or less: A+B[BR]- 60 or less: only A[BR]- 61 or more: NO effects[BR][BR]Also, while preparing the recipe we are already removing some effects in order to increase others, so in this way we would try to maximize the number probability of usefull effects for each goblet..."}, {"16": "With 1 roll there would be no chance to get something with low probability without getting all things with higher probabilities. Not sure if it's bad or not."}, {"33": "Karvest said:\t\t\tWith 1 roll there would be no chance to get something with low probability without getting all things with higher probabilities. Not sure if it's bad or not.\t\tClick to expand...Is it worse than current?[BR]Alternatively, we could be allowed to choose from rolled effects, if previous way seems too powerful, but then again it would be only one effect per goblet..."}, {"45": "Prueba2 said:\t\t\tI am thinking that one simple way of mending the Cauldron is changing how % are calculated.\t\tClick to expand...I think the best option would be to take it out of the game.. or make it possible to sell the damn thing?"}, {"74": "It seems that the more you research (and have diplomas), the less control you have on the potion effects. IMO it should be the opposite![BR]People, like me, who researched everything, are now penalized without knowing that they would have been penalized in the future![BR]INNO developers, are you joking?????[BR]I want to be able to unresearch (for example one of the optional squad size upgrades per chapter), get back the resources I invested and have more control on the potion effects![BR]Otherwise, change the Cauldron!!! For example, the level of each effect should be considered to calculate the probability of its appearnce: a lv 70 effect should have a weight 70 with respect to a lv 1 effect in the normalization step."}, {"22": "most simply, remove %[BR]study an effect => obtain it"}, {"74": "Ainor said:\t\t\tmost simply, remove %[BR]study an effect => obtain it\t\tClick to expand...Mmm ... if you are interested in 10 effects and study all of them, which ones will you get?"}, {"22": "spennyit said:\t\t\tMmm ... if you are interested in 10 effects and study all of them, which ones will you get?\t\tClick to expand...all XD if you can manage it [smilie--sprite2][BR]rather than success rate of the effects, each ingredient affects bonus and/or duration of effects up to your max level reached in the study phase (you can try to purify and refine one or more specific effects)"}, {"74": "Ainor said:\t\t\tall XD if you can manage it [smilie--sprite2][BR]rather than success rate of the effects, each ingredient affects bonus and/or duration of effects up to your max level reached in the study phase (you can try to purify and refine one or more specific effects)\t\tClick to expand...@Ainor with 5 goblets you cannot get 10 effects"}, {"22": "you get the exact potion that you brew, with all effects, but powerful of each effect is decided by ingredients chosen (and much more effects you have, less powerful they are)[BR]goblet remains the same, a possibility to get the potion depending of the success rate(=ingredients number)"}, {"74": "Ainor said:\t\t\tyou get the exact potion that you brew, with all effects, but powerful of each effect is decided by ingredients chosen (and much more effects you have, less powerful they are)[BR]goblet remains the same, a possibility to get the potion depending of the success rate(=ingredients number)\t\tClick to expand...Mmm ... I think that you would like to completely change the Cauldron philosophy and I don't think that INNO will ever accept [smilie--sprite1]"}, {"74": "@Karvest I have 19 diplomas, but I don't know how to give you what you miss :-("}, {"2": "Dorfl the Clay said:\t\t\tI think the best option would be to take it out of the game.. or make it possible to sell the damn thing?\t\tClick to expand...I gather that your comment was passed on.  And now the hammer falls."}, {"16": "spennyit said:\t\t\tI have 19 diplomas, but I don't know how to give you what you miss :-(\t\tClick to expand...[BR]open MA ingame => open dev tools (ctrl-shift-i) => press \"Add ingredients\" or \"Improve Effects\" ingame => look at network tab of dev tools, click on first message, should see something like[BR]Spoiler: this[IMG]https://i.ibb.co/xjCcdR9/https-beta-forum-elvenar-com-index-php-attachments-1674141823822-png-10810.png[/IMG]key things are[BR]\t\t\trequestClass: \"CauldronService\"[BR]requestMethod: \"getPotionEffects\"\t\tClick to expand...then switch to Response tab => ctrl-A (select all) => ctrl-C (copy to clipboard) => open pastebin.com => click on \"new paste\" field => ctrl-V (paste) => press \"create new paste\" => share resulting link with us."}, {"99": "There are many players in my fellowship who are very unhappy with the announcement that the Cauldron will become part of quest and requirements. Out of a full roster of players in our fellowship there are maybe two players who find any value in this feature. In fact, most of us don't even want to use it. We hope you are going to make these quests have the feature of \"decline\" as most of us see this as a feature we do not even want to use!"}, {"22": "spennyit said:\t\t\tMmm ... I think that you would like to completely change the Cauldron philosophy and I don't think that INNO will ever accept [smilie--sprite1]Click to expand...exactly. Current philosophy is slot machine, and I think it  is useless and stupid"}, {"100": "[BR][BR]I don't think this action is good, that the cauldron is being forced on me - [BR]I can't operate this thing with my lower chapter VI or beginning VII - 1. technology."}, {"3": "Strongly object to Cauldron becoming mandatory![BR]Will certainly consider leaving the game, depending on how this is implemented.[BR]Wouldn't be necessary if it wasn't such a useless (self edited the ****)  feature.[BR]Some manager's bonus hanging on uptake of the Cauldron?"}]