[{"32": "looking at a bug report here, I have to add that I really dislike that we can't intervene to add more ingredients or how many Goblets we want to use, also to choose the moment to use it. Once brewed, that spell is effective immediately."}, {"17": "So the cauldron ends on midnight Friday, German time.  So about 19-20 hours before tournament ends."}, {"37": "Alcaro said:@iDavis - do we have a chance to see a video made by you, explaining this feature? I would be deeply grateful!\t\tClick to expand...I won't be having mine video on this one, but we prepared the usual feature explaining video that will cover all its important details. Not sure about the release date, but I'm pretty sure it will be there when Cauldron hits the live servers."}, {"58": "Th EN Forum shared the official video: [BR]~EN Forum Thread[BR][BR]~Official Cauldron Youtube Video"}, {"59": "Can someone with chapter 20 done,  post all possible effects of the potions?"}, {"9": "I should add someone with all researches done, since you can be at the end of the research and still not have all 20 diplomas (you need all researches including non-mandatory in the chapter to recieve diploma):[BR][IMG]https://i.ibb.co/T4FWsSL/https-beta-forum-elvenar-com-index-php-attachments-1669736016076-png-10462.png[/IMG]"}, {"32": "Arthus said:\t\t\tCan someone with chapter 20 done,  post all possible effects of the potions?\t\tClick to expand...I'm afraid that will take time and a lot of work and a player willing to do that.[BR][BR]EDIT - unfortunately MinMaxGamer isn't with us anymore. It seems he deleted his account."}, {"47": "Lovec Krys said:\t\t\tI should add someone with all researches done, since you can be at the end of the research and still not have all 20 diplomas (you need all researches including non-mandatory in the chapter to recieve diploma):[BR]View attachment 10462Click to expand...I think it is the perfect time to have a button in the tech tree to “jump to next  available technology”. This would help for me to find the skipped optional techies."}, {"26": "Prueba2 said:\t\t\tSeeing the effects are similar to Ancient Wonders.[BR]Does the new Cauldron feature increase the difficulty of either the Spire or Tournament?\t\tClick to expand...We don't share details about the spire or tournament difficulty calculations, so if you really want to know you will have to find that out yourselves. But in my personal opinion i dont see how this is any different then culture bonus, or expiring buildings, or pet food effects, and that doesn't seem to affect the difficulty either.[BR]Maillie said:\t\t\tWhen I clicked on some odd shaped thing It told me I have 6060 of something.   I have no idea what.  Is it taking something that I'm going to be short on and need in about 2 minutes from now?[BR][BR]By the way, in order to start this, if you are in the later chapters you need to go all the way back to Chapter 5 and research the Cauldron tech.\t\tClick to expand...The 6060 of something you need, are called Witch points. As the ingame information says, these will be reset every week at the start of new cauldron, so its better to use them all up before cauldron for this week is over.[BR][BR]There will be information about the cauldron in the wiki and our knowledge base pages, but those are typically only finished just before it hits live server. (our mods need time for their work as well)"}, {"35": "SirSmithy said:\t\t\tI think it is the perfect time to have a button in the tech tree to “jump to next  available technology”. This would help for me to find the skipped optional techies.\t\tClick to expand...Well I've been researching those techs i skipped during events that ask for research a technology. So I'm not sure I really like that they want us to do all those techs now immediatly. If thats the case, I hope research a tech requirement will be removed from all event quests as well.[BR][BR]One thing I'm still puzzled about. They promised the cauldron would allow us to spend al those 10thousands of relics we've been saving up over the years. But I still haven't found where I can use them, anyone spotted it yet?"}, {"3": "'Scuse my (Inno) paranoia but can anyone think of a reason not to complete this Cauldron research?"}, {"59": "Well at least cauldron will strike a bit against these players who deliberately chose not to complete optional squad increase technologies to have advantage in tournaments. I already like how this function looks. We just need more time to understand it.[BR][BR]And if there's someone with all technologies in game done, please share all possible effects if you could, please."}, {"35": "Arthus said:\t\t\tWell at least cauldron will strike a bit against these players who deliberately chose not to complete optional squad increase technologies to have advantage in tournaments. I already like how this function looks. We just need more time to understand it.[BR][BR]And if there's someone with all technologies in game done, please share all possible effects if you could, please.\t\tClick to expand...this has already been changed years ago. The only valid reason to skip optional squad size techs, is to save some KP..."}, {"29": "This is a stupid thing... if i don't want to complet all my research i have my reason ... (i don't research squad size)[BR][BR][IMG]https://i.ibb.co/TbVVcMD/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-170654-png-10465.png[/IMG][IMG]https://i.ibb.co/rZVq0zq/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-170733-png-10466.png[/IMG]"}, {"11": "I can improve effects:[BR][BR][IMG]https://i.ibb.co/rbKQ4tf/https-beta-forum-elvenar-com-index-php-attachments-cauldron-question-1-jpg-10463.jpg[/IMG][BR][BR]Such as done by the Barracks Units Strength Increase:[BR][BR][IMG]https://i.ibb.co/1LKHYsV/https-beta-forum-elvenar-com-index-php-attachments-cauldron-question-2-jpg-10464.jpg[/IMG][BR][BR]But it has currently no effect at all.[BR]Probably because i was not lucky to receive any effect.[BR][BR]Will the increase stay anyway at this level for ever or will this be vanished every week?"}, {"16": "List of all currently available effects (I'm too lazy to convert icon id into full human readable description, but IMHO their names are self-explanatory):[BR]SourceNameiconIdpe_301Magical Tax Increasemoneype_302Supply Surplus Spellsuppliespe_303General's Mayhemhb_strengthpe_304Trader's Basic Pleagoods_standard_basicpe_305Trader's Refined Pleagoods_standard_refinedpe_306Trader's Precious Pleagoods_standard_preciouspe_307Monsters' Mayhemtg_strengthpe_308Gift of the High Menportal_productionpe_309Horde Uprisingorcspe_310Enar's Boonmanape_311Mercenaries' Mayhemmc_strengthpe_312Harvest Moonseedspe_313Trader's Basic Prayergoods_sentient_basicpe_314Trader's Refined Prayergoods_sentient_refinedpe_315Trader's Precious Prayergoods_sentient_preciouspe_316Monsters' Morale Boosttg_healthpe_317Mercenaries' Morale Boostmc_healthpe_318Unur's Resurgenceunuriumpe_319Trader's Basic Blessinggoods_ascended_basicpe_320Trader's Refined Blessinggoods_ascended_refinedpe_321Trader's Precious Blessinggoods_ascended_preciouspe_322General's Morale Boosthb_health[BR]So to get Mercenary Camp units health increase I need to finish at least chapter 17 (now I have only 3 first effects available due to optional techs not being researched)"}, {"33": "Kersepitje said:\t\t\tWe don't share details about the spire or tournament difficulty calculations, so if you really want to know you will have to find that out yourselves. But in my personal opinion i dont see how this is any different then culture bonus, or expiring buildings, or pet food effects, and that doesn't seem to affect the difficulty either.\t\tClick to expand...[BR]Well, allow me to disagree. Previously, it has been indicated which factors affect it[BR]Behind the Scenes: Upcoming Tournament Changes[BR][BR]\t\t\tFurthermore, researched (optional) Squad Size Upgrade technologies will no longer make Tournament participation more expensive.\t\tClick to expand...[BR]\t\t\tUp until now, they were directly linked to your Squad Size, meaning that any Squad Size Upgrade technology, both the mandatory and optional ones, would result in higher costs. This will be abolished and instead we will base the costs on a series of progression factors, which involve city development and researches in general.\t\tClick to expand...[BR]\t\t\tThe impact of placed Expansions on the costs formula has been reduced. This was done for both Regular and Premium Expansions, where Premium Expansions' impact was reduced more than Regular Expansions'. Note: Premium Expansions have always had a lower impact than Regular Expansions. This change will also affect the Spire of Eternity, and will be part of the 1.111 update on all Live worlds, and will therefore be released separately from the new Tournaments.\t\tClick to expand..."}, {"9": "@Biloutte91 What reason can you have for not researching squad sizes?[BR]It's been quite a long time since they negativelly affected tournament squad size.[BR]Now they don't have any negative effect on tournaments or Spire."}, {"5": "SirSmithy said:\t\t\tI think it is the perfect time to have a button in the tech tree to “jump to next  available technology”. This would help for me to find the skipped optional techies.\t\tClick to expand...[BR]You can already do that. Go to the research tree and click on each chapter along the bottom line. If you have no skipped research, it takes you to the beginning of the chapter. If you have research in the chapter you skipped, it will take you to the first one."}, {"29": "'Cause I don't see the need...[BR][BR]Active Effects: ( I think they are cauldron effects ?)[BR][BR][IMG]https://i.ibb.co/gFKvZxZ/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-155849-png-10467.png[/IMG][BR][BR][IMG]https://i.ibb.co/7gpVzq7/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-155933-png-10468.png[/IMG][IMG]https://i.ibb.co/fQcrVJB/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-160001-png-10469.png[/IMG][IMG]https://i.ibb.co/rpt3pgz/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-160050-png-10470.png[/IMG][BR]potion Effect Boost: scrolls[BR][BR][IMG]https://i.ibb.co/NFM5dfk/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-160542-png-10471.png[/IMG][BR][BR]Potion Effects Boost: Stell.[BR][BR][IMG]https://i.ibb.co/R44NtPy/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-160617-png-10472.png[/IMG]"}]