[{"101": "I also feel strongly that the Cauldron has no place in event quests.[BR]I can only imagine how fouled up things will get when they ask me to do something in the Cauldron and I have already used my goblets and witch points for the week.[BR][BR]Maybe they will pair up an impossible to do cauldron action (because i am done for the week) with a 5 day scouting mission. That would be a great combination!"}, {"3": "Jaxom said:\t\t\tI also feel strongly that the Cauldron has no place in event quests.[BR]I can only imagine how fouled up things will get when they ask me to do something in the Cauldron and I have already used my goblets and witch points for the week.[BR][BR]Maybe they will pair up an impossible to do cauldron action (because i am done for the week) with a 5 day scouting mission. That would be a great combination!\t\tClick to expand...Perhaps they'll use a carrot and stick (or Cannon) approach ... [BR]Use cauldron or (possible examples)[BR]Update 20 buildings,[BR]Scout 5 provinces,[BR]Collect 300 vision vapor ...[BR]Scope is endless [smilie--sprite1]"}, {"29": "Making this stuff mandatory is rubbish. Inno will regret it"}, {"27": "After almost 6 years of playing, I've already taken a longer break from playing at live server because I don't like the development of the game in the last 2 years at all. If the cauldron is now also involved in events, I'm finally completely out of the game."}, {"102": "I havnt installed it and wont, after 6 years my PS4 is looking really good!"}, {"103": "This is yet another implementation forced on the players.[BR]As a beginner now, you are forced to have a certain amounts of residences, goods, workshops, magic academy, what level of each building you need to be on,etc. to gain the resources given in the quests (which beginner's rely on) . It's pretty hard to do that without spending real money. I get what INNO did there with the Chapter Change implementation.[BR]You no longer gain the needed amount of coins as a beginner in those quests either, making it even harder and not worth the effort to build a new town.[BR]Now, you need to play the Seasons AND the Cauldron AND Crafting AND Events to complete quests/research in each of those stated.... along with the Spire and Tournament, etc. while trying to maintain your town and try to enjoy following the chapter you're in. It's a constant, never-ending job to keep up with everything. The fun is minimal at best.[BR]I've already deleted my main account a couple of weeks ago, after over 7 years of playing, due to frustration with this company and their lack of care towards its players and what we want. It feels like we're now playing in a political world, where the citizens voices no longer matter...unless we are given express permission to do so. Everything else might as well fall on deaf ears.[BR]I'm really mainly here now to see the inevitable downfall of our beloved game. You've changed your management practices over the last couple of years. It's been an even MORE drastic change since Marindor and most of his staff left. They were our last hope for this game.[smilie--sprite3]"}, {"29": "in France we say; shoot yourself in the foot..."}, {"13": "In Italy, cutting (something of) yourself just to upset the wife"}, {"73": "I believe this new development is stupid.[BR]They are making an optional research mandatory for future quests.[BR]With this change they will destroy a big part of their player base.[BR]And once that happens they will get a bad name and destroy them self in the process."}, {"14": "I have researched Cauldron. To be sincere I don't use it so much, as I don't care about Season quests. I simply don't like them so much, and I don't want to change my game style (that's very laaaaaazy) because of them. [BR]We are overwhelmed by features: events, FA, tournaments, spire and now season and cauldron follow one another. We have no more time to dedicate to what Elvenar was created for: build and grow your own city.[BR]Elvenar overview still says: This beautiful fantasy city builder lets you choose to play as either elves or humans. Your task as the ruler of the town is to help your people prosper.[BR]But I feel we're going far away from this, and an example is Secrets of Alchemy event: it's the first event I have see in this game where past event buildings are better than the new ones."}, {"32": "As an end-game player, I decided to ignore EVERYTHING that doesn't suit me and my playing style. Therefore, if new events and Seasons will ask for Cauldron, well, tough luck, I will ignore the events and all Seasons too. I will enjoy events just for getting Unurium from outskirts currency and nothing else. Anyway, it appears as a trend to get weaker and weaker event buildings, so why bother?"}, {"82": "@Prueba2 @Karvest : Thanks so much for explaining the spreadsheet data. This helps me enormously. I'm very grateful for all that you do! [smilie--sprite1]"}, {"95": "HEY INNO!! WHY DON'T YOU JUST GIVE US SCRIPTS TO FOLLOW SO THAT WE PLAY THE GAME EXACTLY HOW YOU WANT????[BR][BR]COME ON,  SOMEONE ACTUALLY FROM INNO ANSWER THIS!! TRULY AMAZING!!!"}, {"3": "Alcaro said:\t\t\tAs an end-game player, I decided to ignore EVERYTHING that doesn't suit me and my playing style. Therefore, if new events and Seasons will ask for Cauldron, well, tough luck, I will ignore the events and all Seasons too. I will enjoy events just for getting Unurium from outskirts currency and nothing else. Anyway, it appears as a trend to get weaker and weaker event buildings, so why bother?\t\tClick to expand...Interesting perspective, @Alcaro [smilie--sprite1][BR][BR]Perhaps we should be treating this as an opportunity rather than an imposition, an opportunity to get off the hampster wheel to which Inno tries to chain us in the last while.[BR][BR]Could skip Cauldron (by definition), Seasons, events, possibly FA, and just concentrate on city building. Could this be feasible? Hmmm"}, {"35": "Verde said:\t\t\tInteresting perspective, @Alcaro [smilie--sprite1][BR][BR]Perhaps we should be treating this as an opportunity rather than an imposition, an opportunity to get off the hampster wheel to which Inno tries to chain us in the last while.[BR][BR]Could skip Cauldron (by definition), Seasons, events, possibly FA, and just concentrate on city building. Could this be feasible? Hmmm\t\tClick to expand...I've been doing this for a while now, the game is pretty boring though once you reach endtech if you ignore everything [smilie--sprite1]"}, {"104": "\"To grant everyone in Elvenar the most magical experience, the Cauldron will start to be involved in quests and requirements starting from January 23rd\"[BR]'THANKS' to all the players who have contributed to this thread (& there have been many earnest & valuable contributions), but you haven't been 'heard', in fact you appear to have been ignored. I'd understand a mini event, tutorial-style, aimed at guiding players through the cauldron quagmire (perhaps we, the vast majority, are 'missing' something in both the 'how to' & benefits? [smilie--sprite12]), but the seemingly dictatorial imposition of including cauldron related activities into the already exhausting demands of the mainstream game &/or side activities is likely to be far from adding to the Elvenar magical experience for many!"}, {"51": "I have always believed that any event in your game is supposed to complement the game itself. Lately with the addition of season of dreams we are inundated with short term productions - invest in your own aw's and a few others that it looks like the only thing Inno is trying to do is get us to spend more time in the game. You really can not fault them for this as this is how they derive their income - but what about an alternate method - listen to the players and bring back some of the things they like - start with the wishing well and continue on from there. They could also eliminate some things that people just do not care for - like the endless buy kp - when I get that quest I stop playing the events as the only thing that does is penalize the player by making the next \"purchase\" even more expensive, and I do not believe is self flagellation - or self punishment. At times now I am wondering if Inno is trying to jettison this game and hoping that its customers will try another of their games - will not happen here - not with what I am being shown"}, {"105": "Verde said:\t\t\tCould skip Cauldron (by definition), Seasons, events, possibly FA, and just concentrate on city building. Could this be feasible? HmHmmmoO\t\tClick to expand...Or just start a new city, wherein they're not even available, for the first few chapters."}, {"18": "So, the announcement on beta is 'the Cauldron will start to be involved in quests and requirements starting from January 23rd'. The Secrets of Alchemy event finishes on the 25th. Is this pre-warning us about the last quest?"}, {"4": "The announcement by @Deadeye Jerry says:[BR][BR]\"To grant everyone in Elvenar the most magical experience, the Cauldron will start to be involved in quests and requirements starting from January 23rd, so if you haven't already, go and research it NOW!\"[BR][BR]It doesn't say 'event quests' and what does 'requirements' mean in this context? The comments above seem to assume event quests. While that seems logical, I don't know if it is true - yet. The current event ends Jan. 24. I don't think they will alter the quests list for this event, but it could reference the last daily. If not and it means only the event quests, we won't see any examples of it until then the next event. That doesn't seem to merit an announcement giving a date of the 23rd. Certainly, it can't mean storyline quests since they tend to be fixed and I can't see them only applying to quest from chapter 21 and beyond. Perhaps the Season's quests and declinable quests, but the declinable ones are going away, or so they say; whoever 'they' are. Maybe it will be obvious come the 23rd. ...and what about 'requirements'? To me, it's a wait and see."}]