[{"9": "From what is written in the annoucement i personaly think that it will become mandatory research and by quests it means chapter 5 quests.[BR][BR]I can also imagine, that making/drinking potion might appear in weekly quests in Seasons.[BR][BR]But we will see what they realy meant."}, {"101": "There is a simple way to deal with having Cauldron be part of events.[BR]Simply stop work on an event when you get to the point of a task that requires the Cauldron.[BR]Go back to having fun with your city. Save yourself a few days/weeks of doing stupid, worthless tasks.[BR][BR]On FoE I often bail out of an event when a task appears that I do not want to do.[BR][BR]How often does an event provide a reward that you absolutely must have? [BR]Personally I find most to be a good source for Spell Fragments."}, {"106": "BlueSoul said:\t\t\tthe seemingly dictatorial imposition of including cauldron related activities into the already exhausting demands of the mainstream game &/or side activities is likely to be far from adding to the Elvenar magical experience for many!\t\tClick to expand...Willie B. Gone said:\t\t\tthe only thing that does is penalize the player by making the next \"purchase\" even more expensive, and I do not believe is self flagellation - or self punishment.\t\tClick to expand...Jaxom said:\t\t\tSimply stop work on an event when you get to the point of a task that requires the Cauldron.[BR]Go back to having fun with your city. Save yourself a few days/weeks of doing stupid, worthless tasks.\t\tClick to expand...Like I also said on the live forum: [BR][BR]It will just be another forced spending of valuable resources to gain something you don't necessarily need at that moment. Your choice to do something in the game when you want to do it is being taken away (again).[BR]And no, choosing therefore to not participe in events is not a comparable/valuable alternative to actually having a choice.[BR][BR]It would not even be so bad if that valuable resource didn't increase in demand. But that is the thing, the resource demands for both buy KP and buy Witch Points increase exponantially.[BR][BR]It's like forcing someone to buy toilet paper rolls each day when they still have a cupboard full of toilet paper, and every day, those rolls become more expensive. It's not that you'll ever stop needing toilet paper, but if you still have enough, and you're not currently sitting on the toilet with diarrhea, you probably don't need to buy any right now. Yet you are forced to."}, {"9": "Jaxom said:\t\t\tHow often does an event provide a reward that you absolutely must have?[BR]Personally I find most to be a good source for Spell Fragments.\t\tClick to expand...I personaly farm KPs from events and from event's evos."}, {"81": "I am a lone voice here .. I LIKE  the cauldron, it’s something new to play with and to learn how to use[BR]the only thing I dislike is the double random so that even though I have got fight spells as the top 3 probabilities.. I end up with a couple of product spells and 2 empty cups, .. but hey I have only used stuff I have a surplus of ..  and it’s a bit of fun …[BR][BR]Inno probably think that if a few more people use the cauldron it will become an excellent part of the game much like the Spire"}, {"107": "2 observations:[BR][BR]If you level your researches, the cauldron is pretty useful for end-chapter players with minimal investment.  If you’re at the end of chapter 20 and have a level 30 bee trader, just using one 100% coin rain with the wholesaler for goods covers levelling up all your 20 diplomas to level 50-60 research. Recurring witch points could guarantee end-game players 4-5 goblets of something each week. It’s easy to see how INNO might see the benefits of the cauldron as a no-brainer just for spending one coin rain.[BR][BR]However, INNO is needlessly setting players up for frustration because 1.we cannot store potions for later use and 2.military and production times pit the two bonuses against each other.  For example, if before morning pick-up I try for a resource potion and get a military potion, the military potion will expire before I can use it in the evening. If I’m aiming for a military potion for my timewarp at afternoon brewing and pick up a 13 hour production goods bonus instead, the long production bonus is actually frustrating because I can’t make full use of it!  Or I pick up two redundant military potions, where again, a potion is useless.  Why force players to waste potions every week unless you want to frustrate them?"}, {"6": "This is my thought: too complicated, too uncertain.[BR][BR]My advice is: simplify.[BR][BR]It's hard to figure out how to mix ingredients to get what you want[BR][BR]It's hard to get what you want, when you want it[BR][BR]The investment is too high for small players, you should put the research starting from chapter 15 or greater[BR][BR]Placing cauldron-related requests into events discourages players from participating in events.[BR][BR]Simplify and make the cauldron interesting and there will be no need to force anyone"}, {"16": "With 20 diplomas you can level more effects, but still can't max few useful ones (these are only military ones, as you can do all your weekly fighting deeds within those 12hours of effect duration, but other effects are almost useless as they cover just a very small portion of your weekly production). + with 20 diplomas you have way less chances to get those useful effects due to probabilities polluted by useless effects.[BR]And the direct consequence of the most effective way of using cauldron military effects (at friday evening on first week and somewhere near wednesday on second week) - you will be locked out from \"buy WP\" quests for almost 80% of the time. For \"brew the potion\" or \"use goblet\" (which are actually the same) lockout is even bigger + they are limited to no more than one per week."}, {"4": "C-Nymph said:\t\t\tIt would not even be so bad if that valuable resource didn't increase in demand. But that is the thing, the resource demands for both buy KP and buy Witch Points increase exponantially.\t\tClick to expand...It seems that too often the term 'exponentially' is used for anything that increases. The 'buy KP' cost increases linearly. For coins, it's 500 coins added for each KP. For the goods, it increases by 40 T1, 20 T2 and 10 T3. Witch points are not linear but may just be a square or some other polynomial. I haven't recorded the change in value, but I'd be really surprised if it was the dreaded exponential. However, I was very surprised that the base tourney and spire squad sizes have an exponential term. So, Inno has done that in one case. I know, I'm nit-picking. It's just a pet peeve I have. (Minor rant over)"}, {"5": "Two observations.[BR][BR]The higher your chapter, the lower the study costs are and the slower the costs rise. So another thing making this favor the end-game players. That means my chapter 20 Live city can raise the effects higher than my chapter 18 Beta city, while spending the exact same amount of resources on witch points. [BR][BR]And while there are 6 military effects, damage and health boosts for each troop building, the barracks health boost effect is the one unlocked when completing chapter 22. Why?!?"}, {"106": "Yogi Dave said:\t\t\tIt seems that too often the term 'exponentially' is used for anything that increases. The 'buy KP' cost increases linearly. For coins, it's 500 coins added for each KP. For the goods, it increases by 40 T1, 20 T2 and 10 T3. Witch points are not linear but may just be a square or some other polynomial. I haven't recorded the change in value, but I'd be really surprised if it was the dreaded exponential. However, I was very surprised that the base tourney and spire squad sizes have an exponential term. So, Inno has done that in one case. I know, I'm nit-picking. It's just a pet peeve I have. (Minor rant over)\t\tClick to expand...I hate to burst that bubble, but I'd like to point you towards my post on EN (live) forum (https://en.forum.elvenar.com/index.php?threads/the-cauldron.17305/page-3#post-108233, text copied below). Yes, I did use the word exponentially twice in that post, I haven't in fact made the exact calculations to see if this is true, but it's at least such a steep rise that it gives the feeling of going towards exponentially.[BR][BR]\t\t\t\t\t\t\tC-Nymph said:\t\t\t\t\t\t\t\tI had a go at \"improving the effects\", because I had resources to spend and it didn't seem to be too expensive at first glance. But the costs rise exponentially, so that the 70 mil marble I had is now down to 37 mil, mostly because I (stupidly) didn't notice that when looking at something else in the game and then going back to the cauldron, the preferred/selected resource to donate switches back to marble. So at a careless moment, I unknowingly increased the cost to 900K marble PER CLICK. [...][BR][BR]The amount of witch points you need to increase an effect to another level also rises exponentially. The costs get rather high when you get above level 50 [...] I have one effect at level 80 now and to get it to level 81 requires 186K witch points. Imagine that if I were to continue spending marble, the next click would cost 900K marble and 'only' gives 2000 witch points. It doesn't require a genius to calculate that this is a ridiculous demand.\t\tClick to expand..."}, {"4": "C-Nymph said:\t\t\tI hate to burst that bubble, but I'd like to point you towards my post on EN (live) forum\t\tClick to expand...Oh, you didn't burst that bubble at all. The 'buy KP costs' increase is linear as I said. I also said the witch point cost wasn't linear. It's at least polynomial, and I'd be surprised if it was exponential. But I wouldn't put it past Inno to make it so since they have done that with the base tourney squad size. But comparing the increase of cost in the cauldron as like the increase in the 'buy KP' is incorrect. The cauldron is significantly worse. We agree on that. Like I said, incorrect use of the term exponential is a pet peeve of mine. No big deal. And I haven't done and probably won't, do the calculations for what the cauldron in actually is."}, {"16": "WP cost = 1000 * (1,03^howManyTimesYou'veAlreadyDonatedThisResource)*(0,75^(Max(0,howManyResearchDiplomasYouHave-4)))"}, {"4": "Karvest said:\t\t\tWP cost = 1000 * (1,03^howManyTimesYou'veAlreadyDonatedThisResource)*(0,75^(Max(0,howManyResearchDiplomasYouHave-4)))\t\tClick to expand...Thank you very much. It is exponential. The 1st term is exponential increasing at 3%. The 2nd is a 25% decay, but only occurs when a new diploma it gotten so only comes into play at most once per chapter."}, {"82": "HappyRose said:\t\t\tInno probably think that if a few more people use the cauldron it will become an excellent part of the game much like the Spire\t\tClick to expand...I've seen a few players making this  comparison, but what is forgotten is that the Spire was near-universally unpopular until the guaranteed FS-level Diamond rewards were added. Very little was otherwise changed, but soon many people decided they loved the Diamonds Spire instead.[BR][BR]If the Cauldron likewise offered a guaranteed 75-125-250 Diamonds per player, according to FS weekly usage, I'm sure we'd see the same result.[BR][BR]Actually, forget that. I wouldn't put it past Inno to think it's a good idea - well, with the Diamonds reduced to about 25, or something! [smilie--sprite8][BR][BR]PS : For what it's worth, even the Diamonds bribe doesn't persuade me to love the Spire. I wish it would go away. Tourney is draining enough."}, {"14": "Laurelin-Beta said:\t\t\tmany people decided they loved the Diamonds Spire instead\t\tClick to expand...And don't forget Premium Buildings; I've replaced all my regular Workshops [smilie--sprite1]"}, {"106": "Laurelin-Beta said:\t\t\tI've seen a few players making this  comparison, but what is forgotten is that the Spire was near-universally unpopular until the guaranteed FS-level Diamond rewards were added. Very little was otherwise changed, but soon many people decided they loved the Diamonds Spire instead.\t\tClick to expand...PrimroseSylvia said:\t\t\tAnd don't forget Premium Buildings; I've replaced all my regular Workshops [smilie--sprite1]Click to expand...Same here. I love the spire not so much for the diamonds, but more for the other rewards. Time instants, CC's, magic buildings, genies, ... For my smaller city I also very much love it for the artifacts for the older evolvable buildings that I wouldn't otherwise be able to evolve there."}, {"43": "After brew[BR]Study effect[BR][BR]on beta my start is 422 I in chapter 16[BR]on live (dk) my start is 13 I finish in chapter 20[BR]what decides our start?[BR][IMG]https://i.ibb.co/0G3xdrG/https-beta-forum-elvenar-com-index-php-attachments-a3f2413b-6b24-4b64-9a91-affc46cd5db7-jpeg-10821.jpg[/IMG][BR]I have ask member on Beta and live[BR]I have get this information[BR]I Think it is not fair that a chapter 5 city start in 1000, it is high for a little town.[BR]It is not the same start, even you are in same chapter.[BR][BR]beta[BR]chapter - start[BR]8 - 316[BR]15 - 178[BR]16 - 422[BR][BR]DK server[BR]5 - 1000[BR]8 - 422[BR]11 - 178[BR]13 - 75[BR]15 - 56[BR]15 - 178[BR]15 - 316[BR]19 - 42[BR]20 - 10[BR]20 - 13"}, {"16": "eltina said:\t\t\twhat decides our start?\t\tClick to expand...amount of research diplomas you have. from 1000 for 4 or less diplomas to 10 for 20 diplomas."}, {"43": "okay, so it's an advantage for all of us who are far away from chapter 5 when the cauldron started.[BR]all small towns that are only now researching get 1000 as a start."}]