[{"16": "It's not a static thing. As soon as you get more research diplomas your costs will go down."}, {"33": "Quick question, how many SpellFragments are refunded per failed brewing?[BR]I mean if 20k are spent, how many should the system return per failed attempt?"}, {"16": "According to some strings inside game files, you should get back half of spell fragments and all the diamonds. But notice that your fragments and diamonds are distributed over all goblets, so if you have 5 goblets and fail one attempt - you'll get back 1/10 of spent fragments and 1/5 of diamonds (haven't tested diamonds part myself)."}, {"33": "Ok, I just wasted 20k, testing it.[BR]Each failed attempt refunds 2k , so it is correct 1/10"}, {"45": "Prueba2 said:\t\t\tOk, I just wasted 20k, testing it.[BR]Each failed attempt refunds 2k , so it is correct 1/10\t\tClick to expand...And so the point was..."}, {"33": "Dorfl the Clay said:\t\t\tAnd so the point was...\t\tClick to expand...Understanding"}, {"29": "[IMG]https://i.ibb.co/3m5S0VN/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-01-23-111959-png-10832.png[/IMG][BR][BR][BR][IMG]https://i.ibb.co/GFH8FG6/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-01-23-112610-png-10830.png[/IMG]... [IMG]https://i.ibb.co/GvJr715/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2023-01-23-112652-png-10831.png[/IMG][BR][BR]Before ........................................................................................ Now [smilie--sprite4][smilie--sprite4][smilie--sprite4]"}, {"100": "So:[BR]I have unlocked the cauldron[BR][BR]But -  if Inno thinks he has to force me to use the cauldron so that I can progress, [BR]then of course I will go, both from the beta and from the German side. [BR]Then the game will be a thing of the past for me.[BR][BR] I had thought that it should be a fun game and I won't be forced to use anything I can't just [BR]because I'm in the lower chapters (currently early VI). I don't have enough goods to just bring them in."}, {"45": "If just researching the Cauldron (without further using it) is enough to be able to do technologie research I have no problem with it.. since that only involves one step in the techtree and the loss of 30 KP.. but if some quests in the screen become impossible to resolve without using the Cauldron (and without the option to refuse them) I am gone too!"}, {"51": "Why thank you Inno !! I have wondered how to explain my desire to not add seeds, sentient goods and ascending goods to my inventory after experiencing the loss of most of my mana when I had to take a little bit of time away from the game. By not being able to advance in this game , I can now tell people that I do not wish to use the most unpopular feature ( to date that is- there might be more coming)  that you have devised so far. This might have been avoided had you gotten down from your high horse and deigned to explain a feature for once - but as it is I see no future for this feature in my world."}, {"108": "Do you want more people to use the Cauldron? Give us the ability to store the potions and increase their duration. As it stands now, if a player brews potions on a Sunday and gets a 3-hour military boost, for example, they end up with a useless boost. Couple that with the fact that if you don't put diamond-bought ingredients, you frequently end up with nothing. Multiply that with the fact that you may use diamond-bought ingredients and still end up with nothing. Voila, you just created the most useless, annoying, and rightfully hated feature in the game."}, {"109": "How can the cauldron be involved in quest and event ??? If we have brew yet some potion, we have to wait one week to be abble to do an other one. Does that mean that the player will be blocked for one week in his quest line ??? [BR]absolutely ridiculous[BR][BR]for the 4 fellowship (3 lives and Beta) none of us have found the interest of using this new feature. Too random, too complicated.[BR]We just spend ressources without having real effect or what so ever.[BR][BR]it might be better if we can store some potion in the inventory and use them when we need too"}, {"73": "There is one simple way to make the cauldron useful.[BR]Let us decide to use the goblets when we want and on saterday evening when the tournament closes, all leftover potion goblets are gone.[BR][BR]The positive effects:[BR]1) goblets made for the goods production boost can be taken at the time right before collecting the goods from your factories.[BR]2) goblets made for fighting can be taken right before you fight in the spire, tournament or province[BR][BR]Negative effects:[BR]1) if a goblet has the wrong effect or no effect at all, you need to take a second or e 3rd goblet (but that is now with all 5 goblets and worst case 4 are wasted on same effect)[BR]2) the cauldron might become useful for all players."}, {"55": "Enar's Boon (Cauldron Mana boost) should also affect AWs, as discussed in this thread.[BR][BR]Also, thank you very much for your feedback, especially about the recent announcement to make the Cauldron mandatory.[BR]We are glad that the Beta community is voicing their opinion so very vehemently. It's really appreciated that you spend your time writing your thoughts down for others to read, to discuss, and to work with:  40k views and 432 replies speak for themselves!"}, {"33": "Vaeri said:\t\t\tEnar's Boon (Cauldron Mana boost) should also affect AWs, as discussed in this thread.\t\tClick to expand...What about Orcs boost (Shrine of the Champions, Heroes Forge) , Seeds boost (Sunset Towers, Elvenar Trade Center, ), Unurium boost (Vallorian Seal, Temple of Spirits )....?[BR][BR]Also, Mana boost & Dragon Abbey/Ener's Embassy?"}, {"22": "Prueba2 said:\t\t\tWhat about Orcs boost (Shrine of the Champions, Heroes Forge) , Seeds boost (Sunset Towers, Elvenar Trade Center, ), Unurium boost (Vallorian Seal, Temple of Spirits )....?[BR][BR]Also, Mana boost & Dragon Abbey/Ener's Embassy?\t\tClick to expand... only on shrine of the champions and elvenar trade center, I think.."}, {"16": "Finally made cauldron recipe calculator working on the most of relatively recent Excel versions (tested down to 2016, but I think it should work on 2013 as well, and maybe even on 2010).[BR]First of all you need solver add-in enabled (how to enable it).[BR]Then download https://tinyurl.com/ElvenarCauldron[BR]Open it, allow editing and unblock active content (VBA macros). VBA is used there for the only purpose of emulating =SORT() function which exists only in Excel 2021 and later.[BR]Ingredients are sorted same way as they are in game, amounts are here (both starting point for solver and resulting recipe, you can clear them all to start from scratch):[BR]Spoiler: screenshot[IMG]https://i.ibb.co/p2RDnq3/https-beta-forum-elvenar-com-index-php-attachments-1674516858188-png-10848.png[/IMG]this recipe looks like this in game:[BR][IMG]https://i.ibb.co/phH5Kbp/https-beta-forum-elvenar-com-index-php-attachments-1674516949251-png-10849.png[/IMG][BR]There is a small rounding error in calculating required witch points, but I guess +-3 is not a big issue.The usage is simple (mentioned cells are marked with red squares like on first screenshot):[BR]1. write down your current available witch points and research diplomas amount in appropriate cells:[BR]Spoiler: screenshot[IMG]https://i.ibb.co/0hZk3kq/https-beta-forum-elvenar-com-index-php-attachments-1674517195006-png-10850.png[/IMG][BR]Notice effects that you can get with written amount of diplomas are marked cyan.2. Select diamonds-blocked ingredients by entering 1 in appropriate cells:[BR]Spoiler: screenshot[IMG]https://i.ibb.co/9THWVVy/https-beta-forum-elvenar-com-index-php-attachments-1674517217171-png-10851.png[/IMG]3. write down weights of your desired effects (on screenshot and in the file these are only military effects, with mc_strength having a bit bigger priority and tg_strength - a bit lower.[BR]Spoiler: screenshot[IMG]https://i.ibb.co/nj4Wdww/https-beta-forum-elvenar-com-index-php-attachments-1674517518381-png-10852.png[/IMG]4. start solver add-in (On the Data tab, in the Analysis group, click Solver.) and press Solve.[BR]Solver would try to maximize the SUM of your weighted effect probabilities (you can see it at the left of the weights).[BR]It may take some time, but you can control the process by pressing Esc from time to time and looking how it's going. If it is not changing for a long time you can stop it or wait for timeout.[BR]5. The result is the list of ingredients, amount of required witch points and effect probabilities. Note that you should invest ingredients starting from max used one going down to least used one, or your actual WP cost will be bigger than in recipe.[BR]Spoiler: screenshot[IMG]https://i.ibb.co/3MZBPft/https-beta-forum-elvenar-com-index-php-attachments-1674518520996-png-10854.png[/IMG][BR]Individual probabilities are marked light green near their weights, their sum = the chance of getting at least one useful effect on each try, there is also overall success rate listed (77.46%).[BR]With this recipe I would have 29.6% chance to get barracks strength effect and same for MC strength (59.2% total). + will have 23.54% chance to get back used spell fragments if I use some.If you found some issues - feel free to report it."}, {"73": "I would like to ask your permission to use, alter/translate and upload this tool to the Dutch forum with a big thanks to you."}, {"16": "There are not so many things to translate, but of course you can do it. Anything went public is public.=)"}, {"109": "With the new update of the cauldron, we have a player in our fellowship ow is blocked on his tech tree, even if he has unlock the cauldron too. Does someone have te same problem please?"}]