[{"45": "Ursus Major said:\t\t\tWith the new update of the cauldron, we have a player in our fellowship ow is blocked on his tech tree, even if he has unlock the cauldron too. Does someone have te same problem please?\t\tClick to expand...If the player already tried refreshing the game (log off and on, clear cache) it sounds like something support should look at.. was it already reported to them?"}, {"16": "Finally got critical effect:[BR]Spoiler: screenshot[IMG]https://i.ibb.co/4Kxt6g6/https-beta-forum-elvenar-com-index-php-attachments-1674656203735-png-10864.png[/IMG]Seems critical = max effect power + x1.5 max effect duration."}, {"33": "I hoped it would affect both Bonus and Duration.[BR]I mean, after spending such amounts of resources, I expected something less ... weak...[BR][BR]Only 1x MAX bonus and 1.5x MAX duration...[BR]...and to have 50% critical we would need to expend 165k Spell Fragments (that are 165 000, ... a lot of weeks of Spire...)"}, {"16": "Well, adding fragments give direct increase of effect power and duration even without critical, so using 10k of them weekly probably worth it (at least I can sustain such usage)."}, {"33": "Ok, I had to prepare a small table to be able to fully understand it.[BR]Now I see that spending SpellFragments does also increase the Bonus.[BR][BR]Spell FragmentsNormal Bonus[BR] Normal DurationCritical ProbabilityCritical Bonus[BR] Critical Duration0k0-100%[BR]0-100%0%---[BR]---10k0-150%[BR]0-150%10.5%150%[BR]225%40k0-200%[BR]0-200%22.1%200%[BR]300%90k0-250%[BR]0-250%35.0%250%[BR]375%160k0-300%[BR]0-300%49.2%300%[BR]450%165k0-303%[BR]0-303%50% (MAX)303%[BR]454%[BR]EDIT: Still the normal effects are still too RNG dependant, too irregular..."}, {"110": "I am trying to understand the cauldron betterm[BR]does anyone know what the v and f means in the sheet? (the yellow arced part[BR][BR][IMG]https://i.ibb.co/F6VV7P9/https-beta-forum-elvenar-com-index-php-attachments-1674856304451-png-10882.png[/IMG]"}, {"16": "value and factor - different parts of the formula[BR]vba macros is disabled on your screenshot, so it can't calculate actual cost of the recipe."}, {"12": "I brewed this week in my town in Fely to 47% mercenary damage.[BR][IMG]https://i.ibb.co/WB62JP5/https-beta-forum-elvenar-com-index-php-attachments-screenshot-50-png-10883.png[/IMG][BR]and that's what I got[BR][IMG]https://i.ibb.co/bmgzTZf/https-beta-forum-elvenar-com-index-php-attachments-screenshot-52-png-10884.png[/IMG][BR]3x snot and 2x fails, how can a fail at 47% be possible or 2 fails?[BR]Can someone explain, is this an unusual rare case of bad luck or am I bewitched?"}, {"16": "Seems you are unlucky enough to be in 6% of those who will fail 5x47% and 5% of those who will fail 2x77.5%"}, {"12": "Karvest said:\t\t\tSeems you are unlucky enough to be in 6% of those who will fail 5x47% and 5% of those who will fail 2x77.5%\t\tClick to expand...Hm oki, I thought I was standing too close and a pringle fell into it.[BR]Then I guess I'll have to be more on the safe side."}, {"110": "Karvest said:\t\t\tvalue and factor - different parts of the formula[BR]vba macros is disabled on your screenshot, so it can't calculate actual cost of the recipe.\t\tClick to expand...I was more looking for information how those factors work.[BR]I do not want to run macro's, I rather try to understand why something does what it does.[BR][BR]When you understand something you can make your own choices.[BR]I have tried macro's but in the end my own reasoning quite often creates a better outcome as the macro often has another calculus than my priorities are.[BR][BR]It also makes the puzzle a lot more fun, if you puzzle it yourself, but understanding what you are puzzling is a key part of solving the puzzle"}, {"16": "you can see formulas just under those values and factors,[BR]probability = max(0,sum(values)*1.1^sum(factors))[BR]calculated for each effect separately then normalized to overall success chance (NumberOfUsedIngredients/25)^0.5[BR]as for priorities for macro - they are configurable...[BR]well, not for macro, macro just sorts ingredients to calculate their cost in witch points, but for solver add-on."}, {"12": "For the next week I need mercenaries and training ground damage, that's my al dente recipe. The 100 diamonds won't hurt me now, as long as there isn't friendly fire again. Let's see how long my bad luck keeps chasing me, otherwise I'll need Gordon Ramsay's number [smilie--sprite1][BR][IMG]https://i.ibb.co/qBtgH3S/https-beta-forum-elvenar-com-index-php-attachments-screenshot-56-png-10887.png[/IMG][BR][BR]The non-diamond alternative looks pretty confident, but without the mercenary bonus, like nachos without cheese dip.[BR][IMG]https://i.ibb.co/NYRw5qx/https-beta-forum-elvenar-com-index-php-attachments-screenshot-57-png-10888.png[/IMG][BR]In case anyone is wondering, for me the barracks damage and barracks units in chapter 17 are useless. [BR]I do produce golems, because why not, but all these units are good at, is scraping off quickly."}, {"82": "This has probably been covered by explanations which are phrased in a way I haven't understood properly, but I'm currently running through the first few explanatory Cauldron Quests on Live (I've given up trying to avoid using it completely!), and I noticed that one of the Witch's introductory dialogue texts (image below) states there is a better chance of achieving the stated Potion strength & duration if \"more Ingredients\" are added :[BR][BR][IMG]https://i.ibb.co/N73kvCC/https-beta-forum-elvenar-com-index-php-attachments-cauldron-potion-strength-duration-estimate-jpg-10.jpg[/IMG][BR][BR]However, the text doesn't clarify whether \"more\" Ingredients means \"more variety [of different Ingredients]...\" or only \"greater total number [of the same one or more Ingredients]...\".[BR][BR]These points appear to be relevant if my reading of the info provided both here and on the US Forum is correct, since I gather from what I've read so far that adding Ingredients in consecutive batches of 2-4, to achieve specific combinations of not many different Ingredients, instead of using a mixture of many different types of Ingredient, is the most efficient way to gain the best results.[BR][BR]Is this piece of Witch dialogue just a poor translation of something already explained in another way, but which I've simply misunderstood?[BR][BR]Can anyone please enlighten me on this, before I waste a ton of Witch Points on semi-uninformed guesses of my own? Thanks in advance! ^_^"}, {"12": "Laurelin-Beta said:\t\t\tCan anyone please enlighten me on this, before I waste a ton of Witch Points on semi-uninformed guesses of my own? Thanks in advance! ^_^\t\tClick to expand...I'm sure now that she means that it's a good idea to use as many ingredients as possible, but not necessarily blindly, of course, but according to the needs of the potion or potions to be brewed.[BR][BR]As you can see above I failed 2 times at 77.5% and missed the potion 5 times which had a 47% chance of success.[BR]In my opinion, this should hardly be possible, but as we can see, even the impossible is possible here [smilie--sprite1][BR]My takeaway from this is that if you aim to save hex points when brewing, then you're inviting the fail at the same time.[BR][BR]EDIT: [BR]Oh sorry i didn't see the picture when i wrote the text above. In the picture she means that you can improve potions (learning phase) and also increase the learned value with fragments when brewing."}, {"33": "Jammin said:\t\t\tFor the next week I need mercenaries and training ground damage, that's my al dente recipe. The 100 diamonds won't hurt me now, as long as there isn't friendly fire again.[BR][...][BR]In case anyone is wondering, for me the barracks damage and barracks units in chapter 17 are useless.[BR]I do produce golems, because why not, but all these units are good at, is scraping off quickly.\t\tClick to expand...Correct me If I am wrong , chapter 17 => 12 diplomas?[BR]Spoiler: Merc & Training Grounds[IMG]https://i.ibb.co/JCxyNqH/https-beta-forum-elvenar-com-index-php-attachments-1675014453352-png-10894.png[/IMG][BR]With those numbers , probably it is good idea to spend 10k to 40k Spell Fragments to improve both Bonus and Duration..."}, {"12": "Prueba2 said:\t\t\tWith those numbers , probably it is good idea to spend 10k to 40k Spell Fragments to improve both Bonus and Duration...\t\tClick to expand...Good idea to donate up to 40k fragments?[BR]Definitely not a good idea [smilie--sprite1][BR]You don't need the Cauldron to play a good tournament, I've managed without it for the last 2 years.[BR]The benefit and the RNG that comes with it doesn't justify such an investment, and certainly not every week.[BR]I donate 3-5k in this area there is a cost-benefit increase.[BR]By the way, your picture is wrong, there's only TG without MC, but that's not bad, I don't need the picture, I always do it myself."}, {"33": "Jammin said:\t\t\tI don't need the picture, I always do it myself.\t\tClick to expand...Good to know!"}, {"73": "the assumption that ch17=12 diploma's is wrong.[BR]you get 1 diploma for every chapter you did all the researches in, also the once on a dead branch of the research tree.[BR]So chapter 17 players can have up to 16 diploma's.[BR]It can be a point of discusion if they can have 17 diploma's but at that point they are researching chapter 18 1st item, so as far as I can see, they are at that point ch 18 players.[BR][BR]only ch20 players that are waiting for the end wall can have the same number as were they are in the chapter list."}, {"105": "Laurelin-Beta said:\t\t\tHowever, the text doesn't clarify whether \"more\" Ingredients means \"more variety [of different Ingredients]...\" or only \"greater total number [of the same one or more Ingredients]...\".\t\tClick to expand...Both are actually true. The tradeoff is between a few high percentages effects, or a lot of low percentage effects. Both approaches will give you the same overall chance of getting \"something.\"[BR][BR]But there IS an important distinction: When you use an ingredient the price of that particular ingredient goes up 154%, while the price of all other ingredients goes up by 110%.[BR][BR]So it's considerably more expensive to be picky, and much cheaper if you're willing to take whatever popups up. [BR][BR]Further, each week four random herbs will require Diamonds, rather than Witch Points, so a narrow focus will frustrate you no end."}]