[{"16": "Bor de Wolf 1965 said:\t\t\tthe assumption that ch17=12 diploma's is wrong.\t\tClick to expand...It was not an assumption that ch17=12diplomas.[BR]It was just a clarification of 2 separate things visible on screenshot:[BR]witch points (enough for ch17) and used ingredients + effects percentages (12 diplomas)."}, {"45": "Bor de Wolf 1965 said:\t\t\tbut at that point they are researching chapter 18 1st item,\t\tClick to expand...It is a well known fact that only after you have finished the first research (of any chapter) you are considered 'in that chapter'..."}, {"73": "I know Dorfl, but everyone I know that plays this game considers the fact after you finished the last mandatory research of a chapter, you are done with that chapter."}, {"45": "Bor de Wolf 1965 said:\t\t\tI know Dorfl, but everyone I know that plays this game considers the fact after you finished the last mandatory research of a chapter, you are done with that chapter.\t\tClick to expand...It's a bit like Vulcan logic.. something isn't truely finished until you have completed the first next step... [smilie--sprite6]"}, {"105": "Dorfl the Clay said:\t\t\tIt's a bit like Vulcan logic.. something isn't truely finished until you have completed the first next step... [smilie--sprite6]Click to expand...When I was in college, I discovered that the BEST way to study for an exam was to quickly read the NEXT chapter.[BR][BR]It's  much easier to understand the foundation if you know what the house looks like."}, {"4": "Dorfl the Clay said:\t\t\tIt is a well known fact that only after you have finished the first research (of any chapter) you are considered 'in that chapter'...\t\tClick to expand...Bor de Wolf 1965 said:\t\t\tI know Dorfl, but everyone I know that plays this game considers the fact after you finished the last mandatory research of a chapter, you are done with that chapter.\t\tClick to expand...[BR]I'm waiting for chapter 21 in my live city and have 20 diplomas because I've done all the research in the game so far. So, I have completed chapter 20. However, until I do the 1st tech of chapter 21, I won't be able to upgrade building, get event building or get the avatars for that chapter 21. The game can't guess your intent to be in the next chapter until that 1st tech is done, however it does know when you have finished the previous one. Same as when you finish 10th grade, you aren't in 11th grade until you attend school that 1st day of the next year."}, {"105": "Yogi Dave said:\t\t\tSame as when you finish 10th grade, you aren't in 11th grade until you attend school that 1st day of the next year.\t\tClick to expand...Similarily, graduating from High School doesn't mean you've started College."}, {"62": "question about the special effects , if you use 10000 spell fragments for better special effect , is it a 1x use for all 4-5 cups to use?     thats what it seems now (just want to confirm)"}, {"16": "You use it once for all cups, but get back only 1/10 on failed cup (for 5 cups, never had less, can't say how it works for 1-4)."}, {"74": "It seems it is tot/#cups for each cup"}, {"86": "I find the latest move of Innogames totally disgusting.[BR]Lots of people have said again and again they don't like the cauldron.[BR]Their response: let's make the cauldron mandatory, force it everybody's throat. They cannot not like it, it's simply because players are too stupid to understand what's good for you. As far as I can tell, that's about the first time they did that.[BR]And I can't say I agree this this move, it's incredibly heavy-handed.[BR][BR]Why couldn't they just say \"okay, we made a big mistake, we'll retire the cauldron for a few weeks and think about it\" ?[BR][BR][BR]That's about how it's been done for as long as I remember.[BR](plus, I've already seen one player asking on facebook because he's stuck in his research tree and there AREN'T any obvious hints *in the tree* telling him he has to go back to chapter 5 to research the cauldron. Previous additions of mandatory tech, like unlocking the tournament and the spire, were handled much more gracefully by innogames.The poorness of the UI for the whole cauldron mess is disturbing. Is this the pet project of some new intern promoted developer ?)"}, {"62": "ayvinul said:\t\t\tI find the latest move of Innogames totally disgusting.[BR]Lots of people have said again and again they don't like the cauldron.[BR]Their response: let's make the cauldron mandatory, force it everybody's throat. They cannot not like it, it's simply because players are too stupid to understand what's good for you. As far as I can tell, that's about the first time they did that.[BR]And I can't say I agree this this move, it's incredibly heavy-handed.[BR][BR]Why couldn't they just say \"okay, we made a big mistake, we'll retire the cauldron for a few weeks and think about it\" ?[BR][BR][BR]That's about how it's been done for as long as I remember.[BR](plus, I've already seen one player asking on facebook because he's stuck in his research tree and there AREN'T any obvious hints *in the tree* telling him he has to go back to chapter 5 to research the cauldron. Previous additions of mandatory tech, like unlocking the tournament and the spire, were handled much more gracefully by innogames.The poorness of the UI for the whole cauldron mess is disturbing. Is this the pet project of some new intern promoted developer ?)\t\tClick to expand...i think the cauldron is great to help with tournement etc and to fight in tower , it just need a waaaay better way to explain how it exacly works and maybe give a few examples in a video  with combinations of potions"}, {"16": "It's not \"great\", just average.[BR]Even if you are lucky enough to get all your favorite boosts, have them leveled really high (90+lvl) and use 10k fragments, strength increase give you just 215-225% attack instead of 190% (13-18% of actual increase if you have fire phoenix and lvl35l AWs) for troops which are not covered by expiring buildings, and like 5% for main attack force covered by 4-5 expiring buildings.[BR]Health effects are even less useful, as UUU and DA cover all types of units - my typical 255% => 270-275% = +6-8% of actual units HP (for the same 90+lvl of effect and 10k fragments), and it won't apply for all units.[BR]+ increasing chance for HP boost effect for some type of barracks reduce the chance of getting strength effect for same type of barracks, making it almost useless to go past 11 diplomas for health effects, as it also adding more useless effects to the potion.[BR]But yes, fighting-oriented effects are much better than others, at least they worth leveling."}, {"12": "This week I was successful, but I didn't try to save HP.[BR]I also invested 5k fragments that are not in the first picture.[BR][IMG]https://i.ibb.co/qBtgH3S/https-beta-forum-elvenar-com-index-php-attachments-screenshot-56-png-10887.png[/IMG] [IMG]https://i.ibb.co/pzMGcWW/https-beta-forum-elvenar-com-index-php-attachments-screenshot-65-png-10926.png[/IMG] [IMG]https://i.ibb.co/XS8SjVH/https-beta-forum-elvenar-com-index-php-attachments-screenshot-69-png-10927.png[/IMG][BR][BR]Next week we only need mercenary camps, unless the main ingredient is blocked with diamonds, it should work again with all in.[BR][BR]Edit: Barring bad luck, this should work for the next week. [BR]Alternatively, we could invest a few more diamonds in the second main ingredient if we want more security.[BR][IMG]https://i.ibb.co/g6NRxJx/https-beta-forum-elvenar-com-index-php-attachments-screenshot-71-png-10928.png[/IMG]"}, {"82": "In what order are the military boosts applied? I've read either here or on the US Forum (sorry, can't remember) that the Potion boost applies to total Unit Health, but it didn't specify what 'total' means - i.e. whether before/after some or all other HP buffs (AWs, UUU, DA...).[BR][BR]In fact, do ALL Potion effects apply to base unmodified figures, as the Goods production Potions do, or does this vary between Potion types?"}, {"12": "Any percentage bonus is always calculated from a unit's base first and then added to it."}, {"16": "not before/after, but along with them. if you have +30% from MM, +50% from DA, +25% from UUU and +15% from potion => totally you have +120% (=220% of base HP)"}, {"33": "Jammin said:\t\t\tGood idea to donate up to 40k fragments?[BR]Definitely not a good idea [smilie--sprite1]Click to expand...[BR]Jammin said:\t\t\tI also invested 5k fragments that are not in the first picture.\t\tClick to expand...The effects improved with the inversion of SpellFrag, right?[BR]So it seems it is worth it"}, {"12": "Prueba2 said:\t\t\tThe effects improved with the inversion of SpellFrag, right?[BR]So it seems it is worth it\t\tClick to expand...Jammin said:\t\t\tI donate 3-5k in this area there is a cost-benefit increase.\t\tClick to expand...I definitely still think investing up to 40k fragments is not a good idea."}, {"33": "40k means +100% bonus and +100% duration, with aprox 20% critical ( for total 300% duration = (base +100%) x1.5).[BR][BR]Is it expensive? Yes, it is[BR]Is it questionable to being able to afford to spend such quantities weekly? Yes, it is[BR]Once already spending 4000 Witch Points in the potion, is a way of getting more duration and bonus from the leveled effects? Undoubtly[BR][BR]EDIT: 10k means +50% bonus and +50% duration, with aprox 10% critical ( for total 225% duration = (base +50%) x1.5)."}]