[{"9": "Btw, about learning diplomas:[BR]Comparison between 2 cities:[BR]City 1 with 11 diplomas (minimum for Mercenary Mayhem).[BR]City 2 with 19 diplomas.[BR][BR]Witch points: [BR]City 1:[IMG]https://i.ibb.co/z6qX3tQ/https-beta-forum-elvenar-com-index-php-attachments-1675681961349-png-10931.png[/IMG],City 2:[IMG]https://i.ibb.co/WPcBFpn/https-beta-forum-elvenar-com-index-php-attachments-1675682056492-png-10932.png[/IMG][BR][BR]Used ingredients:[BR]City1 / City 2:[BR][IMG]https://i.ibb.co/QD4Qtzc/https-beta-forum-elvenar-com-index-php-attachments-1675682156639-png-10933.png[/IMG] [IMG]https://i.ibb.co/0nSsyxS/https-beta-forum-elvenar-com-index-php-attachments-1675682169154-png-10934.png[/IMG][BR]Overall chance:[BR]City 1: [IMG]https://i.ibb.co/tz5Xbfq/https-beta-forum-elvenar-com-index-php-attachments-1675682216459-png-10935.png[/IMG], City 2: [IMG]https://i.ibb.co/xGbLCSx/https-beta-forum-elvenar-com-index-php-attachments-1675682229508-png-10936.png[/IMG][BR][BR]And now the most important chance for Mercenaries Mayhem:[BR]City1 with 11 diplomas:[IMG]https://i.ibb.co/m94WsX0/https-beta-forum-elvenar-com-index-php-attachments-1675682277601-png-10937.png[/IMG], City 2 with 19 diplomas:[IMG]https://i.ibb.co/378BnQ7/https-beta-forum-elvenar-com-index-php-attachments-1675682296225-png-10938.png[/IMG][BR][BR]Despite the fact, that city 2 can use 1 additional ingredient (more witch points from more diplomas), city 1 has much better chance to get the desired effect thanks to the unlearned diplomas - I want to have a possibility to unresearch technologies!"}, {"45": "Lovec Krys said: I want to have a possibility to unresearch technologies!Click to expand...You and me too, Bro!!!"}, {"74": "Lovec Krys said:\t\t\tBtw, about learning diplomas:[BR]Comparison between 2 cities:[BR]City 1 with 11 diplomas (minimum for Mercenary Mayhem).[BR]City 2 with 19 diplomas.[BR][BR]Witch points:[BR]City 1:View attachment 10931,City 2:View attachment 10932[BR][BR]Used ingredients:[BR]City1 / City 2:[BR]View attachment 10933 View attachment 10934[BR]Overall chance:[BR]City 1: View attachment 10935, City 2: View attachment 10936[BR][BR]And now the most important chance for Mercenaries Mayhem:[BR]City1 with 11 diplomas:View attachment 10937, City 2 with 19 diplomas:View attachment 10938[BR][BR]Despite the fact, that city 2 can use 1 additional ingredient (more witch points from more diplomas), city 1 has much better chance to get the desired effect thanks to the unlearned diplomas - I want to have a possibility to unresearch technologies!Click to expand...The worst part of The Cauldron is that, the more diplomas you get advancing in the research tree, the worst The Cauldron becomes as the %s above demonstrate :-( Let us unsearch!!!"}, {"74": "Potion total %: 77.5 -> 2 fails on 5 tries[BR]Effect1 %: 35.2; Effect2 %: 14.3 -> 0 on 3 successes[BR][BR]Why should anybody be interested in The Cauldron?"}, {"45": "spennyit said:\t\t\tWhy should anybody be interested in The Cauldron?\t\tClick to expand...Interested? NO! [smilie--sprite5] Forced to activate it? Yes. [smilie--sprite4] Trying to ignore it? As much as possible. [smilie--sprite8] Looking for another game? Definitely! [smilie--sprite6]"}, {"16": "After some time of using our recipe calculator we added an option which tries to get even probabilities for selected effects. Using is almost the same as in original post, but there is additional checkbox to switch the logic:[BR]Spoiler: screenshot[IMG]https://i.ibb.co/cvnWjV3/https-beta-forum-elvenar-com-index-php-attachments-1676667710863-png-11011.png[/IMG]It doesn't work great if you select a lot of effects or select effects that can't get high even chances together."}, {"73": "What would be an improvement as well is a pacifist switch so it automatic ignores the Barracks, training grounds and mercenary camp buffs.[BR]At this moment I use it for someone with -100 on those options but an auto block would be great."}, {"16": "If you select few pacifist effects and skip military - it would automagically try to minimize those military buffs chances. But there is no way to block them entirely without noticeable bad impact on your preferred effects chances."}, {"54": "With every passing week, I grow more frustrated, lose more interest, and have less hope with the cauldron.  It would be so much more enticing if we actually got the recipe effects we wanted rather than a random stream of recipe effects we don't want or need, not to mention the random \"Fails.\"  I thought my chances would improve by investing in the recipe effects I really wanted... not seeing that.  Experiences range (using weekly 5 goblets) from all 5 succeeding @ 52% success rate (recipe levels below 10) to failing 3 @ 82.5% success rate (recipe levels 15+).  Plus the more recipes we gain, the less the chance % of recipes getting triggered?  This doesn't make sense, results & duration are way too small, and random to make this a mandatory part of the game.  IMO: It doesn't seem worth it for players who cannot login every few hours to make use of any recipe effect. Also, players without hundreds of thousands of spell fragments are out of luck boosting their critical effect chances above 5-10%. [BR][BR]I've no problem with random ingredients being unavailable every week, I do have an issue with getting random recipe effects I don't want (especially those that are under 10% chance to trigger). It's been a challenge to find combinations that actually boost rather than detract from the desired outcome.  I'd like to have ingredients/recipes more clearly designated; like only provide coins and supplies; only standard goods; only sentient goods; only ascended goods; only military boosts; only Mana, Divine seeds, and Unurium. Getting unwanted recipe effects and random Fails are huge reasons I'm not liking the Cauldron.[BR][BR]I had hoped to see the Cauldron as a mechanism to GREATLY bolster (like a minimum of 200%) the effects or productions we really need rather than a huge gamble and sink-hole for resources that takes months to build up and get any reasonable benefit that last more than a few hours.  It's taking weeks longer than I had hoped to get recipe durations or benefits to any level I'd consider rewarding... still not there, been playing Cauldron since it came out in Beta, and I've got some recipes @ level 35+.  IMO: this was introduced to live worlds way too early with the current mechanisms in place.  There's a lot more than could have been done to make the Cauldron more palatable and easier for players to use. If this is meant to be a complex long-term adjunct to game-play, that needed to be made clear at the start (transparency with intentions & instructions please).  That also means late-game players may not see the long-term benefits before they reach the end.  Also, earlier chapter players may just quit playing the Cauldron due to low chance of rewards, unwanted triggered recipes, lack of spell fragments, and lack of clear in-game instructions. Basically, it feels like players have been set up to be frustrated and fail with the Cauldron."}, {"12": "In order to help you, we would first need some key data, how many diplomas do you actually have and which potion do you want at all... and yes, I write potion, not potions.[BR]Concentrate on brewing a potion first, of course it should already be well leveled.[BR]Sometimes there will be diamonds on the necessary ingredients, then you will have to choose to pay for them or just brew another leveled potion.[BR][BR]Once you figure out how to get what you want, you can approach two potions that you want at the same time... but I'll tell you right away, from then on it won't be easy, and certainly not, if you want three potions.[BR][BR]You can't expect to get 5 wishing potions at 5 cups with so much random factors.[BR][BR]If you don't want to be disadvantaged any more then make sure you don't get any more diplomas, you can prevent that by not completing all research in a chapter, so always leave an unimportant optional one. More diplomas just mean more randomness and lower chance of getting what you really want.[BR][BR]If you're already in chapter 20 and have explored everything, you've had it."}, {"9": "ZodiBeta said:\t\t\tI've no problem with random ingredients being unavailable every week, I do have an issue with getting random recipe effects I don't want (especially those that are under 10% chance to trigger).\t\tClick to expand...Those things are connected.[BR]If you have an effect where it is reasonable to use only 5 of the 16 ingredients and 3 of them are blocked by dias, then with the remaining 2 (especialy if they are not the primary ones(those with highest chance)) you have a problem.[BR]Especialy when you're aiming at effect requiring 11 diplomas and you have 20 diplomas greatly lowering your chance for that effect due to system flawed from the start."}, {"74": "Lovec Krys said:\t\t\tEspecialy when you're aiming at effect requiring 11 diplomas and you have 20 diplomas greatly lowering your chance for that effect due to system flawed from the start.\t\tClick to expand...And this is the main problem: I already got 19 diplomas (in the real world) before The Cauldron was released and without knowing what this would have meant. So I am already disadvantaged without any chance to improve my %s :-("}, {"12": "I've noticed that my posts are changed by a moderator from time to time... I once asked a moderator in the German forum to change a player's post, because I think this player had the wrong words.[BR]The moderator wrote me that they are not allowed to edit posts but it seems to be the order of the day here.[BR]I don't want to start a fight because of that, it's just a game. [BR]But if modified contributions no longer make sense, please ask the moderator what I meant [smilie--sprite2]"}, {"21": "Jammin said:\t\t\tI've noticed that my posts are changed by a moderator from time to time... I once asked a moderator in the German forum to change a player's post, because I think this player had the wrong words.[BR]The moderator wrote me that they are not allowed to edit posts but it seems to be the order of the day here.\t\tClick to expand...This may be dependant on different national laws I guess. I don't really know exactly about this, it is just my personal supposition."}, {"1": "Jammin said:\t\t\tI've noticed that my posts are changed by a moderator from time to time... I once asked a moderator in the German forum to change a player's post, because I think this player had the wrong words.[BR]The moderator wrote me that they are not allowed to edit posts but it seems to be the order of the day here.[BR]I don't want to start a fight because of that, it's just a game.[BR]But if modified contributions no longer make sense, please ask the moderator what I meant [smilie--sprite2]Click to expand...You can check out our forum rules, because the moderators on beta are more patient and tolerant, sometimes they edit your posts when the posts break our forum rules and the moderators are doing that instead of deleting the posts. Please respect the forum rules if you don't want your post edited and please don't give a hard time to the supporters."}, {"74": "Deadeye Jerry said:\t\t\tYou can check out our forum rules, because the moderators on beta are more patient and tolerant, sometimes they edit your posts when the posts break our forum rules and the moderators are doing that instead of deleting the posts. Please respect the forum rules if you don't want your post edited and please don't give a hard time to the supporters.\t\tClick to expand...Mmm ... are you sure that in the rules it is forbidden to put asterisks in a message (like ***)? I don't see this rule. BTW, the 3 asterisks in my message were not a mask, but intentional [smilie--sprite1]"}, {"57": "spennyit said:\t\t\tare you sure that in the rules it is forbidden to put asterisks in a message (like ***)?\t\tClick to expand...Indeed, rule #8 states in part:[BR]\t\t\tPlease note that starring out characters like \"f*ck\" does not make it any less a swear word. It is still perfectly understandable and still intentionally offensive, and thus is forbidden in all forms.\t\tClick to expand...This naturally would include a word solely composed of stars/asterisks (***)[BR][BR]Now let's have this thread back on topic please"}, {"74": "It seems you completely missed the semantic of the message: in fact the asterisks were towards myself (and not insulting, but describing a situation). To me, the rule you mention do not apply, but it seems that INNO tries to create any possible situation to \"put themselves\" in a very awful position avoiding to accept constructive critics (see also other threads)."}, {"73": "If we are talking about not allowed words in-game, there is a secret list were players once in a while stumble on when they are using a different language and some starting letter combinations are not allowed.[BR][BR]A simple example with Dutch and English words with the same meaning But Dutch is not allowed[BR]Hoe -> How : in Hoe gaat het ermee -> How are you doing.[BR]hoeveelheid -> amount : de hoeveelheid goederen nodig - the amount goods needed[BR]When ever a word starts with HOE it becomes ***[BR][BR]I know, INNO wands us to only speak englinsh on the beta server, but I am in a Dutch speaking only fellowship, so we speak Dutch, same for players in a french only groep or a spanish only.[BR]So it would be nice if Inno gives us an option to switch off this mature language filter.[BR][BR]And if I want to use the slang word \"hoe\" in english, I can always say: \"a cheap public woman\""}, {"35": "Bor de Wolf 1965 said:\t\t\tIf we are talking about not allowed words in-game, there is a secret list were players once in a while stumble on when they are using a different language and some starting letter combinations are not allowed.[BR][BR]A simple example with Dutch and English words with the same meaning But Dutch is not allowed[BR]Hoe -> How : in Hoe gaat het ermee -> How are you doing.[BR]hoeveelheid -> amount : de hoeveelheid goederen nodig - the amount goods needed[BR]When ever a word starts with HOE it becomes ***[BR][BR]I know, INNO wands us to only speak englinsh on the beta server, but I am in a Dutch speaking only fellowship, so we speak Dutch, same for players in a french only groep or a spanish only.[BR]So it would be nice if Inno gives us an option to switch off this mature language filter.[BR][BR]And if I want to use the slang word \"hoe\" in english, I can always say: \"a cheap public woman\"\t\tClick to expand...and for exactly that reason, we asked to profinaty filter to be turned off on NL long ago.[BR]Honestly there's no reason to have a filter in my opinion, when there is no public chat, only private chatgroups of max 25 people.[BR][BR]but this is still kind of off topic, can we go back to the cauldron discussion?"}]