[{"57": "Hi folks, just a reminder that the topic of this thread is 'The Cauldron'. [BR][BR]@Bor de Wolf 1965 you make some very good points regarding use of other languages in the game, but they are off topic for this thread. Please feel free to start a new thread in the General Discussion section if you wish to debate the language issue you describe, or if you prefer, we could move your post to a new thread to continue that interesting discussion.[BR][BR]Please note, any further off topic posts in this thread may be deleted"}, {"111": "I'm not a strategist and I don't like to (but sometimes must) devote a lot of brain power to this game but I think I may still be above average compared to most players. The Cauldron is too complicated for most players and I say this because anecdotally, I got a lot of questions from my Live FS regarding just the basic mechanics of Cauldron, not even getting around to how to use it efficiently. I just happen to be one of the players who learned the \"how to\" earlier than others, so I became a \"go to\" person. However, I am no expert and I don't know the efficiencies of its use. Spending too much time learning how to use will discourage many from caring about best usage.[BR][BR]I hoped to find smarter and more dedicated players here in the Beta forum who would pass on great advice but after reading the entire feedback thread for Cauldron, I don't find much that is useful for my type of play, which I believe is more intense than most of my FS, but less intense than many forum players. I doubt my FS members would have the patience to read an entire thread and would have no better luck at gleaning some gems. I have looked at recipe maker links and they are also more complicated than most players would like, including me.[BR][BR]I think I'd rather just focus on each week as it occurs. I pick an effect or two that I would like, add/subtract ingredients one at a time to see which will benefit and proceed to add only those ingredients until I use up my WP. Then sprinkle in some spell fragments to garnish, sort of like improvised meal making. Maybe after awhile, some recipes will become routine and I will know automatically which ingredients to use. I know the random chance thing means there are no guarantees, but if I get something, it will help a little. Though, due to this frustrating feature, I don't want to put too much time into it. I only put a small amount of effort in if I only get a small reward.[BR][BR]Timing of when I use the military potions in my big city affects the transition to the research page. I need to brew early enough in the week to take advantage of the coin/supply sink from the learning page for the remainder of the week. For now, I think that dumping coins & supplies in that endeavour is more useful than the wholesaler angle. It is strange that I must dump these resources in order to collect more for quests, FA's etc, but if that is what is necessary, I'd rather spend them in Cauldron research. My problem is that I don't always want to use the potion effects at the beginning of the week. Since I try to minimize my military boosts to use once per 2 weeks, I play tourney and spire on Tuesdays and Fridays alternating weeks. Every second week, the Tuesday run is a good time to use military potions, but the alternate week which is a Friday run, puts the potion use at the end of the Cauldron week and leaves little time to use the research page for coins/supplies.[BR][BR]I also found it wasn't self-evident that triggering the resource potions just before collecting resources was important. I know that is how it works with MM and PoP spells to get the most out of them, but the description of the effect left me wondering if it would apply in the same way. And unlike the spells, the duration of the potion isn't long at first, so it might be better as a one time boost. Of course, that means timing both resource collection and fighting in concordance with the brewing. This seems very oriented toward strategy players.[BR][BR]Am I mistaken in the purpose of this game as a casual game that scales into hardcore strategy? Or is it primarily a strategy game that can be simplified for casual players? Either way, it's not great fun as a casual game, imo, which is why I'm here. I spent mucho diamonds (money) when I was a small city to grow fast and in comparison to a game you buy outright and can play as much as you want, it was at least 10x the price. While that was my fault, it never yielded comparable dividends. The Cauldron is just another example of little gain for so much investment. Both literally when you brew and research, and overall in game satisfaction vs. money spent."}, {"100": "The German side has opened a recipe book witch cauldron.... -  partly with pictures[BR][BR]\t\t\thttps://de.forum.elvenar.com/index.php?threads/rezeptbuch-hexenkessel.26411/#post-426798\t\t[BR]Maybe that will help you a little further....."}, {"57": "That looks really good! It would be great if someone did the same here"}, {"45": "Amy Steele said:\t\t\tThat looks really good! It would be great if someone did the same here\t\tClick to expand...Yes... it would have been even better if INNO developers would have provided a proper Users manual from the start (!) and maybe some tips on how to use the cauldron as efficient as possible. Alas, not only was there a complete lack of proper information on working mechanics of the Cauldron, but it has also become a game of trial and error (and chance!) to try to get some benefit from it."}, {"100": "Perhaps under Questions and Help - preferably pinned at the top so that you can find it again immediately[BR][BR]Recipes should include ingredient names. what was done and very important - in which chapter the person is currently since the recipes change within the chapters in terms of the result.[BR][BR]Recipe - perhaps with pictures ?[BR]\t\t\t1 Augensprossen + 1 Bitterhaarblatt - 4 h regulärer Händlerappell mit + 51%[BR][BR]Kapitel VIII – 5 Dokumenten und freien HPs[BR]************************************************[BR]1 Maden-Limette + 1 Wolkenvolle Knospe - 4:30 h regulärer Händlerappell mit 21%[BR]Kapitel VII – 4 Dokumenten u freien HPs - Beta-Seite\t\tClick to expand...[BR]1 eye sprouts + 1 bitter hair leaf - 4 h regular vendor roll call with +51% [BR]Chapter VIII – 5 documents and free HPs [BR][BR]1 Maggot Lime + 1 Cloudy Bud - 4:30 h regular trader roll call with 21% [BR]Chapter VII – 4 documents and free HPs - Beta-Side"}, {"57": "Here is the format suggested on the German forum, with a couple of examples from there (translated using Google translate):[BR][BR]Hello[BR][BR]Here you can post all the recipes you have brewed. If possible, please write how many diplomas you have, which ingredients how often, fragments, slides, what you won, what you wanted to win and anything else you think would be useful to reproduce. It doesn't matter if it was particularly good or not, maybe someone is looking for THAT![BR][BR]In our guild, a simplified representation of the ingredients has prevailed. We just write them as they are arranged in the window:[BR][BR]eg[BR]0005[BR]0005[BR]0005[BR][BR]Which means I have chosen 5 ingredients from the last ingredient in the row. (If I don't have it right now, I'll pass on which ones they are  ) and I didn't use any of the other ingredients.[BR][BR]Here is my data:[BR][BR]15 Diplomas, Chapter 19, 5 Chalices, 14 Effects at 60% and Barracks at 81% (General))[BR][BR]10k Fragments, no Diamonds[BR][BR]= Unlocked: Orcs, Mana, Seeds, Barracks, Training Grounds, Mercenary Camp, Coins, Tools, gas route (probability in this order)[BR][BR]Won: 2x barracks, gas route, tools, seeds, no shit[BR][BR]wanted: barracks, training grounds, mercenary camp[BR]didn't want: manufactory productions[BR][BR]--‐---------------------------------------------------------------[BR][BR]Examples:[BR][BR]Chapter 20, 20 diplomas, 5 goblets[BR]0 1 0 4[BR]0 0 4 6[BR]0 6 0 0[BR]triggerable effects: mercenary morale, monster strength, mana, monster morale, unurium + 6 other effects up to 4%[BR]no Diamonds, no fragments used.[BR]Result: Monster Morale, Monster Strength, Supplies Abundant, Mercenary Morale, Mana[BR][BR]Chapter 20, 20 diplomas, 5 cups[BR]0 0 3 3 0[BR]2 3 6[BR]0 6 0 0[BR]triggerable effects: mercenary morale, monster strength, mana, general strength, monster morale + 6 other effects[BR]no Diamonds, no fragments used.[BR]Result: Mercenary Morale (2x), Monster Morale, Regular Vendor Appeal (2x)[BR][BR]---‐-------‐---------------------------------------------------[BR]Pictures would also be very useful![BR][BR]If anyone wants to start a thread in Questions and Help, that would be great. There is a 'Guide' prefix you can use, and I will happily pin the thread"}, {"33": "Amy Steele said:\t\t\tThat looks really good! It would be great if someone did the same here\t\tClick to expand...Good idea![BR]For example in the Wiki: The Cauldron.[BR]Part of the information is already there, so it is just completing it"}, {"16": "There is not a big sense in most of these recipes due to differences in diamond-blocked ingredients/number of diplomas/amount of witch points/preferred effects.[BR]The only exception may be that \"go for all military effects not looking at diamond costs\", but even that goal can produce very different recipes depending on which military effects you prefer more, as increasing chances for one effect decrease chances for other effects. For some tourneys it worth having more chances for TG strength, for other TG strength is useless. Also there is not a big sense to have high chances for TG health if you have low chances for TG strength."}, {"112": "Karvest said:\t\t\tFinally made cauldron recipe calculator working on the most of relatively recent Excel versions (tested down to 2016, but I think it should work on 2013 as well, and maybe even on 2010).[BR]First of all you need solver add-in enabled (how to enable it).[BR]Then download https://tinyurl.com/ElvenarCauldron[BR]Open it, allow editing and unblock active content (VBA macros). VBA is used there for the only purpose of emulating =SORT() function which exists only in Excel 2021 and later.[BR]Ingredients are sorted same way as they are in game, amounts are here (both starting point for solver and resulting recipe, you can clear them all to start from scratch):[BR]Spoiler: screenshotView attachment 10848this recipe looks like this in game:[BR]View attachment 10849[BR]There is a small rounding error in calculating required witch points, but I guess +-3 is not a big issue.The usage is simple (mentioned cells are marked with red squares like on first screenshot):[BR]1. write down your current available witch points and research diplomas amount in appropriate cells:[BR]Spoiler: screenshotView attachment 10850[BR]Notice effects that you can get with written amount of diplomas are marked cyan.2. Select diamonds-blocked ingredients by entering 1 in appropriate cells:[BR]Spoiler: screenshotView attachment 108513. write down weights of your desired effects (on screenshot and in the file these are only military effects, with mc_strength having a bit bigger priority and tg_strength - a bit lower.[BR]Spoiler: screenshotView attachment 108524. start solver add-in (On the Data tab, in the Analysis group, click Solver.) and press Solve.[BR]Solver would try to maximize the SUM of your weighted effect probabilities (you can see it at the left of the weights).[BR]It may take some time, but you can control the process by pressing Esc from time to time and looking how it's going. If it is not changing for a long time you can stop it or wait for timeout.[BR]5. The result is the list of ingredients, amount of required witch points and effect probabilities. Note that you should invest ingredients starting from max used one going down to least used one, or your actual WP cost will be bigger than in recipe.[BR]Spoiler: screenshotView attachment 10854[BR]Individual probabilities are marked light green near their weights, their sum = the chance of getting at least one useful effect on each try, there is also overall success rate listed (77.46%).[BR]With this recipe I would have 29.6% chance to get barracks strength effect and same for MC strength (59.2% total). + will have 23.54% chance to get back used spell fragments if I use some.If you found some issues - feel free to report it.\t\tClick to expand...The solver wont work [smilie--sprite3] The only solution is to close excel with task manager. my excel is in dutch, but I assume that can't be the reason...[BR][BR]What can I do? Or did something changed?"}, {"16": "It's working. With the settings from this file it tries to find a better result for a few minutes. You can always stop it by pressing ESC to check current state of process and either continue or finish it. Also there should be current target value shown in the bottom of the window (on green status line, may be hard to see on some versions of excel)."}, {"33": "@Karvest, with the new chapter, do we have all the required values and factors or we need some of them yet?"}, {"16": "Data was 1 chapter ahead, so if there is nothing changed - we have everything for ch21.[BR]Just need to add note about new AW which lowers ingredients costs. I guess it's enough to just multiply amount of witch points you have by AW power before entering it into the sheet."}, {"33": "Karvest said:\t\t\tData was 1 chapter ahead, so if there is nothing changed - we have everything for ch21.[BR]Just need to add note about new AW which lowers ingredients costs. I guess it's enough to just multiply amount of witch points you have by AW power before entering it into the sheet.\t\tClick to expand...A Cell could be added with % discount (normally 0%) and it to decrease internally the cost points of brewing...[BR][IMG]https://i.ibb.co/vPVDtd1/https-beta-forum-elvenar-com-index-php-attachments-1691436724063-png-11660.png[/IMG][BR][IMG]https://i.ibb.co/WHcrH1z/https-beta-forum-elvenar-com-index-php-attachments-1691437875824-png-11662.png[/IMG][BR]Maybe?"}, {"16": "better just include discount into E13 formula, imho.[BR]+ it's shown ingame as resulting %, so would be more comfy to use it and clear multiplication (without (1-x)) like on your screenshot."}, {"12": "Even at the risk of repeating myself, in this feature there is complete no control over the cauldron from a certain level of research, because you also have no control over the diplomas.[BR][BR]I'm lucky enough to only have 12 diplomas in chapter 17, although I'd prefer 11 diplomas for my optimal use of the cauldron.[BR][BR]The discrepancy here...[BR][BR]Players who were already at the research end of all chapters when the cauldron was introduced have most likely completed all research and thus all diplomas. If your preferred use of the cauldron is similar to mine, you face a handicap of 8-9 diplomas, making your chances of desired effects down to a gamble... this fact turns the cauldron from woo to ugh in late chapters (more hex points available for ingredients do not change this fact)[BR][BR]Consider making optional researches in the research tree resettable in all chapters, to give players in different chapters with the same cauldron preference the same chance of desired effects.[BR][BR]If you want to use the cauldron for your preferred way of playing, you can optimize your research tree by resetting the optional ones and control your diplomas. Those who are satisfied with their 20-21 diplomas can ignore this option.[BR][BR]It should be clear to everyone that a high-level diploma will disappear if the research tree is deliberately or imprudently reset.[BR]Unless INNO is far-sighted enough to install a backup so that a deleted leveled diploma reappears leveled, as soon as you use the Research unlocked again."}, {"16": "The main issue is decreased donation costs if you have high diplomas count. With 20 diplomas you can afford much higher level of desired effects, so if you get them, level up interesting effects at low cost, and then unresearch to get back to 11 diplomas - that would be a discrepancy but with different sign. Unless such \"unresearch\" would be available at any time you like, actually changing diplomas count to current chapter in donation cost formula (which would be much more clear and fair). But I afraid that the whole purpose of diplomas count in that formula is to prevent the possibility of getting high level effects with high chances."}, {"12": "Personally, I could overlook the fact that players with 20 diplomas have lower donation costs if it gave me control over the diplomas.[BR]I've gotten to a point where completing the optional troop expansion gives me more than any other random optional research.[BR]Unfortunately, I can't unlock any more optional troop upgrades without getting another diploma.[BR][BR]If I got the chance to reset optional research, I could unlock more optional troop upgrades, backward optimize the whole tech tree accordingly, and also ensure optimal control of the cauldron... as you can see, I think of myself first, but I need to be able to sell it to others too [smilie--sprite1]"}, {"9": "I would also throw away 9 of my 20 diplomas if i could.[BR]But here we are back to the don't research optional squad size upgrade again, since it is the only optional research in ch21(actualy there is another, but obviously choosing between SSU and expansion i choose not research SSU)."}, {"19": "Jammin said:\t\t\tEven at the risk of repeating myself, in this feature there is complete no control over the cauldron from a certain level of research, because you also have no control over the diplomas.[BR][BR]I'm lucky enough to only have 12 diplomas in chapter 17, although I'd prefer 11 diplomas for my optimal use of the cauldron.[BR][BR]The discrepancy here...[BR][BR]Players who were already at the research end of all chapters when the cauldron was introduced have most likely completed all research and thus all diplomas. If your preferred use of the cauldron is similar to mine, you face a handicap of 8-9 diplomas, making your chances of desired effects down to a gamble... this fact turns the cauldron from woo to ugh in late chapters (more hex points available for ingredients do not change this fact)[BR][BR]Consider making optional researches in the research tree resettable in all chapters, to give players in different chapters with the same cauldron preference the same chance of desired effects.[BR][BR]If you want to use the cauldron for your preferred way of playing, you can optimize your research tree by resetting the optional ones and control your diplomas. Those who are satisfied with their 20-21 diplomas can ignore this option.[BR][BR]It should be clear to everyone that a high-level diploma will disappear if the research tree is deliberately or imprudently reset.[BR]Unless INNO is far-sighted enough to install a backup so that a deleted leveled diploma reappears leveled, as soon as you use the Research unlocked again.\t\tClick to expand...Though true in some ways, that is only valid if you want to aim for certain effects only. And even there; more witchpoints means one can add more of the same ingredients to aim for certain effects.[BR]But I just look at it at a set of free-bee bonuses. So even though I tend to play a bit I usually just take what I get and make use of that.[BR]Using the cauldron doesn't necessarily cost anything, except perhaps for the occasional required donations in quests (which I feel should have an alternative). Nobody is forcing you to improve the effects."}]