[{"5": "Karvest said:So to get Mercenary Camp units health increase I need to finish at least chapter 17 (now I have only 3 first effects available due to optional techs not being researched)\t\tClick to expand...[BR]Well, I will never get that one on Beta, or the ones for chapter 16, because I am not wasting KP and resources just to complete the Wonder researches for those two chapters.[BR][BR]As for available effects, I put one of each of the ingredients into the Cauldron and it showed me 15 possible boosts, which looks to be how many I have unlocked with chapters 1-15 fully researched."}, {"57": "Droopy said:\t\t\tI can improve effects:[BR][BR]Such as done by the Barracks Units Strength Increase:[BR][BR]But it has currently no effect at all.[BR]Probably because i was not lucky to receive any effect.[BR][BR]Will the increase stay anyway at this level for ever or will this be vanished every week?\t\tClick to expand...As Vaeri has said in the announcement, the Study phase influences what happens in the next Brewing phase:[BR]Vaeri said:\t\t\tthe Studying Phase prepares you for the next Brewing Phase to come![BR]While studying, you can improve the potion effects you can create by brewing permanently. Learning how a potion works will give you the possibility of increasing its maximum duration and boost value, so be sure to study! Whenever you brew your next potion, the improved values will be visible in the effects forecast.\t\tClick to expand..."}, {"35": "Karvest said:\t\t\tList of all currently available effects (I'm too lazy to convert icon id into full human readable description, but IMHO their names are self-explanatory):[BR]SourceNameiconIdpe_301Magical Tax Increasemoneype_302Supply Surplus Spellsuppliespe_303General's Mayhemhb_strengthpe_304Trader's Basic Pleagoods_standard_basicpe_305Trader's Refined Pleagoods_standard_refinedpe_306Trader's Precious Pleagoods_standard_preciouspe_307Monsters' Mayhemtg_strengthpe_308Gift of the High Menportal_productionpe_309Horde Uprisingorcspe_310Enar's Boonmanape_311Mercenaries' Mayhemmc_strengthpe_312Harvest Moonseedspe_313Trader's Basic Prayergoods_sentient_basicpe_314Trader's Refined Prayergoods_sentient_refinedpe_315Trader's Precious Prayergoods_sentient_preciouspe_316Monsters' Morale Boosttg_healthpe_317Mercenaries' Morale Boostmc_healthpe_318Unur's Resurgenceunuriumpe_319Trader's Basic Blessinggoods_ascended_basicpe_320Trader's Refined Blessinggoods_ascended_refinedpe_321Trader's Precious Blessinggoods_ascended_preciouspe_322General's Morale Boosthb_health[BR]So to get Mercenary Camp units health increase I need to finish at least chapter 17 (now I have only 3 first effects available due to optional techs not being researched)\t\tClick to expand...now that's interesting to know, so what if we intentionally not do a chapter completly anymore, because we don't want the effects we get later on (since they reduce the chance of an effect we do want?)[BR][BR]Is this list in order then?"}, {"5": "Heymrdiedier said:\t\t\tIs this list in order then?\t\tClick to expand...[BR]Yes, they are numbered 1-22, one for each chapter of the game, plus the ones for chapter 21 and 22."}, {"12": "Here's my take on why the cauldron isn't really attractive for two reasons, and much hype about nothing.[BR]On the one hand, the items collected by the sorceress cannot be saved/transferred to the next week, which means that some items always cost diamonds.[BR][BR]The problem here is the benefit for the used diamonds.[BR]Let's assume the ideal case that you have found out the 2-3+ potions that are most interesting for you. The fact that you still have to strengthen these potions we leave out.[BR][BR]I strongly assume that you won't get with a handful of items a more damage or more life potion, for example.[BR]So you will have to invest diamonds for items if you want to create your favorite potion.[BR][BR]Any tournament player will realize that with as little as 50 Diamonds or Sip of Clarity you can spin the Academy and also get a Tournament Booster that lasts 5 days.[BR][BR]I can't say at this point how many diamonds it will cost to make weekly just one favorite potion, but my guess is it will be more than expected.[BR][BR]The cauldron doesn't really look like an advantage to me at the moment, but rather a black hole."}, {"59": "Isn't critical effect cost a lot too high?[BR][BR]around 160k spell fragments to have 50% of chance of triggering critical on a single potion?[BR]I would say that having more than 1 million spell fragments overall is a highly end-game thing, and i doubt someone would lose their entire ammount on 6-7 potions"}, {"33": "Ok, strange that standard (T1/T2/T3) and sentient (S1/S2/S3) got splitted while being treated as a whole in:[BR]Mountain Halls, Aureate Phoenix,D111-a \"Timewarp\", Vortex of Storage,Tree of Enlightenment,So, with the maximum 5 goblets per week, a battling player could activate 5/6 posssible battling effects (*) while a catering player could activate 5/9 possible production effects (3xstandard+orcs+mana+seeds+3xsentients=9 // disregarding gold and tools)[BR][BR]I had hoped for some effects boosting Spells (Power of Provisions, ...) or affecting Wholesaler, reducing Tournament time, Catering costs, recovering Squads...[BR]Something more strategic?[BR][BR]The effects are similar to Ancient Wonders but not alike at all ...[BR][BR](*): Depeding on the type ot units, not that it would be really necessary to activate all 5 of them...[BR][BR]EDIT: Yes, Units also got splitted among their building...."}, {"29": "And if you have not completed ALL the research off the chapters of ascended goods so ........ you have not this [smilie--sprite3] [smilie--sprite3] [smilie--sprite3][BR][BR][IMG]https://i.ibb.co/6v2nknC/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-181711-png-10475.png[/IMG][BR][BR]i'm here of the chapter XIX but I have not completed all the research of all the chapter[BR][BR][IMG]https://i.ibb.co/JB6kPQz/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-181937-png-10476.png[/IMG]"}, {"16": "Announcement states that you can get up to 5 goblets a week, and should use all of them as they are not carried to next week. At the same time it states that you can get 10 active effects. + I have 9 goblets for now.[BR]So questions: [BR]1.Goblets from tournament stay between weeks if not used or we just got more for testing purposes this week?[BR]2.Each goblet can activate more than one effect or we need 10 goblets to activate 10 announced effects?"}, {"24": "Two questions I couldn't see explained/answered:[BR]Is there a cap on the level of studying?Is there a reset for studying like with FS perks where full investment is refunded and can be spent again in a different fashion? Having a free reset every x months would be really good so you could change your mind or approach to your town"}, {"12": "Biloutte91 said:\t\t\tAnd if you have not completed ALL the research off the chapters of ascended goods so ........ you have not this [smilie--sprite3] [smilie--sprite3] [smilie--sprite3][BR][BR]View attachment 10475[BR][BR]i'm here of the chapter XIX but I have not completed all the research of all the chapter\t\tClick to expand...You should ask yourself if you need all these potion diplomas at all... do you really want to invest resources and diamonds to get a potion for a higher production of goods for a few hours ?"}, {"60": "Do you have to use all your goblets at once? Surely not? But after I used one, I can't get rid of the \"bottom's up\" screen."}, {"60": "nvm - I see the discussion in the bug report thread. This is very stupid."}, {"5": "tradescantia said:\t\t\tDo you have to use all your goblets at once? Surely not? But after I used one, I can't get rid of the \"bottom's up\" screen.\t\tClick to expand...[BR]Once you brew a potion, you cannot make another one until next week and can only drink the one you made with your goblets."}, {"29": "Jammin said:\t\t\tYou should ask yourself if you need all these potion diplomas at all... do you really want to invest resources and diamonds to get a potion for a higher production of goods for a few hours ?\t\tClick to expand...[BR]No, of course, but I would like to be able to use the one from chapter XVIII (ascended goods) and for the moment i can't [smilie--sprite3]"}, {"12": "Biloutte91 said:\t\t\tNo, of course, but I would like to be able to use the one from chapter XVIII (ascended goods) and for the moment i can't [smilie--sprite3]Click to expand...So if you haven't completed a research field in previous chapters, you don't get the diplomas for the potions for the other chapters, even though all research there has been completed?"}, {"2": "Arthus said:\t\t\tWell at least cauldron will strike a bit against these players who deliberately chose not to complete optional squad increase technologies to have advantage in tournaments. I already like how this function looks. We just need more time to understand it.[BR][BR]And if there's someone with all technologies in game done, please share all possible effects if you could, please.\t\tClick to expand...I might know someone,  but his city is on live."}, {"29": "Jammin said:\t\t\tSo if you haven't completed a research field in previous chapters, you don't get the diplomas for the potions for the other chapters, even though all research there has been completed?\t\tClick to expand...[BR]Yes [smilie--sprite3][BR][BR][IMG]https://i.ibb.co/2jqRpcB/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-202902-png-10478.png[/IMG][BR][BR][IMG]https://i.ibb.co/FHqv0Yb/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-202951-png-10479.png[/IMG][BR][BR]i am in the chapter XIX (not completed)[BR][BR]Standard goods[BR][IMG]https://i.ibb.co/Fq9XJ4Y/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-203151-png-10480.png[/IMG][BR][BR][BR]Sentient goods[BR][IMG]https://i.ibb.co/2ZNtZnm/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-203209-png-10481.png[/IMG][BR][BR][BR]but not ascended goods[BR][IMG]https://i.ibb.co/fn8sxf6/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-203447-png-10482.png[/IMG][BR][BR]and i need some ^^ ascended goods for the chapter  XIX and XX"}, {"61": "Hi guys! I'm a phone user only. Is there a possibility to check my potion effects somehow after I drank it. I know I had a critical obe, but forgot it already and in the cauldron window I only see the study room and the counter until reset. Thank you!"}, {"32": "Jammin said:\t\t\tSo if you haven't completed a research field in previous chapters, you don't get the diplomas for the potions for the other chapters, even though all research there has been completed?\t\tClick to expand...Biloutte91 said:\t\t\tYes [smilie--sprite3]Click to expand...[BR][BR]I'm not sure if I'm correct but:[BR]- I am in the middle of ch.20 > we deduct 1 chapter[BR]- I have 2 uncompleted techs in ch.16 > we deduct another chapter (you can see in my first screenshot, ch.17 it's ticked as completed)[BR][BR]This means I have 18 completed chapters.[BR][BR][IMG]https://i.ibb.co/cyJzfpT/https-beta-forum-elvenar-com-index-php-attachments-cauldron-1-jpg-10483.jpg[/IMG][BR][BR]In the MA, it appears I have 18 Research Diplomas.[BR][BR][IMG]https://i.ibb.co/9WySxpy/https-beta-forum-elvenar-com-index-php-attachments-cauldron-2-jpg-10484.jpg[/IMG][BR][BR]My personal conclusion is if a chapter is completed it doesn't matter where is in the tech tree or if has before or after it an incomplete chapter. Once a chapter is completed and get it's green tick near the flag, it counts for diplomas."}]