[{"62": "the effects are pretty nice already on high levels[BR][BR][IMG]https://i.ibb.co/2SfhnGR/https-beta-forum-elvenar-com-index-php-attachments-1669751545115-png-10485.png[/IMG]"}, {"17": "Moncsociusz said:\t\t\tHi guys! I'm a phone user only. Is there a possibility to check my potion effects somehow after I drank it. I know I had a critical obe, but forgot it already and in the cauldron window I only see the study room and the counter until reset. Thank you!\t\tClick to expand...Go back to the cauldron and at the bottom of it are your active effects"}, {"57": "Alcaro said:\t\t\tI'm not sure if I'm correct\t\tClick to expand...I believe that is indeed correct @Alcaro"}, {"63": "This is such a fascinating idea, I ♥ it. Brings in a whole new level of Fantasy story gaming. I ♥ the premise as outlined above. I like the discovery of new knowledge and this whole concept certainly provides that. I am looking at this new Phase of Elvenar development with very positive Vibes. [BR]I am sure to enjoy discovering new temporary effects each week and applying my newly discovered knowledge next week and also teaching others what new Knowledge I have acquired. AND looking forward to learning from the community of Elvenar players what they have discovered.[BR]Excellent concept. Many changes and adaptations and balancing to come. Thank you, I like the way it blends in the Tourney, Spire etc etc together. [BR][BR]Sure BUGS will happen. Not all Bugs are bad..... [smilie--sprite1]"}, {"17": "Trophy goblets. First at 210(200?), second at 600."}, {"29": "I have not completed the chapter XVI and XVII but I have completed the chapter XVIII[BR][BR][IMG]https://i.ibb.co/VNRDH8B/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-205536-png-10486.png[/IMG]...[IMG]https://i.ibb.co/Tg1pYbW/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-205556-png-10487.png[/IMG]...[IMG]https://i.ibb.co/yQZq3qQ/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-205743-png-10488.png[/IMG][BR][BR]I am in the chaper XIX and so i have this [BR][BR][IMG]https://i.ibb.co/wStmJRQ/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-210017-png-10489.png[/IMG][BR][BR]it's correct [smilie--sprite1]"}, {"16": "So researching all optional techs is still bad.[BR]For example if you are fighter in ch15 and don't need anything but military boosts - you don't need more than 11 diplomas, each one after will add useless potion effect which will decrease your chances to get effects you want.[BR]For chapter 20 fighter - same story with 17 diplomas."}, {"5": "Ibison2 said:\t\t\tTrophy goblets. First at 210(200?), second at 600.\t\tClick to expand...[BR]First is free, then 4 more at 200, 600, 1200?, and 2000 tournament points."}, {"33": "Not sure, but the 9 effects cap may relate to 4 goblets from previous week Tournament (if not used) + free weekly goblet + 4 goblets from Tournament finished on Saturday, with enough duration and careful timing the first 4 and later 4 could overlap.[BR]Doable once every 2 weeks."}, {"12": "Karvest said:\t\t\tSo researching all optional techs is still bad.[BR]For example if you are fighter in ch15 and don't need anything but military boosts - you don't need more than 11 diplomas, each one after will add useless potion effect which will decrease your chances to get effects you want.[BR]For chapter 20 fighter - same story with 17 diplomas.\t\tClick to expand...I don't quite see how a useless potion diploma is supposed to be annoying. You don't have to upgrade the useless diplomas and level them up with hex points, only the 5 fighter diplomas up to and including chapter 17 if you want to get there at all.[BR][BR]According to your list, the fighter diplomas are in chapters 3, 7, 11, 16, 17 and 22"}, {"64": "I am always getting this[BR][IMG]https://i.ibb.co/BGbFBQz/https-beta-forum-elvenar-com-index-php-attachments-1669754553291-png-10490.png[/IMG][BR]and cant remove it. I made the F5 several times. I closed my browser and removed all cookies. I opend up the game again and it is still there. If I press \"Bottom*s up\", there is always one less left, It was 5, now it is 4 left."}, {"9": "@Karvest But you will need them for the HP in ch 22 according your list."}, {"65": "Jammin said:\t\t\tI don't quite see how a useless potion diploma is supposed to be annoying. You don't have to upgrade the useless diplomas and level them up with hex points, only the 5 fighter diplomas up to and including chapter 17 if you want to get there at all.[BR][BR]According to your list, the fighter diplomas are in chapters 3, 7, 11, 16, 17 and 22\t\tClick to expand...A specific potion is not assigned to a specific chapter, but depends on the number of diplomas. I have the first 6 potions unlocked, although my diplomas are not from the first 6 chapters. They are from different chapters."}, {"16": "Jammin said:\t\t\tI don't quite see how a useless potion diploma is supposed to be annoying. You don't have to upgrade the useless diplomas and level them up with hex points, only the 5 fighter diplomas up to and including chapter 17 if you want to get there at all.\t\tClick to expand...the fact that you don't waste witch points on useless effects doesn't remove them from the list of possible effects of the potion for used ingredients."}, {"11": "I see the effects have a time limit, but i didn't have any effect at all out of the 9 trophy's.[BR]So my question to those who have an effect, when does the time counter for the effects start counting down?"}, {"12": "Eilin said:\t\t\tA specific potion is not assigned to a specific chapter, but depends on the number of diplomas. I have the first 6 potions unlocked, although my diplomas are not from the first 6 chapters. They are from different chapters.\t\tClick to expand...Karvest said:\t\t\tthe fact that you don't waste witch points on useless effects doesn't remove them from the list of possible effects of the potion for used ingredients.\t\tClick to expand...Having the potion diplomas not assigned to a fixed chapter means that completing a chapter will give you a random potion diploma, which in turn means you may not get a fighter diploma you're looking for until chapter 22. [BR]So we're trying to trigger a potion, that might not even be there yet."}, {"66": "not random. [BR][BR]Its just for X diplomas you get the first X ingredients.[BR]Im missing the fairie diploma but missing the precious sentient goods bonus, nr 14. im in chapter 15."}, {"16": "I'm in chapter 15, got 11 diplomas for mc_strength and stopped until chapter 17 were I will get the rest of diplomas and open all 17 effects up to mc_health."}, {"67": "so i threw in some random ingredients...just to see what happens and i now get a blank? am i brewing? is it done? did i get anything? no idea..."}, {"68": "it would be better to be given the opportunity , having all the diplomas , to discover ( study ) only those effects that I need"}]