[{"32": "Orion Pax said:\t\t\tit would be better to be given the opportunity , having all the diplomas , to discover ( study ) only those effects that I need\t\tClick to expand...but I think it does! The problem is that I almost emptied my stock of Basic goods. Another question - this improvement, how long it last? I hope is somehow like the Perks. I would hate to have a limited time of availability.[BR][BR][IMG]https://i.ibb.co/WsjrN6J/https-beta-forum-elvenar-com-index-php-attachments-cauldron-3-jpg-10492.jpg[/IMG]"}, {"66": "- Trophy Goblets: The amount of ingredients added to the Cauldron increases the Success Rate - the chance of every goblet to trigger an effect. Every player has at least one Trophy Goblet available every week.[BR]You will use one Trophy Goblet to drink from your potion, and any effect will be added to your game.[BR]Each time the Cauldron Event begins, you are given a free Trophy Goblet, but you can win more goblets based on how well you did in the Tournament the previous week. You obtain a new Trophy Goblet each time your Tournament Points total reaches a certain threshold: 200, 600, 1200, and 2000 Tournament Points[BR][BR]- Tournament:[BR]You can earn up to four Trophy Goblets, depending on the threshold reached by earning a certain number of tournaments points in the last tournament.\t\tClick to expand...I dont understand the number of goblets.[BR]I got 9 goblets in total,[BR]1 + 4 for earning over 2000 tournament points and the other 4[BR]\t\t\tby earning a certain number of tournaments points in the last tournament.\t\tClick to expand...For me \"in the Tournament the previous week\" and[BR]\"the last tournament\" are basically the same tournament[BR][BR]Can you rephrase it to \"You obtain two new Trophy Goblet each time your Tournament Points total reaches a certain threshold: 200, 600, 1200, and 2000 Tournament Points\" or do you mean \"the tournament in the current week\"?"}, {"67": "i don't even know what i did...no way to check anything?[BR]aliceFalling said:\t\t\tso i threw in some random ingredients...just to see what happens and i now get a blank? am i brewing? is it done? did i get anything? no idea...\t\tClick to expand..."}, {"16": "Alcaro said:\t\t\tThe problem is that I almost emptied my stock of Basic goods\t\tClick to expand...I'm not even near to your numbers and bought much more points than you. You should diversify usage of different resources to get most profit from them.[BR][IMG]https://i.ibb.co/t3NxXZJ/https-beta-forum-elvenar-com-index-php-attachments-1669763733970-png-10493.png[/IMG]"}, {"69": "hello, can you help me why is it empty? i finished the research... [BR][IMG]https://i.ibb.co/2ycVJY6/https-beta-forum-elvenar-com-index-php-attachments-cauldron-png-10494.png[/IMG]"}, {"61": "So probably my potion already expired by the time I logged back in. Hmmmm. So basically I had no use to them. I think it would be better if we could control when we drink them during the week. As I can drink it whenever I log back in and actually use its benefits. As most of the effects are lasting only for some hours. And would make more sense to push for tourney so you can have more chances to have something during those 5 times when you log in and have maxed goblets. Right now it feels useless almost useless."}, {"19": "So far not impressed. Nearing the end of Woodelves in beta I have 1205 'Witchpoints' which will allow me to put in only a few ingredients, with a max of less than 60% success, meaning over 40% chance everything is wasted. Not exactly a great ratio of success.[BR]Adding spellfragments may help, but I'm not exactly drowning in those, I already have a hard time crafting the stuff in the MA and keep up with them.[BR]I love the idea behind it, but with such low successrates it doesn't seem a very practical thing to use[BR]-[BR]So I tried something, the effect lasts for 2 hours? Seriously? The shortest production time for goods is 3 hours and the effect to get extra lasts for 2 hours?"}, {"60": "It feels too random to me, and the effect is WAY too short, especially when you may get several at one time. I tried to choose ingredients to give myself the best chance of getting something I wanted. I had seven potions: I got 3 x nothing, 2 x supply boosts, of which I was only able to keep one. At least I was given a choice which one to keep. 1 t1 manu boost, and 1 High Men which was useless for me because I am between guest races.  I really don't like having to take all of the potions at once - why can't we spread them out over the course of the week? And 2 hours? When you don't really know what you're going to get? Somehow there must be a way to make them more seriously useful."}, {"5": "tradescantia said:\t\t\tIt feels too random to me, and the effect is WAY too short, especially when you may get several at one time. I tried to choose ingredients to give myself the best chance of getting something I wanted. I had seven potions: I got 3 x nothing, 2 x supply boosts, of which I was only able to keep one. At least I was given a choice which one to keep. 1 t1 manu boost, and 1 High Men which was useless for me because I am between guest races.  I really don't like having to take all of the potions at once - why can't we spread them out over the course of the week? And 2 hours? When you don't really know what you're going to get? Somehow there must be a way to make them more seriously useful.\t\tClick to expand...[BR]After you use all your goblets, the improvement screen becomes available, where you can spend resources to get more witch points and to spend witch points to increase the levels of the boosts. So the buffs can have their durations increased."}, {"60": "Enevhar Aldarion said:\t\t\tAfter you use all your goblets, the improvement screen becomes available, where you can spend resources to get more witch points and to spend witch points to increase the levels of the boosts. So the buffs can have their durations increased.\t\tClick to expand...But not until next week, right? And there's no way of being sure you'd get that particular buff next week, either because you don't get those ingredients or because the randomness didn't let you win that one.  Maybe there's some way of mixing the ingredients to focus more on just one thing - it's all kind of poke at something and see what happens right now."}, {"5": "tradescantia said:\t\t\tBut not until next week, right? And there's no way of being sure you'd get that particular buff next week, either because you don't get those ingredients or because the randomness didn't let you win that one.  Maybe there's some way of mixing the ingredients to focus more on just one thing - it's all kind of poke at something and see what happens right now.\t\tClick to expand...[BR]Yeah, I don't think the improvements go into effect until the next week, but you can upgrade all the boosts you have unlocked, not just the ones you activated this week."}, {"16": "There is a way of focusing on specific effects. Sad that focusing on the one unit strength defocus other units, so you can get max 40-50% chance of military strength effect distributed over 3 types with 10%-20% for specific one, depending on which ingredients are blocked."}, {"12": "I'm still small here so can't contribute much, I just threw in all the items individually and got them out again to see which ones could be suitable for what... I'm only interested in damage and life, at the moment I can only say the Mana Shell and Flying Iris are the best items for troop damage for Barracks.[BR][BR]If one manages to brew a potion with the increased Critical Effect Chance stats, are those stats including Critical Effect carried over into the Sorceress' learning phase, or is this feature optional to use when using the potion?[BR][BR]Another question, once you've gotten into the learning phase, can you go in there every week or do you only get into the learning phase when you've managed to make a new potion?[BR][BR]I know that maybe nobody can really answer that yet, but well, maybe someone can? [smilie--sprite1]"}, {"70": "Weird bug that I've reported ... I cannot see any of my beta neighbors in the provinces to visit and donate. They're all yellow as if I'd never discovered them, surrounded by green.[BR]New since I was last on beta in Oct 2022.[BR]Just fyi."}, {"14": "aliceFalling said:\t\t\tso i threw in some random ingredients...just to see what happens and i now get a blank? am i brewing? is it done? did i get anything? no idea...\t\tClick to expand...[BR]Sajtmacska said:\t\t\thello, can you help me why is it empty? i finished the research...[BR]View attachment 10494Click to expand...[BR]It happens to me too; simply reload the game and everything will be fine again[BR][BR]Valtitude said:\t\t\tWeird bug that I've reported ... I cannot see any of my beta neighbors in the provinces to visit and donate. They're all yellow as if I'd never discovered them, surrounded by green.[BR]New since I was last on beta in Oct 2022.[BR]Just fyi.\t\tClick to expand...[BR]This is Cauldron discussion, and you need to have a look here."}, {"70": "PrimroseSylvia said:\t\t\tIt happens to me too; simply reload the game and everything will be fine again[BR][BR][BR][BR]This is Cauldron discussion, and you need to have a look here.\t\tClick to expand...I believe this happened as a result of the Cauldron addition. It's why I mentioned it here. City was fine previously."}, {"9": "How do i get back to brewing page? Or are we limited with 1 brewing per week?[BR][BR]Reset like with fs perks would be great, currently i'm investing only in mercenary spell, with reset i could switch it all to general hp after finishing ch22."}, {"5": "Lovec Krys said:\t\t\tHow do i get back to brewing page? Or are we limited with 1 brewing per week?[BR][BR]Reset like with fs perks would be great, currently i'm investing only in mercenary spell, with reset i could switch it all to general hp after finishing ch22.\t\tClick to expand...[BR]One brewing per week and all available goblets must be used to get to the Study screen."}, {"71": "I researched it, and tried to make a potion but it doesn't complete. and won't let me take out the excess ingredients. also it says you get to drink the result. well it said it filled the goblets but it shows 0 by the goblets. it lied 8( lol[BR]I think there needs some instructions on how to use so you put the the right ingredients in the caldron and don't confuse it like I did. I didn't know which ingredients did what. but on the hand If I learn how to use it correctly I feel that it is worth while having. [smilie--sprite1]"}, {"68": "Alcaro said:\t\t\tbut I think it does! The problem is that I almost emptied my stock of Basic goods. Another question - this improvement, how long it last? I hope is somehow like the Perks. I would hate to have a limited time of availability.[BR][BR]View attachment 10492Click to expand...I meant to be given the opportunity to choose which effects will generally be available for improvement , and so that unexplored effects are generally invisible on this panel"}]