[{"55": "Alcaro said:\t\t\tAnother question - this improvement, how long it last? I hope is somehow like the Perks. I would hate to have a limited time of availability.\t\tClick to expand...The improvements done during the Studying Phase last permanently![BR]Aerendil said:\t\t\tI dont understand the number of goblets.[BR]I got 9 goblets in total,[BR]1 + 4 for earning over 2000 tournament points and the other 4[BR][BR]For me \"in the Tournament the previous week\" and[BR]\"the last tournament\" are basically the same tournament[BR][BR]Can you rephrase it to \"You obtain two new Trophy Goblet each time your Tournament Points total reaches a certain threshold: 200, 600, 1200, and 2000 Tournament Points\" or do you mean \"the tournament in the current week\"?\t\tClick to expand...The announcement is correct, it's just that the players also gained Trophy Goblets for the last two events, too.[BR]This means players can have 9 goblets max, but realistically, they will only have 5 maximum (1 minimum, 4 from Tournament Point Thresholds), in the Cauldron's next Brewing Phase. Players will be unable to gain the remaining 4 goblets next week, but this may change in the future (it's a buffer for balancing changes or could become a reward you can gain from a future feature).[BR]tradescantia said:\t\t\tAnd there's no way of being sure you'd get that particular buff next week, either because you don't get those ingredients or because the randomness didn't let you win that one.  Maybe there's some way of mixing the ingredients to focus more on just one thing - it's all kind of poke at something and see what happens right now.\t\tClick to expand...All ingredients you saw this week will be available next week, but the four ingredients that are obtainable via premium will be different.[BR]We will see next week which \"premium\" ingredients this week will be available for Witch Points next week.[BR]Jammin said:\t\t\tIf one manages to brew a potion with the increased Critical Effect Chance stats, are those stats including Critical Effect carried over into the Sorceress' learning phase, or is this feature optional to use when using the potion?[BR][BR]Another question, once you've gotten into the learning phase, can you go in there every week or do you only get into the learning phase when you've managed to make a new potion?[BR][BR]I know that maybe nobody can really answer that yet, but well, maybe someone can? [smilie--sprite1]Click to expand...Unsure if I understood the question correctly, but after you increased the effects in the Studying Phase, your potion next week will benefit from the past Studying Phase(s).[BR]You can enter the Studying Phase every week after brewing, successful or not.[BR]Valtitude said:\t\t\tWeird bug that I've reported ... I cannot see any of my beta neighbors in the provinces to visit and donate. They're all yellow as if I'd never discovered them, surrounded by green.[BR]New since I was last on beta in Oct 2022.[BR]Just fyi.\t\tClick to expand...Please send our support a message, if not already done! They will help you asap!"}, {"72": "So, I am not sure if I have quite understood how it works yet. But as I understand it:[BR][BR]Once a week I can brew one potion, and immediately after brewing it I will drink it as many times as I have goblets. And the effects (if I get any) will start their timers when I drink the potion. So I should wait brewing my potion until I am ready to use the effects. So in my case, since I am mainly interested in the troop enhancements, I will brew just before I start doing spire (which I usually timeboost my way through) and which I do together with one of the tourney rounds (or all tourney rounds in cities with zero tourney cooldown). In case I get some of the non-troop effects from drinking the potion my factories etc. should optimally be ready to collect at the time where I brew my potion.[BR][BR]To start with all the effects are fairly week, so maybe I should just save most of my witch points for the studying phase until my favorite effects are at a decent level? And I should only level the effects I am most interested in, to make those effects stronger and more likely to be made when brewing?[BR][BR]I should try to get at least 2000 points weekly in tourney to get all the goblets so I have more chances of getting the effects."}, {"73": "When reading all the posts back and my own experience with the cauldron, I keep having the feeling that the devs at Inno did do a bad job and on top of it, they bring us to the centre of a very big lake and throw us overboard and let us figure it our for our self.[BR]There is nothing to be found on the wiki and the video clip explains nothing.[BR]The logic behind this new \"feature\" does not exist or is so small that I can't see it.[BR][BR]All I ask for from any Inno employee is to write a decent part in the wiki about how the cauldron works, how we should be able to use the study points and at least, let us decide to use the potions at the moment we want to use them.[BR]You can put a countdown timer on them so they last only till the next round of the cauldron but we the players should be able to decide when we want to use a 2 hour fighting boost potion (right at the start of a tournament round) and not when they were made and we still have to wait 15h till next tournament round."}, {"22": "too random process.. if I want an effect, studing the corrects ingredients I must obtain it"}, {"74": "When things are random, they are just meant to let you spend diamonds and real money (like slot machines) :-("}, {"16": "The Fairy said:\t\t\tTo start with all the effects are fairly week, so maybe I should just save most of my witch points for the studying phase until my favorite effects are at a decent level? And I should only level the effects I am most interested in, to make those effects stronger and more likely to be made when brewing?\t\tClick to expand...It makes sense not to waste witch points on weak effects, but to be honest - amount of points needed for mastering effects is very much bigger (for example, a single level upgrade from 81 to 82 costs more than 200k points), and the main source of them for studying phase is donating resources. I bought almost 3kk witch points this week and far from mastering first 3 military effects, probably it would take a few weeks at that pace.[BR]Leveling up the effects doesn't change the chance to get them at all, it only changes their quality."}, {"75": "Bor de Wolf 1965 said:\t\t\t[...]  let us decide to use the potions at the moment we want to use them.\t\tClick to expand...As far as I understand it, you can decide. Simply wait with brewing until you are ready to get the effect. And you also decide when to drink the other goblets, you can wait there too (for example, until the first effect wears off, so you are sure you don't waste it if it turns out to be the same effect)."}, {"76": "Alcaro said:\t\t\tbut I think it does! The problem is that I almost emptied my stock of Basic goods. Another question - this improvement, how long it last? I hope is somehow like the Perks. I would hate to have a limited time of availability.[BR][BR]View attachment 10492Click to expand...[BR]Be carefull when re-entering the study function it resets the default on resource to marble and coins effect..."}, {"32": "I have another question which might get an answer next week [smilie--sprite1][BR]The cost in resources to get Witch Points will keep growing infinitely or will be reset every week (sort of like in Wholesaler)?[BR][BR]LE cause I have more questions, ofc    [smilie--sprite8][BR]Soooo, after you brew a potion, you have to use all goblets. Is it possible to trigger the same effect twice or more? And if Yes, are the effects stackable?"}, {"61": "I believe, it was rumoured that the coin sack got higher at the brotherhood adventures as we will have some new developments to make badge collection more realistic. Is this day buff with the cauldron it? Or there is something else coming? Or I just misremembered. Thank you!"}, {"17": "So the way I'm now looking at this is that it won't be an instant gratification thing.  I will get barely anything out of it for awhile.  It will take weeks, more than likely months to build up to what is really good effects. Maybe a year or two to get great effects.  This is a system for the long term player."}, {"9": "Alcaro said:\t\t\tSoooo, after you brew a potion, you have to use all goblets. Is it possible to trigger the same effect twice or more? And if Yes, are the effects stackable?\t\tClick to expand...I got one effect twice. They are not stackable - you have to choose in a pop up window which one you keep."}, {"32": "Lovec Krys said:\t\t\tI got one effect twice. They are not stackable - you have to choose in a pop up window which one you keep.\t\tClick to expand...I think it's unfair for more reasons: if you can be so unlucky to get the same \"no effect\", when you get more times the same effects they should be stackable, especially that we are forced to use all goblets, no matter if we got the desired effect or not."}, {"77": "I am so confused. I only want the military potions, but could not figure out how to isolate just them. I played with this thing for a LONG time adding, subtracting, adding again. I ended up with several potions, and as some one else said, I had to choose to keep or use the new one. SOOOOO VERY CONFUSING! I did get at least one merc troop boost, but also others I just don't need, like the goods and supplies. I did end up with several \"effects\" active and I did go back and \"improve effects\" just on the military ones, but the only military one active (I think) was the merc. Although as I said there were others active, seeds, goods, etc. I still don't know how I did it. [smilie--sprite7] How do you isolate which potion to brew? Or is it truly a slot machine? This seems like just one more way to randomly spend diamonds. [smilie--sprite3]"}, {"75": "Brewing potions is like... well imagine you are the Inno staff member who fills up those treasure chests from tradititonal events. Throwing ingredients into the cauldron does change the probabilities of specific outcomes (and one possible outcome is \"you get nothing\" unless you add 25+ ingredients), but there is never a guaranteed win of the daily prize / your desired effect."}, {"75": "I am only in Chapter 4 on Beta, so I cannot do this myself... but maybe you can help and collect information about the way these effects interact with wonders and other production bonusses.[BR][BR]Biloutte did post a great example of a manufactory production (what percentage the bonus claims to be, and how the bonus actually plays out in production):[BR][BR][IMG]https://i.ibb.co/7gpVzq7/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-155933-png-10468.png[/IMG] [IMG]https://i.ibb.co/NFM5dfk/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-29-160542-png-10471.png[/IMG][BR][BR]I am willing to assume that the other 8 goods bonusses work the same way, but I would also like to see similar screenshots for other resources (Money, supplies, guest race productions, orcs, mana, seeds, unurium) and the battle unit effects (one strength and one health effect should be enough), ideally with all things like wonders / culture bonus / fabulous fabrication spell / expiring 2x2 battle buildings / ... active.[BR][BR][And please don't post portal productions of chapter 20. A bonus of +1 flute on a base value of 3 is extremely unprecise. The actual \"Potion Effect Boost\" should have at least 3 digits]"}, {"29": "I believe there is no guest race production bonus. I am looking that up."}, {"5": "Biloutte91 said:\t\t\tI believe there is no guest race production bonus. I am looking that up.\t\tClick to expand...[BR]Gift of the High Men boosts Portal production."}, {"29": "yes, i have don't see this [smilie--sprite3] sorry[BR][BR][IMG]https://i.ibb.co/h7491TT/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-30-174323-png-10499.png[/IMG]... [IMG]https://i.ibb.co/d2dgPnk/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-30-175228-png-10500.png[/IMG]...[IMG]https://i.ibb.co/tDzwGVg/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-11-30-175755-png-10501.png[/IMG][BR][BR]I will try to favor the productions of the settlements [smilie--sprite2] [smilie--sprite2] [smilie--sprite2]"}, {"9": "Cheap [smilie--sprite8][BR][IMG]https://i.ibb.co/yWY2W2g/https-beta-forum-elvenar-com-index-php-attachments-1669828123755-png-10503.png[/IMG][BR]At least now i know what to do with my 19 milion orcs in my main city.[BR][BR]ps: Does anybody know if there is a hard cap on levels? Or just soft cap?"}]