[{"16": "12% at level 100? pff... not sure if it worth going past 11 diplomas at all..."}, {"78": "Explain for me, ive done lvl 40 and 42 for troops, but it only active IF I do the potion and get lucky it activates?[BR][IMG]https://i.ibb.co/qD5Yxzn/https-beta-forum-elvenar-com-index-php-attachments-h-r-boost-png-10504.png[/IMG]"}, {"16": "Yes, you should select ingredients giving you max chance of triggering that effects, brew the potion, and keep fingers crossed while drinking it using goblets. That should be done just before you do your tourney/spire so that effects won't expire before you are done with fighting."}, {"79": "I created a general mayhem potion.  I had no option to stop brewing.  It forced me to make several of the same potion but you can only keep one.  I had to discard 2.  Apparently once you successfully brew a potion you have to use it right away.  (I didn't have any other choice just a \"bottoms up\" button)  I can't tell if the units I made have any bonus.  I see no way to see the effects of the potion.  Can someone explain how all this works?"}, {"79": "Heymrdiedier said:\t\t\tWell I've been researching those techs i skipped during events that ask for research a technology. So I'm not sure I really like that they want us to do all those techs now immediatly. If thats the case, I hope research a tech requirement will be removed from all event quests as well.[BR][BR]One thing I'm still puzzled about. They promised the cauldron would allow us to spend al those 10thousands of relics we've been saving up over the years. But I still haven't found where I can use them, anyone spotted it yet?\t\tClick to expand...You can use relics to fill the research in your AW. Each relic is 15 KP if you use it in a neighbors AW and 10 KP if you use it in your AW"}, {"79": "Droopy said:\t\t\tI see the effects have a time limit, but i didn't have any effect at all out of the 9 trophy's.[BR]So my question to those who have an effect, when does the time counter for the effects start counting down?\t\tClick to expand...Immediately"}, {"12": "Lovec Krys said:\t\t\tCheap [smilie--sprite8][BR]View attachment 10503[BR]At least now i know what to do with my 19 milion orcs in my main city.[BR][BR]ps: Does anybody know if there is a hard cap on levels? Or just soft cap?\t\tClick to expand...Almost 10% bonus is really bad, when I see what lvl 80 brings then I really hope that there is no hard cap, although the costs are already astronomical. Hard to imagine what it should cost until this potion is worth it.[BR]I hope it will be rebalanced, should it really be over at lvl 100.[BR]I'm sorry for whining so much, but that's my superpower, that, and eating a lot of spaghetti."}, {"72": "Shinara said:\t\t\tYou can use relics to fill the research in your AW. Each relic is 15 KP if you use it in a neighbors AW and 10 KP if you use it in your AW\t\tClick to expand...I think you mean runes here? I still haven't found any use for my thousands of relics, but maybe one day [smilie--sprite1]"}, {"29": "A cauldron's quest in one of my city[BR][BR][IMG]https://i.ibb.co/PzfpYyw/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-01-091612-png-10507.png[/IMG][BR][BR]but not on the other [smilie--sprite3] there is player's test ?[BR][BR]icones in this city: [IMG]https://i.ibb.co/L8DVky2/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-01-091221-png-10508.png[/IMG] (not quest chapter) and on the other ^^ [IMG]https://i.ibb.co/yqp4gN5/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-01-091246-png-10509.png[/IMG] (not cauldron quest)"}, {"29": "[IMG]https://i.ibb.co/LZJ1YLD/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-01-092307-png-10510.png[/IMG][BR][BR][IMG]https://i.ibb.co/KsYjyqZ/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-01-092330-png-10511.png[/IMG]"}, {"80": "Hi @Biloutte91, being non mandatory quest you have to skip/complete the other non mandatory ones that are active in your second city [smilie--sprite1]"}, {"80": "Valtitude said:\t\t\tI believe this happened as a result of the Cauldron addition. It's why I mentioned it here. City was fine previously.\t\tClick to expand...Thanks @Valtitude for explaining that didn't log in since october and in this way confirming that is the (unfortunately well) known issue [smilie--sprite1]"}, {"29": "Konys said:\t\t\tHi @Biloutte91, being non mandatory quest you have to skip/complete the other non mandatory ones that are active in your second city [smilie--sprite1]Click to expand...[BR]@Konys Soory but the problem is not here ^^ the problem is: i have cauldron's quest in a city and not in the other.[BR] In one of my cities... [IMG]https://i.ibb.co/L8DVky2/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-01-091221-png-10508.png[/IMG] ...in the other.... [IMG]https://i.ibb.co/yqp4gN5/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-01-091246-png-10509.png[/IMG] not the same icons and not the same \"type\" of quest[BR][BR]In all my cities (and not one yes and the other no) I should have: Winter magic quest, cauldron quest, history quest and généric quest... no ? like this[BR][BR][IMG]https://i.ibb.co/4Zq2R51/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-01-100806-png-10514.png[/IMG]"}, {"22": "Biloutte91 said:\t\t\tIn all my cities (and not one yes and the other no) I should have: Winter magic quest, cauldron quest, history quest and généric quest... no ? like this[BR][BR][IMG]https://i.ibb.co/4Zq2R51/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-01-100806-png-10514.png[/IMG]Click to expand...no... there is 1 slot for winter magic (event/fa) quest (+1 daily reward)[BR]2 slot for standard quest (mandatory and/or non mandatory)"}, {"29": "No, whit the cauldron quest 4 slots... 1 slot event, 1 slot chapter, one slot généric and 1 slot cauldron..."}, {"80": "@Biloutte91, as @Ainor explained, this is exactly the way it works [smilie--sprite1][BR]I myself had to complete and rejects about 5 non mandatory quests before getting Cauldron ones (and now I'm stuck because it asks for brew, and cannot do it until next round [smilie--sprite7] )"}, {"29": "But where are the generic quest in a city and the chapter quest in the other ?"}, {"80": "Generic quests are the ones without the yellow exclamation mark"}, {"29": "Yes i know that. i'm in chapter XIX ^^ My question is why not 4 icones and all the quests. ? it's possible to let all the icons no ?"}, {"80": "No [smilie--sprite1]"}]