[{"81": "So I have 12 chapters fully researched and 4 needing completing ..  the 12 recipes I get a possibility of, include the 3 troop ones[BR]the next recipe if I finish a research is one effecting sentient … I don’t need this … so better if I don’t go back … as it will reduce probability of the troops … currently possible 3 in 12 would go to 3 in 13 or 16[BR]is this correct?"}, {"22": "Biloutte91 said:\t\t\tMy question is why not 4 icones and all the quests. ?\t\tClick to expand...because cauldron quests are normal generic quests non-mandatory and non-cyclical like many others in the game (related to specific progress in the game such as chapters or wa etc)"}, {"82": "NB : As is often typical of me - this is a LONG POST - and it's FEEDBACK ONLY - NO NEW DATA - for those who'd prefer to skip it! [smilie--sprite1][BR][BR]That said - I was personally much looking forward to the Cauldron's implementation, after such a huge build-up, so I hope that what I'm saying here will at least be read by the Forum's staff, whether or not it makes any difference in the long run... and I'm not just fault-finding for no reason. In fact, I'm personally disappointed, so far, and therefore sad that I can't be more positive than I am, below, and that's why I'm even writing at such length. I'm hoping, rare though this may be, that the Cauldron - which seems to be not at all what I'd hoped for, as explained below - may yet be rebalanced, reworked, or otherwise altered, if only to make it less noticeably biased in favour of Premium play...? Hope springs eternal, as they say![BR][BR]So ...[BR][BR]HappyRose said:\t\t\t[..] if I finish a research is one effecting sentient … I don’t need this … so better if I don’t go back … as it will reduce probability of the troops … currently possible 3 in 12 would go to 3 in 13 or 16 ... is this correct?\t\tClick to expand...^ This - to start with. It's already been mentioned in this comments thread that the Cauldron's effects are similar to those of AWs, albeit in most cases weaker and only temporary - and this reminds me of the similar existing system whereby gaining new relevant AW Runes from the Tournament is a lottery which becomes only more random as one Researches more AWs - just as here, it seems, it's a better decision, strategically, NOT to Research more Diplomas, since the Cauldron's also - disappointingly - going to rely heavily, in several ways, on random mechanics...?[BR][BR]If this is corrrect, then I, for one, won't be sacrificing any of my 'on-hold' Optional Research (needed for Event Quests), and certainly not opening new Mandatory Research, with its negative effect on the 2020 Formula, in order to decrease my chances of obtaining Cauldron effects which I can actually use... which for me, as several are saying, appear largely to be the Merc Camp Troops-relevant boosts.[BR][BR]As already stated, I've been much looking forward to the Cauldron arriving - in the hope it would be strategic and versatile enough to give us something engaging and meaningful to do outside of the 'busy times' when we're all doing Tourney & Spire anyway - but now that I'm getting a picture of how it works, I'm thinking that it may (?) be something to play around with - rarely, and only if/when I have spare Resources or I'm bored - but the highly random nature of its effects, the short duration of potions, their limited effects vs their cost to increase in power, and for most later-game players the potions' limited usage to only one small, short window of time per week seems - to me - to be very much not worth the expense, and especially the disadvantages of having to Research more Optional [or Mandatory] Techs?[BR][BR]Forcing encouraging the Research of any Technologies - in a strategic game where the permanent negative consequences of doing so, strategy-wise, aren't even mentioned to players - is never welcome, IMO, and I would say even verges upon being disingenuous.[BR][BR]And why make such a complex, game-wide-integrated system into something which only really matters at Spire-and-Tourney times of the week...?[BR][BR]This increasingly seems to be a seriously missed opportunity by @InnoGames - it's cost a lot of development & artist & creative writing [not to mention Facebook promo] time to create the Cauldron, only for it to be so very limited all round, and - IMO - so evidently a fairly obvious Diamond sink? That's a real shame. It could have been a very engaging feature for F2P and Premium players alike, useful and enjoyable outside of the 'busy time' of Spire & Tourney - why not at least make it available much more often, so that there's something to do, the rest of the time, other than [essentially] logging on, collecting Resources, placing a few Trades, and logging off again until Spire & Tourney roll round once more...?[BR][BR]WHY does so much, in a nominally strategic game, have to be so RNG-dependent? This alone is very disappointing. Some randomness is fun. The level involved here, it seems, is NOT fun, especially compared with its costs - well, at least for players who don't enjoy gambling, I suppose... :/[BR][BR]All the hype - it's been very real! - and, again, the development & implementation costs - for what amounts to a few weekly Spire & Tourney buffs, for many of us? That's such a shame, unless I really am missing something because I can't test this usefully in my Ch.III Beta City. Many thanks to all the dedicated Beta players who are devoting their City Resources & time to discovering how the Cauldron actually works![BR][BR]And on that subject, too : I've said this before, more than once, but since we have a new CM now, @Vaeri @InnoGames  - we all know that Beta players don't receive any extra City Resources to use in testing new features, even costly & complex ones like this one... but my question is why not?! Testing is far from free of cost, in time, Resources, or Diamonds alike, and Beta players can't even fast-level Cities, or import their Live Account Cities for testing, as would be SO useful both for them and for Inno (and as is the case on every other Beta Server I've played on, in other games).[BR][BR]Also @InnoGames : Providing your Beta players (and staff...) with advance and useful documentation about new features is a much better way to get helpful and informed feedback than giving them nothing more than the non-specific info which the Live Servers are going to get anyway when it's released (cynical mode : assuming it's not already being, or about to be, silently A/B tested there anyway...) - and on that subject, too, I'm wondering how many Live players are going to be happy that they'll have to waste a lot of Live City Resources just to find out [beyond the vague hints in the in-game Quests] how, mathematically, the Cauldron and its effects work? Self-discovery of new game mechanics can be fun, yes, but not at too high a cost - in terms of Resources, time, or player patience/frustration/potential disappointment.[BR][BR]There is currently quite a lot of anticipation and chatter on Live about the Cauldron, much of it positive & enthusiastic. This is one of the biggest additions to the game for a long time. IMO, Inno really needs to rebalance the Cauldron in many ways, including (a) reducing the RNG element (it may well induce spending in some players, but many of us hate it and won't spend Diamonds on random outcomes), (b) making potions more relevant & useful than merely temporary and short-duration weekly effects, and (c) extending the timeframe of the Cauldron's operations so that it's not just a matter of 'log in, rush a few potions, hope for a few good effects, rush some Combat & Catering while potion effects are working, log out, aaand... back to doing nothing much all week'... that's SO limited, and not what I'd hoped for at all, if it's [realistically] all it offers?[BR][BR]Spoiler: A non-irrelevant side-note here - in terms of 'Joined-Up Thinking', as it's called ...Inno is apparently broadening its reach in the Far East, if the in-game ads for Mandarin/Japanese/Korean-fluent CMs is any indicator. This would be a great opportunity to create/boost engagement in a customer base which, by reputation, welcomes intricate and strategic games - even though it's also true that the RNG/gambling element of mobile gaming originated in South Korea (in the form of in-game Lootboxes / gacha pulls)... but even so, surely Inno doesn't want to launch/expand Elvenar (?) in that very significant marketplace with a brand-new feature which [apparently?] has so little long-term strategic interest or potential within the game - even if, yes, I suppose those who love gacha-pull games might appreciate gambling with Diamonds occasionally...? Shouldn't there be more to what makes a great & enduring game than just 'how much can it earn'? Moot point![BR]IMO Inno should also provide much more in the way of information about the Cauldron's mechanics to Live players, too, when this is released to Live - describing how the Cauldron fundamentally works, rather than just taking the usual mobile game route of 'Here's some Quests which are pretty & charismatic but don't really tell you anything useful'... whether they insist on using the apparently cyanosis-suffering new Enchantress avatar or not... and I, for, one, would always have preferred not !! (OK, that's rather off-topic, but still, here's why why I don't like the new version of Tandriel, the Elven Sorceress (or now, perhaps, Witch? - as she may well end up being seen by at least some players... Witch's Cauldron, hm?).[BR][BR]All of the above are [obviously] views more on broad concepts than mechanics-specific details - as I've said, I can't usefully use the Cauldron yet.[BR][BR]Thanks for reading through this, those who did (?!) - as I said, a long post, but a sincere one. I was much looking forward to the Cauldron, and I really don't much like what I see, so far - outside of the artwork (very good), the attempt at charismatic & 'Lore-friendly' text descriptions & Quests (pretty good) and the UI (attractively done - and although I can't personally comment on it, apparently adequately user-friendly as well).[BR][BR]I'm really hoping that (a) I'm wrong about how limited the Cauldron seems, and it's better than I think, or (b) it will be rebalanced & improved...? :/[BR][BR]Spoiler: To Marindor [I know, ID disabled] - and anyone who remembers the Cauldron Ingredients Naming Contest, on Beta and then on FB ...If you're by any chance reading this, @ThaMartin / Marindor... I can only thank you again for taking time out of your Sunday night to have the 'Ear Fungus' graphic altered from what it initially was (a) to what it now is (b), as below... which I maintain was the wisest decision, pre-release of the Cauldron, that Inno could have made. Thank you again for this, and so much else you did for us, and I wish you well in all that you do! [smilie--sprite6][BR](a) [IMG]https://i.ibb.co/hBKwWsd/https-beta-forum-elvenar-com-index-php-attachments-cauldron-ingredients-ear-fungus-original-july-202.png[/IMG] -->(b) [IMG]https://i.ibb.co/KhCV0QL/https-beta-forum-elvenar-com-index-php-attachments-cauldron-ingredients-ear-fungus-new-nov-2022-smal.png[/IMG]​"}, {"45": "Laurelin-Beta said:\t\t\tit's FEEDBACK ONLY - NO NEW DATA - for those who'd prefer to skip it!\t\tClick to expand...Thank you for that.. saves me a lot of reading!"}, {"12": "Laurelin-Beta said:Inno really needs to rebalance the Cauldron in many ways,\t\tClick to expand...Jup, Cost > benefit is a disaster[BR]Just an example lvl 100 life boost 12% & 12h[BR]what is going on in your heads???"}, {"5": "@Laurelin-Beta after reading through your comment here and in the other thread, I realized you are operating under some inaccurate and outdated information. Completing optional research has zero effect on anything related to the tournament or Spire. Other than not wanting to use the needed resources to complete them, there is no reason to skip them."}, {"82": "Enevhar Aldarion said:@Laurelin-Beta after reading through your comment here and in the other thread, I realized you are operating under some inaccurate and outdated information. Completing optional research has zero effect on anything related to the tournament or Spire. Other than not wanting to use the needed resources to complete them, there is no reason to skip them.\t\tClick to expand...Sorry if I wasn't clear... I'll try again! My understanding is that Mandatory Researches affect the 2020 Formula, while Optional Squad Sizes don't affect the 2020 Formula per se, and nor do Optional City Expansion Researches, although placing the Expansions thus gained is the greatest single influential factor affecting the Formula. Better attempt...? [smilie--sprite2][BR][BR]Of course, if one isn't interested in monitoring/minimising Tourney & Spire Squad Sizes and/or Catering Costs, then none of this matters, really! [smilie--sprite8][BR][BR]Optional Researches are important for me in particular to leave open, as I do wherever I can, because I save them for Event Quest use (I don't want to use Mandatory Research for this purpose - several reasons - and I often dislike the alternative options, especially if it's 'Collect X Vision Vapour').[BR][BR]I keep my City very small and Research very slowly for a number of reasons, both strategic and merely convenient to my gameplay style. YMMV [smilie--sprite1]"}, {"82": "Jammin said:\t\t\tCost > benefit is a disaster[BR]Just an example lvl 100 life boost 12% & 12h\t\tClick to expand...@Jammin : Thanks very much for all the detailed Cauldron mechanics info so far. If you have any more of the same, is there any chance you would be able (and willing) to compile a reference chart, or similar? I very much doubt Inno will do so, and it seems very necessary info to me - if you want to go to so much trouble, of course - or if anyone else does? Sorry to ask - I sometimes post long word-heavy opinions, but I'm not skilled enough with code to read the game files in depth, and I'm also not good enough at maths to calculate accurately, either, so I'd be really grateful... [smilie--sprite1]"}, {"74": "I don't like slot machines (i.e. Cauldron and other functionalities)"}, {"83": "I am also saving optional researches for event quests . And I hate being forced doing them. I completed some this week to get 3 diploma out of seven. But I won’t do more . Optional researches should remain optional. I can’t see any reason why this should be changed today. It’s a mistake to change this rule."}, {"33": "Fastandfurious said:\t\t\tI am also saving optional researches for event quests . And I hate being forced doing them. I completed some this week to get 3 diploma out of seven. But I won’t do more . Optional researches should remain optional. I can’t see any reason why this should be changed today. It’s a mistake to change this rule.\t\tClick to expand...They should requiere ONLY all compulsory Technologies, so optionals keep being optional..."}, {"16": "Took a bit closer look at math behind effect probabilities. [BR]Seems there is no way excess useless potion effects can affect useful ones (the only way is to get total potion chance>100% before you get max chances for desired effects, which is impossible due to not enough weekly witch points). So you can feel free to get all research diplomas.[BR]That was wrong, any new effect lower chances of desired effects due to normalization which I've missed reading the code.[BR]Sad that Inno stopped deploying unminified code, it's way harder to understand it now comparing to their summer debug session."}, {"72": "Karvest said:\t\t\tTook a bit closer look at math behind effect probabilities. Seems there is no way excess useless potion effects can affect useful ones (the only way is to get total potion chance>100% before you get max chances for desired effects, which is impossible due to not enough weekly witch points). So you can feel free to get all research diplomas.\t\tClick to expand...I think I am misunderstanding you. As far as I can see we are limited by max 25 ingredients per potion. And the probability to get an effect is 20% times square root of the number of ingredients used. So the probability is 100% when using 25 ingredients.[BR][BR]I haven't been able to figure out how different combinations of ingredients influence the probabilities for the different effects. I have tried experimenting but are confused about what I am observing."}, {"12": "Laurelin-Beta said:@Jammin : Thanks very much for all the detailed Cauldron mechanics info so far. If you have any more of the same, is there any chance you would be able (and willing) to compile a reference chart, or similar? I very much doubt Inno will do so, and it seems very necessary info to me - if you want to go to so much trouble, of course - or if anyone else does? Sorry to ask - I sometimes post long word-heavy opinions, but I'm not skilled enough with code to read the game files in depth, and I'm also not good enough at maths to calculate accurately, either, so I'd be really grateful... [smilie--sprite1]Click to expand...Huhu, I'm definitely not the right person for this, there's nothing to thank for either, as mentioned above I'm still small here and can't test much, only when the Cauldron comes to my capital I will have a better overview .[BR][BR]I'm also only interested in the bonus damage and life of the troops, especially for the mercenary camp, for the other military buildings it's secondary and everything else is just decoration.[BR][BR]What bothers me here is the benefit, I don't even want to start discussing the benefit of all the other potions.[BR][BR]Imagine the following scenario:[BR]The tournament is about to start and you want to brew a bonus damage potion for the mercenary camp, also you want to brew a potion with bonus life for the troops in the mercenary camp.[BR][BR]You throw items into the cauldron which increases the chance of triggering the effects for these two potions (remember that this may increase the chance of other useless potions as well)[BR][BR]If you are satisfied with the chance click on brew and here we go, you have 4 cups and the random generator decides what you get.[BR][BR]This means for you that you might not get any damage bonus at all because the randomizer might give you 4x the same life boost or maybe even some other shit that had a lower chance in it.[BR][BR]So if you want to be on the safe side, you can only brew one potion and that is the one you absolutely want.[BR][BR]And that really annoys me, in the video they said you can have as many potions at the same time, yes you can, you can have all junk at the same time, but you might not get what you wanted either."}, {"16": "The Fairy said:\t\t\tI think I am misunderstanding you. As far as I can see we are limited by max 25 ingredients per potion. And the probability to get an effect is 20% times square root of the number of ingredients used. So the probability is 100% when using 25 ingredients.\t\tClick to expand...well, actually it's not 20% of square root, but (numberOfIngredients/maxNumberOfIngredients)^0.5, with all 3 numbers configurable, but for now it can be treated as 20% of square root.=)[BR]And yes, I missed the part of code which normalize resulting probabilities with that number."}, {"72": "Karvest said:\t\t\twell, actually it's not 20% of square root, but (numberOfIngredients/maxNumberOfIngredients)^0.5, with all 3 numbers configurable, but for now it can be treated as 20% of square root.=)[BR]And yes, I missed the part of code which normalize resulting probabilities with that number.\t\tClick to expand...Yes, that would give the same result, I just plotted the probabilities for the different amounts of ingredients and found the formula that way [smilie--sprite1]"}, {"51": "Wow - sure seems to be a lot of detractors on this thread - and to them I will point out that the cauldron only needs one thing to make it both viable and valuable - and I know Inno can do this as they have done to so many of the beneficial features that we have been blessed with ( albeit for a shorter time than we would have liked) before. I looked on this as it was released and thought to myself that it would be 1 of 2 things - if it was beneficial to the players - then Inno would most likely nerf it or it would be a resource hog. Imagine my surprise then when I saw that Inno has learned from their past  \" mistakes\" and made something that they do not need to nerf right away because the thing that they need to do to get this to where we would praise  ( and use ) this thing is a reverse nerf."}, {"74": "Inno measures funcionalities on the basis of money return: if they will get money from the Cauldron, they wll not change it. It is reasonable: they are there to earn money [smilie--sprite1]"}, {"33": "One quick question , does ingredients' cost (and increase progresion) depends on chapter or is it the same for every player?"}, {"33": "Prueba2 said:\t\t\tOk, strange that standard (T1/T2/T3) and sentient (S1/S2/S3) got splitted while being treated as a whole in:[BR]Mountain Halls, Aureate Phoenix,D111-a \"Timewarp\", Vortex of Storage,Tree of Enlightenment,So, with the maximum 5 goblets per week, a battling player could activate 5/6 posssible battling effects (*) while a catering player could activate 5/9 possible production effects (3xstandard+orcs+mana+seeds+3xsentients=9 // disregarding gold and tools)[BR][BR]I had hoped for some effects boosting Spells (Power of Provisions, ...) or affecting Wholesaler, reducing Tournament time, Catering costs, recovering Squads...[BR]Something more strategic?[BR][BR]The effects are similar to Ancient Wonders but not alike at all ...[BR][BR](*): Depeding on the type ot units, not that it would be really necessary to activate all 5 of them...[BR][BR]EDIT: Yes, Units also got splitted among their building....\t\tClick to expand...Ok, thinking about it again, as units effects got grouped by building (not by type of unit, 15 types) makes sense to do the same for produtcion effects, so T1/S1/A1 effect, T2/S2/A2 effect and T3/S3/A3 effect, instead of 9 production effects..."}]