[{"16": "Prueba2 said:\t\t\tOne quick question , does ingredients' cost (and increase progresion) depends on chapter or is it the same for every player?\t\tClick to expand...It's the same.[BR]Each invested ingredient increase costs of all ingredients by 1.1 times and its own cost by 1.4 times"}, {"33": "Ok, then one viable option would be to spent the first weeks powering the effects until \"slow track\" reached and then starting activating the effects (once enough bonus and duration acchieved)?[BR][BR]EDIT: Also if correctly understood diploma unlocking system, it seems  it makes sense to not investigate further chapters (optional Technologies) than interesting effects to avoid diluding the probability of getting the desired effects..."}, {"84": "Karvest said:\t\t\twell, actually it's not 20% of square root, but (numberOfIngredients/maxNumberOfIngredients)^0.5, with all 3 numbers configurable, but for now it can be treated as 20% of square root.=)[BR]And yes, I missed the part of code which normalize resulting probabilities with that number.\t\tClick to expand...maxNumberOfIngredients = 25 right? Just take the 1/25 out of the suqare root and it is 1/5 or 20% and only (numberOfIngredients)^0.5 remains? Or is maxNumberOfIngredients actually a variable or if it is not, why isn't there a 25 from the get-go?^^"}, {"16": "it's configurable, so they can change it at any time they like for balancing."}, {"79": "The Fairy said:\t\t\tI think you mean runes here? I still haven't found any use for my thousands of relics, but maybe one day [smilie--sprite1]Click to expand...Yes sorry I meant runes.  Relics are used in the magic academy when making spells like provisions, CCs, etc."}, {"62": "is this a bug or am i missing something? making the potion says  15,8% dmg boost if om correct?  but i only get 13% also the time isn't 7:54 but close to 5 hrs[BR][BR][IMG]https://i.ibb.co/LR0Py3x/https-beta-forum-elvenar-com-index-php-attachments-1670110555128-png-10521.png[/IMG][BR][IMG]https://i.ibb.co/MsMfPbd/https-beta-forum-elvenar-com-index-php-attachments-1670110562763-png-10522.png[/IMG]"}, {"19": "The idea is great, I like the new mechanic and I like the fact there is some randomness to it.[BR]But sadly, the implementation rather...well...sucks.[BR]-[BR]My main objection to it is the fact that low-chapter players have almost no use for it at all, as the low number of witch points means one can use only very few ingredients and thus has an extremely low chance of succes for anything, whereas it will be supereffective for end-game players. The balance there is way off.[BR]Near the end of Woodelves chapter and I can put in 9-10 ingredients at the most, with about 66% chance of succes. Meaning it will be much lower for players in lower chapters again. Not exactly a great chance.[BR]-[BR]The fighterboosters are nice, but with a timespan of 2 hours or so (in my case) it means that anyone who does not have a Polar Bear AND a high lvl Timewarp has almost no practical use for this, or at best near the end of the week for one of the later Tourney rounds. I shudder to think how bad it is for people in chapters before this.[BR]The same goes for the duration of goodsproduction, or coins, or supplies, so short it is hardly worth it, meaning that since you can only brew once a week it is very, very limited.[BR]-[BR]We only had one week to try so far, but so far I am not impressed. As stated, great idea, bad implementation."}, {"12": "Skillpowers said:\t\t\tis this a bug or am i missing something? making the potion says  15,8% dmg boost if om correct?  but i only get 13% also the time isn't 7:54 but close to 5 hrs\t\tClick to expand...No bug, the designer would say \"it works as intended\"."}, {"29": "Same thing here... [BR][BR][IMG]https://i.ibb.co/N2Nbm1C/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-04-080130-png-10523.png[/IMG] [IMG]https://i.ibb.co/54mrqmx/https-beta-forum-elvenar-com-index-php-attachments-capture-d-cran-2022-12-04-080210-png-10524.png[/IMG][BR][BR]not the same numbers."}, {"19": "Dhurrin said:\t\t\tThe idea is great, I like the new mechanic and I like the fact there is some randomness to it.[BR]But sadly, the implementation rather...well...sucks.[BR]-[BR]My main objection to it is the fact that low-chapter players have almost no use for it at all, as the low number of witch points means one can use only very few ingredients and thus has an extremely low chance of succes for anything, whereas it will be supereffective for end-game players. The balance there is way off.[BR]Near the end of Woodelves chapter and I can put in 9-10 ingredients at the most, with about 66% chance of succes. Meaning it will be much lower for players in lower chapters again. Not exactly a great chance.[BR]-[BR]The fighterboosters are nice, but with a timespan of 2 hours or so (in my case) it means that anyone who does not have a Polar Bear AND a high lvl Timewarp has almost no practical use for this, or at best near the end of the week for one of the later Tourney rounds. I shudder to think how bad it is for people in chapters before this.[BR]The same goes for the duration of goodsproduction, or coins, or supplies, so short it is hardly worth it, meaning that since you can only brew once a week it is very, very limited.[BR]-[BR]We only had one week to try so far, but so far I am not impressed. As stated, great idea, bad implementation.\t\tClick to expand... Second thing I noticed; it is possible to get the 'no effect' multiple times, so those do 'stack' where the others do not.[BR]I tend to be very unlucky with ALL the random crap in this game, always have been (genies, wishing wells, goddess of wishes, chest-rewards and daily prizes in the events and so on, except for the appearance of petfood and boosterbuildings in the MA, so I'm happy enough on that trade-off). However, if you get the same effect twice, they do not stack.[BR]So out of 4 goblets I had 2 x 'no luck' and 2x the same effect, meaning I only had 1 out of  4, with about 66% chance of success and only 15% chance of the effect I got twice. [BR]I don't mind being unlucky with the random game-mechanics, I have been for years now and am used to it. But this set-up is really ridiculous. The effects are so weak that if you do get the same one at least it should stack, since it's temporary anyway AND you have a pretty good chance of getting nothing at all, especially when in the lower or mid-game chapters.[BR]-[BR]Again it seems a very nice addition for late-game players, but for the others it is hardly worth bothering with"}, {"22": "Dhurrin said:\t\t\tThe idea is great, I like the new mechanic and I like the fact there is some randomness to it.[BR]But sadly, the implementation rather...well...sucks.[BR]-[BR]My main objection to it is the fact that low-chapter players have almost no use for it at all, as the low number of witch points means one can use only very few ingredients and thus has an extremely low chance of succes for anything, whereas it will be supereffective for end-game players. The balance there is way off.[BR]Near the end of Woodelves chapter and I can put in 9-10 ingredients at the most, with about 66% chance of succes. Meaning it will be much lower for players in lower chapters again. Not exactly a great chance.[BR]-[BR]The fighterboosters are nice, but with a timespan of 2 hours or so (in my case) it means that anyone who does not have a Polar Bear AND a high lvl Timewarp has almost no practical use for this, or at best near the end of the week for one of the later Tourney rounds. I shudder to think how bad it is for people in chapters before this.[BR]The same goes for the duration of goodsproduction, or coins, or supplies, so short it is hardly worth it, meaning that since you can only brew once a week it is very, very limited.[BR]-[BR]We only had one week to try so far, but so far I am not impressed. As stated, great idea, bad implementation.\t\tClick to expand...you obtain max bonus if success rate is 100% (using 25 ingredients), I think"}, {"12": "Dhurrin said:\t\t\tAgain it seems a very nice addition for late-game players, but for the others it is hardly worth bothering with\t\tClick to expand...I'm almost with you, late-game players benefit more from the potions, but not really much more.[BR]These effects are very weak and very short, even if they have a high level and when brewing a potion, the random generator ensures that you don't always get the maximum out of the potion, no matter how high its lvl is. (Similar to e.g. tournaments, the min and maximum damage of troops is drawn randomly before attack.)[BR][BR]I actually only see a meaningful use if there is no hardcap for the level of the potions, then you could actually level a pretty good potion at some point. Or as you write when the potions become stackable.[BR][BR]I'm also surprised that two diplomas aren't currently implemented in the cauldron, which could be pretty good without a hardcap or stackable.[BR][BR]Troop Production Bonus & Troop Revival"}, {"33": "Jammin said:\t\t\tI'm also surprised that two diplomas aren't currently implemented in the cauldron, which could be pretty good without a hardcap or stackable.[BR][BR]Troop Production Bonus & Troop Revival\t\tClick to expand...Probably for the new 16 next chapters (one diploma per building, 6 battle effects diplomas, 3 every 7-9 chapters)"}, {"33": "NameiconIdLevel 1 +%/lvl[BR]Bonus[BR]DurationLevel 100[BR] Bonus[BR] DurationMagical Tax Increasemoney10.0% + 0.5%[BR]5:00 + 0:1559.50%[BR]29:45Supply Surplus Spellsupplies10.0% + 0.5%[BR]5:00 + 0:1559.50%[BR]29:45General's Mayhemhb_strength4.0% + 0.2%[BR]2:00 + 0:0623.80%[BR]11:54Trader's Basic Pleagoods_standard_basic40% + 42% // (5.0% + 0.25%)[BR]5:00 + 0:15238.00% // (29.75%)[BR]29:45Trader's Refined Pleagoods_standard_refined40% + 42% // (5.0% + 0.25%)[BR]5:00 + 0:15238.00% // (29.75%)[BR]29:45Trader's Precious Pleagoods_standard_precious40% + 42% // (5.0% + 0.25%)[BR]5:00 + 0:15238.00% // (29.75%)[BR]29:45Monsters' Mayhemtg_strength4.0% + 0.2%[BR]2:00 + 0:0623.80%[BR]11:54Gift of the High Menportal_production4.0% + 0.2%[BR]3:00 + 0:0923.80%[BR]17:51Horde Uprisingorcs10.0% + 0.5%[BR]5:00 + 0:1559.50%[BR]29:45Enar's Boonmana10.0% + 0.5%[BR]5:00 + 0:1559.50%[BR]29:45Mercenaries' Mayhemmc_strength4.0% + 0.2%[BR]2:00 + 0:0623.80%[BR]11:54Harvest Moonseeds10.0% + 0.5%[BR]5:00 + 0:1559.50%[BR]29:45Trader's Basic Prayergoods_sentient_basic40% + 42% // (5.0% + 0.25%)[BR]5:00 + 0:15238.00% // (29.75%)[BR]29:45Trader's Refined Prayergoods_sentient_refined40% + 42% // (5.0% + 0.25%)[BR]5:00 + 0:15238.00% // (29.75%)[BR]29:45Trader's Precious Prayergoods_sentient_precious40% + 42% // (5.0% + 0.25%)[BR]5:00 + 0:15238.00% // (29.75%)[BR]29:45Monsters' Morale Boosttg_health2.0% + 0.1%[BR]2:00 + 0:0611.90%[BR]11:54Mercenaries' Morale Boostmc_health2.0% + 0.1%[BR]2:00 + 0:0611.90%[BR]11:54Unur's Resurgenceunurium10.0% + 0.5%[BR]5:00 + 0:1559.50%[BR]29:45Trader's Basic Blessinggoods_ascended_basic40% + 42% // (5.0% + 0.25%)[BR]5:00 + 0:15238.00% // (29.75%)[BR]29:45Trader's Refined Blessinggoods_ascended_refined40% + 42% // (5.0% + 0.25%)[BR]5:00 + 0:15238.00% // (29.75%)[BR]29:45Trader's Precious Blessinggoods_ascended_precious40% + 42% // (5.0% + 0.25%)[BR]5:00 + 0:15238.00% // (29.75%)[BR]29:45General's Morale Boosthb_health2.0% + 0.1%[BR]2:00 + 0:0611.90%[BR]11:54[BR]For products , provided \"real\" % based on (100% base + 700% relic bonus ) production[BR][BR]EDIT : Added SpellFragments effects:[BR][BR]Spell FragmentsNormal Bonus[BR] Normal DurationCritical ProbabilityCritical Bonus[BR] Critical Duration0k0-100%[BR]0-100%0%---[BR]---10k0-150%[BR]0-150%10.5%150%[BR]225%40k0-200%[BR]0-200%22.1%200%[BR]300%90k0-250%[BR]0-250%35.0%250%[BR]375%160k0-300%[BR]0-300%49.2%300%[BR]450%165k0-303%[BR]0-303%50% (MAX)303%[BR]454%"}, {"73": "I wonder if the rules around the cauldron would stay the same if the devs gets paid according to the current cauldron rules?[BR]they have to do many different things around the office.when they get paid there is a chance of getting someone else pay check or even none at all.and at the moment they get paid they need to spent it all at once.point 1 I can live with, point 2 can be acceptable for the game but point 3 made me decide this new feature is a no go.[BR]I have done what they asked from me (being a guinea pig) and I decide that it is not worth the hassle as long as they don't change  point 3."}, {"11": "Hmmmm[BR][BR][IMG]https://i.ibb.co/KcnQvY1/https-beta-forum-elvenar-com-index-php-attachments-1670158092812-png-10526.png[/IMG][BR][BR][BR]With 22% chance getting \"General's Mayhem\" i still receive this:[BR][IMG]https://i.ibb.co/qy7Ftd7/https-beta-forum-elvenar-com-index-php-attachments-1670158174085-png-10527.png[/IMG][BR][BR]Far away from the 16.4% and 8:12h ???"}, {"12": "Droopy said:\t\t\tFar away from the 16.4% and 8:12h ???\t\tClick to expand...I know something that goes well with it 'Next Level' aespa [BR]at the same time I apologize, it's not my intention to be rude. "}, {"85": "Droopy said:\t\t\tFar away from the 16.4% and 8:12h ???\t\tClick to expand...What you see on the table on the right (your first screenshot) is only the maximal effect you can get.[BR]You can consider it being a range (the minimum isn’t visible for us), when the effect is triggered it is like drawing a random number from this range.[BR][BR]As @Jammin already pointed out, [BR]Jammin said:\t\t\tthe random generator ensures that you don't always get the maximum out of the potion, no matter how high its lvl is. (Similar to e.g. tournaments, the min and maximum damage of troops is drawn randomly before attack.)\t\tClick to expand...[BR]On your screenshot, I see the same diamond ingredients as I also have this week. Are diamond ingredients the same for all players (being in the same week)?"}, {"22": "the same in my city[BR][IMG]https://i.ibb.co/6gqpTD8/https-beta-forum-elvenar-com-index-php-attachments-1670182203314-png-10529.png[/IMG]"}, {"86": "I've just taken a peek at the actual cauldron. I'm underwhelmed. So much work around such a tiny feature.[BR][BR]The potions are half-random, with not enough control on thingsthe interface is not well-thought out: it's impossible to remove ingredients (or is it) without cancelling everything and going back. Annoying when you click on diamonds by mistake, or if you go over your magical power (+/- would be great)The interface is not well-thought out II: I have to try to brew a potion, before I can try to improve my skill.you got to go really high to be reasonably certain you brew at least some potionthe effects are laughably short for \"once a week\" featurethe effects are laughably small, especially with all the restrictions: additive, doesn't take into account any other boost, does not apply to any bonus production, including sets, does not apply to spellsI've seen that, obviously, you can increase the effect by applying diamonds.  So, yeah, maybe by spending diamonds in there instead of on premium expansions, I can get useful effects.[BR][BR]Seriously, we have clamored for ages to have more slot in the magic academy or some way to half-control the rotations, and instead we get this ?[BR][BR]The only cool part about the cauldron is the ingredients."}]