[{"17": "Jak se na nadcházející turnajové změny těšíte? Líbí se vám? Zúčastníte se nových turnajů?[BR][BR]Povídejte, těšíme na vaše názory a postřehy. [smilie--sprite2]"}, {"5": "Zvídavost předbíhá pád....?! Pokud opravdu vše ušetří onen náš vzácný čas, chce se říci: sláva jsem zpátky ve hře."}, {"16": "Ne že by naše zpětná vazba něco změnila, jak je jasné ze zpětné vazby bety a EN serverů, ale přesto můžu napsat pár postřehů z pohledu hráče, jehož turnajový průměr přesahuje 10K bodů a patří tedy k těm, které tato změna postihuje nejvíce negativně.[BR][BR]Snížení počtu střetů 4>1: Ok, tahle změna nasazená sama o sobě by mi ušetřila 1/4 úmorného klikání.[BR]Rozdělení fronty výroby vojsk: Přesto, že jsme dostali tuto změnu předem, vlastně patří až sem. Nevím, jestli s ní bylo počítáno od začátku nebo byla až reakcí na nasazení první verze, ale sama o sobě neznamená, že máma 3x takovou vojenskou sílu, jelikož ty jednotky si nejsou rovny. Nejhorší věc na této změně je ta, že 2 jednotky ze cvičiště stále vyžadují jako vstup orky, tedy vysoce nedostatkovou surovinu v posledních kapitolách (zejména díky extrémnímu nepoměru růstu produkce vs rostoucí náklady)[BR][BR]Nové suroviny: Přidání mincí, kladiv, many a zdražení orků považuji za špatnou věc, v podstatě to výrazně omezuje či rovnou znemožňuje výkup u velmi rozvinutých měst. Jakmile vám selže armáda, tak ceny výkupu jsou natolik veliké (zejména orků), že to nemáte šanci utáhnout výkupem, ne při té směšné produkci zbrojnic.[BR][BR]Rychlost růstu obtížnosti: Obtížnost (= poměr velikosti jednotky nepřítele vs hráče) roste příliš rychle - jednak výrazně omezuje celkový výsledek a jednak snižuje možnost učení boje pro nezkušené hráče (prvních pár provincií je směšně lehkých (když nasadíte těžkooděnce proti lukům a těžkooděnci přesto vyhrají, protože mají brutální přesilu, tak se nic nenaučíte) a pak roste obtížnost tak rychle, že po pár dalších provinciích už nic nevyhrajete, protože přesilu má pro změnu nepřítel a bez lepších jednotek, fénixe, posílení a zkušeností vás nepřítel převálcuje, takže se zase nic nenaučíte.[BR][BR]Změna formule na výpočet velikosti: Asi nejhorší věc z celé změny. Sice je fajn, že už nejsou hráči penalizování za výzkum nepovinných oddílů, ale zase jsou penalizováni za pokrok a to je prostě špatně a dle mého názoru se Innu ve středně a dlouhodobém hledisku vymstí (v odlivu hráčů a poklesu příjmů). Ve snaze zprůměrovat hráče (tzn. těm dole přidáme a těm nahoře ubereme, aby města v trpaslících po půl roce hraní mohla konkurovat městům hrajících 5 let na konci výzkumu) se vymyslela formule, která je extrémně nepřátelská k pokročilým hráčům, kteří několik let pracovali na tom, aby se probojovali do turnajové špičky. To vše se jim teď vrátí, jelikož nová formule je potrestá ztížením turnaje (a věže) za každou další úroveň divů, za každé další položené rozšíření a každý další provedený výzkum, a to tím více, čím více všech 3 kategorií již mají. Všechny parametry se totiž vzájemně násobí, takže s každou další kapitolou budou vytvářet efekt, při kterém budou v turnaji města v poslední kapitole stále méně konkureceschopná a jejich výsledky budou klesat (rozdíl mezi růstem nákladů a růstem výroby surovin i jednotek bude stále extrémnější a bez přepracování této formule je pouze otázka času, kdy bude turnaj (a věž) pro tato města na hranici (či dokonce za ní) hratelnosti).[BR][BR]Já osobně jsem smířen s tím, že můj průměr v turnaji se výrazně zhorší (když budu optimista, tak spadně někam k 5K, když budu pesimista, tak spadne i níže). A s tím, že do přepracování formule bude již jen klesat.[BR]A při výběru mezi pokrokem a turnajem volím pokrok.[BR]Tzn. v turnaji se nadále budu soustředit na udržení relikvií pro výrobu kouzel (takže 7 z 9 turnajů pouze na fénixovi bez dočasných budov) a udržení přísunu plánků (to by asi neměl být problém, předpokládám, že se formule přepracuje předtím, než města na konci výzkumu ztratí možnost nahrát i těch 1600 bodů)"}, {"68": "Nemohu posoudit, jaké to bude mít dopady na můj herní styl. Takže se zatím nebudu vyjadřovat, dokud to neokusím přímo ve hře. Ale pozitivum vidím v tom, že se tolik neuklikám jako doteď, takže tuto změnu velmi vítám...... Ale jaké dopady to bude mít, až se v turnajích budou navíc používat suroviny, které tam doposud nebyli, toť otázka... Snad to nebude zas tak zlé... Nechám se překvapit... [smilie--sprite1]"}, {"48": "Třeba budu ten turnaj hrát víc, když už nezničím při každém turnaji jednu myš (nadsázka  [smilie--sprite2] ) ... K oatatnímu se zatím, podobně jako @aikomi nebudu vyjadřovat dříve než vyzkoušim."}, {"149": "Jak máme rozumět tomuhle, nebo jak to bude probíhat prakticky: [BR][BR]Cílem těchto truhel je, aby je nebylo snadné získat, takže s každou další truhlou narůstá počet bodů, který je třeba v turnaji získat. Vzhledem k tomu, že se jedná o dlouhodobou výzvu nepředpokládáme, že ani ta společenství, která jsou na turnaje extrémně zaměřena, zvládnou získat všechny truhly v prvních týdnech po implementaci této změny.Děkuji. J."}, {"5": "Vzhledem k tomu, že mám ve hře jedno z nejvyspělejších měst a nejpokročilejších, co se do výzkumu a rozšíření jedná, jsem opravdu zvědavý na náročnost nového systému. Tento týden jsem po dlouhé odmlce projel věž a ano s drobnými obtížemi /nakrmeno ptactvo/ pouze bojem /omlouvám se, že nevím konkrétní čísla ztrát, zkusím se na to příště trochu zaměřit a případně i spočítat/. A next týden tedy uvidím a až si to prakticky osahám, co přinesly změny v turnaji, za mne velké + považuji sloučení bojů v provincii, po kterém jsem léta volal! Určitě pak dám zpětnou vazbu, jak to jde....nechci chválit ani hanit den před večerem. Příjemnou zábavu a úspěchy v turnaji všem bijcům [smilie--sprite1][BR]...žel z diskusního vlákna na Betě moc optimismu, ani po kosmetických úpravách nových turnajů, nepřichází..."}, {"68": "@Jana.souck Toto se týká truhel, které jsou nad 10. tudíž nad limit, který ve starém turnaji byl. Normálně bude jako vždy 10 truhel v turnaji a když je vaše společenství udělá, tak po nich následují další truhly, které se dle mého názoru budou stěží zdolávat, vzhledem k tomu kolik to bude chtít bodů....Ale o to to bude asi výzva pro některá společenství...."}, {"24": "Teším sa. Viem, že sa môžem rozlúčiť s turnajmi, v ktorých ide bojovať bez strát. Viem, že sa môžem rozlúčiť s 20k+ bodmi. Ale teším sa, že sa konečne po mesiacoch končí ten podivný stav neistoty, nekonečného balansu a obáv z každej blížiacej sa zmeny. Provizórne stavy nemám rád, a toto bol prípad turnajov od prvého oznámenia tohto updatu (čož to celé trvalo tak nejak dlhšie, než som čakal)."}, {"89": "Uvidíme, máme menší města zaměřená na výkup i města na úplném konci výzkumu s rozvinutými divy, zaměřená na boj. Pro ty první to bude asi lehčí, pro ty druhé to bude těžší. ale doufám, že ne úplně zoufalé. Bohužel ze sedmi nás už aktivně hrají jen tři a snad tohle nebude poslední hřebík do rakve našeho rodinného týmu."}, {"110": "Ahoj. [BR]Tak já si konečně dodělám veškerá nepovinná vylepšení jednotek, což je plus. Na druhou stranu jako \"sběratel\" veškerých prastarých vědomostí (vyzkoumám/postavím) se asi úplně těšit nebudu [smilie--sprite1]. Každopádně uvidím. Ve společenství děláme pravidelně 10 truhel (asi jako všichni zdejší přispěvatelé) tak jen doufám, že to vydrží.[BR]Ryny"}, {"150": "Těším se nesmírně. Pokud jsem měl výrazně méně některých relikvií, snažil jsem se to v turnaji dohnat. Toho času a té nudy, játro trpělo - děs. Nějaké průměry bodů v turnajích mne nezajímají, možná ani nejsou předmětem hry, nevím, jsem strašnej hráč, vím, promiňte. Nedostatek surovin a vojsk jsem neměl nikdy, nepředpokládám, že by se to změnilo. Pro to vše - jsem neskonale šťasten. Děkuji.[BR]Ještě si dovolím poznámku k výše uvedené zmínce o výcviku vojsk ve všech zařízeních nezávisle: achjo, pro staříka, co se snaží oddálit němčoura, blbá změna. Stejně jako dříve již portálové bonusy a teleporty. Ale volalo se po tom všeobecně, tudíž respektuji. Se mi to za chvíli jistě bude hodit [smilie--sprite8] Hezkou brou noc přeje předhrobec"}, {"49": "iDavis > zrovna ty bys měl vědět, že co se pustí na betu se prostě zavede i na live. Bez ohledu na reakce, chyby atp. Název \"beta\" je jen kosmetický [smilie--sprite1][BR][BR]Mám necelých 30 nevyzkoumaných oddílů, město na konci. Jejich dovyzkoumání by už nyný mělo být znatelné?"}, {"89": "Taky už jsem zahájil \"dovýzkum\", ale o to víc mám zoufalý nedostatek orků"}, {"105": "No já se popravdě moc netěším. Dokonce si myslím, že sloučení čtyř bojů do jednoho mi nepřinese ani úsporu času, protože budu muset zkoumat složení nepřítele a možná mnohdy bojovat i ručně, zatímco nyní mi na provincii stačí pár vteřin. Rozhodně se mi prodraží případné výkupy, neboť nyní, když už musím něco vykoupit, tak jeden nebo dva střety v provincii - po novu budu vykupovat celou provincii a zřejmě o moc častěji, než nyní - náhodní protivníci. Život mě naučil, že každá změna je pouze k horšímu ( jinak řečeno-pozitivní mutace neexistují). Proto nesdílím váš optimismus."}, {"3": "taky nečekám zkrácení času. Spíš klikání[BR]I když vlastně času taky, protože pokud obtížnost poroste takovým tempem, jak někteří naznačují, tak s 50+ provinciemi se můžu rozloučit a tím pádem místo 200 střetů pokles třeba na 20"}, {"105": "já mám jen kolem +-20 provincií, takže jsem zvědav, zde je budu schopen uhrát tak, jako nyní, třeba i na 6*."}, {"16": "Vypůjčím si tabulku od Donyho z bety popisující poslední změnu obtížnosti, která proběhla tento týden, tzn. pokud ta čísla platí pro aktuální verzi, tak % ve sloupci new znamená poměr velikosti nepřátelské jednotky ku jednotky hráče(100%=velikost jednotky hráče). Závěry, co hráč potřebuje, aby porazil jednotlivé protivníky a jak daleko se může (ne)udržitelně dostat si může udělat každý hráč sám.[BR]Spoiler[IMG]https://i.ibb.co/z7hYKYW/https-cz-forum-elvenar-com-index-php-attachments-1601707294331-png-4945.png[/IMG]"}, {"105": "@Lovec Krys - to tedy znamená, že pokud to jsou údaje pro 1* turnaje, tak někde kolem 20. provincie čelím stejně velkému nepříteli, jako v současné 6* !!! Takže je mi jasné, že změna zasáhne negativně i malé hráče, jako já a už nebudu schopen tolik pomáhat spolku, jako dřív. Leda bych požadoval od ostatních velké dotace surovin na výkupy. Zjistil jsem, že mi nově přibudou do výkupu i T2 suroviny (4.kapitola), což do teď nebylo.[smilie--sprite4]"}, {"31": "Také připojím od Donyho z bety hezky graficky ztvárněné rozvržení typů jednotek v jednotlivých turnajích. T3 budou nejhorší.[BR]"}]