[{"77": "Druhý nový turnaj jsem měla již jakž takž nastavenou laťku, teda jsem (na automat, ohniváka, 1 zbrojíře, stromkové 2 magické + 1 luk + hnědák) uhrála[BR]v kap. Konstruktů (lidi, divy 227, rozšíření 112)[BR]provincie 1. - 20. /1-5* na výkup (dříve jsem nevykupovala, nyní se mi vyplatí, surovin nijak moc neubylo)[BR]provincie 21. - 31. /5* na vojsko[BR]provincie 32. - 35 /4* na vojsko[BR]provincie 36. /3* na vojsko[BR]a protože mi vojsko ještě zbylo tak 37. - 40. /1* na vojsko + jsem si ještě nechala další vojáky na 1.p. do Věže.[BR]Celkem nahraných 7.362b je můj lepší průměr, tedy v tomto městě spokojenost a to včetně i na získané VB, neboť dříve jsem z časových důvodů hrávala jen na 2* cca 40 provincií a nyní, když mám více času, tak můžu jet i na 5*, což mi VB dalo mnohem více.[BR][BR]Ve druhém městě to bylo o něco horší, mám ho v kap. Amuni (elfové, divy 198, rozšíření 103, na automat, ohniváka, stromkové 1 zdraví, 1 mág, 1 luk + hnědák)[BR]provincie 1. - 15. /4* na výkup[BR]provincie 1. - 10. /5* na výkup[BR]provincie 16. - 25. /4* na vojsko[BR]provincie 26. - 28. /3* na vojsko[BR]provincie 11. - 24. /5* na vojsko[BR]provincie 25. /5* (už vojsko neuhrálo) na výkup[BR]ale i tak spokojenost - 5790b opět můj lepší průměr a tedy celkově chválím i spoustu ušetřeného a na chatu prokláboseného času, včetně nasbíraných z turnaje VB.[BR][BR](Věž jezdím v obou městech, teď z důvodu, že mi ještě běží pomocné stromkové budovy, 1.p. na vojsko - ztráty téměř nulové - a další dvě patra až na vrchol na výkup.)"}, {"112": "@ Ludi - přečetl jsem dost příspěvků, abych alespoň okrajově chápal, že vysoké kapitoly můžou mít problém[BR]Jako zakonzervovaný trpajzlík do toho nevidím a můžu jen věřit. Ale snažte se o změnu dodáním důkazů, popište jak jste postupovali, jaké podpůrné prostředky jste použili, jak bojujete. Plošným zahlášením \"Je to tak, snižte to!\" nahrajete spoustu fejkařům.[BR]A dále tady čtu:[BR]1) klepu autoboj - sežralo mi to jednotky[BR]2) boj v turnaji mě nikdy nezajímal, chci vše vykoupit jako dříve a nemám na to[BR].. turnaj neberu jako odměnu za dosaženou velikost, ale jako příležitost uplatnit mozek a strategii.[BR]A opět se odkážu na závěry do ElfNostradamus, že - žere to čas a musí se to hlídat přes manuál (nebo tak nějak to bylo), pak je možné uhrát dost, ale asi ne tolik, jako předtím.[BR][BR]Z prvního spolku v roce 2017 jsem utekl, protože jako prcek jsem tam hrál v turnaji nejvíc, ostatní jásali v 25 lidech na 4 bednama a opěvovali hráčku, které jen jela v celkovém žebříčku nahoru a hltala kapitoly, pro spolek se ničeho nezúčastnila, a divy nevylepšovala. Pokud tací giganti teď volají \"Jsem na konci kapitol a nejde mi odklikat turnaj!\", pak .. (si doplňte zbytek ze Švejka sami).[BR]Pokud se i aktuální hráč prcek rozhodl letět kapitolami nahoru, pak měl turnaj jako zdroj VB do výzkumu (ale co dokázal vylepšit k tomu?).[BR]Ještě nedávno tady často zazníval názor, že divy stačí stavět do lvl 5... , že zhoršují hraní, .. [BR][BR]Kdysi jsi mi nasměrovala na vzorec (neověřený) pro výpočet oddílu a z něj bylo jasné, že \"Divy zvětšují o trochu velikost oddílu, ale jejich přínos převažuje!\"[BR]Trpasličí val mi umožní vyrábět více jednotek (doplním to o kouzelné dílny pro dostatek zásob), Jehly mi tuto výrobu urychlí (a navíc mám útočný bonus pro střelce), Klášter mi dá převahu zdraví a umožní mi vyhrát souboj."}, {"59": "Já to teda měl úplně jinak, u oceláče nebo např. u elixíru se dalo nahrát přes 60 provincií na pět kol (i šest, když tomu časová konstelace dovolila, by se dalo, ale bylo již poměrně zbytečné), a to i u ostatních se dalo 30-60 ve druhém kole, a podle obtížnosti i úměrně v pátém. A když jsem byl z časových důvodů donucen jedno kolo vynechat (a nebylo možné kvůli nedostatečnému časovému vylepšení kolo dohonit), tak jsem končil čtvrtým kolem, ale zase se daly podmínečně všechny druhy turnajů uhrát na max ve druhém kole. Z čehož vyplívá, že oproti druhé věži, jsem mohl ze všech situací získat daleko více odměn z turnaje (kdybych nahrál jen 30, stále by to bylo nastejno, a na ostatních opět získal víc, kromě toho z mých mizerných statistik je zřejmé, že jsem mnoha většině turnajům ani moc nedal (a pěkně se flákal), protože jsem často hrál bez podpůrných budov, a situaci nijak nehrotil (ale to neznamená že to nešlo), a nebo jsem zase na celé kolo zapomněl aktivovat Felixe, apod.). A zdroje v některých městech (i vlivem znevýhodnění některých hráčů na bonusy) jsou v poslední kapitole tak vycuclé, že aby šlo lépe vykupovat, to určitě ne, předtím se vykupovat vůbec nemuselo.[BR][BR]Jinak výpočet oddílu je jedna věc, a filozofie turnaje oproti druhé věži věc druhá. U mě vždy vycházely turnaje z mapy (a ano, vypadalo to, že tomu je stále tak), a typika byla tedy jasně spojená s provinciemi z mapy. Dokonce se dalo přes prozkoumané provincie zjistit jaké druhy nepřátel nás v daném turnaji čekají, mělo to určitou logiku a duši. V druhé věži mi jen ten malý okamžik dal náznak, že přichází doba chaosu, a nějak jsem v tom moc souvislostí nespatřil, když to po mě chtělo jednotky úplně odlišné, podobné jako u první věže. Když někdo hraje jen 20 provincií a opěvuje ulehčení od klikání, nebo bojuje manuál, mi moc smyslu nedává. Manuál je časově náročnější, a opakujícího se a ze stereotypu nevycházejícího klikání je tam víc než dost (přínos je jen v tom, že jsou výrazně menší ztráty, protože AI strategie nic neříká), a ten kdo uhraje jen 20 provincií se ani v turnaji až tak moc nenaklikal, nikoho hra nenutila klikat 60+ provincií. Kdyby raději hra nechala to co fungovalo a mělo smysl (ale to by nesměla chtít za každou cenu hru uměle a bez přidané hodnoty protáhnout a omezit), a změny utvořila do zcela nového obsahu, jako tomu bylo v období první věže (pak by se užila i změna možnosti využití současně více trénovišť). A to je tu ještě fakt, že celý systém obou věží nabourává na smysl pokroku ve městě, který tu byl již dříve prokázán, že není nijak zanedbatelný (i vliv divů byl dostatečně dokázán podle toho, co si zde z příkladů pamatuji, a ne že by efekty viditělně převyšovaly náklady)."}, {"20": "@Pauleo, moc ráda tě vidím  [smilie--sprite1] [BR][BR]@Trumpetko - tvůj příspěvek mě mrzí, snad se mě trochu znáš, takže nechápu. Těch důkazů o exponenciálním růstu už tu bylo hodně, zvláště na fóru bety. Nejde zdaleka jen o divy, ale především o každý postup ve výzkumu a nová rozšíření. Nevím, co ti vadí na hráčích, kteří postupují ve výzkumu. Já osobně nehodnotím nikoho, ať chce postupovat nebo zůstat bez postupu, každého věc. A řekla bych, že se svým spolkům věnuji a hodně pro ně dělám. [BR]Samozřejmě, že hráči, kteří otvírají max. 20 provincií jsou nadšení, ale kdo byl zvyklý dělat podstatně víc provincií, tak je na tom teď hůř. Navíc dřív jsem zvládala turnaj jen s Fénixem a nepotřebovala jsem žádné podpůrné budovy. Teď, když budu chtít udělat slušný výsledek, tak to bez podpůrných budov nejde."}, {"109": "@Trumpetka v jednom ze svých příspěvků jsem shrnul plusy a mínusy nového turnaje v porovnání se starým. Snažil jsem se o co nejobjektivnější přístup. Navíc jsem zde citoval formuli, která je empiricky odvozena hráčem minmax a která dává takřka přesné výsledky, jak velikosti protivníkových jednotek, tak množství výkupu a na něm je vidět, proč města ve vysokých kapitolách budou mít problém.[BR]Systém boje, jako takový, nikdo v zásadě nekritizuje.[BR]Hlavně jde ale o princip a nový mechanismus hraní, kdy Inno sjednotilo všechny hráče do jedné latě, ať jsou ty města rozvinutá nebo ne. V této (ne)logice je zakopaný pes. Navíc náklady na věž a nyní i turnaj jdou exponenciálně nahoru, kdežto růst města je lineární. Pokud toto Inno nezmění, tak je jasné, že to bude muset znamenat kritické komentáře hráčů."}, {"3": "@Trumpetka bohužel, tentokrát jsi mimo, kamaráde. A jak píší kolegové nade mnou, ty jejich stížnosti jsou opravdu opodstatněné a ty diskuze trvají už měsíce"}, {"112": "Nu, vážení hráči W, zachovám si svůj úhel pohledu na věc.[BR]Než se objevila Věž, tak výsledky v turnajích byly mnohem nižší. Se změnou se od Inno objevila spousta vychytávek (pravidelný přísun z Akademie, Věže, akcí - stromečky, zbrojíře, oddíly až pluky jednotek, hromady urychlovačů), jejichž množství není malé, používali jste je druhotně i pro turnaje, a evidentně jste si na to zvykli.[BR]Připustit, že by to tak nemělo být dále, asi nehodláte.[BR]@ prchlik - je to stejný vzorec, na který mě nasměrovala Ludi, kdysi na něj někdo dal link do jiného vlákna[BR]@ Ludi - výzkumem, ať se každý žene, jak chce. To jsem nijak nenapadal. Jen jsem komentoval, že takový hráč nemá automaticky právo na maximalizaci zisků z turnaje jen kvůli velikosti a počtu teoreticky otevřených provincií. Kouknul jsem na pár větších hráčů na A, kteří dříve dlouhodobě dávali pěkné turnajové výsledky, a u některých je stav divů hodně špatný.[BR]@ Pauleo - 20 provincií je můj případ, správně [smilie--sprite2] . Je to max mých otevřených ocelových provincií. Dříve jsem si na ně musel brát stromečky nebo končil s polovinou bodů. Nyní bych bez manuálu dopadl stejně, ale nový systém mi za pomoci nakrmeného Ohniváka (40%) dovolil přes manuál uhrát více (náklady = 30 min každý večer). V bojích mi pomohla změna, že je proti vždy 5 jednotek - nějak se lépe orientuju, zda to dám či nedám. Na dřevo mám odemčeno 25 provincií a nemyslím si, že by měl být problém uhrát všechny. A tím se dostávám k jádru pudla - 25 až 30 provincií se tady často uvádí jako herní limit a problém. Ale to je 6750b resp. 8100b. Kdo to pravidelně hraje a kde je použití stromečků a zbrojířů? Koukněte na výsledky dřívějších turnajů od druhých stránek.[BR]Exponenciální růst velikosti oddílu - zopakuji se: Nechtějte plošné změny bez více proměnných. Uvádíte jen, kde jste biti, ale nikde to, co vám daná (a předchozí) kapitoly umožňují za vychytávky a zda je vůbec využíváte.[BR][BR]a doplním - hodně hráčů uvádělo, že napálili max provincií na dvě hvězdy kvůli VB a dále to s ohledem na náklady neřešili.. můžou se nyní snažit uhrát páte hvězdy [smilie--sprite2], tam je od desáté provincie VB o jeden víc[BR][BR]// Příspěvky sloučeny. Jumala"}, {"59": "Trumpetka >> Stromky byly získatelné snad už od dob, co se dalo remeslničit v akademii. Zbrojíř přišel s věží, ale zase komu padne, sám Emhyr tu hlásil, že mu někdy i měsíc nepadne. A další věc je, že stále s věží přibyly i nároky na věž, pokud jí dotyčný chce hrát. Urychlovače jsou, ale když chceš hrát věž až do konce, abys zvýšila šance na odměny (protože většinou padají jen portály), tak jich nemálo vypotřebuješ, protože ne každému vychází nastavený čas na uhrátí první věže bez urychlení. Jinak to jsme asi každý hráli jiný turnaj, protože zrovna ocelový turnaj vyžadoval jeden druh jednotky s dalšíma dvěma doplňujícíma podle kapitoly, které navíc byly od určité fáze hry celkem neomylné (stačilo natrénovat správný druh jednotek, a podle kapitoly přizpůsobit jednotkám ze cvičiště a tábora), takže moc nechápu, proč bych na manuál i v nižší kapitole do 20 provincie neměl uhrát turnaj dál nebo stejně jak v druhé věži. Jinak s tou pátou hvězdou to bylo myšleno tak, že když někdo nemá čas odehrát jedno kolo, tak často končil ve čtvrtém kole (když neměl vytuněný časový skok), takže to páté kolo prostě neodehrál (takže ani v druhé věži by nedostal odměny, a ještě by v druhém kole nahrál v pozdější kapitole míň), takže to že ho prostě musí odehrát není řešením. Když příležitost měl, odehrál páté i v turnaji."}, {"109": "@Trumpetka sám jsem do tohoto vlákna daný vzorec uvedl a také jsem v tomto vlákně na něj dal odkaz.[BR]Mimochodem když porovnám ocelový turnaj ve starém a novém formátu, tak musím konstatovat následující.[BR]Ve starém formátu jsem jel na 30provincií, z toho prvních 25 na 6* a zbytek na 5*. Na turnaj jsem se mohl připravit, protože se vědělo, jaký turnaj budeme hrát a jaké budou jednotky. Připravil jsem si na turnaj stromečky JVJ a OS. Takřka vše přes boj, kombinace automat, manuál v poměru asi 80% automat. Samozřejmě klikačka jak hrom. Doplňování jednotek se dalo ustát bez hnědáka. Na další kolo jsem dochystal dostatečné množství.[BR]V novém formátu jsem sice uhrál také 25 na 6*, ale zbytek už jen na 2* s jednou výjimkou na 3*. V novém formátu už musel na řadu přijít také výkup, což jsem ve starém nemusel nebo zcela výjimečně. Doplňování jednotek absolutně nestíhalo, musel jsem krmit medvěda, abych měl jakštakš jednotky na další kolo, ani nová pomoc, že trénuji ve 3 frontách najednou nepomáhá. Na 6.kolo jsem stejně od 15 provincie již jednotky neměl.[BR]Navíc ztratily smysl dvě stromečkové budovy a to OS a VMN. Tím, že jsou primárně určeny pouze a jenom pro jeden typ jednotek, tak ztratili kus ze své hodnoty, protože jednotky chodí náhodně. Nyní v ocelovém turnaji bylo aspoň 15% bojů, kde nebyl ani jeden mág a těžkooděnec. To se ve starém turnaji nestalo.[BR]Samozřejmě, že uvádím, kde jsme biti, ale uvádím to i s konkrétními fakty a jasnou identifikací problému.[BR]A je mi také jasné, že Inno chtělo hráče připravit o přísun VB.[BR]V podstatě je zde pouze jediná věc, po které voláme. Najít rozumnou míru rovnováhy v novém turnaji tak, aby každé vylepšení skutečně přinášelo plus a pokud si tuním město, tak musím být schopen nahrát víc bodů, jak město s nižším stupněm vývoje. A to je to, co je nyní vážně narušeno a co se hráčům nelíbí, protože Inno v podstatě řeklo, každému stačí 10-20 provincií a kdo chce hrát více tak tvrdě zaplať."}, {"2": "Tak všechno co je ve věži a v řemeslné výrobě tu už bylo.[BR]Dalo se to získat v eventech jako odměny, následně věci jako vojensky podpůrné budovy a podobně byli z eventů odebrány a stali se součástí nove zavedené řemeslné výroby."}, {"11": "střelnice, vylepšení jednotek, zbrojíř apod někdy byly v eventech ? Už si nevybavuju."}, {"59": "Zbrojíř ne, ale ostatní v událostech jako denní odměny skutečně pamatuji, pak byly přesunuty do akademie."}, {"11": "fakt si nevybavuju, takže občas jeden za čas, ted se mi jich sejde i deset.[BR]I urychlovače šli v minulosti získat, pamatuju jak byli hráči nadšení z 20hod a 10hod z DS.  A k tomu pár VB. Dneska mám urychlovačů na asi 4k hodin, ani nevím co s nima."}, {"38": "@voyager-1  tady to myslím začalo ty 2x2 budovy - 4.12. 2017 - 8.den [smilie--sprite8] [BR][BR][BR][BR]Trp.zbrojíř myslím jen ve Věži."}, {"112": "Pauleo napsal/a:\t\t\tStromky byly získatelné snad už od dob, co se dalo remeslničit v akademii.\t\tKlikněte zde pro zvětšení...voyager-1 napsal/a:\t\t\tfakt si nevybavuju, takže občas jeden za čas, ted se mi jich sejde i deset.\t\tKlikněte zde pro zvětšení...BiggJOEcz napsal/a:\t\t\ttady to myslím začalo ty 2x2 budovy - 4.12. 2017 - 8.den [smilie--sprite8]Klikněte zde pro zvětšení...Je to tak - po přesunutí budov do Akademie se JVJ vylíhlo 1x za měsíc. 8 turnajů hrál člověk naholo, pak se jednou rozšoupl.[BR]Navýšení výskytu v Akademii bylo avizováno ve změnách jako příprava na drsné časy. Jenže než se to promlelo na Betě a zavedlo v u nás do ostré verze, tak jste si všichni zvykli to brát jako samozřejmost k extra výkonům."}, {"68": "@Trumpetka já to teda nikdy nebrala jako samozřejmost. Tyto budovy jsem nikdy nevyužívala...Možná sem tam na prachový...Ale jinak jsem si vždy vystačila s Ohnivým fénixem. I když běžně dělám 20 provi, na 5*, tak se to nějak dá. Ale je znát, že ty ztráty jsou a nehledě nad 6 provi je znát vysoký úbytek oddílu, který mi kdysi stačil až do otevření 50-60 provi, které jsem sem tam jela(hodně výjimečně)... Teď po nové změně bych měla velký problém se tam dostat. A abych měnila strategii a vykupovala za suroviny, které sice mám dostatek, ale proč je tam cpát....To i Věž jedu bez surovin, pokud tam není komplikovaný boj....[BR][BR]Jak se říká jsme biti za to, že chtěli ulehčit nižším hráčům, aby měli možnost se umístit ( I když v mém případě a jiných hráčů jsem jela na více bodu už v nižších kapitolách)..... Ale jednou i oni dojedou na konec a budou velice překvapeni jaká je skutečná realita.....[BR][BR]v novém turnaji vidím pouze 2 výhody :  - Sloučení 4 bojů do jednoho a [BR]                                                                 - možnost výcvik vojáků bez sdílené fronty [BR][BR]Nejspíš si časem zvykneme na tento turnaj. Ale bude to pro mě velmi s velkým odporem to hrát...."}, {"59": "aikomi: Já spíš obdivuji hráče, kteří si s odporem zvyknou."}, {"2": "Ano, zbrojíř a džin před věží nebyli, ale je to jen varianta na již existující budovy.[BR]opravdová novinka je jen set mesíční knihovny a ten doufám ještě budou řešit"}, {"3": "Trumpetka napsal/a:\t\t\t@ Ludi - výzkumem, ať se každý žene, jak chce. To jsem nijak nenapadal. Jen jsem komentoval, že takový hráč nemá automaticky právo na maximalizaci zisků z turnaje jen kvůli velikosti a počtu teoreticky otevřených provincií.\t\tKlikněte zde pro zvětšení...jenže zapomínáš na to, že ať už se někdo žene, nebo ne, na ten konec se stejně dostane. A na ty změny se prostě není jak připravit, protože obtížnost roste mnohem rychleji, než možnosti měst. To je podstata problému! A na to si všichni hlavně stěžujeme (ostatní jsou jen nepříjemné nepohodlnosti)"}, {"2": "Podle mě je problém, že připravované změny jsou často uvedeny s komentářem, který mi připadá zavádějící.[BR]Nebo jsi vyzván k volbě, která nemá na hru dopad.[BR][BR]Když zaváděli nové bojové jednotky, tak jsme se docela načekali, jeden z důvodů bylo, že do hry přijde jednotka se schopností přeletět překážku a to je velmi náročné - ftipné je, že nic takového není.[BR]Když měnili bojový systém, bylo to proto, že ten starý byl nepochopitelný a chtěli ho zjednodušit - tohle jsem jen těžko mohl brát vážně, protože jsem ho chápal velmi dobře, tady je ta ftipná část, že ten zavedený systém pro zjednodušení ve věži nikdy nebyl a ted to zrušili i pro turnaj.[BR]Na betě ted probíhá event s novým systémem získávání odměn s komnetářem, že bude startegie hrát větší roli, než dřív. Podle mě je to složitější způsob jak utratit sbírané fufníky, ale jeslti na odkrytém poli najdeš odměnu a co z ní případně získáš je stále jen náhoda.[BR]Krom toho rozdělili získávání hlavních a denních odměn, takže celkový přínos eventu pro město je snížený.[BR][BR]A k těm volbám.[BR]Nevím jeslti to ve hře ještě je, ale když jsem začínal, dostal jsem zásadní otázku, jeslti chci hrát hru vojensky nebo ekonomicky.[BR]Bral jsem to dost vážně a nad odpovědí se zamyslel.[BR]Teď mám dojem, že jsem ze sebe udělal blbce, protože ta otázka neměla žádný dopad a ve hře tuhle volbu prostě nemám.[BR]Je tu určitá volba co se divů týče, ale i ty jsou někdy nevyhraněné a jejich efekt má dopad na obě stránky hry.[BR]Ale to je všechno, kasárna jsou povinná, zbrojnice potřebuješ na orky, takže možnost nepostavit vojenské budovy a místo nich zvednout produkci přistavěním manufaktur je dost omezená.[BR][BR]Připadá mi tedy že opravdové pohnutky Inna neznáme a můžeme se jen dohadovat.[BR][BR]Ale když tu budeme dost chestit řetězy, třeba si to někdo zapíše a použije to až na nás přijdou s příští lumpárnou."}]