[{"3": "GorGlin napsal/a:\t\t\tfufníky\t\tKlikněte zde pro zvětšení...Mrakoši?"}, {"59": "Sliby jsou jedna věc, to co nebylo splněno již od začátku druhá, ale zde se nejspíš jedná o lumpárny zavedené až během dávno zaběhlé hry, které se hráči roky přizpůsobují."}, {"2": "Emhyr var Emreis II napsal/a:\t\t\tMrakoši?\t\tKlikněte zde pro zvětšení...No, to co dostáváš za ukoly a sbíráš kolem města.[BR]Ted jsou to magické ingredience, děti tomu říkají batoh s netopírem."}, {"3": "GorGlin napsal/a:\t\t\tNo, to co dostáváš za ukoly a sbíráš kolem města.[BR]Ted jsou to magické ingredience, děti tomu říkají batoh s netopírem.\t\tKlikněte zde pro zvětšení...to byl jen výstřel na slepo. Myslel jsem, že používáš Mrakoplašův termín z knížky Poslední kontinent od Terryho Pratchetta [smilie--sprite1][BR][BR]sorry za OT, už končím"}, {"2": "Ano, řešme turnaj.[BR]Trochu se potýkám s tou Donyho tabulkou z první stránky.[BR]Rozložení jednotek ve střetech.[BR]Základní suroviny mají jednu dominantní jednotku.[BR]Vzácné suroviny jsou vždy kombinace dvou jednotek aby to odpovídalo jednotce která proti jedné bonusy má a proti druhé ne.[BR]Magické už mají dominantní tři a je to už úplně zmatlaný.[BR]Jsem si vědom že náhodnost přítomnosti jednotek způsobí že příprava v původním slova smyslu není možná, ale když se zaměříte na ty dominantní jednotky, co by jste na to nasadili?"}, {"105": "@GorGlin - Na jakoukoliv kombinaci soupeřů je universální lék - výkup  [smilie--sprite2] . Ale vážně - takhle globálně to nelze říct. Tam, kde uspěješ třeba s 5x lehký střelec v 10. provincii, tak už ti stejná kombinace nepřátel v 25. provincii ty střelce díky přesile klidně zruší. Zkušení bojovníci z bety a EN fóra psali, že převážně používáš jednotky na dálku ( lehký a obrněný střelec a mág ). V prvních dvou turnajích jsem si s tím poradil, přičemž jsem občas vypustil i psy nebo barbary. Uvidíme dál. Je potřeba si to ošahat všechno. Ale zatím trénuju jen výše uvedené a pár těžkooděnců mám v záloze."}, {"109": "GorGlin ono se to krom základních surovin velmi těžce určuje, protože jsou ještě drobné rozdíly mezi jednotkami. Všechny typy mají tři varianty. Každá je účinná proti někomu jinému a vždy záleží, jaké jednotky budou mít převahu.[BR]Dobrým vodítkem by pro tebe mohl být příspěvek Porovnání jednotek a jejich využití při bojích od @BiggJOEcz ."}, {"2": "Já vím že to obecně říst nejde, ale zeptal jsme se, jestli třeby někopho nenapadlo něco jiného než mě.[BR]Nechce se mi lidem v cechu psát, bojujte dokud budete mít přesilu.[BR]Nebo jim dávat tabulku."}, {"26": "Až doposud jsem se zdržoval komentářů ke změně v turnaji, ale dnešní začátek, kdy ani první boj v první provincii, která je ze všech nejjednodušší nešel vyhrát bez ztráty jednotek mluví za vše.. První kolo mám 16 provincií s nakrmeným ohnivákem a ztrát více než za kompletních 10provincií v mramoru nebo oceli.. Děsím se co přijde dále..."}, {"158": "prchlik napsal/a:@ElfNostradamus,  hráč minmax(aspoň doufám, že se tak označuje), odvodil následující rovnici pro výpočet.[BR][BR]Červeně označené jsou proměnné, které ovlivňují výkup nebo velikost soupeřova oddílu, s tímto významem[BR]maxB – maximum odemčených procent T1/T2/T3 vylepšeného zbožíM – celkové číslo odemčených povinných výzkumůA – celkové číslo úrovni divůV – počet umístěných neprémiových rozšíření (včetně úvodních 6)P – počet umístěných prémiových rozšíření.Jeho výpočty s jakousi zaokrouhlovací chybou sedí.[BR]Odkaz zde.\t\tKlikněte zde pro zvětšení...Dnes na mě po delší době vyběhla výhodná nabídka 100% k nákupu .[BR]Nicméně vzhledem k tomu, že si za  kupuju \"výhradně\" jen rozšíření, tak další nákup už asi nebude [smilie--sprite8][BR]Přece si nebudu zvyšovat \"P\" a dělat si tak hru těžší..."}, {"16": "@karhol Za to nejspíše můžou Mlžné chodkyně. Vypadají jako Dryády, ale mají větší bonus proti mágům, nejvyšší iniciativu ve hře a kombinace jejich pohybu, dostřelu a iniciativy jim umožňuje střílet jako první a způsobit ztráty téměř vždy (až na pár výjimek jako je terén omezující jim pohyb).[BR]Jakmile se Mlžné chodkyně objeví mezi nepřáteli, jsou ztráty v 99% případů zaručeny. [BR]A můžeš si domyslet, co asi tak udělají s armádou, pokud budou mít dvoj či trojnásobnou přesilu."}, {"26": "Ano, mlžné chodkyně to je ono.. Ty nesnáším už hodně dlouho. Ta stačí jedna mezi čtyřmi těžkooděnci a zdecimuje většinu mágů, kteří jsou na těžkooděnce téměř dokonalí."}, {"11": "tak na 4 TO a chodkyni bych určitě nasadil dryády a ne mágy. A chodkyně si jednou vystřelí proti rovnocenný jednotce  a je po ní. Proti mágům je silná."}, {"2": "Jak říká voyager[BR]Ano, kdyby tam byl nějaký kamenochod, nebo podobně, tak to trochu mění situaci, ale takhle jsou libovolní střelci vždycky lepší."}, {"38": "Kombinace Mlžných chodkyň a těžkooděnců je téměř vždy vražedná. tady je lépe výkup. Když ale se musí bojovat, tak nasaďte Orka Stratéga a nejlépe manuální boj. Se Stratégem díky  většímu pohybu(3)  než mají těžkooděnci(2) a větším dostřelem se zvládne těžkooděncům chvíli vyhýbat a má +80% bonus k obraně proti Mlžným chodkyním. [BR][BR]btw..co se týče vlivu větší iniciativy jednotlivých jednotek pro boj, tak se to bere v úvahu jen pro dané skupiny jednotek, nikoliv různých skupin:[BR][BR]Iniciativa skupin spojeneckých jednotek od nejpomalejších:[BR]* (1-4)   Těžkooděnci[BR]* (5-8)    Obrnění střelci[BR]* (9-12)   Lehkooděnci [BR]* (13-16)  Mágové[BR]* ( 17-20)  Lučištníci[BR][BR][BR]Iniciativa skupin nepřátelských jednotek od nejpomalejších:[BR]* (1-3)   Těžkooděnci[BR]* (4-6)    Obrnění střelci[BR]* (7-11)   Lehkooděnci [BR]* (12-15)  Mágové[BR]* ( 17-21)  Lučištníci[BR][BR]U ostatních nepřátelských jednotek v rámci skupiny máme možnost nasadit jednotky ze stejné skupiny s vyšší iniciativou, ale jen jediná jednotka je OP, a to právě ta Mlžná chodkyně. A jak už mnohokrát psal Lovec,...hraje vždy první a u těchto soubojů je třeba hodně zvážit, jestli vykoupit či ne. "}, {"16": "Nejlepší na výkupech je to, že skoro vždy, když zvažuji výkup to po mně chce pár milionů mincí (jako by nestačila věž), takže v tom okamžiku výkup padá ze stolu (alespoň u mne)."}, {"2": "A když tam nejsou mince, tak aspoň živoucí zboží kterého je celoserverovi nedostatek[BR]Když jsem koukal na ty obrázky, tak my vycházelo, že jsou turnaje nastavené na obě orčí jednotky.[BR]Opravdu špatný vtip"}, {"38": "Vždy jsou alternativy, ale ti Orkové jsou prostě dobří a houževnatí. [smilie--sprite1]"}, {"3": "GorGlin napsal/a:\t\t\tA když tam nejsou mince, tak aspoň živoucí zboží kterého je celoserverovi nedostatek[BR]Když jsem koukal na ty obrázky, tak my vycházelo, že jsou turnaje nastavené na obě orčí jednotky.[BR]Opravdu špatný vtip\t\tKlikněte zde pro zvětšení...co je to za žvást? Zbytečný flame... Turnaje živoucí nechtějí [smilie--sprite2][BR][BR]jinak, mě osobně nejvíc štve to požadované množství orků na výkupy. Mám pocit, že když se chcu vyhnout boji, tak ork je tam minimálně v 50 % případů"}, {"2": "Tak to se omlouvám, já jsem měl pocit že jsem ho tam viděl."}]