[{"3": "bylo to i v oznámení před změnou. Požadavky končí manou. Ani semínka nebudou třeba, protože ty další věci už odčerpává ve velkém věž [smilie--sprite1]"}, {"16": "@GorGlin To sis spletl s věží, tam prošlé zboží je. Což bude asi tím, že nám z turnaje udělali (téměř) druhou věž.[BR][BR]@Emhyr var Emreis II To bude tím, že buď platí Murphyho zákon (zákon schválnosti - jsou tam když je nejméně potřebuješ) anebo konspirační teorie (udělali to schválně). První možnost je rozhodně jednodušší na programování (stačí obyčejná náhoda)."}, {"3": "mi je jasné, že je to náhoda. Nicméně teď na třetí hvězdu jsem vykupoval jedinou provincii a co tam po mě nechtěli, že? [smilie--sprite8]"}, {"20": "Abych řekla pravdu, přes značné usnadnění, že místo 4 střetů je jeden, mě celý turnaj už tak nebaví jako dřív. Mám surek spoustu, ale zvažovat jestli zaplatím nebo budu bojovat? To jsem dřív neznala. Turnaj je přeci od toho, že ho bojuji. A jelikož některé střety jsou proti moc velké přesile, tak možnost rozumného boje padá. Ve starém turnaji mě bavilo, že jsem nepřátelům v boji pěkně nakopala pr... , člověku se tak trochu ulevilo od reálného života. A teď? Prostě to není taková zábava jako dřív. Alespoň pro mě ne."}, {"16": "@Ludi Mně by ani nevadilo, kdybych to mohl vykupovat za suroviny, ale poslední dobou pokaždé, když uvažuji nad výkupem, tak to po mně jako naschvál chce mince nebo kladiva zrovna zdecimované věží.[BR]Pro představu: Aktuálně mám otevřených 25 provincií (1-22 mám hotovo na 4*, 23 na 1*, 24 na 2* a 25 na 0*)[BR]Z toho mám:[BR]5x výkup za mince (21,4M mincí (kapacita sídla 54M))[BR]8x výkup za kladiva (3,99M kladiv (kapacita sídla 5,4M)[BR]14x výkup za T1 (829 000)[BR]16x výkup za T2 (931000)[BR]17x výkup za T3 (519000)[BR]5x výkup za orky (max. střet 13, přesto 37900 orků), (produkce 1 zbrojnice 1600/12h, všech 12 pak 19200/12h, neboli 38400/den)[BR]4x výkup za manu (327000)[BR]8x výkup pouze na T1/T2/T3[BR]12x výkup, kde to po mně chce mince nebo kladiva (1 chtěl obojí).[BR]Takže pokud nechci platit mincemi a kladivy, tak je výkup dost omezený, pokud nechci (nebo nemůžu) platit ani manou nebo orky, tak můžu vykoupit max. 1/3 střetů."}, {"110": "Ahoj. [BR]Jak tak pročítám poslední zprávu od Lovce Krys, tak si v budoucnu v turnaji vůbec neškrtnu, hru jsem pojal tak, že chci projít veškerým výzkumem, a to i u zcela zbytečných prastarých divů. [BR]Vážně nezbývá než doufat, že s tím turnajem vývojáři ještě pohnou. Už teď v orcích (a na mobilní aplikaci) začínám mít velké problémy. [BR]Ryny"}, {"2": "Nadcházející rasa také bude mít docela spotřebu."}, {"105": "Po zkušenostech s dva a půl turnajem v novém systému musím konstatovat, že je to mnohem horší. Z 22 provincií jich 9 vykupuji ( dříve 0 nebo pouze několik střetů ), což mě stojí kolem 40-50K surek za kolo, tedy 240-300k za turnaj. Moje produkce je 210k za týden, takže se pohybuji na hraně udržitelnosti. Naopak já jsem vždy vděčný za mince a kladiva ve výkupu - bo těch mám habafuk. Kritizované bezmyšlenkovité klikání na vojáčky se změnilo na bezmyšlenkovité klikání na výkup. Jediné pozitivum je, že mi jedno kolo turnaje zabere 4 minuty času toho bezmyšlenkovitého klikání. Radost z bojování je pryč."}, {"112": "Je to paráda! Ani třetí turnajový pokus mě nezklamal. Nastavení jsem měl od začátku laděno na boj a změny v turnajích mi umožnily toho naplno využít. Dříve to byla nuda. Zároveň mě to přinutilo se zahloubat nad tím, zda turnaje doopravdy umím a jestli skutečně naplno využívám k turnajům to, co mi hra nabízí. A tady moje ego dostalo na frak. Ale už na tom makám a chybky odstraňuji! Poprvé jsem cíleně využil i Wiki. Děkuji!"}, {"10": "Turnaj zatím dobrý, turnajový průměr 4074 bodů ze třech, dokonce jsem urval po 1/2 roce zase nějaké body. Dlouhodobý průměr mám 3356, takže zlepšení [smilie--sprite1]. Dokonce jsem i po celé tři turnaje něco vykoupil, protože to bylo výhodnější. To jsem dřív nedělal, ale asi se mi to někdy i vyplatí. Za mě s turnajem spokojenost, ve spolku jsme dali 11,12 a nyní i 13 truhliček. Máme tedy stoupající tendenci.[BR]Styl hraní jsem přesunul na 99,9% do ručního, staré turnaje jsem hrál jen na automat a jednotky vymlácené, nyní mi i zbývají.[BR]Poslední turnaj jsem jen jednou nakrmil fenixe a zbytek domlátil bez berliček (2400 b), mám šest zbrojnic.[BR]Já to vidím jako pozitivní změnu. KR přibývají, ještě by to chtělo doladit, třeba za 15-tou další plánek navíc."}, {"3": "jsem rád, že je alespoň někdo spokojený"}, {"11": "většina menších či středních hráčů je spokojena. Menší spol. ted dosahují lepších výsledků. Spol. co jentaktak daly 10 truhel, nyní dělají 12 i více. A to byl možná i záměr."}, {"3": "ale nevím, proč by se tomu mělo říkat turnaj. Přejmenoval bych to třeba na sraz důchodců nebo procházku po parku. Všichni nahrají stejně. Hra ztratila jeden ze svých výrazných nosných prvků..."}, {"11": "Nevím jestli nahrajou všichni stejně. Nahraj 15k jako vítěz posledního turnaje.[BR][BR]a na A dokonce přes 20k"}, {"16": "15K jsem schopen v novém turnaji nahrát taky. Jen cena je příliš vysoká a neudržitelná (kvanta urychlovačů a podpůrných budov). Dá se snížit ručním bojem, ale já nepatřím mezi ty, kteří jsou nadšení, že mohou novým turnajem trávit násobky času než tím starým (tak po dvou turnajích ručního boje bych nejspíše smazal město včetně všech nenahraditelných budov a divů)."}, {"3": "voyager-1 napsal/a:\t\t\tNevím jestli nahrajou všichni stejně. Nahraj 15k jako vítěz posledního turnaje.\t\tKlikněte zde pro zvětšení...v ocelovém jsem dal někde mezi 13 a 14K, ale za jakou cenu? [smilie--sprite3]"}, {"105": "Ano, jistě se najde pár hráčů, kteří jsou schopni dát občas +10k bodů, ale jde vidět, třeba u nás ve spolku, že se výkony pěkně zprůměrovaly mezi 3000 a 5000 body. Takže to chce spolek aktivních hráčů ( jedno jestli malých či velkých ) a 10 truhel je už ve čtvrtek. To je jediné plus turnaje. Jinak souhlas s tím, že ona fáze příprav na turnaj je fuč. Zbylo pouhé vyrábění co nejvíce armády jedno čeho a starost, jestli bude dost surovin na výkupy."}, {"68": "voyager-1 napsal/a:\t\t\tvětšina menších či středních hráčů je spokojena. Menší spol. ted dosahují lepších výsledků. Spol. co jentaktak daly 10 truhel, nyní dělají 12 i více. A to byl možná i záměr.\t\tKlikněte zde pro zvětšení...Nad tímto se musím trošku pousmát. Jen tak tak uhrát 10 truhel? Tak tohle se dalo uhrát normálně ve starém systému, to že někteří asi neuměli hrát, nebo se nechtěli zdržovat klikaním. Tak takovým můžeme poděkovat, že teď turnaje pro nás (ačkoliv se dají uhrát) zbytečně náročné. [BR]Ale pozitivní jednou bude, až oni dojdou na konec a bude to pro ně čim dal tím náročnější, živoucí, mana, seminka, a tak podobně..."}, {"11": "plno spolků dávalo 10 truhel s odřenýma ušima a ted je dávají v pohodě. Stačí si projet spolky na Elvenstats. Snad všichni mají nárůst. Já na malým světě kde jsem dával 2-3k ted bez problémů dám vojensky 5-6k. V hlavním městě na W kde jsem dával až 17k, tam jsem samozřejmě bitej."}, {"38": "@voyager-1  můj názor na to, že je teď větší bodový nárůst  v turnajích, je takový, že se drtivá většina hráčů \"seznamuje\" se změnami v turnaji a zkouší , kde budou jejich bodové hranice... a myslím si, že to ještě cca přes měsíc potrvá.  na druhou stranu..10.truhel na Arendylu zvládalo uhrát už začátkem roku cca 30.společenství. V půlce roku už to bylo mezi 40-50.společenstvími. Teď se to pohybuje okolo 70.společenstev.[BR]Uvidíme časem, až se ta hladina hledání uklidní. Ale většině to otevřelo ta spodní vrátka těm, pro které to dříve bylo nemožné a zavřelo těm třeba 10%, co dávali 6000+ stabilně. Takže pokud řekněme 40% se teď vytáhlo zespod žebříčku a 10% polevilo ze shora, tak je jasný, že turnaje a 10.truhel už spíše nebude problémem. A to je myslím také dobře. Jen to, co provedli těm, co turnajům roky přizpůsobovali města, divy, VB, čas... Těm zavřeli dveře...a dali jim najevo, že herní snaha se může kdykoliv trestat."}]