[{"45": "...osobne som nikdy zmenu turnaja neziadal, turnaj som bral ako vacsina, cize zisk odmien, hlavne VB. Ja som typ hraca, co sa vzdy prisposobi. Stary system som nemal v oblube hlavne koli klikaniu, sem tam som urobil maximum provincii, nahral nieco okolo 20K bodov, ale vacsinou ma klikanie omrzelo velmi skoro a tak som robil svoje minimum, cize 9 provincii na 6lv. a vsetky ostatne na lv.2 a koniec (niekedy aj menej). Zabralo mi to cca 3 hodky...[BR]...v novom turnaji som zvolil minimum na 20 provincii na lv.6. mam ich do 30 minut odklikane (tie idem vzdy automatom) a hotovo. Zvysok turnaja sa uz len hram, zabavam sa s nim, podla toho ako mam chut a cas (nastastie ma osobne manualny boj stale bavi). Prve dva turnaje som urobil hlavne zo zvedavosti na max (fenix+polozene 1 zbrojnik, 1, lesik na zivot a po 2 na strelcov a na magov, resp. v oceli som na magov nepolozil nic). Posledny turnaj som polozil 1 zbrojnika a 1 lesik na zivot a strelcov + fenix, urobil 10K bodov. Prvy turnaj som hral dokopy cca 8h, druhy o nieco menej a posledny dokopy 3h...[BR]...Zaver: Pre mna, mozno ako z mala hracov, je to ulahcenie a spríjemnenie hrania, ak by som isiel na minimum - 20 provincii, tak aj skrátenie casu hrania turnaja (vzdy hram na 0s medzi kolami, takze hned v utorok koniec, resp. niekedy som hral tak, ze som lesiky polozil v piatok alebo sobotu, odohral turnaj, vezu a nasledujuci turnaj a z turnajom som cakal opat dalsich 10 dni, mozno sa postupom casu k tomuto vratim, ak nebude tolko casu alebo chuti). Ked som odohral turnaj na max. tak cas hrania bol cca rovnaky, ako pri klikajucom turnaji, lenze v starom turnaji to bolo klikanie=utrpenie. Ak zahram svoje nove minimum, tak to usetri kopec, casu, resp. za rovnaky cas ako som venoval klikaniu viem teraz uhrat 2x viac bodov...[BR]PS: Som v na konci vyskumu, 298 lv. divov, 133 rozsireni. Potrebne jednotky mam vzdy +999 oddielov. raz za nejaky cas si v pripade potreby naklikam nove. Vezu idem vzdy v nedelu naraz cez casovace a celu bojom. Co sa tyka casovacov, tak momentalne pri ich vyuziti je stale nizsia spotreba ako prisun. Co sa tyka lesikov, tak 2-3 vyrobim za tyzden, zbrojnika mam cca kazdu tretiu vezu (aj preto neocakavam, ze by som kazdy turnaj robil na max. no 10K je realnych, uvidime)..."}, {"44": "Cely novy turnaj je trest pro lidi kteri hre venovaly mraky casu , pokud jses na konci vyzkumu , nejake to rozsireni ,divy a nemas tri medvedy na plose tak muzes akorat skocit sipku do zdi . fakt se nedivim ze lidi uz na to nemaji nervy a konci . [BR]btw 26 provincie : 9M minci,110k prken a 55k drahokamu a nebo si to muzes rozdat 33k vs 65k v boji / 1 tezkoodenec ,2 obr.strelci ,psy a magove/ , tleskam tomu kdo tuhle krav.... vymyslel ."}, {"150": "Se omlouvám, že neumím takové ty vaše hezké odkazy, toť nad mé chápání, jak toho docílit, nevím, ta senilita... chjo.[BR]Tedy pouze takto prachobyčejně:[BR]Lovec: se snažím udržovat počty všech druhů relikvií na stejné úrovni. Magickou výrobu naprosto nepotřebuji, vyrábím pouze při DS na kouzelnické propriety (hůlka? - nejsem si jist). A používám jen při událostech, když je potřeba vyrobit hafo nějakého zboží. Asi jako většina hráčů, ne? Neb mám všeho furt dost, no. Promiň.[BR]prchlik: dovolím si plknout, že jsem si mimochodně nerad zkusil přidat v novém turnaji. A stále musím tvrdit, že nový systém je časově úspornější. A hlavně se při něm nezmírá nudou. Ale je mi jasné, že staříkův dojem je mimo...  Si hlavně hrajme napříč věky, toť perfekt."}, {"11": "@Anthalas   ten střet co tu uvadíš je ale spíš jednoduchej střet. Posílení jednotek samozřejmě nutné, bez toho to už moc nejde.[BR]A tři medvědi opravdu nejsou nutný, stačí jeden nebo dva, nasadit je jednou za turnaj, já je nasazuju ve středu a pomocí urychlovačů si naklikám desítky, stovky jednotek, že po turnaji mám vojsko skoro stejný jako před ním. Nevykupuji.[BR][BR]@tupecpolni  gratulace k vítězství, Tvůj první ?  A pak že to nejde, starci to tady táhnou a mladí fnukaj [smilie--sprite1] [smilie--sprite1]"}, {"16": "@tupecpolni Napiš @ a pak začni psát jméno hráče, ono se ti pak nabídne celé (na české klávesnici se @ píše jako pravý alt + v, na anglické jako shift + 2(neboli ě na české)).[BR]Časově méně to náročné je, pokud hráč nejede ruční boje. 10K s ručními boji to zabere více času než 20K na automat ve starém. (já v novém ještě nejel ani jeden souboj ručně a ani to nemám v úmyslu)."}, {"44": "@voyager-1 jo oni ty medvedi vlastne nejsou potreba [smilie--sprite1] [smilie--sprite1] , turnaj nejde hrat bez ztrat a prave ty dva medvedi co mas ve meste ti dovoli do toho mlejnku nasypat vic jednotek . a jaky je rozdil v tom mit 1 a nebo 2 asi sam znas. [BR]Ty napises ze ten stret je jednoduchy ale i tak prijdes o docela slusny pocet jednotek a ted si ten stret vynasob 50ti . aaaa to uz docela zaboli ze [smilie--sprite1] .[BR]Pokud chces hrat turnaj na 8k+ tak prave pocet jednotek rozhoduje , nekdo si nasetri a pak to vymlati do jednoho turnaje a nekdo hodi tri krmeni a hraje to same kazdy turnaj . A dostavat +0 a nebo +100/150% je kur... rozdil. Jee to by bylo prskani kdyby ten efekt fungoval jen z jednoho medveda.[BR][BR]Ted je tu nova rasa tak jsem zvedav jak se projevi az ji dokoncim , to uz turnaj bude nehratelnej s tim jak rychle jde obtiznost nahoru ne ?[BR][BR]Novy turnaj je paskvil a jedinou lepsi vec co prinesl je mene klikani . Ale tak hlavne ze se mensim mestum ulevilo a uz si muzou krome veze jet zadarmo i turnaj [smilie--sprite1]"}, {"45": "@Lovec Krys neviem ako rychlo si dokazal klikat (mozno som bol pomaly klikac [smilie--sprite1]), ale osobne som zahral na max turnaj aj v starom a aj v novom systeme, kde v novom som siel po 20 provinciu automatom a dalsich cca 90% duelov manualom a zabralo mi to cca rovnaky cas. Na 10K bodov potrebujem cca 3 hodiny cisteho hrania...[BR]PS: novy system ma kopec nedostatkov, aj ja by som bol rad, ak by sa upravili, ale v ziadnom pripade by som si nezelal spat klikaci maraton, to nebola hra a uz vobec nie zabava, skor taka povinnost, ak som chcel rast a napredovat. Teraz po 20-ku je to opat povinnost ale 4x kratsia a potom sa zacina pre mna hra, mam rad vyzvy a nastastie, ako som uz pisal, manual ma zatial bavi a ked som tu naklikam si do mesta co je potreba, a dalej kecam so spoluhracmi o blbostiach a popritom sa hram [smilie--sprite1].."}, {"3": "Anthalas napsal/a:\t\t\ta nekdo hodi tri krmeni a hraje to same kazdy turnaj .\t\tKlikněte zde pro zvětšení...zkusme se nad tím trošku zamyslet. Opravdu jde tohle dělat každý turnaj?[BR][BR]Já mám medvědy dva a krmím je cca co 2-3 měsíce, abych stihl doplnit zásoby.[BR]Jedno krmení mě totiž vyjde asi na 20 kouzel 100% kladívek a asi 250-300 5hodinových urychlovačů.[BR]Tohle opravdu nejde dělat každý týden.[BR]A třeba jen teď křišťálový turnaj, kde jsem zaostal za vítězem (gratuluju - došly mi provincie a víc se mi jich nechtělo vykupovat [smilie--sprite8] ) o cca 1000 bodů, mě stál 650 oddílů luků, 450 oddílů mágů, 300 oddílů těžkooděnců a něco dalších jednotek a stovky tisíc surovin. Tohle opravdu nejde každý týden - medvěd nemedvěd [smilie--sprite2][BR][BR]PS: ano, možná při hře na těch 5-8000 bodů, ale co to je za výsledek?"}, {"44": "@Emhyr var Emreis II a ty tu vyrobu jednotek pouzijes celou na jeden turnaj ? [smilie--sprite1] tezko ze !  Ale vlastne jsi si odpovedel sam . nemit dva medvedy tak nasypes do turnaje 1500 oddilu jednotek ? dost o tom pochybuju . druha vec je ze kdyby jsi mel jednoho tak tech pozehnani a casovacu pouzijes daleko vice na stejny vysledek . Takze i kdyz se snazis presvedcit  jak je strasne drahe zivit medveda , tak jsi vlastne potvrdil ze bez co nejvice medvedu nejde hrat turnaj na slusny vysledek."}, {"45": "@Emhyr var Emreis II , myslim, ze prave o to tvorcom islo, aby max. turnaj bol za max. namahu a nebola to samozrejmost, resp. pri starom systeme vyhral turnaj ten, co mal dostatok casu a provincii, niektore turnaje boli \"zadarmo\" proste kopec VB a inych veci za minimum investicii. Urobilu zmenu, ako som uz pisal, nie dokonalu, ale z mojho pohladu zmenu k lepsiemu [smilie--sprite1]"}, {"3": "@Anthalas já přece netvrdím, že medvědi nepomáhají. Ale tvrdím to, že i přes měedvěd nejde kvůli konečnému množství zásob hrát na plno každý týden. Kdybych to tak hrál, tak jsem do měsíce bez vojáků (a do několika bez surovin) a tak rychle si zásobu na výrobu vojáků pes medvědy nedoplním.[BR][BR]Souhlas, že čím víc medvědů, tím častěji se můžu rozšoupnout. Ale nejde jen o medvědy, ale i o úrovně příslušných divů, které urychlují a navyšují výroby.[BR][BR]ad dva medvědi: však jsem taky musel něco obětovat, abych se k nim dopracoval. Zadarmo to nebylo a ti šílenci, co dali tři (nebo 4), to už je fakt extrém. Ale ono se jim to časem vrátí..."}, {"11": "on má někdo 4. hnědý medvědy?"}, {"19": "Nedávno tu byl odkaz na město hráče tuším z Polska a ten jich měl snad 8 na max."}, {"38": "jj..tento hráč z PL má 5x polárního, 5x Hnědého a 2x Pandu[BR][BR]\t\t\thttps://www.elvenstats.com/player/pl1/441650\t\t[BR]BTW...vytvořil opět nový rekord v turnaji - 31.860b, a to už v prvním novém turnaji mramoru.A laťku nesnižuje ani teď. [smilie--sprite6]"}, {"11": "zvláštní město, k tomu asi 25 zbrojnic a desítky malých zbrojnic, asi 12 rajů m. pannen, vidím jen ojedinělý manuf. i obytky.[BR][BR]jeho spol. udělalo u mramoru 370k bodů"}, {"19": "@BiggJOEcz těch medvědů má 8+8+6 všechny na max"}, {"11": "taky vidím \"jen\" 12"}, {"19": "3 řady po šesti a nad nimi další 4"}, {"11": "nevím,já vidím vpravo, v horní části vedle jehel bouře pět polárních medvědů, pod nima pět hnědých a dvě pandy a nad nima jsou Raje[BR]https://imgur.com/tYLefwH"}, {"19": "Už je to jasný, stejný hráč, jiný server. Můj screen je z PL3."}]