[{"11": "aha, ale ty jsi tam ten screen ještě neměl když jsem reagoval, by mě to trklo [smilie--sprite1]"}, {"15": "Jenom zírám , to je snad úplný ZOO ! Kam se hrabe \"Šest medvědů s Cibulkou \"! [smilie--sprite6]"}, {"10": "Už nějaký spolek dal všechny truhly?[BR]Pokud dobře počítám, je to 160.000 bodů/ tedy 6.400 na jednoho. [smilie--sprite1]"}, {"44": "@showstall Star Wars 1 uhraly dva turnaje na max truhel"}, {"150": "@Lovec Krys Díky moc za radu, to by mne fakt nenapadlo s tím zavináčem. Si to teď užiju [smilie--sprite8][BR]@voyager-1 Díky za gratulaci. A nebylo to poprvé, stihl jsem vyhrát turnaj i nějak krátce před zavedením nového systému, právě abych si oba způsoby mohl sám porovnat. Na obecné hořekování moc nedám, to asi tím mým pokročilým věkem, jak píšeš [smilie--sprite8] Tedy se po vlastní zkušenosti v podstatě mohu podepsat pod příspěvky @citellus. Asi bych možná dodal, že při vyšších provinciích jsem ještě kombinoval ruční boj s výkupem, pokud jsem na první pohled naznal, že by vojcli dostali řádně zabrat. Konečně jsem nějak využil ty nastřádané tuny surovin. Tedy si troufnu opakovat, že nový systém je pro mne skvělý. Časově nesrovnatelně úspornější. A pokud mám zrovna nějakých relikvií výrazně méně, zároveň není žádná hoňka v práci a vykopu děcka z domu - mohu turnajovat do plnejch, aniž bych se obával smrti nudou. Což, nezlobte se, mi ve starém systému skutečně hrozilo [smilie--sprite8][BR]@Emhyr var Emreis II Taktéž děkuji za gratulaci. A vůbec se ti nedivím, to by mne taky mohlo vohrát, bych kvůli turnaji vykupoval nějaké provincie. Ale 5 - 8 tisíc TB já považuji za skvělý a nadprůměrný a výjimečný výsledek, v tom se lišíme, to joo."}, {"89": "Po prvotním rozladění jsem svůj názor na nový systém turnaje radikálně přehodnotil:[BR]1. V turnaji neusiluju o pořadí, ale o maximální počet VB, proto pro mne i tak víc jak 20 provincií moc smyslu nedává, zato potřebuji hrát až do 5. kola právě těch 20. provincií.[BR]2. Ohniváka krmím už před turnajem a použiju pro boj ve věži a pak pro dvě první kola věže.[BR]3. Další tři kola turnaje dávám až v pátek-sobota, opět nakrmený Ohnivák a pokud jsou tak nějaké pomocné háječky/trpajzlíci - ti pak vydrží i pro další věž. [BR]4. V šestém kole turnaje už jen maximálně pozbírám knížky.[BR]6. Nestydím se vykupovat, když je kombinace na boj špatná. [BR]7. Hraju automatem a úspora času je enormní. [BR]Medvěda mám jen jednoho a i toho krmím jen zcela vyjímečně, v pohodě stíhám vojsko vyrábět normálně. Dílny samozřejmě permanentně s kouzlem, ale z turnajů jich mám stovky."}, {"3": "ElfMaGorr napsal/a:\t\t\t1. V turnaji neusiluju o pořadí, ale o maximální počet VB, proto pro mne i tak víc jak 20 provincií moc smyslu nedává, zato potřebuji hrát až do 5. kola právě těch 20. provincií.\t\tKlikněte zde pro zvětšení...to znamená 55 + 66 VB z 10.-20. provincie a k tomu ty šušně z první devítky (cca 69) = 190VB. Hodně slabé proti předchozímu systému, kdy se minimálně v polovině turnajů (za mě 5-6 z 9) dalo nahrát přes 500 VB... To prostě žádné menší přínosy nového systému ani zdaleka nedorovnají [smilie--sprite3]"}, {"77": "To právě kdo si mohl dovolit otevřít třeba 50, 70 a více provincií na danou relikvii a potom je každý turnaj odehrát, tak si nasyslil do zásoby slušné množství kouzel [smilie--sprite2] a nasypal slušné množství VB do divů, já si něco takového dovolit nemohla v nižší kapitole, když jsem tedy v ní měla rozvinuté město vyváženě ve všech směrech a ne jen cíleně v otevření co nejvíce provincií, jak jen bylo možné a ta kapitola sama o sobě měla také určité limity.[BR]Po pravdě přínosem v novém systému je pro mě právě to, že ty rozdíly mezi hráči v nižších a vyšších kapitolách ve výtěžnosti z turnajů už nejsou tak bolestně ohromné a že se mnohem méně kliká a za těmi VB honí na úkor šlach na ruce a času, a že místo věnování se tomu otevřít co nejvíce provincií a namamonit co nejvíce knížek, věnuje se více hře a rozvoji města a turnajové strategii jako takové - vědět jakého přesně vojáka nasadit atd. - což starý systém, kde byly převážně jeden dva typy jednotek na každý turnaj, a to již předem dané a tedy velká nuda, vůbec nenabízel, tak jako ten nový, co nabízí teď, tedy to dříve chybějící gró celého turnaje a vůbec asi i daleko víc rovnější podmínky mezi hráči napříč všemi kapitolami."}, {"3": "pořád nevidím důvod, proč by podmínky pro hráče mezi kapitolami měly být rovné. Však do pozdějších kapitol může postupně dojít každý...[BR][BR]I v práci je přece normální, že zkušení zaměstnanci berou více, než začátečníci..."}, {"16": "@luterina Problém je v tom, že my tu příležitost měli, ty už ji mít nebudeš (pokrok už ti nepomůže k lepším výsledkům jako ve starém systému)"}, {"44": "@Emhyr var Emreis II naprosty souhlas ."}, {"118": "Hraju na mobilu, boj tedy pouze přes automat. Jako velké plus vidím úsporu času v klikání. Oproti minulému systému mi vadí zprumerovani hráčů. Nejsem ještě tak daleko, abych si nepamatovala, jak se turnaj hraje začátečníkům. Nemůžu souhlasit, že pro začátečníky je turnaj těžší. Jediným omezujícím faktorem v tomto období pro mě byl počet provincií. Provincie jsem vždy bojovala všechny na plný počet hvězd. Výkup jsem použila jen výjimečně. Nyní lze vybojovat přes automat plus/mínus deset provincií a zbytek už je možné získat pouze přes výkup. Náklady na výkup, nyní třeba kladívka a od příští kapitoly  počítám i Orlové vidím jako problematické a z dlouhodobého hlediska neudržitelné. Ano, společenství si nyní v počtu beden polepšilo. K té desáté bedně by jsme dospěli asi o měsíc později. Nicméně by to nebylo s vytlucenou armou a bez surek. Bohužel se většina turnaje u boje na automat přesunula do výkupu a kouzlo starého turnaje, kdy se dal celý u bojovat armádou bez toho aby byla celá pobita, tak tenhle turnaj padnul. Jako začátečník jsem se těšila, až budu pokročilejší hráč se všemi benefity, které to přináší, teď když to vidím, říkám si, jestli se vůbec nějaký pokrok vyplatí."}, {"20": "Nový turnaj je výrazná úspora času, ale celkově se mi systém nelíbí. V podstatě jsme dostali mnohé limity. Na počet otevřených provincií, počet divů i dalších věcí. A to se mi opravdu nelíbí. Už mám na nový turnaj svůj systém hry, ale chybí mi ta dřívější svoboda."}, {"104": "@Ladonka pokud vidíš pokrok jen v tom nahrát víc v turnaji resp. získat v turnaji víc benefitů, tak to je mi tě v podsatě líto. Já pokrok vidím především v rozvoji města, v tom dostat se co nejdál, přispět společenství - dojít pro zlato ve věži, vyhrát DS, zvýšit svoje bodové hodnocení, atd.[BR]Já v podstatě nikdy nepoužívám výkup, když vidím problém, tak nechám provincii ležet a beru ostatní, které jsou jasnější. Nemusím udělat pokaždé všechny provincie na 6*, stačí mi v klidu těch 5-8 tisíc, jak to uvedl @tupecpolni . Zdá se, že postupně na to přichází i další hráči jako @ElfMaGorr , že tento systém je lepší. U nás ve společenství nevím o nikom, kdo by chtěl ten původní. Tím nechci říct, že není prostor pro zlepšení, ale na druhou stranu každý by si asi to zlepšení představoval jinak, takže raději ať to zůstane tak, jak to je nyní."}, {"16": "@kasimir Ono se to ale týká i té věže - je tam použit stejný vzorec na velikost jednotek (a nákladů na výkup), takže i věž se postupně zdražuje. Jediný rozdíl je ten, že věž takhle byla už od začátku."}, {"118": "@kasimir , nevím jaký je rozdíl v tom jestli chci dojít nejdál v turnaji, věži, nebo DS. Výsledkem každého přispívám společenství,  ani jedno neupřednostňuji. Mimochodem 5 tisíc rozhodně nedosahuji, přesto ti mě nemusí být líto. O tom, jak vidím pokrok jsem nic nepsala. Ale chápu, že hráč, který nahraje 5-8 tis. si asi už nevzpomíná, jak je každá odměna pro začínající města důležitá."}, {"77": "Větší, pokročilejší město prostě nahraje víc než to menší a méně pokročilé (a to je ta rovnost mezi hráči napříč všemi kapitolami, o které tu hovořím). Tedy nemuseli byste tady strašit města malá, že když si postaví divy a rozšíří město, že na tom budou hůř a cenu postupovat a vyvíjet se, že smysl nemá, ať se netěší, to se nedělá! [smilie--sprite2][smilie--sprite7][smilie--sprite8]"}, {"104": "@Ladonka - přečti si poslední větu u svého předchozího příspěvku. To je o tom pokroku. A co se týká začátků - nehraji zase až tak dlouho - něco málo přes rok - takže si to velmi dobře vzpomínám. A proto mi připadá současný systém výrazně lepší, protože umožňuje dosáhnout na odměny všem - i začínajícím hráčům i menším společenstvím.[BR][BR]@Lovec Krys souhlas. A také se důraz hráčů hodně přesunul z turnaje na věže. Taky na začátku bylo spousta komentářů nad \"nespravedlností\" jak je věž postavena a že není možné udělat všechna 3 patra apod. - a teď je hodně hráčů (já taky), kteří dělají pravidelně věž až do konce. [BR]Ano, po změně v turnaji neplatí původní poučky na elvengames co a jak nasadit a musí se u toho víc myslet. To mně ovšem nevadí. Naopak mě těší, že třeba KR se staly mnohem dostupnější."}, {"3": "víc myslet... chtělo by to znát terén. Byl tu na to hrozně šikovný nápad na zlepšení."}, {"2": "Já řeším problémy co to přineslo do společenství.[BR]Když někdo dřív měl problém, tak to za něj někdo vzal.[BR]když ten problém nebyl na celý týden, otevřel víc provincií a potřebné body získal třeba za tři nebo 4 kola.[BR]znám hráče co turnaj nikdy nehráli na 6 kol, protože odehrát dve kola v jednom dni pro něnebylo možné.[BR]S tím je ted konec.[BR]Menší variabilita hry a stížená spolupráce v cechu.[BR]To mě opravdu mrzí."}]