[{"104": "@GorGlin Tak takhle to fakt nevidím. Zatím jsme ve společenství vždy udělali alespoň 13 truhel a to i když někteří hrají právě jen dva dny - naopak se nám teď stává, že začínají až v pátek a ještě jsou schopni cca 1200 bodů uhrát. A když vypadnou dva (stalo se), tak to taky není poznat - jestli ve 14té truhle dáme 9000 nebo 500 je jedno. A co se týká těch 6 kol - ty jsem hrál snad vždy, prostě jeden den brzy ráno a pozdě večer, třeba klidně v pátek. Ale to samozřejmě záleží na časových možnostech každého, nakonec 6 hvězd není nezbytných, i s 5 se dá bez problémů nahrát 4000 a i když to není na umístění, tak na 10 beden společenství je to dost."}, {"59": "Dle některých příspěvků čím dál více vnímám, že hlavní rozdíl druhé věže a turnaje je v tom, že řada hráčů, kteří jsou aspoň trochu aktivní, získají zřetelně méně, ale hra se je snaží oblafnout tím, že se jim snaží ukázat, že nahráli stejně nebo více, aby byla spokojenost na obou stranách. A úspora času se také logicky dostaví, když jim hra nahrát více ani neumožní, když naopak něco nahrají, čas se podle mě vyrovná, protože vykupovat se nevyplatí, a dost hráčů musí přejít na manuál. Samozřejmě ti, co moc aktivní nejsou, žádný rozdíl ani nevidí, protože možnosti předchozího turnaje nikdy neodehráli (a v poslední době hra otevřela tolik možností, jak se na hru připravit (což bylo také změněno), že nebylo ani možné, aby to i v půlce hry nešlo). Jako jasně, jsou tu i takoví, kteří tu psali, že 65+ provincií v každé nové věži pro ně není ani teď bez manuálu problém.[BR][BR]kasimir >> Nevím o jakých benefitech mluvíš, ale množství odměn jednoznačně souvisí s rozvojem města, teda tak to aspoň platilo dříve, protože veškeré prostředky se daly dle libosti naházet do výzkumu nebo divů (pro ty, které těšilo vylepšovat divy), teď je třeba zvažovat zda se vůbec házet do divů vyplatí, a ještě je jejich zisk značně omezen.[BR][BR]Co se zisku KR týče, těm co měli problém je získávat, je to samozřejmě přáno, ale hra byla už dávno nastavena tak, že např. hybridy se stavět pomalu nevyplácí (jednak jsou slaboučké, a druhak nové kapitoly tuto volbu jednoznačně degradují), a těch budov, které by měly nějaký valný přínos, a vyplatilo se je dlouhodobě vylepšovat, moc není."}, {"20": "Samozřejmě, že nový turnaj si víc chválí hráči, kteří ještě nejsou ve hře tak daleko. Pro méně rozvinuté hráče je teď turnaj snazší. Objevují se námitky, proč by rozvinutí hráči měli získávat o tolik víc v turnaji, než menší hráči, jak tomu bylo ve starém turnaji. Odpověď je jednoduchá: protože i nároky na vše, jsou v posledních kapitolách daleko větší. Mrzí mě, že právě hráči, kteří jsou v poslední kapitole, novým turnajem dostali limit na spoustu věcí. Ráda jsem vylepšovala divy a v pauze mezi kapitolami to byla zábava. Teď už jsem divy stopla (kvůli vzorci velikosti oddílu v boji) a až dokončím kapitolu (ostatně nemám teď vůbec důvod s ní spěchat), tak mi to bude chybět.[BR]Jinak v obou společenstvích (na A i W) hrajeme turnaj naprosto v pohodě, tam problém není. O co mi jde, je právě ten individuální přístup k rozvinutým hráčům, kteří teď mají v mnoha věcech stopku. Pokud se vzorec velikosti oddílu nezmění, tak to jednou poznáte všichni."}, {"59": "No ona je otázka, zda až se tam ti co chválí dovalí, nebude hra opět tak změněná, popř. už bude vše v čase tak zastřeno, že nebudou mít srovnání o co všechno přišli."}, {"77": "My, kteří teprve k nejnovější kapitole směřujeme, poznáme to, že budeme nahrávat stále v turnajích více a více.[BR][BR]A to, že kdysi se v nejvyšších kapitolách (a v nerovnosti napříč všemi kapitolami i v nezvykle nízkých kapitolách) dalo v turnaji nahrát těžký nad limit a nasyslit si a získat mnohem větší množství VB a dalších odměn z turnaje, se pro nás stalo jedině velkou, oproti těm co už nemohou, výhodou - prostě jsme si tehdá slušně našetřili - viz. např. kouzla a relikvie na recepty.[BR]A ani my, co jsme zažili např. nekonečnou řadu úkolů v události a měli možnost získat i několik Ohniváků a Medvědů na turnaje, nejsme jen ve svých městech se sladkou vzpomínkou, ale i proti těm co už toto nemohli a nemohou, jsme získali opět v turnajích velkou výhodu.[BR][BR]Elvenar se prostě vyvíjí a mění, co platilo včera, nemusí platit dnes, zásadní je podle mě ta výzva se s danými podmínkami nejen vyrovnat, ale i je svým způsobem pokořit naší další výhrou a ujmutí se opět té správné a pro nás té nejlepší strategie.[BR]Vylepšování divů jasně převažuje újmu na exponenciálním růstu v turnaji, alespoň tak to vidím já a hodlám si ty, které si dle své strategie vyberu, vylepšovat na jejich maximální úroveň, opravdu se toho nebojím. [smilie--sprite2][smilie--sprite1]"}, {"59": "Pro mě je výzva něco co mě baví a těší, a ne si nechat jen něco diktovat, a snažit se o přijetí, a hrát si na to, že se mi to líbí. Myšleno obecně na onen nový směr hry, ne jen na druhou věž."}, {"16": "luterina napsal/a:\t\t\tMy, kteří teprve k nejnovější kapitole směřujeme, poznáme to, že budeme nahrávat stále v turnajích více a více.\t\tKlikněte zde pro zvětšení...Pokud budeš ten výsledek zvyšovat velmi, velmi pomalu, pak ano.[BR]Jinak dříve nebo později ale narazíš na limity aktuálního systému.[BR]Buď narazíš na tvrdý limit přesily nepřátel anebo na měkký limit nákladů na vytrénování dostatečného množství jednotek (anebo nákladů na vyjednávání). Obojí tvůj růst prostě zastaví.[BR][BR]Tvrdý limit máme všichni stejný: Růst přesily nepřátel není omezen a už někde kolem 30 provincie bojuješ s dvojnásobnou přesilou.[BR]Tento limit se dá  posunout či překonat pouze některými divy (+životy, škody), ručním bojem anebo dočasnými budovami (posilovacími stromky z řemeslné výroby a zbrojíři z věže). U divů na životy a škody narazíš na jejich maximální úroveň, ruční boj zabírá více času než starý systém (a není přístupný v mobilní aplikaci) a posilovacích budov je jen omezený příjem, takže jejich výhod můžeš využít jen v omezeném množství turnajů.[BR][BR]Měkký limit zase negativně ovlivňuje vzájemně se násobící parametry (a je tedy z podstaty exponenciální) - počet výzkumů(povinných), rozšíření a součet úrovní všech divů ve městě. Takže je pouze otázka času, kdy se dostaneš do stadia, kdy náklady na výkup/velikost jednotky rostou rychleji než tvoje produkce a tvoje tvrzení o zvyšujícím se výsledku prostě přestane platit (tvoje náklady prostě porostou rychleji než tvoje trénování/produkce surovin(zejména many a orků, příp. mincí).[BR][BR]Bez vnějšího zásahu (změna výpočtu nákladů/velikosti jednotky nebo nějakých dalších budov typu fénix/medvěd)  nás to čeká všechny, kdo dojdeme dostatečně daleko. Prostě ten výpočet je v jádru špatně (penalizace za pokrok). A dříve nebo později bude zase změněn (jen je otázka, kolik ztracených hráčů to bude stát, než ten výpočet někdo změní)."}, {"112": "Při starém systému beze změn mě hra přestala bavit a její hraní jsem stopnul (začátek roku 2019). Na přelomu 19/20 jsem nakoukl zpět a Věž a její tzv. obtížnost se pro mne stala impulsem. A nyní, když jsem v létě ohlásil herní pauzu, se pro mne test nových turnajů stal opět novou motivací zůstat a hrát.[BR]Taky jsem si asi jako jeden z mála nastudoval ten často omílaný vzorec - a divy levlím jako divý (jak píše luterina - ty, které si pro svou strategii vyberu). Jednoznačně souhlasím s Lovcem, že svůj limit divy mají (škoda a možná jiskřička do budoucna, že Inno v tomto udělá posun - na druhou stranu, kdo z velkých hráčů má ty, které by chtěl, opravdu na max?).[BR]Nemám medvědy (resp. lvl 1), ohnivého fénixe jsem plácal za 2 artefakty jiného na úroveň 8 (nehrál jsem v tu dobu), ale současná hra mě baví.[BR][BR]Turnaje budou nyní více těch, které to baví. Z VB infinito na VB limitováno.[BR]Větší hráč má i nyní vždy navrch nad menším. Ulehčení pro menší je jen v tom, že může na 5-6 provincií protočit autobojem 5-6 hvězd a nemusí ho nikdo upomínat, že nedělá body do spolku. Jakmile se snaží o víc, tak přijde rychle o jednotky a případně i o surky. S kvalitou vyzkoumaných jednotek a dostupných divů toho moc nevybojuje.[BR]Nicméně bude to doba nových fejků (což nikomu kupodivu asi moc nevadí), turnajové hráče bych začal rozlišovat až tak nad 2500-3000 bodů. Inno se bude prezentovat počtem hráčů, fejkaři si VB do divů doplní z pomocných účtů. Brečet zůstanou jen ti, co chtějí letět kapitolama.[BR]Osobně bych VB z turnajů dávno omezil. Nebo je změnil na interní odměny do divů, tj. ani do Výzkumu, ani fejkařit do divu na jiném účtu.[BR]Dle mého by odměny z turnajů měly být vratné do turnaje a hrát tak turnaj pro radost ze hry.[BR]Linearitě násobení velikosti TSSo nicméně nefandím a nerozumím. Právě kvůli limitu rozvoje divů bych rozuměl i limitu na tento faktor. V kombinaci s následnou křivkou zvyšující se velikostí oddílu protivníka bych předpokládal i limit nebo omezení na násobení TSSo.[BR]Vzorec jsem si u sebe detailně odzkoušel a potvrzuji, že je hodně přesný.[BR]Trpajzlík T."}, {"59": "Mě bavila různorodost Elvenaru, takže turnaj byl můj víc, když to byl ještě turnaj, a ne bezduchá kopírka předtím unikátní věže, pracující na stejných principech (ztrácející typiku a logiku vycházející z původních principů Elvenaru), a k tomu ještě zřetelnou stopou po záměru hráče omezit v možnostech na každém kroku nového Elvenaru. To je to co se mi na tom nelíbí, že hra místo aby se obohacovala (a hledala nějaké kreativnější využití zisku bodů z turnajů), postupně redukuje možnosti na jednu jedinou přednastavenou kolej, a zbytek ve hře se postupně mění na loterii, a vytrácí se i \"příběh\" celé hry. Za chvíli už opravdu bude hráč hrát jen sám za sebe, kdy ani nebude moci využít svůj potenciál ve prospěch jiných hráčů, když i to se zakáže (by se kdyby). Řada hráčů si oddechla od klikání, ale že za tím z půlky stál velmi zastaralý systém rozhraní turnajů a výberu jednotek (to už jsem nekolikrát řešil), o tom se nikdo nezmínil. A vůbec si ani nemyslím, že ještě v turnaji byla možnost získávat odměny jen pro hráče na konci hry, hra se za poslední dobu velmi rozšířila, a v době kdy ten na konci hry byl ještě např. v polovině obsahu, zdaleka žádné takové možnosti nebyly."}, {"159": "Pratele, prosim o radu. Zvazuji dodatecne vyzkoumat nepovinne vylepseni jednotek, kvuli vyssi produkci Divu jenz poskytuji jednotky, ale nejsem si jistay zda si tim turnaje neztizim. Puvodne to tak bylo, ted po tech zmenach udajne uz ne, ale moudra z toho teda nejsem. Smilujete se nademnou nekdo a shrnete mi potrebene info at vim, jak se rozhodnout? Moc diky."}, {"2": "Za me to vyzkoumej.[BR]Někde tu byl vzorec na sílu soupeře a já mám 6 divu na jednotky a spočítal jsem to jako lepší."}, {"16": "Nepovinné zvětšení oddílu již nemá na turnaj žádný negativní vliv. (taky jsem je všechny vyzkoumal hned po změně)."}, {"2": "tak jsem ten vzorec našel, poslal ho prchlik 11. října.[BR]A počet velikost oddílu se vůbec nezapočítává.[BR]Ale když jsem se na to ted koukal, tak mě napadlo.[BR]ve výpočtu je bonus na výrobu zboží.[BR]to znemená že divy na produkci platím dvakrát?[BR]jednou jako lvl divů a pdruhé jako bonus na produkci?"}, {"112": "základní vzorec je aktuálně (naposledy kontrolováno v listopadu 2020) tento:[BR]CAL = 0,6887 * (min(maxB,700%)+1) * 1,0045naM * (0,003A+1) * (V+0,66P-4,5)[BR]TSS = 0,1159*CAL[BR]platné pouze pro ty, kteří věří těmto stránkám https://minmaxgame.com/[BR]doporučuji nastudovat, jakékoli diskuze bez znalosti těchto stránek bude zavádějící[BR][BR]CAL, první část se u aktivních hráčů rovnou může brát jako 700%[BR]M znamená, jak daleko jsi ve Výzkumu[BR]A je součet dosažených úrovní ze všech divů[BR]V jsou počet klasických rozšíření[BR]P pak počet dia rozšíření[BR][BR]Osobně se snažím využít na max stávající prostor, a pokud bych dospěl k závěru, že se potřebuju rozšířit, pak za dia z Věže.[BR]Pro divy souhlasím s tím, co avizovali na konci léta ve videu k představení změn v turnajích - mají vliv, ale jejich přínos převažuje.[BR]Dobře si však při znalosti vzorečku rozmyslete, které vážně chcete stavět a levlit. Nezapomínejte, že pro jejich stavbu potřebujete místo a parametr V je Jidáš.[BR][BR]Pro staré hráče to byl šok, nováčci se mohou \"adaptovat\". Zatím jsem nezaregistroval třeba Návrh, aby původní rozšíření V šlo nahradit zakoupeným typem P.[BR]Škoda, hodně starších hráčů, které tyto změny nezlomily a pokračují ve hře, by to možná přivítalo.[BR][BR]Velikost oddílu se při stávajícím systému vyplatí jednoznačně dovyzkoumat, pokud třeba máte div typu Val. Nicméně rozhodně aktuálně neuškodí (musíte doufat, že se Inno po mnoha negativních ohlasech od starších hráčů nevrátí k původnímu výpočtu, kde velikost oddílu hrála důležitou roli).[BR][BR]parametr M - jsem na konci Trpaslíků (elf), tj. Výzkum 6, proto do vzorce používám 1,78 což je koef pro začátek fáze 7[BR]"}, {"111": "Rád bych se zeptal jestli ještě platí , že královská rekonstrukce je po 6300 bodech v truhličce ."}, {"19": "Ano, ve 4. truhle za 6300 b. je 1. KR, potom v 6. a od 8. výše."}, {"111": "A taky vám přijde že turnaje mají rozdílnou obtížnost ?"}, {"2": "no, ano, vychází to nasazovaných protivníků"}, {"111": "Tak to se těším na prachový turnaj , jestli půjde všechno podle plánu tak si sólo došáhnu na Královskou rekonstrukci [smilie--sprite8]"}, {"3": "ale k čemu ti bude jedna..."}]