[{"2": "Neplete si to s plánkem?"}, {"36": "@GorGlin Na plánek je potřeba 40000 bodů, takže asi opravdu myslí královskou rekonstrukci."}, {"38": "Emhyr var Emreis II napsal/a:\t\t\tale k čemu ti bude jedna...\t\tKlikněte zde pro zvětšení......bude meta pokořena, motivace posílena a nadšení znásobeno [smilie--sprite1][BR](ale hlavně tam připsal slovíčko \"SÓLO\" [smilie--sprite2])[BR][BR]Navíc je to hráč s pořadovým CZ-forum číslem 743 (já mám 2179). Takže asi ví, že ví [smilie--sprite6]"}, {"111": "BiggJOEcz napsal/a:\t\t\t...bude meta pokořena, motivace posílena a nadšení znásobeno [smilie--sprite1][BR](ale hlavně tam připsal slovíčko \"SÓLO\" [smilie--sprite2])[BR][BR]Navíc je to hráč s pořadovým CZ-forum číslem 743 (já mám 2179). Takže asi ví, že ví [smilie--sprite6]Klikněte zde pro zvětšení...Přesně tak . Asi je budu syslit do foroty jako teleporty z věžě . Momentálně nemám budovu do které bych je chtěl investovat . Vývoj běží dál , třeba se dočkám toho že budou použitelné i na starší , dnes už pro mne příliš slabé kulturní budovy ."}, {"160": "Ahoj existuje nějaký manuál či kalkulátor na ty souboje?[BR]Na WIKI je sice jakési vysvětlení,ale to mi stačilo do začátku,chtěl bych jasněji pobrat jakou kdo má sílu a nezkoušet to v boji.[BR]Natlouci si to trochu do palice [smilie--sprite8][BR]Díky za každý poznatek [smilie--sprite1]"}, {"24": "@FLYGHT k bojom existuje akýsi simulátor na Elven Architect (aj keď ten je vytvorený už niekoľko rokov a nemám úplne pocit že by bol aj dostatočne aktualizovaný), čosi je na Elvengems (tento návod bol avšak aktuálny k starým turnajom (aj tam asi od pulčíkov neaktualizovaný), prípadne tutoriál na Youtube (ktorý sa avšak zameriava skôr na technickú stránku bojov, než na turnaje samostatne).[BR][BR]Osobne si ale myslím, že práve to vlastné skúšanie v boji je najlepšia voľba - po tom, čo zaviedli nové turnaje, som si prvé kolo (prvých 9 týždňov) spravil rekreačné méty - viacmenej som len sledoval, na ktorý turnaj sú dobré ktoré jednotky a na ktoré sa hodia stromkové budovy, výsledky som si zapisoval a vytvoril akýsi spis poznámok, ktorého sa myslím celkom efektívne držím dodnes."}, {"161": "@iDavis Na ocelový turnaj spíše stromky pro střelce?"}, {"11": "jj, na střelce a něco do obrany. Ale i mágové jsou sem tam použitelní pokud jsou stromky navíc[BR]Za starýho režimu byly u tohohle turnaje dominantní střelci ze cvičiště, nově je to Lovec z tábora."}, {"38": "@FLYGHT[BR]Zkus se kouknout sem. Kdysi jsem dělal přehled, jakou kdo má sílu, životy,... Třeba Ti to pomůže:[BR][BR]\t\t\thttps://cz.forum.elvenar.com/index.php?threads/porovn%C3%A1n%C3%AD-jednotek-a-jejich-vyu%C5%BEit%C3%AD-p%C5%99i-boj%C3%ADch.6824/\t\t"}, {"160": "BiggJOEcz napsal/a:@FLYGHT[BR]Zkus se kouknout sem. Kdysi jsem dělal přehled, jakou kdo má sílu, životy,... Třeba Ti to pomůže:[BR][BR]\t\t\thttps://cz.forum.elvenar.com/index.php?threads/porovn%C3%A1n%C3%AD-jednotek-a-jejich-vyu%C5%BEit%C3%AD-p%C5%99i-boj%C3%ADch.6824/\t\tKlikněte zde pro zvětšení...To je vonóóó [smilie--sprite1]  Skvěle,moc dobrá práce [smilie--sprite2][BR]Právě tohle jsem hledal abych porovnal,viděl co kdo dokáže...já třebas postavím střelce na mágy,ale pokud jsou blokovaní nějakou jednotkou tak strašně krvací...to Kerberos s nimi zamává nahned [smilie--sprite8][BR]Ještě mám výtky jako k celkovému provedení boje (vidím jen jednotky,ale ne terén [smilie--sprite8]  ) ale co naděláš,nic není dokonalé [smilie--sprite8][BR]Ale jde ustoupit a změnit jednotky dle terénu...no mám se co učit,zaměřuji se především na boj a tak chci co nejvíc pobrat,ještě jednou díky [smilie--sprite2][BR][BR]iDavis napsal/a:@FLYGHT k bojom existuje akýsi simulátor na Elven Architect (aj keď ten je vytvorený už niekoľko rokov a nemám úplne pocit že by bol aj dostatočne aktualizovaný), čosi je na Elvengems (tento návod bol avšak aktuálny k starým turnajom (aj tam asi od pulčíkov neaktualizovaný), prípadne tutoriál na Youtube (ktorý sa avšak zameriava skôr na technickú stránku bojov, než na turnaje samostatne).[BR][BR]Osobne si ale myslím, že práve to vlastné skúšanie v boji je najlepšia voľba - po tom, čo zaviedli nové turnaje, som si prvé kolo (prvých 9 týždňov) spravil rekreačné méty - viacmenej som len sledoval, na ktorý turnaj sú dobré ktoré jednotky a na ktoré sa hodia stromkové budovy, výsledky som si zapisoval a vytvoril akýsi spis poznámok, ktorého sa myslím celkom efektívne držím dodnes.\t\tKlikněte zde pro zvětšení...Děkuji na vše se kouknu a budu se učit,to s tím zapisováním poznatků je dobré [smilie--sprite1][BR]Taky mi u PC vysíval obrázek toho pentagramu z WIKI [smilie--sprite8][BR]Díky FLY[BR][BR]Příspěvky sloučeny. Embla"}, {"11": "no nevím na ten simulátor bych moc nedal, kdysi jsem ho zkoušel, to zadávání všeho je docela pakárna a navíc neznáš dopředu náhodnou sílu jednotek."}, {"5": ".....finále je, že když máš otevřených cca 700 provincií, 164 rozšíření apod., tak ve vyšších kolech a provinciích na tebe naběhnou takové počty oddílů soupeře, že bez opravdu masívní podpory dalších budov /stromky, zbrojíř, krmený fénix/ jsi stejně bitej jako žito...ne úplně košér pro pokročilé hráče.[BR]Přesto tedy Joí krásné zpracování...palec"}, {"16": "A od změny v turnajích je turnaj úmyslně udělán tak, že se nadprůměrně vyskytují kombinace jednotek, které ti úmyslně zvětšují ztráty (tzn. zejména v turnajích se třemi základními jednotkami (elixír,prach,drahokam) máš prakticky jistotu, že jednotka silná vůči 2 ze 3 typů nepřátel bude slabá vůči tomu třetímu.[BR]Nicméně hráči cílící na méně než 2k bodů mohou být v klidu - první provincie jsou lehké a snadno porazitelné i jen s nakrmeným fénixem (a ty úplně první i bez něho).[BR]Nepřátelé získají dvojnásobnou přesilu až někde ve 31. provincii."}, {"5": "..mno pokud jsi turnajový hráč a byl zvyklý roky pravidelně dělat v turnaji 12-15k občas 18k a nyní to máš pouze občas s vyčerpáním se z podpůrných budov a surovin, tak je něco špatně..."}, {"161": "Tak poslední úroveň Ocelového turnaje u mne jednoznačně převažovala potřeba lehkooděnců a trocha obrněných střelců.[BR]Budu si asi muset vést statistiku nepřátel, abych věděl do budoucna, jaké stromky/zbrojíře stavět."}, {"11": "@athlo   výše je tabulka od @Prealiena která napovídá které jednotky budou v provincii[BR][BR]https://cz.forum.elvenar.com/index.php?threads/turnaje.6807/#post-127136"}, {"161": "@voyager-1 Dik, tahle tabulka je super, zjednodusi mi to hrani [smilie--sprite1][BR][BR]Ale hlavne ty tabulky jednotek & nepratel jsou delane na *** uroven jednotek, ale hraci trva +/- 1,5 roku nez se tam s vlastnimi jednotkami dostane.[BR]Kdyz jsem napriklad uz jenom par dni od objevu Lovce, tak mi ta tabulka parovani mojich jednotek k jednotkam nepritele vychazi jinak, a dost to ovlivni i rozlozeni terenu."}, {"38": "FLYGHT napsal/a:\t\t\tJeště mám výtky jako k celkovému provedení boje (vidím jen jednotky,ale ne terén [smilie--sprite8] )\t\tKlikněte zde pro zvětšení...jojo..loni jsem na tento problém s absencí náhledu na bojiště před bojem poukázal tady:[BR]\t\t\thttps://cz.forum.elvenar.com/index.php?threads/n%C3%A1hled-ter%C3%A9nu-p%C5%99ed-bojem.6819/\t\tBylo to předáno, ale víš jak to je...[smilie--sprite10][BR][BR]@athlo Je to dělané na 3*** jednotek. Pokud máš hvězd méně, tak toto ber jako úměrné vodítko.[BR]Pokud máš na mysli porovnání jednotek třeba pro 3*** z kasáren a pro 2** z cvičiště/tábora, co se vyplatí, tak pokud Tě to opravdu zajímá, uprav si tu moji tabulku dle Tvých hvězd ** v armádě, jak to máš. Čerpal jsem odsud:[BR][BR]\t\t\thttps://www.elvenarchitect.com/units/\t\t[BR]Good luck [smilie--sprite2]"}, {"161": "Nakonec jsem si jednotky porovnal podle statistik schovaných přímo ve hře v prohlížeči. Kdybych hrál jenom na mobilu, asi by mi nezbylo, než to porovnávat podle Architekta (https://www.elvenarchitect.com/units/). Výhoda statistik ze hry je v tom, že rovnou zohlední i bonusy i z divů (Jehly Bouře 12* a jiné, kdybych jiné měl).[BR]Zrovna jsem v 9. věku: Lesní elfové. Tj. Kasárny ***, Cvičiště * (Kerberus ***, Dryáda **), Tábor žoldnéřů: Včelí jezdkyně *, Lovec *, Květinová kouzelnice *[BR]Jasná je preference jednotek, které mají speciální schopnosti, resp. jednotek s velkým dosahem útoku, ev. pohybu. Které dokáží využít terén, resp. v souboji jeden na jednoho protivníka oslabují schopnostmi.[BR][BR]Nepřítel:LehkooděnciStřelciKouzelníciTěžkooděnciObrnění střelciMůj Tým AŽulový golem ***Ork Stratég *Elitní lučištník ***Květinová kouzelnice *Víla smrti *Můj Tým BOrk bojovník *Včelí jezdkyně *Zlověstný kerberus ***Dryáda **Starodávný lesní duch ***[BR]Vidno, že se už můj Tým A přibližuje ideálu (https://cz.forum.elvenar.com/index.php?threads/turnaje.6807/#post-127136), ale ještě mi dost vývoje chybí [smilie--sprite1]"}, {"38": "@athlo možná bych raději přehodnotil použití jednotek s dvěma ** a jednou * z Tábora a Cvičiště. Z praxe vím, že dokud nebyly ostatní jednotky na 3***, tak až na vyjímky nemělo cenu je používat.[BR]Všeobecně vzato jsou jednotky z kasáren \"univerzální\" proti všem, jednotky ze cvičiště a z tábora jsou už stavěny na konkrétní cíle. Ale opravdu bych raději používal ty jednotky z kasáren. Uvidíš sám.[BR][BR]Aby jsi to měl jednodušší, koukni na tuto tabulku, máš tam všechny Tvé jednotky z kasáren, cvičiště i tábora s hodnotami pro jejich hvězdy, navíc tam máš i vypočítaný Jehlový ATK bonus pro Lučištníky:"}]