[{"11": "za to bych ruku do ohně nedal, že třeba elfí OS je lepší než ork či žába na lvl. 2. žába má navíc výhodu že neběží TO naproti aby si do ní píchly [smilie--sprite1]  Např. ted u prkenýho turnaje kde se často používá kombinace OS a TO a v provincii je také TO."}, {"38": "@voyager-1  Zkus mi nastínit nějaký příklad v boji.  Jinak OS a TO myslíš Obrněný střelec a Těžkooděnec? On má Žabáka na 1*, navíc bych proti těžkooděncům či v kombinaci s obrněnými střelci šel s mágama."}, {"2": "Taky záleží na tom, jaký těžkooděnec to je ork se specializací na lehkoobence, nebo rytíř který má krom procent na žáby i problouzeny dosah"}, {"161": "@BiggJOEcz Tak to asi fakt zkusím simulovat v tom Elvenarchitect, i když tam píší, že nesimuluji překážky v terénu, což je mnohdy to rozhodující.[BR]Když se pokusím si vzpomenout, kolikrát se mi stalo, že se souboj odehrál na rovné planině, tak to bude možná 1:10?[BR][BR]Žáby ještě nemám. Ale už se na ně těším [smilie--sprite1][BR][BR]Moje tabulka vypadá momentálně takto (s Lovec * a Včelí jezdkyně ** a dalším upgrade Velikosti oddílu). Sloupce min. max. a avg. jsou hodnoty Poškození už se započítanými bonusy. Sloupec Životy už má taky započítané bonusy. Bonusy myslím divy i bonus proti soupeři i efekt kouzla.[BR][IMG]https://i.ibb.co/qNw0QF6/https-cz-forum-elvenar-com-index-php-attachments-1636453609153-png-5821.png[/IMG]"}, {"11": "@BiggJOEcz  se mi to nechce pitvat, řešit nějaký čísla a tabulky, tam hraje roli několik faktorů, napsal jsem jen můj názor."}, {"38": "@voyager-1 jasný, rozumím.  Samotného mě to jen zajímalo.[BR][BR]@athlo koukám na tu Tvoji tabulku, konkrétně na Elitního lučištníka*** a Dryádu II** a jejich životy.Tady to vypadá, že má téměř dvojnásobek životů, tudíž by teoreticky měla vydržet více. Pokud Ti bude ale v bojích připadat, že umírá více než E.L., princip je celkem jednoduchý.. Směrodatné u jednotek je krom útoku, životů,... právě velikost jednotky. Elitní lučištník i Lovec má 1.jednotku, Dryáda má 2.jednotky na skupinku.[BR]V praxi to bude, že pokud budeš vyrábět plácnu 4000.jednotek El.Lučištníků na oddíl, Dryád to bude 2000. Útok bude cca podobný, Dryády bude těžší zabít. Pokud je nasadíš proti enemy lučištníkům, má menší iniciativu (17) oni mají od 17-21. Takže se pak dá lehce prohrát. Navíc pak to ještě může zkomplikovat blbý terén, kdy těžkooděnci zablokují východ..atd..[BR]Je tam jak píše @voyager-1 - hodně faktorů. Proto v praxi u 90% z nás se to nějak závažněji neřeší a jede na auto [smilie--sprite1][BR]Každopádně ať se daří."}, {"161": "@BiggJOEcz Máš pravdu.[BR]Nevím jestli je to tak zřejmé jak jsem si myslel. Pozadí políček tabulky je obarveno barvou nepřítele. Takže když se zrovna díváme na Dryádu, tak má sice dechberoucí bonus k obraně před Težkooděnci, ale šance, že se k ní Těžkooděnec přiblíží je mizivá. Ale je to výborný postřeh, přidám si do tabulky ještě jeden sloupec životy bez bonusu obrany proti tomu kontkrétnímu nepříteli.[BR]A výborný postřeh s iniciativou, tu zohledním extra [smilie--sprite1][BR]Díky."}, {"2": "také je potřeba brát v potaz, že Dryády mají velikost dva, takže jich je v oddílu poloviční počet"}, {"160": "Ahoj,dovolím si podotknouti na adresu INNO,že hraji ještě jednu jejich hru a tam jsou boje o pevnosti.[BR]Potřebovali prachy,tak hodili do prodej set (podotýkám kdo nedotuje výrobce finančně tak se k němu nedostal) a ten totálně převálcoval veškeré dostupné sety a bitvy se staly jaksi nevyrovnané.[BR]Pak běžel tzv.IFBC (mezinárodní mistrovstí v bitvách) podle nějž se mělo vybalancovat ono nevyvážení,ale ouha někde se stala chyba a úprava vedla k ještě horšímu stavu a bitvy začli silně strádat.[BR]Tak se do eventu dal set jenž slušně vyrovnal ten placený,nicméně už nešlo moc co zachraňovat.[BR]Podotýkám,že na živých světech se odehrávali bitvy 2x - 3x týdně i vícekrát...teď na nejbojovnějším světě probýhá bitva tak jednou za 7 - 14 dní.[BR]A co z toho vyvozuji a proč to sem uvádím???[BR]Protože dostávám silný pocit,že úprava turnajů jde stejným směrem.[BR]Jsem Trpaslík stále a mám malý výběr vojska tak i *** nejsou nijak závratné,však to znáte [smilie--sprite2] Ale tak jak je nastaven terén a namixovaný nepřítel vede ktomu,že i za pomocí stromků a zbrojíře jsem nucen min.50% vykupovat.[BR]Jako člověka kterého boje baví a zajímají to bohužel trošku zarmucuje a hra se pro mne stává jen klikáním na obnovu vojska,střádání surovin které mi lidé ze společenství nepoměrně mění abych je zase nacpal do turnaje [smilie--sprite3][BR]Přitom jsem se v turnajích dokázal držet na +- 3 - 6 místě ve spolku a z cca 25 provincií dával v boji 15 i více.[BR]Ahoj,muselo to ven [smilie--sprite8]"}, {"38": "@FLYGHT rozumím Ti, ale je třeba konkrétně u Elvenaru si v takových případech vždy připomenout, že Elvenar je koncipován jako budovatelská strategie, ne bojová.  To je tu jen jako bonus. Na bojovky bychom se museli poohlédnout jinde."}, {"2": "To je pravda, na druhou stranu, věci spojené s bojem, jako je turnaj a věž jsou významnou součástí hry a mě osobně zaberou v týdnu cca stejně času jako vše ostatní."}, {"162": "Ahoj, chtěl bych se zeptat, včera po začátku turnaje k nám do společenství přibyl nový člen. Připojil se k turnaji, hraje za nás, ale jeho body se ostatním nepřičítavají. Je to chyba, nebo je to tím, že nastoupil až po začátku turnaje? Díky za radu."}, {"20": "To je potíž při bonusech. Když hráč přijde do spolku během hry turnaje a věže, má hru obojího zablokovanou. Nejlepší je, aby hráč přešel do nového spolku v sobotu večer po skončení turnaje."}, {"2": "Na prestup bez omezeni je 18 hodin týdně.[BR]Chápu to při DS, ale takhle už mi to přijde moc.[BR][BR]Stalo se mi, že jsem se rafnul se spolkem a vyhodili mě. [BR]Vždycky si přestup nejde naplánovat na přesnou hodinu."}, {"3": "Tak ono se bez toho jednoho turnaje/věže dá taky žít a každý týden spolky snad nikdo nemění"}, {"2": "v celkovém součtu máš jistě pravdu, ale pro město v prvních kapitolách je to citelné [BR]urychlovače, runy, činidla, relikvie , toho všeho mám hromady, něčeho větší, něčeho menší, ale město ve třetí, páté kapitole to tak většinou nemá.[BR]V případě DS je to tak schválně nastaveno aby cechy nemohli střádat cetky na účtu mimo cech[BR]ale tady smysl nevidím"}, {"3": "řekl bych, že obejít tenhle problém by bylo moc složité na to, jak malý přínos by s tím byl spojený, tak to vývojáři vzali jako menší zlo"}, {"124": "jojo je to na pytel, ale zas má hráč čas popřemýšlet do jakého společenství se přidat dál a dohodnout se s vedením daného spolku kdy k přestupu dojde Pro společenství je zas výhoda v tom, že můžou po tu dobu oslovit či napsat jinému hráči,že se u nich uvolní místo a jestli by neměl zájem přidat se k nim Hold netřeba koukat jen na negativní stránku"}, {"133": "Mám dotaz, u nás ve spolku je hráč na začátku a nejde se mu připojit do turnaje už pár týdnů. Prý až ve 4 kapitole má kolonku, kde má teprve vyzkoumat turnaj. Nic takového ostatní nemají, setkali jste se s tím, nebo to vypadá na chybu ve hře?[BR]Na mapě při turnaji má kolonku turnaje šedou neaktivní prý."}, {"21": "Od 4 kapitoly se může připojit, o žádném výzkumu turnaje nevím , oprava věž od 5 kapitoly"}]