[{"142": "@OrickJ snad jedině, že to má něco společného s novinkami, které byly uvedeny v 10/2023 jako pomoc novým hráčům - viz odkaz, ale konkrétně o turnaji se tam nic nepíše."}, {"133": "Tak jsem si udělal nový účet na sk serveru a opravdu ve IV kapitole je výzkum turnaje, teprve pak se hráč može zúčastnit týdenních turnajů.[BR]Je to tedy novinka. [smilie--sprite1]"}, {"3": "Věž bývala od třetí kapitoly... s tím turnajem je to nějaké divne"}, {"136": "o turnaji as  tam síce nepíše ale tiež poznám hráča, ktorý nemá dôvod mi klamať že to tak je,[BR]nový hráči ktorý začali po tej aktualizácii majú prekopaný výskumný strom až do trpaslíkov, a všetkym starym hračom bol ponechany pôvodny strom takže žiadne zmeny nevidia[BR]- ale dať turnaj až do štvrtej kapitoly,  akože chapem že v štvrtej kapitole má hráč v turnaji 6-8 provincií a stále sa len vezie so spolkom ale tie VB a runy sú velka pomoc ked to získavaš už od druhej kapitoly"}, {"22": "Potvrzuji, taky mi nový hráč tvrdil, že žádný turnaj nevidí a musí ho teprve vyzkoumat a nikdo z nás to ve výzkumu nemá. Zřejmě ti nováčci mají jiný výzkum[BR][BR]Třeba tam mají nově výzkum Společenství až v druhé kapitole a pak si teprve můžou najít spolek. Když se podívám zpátky, tak to tam nemám a co si pamatuji, šlo se přidat do spolku prakticky okamžitě."}, {"6": "Je pravda, že jsem nastoupil a hned začal mrskat první turnaj. Víceméně za surky spoluhráčů. Ale už semotamo jsem se srdnatě pustil do bitky.[BR]Byla to jedna z věcí, která mne na hře hned chytla.[BR]Je škoda, že jste připravili začátečníky o tuhle iniciační kratochvíli. Boj je součástí hry a chránit někoho ve vatičce postrádá smysl.[BR]Pro to je spolek, aby provedl své začátečníky úvodem hry, včetně bitevní přípravy.[BR]No a kdo si to hraje bez spolku, tak to asi taky jde, ale pro mne tato cesta byla nezajímavá."}, {"22": "Udělala jsem si nové zkušební městečko, takže moje poznatky:[BR][BR]Výzkum Společenství je až v druhé kapitole, celkem opruz. Než jsem se tam dostala, nasbírala jsem score kolem 1000, takže mě napadá otázka, jestli ti lidi, co mají méně než 1000, mohou dostat pozvánku a zda jí vůbec vidí? Rozesílám spousty pozvánek, pořád nám chybí lidi a nabízí mi to různé začínající hráče i s pár body, takže jim jí asi posílám zbytečně...[BR][BR]Druhý poznatek, výzkum turnaje je až v polovině čtvrté kapitoly a výzkum Dobrodružství ve třetí kapitole. Takže ten chudák čeká dvě kapitoly, než se vůbec může do něčeho zapojit. Jestli je tohle pomoc začátečníkům, tak docela krok zpátky [smilie--sprite3] Navíc mi přijde divné, že se může Dobrodružství zúčastnit dřív, než Turnaje a Věže, protože nemá jak vyrábět odznaky.[BR][BR]Třetí poznatek, přidala jsem své zkušební městečko do spolku a během dneška mi to vyhodilo dvakrát upozornění na začátek Turnaje. Nevím proč, protože ho nemám vyzkoumaný, navíc na něj ani nešlo kliknout. Tlačítko jen zešedlo a bylo nefunkční. Přišlo mi to jako chyba.[BR][BR]Pro mě jsou tohle docela nové informace. Myslela jsem si, že to ti noví jen lajdaj, ale netušila jsem, že se nemůžou připojit i kdyby chtěli. Ještě že tu máme to forum [smilie--sprite1]"}, {"6": "@Jasnost máš pravdu. Asi bych to za těchto podmínek hned po začátku zapíchl a šel hledat jinou kratochvíli.[BR]Alespoň teď tuším, proč se tak blbě oslovují začátečníci. A když už se s úspěchem osloví, tak dlouho nevydrží."}, {"11": "Problém je spíš, že neumíš správně nasadit jednotky, jak mi vysvětlíš že plno hráčů dá každej turnaj 10k a víc a nemá s doplněním jednotek problém. Velikost oddílu (ne přímo obtížnost) se navyšuje hráčům co mají hodně divů. Pravda taky bych se nezlobil kdyby to změnili [smilie--sprite1]"}, {"7": "kpavel​[BR]jj, budem si to hrát sami!"}, {"3": "Obnovování jednotek... to je věda.  Naštěstí mám dva hnědé medvedy. Jednou za (delsi) čas nakrmit, a utratim tisíce hodin urychlovacu a spalim spousty kouzel na kladiva, abych si na nějaký čas naddelal armádu. Všechno souvisí se vším a je třeba si za tím jít. Třeba v eventech už jdu jen pro uzdravovace jednotek"}, {"16": "@kpavel Z hlediska počtu druhů jednotek nepřítele jsou turnaje rozděleny do 3 úrovní obtížnosti:[BR]T1-T3 turnaje (dřevo,ocel,mramor) - Základ tvoří jedna jednotka[BR]T7-T6 turnaje (křišťál,svitek,hedvábí) - Základ tvoří dvě jednotky[BR]T7-T9 turnaje (elixír, prach, drahokamy) - Základ tvoří tři jednotky[BR]Více jednotek v základu = více druhů jednotek v boji (v průměru, bo náhoda).[BR]Nicméně, toto není žádná novinka, je to tak již dva roky od velké turnajové změny. A v tomto nebyly dělány žádné úpravy. [BR]Jediné, co se změnilo, je to, že jednotky ve vyšších provinciích mají více *, tak jak jsou 4* jednotky postupně přidávány do hry spolu s kapitolami.[BR][BR]Pak tu máme obtížnosti:[BR]Kromě přidávání 4* jednotek máme obtížnost turnaje = poměr velikosti jednotky nepřítele a hráče, který je konstantní a pokud vím, nebyl 2 roky nijak upravován a je pevně dán turnajovou provincií a jejím kolem.[BR][BR]Pak je tu \"obtížnost\", tedy spíše drahota turnaje = velikost jednotek v turnaji i věži odvozená z přísně tajné formule, na niž má vliv několik faktorů - hlavně počet výzkumů, použitých rozšíření a úrovně divů (více rozšíření a úrovní divů = dražší turnaj(větší velikost oddílu)).[BR][BR]Způsoby, jak se vyrovnat s obtížností i drahotou turnaje/věže:[BR]- Ohnivý fénix - základ každého bojovníka (max +50% škod pro všechny jednotky)[BR]- Hnědý medvěd - Bonus k produkci (sběru) jednotek  (až +50%) (nejefektivnější na krmivo je po použití urychlovat výrobu jednotek a případně doplňovat kladiva požehnáními)[BR]- Div Simia Sapiens - Bonus ke sběru jednotek (bez nutnosti krmit) (až +46%, navíc snižuje rozpad živoucího zboží)[BR]- Div Klášter/(a jeho lidský ekvivalent) - Bonus k životům jednotek (až +30%)[BR][BR]- Další bojové divy pro turnajově zaměřená města (bonusy ke škodám jednotek, zvýšení rychlosti produkce kasáren/cvičiště/tábora)[BR]- Možnost snížení počtu mrtvých jednotek přes nakrmení Fénixe soumraku (až 5% oživených padlých jednotek)[BR]- Používání dočasných posilovacích budov z řemeslné výroby a z věže (Osvícená střelnice, Velký magický násobitel, Jedinečné vylepšení jednotek z řemeslné výroby a Zbrojíž z věže) - potřeba hlídat a vybírat všechny 4 cykly rotace receptů v řemeslné výrobě + možnost přidání dalších cyklů přes doušky vyjasnění (padají ve 3. patře věže s 55% šancí po 3 kusech(nebo 5 - teď z paměti nevím)).[BR]- Ušetření množství spotřebovaných dočasných budov a krmiva jejich použitím na 2 věže, případně 2 věže a 2 turnaje - pokud má hráč časový skok 30+ a lv10 Polárního medvěda a 0 čas mezi koly turnaje, může na jedny budovy z řemeslné výroby odehrát 2 turnaje a 2 věže (za použití urychlovačů na brány) (tzn. sjet celý turnaj i věž v Pátek a v úterý obojí sjet znovu na ty samé budovy).[BR][BR]Pro hráče na konci výzkumu sice s každou další kapitolou stoupá drahota turnaje, ale rychlost růstu této drahoty není tak dramatická, jak jsem se před 2 roky obával, částečně je to způsobeno i tím, že do hry jsou čas od času přidávány nové věci mírně snižující důsledky růstu této drahoty (např. Fénix soumraku, přidání doušků vyjasnění, nebo teď i kotlík (já z něho využívám vylepšenou Melu žoldnéřů, jejíž efekt mi stačí díky výše popsanému na celý turnaj i věž - ten efekt není moc velký, ale i to málo pomůže))."}, {"3": "zapomněls na uzdravování jednotek - důležitá pomoc. Hlavně u provincií 50+ už ty ztráty jsou fakt šílené a opravdu se vyplatí si je uzdravovat [smilie--sprite1]"}, {"142": "Máš na mysli Fénixe soumraku... po nakrmení oživuje jednotky po ukončení bitvy."}, {"3": "jde mi o kouzla"}]