[{"149": "iDavis napsal/a:\t\t\tTeším sa. Viem, že sa môžem rozlúčiť s turnajmi, v ktorých ide bojovať bez strát. Viem, že sa môžem rozlúčiť s 20k+ bodmi. Ale teším sa, že sa konečne po mesiacoch končí ten podivný stav neistoty, nekonečného balansu a obáv z každej blížiacej sa zmeny. Provizórne stavy nemám rád, a toto bol prípad turnajov od prvého oznámenia tohto updatu (čož to celé trvalo tak nejak dlhšie, než som čakal)\t\tKlikněte zde pro zvětšení...Přesně, taky jsem ráda, že už to spustí, nemám ráda nejistotu.[BR][BR]A ještě bych ráda věděla, jestli složení jednotek bude zobrazované podle prohlížeče nebo podle mobilu?[BR][BR][BR]// Příspěvky sloučeny. Jumala"}, {"109": "Již jsem to někde navrhoval. U nového turnaje by měl být zavedena také možnost částečného výkupu. Mohlo by to být řešeno přes slider s tím, že když něco vykoupím, tak mi klesne armáda a obráceně. Jak by to mohlo vypadat, jsem si dovolil udělat do obrázku. Ta ruka by byla samozřejmě pohyblivá. A bylo by tam jen jedno zelené tlačítko. Např s nápisem vypořádat.[BR][IMG]https://i.ibb.co/HCgYYH8/https-cz-forum-elvenar-com-index-php-attachments-elv-png-4947.png[/IMG]"}, {"105": "@prchlik - tak to by bylo super !!! Jenže to nemá šanci projít, neboť by se to hráčům mohlo i líbit [smilie--sprite2]"}, {"124": "@prchlik  ted jde o to jak by si vývojáři přebrali a nemusel bys pak dávat surky jen na to aby sis ten turnaj mohl vybojovat Myslím tím aby pak nedávali přehnané množství jednotek takže já jsem proti"}, {"59": "U mě to přinese výrazné zkrácení času. A jinak jsem také rád, že už se autoři rozhoupali konečně rozhodnout.[BR][BR]Danber7777 >> To můžou tak jako tak, záleží vždy jak obtížnost nastaví. Dávání surek ulehčení jako takové nepřináší, protože ne každý surky na rozdávání má. A navíc jsou surky, které např. já mám věčně na nule a nebo je nutně potřebuji."}, {"109": "@Danber7777 nevím jak by si to vývojáři měli přebrat. Jak množství jednotek, tak surovin je definováno \"jakýmsi vzorcem\", nejvíc o tom ví @Lovec Krys . I nyní hodně hráčů, možná většina, z těch 4 soubojů 1-2 vykoupí. A to by zde zůstalo zachováno. Ostatně i nyní říkají z Inna, že sloučili 4 souboje do jednoho a tím pádem všechno sečetli. Myslím, že jsi asi nepochopil, jak jsem to myslel. V novém turnaji musíš buď jen bojovat nebo jen vykupovat. A toto by do hry vnášelo kousek i z toho starého, kdy jsi část vykoupil. Ostatně dle hlášení z bety, od nějaké 10 provincie začínají jednotky dramaticky růst a již v prvním kole jsou takřka dvojnásobné."}, {"112": "Na změny se těším moc (snad se nezklamu), přeruším podzimní herní přestávku a vyzkouším si nové turnaje. Soutěživost u aktivních hráčů se tím nevytratí, jen rozdíly v bodech a celková maxima budou prostě menší. Kdysi jsem hrával turnaje na manuál (2017), postupně s růstem provincií se z toho stalo - automat nebo výkup. Ručně vedený boj jsem si užil jen příležitostně a pokud nás Inno \"přinutí hrát\" manuálně, pak to nevidím jako krok zpět. Zároveň nikdo po zkušenostech z Bety nevyvrátil, že by nedošlo ke zjednodušení pro vícehvězdičkové úrovně u nižších provincií - taktéž avizace levnějšího výkupu nikdo nevyvrátil. Z toho vyvozuji, že by mělo být pro spoustu neturnajových hráčů menší problém udělat body do turnaje a přiblížit se desítkovému průměru 1600. Aktivní turnajové hráče tento typ hráčů v žebříčcích rozhodně neohrozí."}, {"3": "Promin, ale nechápeš, v čem je problém. Nejde o body, ale o odměny. Víc provincii znamenalo víc VB. A navíc, na appce ručně bojovat nejde..."}, {"89": "Emhyr var Emreis II napsal/a:\t\t\tVíc provincii znamenalo víc VB.\t\tKlikněte zde pro zvětšení...Přesně to je ono proč jsem hrával mnoho provincií alespoň na 5 kol - VB v druhém a pátém kole byly hlavním zdojem rozvoje divů."}, {"20": "Určitě vítám 1 střet místo 4. Občas to byla nepříjemná a zdlouhavá klikačka. Sama jsem zvědavá, kolik toho teď uhraju. Na betě mám malé město a nikdy neotvírám víc než 10 provincií, takže z toho zase tak moc nepoznám. Už jsem se i já smířila s tím, že výsledky v turnaji půjdou dolů. Na druhou stranu vnímám podobně jako iDavis jakousi úlevu z toho, že doba nejistoty končí. Alespoň nějaké částečné úpravy v turnaji od jeho spuštění na betě proběhly, sice malé, ale lepší než nic. Doufejme, že po startu na live serverech se ještě časem něco zlepší. Bude to výzva a jsem zvědavá, jak se s tím vypořádám."}, {"79": "To jako mysli ino vážně????U mramoru dostávat na prdel při nakrmenem fenixu a 2ks podpůrných budovách k army????Jako fakt????Trošku někomu preskocili kolečka asi.U nejlehciho turnaje takovéto terno???Co pak bude u T3....5 provincii a čus????Proč vedou tuhle skvělou hru do kytek????proč[smilie--sprite3]"}, {"103": "Tak po prvním kole turnaje (30 provincií) mám o něco málo (ale málo) větší ztráty než obvykle, nepraktikovala jsem žádnou velkou strategii, prostě jsem zvolila jeden typ jednotky, který je výhodný proti co největšímu množství nepřátel (no, někdy dva typy) a utloukla jsem je. Mám nakrmeného fénixe, postavené dva magické násobitele a osvícenou střelnici a trpasličího zbrojíře (což tak zhruba mívám v každém turnaji, i když většinou nestavím střelnici i násobitele zároveň). Jediné, co se mi jeví jako problém, je , že kdybych chtěla otvírat další provincie, tak za chvíli nebudu schopná postavit třeba 5  oddílů mágů najednou, ačkoli jich mám plná kasárna). Ale celkově mi to zatím přijde fajn, velká časová úspora. Otázka je, jak to bude vypadat v dalším kole."}, {"68": "Tak s nakrmeným ptákem jsem udolala 30 provi bez žádného výkupu. A kdybych měla pokračovat dále, tak bych za chvilku neměla žádné oddíly. V minulém by mi to stačilo do 60ti provi jsem měla okolo 80odd..., ted když jsem udělala 30 provi tak mám kolem 29 oddílu... Což je velký rozdíl... Pozitivum vidím v tom, že je to rychlejší klikání,..... Uvidím jak se mi bude dařit v dalších kolech..."}, {"16": "PallandoCZ napsal/a:\t\t\tMám nakrmeného fénixe, postavené dva magické násobitele a osvícenou střelnici a trpasličího zbrojíře (což tak zhruba mívám v každém turnaji, i když většinou nestavím střelnici i násobitele zároveň)\t\tKlikněte zde pro zvětšení...Dobré pro tebe, že máš takové štěstí, že je můžeš používat v každém turnaji. Mi ve věži skoro pořád padají místo zbrojíře portálová požehnání, která mi jsou v turnaji na nic."}, {"59": "Tak jsem si to také zkusil, a dle očekávání za mě jednoznačně zklamání. Měl jsem natrénováno na mramorový turnaj, a hle, hra po mě chce i jednotky, co nemám natrénované, takže ano, třicet se dá, ale je to bez berliček výrazně méně, než jsem dokázal uhrát předtím. Ztráty jsou na automat opravdu vysoké, bez některých jednotek dost nehratelné, z toho plyne jednoznačně méně odměn do divů, a nedostatek vojska na další kola. Dalo by se sice řešit berličkama, ale to nejde krmit dlouhodobě. Výkup je kvůli spojení provincií také dost mizerný. Hrát manuál nebudu, dost mi to připomíná věž, kde nároky najednou narostou na pro mě nehratelnou mez, kde bez klíčových jednotek nejenže nemám šanci, ale hlavně při prohře automatu přijdu o většinu jednotek. A vyházet všechny berličky a urychlovače opravdu nehodlám. Potvrdilo se jen další omezení hry (kromě toho zmizela i typika jednotlivých turnajů, takže opět nějaká vychytanost na hře zapadla do šedi a zapomnění), kterých je za poslední dobu dost a dost. To co mě na hře převážně bavilo tím zaniká (nebudu si škodit tím, že budu vyvíjet své město), a to je asi tak vše co k tomu můžu říci.[BR][BR]Lovec Krys >> Ano, portály byly i u mě vždy tím nejpadanějším sortimentem (úlomky nepočítám)."}, {"103": "Lovec Krys napsal/a:\t\t\tDobré pro tebe, že máš takové štěstí, že je můžeš používat v každém turnaji. Mi ve věži skoro pořád padají místo zbrojíře portálová požehnání, která mi jsou v turnaji na nic.\t\tKlikněte zde pro zvětšení...Tak nemám ho v každém turnaji, někdy stavím jedinečné vylepšení jednotek, ale je fakt, že mi padá celkem často, nestěžuju si."}, {"42": "Je to paskvil. Dobrý nápad na snížení počtu bojů je znehodnoceno novým systémem výpočtu jednotek. Hra se mi po pracně odehraných letech znechucuje."}, {"10": "PallandoCZ napsal/a:\t\t\tTak po prvním kole turnaje (30 provincií) mám o něco málo (ale málo) větší ztráty než obvykle, nepraktikovala jsem žádnou velkou strategii, prostě jsem zvolila jeden typ jednotky, který je výhodný proti co největšímu množství nepřátel (no, někdy dva typy) a utloukla jsem je. Mám nakrmeného fénixe, postavené dva magické násobitele a osvícenou střelnici a trpasličího zbrojíře (což tak zhruba mívám v každém turnaji, i když většinou nestavím střelnici i násobitele zároveň). Jediné, co se mi jeví jako problém, je , že kdybych chtěla otvírat další provincie, tak za chvíli nebudu schopná postavit třeba 5  oddílů mágů najednou, ačkoli jich mám plná kasárna). Ale celkově mi to zatím přijde fajn, velká časová úspora. Otázka je, jak to bude vypadat v dalším kole.\t\tKlikněte zde pro zvětšení...Jsem na to úplně stejně. Nažraný fénix, zbrojíř a po jednom magický násobitel a vylepšení jednotek. Udělal jsem 4 provincie bez jakékoliv pomoci, ale v té čtvrté už to stálo moc, tak jsem doplnil zmíněné a udělal 30 provincií. Zatím to nechám a nikam se nepoženu, až co na to druhá hvězda, když tak se vrátím k těm následujícím. Ušetřilo to mraky klikání, to je pozitivum, které se určitě bude líbit všem."}, {"3": "tak, zatím to vypadá, že se obavy naplnily a vývojáři vylili s vaničkou i dítě.[BR]Turnaje naprosto ztratily jakékoli kouzlo.[BR]Zkusím tomu dát čas, ale přiznávám, nebaví mě to. Ani ta časová úspora to nezachraňuje. Snad jen v tom, že se z turnaje stala jen bezduchá povinnost. Předtím jsem se na některé typy vyloženě těšil. Teď to takové asi nebude [smilie--sprite3]"}, {"20": "Už podle zkušeností z bety bylo jasné, že otvírání 40 a více provincií odzvonilo. Otevřela jsem zatím 25 provincií (mám jenom nakrmeného Fénixe a žádné další pomocné budovy). U 25. provincie jsem už začala vnímat větší ztráty a tak jsem to stopla. Nechci si hned na poprvé vymlátit vojsko. Prostě sice méně klikání, ale také jasné omezení výkonu. Škoda."}]