[{"3": "mě přišlo, že to začalo významně klekat od 15. [smilie--sprite3]"}, {"24": "\"Dali nám do rúk nové karty, hráme ďalej, ale inak..\""}, {"3": "neříkám, že nebudu hrát. Zkusím si v tom něco najít, ale vypadá to, že to kouzlo je prostě pryč"}, {"59": "Mě žádné nové karty nedali, zábava ta tam, přijde mi jak když klikám věž (která byla ale unikátní), jediné co mám je, že můžu trénovat víc jednotek naráz, u mě to ale nějak nefunguje, protože všechny rázem ztratím. Výsledek je, že nezískám to co mě u hry drží, a o nějaké hodnocení v tabulce vůbec nejde."}, {"92": "Za mňa zatiaľ spokojnosť. Jediná chyba je, že to prišlo až teraz, keď už turnaje boli 2-3 roky bezduchá klikačka, bez akejkoľvek straty. [BR]Negatívne reakcie plynú iba z toho, že tá nešťastná situácia trvala príliš dlho a hráči si na to zvykli. Pripomína mi to obdobie, keď urobili nerf paladinov s ktorými, v tom čase, bolo možné hrať všetky turnaje a hráč nemusel trénovať žiadne iné jednotky. Vtedy to spôsobilo tiež negatívne reakcie. [BR]Obrovské plus je pre mňa možnosť trénovať vo všetkých troch vojenských budovách, vďaka čomu sa stala veža omnoho ľahšou."}, {"5": "..od 61.provincie mi nejde hrát manuálně a automat mi sežral 4 střety, nevím jaké je bojové pole a jaký typ jednotek proto přesně postavit!!![BR]...nakonec jsem provincii vykoupil, abych se pohnul, protože krmivo expiruje..."}, {"112": "první reakce spodiny: nastavení bez krmení a přídavných budov[BR]- pro malé hráče výrazně lehčí (do provincie 8)[BR]- pro vejrostky zajímavé a hratelné (stopnul jsem to po 16, nejspíš by to šlo i dál, ale přituhovalo), od 9 do 16 manuál, dvanáctka vykoupeno[BR]Pokud bude pravda, že s hvězdama se nebude výrazně zvyšovat obtížnost, pak bych měl dosahovat vyššího průměru než dříve (ukáží další dny).[BR]Jen si tak přemýšlím... Jaké by byly reakce hráčů, kdyby to celé bylo opačně, tohle byl několikaletý standard a přehodili by to na tu předchozí klikačku. Nebyl by větší řev?"}, {"5": "Trumpetko /hezky zvolený nick/. Turnaj je nyní více výhodný pro malá města než pro hráče , kteří si město 4 až 5 let pracně šperkují a vylepšují a nyní jsou na tom biti, díky kritériím, která zvolili ... jsou dost vysoko a nespravedlivě nastavená pro pokročilá města..."}, {"105": "No já jsem malá vesnice - kapitola 4 a mé zkušenosti s novotou - jak A, tak W 22 provincií, pták na 6 a 7 level, v obou zbrojíř nebo 2x stromky. Měl jsem nachystáno lehce přes 100 oddílů kušníků 2** a kněžích 1*. V minulosti by mi to stačilo na 2-3 kola turnaje, dnes jsem v posledních provinciích skládal co se dalo, abych naplnil oddíly. Za mě velké mínus a do budoucna neudržitelné. Výkupy jsem koukal, že to chce docela dost T2, kterou jsem zatím v turnajích nepotřeboval. Opět velké mínus. Co se týká času, tak jsem musel bojovat i manuálně, což jsem nikdy v prvních 4ech kolech nedělal. Úspora tedy žádná, ba naopak. Opět tedy velké mínus. Děkuji INNO  [smilie--sprite4]"}, {"77": "Amuni a Konstrukti, obě města 1*34 provincií jenom na výkup a zas až o tolik zboží a surovin - asi tak o 1/4 z celkového - jsem nepřišla a než bude druhé kolo, tak ještě přibude z dalšího rekrutu větší armáda. Na boj určitě postavím stromky a zbrojíře, tedy kromě toho, že ještě nakrmím ptáka. Pokud by mě nezdržovalo neustálé přebíhání z mapy na mapu, z důvodu nemožnosti jít z té světové rovnou do obchodu - kvůli zisku klobouků na DS, měla bych první kolo cobydup a to je z té šílené bláznivé klikačky neskutečné vysvobození. Že to nebude na uhrání tolika provincií tak snadné, co jsem byla zvyklá, bylo předem jasné, tedy v tomto se překvapení u mě nekoná, ani konat nebude. Ti co si nefér nasypali do divů a měli neprávem dost dlouhou dobu výhodu (oproti těm fér a poctivým), že to budou mít teď více ztížené, než by museli mít, to opravdu nepláču, příště si možná rozmyslí chovat se netýmově vůči ostatním hráčům, když čas ukázal, že se něco takového na Elvenaru nevyplácí. Takto měl být - a věřím že to bylo původně tvůrci zamýšlené - nastavený turnaj už od jeho počátku, mohli jsme si ušetřit to znechucení na obou stranách, k pushingům by vůbec důvod, jenom kvůli turnaji, takto žádný nebyl. A co u mě stoprocentně přinesl dobrého,  tento v novém hávu turnaj, a tím si myslím, že zabil dvě mouchy jednou ranou, je možnost výcviku na všech třech frontách, konečně se dají nezávisle na sobě, všechny ty tři budovy plně využít. Já za něj děkuji. [smilie--sprite1]"}, {"59": "luterina >> Tomuhle moc nerozumím. To že někoho bavilo hrát o body, kde si pak vylepšil divy bylo nefér? O to více teď spíše nahrává faktu, že pokud někoho baví vylepšovat divy, tak už pro něj nemá smysl hrát takto odfláklý turnaj, ale spíše se uhranout k nějaké nekalé metodě zisku bodů na jejich vylepšení."}, {"16": "No já přeji nové turnajové špičce vše nejlepší, já už mezi vás nepatřím a do další změny turnajového systému ani patřit nebudu. Kromě relikviových turnajů si nejspíše pojedu jen svých nových 20 provincií (byl bych schopen nahrát o pár provincií dál, ale přijde mi to jako zbytečné plýtvání prostředky bez adekvátní odměny, takže je raději pošetřím na klíčové relikviové turnaje)."}, {"112": "Doplním jeden postřeh. Po reakcích z Bety a tohoto vlákna jsem čekal, že se zvýšením obtížnosti u vyšších provincií hned prvního kola (versus mé nadšenectví a pozitivní přístup) se posunu v žebříčku vpřed a rozšířím si svých 420 turnajových bodů nazobaných historicky za léta po pár kouscích. 16 provincií po prvním kole mi nepřijde na prcka málo. A místo toho jsem pozice 760 až 880. No kde se ti hráči/účty berou?"}, {"77": "Pauleo napsal/a:\t\t\tluterina >> Tomuhle moc nerozumím. To že někoho bavilo hrát o body, kde si pak vylepšil divy bylo nefér? O to více teď spíše nahrává faktu, že pokud někoho baví vylepšovat divy, tak už pro něj nemá smysl hrát takto odfláklý turnaj, ale spíše se uhranout k nějaké nekalé metodě zisku bodů na jejich vylepšení.\t\tKlikněte zde pro zvětšení...Prosím přečti si to ještě jednou, řeč je o těch nefér, tedy o těch co si více městy zadotovali na divech to své hlavní, že jsme z turnajů poctivě těžili VBčka je v pořádku, to nám tak i při zachování fér hry bylo umožněné."}, {"3": "každý zkouší, co se dá uhrát, spousta lidí nasadila \"stromky\"... ono se to utřepe a věřím, že za 1-2 měsíce zase to nadšení opadne. Lidem se sice ulehčí klikání, ale kdo nechce, stejně ty turnaje nebude nijak hrotit. Navíc, teď už se nedá nic nahrát, takže spousta hráčů bude rezignovat i na to občasné vzepětí sil.[BR]CHci se plést, ale podle mě zasadili zbytečně ránu jedné ze zajímavých VOLITELNÝCH součástí hry.[BR][BR]luterina napsal/a:\t\t\tProsím přečti si to ještě jednou, řeč je o těch nefér, tedy o těch co si více městy zadotovali na divech to své hlavní, že jsme z turnajů poctivě těžili VBčka je v pořádku, to nám tak i při zachování fér hry bylo umožněné.\t\tKlikněte zde pro zvětšení...to bylo myšleno jinak. ZAtímco doteď bylo možné si div každý týden napumpovat třeba 500-600 férovými VB, teď už to nepůjde. Takže hráči jsou v podstatě tlačeni do zakládání push měst, aby nějaké VB do divů dostali. Legálně to už skoro nejde, když VB osekávají úplně odevšad [smilie--sprite3][BR][BR]příspěvky sloučeny. Jumala"}, {"68": "Já změny vždy vítám, když to nehati hru. Sama dělám běžné kolem 20 provincií a turnaj měl zůstat takový jaký byl doposud, aby Věž byla svým způsobem v boji jedinečná. Chápu, že chtěli udělat nějakou změnu a těm kteří pravidelně nahrávali více jak 10k to trošku utnout. Ale abych po téměř 4 letech, kdy si budují město, byla tím omezená mi přijde trošku nefér. [smilie--sprite3][BR][BR]Zajímalo by mě, jaké ohlasy to má na ostatních servech. Protože určitě se tohle nebude líbit více lidem. Ani bych se nedivila, kdyby to spoustu hráčů odradilo od hraní. Pokud je tohle lepší pro nižší hráče, tak budou trestáni vyspělejší?[BR][BR]Zkusím dodělat těch 20 provi na 6* jak běžné dělám a uvidím jaké ztráty budu mít. Většinou bojují automat. Manuál nikdy. I když nám dali do každé provi jeden boj, nehodlám vše dělat manuálně. Mám taky svůj osobní život...[BR][BR]Jediné pozitivum je ulehčení klikani v boji..."}, {"20": "@Emhyr var Emreis II - souhlasím, že to prvotní nadšení a města plná pomocných budov, to časem opadne. Pomocné budovy se navíc ne vždy snadno shánějí. [BR]Nakonec jsem otevřela 30 provincií, vše bojem, jen s nakrmeným Ohnivákem. Ztráty jsou o něco větší, než v minulém turnaji, ale dá se to zvládnout. [BR]Co se týče VB, když se hraje na 5 kol, je zisk VB celkem slušný. Jsem ráda, že velká klikačka je pryč, ale nové turnaje nám dávají určitá omezení, a to je nepříjemné. Jsem zvědavá na další kola a také na turnaje T2 a T3, nakolik budou těžší. Naopak se mi líbí, že střety jsou pestřejší."}, {"77": "Trumpetka napsal/a:\t\t\tDoplním jeden postřeh. Po reakcích z Bety a tohoto vlákna jsem čekal, že se zvýšením obtížnosti u vyšších provincií hned prvního kola (versus mé nadšenectví a pozitivní přístup) se posunu v žebříčku vpřed a rozšířím si svých 420 turnajových bodů nazobaných historicky za léta po pár kouscích. 16 provincií po prvním kole mi nepřijde na prcka málo. A místo toho jsem pozice 760 až 880. No kde se ti hráči/účty berou?\t\tKlikněte zde pro zvětšení...[BR]Trumpetko, asi ti přispěvatelé nepřejí těm malým v týmu, aby si připadali v turnajích za stejnou dřinu stejně tak užiteční jako oni a nepřejí jim, aby si získali i víc z turnaje odměn, a taky zřejmě těm, kteří si nadupali multiúčty všechny možné divy na takovou úroveň, že už nejsou ve velké výhodě nad jinými poctivci, se nelíbí, že jim ty vysoké úrovně divů teď budou škodit, jinak si ty negativní příspěvky nedokážu vysvětlit."}, {"151": "já nadšená teda rozhodně nejsem otevřu polovinu provincií než po staru nakrmený ohnivák zbrojíř a dva stromky a druhé kolo jen 15 provincií s toho prvních pět uplacených deset vojskem jen s kasáren ono totiž na cvičišti a v táboře žoldnéřů toho moc nevycvičím když nejsou kladiva a že bych chtěla mít město plné zbrojnic to teda nechci tak že velké mínus no a tím pádem pro mne kouzelné budovy ztrácí na hodnotě když se k plánkům na vylepšení nedostanu tak zas jeden negativní příspěvek nu což nebudu chválit něco co si pochvalu nezaslouží:-((("}, {"3": "luterina napsal/a:\t\t\tTrumpetko, asi ti přispěvatelé nepřejí těm malým v týmu, aby si připadali v turnajích za stejnou dřinu stejně tak užiteční jako oni a nepřejí jim, aby si získali i víc z turnaje odměn, a taky zřejmě těm, kteří si nadupali multiúčty všechny možné divy na takovou úroveň, že už nejsou ve velké výhodě nad jinými poctivci, se nelíbí, že jim ty vysoké úrovně divů teď budou škodit, jinak si ty negativní příspěvky nedokážu vysvětlit.\t\tKlikněte zde pro zvětšení...nepatřím ani do jedné skupiny. Byl jsem malý hráč a poctivě (bez jediného pushe!) jsem si vypracoval město, až se m i3x podařilo vyhrát celý turnaj. Všem malým přeju, aby si poctivou prací vybudovali podobnou pozici. Nechápu, proč se má komukoli cokoli... \"kompenzovat\"?[BR][BR]Vždyť o co jde? O těch pár bodů do pořadí? Jinak mohlo být každému šumák, co si kdo nahrál. Stačilo zrušit žebříček..."}]