[{"20": "Třetí kolo: provincie 25 - 30 nepříjemné ztráty. Ještě k tomu přispělo i pár střetů ve 3. patře věže. Sice vítězství, ale hodně vojáků na ošetřovně. Přikláním se k Lovci Krys, že pro mě bude do budoucna lepší držet se při zdi, neotvírat víc než 25 provincií, a zbytečně neplýtvat zdroji. Na provoz města v udržení množství kouzel, relikvií a run a pár VB to stačí. Nový turnaj je prostě hratelný, ale na velký rozlet to už není. Čas od času přidám k Ohnivákovi zbrojíře a pak to bude trochu lepší, ale bude to u mě spíš výjimka. [BR]Vzpomínáte na film Amadeus, jak Salieri žehná průměrnosti? Jsme tam ... [smilie--sprite3]"}, {"105": "2. kolo a provincie 15-22 polovina výkupy. I přes zbrojíře, ohniváka a stromky je soupeř tak velký, že ho moji 1* mágové nedokážou udolat dřív, než k nim ty 3*** příšery dolezou !!![BR][BR]aikomi napsal/a:\t\t\tZajímalo by mě, jaké ohlasy to má na ostatních servech. Protože určitě se tohle nebude líbit více lidem. Ani bych se nedivila, kdyby to spoustu hráčů odradilo od hraní. Pokud je tohle lepší pro nižší hráče, tak budou trestáni vyspělejší?\t\tKlikněte zde pro zvětšení...Ohlasy jsou na EN, US, DE, NL forech většinou záporné"}, {"150": "Děkuji za změnu. Efektivní a rychlé. Elve považuji za neskonale rozmanitou hru, každý si možná může najít své. Proto mi i zmiňované \"průměry a výjimečnosti\" v těchto diskusích dávají smysl, leč rozporu nevnímám. Připsáno budiž stařecké omezenosti, promiňte."}, {"59": "Ta hra je tak rozmanitá, že ti co zůstali, budou za chvíli sbírat jen mince."}, {"103": "Ve třetím kole trochu přituhlo, ztráty oproti předchozímu systému výraznější. Ale tím, že se dají cvičit tři fronty najednou, to jsem jakž takž schopná vyvážit, uvidíme, co kola 4 a 5."}, {"10": "Ludi napsal/a:\t\t\tTřetí kolo: provincie 25 - 30 nepříjemné ztráty. Ještě k tomu přispělo i pár střetů ve 3. patře věže. Sice vítězství, ale hodně vojáků na ošetřovně. Přikláním se k Lovci Krys, že pro mě bude do budoucna lepší držet se při zdi, neotvírat víc než 25 provincií, a zbytečně neplýtvat zdroji. Na provoz města v udržení množství kouzel, relikvií a run a pár VB to stačí. Nový turnaj je prostě hratelný, ale na velký rozlet to už není. Čas od času přidám k Ohnivákovi zbrojíře a pak to bude trochu lepší, ale bude to u mě spíš výjimka.[BR]Vzpomínáte na film Amadeus, jak Salieri žehná průměrnosti? Jsme tam ... [smilie--sprite3]Klikněte zde pro zvětšení...Mám to podobně, 30 provincií na dvě hvězdy, 24 na tři hvězdy a berličky, které jsem využil poprvé k vyběhnutí věže až nahoru. Ale těch jednotek co to sežralo. Ještě, že z posledního eventu jsem měl jednotky nasyslený. Pokud budou některé turnaje hratelné bez pomocníků třeba 6 provincií na šest hvězd, tak by to šlo, ale jinak nebudu stíhat v akademii vyrábět stromky."}, {"48": "Ale k tématu: dojela jsem na zkoušku 10 provincií (potřebovala jsem do DS nějaká kouzla), ale připadá mi jako bych nic nehrála, zase až tak moc to zkrátit nemuseli..."}, {"2": "Když sečtu změny, které proběhly, tak si nemůžu pomoci, ale jediný opravdový motiv mi přijde snížit dostupnost VBček.[BR]Postupně ze setů a levlovacích budov jsou tu města, která mají denní produkci VBček dvakrát i třikrát vyšší než je základ.[BR]V eventech bylo možné získávat dost budov, které VBčka dělali.[BR]Kola, studny, knihovničky, monumenty...[BR]A už nejsou.[BR]K tomu přidali pár věcí po kterých lidi už dlouho volali.[BR]Snížení počtu střetů, rozdělení výcvikových řad.[BR]Řeči o vyvážování a kompenzování jsou jen řeči.[BR]Vemte si jen ohnivého fénixe jeho dopad na nový systém je dramatický a nový hráči si o něm můžou nechat jen zdát.[BR]Takže stará města budou stále ve výhodě a nikdo nic neřeší."}, {"48": "GorGlin napsal/a:\t\t\tTakže stará města budou stále ve výhodě a nikdo nic neřeší.\t\tKlikněte zde pro zvětšení...[BR]Promiň, to je ale totožné třeba s tím, že bys chtěl přidělat k limitované edici artefaktu pro minulý rok další pro tenhle. Protože ti, co si ho koupili/vyhráli jsou \"ve výhodě\" a to je fujfuj... (obzvláště když já v té výhodě nejsem) [smilie--sprite11]"}, {"59": "GorGlin >> Tohle jsem přesně chtěl několikrát napsat, že jim šlo jen o omezení odměn jako jsou VB (a věděl jsem, že to tak bude, ještě když jsem hrál, a tu se to neustále řešilo), ostatní jako vyvažování je jen jakási zástěrka (kromě toho, rozdíly pokroku ve městech jsou logický stav, nevidím ani důvod něco vyvažovat, tak by to mělo být, a nevím proč by někdo na začátku hry měl snášet srovnání s někým na konci hry)."}, {"41": "Ja se chci zeptat, oplatí se tedy dozkoumávat Vylepšení velikosti oddílu? Tedy ta nepovinná? Nebo se to ani neoplatí? Nejak už nevím čemu mám v tý hre verit.. :/"}, {"24": "Výhodami preskúmania týchto technológií sú ľahšie boje v provinciách na mape a vyššia produkcia jednotiek z divov. Keďže sa turnaje podľa toho už nepočítajú, jedinou nevýhodou je, myslím že niekto niekde spomínal že sa tým o kúsok zvýšia požadované jednotky na tréning v úlohách, ale to je podľa mňa zanedbateľné."}, {"41": "Takže na turnaj to už nemá žáden vlyv, takže si všechny mužu klidne dodelat? Chápu to správne? Čím se tedy tedka dá turnaj nejak zjednodušit? Jen tím,že si nebudu kupovat rozšírení a nebudu vylepšovat divy?"}, {"2": "Podle informací které šli na začátku má vliv i velikost oddílu, jen ne takový a jsou i další věci které to ovlivnují.[BR]Já jsem jedno rozšíření dozkoumal po začátku turnaje a velikost oddílu v turnaji mi zustala stejná."}, {"3": "myslím, že vliv má obecně pokrok ve výzkumu, takže velikost oddílu je prostě braná jako další výzkum a tedy trochu přítěží. Přínos by měl ale převážit. Prý, snad. Zatím čekám [smilie--sprite1]"}, {"16": "Má vliv povinná technologie, takže jen nepokračování ve výzkumu zabrání vlivu povinných rozšíření oddílů na turnaj. Ale vzhledem k počtu výzkumů je zrovna vliv oddílu zanedbatelný.[BR]Vyzkoumání nepovinného oddílu velikost nepřátelského ani hráčova oddílu v turnaji nijak neovlivní.[BR]Takže zkoumat/nezkoumat je teď již jen o tom, zda hráč chce produkovat více jednotek v divech nebo nechce plýtvat VB/surovinami na výzkum nepovinných oddílů.[BR]Kdo nemá divy produkující jednotky, tak asi je zbytečné je zkoumat (leda snad na úkol do eventu), kdo naopak má (skoro) všechny, tak jejich vyzkoumáním si zadarmo zvýší produkci."}, {"41": "Dekuju za info [smilie--sprite1]"}, {"3": "tak pokud je to nic proti ničemu, tak si to vyzkoumám během eventu, až přijde příslušný úkol."}, {"77": "Zatím si v turnaji nastavuji laťku, měla jsem něco našetřených surovin, tedy problém dát na výkup 35 provincií na 2* jsem neměla, ale udržitelně to vidím na možnost výkupu jen na 1*, další uvidím až po konci turnaje, ale jedno je jisté, bez Ohniváka a zbrojíře + alespoň 2 stromků, se turnaj na vojáky jet moc nevyplatí na nějaké ty rozumné odměny, co mě však těší je to, že jsou konečně využité body za 10. truhlou ve formě přírůstku dalších odměn, sice to není žádné terno, ale každá, díky tomu, na víc PV a KR se jistě bude hodit."}, {"2": "Já sem příjemně překvapen, že na začátku turnaje nechali začátečnické jednotky."}]