[{"137": "Podle prvních zkušeností průběh turnaje odpovídá tomu, co psali vývojáři. Začátek lehčí než v minulém turnajovém systému. Nad 20. provincii silně přituhuje a stejně tak ve vyšších kolech.  Celkově ovšem spokojenost - ve společenství se dá lépe uhrát 10 beden i více a dá se tedy soustředit na Věž.  Bohužel - a to mě mrzí - úspora času je menší, než jsem počítal, načítání mezi jednotlivými provinciemi je zoufale pomalé. Hraju na PC - odzkoušeno v  Google Chrome i Firefox."}, {"2": "Mě zdržuje hlavně ta náhodnost střetů.[BR]Dřív se mi zobrazila sestava očekávaných jednotek, kterou jsme snadno a rychle vyhodnotil a nasadil jednotky.[BR]Ted tam mám všelico včetně pěti různých jednotek[BR]nad tím se musím zamyslet"}, {"77": "já je na automat nejlépe uhrála ( ale záleží i na síle a druhu jednotky - kasárna, cvičiště, tábor,.. taky na rase - jestli elf nebo člověk a pomocných budovách - luk a mág potom můžou být silnější)  na 2 Mág, 2 Obrstřelec, 1 Meč,  nevím jak na manuál, tam to možná bude složitější, počítá se i s terénem"}, {"105": "já hrál téměř vše 5x kušník nebo 5x kněz. Od provincie 15 jsem kvůli ztrátám radši vykupoval ( přestože jsem měl jak zbrojíře, tak ptáka level 7). Mám jen 2** střelce a 1* mágy a proti dvojnásobné přesile *** soupeřů už to moc nešlo ubojovat, a to ani ručně. V minulosti jsem to dával v pohodě na automat bez jakýchkoliv výkupů. Proto za mě mínus. I když jako spolek jsme dali 12truhel a spousta hráčů si nahrála osobáky. Ale tento turnaj byl extrémně jednoduchý, počítám, že příjdou mnohem složitější věci. Ty zbabělé výkupy pak sráží zábavu na nulu. Tož tak  [smilie--sprite2]"}, {"124": "Já na výkupy kašlu a hraji hlavně na manuál Bohužel jsem neměl naverbováno,ale i přes to se dalo prvních 12provincií uhrát v pohodě na 6hvězd bez zbrojíře nebo stromečků Chyba,že jsem neměl víc vojska nebo aspon zbrojnice Dalo by se nahrát víc"}, {"152": "Jenom 19 beden? Víc jich není?"}, {"153": "Po 19 bedně jsem stratila motivaci, mohli  jěště pár beden přidat"}, {"16": "Jen si plýtvejte zásoby (zejména pomocné dočasné budovy) rychleji než je jejich příjem. Však ony vám dojdou.[BR]A že bych měl chuť strávit každým kolem turnaje 2 hodiny manuální boje? Ne, díky, to raději odklikám turnaj za 15 minut a pak se můžu věnovat mnohem zábavnějším věcem.[BR]Akorát už z turnaje nemám žádné body (poprvé po několika letech), což vzhledem ke konstantnímu bodování mi už může být jedno, ještě pár kapitol a budou na tom body z turnaje jako body z mapy."}, {"78": "Konečně změna. Předtím to bylo jen bezduché klikání a to mě nebavilo, proto jsem v minulosti jela turnaj jen občas naplno.[BR]Měla jsem otevřených 51 provincií a podle toho co jsem viděla a otestovala, budu těch 50 provincií zvládat pokaždé.[BR]Jo a nemyslím si že půjde o nějaké plýtvaní, jak tu někteří naznačují. Je to hra a mě konečně turnaje baví. [smilie--sprite2]"}, {"103": "Za mě turnaj dobrý. Velká úspora času, výsledek zhruba stejný (tedy, o něco nižší, protože jsem z opatrnosti otevřela ve vyšších kolech o něco méně provincií, nevěděla jsem, jak rychle se budou nároky zvětšovat, ale příště pojedu na obvyklé množství), ztráty vojska možná dokonce o něco menší. Jediný problém vidím v tom, že kdybych otevírala další provincie, už bych nebyla schopná postavit těch pět příslušných oddílů (třeba mágů), ačkoli jich mám stále plná kasárna. Ale těch 30 provincií na 5 hvězd, jak to obvykle dělám, se mi nejeví jako problém. Jako společenství jsme udělali 12 truhel, takže taky v pohodě (i když to možná v budoucnu nebude, protože se zapojilo víc hráčů než obvykle, asi si to každý chtěl vyzkoušet)"}, {"20": "Hodnotit turnaj, po prvním mramorovém, je předčasné. Uvidíme, co se bude dít v dalších.[BR]Zatím hráči, kteří měli dřív v turnajích slabší výsledky, se o něco zlepšili, takže získat víc než 10 truhel nebude problém. V Trubadúrech jsme tentokrát neměli vůbec v plánu hrát na 10 a zvládli jsme 11. Jen tak, levou zadní [smilie--sprite2].[BR]Ve Sci-fi, kde jsou silnější hráči, jsme dali v pohodě 14 beden a náš adnall šel do boje o první místo. Jenže ElfNostradamus nakrmí dva Ohniváky a to se porazit jen tak nedá [smilie--sprite1] a navíc je to prostě hráč.  Ale i tak se adnall držel skvěle. Má rád ruční boj, takže to je teď výhoda.[BR]Já nakonec dala s jedním Ohnivákem a bez další pomocné budovy 33 provincií na 6 kol. Boje musí být přesnější, ztráty si musím pečlivě hlídat. Je to prostě hratelné, ale nejsem si jistá, kolik provincií příště otevřu. Uvidím, jak budou střety v ocelovém vypadat. Nechci nic přehánět a hráče ve svých spolcích nikam nehoním. Proč taky. Nejde nám o honbu na další bedny. Čím méně naše hráče honím, tím lépe hrají [smilie--sprite1], protože jsou prostě skvělí."}, {"109": "Měl jsem trochu obavy z nového turnaje, ale nakonec to hodnotím pozitivně. Reakce členů u mě ve společenství jenom pozitivní. Hráči, kteří nebyli schopni dostat se přes 3000 bodů, najednou zahráli přes 5000. Vzali jsme akorát 10 beden, na jedenáctou už nedošlo, ale to mi až tak nevadí.[BR]Obecně se jeví, že nový systém turnaje je hratelnější pro více členů společenství a hráči jsou schopni nahrát víc bodů. Jednoznačně je rychleji odehraný. Trochu mě překvapilo, že hráči u nás ve společenství pozitivně hodnotí různorodost jednotek.[BR]Všichni se shodli, že nový turnaj je lepší.[BR]Uvidíme, co přinesou další turnaje."}, {"5": "Stále jsem se nikde nedočetl jaká je přesná formule na zvyšování obtížnosti v turnaji /vyloučit můžeme tzv. vylepšení velikosti oddílu z výzkumu - sám i vyzkoušel, vliv není/ . Takže pokud někdo ví nebo se někde dočetl přesný výpočet na formuli k vlivu na obtížnost turnaje, tak prosím sem s tím [smilie--sprite1].... na kolik přesně hraje roli: počet rozšíření, velikost lv v divech, postup v kapitolách a výzkumu?      [BR]Ano, nový turnaj byl ve vyšších kolech a se zvyšujícím se počtem provincií o dost náročnější než starý to rozhodně! Skladba jednotek je náhodná a ta pestrost složení nutí k ostražitosti a to především tehdy, když je iniciativa na straně soupeře /mlžná chodkyně/. Dříve jsem odehrál vše de facto pouze na manuál, nyní asi jen 50% všech bojů. 30% manuál nevyhnutelně /nebo alespon´ minimálně nahlédnout na terén a rozestavění/, protože ve vyšších kolech a provinciích jsou každé ztráty vojska velmi citelné! 20% přímý odkup, což tolik nebolelo vzhledem ke skladbě města a jeho možnostem /snad jen orci budou do budoucna určitě chybět a s novou rasou jistě nějakou zbrojnici určitě přidám/. Každopádně manuál pak bere hodně času, takže ten ušetřený čas ze sloučení jednotlivých střetů v provincii /což moc kvituji/ nakonec hráč stejně nechá v manuálních bojích, které jsou nevyhnutelné. Aktuálně ležím, takže mi to bylo jedno, ale jinak ,,sorry,,  svého osobního volného času si moc vážím a za mne ho raději využiji lépe s rodinou než v manuálním boji ve hře.[BR]Závěr: z prvních zkušeností a ozvěn lze odvodit, že turnaj bude lépe hratelnější než dříve pro menší a středně pokročilá města a budiž jim i přáno!... a žel obtížnější a nákladnější pro pokročilejší města /zde jim zůstává drobná výhoda v možnosti využití více otevřených provincií, pokud se ovšem hráč k těm vyšším vůbec dostane - otevřel jsem 73 provincií a na nich odehrál 2.kola - zde opravdu velmi nutné kvalitně doplněné a nakrmené město/.[BR]Finále: viditelně zkušený hráč s dostatkem času a trpělivosti, kvalitním městem a podporou zvířectva a pomocných budov, může pomýšlet občas dost vysoko v turnaji, přesto nutno s vojskem, surkami, krmením a budovami hospodařit obezřetně, protože turnaj se hraje každý týden.[BR]Necht´se všem daří. [smilie--sprite1]"}, {"11": "tak jsem z toho blázen [smilie--sprite1] Celou dobu jsem tady četl jak se vyplatí vyzkoumat všechny oddíly a ted zase ne?"}, {"5": "vyzkoumat oddíly se vyplatí na výrobu v divech na turnaj to nemá vliv...oddíl mého vojska ani soupeře se po vyzkoumání nezměnil"}, {"11": "a neprojevuje se to až v dalším turnaji a ne v tom rozehraným?"}, {"103": "No, já třeba v naprosté většině případů použila jenom mágy, občas doplněné něčím jiným (řekla bych, že tak 90 % toho, co jsem použila, byli mágové), měla jsem je podpořené 2 magickými násobiteli (a ještě jedinečným vylepšením jednotek, které pomáhá všem, a osvícenou střelnicí pro lehké střelce, a ohnivákem)."}, {"5": "Voyager...otázka pro božstvo z Inna [smilie--sprite1]"}, {"24": "Prejavuje sa to až s ďalším..[BR][BR]Zhrnutie toho, aký má teraz vplyv preskúmanie nepovinných veľkostí oddielov:[BR][BR]+ zľahčí boje na mape[BR]+ zvýši produkciu jednotiek v divoch[BR]- zvýši mierne nároky v úlohách vyžadujúcich tréning jednotiek[BR][BR](to posledné je podľa mňa zanedbateľné)"}, {"38": "@ElfNostradamus[BR]Asi takhle:[BR][BR]\t\t\thttps://cz.forum.elvenar.com/index.php?threads/verze-1-111.6689/post-124184\t\t[BR]Odpověď takto:[BR][BR]\t\t\thttps://cz.forum.elvenar.com/index.php?threads/verze-1-111.6689/post-124193\t\t"}]