[{"59": "Ať mi nikdo neříká, že z těch co netrhají rekordy v jakémkoliv nastavení (ti co dají bez pomocných budov i teď např. 60), nahraje stejně, většina se tu zmínila něco kolem 20-30 provincií, to pak asi v zrušeném turnaji vůbec nehráli. A mám na mysli starší hráče, ne ty co neměli dostatek provincií. Myšleno odměny ze střetů, ne body."}, {"109": "@ElfNostradamus,  hráč minmax(aspoň doufám, že se tak označuje), odvodil následující rovnici pro výpočet.[BR][BR]Červeně označené jsou proměnné, které ovlivňují výkup nebo velikost soupeřova oddílu, s tímto významem[BR]maxB – maximum odemčených procent T1/T2/T3 vylepšeného zbožíM – celkové číslo odemčených povinných výzkumůA – celkové číslo úrovni divůV – počet umístěných neprémiových rozšíření (včetně úvodních 6)P – počet umístěných prémiových rozšíření.Jeho výpočty s jakousi zaokrouhlovací chybou sedí.[BR]Odkaz zde."}, {"11": "no a co z toho vyplývá? lepší je mít vyzkoumané nebo ne? [smilie--sprite1]"}, {"109": "Z toho plyne, že nepovinný výzkum nemá vliv na velikost jednotek ve věži nebo v turnaji. Dále z toho vyplývá, že čím více rozšíření máš umístěno tím těžší bitvy budou, čím více divů a jejich úrovni, tím těžší bitvy, o co více jsi dál ve výzkumu o to máš těžší bitvy, čím větší procento z podpory relikvií na posílené zboží, tím těžší bitvy. Resp. Místo těžší bitva můžeš použít dražší výkup"}, {"2": "z toho vyplývá, koumej co to dá"}, {"110": "Ahoj. [BR]Tak za \"začátečníky\" (momentálně v orcích) mohu říct, že zatím extra změnu nepociťuji. Dosud nemám vyzkoumané nepovinné vylepšení jednotek. Jsem sběratel veškerých prastarých divů (do trpaslíků) a některé mám na 12. úrovni. V turnaji jsem využil jedinečné vylepšení jednotek a po dvou stromech střelnice a magického násobitele.[BR]Měl jsem otevřeno jen 21. provincií a dohrál je do plnejch. Píšu jen, aby zde byla zastoupena i skupina těch slabších [smilie--sprite1]. Nicméně budu očekávat, že boje budou těžší a těžší. Trest za výzkum a postup mi úplně smysl nedává.[BR]Ryny"}, {"2": "zkus uhrát všechny otevřené provincie a pak okomentuj rozdíl[BR]jsem zvědav na tvoje postřehy"}, {"68": "@Ryny Když máš tolik podpůrných budov, tak to ani nemusíš tolik pocítit. Kdyby jsi to jel bez toho, tak by jsi poznal rozdíl. Já měla nakrmeneho pouze ohniveho Fénixe. Neříkám, že se to nedá, ale ty ztráty byly. Dokonce jsem musela často vykupovat, na to nejsem zvyklá... Ten limit je znát..."}, {"96": "Mám vyzkoumané město trpaslíků, postavené ty dostupné divy na podporu bojů + ohnivák na 2 level. Dohrál jsem všechny dostupné provincie se základem posilových budov (magický násobitel 1x) bez větších potíží až na posledních 6 bojů na šestých hvězdičkách. V těch jsem ztratil víc vojáků než v celém předcházejícím průběhu turnaje. To považuju za nevyvážené.[BR]PS: a nepovinné výzkumy na velikost oddílu většinou nedělám, myslím, že záporný vliv mají."}, {"110": "GorGlin napsal/a:\t\t\tzkus uhrát všechny otevřené provincie a pak okomentuj rozdíl[BR]jsem zvědav na tvoje postřehy\t\tKlikněte zde pro zvětšení...Z toho co jsem napsal je zřejmé, že nejsem na takové úrovni jako většina přispěvatelů. Jen abych zareagoval. Já všechny otevřené provincie projel dokonce. Jen jsem jich měl pouze 21. Tedy přesněji řečeno 23, ale poslední 2 jsem otevřel pár hodin před koncem turnaje, takže jsem je logicky nedohrál.[BR]Ryny[BR]PS: nechápu ten útočný tón, jen jsem napsal svoji zkušenost. Nehledě na to, že změny v turnaji nijak nevítám.[BR][BR]aikomi napsal/a:@Ryny Když máš tolik podpůrných budov, tak to ani nemusíš tolik pocítit. Kdyby jsi to jel bez toho, tak by jsi poznal rozdíl. Já měla nakrmeneho pouze ohniveho Fénixe. Neříkám, že se to nedá, ale ty ztráty byly. Dokonce jsem musela často vykupovat, na to nejsem zvyklá... Ten limit je znát...\t\tKlikněte zde pro zvětšení...To je mi jasný [smilie--sprite1]. Proto v akademii přednostně vyrábím veškeré posilovací budovy. Nicméně tenhle turnaj byl výjimkou, ve které jsem mohl uplatnit ty, kterých mám dostatek. V dalších turnajích už to bude horší. [BR]Ryny[BR][BR]// Příspěvky sloučeny. Jumala"}, {"109": "Thuria napsal/a:\t\t\t...... PS: a nepovinné výzkumy na velikost oddílu většinou nedělám, myslím, že záporný vliv mají.\t\tKlikněte zde pro zvětšení...Už nemají, ale měly."}, {"154": "Ocelový turnaj byl takový miloučký, oddychový. Teď je to \"Texaský masakr motorovou pilou\""}, {"3": "Prealiena napsal/a:\t\t\tTaké připojím od Donyho z bety hezky graficky ztvárněné rozvržení typů jednotek v jednotlivých turnajích. T3 budou nejhorší.[BR]Zobrazit přílohu uživatele 4946Klikněte zde pro zvětšení...tak jsem se poctivě na ocelárnu podle \"návodu\" připravoval a te´d to po mě chce snad v 66 % luky... humáč"}, {"11": "a to je přehled jednotek co jsou v provinciích ? To by u mně vycházelo, mám převážně střety pro lovce,"}, {"3": "ha, jsem já to ale... *hlupáček*... hned to dává smysl. Pochopil jsem to tak, že to je spíš seznam vlastních nasazených jednotek, ne nepřátelé... [smilie--sprite3] mea culpa"}, {"11": "jsem si myslel že jsi to pochopil obráceně [smilie--sprite1][BR][BR]ale šikovná tabulka"}, {"109": "XB238 napsal/a:\t\t\tOcelový turnaj byl takový miloučký, oddychový. Teď je to \"Texaský masakr motorovou pilou\"\t\tKlikněte zde pro zvětšení...ale není, jen nesmíš otevírat 10. a vyšší provincii.....[smilie--sprite2][BR]jen tak pro zábavu: 33.provincie 2* : moje velikost jednotek 6133, soupeř 12412 (2xmágové 3103, orkové obrnění střelci 2068, střelec bandita 12412 a zlodějka lehkooděnec 12412) [smilie--sprite12]. tak jsem si došel pro pyrhovo vítězství přes boj... 70% mých jednotek lehlo - RIP."}, {"124": "no tak tohle je pěknej humus Mám otevřených 22 provincií odehráno na 2hvězdy a jatka Radši do dalších ani nejdu Stromečky a zbrojíře ted používat opravdu nechci páč příjdou horší turnaje:-("}, {"68": "Ne, ne, ne!!! Snažila jsem se dát novým turnajům šanci, i když už bylo jasné, že to bude katastrofa. Nelíbí se mi to. Nechci je. Takhle změna je ta nejhorší, co se mohla do hry zavést.[BR]Je to šlichta, teď budou všechny turnaje na stejné brdo v tom, že to bude tak prekombinovane, že to ztratilo své kouzlo. Každý turnaj měl něco svého, své vojáky teď to nemá nic. Nesmyslné jednotky. A to upozorňují, že upřednostňují boj před výkupem...[BR]I s nakrmenym ptákem a s trpaslicim zbrojirem je boj těžší. Tak na co mi jsou ty podpůrné budovy? To jich mám postavit 10 ? Abych na tom nebyla hůř?[BR][BR]Většinou nejsem kritická, ale za mě jedno velké NE. Teď to budu hrát s velkou nechutí. Opravdu mám nejraději chuť se na to vykašlat...."}, {"112": "Nu, tak u mne se názor nezměnil. Je to paráda! Postupně přidávám podpůrně věcičky (minule při mramoru nic, nyní krmím Ohniváka - 40%, příště při dřevu nasadím stromečky). Krásně si vyhraju - zhodnotit, nakouknout, většinou manuál lze (provincie 20 na *** a skoro beze ztrát). Když se mi to nezdá, klepnu vykoupit (výkupy jsou nyní opravdu značně levnější než to bývalo!). Turnaj na klepačku mě nebavil, udělat si z něj rejžovačku odměn mě nikdy nelákalo."}]