[{"16": "Trumpetka napsal/a:\t\t\t(výkupy jsou nyní opravdu značně levnější než to bývalo!)\t\tKlikněte zde pro zvětšení...Pouze pokud máš štěstí a výkup je jen v T1/T2/T3 a ne v mincích, kladivech, maně a orcích. Orkové zdražili a ostatní vyjmenované suroviny ve starém turnaji vůbec nebyly, takže mluvit o levnějším výkupu je nesmysl. A mince a kladiva jsou navíc zastropovány, takže si nemůžeš nasyslit miliardu mincí a sto milionů kladiv na výkupy. A požehnání taky není nekonečně a jejich zdroje jsou omezené, takže třeba pro mne je výkup mnohem omezenější než dříve a obvykle chytnu mince/kladiva zrovna, když jich mám málo, takže buď můžu vyplýtvat omezené požehnání anebo nemít výkup jako možnost."}, {"112": "Možná by bylo dobré přidávat k příspěvkům kapitolu, ve které se daný hráč nachází. Forseti vlákno nějak nazval a uvedl - toho se držím. Ani v nejmenším ti nebudu vyvracet tvůj náhled, když jsi ve hře jinde - v naprosto jiné kapitole. Respektuji tvé (a nejen tvé) komentáře k obtížnosti pro větší hráče a fandím vám, aby se s tím postupně něco udělalo.[BR][BR]Lovec Krys napsal/a:\t\t\t, takže mluvit o levnějším výkupu je nesmysl.\t\tKlikněte zde pro zvětšení...- u mne to tak je, výkupy za 4 dřívější boje oproti nynější sumě mě dříve vyšly víc, navíc mám přebytky mincí a zásob a i ty mi občas nahradí surovinu[BR][BR]shrnuto to bylo krásně zde[BR]ElfNostradamus napsal/a:\t\t\tZávěr: z prvních zkušeností a ozvěn lze odvodit, že turnaj bude lépe hratelnější než dříve pro menší a středně pokročilá města a budiž jim i přáno!... a žel obtížnější a nákladnější pro pokročilejší města /zde jim zůstává drobná výhoda v možnosti využití více otevřených provincií, pokud se ovšem hráč k těm vyšším vůbec dostane - otevřel jsem 73 provincií a na nich odehrál 2.kola - zde opravdu velmi nutné kvalitně doplněné a nakrmené město/.[BR]Finále: viditelně zkušený hráč s dostatkem času a trpělivosti, kvalitním městem a podporou zvířectva a pomocných budov, může pomýšlet občas dost vysoko v turnaji, přesto nutno s vojskem, surkami, krmením a budovami hospodařit obezřetně, protože turnaj se hraje každý týden.[BR]Necht´se všem daří. [smilie--sprite1]Klikněte zde pro zvětšení..."}, {"16": "@Trumpetka Aha, trpasličí město, pak chápu. První šok přijde v lesních elfech (orkové na výkup), další pak s manou v čarodějích (nové suroviny v turnaji mají kapitolu zpoždění oproti výskytu těchto surovin ve hře)."}, {"154": "prchlik napsal/a:\t\t\tale není, jen nesmíš otevírat 10. a vyšší provincii.....[smilie--sprite2]Klikněte zde pro zvětšení...[BR]Nj, ale já byl v ocelovém zvyklý otevírat maximum [smilie--sprite2] a to maximum dojet co nejdál."}, {"110": "Lovec Krys napsal/a:@Trumpetka Aha, trpasličí město, pak chápu. První šok přijde v lesních elfech (orkové na výkup), další pak s manou v čarodějích (nové suroviny v turnaji mají kapitolu zpoždění oproti výskytu těchto surovin ve hře).\t\tKlikněte zde pro zvětšení...Ahoj. [BR]Jsem v orcích a už se na to děsně těším :-(. Naštěstí jsme společenství s relativně novými hráči a těch deset truhel kvůli plánku a rekonstrukcím snad udržíme i nadále ;-). [BR]Ryny"}, {"109": "Druhé hodnocení. Když jsme hodnotil prvně, tak si to hráči v mé družině chválili. Ale to se neozvali ti s vyšším pokrokem. A u nich je ta reakce obdobná všem negativním zde.[BR]Výkup vidím celkově výhodnější jak boj ve srovnání s předchozím turnajem. Má to ale. A to ale je, a už to uvedl @Lovec Krys , výkup přes kladívka, mince, orky a manu. Když je výkup za 150k kladívek, 8tisíc orků a 32tisíc many.....tak to fakt ne. Když je výkup jenom 10-15tisíc T1, T2 a T3 tak se zasměju a směle vykoupím.[BR]A je jasné, že města s rozvinutými divy, pokročilým výzkumem a mnoha položenými rozšířeními budou bita. Resp. jsou bita v porovnání s předchozím turnajem.[BR]Míra velikosti města a jeho vyspělosti je v rámci turnaje totálně smazaná a bohužel nynější princip hry je postaven na tom,  město v kapitole orkové zastropovat a dál nerozvíjet. Pokud se tedy chcete účastnit turnajů.[BR]Na druhou stranu kvituju, že turnaj není jednotvárný z hlediska jednotek. Je zde ve vlákně i tabulka s jakýmsi pravděpodobnostním rozložení, které jednotky se budou vyskytovat. Takže se dá trochu na ten turnaj připravit.[BR][BR]Suma sumárum:[BR]Plusy:[BR]- jednodušší dostat do turnaje slabší města[BR]- o něco jednodušší pro společenství se dostat k 10bednám[BR]- relativně levnější výkup přes suroviny[BR]- rychlejší odehrání turnaje (sloučení 4 bojů do jednoho)[BR]- pestřejší jednotky v boji[BR]Mínusy:[BR]- naprosto nesmyslné počty soupeřových jednotek již v prvních kolech od 25. provincie výš[BR]- degradace vyspělých a rozvinutých měst[BR]- ve výkupu je mana, orkové v naprosto ustřelených číslech, zejména ve vztahu k jejich velmi omezenému příjmu a zároveň nárokům z hlediska rozvoje města[BR]- nový turnaj demotivuje hráče rozvíjet město[BR]- nemožnost částečně vykoupit[BR]- degradace pomocných budov, tzv. stromečky[BR][BR]Uvedl jsem 5 plusů a 6 mínusů. Možná by někteří z Vás napsali další. Za mě musím ve finále konstatovat, bez ohledu na počet plusů a minusů, že mínusy jednoznačně převládají a bohužel z hlediska hratelnosti vnášejí do hry nesmyslný trest pro hráče s rozvinutým městem. A to je bohužel obrovská chyba, kterou Inno dělá, protože se nejedná o rozdíl ve změně strategického chování. Ale toto má fatální dopad na další rozvoj města a každý hráč, který bude své město rozvíjet, tak si bude muset položit otázku. Má smysl dělat město lepším, když vše kolem se mi zhorší? upřímně píšu, já v tom bodě zrovna jsem. Jsem na začátku kapitoly půlčíků, ale již silně zvažuji, jestli vůbec pokračovat dál, protože mě daný systém nabádá k tomu, abych skončil a dál už nepokračoval. Respektive pokračovat se dá, ale bez nějakého rozvoje, vylepšit co se ještě vylepšit dá, ale už se neposunovat ve výzkumu, nevylepšovat si divy, nepokládat další rozšíření atd. atd. V takovém okamžiku je ovšem daná hra mrtvá a hráči nemůže dávat žádný smysl.[BR]Toť tak vše, co jsem chtěl vyjádřit."}, {"20": "V novém turnaji bych většinu věcí akceptovala, přizpůsobím se, ale strašně mi vadí obrovská jednotka a přesila, proti které musím jít. Pak jsou ztráty vojska zbytečně moc velké a to mě štve. Výkup je někdy naprosto nesmyslně drahý. Takže jsme zase zpět u formule velikosti oddílu na věž a teď i na turnaj. Až začneme novou 17. kapitolu, tak se všechno zhorší. Výzkum na to má největší vliv. Tohle by Inno vážně mělo přehodnotit.[BR]Pauleo ukončil hru, což mě mrzí, ráda jsem si s ním povídala."}, {"110": "K tomu co napsal Prchlík cit.: \"Respektive pokračovat se dá, ale bez nějakého rozvoje, vylepšit co se ještě vylepšit dá, ale už se neposunovat ve výzkumu, nevylepšovat si divy, nepokládat další rozšíření atd. atd. V takovém okamžiku je ovšem daná hra mrtvá a hráči nemůže dávat žádný smysl.\" mohu pouze napsat, že hru hraji právě kvůli výzkumu a postupu ve hře. Rozhodně to neobětuji kvůli turnajům. Prostě je natolik omezím, abych týmu přispěl svým dílem, abychom dosáhli na plánek a pak ho prostě hrát nebudu. Snad se vývojáři časem umoudří a pochopí, jakou chybu udělali.[BR]Ryny"}, {"44": "32 provincie - 10M minci ,130k mramor, 210k many  boj 39000 vs 82500 .[BR][BR]Měl jsem rád turnaje ale tenhle paskvil at si strci do mist kde slunce nesviti . stejne jako ve vezi ,mesta v nizsich kapitolach udelaji pres minimalni vykup to same jako velke mesto za tisicinasobek . A vychcanci stejne jako ve vezi naplni spolky mestama kolem 5-6 kapitoly a za deset minut hotovo. Jako chapu ze novej hrac asi zaplati radeji nez lidi co tu hru hraji roky ale je to zabavne ? neni ! [BR]Ano starý system byla klikacka ale dalo se pripravit atd . tady jedina strategie spociva v umeni umet skoncit driv nez si vymlatis jednotky na mesic dopredu za nic ."}, {"48": "K novým turnajům po informacích od ostatních asi toto: pokud končí s hrou i hráči dosti aktivní na fóru jako třeba Pauleo, tak tady \"vidím velký špatný\".  Inno vymyslí strategickou budovatelskou hru a hráč, který ji hraje, je za budování (smysl hry) trestán?  [smilie--sprite11] Proč tedy jsou turnaje? Buď tedy budeme mít budování a vylepšování nebo bojování. Už moji prarodiče říkali \"neopravuj to, když to není rozbité\"...."}, {"16": "@prchlik Kdyby jenom 32 tisíc. [BR]Výkup 20. provincie na 6*:[BR][IMG]https://i.ibb.co/Ld9XRQ4/https-cz-forum-elvenar-com-index-php-attachments-1602780488469-png-5000.png[/IMG][BR]Pro ilustraci (kapacita hlavního sídla 54M, křišťálu mám přes 900k a many 1,8M (aktuálně krom občasného vylepšení některých divů mimo výkupů ve věži v podstatě nepoužívám))[BR][BR]Pro srovnání střet ve 3. patře věže (tady je potřeba počítat, že každá surovina je platbou za pokus, nikoliv 100% ceny jako v turnaji):[BR][IMG]https://i.ibb.co/bB1WYjq/https-cz-forum-elvenar-com-index-php-attachments-1602780681131-png-5001.png[/IMG]"}, {"104": "Možná proto, že jsem jen v elvenarech, tak vidím ve změnách v turnaji jen plusy. Nepociťuji žádnou demotivaci v rozvoji města a stejně tak žádnou degradaci \"stromečkových\" budov. Ano, střelnice už není tak atraktivní, protože nevím, kdy ji postavit (teď na ocel by se hodila), ale to je jen otázka času, kdy bude jasné, kdy je nejvhodnější ji použít. Vylepšení jednotek je ovšem použitelné univerzálně.[BR]Velký plus je za zkrácení času - dřív mi trvalo hodinu, než jsem vše oklikal - hodinu na jednu úroveň přes všechny provincie. Teď je to čtvrtina času a to se počítá. Nemám problém s tím, abych končil na 8 tisících (nebo méně, podle typu turnaje) a nechal i ostatní ve společenství, ať se zapojí - ne na 10 beden, ale zatím to vypadá na 12-13 a asi bude i víc. I dodatečné odměny (byť by mohly být vyšší), je příjemný bonus změny.[BR]Pravda, nevykupuji. Těch 40 provincií v prvním a druhém kole dělám bez problémů vojskem a pak to omezím na 30 a postupně 20 a nakonec třeba jen 15. Hlavně kromě prvního kola není nutné dělat všechny provincie a když vidím, že nějaká mi není jasné co se složení vojska týká, tak ji prostě nechám být a jdu na další. [BR]Znovu, za mně vidím jen pozitiva této změny."}, {"155": "Co se novýho systému týká tak jsem docela rozpolcenej. Na jednu stranu \"by bylo\" super úspora času, ale díky tomu že jak už tady padlo mockrát, bez manuálu se to občas nedá, tak bych byl na stejným čase jako před tím. A to už fakt nehodlám, Takže výkupy. No ještě před pár dny jsem si řikal že už se v základních surovinách nedostanu na nulu protože sklady byly milionový a ejhle, 2 turnaje a jsem žebrák [smilie--sprite1][BR]Takže i když jsem se na tento systém těšil a poslední dobou turnaje moc nehrál a čekal až na novej systém, tak je to v tomhle ohledu mírné zklamání. Ale fakt jen mírné, jen z té obtížnosti, přece jen je to mnohem pohodlnější než před tím, mít to zfouknutý za pár minut. Takže tak nějak lehce nadpoloviční spokojenost.[BR]No ale mysleli tvůrci na lidi na telefonech? Tam bez manuálu to bude asi nehratelný... Ale jinak, až na tu šílenou obtížnost dávám palec nahoru.[BR]Každopádně ještě k tomu xxx krát probíranýmu vylepšení oddílů. Zajímalo by mě teda jak to funguje. (řečnická otázka, vím že mi na to nikdo neodpoví)... Nepovinné oddíly jsem vynechával zhruba od kapitoly elfů. A bohužel (nebo bohudík???) jsem se nechal zblbnout tvrzením tvůrců že dokončit nepovinné oddíly se vyplatí. Takže u prvního turnaje minulej tejden jsem udělal malej pokus.[BR]Jel jsem pořád až do první prohry, tam přišla tuším v provincii 23. Každopádně vím že automatsystem je haluzák a se stejnou sestavou můžu jednou prohrát a potom vyhrát. Tak jsem obětoval jednotky ještě 2x se stejným výsledkem. Vždycky prohra zhruba s podobným zbytkem nepřátel. Pak jsem dokončil 4 vylepšení oddílu a šel jsem do toho znova s úplně stejnou sestavou a výsledek výhra s cca 40% přeživších jednotek. NÁHODA?"}, {"150": "Jsem novými turnaji nadšen. Elve hraji, neb mne baví budování města, žádná omezení nevnímám. Turnaj beru pouze jako zdroj potřebného. Rekordů mi v něm netřeba. Za mne - ubylo klikací nudy, ušetřili jsme čas ku plkání, děkuji."}, {"16": "@kasimir Jistě, že nemáš problém skončit na 8 tisících, když jsi je dle elvenstats (https://www.elvenstats.com/player/cz2/512001) ještě nikdy nedal (pokud nemluvíš o jiném městě pod jiným nickem, než pod jakým píšeš).[BR]S nízkým počtem divů a rozšíření máš také nízké náklady (to samozřejmě neovlivňuje obtížnost (= poměr nepřátelské jednotky k jednotce hráče)).[BR]A 40. provincie znamená manuální boj, který trvá déle než ve starém systému automat se 4 násobným počtem střetů (takže jaká úspora času?).[BR]Už někde ve 30. nebo 31. provincii má nepřítel dvojnásobnou přesilu a ve 40. je to ještě horší, takže si nejsem jist, zda se to na manuál vůbec dá uhrát jenom s ohnivákem. Na automat to lze přebýt podpůrnými budovami, ale dle mě jen v dlouhodobě neudržitelném množství (při každotýdenním využití).[BR][BR]@tupecpolni Zdrojem potřebného jsou například relikvie pro nepřetržitou výrobu kouzel (pokud vyrábíš např. kouzlo magická výroba 24/7 v MA lv.5, potřebuješ ve 2 turnajích nahrát přes 7000 bodů, aby ti neklesaly relikvie potřebné na tyto kouzla."}, {"109": "Ok. tak pojďme plkat.[BR]Hráči, co jsou v kapitole orkové a níž, vesměs chválí nový typ turnaje.[BR]Hráči v kapitolách lesních elfů po řekněme konstrukty, tak tam to vnímám 50:50, i když s jistými obavami těch, co říkají ano novým turnajům.[BR]Hráči v posledních dvou kapitolách, tak ti už vesměs nechválí nový typ turnaje.[BR][BR]Turnaj hraji proto, abych získal další potřebné zdroje pro rozvoj města. A čím víc postupuji ve hře tím bych měl mít motivaci a zájem, abych nahrál více provincií, více kol a tím více zdrojů pro rozvoj města. Prostě chci se s výsledky zvedat. To je ovšem minulost.[BR]Když jsem se díval, jak hraje turnaj @tupecpolni , tak ač má dvě města v kapitole 16, tak turnaj prakticky nehraje. Hraje odhadem 9 provincií na 5* tak je jasné, že nový systém je pro něho parádní. Do 10.provincie lze hrát na 6* bez jakékoliv podpory medvědů, fenixů a stromečků a bez značných ztrát na jednotkách, resp. přes levný výkup. @kasimir hraje turnaj o něco víc, ale hraje podobné body jako já když jsem byl kapitole orků. Samozřejmě každý má jiný styl hraní a jinou strategii, ale obecný smysl by měl být ten, že pokud mám rozvinutější město, tak musím být schopen nahrát víc než město na začátku. A to je ta LOGICKÁ chyba, kterou Inno v podobě nového turnaje zatáhlo do hry, protože nyní je turnaj prakticky zastropován. Město v kapitole trpaslíků hraje stejné body jako město v kapitole ambasád.[BR][BR]Pro @kasimir proč jsem uvedl stromečky do mínusu. Je to z toho důvodu, že nyní jsou jednotky natolik rozmanité, že když nasadím stromeček pro střelce, tak ho v nynějším turnaji na ocel efektivně využiji v 70% případů boje. (To jsou boje, kde dám 3 a více střeleckých jednotek). V předchozím verzi, když byl ocelový turnaj, tak využití bylo mezi 90-95%. To je ta degradace, co jsem psal.[BR]Již při prvních zprávách z bety, (na betě nehraji), jsem navrhoval, aby se změnila funkce stromečků. Jeden stromeček na život na všechny, ten je, jeden stromeček na útok pro všechny, náhrada za osvícenou střelnici a jeden stromeček na obranu pro všechny, to je náhrada za magického násobitele. Uvedenou myšlenku jsem dal do oficiálních návrhů.[BR][BR]A navíc, pokud platí vzorec pro výpočet jednotek a výkupu dle minmaxe, tak je tam faktor, že všechny 4 parametry, které ovlivňují množství se mezi sebou násobí. To znamená, že náklady jdou exponenciálně nahoru, ale rozvoj města je lineární !!!"}, {"3": "dobré shrnutí"}, {"156": "Naprosto souhlasím s LovcemKrys. Je to děsné. Jen přidám, že odměny z bonusových odměn jsou sice fajn, jako že lepší něco než nic, ale dát v každé truhle 10VB do divů i 1 rekontstrukci mi přijde drobet odfláklé. Zvlášť když je další a další bedna za víc a víc bodů... Nějak to nemá žádnou motivaci."}, {"104": "Lovče, ano, hlavní hru hraji pod jiným nickem a tento je jen na doplnění. Takže těch 8k dám, byť ne vždy. Ono to není taky nutné - pokud společenství jede a cílem je plánek a ne několik dalších VB či rozbitých úlomků run, které se stejně nevejdou do skladu.[BR]K rychlosti - hraju vždy na automat, ale za použití bonusových budov a s nakrmeným ohnivákem. To tak nějak pokládám za samozřejmost. Pokud by došly trpasličí zbrojíři, tak by to bylo složitější, ale zjevně to zatím nehrozí, téměř každou věž jeden padne a k tomu vylepšení jednotek - dva za týden, takže budovy ve skladu neubývají, spíš naopak.[BR]A stromečkové budovy - vždyť je tam vylepšení jednotek, to platí na všechny. Stačí brát jen tuhle jednu, začne padat častěji. Vyzkoušeno."}, {"16": "@kasimir Závidím ty zbrojíře. Mi se nezřídka stává, že mi padne i 1 za měsíc (zato kupa pro mne zcela zbytečných PP). Ono i kdyby padal 1 týdně, tak to nepomůže, ne na to, abych se vrátil ke svým obvyklým výsledkům. Navíc jsme začali lehčími turnaji - bude přituhovat."}]