[{"104": "@Lovec Krys Už se těším na svitkový [smilie--sprite1]. Ten byl pro většinu hrůza, naučil jsem se na něj pár triků a dělal jsem na něm body do žebříčku. Tak uvidím, jaký to bude tady a teď. [BR]@prchlik řekl bych, že právě vyrovnání šancí hráčů v různých úrovních a s různým rozvojem města bylo jedním z hlavních důvodů takovéto změny - tak aby i ten, kdo je v trpaslících když správně navolí jednotky, mohl dosáhnout na dobré umístění a získal odměny co mu pomůžou dál, nejen ten, kdo hraje 4 roky a za poslední 2 se posunul o jednu kapitolu."}, {"109": "Pokud by jeden z hlavních důvodů měl být jak píšeš,[BR]kasimir napsal/a:\t\t\t... právě vyrovnání šancí hráčů v různých úrovních a s různým rozvojem města bylo jedním z hlavních důvodů takovéto změny - tak aby i ten, kdo je v trpaslících když správně navolí jednotky, mohl dosáhnout na dobré umístění a získal odměny co mu pomůžou dál, nejen ten, kdo hraje 4 roky a za poslední 2 se posunul o jednu kapitolu.\t\tKlikněte zde pro zvětšení..., tak pak je to podle mého názoru chyba. Chápu myšlenku zatáhnout do turnaje více členů a nějak je motivovat, nyní v podobě snadnějšího výsledku na prvních 10.provinciích, za méně snahy větší odměna. Ale udělat z celého pelotonu hráčů jednu průměrnou šedou myšku, ty moc vykukuješ, tak tě bacím a ty jsi pomalý, tak do tebe žďuchnu mi nepřijde jako cesta vpřed. A to je to, co Inno nyní udělalo. Přeci město v trpaslicích nemá odemčeno tolik provincií jako město v ambasádách  a tak zákonitě nemůže nahrát takové body. Ale nyní to sekli tak, že všichni můžou hrát 20 provincií a kdo jde nad, tak s vědomím, že si jde pro likvidaci jednotek nebo decimaci skladu. Nad 30.provincii nyní už hraje jenom někdo, kdo trpí sadomachismem. Ale hra má být o zábavě a to je to, co šlo v případě nových turnajů do pozadí.[BR]Můj názor je ten, že primární snahou změny bylo ořezat hráče od příjmů VB a eliminovat push účty na VB, to všechno ostatní je jen balast podle toho, jak se komu hodí."}, {"110": "Ahoj. [BR]K výše uvedenému se musím přidat. Když jsem před pár měsíci začínal, tak mi bylo jasné, že v turnaji nedosáhnu takových výsledků, jako hráči na daleko vyšší úrovni. To je ale přece zcela logické!!! Naopak mě to motivovalo k postupu za který budu nyní (i když asi za delší čas) trestán. To je přece kontraproduktivní. Jak tak pročítám názory těch zkušenějších, tak jen doufám, že se vývojáři chytí za hlavu a něco s tím udělají.[BR]Dokud dejchám, pořád doufám ;-).[BR]Ryny"}, {"3": "Ryny napsal/a:\t\t\ttak mi bylo jasné, že v turnaji nedosáhnu takových výsledků, jako hráči na daleko vyšší úrovni. To je ale přece zcela logické!!! Naopak mě to motivovalo k postupu...\t\tKlikněte zde pro zvětšení...ANO, PŘESNĚ TAK!!! A každý úspěch, kdy porazíš pokročilejší hráče, byl o to sladší..."}, {"10": "za mě turnaj super, se dvěma stromečky, zbrojířem a fenixem klídek. Dnes jsem jel 17 provincií na čtvrtou hvězdu i bez fenixe a vše ručně. Musím říct, že víc než pohoda. Momentálně 3342 a ještě nekončím. Prkenný hodlám vyzkoušet bez jakýchkoliv podpor, pak uvidím co to bude za rozdíl.[BR]Díky sdružení se dá hrát ručně a ušetřím mraky času. Já sem tak y spokojený."}, {"2": "Mě tahle změna naopak přišla jako podpora push účtů[BR]Body z turnaje uhraješ i s malým městem ve třetí kapitole[BR]jenom těch základních 130 bodů je víc jak 10 provincií[BR]dřív bylo možné prostě otevřít dalších deset provincií[BR]ted to to město zrujnuje"}, {"104": "@Ryny to stejně nedosáhneš, protože naučit se používat správně jednotky je záležitost na delší dobu. [BR]@prchlik řekl bych, že nejde o to zatáhnout do turnaje více hráčů, ale umožnit jim získat i v nižších kapitolách odměny, na které by jinak nedosáhli. A zas to je o tom, jak rychle se naučí používat jednotky, kdy se dostanou k lepším jednotkám ze cvičiště či tábora apod. Z tohoto pohledu mají ti hráči, kteří jsou dál, stále výhodu - mají 3* orky stratégy a květinové princezny a mohou optimálně nasazovat vojsko - já třeba ještě nemám 3* lovce a musím tak všude strkat střelce i když by lovec byl lepší. Jednoduše - kdo umí pracovat správně s vojskem v turnaji (věži i v provinciích), má nyní lepší šanci na dobrý výsledek bez ohledu na kapitolu."}, {"10": "Je to věc názoru, ale já mám lovce i květinovku na 2* a hodně likvidovali. Ruční boj je teď zábavnější, protože se snížilo klikání."}, {"109": "Tak to má stejný efekt. Tím že jim nabídnou odměnu za méně snahy, tak je přirozeně do turnaje zatáhnou. Otázka je, co máš na mysli pod lepším výsledkem. Je to umístění v žebříčku, více odměn nebo víc bodů pro společenství, aby se dostali k plánku?"}, {"104": "@prchlik všechno to."}, {"2": "Myslím že je neoddiskutovatelné, že město do páté kapitoly se v turnaji docela nechytalo.[BR]Jsem tu už dlouho a bojů jsem se něco naklikal, ale i když už jsem otevřel v jedné surovině šest provincii tak na šest kol i v kombinaci s výkupem to uhrát byli čiré zoufalství.[BR]A pro takové město jsou už samotné relikvie na podporu produkce velmi zásadní a teď to není problem"}, {"110": "kasimir napsal/a:@Ryny to stejně nedosáhneš, protože naučit se používat správně jednotky je záležitost na delší dobu.[BR][BR]Tak já se samozřejmě nechtěl ani nechci srovnávat s hráči, co to hrají léta a mají hru přečtenou. Na jejich úroveň nedosáhnu, nehledě na to, že hraju na mobilu a v mobilní aplikaci je hra oproti hře na PC omezena (alespoň dle mého názoru).[BR]Zkrátka jsem jen chtěl uvést, že je zcela normální vývojem postupovat vpřed a ne být za postup trestán. Nic víc, nic míň.[BR]Ryny\t\tKlikněte zde pro zvětšení...[BR]PS: já ani pořádně neovládám citace a psaní zpráv na fóru (viz výše) .[BR][BR]// Příspěvky sloučeny. Jumala"}, {"157": "Tak děkuji INNO turnaj totálně zabitý.Nároky neskutečně vzrostly odměny zase klesly.Otevíral jsem i 4 strany dnes druhá a jednotky v čudu.Další sešup směrem dolů.Je vidět,že ti inženýři z Afriky nebudou dobrou volbou co,ale za ty prachy vám to jiný stejně dělat nebude neb nikdo levnější nebyl!Takhle to daleko nedotáhnete....Nejlepším ukazatelem je počet aktivních hráčů a množství opuštěných měst,kterých je plná mapa.Jen bych rád viděl vola,který vám do tohohle dá prachy...[smilie--sprite1] čus"}, {"68": "Nechápu, jak někdo může psát, že předtím si hráči v nižších kapitolách ani neškrtli. Tak to asi neuměli hrat turnaje. Já už od dob orku, možná trpaslíků jsem byla schopna dříve uhrát turnaj přes 1600 bodů a pamatuji si, že to stačilo i do TOP 100. A to může být tak 2-3 roky zpátky. Než začali hráči více uhrávat. Ovšem pak záleželo na vyzkoumanych provincii, ten kdo mel více, tak i nejvíce uhrál, když chtěl...To že je to teď zvýhodněné i pro slabší hráče nový turnaj, tak si teď můžou skákat radostí. To mi jako chcete říct, že předtím byl turnaj horší, těžko uhratelný? Nebo to spíš byla lenost uhrát více jen kvůli tomu, že se muselo více klikat?"}, {"149": "ElfNostradamus napsal/a:\t\t\tTrumpetko /hezky zvolený nick/. Turnaj je nyní více výhodný pro malá města než pro hráče , kteří si město 4 až 5 let pracně šperkují a vylepšují a nyní jsou na tom biti, díky kritériím, která zvolili ... jsou dost vysoko a nespravedlivě nastavená pro pokročilá města...\t\tKlikněte zde pro zvětšení...No, já nevím, co je potom malé město. Mám město v konstruktech na W narvané divama a tam hraju na 20 provincií úplně stejně jako před změnou, víc provincií jsem nikdy nehrála a nemám potřebu. Akorát mi akademie málo dává krmení, jinak pohoda. [BR]Jenže pak mám město na A v půlčících, tam je docela levný výkup, ale dlouhodobě to vykupovat nebude možné. Se zlatým Fénixem a bez stromečků, ty v tomhle turnaji nemám, protože akademie je lakomá, uhraju s bídou 14 provincií, armáda je mrtvá a obnova vojáků trvá věčnost. Takže tomu fakt nerozumím."}, {"104": "@Jana.souck v půlčících se zaměř víc na věž. Dá se i přes suroviny (pokud dokážeš dobře logicky kombinovat) dostat na konec L2 a máš velkou šanci, že ti padnou truhličky a dostaneš zbrojíře. A s jeho pomocí a s fénixem pak můžeš zvládnout nejen celou věž na vojsko, ale i turnaj. A ve věži také často padají urychlovače, takže můžeš zrychlit výcvik vojska a obnovit si ho. Bez věže se hraje mnohem hůř a to na všech úrovních."}, {"109": "GorGlin napsal/a:\t\t\tMyslím že je neoddiskutovatelné, že město do páté kapitoly se v turnaji docela nechytalo.[BR]Jsem tu už dlouho a bojů jsem se něco naklikal, ale i když už jsem otevřel v jedné surovině šest provincii tak na šest kol i v kombinaci s výkupem to uhrát byli čiré zoufalství.[BR]A pro takové město jsou už samotné relikvie na podporu produkce velmi zásadní a teď to není problem\t\tKlikněte zde pro zvětšení...S tím nesouhlasím, už od třetí kapitoly jsem hrál přes 1300 bodů a nebylo to zničující. Tím jak jsem otevíral další a další provincie tak šly body nahoru. Takřka vše jsem šel přes boj. Nepotřeboval jsem urychlovače na výrobu armády, stačila se doplňovat. Nyní v 11. kapitole nový turnaj a po dvou kolech je armáda tak zdecimována, že už nejsem schopen bez urychlovačů doplnit stavy na další kolo.[BR]Jak jsem psal, nový turnaj je pro menší města do 10. provincie výhodnější než starý, ale to neznamená, že ve starém se nedal hrát."}, {"38": "@GorGlin musím souhlasit s @prchlik  a také nesouhlasím.  [BR]Kdysi jsme měli u nás ve spolku třeba hráče, který už ve 3.kapitole hrával pravidelně cca 4.500 bodů... bavilo ho to, nikoliv výstavba města. Ono ale rozumím, že né každý si město upraví jen na turnaje. Ale pokud by někdo chtěl, vždy je cesta se přizpůsobit tomu, co je potřeba.  Tady třeba turnajům, kde náklady byly jen v mincích a kladívkách. Kouzla na dílny měl z turnajů, VB na vylepšování divů taky.  Vždy je cesta.[BR][BR]\t\t\thttps://www.elvenstats.com/player/cz1/90702\t\t"}, {"20": "V dřívějším turnaji mohli hráči i v nižších kapitolách uhrát velmi dobré body. Za 10 otevřených provincií na 5 kol je 2100 a to mohlo zvládnout spoustu hráčů. Prvních 10 provincií bylo i dřív celkem snadných. Ještě daleko snazší varianta je 8 provincií na 5 kol = 1680 bodů. Dneska jsou tyhle provincie hratelné levou zadní. Menší hráči měli i dřív možnost hrát slušný turnaj.[BR]Problém je trest na ztížení bojů, pokud člověk pokračuje ve výzkumu, pokládá nová rozšíření a vylepšuje divy. Tedy, když normálně hraje. A to je prostě špatně. Chápu, že pokročilí hráč by měl mít hru o něco náročnější, ale tak jak je to nastavené, je prostě moc, a pokud se něco nezmění, tak bude brzo pro hráče na konci výzkumu věž i turnaj nehratelný.[BR]PROSÍM INNO, ABY DOŠLO K PŘEHODNOCENÍ FORMULE NA VELIKOST ODDÍLU NA BOJE VE VĚŽI I V TURNAJI ."}, {"109": "@BiggJOEcz to jsi jen potvrdil moje slova, že hrát turnaj ve staré podobě nebyl problém i pro hráče v nízkých kapitolách. [smilie--sprite1] Nějak mi uteklo v čem jsi se mnou nesouhlasil. [smilie--sprite2]"}]