[{"38": "prchlik napsal/a:\t\t\tNějak mi uteklo v čem jsi se mnou nesouhlasil. [smilie--sprite2]Klikněte zde pro zvětšení...zkus si to přečíst znovu  [smilie--sprite2]"}, {"109": "asi do mě budeš muset kopnout fakt to nevidím.[smilie--sprite12]"}, {"2": "S tebou souhlasí, semnou nesouhlasí"}, {"10": "Nevím, co dělá jinak, ale já jsem asi jiný. Mám uhráno 5000 bodů, vojáků mi zbylo víc než kdy jindy a baví mě to. Prkenný si dám bez stromečků a zbrojíře, tak jsem na to zvědavý. Ale já vidím jen pozitiva.  [smilie--sprite6]"}, {"109": "@GorGlin děkuji za vysvětlení. Já tomu rozuměl tak, že se mnou souhlasí, ale také nesouhlasí."}, {"3": "Tak jsem právě dodělal 50 provincií a nějaké drobné k tomu. Armáda dávno fuč, šestou hvězdu jsem vykupoval všechno, co nechtělo orky... peklo, tohle mě neba. Hned tak si velký turnaj asi nedám."}, {"158": "Deset truhel dává dnes asi kdekdo...[BR]Ale všech devět bonusových opět zase jen SW1  [smilie--sprite11] [BR]Díky [smilie--sprite2]"}, {"38": "*10.truhel je rozumná meta. [BR]*dalších 9.truhel je meta prestiže.[BR]*dívání se na ostatní ze shora je špatná meta  [smilie--sprite6] [BR][BR]Každopádně gratulace. Ať to vydrží. Všechna čest [smilie--sprite2]"}, {"3": "tak tak, to už je frajeřina. My měli minule 14 nebo 15, tentokrát 15. Myslím, že plus mínus tuhle metu asi standardně udržíme, bez nějakého stresu"}, {"105": "Emhyre a dáváš ten svůj velevýsledek udržitelným způsobem nebo to bylo pouhé vzepjetí a vydrancování nasyslených zásob?"}, {"3": "ani náhodou! udržitelných může být cca 20-30 provincií max (a to včetně výkupu, samozřejmě s fénixem). Teď si dám zase pohov, nic mě tak úplně netlačí hnát to silou. Jenže mě to bavilo - a jak jsem psal, je to pryč [smilie--sprite3] turnaje budou jen nut(d)ným zlem"}, {"2": "To asi i pro mě, turnaj je nutnost kterou musím odklikat, abych udržel rozvoj města.[BR]Ano, současné změny jsou trochu kanada pod bradu, abych si moc nevyskakoval, ale snad zvládnu něco našetřit a i přes všechnu snahu Inna zvládnu nadcházející kapitolu bez pocitu že furt na něco čekám.[BR]Minule jsem jel 20, ted 25, jesti zvádnu pravidelně 30, tak to by bylo super, ale zatím to vidím max na tu 25. provincii[BR]ale nevzdávám to[BR]jen tak mě nedostanou"}, {"158": "BiggJOEcz napsal/a:\t\t\t*10.truhel je rozumná meta.[BR]*dalších 9.truhel je meta prestiže.[BR]*dívání se na ostatní ze shora je špatná meta  [smilie--sprite6][BR][BR]Každopádně gratulace. Ať to vydrží. Všechna čest [smilie--sprite2]Klikněte zde pro zvětšení...To není o dívání se shora, ale spíš jen radost, že to zase vyšlo [smilie--sprite8][BR]A tentokrát i bez hecování týmu [smilie--sprite7]"}, {"78": "petr.wp99 Bravo, super výsledek.[BR][BR]Já jsem projela u třetí hvězdy čtyři souboje za sebou a přišla o všechny jednotky. Ale vzhledem k tomu, že jsem ocelový turnaj vždycky nesnášela, tak jsem vlastně nahrála dobré body. Zajímavý bude svitkový, vždycky sem se mu vyhýbala. Až přijde pokusím se ho zdolat. [smilie--sprite8]"}, {"3": "@petr.wp99 nechceš hodit prtscrn společenství, jak máte rozložené body v turnaji mezi hráči? [smilie--sprite1]"}, {"65": "To si můžeš kdykoli zjistit sám u kteréhokoli společenství na stránce elvenstats.com. Najdeš si tam společenství a v historii turnaje pak klikneš na sloupeček toho turnaje, co tě zajímá. Vyjede ti pořadí členů a jejich body v turnaji (musíš najet na jejich sloupečky myší, abys viděl kolik přesně kdo nahrál). Údaje z tohoto turnaje tam zatím ještě nejsou, ale u minulého už se na to můžeš podívat."}, {"11": "\t\t\thttps://www.elvenstats.com/fellowship/cz1/19431\t\t"}, {"112": "184k bodů - moc pěkný Star Wars 1[BR]na druhou stranu 13 hráčů s více body, 12 pode mnou - celkově z toho rekordu na mne padl splín, že to hru vlastně skoro nikdo nehraje a na Fórum se jen soustředila skupina, která by si ráda vydupala ulehčení a návrat ke klikačce ideálně v novém poměru 1 místo 4. A jak poznamenal GorGlin (sorry, pokud čtu mezi řádky a nemyslel jsi to tak) - z pushing systému přesunu surek z velkých pomocných účtů (kdy je výkup nyní limitován zdroji, které nelze přesouvat) se fejkaři začínají zaměřovat na využití malých účtů (i kolem pozice 1700 mají hráči přes 2000b - nějak se mi nechce věřit, že by změna inspirovala tolik dříve turnaj nehrajících hráčů - nu snad, buďme alespoň chvíli idealisté). Jak na jednom vláknu kdysi jeden hráč poznamenal - v turnaji nejde o hraní, ale o zisk VB :/"}, {"20": "@Trumpetka :  my, komu se nelíbí systém vypočítávání velikosti oddílu ve věži a novém turnaji, a jsme na konci výzkumu, opravdu nechceme kompletní návrat ke starému systému. Jde tu o to, aby vypočítávání velkosti oddílu v boji nemělo exponenciální růst. Díky pandemii asi už každý ví, co je to exponenciální růst. Mluví tu různí hráči, ale upřímně, nyní jsou podmínky hry pokřivené, protože ti, kdo jsou na konci výzkumu, jsou nevíce biti. Takže až přijde nová kapitola a udělám první vstupní výzkum, (už jsem to zažila u velikosti oddílu ve věži v minulé kapitole), skokově mi velikost oddílu naroste. A to bude s každým dalším výzkumem a položením rozšířením.  Takže hráčům, jako jsem já, jde o to, aby byl upraven vzorec růstu oddílu a byl zastaven exponenciální růst, abychom mohli normálně hrát, aniž by nám to zničilo možnost hrát turnaj a věž. Nic víc a nic míň.[BR]A na případné námitky, jak můžu vědět co bude, předem odpovídám, že stačí se podívat na vývoj vzorce růstu oddílu a ke grafu jen přiložit pravítko. Každopádně praxe dokládá teorii.[BR]Všichni, kdo chtějí pokračovat ve hře, by toto měli podpořit, protože evidentně vývojáři tuto věc silně podceňují a nechtějí si tento problém přiznat. Pokud se něco nestane, tak další velké množství hráčů skončí hru."}, {"158": "nataly111 napsal/a:petr.wp99 Bravo, super výsledek.[BR][BR]Já jsem projela u třetí hvězdy čtyři souboje za sebou a přišla o všechny jednotky. Ale vzhledem k tomu, že jsem ocelový turnaj vždycky nesnášela, tak jsem vlastně nahrála dobré body. Zajímavý bude svitkový, vždycky sem se mu vyhýbala. Až přijde pokusím se ho zdolat. [smilie--sprite8]Klikněte zde pro zvětšení...Díky, bez hafo stromků by to taky pěkně bolelo [smilie--sprite1][BR]A na samotného fénixe už se to bohužel hrát nedá [smilie--sprite3] [BR]Svitkový říkáš ? A já myslel, že se zase potkáme u toho našeho  hedvábného [smilie--sprite8]"}]